{
    "Symbol": "FILATEX",
    "ISIN": "INE816B01035",
    "News": [
        {
            "Title": "Filatex India Q3 FY26 Earnings Call on Feb 9",
            "Summary": "Filatex India Limited has scheduled an earnings conference call on February 9, 2026 at 3:30 PM IST to discuss Q3 and 9M FY26 results with senior management including MD & Chairman.",
            "Sentiment": "neutral",
            "PublishDate": 1770222601501,
            "Source": "co_actions_results"
        },
        {
            "Title": "Filatex India Provides Rs 200 Crore Guarantee",
            "Summary": "Filatex India Limited provides corporate guarantee of Rs 200 crores for wholly owned subsidiary Texfil Private Limited's term loan from Punjab National Bank for polyester textile recycling project.",
            "Sentiment": "neutral",
            "PublishDate": 1769703432154,
            "Source": "stocks"
        },
        {
            "Title": "Filatex India Invests ₹15 Cr in Subsidiary Texfil",
            "Summary": "Filatex India acquires 1.5 crore equity shares in subsidiary Texfil for ₹15 crores to fund recycling project, loan repayment, and working capital requirements.",
            "Sentiment": "positive",
            "PublishDate": 1768575168715,
            "Source": "stocks"
        },
        {
            "Title": "Filatex India Relocates Corporate Office to Delhi",
            "Summary": "Filatex India Limited announces relocation of its corporate office from New Friends Colony to Radisson Hotel premises on M.G. Road, New Delhi, effective January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766733029164,
            "Source": "stocks"
        },
        {
            "Title": "Filatex Subsidiary Signs MoU with Decathlon for Recycled Polyester",
            "Summary": "Texfil Private Limited, wholly owned subsidiary of Filatex India, signed MoU with Indeca Sporting Goods for high-quality recycled polyester use in sports apparel under Ecosis trademark.",
            "Sentiment": "positive",
            "PublishDate": 1765457727461,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gujarat Court Quashes Show Cause Notices Against Filatex India",
            "Summary": "Gujarat Court has quashed show cause notices issued against Filatex India. This legal development removes regulatory concerns that were pending against the company.",
            "Sentiment": "positive",
            "PublishDate": 1764854080666,
            "Source": "stock"
        },
        {
            "Title": "Filatex India Allots 2.02 Lakh Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Filatex India Limited allotted 2,02,875 equity shares of Rs. 1 each at an exercise price of Rs. 48.05 per share to employees under its Employee Stock Option Scheme 2015. The allotment increased the company's paid-up share capital to Rs. 44,40,58,375 consisting of 44,40,58,375 equity shares from the previous Rs. 44,38,55,500.",
            "Sentiment": "positive",
            "PublishDate": 1764836333895,
            "Source": "corporate_action"
        },
        {
            "Title": "DGTR Launches Anti-Dumping Investigation Into Chinese Polyester Textured Yarn Imports",
            "Summary": "The Directorate General of Trade Remedies has initiated an anti-dumping probe into polyester textured yarn imports from China. This investigation could impact Reliance Industries and the broader domestic textile industry by potentially leading to protective duties on Chinese imports.",
            "Sentiment": "neutral",
            "PublishDate": 1763695066115,
            "Source": "stock"
        },
        {
            "Title": "Filatex India Invests Rs 20 Crore in Wholly Owned Subsidiary Texfil Private Limited",
            "Summary": "Filatex India Limited acquired 2 crore additional equity shares of its wholly owned subsidiary Texfil Private Limited for Rs 20 crore at Rs 10 per share. The investment will finance the ongoing Polyester Textiles Recycling Project, repay existing loans from Filatex, and support working capital requirements.",
            "Sentiment": "positive",
            "PublishDate": 1763129981035,
            "Source": "stock"
        },
        {
            "Title": "Filatex India Reports Strong Q2 FY26 Performance with Revenue Growth and Margin Expansion",
            "Summary": "Filatex India Limited reported quarterly revenue growth to INR 1,076 crores from INR 1,049 crores, with sales volume increasing to 101,391 metric tonnes from 97,263 metric tonnes. EBITDA rose 14.36% to INR 88.93 crores compared to INR 77.76 crores in the previous quarter, while PAT increased 16.8% to INR 47.58 crores from INR 40.74 crores. For the first half, revenue stood at INR 2,125 crores versus INR 2,103 crores in the same period last year. EBITDA for the half-year improved significantly to INR 166.7 crores from INR 106.6 crores, while PAT nearly doubled to INR 88.32 crores from INR 45.77 crores. The company is progressing with its INR 650 crores investment plan covering capacity expansion, sustainability and energy efficiency projects. Management expects EBITDA margins to reach 8.5% to 9% in the second half from the current 7.84% in the first half. The company anticipates margin improvement of around 2% when upcoming PTA capacity additions by GAIL and IOCL become operational.",
            "Sentiment": "positive",
            "PublishDate": 1762778417113,
            "Source": "earnings"
        },
        {
            "Title": "Filatex India Reports Strong Q2 Performance with Net Profit Surging to 476 Million Rupees",
            "Summary": "Filatex India delivered robust quarterly results with net profit jumping to 476 million rupees compared to 135 million rupees in the same period last year. Revenue grew to 10.75 billion rupees from 10.5 billion rupees year-over-year. EBITDA nearly doubled to 826 million rupees from 415 million rupees, while EBITDA margin expanded significantly to 7.67% from 3.95% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762388715876,
            "Source": "earnings"
        },
        {
            "Title": "Filatex India Reports 93% Jump in Half-Year Profit, Q2 Revenue Up 2.5%",
            "Summary": "Filatex India Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. The company reported revenue from operations of Rs 1,075.93 crores for Q2, representing a 2.53% increase compared to the previous quarter and 2.56% growth year-over-year. Profit after tax for the quarter stood at Rs 47.58 crores, marking a 16.79% quarter-on-quarter increase and 253.23% year-over-year growth. For the half-year period, revenue reached Rs 2,125.33 crores with a 1.04% year-over-year increase, while profit after tax surged 93.01% to Rs 88.32 crores compared to Rs 45.76 crores in the previous year. Sales volume for Q2 was 1,01,391 MT, up 4.24% from the previous quarter. The company operates in synthetic multifilament yarn manufacturing with production of 1,94,970 MT and sales of 1,98,654 MT for the half-year period. Management highlighted improved operational performance supported by higher sales volumes and enhanced operational efficiencies.",
            "Sentiment": "positive",
            "PublishDate": 1762257193522,
            "Source": "earnings"
        },
        {
            "Title": "Filatex India Signs MoU with Revti Business and Wastewear for Textile Waste Recycling Collaboration",
            "Summary": "Filatex India Limited signed a Memorandum of Understanding with Revti Business Pvt. Ltd. and Wastewear Inc. on October 21, 2025, to establish a collaboration focused on textile waste recycling, product innovation, and global co-branding. Under the partnership, Filatex India will process textile feedstock into recycled PET chips and filament yarn, Revti Business will supply sorted textile waste and act as a preferred customer for recycled outputs, and Wastewear Inc. will facilitate imports of textile waste into India and lead international marketing efforts under the 'ecosis' yarn brand. The collaboration includes structured procurement of high-polyester-content textile waste, collaborative R&D in recycled staple fibre development, co-branded product initiatives, mutual exclusivity agreements, and strategic coordination on sustainability initiatives. The partnership aims to advance sustainable textile manufacturing and circular economy initiatives while scaling textile recycling infrastructure in India.",
            "Sentiment": "positive",
            "PublishDate": 1761052509063,
            "Source": "order&deals"
        },
        {
            "Title": "Filatex India Reports Minor Fire at Dadra Plant with Estimated Rs 4-5 Crore Loss",
            "Summary": "Filatex India Limited experienced a minor fire incident at its Dadra plant. The company estimates potential losses of Rs 4-5 crores, though the exact quantum of loss cannot be determined at this stage. The incident is fully covered by insurance, and the company has a Loss of Profit Insurance Policy for business interruption coverage. The disclosure was made to stock exchanges NSE and BSE by Company Secretary Raman Kumar Jha.",
            "Sentiment": "neutral",
            "PublishDate": 1760695442069,
            "Source": "stock"
        },
        {
            "Title": "Filatex India Reports Minor Fire at Dadra Plant, No Material Impact on Operations",
            "Summary": "Filatex India Limited experienced a minor fire incident at its Dadra Plant around 6:15 P.M., affecting 3-4 production lines. The fire was brought under control within a couple of hours. No workmen or other persons were injured, and no casualties occurred. The remaining production lines continued operations without loss. The company stated that the loss from the fire does not materially affect the company. Filatex has informed the concerned departments and statutory authorities about the incident.",
            "Sentiment": "neutral",
            "PublishDate": 1760636464247,
            "Source": "stock"
        },
        {
            "Title": "Filatex India's Joint Statutory Auditor M/s R N Marwah & Co LLP Completes 5-Year Tenure",
            "Summary": "Filatex India Limited announced that M/s R N Marwah & Co LLP has completed their 5-year tenure as Joint Statutory Auditors, ceasing their role effective September 26, 2025, following the conclusion of the company's 35th Annual General Meeting. The auditing firm R N Marwah & Co LLP is a chartered accountancy firm with ICAI registration number 001211N/N500019. The company's Board of Directors and Management expressed appreciation for the auditor's contributions during their association with the company.",
            "Sentiment": "neutral",
            "PublishDate": 1758901922730,
            "Source": "corporate_governance"
        },
        {
            "Title": "Filatex India Reports Q1 FY26 Results with 27.75% EBITDA Growth and Announces INR700 Crore Expansion Plan",
            "Summary": "Filatex India Limited reported quarterly results with revenue of INR1,049 crores compared to INR1,054 crores in Q1 FY25. Sales quantity increased to 97,263 metric tons from 95,962 metric tons year-over-year. EBITDA grew significantly by 27.75% to INR77.8 crores from INR60.9 crores, while PAT rose 26% to INR40.7 crores from INR32.3 crores in Q1 FY25. The company announced multiple expansion projects totaling approximately INR700 crores, including additional yarn capacity (INR235 crores), recycling project (INR300 crores), steam infrastructure (INR85 crores), and renewable energy (INR27.6 crores). These projects are expected to be completed by September 2026 and generate combined EBITDA of INR230 crores annually. Management expects margins to improve gradually, targeting double-digit EBITDA margins by Q4 and blended margins of 8.5-9% for the full year. The company cited challenges from Chinese imports but noted government measures through minimum import pricing have reduced imports by approximately 60%.",
            "Sentiment": "positive",
            "PublishDate": 1753949227542,
            "Source": "earnings"
        },
        {
            "Title": "Filatex India Publishes Q1 FY26 Financial Results in Newspapers",
            "Summary": "Filatex India Limited has published its standalone and consolidated unaudited financial results for the quarter ended June 30, 2025, in multiple newspapers. The results were approved by the Board in its meeting held on July 23, 2025. The company published the financial results in three newspapers: Mumbai Edition of 'The Financial Express', Surat Edition of 'Gujarat Mitra' in Gujarati language, and All Edition of 'Business Standard', all on July 25, 2025. The publication was made in compliance with regulatory requirements for listed companies.",
            "Sentiment": "neutral",
            "PublishDate": 1753443612761,
            "Source": "earnings"
        },
        {
            "Title": "Filatex Targets Margin Improvement and Polyester Expansion with Green Recycling Focus",
            "Summary": "Filatex is focusing on margin gains and polyester expansion while scaling up green recycling operations. The company is operating in an environment of stable demand and is benefiting from government support, ESG trends, and man-made fiber (MMF) tailwinds.",
            "Sentiment": "positive",
            "PublishDate": 1753283410162,
            "Source": "stock"
        },
        {
            "Title": "Filatex India Reports 27.68% EBITDA Growth in Q1FY26 Despite Revenue Decline",
            "Summary": "Filatex India Limited reported mixed quarterly results with revenue from operations declining 0.47% year-on-year to Rs 1,049.40 crores in Q1FY26. However, the company achieved strong profitability growth with EBITDA rising 27.68% to Rs 77.76 crores and profit after tax increasing 26.17% to Rs 40.74 crores compared to the same quarter last year. EBITDA margins improved to 7.41% from 5.78% in Q1FY25. The Chairman noted that demand and margin signs are improving gradually, with stable demand conditions. The company expects margins to continue improving as import volumes reduce. Filatex operates with an annual manufacturing capacity of 4,17,240 MT and focuses on polyester filament yarn production across diverse end-user segments including apparel, home textiles, and industrial applications. The company is also investing in sustainability initiatives including renewable energy sourcing and setting up recycling facilities for polyester waste with a capacity of 27,000 MTPA.",
            "Sentiment": "positive",
            "PublishDate": 1753283044438,
            "Source": "stock"
        },
        {
            "Title": "Filatex India Reports Q1 2025 Results, Reappoints Key Leadership for Five-Year Terms",
            "Summary": "Filatex India Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of INR 1,049 crores compared to INR 1,080 crores in the previous quarter and INR 1,054 crores in the same quarter last year. Net profit stood at INR 40.7 crores versus INR 41.4 crores in the previous quarter and INR 32.3 crores in the corresponding quarter of the previous year. EBITDA increased to INR 77.8 crores from INR 75.7 crores quarter-on-quarter and INR 60.9 crores year-on-year. The board approved the reappointment of Madhu Sudhan Bhageria as Chairman and Managing Director, Purrshottam Bhaggeria as Vice Chairman & Managing Director, and Madhav Bhageria as Managing Director, all for five-year terms starting July 30, 2025. Two independent directors, Rajender Mohan Malta and Manish Vij, were also reappointed for five-year terms. The company appointed M/s Siddiqui & Associates as Secretarial Auditor for five consecutive years from Financial Year 2025-26. The board also approved alterations to the Memorandum of Association by adding two new object clauses relating to Steam Power Distribution. All reappointments and alterations are subject to shareholder approval at the upcoming Annual General Meeting.",
            "Sentiment": "positive",
            "PublishDate": 1753278811011,
            "Source": "earnings"
        },
        {
            "Title": "Filatex India Schedules Q1 FY2025-26 Earnings Conference Call for July 24, 2025",
            "Summary": "Filatex India Ltd has scheduled an earnings conference call for analysts and investors on July 24, 2025, at 12:30 PM IST to discuss Q1 FY2025-26 results. The call will be represented by key executives including Chairman and Managing Director Madhu Sudhan Bhageria, Chief Visionary Officer Ashok Chauhan, Chief Financial Officer Nitin Agarwal, and Vice President of Corporate Strategy Vedansh Bhageria. The conference call is being organized by Share India Securities Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1753158297314,
            "Source": "earnings"
        },
        {
            "Title": "Filatex India Reports Q4 Results and Approves Expansion Projects",
            "Summary": "Filatex India announced its Q4 financial results with a net profit of 414 million rupees, up from 348 million rupees year-over-year. The company's revenue increased to 10.8 billion rupees from 10.2 billion rupees in the same period last year. Additionally, Filatex India approved a revised expansion project for its Dahej plant, estimated to cost 2.35 billion rupees, and a steam power distribution project costing 850 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1745453488000,
            "Source": "default"
        },
        {
            "Title": "Filatex India Approves Expansion Projects",
            "Summary": "Filatex India has approved two significant projects: a revised expansion project for its Dahej plant, estimated to cost 2.35 billion rupees, and a steam power distribution project with an estimated cost of 850 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1745420729000,
            "Source": "default"
        },
        {
            "Title": "Filatex India Reports Q4 Financial Results",
            "Summary": "Filatex India has announced its Q4 financial results. The company's EBITDA increased to 713 million rupees from 646 million rupees year-over-year. The EBITDA margin improved to 6.60% from 6.30% in the same period. Net profit rose to 414 million rupees from 348 million rupees year-over-year, but decreased from 474 million rupees quarter-over-quarter. Revenue for Q4 stood at 10.8 billion rupees, up from 10.2 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1745415870000,
            "Source": "result"
        },
        {
            "Title": "Filatex India Announces Expansion of Yarn Production Capacity",
            "Summary": "Filatex India has announced a significant expansion of its yarn production capacity at its existing unit in Dahej. The company plans to increase its Partially Oriented Yarn (POY) capacity by 19,800 MTPA, Fully Drawn Yarn (FDY) by 14,400 MTPA, and Draw Textured Yarn (DTY) by 14,400 MTPA. This expansion project comes with a capital expenditure of 1.5 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738142491000,
            "Source": "corporate_action"
        },
        {
            "Title": "Filatex India Reports Improved Q3 EBITDA and Margin",
            "Summary": "Filatex India has announced its Q3 financial results, showing an increase in both EBITDA and EBITDA margin compared to the same period last year. The company's EBITDA rose to 784 million rupees from 747 million rupees year-over-year. Additionally, the EBITDA margin improved to 7.3% from 6.9% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738142369000,
            "Source": "earnings"
        },
        {
            "Title": "Filatex India Reports Q3 Revenue Decline",
            "Summary": "Filatex India has reported a 0.93% decrease in revenue for the third quarter compared to the previous period. This slight decline in revenue indicates a minor setback in the company's financial performance for the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1738142231000,
            "Source": "earnings"
        },
        {
            "Title": "Filatex India Reports 35% Increase in Q3 Net Profit",
            "Summary": "Filatex India has announced its financial results for the third quarter. The company's net profit rose to 474 million rupees, up from 351 million rupees in the same period last year, representing a year-over-year increase of approximately 35%.",
            "Sentiment": "positive",
            "PublishDate": 1738142191000,
            "Source": "earnings"
        },
        {
            "Title": "Filatex India to Consider Q3 Results on January 29",
            "Summary": "Filatex India Limited has announced that it will consider and approve its financial results for the third quarter on January 29. This indicates the company is preparing to disclose its performance for the most recent fiscal period to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1737558520000,
            "Source": "earnings"
        },
        {
            "Title": "FILA: Italian Stationery Maker Reduces Stake in Indian Subsidiary DOMS",
            "Summary": "FILA is selling up to 4.57% of shares in its Indian unit DOMS through an accelerated bookbuilding process, aiming to increase free float and liquidity. The stake reduction will leave FILA with no less than 26.01% ownership in DOMS. The placement includes a 90-day lock-up period for the buyer.",
            "Sentiment": "neutral",
            "PublishDate": 1734524484000,
            "Source": "corporate_action"
        },
        {
            "Title": "Filatex India Reports Q2 Financial Results",
            "Summary": "Filatex India announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 was 415 million rupees, down from 539 million rupees in the same quarter last year. The EBITDA margin decreased to 3.95% from 4.86% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731398887000,
            "Source": "result"
        },
        {
            "Title": "Filatex India Reports Q2 Revenue Decline",
            "Summary": "Filatex India, a textile company, has reported its second quarter revenue for the current fiscal year. The company's revenue stood at 10.5 billion rupees, down from 11.1 billion rupees in the same quarter of the previous year, indicating a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731398841000,
            "Source": "result"
        },
        {
            "Title": "Filatex India Reports Q2 Net Profit Decline",
            "Summary": "Filatex India has reported a net profit of 135 million rupees for the second quarter, down from 231 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731398741000,
            "Source": "result"
        }
    ]
}