{
    "Symbol": "FILATFASH",
    "ISIN": "INE185E01021",
    "News": [
        {
            "Title": "Filatex Fashions Clarifies Stock Price Movement",
            "Summary": "Filatex Fashions responds to exchange query on significant price movement, stating no undisclosed material information exists and attributing movement to market conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1767705366459,
            "Source": "stocks"
        },
        {
            "Title": "MSL Global Limited Reduces Stake in Filatex Fashions Through Open Market Sale",
            "Summary": "MSL Global Limited sold 19.50 crore shares of Filatex Fashions Limited through open market transactions, reducing its shareholding from 6% to 3.66%. The transaction involved shares worth approximately Rs. 30.50 crores based on the company's total equity capital of Rs. 833.40 crores divided into equivalent shares of Rs. 1 each.",
            "Sentiment": "neutral",
            "PublishDate": 1764913291244,
            "Source": "corporate_action"
        },
        {
            "Title": "Filatex Fashions Undergoes Major Board Restructuring with New Appointments and Resignations",
            "Summary": "Filatex Fashions Limited appointed new statutory and secretarial auditors, three new directors including Ms. Sanju as Whole Time Director, and two independent directors for five-year terms effective December 3, 2025. The company also accepted resignations of two directors and reconstituted all board committees, requiring shareholder approval at the upcoming general meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1764757528411,
            "Source": "corporate_governance"
        },
        {
            "Title": "Filatex Fashions Applies for Reclassification of Three Promoter Group Members to Public Shareholders",
            "Summary": "Filatex Fashions Limited has submitted applications to BSE and NSE for reclassifying three promoter group shareholders - Mr. Prashant Kumar Sethia, Mr. Raj Kumar Sethia, and Mr. Mahavir Golechha - from promoter group category to public shareholder category. The three outgoing promoter group members collectively hold 22,77,537 shares representing 0.025% of the company's shareholding.",
            "Sentiment": "neutral",
            "PublishDate": 1763203603065,
            "Source": "corporate_governance"
        },
        {
            "Title": "Filatex Fashions Loses Both Statutory and Secretarial Auditors on Same Day",
            "Summary": "Filatex Fashions Limited announced the simultaneous resignation of its statutory auditor M/s Pundarikashyam and Associates and secretarial auditor M/s Akhilesh Singh Associates, both effective November 13, 2025. The statutory auditor cited internal reallocation of audit resources and strategic priorities, while the secretarial auditor resigned due to pre-occupation in other professional activities, with the company confirming no material concerns were raised by either auditor.",
            "Sentiment": "negative",
            "PublishDate": 1763112325290,
            "Source": "corporate_governance"
        },
        {
            "Title": "Filatex Fashions Reports Q2 Results, Appoints New CFO and Initiates Promoter Reclassification",
            "Summary": "Filatex Fashions Limited announced quarterly results for the period ended September 30, 2025, reporting revenue from operations of Rs 6,845.24 lakhs and net profit of Rs 245.20 lakhs. The company appointed Mr. Prabhat Sethia as Chief Financial Officer effective November 11, 2025. Sethia is a Commerce Graduate with over 34 years of experience in the spinning industry and is married to company Director Mrs. Sangeeta Sethia. The Board approved the reclassification of certain shareholders from Promoter/Promoter Group status to Public Shareholder status, subject to stock exchange and shareholder approvals. The reclassification involves promoters who will not hold more than 10% equity, will not exercise control over company affairs, and will not be represented on the Board of Directors. The company's equity share capital stands at Rs 83,340.73 lakhs with basic earnings per share of Rs 0.0029.",
            "Sentiment": "neutral",
            "PublishDate": 1762882109409,
            "Source": "earnings"
        },
        {
            "Title": "Filatex Fashions Company Secretary Chintala Srinivasa Rao Resigns Due to Personal Reasons",
            "Summary": "Filatex Fashions Limited announced the resignation of Mr. Chintala Srinivasa Rao from his position as Company Secretary and Compliance Officer due to personal reasons. The resignation is effective from the close of business hours on October 23, 2025. In his resignation letter, Mr. Rao stated he is unable to devote time to company affairs due to personal reasons. The company acknowledged his contributions during his tenure and is in the process of appointing a suitable replacement for the position. Mr. Rao confirmed there are no material reasons for his resignation beyond those mentioned in his resignation letter.",
            "Sentiment": "neutral",
            "PublishDate": 1761215085003,
            "Source": "corporate_governance"
        },
        {
            "Title": "Filatex Fashions CFO Yash Sethia Resigns; Company Appoints New Auditors and Approves AGM Notice",
            "Summary": "Filatex Fashions Limited announced key corporate changes during its board meeting on September 8, 2025. Ms. Yash Sethia resigned from her position as Chief Financial Officer effective August 29, 2025, citing personal commitments and pre-occupations. The company appointed M/s. Kandula & Associates as Internal Auditors for FY 2025-26 and M/s. Akhilesh Singh & Associates as Secretarial Auditors for a five-year term from FY 2025-26 to 2029-30, subject to shareholder approval. The board also approved the 31st Director's Report for FY 2024-25 and the notice for the 31st Annual General Meeting. Kandula & Associates is a Hyderabad-based chartered accountancy firm with over 25 years of experience in audit and taxation, while Akhilesh Singh & Associates is a Kanpur-based company secretary firm with more than a decade of experience in secretarial and advisory services.",
            "Sentiment": "neutral",
            "PublishDate": 1757336752285,
            "Source": "corporate_governance"
        },
        {
            "Title": "Filatex Fashions Reports 197.6% Standalone Revenue Growth in Q1 FY2026",
            "Summary": "Filatex Fashions Limited, a Hyderabad-based textile company, reported strong standalone performance with total income from operations rising 197.6% to ₹903.74 lakhs compared to ₹303.64 lakhs in the same quarter last year. Standalone net profit before tax surged 1096.2% to ₹15.91 lakhs from ₹1.33 lakhs, while net profit after tax increased 17.9% to ₹11.84 lakhs. On a consolidated basis, the company showed revenue growth of 73.9% to ₹4626.77 lakhs, but profitability declined with net profit before tax falling 22.1% to ₹168.95 lakhs and net profit after tax decreasing 18.9% to ₹141.23 lakhs. Earnings per share for the standalone entity improved from ₹0.22 to ₹0.26. The Board of Directors approved these unaudited results on August 12, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755150727910,
            "Source": "earnings"
        },
        {
            "Title": "Filatex Fashions Reports 18% Decline in Quarterly Revenue to Rs 4,497.53 Lakhs",
            "Summary": "Filatex Fashions Limited announced its quarterly results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 4,497.53 lakhs, down from Rs 6,583.40 lakhs in the previous quarter and Rs 2,421.34 lakhs in the same quarter last year. Net profit decreased to Rs 141.23 lakhs from Rs 180.90 lakhs in the previous quarter, though it remained lower than Rs 172.62 lakhs reported in the corresponding quarter of the previous year. On a consolidated basis, revenue from operations stood at Rs 4,622.46 lakhs with net profit of Rs 142.72 lakhs. Basic earnings per share was Rs 0.0017 for standalone results and Rs 0.002 for consolidated results. The company's paid-up equity share capital remained at Rs 83,340.73 lakhs with a face value of Re 1 per share.",
            "Sentiment": "negative",
            "PublishDate": 1755013172735,
            "Source": "earnings"
        },
        {
            "Title": "Filatex Fashions: Revenue Grows 7% to Rs 191.65 Crore in FY 2025",
            "Summary": "Filatex Fashions reported a 7% increase in revenue to Rs 191.65 crore for fiscal year 2025, driven by export orders. Its mining subsidiary secured major export orders worth $35 million and $43.875 million for marble supply. The company's net profit for FY 2025 was Rs 9.41 crore.",
            "Sentiment": "positive",
            "PublishDate": 1751294922000,
            "Source": "earnings"
        }
    ]
}