{
    "Symbol": "FINCABLES",
    "ISIN": "INE235A01022",
    "News": [
        {
            "Title": "Finolex Cables Q3 FY26 Revenue Surges 35% to ₹1,599 Cr",
            "Summary": "Finolex Cables reported strong Q3 FY26 results with revenue growing 35% YoY to ₹1,598.62 crores. Net profit increased 10% to ₹135.97 crores despite additional gratuity provision of ₹6.01 crores under new Labour Codes.",
            "Sentiment": "positive",
            "PublishDate": 1770735699790,
            "Source": "co_actions_results"
        },
        {
            "Title": "Finolex Cables Appoints Siddhesh Mandke as Compliance Officer",
            "Summary": "Finolex Cables Limited has appointed Mr. Siddhesh Mandke as Compliance Officer and Key Managerial Personnel with immediate effect on 10th February 2026, following Board approval based on Nomination Committee recommendation.",
            "Sentiment": "positive",
            "PublishDate": 1770724184071,
            "Source": "stocks"
        },
        {
            "Title": "Finolex Cables Q3FY26 Earnings Call on Feb 12",
            "Summary": "Finolex Cables Limited announces earnings conference call scheduled for February 12, 2026 at 5:00 PM IST to discuss Q3FY26 financial results with CFO Mahesh Viswanathan.",
            "Sentiment": "neutral",
            "PublishDate": 1770184382234,
            "Source": "co_actions_results"
        },
        {
            "Title": "Finolex Cables Receives GST Demand Order Worth ₹1.11 Lakh",
            "Summary": "Finolex Cables Limited received a GST demand order from CGST authorities for FY 2018-19, involving alleged non-payment of GST on outward supplies with total demand of ₹1.11 lakh including penalty.",
            "Sentiment": "negative",
            "PublishDate": 1767422477655,
            "Source": "stocks"
        },
        {
            "Title": "Finolex Cables Receives CGST Tax Demand of ₹15.19 Lakhs",
            "Summary": "Finolex Cables Limited received a CGST order dated December 24, 2025, with a tax demand of ₹15.19 lakhs for Input Tax Credit (ITC) availed during FY 2018-19, 2019-20, and FY 2022-23.",
            "Sentiment": "negative",
            "PublishDate": 1767177027510,
            "Source": "stocks"
        },
        {
            "Title": "Finolex Cables Faces ₹22 Cr GST Demand Notice",
            "Summary": "Finolex Cables receives GST demand order of ₹22.01 crores from Chandigarh Commercial Tax Officer for FY 2021-22, related to ITC mismatch and HSN code discrepancies.",
            "Sentiment": "negative",
            "PublishDate": 1766489172778,
            "Source": "stocks"
        },
        {
            "Title": "Finolex Cables Receives GST Order Worth ₹22.58 Lakh",
            "Summary": "Finolex Cables receives GST order from Uttar Pradesh authorities for ₹22.58 lakh related to Input Tax Credit mismatch during FY 2021-22. Company states minimal operational impact and retains appeal option.",
            "Sentiment": "negative",
            "PublishDate": 1766403803948,
            "Source": "stocks"
        },
        {
            "Title": "Finolex Cables Issues ₹39.20 Cr Corporate Guarantee",
            "Summary": "Finolex Cables provides corporate guarantee of ₹39.20 crores to ICICI Bank for joint venture company FJPSL's working capital facilities worth ₹80 crores, with risk-sharing arrangement based on shareholding.",
            "Sentiment": "neutral",
            "PublishDate": 1765625772376,
            "Source": "co_actions_results"
        },
        {
            "Title": "Finolex Cables Receives GST Demand of Rs 1.87 Lakh from West Bengal Revenue Authority",
            "Summary": "Finolex Cables Limited received an order from Additional Commissioner of Revenue (Appeals) in West Bengal confirming a GST demand of Rs 1,86,952 for alleged excess Input Tax Credit claims due to portal mismatches. The company has the option to file an appeal against the order and states the demand will not have a major impact on operations.",
            "Sentiment": "negative",
            "PublishDate": 1764234869706,
            "Source": "stock"
        },
        {
            "Title": "Finolex Cables Reports Mixed Q2 FY26 Results with 5% Revenue Growth and 26% EBITDA Jump",
            "Summary": "Finolex Cables Limited achieved modest 5% quarterly revenue growth and 9% half-yearly growth, with EBITDA rising 26% for the quarter and 19% for half-year, while PAT increased 35% quarterly and 21% half-yearly. The company faced headwinds in agriculture and building wire segments due to prolonged monsoons and real estate moderation, but saw strong 60% volume growth in cables and expects new preform and fiber draw plants to be operational by March 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1763447581267,
            "Source": "earnings"
        },
        {
            "Title": "Finolex Cables Compliance Officer Resigns Due to Personal Reasons",
            "Summary": "Mrs. Gayatri Kulkarni, Assistant Company Secretary and Compliance Officer at Finolex Cables Limited, has resigned effective after business hours on December 12, 2025, citing personal reasons. The resignation affects the company's compliance function and requires appointment of a replacement for key regulatory and governance roles including POSH Act responsibilities.",
            "Sentiment": "neutral",
            "PublishDate": 1763117698915,
            "Source": "corporate_governance"
        },
        {
            "Title": "Finolex Cables Reports Strong Q2 Performance with 26% Revenue Growth and Margin Expansion",
            "Summary": "Finolex Cables achieved revenue of ₹1,376 crore in Q2 FY26, marking a 26% year-on-year increase, with EBITDA margins expanding 35% and PAT rising 28% to ₹187 crore. The electrical cables segment drove growth with over 60% volume increase in cables despite flat building wire volumes, while communication cables faced muted demand and the company maintained industry-leading working capital efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1763099945341,
            "Source": "earnings"
        },
        {
            "Title": "Finolex Cables Amends Insider Trading Code of Conduct",
            "Summary": "Finolex Cables Limited's Board of Directors approved amendments to the Company's Code of Conduct to regulate, monitor and report trading by designated persons and their immediate relatives. The amended code was approved at a board meeting and includes provisions for pre-clearance requirements, trading window restrictions, disclosure obligations, and penalty structures for non-compliance. The code applies to designated persons including promoters, directors, key managerial personnel, employees with access to unpublished price sensitive information, and their immediate relatives. Trading window closure periods are specified from end of every quarter till 48 hours after declaration of financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1762885039021,
            "Source": "corporate_governance"
        },
        {
            "Title": "Finolex Cables Reports Strong Q2 Performance with 30% Jump in Net Profit",
            "Summary": "Finolex Cables delivered robust quarterly results with net profit rising to 1.9 billion rupees from 1.46 billion rupees year-over-year. Revenue increased to 14 billion rupees compared to 13.11 billion rupees in the same period last year. The company's EBITDA grew significantly to 1.43 billion rupees from 985 million rupees, while EBITDA margin expanded to 10.4% from 7.5% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1762848853267,
            "Source": "earnings"
        },
        {
            "Title": "Finolex Cables Schedules Earnings Conference Call for Quarter Ended September 30, 2025",
            "Summary": "Finolex Cables Limited has announced an earnings conference call for analysts and investors scheduled for November 14, 2025 at 4:00 PM IST. The call will discuss the company's financial results for the quarter and half year ended September 30, 2025. Mr. Mahesh Viswanathan, Deputy CEO and Chief Financial Officer, will represent the management during the group call. The company has provided multiple dial-in options including a Diamond Pass registration for immediate access and various international toll-free numbers. Finolex Cables, established in 1958, is a leading manufacturer of electrical and telecommunication cables in India and has recently diversified into fast-moving electrical goods. The company operates four manufacturing plants located in Pimpri, Urse, Goa, and Roorkee.",
            "Sentiment": "neutral",
            "PublishDate": 1762450304335,
            "Source": "earnings"
        },
        {
            "Title": "Finolex Cables Receives GST Order Demanding Rs 41.19 Lakh for Input Tax Credit Mismatch",
            "Summary": "Finolex Cables Limited received an Order-in-Original from the Assistant Commissioner, Central Tax, Division-II (Pimpri), Pune-I Commissionerate on October 16, 2025. The order partially confirms a demand under Show Cause Notice for disallowing Input Tax Credit due to mismatch on GST portal. The total demand comprises Rs 10.03 lakh in tax, Rs 5.22 lakh in interest, and Rs 25.93 lakh in penalty, totaling Rs 41.19 lakh. The company is alleged to have claimed excess Input Tax Credit compared to the GST portal. Finolex Cables has the option to file an appeal with the Appellate Authority and states the tax demand will not have a major impact on company operations.",
            "Sentiment": "negative",
            "PublishDate": 1760613945056,
            "Source": "stock"
        },
        {
            "Title": "Finolex Cables Reports 13% Revenue Growth in Q1, Faces Margin Pressures from Product Mix Shift",
            "Summary": "Finolex Cables Limited reported revenue of INR 1,400 crore in Q1, representing 13% year-over-year growth, with profit after tax also growing 13%. The electrical segment drove performance with 16% volume growth, primarily from power cables rather than wires. However, the company faced challenges including unseasonal rains impacting agricultural wire demand, depressed communication cable volumes due to delayed contract closures, and price erosion in the lighting segment affecting FMEG revenues. Gross margins remained stable at 20%. The company has underperformed industry growth over the past 4-5 years, with management acknowledging a shift from retail sales to lower-margin project sales. Finolex announced a capex plan of INR 300 crore for the year, including investments in optical fiber business and electrical cables expansion. The company completed its E-beam facility for electrical cables and is preparing to launch its optical fiber preform facility.",
            "Sentiment": "neutral",
            "PublishDate": 1755596455252,
            "Source": "earnings"
        },
        {
            "Title": "Finolex Cables Makes Q1 FY26 Earnings Call Recording Available Online",
            "Summary": "Finolex Cables Limited has made the audio recording of their Q1 FY26 earnings call available on their website. The analysts/investors meet was held on August 14, 2025 at 4:00 PM IST to discuss quarterly results for the period ended July 30, 2025. The company filed this disclosure on August 16, 2025, with Gayatri Kulkarni, Assistant Company Secretary & Compliance Officer, signing the document. The recording is accessible through the company's official website for investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1755325136889,
            "Source": "earnings"
        },
        {
            "Title": "Finolex Cables Reports 13% Revenue Growth in Q1 FY26 Despite Seasonal Challenges",
            "Summary": "Finolex Cables Limited reported quarterly revenue of Rs. 1,396 crores, marking a 13% year-over-year increase from Rs. 1,230 crores in the same quarter last year. EBITDA grew 11% year-over-year to Rs. 185 crores, while profit after tax (PAT) increased 13% to Rs. 139 crores. However, sequential quarterly performance showed declines with revenue down 12%, EBITDA down 9%, and PAT down 16% compared to the previous quarter. The electrical cables segment drove growth with 17% year-over-year revenue increase to Rs. 1,206 crores, supported by 16% growth in wire volumes and doubled power cable volumes. Communication cables segment faced challenges with 9% revenue decline year-over-year to Rs. 109 crores due to delays in optical fiber cable agreements with customers. Unseasonal rains impacted sales in agricultural applications and appliances across segments. The company held a conference call with analysts and investors to discuss these quarterly results.",
            "Sentiment": "neutral",
            "PublishDate": 1755153608035,
            "Source": "earnings"
        },
        {
            "Title": "Finolex Cables Reports 13% Revenue Growth to Rs 1,395.5 Crore in Q1 FY26",
            "Summary": "Finolex Cables Limited reported quarterly revenue of Rs 1,395.5 crore compared to Rs 1,230.5 crore in the corresponding period last year, marking 13% growth. Profit after tax increased 13% to Rs 138.8 crore from Rs 122.5 crore. Electrical Wires volumes grew 6% while Power Cables volumes surged 96%. Communication Cables segment saw lower volumes in both metal-based products and Optic Fiber Cables due to delays in customer agreements. Unseasonal rains affected volumes in new product categories and agricultural wire sales, impacting the overall product mix and margins negatively. Copper price volatility led to selling price reductions in April. The company's Preform Facility expansion is delayed, now expected to be operational by Q4 of the current fiscal year. Earnings per share stood at Rs 9.08 on a face value of Rs 2 per share.",
            "Sentiment": "positive",
            "PublishDate": 1754985734448,
            "Source": "earnings"
        },
        {
            "Title": "Finolex Cables Reports 34% Decline in Quarterly Net Profit",
            "Summary": "Finolex Cables reported consolidated net profit of 1.62 billion rupees for the first quarter, down from 2.44 billion rupees in the same period last year, representing a year-over-year decline of 34%.",
            "Sentiment": "negative",
            "PublishDate": 1754985302067,
            "Source": "earnings"
        },
        {
            "Title": "Finolex Cables Reports Q1 Revenue Growth to 14B Rupees Despite Margin Decline",
            "Summary": "Finolex Cables reported quarterly results showing revenue growth to 14 billion rupees from 12.3 billion rupees year-over-year. EBITDA increased to 1.3 billion rupees from 1.2 billion rupees, while net profit rose to 1.4 billion rupees from 1.22 billion rupees. However, EBITDA margin declined to 7.52% from 9.78% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1754984728230,
            "Source": "earnings"
        },
        {
            "Title": "Finolex Cables Announces 400% Dividend, Issues Tax Deduction Guidelines to Shareholders",
            "Summary": "Finolex Cables Limited has announced a dividend of 400% (Rs. 8 per equity share) for the financial year ended March 31, 2025, subject to shareholder approval at the 57th Annual General Meeting. The Board of Directors recommended this dividend at their meeting held on May 28, 2025. The record date for dividend eligibility is set for September 5, 2025. The company has communicated detailed tax deduction at source (TDS) requirements to shareholders, with different rates applicable based on shareholder category and residential status. For resident individual shareholders, dividend amounts up to Rs. 10,000 during the financial year will have 0% TDS, while other resident shareholders face 10% TDS. Non-resident shareholders will be subject to 20% TDS plus applicable surcharge and cess. Shareholders must submit required documentation to KFin Technologies Limited by August 31, 2025, to ensure appropriate tax deduction rates are applied.",
            "Sentiment": "positive",
            "PublishDate": 1754913696595,
            "Source": "corporate_action"
        },
        {
            "Title": "Finolex Cables: Shares Surge on Jefferies' Bullish Outlook",
            "Summary": "Finolex Cables' stock rose over 5% after Jefferies maintained a 'buy' rating following strong Q4 results. The company beat estimates with 14% YoY sales growth and expects growth from 5G rollout and data centers. Jefferies projects 19% PAT CAGR over FY25-28e and 370 bps ROCE expansion.",
            "Sentiment": "positive",
            "PublishDate": 1748924371000,
            "Source": "earnings"
        },
        {
            "Title": "Finolex Cables: Q4 Revenue Up 14%, Declares ₹8 Dividend",
            "Summary": "Finolex Cables reported Q4 revenue of ₹1,594.6 crore, up 13.8% YoY. Net profit rose 3% to ₹191.7 crore. EBITDA increased 5.5% but margins narrowed. Optical fibre cables saw 30% volume growth. The company declared a ₹8 per share dividend for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1748427316000,
            "Source": "earnings"
        },
        {
            "Title": "Finolex Cables Announces Q4 Results and Dividend",
            "Summary": "Finolex Cables reported its Q4 financial results and declared a dividend. The company's Q4 revenue increased to 16 billion rupees from 14 billion rupees year-over-year. EBITDA rose to 1.66 billion rupees from 1.58 billion rupees, while the EBITDA margin decreased to 10.43% from 11.35%. Net profit for Q4 grew to 1.52 billion rupees from 1.46 billion rupees in the previous year. Additionally, the company announced a dividend of 8 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1748424497000,
            "Source": "result"
        },
        {
            "Title": "Finolex Cables Reports Q3 FY24 Financial Results",
            "Summary": "Finolex Cables has announced its financial results for the third quarter. The company reported an EBITDA of 1.29 billion rupees, compared to 1.33 billion rupees in the same quarter last year. Despite a slight decrease in EBITDA, the EBITDA margin improved marginally to 10.95% from 10.92% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739348908000,
            "Source": "earnings"
        },
        {
            "Title": "Finolex Cables Reports Q3 Revenue Decline",
            "Summary": "Finolex Cables has reported a revenue of 11.8 billion rupees for the third quarter, compared to 12.2 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1739348839000,
            "Source": "earnings"
        },
        {
            "Title": "Finolex Cables Reports Q3 Net Profit of 1.24 Billion Rupees",
            "Summary": "Finolex Cables Limited has announced its financial results for the third quarter. The company reported a net profit of 1.24 billion rupees, compared to 1.3 billion rupees in the same period last year, indicating a slight year-over-year decline.",
            "Sentiment": "neutral",
            "PublishDate": 1739348653000,
            "Source": "earnings"
        },
        {
            "Title": "Finolex Cables Reports Q2 Revenue Growth",
            "Summary": "Finolex Cables has reported a revenue of 13.1 billion rupees for the second quarter, compared to 11.9 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731404056000,
            "Source": "result"
        },
        {
            "Title": "Finolex Cables Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Finolex Cables has reported a significant decrease in its Q2 EBITDA, which fell to 980 million rupees from 1.46 billion rupees year-over-year. The company's EBITDA margin also declined, dropping to 7.50% from 12.30% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731404056000,
            "Source": "result"
        },
        {
            "Title": "Finolex Cables Reports Q2 Net Profit Decline",
            "Summary": "Finolex Cables has reported a net profit of 1.46 billion rupees for the second quarter, down from 1.65 billion rupees in the same period last year. This represents a year-over-year decrease in the company's quarterly earnings.",
            "Sentiment": "negative",
            "PublishDate": 1731404024000,
            "Source": "result"
        }
    ]
}