{
    "Symbol": "FINEORG",
    "ISIN": "INE686Y01026",
    "News": [
        {
            "Title": "Fine Organic Industries Q3FY26 Net Profit Drops 23.5%",
            "Summary": "Fine Organic Industries reported Q3FY26 net profit of ₹6,811.82 lakhs, down 23.5% YoY. Revenue grew marginally to ₹52,858.64 lakhs. Nine-month profit declined 14.9% to ₹25,631.15 lakhs despite revenue growth.",
            "Sentiment": "negative",
            "PublishDate": 1770896062434,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fine Organic Industries Board Meet on Feb 12, 2026",
            "Summary": "Fine Organic Industries Limited has scheduled a Board meeting on February 12, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed until February 14, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770132974451,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fine Organic Industries receives warning from NSE, BSE",
            "Summary": "Fine Organic Industries Limited received warning letters from NSE and BSE on January 6, 2026, for non-compliance with Risk Management Committee meeting requirements during FY25.",
            "Sentiment": "negative",
            "PublishDate": 1767777288581,
            "Source": "stocks"
        },
        {
            "Title": "Fine Organic Industries Forms Dubai Subsidiary",
            "Summary": "Fine Organic Industries Limited incorporated wholly-owned subsidiary Fine Organics FZE in Dubai's Jebel Ali Free Zone on December 24, 2025, to establish local presence in GCC countries and improve supply chain efficiencies.",
            "Sentiment": "positive",
            "PublishDate": 1766570214987,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fine Organic Industries Reports Financial Results for Quarter and Half Year Ended September 30, 2025",
            "Summary": "Fine Organic Industries Limited, India's largest manufacturer of oleochemical-based additives, announced its financial results for the quarter and half year ended September 30, 2025. The company reported a PAT margin of 18.2% for Q2 FY26. Exports accounted for 55% of total revenue during Q2 FY26 and H1 FY26. Overall demand remained stable during H1 FY26, with export markets showing steady performance and domestic demand improving in Q2. Raw material costs increased in H1 FY26 compared to H1 FY25, with a slight increase in Q2 compared to Q1, while freight costs remained stable throughout H1 FY26. The company's wholly owned subsidiary Fine Organic Industries (SEZ) Private Limited issued Preference Shares amounting to Rs 65 crores during the quarter. For strategic expansion in the United States, the company incorporated Fine Organics Americas LLC and made an equity investment of USD 1.12 million (Rs 9.6 crores) in June 2025. In July 2025, the company acquired 159.9 acres of land in Jonesville, Union County, South Carolina for future expansion and manufacturing capabilities.",
            "Sentiment": "neutral",
            "PublishDate": 1762690384544,
            "Source": "earnings"
        },
        {
            "Title": "Fine Organic Industries Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Fine Organic Industries reported Q2 consolidated net profit of 1.08 billion rupees, down from 1.17 billion rupees in the same period last year. Revenue increased to 5.98 billion rupees from 5.96 billion rupees year-over-year. EBITDA declined to 1.35 billion rupees from 1.51 billion rupees, while EBITDA margin compressed to 22.63% from 25.28% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762518464163,
            "Source": "earnings"
        },
        {
            "Title": "Fine Organic Industries Reports Strong Q2 Performance with Net Profit of ₹95.35 Crores",
            "Summary": "Fine Organic Industries Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. The company reported a standalone net profit of ₹95.35 crores for the quarter, compared to ₹92.89 crores in the previous quarter. Revenue from operations stood at ₹371.93 crores for the quarter versus ₹359.15 crores in the prior quarter. For the six-month period, net profit reached ₹188.24 crores with revenue of ₹731.07 crores. The company received an insurance settlement of ₹6.98 crores related to business interruption from a fire incident that occurred in January 2024. The Board had previously recommended a final dividend of ₹11 per share for the year ended March 31, 2025, which was paid in August 2025. The company operates primarily in specialty chemicals manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1762513964965,
            "Source": "earnings"
        },
        {
            "Title": "Fine Organic Industries Independent Director Resigns Due to Health Concerns",
            "Summary": "Ms. Pratima Umarji, Independent Director of Fine Organic Industries Limited, resigned from her position effective November 3, 2025, citing ongoing health concerns. Her resignation also resulted in her ceasing roles as Chairperson of the Stakeholders Relationship Committee and Member of the Nomination and Remuneration Committee. Umarji confirmed there were no other material reasons for her resignation beyond health issues. The company stated that despite the change in board composition, the Board remains duly constituted in accordance with regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1762169691585,
            "Source": "corporate_governance"
        },
        {
            "Title": "Fine Organic Industries Invests Rs. 65 Crore in Wholly Owned Subsidiary",
            "Summary": "Fine Organic Industries Limited invested Rs. 65 crore in its wholly owned subsidiary Fine Organic Industries (SEZ) Private Limited by subscribing to 6.5 crore non-convertible, non-cumulative, non-participating, redeemable preference shares at Rs. 10 per share. The investment aims to support the subsidiary in setting up a manufacturing unit for specialty chemicals business. The subsidiary was incorporated in October 2023 and has not yet commenced operations. The transaction was completed through cash consideration and maintains 100% shareholding control.",
            "Sentiment": "positive",
            "PublishDate": 1755177539665,
            "Source": "stock"
        },
        {
            "Title": "Fine Organic Plans Capacity Expansion Across Three Plants to Drive Growth",
            "Summary": "Fine Organic is pursuing long-term growth through capacity expansion at its Ambernath, Patalganga, and Netherlands manufacturing facilities. The company's strategy focuses on high-profit specialty additives, expanding export markets, and developing sustainable innovations to boost revenue and profit margins.",
            "Sentiment": "positive",
            "PublishDate": 1754671368588,
            "Source": "stock"
        },
        {
            "Title": "Fine Organic Industries Reports Mixed Q1 Results with Revenue Growth and Margin Decline",
            "Summary": "Fine Organic Industries reported Q1 consolidated net profit of 1.17 billion rupees, up from 1.13 billion rupees year-over-year. Revenue increased to 5.88 billion rupees from 5.5 billion rupees in the same period last year. However, EBITDA declined to 1.24 billion rupees from 1.39 billion rupees year-over-year, while EBITDA margin compressed to 21% from 25.44% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754652256801,
            "Source": "earnings"
        },
        {
            "Title": "Fine Organic Industries' Unit Acquires Land in South Carolina",
            "Summary": "Fine Organic Industries has announced that its unit has purchased 159.92 acres of land in South Carolina. The acquisition is intended to expand the company's manufacturing operations in the region.",
            "Sentiment": "positive",
            "PublishDate": 1752206221000,
            "Source": "default"
        },
        {
            "Title": "Fine Organic Industries Announces Q4 Results and Dividend",
            "Summary": "Fine Organic Industries has declared a dividend of 11 rupees per equity share. The company's Q4 EBITDA was 1.2 billion rupees, down from 1.4 billion rupees year-over-year. The Q4 EBITDA margin decreased to 19.71% from 26.24% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1746715651000,
            "Source": "result"
        },
        {
            "Title": "Fine Organic Industries Reports Q4 FY23 Financial Results",
            "Summary": "Fine Organic Industries announced its Q4 financial results. The company reported a consolidated net profit of 971 million rupees, down from 1.15 billion rupees year-over-year but up from 827 million rupees quarter-over-quarter. Revenue for Q4 stood at 6.1 billion rupees, an increase from 5.5 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1746715571000,
            "Source": "result"
        },
        {
            "Title": "Fine Organic Industries Reports Q3 Financial Results",
            "Summary": "Fine Organic Industries has announced its Q3 consolidated net profit of 827 million rupees, compared to 942 million rupees in the same quarter last year and 1.17 billion rupees in the previous quarter. The company's Q3 revenue stands at 5.1 billion rupees, up from 4.88 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738714800000,
            "Source": "earnings"
        },
        {
            "Title": "Fine Organic Industries Reports Q3 Financial Results",
            "Summary": "Fine Organic Industries has released its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q3 was 990 million rupees, compared to 1.18 billion rupees in the same quarter last year. The EBITDA margin decreased to 19.29% from 24.21% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738676086000,
            "Source": "earnings"
        },
        {
            "Title": "Fine Organic Industries Reports Q3 Financial Results",
            "Summary": "Fine Organic Industries has announced its Q3 consolidated net profit of 827 million rupees, showing a decrease from 942 million rupees year-over-year and 1.17 billion rupees quarter-over-quarter. The company's Q3 revenue increased to 5.1 billion rupees from 4.88 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738676020000,
            "Source": "earnings"
        },
        {
            "Title": "Fine Organic Industries to Resume Manufacturing at Badlapur Plant",
            "Summary": "Fine Organic Industries has announced that it will resume manufacturing operations at its Badlapur plant starting November 28. This decision marks the reopening of a key production facility for the company.",
            "Sentiment": "positive",
            "PublishDate": 1732839804000,
            "Source": "corporate_action"
        },
        {
            "Title": "Fine Organic Industries to Resume Manufacturing Operations at Badlapur Plant",
            "Summary": "Fine Organic Industries has announced that it will resume manufacturing operations at its Badlapur plant starting November 28. The company had previously halted operations at this facility.",
            "Sentiment": "positive",
            "PublishDate": 1732791837000,
            "Source": "corporate_action"
        },
        {
            "Title": "Fine Organic: Q2 Results Show Margin Pressure",
            "Summary": "Fine Organic's Q2 results indicate margin pressure due to a weak medium-term outlook, according to a Motilal Oswal report.",
            "Sentiment": "negative",
            "PublishDate": 1731328130000,
            "Source": "result"
        },
        {
            "Title": "Fine Organic Industries Reports Q2 EBITDA and Margin Improvement",
            "Summary": "Fine Organic Industries has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) has increased compared to the same quarter last year. Additionally, the EBITDA margin has improved from 24.25% to 25.28% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731065551000,
            "Source": "result"
        },
        {
            "Title": "Fine Organic Industries Reports Q2 Revenue Growth",
            "Summary": "Fine Organic Industries has announced its second quarter revenue, which amounts to 5.9 billion rupees. This represents an increase from 5.4 billion rupees in the same quarter of the previous year, indicating year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731065457000,
            "Source": "result"
        },
        {
            "Title": "Fine Organic Industries Reports Q2 Profit Growth",
            "Summary": "Fine Organic Industries has announced its Q2 consolidated net profit of 1.2 billion rupees, showing an increase from 1.03 billion rupees year-over-year and 1.1 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731065447000,
            "Source": "result"
        },
        {
            "Title": "Fine Organic Unit Leases Land for New Manufacturing Facility",
            "Summary": "A subsidiary of Fine Organic has entered into a lease agreement with Jawaharlal Nehru Port Authority (JNPA) for a plot of land. The purpose of this lease is to establish a new manufacturing unit.",
            "Sentiment": "positive",
            "PublishDate": 1730207804000,
            "Source": "corporate_action"
        }
    ]
}