{
    "Symbol": "FINKURVE",
    "ISIN": "INE734I01027",
    "News": [
        {
            "Title": "Finkurve Files Q3FY26 Monitoring Agency Report",
            "Summary": "Finkurve Financial Services submitted its Q3FY26 monitoring agency report showing Rs. 111.50 crores utilized from preferential issue proceeds, with Rs. 30.00 crores remaining unutilized during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1770797138726,
            "Source": "co_actions_results"
        },
        {
            "Title": "Finkurve Gets Credit Rating Enhancement from Crisil",
            "Summary": "Crisil Ratings reaffirmed BBB/Stable rating for Finkurve Financial Services' bank facilities and NCDs while enhancing the rated amount for Non-Convertible Debentures to Rs.300 crore.",
            "Sentiment": "positive",
            "PublishDate": 1770382176428,
            "Source": "stocks"
        },
        {
            "Title": "Finkurve Financial Services Schedules Q3 FY26 Call",
            "Summary": "Finkurve Financial Services announces earnings call on February 09, 2026 to discuss Q3 and 9M FY26 financial results with investors and analysts from 12:00 noon to 01:00 PM IST.",
            "Sentiment": "neutral",
            "PublishDate": 1770133911530,
            "Source": "co_actions_results"
        },
        {
            "Title": "Finkurve Opens 100th Gold Loan Branch Milestone",
            "Summary": "Finkurve Financial Services Limited announces the commencement of its 100th tech-enabled gold loan branch, marking significant growth from just 4 branches in 2021 to 100 today.",
            "Sentiment": "positive",
            "PublishDate": 1769681369733,
            "Source": "stocks"
        },
        {
            "Title": "Finkurve Raises ₹35 Crores Through NCDs",
            "Summary": "Finkurve Financial Services board approves fundraising of ₹35 crores through Non-Convertible Debentures via private placement on Electronic Bidding Platform with 11.16% coupon rate.",
            "Sentiment": "positive",
            "PublishDate": 1767075739235,
            "Source": "co_actions_results"
        },
        {
            "Title": "Finkurve Completes NCD Interest Payment Worth ₹51.28 Lakh",
            "Summary": "Finkurve Financial Services paid ₹51.28 lakh interest on two NCD series worth ₹50 crores total, completing payment ahead of January 1, 2026 due date on December 29, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766481349193,
            "Source": "co_actions_results"
        },
        {
            "Title": "Finkurve Financial Services Raises Rs. 50 Crores Through Non-Convertible Debentures",
            "Summary": "Finkurve Financial Services' Board approved raising Rs. 50 crores through Non-Convertible Debentures via private placement, structured in two series with 2-year and 3-year tenures. The NCDs offer coupon rates of 11.15% and 11.25% per annum with monthly interest payments, secured against the company's receivables equivalent to 1.10x of gold loan AUM.",
            "Sentiment": "positive",
            "PublishDate": 1763968496035,
            "Source": "corporate_action"
        },
        {
            "Title": "Finkurve Financial Services Reports No Deviation in Preferential Issue Proceeds Utilization",
            "Summary": "Finkurve Financial Services Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing Rs 111.50 crores utilized from the revised issue proceeds of Rs 141.50 crores with no deviations from stated objectives. CRISIL Ratings confirmed the NBFC has properly deployed funds for onward lending, investments and repayment of borrowings, with Rs 30 crores still pending from warrant holders who have 18 months to convert their warrants into equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763108461937,
            "Source": "corporate_action"
        },
        {
            "Title": "Finkurve Financial Reports 97% YoY AUM Growth and Appoints New CEO",
            "Summary": "Finkurve Financial Services reported 97% year-on-year growth in Assets Under Management to INR 671.35 crore and 71% rise in PAT for Q2FY26, with total income growing 49.82% to INR 48.14 crore. The company appointed Naveen Kottala as Chief Executive Officer effective November 18, 2025, to lead its next phase of growth in the gold loan business.",
            "Sentiment": "positive",
            "PublishDate": 1763101932039,
            "Source": "earnings"
        },
        {
            "Title": "Finkurve Financial Services CEO Amit Shroff Resigns Due to Personal Reasons",
            "Summary": "Amit Shroff has resigned from his position as Chief Executive Officer of Finkurve Financial Services Limited, effective October 31, 2025. Shroff submitted his resignation letter on October 13, 2025, citing personal reasons for his departure. The resignation will take effect at the close of business hours on October 31, 2025. The company has made the required regulatory disclosures to stock exchanges BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1760338021905,
            "Source": "corporate_governance"
        },
        {
            "Title": "Finkurve Financial Services Gets NSE Listing Approval for 14 Crore Equity Shares",
            "Summary": "Finkurve Financial Services Limited received approval from the National Stock Exchange of India (NSE) to list 14,00,19,206 equity shares on the Main Board. The company's equity shares will commence trading on NSE from October 1, 2025, under the symbol FINKURVE. The approval was granted through NSE letter dated September 29, 2025. The shares have a face value of Re. 1 each and are fully paid up. The listing includes various lock-in periods for different tranches of shares, with some shares remaining free for trading while others have lock-in periods extending until November 2025 and February 2026.",
            "Sentiment": "positive",
            "PublishDate": 1759212899116,
            "Source": "stock"
        },
        {
            "Title": "Finkurve Financial Services Announces Analyst Meet with Presentation on Gold Loan Business Strategy",
            "Summary": "Finkurve Financial Services Limited announced an Analyst/Institutional Investor Meet scheduled for September 23, 2025, and provided a detailed presentation covering its gold loan business operations. The company operates as a tech-enabled NBFC with 83 physical branches across 4 states, focusing on gold loans which comprise 89% of its AUM. Key highlights include disbursing INR 1,605.55 cr in FY25, maintaining a 30-minute average loan disbursal time, and serving 70,000+ active customers. The company is backed by the Augmont Group, which operates India's largest gold and silver SPOT platform. Financial metrics show gross AUM of INR 541.78 cr in Q1FY26, with GNPA at 0.37% and NNPA at 0.17%. The company reported profit after tax of INR 5.09 cr in Q1FY26 and maintains a CRISIL BBB/Stable rating. Finkurve aims to achieve a loan book of INR 10,000 cr by 2029, positioning itself as India's largest tech-driven gold loans company.",
            "Sentiment": "positive",
            "PublishDate": 1758265949723,
            "Source": "stock"
        },
        {
            "Title": "Finkurve Financial Services Sets Record Date for NCD Interest Payment",
            "Summary": "Finkurve Financial Services Limited has set August 23, 2025 as the record date for quarterly interest payment on its Non-Convertible Debentures (ISIN: INE734I07024). The interest payment is scheduled for September 7, 2025. NCD holders whose names appear in the Statement of Beneficiary Position provided by Depositories as on the record date will receive the interest payment on the due date.",
            "Sentiment": "neutral",
            "PublishDate": 1756107383455,
            "Source": "corporate_action"
        },
        {
            "Title": "Finkurve Financial Services Reports 66% YoY AUM Growth in Q1 FY26",
            "Summary": "Finkurve Financial Services Limited, a tech-first gold loan NBFC, reported strong performance for Q1 FY26. Asset Under Management grew 66.01% year-over-year to INR 541.78 crores from INR 326.36 crores. Total income increased 40.47% YoY to INR 40.04 crores, while net interest income rose 29.47% to INR 19.52 crores. The company maintained healthy asset quality with gross NPA at 0.37% and net NPA at 0.17%. Capital adequacy ratio stood at 57.31%. During the quarter, the company raised approximately INR 111.50 crores through preferential issue of equity shares and warrants. Branch network expanded 29.68% YoY to 83 branches, including the first branch in Chennai, Tamil Nadu. Disbursements reached INR 796.61 crores during the quarter. Net Interest Margin was reported at 15.91%.",
            "Sentiment": "positive",
            "PublishDate": 1755522435227,
            "Source": "earnings"
        },
        {
            "Title": "Finkurve Financial Services Reports Q1 Results and Allots Rs 210 Crore NCDs",
            "Summary": "Finkurve Financial Services Limited announced its quarterly results for the quarter ended June 30, 2025, reporting a net profit of Rs 509.11 lakhs compared to Rs 391.38 lakhs in the previous quarter. Total income increased to Rs 4,042.66 lakhs from Rs 2,850.31 lakhs in the same quarter last year. The company's board approved the allotment of 2,100 non-convertible debentures with a face value of Rs 1,00,000 each, raising Rs 21 crores through private placement. The NCDs carry an 11.75% coupon rate and have a 36-month tenure maturing on August 13, 2028. The company reported no deviation in the utilization of Rs 141.50 crores raised through preferential issue of equity shares and share warrants, with Rs 111.50 crores utilized for onward lending, investment, and repayment of borrowings. The company's off-book AUM through co-lending of gold loans reached Rs 14.25 crores.",
            "Sentiment": "positive",
            "PublishDate": 1755088644501,
            "Source": "earnings"
        },
        {
            "Title": "Finkurve Financial Services Approves Rs 22 Crore Non-Convertible Debenture Issuance",
            "Summary": "Finkurve Financial Services Limited's Board of Directors approved raising funds up to Rs 22 crores through Non-Convertible Debentures on a private placement basis via Electronic Bidding Platform. The company will issue 2,200 NCDs with a face value and issue price of Rs 1 lakh each. The debentures carry an 11.75% per annum coupon rate with a 36-month tenure, scheduled for allotment on August 13, 2025, and maturity on August 13, 2028. The NCDs are secured against the company's receivables equivalent to 1.10x of the gold loan AUM and are proposed to be listed on BSE Limited. Interest payments are scheduled quarterly starting from March 31, 2025. In case of payment default, the company will pay additional interest at 1% per annum over the base interest rate.",
            "Sentiment": "neutral",
            "PublishDate": 1754898447663,
            "Source": "corporate_action"
        },
        {
            "Title": "Finkurve Financial Services Schedules Board Meeting to Consider Non-Convertible Debentures Issuance",
            "Summary": "Finkurve Financial Services Limited has scheduled a board meeting for August 11, 2025, to consider and approve raising funds through the issuance of Non-Convertible Debentures. The debentures will have a face value and issue price of Rs. 1,00,000 each and will be issued through private placement via Electronic Bidding Platform. The company informed BSE about the board meeting through Company Secretary Kajal Parmar.",
            "Sentiment": "neutral",
            "PublishDate": 1754389807030,
            "Source": "corporate_action"
        },
        {
            "Title": "Finkurve Financial Services Board to Review Debenture Issuance Plans",
            "Summary": "Finkurve Financial Services has announced that its board plans to review a debenture issuance. The review will examine the company's debt instrument offering plans.",
            "Sentiment": "neutral",
            "PublishDate": 1754389301769,
            "Source": "corporate_action"
        },
        {
            "Title": "Finkurve Financial Services Receives BSE Trading Approval for 13 Crore Preferential Equity Shares",
            "Summary": "Finkurve Financial Services Limited has received trading approval from BSE Limited for 1,30,13,100 equity shares of Re. 1/- each allotted to non-promoters on a preferential basis. The shares were issued at a premium of Rs. 77/- with distinctive numbers from 126908607 to 139921706. BSE granted the trading approval through a letter dated July 22, 2025, and the securities became listed on the exchange effective from July 23, 2025. The company informed about this development through Company Secretary Kajal Parmar.",
            "Sentiment": "positive",
            "PublishDate": 1753957480468,
            "Source": "corporate_action"
        },
        {
            "Title": "Finkurve Financial Services to Consider Raising Funds via NCDs",
            "Summary": "Finkurve Financial Services has announced a board meeting scheduled for January 23. The primary agenda is to consider and approve the raising of funds through the issuance of Non-Convertible Debentures (NCDs) via private placement.",
            "Sentiment": "neutral",
            "PublishDate": 1737378313000,
            "Source": "corporate_action"
        },
        {
            "Title": "Finkurve Financial Services Announces Fundraising Plans",
            "Summary": "Finkurve Financial Services has announced plans to raise funds through multiple channels. The company intends to raise up to 1.2 billion rupees through shares, up to 233 million rupees via Non-Convertible Debentures (NCDs), and 400 million rupees through convertible share warrants.",
            "Sentiment": "positive",
            "PublishDate": 1734360482000,
            "Source": "corporate_action"
        },
        {
            "Title": "Finkurve Financial Services to Consider Fund Raising in Board Meeting",
            "Summary": "Finkurve Financial Services has announced a board meeting scheduled for December 16 to discuss potential fund raising options. This meeting suggests the company may be looking to secure additional capital for its operations or expansion plans.",
            "Sentiment": "neutral",
            "PublishDate": 1733918841000,
            "Source": "corporate_action"
        }
    ]
}