{
    "Symbol": "FINOPB",
    "ISIN": "INE02NC01014",
    "News": [
        {
            "Title": "Fino Payments Bank Reports No Fund Deviations in Q3",
            "Summary": "Fino Payments Bank Limited confirms no deviations in utilization of Rs. 300 crore IPO funds for Q3 ended December 31, 2025, with complete fund utilization achieved.",
            "Sentiment": "positive",
            "PublishDate": 1769699693850,
            "Source": "stocks"
        },
        {
            "Title": "Fino Payments Bank Q3FY26 Net Profit Drops 47%",
            "Summary": "Fino Payments Bank reported Q3FY26 net profit of ₹1,225 lakhs, down 47% YoY from ₹2,311 lakhs. Total income declined to ₹39,441 lakhs while operating expenses decreased.",
            "Sentiment": "negative",
            "PublishDate": 1769697566160,
            "Source": "co_actions_results"
        },
        {
            "Title": "RBI Approves Fino Payments Bank CEO Re-Appointment",
            "Summary": "Reserve Bank of India grants approval for Rishi Gupta's re-appointment as Managing Director & CEO of Fino Payments Bank until May 2026, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1769580208407,
            "Source": "stocks"
        },
        {
            "Title": "Fino Payments Bank migrates to Finacle platform Jan 8-10",
            "Summary": "Fino Payments Bank announces Core Banking System migration to Finacle platform from January 8-10, 2026. All banking services will be unavailable during the transition period as part of digital transformation.",
            "Sentiment": "neutral",
            "PublishDate": 1767699467378,
            "Source": "stocks"
        },
        {
            "Title": "Fino Payments Bank to Add 600 Staff in SFB Transition",
            "Summary": "Fino Payments Bank plans to hire 600 people over three years as it transitions to a small finance bank, targeting its existing merchant and customer base for lending operations.",
            "Sentiment": "positive",
            "PublishDate": 1767264325873,
            "Source": "stocks"
        },
        {
            "Title": "Fino Payments Bank Receives RBI In-Principle Approval to Convert into Small Finance Bank",
            "Summary": "Fino Payments Bank Limited received in-principle approval from the Reserve Bank of India on December 05, 2025, to convert from a Payments Bank to a Small Finance Bank, becoming the first Payments Bank in India to achieve this milestone. The conversion will enable Fino to expand its product suite, engage with wider customer segments, foray into lending, and build a stronger liability franchise while continuing operations as a Payments Bank until final approval is granted.",
            "Sentiment": "positive",
            "PublishDate": 1764944130289,
            "Source": "corporate_action"
        },
        {
            "Title": "Fino Payments Bank Pays Rs. 10.18 Crores Under Protest in GST Dispute",
            "Summary": "Fino Payments Bank paid Rs. 10.18 crores under protest following GST officials' search operations that concluded on November 19, 2025, related to Input Tax Credit claims. The bank plans to contest the GST Authority's view and states there will be no impact on its operations or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1763579627918,
            "Source": "stock"
        },
        {
            "Title": "Fino Payments Bank Faces GST Authority Search at Registered Office",
            "Summary": "GST authorities initiated a search at Fino Payments Bank Limited's registered office on November 10, 2025. The search is being conducted under Section 67(2) of the Maharashtra Goods and Service Tax Act, 2017 by the Commissioner of State Tax, Maharashtra State, Mumbai. The proceedings are ongoing and the bank is cooperating fully by providing data as requested by the authorities. The company has disclosed this information to stock exchanges as required under SEBI listing regulations.",
            "Sentiment": "negative",
            "PublishDate": 1762803158144,
            "Source": "stock"
        },
        {
            "Title": "Fino Payments Bank Outlines Growth Strategy Through Cross-Selling and Network Expansion",
            "Summary": "Fino Payments Bank has provided guidance on its path to accelerated profitability through multiple strategic initiatives. The bank plans to focus on cross-selling products to existing customers, expanding its merchant and agent networks, and capitalizing on strong transaction growth in rural and semi-urban markets.",
            "Sentiment": "positive",
            "PublishDate": 1761755131604,
            "Source": "stock"
        },
        {
            "Title": "Fino Payments Bank Reports Mixed Q2 Results with Revenue Growth and Profit Decline",
            "Summary": "Fino Payments Bank reported quarterly net profit of 154 million rupees, down from 212 million rupees in the same period last year. However, the bank's revenue increased to 601 million rupees compared to 478 million rupees year-over-year, showing growth in top-line performance despite the decline in profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1761741066048,
            "Source": "earnings"
        },
        {
            "Title": "Fino Payments Bank Schedules Board Meeting for October 29, 2025 to Approve Financial Results",
            "Summary": "Fino Payments Bank Limited will hold a Board of Directors meeting on October 29, 2025, to consider and approve the Audited Financial Results for the half year ended September 30, 2025 and Unaudited Financial Results for the quarter ended September 30, 2025. The bank has implemented a trading window closure for its designated persons and their immediate relatives from October 1, 2025 to October 31, 2025. The bank trades on BSE with scrip code 543386 and on NSE with symbol FINOPB.",
            "Sentiment": "neutral",
            "PublishDate": 1760783845297,
            "Source": "corporate_action"
        },
        {
            "Title": "Fino Payments Bank Gets RBI Approval for Chairman Re-appointment",
            "Summary": "Fino Payments Bank Limited received Reserve Bank of India approval for the re-appointment of Rajat Kumar Jain as Part-Time Chairman for a three-year term from November 02, 2025 to November 01, 2028. The bank's Board of Directors had previously approved the re-appointment based on the Nomination and Remuneration Committee's recommendation. Jain has been an Independent Director since November 02, 2020 and Part-Time Chairman since November 24, 2023. He is an alumnus of IIT Delhi and IIM Ahmedabad, and currently serves as Founder Director of Padup Ventures, a knowledge and mentoring platform for early-stage tech companies.",
            "Sentiment": "positive",
            "PublishDate": 1760712815363,
            "Source": "corporate_governance"
        },
        {
            "Title": "Fino Payments Bank Approves Re-appointment of Rishi Gupta as MD & CEO for Three Years",
            "Summary": "Fino Payments Bank Limited's Board of Directors approved the re-appointment of Rishi Gupta as Managing Director and Chief Executive Officer for a three-year term from May 02, 2026 to May 01, 2029. The decision was made following a recommendation from the Nomination and Remuneration Committee and is subject to regulatory approval from the Reserve Bank of India and shareholder approval. Gupta is one of the founders of Fino PayTech Limited, the holding company of Fino Payments Bank, and has 31 years of experience in financial services. He is a qualified Chartered Accountant and Cost & Management Accountant with a Bachelor's degree in commerce from Shri Ram College of Commerce, University of Delhi.",
            "Sentiment": "positive",
            "PublishDate": 1760711596111,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jio Payments Bank Wins Contract for Next-Gen Tolling System on Gurugram-Jaipur Highway",
            "Summary": "Jio Payments Bank, a subsidiary of Jio Financial Services, secured a contract to deploy an Automatic Number Plate Recognition (ANPR)-based Multi-Lane Free Flow (MLFF) tolling system at Shahjahanpur and Manoharpura toll plazas on the Gurugram-Jaipur highway. The MLFF system enables electronic toll collection across multiple lanes without requiring vehicles to slow down, integrating RFID, ANPR, DSRC, and GNSS technologies. The contract was awarded through a tender by Indian Highways Management Company Limited under India's pilot MLFF project. JPBL has won two of the five MLFF tenders awarded so far and began managing FASTag-based toll collection at 11 other highway plazas. The bank plans to explore synergies with Jio Platforms to support toll management operations and strengthen digital payments across highways.",
            "Sentiment": "positive",
            "PublishDate": 1760340930631,
            "Source": "stock"
        },
        {
            "Title": "Fino Payments Bank Pays Rs 5.88 Lakh to Settle SEBI Case Over Disclosure Violations",
            "Summary": "Fino Payments Bank settled a case with SEBI by paying Rs 5.88 lakh for failing to make timely and complete disclosure regarding frauds perpetrated by its employees. The bank received 15 complaints alleging fraudulent investment schemes by employees and obtained KPMG's investigation report on November 8, 2023. However, the bank failed to make adequate disclosure within the required 24 hours and did not provide subsequent updates as mandated under LODR Regulations. The disclosure should have been made by November 9, 2023. The settlement was made without admission or denial of findings, and SEBI disposed of the adjudication proceedings that began with a show cause notice dated October 8, 2024.",
            "Sentiment": "negative",
            "PublishDate": 1759755753125,
            "Source": "corporate_governance"
        },
        {
            "Title": "Fino Payments Bank Reports 4% Revenue Growth Amid Regulatory Headwinds and Remittance Business Decline",
            "Summary": "Fino Payments Bank recorded revenue of INR453 crores for Q1 FY26, marking 4% year-on-year growth despite facing industry-wide challenges. The bank added approximately 7 lakh new CASA accounts, bringing total accounts to 1.5 crores, while average deposits rose 34% to INR2,275 crores. However, remittance business saw significant decline following regulatory changes introduced in November 2024, with the segment dropping from one-third of revenue in Q1 FY25 to one-fifth currently. EBITDA increased 16% to INR62 crores and cash profit grew 20% to INR50.5 crores. The bank adopted cautious approach due to rising mule account concerns and enhanced regulatory scrutiny, temporarily impacting account additions and transaction volumes. Digital payment services revenue grew 59% to INR106 crores, handling transactions worth INR68,000 crores. Net revenue margin expanded by 250 basis points year-on-year due to favorable shift toward higher-margin CASA and digital payment services. The bank has applied for small finance bank license and expects core banking system migration completion before calendar year end.",
            "Sentiment": "neutral",
            "PublishDate": 1754465111130,
            "Source": "earnings"
        },
        {
            "Title": "Fino Payments Bank Makes Earnings Call Audio Recording Available to Investors",
            "Summary": "Fino Payments Bank has made the audio recording of its earnings call with investors and analysts available on its website. The call was held on July 31, 2025, to discuss the un-audited financial results for the quarter ended June 30, 2025. The bank's investor presentation has already been submitted to stock exchanges, and the call transcript will be submitted subsequently. The audio recording can be accessed through the bank's website at www.finobank.com.",
            "Sentiment": "neutral",
            "PublishDate": 1753982475562,
            "Source": "earnings"
        },
        {
            "Title": "Fino Payments Bank Plans Growth Strategy with SFB License Application and Core Banking Upgrades",
            "Summary": "Fino Payments Bank has outlined expansion plans targeting a 40% increase in profitable ventures. The bank intends to apply for a Small Finance Bank (SFB) license and implement core banking system improvements as part of its long-term digital expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1753886259031,
            "Source": "stock"
        },
        {
            "Title": "Fino Payments Bank Reports Q1 FY26 Results, Reappoints Chairman and Names New Auditors",
            "Summary": "Fino Payments Bank announced its unaudited financial results for the quarter ended June 30, 2025. The bank reported a net profit of ₹1,776 lakhs compared to ₹2,427 lakhs in the same quarter last year. Total income stood at ₹45,347 lakhs versus ₹43,686 lakhs in the previous year quarter. The board approved the reappointment of Mr. Rajat Kumar Jain as Non-Executive Independent Director and Part-Time Chairperson for three consecutive years from November 2025 to November 2028, subject to shareholder and regulatory approvals. The bank also appointed M/s. Bilimoria Mehta & Co. as new Statutory Central Auditors for three years and M/s. Alwyn Jay & Co. as Secretarial Auditors for five years, both appointments subject to shareholder approval. Basic earnings per share decreased to ₹2.13 from ₹2.92 in the corresponding quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753884646765,
            "Source": "earnings"
        },
        {
            "Title": "Fino Payments Bank Reports 34.5% Revenue Growth in Q1 Results",
            "Summary": "Fino Payments Bank reported quarterly net profit of 246.3 million rupees compared to 242.7 million rupees in the same period last year, representing a marginal increase. The bank's revenue grew significantly to 609.9 million rupees from 453.3 million rupees year-over-year, marking a 34.5% increase in revenue performance.",
            "Sentiment": "positive",
            "PublishDate": 1753883333201,
            "Source": "earnings"
        },
        {
            "Title": "Fino Payments Bank Schedules Earnings Call for July 31, 2025",
            "Summary": "Fino Payments Bank Limited will host an earnings conference call with investors and analysts on July 31, 2025, at 4:00 P.M. (IST). The call will be moderated by Go India Advisors and will discuss the unaudited financial results for the quarter ended June 30, 2025. Participants can join via pre-registration through Diamond Pass Registration or dial-in numbers. The earnings call information is available on the bank's website at www.finobank.com.",
            "Sentiment": "neutral",
            "PublishDate": 1753167727531,
            "Source": "earnings"
        },
        {
            "Title": "Fino Payments Bank: Targets Rs 100 Crore Profit in FY26, Embraces Digital Growth",
            "Summary": "Fino Payments Bank aims for Rs 100 crore profit in FY26, driven by digital transaction growth. CEO Rishi Gupta reports 49% of transaction volume now from digital sources. The bank continues to add 1.5-2 lakh merchants annually to its network of 19 lakh. Fino is collaborating with NBFCs for lending products and has applied for a small finance bank license.",
            "Sentiment": "positive",
            "PublishDate": 1751418389000,
            "Source": "earnings"
        },
        {
            "Title": "Fino Payments Bank: Preparing for Small Finance Bank Transition",
            "Summary": "Fino Payments Bank is preparing to transition into a small finance bank, awaiting RBI approval for license upgradation. The bank plans to focus on secured loans and is building organizational capacity for the change. This move is seen as a strategy to address challenges in the payments bank space, particularly due to UPI dominance.",
            "Sentiment": "positive",
            "PublishDate": 1746559289000,
            "Source": "corporate_action"
        },
        {
            "Title": "Fino Payments Bank: Revenue Surges 25% to ₹1,847 Crore in FY25",
            "Summary": "Fino Payments Bank reported 25% YoY revenue growth to ₹1,847 crore in FY25. Profit before tax increased 26% to ₹108.3 crore. Digital transactions grew 29% YoY, processing over ₹4.6 lakh crore. Customer base expanded to 1.43 crore. The bank invested ₹150 crore in technology infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1745855152000,
            "Source": "earnings"
        },
        {
            "Title": "FINO Payments Bank Reports Q4 FY23 Financial Results",
            "Summary": "FINO Payments Bank announced its Q4 FY23 financial results. The bank reported a net profit of 240 million rupees, compared to 252 million rupees year-over-year and 231 million rupees quarter-over-quarter. Revenue for Q4 stood at 528 million rupees, up from 414 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1745849363000,
            "Source": "result"
        },
        {
            "Title": "Fino Payments Bank: Expanding Loan Portfolio and Eyeing Small Finance Bank Status",
            "Summary": "Fino Payments Bank is ramping up its credit disbursement business through partnerships with lending institutions. The bank is conducting pilots for home loans, gold loans, and micro-credit products. Monthly loan disbursements have increased from ₹10-20 crore to ₹50-60 crore in four months. Fino applied for a small finance bank license in December 2023 and aims to build a differentiated, low-cost digital model offering payments, savings, and credit products.",
            "Sentiment": "positive",
            "PublishDate": 1740011403000,
            "Source": "normal_news"
        },
        {
            "Title": "Fino Payments Bank Reports Q3 Financial Results",
            "Summary": "Fino Payments Bank has announced its financial results for the third quarter. The bank reported a net profit of 231 million rupees, showing a slight increase from 228 million rupees in the same quarter last year and a more significant rise from 212 million rupees in the previous quarter. Revenue for Q3 stood at 494 million rupees, marking a substantial increase from 391 million rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738197203000,
            "Source": "earnings"
        },
        {
            "Title": "Fino Payments Bank Reports Q3 Financial Results",
            "Summary": "Fino Payments Bank has announced its financial results for the third quarter. The bank reported a net profit of 231 million rupees, showing a slight increase from 228 million rupees year-over-year. Compared to the previous quarter, the net profit rose from 212 million rupees. The bank's revenue for Q3 stood at 494 million rupees, marking a significant increase from 391 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738159792000,
            "Source": "earnings"
        },
        {
            "Title": "Fino Payments Bank Addresses Misappropriation of Funds",
            "Summary": "Fino Payments Bank has reported findings from a KPMG investigation into the misappropriation of funds. The investigation revealed unauthorized actions by staff members, leading to the termination of identified employees on October 27, 2023. The total alleged complaint amount is 355.5 million rupees. The bank has taken disciplinary actions, filed police complaints, and terminated agreements with merchants who breached the bank's prescribed processes.",
            "Sentiment": "negative",
            "PublishDate": 1737936669000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Fino Payments Bank Takes Action Against Employees and Merchants for Policy Breaches",
            "Summary": "Fino Payments Bank has implemented disciplinary measures against certain employees and filed police complaints in response to identified misconduct. Additionally, the bank has terminated agreements with some merchants who were found to be in violation of the bank's prescribed processes.",
            "Sentiment": "negative",
            "PublishDate": 1737729585000,
            "Source": "corporate_governance"
        },
        {
            "Title": "FINO Payments Bank Terminates Employees Over Fund Misappropriation",
            "Summary": "FINO Payments Bank has reported that a KPMG investigation into the misappropriation of funds revealed unauthorized actions by staff members. As a result, the identified employees were terminated on October 27, 2023. The total alleged complaint amount, according to the KPMG report, is 355.5 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1737729575000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Fino Payment Bank to Consider Q3 Results on January 29",
            "Summary": "Fino Payment Bank has announced that it will consider and approve its financial results for the third quarter of the current fiscal year on January 29. This meeting will review the bank's performance for the quarter ending December 31.",
            "Sentiment": "neutral",
            "PublishDate": 1737385119000,
            "Source": "earnings"
        },
        {
            "Title": "Fino Payments Bank: Prepares for Small Finance Bank Transition",
            "Summary": "Fino Payments Bank is preparing to apply for a small finance bank license, signaling a strategic move towards future growth and expansion of services.",
            "Sentiment": "positive",
            "PublishDate": 1729770058000,
            "Source": "normal_news"
        },
        {
            "Title": "FINO Payments Bank Reports Q2 FY24 Financial Results",
            "Summary": "FINO Payments Bank has announced its financial results for the second quarter of fiscal year 2024. The bank reported a net profit of 212 million rupees, showing an increase from 195 million rupees in the same quarter last year and 243 million rupees in the previous quarter. Revenue for Q2 stood at 478 million rupees, up from 365 million rupees in the corresponding period last year.",
            "Sentiment": "positive",
            "PublishDate": 1729692159000,
            "Source": "result"
        }
    ]
}