{
    "Symbol": "FINPIPE",
    "ISIN": "INE183A01024",
    "News": [
        {
            "Title": "Finolex Industries Q3FY26 Earnings Call Highlights",
            "Summary": "Finolex Industries reported improved profitability in Q3FY26 despite volume decline, with EBITDA rising to ₹123 crores from ₹83 crores YoY. Company maintains strong balance sheet with net cash surplus of ₹2,430 crores.",
            "Sentiment": "positive",
            "PublishDate": 1770300363095,
            "Source": "co_actions_results"
        },
        {
            "Title": "Finolex Industries Board Meet Set for Jan 31, 2026",
            "Summary": "Finolex Industries announces board meeting on January 31, 2026 to consider Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769499288473,
            "Source": "co_actions_results"
        },
        {
            "Title": "Finolex Industries Appoints Shirish Panke as Head-HR",
            "Summary": "Finolex Industries Limited has appointed Mr. Shirish Panke as Head-Human Resources and Senior Management Personnel effective December 11, 2025, bringing 29 years of strategic HR experience.",
            "Sentiment": "positive",
            "PublishDate": 1765447850099,
            "Source": "stocks"
        },
        {
            "Title": "Finolex Industries Reports Strong Q2 Performance with Net Profit Rising to 1.2 Billion Rupees",
            "Summary": "Finolex Industries delivered strong quarterly results with net profit increasing to 1.2 billion rupees from 514.4 million rupees year-over-year. Revenue grew to 8.6 billion rupees compared to 8.28 billion rupees in the same period last year. EBITDA surged significantly to 1.3 billion rupees from 120 million rupees year-over-year, while EBITDA margin expanded substantially to 15.02% from 1.45% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762733536399,
            "Source": "earnings"
        },
        {
            "Title": "Finolex Industries Reports Strong Q2 Performance with EBITDA Surge to 1.3B Rupees",
            "Summary": "Finolex Industries delivered robust quarterly results with EBITDA jumping to 1.3 billion rupees from 120 million rupees year-over-year. The company's EBITDA margin expanded significantly to 15.02% compared to 1.45% in the same period last year. Net profit increased to 1.2 billion rupees from 514.4 million rupees year-over-year, while revenue grew to 8.6 billion rupees from 8.28 billion rupees in the corresponding period.",
            "Sentiment": "positive",
            "PublishDate": 1762528236619,
            "Source": "earnings"
        },
        {
            "Title": "Finolex Industries Reports Muted Q1 Performance with 2% Volume Growth Despite Weak Demand",
            "Summary": "Finolex Industries reported modest growth in pipes and fittings volume of 2% to 92,129 metric tons in Q1, despite weak overall demand. Total income from operations declined 9% to INR 1,043 crores due to weaker sales realizations from PVC price volatility. EBITDA dropped significantly to INR 94 crores from INR 207 crores in the previous year. The company will now report as a single entity rather than splitting PVC resin and pipes segments, as PVC resin is almost entirely for captive consumption. The company maintains a strong balance sheet with net cash surplus of INR 2,533 crores. Management expects high single-digit growth going forward and anticipates double-digit industry growth for the year. A new Managing Director has been approved by the Board and will join soon, with current MD Saurabh Dhanorkar continuing in an advisory capacity.",
            "Sentiment": "neutral",
            "PublishDate": 1754922879736,
            "Source": "earnings"
        },
        {
            "Title": "Finolex Industries Reports 54% Drop in Q1 FY26 Profit Despite Volume Growth",
            "Summary": "Finolex Industries reported mixed results for Q1 FY26 with pipe and fitting volumes growing 2% to 92,129 MT compared to 90,620 MT in Q1 FY25. However, revenue declined 9% to ₹1,043 crore from ₹1,140 crore due to weaker realizations caused by PVC price volatility. EBITDA fell significantly to ₹94 crore from ₹207 crore in the previous year, while profit before tax dropped 45% to ₹126 crore from ₹229 crore. The company maintained strong liquidity with free cash of ₹2,533 crore. The results reflect a muted operating performance despite modest volume growth in a weak demand environment. The company also highlighted various marketing initiatives including digital campaigns, retail branding across 200+ counters, and extensive CSR activities spanning education, healthcare, rural development, and environmental sustainability.",
            "Sentiment": "negative",
            "PublishDate": 1754154177351,
            "Source": "earnings"
        },
        {
            "Title": "Finolex Industries Announces Leadership Changes and Appoints New Managing Director",
            "Summary": "Finolex Industries' Board approved significant leadership changes during its meeting on August 2, 2025. The company appointed Udipt Agarwal as Additional Director cum Whole-time Director from September 5, 2025, and as Managing Director from November 1, 2025, for a five-year term. Rambabu Sanka was appointed as Additional Director cum Whole-time Director and designated as Director - Technical for five years from August 2, 2025. The appointments are subject to shareholder approval at the 44th Annual General Meeting scheduled for September 12, 2025. Managing Director Saurabh Dhanorkar will step down on October 25, 2025, upon reaching age 70, while Director - Technical Saumya Chakrabarti resigned effective August 31, 2025, citing personal reasons. Independent Director Rajesh Balkrishna Rathi also resigned on August 2, 2025, due to other professional commitments. The Board also appointed SVD & Associates as Secretarial Auditors for five years and approved quarterly results for the period ended June 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754149664601,
            "Source": "corporate_governance"
        },
        {
            "Title": "Finolex Industries Expects Price Increase and Continued Growth",
            "Summary": "Finolex Industries anticipates another price increase in June or July, driven by government initiatives. The company expects low capital expenditure for capacity increase in the pipes business, noting it's not highly capital-intensive. Finolex projects a close to double-digit growth trend to continue in both agricultural and non-agricultural segments, with internal calculations assuming a growth rate slightly above 10%.",
            "Sentiment": "positive",
            "PublishDate": 1748316473000,
            "Source": "default"
        },
        {
            "Title": "Finolex Industries: Q4 Revenue and EBITDA Decline, Dividend Announced",
            "Summary": "Finolex Industries reported a 5% decrease in Q4 revenue to ₹1,171.8 crore. EBITDA fell 18% to ₹171.3 crore, with margin contracting to 14.62%. Net profit remained flat at ₹165 crore. The board recommended a total dividend of ₹3.6 per share for FY2025.",
            "Sentiment": "neutral",
            "PublishDate": 1748075786000,
            "Source": "earnings"
        },
        {
            "Title": "Finolex Industries Announces Dividend and Q4 Financial Results",
            "Summary": "Finolex Industries has recommended a final dividend of 2 rupees per fully paid-up equity share and a special dividend of 1.60 rupees per equity share. For the latest quarter, the company reported revenue of 11.72 billion rupees, down from 12.35 billion rupees year-over-year. EBITDA decreased to 1.71 billion rupees from 2.09 billion rupees, with EBITDA margin dropping to 14.62% from 16.91%. Net profit for the quarter stood at 1.5 billion rupees, compared to 1.61 billion rupees year-over-year and 709.6 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748021549000,
            "Source": "result"
        },
        {
            "Title": "Finolex Industries Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Finolex Industries has reported a decrease in its third-quarter EBITDA, which fell to 834.3 million rupees from 1.2 billion rupees in the same period last year. The company's EBITDA margin also declined, dropping to 8.33% from 11.76% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738862836000,
            "Source": "earnings"
        },
        {
            "Title": "Finolex Industries Reports Q3 Revenue of 10 Billion Rupees",
            "Summary": "Finolex Industries has announced its third-quarter revenue, which stands at 10 billion rupees. This figure represents a slight decrease compared to the same period last year, when the company reported revenue of 10.2 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1738862830000,
            "Source": "earnings"
        },
        {
            "Title": "Finolex Industries Reports Q3 Net Profit of 709.6 Million Rupees",
            "Summary": "Finolex Industries has announced its financial results for the third quarter. The company reported a net profit of 709.6 million rupees, which represents a decrease from 892 million rupees in the same quarter last year (YoY). However, it shows an increase from 514.4 million rupees in the previous quarter (QoQ).",
            "Sentiment": "neutral",
            "PublishDate": 1738862823000,
            "Source": "earnings"
        },
        {
            "Title": "DGTR Announces Preliminary Anti-Dumping Duties on PVC Suspension Resin",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has released preliminary findings from its anti-dumping investigations, proposing provisional duties ranging from $25 to $399 per metric ton on PVC suspension resin. This development affects Finolex Industries, a major player in the PVC market. The DGTR has invited comments from interested parties within the next 30 days.",
            "Sentiment": "neutral",
            "PublishDate": 1730775995000,
            "Source": "corporate_action"
        },
        {
            "Title": "Finolex Industries: Q2 Results Show Impact of Lower Pipe Realisation",
            "Summary": "Finolex Industries reported lower pipe realisation in Q2, affecting results. The company aims for over 15% volume growth in H2.",
            "Sentiment": "neutral",
            "PublishDate": 1729869774000,
            "Source": "result"
        },
        {
            "Title": "Finolex Industries Reports Q2 Revenue Decline",
            "Summary": "Finolex Industries has reported a revenue of 8.28 billion rupees for the second quarter, down from 8.8 billion rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1729790105000,
            "Source": "result"
        },
        {
            "Title": "Finolex Industries Reports Q2 Net Profit Decline",
            "Summary": "Finolex Industries has reported a net profit of 514.4 million rupees for the second quarter, which is a significant decrease from 938 million rupees in the same quarter last year. However, it shows an improvement from the previous quarter's 5.05 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1729790091000,
            "Source": "result"
        }
    ]
}