{
    "Symbol": "FIRSTCRY",
    "ISIN": "INE02RE01045",
    "News": [
        {
            "Title": "FirstCry schedules Q3FY26 earnings call for Feb 13",
            "Summary": "Brainbees Solutions Limited announces earnings conference call on February 13, 2026 at 6:00 PM IST to discuss Q3FY26 and nine months results ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770709198112,
            "Source": "co_actions_results"
        },
        {
            "Title": "FirstCry Allots 1.35 Lakh Shares via ESOP Exercise",
            "Summary": "Brainbees Solutions (FirstCry) allotted 27,825 equity shares and transferred 1,07,199 shares through ESOP exercise, increasing paid-up capital to Rs. 1,04,40,83,968.",
            "Sentiment": "positive",
            "PublishDate": 1770125223667,
            "Source": "co_actions_results"
        },
        {
            "Title": "FirstCry faces ₹6.57 cr customs demand over APTA duty",
            "Summary": "Brainbees Solutions (FirstCry) received customs adjudication order demanding ₹6.57 crores for alleged violations of concessional duty exemption under APTA framework. Company plans to appeal the order.",
            "Sentiment": "negative",
            "PublishDate": 1768475167080,
            "Source": "stocks"
        },
        {
            "Title": "FirstCry completes acquisition of additional stake",
            "Summary": "Brainbees Solutions Limited has completed the acquisition of additional stake in Swara Baby Products Private Limited, increasing its shareholding from 75.92% to 76.59%.",
            "Sentiment": "neutral",
            "PublishDate": 1767886156267,
            "Source": "co_actions_results"
        },
        {
            "Title": "Brainbees Solutions Increases Swara Baby Stake",
            "Summary": "Brainbees Solutions has increased its ownership in Swara Baby to 76.59% following completion of the Solis Hygiene transaction, though specific financial details remain undisclosed.",
            "Sentiment": "neutral",
            "PublishDate": 1767885951106,
            "Source": "co_actions_results"
        },
        {
            "Title": "FirstCry Restructures Hygiene Business, Appoints New CS",
            "Summary": "Brainbees Solutions completes intra-group restructuring involving Swara Baby and Solis Hygiene subsidiaries worth ₹190.78 crores, while appointing Mandar Joshi as new Company Secretary.",
            "Sentiment": "neutral",
            "PublishDate": 1766755781646,
            "Source": "co_actions_results"
        },
        {
            "Title": "FirstCry completes acquisition of KA Hygiene via subsidiary",
            "Summary": "Brainbees Solutions' subsidiary Swara Baby Products acquires 100% stake in K.A. Enterprises (Hygiene) through equity share allotment, reducing parent company's holding to 75.92%.",
            "Sentiment": "positive",
            "PublishDate": 1766650383512,
            "Source": "co_actions_results"
        },
        {
            "Title": "FirstCry Allots 21,474 Shares Under ESOP Plans",
            "Summary": "Brainbees Solutions approved allotment of 21,474 equity shares and transfer of 63,937 shares under various ESOP plans on December 24, 2025, increasing paid-up capital to ₹1,04,40,28,318.",
            "Sentiment": "neutral",
            "PublishDate": 1766592066742,
            "Source": "co_actions_results"
        },
        {
            "Title": "Brainbees Solutions Forms US Subsidiary Swara Corp",
            "Summary": "Brainbees Solutions has established a new subsidiary called Swara Corp in the United States, marking the company's expansion into the US market through this corporate structure.",
            "Sentiment": "positive",
            "PublishDate": 1765817501602,
            "Source": "stocks"
        },
        {
            "Title": "Morgan Stanley Cuts FirstCry Target Price to ₹365",
            "Summary": "Morgan Stanley maintains Overweight rating on Brainbees Solutions (FirstCry) but reduces target price from ₹417 to ₹365, reflecting revised valuation expectations for the retail company.",
            "Sentiment": "neutral",
            "PublishDate": 1765510752111,
            "Source": "stocks"
        },
        {
            "Title": "GlobalBees Increases Stake in HS Fitness to 86.49% with ₹2.40 Crores Investment",
            "Summary": "GlobalBees has increased its stake in HS Fitness from 80% to 86.49% by investing ₹2.40 crores to acquire an additional 6.49% shares. The transaction strengthens GlobalBees' control over HS Fitness through this strategic equity acquisition.",
            "Sentiment": "neutral",
            "PublishDate": 1764660869168,
            "Source": "order&deals"
        },
        {
            "Title": "FirstCry Terminates Inter-Se Agreement with Foreign Shareholders",
            "Summary": "Brainbees Solutions Limited (FirstCry) terminated its Inter-Se Agreement with five foreign shareholders including SVF Frog (Cayman) Limited and others, effective November 27, 2025. The termination occurred after the resident bloc achieved over 60% shareholding for a continuous 30-day period, allowing the company to maintain Indian ownership and control under FEMA regulations.",
            "Sentiment": "positive",
            "PublishDate": 1764211917890,
            "Source": "corporate_action"
        },
        {
            "Title": "FirstCry's Subsidiary Globalbees Increases Stake in DF Pharmacy to 80% for INR 21.56 Crores",
            "Summary": "Globalbees Brands Private Limited, a material subsidiary of Brainbees Solutions Limited (FirstCry), acquired an additional 20% stake in DF Pharmacy Limited for INR 21.56 crores, increasing its shareholding from 60% to 80%. DF Pharmacy operates in the nutraceutical and pharmaceutical products business under brands like Kozicare and Glutalight, with a turnover of INR 20.97 crores in 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1763740832385,
            "Source": "order&deals"
        },
        {
            "Title": "Brainbees Solutions (FirstCry) Reports 51% Jump in Adjusted EBITDA for Q2 FY26",
            "Summary": "Brainbees Solutions achieved consolidated PBT positive status and 51% year-on-year growth in adjusted EBITDA for Q2 FY26, driven by improvements across all business segments including India Multi-Channel, International, and Globalbees operations. The company expanded its faster delivery network from 4 to 13 cities and reduced International business losses by over half from INR 39.4 crore to INR 18.9 crore, while maintaining free cash flow positive status.",
            "Sentiment": "positive",
            "PublishDate": 1763654666598,
            "Source": "earnings"
        },
        {
            "Title": "Brainbees Solutions Maintains Early-Teens Revenue Growth Guidance for FY26 India Operations",
            "Summary": "Brainbees Solutions reaffirmed its early-teens revenue growth guidance for India Multi-Channel business in FY26 with potential upside, while planning to expand faster delivery network coverage from 20% to 50% of shipments by mid-next year. The company expects stronger H2 FY26 growth compared to H1 FY26 for India operations and aims for sustainable international growth while reducing losses.",
            "Sentiment": "positive",
            "PublishDate": 1763216748519,
            "Source": "stock"
        },
        {
            "Title": "Brainbees Solutions (FirstCry) Reports Quarterly Loss Despite Revenue Growth",
            "Summary": "Brainbees Solutions Limited reported consolidated revenue of ₹21,373.29 million for the quarter ended September 30, 2025, but posted a net loss of ₹805.43 million compared to ₹1,385.40 million loss in the same quarter last year. The company's Board approved unaudited financial results showing improved performance with reduced losses across both standalone and consolidated operations, while continuing expansion through new store setups and warehouse investments funded by IPO proceeds.",
            "Sentiment": "neutral",
            "PublishDate": 1763138484472,
            "Source": "corporate_action"
        },
        {
            "Title": "Globalbees to Acquire Additional 14.91% Stake in Fitness Equipment Company Dynamic IT Solution for INR 1.5 Crore",
            "Summary": "Globalbees Brands Private Limited, a material subsidiary of Brainbees Solutions Limited, has agreed to acquire an additional 14.91% stake in Dynamic IT Solution Private Limited for INR 1.5 Crore in cash. The acquisition will increase Globalbees' shareholding from 75% to 89.91% in Dynamic IT Solution, which operates in the fitness equipment and sports products business under the brand name 'Strauss'. Dynamic IT Solution was incorporated in 2002 and reported a turnover of INR 11.92 Crore and net worth of INR 1.53 Crore for 2024-25. The company's turnover has fluctuated over the past three years, from INR 23.29 Crore in 2022-23 to INR 27.4 Crore in 2023-24, before declining to INR 11.92 Crore in 2024-25. The transaction is expected to be completed before October 30, 2025, and is structured as an arm's length related party transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1760712438728,
            "Source": "order&deals"
        },
        {
            "Title": "FirstCry's Subsidiary Globalbees Acquires Additional 10% Stake in Plantex E-Commerce for INR 19.96 Crores",
            "Summary": "Globalbees Brands Private Limited, a material subsidiary of Brainbees Solutions Limited (FirstCry), has acquired an additional 10% stake in Plantex E-Commerce Private Limited for INR 19.96 crores in cash. The acquisition increases Globalbees' shareholding from 60% to 70% in Plantex, a step-down subsidiary engaged in kitchen and home utility products business under brands including Plantex, Impulse, and Planet. The transaction was completed pursuant to a Shareholders Agreement dated September 02, 2022. Plantex, incorporated in August 2020, reported a turnover of INR 170.85 crores and net worth of INR 69.95 crores for 2024-25, showing consistent growth from INR 52.85 crores turnover in 2022-23. The acquisition was conducted at arm's length with no additional governmental or regulatory approvals required.",
            "Sentiment": "positive",
            "PublishDate": 1758293755926,
            "Source": "order&deals"
        },
        {
            "Title": "Brainbees Solutions Increases Stake in Globalbees Brands to 51.68%",
            "Summary": "Brainbees Solutions has increased its stake in Globalbees Brands to 51.68% through a Series C3 CCPS (Compulsorily Convertible Preference Shares) allotment valued at ₹19.96 crores. This transaction gives Brainbees Solutions majority control in Globalbees Brands.",
            "Sentiment": "positive",
            "PublishDate": 1758290641421,
            "Source": "order&deals"
        },
        {
            "Title": "FirstCry's Subsidiary Globalbees Increases Stake in Healthyhey Foods to 79.60%",
            "Summary": "Globalbees Brands Private Limited, a material subsidiary of Brainbees Solutions Limited (FirstCry), has acquired an additional 19.60% partnership interest in Healthyhey Foods LLP for INR 8.90 crores in cash. The acquisition increases Globalbees' stake from 60% to 79.60% in the nutritional supplements manufacturer. Healthyhey Foods operates under brand names 'HealthyHey', 'Healthy Hey Nutrition', and 'HealthyHey Sports', manufacturing and distributing nutritional supplements and consumer products including food, personal hygiene, cosmetics, health, beauty, fashion, and lifestyle products. The company reported a turnover of INR 89.74 crores and net worth of INR 2.48 crores in 2024-25, showing significant growth from INR 22.71 crores turnover in 2023-24 and INR 18.11 crores in 2022-23. The acquisition was completed on September 12, 2025, under an Assignment cum Investment Agreement dated November 11, 2021, with partnership interests acquired from Ms. Shilpa Anushul Varma and Ms. Arushi Govind Agarwal.",
            "Sentiment": "positive",
            "PublishDate": 1757681049586,
            "Source": "order&deals"
        },
        {
            "Title": "FirstCry Invests ₹73 Crore in Globalbees, Increases Stake to 51.51%",
            "Summary": "FirstCry has invested ₹73 crore in the second tranche of Globalbees' Compulsorily Convertible Preference Shares (CCPS). Following this investment, FirstCry's stake in Globalbees has increased to 51.51%, giving it majority control of the company.",
            "Sentiment": "positive",
            "PublishDate": 1757597721868,
            "Source": "order&deals"
        },
        {
            "Title": "FirstCry Shares Jump 14% on GST Rate Cuts for Baby Care and Consumer Products",
            "Summary": "Brainbees Solutions, FirstCry's parent company, saw shares surge 14% to an intraday high of Rs 403 following government GST relief on key product categories. The GST Council reduced rates on personal baby care and beauty products from 18% to 5%, baby napkins and diapers from 12% to 5%, toys from 12% to 5%, and eliminated GST entirely on stationery items like pencils and geometry boxes. These categories represent FirstCry's main product offerings in infant, maternity and children's products. The company reported quarterly revenue of Rs 1,863 crore, up 12% year-on-year, while narrowing losses to Rs 46 crore from Rs 56.7 crore. However, EBITDA declined 32.6% to Rs 33.1 crore and margins compressed to 1.8% from 2.9%. The stock had previously delivered negative 40% returns since listing.",
            "Sentiment": "positive",
            "PublishDate": 1757061505961,
            "Source": "stock"
        },
        {
            "Title": "FirstCry Reports 25% EBITDA Growth and First-Time Positive Free Cash Flow in Q1 Results",
            "Summary": "Brainbees Solutions Limited (FirstCry) reported revenue of INR 18,626 million with 13% year-over-year growth in their quarterly results. The company achieved 25% growth in adjusted EBITDA to INR 931.3 million and became free cash flow positive at consolidated level for the first time. The India multi-channel business generated revenue of INR 12,366 million with 8% growth, while facing challenges from consumer slowdown, delivery ecosystem issues, and geopolitical tensions in North India. International business revenue grew 13% to INR 2,070 million with improved unit economics. Globalbees segment showed strong 31% revenue growth to INR 4,265 million. The company operates over 300 preschools and plans expansion to 1,000 centers. Annual unique transacting customers reached 10.8 million, growing 14% year-over-year. Management noted encouraging growth signs in July and expects early teens revenue growth for the India business in the full year.",
            "Sentiment": "positive",
            "PublishDate": 1755602590781,
            "Source": "earnings"
        },
        {
            "Title": "FirstCry's GlobalBees Subsidiary Acquires Full Ownership of Cloud Lifestyle",
            "Summary": "FirstCry's subsidiary GlobalBees has acquired complete ownership of Cloud Lifestyle Pvt Ltd. The acquisition gives GlobalBees full control over the company.",
            "Sentiment": "neutral",
            "PublishDate": 1755181725663,
            "Source": "order&deals"
        },
        {
            "Title": "Brainbees Solutions Approves Q1 FY2026 Results and ₹19.96 Crore Investment in Globalbees",
            "Summary": "Brainbees Solutions Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of ₹18,625.64 million and a net loss of ₹665.04 million for the quarter. The Board also authorized a further investment of ₹19.96 crore in material subsidiary Globalbees Brands Private Limited, funded from IPO proceeds. Additionally, the Board approved convening the 15th Annual General Meeting on September 19, 2025. Globalbees operates in consumer goods segments including beauty, home care, personal care, and nutrition, with consolidated turnover of ₹1,577.70 crore in 2024-25.",
            "Sentiment": "neutral",
            "PublishDate": 1755088795246,
            "Source": "earnings"
        },
        {
            "Title": "Brainbees Solutions Wins Income Tax Reassessment Case in Bombay High Court",
            "Summary": "Brainbees Solutions Limited successfully challenged income tax reassessment notices in the Bombay High Court. The court set aside notices for assessment years 2018-19 to 2021-22, ruling they were issued without jurisdiction. The Income Tax Department had issued these notices on October 25, 2024, seeking re-assessment under Section 147 of the Income Tax Act. The High Court disposed of the matter through four separate writ petitions, citing lack of jurisdiction and an existing judicial precedent favoring the company. The company stated there is no adverse impact on its operations from this outcome.",
            "Sentiment": "positive",
            "PublishDate": 1753197008383,
            "Source": "stock"
        },
        {
            "Title": "Brainbees Solutions: Q4 Revenue Up, Profitability Down",
            "Summary": "Brainbees Solutions reported Q4 results with revenue up 15.84% YoY to Rs 1,930 crore, but EBITDA down 51.51% to Rs 16 crore. Net loss widened to Rs 76.7 crore. India GMV for apparel and footwear at 52%. Home brands' share in India GMV rose to 55% in 2025 from 37% in 2020. International revenue grew 11% YoY but faced competitive pressure.",
            "Sentiment": "neutral",
            "PublishDate": 1748312692000,
            "Source": "earnings"
        },
        {
            "Title": "Brainbees Solutions: FirstCry Parent's Q4 Net Loss Widens, Revenue Grows 16%",
            "Summary": "Brainbees Solutions, parent of FirstCry, reported a Q4FY25 net loss of Rs 111 crore, up from Rs 43 crore YoY. Revenue increased 16% to Rs 1,930 crore. Full-year FY25 losses reduced to Rs 265 crore, with revenue up 18% to Rs 7,660 crore. Adjusted EBITDA rose 43% YoY to Rs 394 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1748265907000,
            "Source": "earnings"
        },
        {
            "Title": "Brainbees Solutions Approves Investment in GlobalBees Brands",
            "Summary": "Brainbees Solutions has approved an investment of up to 1.46 billion rupees in GlobalBees Brands. No further details about the investment or its purpose were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1748263011000,
            "Source": "default"
        },
        {
            "Title": "Brainbees Solutions Reports Decline in Q4 EBITDA and Margin",
            "Summary": "Brainbees Solutions has reported its Q4 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q4 was 158 million rupees, down from 331 million rupees in the same quarter of the previous year. The EBITDA margin also decreased to 0.82% from 1.99% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748262346000,
            "Source": "result"
        },
        {
            "Title": "BrainBees Solutions Reports Q4 Financial Results",
            "Summary": "BrainBees Solutions reported its Q4 consolidated financial results. The company's net loss increased to 767 million rupees, compared to a loss of 517 million rupees in the same quarter last year. Sequentially, the loss decreased from 78 million rupees in the previous quarter. Revenue for Q4 grew to 19.3 billion rupees from 16.7 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748262266000,
            "Source": "result"
        },
        {
            "Title": "Brainbees Solutions to Invest in Globalbees Brands and FirstCry Management",
            "Summary": "Brainbees Solutions has approved two significant investments. The company plans to infuse funds of up to 1.46 billion rupees into Globalbees Brands. Additionally, Brainbees Solutions has approved an investment of 9 million AED in FirstCry Management DWC LLC.",
            "Sentiment": "positive",
            "PublishDate": 1742947752000,
            "Source": "corporate_action"
        },
        {
            "Title": "Brainbees Solutions to Invest in Globalbees Brands and FirstCry Management",
            "Summary": "Brainbees Solutions has approved two significant investments. The company plans to infuse funds of up to 1.46 billion rupees into Globalbees Brands. Additionally, Brainbees Solutions has approved an investment of 9 million AED in FirstCry Management DWC LLC.",
            "Sentiment": "positive",
            "PublishDate": 1742918187000,
            "Source": "corporate_action"
        },
        {
            "Title": "Brainbees Solutions: Stock Surges 15% in Biggest Intraday Gain Since Listing",
            "Summary": "Brainbees Solutions, parent company of FirstCry, saw its stock surge 15.20% to ₹420.85 per share on March 6, marking its largest intraday gain since its August 2024 listing. The jump comes after recent declines, with the stock previously trading 11% below its IPO price. The company recently reported a 69.6% reduction in Q3FY25 net loss and a 14.3% increase in revenue.",
            "Sentiment": "positive",
            "PublishDate": 1741250955000,
            "Source": "normal_news"
        },
        {
            "Title": "Brainbees Solutions: Q3 Loss Narrows, Stock Surges 9%",
            "Summary": "Brainbees Solutions, parent of FirstCry, reported Q3 revenue growth of 14.3% to Rs 2,172 crore, Ebitda increase of 84.4% to Rs 108 crore, and narrowed net loss to Rs 8 crore from Rs 31.5 crore year-on-year. Stock price surged over 9% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1739166916000,
            "Source": "earnings"
        },
        {
            "Title": "Brainbees Solutions: FirstCry Parent Cuts Q3 Loss by 69%, Revenue Up 14.3%",
            "Summary": "Brainbees Solutions, FirstCry's parent company, reduced Q3 FY25 losses by 69.2% to ₹14.7 crore. Revenue increased 14.3% to ₹2,172 crore. India revenue grew 15% to ₹1,510 crore. Orders increased 13% to 11.1 million. Annual transacting customers rose 17% to 98 lakh. The company is investing ₹299.59 crore in Digital Age Retail Pvt Ltd and has closed some company-owned stores.",
            "Sentiment": "positive",
            "PublishDate": 1739082504000,
            "Source": "earnings"
        },
        {
            "Title": "BrainBees Solutions Reports Significant Growth in Q3 EBITDA",
            "Summary": "BrainBees Solutions has announced its Q3 financial results, showing substantial year-over-year improvement. The company's EBITDA increased to 1.08 billion rupees, up from 586 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 4.97% from 3.08% in the previous year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739019378000,
            "Source": "earnings"
        },
        {
            "Title": "BrainBees Solutions Reports Q3 Financial Results",
            "Summary": "BrainBees Solutions has announced its Q3 financial results. The company reported a consolidated net profit of 78 million rupees, which is a significant decrease from 1.16 billion rupees in the same quarter last year. However, the company's revenue increased to 22 billion rupees from 19 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739019373000,
            "Source": "earnings"
        },
        {
            "Title": "Brainbees Solutions: FirstCry Shares Drop Amid Lock-in Expiry Concerns",
            "Summary": "Brainbees Solutions (FirstCry) shares fell 2.3% to Rs 457.10 on BSE due to concerns over pre-IPO lock-in expiry on February 13. JM Financial maintains 'buy' rating with a reduced target price of Rs 667, implying 46% upside. The lock-in expiry will make 60% of company's share capital eligible for trading. The stock has fallen 26% over three months, with a 6.5% drop in the last week.",
            "Sentiment": "neutral",
            "PublishDate": 1737957607000,
            "Source": "normal_news"
        },
        {
            "Title": "Brainbees Solutions Ltd: Kotak Securities Initiates 'Add' Rating, Shares Surge",
            "Summary": "Brainbees Solutions Ltd shares rose over 4% after Kotak Securities initiated coverage with an 'add' rating and Rs 630 target price. The brokerage projects 17% revenue CAGR from FY24-27, driven by customer base growth and average order value. Globalbees, Brainbees' brand aggregator subsidiary, is expected to grow at 25.9% CAGR over three years.",
            "Sentiment": "positive",
            "PublishDate": 1733983135000,
            "Source": "normal_news"
        },
        {
            "Title": "BRAINBEES SOLUTIONS LTD Block Trade on NSE",
            "Summary": "A block trade of approximately 301,198 shares of BRAINBEES SOLUTIONS LTD was executed on the National Stock Exchange (NSE) at a price of Rs. 585.10 per share. The total value of the transaction amounted to Rs. 17.62 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1733817780000,
            "Source": "block_deals"
        },
        {
            "Title": "BrainBees Solutions Reports Significant EBITDA Improvement in Q2",
            "Summary": "BrainBees Solutions has reported a substantial improvement in its Q2 EBITDA, turning a loss of 56 million rupees in the previous year to a gain of 571 million rupees. The company's Q2 EBITDA margin stands at 3%.",
            "Sentiment": "positive",
            "PublishDate": 1731589114000,
            "Source": "result"
        },
        {
            "Title": "FirstCry Parent: Q2 Loss Narrows, Revenue Surges 26% YoY",
            "Summary": "Brainbees Solutions, FirstCry's parent, reported a Q2 FY2025 net loss of ₹62.85 crore, down from ₹119.4 crore YoY. Revenue rose 26.41% YoY to ₹1,904.91 crore. Sequential improvement seen with 15% QoQ revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1731587114000,
            "Source": "result"
        },
        {
            "Title": "BrainBees Solutions Subsidiary Invests in Kitchenopedia Appliances",
            "Summary": "A subsidiary of BrainBees Solutions has made an additional investment of 55.9 million rupees in Kitchenopedia Appliances, a company operating in the kitchen appliances sector.",
            "Sentiment": "positive",
            "PublishDate": 1730207193000,
            "Source": "corporate_action"
        },
        {
            "Title": "BrainBees Solutions Invests 45 Million Rupees in Dynamic IT Solution",
            "Summary": "BrainBees Solutions has made an additional investment of 45 million rupees in Dynamic IT Solution. This investment suggests a strategic move by BrainBees Solutions to strengthen its IT capabilities or expand its technological infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1729520398000,
            "Source": "corporate_action"
        }
    ]
}