{
    "Symbol": "FISCHER",
    "ISIN": "INE771F01041",
    "News": [
        {
            "Title": "Fischer Medical Ventures Promoter Pledges Shares",
            "Summary": "Promoter Shankar Varadharajan pledged 30,00,000 equity shares (4.63% stake) to HDFC Bank as collateral for ₹40 crores loan for working capital needs of wholly owned subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1770370281740,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fischer Medical Q3FY26 Results & Key Updates",
            "Summary": "Fischer Medical Ventures reported Q3FY26 results with consolidated revenue of ₹10,109.52 lakhs and net profit of ₹1,923.48 lakhs. Company announced key management changes and subsidiary restructuring.",
            "Sentiment": "positive",
            "PublishDate": 1769773881851,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fischer Medical Ventures Approves Internal Reorganisation",
            "Summary": "Fischer Medical Ventures' Executive Business Committee approved transfer of foreign subsidiary shares to wholly owned subsidiary for operational efficiency without impacting ultimate ownership or control.",
            "Sentiment": "neutral",
            "PublishDate": 1768999972632,
            "Source": "stocks"
        },
        {
            "Title": "Fischer Medical Ventures Updates Board Committee Structure",
            "Summary": "Fischer Medical Ventures Limited disclosed updated composition of key board committees including Audit, Nomination & Remuneration, and Risk Management committees with detailed member appointments.",
            "Sentiment": "neutral",
            "PublishDate": 1767330212772,
            "Source": "stocks"
        },
        {
            "Title": "Fischer Medical Ventures Reports Strong Q2 Growth with Net Profit Surge to 139M Rupees",
            "Summary": "Fischer Medical Ventures reported consolidated net profit of 139 million rupees in Q2, compared to 3 million rupees in the same period last year. The company's revenue increased to 863 million rupees from 397 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761667365976,
            "Source": "earnings"
        },
        {
            "Title": "Fischer Medical Ventures' Nanomedic Secures UK NHS Approval and CDSCO License for SpinCare Device",
            "Summary": "Fischer Medical Ventures announced that its subsidiary Nanomedic has successfully overcome a UK NHS challenge and obtained a license from CDSCO for its SpinCare device. The company has introduced plans for the India market and is targeting a US FDA filing for the medical device.",
            "Sentiment": "positive",
            "PublishDate": 1761191430466,
            "Source": "stock"
        }
    ]
}