{
    "Symbol": "FIVESTAR",
    "ISIN": "INE128S01021",
    "News": [
        {
            "Title": "Five-Star Business Finance Allots 21,870 Shares",
            "Summary": "Five-Star Business Finance Limited allotted 21,870 equity shares on February 12, 2026, under its employee stock option scheme, increasing paid-up capital to INR 29,45,66,168.",
            "Sentiment": "neutral",
            "PublishDate": 1770879744714,
            "Source": "co_actions_results"
        },
        {
            "Title": "Five-Star Business Finance Appoints New Independent Directors",
            "Summary": "Five-Star Business Finance Limited's board approved appointment of Ms. Rajeshwari Shankar as new Independent Director and re-appointment of Mr. Srinivasaraghavan Thiruvallur Thattai for second term.",
            "Sentiment": "positive",
            "PublishDate": 1769606962202,
            "Source": "stocks"
        },
        {
            "Title": "Five-Star Business Finance Reports Nil Deviation Q3FY26",
            "Summary": "Five-Star Business Finance Limited confirms no deviation in warrant proceeds utilization for Q3FY26, with no warrant conversions during the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769606324240,
            "Source": "stocks"
        },
        {
            "Title": "Five-Star Business Finance Q3FY26 Results Announced",
            "Summary": "Five-Star Business Finance Limited reported Q3FY26 financial results with profit of ₹27,702.78 lakhs and revenue from operations of ₹81,506.51 lakhs for quarter ended December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1769602812028,
            "Source": "co_actions_results"
        },
        {
            "Title": "Five-Star Business Finance Board Meet on Jan 28",
            "Summary": "Five-Star Business Finance Limited has scheduled a board meeting on January 28, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768991137140,
            "Source": "co_actions_results"
        },
        {
            "Title": "Five-Star Business Finance Allots 10,750 ESOP Shares",
            "Summary": "Five-Star Business Finance Limited allotted 10,750 equity shares on January 05, 2026, under its Employee Stock Option Scheme, increasing paid-up capital to ₹29.45 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1767596660985,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wasatch Advisors LP Reduces Stake in Five-Star Finance",
            "Summary": "Wasatch Advisors LP disposed of 63,741 shares in Five-Star Business Finance Ltd through open market transactions on December 26, 2025, reducing its shareholding from 7.26% to 7.23%.",
            "Sentiment": "neutral",
            "PublishDate": 1766998150389,
            "Source": "co_actions_results"
        },
        {
            "Title": "Five-Star Business Finance Allots 59,118 Equity Shares Under Employee Stock Option Schemes",
            "Summary": "Five-Star Business Finance Limited allotted 59,118 equity shares of INR 1.00 each on December 10, 2025, following exercise of stock options under its 2015 and 2018 employee schemes. The company's paid-up share capital increased from INR 29,44,74,430 to INR 29,45,33,548, with the newly allotted shares ranking equally with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1765343827341,
            "Source": "corporate_action"
        },
        {
            "Title": "Five-Star Business Finance Reports Stable Q2 Performance with 7% Profit Growth",
            "Summary": "Five-Star Business Finance Limited reported quarterly results showing stabilization across key metrics. The company achieved a profit of Rs. 286 crores, representing 7% growth compared to the previous quarter. Return on assets improved from 7.24% to 7.49%, while return on equity increased from 16.57% to 16.91%. Disbursements stood at Rs. 1,196 crores versus Rs. 1,290 crores in Q1, attributed to additional underwriting controls implemented during the quarter. Collection efficiency from unique customers remained stable at 95.1%, while overall collection efficiency improved from 96.3% to 96.7%. The company added 33 branches and 769 business and collection officers during Q2. Credit costs were maintained at around 1.34%, marginally higher than Q1. Five-Star availed incremental debt of Rs. 1,068 crores at 8.56% cost and onboarded J.P. Morgan for Rs. 650 crores investment in PTCs. The company launched its housing loan product with initial files being processed. Management expects better performance in Q3 and stronger results in Q4, maintaining their annual guidance of 25% AUM growth and credit costs of 1.25-1.35%.",
            "Sentiment": "positive",
            "PublishDate": 1762266750301,
            "Source": "earnings"
        },
        {
            "Title": "Five-Star Business Finance Reports Higher Q2 Profit and Revenue",
            "Summary": "Five-Star Business Finance reported net profit of Rs 2.9 billion for Q2, compared to Rs 2.7 billion in the same period last year. The company's revenue increased to Rs 8 billion from Rs 7 billion year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761721984582,
            "Source": "earnings"
        },
        {
            "Title": "Five-Star Business Finance Gets Shareholder Approval for ₹4,000 Crore NCD Issuance",
            "Summary": "Five-Star Business Finance has received shareholder approval to issue non-convertible debentures (NCDs) worth up to ₹4,000 crore through private placement. This approval enables the company to raise funds through debt instruments from select investors.",
            "Sentiment": "positive",
            "PublishDate": 1757512633949,
            "Source": "corporate_action"
        },
        {
            "Title": "Five-Star Business Finance Sees Rs. 15.98 Crore Block Trade on NSE",
            "Summary": "Five-Star Business Finance Ltd. witnessed a block trade worth Rs. 15.98 crores on the NSE. The transaction involved approximately 304,149 shares at a price of Rs. 525.30 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1757044750919,
            "Source": "order&deals"
        },
        {
            "Title": "Five-Star Business Finance Reports 28% PAT Growth to ₹1,073 Crores Despite Asset Quality Challenges",
            "Summary": "Five-Star Business Finance Limited reported a 28% increase in profit after tax to ₹1,073 crores for FY2025, crossing the four-digit mark for the first time. The company's assets under management grew 23% to ₹11,877 crores, while revenue from operations increased 31% to ₹2,866 crores. However, gross Stage 3 assets (NPAs) rose to 1.79% from 1.38% in the previous year due to industry-wide overleveraging issues. The company expanded its branch network to 748 branches across 10 states and 1 union territory. The Board recommended a final dividend of ₹2 per equity share (200% of face value). The company maintained a strong capital adequacy ratio of 50.10%, well above the regulatory minimum of 15%.",
            "Sentiment": "positive",
            "PublishDate": 1755496360310,
            "Source": "stock"
        },
        {
            "Title": "Rangarajan Krishnan Resigns as Joint MD & CEO of Five-Star Business Finance",
            "Summary": "Rangarajan Krishnan resigned from his position as Joint Managing Director & CEO of Five-Star Business Finance Limited, effective August 14, 2025. In his resignation letter dated July 28, 2025, Krishnan stated he is stepping down to pursue an entrepreneurial journey after serving the company for ten years. He confirmed there are no other material reasons for his resignation. The company has updated its authorized contact persons, with Lakshmipathy Deenadayalan as Chairman & Managing Director and Srikanth Gopalakrishnan as Joint Managing Director & CFO remaining as key contacts.",
            "Sentiment": "neutral",
            "PublishDate": 1755181187637,
            "Source": "corporate_governance"
        },
        {
            "Title": "Five-Star Business Finance Reports Muted Q1 FY26 Performance Amid Overleveraged Customer Stress",
            "Summary": "Five-Star Business Finance reported subdued quarterly results with profit after tax of INR266 crores, representing 6% year-on-year growth but 5% decline quarter-on-quarter. The company faced asset quality challenges with credit costs rising from 0.7% to 1.3%, primarily due to overleveraged customers in the below INR3 lakh loan segment. Collection efficiency dropped to 96.3% as borrowers struggled with multiple loans from microfinance and personal loan lenders. The company is shifting focus toward INR5-10 lakh ticket sizes while maintaining its sweet spot in INR3-5 lakh segment. AUM growth was muted at 5% quarter-on-quarter and 20% year-on-year, reaching INR12,500 crores. Management maintains 25% growth guidance for FY26 but revised credit cost guidance to 1.20-1.25%. CEO Rangarajan Krishnan announced his resignation effective August 14, 2025, to pursue entrepreneurial activities. The company added 200 collection officers and expects stabilization by Q2 end with improvement from the second half of FY26.",
            "Sentiment": "negative",
            "PublishDate": 1754321212701,
            "Source": "earnings"
        },
        {
            "Title": "Five-Star Business Finance Targets 25-30% AUM Growth with South India Focus and AI Credit Analytics",
            "Summary": "Five-Star Business Finance has outlined an ambitious growth strategy targeting 25-30% compound annual growth rate (CAGR) for its Assets Under Management (AUM). The company's growth plan centers on three key pillars: maintaining a strong focus on South India markets, implementing AI-powered credit analytics systems, and sustaining high asset quality standards. This strategic approach aims to drive sustainable long-term growth for the financial services company.",
            "Sentiment": "positive",
            "PublishDate": 1753712014946,
            "Source": "stock"
        },
        {
            "Title": "Five-Star Business Finance Reports 20% AUM Growth to ₹124.6bn in Q1FY26",
            "Summary": "Five-Star Business Finance Limited reported Assets Under Management (AUM) of ₹124,578 million for the quarter ended June 30, 2025, representing a 20% year-on-year growth from ₹103,439 million. The company added 19 branches during the quarter, bringing total branch count to 767. Profit After Tax stood at ₹2,663 million, up 6% year-on-year. However, asset quality showed some pressure with Gross Stage 3 assets increasing to 2.46% from 1.41% in the previous year, and 30+ Days Past Due rising to 11.31%. Collections efficiency declined to 96.3% from 97.7% in the previous quarter. Return on Equity was 16.57% and Return on Assets was 7.24%. The company maintained a strong capital adequacy ratio of 49.15% and operates through 767 branches across 11 states with 12,043 employees.",
            "Sentiment": "neutral",
            "PublishDate": 1753711524954,
            "Source": "earnings"
        },
        {
            "Title": "Five-Star Business Finance Joint MD & CEO Rangarajan Krishnan Resigns to Pursue Entrepreneurial Opportunities",
            "Summary": "Rangarajan Krishnan has resigned from his position as Joint Managing Director and Chief Executive Officer of Five-Star Business Finance Limited, effective August 14, 2025. Krishnan cited his desire to pursue an entrepreneurial journey as the reason for his departure after serving the company for 10 years. The Board has accepted his resignation and confirmed there are no other material reasons for the decision. Lakshmipathy Deenadayalan, Chairman and Managing Director, will continue overseeing the company's day-to-day operations. The Board expressed appreciation for Krishnan's decade-long service to the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1753710363649,
            "Source": "corporate_governance"
        },
        {
            "Title": "Five-Star Business Finance Reports 5.6% Growth in Q1 Net Profit to 2.66 Billion Rupees",
            "Summary": "Five-Star Business Finance reported Q1 net profit of 2.66 billion rupees compared to 2.52 billion rupees in the same period last year. Revenue increased to 7.86 billion rupees from 6.66 billion rupees year-over-year. EBITDA rose to 5.46 billion rupees from 4.97 billion rupees, though EBITDA margin declined to 69.4% from 74.69% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753709320610,
            "Source": "earnings"
        },
        {
            "Title": "Five-Star Business Finance Schedules Earnings Call for July 29, 2025",
            "Summary": "Five-Star Business Finance Limited has scheduled an earnings conference call on July 29, 2025, at 10:00 AM IST to discuss the financial and operational performance for the quarter ended June 30, 2025. The call will feature key company executives including the Chairman & Managing Director, CEO, and CFO. JM Financial Institutional Securities is hosting the call with dial-in numbers provided for various regions including India, USA, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1753179167771,
            "Source": "earnings"
        },
        {
            "Title": "Five-Star Business Finance Ltd: Block Trade of Rs. 77.80 Crores on NSE",
            "Summary": "A block trade of approximately 1,006,623 shares of Five-Star Business Finance Ltd. took place on the National Stock Exchange (NSE). The transaction was valued at Rs. 77.80 crores, with the shares trading at a price of Rs. 772.90 each.",
            "Sentiment": "neutral",
            "PublishDate": 1751949390000,
            "Source": "block_details"
        },
        {
            "Title": "Block Trade of Five-Star Business Finance Ltd. Shares on NSE",
            "Summary": "A block trade of approximately 655,295 shares of Five-Star Business Finance Ltd. occurred on the National Stock Exchange (NSE). The trade was valued at Rs. 50.13 crores, with shares priced at Rs. 765.00 each.",
            "Sentiment": "neutral",
            "PublishDate": 1751429103000,
            "Source": "block_details"
        },
        {
            "Title": "Block Trade of Five-Star Business Finance Ltd. Shares on NSE",
            "Summary": "A block trade of approximately 1,006,459 shares of Five-Star Business Finance Ltd. occurred on the National Stock Exchange (NSE). The total value of the trade was Rs. 81.41 crores, with shares trading at Rs. 808.85 each.",
            "Sentiment": "neutral",
            "PublishDate": 1749614455000,
            "Source": "block_details"
        },
        {
            "Title": "Five-star Business Finance Reports Strong Q4 Financial Results",
            "Summary": "Five-star Business Finance has announced its Q4 financial results. The company's net profit increased to 2.79 billion rupees, up from 2.36 billion rupees year-over-year and 2.74 billion rupees quarter-over-quarter. Revenue also saw growth, reaching 7.34 billion rupees compared to 5.99 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1745972730000,
            "Source": "default"
        },
        {
            "Title": "Five-Star Business Finance Reports Q4 Profit and Revenue Growth",
            "Summary": "Five-Star Business Finance announced its Q4 financial results, showing year-over-year growth in both net profit and revenue. The company's net profit increased to 2.79 billion rupees from 2.36 billion rupees in the same quarter last year, and 2.74 billion rupees in the previous quarter. Revenue rose to 7.34 billion rupees from 5.99 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1745929845000,
            "Source": "result"
        },
        {
            "Title": "Five-Star Business Finance Approves NCD Issuance of Up to 40 Billion Rupees",
            "Summary": "The board of Five-Star Business Finance has approved the issuance of Non-Convertible Debentures (NCDs) for an aggregate amount of up to 40 billion rupees. This decision was made during a recent board meeting.",
            "Sentiment": "positive",
            "PublishDate": 1742197126000,
            "Source": "corporate_action"
        },
        {
            "Title": "Five-Star Business Finance Reports Strong Q3 Financial Results",
            "Summary": "Five-Star Business Finance has announced its Q3 financial results, showing significant year-over-year growth. The company's net profit increased to 2.73 billion rupees, up from 2.16 billion rupees in the same quarter last year. This also represents a quarter-over-quarter increase from 2.67 billion rupees. Revenue for Q3 rose to 7.3 billion rupees, compared to 5.67 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738325943000,
            "Source": "earnings"
        },
        {
            "Title": "Five-Star Business Finance Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for Five-Star Business Finance Ltd. Approximately 494,425 shares were traded at a price of Rs. 737.05 per share, totaling Rs. 36.44 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1734424345000,
            "Source": "block_deals"
        },
        {
            "Title": "Five-Star Business Finance Ltd Block Trade on NSE",
            "Summary": "A block trade of approximately 1,017,464 shares of Five-Star Business Finance Ltd occurred on the National Stock Exchange (NSE) for Rs. 66.65 crores. The trade was executed at a price of Rs. 655.10 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1733987500000,
            "Source": "block_deals"
        },
        {
            "Title": "Five Star Business Finance Block Trade on NSE",
            "Summary": "A block trade of approximately 470,820 shares of Five Star Business Finance occurred on the National Stock Exchange (NSE) at a price of Rs 632 per share, totaling Rs 29.76 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1733806410000,
            "Source": "block_deals"
        },
        {
            "Title": "Five-Star Business Finance Ltd: Block Trade of Rs. 35.54 Crores on NSE",
            "Summary": "A significant block trade occurred for Five-Star Business Finance Ltd on the National Stock Exchange (NSE). Approximately 551,050 shares were traded at a price of Rs. 644.90 per share, resulting in a total transaction value of Rs. 35.54 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1733469425000,
            "Source": "block_deals"
        },
        {
            "Title": "Five-Star Business Finance Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for Five-Star Business Finance Ltd. The transaction involved approximately 1,042,659 shares, traded at a price of Rs. 661.55 per share, totaling Rs. 68.98 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1730867538000,
            "Source": "block_deals"
        },
        {
            "Title": "Five-Star Business Finance Ltd Block Trade on NSE",
            "Summary": "A block trade of approximately 1,017,641 shares of Five-Star Business Finance Ltd occurred on the National Stock Exchange (NSE) for Rs. 67.24 crores. The trade was executed at a price of Rs. 660.70 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1730865333000,
            "Source": "block_deals"
        },
        {
            "Title": "Five Star Business Finance: AUM Growth Cut Sparks Stock Plunge",
            "Summary": "Five Star Business Finance shares dropped 13.6% after lowering FY25 AUM growth guidance to 25% from 30%. The NBFC plans to reduce lending rates by 2% from November 2024, impacting future disbursements. Despite this, Q2 FY25 results showed strong growth with net income up 30% and PAT increasing 34% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730273660000,
            "Source": "result"
        },
        {
            "Title": "Five-Star Business Finance: AUM Growth Cut Sparks 11% Stock Plunge",
            "Summary": "Five-Star Business Finance shares fell 11% after management reduced AUM growth guidance from 30% to 25%. Q2 results showed 32.2% AUM growth to ₹10,927 crore. Gross NPA rose to 1.47%, Net NPA to 0.71%. Provisions doubled year-over-year. Avendus Spark and DAM Capital downgraded the stock.",
            "Sentiment": "negative",
            "PublishDate": 1730265211000,
            "Source": "result"
        },
        {
            "Title": "Five-Star Business Finance Reports Strong Q2 Revenue Growth",
            "Summary": "Five-Star Business Finance has reported a significant increase in its second-quarter revenue. The company's revenue for Q2 reached 7 billion rupees, compared to 5.2 billion rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730190241000,
            "Source": "result"
        },
        {
            "Title": "Five-Star Business Finance Reports Q2 Net Profit Increase",
            "Summary": "Five-Star Business Finance has reported a net profit of 2.7 billion rupees for the second quarter, compared to 2 billion rupees in the same period last year. This represents a year-over-year increase in profitability for the company.",
            "Sentiment": "positive",
            "PublishDate": 1730190216000,
            "Source": "result"
        }
    ]
}