{
    "Symbol": "FLAIR",
    "ISIN": "INE00Y201027",
    "News": [
        {
            "Title": "Flair Writing Industries Gets Tax Relief",
            "Summary": "Flair Writing Industries receives order dropping CGST proceedings for FY 2017-18, eliminating Rs. 29.30 lakh demand including tax and penalty with no material impact on operations.",
            "Sentiment": "positive",
            "PublishDate": 1770383837524,
            "Source": "stocks"
        },
        {
            "Title": "Flair Writing Industries schedules investor meet",
            "Summary": "Flair Writing Industries Limited will participate in Nuvama Institutional Equities India Conference on February 11, 2026, at Grand Hyatt Mumbai for one-to-one and group meetings with investors.",
            "Sentiment": "neutral",
            "PublishDate": 1770201886375,
            "Source": "stocks"
        },
        {
            "Title": "Flair Writing Industries Q3 FY26 IPO Monitoring Report",
            "Summary": "ICRA Limited reports no deviation in IPO proceeds utilization for Q3 FY26. Company utilized ₹8.171 crore during quarter, with ₹19.152 crore remaining for Valsad unit setup.",
            "Sentiment": "neutral",
            "PublishDate": 1769697490806,
            "Source": "co_actions_results"
        },
        {
            "Title": "Flair Writing Industries Q3FY26 Results & Dividend",
            "Summary": "Flair Writing Industries reported Q3FY26 consolidated revenue of ₹31,769.85 lakhs and net profit of ₹3,314.04 lakhs. Board declared interim dividend of ₹0.50 per share with February 4, 2026 record date.",
            "Sentiment": "positive",
            "PublishDate": 1769691180036,
            "Source": "co_actions_results"
        },
        {
            "Title": "Flair Writing Industries Board Meet on Jan 29",
            "Summary": "Flair Writing Industries Limited has scheduled its Board Meeting for January 29, 2026, to consider Q3FY26 unaudited financial results and interim dividend declaration for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1768914440692,
            "Source": "co_actions_results"
        },
        {
            "Title": "Flair Writing Industries Gets ESG Score of 63.9",
            "Summary": "Flair Writing Industries Limited receives an ESG score of 63.9 for 2025 from SES ESG Research Private Limited, based on FY2024-25 data and publicly available information.",
            "Sentiment": "neutral",
            "PublishDate": 1768032641008,
            "Source": "stocks"
        },
        {
            "Title": "Flair Writing Gets Relief in CGST Proceedings",
            "Summary": "Flair Writing Industries receives order dropping CGST proceedings under Section 74 for FY 2018-19, eliminating potential liability of ₹27.54 lakh including tax and penalty components.",
            "Sentiment": "positive",
            "PublishDate": 1767192004982,
            "Source": "stocks"
        },
        {
            "Title": "Flair Writing Industries Board Approves Guarantee",
            "Summary": "Flair Writing Industries' board approved a ₹20 crore corporate guarantee for step-down subsidiary Flomaxe Stationery and addressed BSE compliance delay issues.",
            "Sentiment": "neutral",
            "PublishDate": 1766144656641,
            "Source": "stocks"
        },
        {
            "Title": "Flair Writing Industries Receives Export Excellence Award for Seventh Consecutive Year",
            "Summary": "Flair Writing Industries Limited was honored with the Prestigious Export Award in the Writing Instruments category for outstanding export performance during 2023-24 and 2024-25 by The Plastics Export Promotion Council. The company has consistently received this recognition for seven consecutive years, with exports contributing 17.45% to total revenue and operations spanning over 115 countries through 68 international distributors.",
            "Sentiment": "positive",
            "PublishDate": 1763362755579,
            "Source": "stock"
        },
        {
            "Title": "Flair Writing Industries Reports Strong Q2 Performance with 18.8% Revenue Growth",
            "Summary": "Flair Writing Industries achieved quarterly revenue of INR 320.9 crores in Q2 FY26, marking 18.8% year-on-year growth, driven by exceptional performance in creative products (70% growth) and steel bottles & houseware segment (121% growth). The company's profit after tax increased 30.4% to INR 42.7 crores with improved EBITDA margins at 18.8%, while the new Valsad manufacturing facility is scheduled to commence operations in Q4 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1763043533061,
            "Source": "earnings"
        },
        {
            "Title": "Flair Writing Industries Reports No Deviation in IPO Proceeds Utilization for Q2 FY2026",
            "Summary": "Flair Writing Industries Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing proper utilization of IPO proceeds. ICRA Limited, the monitoring agency, confirmed no deviation from the stated objects of the issue. The company raised INR 273.037 crore net proceeds from its November 2023 IPO. Out of total proceeds, INR 245.714 crore has been utilized across various objectives including setting up new Valsad unit (INR 28.670 crore utilized), funding capital expenditure (fully utilized INR 86.748 crore), working capital requirements (INR 77.000 crore utilized), debt repayment (INR 43.000 crore utilized), and general corporate purposes (INR 10.296 crore utilized). The remaining INR 27.323 crore is deployed in fixed deposits with Axis Bank earning returns between 4.00% to 7.40%. The capital expenditure for the company and subsidiary was completed in Q2 FY2026, while the new Valsad unit setup remains in progress as per the original timeline of FY25-FY26.",
            "Sentiment": "positive",
            "PublishDate": 1762465382826,
            "Source": "corporate_action"
        },
        {
            "Title": "Flair Writing Industries Reports 30% Profit Growth in Q2FY26 with Strong Performance Across Segments",
            "Summary": "Flair Writing Industries Limited announced its financial results for the quarter and half year ended September 30, 2025. The company reported consolidated revenue from operations of Rs. 321 crores with a 19% year-on-year growth. Profit after tax increased by 30% year-on-year to Rs. 43 crores. EBITDA reached Rs. 60 crores with a margin of 18.8%. The Creative business achieved 70% year-on-year revenue growth reaching Rs. 70 crores. Steel Bottles Houseware business more than doubled its revenue year-on-year to Rs. 26 crores. Total own brand sales grew 20% year-on-year to Rs. 291 crores, with domestic own brand sales at Rs. 262 crores and export own brand sales at Rs. 29 crores. The company launched 36 new products during the quarter across all business segments. Managing Director Vimalchand Rathod highlighted strong domestic demand and healthy export performance. The new Valsad facility construction remains on schedule for full operations in Q4FY26.",
            "Sentiment": "positive",
            "PublishDate": 1762444438050,
            "Source": "earnings"
        },
        {
            "Title": "Flair Writing Industries Plans Volume Growth and International Expansion",
            "Summary": "Flair Writing Industries is targeting steady volume growth and brand premiumization through launches in luxury pen and stationery segments. The company is expanding its export footprint to over 45 countries while scaling its domestic distribution network. Flair aims to sustain high double-digit growth and margin expansion by focusing on automation, innovation, and cost efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1762442076231,
            "Source": "stock"
        },
        {
            "Title": "Flair Writing Reports Strong Q2 Growth with 29% Jump in Net Profit",
            "Summary": "Flair Writing delivered robust quarterly performance with consolidated net profit rising to 426 million rupees from 330 million rupees year-over-year. Revenue grew to 3.21 billion rupees compared to 2.7 billion rupees in the same period last year. EBITDA increased to 603.5 million rupees from 506 million rupees, while EBITDA margin improved marginally to 18.81% from 18.74%.",
            "Sentiment": "positive",
            "PublishDate": 1762434590654,
            "Source": "earnings"
        },
        {
            "Title": "Flair Writing Industries Schedules Earnings Call for Q2 and H1 FY26 Results",
            "Summary": "Flair Writing Industries Limited has scheduled an earnings conference call for Friday, November 7, 2025, at 11:30 AM IST to discuss its unaudited financial results for the quarter and half-year ended September 30, 2025. The call will be attended by key management including Managing Director Vimalchand Rathod, Whole Time Directors Mohit Rathod and Sumit Rathod, and Chief Financial Officer Alpesh Porwal. The company has provided international dial-in numbers for participants from various countries including the US, UK, Hong Kong, Singapore, and Germany. A transcript of the call will be made available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1761856721831,
            "Source": "earnings"
        },
        {
            "Title": "Flair Writing Industries Reports 16.8% Revenue Growth in Q1 FY26, Creative Segment Surges 77%",
            "Summary": "Flair Writing Industries delivered strong quarterly results with revenue from operations reaching INR 288.5 crores, marking a 16.8% year-on-year increase. The Creative segment emerged as the standout performer with 77% growth to INR 65 crores, driven by new product innovations and increased in-house manufacturing capacity. Own Brand sales grew 23% to INR 264 crores, while OEM sales declined 24% due to domestic pen OEM customer issues. The pens segment grew modestly at 3% to INR 202 crores, and steel bottles expanded 55% to INR 13 crores. EBITDA increased 17.9% to INR 49.5 crores with margins at 17.2%, while profit after tax grew 10.5% to INR 29 crores. The company is constructing a new 2 lakh square feet manufacturing facility in Valsad with orders placed for 60 injection molding machines. Management maintains revenue growth guidance of 15-16% CAGR over the medium term, with the Creative segment expected to continue strong performance at 45-50% growth. The company has expanded its Creative product portfolio to 223 offerings and increased in-house manufacturing from 70% to a targeted 80-85%.",
            "Sentiment": "positive",
            "PublishDate": 1754303972783,
            "Source": "earnings"
        },
        {
            "Title": "Flair Writing Industries Makes Audio Recording of Earnings Call Available",
            "Summary": "Flair Writing Industries Limited has made the audio recording of their earnings conference call available online. The call discussed the company's performance for the quarter ended June 30, 2025, and was held on July 29, 2025. The recording can be accessed through a link provided on the company's website at flairworld.in. The company notified BSE Limited and National Stock Exchange of India Limited about the availability of this recording.",
            "Sentiment": "neutral",
            "PublishDate": 1753786928459,
            "Source": "earnings"
        },
        {
            "Title": "Flair Writing Orders 50 Injection Moulding Machines for New 200,000 Sq. Ft. Valsad Facility",
            "Summary": "Flair Writing has ordered 50 injection moulding machines for its new 200,000 square feet facility in Valsad. The facility is designed to enhance operations in the pens and creative segments. Company executives state the new facility will improve collaboration in pens and creative areas while providing fresh growth opportunities. The company plans to continue strategic investments and innovation efforts to build a robust future.",
            "Sentiment": "positive",
            "PublishDate": 1753712007405,
            "Source": "stock"
        },
        {
            "Title": "Flair Writing Plans ₹90 Cr Expansion to Target 14-15% Revenue Growth and ₹100 Cr Steelware Revenue by FY27",
            "Summary": "Flair Writing has announced a ₹90 crore capital expenditure-led expansion plan aimed at strengthening its premium portfolio and entering new categories. The company is targeting a revenue compound annual growth rate of 14-15% and aims to achieve ₹100 crore in steelware revenue by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1753711007772,
            "Source": "stock"
        },
        {
            "Title": "Flair Writing Reports Growth in Q1 Financial Performance",
            "Summary": "Flair Writing reported quarterly financial results showing growth across key metrics. Net profit increased to 286 million rupees from 265 million rupees year-over-year. Revenue rose to 2.88 billion rupees compared to 2.47 billion rupees in the same period last year. EBITDA grew to 495 million rupees from 420 million rupees year-over-year. EBITDA margin improved slightly to 17.17% from 17.01% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753703607349,
            "Source": "earnings"
        },
        {
            "Title": "Flair Writing Industries Approves Board Report, Sets AGM Date and Dividend Record Date",
            "Summary": "Flair Writing Industries Limited's Board of Directors approved the Board's Report for FY 2024-25 and scheduled the 9th Annual General Meeting for August 19, 2025, to be conducted virtually. The company set August 12, 2025 as the cut-off date for e-voting eligibility and will close its register of members from August 12-19, 2025. The Board appointed M/s. KPUB & Co., Company Secretaries as Secretarial Auditors for five consecutive years from FY 2025-26 to FY 2029-30, subject to shareholder approval. For dividend distribution, the company fixed August 8, 2025 as the record date to determine member entitlement for the final dividend of Re. 1 per equity share of Rs. 5 each for the financial year ended March 31, 2025, which was previously recommended by the Board on May 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753445148674,
            "Source": "corporate_action"
        },
        {
            "Title": "Flair Writing Industries Schedules Q1 FY26 Earnings Call for July 29, 2025",
            "Summary": "Flair Writing Industries Limited has scheduled an earnings conference call on July 29, 2025, at 12:00 PM IST to discuss unaudited financial results for the quarter ended June 30, 2025. The call will feature key management representatives including Managing Director Vimalchand Rathod, Whole Time Directors Mohit Rathod and Sumit Rathod, and CFO Alpesh Porwal. International participants can join through dedicated toll-free numbers for Hong Kong, Singapore, USA, and UK. The call transcript will be made available on the company's website following the session.",
            "Sentiment": "neutral",
            "PublishDate": 1753266476048,
            "Source": "earnings"
        },
        {
            "Title": "Flair Writing Recommends Dividend of 1 Rupee per Share",
            "Summary": "Flair Writing has recommended a dividend of 1 rupee per equity share. No additional details about the time period or financial performance were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747922974000,
            "Source": "result"
        },
        {
            "Title": "Flair Writing Reports Q4 Financial Results",
            "Summary": "Flair Writing has released its Q4 financial results. The company reported an EBITDA of 468 million rupees, down from 505 million rupees year-over-year. The EBITDA margin decreased to 15.71% from 20.20% in the same period last year. Net profit for Q4 was 308 million rupees, compared to 343 million rupees year-over-year and 293 million rupees quarter-over-quarter. Revenue for Q4 increased to 2.98 billion rupees from 2.5 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1747922932000,
            "Source": "result"
        },
        {
            "Title": "Flair Writing Industries Reports Improved Q3 EBITDA and Margin",
            "Summary": "Flair Writing Industries has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased from 346 million rupees to 453 million rupees. Additionally, the EBITDA margin expanded from 15.36% to 17.12%, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738308730000,
            "Source": "earnings"
        },
        {
            "Title": "Flair Writing Reports Strong Q3 Financial Results",
            "Summary": "Flair Writing has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 293 million rupees from 192 million rupees in the same quarter last year. Revenue also saw a notable rise, reaching 2.6 billion rupees compared to 2.2 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1738308692000,
            "Source": "earnings"
        },
        {
            "Title": "Flair Writing Industries Announces Strategic Partnership with Maped",
            "Summary": "Flair Writing Industries has entered into a strategic partnership with Maped, a global stationery company. This collaboration is likely aimed at expanding Flair's market reach and potentially combining the strengths of both companies in the stationery industry.",
            "Sentiment": "positive",
            "PublishDate": 1733990482000,
            "Source": "corporate_action"
        },
        {
            "Title": "Flair Writing Q2 EBITDA Declines Year-over-Year",
            "Summary": "Flair Writing reported a decrease in Q2 EBITDA, falling to 506 million rupees from 538 million rupees in the same quarter last year. The company's EBITDA margin also contracted, dropping to 18.74% from 21% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731049981000,
            "Source": "result"
        },
        {
            "Title": "Flair Writing Reports Q2 Revenue Increase",
            "Summary": "Flair Writing has announced its Q2 revenue of 2.7 billion rupees, compared to 2.57 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731049921000,
            "Source": "result"
        },
        {
            "Title": "Flair Writing Reports Q2 Consolidated Net Profit",
            "Summary": "Flair Writing Industries has reported a consolidated net profit of 330 million rupees for the second quarter, compared to 333 million rupees in the same period last year, showing a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1731049896000,
            "Source": "result"
        },
        {
            "Title": "Flair Writing Industries: Tax Notices Received for Excess ITC Claims",
            "Summary": "<p><span class='neutral'>Flair Writing Industries Limited</span> (FWIL) received two <b>show cause notices</b> for <span class='negative'>excess input tax credit claims</span> totaling <b>₹1.86 crore</b> for FY 2020-21. The company plans to <span class='positive'>challenge the notices</span> and <span class='positive'>doesn't expect material impact</span> on financials or operations.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728385360000,
            "Source": "normal_news"
        }
    ]
}