{
    "Symbol": "FLEXITUFF",
    "ISIN": "INE060J01017",
    "News": [
        {
            "Title": "Flexituff Ventures Director Alka Sagar Resigns",
            "Summary": "Ms. Alka Sagar has resigned as Non-Executive Women Director of Flexituff Ventures International Limited effective January 29, 2026, citing pre-occupation in other assignments.",
            "Sentiment": "neutral",
            "PublishDate": 1769778924943,
            "Source": "stocks"
        },
        {
            "Title": "Flexituff Ventures Reports Rs 3,629 Crore Loss Amid Operational Crisis and Plant Disruption",
            "Summary": "Flexituff Ventures International Limited posted a net loss of Rs 3,629.31 lakhs for the half-year ended September 30, 2025, with operations disrupted at its Kashipur plant due to raw material shortages and labor strikes from unpaid wages. The company faces severe financial distress with negative equity of Rs 858.54 lakhs, current liabilities exceeding assets by Rs 15,446.80 lakhs, and over-utilization of credit facilities by Rs 7,473.63 lakhs, raising significant going concern doubts.",
            "Sentiment": "negative",
            "PublishDate": 1765278860567,
            "Source": "earnings"
        },
        {
            "Title": "Flexituff Ventures Reports Rs 1,857 Lakh Default on Bank Loans",
            "Summary": "Flexituff Ventures International Limited disclosed defaults of Rs 1,857 lakh against total outstanding bank loans of Rs 1,745 lakh for the quarter and half year ended September 30, 2025. The company's total financial indebtedness stands at Rs 26,309.08 lakh, with the disclosure submitted in PDF format due to delays in filing integrated financials.",
            "Sentiment": "negative",
            "PublishDate": 1763114795473,
            "Source": "corporate_action"
        },
        {
            "Title": "Flexituff Ventures Delays Q2 Financial Results Due to Plant Operations Disruption and Labor Strike",
            "Summary": "Flexituff Ventures International Limited announced a delay in submitting its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company cited temporary disruption in operations at its Kashipur-based plant in Uttarakhand due to non-availability of critical raw materials required for production. The raw material shortage has led to a labor strike arising from non-payment of wages and salaries to workers. Due to the labor strike at the manufacturing plant, the company is unable to access the server and financial records located at the facility. The company has requested an extension from stock exchanges for filing the financial results, which were originally due by November 14, 2025. Flexituff stated it is actively working to resolve supply chain constraints and address labor-related concerns to restore normalcy. The trading window for the company's securities will remain closed for designated persons until 48 hours after the declaration of financial results.",
            "Sentiment": "negative",
            "PublishDate": 1762876451409,
            "Source": "stock"
        },
        {
            "Title": "Flexituff Ventures Faces Production Halt and Labour Strike Due to Raw Material Shortage",
            "Summary": "Flexituff Ventures International Limited reported disruption in operations at its manufacturing plant due to non-availability of critical raw materials essential for production. The shortage has adversely impacted the company's ability to maintain regular operations. As a consequence of the production halt, the company is facing a labour strike arising from non-payment of wages and salaries to workers. Production is completely stopped at the Pepalgaon facility in Uttarakhand. The company stated it is actively working to resolve supply chain constraints and address labour-related concerns to restore normalcy. There is no physical damage at the factory, only production has been halted. The estimated impact on production and operations is currently under assessment.",
            "Sentiment": "negative",
            "PublishDate": 1762593080102,
            "Source": "stock"
        },
        {
            "Title": "Flexituff Ventures Temporarily Shuts Down Kashipur Plant Due to Raw Material Shortage",
            "Summary": "Flexituff Ventures International Limited has temporarily disrupted operations at its Kashipur plant in Uttarakhand due to non-availability of critical raw materials. The closure occurred on September 24, 2025, caused by supply chain and vendor-related challenges. The affected unit contributed ₹2,279.91 million in turnover during the last financial year, representing approximately 79% of the company's total turnover. The shutdown has resulted in temporary suspension of manufacturing activities, with downtime duration under assessment. The company is engaging with suppliers and logistics partners to address commercial issues and restore material flow to resume operations.",
            "Sentiment": "negative",
            "PublishDate": 1758721220984,
            "Source": "stock"
        },
        {
            "Title": "Flexituff Ventures Appoints Sunil Ramsinghani as Independent Director for Five-Year Term",
            "Summary": "Flexituff Ventures International Limited appointed Mr. Sunil Ramsinghani as a Non-Executive Independent Director for a five-year term starting May 28, 2025. The appointment was approved by shareholders through a postal ballot concluded on August 21, 2025. Ramsinghani holds DIN 11121244 and brings over 18 years of experience in software development, project management, and executive leadership. He has worked with multinational corporations including CDN Solutions, Webgility, Together Light Inc., and Souped Up in various roles from Software Engineer to Chief Technology Officer. The company confirmed he meets independence criteria under the Companies Act, 2013 and SEBI Listing Regulations, and is not related to any existing directors.",
            "Sentiment": "positive",
            "PublishDate": 1755873516798,
            "Source": "corporate_governance"
        },
        {
            "Title": "Flexituff Ventures Reports Loss of Rs 1,826.61 Lakhs in Q1 FY26, Faces Operational Challenges",
            "Summary": "Flexituff Ventures International Limited reported a net loss of Rs 1,826.61 lakhs for the quarter ended June 30, 2025, compared to a profit of Rs 27,468.97 lakhs in the same quarter last year. Revenue from operations declined significantly to Rs 1,111.20 lakhs from Rs 7,995.16 lakhs year-on-year. The company is facing operational and financial difficulties including labour issues, underutilization of production capacity, and defaults in statutory payments. The board approved quarterly results, scheduled the 32nd Annual General Meeting for September 30, 2025, and appointed M/s. Ritesh Gupta & Co. as Secretarial Auditor while re-appointing M/s. Mahesh C. Solanki & Co. as Statutory Auditor. The auditor expressed qualified conclusions regarding the recoverability of deferred tax assets worth Rs 5,681.75 lakhs and impairment assessment of the Kashipur cluster assets valued at Rs 23,004.33 lakhs, citing material uncertainty about the company's ability to continue as a going concern.",
            "Sentiment": "negative",
            "PublishDate": 1755184873000,
            "Source": "earnings"
        },
        {
            "Title": "Flexituff Ventures Dispatches Postal Ballot Notice to Shareholders",
            "Summary": "Flexituff Ventures International Limited dispatched a Postal Ballot Notice to shareholders via email on July 21, 2025, and published newspaper advertisements in Free Press (English) and Swadesh (Hindi) on July 22, 2025. The postal ballot is conducted under Section 110 of the Companies Act, 2013. The notice is also available on the company's website at www.flexituff.com. Company Secretary and Compliance Officer Ms. Priya Soni informed BSE and NSE about the dispatch and newspaper publication.",
            "Sentiment": "neutral",
            "PublishDate": 1753178142886,
            "Source": "corporate_action"
        },
        {
            "Title": "Flexituff Ventures Seeks Shareholder Approval for Independent Director Appointment via Postal Ballot",
            "Summary": "Flexituff Ventures International Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Sunil Ramsinghani as a Non-Executive Independent Director. The Board appointed Ramsinghani as an Additional Independent Director on May 28, 2025, for a five-year term ending May 27, 2030, based on the Nomination and Remuneration Committee's recommendation. The remote e-voting process will run from July 23, 2025, at 9:00 AM to August 21, 2025, at 5:00 PM. The appointment requires a special resolution under SEBI listing regulations. Ramsinghani is an engineering professional with over 18 years of experience in software development, project management, and executive leadership, having worked with multinational corporations. He holds no equity shares in the company and meets independence criteria under the Companies Act and SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1753158183245,
            "Source": "corporate_governance"
        }
    ]
}