{
    "Symbol": "FLUOROCHEM",
    "ISIN": "INE09N301011",
    "News": [
        {
            "Title": "Gujarat Fluorochemicals Sets Up $216 Mn Oman Plant",
            "Summary": "Gujarat Fluorochemicals subsidiary GFCL EV (SFZ) LLC signs investment agreements with Sultanate of Oman to establish a $216 million greenfield battery materials manufacturing facility at Salalah Free Zone.",
            "Sentiment": "positive",
            "PublishDate": 1770897179420,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gujarat Fluorochemicals Q3FY26 Results Announced",
            "Summary": "Gujarat Fluorochemicals reported Q3FY26 standalone revenue of Rs. 1,026 crores with net profit of Rs. 127 crores. Nine-month revenue reached Rs. 3,331 crores with profit of Rs. 507 crores.",
            "Sentiment": "positive",
            "PublishDate": 1770885195176,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gujarat Fluorochemicals Board Meet on Feb 12, 2026",
            "Summary": "Gujarat Fluorochemicals Limited has scheduled its Board meeting for February 12, 2026, to consider Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770198135857,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gujarat Fluorochemicals Block Trade Worth Rs. 32.33 Cr",
            "Summary": "Gujarat Fluorochemicals executed a significant NSE block trade valued at Rs. 32.33 crores for approximately 100,238 shares at Rs. 3225.00 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770101959137,
            "Source": "co_actions_results"
        },
        {
            "Title": "GFCL Sets Up Step-Down Subsidiary in Oman",
            "Summary": "Gujarat Fluorochemicals Limited establishes GFCL EV Advanced Materials (SFZ) LLC in Sultanate of Oman through its subsidiary GFCL EV Products Limited for chemical manufacturing operations.",
            "Sentiment": "positive",
            "PublishDate": 1768917206814,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gujarat Fluorochemicals Block Trade Worth ₹21.50 Cr",
            "Summary": "Gujarat Fluorochemicals witnessed a significant NSE block trade of ₹21.50 crores involving 64,765 shares at ₹3,319.80 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768882723121,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gujarat Fluorochemicals Block Trade Worth ₹42.18 Cr",
            "Summary": "Gujarat Fluorochemicals witnessed a significant NSE block trade worth ₹42.18 crores involving 114,869 shares at ₹3,672 per share, indicating substantial institutional activity in the chemical sector stock.",
            "Sentiment": "neutral",
            "PublishDate": 1767158574568,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gujarat Fluorochemicals Chairman Devendra Kumar Jain Passes Away",
            "Summary": "Gujarat Fluorochemicals Limited announces the demise of Chairman and Director Shri Devendra Kumar Jain on December 29, 2025. The founder promoter made significant contributions to the company's success.",
            "Sentiment": "negative",
            "PublishDate": 1767018221889,
            "Source": "stocks"
        },
        {
            "Title": "Gujarat Fluorochemicals Block Trade Worth ₹29.52 Cr",
            "Summary": "Gujarat Fluorochemicals witnessed a significant NSE block trade involving 81,234 shares valued at ₹29.52 crores, executed at ₹3,633.60 per share, indicating institutional interest in the chemical company.",
            "Sentiment": "neutral",
            "PublishDate": 1766991537641,
            "Source": "co_actions_results"
        },
        {
            "Title": "IFC Invests $50 Million in Gujarat Fluoro's Battery Materials Facility",
            "Summary": "The International Finance Corporation (IFC) has invested $50 million in Gujarat Fluoro's battery materials manufacturing facility. This represents India's first facility of its kind in the battery materials sector.",
            "Sentiment": "positive",
            "PublishDate": 1764922369363,
            "Source": "order&deals"
        },
        {
            "Title": "Gujarat Fluorochemicals Reports 26% EBITDA Growth in Q2FY26 Despite US Tariff Impact",
            "Summary": "Gujarat Fluorochemicals delivered resilient quarterly results with chemical segment revenue at Rs. 1,210 crores (up 2% YoY) and EBITDA growing 26% to Rs. 381 crores, achieving 32% margins despite US tariff uncertainties affecting fluoropolymer sales. The company expects revenue from its EV materials business to begin flowing from Q4 this financial year, with LiPF6 prices rising significantly from $10 to $17 per kg, positioning the company as a unique non-China integrated producer in the battery materials space.",
            "Sentiment": "positive",
            "PublishDate": 1763117320742,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Fluorochemicals Seeks Shareholder Approval for Two New Whole-Time Directors via Postal Ballot",
            "Summary": "Gujarat Fluorochemicals Limited has issued a postal ballot notice seeking shareholder approval for three resolutions through remote e-voting. The company proposes to appoint Mr. Niraj Kishore Agnihotri as Director and Whole-time Director with annual remuneration up to Rs. 2.55 crores, and Mr. Shesh Narayan Pandey as Director and Whole-time Director with annual remuneration up to Rs. 1.30 crores. Both appointments are for one-year terms from November 11, 2025 to November 10, 2026. The company also seeks approval for altering its Articles of Association regarding director retirement by rotation. The remote e-voting period runs from November 13, 2025 to December 12, 2025, with results to be declared by December 16, 2025. Both new appointees bring over 33 years of experience in manufacturing operations and strategic planning.",
            "Sentiment": "neutral",
            "PublishDate": 1762967282179,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gujarat Floro Projects EBITDA Margin Growth and Battery Chemicals Breakeven by FY'27",
            "Summary": "Gujarat Floro expects EBITDA margins to rise long-term and anticipates EBIT breakeven for its battery chemicals business by FY'27. The company plans to increase battery chemicals capital expenditure to INR 1,500 crores in FY'27, up from INR 1,200 crores in FY'26. Gujarat Floro had previously forecasted total capital expenditure of INR 6,000 crores over 4-5 years for battery chemicals. The company expects over 2 asset turnover with good margins in its full-scale battery materials business and anticipates significant revenue growth in battery chemicals by FY'28.",
            "Sentiment": "positive",
            "PublishDate": 1762918708120,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Fluorochemicals Reports 18% Revenue Growth to ₹4,896 Cr in H1FY26",
            "Summary": "Gujarat Fluorochemicals reported revenue of ₹4,896 crores in H1FY26, marking an 18% year-on-year increase. The company achieved EBITDA of ₹1,534 crores with a margin of 31%. The company is expanding capacity for PVDF, Li-Ion battery chemicals, and green hydrogen materials. It is focusing on exports to EV and semiconductor sectors. The company guides for strong growth in specialty chemicals and fluoropolymers, with margin expansion expected from value-added fluorine derivatives.",
            "Sentiment": "positive",
            "PublishDate": 1762874916984,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Fluorochemicals Reports Board Changes and Q2 Results",
            "Summary": "Gujarat Fluorochemicals Limited announced quarterly results for the period ended September 30, 2025, and significant board changes. The company appointed Mr. Niraj Kishore Agnihotri and Mr. Shesh Narayan Pandey as Additional and Whole-time Directors for one year, subject to shareholder approval. Mr. Sunil Kumar Singh Chauhan resigned as Whole-time Director due to personal reasons. For the quarter ended September 30, 2025, the company reported revenue from operations of Rs. 343.1 crores on standalone basis and Rs. 364.7 crores on consolidated basis. The company operates in two reportable segments: Chemicals (comprising Bulk Chemicals, Fluorochemicals & Fluoropolymers) and EV Products (Battery Chemicals and allied activities). The board meeting was held on November 11, 2025, where these results and appointments were approved.",
            "Sentiment": "neutral",
            "PublishDate": 1762865414474,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Fluorochemicals Reports 48% Jump in Q2 Net Profit to 1.79 Billion Rupees",
            "Summary": "Gujarat Fluorochemicals reported consolidated net profit of 1.79 billion rupees in Q2, up from 1.21 billion rupees in the same period last year. Revenue increased to 12.1 billion rupees from 11.88 billion rupees year-over-year. EBITDA rose to 3.64 billion rupees compared to 2.95 billion rupees previously. The company's EBITDA margin improved to 30.08% from 24.83% in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1762858932176,
            "Source": "earnings"
        },
        {
            "Title": "DGTR Recommends Continuing Anti-Dumping Duty on Chinese Fluoroelastomer Imports",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has recommended maintaining anti-dumping duties on fluoroelastomer imports from China following a review. This recommendation affects Gujarat Fluorochemicals, which operates in the fluoroelastomer market segment.",
            "Sentiment": "positive",
            "PublishDate": 1761880569602,
            "Source": "stock"
        },
        {
            "Title": "DGTR Initiates Anti-Dumping Investigation on R-125 Imports from China",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has commenced an investigation into imports of R-125, a hydrofluorocarbon (HFC) component, from China. This investigation appears to involve Gujarat Fluorochemicals, which is likely a domestic manufacturer of the product. R-125 is used in refrigeration and air conditioning applications as part of refrigerant blends.",
            "Sentiment": "neutral",
            "PublishDate": 1758769804760,
            "Source": "stock"
        },
        {
            "Title": "DGTR Imposes Anti-Dumping Duty on PTFE Imports from China and Russia",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has imposed anti-dumping duties on PTFE (polytetrafluoroethylene) imports from China and Russia. This development relates to Gujarat Fluorochemicals, which operates in the fluorochemicals sector.",
            "Sentiment": "positive",
            "PublishDate": 1758511132475,
            "Source": "stock"
        },
        {
            "Title": "Devansh Trademart LLP Sells 1.18% Stake in Gujarat Fluorochemicals for Rs 13 Lakh Shares",
            "Summary": "Devansh Trademart LLP, part of Gujarat Fluorochemicals Limited's promoter group, sold 13,00,000 equity shares representing 1.18% of the company's total issued and paid-up equity share capital through stock exchange mechanism on September 17, 2025. The transaction was conducted in the open market through stock exchanges. Following the sale, Devansh Trademart LLP's holding in Gujarat Fluorochemicals reduced from 4.83% to 3.65%. The company's total equity share capital remains Rs. 10,98,50,000 divided into 10,98,50,000 equity shares of Re. 1 each. The disclosure was made under SEBI takeover regulations, with Vivek Jain signing as the designated partner of Devansh Trademart LLP.",
            "Sentiment": "neutral",
            "PublishDate": 1758109839038,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Fluorochemicals Shares Drop 3% Following ₹500 Crore Block Deal",
            "Summary": "Gujarat Fluorochemicals shares declined as much as 3% following a large block trade involving 14 lakh shares (1.28% of total equity) worth ₹500 crore at an average price of ₹3,565 per share. Promoters had indicated plans to sell up to 13 lakh shares with a floor price of ₹3,500 per share. The promoters hold 62.58% stake as of June quarter-end, while domestic mutual funds hold 7.23%, LIC holds 3.09%, Akash Bhanshali holds 4.75%, and retail investors hold 8.47%. Shares recovered partially from session lows, trading 2% lower at ₹3,622.9.",
            "Sentiment": "negative",
            "PublishDate": 1758083545628,
            "Source": "order&deals"
        },
        {
            "Title": "Gujarat Fluorochemicals Block Trade Worth Rs. 471.81 Crores Executed on NSE",
            "Summary": "Gujarat Fluorochemicals Ltd. witnessed a block trade on the National Stock Exchange involving approximately 1,329,565 shares at a price of Rs. 3,548.60 per share. The total transaction value amounted to Rs. 471.81 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1758080925309,
            "Source": "order&deals"
        },
        {
            "Title": "Gujarat Fluorochemicals Promoters to Sell 13 Lakh Shares at ₹3,500 Floor Price",
            "Summary": "Promoters of Gujarat Fluorochemicals plan to sell 13 lakh shares with a floor price of ₹3,500 per share. The exact timeline, sale method, and expected proceeds remain undisclosed. Gujarat Fluorochemicals, part of the INOXGFL group, is a leading Indian chemicals manufacturer specializing in fluoropolymers, fluoroelastomers and refrigerants. The company serves pharmaceuticals, agrochemicals, batteries, EVs, and renewable energy sectors, exporting to over 75 countries. Shares have declined 12.6% year-to-date, closing at ₹3,690.00 on NSE with a market capitalization of ₹40,534.65 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1758040017691,
            "Source": "order&deals"
        },
        {
            "Title": "Gujarat Fluorochemicals Halts Operations at Ranjitnagar Plant Following Fatal Gas Leak",
            "Summary": "Gujarat Fluorochemicals has temporarily suspended operations at its Ranjitnagar plant due to a gas leak incident that resulted in one death. The company is conducting an investigation into the incident and has insurance coverage in place for potential losses from the operational halt.",
            "Sentiment": "negative",
            "PublishDate": 1757580835179,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Fluorochemicals Sets Record Date for Rs. 3 Final Dividend Payment",
            "Summary": "Gujarat Fluorochemicals Limited has set September 22, 2025 as the record date for determining shareholders eligible to receive a final dividend of Rs. 3 per equity share for the financial year 2024-25. The dividend represents 300% of the face value of Re. 1 per equity share. The final dividend payment is subject to shareholder approval at the company's 7th Annual General Meeting. If approved, the dividend will be paid within the stipulated time with applicable tax deductions at source.",
            "Sentiment": "positive",
            "PublishDate": 1756992494287,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Fluorochemicals Reports 70% PAT Growth in Q1 FY26, Starts R32 Production Ahead of Schedule",
            "Summary": "Gujarat Fluorochemicals Limited reported strong quarterly results with consolidated revenue rising 5% year-on-year to Rs. 1,281 crores. EBITDA grew 31% to Rs. 344 crores with margins expanding 500 basis points to 27%. Profit after tax surged 70% to Rs. 184 crores. The chemical segment showed 9% revenue growth to Rs. 1,280 crores with EBITDA up 33% to Rs. 354 crores. The company commenced commercial production of R32 refrigerant gas several quarters ahead of schedule through strategic retrofitting, targeting 20,000 metric tons capacity by year-end. Fluoropolymer business achieved highest-ever quarterly revenue with management maintaining 25% growth guidance for the segment. The company expects fluoropolymer capacities added over recent years to reach optimal utilization by end of financial year. Battery chemicals segment is positioned for growth driven by US subsidies for energy storage systems and supply chain diversification requirements. Working capital improved from 188 days to 172 days. Management expressed confidence in sustained growth across fluoropolymers, fluorochemicals, and battery materials businesses.",
            "Sentiment": "positive",
            "PublishDate": 1754986587837,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Fluro Plans ₹1,600 Crore Investment with Focus on EV Sector Expansion",
            "Summary": "Gujarat Fluro announced plans to invest ₹1,200 crore in the EV sector and ₹400 crore in other areas during the current fiscal year. The company expects 25% growth in its fluoropolymers business for FY26 and aims to achieve 20,000 metric tonnes capacity in R32 refrigerant by the end of FY26. The company anticipates meaningful revenue from battery materials starting in FY27.",
            "Sentiment": "positive",
            "PublishDate": 1754451965125,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Fluorochemicals Reports Strong Q1 Growth with Revenue Rising to 12.8B Rupees",
            "Summary": "Gujarat Fluorochemicals delivered robust Q1 performance with revenue increasing to 12.8 billion rupees from 11.8 billion rupees year-over-year. The company's consolidated net profit surged to 1.84 billion rupees compared to 1.08 billion rupees in the previous year. EBITDA grew to 3.44 billion rupees from 2.62 billion rupees, while EBITDA margin expanded to 26.85% from 22.28% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754382418706,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Fluorochemicals Schedules Q1 FY26 Results Conference Call for August 5",
            "Summary": "Gujarat Fluorochemicals Limited has scheduled a conference call with investors and analysts on August 5, 2025, at 4:00 PM to discuss the company's Q1 FY26 financial performance. The call will be hosted by B&K Securities with management representatives including Dr. Bir Kapoor, CEO and DMD, along with senior management team members. The company will submit its investor presentation on financial results for the quarter ended June 30, 2025, following a board meeting on the same day. Registration details and dial-in numbers for both domestic and international participants have been provided.",
            "Sentiment": "neutral",
            "PublishDate": 1753867234295,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Fluorochemicals Sees Rs. 25.83 Crore Block Trade on NSE",
            "Summary": "Gujarat Fluorochemicals Ltd. witnessed a block trade worth Rs. 25.83 crores on the National Stock Exchange. The transaction involved approximately 73,649 shares executed at a price of Rs. 3,507.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1753073490780,
            "Source": "order&deals"
        },
        {
            "Title": "DGTR Initiates Review of Anti-Dumping Duty on Fluoroelastomer Imports from China",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has initiated a review of the anti-dumping duty imposed on fluoroelastomer imports from China. This review affects Gujarat Fluorochemicals, a company involved in the fluorochemicals industry. The anti-dumping duty is currently in place to protect domestic manufacturers from unfair competition.",
            "Sentiment": "neutral",
            "PublishDate": 1750304080000,
            "Source": "default"
        },
        {
            "Title": "Gujarat Fluorochemicals Ltd: Q4 Results Miss Expectations, Analysts Divided",
            "Summary": "Gujarat Fluorochemicals reported Q4FY25 earnings below Street expectations. EBITDA grew due to lower base and rebound in new fluoropolymers. Management aims for 25% growth in fluoropolymer segment. Planned capex of ₹1,600 crore for FY26. Analyst opinions vary, with price targets ranging from ₹2,600 to ₹5,386.",
            "Sentiment": "neutral",
            "PublishDate": 1748402892000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Fluorochemicals Announces Capex Plans and Growth Projections",
            "Summary": "Gujarat Fluorochemicals has announced a capex of INR 1,600 crores for FY '26, with INR 1,200 crores for GFCL EV and INR 400 crores for GFL. The company plans to add HF capacity and invest in fluoropolymers. They are targeting FY 20,000 through retrofitting and capacity additions. Revenue from the EV business is expected to increase in the second half of the financial year, with continued growth in FY '27. The company aims to reach global benchmarks for its plant capacity. Commercial sale of R-32 plant products is expected to begin in the second half of the financial year. A 25% growth in fluoropolymers from current levels is anticipated. The company expects continued momentum in the fluoropolymers segment, driven by growth in semiconductors and automotive sectors. Margin and volume improvements in the specialty chemicals business are expected in FY '26.",
            "Sentiment": "positive",
            "PublishDate": 1748402774000,
            "Source": "default"
        },
        {
            "Title": "Gujarat Fluorochemicals Reports Q4 Financial Results and Dividend Declaration",
            "Summary": "Gujarat Fluorochemicals announced its Q4 financial results, showing year-over-year improvements. The company's EBITDA increased to 3.1 billion rupees from 2.38 billion rupees, with EBITDA margin rising to 24.98% from 21.01%. Revenue grew to 12.25 billion rupees from 11.33 billion rupees. Consolidated net profit rose to 1.9 billion rupees from 1.01 billion rupees. Additionally, the company declared a dividend of 3 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1748333705000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Fluorochemicals Reports Strong Export Growth",
            "Summary": "Gujarat Fluorochemicals Limited has reported significant growth in its export data. The company's exports have increased by 16% month-over-month and 37% year-over-year, indicating a robust performance in international markets.",
            "Sentiment": "positive",
            "PublishDate": 1741579667000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Fluorochemicals: Q3 Profit Surges 57.32% YoY to ₹126 Crore",
            "Summary": "Gujarat Fluorochemicals reported Q3 FY25 results with revenue up 15.76% YoY to ₹1148 crore and profit rising 57.32% YoY to ₹126 crore. EPS increased to ₹11.47. Despite strong yearly growth, quarterly revenue declined 3.37% while profit grew 4.13% QoQ. Operating income improved significantly YoY.",
            "Sentiment": "positive",
            "PublishDate": 1738217190000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Fluorochemicals Reports 62% Increase in Q3 Net Profit",
            "Summary": "Gujarat Fluorochemicals has announced its financial results for the third quarter, reporting a consolidated net profit of 1.3 billion rupees. This represents a significant increase of approximately 62% compared to the same period last year when the company reported a net profit of 801 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738136748000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Fluorochemicals: Fatal Gas Leak at Chemical Plant Claims Four Lives",
            "Summary": "A gas leak incident at Gujarat Fluorochemicals' CMS-1 plant in Dahej on December 28, 2024, resulted in four fatalities. The company has temporarily halted operations, initiated a root cause investigation, and announced compensation measures for affected families, including ₹30 lakh ex-gratia payment and additional support.",
            "Sentiment": "negative",
            "PublishDate": 1735527049000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gujarat Fluorochemicals Approves Multiple Strategic Investments",
            "Summary": "Gujarat Fluorochemicals has approved several significant financial decisions. The company will execute a slump sale of its power undertaking for 2 billion rupees. Additionally, it plans to invest 400 million rupees in Igrel Mahidad and 2 billion rupees for a 26% stake in Flurry Wind Energy.",
            "Sentiment": "positive",
            "PublishDate": 1735259136000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Fluorochemicals Approves Investment in Flurry Wind Energy",
            "Summary": "Gujarat Fluorochemicals has approved an investment of 2 billion rupees to acquire a 26% stake in Flurry Wind Energy. This strategic move indicates the company's expansion into the renewable energy sector, particularly wind energy.",
            "Sentiment": "positive",
            "PublishDate": 1735210038000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Fluorochemicals Approves Slump Sale and Investment",
            "Summary": "Gujarat Fluorochemicals has approved two significant financial decisions. Firstly, the company has agreed to a slump sale of its power undertaking for 2 billion rupees. Secondly, it has approved an investment of 400 million rupees in IGREL Mahidad.",
            "Sentiment": "positive",
            "PublishDate": 1735210024000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Fluorochemicals Anticipates Profitability Boost from Battery Chemicals and Capex Plans",
            "Summary": "Gujarat Fluorochemicals expects improved profitability driven by operating leverage, particularly in its battery chemicals vertical and fluoropolymers segment. The company has outlined significant capital expenditure plans, aiming to complete INR5,000 crores by FY27 and INR6,000 crores by FY28.",
            "Sentiment": "positive",
            "PublishDate": 1730257430000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Fluorochemicals Reports Muted Specialty Chemicals Performance",
            "Summary": "Gujarat Fluorochemicals stated in an investor presentation that their specialty chemicals segment remained subdued during the recent quarter. However, the company anticipates improvements in both margins and volumes starting from the fourth quarter of fiscal year 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1730192488000,
            "Source": "normal_news"
        },
        {
            "Title": "Gujarat Fluorochemicals Reports Strong Q2 Financial Performance",
            "Summary": "Gujarat Fluorochemicals has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 2.95 billion rupees from 1.64 billion rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 24.83% from 17.32% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1730191497000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Fluorochemicals Reports Q2 Revenue Growth",
            "Summary": "Gujarat Fluorochemicals has announced its Q2 revenue, which stands at 11.9 billion rupees, compared to 9.47 billion rupees in the same quarter last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730191372000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Fluorochemicals Reports Significant Profit Growth in Q2",
            "Summary": "Gujarat Fluorochemicals has reported a consolidated net profit of 1.2 billion rupees for the second quarter, compared to 527 million rupees in the same period last year. This represents a substantial year-over-year increase in profitability for the company.",
            "Sentiment": "positive",
            "PublishDate": 1730191349000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Fluorochemicals: EV Battery Subsidiary Raises Rs 1,000 Crore",
            "Summary": "GFCL EV Products Ltd., a subsidiary of Gujarat Fluorochemicals Ltd., has raised Rs 1,000 crore from investors to expand its EV battery chemicals business. The fundraise values the unit at Rs 25,000 crore. Funds will be used for capex to scale up operations in the EV and energy storage systems space. The company expects to start commercial sales by the March quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729652537000,
            "Source": "normal_news"
        },
        {
            "Title": "Gujarat Fluorochemicals Announces Capex Plans for EV and Energy Storage Expansion",
            "Summary": "Gujarat Fluorochemicals has announced plans to utilize funds for capital expenditure requirements. The company aims to scale up its operations to capitalize on global opportunities in the electric vehicles (EV) and energy storage systems (ESS) sectors.",
            "Sentiment": "positive",
            "PublishDate": 1729649482000,
            "Source": "corporate_action"
        },
        {
            "Title": "GFCL EV Raises ₹1,000 Crore at ₹25,000 Crore Valuation",
            "Summary": "GFCL EV, a unit of Gujarat Fluorochemicals, has successfully raised ₹1,000 crore (approximately $120 million) in funding. This fundraising values the electric vehicle (EV) unit at ₹25,000 crore (about $3 billion), indicating significant investor interest in the company's EV initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1729649363000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Fluorochemicals: Customs Duty Demand of ₹304.7 Crore Issued",
            "Summary": "Gujarat Fluorochemicals received a customs duty demand of ₹304.7 crore plus penalties from Mumbai Customs. The dispute relates to IGST exemptions on imported raw materials. GFL plans to appeal, citing a Supreme Court judgment allowing Input Tax Credit for such payments.",
            "Sentiment": "neutral",
            "PublishDate": 1729141850000,
            "Source": "normal_news"
        }
    ]
}