{
    "Symbol": "FMGOETZE",
    "ISIN": "INE529A01010",
    "News": [
        {
            "Title": "Federal-Mogul Goetze Q3FY26 Results Show Mixed Performance",
            "Summary": "Federal-Mogul Goetze reports Q3FY26 revenue of ₹48,647.98 lakhs, up 14.3% YoY, but net profit drops to ₹2,778.41 lakhs due to ₹1,488.04 lakhs exceptional charge for new labour codes.",
            "Sentiment": "neutral",
            "PublishDate": 1770735354276,
            "Source": "co_actions_results"
        },
        {
            "Title": "Federal-Mogul Goetze Board Meet on Feb 10, 2026",
            "Summary": "Federal-Mogul Goetze (India) Limited has scheduled its board meeting for February 10, 2026, to approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769695363205,
            "Source": "co_actions_results"
        },
        {
            "Title": "Federal-Mogul Goetze Appoints Varun Dua as Director",
            "Summary": "Federal-Mogul Goetze (India) Limited's board approved the appointment of Mr. Varun Dua as Additional Director (Non-Executive Non-Independent) effective January 12, 2026, subject to obtaining Director Identification Number.",
            "Sentiment": "neutral",
            "PublishDate": 1767848013773,
            "Source": "stocks"
        },
        {
            "Title": "Federal-Mogul Goetze Director Vishal Khairari Resigns",
            "Summary": "Federal-Mogul Goetze (India) Limited announces resignation of Director Mr. Vishal Khairari effective December 29, 2025, citing personal reasons for his departure from the board.",
            "Sentiment": "neutral",
            "PublishDate": 1767020616197,
            "Source": "stocks"
        },
        {
            "Title": "Federal-Mogul Goetze India Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "Federal-Mogul Goetze India Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025, showing standalone total income of Rs. 48,128.06 lacs and net profit after tax of Rs. 5,141.98 lacs for the quarter. The results were approved by the Board of Directors on November 11, 2025, with earnings per share of Rs. 9.24 for the quarter, affecting shareholders and investors tracking the company's performance.",
            "Sentiment": "neutral",
            "PublishDate": 1763057496636,
            "Source": "earnings"
        },
        {
            "Title": "Federal-Mogul Goetze Reports Strong Q2 Performance with 29% Jump in Net Profit",
            "Summary": "Federal-Mogul Goetze delivered robust quarterly results with consolidated net profit rising to 492 million rupees from 382 million rupees year-over-year. Revenue increased to 4.9 billion rupees compared to 4.6 billion rupees in the same period last year. The company's EBITDA grew to 816 million rupees from 691 million rupees, while EBITDA margin expanded to 16.64% from 14.9% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1762874048211,
            "Source": "earnings"
        },
        {
            "Title": "Federal-Mogul Goetze India Appoints New Leadership Team with Five Key Appointments",
            "Summary": "Federal-Mogul Goetze (India) Limited announced significant leadership changes effective August 11, 2025. The company appointed three Additional Directors: Jason Wesley Johnson (53), Vishal Khairari (50), and Rishi Verma (45), all as Non-Executive Non-Independent Directors. Amit Mittal (58) was appointed as Managing Director and Chief Financial Officer for a 3-year term, bringing over 34 years of experience including 21 years in CFO positions. Gangasagar Neminath Hemade (53) was named Chief Executive Officer, with 31 years of experience including over 30 years in the automotive industry. Simultaneously, T. Kannan resigned as Managing Director and Manish Chadha resigned as Chief Financial Officer and Finance Director. All new appointees have extensive experience with Tenneco and related automotive industry operations. The board confirmed continued compliance with regulatory requirements despite the leadership transitions.",
            "Sentiment": "neutral",
            "PublishDate": 1754922825610,
            "Source": "corporate_governance"
        },
        {
            "Title": "Federal-Mogul Goetze Reports 22% Jump in Q1 Net Profit to 432M Rupees",
            "Summary": "Federal-Mogul Goetze posted a consolidated net profit of 432 million rupees in Q1, up from 354.9 million rupees in the same period last year. Revenue increased to 4.83 billion rupees from 4.45 billion rupees year-over-year. The company's EBITDA rose to 706 million rupees compared to 628.8 million rupees previously, while EBITDA margin improved to 14.59% from 14.14%.",
            "Sentiment": "positive",
            "PublishDate": 1754914170291,
            "Source": "earnings"
        },
        {
            "Title": "Federal-mogul Goetze Reports Q4 Financial Results",
            "Summary": "Federal-mogul Goetze has announced its Q4 consolidated financial results. The company's net profit increased to 594 million rupees, compared to 403 million rupees in the same quarter last year and 289 million rupees in the previous quarter. Revenue for Q4 rose to 4.6 billion rupees from 4.3 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748477293000,
            "Source": "default"
        },
        {
            "Title": "Federal-Mogul Goetze Reports Q4 Financial Results",
            "Summary": "Federal-Mogul Goetze has announced its Q4 financial results. The company's consolidated net profit for the quarter was 594 million rupees, compared to 403 million rupees year-over-year and 289 million rupees quarter-over-quarter. Revenue for Q4 was reported at 4.6 billion rupees, up from 4.3 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748443252000,
            "Source": "result"
        },
        {
            "Title": "Federal-Mogul Goetze (India) Reports Q3 Financial Results",
            "Summary": "Federal-Mogul Goetze (India) has announced its Q3 financial results. The company's consolidated net profit increased to 289 million rupees from 245 million rupees in the same quarter last year. Revenue also saw growth, rising to 4.3 billion rupees from 4.15 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739352551000,
            "Source": "earnings"
        },
        {
            "Title": "Federal-Mogul Goetze (India) Reports Improved Q3 EBITDA and Margin",
            "Summary": "Federal-Mogul Goetze (India) has announced its Q3 financial results. The company's EBITDA increased to 551 million rupees from 476 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 12.73% from 11.47% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739352551000,
            "Source": "earnings"
        },
        {
            "Title": "Federal-Mogul Goetze Reports Improved Q2 EBITDA and Margin",
            "Summary": "Federal-Mogul Goetze has announced its Q2 financial results. The company's EBITDA increased to 691 million rupees from 626 million rupees year-over-year. Additionally, the EBITDA margin improved to 14.90% from 14.16% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731598730000,
            "Source": "result"
        },
        {
            "Title": "Federal-Mogul Goetze Reports Q2 Revenue Growth",
            "Summary": "Federal-Mogul Goetze has announced its Q2 revenue of 4.6 billion rupees, showing an increase from 4.4 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731598597000,
            "Source": "result"
        },
        {
            "Title": "Federal-Mogul Goetze Reports Q2 Profit Increase",
            "Summary": "Federal-Mogul Goetze has reported a consolidated net profit of 382 million rupees for the second quarter, showing an increase from 321 million rupees year-over-year and 354.9 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731598555000,
            "Source": "result"
        }
    ]
}