{
    "Symbol": "FMNL",
    "ISIN": "INE360L01017",
    "News": [
        {
            "Title": "Future Market Networks Q3FY26 Results Announced",
            "Summary": "Future Market Networks Limited reported Q3FY26 financial results with net profit of ₹220.63 lakhs on standalone basis and ₹180.79 lakhs on consolidated basis for quarter ended December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770724333404,
            "Source": "co_actions_results"
        },
        {
            "Title": "Future Market Networks Reports Q2 FY2026 Results with Exceptional Gains from Property Disposals",
            "Summary": "Future Market Networks Limited announced quarterly results for the period ended September 30, 2025, showing exceptional gains of INR 8,111.28 lakhs primarily from disposal of two properties taken over by lenders. The company faces ongoing legal proceedings including demand notices from Yes Bank/JC Flower for INR 18,448.96 lakhs and various disputes related to corporate guarantees and pledged assets.",
            "Sentiment": "neutral",
            "PublishDate": 1763122448930,
            "Source": "earnings"
        },
        {
            "Title": "Future Market Networks Seeks Shareholder Approval to Surrender Diamond Plaza Mall Lease Rights for ₹60 Crores",
            "Summary": "Future Market Networks Limited has initiated a postal ballot process to obtain shareholder approval for surrendering its leasehold rights to Diamond Plaza Mall in Kolkata. The company proposes to surrender the lease rights to original lessors M/s Super Diamond Enterprises for compensation of at least ₹60 crores. The mall is located at Calcutta Jessore Road, Kolkata, under a lease deed dated January 31, 2013. The e-voting period runs from October 19 to November 17, 2025, with the cut-off date set as October 10, 2025. The Board approved this proposal on October 15, 2025, following recommendations from the Audit Committee and a valuation report. The company plans to use proceeds primarily to repay secured loans from Axis Finance Limited, with remaining funds allocated for business operations and growth opportunities. The proposal requires special resolution approval as it involves disposal of substantially the whole undertaking under Section 180(1)(a) of the Companies Act, 2013.",
            "Sentiment": "neutral",
            "PublishDate": 1760768774155,
            "Source": "corporate_action"
        },
        {
            "Title": "Future Market Networks Approves Sale of Diamond Plaza Mall for INR 60 Crore",
            "Summary": "Future Market Networks Limited's board approved the surrender of leasehold rights for Diamond Plaza Mall in Kolkata to original lessors M/s Super Diamond Enterprises for a minimum consideration of INR 60 crore. The mall contributed ₹41.14 crore to company revenue, representing 45.19% of turnover during the last financial year. The transaction requires shareholder approval through special resolution under postal ballot process. The deal is expected to complete before March 31, 2026, and involves lessors who are not related to the promoter group. The disposal falls outside the company's scheme of arrangement and requires compliance with regulatory provisions.",
            "Sentiment": "neutral",
            "PublishDate": 1760531328193,
            "Source": "corporate_action"
        },
        {
            "Title": "Future Market Networks Limited's Arbitration Challenge Dismissed by Calcutta High Court",
            "Summary": "The Calcutta High Court dismissed Future Market Networks Limited's application challenging an arbitration award dated May 19, 2016. The company had contested the award on four grounds, including license fees for a 5-year lock-in period totaling Rs. 13,26,56,751, loss of interest on security deposit of Rs. 50,00,000, additional license fees of Rs. 3,95,50,500, electricity charges of Rs. 14,68,762, and water charges of Rs. 11,70,000. The court upheld the arbitrator's decision, ruling that the arbitrator correctly interpreted the contract terms and stayed within the scope of reference. The dispute arose from a licensing agreement between Future Market Networks and Laxmipat Surana, where the company terminated the agreement without providing the required 30-day notice as stipulated in the contract. Future Market Networks plans to file an appeal against this decision.",
            "Sentiment": "negative",
            "PublishDate": 1758522885660,
            "Source": "stock"
        },
        {
            "Title": "Future Market Networks Limited Approves Quarterly Results and Recommends New Statutory Auditors",
            "Summary": "Future Market Networks Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The Board recommended M/s. Bakliwal & Co., Chartered Accountants for appointment as statutory auditors for a two-year term from the 17th Annual General Meeting until the 19th Annual General Meeting. The Board also adopted the FMNL Employees Stock Option Scheme 2025 for eligible employees of the company and subsidiary companies. The 17th Annual General Meeting is scheduled for September 25, 2025, at 2:30 PM through video conferencing, where shareholders will vote on the auditor appointment and stock option scheme. M/s. Bakliwal & Co. is a partnership firm established in 2009 with eight partners and offices across Mumbai, Thane, Indore, Jaipur, Surat and Delhi, specializing in audit services across various sectors.",
            "Sentiment": "neutral",
            "PublishDate": 1755088904442,
            "Source": "corporate_action"
        },
        {
            "Title": "Future Market Networks Limited Discharged from Corporate Mortgage Obligation After Property Sale Under SARFAESI Act",
            "Summary": "Future Market Networks Limited has been discharged from its corporate mortgage obligation to Hero FinCorp Private Limited. The mortgage was related to a term loan of INR 14,000 lakhs availed by Hare Krishna Operating Lease Private Limited for R Mall property situated at Lal Bahadur Shastri Marg, Revenue Village of Mulund West. Hero FinCorp acquired and sold the property under SARFAESI Act provisions. The company is now discharged from all obligations with no further amounts payable, as confirmed in writing by the lender.",
            "Sentiment": "positive",
            "PublishDate": 1753854740983,
            "Source": "stock"
        }
    ]
}