{
    "Symbol": "FOCUS",
    "ISIN": "INE593W01028",
    "News": [
        {
            "Title": "Focus Lighting And Fixtures Wins ₹1.88 Crore LED Project Contract from Gandhinagar Municipal Corporation",
            "Summary": "Focus Lighting And Fixtures has secured a contract worth ₹1.88 crore from Gandhinagar Municipal Corporation for an LED lighting project. The contract encompasses production, supply, delivery, and installation of lighting fixtures.",
            "Sentiment": "positive",
            "PublishDate": 1760001816242,
            "Source": "stock"
        },
        {
            "Title": "Focus Lighting and Fixtures Reports 76% Drop in Q1 Net Profit",
            "Summary": "Focus Lighting and Fixtures reported a consolidated net profit of 22 million rupees in Q1, down from 91 million rupees in the same period last year. Revenue declined to 414 million rupees from 550 million rupees year-over-year. EBITDA fell to 43 million rupees compared to 117 million rupees previously, while EBITDA margin compressed to 10.35% from 21.33%.",
            "Sentiment": "negative",
            "PublishDate": 1754406724414,
            "Source": "earnings"
        },
        {
            "Title": "Focus Lighting And Fixtures Denies Panasonic Acquisition Rumors",
            "Summary": "Focus Lighting And Fixtures has denied reports regarding Panasonic purchasing a controlling share in the company. The company has officially refuted these acquisition talks.",
            "Sentiment": "neutral",
            "PublishDate": 1753797329115,
            "Source": "stock"
        },
        {
            "Title": "Focus Lighting & Fixtures Secures ₹10.5 Crore Order from L&T",
            "Summary": "Focus Lighting & Fixtures has won an order worth ₹10.5 crore (including 18% GST) from Larsen & Toubro (L&T) for LED lighting solutions. This order represents a significant business opportunity for Focus Lighting & Fixtures in the LED lighting sector.",
            "Sentiment": "positive",
            "PublishDate": 1747311876000,
            "Source": "default"
        },
        {
            "Title": "Focus Lighting & Fixtures Empanelled by Gujarat Government",
            "Summary": "Focus Lighting & Fixtures has been empanelled by the Electrical Wing of the Roads & Buildings (R&B) Department, Government of Gujarat, for the financial year 2025-26. This empanelment is under the Schedule of Rates (S.O.R.) review for public sector lighting.",
            "Sentiment": "positive",
            "PublishDate": 1745504860000,
            "Source": "default"
        },
        {
            "Title": "Focus Lighting and Fixtures Subsidiary Secures ₹2.1 Crore Order",
            "Summary": "A subsidiary of Focus Lighting and Fixtures has received an order worth ₹2.1 crore (21 million rupees). This new order represents a positive development for the company's business operations.",
            "Sentiment": "positive",
            "PublishDate": 1745473221000,
            "Source": "default"
        }
    ]
}