{
    "Symbol": "FOODSIN",
    "ISIN": "INE976E01023",
    "News": [
        {
            "Title": "Foods & Inns Allots 1.11 Lakh Shares Under ESOP",
            "Summary": "Foods & Inns Limited allotted 1,11,659 equity shares to employees under ESOP 2021 at Rs. 54 per share, increasing paid-up capital to Rs. 7.35 crore with 7,35,26,283 total equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1770913193338,
            "Source": "co_actions_results"
        },
        {
            "Title": "Foods & Inns schedules Q3FY26 earnings call",
            "Summary": "Foods & Inns Limited has scheduled a conference call with analysts and investors on February 13, 2026 at 4:30 PM IST to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770719752550,
            "Source": "co_actions_results"
        },
        {
            "Title": "Western Press Private Limited Pledges Additional Shares in Foods and Inns Limited",
            "Summary": "Western Press Private Limited pledged 100,000 shares of Foods and Inns Limited to Tata Capital Limited on November 24, 2025, increasing their total pledged shareholding from 4.50% to 4.63%. The pledge was created as part of encumbrance arrangements, with the disclosure made to stock exchanges BSE and NSE under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764305719081,
            "Source": "corporate_action"
        },
        {
            "Title": "Foods and Inns Ltd Promoter Pledges Shares Worth Rs 4.2 Crore to Tata Capital",
            "Summary": "Mrs. Rekha Dalal, promoter of Foods and Inns Ltd, pledged 3,39,000 shares (0.47% stake) to Tata Capital Limited for loan purposes in two separate transactions on November 18-19, 2025. The pledging involves shares from her total holding of 22,61,500 shares (3.09% of company's share capital) and was disclosed under SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763720250925,
            "Source": "corporate_action"
        },
        {
            "Title": "Foods and Inns Reports 25.7% Volume Growth in Q2 FY26 Despite EBITDA Decline",
            "Summary": "Foods and Inns Limited achieved 25.7% year-on-year volume growth in Q2 FY26 but faced a 2.1% EBITDA decline due to INR 5 crore forex losses and higher operational expenses from increased in-house production capacity. The company secured significant tomato paste orders worth INR 75-90 crores and expects strong export demand as Indian mango pulp becomes price competitive against Mexico, targeting 20% annual volume growth.",
            "Sentiment": "neutral",
            "PublishDate": 1763716272722,
            "Source": "earnings"
        },
        {
            "Title": "Foods and Inns Reports Mixed Q2 FY26 Results with Strong Volume Growth Offset by Forex Losses",
            "Summary": "Foods and Inns achieved 26% growth in sales tonnage and 14% increase in total income to Rs 195 crore for Q2 FY26, driven by 39% surge in export volumes and healthy domestic sales expansion. The company's profit after tax declined 94% year-on-year to Rs 1 crore due to an Rs 85.46 crore mark-to-market forex loss from currency fluctuations, while EBITDA margin compressed to 10.4% from 15.2% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1763118631868,
            "Source": "earnings"
        },
        {
            "Title": "Foods and Inns Limited Schedules Q2 FY26 Earnings Conference Call",
            "Summary": "Foods and Inns Limited has scheduled a conference call with analysts and investors on Friday, November 14, 2025 at 3:30 P.M. IST to discuss financial results for the second quarter ended September 30, 2025. The call will be represented by Managing Director Milan Dalal, Chief Executive Officer Moloy Saha, and Chief Financial Officer Anand Krishnan. Arihant Capital Markets Ltd is facilitating the earnings call.",
            "Sentiment": "neutral",
            "PublishDate": 1762893860416,
            "Source": "earnings"
        },
        {
            "Title": "Foods and Inns Limited Makes Q1 FY2026 Earnings Call Recording Available",
            "Summary": "Foods and Inns Limited held an earnings conference call on August 18, 2025 to discuss their unaudited financial results for the first quarter ended June 30, 2025. The company has made the audio recording of this earnings call available on their website. The company trades on NSE under the symbol FOODSIN and on BSE under code 507552. Ameya Masurkar serves as the Company Secretary & Compliance Officer.",
            "Sentiment": "neutral",
            "PublishDate": 1755624826891,
            "Source": "earnings"
        },
        {
            "Title": "Foods and Inns Limited Sets Book Closure Dates for 53rd AGM and Dividend Distribution",
            "Summary": "Foods and Inns Limited announced that its 53rd Annual General Meeting will be held on September 23, 2025 at 4:30 PM. The company's Register of Members and Share Transfer Books will remain closed from September 16 to September 23, 2025 for the AGM and dividend distribution purposes. The record date for dividend distribution has been set as September 15, 2025. The company trades on BSE under scrip code 507552 and on NSE under symbol FOODSIN, with equity shares having a paid-up value of Re. 1.",
            "Sentiment": "neutral",
            "PublishDate": 1755516971654,
            "Source": "corporate_action"
        },
        {
            "Title": "Foods and Inns Reports Mixed Q1FY26 Results with Revenue Decline but Margin Improvement",
            "Summary": "Foods and Inns Limited reported quarterly results showing total income declined 5% to Rs 239 crore compared to Rs 251 crore in the previous year. Revenue from operations fell to Rs 236 crore from Rs 247 crore. However, gross margin improved to 39.0% from 37.6%, while EBITDA margin decreased to 11.5% from 12.1%. The company's mango procurement volumes increased 20% year-on-year with lower raw material prices for Totapuri mangoes. Domestic sales grew 12% with positive momentum continuing into July and August 2025. The frozen food segment saw volumes rise 50% year-on-year, and the company regained a previously lost client with deliveries starting in the second half. The spray drying division operates at full capacity with plans for mid-size plant expansion. Sales tonnage increased 10% to 29,964 MT from 27,154 MT.",
            "Sentiment": "neutral",
            "PublishDate": 1755507073249,
            "Source": "earnings"
        },
        {
            "Title": "Foods & Inns Reports Q1 FY26 Results, Schedules 53rd AGM for September 23, 2025",
            "Summary": "Foods & Inns Limited held a board meeting on August 13, 2025, approving unaudited financial results for Q1 FY26. The company reported revenue from operations of Rs 231.58 crores compared to Rs 241.05 crores in Q1 FY25, representing a 4% decline. Net profit after tax stood at Rs 7.63 crores versus Rs 7.31 crores in the previous year quarter. Sales tonnage increased 10.3% to 29,964 MT, with domestic sales growing 12.4% while exports declined 0.4%. The board scheduled the 53rd Annual General Meeting for September 23, 2025, via video conferencing at 4:30 PM, with e-voting cut-off date set for September 15, 2025. The company appointed M/s. Ragini Chokshi & Co. as Secretarial Auditor for five consecutive years, subject to shareholder approval. Business segments showed mixed performance: frozen food volumes surged 50% year-on-year, spray dried powders operated at full capacity with expansion plans, and the company received initial export orders to Russia for Tetra Recart products.",
            "Sentiment": "neutral",
            "PublishDate": 1755100843964,
            "Source": "earnings"
        },
        {
            "Title": "Foods & Inns Reports Q3 Financial Results",
            "Summary": "Foods & Inns has announced its Q3 financial results. The company's net profit for the quarter stands at 10 million rupees, showing a decrease from 37 million rupees year-over-year, but an improvement from 117 million rupees quarter-over-quarter. The company's revenue for Q3 is reported at 1.85 billion rupees, up from 1.44 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738681206000,
            "Source": "earnings"
        },
        {
            "Title": "Foods & Inns Reports Q2 Revenue Decline",
            "Summary": "Foods & Inns, an Indian company, has reported a revenue of 1.64 billion rupees for the second quarter, down from 2.3 billion rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1730302978000,
            "Source": "result"
        }
    ]
}