{
    "Symbol": "FORCEMOT",
    "ISIN": "INE451A01017",
    "News": [
        {
            "Title": "Force Motors receives SEBI inquiry on Q1 FY26 results",
            "Summary": "Force Motors Limited disclosed receiving communication from SEBI's Investigation Department seeking information about quarterly financial results submitted on July 23, 2025, with no penalties imposed.",
            "Sentiment": "neutral",
            "PublishDate": 1770287336554,
            "Source": "stocks"
        },
        {
            "Title": "Force Motors Plans Full Acquisition of Veera Tanneries",
            "Summary": "Force Motors announces strategic plan to complete full acquisition of Veera Tanneries by March 31, 2026, marking significant expansion move for the automotive manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1770218531400,
            "Source": "co_actions_results"
        },
        {
            "Title": "Force Motors Q3 Net Profit Surges 273% to ₹4.1B",
            "Summary": "Force Motors reports consolidated net profit of ₹4.1 billion in Q3, marking a significant 273% increase from ₹1.1 billion in the same quarter last year, while revenue grew 13% to ₹21.3 billion.",
            "Sentiment": "positive",
            "PublishDate": 1770215128745,
            "Source": "co_actions_results"
        },
        {
            "Title": "Force Motors Reports 4.6% Sales Growth in January",
            "Summary": "Force Motors achieved total sales of 3,764 units in January, marking a 4.6% year-on-year increase from 3,597 units in the corresponding period last year.",
            "Sentiment": "positive",
            "PublishDate": 1770019274903,
            "Source": "stocks"
        },
        {
            "Title": "Force Motors Appoints Lt. Gen. Khandare as Director",
            "Summary": "Force Motors Limited has appointed Lt. Gen. Vinod Gulabrao Khandare (Retd.) as Independent Director effective January 29, 2026, for a five-year term subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1769702161805,
            "Source": "stocks"
        },
        {
            "Title": "Force Motors December sales surge 50%, stock up 5%",
            "Summary": "Force Motors reported 50% jump in December sales to 3,048 units, driving stock up 5% to ₹21,916. Company delivered 216% returns in 2025 with strong Q2 performance showing doubled net profit.",
            "Sentiment": "positive",
            "PublishDate": 1767327729412,
            "Source": "co_actions_results"
        },
        {
            "Title": "Force Motors December Sales Jump 49.7% YoY to 3,048 Units",
            "Summary": "Force Motors reported strong December sales growth with 3,048 units sold compared to 2,036 units in the same period last year, marking a significant 49.7% year-on-year increase in vehicle deliveries.",
            "Sentiment": "positive",
            "PublishDate": 1767262031886,
            "Source": "stocks"
        },
        {
            "Title": "Force Motors Appoints Two Independent Directors",
            "Summary": "Force Motors Limited announces appointment of Gautam Hemant Bambawale and Nitin Nandkishor Kareer as Independent Directors for 5-year terms, effective December 19, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766147000552,
            "Source": "stocks"
        },
        {
            "Title": "Force Motors Reports 53% Jump in November Sales to 2,883 Units",
            "Summary": "Force Motors recorded total sales of 2,883 units in November compared to 1,885 units in the same month last year, marking a year-on-year growth. The sales increase demonstrates improved performance for the commercial vehicle manufacturer during the month.",
            "Sentiment": "positive",
            "PublishDate": 1764633514895,
            "Source": "stock"
        },
        {
            "Title": "Force Motors Allocates Rs 2,000 Crore for Global Expansion and Product Enhancement",
            "Summary": "Force Motors has earmarked Rs 2,000 crore capex over three years to expand internationally beyond its current 20 markets, enhance production facilities, and develop electric vehicles while maintaining its 70% market share in the Traveller segment. The debt-free automaker reported record quarterly profit of Rs 350 crore and aims for exports to contribute 20-30% of volumes, focusing on shared mobility solutions rather than expanding into passenger vehicles.",
            "Sentiment": "positive",
            "PublishDate": 1763274133814,
            "Source": "stock"
        },
        {
            "Title": "Force Motors Shares Investor Presentation on Q2 & H1 FY26 Financial Results",
            "Summary": "Force Motors Limited disclosed its investor presentation covering unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The presentation highlights the company's vehicle business including Traveller, Urbania, and Gurkha models, along with its high-tech aggregate business and manufacturing operations across multiple facilities.",
            "Sentiment": "positive",
            "PublishDate": 1763139703131,
            "Source": "stock"
        },
        {
            "Title": "Force Motors Reports Higher Q2 EBITDA and Margin Growth",
            "Summary": "Force Motors reported Q2 EBITDA of 3.6 billion rupees compared to 2.82 billion rupees in the same period last year. The company's EBITDA margin improved to 17.43% from 14.56% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762522637333,
            "Source": "earnings"
        },
        {
            "Title": "Force Motors Reports Strong Quarterly Performance with Net Profit Surge",
            "Summary": "Force Motors reported consolidated net profit of 3.5 billion rupees for the quarter, significantly higher than 1.35 billion rupees in the same period last year. The company's revenue increased to 20.8 billion rupees compared to 19.4 billion rupees year-over-year. The results show substantial growth in both profitability and revenue metrics.",
            "Sentiment": "positive",
            "PublishDate": 1762522247199,
            "Source": "earnings"
        },
        {
            "Title": "Force Motors October Sales Rise 32% to 2,835 Units",
            "Summary": "Force Motors reported October sales of 2,835 units, representing an increase from 2,146 units sold in the same month last year. This marks a year-over-year growth in monthly vehicle sales for the automotive manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1762267184685,
            "Source": "stock"
        },
        {
            "Title": "Force Motors September Sales Rise 1.8% to 2,610 Units",
            "Summary": "Force Motors reported September sales of 2,610 units, marking a 1.79% increase from 2,564 units in the same period last year. Domestic sales grew 1.5% to 2,486 units while exports improved 7.8% to 124 units from 115 units. The company showed strong quarterly performance with net profit surging 52.3% to ₹176.3 crore and revenue climbing 21.9% to ₹2,297 crore. EBITDA jumped 33.3% to ₹332 crore with margin improving to 14.4% from 13.2%. The automobile industry experienced strong momentum during September due to the festive season and GST reforms impact.",
            "Sentiment": "positive",
            "PublishDate": 1759652801880,
            "Source": "stock"
        },
        {
            "Title": "BNP Paribas Sells Rs 122 Crore Worth of Force Motors Shares in Bulk Deal",
            "Summary": "BNP Paribas sold 65,610 equity shares of Force Motors worth Rs 122 crore through a bulk deal at Rs 18,581.1 per share, representing a 2% discount to the previous day's closing price of Rs 18,952.10. Force Motors shares declined 2% to close at Rs 18,555.55. The smallcap company has a market capitalization of Rs 24,183.26 crore and has delivered 167% returns over the past year. Force Motors reported consolidated net profit of Rs 176 crore for the quarter ended June 30, 2025, up 52% from Rs 116 crore in the same period last year. Total revenues increased 22% to Rs 2,322 crore from Rs 1,900 crore. The company is an integrated automobile manufacturer with five manufacturing units across India and over 300 sales and service touchpoints, exporting to multiple international markets.",
            "Sentiment": "neutral",
            "PublishDate": 1758297978808,
            "Source": "order&deals"
        },
        {
            "Title": "Force Motors Reports 4.5% Growth in August Sales to 2,403 Units",
            "Summary": "Force Motors sold 2,403 units in August, representing an increase from 2,299 units in the same month of the previous year. This marks a year-over-year growth in the company's monthly sales performance.",
            "Sentiment": "positive",
            "PublishDate": 1756907678811,
            "Source": "stock"
        },
        {
            "Title": "FIIs Increase Stakes in Seven Multibagger Smallcap Stocks Delivering Up to 157% Returns",
            "Summary": "Foreign institutional investors have increased their stakes in seven smallcap stocks that delivered multibagger returns in 2025. Force Motors led with 157% returns as FII stake rose from 8.36% to 9.77%, followed by SML Isuzu with 147% gains and FII ownership increasing from 15.24% to 15.73%. Other stocks seeing FII accumulation include Mangalore Chemicals (stake up from 2.12% to 3.09%), Camlin Fine Sciences (1.47% to 2.88%), Gabriel India (5.23% to 5.97%), Suven Life Sciences (0.25% to 0.58%), and Axiscades Technologies (0.69% to 1.62%). All seven stocks achieved perfect momentum scores of 5/5 according to Share.Market analysis. Market analysts view rising FII stakes as signals of institutional confidence and improving fundamentals, though they caution that FII data reflects quarterly reporting and should be combined with other fundamental analysis factors.",
            "Sentiment": "positive",
            "PublishDate": 1754886781771,
            "Source": "stock"
        },
        {
            "Title": "Force Motors Reports 11.44% Growth in Total Sales for July 2025",
            "Summary": "Force Motors Limited reported total sales of 2,755 units in July 2025, marking an 11.44% increase from 2,472 units in July 2024. Domestic sales across small commercial vehicles, light commercial vehicles, utility vehicles, and sports utility vehicles reached 2,700 units, up 10.61% from 2,441 units in the previous year. Export sales showed strong growth of 77.41%, rising to 55 units from 31 units in July 2024.",
            "Sentiment": "positive",
            "PublishDate": 1754397084716,
            "Source": "stock"
        },
        {
            "Title": "Force Motors Shares Surge 1,868% Over Five Years, Transforming ₹1 Lakh Investment Into ₹20 Lakh",
            "Summary": "Force Motors, a Pune-based company known for Travellers and Gurkhas, has delivered exceptional returns with shares rising 1,868% over five years and 117% in the past year. The company transformed its business by exiting low-margin tractors and focusing on original equipment manufacturing for BMW and Mercedes-Benz. Revenue grew from ₹3,240 crore in FY22 to ₹8,072 crore in FY25, while net profit swung from losses to over ₹800 crore. EBITDA margins expanded to 14% and return on capital employed improved to 25%. In Q1 FY26, consolidated revenue rose 22% year-on-year to ₹2,297 crore, with net profit surging 52% to ₹176 crore. Key growth drivers include strong demand for the Urbania utility vehicle, a ₹1,000 crore defence contract for 2,978 Gurkha vehicles, and engine manufacturing partnerships with luxury car brands. The company is investing in electric vehicle platforms and maintains a debt-to-equity ratio under 0.3x. However, analysts note the stock trades at demanding valuations of around 29-31 times earnings, with risks including lumpy defence deliveries, potential OEM partner changes, and export volatility.",
            "Sentiment": "positive",
            "PublishDate": 1753676817574,
            "Source": "stock"
        },
        {
            "Title": "Force Motors Receives Reaffirmed CRISIL AA+/Stable Credit Ratings on Rs 765 Crore Bank Facilities",
            "Summary": "Force Motors Limited received reaffirmed credit ratings from CRISIL with long-term rating at CRISIL AA+/Stable and short-term rating at CRISIL A1+ for bank loan facilities worth Rs 765 crores. The ratings reflect the company's strong financial performance with revenue growing 15% to Rs 8,092 crore in fiscal 2025, driven by light commercial vehicles sales. Operating margin expanded to 13.8% from 13.2% in the previous fiscal, with absolute operating profit rising to Rs 1,113 crore from Rs 926 crore. The company significantly reduced total debt to Rs 17 crore as of March 31, 2025, from Rs 525 crore a year earlier, and became debt-free in May 2025. Force Motors holds a dominant 70-75% market share in the LCV passenger segment and maintains its leading position in niche automotive segments. The ratings also factor in strong support from parent company JHIPL, which holds 57.38% stake and has marketable securities worth over Rs 31,000 crore. CRISIL withdrew ratings on certain term loan facilities and non-convertible debentures as requested by the company after receipt of no-dues certificates.",
            "Sentiment": "positive",
            "PublishDate": 1753495268177,
            "Source": "stock"
        },
        {
            "Title": "Force Motors Appoints New VP Corporate Strategy and Secretarial Auditors",
            "Summary": "Force Motors Limited has appointed Mr. Anshul Saxena as Vice President - Corporate Strategy, under the category of Senior Management Personnel, effective July 23, 2025. Mr. Saxena brings over 19 years of experience in strategic advisory and board roles in manufacturing companies. Force Motors Limited has appointed M/s SIUT & Co LLP as Secretarial Auditors for a five-year term from FY 2025-26 to FY 2029-30, subject to shareholder approval at the upcoming Annual General Meeting.",
            "Sentiment": "positive",
            "PublishDate": 1753279769831,
            "Source": "corporate_governance"
        },
        {
            "Title": "Force Motors Reports Strong Q1 Results with 52% Jump in Net Profit",
            "Summary": "Force Motors delivered robust quarterly performance with consolidated net profit rising to 1.76 billion rupees from 1.16 billion rupees year-over-year. Revenue increased to 22.97 billion rupees compared to 18.8 billion rupees in the same period last year. The company's EBITDA grew to 3.32 billion rupees from 2.5 billion rupees, while EBITDA margin improved to 14.45% from 13.22% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1753278351760,
            "Source": "earnings"
        },
        {
            "Title": "FIIs Boost Stakes in 264 Smallcap Stocks, Three Deliver Multibagger Returns Up to 165%",
            "Summary": "Foreign institutional investors increased their stakes in 264 smallcap stocks during the June quarter, with three delivering exceptional returns in 2025. Force Motors led with 165% gains as FII holdings rose from 8.36% to 9.77%. Camlin Fine Sciences returned 125% with FII stakes nearly doubling from 1.47% to 2.88%, while Gabriel India gained 107% as foreign holdings increased from 5.23% to 5.97%. Overall, 17 stocks from the FII-backed list delivered returns of at least 50%, including Lumax Auto Technologies (77%), Authum Investment & Infrastructure (69%), and RBL Bank (65%). Apollo Micro Systems saw the largest stake increase with FII holdings jumping from 0.93% to 7.16%. The automotive sector emerged as a clear FII favorite, with defense, infrastructure, financial services, and healthcare stocks also attracting foreign investment. However, not all picks succeeded, with Advanced Enzyme Technologies declining 4.36% despite FIIs increasing their stake by 1155 basis points to 23.45%. Emkay Global has adjusted its model portfolio to include more small and midcap stocks, while analysts note that after the rally from April lows, valuations are no longer cheap across market segments.",
            "Sentiment": "positive",
            "PublishDate": 1753246113176,
            "Source": "stock"
        },
        {
            "Title": "Bombay High Court Cancels Reassessment Notices Against Force Motors",
            "Summary": "The Bombay High Court has canceled reassessment notices issued against Force Motors. The court's decision is in favor of the company, invalidating the reassessment notices that were previously issued.",
            "Sentiment": "positive",
            "PublishDate": 1752237556000,
            "Source": "default"
        },
        {
            "Title": "Force Motors Reports Increase in June Sales",
            "Summary": "Force Motors has reported sales of 2,889 units in June, showing an increase from 2,553 units sold in the same month last year. This represents a year-over-year growth in the company's vehicle sales.",
            "Sentiment": "positive",
            "PublishDate": 1751550865000,
            "Source": "default"
        },
        {
            "Title": "Force Motors Announces CFO Change",
            "Summary": "Force Motors has announced the resignation of Sanjay Kumar Bohra as CFO. Rishi Luharuka will take over as the new Group CFO and Key Managerial Person.",
            "Sentiment": "neutral",
            "PublishDate": 1749465214000,
            "Source": "default"
        },
        {
            "Title": "Force Motors Reports 19% Increase in May Sales",
            "Summary": "Force Motors reported total sales of 3,088 units in May, compared to 2,592 units in the same month last year, representing a year-over-year increase of 19%.",
            "Sentiment": "positive",
            "PublishDate": 1749082147000,
            "Source": "default"
        },
        {
            "Title": "Force Motors Reports Increased Sales in May",
            "Summary": "Force Motors has reported sales of 3,088 units in May, showing an increase from 2,592 units in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1749038546000,
            "Source": "default"
        },
        {
            "Title": "Force Motors Reports Increase in April Sales",
            "Summary": "Force Motors has reported sales of 3,210 units in April, compared to 2,268 units in the same month last year, representing a significant year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1746411510000,
            "Source": "default"
        },
        {
            "Title": "Force Motors Reports Strong Q4 FY25 Results with Significant Profit Growth",
            "Summary": "Force Motors announced its Q4 FY25 results, showing a substantial increase in net profit to 4.35 billion rupees, up from 1.4 billion rupees year-over-year. Revenue rose to 23.6 billion rupees from 20.1 billion rupees in the same period last year. The company reported an exceptional item of 3.95 billion rupees in Q4. Profit before tax increased to 2.68 billion rupees from 2.1 billion rupees year-over-year. Additionally, the company recommended a dividend of 40 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1745799432000,
            "Source": "default"
        },
        {
            "Title": "Force Motors: Q4 Profit Triples, Revenue Up 17%, ₹40 Dividend Declared",
            "Summary": "Force Motors reported Q4FY24 results with net profit surging 210% YoY to ₹434.7 crore. Revenue increased 17.1% to ₹2,356 crore. EBITDA rose 18.2% to ₹329.3 crore with margin at 14%. The board recommended a dividend of ₹40 per share.",
            "Sentiment": "positive",
            "PublishDate": 1745588524000,
            "Source": "earnings"
        },
        {
            "Title": "Force Motors Announces Dividend of 40 Rupees per Share",
            "Summary": "Force Motors has recommended a dividend of 40 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1745587842000,
            "Source": "result"
        },
        {
            "Title": "Force Motors Reports Strong Q4 FY25 Results with Exceptional Item",
            "Summary": "Force Motors announced its Q4 FY25 financial results, reporting a consolidated net profit of 4.35 billion rupees, up from 1.4 billion rupees year-over-year. The company's revenue increased to 23.6 billion rupees from 20.1 billion rupees in the same period last year. The quarter included an exceptional item of 3.95 billion rupees. EBITDA rose to 3.3 billion rupees with a margin of 13.97%, slightly up from 13.85% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1745587777000,
            "Source": "result"
        },
        {
            "Title": "Force Motors Reports Slight Increase in March Sales",
            "Summary": "Force Motors reported total sales of 3,700 units in March, compared to 3,668 units in the same month last year, representing a small year-over-year increase.",
            "Sentiment": "neutral",
            "PublishDate": 1743781494000,
            "Source": "earnings"
        },
        {
            "Title": "Force Motors: Secures 2,978 Vehicle Order from Indian Defence Forces",
            "Summary": "Force Motors has received an order for 2,978 vehicles from the Indian Army and Air Force. The vehicles are designed to meet specific operational requirements in demanding defence environments.",
            "Sentiment": "positive",
            "PublishDate": 1743253589000,
            "Source": "order&deals"
        },
        {
            "Title": "Force Motors: Secures Major Defence Contract for 2,978 Gurkha Vehicles",
            "Summary": "Force Motors has signed a contract to supply 2,978 Force Gurkha light vehicles to the Indian Defence Forces. The order comes from the Directorate General of Capb, Devp (CD-13/14) General Staff Branch, IHQ of MoD (Army), New Delhi. This significant order underscores Force Motors' commitment to enhancing India's defense capabilities through its range of General Service Vehicles.",
            "Sentiment": "positive",
            "PublishDate": 1743134268000,
            "Source": "order&deals"
        },
        {
            "Title": "Force Motors to Supply Over 2,900 Gurkha Vehicles to Indian Defence Forces",
            "Summary": "Force Motors has secured a contract to provide more than 2,900 Force Gurkha vehicles to the Indian Defence Forces. This significant order demonstrates the company's capability to meet military-grade requirements and potentially boost its revenue and market presence in the defense sector.",
            "Sentiment": "positive",
            "PublishDate": 1743077727000,
            "Source": "order&deals"
        },
        {
            "Title": "Indian Government Signs 25 Billion Rupee Contract for Light Vehicles",
            "Summary": "The Indian government has entered into contracts worth 25 billion rupees with Mahindra and Mahindra and Force Motors for the procurement of 5,000 light vehicles. This significant deal highlights the government's investment in domestic automotive manufacturers and potentially signals an upgrade or expansion of its vehicle fleet.",
            "Sentiment": "positive",
            "PublishDate": 1743076946000,
            "Source": "order&deals"
        },
        {
            "Title": "Force Motors Reports 48.81% Increase in Domestic Sales for February 2025",
            "Summary": "Force Motors has announced a significant increase in their domestic sales figures for February 2025. The company reported a 48.81% year-over-year growth in sales of Small Commercial Vehicles (SCV), Light Commercial Vehicles (LCV), Utility Vehicles (UV), and Sport Utility Vehicles (SUV) in the domestic market.",
            "Sentiment": "positive",
            "PublishDate": 1741098245000,
            "Source": "result"
        },
        {
            "Title": "Force Motors Reports Strong Q3 Financial Performance",
            "Summary": "Force Motors has announced its Q3 financial results, showing significant growth. The company's consolidated net profit increased to 1.1 billion rupees, up from 854 million rupees year-over-year and 1.35 billion rupees quarter-over-quarter. Revenue also saw a rise, reaching 18.9 billion rupees compared to 16.9 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739233329000,
            "Source": "earnings"
        },
        {
            "Title": "Force Motors Reports Mixed Q3 Financial Results",
            "Summary": "Force Motors has released its Q3 financial results, showing a year-over-year increase in EBITDA but a decrease in EBITDA margin. The company's EBITDA rose to 2.3 billion rupees from 2.24 billion rupees in the same quarter last year. However, the EBITDA margin declined to 12.26% from 13.27% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739192200000,
            "Source": "earnings"
        },
        {
            "Title": "Force Motors Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Force Motors has announced its Q3 financial results, showing substantial year-over-year and quarter-over-quarter growth. The company's consolidated net profit increased to 1.1 billion rupees, up from 854 million rupees in the same quarter last year and 1.35 billion rupees in the previous quarter. Revenue also saw a rise, reaching 18.9 billion rupees compared to 16.9 billion rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1739192118000,
            "Source": "earnings"
        },
        {
            "Title": "Force Motors Reports Increase in January Sales",
            "Summary": "Force Motors has reported total sales of 3,597 units in January, compared to 2,989 units in the same month last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738735563000,
            "Source": "result"
        },
        {
            "Title": "Force Motors Reports Decline in December Sales",
            "Summary": "Force Motors reported total sales of 2,036 units in December, compared to 2,485 units in the same month of the previous year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1735880356000,
            "Source": "result"
        },
        {
            "Title": "Force Motors Receives Order for 2,429 BSVI Diesel Ambulances",
            "Summary": "Force Motors has secured an order for the supply of 2,429 units of BSVI (Bharat Stage VI) compliant diesel ambulances. This significant order demonstrates the company's capability in producing specialized vehicles and its contribution to the healthcare sector.",
            "Sentiment": "positive",
            "PublishDate": 1735809708000,
            "Source": "order&deals"
        },
        {
            "Title": "Force Motors Reports Marginal Increase in November Sales",
            "Summary": "Force Motors announced its sales figures for November, reporting total sales of 1,885 units. This represents a slight increase from the 1,884 units sold in the same month of the previous year, indicating a year-over-year growth of 1 unit.",
            "Sentiment": "neutral",
            "PublishDate": 1733318410000,
            "Source": "result"
        },
        {
            "Title": "Force Motors Reports Decline in October Domestic Sales",
            "Summary": "Force Motors' total domestic sales for October decreased to 2,002 units from 2,254 units in the same month last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1731072416000,
            "Source": "result"
        },
        {
            "Title": "Force Motors: Q2 Results Drive 19% Stock Surge",
            "Summary": "Force Motors share price jumped 19% in morning trade on BSE, reaching ₹7,575 from the previous close of ₹6,378.35, following strong Q2 results.",
            "Sentiment": "positive",
            "PublishDate": 1730262473000,
            "Source": "result"
        },
        {
            "Title": "Force Motors Reports Improved Q2 EBITDA and Margin",
            "Summary": "Force Motors has announced its Q2 financial results. The company's EBITDA increased to 2.82 billion rupees from 2.25 billion rupees year-over-year. Additionally, the EBITDA margin improved to 14.56% from 12.49% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730204706000,
            "Source": "result"
        }
    ]
}