{
    "Symbol": "FORTIS",
    "ISIN": "INE061F01013",
    "News": [
        {
            "Title": "Fortis Healthcare Board Meet Set for Feb 13, 2026",
            "Summary": "Fortis Healthcare Limited has scheduled a board meeting on February 13, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770365772232,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fortis Healthcare Appoints New Non-Executive Director",
            "Summary": "Fortis Healthcare Limited successfully completes postal ballot voting with 99.39% approval for appointing Mr. Mohd Shahazwan Bin Mohd Harris as Non-Independent & Non-Executive Director.",
            "Sentiment": "positive",
            "PublishDate": 1769165771258,
            "Source": "stocks"
        },
        {
            "Title": "Delhi High Court Issues Criminal Complaint Against Fortis",
            "Summary": "Delhi High Court has issued a criminal complaint regarding a forged term sheet in the ongoing dispute between Fortis Healthcare and Walmark, marking a significant legal development.",
            "Sentiment": "negative",
            "PublishDate": 1769074587568,
            "Source": "stocks"
        },
        {
            "Title": "NCLT Approves Fortis Healthcare Subsidiary Merger",
            "Summary": "NCLT has approved the merger of Fortis Healthcare's wholly owned subsidiaries with Fortis Hospitals Limited, effective April 1, 2022, subject to ROC registrations.",
            "Sentiment": "positive",
            "PublishDate": 1768575570446,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fortis Healthcare Block Trade Worth ₹25.38 Crores",
            "Summary": "Fortis Healthcare witnessed a significant NSE block trade involving 278,226 shares valued at ₹25.38 crores, executed at ₹912.20 per share on the exchange.",
            "Sentiment": "neutral",
            "PublishDate": 1768368337855,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fortis Healthcare Plans 3,200+ Bed Expansion by 2030",
            "Summary": "Fortis Healthcare announces aggressive expansion strategy with over 3,200 new beds by 2030, strategic acquisitions in Bangalore and Punjab, and focus on medical tourism growth.",
            "Sentiment": "positive",
            "PublishDate": 1767852486276,
            "Source": "stocks"
        },
        {
            "Title": "Fortis Healthcare Releases Investor Presentation Materials",
            "Summary": "Fortis Healthcare submits comprehensive investor presentation for US roadshow and JP Morgan Healthcare Conference, covering business highlights, financial performance, and expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1767809327170,
            "Source": "stocks"
        },
        {
            "Title": "Fortis Healthcare Credit Rating Reaffirmed at AA+",
            "Summary": "CRISIL reaffirms Fortis Healthcare's credit rating at AA+/Stable for bank facilities worth ₹425.98 crores and NCDs worth ₹1,550 crores, citing strong market position and healthy financial metrics.",
            "Sentiment": "positive",
            "PublishDate": 1767686554401,
            "Source": "stocks"
        },
        {
            "Title": "Fortis Healthcare Receives GST Orders Worth ₹2,139.61 Cr",
            "Summary": "Fortis Healthcare disclosed receipt of GST orders from Tamil Nadu authorities totaling ₹2,139.61 crores across FY 2020-21 to 2022-23, including interest and penalties.",
            "Sentiment": "negative",
            "PublishDate": 1767097571756,
            "Source": "stocks"
        },
        {
            "Title": "Fortis Healthcare Wins Legal Case Against Third Party",
            "Summary": "Delhi High Court rules in favor of Fortis Healthcare in civil suit challenging third party's locus and seeking permanent injunction against their actions on December 19, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766498820548,
            "Source": "stocks"
        },
        {
            "Title": "Fortis Healthcare Pays ₹130.47 Cr Interest",
            "Summary": "Fortis Healthcare Limited completed annual interest payments totaling ₹130.47 crores to debenture holders across three series on December 22, 2025, as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1766412473077,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fortis Healthcare Arm Acquires TMI Healthcare Assets",
            "Summary": "Fortis Healthcare's subsidiary IHL has finalized agreements to acquire TMI Healthcare and its hospital properties, expanding the company's healthcare infrastructure footprint.",
            "Sentiment": "positive",
            "PublishDate": 1766214904428,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fortis Healthcare Plans ₹840 Cr Investment in Bengaluru",
            "Summary": "Fortis Healthcare acquires PeopleTree Hospital Yeshwanthpur for ₹430 cr and plans additional ₹410 cr investment to scale up to 300 beds, supporting cluster growth strategy in Bengaluru.",
            "Sentiment": "positive",
            "PublishDate": 1766171297333,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fortis Healthcare Postal Ballot for Director Appointment",
            "Summary": "Fortis Healthcare issues postal ballot notice seeking shareholder approval for Mr. Mohd Shahazwan Bin Mohd Harris appointment as Non-Independent Non-Executive Director, with voting period from December 24, 2025 to January 22, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766138704956,
            "Source": "stocks"
        },
        {
            "Title": "Fortis Healthcare Block Trade Worth ₹37.11 Crores",
            "Summary": "Fortis Healthcare executed a significant NSE block trade involving 419,265 shares at ₹885.10 per share, totaling ₹37.11 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1766123059949,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fortis Healthcare Modifies Terms of INR 1,550 Crore Non-Convertible Debentures",
            "Summary": "Fortis Healthcare executed amendments to its debenture trust deed on December 3, 2025, modifying key terms of its INR 1,550 crore NCDs including reducing spread from 192 to 150 basis points post-reset date and converting from secured to unsecured status. The changes also provide additional flexibility on IHH's shareholding dilution through subsidiary mergers and removes prior approval requirements for Agilus Diagnostics stake dilution up to 51% through IPO.",
            "Sentiment": "positive",
            "PublishDate": 1764839229151,
            "Source": "corporate_action"
        },
        {
            "Title": "Fortis Healthcare Subsidiary Challenges GST Show Cause Notice in Delhi High Court",
            "Summary": "Escorts Heart Institute and Research Centre Limited, a wholly-owned subsidiary of Fortis Healthcare, has filed a writ petition in Delhi High Court challenging a GST show cause notice regarding alleged non-remittance of GST on medicines and consumables charged to IPD patients. The GST department's claim involves INR 6.66 crore plus interest and penalty, with the legal challenge filed on December 2, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1764747053797,
            "Source": "stock"
        },
        {
            "Title": "Fortis Healthcare Shareholders Approve Appointment of Dr. Keith Hsiu Chin Lim as Non-Executive Director",
            "Summary": "Fortis Healthcare Limited shareholders approved the appointment of Dr. Keith Hsiu Chin Lim as a Non-Independent Non-Executive Director through postal ballot voting that concluded on November 15, 2025. The resolution received overwhelming support with 99.3167% of votes cast in favor, with 633,845,904 shares voting in approval out of total votes polled.",
            "Sentiment": "positive",
            "PublishDate": 1763464952697,
            "Source": "corporate_governance"
        },
        {
            "Title": "Fortis Healthcare Reports Strong Q2 FY26 Results with 17.3% Revenue Growth and Margin Expansion",
            "Summary": "Fortis Healthcare delivered consolidated revenue of INR 2,331 crores in Q2 FY26, up 17.3% year-on-year, with hospital business growing 19.3% to INR 1,974 crores and diagnostics revenue rising 7.1% to INR 357 crores. Operating EBITDA increased 28% to INR 556 crores with margins expanding to 23.9% from 21.9% in the previous year, driven by improved hospital occupancy at 71% and higher ARPOB of INR 2.51 crores per annum.",
            "Sentiment": "positive",
            "PublishDate": 1763380220730,
            "Source": "earnings"
        },
        {
            "Title": "Fortis Healthcare Reports Strong Q2 Performance with 82% Jump in Net Profit",
            "Summary": "Fortis Healthcare delivered robust Q2 results with consolidated net profit rising to 3.2 billion rupees from 1.76 billion rupees year-over-year. Revenue increased to 23.3 billion rupees compared to 19.9 billion rupees in the same period last year. The company's EBITDA grew to 5.6 billion rupees from 4.35 billion rupees year-over-year, while EBITDA margin improved to 23.86% from 21.87% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762872694475,
            "Source": "earnings"
        },
        {
            "Title": "IHH Healthcare Completes Open Offers for Fortis Healthcare and Malar Hospitals with Minimal Response",
            "Summary": "IHH Healthcare Berhad announced the completion of mandatory open offers for Fortis Healthcare Limited and Fortis Malar Hospitals Limited. The tendering period closed on November 4, 2025, with results confirmed by BSE Limited on November 7, 2025. For Fortis Healthcare, only 1,778 shares (0.0002%) were tendered during the open offer period, while for Malar Hospitals, 4,523 shares (0.02%) were tendered. Following completion, IHH will indirectly hold 235,295,895 Fortis shares (31.17% of total shares) and 11,756,925 Malar shares (62.73% of total shares) through its subsidiaries. The open offers were part of a larger transaction that included a preferential allotment of 235,294,117 new Fortis shares to Northern TK Venture Pte Ltd, an indirect wholly-owned subsidiary of IHH.",
            "Sentiment": "neutral",
            "PublishDate": 1762816772825,
            "Source": "order&deals"
        },
        {
            "Title": "IHH Healthcare Announces Tendering Period for Fortis and Malar Open Offers",
            "Summary": "IHH Healthcare Berhad announced that the tendering period for open offers involving Fortis Healthcare Limited and Fortis Malar Hospitals Limited will commence from October 20, 2025 and remain open until November 4, 2025. The transaction involves subscription of 235,294,117 new Fortis shares through preferential allotment to Northern TK Venture Pte Ltd, an indirect wholly-owned subsidiary of IHH. The Fortis open offer seeks to acquire up to 197,025,660 shares representing 26.10% of expanded voting share capital, while the Malar open offer targets up to 4,894,308 shares representing 26.11% of voting share capital. The Committees of Independent Directors of both Fortis and Malar published their recommendations on October 16, 2025, which will be included in pre-offer advertisements scheduled for October 17, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760618035137,
            "Source": "corporate_action"
        },
        {
            "Title": "Fortis Healthcare Seeks Shareholder Approval for Dr. Keith Hsiu Chin Lim's Board Appointment",
            "Summary": "Fortis Healthcare Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Dr. Keith Hsiu Chin Lim as a Non-Independent & Non-Executive Director. Dr. Lim was appointed as an Additional Director on September 09, 2025, following nomination by Northern TK Venture Pte. Limited. The 51-year-old medical professional serves as Group Chief Medical Officer at IHH Healthcare and holds qualifications including MBBS from National University of Singapore. The voting period runs from October 17, 2025 to November 15, 2025, with results to be declared by November 18, 2025. Dr. Lim will receive sitting fees as per company policy and his position will be subject to retirement by rotation. The appointment requires ordinary resolution approval from shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1760612620616,
            "Source": "corporate_governance"
        },
        {
            "Title": "Fortis Healthcare Shares Rise 3% as IHH Gets SEBI Approval for Open Offer After Seven-Year Delay",
            "Summary": "Fortis Healthcare shares gained 3% after Malaysia-based IHH Healthcare Berhad received SEBI approval to proceed with an open offer to acquire an additional 26% stake in the hospital chain. IHH originally acquired a 31.1% stake in Fortis for ₹4,000 crore in 2018, with the subsequent open offer worth ₹3,300 crore initially scheduled for December 2018. The offer was stalled due to legal disputes involving Daiichi Sankyo and Fortis' former promoters, the Singh Brothers. The Supreme Court cleared the path for the open offer in September 2022, subject to SEBI approval. The original 2018 open offer price was ₹170 per share, while Fortis currently trades at ₹980 per share, representing a 4.7x increase. At current market prices, the open offer size would be ₹19,308 crore. Fortis shares closed 2.8% higher at ₹1,007.6 and have gained 7% over the past month.",
            "Sentiment": "positive",
            "PublishDate": 1759723472898,
            "Source": "corporate_action"
        },
        {
            "Title": "SEBI Approves IHH Healthcare's Open Offer for Fortis Healthcare and Fortis Malar Hospitals",
            "Summary": "IHH Healthcare Berhad received approval from SEBI to proceed with open offers for Fortis Healthcare Limited and its subsidiary Fortis Malar Hospitals Limited. The transaction involves three components: subscription of 235,294,117 new Fortis shares through preferential allotment to IHH's subsidiary Northern TK Venture Pte Ltd, a mandatory open offer for up to 197,025,660 Fortis shares representing 26.10% of expanded voting capital, and a mandatory open offer for up to 4,894,308 Malar shares representing 26.11% of voting capital. SEBI's approval letter was dated October 1, 2025, allowing IHH to move forward with both open offers after a lengthy regulatory process that began in 2018.",
            "Sentiment": "positive",
            "PublishDate": 1759495756173,
            "Source": "order&deals"
        },
        {
            "Title": "Fortis Healthcare Signs O&M Agreement for Gleneagles BGS Hospital",
            "Summary": "Fortis Healthcare has signed an Operations and Maintenance (O&M) agreement for Gleneagles BGS Hospital. The agreement is set to commence on October 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1759326404695,
            "Source": "order&deals"
        },
        {
            "Title": "Fortis Healthcare Appoints Dr. Keith Lim as Director, Tomo Nagahiro Resigns",
            "Summary": "Fortis Healthcare announced board changes effective September 09, 2025. Dr. Keith Hsiu Chin Lim was appointed as Additional Director (Non-Executive & Non-Independent) based on the Nomination and Remuneration Committee's recommendation. Simultaneously, Tomo Nagahiro resigned from his position as Non-Executive & Non-Independent Director due to other commitments and responsibilities. Dr. Lim serves as Group Chief Medical Officer at IHH Healthcare and holds over 20 years of experience as a radiation oncologist. He previously worked with National University Health System and Singapore's Ministry of Health, receiving Singapore's National Medical Excellence Award. Dr. Lim is not related to other company directors but serves as a nominee director of Northern TK Venture Pte. Ltd along with several other board members.",
            "Sentiment": "neutral",
            "PublishDate": 1757418961691,
            "Source": "corporate_governance"
        },
        {
            "Title": "Fortis Healthcare Signs Hospital Land and Equipment Lease Agreement in Greater Noida",
            "Summary": "Fortis Healthcare has entered into an agreement for hospital land and equipment lease in Greater Noida. The agreement involves UPSIDA and R.R. Lifesciences Pvt Ltd as the other parties to the deal.",
            "Sentiment": "positive",
            "PublishDate": 1757055779432,
            "Source": "order&deals"
        },
        {
            "Title": "Fortis Healthcare Expands Delhi-NCR Network with 200-Bed Greater Noida Hospital",
            "Summary": "Fortis Healthcare has taken control of a 200-bed hospital in Greater Noida through a long-term lease arrangement. This expansion increases the company's total bed capacity in the Delhi-NCR region to approximately 2,000 beds. The move is aimed at providing wider healthcare access and enhancing collaborations in the region.",
            "Sentiment": "positive",
            "PublishDate": 1756780259306,
            "Source": "stock"
        },
        {
            "Title": "Fortis Healthcare Signs O&M Agreement for 550-Bed Hospital in Lucknow",
            "Summary": "Fortis Healthcare has signed an Operations & Maintenance (O&M) agreement with Ekana Group for a 550-bed greenfield super specialty hospital in Lucknow. The agreement involves Fortis managing operations of the new healthcare facility being developed by Ekana Group.",
            "Sentiment": "positive",
            "PublishDate": 1755709104471,
            "Source": "order&deals"
        },
        {
            "Title": "Fortis Healthcare Reports Strong Q1 FY26 Results with 16.6% Revenue Growth and Margin Expansion",
            "Summary": "Fortis Healthcare Limited reported consolidated revenue of INR 2,167 crores for Q1 FY26, representing a 16.6% year-over-year increase. Operating EBITDA grew 43.2% to INR 491 crores, with EBITDA margin improving to 22.6% from 18.4% in Q1 FY25. The hospitals segment generated revenue of INR 1,838 crores (up 18.6% YoY) with EBITDA margin of 22.1%. The diagnostics segment (Agilus) recorded net revenue of INR 329 crores (up 6.3% YoY) with operating EBITDA margin improving to 23% from 16.1%. Key operational metrics showed hospital occupancy at 69% versus 67% in the prior year, with ARPOB increasing 10.2% to INR 2.65 crores per annum. The company acquired Shrimann Superspecialty Hospital in Jalandhar adding 228 beds and entered an operations management agreement with Gleneagles India to manage approximately 700 beds across 5 hospitals. Management expects continued growth momentum and is targeting 200 basis points margin improvement for FY26, with diagnostics margins expected to stabilize in the 22-23% range.",
            "Sentiment": "positive",
            "PublishDate": 1754916758034,
            "Source": "earnings"
        },
        {
            "Title": "Fortis Healthcare Plans Expansion with 1,000+ New Beds Through Strategic Acquisitions",
            "Summary": "Fortis Healthcare has outlined long-term growth plans involving the addition of over 1,000 new beds through Gleneagles operations and maintenance activities and the Shriman acquisition. The company generates 63% of its revenue from high-profit specialty services and is working to increase international patient revenue. The healthcare provider is also targeting a diagnostics margin improvement to 23%.",
            "Sentiment": "positive",
            "PublishDate": 1754496763846,
            "Source": "stock"
        },
        {
            "Title": "Fortis Healthcare Reports Strong Q1 Growth with Net Profit Rising 53% to 2.67B Rupees",
            "Summary": "Fortis Healthcare delivered robust quarterly results with consolidated net profit increasing to 2.67 billion rupees from 1.74 billion rupees year-over-year. Revenue grew to 21.67 billion rupees compared to 18.6 billion rupees in the same period last year. The company's EBITDA improved significantly to 4.91 billion rupees from 3.42 billion rupees, while EBITDA margin expanded to 22.65% from 18.43% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754494807212,
            "Source": "earnings"
        },
        {
            "Title": "Fortis Healthcare Announces Quarterly Results and Appoints Tax Auditors",
            "Summary": "Fortis Healthcare Limited announced its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company's board also approved the appointment of M/s. B S R & Co. LLP as Tax Auditors for the Financial Year 2024-25. B S R & Co. LLP is a chartered accounting firm established in 1990, converted to LLP in 2013, with over 4000 staff and 140+ partners. The firm audits various listed companies including those in the healthcare sector. The board meeting was held on August 6, 2025, commencing at 12:00 PM and concluding at 8:25 PM IST.",
            "Sentiment": "neutral",
            "PublishDate": 1754494750924,
            "Source": "earnings"
        },
        {
            "Title": "Fortis Healthcare Receives NCLT Approval for Subsidiary Restructuring Scheme",
            "Summary": "Fortis Healthcare Limited received approval from the National Company Law Tribunals of New Delhi and Chandigarh for a composite scheme of arrangement involving three wholly-owned subsidiaries - International Hospital Limited, Fortis Hospitals Limited, and Fortis Hospotel Limited. The NCLT New Delhi approved the scheme on May 9, 2025, while NCLT Chandigarh approved it on July 30, 2025. The scheme has an appointed date of April 1, 2023, and will become effective once the certified copy of the Chandigarh order is filed with the Registrar of Companies. The restructuring aims to rationalize the company's complex corporate group structure to reduce administrative, operational and financial inefficiencies. The three subsidiaries operate in healthcare with combined paid-up capital of INR 9,708.01 million and total turnover of INR 50,298.26 million as of March 31, 2025. The arrangement includes specific share exchange ratios between the entities and will not impact the shareholding pattern of the listed entity.",
            "Sentiment": "positive",
            "PublishDate": 1753965543670,
            "Source": "corporate_action"
        },
        {
            "Title": "Fortis Healthcare Subsidiary Completes Acquisition of Shrimann Superspecialty Hospital",
            "Summary": "Fortis Hospotel Limited, a wholly-owned subsidiary of Fortis Healthcare Limited, has completed the acquisition of Shrimann Superspecialty Hospital's entire business operations. The transaction includes the hospital land and adjacent property. The acquisition was completed at 09:14 PM IST on July 24, 2025, following earlier intimations to exchanges in February, March, and May 2025 regarding the definitive agreements for this transaction.",
            "Sentiment": "positive",
            "PublishDate": 1753374017260,
            "Source": "order&deals"
        },
        {
            "Title": "Fortis Healthcare Shares Hit Record High on Gleneagles Hospital Management Deal",
            "Summary": "Fortis Healthcare shares reached a new record high of Rs 839.90 after IHH Healthcare Berhad signed an operation and maintenance services agreement with the company. Under the agreement, Fortis Healthcare will operate and maintain five out of six Gleneagles hospitals across India. The collaboration aims to strengthen IHH Healthcare Berhad's business in India and unlock operational and financial synergies across both networks. Fortis shares rose 1.97% to the record high and were trading 0.89% higher at Rs 831, outperforming the NSE Nifty 50 which declined 0.13%. The stock has gained 72.03% over 12 months and 15.62% year-to-date. Trading volume was 3.8 times the 30-day average. Among 15 analysts covering the stock, 14 maintain buy ratings while one suggests sell, with the average 12-month price target implying a 2.4% downside.",
            "Sentiment": "positive",
            "PublishDate": 1753332659216,
            "Source": "stock"
        },
        {
            "Title": "Fortis Healthcare Shares Rise on O&M Agreement with Gleneagles Healthcare India",
            "Summary": "Fortis Healthcare signed an operation and management services agreement with Gleneagles Healthcare India (GHIPL) covering five hospitals and one clinic. Under the deal, Fortis will receive a monthly service fee equal to 3% of the net revenue from GHIPL's hospitals business, which had consolidated revenue of ₹718.5 crore as of March 31, 2025. The agreement becomes effective for Gleneagles BGS Hospital in Karnataka. GHIPL is a subsidiary of IHH, which is the parent entity of Fortis' promoter. The partnership expands Fortis' geographic footprint, increases beds under management, and provides incremental revenue through direct service fees. GHIPL will cover all third-party and out-of-pocket expenses incurred by Fortis. Fortis Healthcare shares traded 1.09% higher at ₹817.9, with the stock gaining 15.3% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1753252880437,
            "Source": "order&deals"
        },
        {
            "Title": "Agilus Acquires 'SRL' Trademarks for ₹8 Crore in Delhi High Court Auction",
            "Summary": "Agilus has purchased the 'SRL' trademarks for ₹8 crore through a court auction sanctioned by the Delhi High Court. The acquisition relates to Fortis Healthcare and involves the transfer of trademark rights through the judicial auction process.",
            "Sentiment": "neutral",
            "PublishDate": 1753068888574,
            "Source": "stock"
        },
        {
            "Title": "Fortis Healthcare: Expansion Plans and Improved Performance Drive Growth",
            "Summary": "Fortis Healthcare plans to add 900 beds next year, aiming for 14-15% revenue growth in FY26. The company's hospital segment showed strong 14% YoY revenue growth in Q4 FY25, with improved occupancy and ARPOB. The diagnostics segment, rebranded as Agilus, is expected to show stronger performance from FY26. Analysts maintain 'Outperform' rating on the stock.",
            "Sentiment": "positive",
            "PublishDate": 1751294671000,
            "Source": "earnings"
        },
        {
            "Title": "Fortis Healthcare: Shares Surge 10% on Strong Growth Outlook",
            "Summary": "Fortis Healthcare shares jumped up to 10% following positive Q4 performance and robust FY26 guidance. The company plans to add 1,976 beds by FY29, projecting 14-15% revenue growth and 150-200 bps margin expansion in its hospital business for FY26. The diagnostics segment expects double-digit revenue growth with mid-20% margins. Global brokerages Nomura and Nuvama maintain 'Buy' ratings with increased price targets.",
            "Sentiment": "positive",
            "PublishDate": 1747898171000,
            "Source": "normal_news"
        },
        {
            "Title": "Fortis Healthcare: Targeting Higher Margins and Steady Growth in FY26",
            "Summary": "Fortis Healthcare aims for margin improvement in FY26, supported by stable occupancy levels above 70%, increased complex procedures, and network expansion. The company plans to add 800 new beds this year and expects diagnostics margins to reach 21%. International patient revenue growth may moderate due to geopolitical uncertainty.",
            "Sentiment": "positive",
            "PublishDate": 1747816712000,
            "Source": "earnings"
        },
        {
            "Title": "Fortis Healthcare Reports Q4 Financial Results and Dividend",
            "Summary": "Fortis Healthcare announced its Q4 consolidated net profit of 1.88 billion rupees, down from 2.03 billion rupees year-over-year. Revenue increased to 20.07 billion rupees from 17.86 billion rupees in the same period last year. The company reported an exceptional loss of 535.7 million rupees compared to a profit of 31.4 million rupees in the previous year. Q4 profit before tax (PBT) rose to 2.9 billion rupees from 2.68 billion rupees year-over-year. Fortis Healthcare has recommended a final dividend of 1 rupee per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747786911000,
            "Source": "default"
        },
        {
            "Title": "Fortis Healthcare: Q4 Net Profit Drops 7% to Rs 188 Crore",
            "Summary": "Fortis Healthcare reported a 7.44% decrease in Q4 FY25 consolidated net profit to Rs 188.02 crore, down from Rs 203.14 crore in the previous year. Revenue increased to Rs 2,007.2 crore. The company faced exceptional losses due to impairment. The board recommended a final dividend of Re 1 per share for FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1747754261000,
            "Source": "earnings"
        },
        {
            "Title": "Fortis Healthcare Reports Q4 Results and Recommends Dividend",
            "Summary": "Fortis Healthcare has announced its Q4 results and dividend recommendation. The company's Q4 EBITDA increased to 4.4 billion rupees from 3.85 billion rupees year-over-year. The EBITDA margin also improved to 21.93% from 21.58% in the same period. Additionally, the company has recommended a final dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747750878000,
            "Source": "result"
        },
        {
            "Title": "Fortis Healthcare Reports Q4 Financial Results",
            "Summary": "Fortis Healthcare announced its Q4 financial results. The company reported revenue of 20.07 billion rupees, up from 17.86 billion rupees year-over-year. Profit before tax (PBT) increased to 2.9 billion rupees from 2.68 billion rupees in the previous year. However, consolidated net profit decreased to 1.88 billion rupees from 2.03 billion rupees year-over-year, but increased from 2.54 billion rupees quarter-over-quarter. The company also reported an exceptional item loss of 535.7 million rupees compared to a profit of 31.4 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747750863000,
            "Source": "result"
        },
        {
            "Title": "Fortis Healthcare Receives Favorable Tax Rectification Order",
            "Summary": "Fortis Healthcare has announced that it received a rectification order under the Income Tax Act. As a result of this order, the tax demand for Fortis Hospitals has been reduced to nil.",
            "Sentiment": "positive",
            "PublishDate": 1746490050000,
            "Source": "default"
        },
        {
            "Title": "Fortis Healthcare: ₹89.53 Crore Tax Demand on Subsidiary Scrapped",
            "Summary": "Fortis Healthcare's subsidiary, Fortis Hospitals, has received a rectification order from the Income Tax Department, reducing the previously raised tax demand of ₹89.53 crore for the assessment year 2022-23 to nil. The order corrects mistakes in the earlier assessment under Section 143(3) of the Income Tax Act, 1961.",
            "Sentiment": "positive",
            "PublishDate": 1746473669000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Fortis Healthcare Receives Favorable Tax Rectification Order",
            "Summary": "Fortis Healthcare has announced that it received a rectification order under the Income Tax Act. As a result of this order, the tax demand for Fortis Hospitals has been reduced to nil.",
            "Sentiment": "positive",
            "PublishDate": 1746459815000,
            "Source": "default"
        },
        {
            "Title": "Fortis Healthcare: IHL Receives ₹76.19 Crore Tax Demand",
            "Summary": "Fortis Healthcare's subsidiary International Hospital Limited (IHL) received a ₹76.19 crore income tax demand for AY 2019-20. The demand is related to disallowed interest expenses. IHL plans to appeal and Fortis states this won't impact financials or operations.",
            "Sentiment": "neutral",
            "PublishDate": 1743685876000,
            "Source": "corporate_governance"
        }
    ]
}