{
    "Symbol": "FOSECOIND",
    "ISIN": "INE519A01011",
    "News": [
        {
            "Title": "Morganite Crucible and Morgan Terrassen Acquire Stakes in Foseco India Through Preferential Allotment",
            "Summary": "Morganite Crucible Limited acquired 5,90,744 equity shares (7.84% stake) and Morgan Terrassen B.V. acquired 5,60,056 equity shares (7.43% stake) in Foseco India Limited through preferential allotment on November 12, 2025. The acquisition increased Foseco India's total equity share capital from INR 6,38,64,590 to INR 7,53,72,590, comprising 75,37,259 equity shares of INR 10 each.",
            "Sentiment": "positive",
            "PublishDate": 1763100868633,
            "Source": "order&deals"
        },
        {
            "Title": "Foseco India Allots 11.5 Lakh Equity Shares to Two Entities on Preferential Basis",
            "Summary": "Foseco India Limited has allotted 11,50,800 equity shares on a preferential basis to Morganite Crucible Limited (5,90,744 shares) and Morgan Terrassen BV (5,60,056 shares). The allotment was approved by the Board of Directors on November 11, 2025, effective November 12, 2025. The shares, with a face value of Rs 10 each, were issued for consideration other than cash. The allotment follows shareholder approval via special resolution at an extraordinary general meeting held on September 21, 2025, and receipt of in-principle approvals from NSE and BSE on November 3 and 4, 2025 respectively. The allotted shares are subject to lock-in and transferability restrictions as prescribed under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762889632101,
            "Source": "corporate_action"
        },
        {
            "Title": "Foseco India Reports Mixed Q2 Results with Higher Revenue and EBITDA but Lower Net Profit",
            "Summary": "Foseco India announced its Q2 financial results showing revenue growth to 1.5 billion rupees from 1.4 billion rupees year-over-year. EBITDA increased to 275 million rupees compared to 239 million rupees in the same period last year, with EBITDA margin improving to 18.27% from 17.01%. However, net profit declined to 165 million rupees from 191 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1762435825368,
            "Source": "earnings"
        },
        {
            "Title": "Foseco India Extends Share Purchase Agreement Deadline to November 14, 2025",
            "Summary": "Foseco India Limited has extended the Long Stop Date under its share purchase agreement to November 14, 2025. The agreement involves the company's promoters including Foseco Overseas Limited, Vesuvius Holdings Limited, Foseco (UK) Limited, Morgan Advanced Materials Plc, Morganite Crucible Limited, and Morgan Terrassen B.V. This marks the second extension, as the deadline was previously moved from October 15 to October 31, 2025. The parties reached this understanding after trading hours on October 31, 2025, and formalized it in writing on November 1, 2025. The acquisition completion is now expected by November 14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762063652924,
            "Source": "order&deals"
        },
        {
            "Title": "Foseco India Extends Deadline for 75% Stake Acquisition in Morganite Crucible India to October 31, 2025",
            "Summary": "Foseco India Limited has extended the Long Stop Date for its share purchase agreement to acquire 75% stake in Morganite Crucible (India) Limited from October 15, 2025 to October 31, 2025. The acquisition involves purchasing 42,00,000 fully paid up equity shares from MCIL Promoters including Morgan Advanced Materials Plc, Morganite Crucible Limited, and Morgan Terrassen B.V. The extension was mutually agreed upon by both parties, with closing formalities now expected to be completed by the new deadline. The original share purchase agreement was executed on August 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760550208706,
            "Source": "order&deals"
        },
        {
            "Title": "Foseco India Appoints Prachee Chirag Sonchal as Director - Human Resources",
            "Summary": "Foseco India Limited appointed Mrs. Prachee Chirag Sonchal as Director - Human Resources, effective November 3, 2025. The Board of Directors approved the appointment based on the recommendation of the Nomination & Remuneration Committee. Sonchal brings over 21 years of experience in strategic HR initiatives across multiple sectors, with expertise in talent management and organizational transformation. The appointment is for full-time employment.",
            "Sentiment": "positive",
            "PublishDate": 1760542247143,
            "Source": "corporate_governance"
        },
        {
            "Title": "Foseco India Clarifies Pricing Basis for Preferential Equity Share Issue Following NSE Query",
            "Summary": "Foseco India Limited issued a clarification regarding its Extra-Ordinary General Meeting scheduled for September 21, 2025, following a request from the National Stock Exchange of India Limited. The clarification pertains to the basis of price determination for a proposed preferential issue of equity shares. NSE requested changes to Paragraph 3 of Point 6 in the EGM Notice's Explanatory Statement regarding how share prices are determined. The company updated the statement to clarify that its Articles of Association provide that when increasing subscribed capital through further share allotments, such shares shall be offered to any persons for cash or other consideration if the price is determined by a registered valuer's valuation report, subject to prescribed conditions. This replaces the previous statement about the Articles not providing for a method resulting in a floor price higher than that determined under SEBI ICDR Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1758902339494,
            "Source": "corporate_action"
        },
        {
            "Title": "Foseco India Shareholders Approve Four Key Resolutions at Extraordinary General Meeting",
            "Summary": "Foseco India Limited held its 1st Extraordinary General Meeting on September 21, 2025, through video conferencing, where shareholders voted on four key resolutions. All resolutions were passed with overwhelming support: approval for preferential equity share allotment (99.98% in favor), increase in authorized share capital (99.98% in favor), appointment of Manuel Antonio Delfino Aguilera as non-executive non-independent director (99.98% in favor), and approval for investing company funds beyond statutory limits under Section 186 (99.86% in favor). The meeting had 13,957 total shareholders on the cut-off date, with 38 shareholders attending via video conference. Remote e-voting was conducted from September 18-20, 2025, with additional e-voting available during the meeting. Jayavant B. Bhave served as the scrutinizer for the voting process, with results showing strong shareholder support across all categories including promoter group and public shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1758593274998,
            "Source": "corporate_action"
        },
        {
            "Title": "Foseco India Revises Share Price to ₹5,674.12 in EGM Corrigendum Following NSE Clarifications",
            "Summary": "Foseco India Limited issued a corrigendum to its Extra-Ordinary General Meeting notice scheduled for September 21, 2025, revising the preferential issue price of equity shares to ₹5,674.12 per share. The revision was made following clarifications requested by NSE after the company filed applications with BSE and NSE seeking in-principle approval for the proposed preferential issue. The corrigendum updates multiple sections of the original EGM notice with the new price and adds information about valuation reports being available on the company's website. The company confirmed no preferential allotments were made during the financial year ending December 31, 2024, or up to September 17, 2025. The EGM will be conducted through video conferencing, with the corrigendum forming an integral part of the original notice.",
            "Sentiment": "neutral",
            "PublishDate": 1758129664938,
            "Source": "corporate_action"
        },
        {
            "Title": "Foseco India Acquires 75% Stake in Morganite Crucible for ₹654 Crore",
            "Summary": "Foseco India has signed a share purchase agreement to acquire 42 lakh shares representing 75% of Morganite Crucible (India) Ltd.'s voting share capital. The acquisition is valued at ₹1,557 per share for a total consideration of ₹653.94 crore. Morganite Crucible, incorporated in 1986, manufactures crucibles and foundry consumables for metal melting applications. The company reported revenues of ₹182.15 crore in FY25, ₹174.03 crore in FY24, and ₹159.42 crore in FY23. Foseco India shares traded 6.09% higher at ₹5,953, extending gains of over 70% in six months.",
            "Sentiment": "positive",
            "PublishDate": 1755849442503,
            "Source": "order&deals"
        },
        {
            "Title": "Foseco India Board to Review New Securities Issuance",
            "Summary": "Foseco India's board of directors plans to review the issuance of new securities. The company has announced this agenda item for board consideration.",
            "Sentiment": "neutral",
            "PublishDate": 1755612883441,
            "Source": "corporate_action"
        },
        {
            "Title": "Foseco India Appoints Manuel Antonio Delfino Aguilera as Non-Executive Director",
            "Summary": "Foseco India Limited appointed Manuel Antonio Delfino Aguilera as a Non-Executive Non-Independent Director effective July 30, 2025. The 46-year-old Italian citizen holds a degree in Metallurgy and an MBA, and serves as President of the Foundry Technologies Business Unit of Vesuvius plc. He is a nominee of the holding company Foseco Overseas Limited and will be liable to retire by rotation. Following his appointment, the company reconstituted three board committees - the Stakeholders' Relationship Committee, Corporate Social Responsibility Committee, and Risk Management Committee - with Aguilera becoming a member of all three committees.",
            "Sentiment": "neutral",
            "PublishDate": 1753791886514,
            "Source": "corporate_governance"
        },
        {
            "Title": "Foseco India Reports 16% Growth in Q1 Net Profit to 215M Rupees",
            "Summary": "Foseco India reported Q1 net profit of 215 million rupees compared to 185 million rupees in the same period last year. Revenue increased to 1.57 billion rupees from 1.25 billion rupees year-over-year. EBITDA rose to 272 million rupees from 235 million rupees, though EBITDA margin declined to 17.27% from 18.83% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753790739531,
            "Source": "earnings"
        },
        {
            "Title": "Foseco India Reports Strong Q4 Financial Results",
            "Summary": "Foseco India has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 273 million rupees from 199 million rupees in the previous year, with the EBITDA margin rising to 18.38% from 16.22%. Net profit grew to 217 million rupees from 159 million rupees year-over-year, and 195 million rupees quarter-over-quarter. Revenue for Q4 reached 1.5 billion rupees, up from 1.23 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747232851000,
            "Source": "result"
        },
        {
            "Title": "Foseco India Reports Strong Q2 EBITDA Growth",
            "Summary": "Foseco India has announced its Q2 financial results, showing significant improvement in EBITDA and EBITDA margin compared to the same period last year. The company's EBITDA increased from 161 million rupees to 239 million rupees year-over-year. Additionally, the EBITDA margin expanded from 13.04% to 17.01% in the same period.",
            "Sentiment": "positive",
            "PublishDate": 1731506785000,
            "Source": "result"
        },
        {
            "Title": "Foseco India Reports Strong Q2 Financial Results",
            "Summary": "Foseco India has announced its Q2 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's net profit increased to 191 million rupees, up from 148 million rupees in the same quarter last year and 185 million rupees in the previous quarter. Revenue also saw a substantial rise, reaching 1.4 billion rupees compared to 1.23 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731506727000,
            "Source": "result"
        }
    ]
}