{
    "Symbol": "FSL",
    "ISIN": "INE684F01012",
    "News": [
        {
            "Title": "Firstsource Partners with Prosper AI for Healthcare RCM",
            "Summary": "Firstsource Solutions announces strategic partnership with Prosper AI to deploy voice AI technology across healthcare revenue cycle management, with early deployments showing significant improvements in Medicaid screenings and patient interactions.",
            "Sentiment": "positive",
            "PublishDate": 1770292518065,
            "Source": "stocks"
        },
        {
            "Title": "Firstsource Solutions Q3 FY26 Results Strong Growth",
            "Summary": "Firstsource Solutions reported robust Q3 FY26 results with revenue of ₹24,674.47 million, up 18.16% YoY, and net profit of ₹1,203.29 million. Board declared interim dividend of ₹5.50 per share.",
            "Sentiment": "positive",
            "PublishDate": 1770138507699,
            "Source": "co_actions_results"
        },
        {
            "Title": "Firstsource Grants 9.43 Lakh Stock Options to Employees",
            "Summary": "Firstsource Solutions approves grant of 9,43,000 stock options to eligible employees under ESOP 2019 plan. Board committee meeting held on February 3, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770117967963,
            "Source": "co_actions_results"
        },
        {
            "Title": "Firstsource Solutions Declares ₹5.50 Interim Dividend",
            "Summary": "Firstsource Solutions has announced an interim dividend of ₹5.50 per share for its shareholders, demonstrating the company's commitment to returning value to investors.",
            "Sentiment": "positive",
            "PublishDate": 1770117244650,
            "Source": "co_actions_results"
        },
        {
            "Title": "Firstsource Solutions Q3 Net Profit Drops 33% QoQ",
            "Summary": "Firstsource Solutions reported consolidated net profit of ₹1.2 billion in Q3, marking a significant decline of 33% from the previous quarter's ₹1.79 billion performance.",
            "Sentiment": "negative",
            "PublishDate": 1770117159033,
            "Source": "co_actions_results"
        },
        {
            "Title": "Firstsource Solutions Q3FY26 Results Call on Feb 3",
            "Summary": "Firstsource Solutions has scheduled a conference call with analysts and investors on February 3, 2026, at 5:00 PM IST to discuss Q3FY26 financial performance for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768916586081,
            "Source": "co_actions_results"
        },
        {
            "Title": "Firstsource acquires TeleMedik for $3M in US expansion",
            "Summary": "Firstsource Solutions acquired Puerto Rico-based TeleMedik for $3 million to strengthen its healthcare BPaaS offerings and expand presence in the US payer-provider ecosystem through enhanced digital capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1768325411354,
            "Source": "co_actions_results"
        },
        {
            "Title": "Firstsource Acquires TeleMedik to Expand U.S. Healthcare",
            "Summary": "Firstsource Solutions Limited announces acquisition of Puerto Rico-based TeleMedik to strengthen clinical and utilization management capabilities and expand presence in U.S. healthcare payer-provider markets.",
            "Sentiment": "positive",
            "PublishDate": 1768320756675,
            "Source": "co_actions_results"
        },
        {
            "Title": "Firstsource Subsidiary Acquires Telemedik for $3M",
            "Summary": "Firstsource Solutions' subsidiary completes acquisition of full ownership in Telemedik for up to $3 million, expanding the company's healthcare technology capabilities and market presence.",
            "Sentiment": "positive",
            "PublishDate": 1768317967944,
            "Source": "co_actions_results"
        },
        {
            "Title": "Firstsource Solutions Independent Director Passes Away",
            "Summary": "Firstsource Solutions announces the demise of Independent Director Mr. Sunil Mitra on January 12, 2026. The company acknowledges his valuable contributions during his tenure on the Board.",
            "Sentiment": "negative",
            "PublishDate": 1768231717304,
            "Source": "stocks"
        },
        {
            "Title": "Firstsource Recognized as Leader in Banking Operations",
            "Summary": "Firstsource Solutions earns dual analyst recognitions from Everest Group and NelsonHall for its Banking Operations capabilities, highlighting its AI-driven, outcome-oriented approach to banking process management.",
            "Sentiment": "positive",
            "PublishDate": 1767696198177,
            "Source": "stocks"
        },
        {
            "Title": "Firstsource Solutions Gets Credit Rating Upgrade",
            "Summary": "CRISIL revises outlook on Firstsource Solutions' long-term bank facilities to Positive from Stable while reaffirming CRISIL A+ rating. Short-term rating maintained at CRISIL A1.",
            "Sentiment": "positive",
            "PublishDate": 1765388131907,
            "Source": "stocks"
        },
        {
            "Title": "Firstsource Solutions Allots 77,660 Equity Shares Under Employee Stock Option Plans",
            "Summary": "Firstsource Solutions allotted 77,660 equity shares on December 10, 2025, under its Employee Stock Option Scheme-2003 and Employee Stock Option Plan 2019 following exercise of stock options. The allotment was approved by the Trustees of Firstsource Employee Benefit Trust and affects the company's share capital structure.",
            "Sentiment": "neutral",
            "PublishDate": 1765361685211,
            "Source": "corporate_action"
        },
        {
            "Title": "Firstsource Solutions Recognized as Global Leader in Generative AI Services by ISG Provider Lens 2025",
            "Summary": "Firstsource Solutions Limited earned Leader positions in both Strategy Consulting Services and Development Deployment Services quadrants for midsize companies in ISG Provider Lens 2025 Generative AI Services Study. The recognition reflects the company's ability to deliver scalable, responsible, and production-grade GenAI solutions through its integrated end-to-end approach combining domain expertise, AI innovation, and enterprise-grade orchestration platforms.",
            "Sentiment": "positive",
            "PublishDate": 1764843473541,
            "Source": "stock"
        },
        {
            "Title": "Firstsource Solutions Recognized as Leader in Digital Operations by ISG Provider Lens 2025",
            "Summary": "Firstsource Solutions Limited has been recognized as a Leader in Digital Operations in the ISG Provider Lens 2025 Contact Center-Customer Experience Services Quadrant Report. The recognition highlights the company's AI-first UnBPO framework, deep domain expertise across healthcare and telecom sectors, strategic acquisitions, and global delivery expansion capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1764067149433,
            "Source": "stock"
        },
        {
            "Title": "Firstsource Solutions Allots 30,831 Equity Shares Under Employee Stock Option Plans",
            "Summary": "Firstsource Solutions allotted 30,831 equity shares on November 19, 2025, under its ESOS 2003 and ESOP 2019 employee stock option schemes following exercise of stock options. The allotment was approved by the Trustees of Firstsource Employee Benefit Trust and affects the company's share capital structure for employee beneficiaries.",
            "Sentiment": "neutral",
            "PublishDate": 1763549103638,
            "Source": "corporate_action"
        },
        {
            "Title": "Firstsource Recognized as Leader in Avasant's Mortgage Business Process Transformation 2025 RadarView",
            "Summary": "Firstsource Solutions Limited has been recognized as a Leader for the second consecutive year in Avasant's Mortgage Business Process Transformation 2025 RadarView, highlighting the strength of its US-based mortgage arm, Sourcepoint, Inc. The recognition acknowledges Firstsource's end-to-end mortgage transformation expertise, AI-driven delivery model, and innovation in digital mortgage operations across origination, servicing, and default management.",
            "Sentiment": "positive",
            "PublishDate": 1763046753861,
            "Source": "stock"
        },
        {
            "Title": "Firstsource Solutions Allots 288,728 Equity Shares Under Employee Stock Option Plans",
            "Summary": "Firstsource Solutions Limited allotted 288,728 equity shares on November 12, 2025, under two employee stock option schemes - the Employee Stock Option Scheme-2003 (ESOS 2003) and the Employee Stock Option Plan 2019 (ESOP 2019 Plan). The allotment was made following the exercise of stock options granted under the company's ESOP 2019 Plan. The Trustees of Firstsource Employee Benefit Trust approved the allotment at 4:00 p.m. The company has informed the National Stock Exchange of India Limited and BSE Limited about this allotment.",
            "Sentiment": "neutral",
            "PublishDate": 1762958519844,
            "Source": "corporate_action"
        },
        {
            "Title": "Firstsource Solutions Invests in Applied AI to Enhance Enterprise Automation",
            "Summary": "Firstsource Solutions Limited has made a strategic investment in Applied AI, an AI workflow automation platform designed to transform complex enterprise processes. The investment supports Firstsource's UnBPO strategy, moving beyond traditional outsourcing to build technology-first operations. Applied AI's platform uses its Large Work Model to learn enterprise workflows and re-engineer them for higher efficiency. The collaboration will help clients automate compliance-heavy workflows with transparency and auditability, improve accuracy and speed through AI orchestration, and deliver measurable business outcomes across healthcare, financial services, insurance, and government sectors. Chairman Dr. Sanjiv Goenka emphasized this as a decisive step toward reimagining enterprise operations, while Applied AI's Founder CEO Arya Bolurfrushan highlighted the partnership's focus on redefining knowledge work through supervised automation and outcome-based pricing.",
            "Sentiment": "positive",
            "PublishDate": 1762863825712,
            "Source": "stock"
        },
        {
            "Title": "Firstsource Solutions Reports 20.1% Revenue Growth in Q2, Crosses $1 Billion Annual Revenue Mark",
            "Summary": "Firstsource Solutions delivered strong quarterly results with revenue growing 20.1% year-on-year to Rs. 23.1 billion (US$265 million). This marks the sixth consecutive quarter of double-digit year-on-year revenue growth and seventh straight quarter of sequential growth. The company achieved an EBIT margin of 11.5%, up 70 basis points year-on-year, marking the fourth consecutive quarter of margin expansion. Net profit reached Rs. 1.8 billion with diluted EPS of Rs. 2.54. The company signed four large deals during the quarter and added 10 new logos, including 4 strategic logos. Deal pipeline crossed $1 billion for the first time in company history. Headcount increased by 1,500 to 35,997 associates, the highest addition in six quarters. The company maintains revenue growth guidance of 13-15% for FY26 and EBIT margin guidance of 11.25-12%. Management expects accelerated growth trajectory in the second half of FY26, driven by ramping up of previously won deals including a Healthcare BPaaS deal expected to contribute from Q3.",
            "Sentiment": "positive",
            "PublishDate": 1762454879381,
            "Source": "earnings"
        },
        {
            "Title": "Firstsource Solutions Grants 677,000 Stock Options to Employees",
            "Summary": "Firstsource Solutions Limited's Nomination and Remuneration Committee approved the grant of 677,000 stock options to eligible employees of the company and its subsidiaries. Each option is exercisable into one equity share under the Firstsource Solutions Limited Employee Stock Option Plan 2019. The decision was made at a committee meeting held on November 4, 2025, in accordance with SEBI regulations for share-based employee benefits.",
            "Sentiment": "positive",
            "PublishDate": 1762309413952,
            "Source": "corporate_action"
        },
        {
            "Title": "Firstsource Solutions Makes Strategic Investment in AI Platform Lyzr.ai",
            "Summary": "Firstsource Solutions Limited announced a strategic investment in Lyzr.ai, an enterprise AI agent infrastructure platform. The investment advances Firstsource's UnBPO vision, which blends human capabilities with enterprise-grade AI to shift from traditional outsourcing to technology arbitrage. Lyzr.ai provides a private, full-stack agent infrastructure that enables organizations to build secure AI agents with comprehensive knowledge bases and governance. The platform is already being used across industries for customer experience, healthcare claims negotiation, banking KYC, IT ticketing, and legal contract intelligence. Dr. Sanjiv Goenka, Chairman of RPSG Group and Firstsource, stated the partnership accelerates creation of future-ready organizations through scalable AI agents for regulated environments. Lyzr.ai CEO Siva Surendira highlighted that the partnership will help Fortune 500 companies move AI from experimentation to production while building their Organizational General Intelligence.",
            "Sentiment": "positive",
            "PublishDate": 1762304132766,
            "Source": "stock"
        },
        {
            "Title": "Firstsource Solutions Targets Top-Quartile Revenue Growth Through OneFirstsource Strategy",
            "Summary": "Firstsource Solutions aims to achieve top-quartile revenue growth alongside margin expansion through its OneFirstsource strategy. The company is investing in AI-powered digital transformation, cross-sell opportunities, and large global deal wins to accelerate scale and efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1762267754244,
            "Source": "stock"
        },
        {
            "Title": "Firstsource Solutions Reports Strong Q2 Results with 20.1% Revenue Growth and Strategic Investments",
            "Summary": "Firstsource Solutions reported quarterly results with revenue of ₹23,122 million, up 20.1% year-over-year, and EBIT of ₹2,665 million representing 11.5% of revenues. The company added 1,500 net headcount and secured four large deal wins during the quarter. For the half-year period, revenue reached ₹45,299 million, up 21.9% year-over-year. The Board approved audited financial results and made a strategic minority investment in Applied AI during the quarter. The company appointed Ms. Jagriti Bhattacharya as Executive Vice President and General Counsel. Additionally, the Board approved a merger scheme between two wholly-owned subsidiaries (Firstsource Process Management Services Limited and Accunai India Services Private Limited) with Firstsource Solutions Limited, subject to regulatory approvals. The company maintained its FY26 revenue growth guidance of 13-15% in constant currency terms.",
            "Sentiment": "positive",
            "PublishDate": 1762263097696,
            "Source": "earnings"
        },
        {
            "Title": "FSL Forecasts 13-15% Revenue Growth and 11.25-12% EBIT Margin for FY26, Announces Investment in LYZR.AI",
            "Summary": "FSL has projected revenue growth of 13-15% for FY26 along with an EBIT margin target of 11.25-12.0% for the same period. The company has also disclosed a strategic investment in LYZR.AI.",
            "Sentiment": "positive",
            "PublishDate": 1762257293524,
            "Source": "stock"
        },
        {
            "Title": "Firstsource Solutions Reports Growth in Q2 Financial Results",
            "Summary": "Firstsource Solutions reported quarterly financial results showing growth across key metrics. Net profit increased to 1.79 billion rupees from 1.69 billion rupees in the previous quarter. Revenue rose to 23.15 billion rupees compared to 22 billion rupees quarter-on-quarter. EBIT grew to 2.66 billion rupees from 2.5 billion rupees, while EBIT margin improved to 11.51% from 11.25% in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762254622876,
            "Source": "earnings"
        },
        {
            "Title": "FSL Signs Partnership with Monash University for AI Innovation and Student Internships",
            "Summary": "FSL has entered into a partnership agreement with Monash University focused on artificial intelligence innovation. The collaboration involves co-developing advanced AI solutions and providing student internship opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1761906249091,
            "Source": "stock"
        },
        {
            "Title": "Firstsource Solutions Establishes New Canadian Subsidiary",
            "Summary": "Firstsource Solutions has formed a new subsidiary in Canada named Firstsource Solutions Canada Inc. The company has expanded its operations into the Canadian market through this new entity.",
            "Sentiment": "positive",
            "PublishDate": 1761746702246,
            "Source": "stock"
        },
        {
            "Title": "Firstsource Solutions Confirms No Impact from Proposed H-1B Visa Fee Changes",
            "Summary": "Firstsource Solutions Limited announced that proposed H-1B visa restrictions introduced by the US President on September 19, 2025, will have no impact on its workforce or business operations. The Business Process Management services provider stated it has zero dependency on the H-1B program, relying instead on local hiring and a globally distributed execution model. The company operates across multiple countries including the US, UK, India, Philippines, Mexico, Romania, Turkey, Trinidad & Tobago, South Africa, and Australia, serving industries such as Healthcare, Banking and Financial Services, Communications, Media and Technology, and Retail.",
            "Sentiment": "positive",
            "PublishDate": 1758463465242,
            "Source": "stock"
        },
        {
            "Title": "Firstsource Solutions Appoints Kumaran Shanmuhan as EVP and Chief Strategy Officer",
            "Summary": "Firstsource Solutions Limited appointed Mr. Kumaran Shanmuhan as Executive Vice President and Chief Strategy Officer, effective September 15, 2025. The appointment was approved by the Board of Directors based on the recommendation of the Nomination and Remuneration Committee. Shanmuhan brings over two decades of strategic leadership experience in technology, operations, and business transformation, with expertise in building and scaling consulting, product, platform, and go-to-market functions for high-growth SaaS and AI companies. He holds an MBA from the Kellogg School of Business and a graduate engineering degree from BITS Pilani. The appointment is on a full-time employment basis.",
            "Sentiment": "positive",
            "PublishDate": 1757933974013,
            "Source": "corporate_governance"
        },
        {
            "Title": "Firstsource Recognized as Horizon 3 Market Leader in HFS Mortgage Reinvention Report",
            "Summary": "Firstsource has been named a Horizon 3 Market Leader in the HFS Report on Mortgage Reinvention 2025. This recognition positions the company as a leader in the mortgage services sector according to the HFS research analysis.",
            "Sentiment": "positive",
            "PublishDate": 1756811535802,
            "Source": "stock"
        },
        {
            "Title": "Firstsource Partners with Guidehealth for AI-Enabled Value-Based Care Innovation",
            "Summary": "Firstsource has entered into a partnership with Guidehealth to accelerate AI-enabled value-based care innovation specifically targeting health plans. The collaboration focuses on advancing technology solutions in the healthcare sector.",
            "Sentiment": "positive",
            "PublishDate": 1755084436217,
            "Source": "stock"
        },
        {
            "Title": "Firstsource Solutions Named 'Star Performer' and 'Major Contender' in Everest Group's Financial Crime and Compliance Assessment 2025",
            "Summary": "Firstsource Solutions Limited received dual recognition as a 'Star Performer' and 'Major Contender' in Everest Group's Financial Crime and Compliance Operations Services PEAK Matrix Assessment 2025. The recognition reflects year-on-year improvement in market impact and vision & capability dimensions among 36 global providers. Everest Group highlighted Firstsource's strong UK presence, expansion from fraud specialization to end-to-end FCC operations, and AI-powered BPaaS delivery model. The Star Performer distinction is awarded selectively to providers showing substantial year-on-year progress. Key developments include AI-powered BPaaS model evolution covering AML, KYC, and fraud; GenAI-powered workforce training through FCC Academy; modular AI solutions like Firstsource relAI and Analyst Co-Pilot; and expansion of FCC delivery capabilities in North America while maintaining strong UK foundation.",
            "Sentiment": "positive",
            "PublishDate": 1754996343854,
            "Source": "stock"
        },
        {
            "Title": "Firstsource Releases FY25 ESG Report Highlighting Sustainability Progress",
            "Summary": "Firstsource Solutions Limited released its Environmental, Social, and Governance (ESG) Report for fiscal year 2024-25. The report showcases progress through the company's FirstConscious ESG framework and UnBPO operating philosophy. Key achievements include 26.26% renewable power usage (up 164% from previous year), commitment to SBTi near-term targets and Net Zero by 2050, and 46% gender diversity exceeding the 45% target. The company surpassed its impact hiring goal with 11,061 hires and received Great Place to Work certification across multiple countries. Firstsource achieved top 99th percentile on the Dow Jones Sustainability Index with CSA and ESG scores of 81, received a 'B' rating from CDP for Climate disclosures, and earned a Silver Medal from EcoVadis placing it in the top 15% globally. The company deployed ESGfirst Phase 1, its real-time ESG data platform, and maintained a 95% client satisfaction score.",
            "Sentiment": "positive",
            "PublishDate": 1754305507691,
            "Source": "stock"
        },
        {
            "Title": "Firstsource Solutions Reports 23.8% Revenue Growth, Raises FY26 Guidance to 13-15%",
            "Summary": "Firstsource Solutions reported revenue of Rs.22.2 billion for Q1FY26, marking 23.8% year-over-year growth and 20.7% growth in US dollar terms. The company achieved its seventh consecutive quarter of sequential revenue growth and fourth consecutive quarter of margin expansion, with EBIT margin at 11.3%. The company signed four large deals and added 17 new logos during the quarter, the highest quarterly addition in three years. Management raised the revenue guidance for FY26 to 13-15% in constant currency terms, up from the previous lower end of 12%. The healthcare vertical saw strong performance with all large deals coming from this segment, while the banking and financial services vertical remained flat quarter-over-quarter. The company announced a pending acquisition of Pastdue Credit Solutions in the UK for GBP 22 million, subject to regulatory approvals. Firstsource emphasized its UnBPO strategy, focusing on AI-driven solutions and outcome-based commercial models, with over 50% of business coming from non-linear commercial constructs compared to the industry average of 75% time-and-material billing.",
            "Sentiment": "positive",
            "PublishDate": 1754049541984,
            "Source": "earnings"
        },
        {
            "Title": "Firstsource Solutions Receives RBI Compounding Order for Delayed ESOP Filings",
            "Summary": "Firstsource Solutions Limited received a compounding order from the Reserve Bank of India dated July 29, 2025, under the Foreign Exchange Management Act, 1999. The order directs payment of Rs. 265,912 due to delayed filings of Form ESOP for the period between May 26, 2020 and June 10, 2020. The company states the order has no material impact on its financial, operations or other activities and has undertaken measures to address the issue.",
            "Sentiment": "neutral",
            "PublishDate": 1753887878681,
            "Source": "stock"
        },
        {
            "Title": "Firstsource Solutions Raises Revenue Growth Forecast as AI Implementation Drives Efficiency Gains",
            "Summary": "Firstsource Solutions has increased its full-year revenue growth forecast to 13-15% from the previous 12-15%, driven by strong deal wins and AI implementation. Chairman Sanjiv Goenka reported that AI is helping improve efficiency without adding headcount, contributing to margin improvement alongside a 13% reduction in attrition rates over eight quarters. The company won $434 million in annual contract value last year and achieved $95 million in the first quarter, with a current pipeline of $1.1 billion - 40% higher than recent quarters. Firstsource completed three acquisitions in 2024-25, including Past Due Credit Solutions for $22 million in July, which provides entry into the UK public utilities market. The company maintains its target of margin expansion toward mid-teen levels while implementing its 'un-BPO' strategy that combines AI with conventional business process outsourcing.",
            "Sentiment": "positive",
            "PublishDate": 1753874627002,
            "Source": "stock"
        },
        {
            "Title": "Firstsource Solutions Reports Strong Q1FY26 Results with 23.8% Revenue Growth",
            "Summary": "Firstsource Solutions delivered robust quarterly results with revenue reaching ₹22,177 million (US$259 million), marking a 23.8% year-over-year growth and 19.2% constant currency growth. The company's EBIT grew 26.8% to ₹2,498 million with margin expansion of 30 basis points to 11.3%. Profit after tax increased 25.2% to ₹1,693 million with earnings per share of ₹2.40. The business process services provider added 17 new client logos during the quarter, the highest quarterly addition in three years, and secured four large deal wins. The company maintained its revenue growth guidance of 13-15% constant currency for the full year and EBIT margin guidance of 11.25-12.0%. Firstsource's workforce stood at 34,495 employees with attrition improving to 28.9%. The company continues to invest in AI capabilities through its relAI suite and launched new platforms including Gigsourcing and Agentic AI Studio.",
            "Sentiment": "positive",
            "PublishDate": 1753863458057,
            "Source": "earnings"
        },
        {
            "Title": "Firstsource Solutions Reports Q1 Revenue Growth, Revises Currency Growth Guidance",
            "Summary": "Firstsource Solutions reported quarterly revenue of 22 billion rupees compared to 21.68 billion rupees in the previous quarter. The company's EBIT increased to 2.5 billion rupees from 2.42 billion rupees quarter-over-quarter, with EBIT margin improving to 11.27% from 11.17%. The company has updated its constant currency growth guidance to 13-15% from the previous range of 12-15%.",
            "Sentiment": "positive",
            "PublishDate": 1753861478410,
            "Source": "stock"
        },
        {
            "Title": "Firstsource Solutions Reports Q1 Consolidated Net Profit of 1.7 Billion Rupees",
            "Summary": "Firstsource Solutions posted a consolidated net profit of 1.7 billion rupees in Q1, compared to 1.61 billion rupees in the previous quarter, representing a quarter-on-quarter increase.",
            "Sentiment": "positive",
            "PublishDate": 1753861114408,
            "Source": "earnings"
        },
        {
            "Title": "Firstsource Solutions Establishes New Subsidiary in Dubai for Middle East Expansion",
            "Summary": "Firstsource Solutions has formed a new subsidiary in Dubai as part of its strategy to strengthen operations in the Middle East region.",
            "Sentiment": "positive",
            "PublishDate": 1753460524020,
            "Source": "stock"
        },
        {
            "Title": "Firstsource Solutions Incorporates Wholly Owned Subsidiary in Dubai to Expand BPO Operations",
            "Summary": "Firstsource Solutions Limited has incorporated a new wholly owned subsidiary named FIRSTSOURCE MIDDLE EAST SERVICES L.L.C. in Dubai, UAE on July 25, 2025. The subsidiary has an authorized capital of 300 shares at AED 1000 per share and operates in the Information Technology (BPO) sector. The company established this subsidiary to expand its BPO business in the Middle East region. Firstsource holds 100% shareholding through subscription to the share capital at face value. The newly incorporated entity has not yet commenced business operations and therefore has no turnover.",
            "Sentiment": "positive",
            "PublishDate": 1753460468034,
            "Source": "corporate_action"
        },
        {
            "Title": "Firstsource Solutions: Acquisition of UK's Pastdue Credit Solutions",
            "Summary": "Firstsource Solutions has agreed to acquire Pastdue Credit Solutions, a UK debt collection firm, to expand its presence in utilities, telecom, and public sector segments across the UK. The acquisition is pending FCA approval and aims to strengthen Firstsource's capabilities in a growing market with over £1.9 billion in opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1752843398000,
            "Source": "corporate_action"
        },
        {
            "Title": "Firstsource Solutions Acquires Pastdue Credit Solutions",
            "Summary": "Firstsource Solutions, a UK-based company, has acquired Pastdue Credit Solutions for £22 million. The acquisition was announced, but no further details about the terms or strategic rationale were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1752842175000,
            "Source": "default"
        },
        {
            "Title": "Firstsource Solutions to Review Q1 Results on July 30",
            "Summary": "Firstsource Solutions has announced that it will review its Q1 results on July 30. No additional details about the financial performance or expectations were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1751031538000,
            "Source": "default"
        },
        {
            "Title": "Firstsource Solutions Reports Q4 Financial Results",
            "Summary": "Firstsource Solutions announced its Q4 financial results. The company's consolidated net profit was 1.61 billion rupees, compared to 1.6 billion rupees in the previous quarter. Revenue increased to 21.68 billion rupees from 20.9 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745885418000,
            "Source": "default"
        },
        {
            "Title": "Firstsource Solutions Projects Strong Growth for FY26",
            "Summary": "Firstsource Solutions has presented an optimistic business outlook for FY26 in their investor presentation. The company anticipates a constant currency revenue growth of 12-15% and an EBIT margin of 11.25-12.0%.",
            "Sentiment": "positive",
            "PublishDate": 1745848230000,
            "Source": "default"
        },
        {
            "Title": "Firstsource Solutions Q4 Financial Results",
            "Summary": "Firstsource Solutions reported its Q4 financial results. The company's EBIT increased to 2.42 billion rupees from 2.33 billion rupees quarter-over-quarter. The EBIT margin remained steady at 11.17%. Revenue grew to 21.68 billion rupees from 20.9 billion rupees in the previous quarter. Consolidated net profit slightly increased to 1.61 billion rupees from 1.6 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745847964000,
            "Source": "result"
        },
        {
            "Title": "Firstsource Solutions: Q4 Profit Surges 20%, Secures Record Deal Wins",
            "Summary": "Firstsource Solutions reported a 20.4% YoY increase in Q4FY25 net profit to ₹160.68 crore. Revenue grew 29.4% to ₹2,161.5 crore. The company secured five large deals in Q4, totaling 14 for FY25. FY26 revenue growth is projected at 12-15% with operating margins of 11.25-12%.",
            "Sentiment": "positive",
            "PublishDate": 1745843546000,
            "Source": "earnings"
        },
        {
            "Title": "Firstsource Solutions Revises FY25 Revenue Growth Guidance Upward",
            "Summary": "Firstsource Solutions has updated its constant currency revenue growth guidance for the fiscal year 2025. The company has increased its projection to 21.8-22.3% from the previous estimate of 19.5-20.5%.",
            "Sentiment": "positive",
            "PublishDate": 1741651382000,
            "Source": "corporate_action"
        }
    ]
}