{
    "Symbol": "FUSION",
    "ISIN": "INE139R01012",
    "News": [
        {
            "Title": "Fusion Finance Q3FY26 Rights Issue Monitoring Report",
            "Summary": "Fusion Finance submitted Q3FY26 monitoring agency report by CRISIL for rights issue proceeds utilization. No utilization reported during quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770457767563,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fusion Finance Reports Q3FY26 PAT of ₹14 Cr",
            "Summary": "Fusion Finance Limited posted profit after tax of ₹14 crore in Q3 FY26 versus loss of ₹22 crore in Q2 FY26, with 23% QoQ growth in disbursements to ₹1,594 crore and improved NIM at 11.32%.",
            "Sentiment": "positive",
            "PublishDate": 1770392783945,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fusion Finance Gets Trading Approval for 14,765 Shares",
            "Summary": "Fusion Finance Limited receives trading approval from NSE and BSE for 14,765 equity shares converted from partly paid-up to fully paid-up shares, available for trading from February 05, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770208983068,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fusion Finance Q3 & 9M FY26 Earnings Call on Feb 9",
            "Summary": "Fusion Finance Limited announces earnings conference call scheduled for February 09, 2026 at 9:30 AM IST to discuss Q3 & 9M FY26 business performance and results under Regulation 30.",
            "Sentiment": "neutral",
            "PublishDate": 1769854715375,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fusion Finance Files Q3FY26 Compliance Disclosure",
            "Summary": "Fusion Finance Limited submits quarterly compliance officer and RTA details for Q3FY26, disclosing recent changes in compliance officer position and registrar appointments.",
            "Sentiment": "neutral",
            "PublishDate": 1769595894432,
            "Source": "stocks"
        },
        {
            "Title": "Fusion Finance receives NSE cautionary email on audit",
            "Summary": "Fusion Finance Limited received a cautionary email from NSE on January 27, 2026, regarding observations in its Secretarial Compliance Report for FY 2024-25, with no financial impact reported.",
            "Sentiment": "negative",
            "PublishDate": 1769587531081,
            "Source": "stocks"
        },
        {
            "Title": "Fusion Finance Gets Trading Approval for 5.66L Shares",
            "Summary": "Fusion Finance Limited receives trading approval from NSE and BSE for 5,66,562 equity shares converted from partly paid-up to fully paid-up status under ISIN INE139R01012, effective January 28, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769587452089,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fusion Finance Postal Ballot Results Announced",
            "Summary": "Fusion Finance Limited successfully passes two special resolutions through postal ballot with overwhelming shareholder support. Both resolutions regarding AOA amendment and MD appointment received 99%+ approval.",
            "Sentiment": "positive",
            "PublishDate": 1768007871088,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fusion Finance Shareholders Approve Key Resolutions",
            "Summary": "Fusion Finance Limited shareholders approved amendment to Articles of Association and appointment of Sanjay Gargali as Managing Director through postal ballot with overwhelming majority support.",
            "Sentiment": "positive",
            "PublishDate": 1768007653027,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fusion Finance Shareholders Approve Key Resolutions",
            "Summary": "Fusion Finance Limited shareholders approved amendment to Articles of Association and appointment of Sanjay Gargali as Managing Director through postal ballot with overwhelming majority support.",
            "Sentiment": "positive",
            "PublishDate": 1768007625036,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fusion Finance allots ₹150 cr debentures",
            "Summary": "Fusion Finance Limited's Working Committee approved allotment of 15,000 non-convertible debentures worth ₹150 crores at 10.95% interest rate with 30-month tenure on December 29, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767000850645,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fusion Finance Plans Fund Raising via Debentures",
            "Summary": "Fusion Finance Limited schedules Working Committee meeting on December 29, 2025, to consider fund raising through non-convertible debentures on private placement basis.",
            "Sentiment": "neutral",
            "PublishDate": 1766496641743,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fusion Finance Gets CARE A Rating on New NCD Issue",
            "Summary": "CARE Ratings assigns CARE A (RWN) rating to Fusion Finance's ₹150 crore NCD issue and continues rating watch with negative implications on ₹1,500 crore bank facilities amid covenant breaches.",
            "Sentiment": "negative",
            "PublishDate": 1765978222379,
            "Source": "stocks"
        },
        {
            "Title": "Fusion Finance allots ₹150 cr debentures",
            "Summary": "Fusion Finance Limited's Working Committee approved allotment of 15,000 secured non-convertible debentures worth ₹150 crores on private placement basis with 10.95% coupon rate and 30-month tenure.",
            "Sentiment": "positive",
            "PublishDate": 1765889733402,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fusion Finance Plans NCD Fundraising Discussion Dec 16",
            "Summary": "Fusion Finance has scheduled a board meeting on December 16th to discuss fundraising through Non-Convertible Debentures (NCDs), marking a potential capital raising initiative for the microfinance company.",
            "Sentiment": "neutral",
            "PublishDate": 1765462064947,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fusion Finance Seeks Shareholder Approval for Board Changes and MD Appointment via Postal Ballot",
            "Summary": "Fusion Finance Limited has issued a postal ballot notice seeking shareholder approval for amendments to its Articles of Association, including removal of founder promoter director nomination rights and board composition changes. The company also seeks approval for appointing Sanjay Garyali as Managing Director, with remote e-voting scheduled from December 9, 2025 to January 7, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1765208040388,
            "Source": "corporate_governance"
        },
        {
            "Title": "Fusion Finance Receives Improved Credit Ratings from ICRA with Outlook Revised to Stable",
            "Summary": "ICRA Limited assigned and reaffirmed credit ratings for Fusion Finance Limited's debt instruments totaling Rs. 555 crore, revising the outlook to Stable from Negative. The rating actions include ICRA [A-] (Stable) for Rs. 500 crore NCD and Rs. 55 crore subordinated debt, while withdrawing ratings on a previous Rs. 145 crore NCD instrument.",
            "Sentiment": "positive",
            "PublishDate": 1764243531484,
            "Source": "stock"
        },
        {
            "Title": "Fusion Finance Highlights Bihar as Strategic Market with ₹1,314 Crore Portfolio",
            "Summary": "Fusion Finance's MD & CEO participated in a media roundtable in Patna, emphasizing Bihar's importance as India's largest microfinance market with the company maintaining a ₹1,314 crore portfolio through 216 branches serving 4.52 lakh active accounts. The company reported strong collection efficiency of 98.81% in Q2 FY26 and outlined plans to deepen presence in Bihar through expanded microfinance and secured MSME loans while scaling digital solutions.",
            "Sentiment": "positive",
            "PublishDate": 1764144794120,
            "Source": "stock"
        },
        {
            "Title": "Fusion Finance Issues First and Final Call Notice for Rights Issue Shareholders",
            "Summary": "Fusion Finance Limited has issued a first and final call notice requiring holders of partly paid-up equity shares from its rights issue to pay ₹65.50 per share between November 27, 2025 and December 11, 2025. The company warns that failure to make payment by the deadline will result in 10% annual interest charges and potential forfeiture of shares along with amounts already paid.",
            "Sentiment": "neutral",
            "PublishDate": 1763109762045,
            "Source": "corporate_action"
        },
        {
            "Title": "Fusion Finance Expects Profitability in Second Half After Six Quarters of Losses",
            "Summary": "Warburg Pincus-backed Fusion Finance narrowed its net loss to ₹22 crore in July-September from ₹92 crore in the previous quarter, with CEO Sanjay Garwali targeting profitability in the third quarter. The NBFC-MFI plans to call the second tranche of ₹400 crore from its ₹800 crore rights issue and increase monthly loan disbursals to ₹550-600 crore from January, up from the current ₹450 crore.",
            "Sentiment": "positive",
            "PublishDate": 1763080977157,
            "Source": "stock"
        },
        {
            "Title": "Fusion Finance Reports No Deviation in Rights Issue Fund Utilization for September Quarter",
            "Summary": "Fusion Finance Limited reported no deviation or variation in the use of proceeds from its rights issue of equity shares for the quarter ended September 30, 2025. The company raised INR 399.93 crore through allotment of 6,10,58,392 partly paid-up equity shares at INR 131 per share on May 2, 2025, as part of a total rights issue size of INR 799.86 crore. The funds are being utilized to augment the company's capital base to meet future capital requirements, as originally stated in the Letter of Offer dated March 29, 2025. The remaining INR 65.50 per share is to be paid in subsequent calls by March 31, 2027. The statement was reviewed by the company's Audit Committee in its meeting held on August 8, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762281186943,
            "Source": "corporate_action"
        },
        {
            "Title": "Fusion Finance Reports 37% QoQ Growth in Disbursements, Narrows Loss to INR 22 Crore in Q2FY26",
            "Summary": "Fusion Finance Limited reported quarterly results for September 2025, showing total loan disbursements of INR 1,298 crore, up 37% quarter-on-quarter. Loss after tax reduced significantly to INR 22 crore from INR 92 crore in the previous quarter. The company's Assets Under Management stood at INR 7,038 crore with 25.8 lakh active borrowers across 1,545 branches. Net Interest Margin improved to 10.85% from 10.29% in Q1FY26. Gross NPA declined to 4.61% from 5.43% in the previous quarter. The Board approved issuance of non-convertible debentures worth up to INR 1,000 crore and up to INR 100 crore in separate tranches through private placement. Additionally, founder and director Devesh Sachdev resigned with immediate effect citing personal reasons, and the Board approved making a first and final call on partly paid-up equity shares of Rs 65.50 per share with November 11, 2025 as the record date.",
            "Sentiment": "positive",
            "PublishDate": 1762280221132,
            "Source": "earnings"
        },
        {
            "Title": "Fusion Finance Reports Reduced Net Loss and Revenue Decline in Q2 Results",
            "Summary": "Fusion Finance reported a net loss of 221.4 million rupees in Q2, significantly lower than the previous year's loss of 3.05 billion rupees. The company's revenue declined to 4.16 billion rupees from 6.9 billion rupees year-over-year. The Gross Non-Performing Assets (GNPA) ratio improved to 4.61% from 5.43% quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762270063565,
            "Source": "earnings"
        },
        {
            "Title": "Fusion Finance Limited Schedules Q2 FY2025-26 Earnings Conference Call",
            "Summary": "Fusion Finance Limited has announced its Q2 FY2025-26 earnings conference call scheduled for Thursday, November 6, 2025, at 9:30 AM IST. The call will discuss the company's business performance and results for the quarter and first half of FY26. The management team will be represented by Managing Director & CEO Sanjay Garyali, Interim CFO Amandeep Singh, COO-MFI Sunil Mundra, COO-MSME Jitender Sharma, and Company Secretary Vikrant Sadana, along with senior management. The company has provided multiple dial-in numbers for different regions and a pre-registration option to avoid wait times.",
            "Sentiment": "neutral",
            "PublishDate": 1761903385983,
            "Source": "earnings"
        },
        {
            "Title": "Fusion Finance Limited Obtains IRDAI License to Act as Corporate Insurance Agent",
            "Summary": "Fusion Finance Limited has received a Certificate of Registration from the Insurance Regulatory and Development Authority of India (IRDAI) to operate as a Corporate Agent (Composite) under the Insurance Act, 1938. The three-year license enables the company to solicit insurance products to its customers, expanding its service offerings beyond its current business operations.",
            "Sentiment": "positive",
            "PublishDate": 1761132353708,
            "Source": "stock"
        },
        {
            "Title": "Fusion Finance Shareholders Approve Four Director Appointments Through Postal Ballot",
            "Summary": "Fusion Finance Limited announced that shareholders have approved four resolutions through postal ballot voting. The approved appointments include Sanjay Garyali as Director and Whole-time Director with remuneration fixation, Rajeev Sardana as Non-Executive Independent Director with remuneration, and Hemant Omprakash Mundra as Non-Executive Director. The postal ballot was conducted through remote e-voting with 86,402 total shareholders on record date of September 12, 2025. All four resolutions passed with requisite majority, with voting percentages ranging from 96.36% to 99.998% in favor. The scrutinizer's report was submitted on October 21, 2025, confirming the validity of the voting process.",
            "Sentiment": "positive",
            "PublishDate": 1761063932003,
            "Source": "corporate_action"
        },
        {
            "Title": "Fusion Finance Receives Income Tax Appeals for Rs 27.8 Crore Disputed Tax Demands",
            "Summary": "Fusion Finance Limited received intimations regarding two income tax appeals filed by the Income Tax Officer with the Income Tax Appellate Tribunal in New Delhi. The appeals challenge orders that deleted tax demands totaling Rs 27.8 crore across two assessment years. For AY 2020-21, the disputed demand is Rs 16.62 crore (tax liability Rs 9.55 crore plus interest Rs 7.07 crore). For AY 2021-22, the disputed amount is Rs 11.18 crore (tax liability Rs 7.10 crore plus interest Rs 4.08 crore). The disputes relate to alleged non-deduction or lower deduction of tax on interest payments made to foreign NCD holders, where the company was treated as 'deemed to be an assessee in default'. The tax authority alleged that interest payments should attract 20% withholding tax instead of the 5% already withheld by the company. The company had successfully appealed earlier orders, resulting in deletion of the demands, but the Income Tax Officer has now challenged these favorable decisions before the tribunal.",
            "Sentiment": "negative",
            "PublishDate": 1760703576918,
            "Source": "stock"
        },
        {
            "Title": "Fusion Finance Appoints Sanjay Garyali as Managing Director, Devesh Sachdev Steps Down",
            "Summary": "Fusion Finance Limited has appointed Sanjay Garyali as Managing Director & Chief Executive Officer, replacing Devesh Sachdev who resigned from the Managing Director position due to personal reasons but will continue as a director on the Board. Garyali, who has been serving as the company's CEO since March 2025, brings over 28 years of experience in the finance industry and previously managed a portfolio worth INR 40,000 crore at L&T Finance's Urban Finance business. The company also appointed Gautam Munjal as Head of Internal Audit, who brings over 26 years of experience across leading financial institutions in the BFSI sector. The Board stated that Garyali's appointment is part of the company's strategy to strengthen its executive leadership team for the next phase of growth.",
            "Sentiment": "neutral",
            "PublishDate": 1759250111638,
            "Source": "corporate_governance"
        },
        {
            "Title": "Fusion Finance Limited Receives GST Show Cause Notice for Rs 2.84 Crore",
            "Summary": "Fusion Finance Limited received a show cause notice from the Joint Commissioner Corporate Circle, Varanasi, Uttar Pradesh under section 73 of CGST Act. The company has been directed to pay Rs 2,84,36,461 in total, comprising Rs 1,56,16,579 as tax amount, Rs 1,12,43,938 as interest and Rs 15,75,944 as penalty. The notice relates to alleged excess Input Tax Credit (ITC) claimed and non-reversal of ITC as per rule 42/43 of CGST Act, 2017 during April 2021 to March 2022. The company believes it has adequate legal grounds to substantiate its position and does not expect any material impact on its financial, operational or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1758889454617,
            "Source": "stock"
        },
        {
            "Title": "Fusion Finance Limited Makes Q1 FY25-26 Earnings Call Transcript Available",
            "Summary": "Fusion Finance Limited has made the transcript of its Q1 FY25-26 earnings conference call available on its website. The call discussed the company's unaudited financial results for the quarter ended June 30, 2025. The earnings call was held on August 11, 2025, from 9:30 AM to 10:35 AM IST. The transcript can be accessed through the company's website at www.fusionfin.com.",
            "Sentiment": "neutral",
            "PublishDate": 1755521821769,
            "Source": "earnings"
        },
        {
            "Title": "Fusion Financial Limited Announces Major Leadership Restructuring with New Director Appointments",
            "Summary": "Fusion Financial Limited has appointed Mr. Rajeev Sardana as Additional Non-Executive Independent Director and Mr. Sanjay Garyali as Additional Director designated as Whole Time Director, both for 5-year terms effective August 18, 2025, subject to shareholder approval. Sardana brings over three decades of financial services experience from HDFC Ltd., while Garyali, who has been serving as CEO since March 2025, has 28 years of finance industry experience including managing a INR 40,000 crore portfolio at L&T Finance. The company also announced the resignation of Company Secretary Deepak Madaan and Head of Internal Audit Vikas Jagdish Jajoo, both effective August 17, 2025. To fill these positions, the board appointed Vikrant Sadana as Company Secretary & Compliance Officer, Nishant Monga as Chief Compliance Officer, and Satish Mani as Interim Head of Internal Audit, all effective August 18, 2025. The changes are part of the company's strategy to strengthen governance and compliance frameworks to support its growth plans.",
            "Sentiment": "positive",
            "PublishDate": 1755419588203,
            "Source": "corporate_governance"
        },
        {
            "Title": "Fusion Finance Plans MSME Focus, Expects Q3 Turnaround After Five-Quarter Loss Streak",
            "Summary": "Microfinance company Fusion Finance is targeting a turnaround from the third quarter while shifting focus toward micro, small and medium enterprises to reduce concentration risk. CEO Sanjay Garyali announced plans to increase MSME lending share to 18-20% over two years from the current 8%. The company's assets under management declined 37% year-on-year to ₹7,688 crore at June-end from ₹12,193 crore, following reduced disbursals to overleveraged borrowers. Collection efficiency improved to 98.6% from 96.6% nine months earlier, with 44% of AUM comprising new loans averaging 6 months life showing better repayment records. Fusion reported five consecutive quarterly losses, including a ₹92 crore loss in Q1 after a ₹1,225 crore annual loss in FY25. The CEO expects declining credit costs in the second quarter to move closer to profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754961397946,
            "Source": "stock"
        },
        {
            "Title": "Fusion Finance Appoints Jitender Sharma as Deputy COO for MSME Business",
            "Summary": "Fusion Finance Limited appointed Jitender Sharma as Deputy Chief Operating Officer - MSME Business, effective August 11, 2025. Sharma brings over 17 years of experience in banking and finance, with specialization in home finance and Loan Against Property. He previously served as Executive Vice President at Kotak Mahindra Bank and has worked across housing finance sales, credit operations, and LAP portfolios in multiple geographies. Sharma began his career in statutory audit before transitioning to senior banking leadership roles.",
            "Sentiment": "positive",
            "PublishDate": 1754927252369,
            "Source": "corporate_governance"
        },
        {
            "Title": "Fusion Finance Limited Uploads Q1 FY25-26 Earnings Call Audio Recording",
            "Summary": "Fusion Finance Limited has made available the audio recording of its Q1 FY25-26 earnings conference call on its website at www.fusionfin.com. The call discussed the company's unaudited financial results for the quarter ended June 30, 2025, and took place on August 11, 2025, from 9:30 AM to 10:35 AM IST. The company indicated that a transcript of the call will be shared with stock exchanges and uploaded to the website later. The audio recording can be accessed through a direct link provided on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1754907846270,
            "Source": "earnings"
        },
        {
            "Title": "Fusion Finance Reports Q1 FY26 Results with Improved Credit Costs and Portfolio Quality",
            "Summary": "Fusion Finance Limited reported quarterly results with AUM of ₹7,688 crores, down 14% quarter-on-quarter from ₹8,980 crores. The company disbursed ₹950 crores with enhanced guardrails, focusing on quality over growth. Credit costs improved sequentially for the third consecutive quarter to ₹178 crores from ₹253 crores in Q4 FY25. GNPA improved to 5.43% from 7.92% in the previous quarter, while NNPA declined to 0.19% from 0.30%. Current collection efficiency improved to 98.5% versus 96.24% in Q1 FY25. The company maintains strong liquidity of ₹724 crores and CRAR of 29.52%. Net worth increased 18% quarter-on-quarter to ₹1,943 crores. The company reported a net loss of ₹92 crores compared to ₹165 crores loss in Q4 FY25. NIM expanded to 10.29% from 8.6% in the previous quarter. The company operates 1,560 branches across 22 states serving 28.5 lakh active clients.",
            "Sentiment": "positive",
            "PublishDate": 1754829942290,
            "Source": "earnings"
        },
        {
            "Title": "Fusion Finance Reports Widened Net Loss and Revenue Decline in Q1 Results",
            "Summary": "Fusion Finance reported a net loss of 922.5 million rupees in Q1, significantly higher than the 356.2 million rupees loss in the same quarter last year. The company's revenue declined to 4.22 billion rupees compared to 6.21 billion rupees in the previous year's corresponding quarter, representing a substantial year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1754663968346,
            "Source": "earnings"
        },
        {
            "Title": "Fusion Finance Ltd.: CLSA Maintains 'Underperform' Rating Amid Cautious Growth Outlook",
            "Summary": "CLSA keeps 'underperform' rating on Fusion Finance Ltd. with Rs 155 target price. Management expects Q1 FY26 disbursals similar to Q4 FY25. Company categorizes states for growth strategy. Net slippage at 13-14% annualized. Rights issue provides comfort. Customers with multiple lenders reduced to 13%. Stage 3 assets at 7.9% with 96.5% Provision Coverage Ratio.",
            "Sentiment": "neutral",
            "PublishDate": 1748316331000,
            "Source": "normal_news"
        },
        {
            "Title": "Fusion Finance: Microfinance Lender Reports Fourth Consecutive Quarterly Loss",
            "Summary": "Fusion Finance reported a net loss of Rs 165 crore in Q4 FY25, marking its fourth consecutive quarterly loss. The company's annual net loss stood at Rs 1225 crore. Gross NPA ratio was 7.92% at the end of March. The company breached financial covenants on borrowings of Rs 4763 crore, making them repayable on demand. Extensions have been obtained for Rs 4080 crore, with discussions ongoing for the remainder.",
            "Sentiment": "negative",
            "PublishDate": 1748079941000,
            "Source": "earnings"
        },
        {
            "Title": "Fusion Finance Limited: Rights Issue Oversubscribed 1.5 Times",
            "Summary": "Fusion Finance Limited successfully completed its ₹800 crore rights issue with 1.5 times oversubscription. The issue comprised 6.11 million partly paid-up equity shares at ₹131 per share. The capital raised will strengthen the company's balance sheet and enhance its capital adequacy ratio. Fusion Finance serves 3.66 million clients and reported an Asset Under Management of ₹10,599.37 crore as of December 31, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1747035300000,
            "Source": "corporate_action"
        },
        {
            "Title": "Fusion Finance: Former L&T Finance CEO Sanjay Garyali Appointed as New Chief Executive",
            "Summary": "Sanjay Garyali, former CEO of L&T Financial Services, has been appointed as the new CEO of microfinance lender Fusion Finance, effective March 17, 2025. Garyali brings 28 years of finance industry experience and will face the challenge of turning around the company, which reported a net loss of ₹1,060 crore for the nine months ended December 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1741974347000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Fusion Finance: Rs 800 Crore Rights Issue to Boost Capital Adequacy",
            "Summary": "Fusion Finance plans to raise Rs 800 crore through a rights issue to enhance capital adequacy and strengthen its balance sheet. The company's capital adequacy ratio is expected to exceed 30% post-issue. Q3 results show improved business parameters and a higher-quality loan portfolio. MSME lending division shows growth with strong asset quality.",
            "Sentiment": "positive",
            "PublishDate": 1740047364000,
            "Source": "corporate_action"
        },
        {
            "Title": "Fusion Finance Limited: ₹800 Crore Rights Issue Planned",
            "Summary": "Fusion Finance Limited announced plans for a rights issue to raise up to ₹800 crores through partly paid-up equity shares. The board approved this capital-raising initiative on December 4-5, 2024. The company will file a draft letter of offer with SEBI, BSE, and NSE.",
            "Sentiment": "positive",
            "PublishDate": 1733464767000,
            "Source": "corporate_action"
        },
        {
            "Title": "Fusion Finance: Rs 800 Crore Rights Issue Approved Amid MFI Stress",
            "Summary": "Fusion Finance's board approved raising up to Rs 800 crore through a rights issue, increasing from the previously approved Rs 550 crore. The company is facing covenant breaches on over Rs 5,600 crore of borrowings due to high bad loans and a credit rating downgrade. This fundraising is crucial as the company negotiates with lenders for a 12-month waiver on immediate repayment demands.",
            "Sentiment": "neutral",
            "PublishDate": 1733336095000,
            "Source": "corporate_action"
        },
        {
            "Title": "Fusion Finance: Crisil Downgrades Long-Term Bank Loan Rating",
            "Summary": "Crisil Ratings has downgraded Fusion Finance's long-term bank loan facility rating to 'A' from 'A+/ negative' and placed it under rating watch. The Rs 50 crore commercial paper rating was also downgraded to 'A1' from 'A1+'.",
            "Sentiment": "negative",
            "PublishDate": 1732759553000,
            "Source": "normal_news"
        },
        {
            "Title": "Fusion Finance Refutes 'Going Concern' Report",
            "Summary": "Fusion Finance has issued a clarification regarding a report suggesting the company may cease to be a going concern. The company states that this report is factually incorrect and misleading. Fusion Finance emphasizes that it has not requested any moratorium from any lender, contrary to what may have been implied in the report.",
            "Sentiment": "neutral",
            "PublishDate": 1732022487000,
            "Source": "normal_news"
        },
        {
            "Title": "Fusion Finance: Going Concern Status at Risk, Warns Deloitte",
            "Summary": "Deloitte Haskins and Sells warns Fusion Finance may lose its 'going concern' status without a 12-month loan moratorium or new funding. The NBFC-MFI reported a Q2 FY25 net loss of Rs 305 crore, with gross NPAs rising to 9.4%. The company is negotiating with lenders for repayment waivers.",
            "Sentiment": "negative",
            "PublishDate": 1731918274000,
            "Source": "result"
        },
        {
            "Title": "Fusion Finance: Q2 Loss Widens Despite Revenue Growth",
            "Summary": "Fusion Finance reported Q2 2024 results with a loss of ₹305.04 crore, despite 25.16% YoY revenue growth. Operating income declined 259.2% QoQ. EPS decreased to ₹14.52. Analysts consensus recommends Sell.",
            "Sentiment": "negative",
            "PublishDate": 1731737129000,
            "Source": "result"
        },
        {
            "Title": "Fusion Micro Finance: Board Approves Rs 550 Crore Rights Issue",
            "Summary": "<p><span class='neutral'>Fusion Micro Finance's</span> board has <span class='positive'>approved</span> raising up to <b>Rs 550 crore</b> through a <span class='neutral'>rights issue</span>. The board also <span class='positive'>approved</span> <span class='positive'>increasing</span> the authorized share capital from <b>Rs 105 crore</b> to <b>Rs 200 crore</b>. These decisions were made at a board meeting held on <b>October 5, 2024</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728114300000,
            "Source": "corporate_action"
        }
    ]
}