{
    "Symbol": "GABRIEL",
    "ISIN": "INE524A01029",
    "News": [
        {
            "Title": "Gabriel India Equity Meet Set for March 18, 2026",
            "Summary": "Gabriel India Limited schedules equity shareholders meeting for March 18, 2026 to approve composite scheme of arrangement involving Anchemco India and Asia Investments amalgamation and demerger.",
            "Sentiment": "neutral",
            "PublishDate": 1770709703389,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gabriel India Q3 Revenue Rises 15.7% to ₹11.8B",
            "Summary": "Gabriel India reported Q3 consolidated revenue of ₹11.8 billion, up 15.7% YoY, while net profit declined 9.0% to ₹547 million compared to ₹601 million in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1770105988903,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gabriel India CPO Prashant Shah Retires Jan 31",
            "Summary": "Gabriel India Limited announces retirement of Chief Purchase Officer Mr. Prashant Shah effective January 31, 2026, as disclosed under SEBI Regulation 30 compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1769883468207,
            "Source": "stocks"
        },
        {
            "Title": "Gabriel India schedules Q3FY26 earnings call for Feb 3",
            "Summary": "Gabriel India Limited has scheduled an earnings call on February 3, 2026, at 5:00 PM IST to discuss Q3 FY 2025-26 operational and financial performance with investors and shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1769507982088,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gabriel India Clarifies Price Movement to BSE",
            "Summary": "Gabriel India Limited responds to BSE inquiry about significant price movement, stating company is unaware of reasons behind the volatility and confirms no undisclosed price-sensitive information.",
            "Sentiment": "neutral",
            "PublishDate": 1766381194015,
            "Source": "stocks"
        },
        {
            "Title": "Gabriel India Joint Venture with SK Enmove Progresses with Incorporation Activities Underway",
            "Summary": "Gabriel India has begun incorporation activities for its joint venture agreement with SK Enmove, marking progress in the partnership formation. The company expects to receive final regulatory approvals by December 31, 2025, which will complete the joint venture establishment process.",
            "Sentiment": "neutral",
            "PublishDate": 1764555669758,
            "Source": "corporate_action"
        },
        {
            "Title": "Gabriel India Receives BSE No-Objection Letter for Composite Scheme of Arrangement",
            "Summary": "Gabriel India Limited received a no-adverse observation letter from BSE Limited on November 18, 2025, for its proposed composite scheme involving amalgamation of Anchemco India Private Limited with Asia Investments Private Limited and demerger of automotive undertaking into Gabriel India Limited. The company will now proceed to file the scheme with the National Company Law Tribunal, Mumbai Bench, with the scheme's effectiveness subject to NCLT approval and other necessary regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1763487941974,
            "Source": "corporate_action"
        },
        {
            "Title": "Gabriel India Reports 14.7% Revenue Growth in H1FY26, Announces Multiple Strategic Joint Ventures",
            "Summary": "Gabriel India Limited reported revenue of Rs. 27,882 million for H1FY26, marking a 14.7% year-over-year growth. The company's EBITDA stood at Rs. 2,346 million with an 8.4% margin, while PAT reached Rs. 1,330 million with a 4.8% margin. The company announced several strategic partnerships including joint ventures with Jinhap Korea for fasteners business (Rs. 268 million investment for 51% stake) and SK Enmove for lubricants and functional fluids (49:51 shareholding with Rs. 294 million infusion). Gabriel also revised its sunroof joint venture arrangement with Inalfa, where Inalfa will hold 35% and Gabriel 65% in IGSSPL. The company completed acquisition of additional capacity through Chakan-2 plant from Marelli Motherson Auto Suspension, adding 3.2 million shock absorbers and 1 million gas springs capacity. Export sales grew 59.5% year-over-year, while aftermarket business increased 8.5%. The company maintains a net cash position of Rs. 2,896 million and achieved capex of Rs. 1,083 million in H1FY26.",
            "Sentiment": "positive",
            "PublishDate": 1762991144118,
            "Source": "earnings"
        },
        {
            "Title": "Gabriel India Reports Quarterly Results and Declares Rs. 1.90 Interim Dividend",
            "Summary": "Gabriel India Limited announced its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company's Board of Directors approved an interim dividend of Rs. 1.90 per share with face value of Re. 1 each. The record date for dividend payment is set for November 21, 2025, with payment to be made on or before December 11, 2025. The financial results include statements of assets and liabilities and cash flow statements for the reporting period. The results were reviewed by PriceWaterhouseCoopers Chartered Accountants LLP, who provided a limited review report confirming the statements were prepared in accordance with Indian Accounting Standards.",
            "Sentiment": "neutral",
            "PublishDate": 1762984656008,
            "Source": "corporate_action"
        },
        {
            "Title": "Gabriel India Revises Joint Venture Structure with Inalfa, Reduces Partner's Stake to 35%",
            "Summary": "Gabriel India's board approved a revised joint venture agreement with Inalfa Roof Systems Group B.V. for their subsidiary Inalfa Gabriel Sunroof Systems Private Limited (IGSSPL). The new structure reduces Inalfa's shareholding from the previously proposed 51% to 35%, while Gabriel India will hold 65%. This revision follows the rejection of Inalfa's PN3 approval application by the Ministry of Heavy Industries in August 2024. The board also approved execution of multiple agreements including an amended Technical Collaboration and Alliance Agreement, addendum to Corporate Service Agreement with Anand Automotive Private Limited, Brand License Agreement for exclusive use of Inalfa trademarks in India, and Investment Agreement for Inalfa's 35% stake acquisition. Gabriel India will retain majority control of IGSSPL and will reduce its ownership from 100% to 65% following the transaction. All agreements are subject to requisite corporate and regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1762950965363,
            "Source": "order&deals"
        },
        {
            "Title": "Gabriel India Reports 15% Growth in Net Profit for Q2",
            "Summary": "Gabriel India reported net profit of 606.5 million rupees for Q2, compared to 527 million rupees in the same period last year. Revenue increased to 10.66 billion rupees from 9.24 billion rupees year-over-year. EBITDA rose to 923 million rupees from 791 million rupees, while EBITDA margin improved slightly to 8.66% from 8.57%.",
            "Sentiment": "positive",
            "PublishDate": 1762949825579,
            "Source": "earnings"
        },
        {
            "Title": "Gabriel India Extends Joint Venture Agreement Closing Date to December 31, 2025",
            "Summary": "Gabriel India Limited has extended the closing date for its Joint Venture Agreement with Jinos Co., Ltd. and Jinhap Automotive India Private Limited from October 31, 2025, to December 31, 2025. The extension allows additional time to complete remaining conditions precedent for the joint venture. The closing date also serves as the effective date of the Joint Venture Agreement as defined in the Share Subscription Agreement.",
            "Sentiment": "neutral",
            "PublishDate": 1761919996850,
            "Source": "order&deals"
        },
        {
            "Title": "Gabriel India Limited Executes Joint Venture Agreement with SK Enmove Co., Ltd.",
            "Summary": "Gabriel India Limited has formally executed a Joint Venture Agreement with SK Enmove Co., Ltd. on October 15, 2025. This follows the company's earlier intimation about the proposed joint venture that was made on October 7, 2025. The execution of the agreement was communicated to both the National Stock Exchange of India Limited and BSE Limited by Company Secretary Nilesh Jain.",
            "Sentiment": "positive",
            "PublishDate": 1760549430564,
            "Source": "order&deals"
        },
        {
            "Title": "Gabriel India Forms Joint Venture with SK Enmove for Engine Oils and Lubricants Business",
            "Summary": "Gabriel India Limited has established a joint venture with SK Enmove Co., Ltd focusing on engine oils and lubricants. Gabriel will invest up to ₹29.40 crores to acquire a 49% stake in the joint venture partnership.",
            "Sentiment": "positive",
            "PublishDate": 1759817923230,
            "Source": "order&deals"
        },
        {
            "Title": "Gabriel India Reports 7.5% Growth in Q1 Net Profit to 619 Million Rupees",
            "Summary": "Gabriel India reported consolidated net profit of 619 million rupees in Q1, up from 576 million rupees in the same period last year. Revenue increased to 10.98 billion rupees from 9.46 billion rupees year-over-year. EBITDA rose to 875 million rupees from 779 million rupees, though EBITDA margin declined slightly to 8.9% from 9.02% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753775552462,
            "Source": "earnings"
        },
        {
            "Title": "Gabriel India Reports 8.8% Growth in Quarterly Net Profit to 557 Million Rupees",
            "Summary": "Gabriel India announced quarterly net profit of 557 million rupees compared to 512 million rupees in the same period last year, representing year-over-year growth. The auto component manufacturer's profit increased by 45 million rupees from the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753775011060,
            "Source": "earnings"
        },
        {
            "Title": "Gabriel India Schedules Q1 FY 2025-26 Earnings Call for July 30, 2025",
            "Summary": "Gabriel India Limited has scheduled an earnings call with investors and shareholders on July 30, 2025, at 10:30 AM IST to discuss the company's operational and financial performance for Q1 FY 2025-26. The call will feature Managing Director Atul Jaggi and Chief Financial Officer Mohit Srivastava as participants. The company has provided access numbers for various regions including India, USA, UK, Singapore, and Hong Kong, with pre-registration required through a provided link.",
            "Sentiment": "neutral",
            "PublishDate": 1753341639094,
            "Source": "corporate_action"
        },
        {
            "Title": "Gabriel India Schedules Board Meeting on July 29, 2025 to Approve Quarterly Financial Results",
            "Summary": "Gabriel India Limited will hold a Board of Directors meeting on July 29, 2025 to consider and approve the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company has notified both the National Stock Exchange of India Limited and BSE Limited about this scheduled board meeting. Company Secretary Nilesh Jain signed the notice dated July 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753181942357,
            "Source": "corporate_action"
        },
        {
            "Title": "Gabriel India: Stock Surges 41% on Strategic Reorganization",
            "Summary": "Gabriel India's stock jumped 41% in a week following a proposed reorganization of subsidiaries. The plan aims to consolidate automotive products under one entity, increasing promoter stake to 63.5%. Analysts have raised EPS targets for FY27 by 36%, with projections of significant revenue and profit growth.",
            "Sentiment": "positive",
            "PublishDate": 1752109446000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gabriel India: Hits 20% Upper Circuit for Second Day, Reaches New High",
            "Summary": "Gabriel India's stock hit a 20% upper circuit for the second consecutive day, reaching a fresh high. The company announced a major business restructuring plan, including the integration of Anchemo India Pvt. with Asia Investments Pvt. and subsequent demerger of Anchemo's automotive business to merge with Gabriel India.",
            "Sentiment": "positive",
            "PublishDate": 1751429666000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gabriel India Ltd: Auto Business Consolidation via Share Swap Announced",
            "Summary": "Gabriel India announced a scheme to merge Anchemco India into Asia Investments, followed by demerging automotive undertakings into Gabriel India. The company will issue 1,158 shares for every 1,000 shares of AIPL. This move aims to simplify group structure and expand presence, targeting ₹50,000 crore revenue by 2030. The deal is valued at 8x FY2025 EV/EBITDA and awaits various approvals.",
            "Sentiment": "positive",
            "PublishDate": 1751331822000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gabriel India Approves Strategic Composite Scheme for Business Expansion",
            "Summary": "Gabriel India has approved a strategic composite scheme to expand its business into multi-product mobility solutions. The company aims to diversify its offerings beyond its current focus, potentially entering new segments within the mobility sector.",
            "Sentiment": "positive",
            "PublishDate": 1751328346000,
            "Source": "default"
        },
        {
            "Title": "Gabriel India Approves Plan to Expand Multi-Product Mobility Solutions",
            "Summary": "Gabriel India has approved a plan to broaden its range of multi-product mobility solutions. The company aims to diversify its product offerings in the mobility sector.",
            "Sentiment": "positive",
            "PublishDate": 1751299893000,
            "Source": "default"
        },
        {
            "Title": "Gabriel India Reports Q4 Results and Dividend Announcement",
            "Summary": "Gabriel India has reported its Q4 financial results. The company's net profit for the quarter was 540.5 million rupees, compared to 527 million rupees year-over-year and 539.7 million rupees quarter-over-quarter. Revenue for Q4 stood at 9.31 billion rupees, up from 8.59 billion rupees in the same quarter last year. Additionally, the company has recommended a final dividend of 2.95 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747786907000,
            "Source": "default"
        },
        {
            "Title": "Gabriel India Reports Q4 Results and Recommends Final Dividend",
            "Summary": "Gabriel India has announced its Q4 financial results and dividend recommendation. The company's Q4 revenue increased to 9.31 billion rupees from 8.59 billion rupees year-over-year. EBITDA rose to 857.5 million rupees from 776 million rupees, with the EBITDA margin improving to 9.21% from 9.03%. Net profit for Q4 stood at 540.5 million rupees, up from 527 million rupees year-over-year and 539.7 million rupees quarter-over-quarter. The company has recommended a final dividend of 2.95 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747751663000,
            "Source": "result"
        },
        {
            "Title": "Gabriel India Commences Production at New Pune Facility",
            "Summary": "Gabriel India has started commercial production at its new manufacturing facility located in MIDC Chakan, Pune. This expansion represents a significant development for the company's production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1743695524000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gabriel India Reports Strong Q3 Financial Performance",
            "Summary": "Gabriel India has announced its financial results for the third quarter. The company's net profit increased to 540 million rupees, up from 430 million rupees year-over-year and 527 million rupees quarter-over-quarter. Revenue also saw growth, reaching 9.2 billion rupees compared to 8.13 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738197214000,
            "Source": "earnings"
        },
        {
            "Title": "Gabriel India Reports Q3 EBITDA Growth",
            "Summary": "Gabriel India has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 784 million rupees from 702 million rupees year-over-year. However, the EBITDA margin slightly decreased to 8.48% from 8.63% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738157687000,
            "Source": "earnings"
        },
        {
            "Title": "Gabriel India Reports Increased Q3 Profit and Revenue",
            "Summary": "Gabriel India has announced its financial results for the third quarter. The company's net profit rose to 540 million rupees, up from 430 million rupees year-over-year and 527 million rupees quarter-over-quarter. Revenue also increased to 9.2 billion rupees, compared to 8.13 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738157592000,
            "Source": "earnings"
        },
        {
            "Title": "Gabriel India Announces 600 Million Rupee Purchase",
            "Summary": "Gabriel India has announced a purchase at a consideration of 600 million rupees. The specific details of the purchase, such as what was acquired or the strategic purpose behind the transaction, were not provided in the brief news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1737694674000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gabriel India Enters Asset Purchase Agreement with Marelli Motherson",
            "Summary": "Gabriel India has entered into an asset purchase agreement with Marelli Motherson and other parties. The company plans to acquire assets from MMAS (presumably Marelli Motherson Automotive Systems). This move suggests a strategic expansion or consolidation within the automotive components sector.",
            "Sentiment": "positive",
            "PublishDate": 1737694630000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gabriel India Reports Q2 EBITDA Growth",
            "Summary": "Gabriel India's Q2 EBITDA increased to 791 million rupees from 738 million rupees year-over-year. The company's EBITDA margin also improved slightly to 8.56% from 8.50% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1729601116000,
            "Source": "result"
        },
        {
            "Title": "Gabriel India Reports Q2 FY2024 Financial Results",
            "Summary": "Gabriel India has announced its financial results for the second quarter of fiscal year 2024. The company reported a net profit of 527 million rupees, showing an increase from 470 million rupees year-over-year and 512 million rupees quarter-over-quarter. Revenue for Q2 stood at 9.2 billion rupees, up from 8.6 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1729601028000,
            "Source": "result"
        }
    ]
}