{
    "Symbol": "GAEL",
    "ISIN": "INE036B01030",
    "News": [
        {
            "Title": "Gujarat Ambuja Exports Q3 Results Mixed Performance",
            "Summary": "Gujarat Ambuja Exports reports Q3 revenue growth to ₹14.8 billion from ₹11.3 billion YoY, while net profit declines to ₹661 million from ₹718 million in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1769782688790,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gujarat Ambuja Exports Reports Zero Transfer Requests",
            "Summary": "Gujarat Ambuja Exports Limited received no requests for re-lodgement of physical share transfers during the six-month special window period mandated by SEBI, which concluded on January 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767788668963,
            "Source": "stocks"
        },
        {
            "Title": "Gujarat Ambuja Starts Sodium Gluconate Production",
            "Summary": "Gujarat Ambuja Exports commences production at its new 30,000 TPA sodium gluconate plant in Hubli, Karnataka - India's first maize starch fermentation facility with expansion plans to 1,20,000 TPA by 2028.",
            "Sentiment": "positive",
            "PublishDate": 1766129762245,
            "Source": "stocks"
        },
        {
            "Title": "Gujarat Ambuja Exports Gets ₹48.08L GST Demand",
            "Summary": "Gujarat Ambuja Exports received fresh GST demand order of ₹48.08 lakh for FY2021-22 related to excess ITC claims. Company plans appeal against the order.",
            "Sentiment": "negative",
            "PublishDate": 1765969902783,
            "Source": "stocks"
        },
        {
            "Title": "Gujarat Ambuja Exports Gets Credit Rating Reaffirmation from CARE Ratings",
            "Summary": "CARE Ratings Limited reaffirmed Gujarat Ambuja Exports' long-term bank facilities credit rating at CARE AA- with Stable outlook, while enhancing the facility amount from ₹350 crore to ₹395 crore. The rating reaffirmation indicates maintained creditworthiness and the company's ability to service its enhanced debt obligations.",
            "Sentiment": "positive",
            "PublishDate": 1764218919990,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Ambuja Exports Seeks Shareholder Approval for Three Independent Director Appointments",
            "Summary": "Gujarat Ambuja Exports Limited has issued a postal ballot notice seeking member approval for the appointment of three Non-Executive Independent Directors: Mr. Dukhabandhu Rath, Mr. Yogesh Ghanshyambhai Shah, and Ms. Gauri Trivedi, each for a 5-year term effective from November 8, 2025. The remote e-voting period runs from November 21, 2025 at 9:00 AM IST to December 20, 2025 at 5:00 PM IST, with results to be announced by December 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763640840714,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Ambuja Exports Non-Executive Director Resigns Due to Personal Reasons",
            "Summary": "Mrs. Sulochana Vijaykumar Gupta resigned from her position as Non-Executive Director of Gujarat Ambuja Exports Limited effective November 19, 2025, citing personal reasons. The company confirmed there were no other material reasons for her resignation beyond those stated in her resignation letter.",
            "Sentiment": "neutral",
            "PublishDate": 1763554501253,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gujarat Ambuja Exports Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Gujarat Ambuja Exports reported quarterly results showing revenue increased to 14.87 billion rupees from 11.25 billion rupees year-over-year. However, net profit declined to 380.8 million rupees compared to 695 million rupees in the same period last year. EBITDA decreased to 758.7 million rupees from 1.1 billion rupees, while EBITDA margin compressed to 5.1% from 9.79% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762627045169,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Ambuja Exports Reports Q2 Results and Appoints Three Independent Directors",
            "Summary": "Gujarat Ambuja Exports Limited announced its quarterly results for the second quarter and half year ended September 30, 2025. The company's Board of Directors approved the standalone and consolidated unaudited financial results. Additionally, the board appointed three new Additional Directors in the category of Non-Executive Independent Directors for five consecutive years effective November 8, 2025: Mr. Dukhabandhu Rath (a banking professional with nearly four decades of experience including 36 years at State Bank of India), Mr. Yogesh Ghanshyambhai Shah (a Chartered Accountant with over 40 years of experience who worked his entire career with Deloitte), and Ms. Gauri Trivedi (a former IAS officer with 22 years of service who currently serves as an Advisor to Sanskardham and holds board positions in several companies including Adani Total Gas and Adani Airport Holdings). All three appointments are subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1762611062701,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Ambuja Exports Signs MOU with Gujarat Government for Rs. 100 Crore Plant Expansion",
            "Summary": "Gujarat Ambuja Exports Limited has signed a Memorandum of Understanding with the Government of Gujarat for expanding derivative capacity at its 900 TPD Corn Wet Milling Plant in Himmatnagar, Gujarat. The project is estimated to cost Rs. 100 crores and will be financed through internal accruals. The MOU is subject to necessary approvals and clearances from concerned authorities.",
            "Sentiment": "positive",
            "PublishDate": 1760091239424,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Ambuja Exports Reports 65.40 Crore Net Profit, Appoints New Secretarial Auditors",
            "Summary": "Gujarat Ambuja Exports Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone net profit of ₹65.40 crores compared to ₹76.74 crores in the same quarter last year. Revenue from operations increased to ₹1,291.23 crores from ₹1,090.44 crores year-over-year. Basic earnings per share stood at ₹1.43 versus ₹1.67 in the previous year quarter. The Board appointed M/s. TNT & Associates as Secretarial Auditors for five years from FY 2025-26 to FY 2029-30, subject to shareholder approval. The company also approved alterations to Articles of Association to comply with State Electricity Regulatory Commission requirements. The consolidated results showed similar performance with net profit of ₹65.02 crores. Segment-wise, Maize Processing Division generated ₹795.80 crores revenue while Other Agro Processing Division contributed ₹475.60 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1754130096340,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Ambuja Exports Reports Higher Q1 EBITDA and Margin Growth",
            "Summary": "Gujarat Ambuja Exports reported Q1 EBITDA of Rs 1.24 billion compared to Rs 1.02 billion in the same period last year. The company's EBITDA margin improved to 96.50% from 93.93% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754129726211,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Ambuja Exports Reports 15% Decline in Q1 Net Profit",
            "Summary": "Gujarat Ambuja Exports recorded a net profit of Rs 654 million in Q1, compared to Rs 767.4 million in the same period last year, representing a year-over-year decrease of approximately 15%.",
            "Sentiment": "negative",
            "PublishDate": 1754129416383,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Ambuja Exports Reports Q4 Results and Dividend",
            "Summary": "Gujarat Ambuja Exports has announced its Q4 financial results and a dividend recommendation. The company's Q4 EBITDA decreased to 622 million rupees from 1.11 billion rupees year-over-year, with EBITDA margin falling to 4.91% from 8.28%. Net profit for Q4 declined to 327 million rupees from 914 million rupees in the previous year. Revenue for the quarter was 12.67 billion rupees, down from 13.46 billion rupees year-over-year. The company has recommended a final dividend of 0.25 rupees per share.",
            "Sentiment": "negative",
            "PublishDate": 1747481014000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Ambuja Exports Increases Maize Processing Capacity",
            "Summary": "Gujarat Ambuja Exports has announced an increase in its consolidated installed maize processing capacity. The company's capacity has now reached 5,200 tonnes per day (TPD).",
            "Sentiment": "positive",
            "PublishDate": 1742963814000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Ambuja Exports Commences Commercial Production at New Maize Unit",
            "Summary": "Gujarat Ambuja Exports has announced the start of commercial production at its new 1200 TPD (tonnes per day) maize processing unit. This development marks a significant expansion in the company's production capacity for maize-based products.",
            "Sentiment": "positive",
            "PublishDate": 1742963758000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Ambuja Exports: Q3FY25 Profit and Revenue Decline, Margins Improve",
            "Summary": "Gujarat Ambuja Exports reported a 29.2% drop in net profit to ₹71.4 crore and a 13.1% decrease in revenue to ₹1,130.9 crore for Q3FY25. Despite the decline, EBITDA margin improved to 10.9% from 9.6%, indicating better operational efficiency.",
            "Sentiment": "neutral",
            "PublishDate": 1737806705000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Ambuja Exports to Consider Q3 Results",
            "Summary": "Gujarat Ambuja Exports Limited has announced that it will consider its third quarter (Q3) financial results on January 25. This meeting is likely to review and approve the company's performance for the quarter ending December 31.",
            "Sentiment": "neutral",
            "PublishDate": 1737117754000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Ambuja Exports Receives Environmental Clearance for New Plant",
            "Summary": "Gujarat Ambuja Exports has obtained environmental clearance for a 180 KLPD (Kilo Liters Per Day) plant in Malda. This approval is a significant step towards the company's expansion plans and potential increase in production capacity.",
            "Sentiment": "positive",
            "PublishDate": 1731315313000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Ambuja Exports Reports Improved Q2 EBITDA and Margin",
            "Summary": "Gujarat Ambuja Exports has announced its Q2 financial results. The company's EBITDA increased to 1.09 billion rupees, up from 1.03 billion rupees in the same quarter last year. The EBITDA margin also improved, rising to 9.69% from 9.28% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730106810000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Ambuja Exports Reports Stable Q2 Revenue",
            "Summary": "Gujarat Ambuja Exports has reported a quarterly revenue of 11.2 billion rupees for Q2, which remains unchanged compared to the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730106733000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Ambuja Exports Reports Q2 Net Profit Decline",
            "Summary": "Gujarat Ambuja Exports has reported a net profit of 695 million rupees for the second quarter, down from 830 million rupees in the same period last year. This represents a year-over-year decrease in the company's quarterly earnings.",
            "Sentiment": "negative",
            "PublishDate": 1730106723000,
            "Source": "result"
        }
    ]
}