{
    "Symbol": "GAIL",
    "ISIN": "INE129A01019",
    "News": [
        {
            "Title": "GAIL Appoints Deepak Gupta as CMD from March 2026",
            "Summary": "GAIL (India) Limited announces appointment of Shri Deepak Gupta as Chairman and Managing Director effective 01.03.2026, replacing current leadership as per MoPNG directive dated 12.02.2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770908429585,
            "Source": "stocks"
        },
        {
            "Title": "GAIL Gets DIPAM Nod for Leafiniti Bioenergy Stake",
            "Summary": "GAIL (India) Limited receives DIPAM concurrence for equity participation in Leafiniti Bioenergy Private Limited, following earlier share subscription agreement executed in August 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770286473354,
            "Source": "co_actions_results"
        },
        {
            "Title": "GAIL Q3 FY26 Earnings Call Set for February 2",
            "Summary": "GAIL (India) Limited announces Q3 FY26 earnings conference call scheduled for February 2, 2026, at 11:00 AM IST, with presentation materials shared in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769882497884,
            "Source": "co_actions_results"
        },
        {
            "Title": "GAIL Revises MNJPL Pipeline Completion to Feb 2026",
            "Summary": "GAIL (India) Limited announces revision in completion schedule for its 1702 Km Mumbai-Nagpur-Jharsuguda Pipeline Project from January 1, 2026 to February 28, 2026 progressively.",
            "Sentiment": "neutral",
            "PublishDate": 1769880189472,
            "Source": "stocks"
        },
        {
            "Title": "GAIL Q3FY26 Results: Net Profit Drops 59% to ₹1,603 Cr",
            "Summary": "GAIL (India) Limited reported Q3FY26 net profit of ₹1,602.57 crore, down 59% YoY. Revenue from operations declined 2.5% to ₹34,075.81 crore. Board declared interim dividend of ₹5 per share.",
            "Sentiment": "negative",
            "PublishDate": 1769862051462,
            "Source": "co_actions_results"
        },
        {
            "Title": "GAIL Partners with K LINE & J M Baxi for LNG Ship Equity",
            "Summary": "GAIL (India) Limited signs term sheet with Kawasaki Kisen Kaisha and J M Baxi Marine Services for equity participation in Singapore-based ship-owning company, marking strategic expansion in LNG shipping sector.",
            "Sentiment": "positive",
            "PublishDate": 1769584798905,
            "Source": "co_actions_results"
        },
        {
            "Title": "GAIL CMD Expects Higher Natural Gas Supply for India",
            "Summary": "GAIL's Co-CMD anticipates increased natural gas supply availability, which is expected to provide benefits for India's energy sector and overall economic development.",
            "Sentiment": "positive",
            "PublishDate": 1769503936068,
            "Source": "stocks"
        },
        {
            "Title": "GAIL Sees Rs. 78.69 Crore Block Trade on NSE",
            "Summary": "GAIL (India) Ltd witnessed a significant block trade worth Rs. 78.69 crores on NSE involving approximately 4.92 million shares at Rs. 159.80 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1769490379565,
            "Source": "co_actions_results"
        },
        {
            "Title": "GAIL India Shares Drop 2.06% Despite Strong FY25 Results",
            "Summary": "GAIL India shares fell 2.06% to ₹160.20 despite reporting strong annual performance with revenue rising to ₹141,903.49 crores and net profit increasing 33.3% to ₹10,959.63 crores in FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1769158458914,
            "Source": "stocks"
        },
        {
            "Title": "GAIL Board Meeting Set for Jan 31 to Review Q3 Results",
            "Summary": "GAIL (India) Limited has scheduled its board meeting for January 31, 2026, to consider Q3 FY26 unaudited financial results and interim dividend. Record date fixed for February 5, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769148906614,
            "Source": "co_actions_results"
        },
        {
            "Title": "GAIL Faces Cost Pressure as US Gas Prices Surge 67%",
            "Summary": "Henry Hub natural gas prices have jumped 67% in three days, crossing $5/MMBTU and creating input cost challenges for GAIL's US gas purchase operations with limited pass-through options.",
            "Sentiment": "negative",
            "PublishDate": 1769054674003,
            "Source": "stocks"
        },
        {
            "Title": "GAIL Block Trade Worth ₹20.12 Crores on NSE",
            "Summary": "GAIL (India) Ltd witnessed another block trade on NSE involving 1.23 million shares worth ₹20.12 crores at ₹164.07 per share, showing continued institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768540379099,
            "Source": "co_actions_results"
        },
        {
            "Title": "GAIL Block Trade Worth ₹17.57 Crores on NSE",
            "Summary": "GAIL (India) Ltd. witnessed a significant block trade on NSE involving 1,005,185 shares worth ₹17.57 crores at ₹174.84 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767586223374,
            "Source": "co_actions_results"
        },
        {
            "Title": "GAIL Revises Pipeline Completion Schedule to March 2026",
            "Summary": "GAIL (India) Limited has revised the completion schedule for two key pipeline sections from December 2025 to March 2026 due to delays in Right of Use permissions and fisheries front availability.",
            "Sentiment": "neutral",
            "PublishDate": 1767439388198,
            "Source": "stocks"
        },
        {
            "Title": "GAIL Revises KKBMPL Pipeline Completion to March 2026",
            "Summary": "GAIL (India) Limited announces revision in completion schedule for its 1,104 km Kochi-Koottanad-Bengaluru-Mangaluru Pipeline project from December 2025 to March 2026 due to delays in availability of hindrance-free fronts.",
            "Sentiment": "neutral",
            "PublishDate": 1767439350784,
            "Source": "stocks"
        },
        {
            "Title": "GAIL Revises Srikakulam Angul Pipeline Completion to June 2026",
            "Summary": "GAIL (India) Limited announced revision in completion schedule for its 744 km Srikakulam Angul Pipeline Project from December 2025 to June 2026 due to forest permission delays affecting 56 km spur line construction.",
            "Sentiment": "neutral",
            "PublishDate": 1767439043895,
            "Source": "stocks"
        },
        {
            "Title": "GAIL Block Trade Worth ₹17.29 Crores on NSE",
            "Summary": "GAIL (India) Ltd. witnessed a significant block trade on NSE involving over 10 lakh shares worth ₹17.29 crores at ₹172.35 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767329374300,
            "Source": "co_actions_results"
        },
        {
            "Title": "GAIL Gas Reduces CNG, PNG Prices by ₹1",
            "Summary": "GAIL Gas Ltd cuts CNG and domestic PNG prices by ₹1 following pipeline tariff rationalization by PNGRB, effective across nine states including UP, Karnataka, and Madhya Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1767270156949,
            "Source": "stocks"
        },
        {
            "Title": "GAIL Signs MoU for Gas-Based Fertilizer Project Study",
            "Summary": "GAIL (India) Ltd and Chhattisgarh Government sign agreement to study establishment of gas-based urea fertilizer plant in the state, marking potential expansion in fertilizer sector.",
            "Sentiment": "positive",
            "PublishDate": 1766490482927,
            "Source": "stocks"
        },
        {
            "Title": "GAIL Signs MoU for Gas-Based Fertilizer Project",
            "Summary": "GAIL India Limited partners with Chhattisgarh Government to develop a greenfield gas-based fertilizer project with 12.7 lakh metric ton urea manufacturing capacity along MNJPL corridor.",
            "Sentiment": "positive",
            "PublishDate": 1766484793016,
            "Source": "co_actions_results"
        },
        {
            "Title": "GAIL Faces ₹143.08 Cr GST Demand on Guarantees",
            "Summary": "GAIL (India) receives GST demand notice of ₹143.08 crore from CGST Delhi South for corporate guarantees provided to subsidiaries on December 10, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1765446682836,
            "Source": "stocks"
        },
        {
            "Title": "GAIL India Receives ESG Rating of 66 from NSE Sustainability with 'Aspiring' Category",
            "Summary": "GAIL (India) Limited received an ESG rating of 66 for FY2025 from NSE Sustainability Ratings Analytics, categorized as 'Aspiring' with scores of 56 for Environment, 76 for Social, and 71 for Governance. The state-owned natural gas processing and distribution company disclosed challenges in greenhouse gas emissions and renewable energy adoption while showing strong performance in worker safety and governance compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1765363538038,
            "Source": "stock"
        },
        {
            "Title": "GAIL Gets 12% Tariff Hike for Natural Gas Pipeline Network",
            "Summary": "PNGRB approved a levelized tariff of ₹65.69/MMBTU for GAIL's Integrated Natural Gas Pipeline network effective January 1, 2026, representing a 12% increase from the previous ₹58.61/MMBTU. The tariff adjustment is expected to generate a positive impact of approximately ₹1,200 crore for GAIL, with further true-up scheduled for the next tariff review in FY2027-28.",
            "Sentiment": "neutral",
            "PublishDate": 1764334990304,
            "Source": "stock"
        },
        {
            "Title": "GAIL India Government Nominee Director Kamini Chauhan Ratan Steps Down",
            "Summary": "Ms. Kamini Chauhan Ratan ceased to be a Government Nominee Director of GAIL (India) Limited effective November 22, 2025, following a directive from the Ministry of Petroleum & Natural Gas. The directorate change affects the board composition of the Maharatna PSU company and was disclosed in compliance with SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763809008809,
            "Source": "corporate_governance"
        },
        {
            "Title": "GAIL Reports Gas Pipeline Leak Incident at RCF Trombay, Supply to MGL Normalized",
            "Summary": "GAIL experienced a gas leakage on November 16, 2025 at its pipeline supplying 2-3 MMSCMD gas to Mahanagar Gas Limited through RCF Trombay premises, caused by third-party damage from a contractor. The company completed repair work within 36-40 hours and restored normal gas supply to MGL Wadala by November 18, 2025, with no material impact on operations.",
            "Sentiment": "neutral",
            "PublishDate": 1763543917761,
            "Source": "stock"
        },
        {
            "Title": "GAIL Q2 Standalone Ebitda Beats Estimates at Rs 31.9 Billion, Marketing Segment Shows Strong Performance",
            "Summary": "GAIL reported standalone Ebitda of Rs 31.9 billion in Q2, exceeding estimates by 5%. The gas transmission segment's Ebit fell short of brokerage estimates by 6%, while the marketing segment delivered strong performance. The company's H1 Ebit represents approximately 50% of the full-year guidance of Rs 45 billion. Motilal Oswal maintains a 'Buy' rating, citing tariff hikes and volume uplift as key catalysts for H2 FY26-27.",
            "Sentiment": "positive",
            "PublishDate": 1762151967260,
            "Source": "earnings"
        },
        {
            "Title": "GAIL Projects Gas Marketing PBT of ₹4,000-5,000 Crore, Cuts FY26 Transmission Volume Guidance",
            "Summary": "GAIL management projects profit before tax of ₹4,000-5,000 crore in its gas marketing segment. The company has reduced its FY26 transmission volume guidance to 123-124 MMSCMD, citing pipeline issues and lower demand as contributing factors.",
            "Sentiment": "negative",
            "PublishDate": 1761993511705,
            "Source": "stock"
        },
        {
            "Title": "GAIL India Seeks to Expand LNG Regassification Capacity Through Additional Terminal Partnerships",
            "Summary": "GAIL India is looking to secure additional LNG regassification capacity by partnering with more terminal operators. This move appears aimed at expanding the company's LNG processing capabilities through diversified terminal access.",
            "Sentiment": "positive",
            "PublishDate": 1761909678579,
            "Source": "stock"
        },
        {
            "Title": "GAIL India Anticipates Drop in Henry Hub LNG Prices",
            "Summary": "GAIL India expects Henry Hub LNG prices to decrease. The company has indicated its outlook for lower pricing in the liquefied natural gas market tied to the Henry Hub benchmark.",
            "Sentiment": "positive",
            "PublishDate": 1761908421077,
            "Source": "stock"
        },
        {
            "Title": "GAIL India Reports Mixed Performance in H1 FY26 with Revenue Decline Despite Volume Growth",
            "Summary": "GAIL India released its H1 FY26 earnings presentation showing natural gas transmission volumes increased to 105.47 MMSCMD from 98.02 MMSCMD in H1 FY25. However, standalone turnover declined to Rs. 91,426 crore from Rs. 1,36,960 crore in FY25. Gross margin (EBITDA) dropped to Rs. 8,608 crore in H1 FY26 compared to Rs. 15,583 crore in FY25. Profit after tax fell to Rs. 5,302 crore from Rs. 10,364 crore in FY25. On consolidated basis, turnover was Rs. 92,636 crore with EBITDA of Rs. 10,323 crore in H1 FY26. The company maintains a debt-equity ratio of 0.20 and plans capital expenditure of Rs. 10,700 crore for FY2025-26, focusing on pipelines (28%), city gas distribution equity (26%), and petrochemicals (18%). Major gas demand comes from fertilizer and city gas distribution companies, with imported gas primarily consisting of long-term RLNG and spot purchases.",
            "Sentiment": "negative",
            "PublishDate": 1761903305214,
            "Source": "earnings"
        },
        {
            "Title": "GAIL India Reports Mixed Q2 Results with Higher Revenue and Profit but Lower EBITDA",
            "Summary": "GAIL India reported quarterly revenue of 350 billion rupees, up from 348 billion rupees in the previous quarter. Net profit increased to 22.2 billion rupees from 18.9 billion rupees quarter-on-quarter. However, EBITDA declined to 31.9 billion rupees from 33.33 billion rupees, with EBITDA margin dropping to 9.11% from 9.58% in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1761901445940,
            "Source": "earnings"
        },
        {
            "Title": "GAIL India Reports Strong Q2 Performance with 33% Jump in Net Profit",
            "Summary": "GAIL (India) Limited reported net profit of ₹2,057.97 crores for the quarter ended September 30, 2025, representing a 33% increase from ₹1,549.97 crores in the same period last year. Total income rose to ₹35,004.37 crores compared to ₹32,738.25 crores in the previous year quarter. For the half-year period, net profit increased to ₹4,395.91 crores from ₹3,332.91 crores. The company's transmission services segment generated revenue of ₹2,517.37 crores while natural gas marketing contributed ₹14,142.10 crores during the quarter. The Board approved these unaudited financial results at their meeting held on October 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761901402083,
            "Source": "earnings"
        },
        {
            "Title": "Moody's Confirms GAIL's Baa3 Credit Rating With Stable Outlook",
            "Summary": "Moody's has confirmed GAIL's Baa3 credit ratings and maintained a stable outlook for the company. The rating confirmation indicates the credit rating agency's assessment of GAIL's creditworthiness remains unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1761654528501,
            "Source": "stock"
        },
        {
            "Title": "GAIL India Schedules Q2 FY2026 Earnings Conference Call for October 31, 2025",
            "Summary": "GAIL (India) Limited has announced its earnings conference call for Q2 FY 2025-26, scheduled for October 31, 2025 at 4:00 PM IST. The call will be hosted by PhillipCapital India with Director Finance R.K. Jain and other senior executives as speakers. The company has informed stock exchanges NSE and BSE that no unpublished price sensitive information will be shared during the conference call. The call will be recorded and participant details will be shared with the corporate, following regulatory guidelines and transparency practices.",
            "Sentiment": "neutral",
            "PublishDate": 1761412610862,
            "Source": "earnings"
        },
        {
            "Title": "GAIL Executes Sponsor Support Undertaking for Talcher Fertilizer's Rs 12,250 Crore Loan Facility",
            "Summary": "GAIL (India) Ltd has executed a Sponsor Support Undertaking for Talcher Fertilizer Limited as part of securing a Rupee Term Loan Facility of approximately Rs 12,250 crores from lenders. Talcher Fertilizer Limited is a joint venture company incorporated in 2015 between GAIL, Coal India Ltd, Rashtriya Chemicals & Fertilizers Ltd, and Fertilizer Corporation of India Limited for setting up a coal gasification based fertilizer plant at Talcher. The Sponsor Support Undertaking was executed by all promoters of TFL as a prerequisite for loan disbursement. GAIL clarified it is not the guarantor of the facility and there is no financial implication for the company. The transaction is conducted at arm's length.",
            "Sentiment": "neutral",
            "PublishDate": 1760785656426,
            "Source": "stock"
        },
        {
            "Title": "GAIL India Signs 25-Year Deal for Compressed Bio-Gas Plant in Bengaluru",
            "Summary": "GAIL (India) has signed an agreement for establishing a compressed bio-gas plant in Bengaluru. The project involves 18 acres of land provided by GBA. The plant is designed to process 300 tons of waste daily, which will produce 12.6 tons of compressed bio-gas (CBG) and 22 tons of fermented organic manure (FOM). The agreement has a duration of 25 years.",
            "Sentiment": "positive",
            "PublishDate": 1760685281171,
            "Source": "order&deals"
        },
        {
            "Title": "PNGRB Members Oppose GAIL's Pipeline Tariff Increase Plan",
            "Summary": "Some members of the Petroleum and Natural Gas Regulatory Board (PNGRB) have objected to GAIL's plan to increase pipeline tariffs. The regulatory board has raised concerns about the company's rationale and the process used to determine the tariff revision.",
            "Sentiment": "negative",
            "PublishDate": 1760430765140,
            "Source": "stock"
        },
        {
            "Title": "Government Plans New Operator for Common Carrier Pipelines with GAIL Infrastructure Involvement",
            "Summary": "The government is working to establish a new operator that will manage all common carrier pipelines. GAIL Infrastructure will be included as part of this new operational framework.",
            "Sentiment": "neutral",
            "PublishDate": 1759143652239,
            "Source": "stock"
        },
        {
            "Title": "GAIL Plans to Double Jamnagar-Loni LPG Pipeline Capacity with Rs 53.5 Billion Investment",
            "Summary": "GAIL is set to expand its Jamnagar-Loni LPG pipeline capacity from 3.25 million metric tonnes per annum (MMTPA) to 6.5 MMTPA. The expansion project will require an investment of Rs 53.5 billion, effectively doubling the pipeline's current capacity.",
            "Sentiment": "positive",
            "PublishDate": 1758845510950,
            "Source": "stock"
        },
        {
            "Title": "GAIL Delays MNJPL Project to December 2025, Approves ₹5,364 Crore Jamnagar LPG Pipeline Expansion",
            "Summary": "GAIL (India) Ltd revised the completion schedule for its Mumbai–Nagpur–Jharsuguda Pipeline (MNJPL) project to December 31, 2025, from the previous deadline of September 30, 2025. The 1,702 km project consists of three sections with most construction mechanically complete, awaiting regulatory approvals from PESO. The Mumbai–Nagpur section is finished and ready, while small portions totaling around 11 km remain incomplete across different stretches. Separately, GAIL's board approved expanding the Jamnagar–Loni LPG Pipeline capacity from 3.25 MMTPA to 6.5 MMTPA, requiring an investment of ₹5,363.88 crore. The expansion project is scheduled for completion within 36 months from PNGRB's authorization dated July 23, 2025, with funding through debt and equity mix. GAIL shares were trading 1.60% lower at ₹175.80.",
            "Sentiment": "neutral",
            "PublishDate": 1758708279391,
            "Source": "stock"
        },
        {
            "Title": "GAIL Approves Rs 5,364 Crore Capacity Expansion for Jamnagar-Loni LPG Pipeline",
            "Summary": "GAIL's Board of Directors approved a capacity expansion project for its Jamnagar-Loni Petroleum Product (LPG) Pipeline, doubling capacity from 3.25 MMTPA to 6.5 MMTPA. The project requires an investment of Rs. 5,363.88 crore and will be financed through debt and equity. Current capacity utilization stands at 3.22 MMTPA against existing capacity of 3.25 MMTPA. The expansion is scheduled for completion within 36 months from July 23, 2025, following PNGRB authorization. The rationale cited for the expansion is the company's business growth.",
            "Sentiment": "positive",
            "PublishDate": 1758706267326,
            "Source": "stock"
        },
        {
            "Title": "Karnataka Cabinet Approves 18-Acre Land Allotment to GAIL India for Bio-CNG Plant in Bengaluru",
            "Summary": "The Karnataka Cabinet approved allotting 18 acres of land at Haralakunte village, Bengaluru South Taluk to GAIL India on a 'Permissive Use' basis for 25 years. The land will be used to establish a 300 metric tonne per day bio-CNG unit, expandable up to 500 metric tonnes per day. The Revenue Department and Bengaluru Solid Waste Management Ltd will jointly survey and hand over the land with proper maps. The cabinet also approved guidelines to prevent spurious chemical sales under the bio-diesel name and decided to draft 'The Bio-Diesel (B-100) Blending with High Speed Diesel for Transportation Purposes (Licensing) Order, 2022'. Additionally, the government extended Ayushman Bharat Arogya Karnataka scheme benefits to all senior citizens aged 70 and above, approved construction of two 100-bed hospitals at Rs 100 crore total cost, and authorized procurement of 3,500 Chromebooks for revenue inspectors under the Digi Revenue Project.",
            "Sentiment": "positive",
            "PublishDate": 1757662285963,
            "Source": "stock"
        },
        {
            "Title": "GAIL Shares Jump Nearly 3% on Expected Pipeline Tariff Hike Decision",
            "Summary": "GAIL (India) Ltd. shares rose 2.8% to ₹178.74 as the Petroleum and Natural Gas Regulatory Board (PNGRB) fast-tracks its decision on revising pipeline tariffs. Sources indicate an announcement could come within days, with a PNGRB member previously suggesting a possible 20% increase. GAIL's current pipeline tariff stands at ₹58.59 per mmBtu, with revision toward ₹70/mmBtu seen as likely. Brokerages project significant impact: Jefferies estimates a 10% or 20% increase would boost GAIL's transmission EBITDA by 13% and 26% respectively, setting fair value targets of ₹235-₹250. Nomura expects tariffs to reach ₹70/mmBtu from April 2026, projecting a 42% year-on-year increase in gas transmission EBIT. Pipeline tariffs have remained unchanged since 2018 despite GAIL's significant pipeline expansion and rising capital expenditure.",
            "Sentiment": "positive",
            "PublishDate": 1757580489159,
            "Source": "stock"
        },
        {
            "Title": "GAIL Explores Listing of City Gas Distribution Arm GAIL Gas on Indian Stock Exchanges",
            "Summary": "GAIL, India's largest gas utility, is exploring the listing of its city gas distribution arm GAIL Gas (GGL) on Indian stock exchanges. The company has floated a tender to hire a consultant to study various aspects of the listing process. GGL serves natural gas to approximately 6% of India's population and operates across 25 geographical areas in 49 districts across 13 states. The company reported its highest-ever gross turnover of Rs 10,944 crore and profit after tax of Rs 323 crore in FY24, driven by 32% year-on-year growth in CNG sales to 267 million standard cubic meters. GGL expects gas usage by the CGD sector to grow at 13% CAGR until FY30, compared to 8.4% annual growth between FY14-FY24. The company is implementing CGD projects in 16 geographical areas across eight states and contemplating acquisition of GAIL's 6 geographical areas across four states. India aims to increase natural gas share in its primary energy mix from 6% to 15% by 2030, with CGD expected to account for one-third of cumulative consumption by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1757513551823,
            "Source": "stock"
        },
        {
            "Title": "GAIL Faces Rs 529.32 Crore Counter Claim in Arbitration Against Focus Energy Limited",
            "Summary": "GAIL (India) Limited received a Statement of Defence and Counter Claim from Focus Energy Limited and others on September 8, 2025, in ongoing arbitration proceedings related to unadjusted balance Annual Take or Pay amount. Focus Energy Limited and associated companies iServices Investment Limited and Newbury Oil Company Limited have denied all claims made by GAIL and filed counter claims totaling Rs 529.32 crores plus interest. The arbitration case involves disputes over Annual Take or Pay obligations between the parties.",
            "Sentiment": "negative",
            "PublishDate": 1757488331760,
            "Source": "stock"
        },
        {
            "Title": "GAIL Pipeline Tariff Announcement Expected by Early September",
            "Summary": "GAIL's pipeline tariff announcement is expected by the start of September. The Petroleum and Natural Gas Regulatory Board (PNGRB) will approve matters concerning other pipelines at its August board meeting this month.",
            "Sentiment": "neutral",
            "PublishDate": 1755597293731,
            "Source": "stock"
        },
        {
            "Title": "GAIL Faces Rs 21.84 Lakh Penalty and Fine from Customs Authority",
            "Summary": "GAIL received an order from the Joint Commissioner of Customs, Nhava Sheva, Mumbai, demanding differential custom duty, interest, fine, and penalty. The order was received on August 13, 2025, and relates to alleged denial of concessional duty benefit on an import consignment. The company faces a penalty of Rs 12,33,830 and a fine of Rs 9,50,000, totaling Rs 21.84 lakh in monetary impact.",
            "Sentiment": "negative",
            "PublishDate": 1755105431130,
            "Source": "stock"
        },
        {
            "Title": "GAIL Signs Agreement for 49% Stake in Leafiniti Bioenergy for Compressed Bio Gas Projects",
            "Summary": "GAIL (India) Limited has signed a Share Subscription cum Shareholders Agreement with TruAlt Bioenergy Limited for 49% equity participation in Leafiniti Bioenergy Private Limited. The partnership aims to set up new Compressed Bio Gas projects through LBPL. Currently, LBPL is wholly owned by TruAlt Bioenergy Limited. Upon completion of conditions and DIPAM approval, the shareholding will be TruAlt Bioenergy 51% and GAIL 49%. LBPL's board will comprise 4 directors, with 2 nominated by each party. GAIL will nominate the first Chairman and the Chief Financial Officer, while TruAlt Bioenergy will nominate the Chief Executive Officer. GAIL has secured first right to participate in fresh share issuances, affirmative voting rights on capital structure changes, and Right of First Refusal on equity sales by TruAlt Bioenergy. The agreement includes a lock-in period of 5 years from closing or 3 years from commissioning of 6 CBG projects, whichever is earlier.",
            "Sentiment": "positive",
            "PublishDate": 1754932639176,
            "Source": "order&deals"
        },
        {
            "Title": "GAIL and Hindustan Copper Sign MoU for Critical Mineral Resources Development",
            "Summary": "GAIL (India) Limited and Hindustan Copper Limited signed a Memorandum of Understanding to collaborate on exploration and development of critical mineral resources in India and overseas. The MoU was signed by Sanjay Agarwal, Executive Director (Business Development and Exploration & Production) from GAIL, and Binod Kumar Gupta, Executive Director (Mining)- Resource Planning from HCL, in the presence of senior officials from both organizations. The partnership aims to enhance India's self-reliance in critical minerals and support the country's technology and clean energy industries while reducing dependence on imported resources through strengthened domestic mining and mineral processing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1754582818651,
            "Source": "order&deals"
        },
        {
            "Title": "GAIL India Shares Earnings Call Transcript for Q1 FY 2025-26",
            "Summary": "GAIL (India) Limited has provided the link to the transcript of their earnings conference call held on July 29, 2025, discussing the unaudited financial results for the quarter ended June 30, 2025. The company shared this information with stock exchanges NSE and BSE, making the earnings call transcript available on their website. The disclosure was made by Company Secretary Mahesh Kumar Agarwal.",
            "Sentiment": "neutral",
            "PublishDate": 1753945346478,
            "Source": "earnings"
        }
    ]
}