{
    "Symbol": "GALAXYSURF",
    "ISIN": "INE600K01018",
    "News": [
        {
            "Title": "Galaxy Surfactants Q3 FY26 Earnings Call Feb 16",
            "Summary": "Galaxy Surfactants announces analyst conference call on February 16, 2026 at 12:00 Noon IST to discuss Q3 & 9MFY26 operational and financial performance with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1770290212759,
            "Source": "stocks"
        },
        {
            "Title": "Galaxy Surfactants Unveils New Corporate Logo",
            "Summary": "Galaxy Surfactants Limited has refreshed its corporate logo, embracing the philosophy 'Chemistry Creates Care' while maintaining its core business operations unchanged.",
            "Sentiment": "positive",
            "PublishDate": 1769074989548,
            "Source": "stocks"
        },
        {
            "Title": "Galaxy Surfactants Reports Flat Q2 Volumes Amid US Tariff Impact and India Demand Challenges",
            "Summary": "Galaxy Surfactants faced multiple headwinds in Q2 FY26 with flat consolidated volumes year-on-year, as 50% US tariffs on Indian exports and GST-driven inventory adjustments by FMCG players impacted business. The company's H1 FY26 EBITDA declined 5% to INR 251 crores with elevated fatty alcohol prices prompting customer reformulation, though management expects gradual recovery from Q4 FY26.",
            "Sentiment": "negative",
            "PublishDate": 1763547149876,
            "Source": "earnings"
        },
        {
            "Title": "Galaxy Surfactants Reports Mixed Q2 Results with Revenue Growth but Lower Profitability",
            "Summary": "Galaxy Surfactants reported Q2 revenue of 13.3 billion rupees, up from 10.6 billion rupees in the same quarter last year. However, the company's profitability declined with consolidated net profit falling to 665 million rupees from 847 million rupees year-over-year. EBITDA decreased to 1.1 billion rupees from 1.28 billion rupees, while EBITDA margin compressed to 8.30% from 12.04% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762960543954,
            "Source": "earnings"
        },
        {
            "Title": "Galaxy Surfactants Schedules Analyst Conference Call for Q2H1FY26 Results",
            "Summary": "Galaxy Surfactants Limited has scheduled an analyst and investor conference call for Thursday, November 13, 2025, at 12:00 Noon IST to discuss operational and financial performance for Q2H1FY26. The call will be attended by key management including Managing Director K. Natarajan, Executive Director COO Vaijanath Kulkarni, and CFO Abhijit Damle. Dial-in details have been provided for domestic and international participants, with numbers available for Hong Kong, Singapore, UK, and USA. The company has requested pre-registration for the call and made the information available on their website.",
            "Sentiment": "neutral",
            "PublishDate": 1762337566993,
            "Source": "earnings"
        },
        {
            "Title": "Galaxy Surfactants Executes Corporate Guarantee for Subsidiary's Performance to Global Customer",
            "Summary": "Galaxy Surfactants Limited has executed a corporate guarantee for its wholly owned subsidiary's performance to a global customer. This guarantee, related to a transaction disclosed on March 5, 2025, may result in financial outflows if the subsidiary fails to perform. The company disclosed this arrangement as part of regulatory requirements, noting it serves as a performance guarantee for the subsidiary's obligations.",
            "Sentiment": "neutral",
            "PublishDate": 1760421805268,
            "Source": "corporate_action"
        },
        {
            "Title": "Galaxy Surfactants Reports 5% Volume Growth Despite Raw Material Challenges in Q1 FY2026",
            "Summary": "Galaxy Surfactants Limited reported consolidated volume growth of 5% year-on-year and 9% quarter-on-quarter in Q1 FY2026. EBITDA increased 4.5% to INR 135 crores from INR 129 crores in the previous year, while EBITDA per metric ton remained stable at INR 20,000. The company faced challenges including tight raw material availability due to disruptions at a key Southeast Asian supplier and elevated feedstock prices expected to continue through the next quarter. Regional performance varied with India showing 3% YoY growth, AMET remaining flat, and Rest of World achieving 16% growth driven by LATAM and APAC markets. The company is managing tariff uncertainties affecting North American customers and supply chain disruptions across Europe, China, and Southeast Asia. Management targets 6-8% volume growth for FY2026 and has set capex guidance of INR 120-150 crores for regular maintenance and debottlenecking projects. Galaxy Hearth Biosurf won the Best Innovation in Home Care segment Platinum Award, highlighting the company's focus on innovation within its Vision 2030 strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1755599306172,
            "Source": "earnings"
        },
        {
            "Title": "Galaxy Surfactants Plans Capacity Expansion and Sustainable Innovation for Emerging Markets",
            "Summary": "Galaxy Surfactants announced plans to expand its capacity in specialty surfactants while strengthening customer partnerships. The company aims to innovate sustainable ingredients to meet rising demand in emerging markets.",
            "Sentiment": "positive",
            "PublishDate": 1755103964606,
            "Source": "stock"
        },
        {
            "Title": "Galaxy Surfactants Reports 32% Revenue Growth to ₹1,289 Crores in Q1FY26",
            "Summary": "Galaxy Surfactants Limited reported total revenue of ₹1,289.2 crores for the quarter ended June 30, 2025, marking a 31.6% increase from ₹979.5 crores in the same quarter last year. EBITDA grew 4.3% to ₹135.1 crores, while PAT remained flat at ₹79.5 crores compared to ₹79.7 crores in Q1FY25. The company achieved 5% volume growth year-on-year with nearly double-digit sequential growth across performance surfactants and specialty care segments. Performance Surfactants generated revenue of ₹840.5 crores while Specialty Care contributed ₹448.6 crores. Regionally, India and AMET volumes remained flat year-on-year, while ROW region experienced high double-digit volume growth driven by LATAM and APAC markets. EBITDA margin compressed to 10.5% from 13.2% in the previous year, while PAT margin declined to 6.2% from 8.1%. Managing Director K. Natarajan noted that supply-side challenges persisted with tight raw material availability, with fatty alcohol prices increasing to an average of $2,723/MT compared to $1,548/MT in Q1FY25.",
            "Sentiment": "positive",
            "PublishDate": 1755100555006,
            "Source": "earnings"
        },
        {
            "Title": "Galaxy Surfactants Reports Mixed Q1 Results with Revenue Growth but Margin Decline",
            "Summary": "Galaxy Surfactants reported quarterly consolidated net profit of 795 million rupees, nearly flat compared to 797 million rupees in the same period last year. Revenue grew significantly to 12.8 billion rupees from 9.74 billion rupees year-over-year. However, EBITDA declined slightly to 1.24 billion rupees from 1.25 billion rupees, while EBITDA margin compressed to 9.70% from 12.83% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1755093102909,
            "Source": "earnings"
        },
        {
            "Title": "Galaxy Surfactants Schedules Q1FY26 Earnings Call for August 14, 2025",
            "Summary": "Galaxy Surfactants Limited has scheduled an analyst and investor conference call for August 14, 2025, at 12:00 Noon IST to discuss its operational and financial performance for Q1FY26. The earnings call will be attended by key executives including Managing Director K. Natarajan, Executive Director & COO Vaijanath Kulkarni, and CFO Abhijit Damle. The company has provided dial-in details with access numbers for domestic and international participants, including toll-free numbers for Hong Kong, Singapore, UK, and USA. Participants are required to pre-register for the call, and the information is available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1754479611621,
            "Source": "earnings"
        },
        {
            "Title": "Galaxy Surfactants: Targets 4% Volume Growth for FY26",
            "Summary": "Galaxy Surfactants aims for 4% volume growth in FY26, maintaining Q4 momentum. EBITDA expected to be ₹20,500-₹21,000 per metric tonne. Cautious about Indian demand, with recovery likely in second half. Specialty care volumes expected to gradually pick up across key markets. US customers apprehensive about potential tariff impacts on demand growth.",
            "Sentiment": "neutral",
            "PublishDate": 1747638153000,
            "Source": "normal_news"
        },
        {
            "Title": "Galaxy Surfactants: Q4 Profit Up 6.4%, Revenue Surges 23.2%",
            "Summary": "Galaxy Surfactants reported a 6.4% YoY increase in Q4 net profit to ₹100 crore. Revenue rose 23.2% to ₹1,144.9 crore. EBITDA grew 24.8% to ₹126.9 crore with margin at 11%. The company recommended a final dividend of ₹4 per share.",
            "Sentiment": "positive",
            "PublishDate": 1747410885000,
            "Source": "earnings"
        },
        {
            "Title": "Galaxy Surfactants Recommends Dividend",
            "Summary": "Galaxy Surfactants has recommended a dividend of 4 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747408347000,
            "Source": "result"
        },
        {
            "Title": "Galaxy Surfactants Reports Q4 Financial Results",
            "Summary": "Galaxy Surfactants announced its Q4 financial results. The company's EBITDA increased to 1.3 billion rupees from 1.02 billion rupees year-over-year. The EBITDA margin slightly improved to 11% from 10.94% in the same period last year. Consolidated net profit was 759 million rupees, down from 775 million rupees year-over-year but up from 646 million rupees quarter-over-quarter. Revenue for Q4 grew to 11.4 billion rupees from 9.29 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747408312000,
            "Source": "result"
        },
        {
            "Title": "Galaxy Surfactants Approves Formation of New Overseas Investment Subsidiary",
            "Summary": "Galaxy Surfactants has approved the formation of a new overseas subsidiary that will operate in the investment holdings business. This strategic move suggests the company is expanding its global presence and diversifying its business activities.",
            "Sentiment": "positive",
            "PublishDate": 1744793725000,
            "Source": "default"
        },
        {
            "Title": "Galaxy Surfactants: ICICI Prudential Mutual Fund Acquires Additional Stake",
            "Summary": "ICICI Prudential Mutual Fund purchased a 0.83% stake (2.97 lakh shares) in Galaxy Surfactants for Rs 124 crore at Rs 2,092 per share through open market transactions. The fund now holds a total 1.02% stake in the company.",
            "Sentiment": "positive",
            "PublishDate": 1743522133000,
            "Source": "block_deals"
        },
        {
            "Title": "Galaxy Surfactants: ₹18 Per Share Interim Dividend Declared for FY25",
            "Summary": "Galaxy Surfactants has declared an interim dividend of ₹18 per equity share for FY 2024-25. The record date is set for March 20, 2025, with payment to be made within 30 days. The company has moderated its volume growth targets to about 4% due to headwinds in the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1742044688000,
            "Source": "corporate_action"
        },
        {
            "Title": "Galaxy Surfactants Enters Strategic Collaboration for EPC Services",
            "Summary": "Galaxy Surfactants has announced that it has entered into a strategic collaboration with one of its global customers through its group companies. The collaboration is aimed at providing Engineering, Procurement, and Construction (EPC) services. This move suggests Galaxy Surfactants is expanding its service offerings beyond its core surfactant business.",
            "Sentiment": "positive",
            "PublishDate": 1741220847000,
            "Source": "corporate_action"
        },
        {
            "Title": "Galaxy Surfactants Enters Strategic Collaboration for EPC Services",
            "Summary": "Galaxy Surfactants has announced that it, through its group companies, has entered into a strategic collaboration with one of its global customers. The collaboration is specifically for providing Engineering, Procurement, and Construction (EPC) services.",
            "Sentiment": "positive",
            "PublishDate": 1741173135000,
            "Source": "corporate_action"
        },
        {
            "Title": "Galaxy Surfactants: Demand Revival Expected in FY26 Amid Consumer Spending Boost",
            "Summary": "Galaxy Surfactants anticipates demand recovery from Q1 FY26, driven by increased consumer spending and government initiatives. Q3 FY25 saw revenue rise 10.4% YoY, but profit declined 9.5%. The company maintains a 6-8% medium to long-term volume growth target, focusing on speciality chemicals growth in Europe and North America.",
            "Sentiment": "neutral",
            "PublishDate": 1739617456000,
            "Source": "earnings"
        },
        {
            "Title": "Galaxy Surfactants: Reduces FY25 Volume Growth Targets",
            "Summary": "Galaxy Surfactants has revised its volume growth targets for the fiscal year 2025 downward. The company has not provided specific details about the new targets or reasons for the reduction in this brief update.",
            "Sentiment": "negative",
            "PublishDate": 1739251545000,
            "Source": "corporate_action"
        },
        {
            "Title": "Galaxy Surfactants Reports Q3 FY24 Financial Results",
            "Summary": "Galaxy Surfactants announced its Q3 financial results. The company's consolidated net profit decreased to 646 million rupees from 714 million rupees year-over-year. However, revenue increased to 10.4 billion rupees from 9.4 billion rupees compared to the same quarter last year. Sequentially, net profit declined from 874 million rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1739192411000,
            "Source": "earnings"
        },
        {
            "Title": "Galaxy Surfactants: CEO Reaffirms 6-8% Volume Growth Target for FY25",
            "Summary": "Galaxy Surfactants' CEO K Natarajan maintains 6-8% volume growth guidance for FY25, citing expected revival in domestic market and improving conditions in foreign territories. The company anticipates challenges but remains confident in meeting targets, with specialty and performance surfactants expected to benefit from increased premium product demand.",
            "Sentiment": "positive",
            "PublishDate": 1732591990000,
            "Source": "normal_news"
        },
        {
            "Title": "Galaxy Surfactants Reports Q2 EBITDA Growth",
            "Summary": "Galaxy Surfactants announced its Q2 financial results. The company's EBITDA increased to 1.28 billion rupees from 1.24 billion rupees year-over-year. However, the EBITDA margin decreased slightly to 12.04% from 12.67% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731333783000,
            "Source": "result"
        },
        {
            "Title": "Galaxy Surfactants Reports Q2 FY2024 Financial Results",
            "Summary": "Galaxy Surfactants announced its Q2 FY2024 financial results. The company's consolidated net profit increased to 847 million rupees, up from 774 million rupees year-over-year and 797 million rupees quarter-over-quarter. Revenue for the quarter rose to 10.6 billion rupees, compared to 9.83 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731333736000,
            "Source": "result"
        }
    ]
}