{
    "Symbol": "GALAPREC",
    "ISIN": "INE0RE001014",
    "News": [
        {
            "Title": "Gala Precision Engineering Q3FY26 IPO Proceeds Report",
            "Summary": "Gala Precision Engineering utilized Rs 69.49 million during Q3FY26, with Rs 422.23 million remaining unutilized from its Rs 1,353.40 million IPO proceeds. The company deployed funds across facility setup and equipment purchase projects.",
            "Sentiment": "neutral",
            "PublishDate": 1770390311526,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gala Precision Engineering allots 47,275 ESOP shares",
            "Summary": "Gala Precision Engineering Limited allotted 47,275 equity shares to employees under ESOP 2021, increasing total shares from 1,27,50,276 to 1,27,97,550. The company realized INR 41,36,563 from the exercise.",
            "Sentiment": "positive",
            "PublishDate": 1770360953331,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gala Precision Engineering Q3 Profit Surges 57%",
            "Summary": "Gala Precision Engineering reported strong Q3 performance with net profit rising to 83M rupees from 53M rupees year-on-year, while revenue jumped to 853M rupees from 581M rupees.",
            "Sentiment": "positive",
            "PublishDate": 1770281117065,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gala Precision Engineering Reports 40% Revenue Growth in Q2 FY26, Chennai Plant Ramps Up Production",
            "Summary": "Gala Precision Engineering achieved consolidated revenue of Rs. 71 crores in Q2 FY26, marking a 40% year-on-year increase, with net profit growing 59% to Rs. 8 crores. The company's new Chennai facility has ramped up manufacturing to Rs. 4 crores per month and achieved Rs. 3 crores in sales for October, targeting Phase-1 capacity of Rs. 60 crores annually.",
            "Sentiment": "positive",
            "PublishDate": 1763116663239,
            "Source": "earnings"
        },
        {
            "Title": "Gala Precision Engineering Targets Growth Through Aerospace, Defense, and Oil-Gas Expansion",
            "Summary": "Gala Precision Engineering is targeting sustained growth driven by orders from aerospace, defense, and oil-gas sectors. The company is expanding its precision component capacity and automation efficiency while enhancing its global customer base through technology upgrades. The company maintains a strong export order book and aims for margin expansion through a high-value product mix.",
            "Sentiment": "positive",
            "PublishDate": 1762960747370,
            "Source": "stock"
        },
        {
            "Title": "Gala Precision Engineering Reports IPO Proceeds Utilization for September 2025 Quarter",
            "Summary": "Gala Precision Engineering Limited submitted its monitoring agency report for IPO proceeds utilization for the quarter ended September 30, 2025. The company raised Rs 1,353.40 million through its IPO conducted from September 2-4, 2024, with net proceeds of Rs 1,212.35 million after deducting issue expenses of Rs 141.05 million. The funds are being deployed across four main objectives: setting up a new facility in Tamil Nadu for manufacturing high tensile fasteners and hex bolts (Rs 370 million allocated), funding capital expenditure for equipment purchase at Wada, Maharashtra (Rs 110.69 million), repayment of borrowings (Rs 454.30 million - fully utilized), and general corporate purposes (Rs 277.36 million). As of September 30, 2025, the company had utilized Rs 720.63 million and maintained Rs 491.72 million in unutilized proceeds, primarily invested in fixed deposits with HDFC Bank and YES Bank. The monitoring was conducted by Crisil Ratings Limited, which reported no deviations from disclosed objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1762896328672,
            "Source": "stock"
        },
        {
            "Title": "Gala Precision Engineering Reports 61% Jump in Q2 Net Profit to 84 Million Rupees",
            "Summary": "Gala Precision Engineering reported Q2 net profit of 84 million rupees compared to 52 million rupees in the same period last year. Revenue increased to 714 million rupees from 512 million rupees year-over-year. EBITDA rose to 116 million rupees from 89 million rupees, though EBITDA margin declined to 15.70% from 17.47% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762862750187,
            "Source": "earnings"
        },
        {
            "Title": "Gala Precision Engineering Schedules Q2-FY26 Earnings Conference Call",
            "Summary": "Gala Precision Engineering Limited has scheduled a quarterly earnings conference call for investors and analysts on Thursday, November 13, 2025, at 10:00 AM IST to discuss the company's Q2-FY26 results. The management team will be represented by Chairman Managing Director Kirit Gala, Whole Time Director (Executive) Balkishan Jalan, Whole Time Director (Marketing) Satish Kotwani, and Chief Financial Officer Srinivasan Giridhar. The conference call will be facilitated by Valorem Advisors and includes multiple dial-in options including universal dial-in numbers and international toll-free numbers for USA, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1762418511417,
            "Source": "earnings"
        },
        {
            "Title": "Gala Precision Engineering Reports 19% Revenue Growth in Q1 FY26, Chennai Plant Begins Production",
            "Summary": "Gala Precision Engineering Limited reported consolidated revenue of Rs. 63 crores for Q1 FY26, marking a 19% year-on-year increase but a 16% quarter-on-quarter decline. The company's fastener business showed strong sequential growth of 64%, with revenue rising from Rs. 12 crores to Rs. 20 crores. EBITDA stood at Rs. 10 crores with margins at 15.21%, impacted by Rs. 2 crores forex losses on forward contract revaluation and additional operational costs of Rs. 1 crore. Net profit reached Rs. 6.5 crores, up 3.2% year-on-year. The company's order book stands at Rs. 70 crores to be executed over 3-4 months. Commercial production at the new Chennai facility began in July 2025, with dispatches expected from August. The company serves over 175 global customers across 25 countries with manufacturing focused on renewable energy, industrial, and mobility sectors. Management maintains growth guidance of 20-25% for FY26 and targets EBITDA margins of 17-19%. The Chennai plant is expected to contribute approximately Rs. 30 crores in FY26, while the Wada plant is projected to generate around Rs. 270 crores.",
            "Sentiment": "positive",
            "PublishDate": 1754641023594,
            "Source": "earnings"
        },
        {
            "Title": "Gala Precision Engineering Makes Q1 FY26 Earnings Call Audio Recording Available",
            "Summary": "Gala Precision Engineering Limited has made the audio recording of its Q1 FY26 earnings call available on its website. The earnings call was held on August 6, 2025, and discussed the company's operational and financial performance for the quarter ended June 30, 2025. The audio recording can be accessed through the company's website at galagroup.com.",
            "Sentiment": "neutral",
            "PublishDate": 1754485496652,
            "Source": "earnings"
        },
        {
            "Title": "Gala Precision Engineering Reports Decline in Q1 Financial Performance",
            "Summary": "Gala Precision Engineering reported quarterly results showing a decline across key financial metrics. Net profit decreased to 66 million rupees from 100 million rupees in the same period last year. Revenue fell to 631 million rupees compared to 753 million rupees year-over-year. EBITDA dropped to 96 million rupees from 128 million rupees, while EBITDA margin compressed to 15.25% from 17.01% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754394505259,
            "Source": "earnings"
        },
        {
            "Title": "Gala Precision Engineering Approves Quarterly Financial Results",
            "Summary": "Gala Precision Engineering Limited's Board of Directors approved the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The board meeting was held on August 5, 2025, lasting from 15:30 IST to 16:35 IST. The company submitted the financial results along with limited review reports from statutory auditors M/s SCA and Associates to BSE and NSE. The information has also been uploaded on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1754394375476,
            "Source": "earnings"
        },
        {
            "Title": "Gala Precision Engineering Reports Strong Q3 Financial Results",
            "Summary": "Gala Precision Engineering has announced its financial results for the third quarter. The company's net profit increased to 53 million rupees, up from 36 million rupees in the same period last year. Revenue also saw growth, rising to 581 million rupees from 494 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739350482000,
            "Source": "earnings"
        },
        {
            "Title": "Gala Precision Engineering: Shares Hit All-Time High on Heavy Volume",
            "Summary": "Gala Precision Engineering's shares surged 15.56% to a record high of Rs 944.90 on NSE, driven by heavy trading volume. The stock saw nearly 4.59 lakh shares traded, worth about Rs 41.35 crore, across NSE and BSE. Trading volume on NSE jumped to 4,13,933 shares, almost 7 times its weekly average.",
            "Sentiment": "positive",
            "PublishDate": 1729071593000,
            "Source": "normal_news"
        }
    ]
}