{
    "Symbol": "GALLANTT",
    "ISIN": "INE297H01019",
    "News": [
        {
            "Title": "Gallantt Ispat Q3 Results Show Revenue, Profit Decline",
            "Summary": "Gallantt Ispat reports Q3 net profit of ₹1.00 billion compared to ₹1.14 billion year-on-year, while revenue declined to ₹10.74 billion from ₹11.10 billion in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1770209270740,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gallantt Ispat Completes Inter-se Share Transfer",
            "Summary": "Gallantt Ispat Limited completed inter-se transfer of equity shares within promoter group on December 29 and 30, 2025, involving multiple family entities with regulatory compliance under SEBI SAST.",
            "Sentiment": "neutral",
            "PublishDate": 1767598031114,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gallantt Ispat Completes Additional Inter-se Transfer",
            "Summary": "Gallantt Ispat completed another inter-se share transfer on December 29, 2025, with Prem Prakash Agrawal acquiring 55.75 lakh shares (2.31%) from Prem Prakash Agrawal HUF, following earlier December transfers.",
            "Sentiment": "neutral",
            "PublishDate": 1766578241187,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gallantt Ispat Promoter Acquires 23.5 Lakh Shares",
            "Summary": "Santosh Kumar Agrawal acquired 23,49,775 equity shares from family member Smriti Agrawal in inter-se transfer on December 23, 2025, increasing promoter group holding to 4.66%.",
            "Sentiment": "neutral",
            "PublishDate": 1766577671929,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gallantt Ispat promoter transfers 86L shares",
            "Summary": "Santosh Kumar Agrawal acquires 86.04 lakh equity shares (3.566% stake) from Ashutosh Agrawal as gift transaction within promoter group for asset streamlining on December 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766558559689,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gallantt Ispat Promoter Acquires 1.63 Cr Shares",
            "Summary": "Chandra Prakash Agrawal acquired 16.33 million equity shares from promoter group member Mayank Agrawal through gift transaction on December 22, 2025, increasing promoter holding to 35.97%.",
            "Sentiment": "neutral",
            "PublishDate": 1766557512120,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gallantt Industry Acquires Additional 12.07L Shares",
            "Summary": "Gallantt Industry Private Limited acquired another 12,07,000 equity shares of Gallantt Ispat Limited on December 16, 2025, further increasing promoter group holding to 69.83%.",
            "Sentiment": "positive",
            "PublishDate": 1765519987768,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gallant Ispat Announces Inter-se Share Transfer Among Promoter Group Members",
            "Summary": "Gallant Ispat Limited disclosed that promoter group members will transfer 5,12,13,544 equity shares through gift transactions without consideration, scheduled on or after December 12, 2025. The inter-se transfers among the Agrawal family members will maintain the overall promoter group shareholding at the same level while streamlining family assets.",
            "Sentiment": "neutral",
            "PublishDate": 1765182113911,
            "Source": "corporate_action"
        },
        {
            "Title": "Gallantt Ispat Reports Strong Q2 Performance, Divests Associate Companies and Plans 18MW Solar Plant",
            "Summary": "Gallantt Ispat Limited reported quarterly results for the period ended September 30, 2025, with revenue from operations of Rs. 1,012.75 crores and net profit of Rs. 67.23 crores. The company's board approved the sale of its entire shareholding in two associate companies - Gallantt Medicity Developers Private Limited for Rs. 7.80 crores and Gallantt Lifespace Developers Private Limited for Rs. 81.90 crores to Gallantt Fincares Private Limited, a promoter group entity. Both transactions are expected to complete by November 30, 2025. Additionally, the board approved setting up an 18MW solar power plant in Gujarat with an estimated investment of Rs. 48.25 crores, expected to generate 3.38 crore KWH annually and become operational by May 31, 2026. The company has finalized approximately 60 acres of land on leasehold basis for the project.",
            "Sentiment": "positive",
            "PublishDate": 1762172374811,
            "Source": "earnings"
        },
        {
            "Title": "Gallantt Ispat Reports 33% Jump in Quarterly EBITDA to 1.3 Billion Rupees",
            "Summary": "Gallantt Ispat reported quarterly EBITDA of 1.3 billion rupees compared to 976 million rupees in the same period last year. The company's EBITDA margin improved to 12.99% from 10.35% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1762171616853,
            "Source": "earnings"
        },
        {
            "Title": "Gallantt Ispat Reports 78% Jump in Quarterly Net Profit to 872 Million Rupees",
            "Summary": "Gallantt Ispat reported net profit of 872 million rupees in its quarterly results, representing a significant increase from 489 million rupees in the same period last year. The company's revenue also grew to 10 billion rupees compared to 9.43 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762171234203,
            "Source": "earnings"
        },
        {
            "Title": "Gallantt Ispat Establishes Solar Power Subsidiary with ₹1 Lakh Investment",
            "Summary": "Gallantt Ispat's board has approved the establishment of a wholly-owned subsidiary called Suryalaxmi Technologies Pvt Ltd. The company plans to invest ₹1 lakh to develop a solar power plant with a capacity of 62.5 to 80 MW. The generated energy will be sold to the state government or through energy exchanges.",
            "Sentiment": "positive",
            "PublishDate": 1759995431828,
            "Source": "stock"
        },
        {
            "Title": "Gallant Ispat to Review New Subsidiaries and Solar Power Plant Establishment",
            "Summary": "Gallant Ispat plans to review and approve new wholly owned subsidiaries and establish a solar power plant on October 9. The company is expanding its business operations through subsidiary creation while also venturing into renewable energy infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1759763382110,
            "Source": "stock"
        },
        {
            "Title": "Gallantt Ispat Reports 43% Jump in Net Profit to Rs 173.8 Crore in Q1",
            "Summary": "Gallantt Ispat Limited reported net profit of Rs 173.8 crore for the quarter ended June 30, 2025, compared to Rs 121.9 crore in the same period last year. Revenue from operations increased to Rs 1,127.8 crore from Rs 1,159.7 crore year-over-year. The company's basic earnings per share stood at Rs 7.20 versus Rs 5.05 in the corresponding quarter. Total expenses decreased to Rs 918.2 crore from Rs 981.5 crore. The steel manufacturer's finance costs were Rs 5.6 crore, while other income was Rs 6.8 crore. The company is engaged in manufacturing steel and allied products including pellets, sponge iron, ingots, TMT bars and power generation. The board approved these unaudited financial results in a meeting held on July 29, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753785841413,
            "Source": "earnings"
        },
        {
            "Title": "Gallantt Ispat Wins Bid for Two Iron Ore Blocks in Uttar Pradesh",
            "Summary": "Gallantt Ispat has been selected as the preferred bidder for two iron ore blocks in Uttar Pradesh. These blocks contain combined reserves of 50.59 million metric tons of iron ore.",
            "Sentiment": "positive",
            "PublishDate": 1750325186000,
            "Source": "default"
        },
        {
            "Title": "Gallantt Ispat Reports Q4 Results and Recommends Dividend",
            "Summary": "Gallantt Ispat has announced its Q4 financial results and dividend recommendation. The company's Q4 revenue decreased to 10.72 billion rupees from 11.8 billion rupees year-over-year. However, Q4 standalone net profit increased to 1.16 billion rupees from 954 million rupees year-over-year. The EBITDA remained stable at 1.83 billion rupees, with an improved EBITDA margin of 17.08% compared to 15.59% in the previous year. The company has recommended a final dividend of 1.25 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747843565000,
            "Source": "result"
        },
        {
            "Title": "Gallantt Ispat to Consider Manufacturing Unit Expansion in Gorakhpur",
            "Summary": "Gallantt Ispat Ltd. has announced a board meeting scheduled for April 9 to discuss the potential expansion of its manufacturing units located in Gorakhpur. This meeting suggests the company is considering strategic growth opportunities to enhance its production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1743725206000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gallantt Ispat Forecasts Strong Growth and Margin Expansion",
            "Summary": "Gallantt Ispat has announced ambitious financial projections for the coming years. The company expects to achieve revenue of approximately 50 billion rupees by fiscal year 2026. For fiscal year 2025, Gallantt Ispat anticipates EBITDA margins to expand by 200 basis points year-over-year, reaching 13%. The company aims to drive this growth by targeting capacity utilization levels of over 90%.",
            "Sentiment": "positive",
            "PublishDate": 1733442793000,
            "Source": "earnings"
        },
        {
            "Title": "Gallantt Ispat: ₹80.45 Crore SGST Reimbursement Received from Gujarat and UP",
            "Summary": "Gallantt Ispat Ltd received ₹80.45 crore in partial SGST reimbursements from Gujarat (₹14.49 crore) and Uttar Pradesh (₹65.96 crore) governments under their respective industrial promotion policies for manufacturing facilities in Kutch and Gorakhpur.",
            "Sentiment": "positive",
            "PublishDate": 1733315178000,
            "Source": "corporate_action"
        }
    ]
}