{
    "Symbol": "GANDHAR",
    "ISIN": "INE717W01049",
    "News": [
        {
            "Title": "Gandhar Oil Refinery: Promoter Group Ups Stake to 1.59%",
            "Summary": "Gandhar Coals & Mines Private Limited acquires additional 40,000 shares in Gandhar Oil Refinery through open market purchase, increasing promoter group holding from 1.55% to 1.59%.",
            "Sentiment": "positive",
            "PublishDate": 1770141767987,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gandhar Oil Refinery Completes IPO Proceeds Utilization",
            "Summary": "Gandhar Oil Refinery has fully utilized its IPO proceeds of INR 281.184 crore across all stated objectives, with ICRA confirming no material deviations from the original plan.",
            "Sentiment": "positive",
            "PublishDate": 1770105339581,
            "Source": "stocks"
        },
        {
            "Title": "Gandhar Oil Declares Rs 0.75 Interim Dividend",
            "Summary": "Gandhar Oil Refinery announces interim dividend of Rs 0.75 per equity share for FY26 with record date January 30, 2026. Company provides detailed TDS guidelines for shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1769265257044,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gandhar Oil Refinery Q3FY26 Revenue Jumps 16% to ₹1,167 Cr",
            "Summary": "Gandhar Oil Refinery reports strong Q3FY26 results with revenue of ₹1,167 crores, up 16% YoY. EBITDA surged 42% to ₹59.1 crores while PAT jumped 68% to ₹34.3 crores, driven by sustained domestic demand.",
            "Sentiment": "positive",
            "PublishDate": 1769173329205,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gandhar Oil Refinery Sells Mohali Property, Buys Land",
            "Summary": "Gandhar Oil Refinery approves sale of Mohali immovable property for over ₹16 million and purchases 453.55-decimal land parcel adjacent to factory for expansion purposes.",
            "Sentiment": "positive",
            "PublishDate": 1769170730860,
            "Source": "stocks"
        },
        {
            "Title": "Gandhar Oil Board Meet Set for Jan 23 to Review Q3 Results",
            "Summary": "Gandhar Oil Refinery has scheduled its board meeting for January 23, 2026, to consider Q3FY26 unaudited financial results and potential interim dividend declaration for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1768571203282,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gandhar Oil Refinery Promoter Group Increases Stake",
            "Summary": "Gandhar Coal & Mines Private Limited acquired 53,816 additional shares in Gandhar Oil Refinery through open market purchase on December 30, 2025, increasing its stake from 1.36% to 1.41%.",
            "Sentiment": "positive",
            "PublishDate": 1767092363925,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gandhar Coal Mines Raises Stake to 1.25% with Dec 23 Buy",
            "Summary": "Gandhar Coal Mines acquired 51,842 additional shares of Gandhar Oil Refinery on December 23, 2025, increasing its total shareholding to 12,33,295 shares representing 1.25% stake through open market purchase.",
            "Sentiment": "positive",
            "PublishDate": 1765425533149,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gandhar Oil Refinery Appoints New Authorized Personnel for Stock Exchange Disclosures",
            "Summary": "Gandhar Oil Refinery's Board approved changes in Key Managerial Personnel authorized under Regulation 30(5) for determining materiality and making stock exchange disclosures, effective December 10, 2025. Mr. Indrajit Bhattacharyya (CFO) and Ms. Binal Khosla (Company Secretary & Compliance Officer) have been designated as the authorized persons for regulatory compliance and disclosure responsibilities.",
            "Sentiment": "neutral",
            "PublishDate": 1765196261575,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gandhar Oil Refinery Announces Key Management Changes with Company Secretary Transition",
            "Summary": "Gandhar Oil Refinery (India) Ltd announced the resignation of Company Secretary Jayshree Soni effective December 9, 2025, due to alternate career opportunities, with the Board accepting her resignation on December 8, 2025. The company simultaneously appointed Binal Khosla as the new Company Secretary-Legal Compliance Officer effective December 10, 2025, who brings over 13 years of corporate governance and compliance experience.",
            "Sentiment": "neutral",
            "PublishDate": 1765195482421,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gandhar Oil Refinery Reports Strong Q2 Performance with 17% Sequential Revenue Growth",
            "Summary": "Gandhar Oil Refinery posted Q2FY26 revenue of INR 10,599 million, up 17% sequentially, with EBITDA rising 43% to INR 658 million and PAT more than doubling to INR 397 million. The company achieved consolidated manufacturing volumes of 261,524 KL in H1FY26, up 9% year-on-year, driven by robust domestic demand in pharma and personal care segments.",
            "Sentiment": "positive",
            "PublishDate": 1763550081353,
            "Source": "earnings"
        },
        {
            "Title": "Gandhar Oil Refinery Reports No Material Deviation in IPO Proceeds Utilization for Q2 FY2026",
            "Summary": "Gandhar Oil Refinery (India) Limited submitted its monitoring agency report for Q2 FY2026, showing no material deviation from the objects of its IPO issue. ICRA Limited, the monitoring agency, confirmed that the utilization of issuance proceeds is in line with the stated objectives. The company's IPO was conducted in November 2023 with an issue size of INR 500.692 crore, generating actual net proceeds of INR 281.141 crore, which was higher than the estimated INR 263.103 crore due to lower issue-related expenses. The proceeds were allocated across four main objects: investment in Texol through loan (INR 22.713 crore), capital expenditure for automotive oil capacity expansion at Silvassa Plant (INR 27.729 crore), working capital requirements (INR 191.129 crore), and general corporate purposes (INR 39.570 crore). As of September 30, 2025, INR 281.125 crore has been utilized with only INR 0.016 crore remaining unutilized. The company operates in the lubricants sector and is promoted by Ramesh Babulal Parekh, Aslesh Rameshkumar Parekh, and Samir Ramesh Parekh.",
            "Sentiment": "positive",
            "PublishDate": 1763021898544,
            "Source": "corporate_action"
        },
        {
            "Title": "Gandhar Oil Refinery Reports Strong Q2 Results, Discontinues Subsidiary Merger, Approves Voluntary Liquidation",
            "Summary": "Gandhar Oil Refinery (India) Limited announced quarterly results for the period ended September 30, 2025, showing revenue from operations of Rs. 8,072.66 million and net profit of Rs. 322.20 million. The company discontinued its previously approved scheme of amalgamation with wholly-owned subsidiary Gandhar Shipping & Logistics Private Limited due to current business and operational considerations. The Board approved voluntary liquidation of Gandhar Shipping & Logistics Private Limited under the Insolvency and Bankruptcy Code, 2016. The subsidiary is not a material subsidiary and its liquidation will not affect business operations or have material impact on consolidated financials. On a consolidated basis, the company reported revenue of Rs. 10,545.40 million and net profit of Rs. 397.75 million for the quarter. The company had previously raised Rs. 3,020 million through fresh equity issue, with utilization details provided for various corporate purposes including subsidiary investment, capital expenditure, and working capital requirements.",
            "Sentiment": "positive",
            "PublishDate": 1762975878856,
            "Source": "earnings"
        },
        {
            "Title": "Gandhar Oil Refinery Releases Q2 FY2025-26 Investor Presentation",
            "Summary": "Gandhar Oil Refinery (India) Limited has released its investor presentation for the quarter and half-year ended September 30, 2025. The company reported quarterly revenue of INR 10,599 million for Q2 FY26, up from INR 9,351 million in Q2 FY25. Profit after tax increased to INR 398 million from INR 181 million year-over-year. For the half-year period, revenue reached INR 19,629 million with profit after tax of INR 659 million. The company positions itself as one of India's largest manufacturers of white oils and a top five player globally, with overseas operations contributing 40.21% of consolidated revenue. Personal care, healthcare and performance oils (PHPO) remains the largest business division, contributing 47.27% of revenues from finished goods sold. The company operates three manufacturing facilities in Taloja, Silvassa, and Sharjah with a total capacity of 218,256 kL.",
            "Sentiment": "positive",
            "PublishDate": 1762966541131,
            "Source": "stock"
        },
        {
            "Title": "Gandhar Oil Refinery Plans Volume Growth Through New Blending Units and Export Expansion",
            "Summary": "Gandhar Oil Refinery is pursuing volume-led growth by establishing new lubricant and specialty oil blending units. The company is expanding its export presence in Africa and Europe while investing in automation and high-margin white oil segments. The strategy focuses on product diversification and increasing global brand visibility, with management guiding for steady EBITDA improvement.",
            "Sentiment": "positive",
            "PublishDate": 1762960646121,
            "Source": "stock"
        },
        {
            "Title": "Gandhar Oil Refinery Reports Strong Q2 Performance with 37.5% Jump in Net Profit",
            "Summary": "Gandhar Oil Refinery delivered robust quarterly results with consolidated net profit rising to 360.5 million rupees from 262.2 million rupees in the previous quarter. Revenue increased to 10.6 billion rupees compared to 9.03 billion rupees quarter-on-quarter. EBITDA grew significantly to 658.4 million rupees from 460 million rupees, while EBITDA margin expanded to 6.21% from 5.09% in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762943848830,
            "Source": "earnings"
        },
        {
            "Title": "Gandhar Oil Refinery Schedules Earnings Call for Q2 & H1 FY2026 Results",
            "Summary": "Gandhar Oil Refinery (India) Limited has scheduled an earnings call with analysts and institutional investors on Thursday, November 13, 2025, at 10:30 AM IST. The call will discuss the company's unaudited financial results for the quarter and half year ended September 30, 2025 (Q2 & H1 FY2026). Key company participants include Samir Parekh (Vice Chairperson & Joint Managing Director), Aslesh Parekh (Joint Managing Director), and Indrajit Bhattacharyya (Chief Financial Officer). The company has provided conference dial-in numbers and pre-registration details for the call.",
            "Sentiment": "neutral",
            "PublishDate": 1762830427167,
            "Source": "earnings"
        },
        {
            "Title": "Gandhar Oil Refinery Ends Joint Venture with Texol Oils FZC and Signs Termination Deal with Espe Oils FZC",
            "Summary": "Gandhar Oil Refinery has announced the termination of its joint venture with Texol Oils FZC and has signed a termination agreement with Espe Oils FZC. The company is ending these business partnerships as part of restructuring its operations.",
            "Sentiment": "neutral",
            "PublishDate": 1760703116251,
            "Source": "order&deals"
        },
        {
            "Title": "Gandhar Oil and Refinery to Terminate Joint Venture with ESPE Oils and Wind Up Texol Oils FZC",
            "Summary": "Gandhar Oil and Refinery (India) Ltd's Board of Directors approved the termination of its joint venture agreement with ESPE Oils FZC and the winding up of joint venture company Texol Oils FZC during a meeting held on September 23, 2025. The company holds a 50% stake in Texol Oils FZC, which operates under a Commercial License from Hamriyah Free Zone Authority Sharjah. The decision is subject to regulatory approvals. Both parties mutually agreed to terminate the joint venture agreement as the separate structure was not beneficial to either party due to changed circumstances.",
            "Sentiment": "neutral",
            "PublishDate": 1758642422849,
            "Source": "corporate_action"
        },
        {
            "Title": "Gandhar Oil Refinery Secures Two-Year Transformer Oil Supply Contract with BHEL Jhansi",
            "Summary": "Gandhar Oil Refinery has secured a two-year contract with BHEL, Jhansi for the supply of transformer oil. The agreement establishes Gandhar Oil Refinery as a supplier to the public sector engineering company for this specialized petroleum product over the specified duration.",
            "Sentiment": "positive",
            "PublishDate": 1756107397835,
            "Source": "stock"
        },
        {
            "Title": "Gandhar Oil Refinery Plans Growth Strategy Focused on High-Profit PHPO and Global Expansion",
            "Summary": "Gandhar Oil Refinery has announced plans to enter its next growth phase by focusing on high-profit PHPO (Partially Hydrogenated Palm Oil) products and global expansion. The company aims to leverage its existing strong clientele in FMCG and healthcare sectors, along with its presence across over 100 countries. The growth strategy includes implementing a contract manufacturing approach designed to enhance scale, improve margins, and strengthen market leadership position.",
            "Sentiment": "positive",
            "PublishDate": 1754666600849,
            "Source": "stock"
        },
        {
            "Title": "Gandhar Oil Refinery Reports Mixed Q1 Results with Profit Surge Despite Revenue Decline",
            "Summary": "Gandhar Oil Refinery reported Q1 revenue of 9 billion rupees, down from 9.6 billion rupees in the previous quarter. However, the company's consolidated net profit more than doubled to 262 million rupees from 117 million rupees quarter-on-quarter. EBITDA increased significantly to 560 million rupees from 336 million rupees, while EBITDA margin improved to 5.1% from 3.49% in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754637975367,
            "Source": "earnings"
        },
        {
            "Title": "Gandhar Oil Refinery Senior General Manager Niraj Parekh Passes Away",
            "Summary": "Gandhar Oil Refinery (India) Ltd announced the passing of Mr. Niraj Parekh, Senior General Manager Plant at Silvasa, on July 30, 2025. Parekh held the position of Senior General Manager at Manufacturing, Operations Department at Silvassa Plant and was part of the senior management personnel. The company disclosed this information to stock exchanges BSE and NSE, with BSE scrip code 544029 and NSE symbol GANDHAR.",
            "Sentiment": "negative",
            "PublishDate": 1753861996626,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gandhar Oil Refinery Subsidiary Inaugurates Free Dialysis Center in Mumbai",
            "Summary": "Gandhar Foundation, a wholly owned subsidiary of Gandhar Oil Refinery (India) Limited, inaugurated a free dialysis center on July 21, 2025, at DLH Park, Malad West, Mumbai. The center was inaugurated by Maharashtra Chief Minister Devendra Fadnavis. This initiative is part of the company's Corporate Social Responsibility efforts, aimed at providing affordable and accessible medical facilities to underprivileged patients suffering from chronic kidney diseases. The center represents the company's commitment towards community healthcare development.",
            "Sentiment": "positive",
            "PublishDate": 1753160932018,
            "Source": "stock"
        },
        {
            "Title": "Gandhar Oil Refinery Reports Q4 EBITDA and Margin Decline",
            "Summary": "Gandhar Oil Refinery's Q4 EBITDA decreased to 336 million rupees from 416 million rupees in the previous quarter. The company's Q4 EBITDA margin also declined to 3.49% from 4.14% quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747923909000,
            "Source": "result"
        },
        {
            "Title": "Gandhar Oil Refinery Reports Q4 Financial Results",
            "Summary": "Gandhar Oil Refinery has reported its latest quarterly financial results. The company's consolidated net profit for Q4 was 117 million rupees, compared to 193 million rupees in the previous quarter. Revenue for Q4 stood at 9.6 billion rupees, down from 10 billion rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747923849000,
            "Source": "result"
        },
        {
            "Title": "Gandhar Oil Refinery Signs MoU for Vadhvan Port Development",
            "Summary": "Gandhar Oil Refinery (India) has signed a Memorandum of Understanding (MoU) with Jawaharlal Nehru Port Authority (JNPA) for the development of Vadhvan Port. The project is estimated to require an investment of 10 billion rupees and is scheduled to commence in 2030.",
            "Sentiment": "positive",
            "PublishDate": 1745281550000,
            "Source": "default"
        },
        {
            "Title": "Gandhar Oil Refinery Signs MOU for Vadhvan Port Development",
            "Summary": "Gandhar Oil Refinery (India) has signed a Memorandum of Understanding (MOU) with Jawaharlal Nehru Port Authority (JNPA) for the development of Vadhvan Port. The project is estimated to require an investment of 10 billion rupees and is scheduled to commence in 2030.",
            "Sentiment": "positive",
            "PublishDate": 1745246004000,
            "Source": "default"
        },
        {
            "Title": "Gandhar Oil Refinery Reports Q3 Results and Approves Amalgamation",
            "Summary": "Gandhar Oil Refinery (India) reported a consolidated net profit of 193 million rupees for Q3, down from 473 million rupees in the same period last year. Revenue decreased to 10 billion rupees from 11 billion rupees year-over-year. The company also approved a scheme of amalgamation with Gandhar Shipping & Logistics.",
            "Sentiment": "neutral",
            "PublishDate": 1738714938000,
            "Source": "earnings"
        },
        {
            "Title": "Gandhar Oil Refinery Approves Merger with Gandhar Shipping & Logistics",
            "Summary": "Gandhar Oil Refinery (India) has approved a scheme of amalgamation with Gandhar Shipping & Logistics. This corporate action involves the merger of the two companies, potentially consolidating their operations and resources.",
            "Sentiment": "neutral",
            "PublishDate": 1738673584000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gandhar Oil Refinery (India) Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Gandhar Oil Refinery (India) has reported a significant decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 417 million rupees, compared to 851 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin dropped to 4.15% from 7.72% year-over-year, indicating a substantial reduction in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1738669219000,
            "Source": "earnings"
        },
        {
            "Title": "Gandhar Oil Refinery (India) Reports Decline in Q3 Financial Results",
            "Summary": "Gandhar Oil Refinery (India) has reported a significant decrease in its third-quarter consolidated net profit, which fell to 193 million rupees from 473 million rupees in the same period last year. The company's revenue also declined, dropping to 10 billion rupees from 11 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738669212000,
            "Source": "earnings"
        },
        {
            "Title": "Gandhar Oil Refinery: USFDA Closes Inspection of Taloja Facility",
            "Summary": "Gandhar Oil Refinery received an Establishment Inspection Report (EIR) from USFDA for its Taloja facility. The inspection was classified as Voluntary Action Indicated (VAI) and concluded as 'closed'. This suggests minor issues that can be addressed voluntarily without formal regulatory actions.",
            "Sentiment": "positive",
            "PublishDate": 1734527343000,
            "Source": "normal_news"
        },
        {
            "Title": "Gandhar Oil Refinery Receives EIR from USFDA with VAI Classification",
            "Summary": "Gandhar Oil Refinery has received an Establishment Inspection Report (EIR) from the U.S. Food and Drug Administration (USFDA) for its Taljoa facility. The USFDA has classified the inspection as Voluntary Action Indicated (VAI), and the inspection has been concluded as 'closed'.",
            "Sentiment": "positive",
            "PublishDate": 1734521798000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gandhar Oil Refinery Reports Decline in Q2 EBITDA",
            "Summary": "Gandhar Oil Refinery's Q2 EBITDA decreased to 402 million rupees from 603 million rupees in the previous quarter. The company's EBITDA margin also fell to 4.30% from 6.06% quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1730886440000,
            "Source": "result"
        },
        {
            "Title": "Gandhar Oil Refinery Reports Q2 Revenue",
            "Summary": "Gandhar Oil Refinery has reported a quarterly revenue of 9.35 billion rupees for Q2, compared to 9.95 billion rupees in the previous quarter, indicating a quarter-over-quarter decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1730886430000,
            "Source": "result"
        },
        {
            "Title": "Gandhar Oil Refinery Reports Q2 Financial Results",
            "Summary": "Gandhar Oil Refinery has announced its consolidated net profit for the second quarter. The company reported a net profit of 181 million rupees, which is a decrease compared to the previous quarter's 308 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1730886375000,
            "Source": "result"
        }
    ]
}