{
    "Symbol": "GANDHITUBE",
    "ISIN": "INE524B01027",
    "News": [
        {
            "Title": "Gandhi Special Tubes Q3FY26 Net Profit Surges 30%",
            "Summary": "Gandhi Special Tubes reported strong Q3FY26 results with net profit rising 30% YoY to ₹1,969.97 lakhs. Revenue grew 22% to ₹4,844.21 lakhs despite exceptional charges of ₹118.12 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770826719987,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gandhi Special Tubes Board Meet on Feb 10 for Q3FY26",
            "Summary": "Gandhi Special Tubes Limited has scheduled a board meeting on February 10, 2026, to consider and approve unaudited financial results for Q3 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769756192182,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gandhi Special Tubes Promoters Sign Inter-se Agreement Governing Share Transfer and Control Rights",
            "Summary": "Gandhi Special Tubes Limited's 17 promoter shareholders entered into an inter-se agreement on November 22, 2025, establishing governance framework for their shareholding rights, transfer restrictions, and voting arrangements. The agreement requires 75% promoter consent for share pledging or transfers, mandates offering shares to working promoters first before external sales, and prohibits reclassification from promoter to public status without unanimous consent.",
            "Sentiment": "neutral",
            "PublishDate": 1763966474620,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gandhi Special Tubes Reports Mixed Q2 Results with Profit Growth and Revenue Decline",
            "Summary": "Gandhi Special Tubes reported quarterly net profit of 177 million rupees compared to 172 million rupees in the same period last year. Revenue declined to 480 million rupees from 486 million rupees year-over-year. EBITDA increased to 210.3 million rupees from 198.2 million rupees, while EBITDA margin improved to 43.8% from 40.79% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762776721577,
            "Source": "earnings"
        },
        {
            "Title": "Gandhi Special Tubes Senior General Manager Bharathuji K. Zala Resigns",
            "Summary": "Gandhi Special Tubes Limited announced that Mr. Bharathuji K. Zala, Senior General Manager, has resigned from his position due to personal reasons. His resignation becomes effective from the close of business hours on October 31, 2025. The company disclosed this information to BSE and NSE under SEBI listing regulations. Zala submitted his resignation letter on September 22, 2025, requesting relief from duties by October 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761910481875,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gandhi Tube Company Promoter Plans Inter-se Transfer of 1.65% Stake",
            "Summary": "Gandhi Tube Company Limited announced an inter-se transfer of 200,000 equity shares representing 1.65% stake between promoter group members. Mr. Manhar Gandhi will gift these shares to Mr. Rahul Gandhi through an off-market transaction scheduled on or after September 26, 2025. The transaction is structured as a gift without consideration and falls under the exemption of SEBI SAST Regulations. The aggregate holding of the promoter and promoter group will remain unchanged after the transfer.",
            "Sentiment": "neutral",
            "PublishDate": 1758535381048,
            "Source": "corporate_action"
        },
        {
            "Title": "Gandhi Special Tubes Limited Announces Passing of Promoter and Non-Executive Director Mr. Bhupatrai Gandhi",
            "Summary": "Gandhi Special Tubes Limited announced the death of Mr. Bhupatrai Gandhi, who served as Promoter and Non-Executive Director of the company. He passed away on September 9, 2025. The company acknowledged that it benefitted from his guidance and vision during his tenure on the Board and its Committees. The Board of Directors and employees expressed condolences to his family. The announcement was made through a regulatory disclosure to BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "negative",
            "PublishDate": 1757405263183,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gandhi Special Tubes Limited Approves Quarterly Financial Results for Period Ended June 30, 2025",
            "Summary": "Gandhi Special Tubes Limited's Board of Directors approved the unaudited financial results for the first quarter ended June 30, 2025, during a 30-minute board meeting held on August 11, 2025. The company, which specializes in manufacturing steel tubes and pipes, also approved the Limited Review Report from statutory auditors. The results will be published in newspapers and made available on the company's website at gandhispecialtubes.com. The approval follows SEBI regulations for disclosure requirements, with the company having provided prior intimation about the board meeting on August 1, 2025. Specific financial figures were not disclosed in the announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1754915643693,
            "Source": "earnings"
        },
        {
            "Title": "Gandhi Special Tubes Reports Strong Q1 Performance with 51% Jump in Net Profit",
            "Summary": "Gandhi Special Tubes delivered robust quarterly results with net profit rising to 216 million rupees from 143.2 million rupees year-over-year, marking a 51% increase. Revenue grew to 481 million rupees compared to 408.3 million rupees in the same period last year. The company's EBITDA improved to 207 million rupees from 158 million rupees, while EBITDA margin expanded to 43.11% from 38.69% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754914177154,
            "Source": "earnings"
        },
        {
            "Title": "Gandhi Special Tubes Reports Q4 Results and Recommends Dividend",
            "Summary": "Gandhi Special Tubes has announced its quarterly results and dividend recommendation. The company's Q4 net profit is reported at 119 million rupees, compared to 133.6 million rupees year-over-year and 152 million rupees quarter-over-quarter. Q4 revenue stands at 433 million rupees, up from 394.5 million rupees in the same quarter last year. The company has recommended a dividend of 15 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1748439522000,
            "Source": "result"
        },
        {
            "Title": "Gandhi Special Tubes Reports Improved Q3 EBITDA and Margin",
            "Summary": "Gandhi Special Tubes has reported an increase in its Q3 EBITDA to 167 million rupees, up from 155 million rupees in the same quarter last year. The company's EBITDA margin also improved, rising to 42.10% from 37.55% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739190109000,
            "Source": "earnings"
        },
        {
            "Title": "Gandhi Special Tubes Reports Q3 Financial Results",
            "Summary": "Gandhi Special Tubes has announced its financial results for the third quarter. The company reported a net profit of 152 million rupees, showing an increase from 132 million rupees year-over-year. However, it's a decrease from 172 million rupees quarter-over-quarter. The revenue for Q3 stood at 398 million rupees, down from 412 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739190014000,
            "Source": "earnings"
        },
        {
            "Title": "Gandhi Special Tubes Reports Improved Q2 Financial Performance",
            "Summary": "Gandhi Special Tubes has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 198 million rupees from 157 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 40.79% from 35.74% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730120481000,
            "Source": "result"
        },
        {
            "Title": "Gandhi Special Tubes Reports Q2 Revenue Growth",
            "Summary": "Gandhi Special Tubes has announced its Q2 revenue, which stands at 486 million rupees, compared to 439 million rupees in the same quarter last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730120469000,
            "Source": "result"
        },
        {
            "Title": "Gandhi Special Tubes Reports Q2 Profit Increase",
            "Summary": "Gandhi Special Tubes has reported a net profit of 172 million rupees for the second quarter, showing an increase from both the previous year (132 million rupees) and the previous quarter (143 million rupees).",
            "Sentiment": "positive",
            "PublishDate": 1730120457000,
            "Source": "result"
        }
    ]
}