{
    "Symbol": "GANESHBE",
    "ISIN": "INE388A01029",
    "News": [
        {
            "Title": "Ganesh Benzoplast Board Meet on Feb 13 for Q3 Results",
            "Summary": "Ganesh Benzoplast Limited has scheduled a board meeting on February 13, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed until 48 hours post-meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1770309544479,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ganesh Benzoplast Exits LPG Terminal Joint Venture with JNPT and Divests Stake in GBC LPG",
            "Summary": "Ganesh Benzoplast terminated its joint venture with JNPT for an LPG terminal project and sold its stake in GBC LPG. The company also received a non-compete fee from BW LPG as part of these strategic divestment transactions.",
            "Sentiment": "positive",
            "PublishDate": 1764089523486,
            "Source": "corporate_action"
        },
        {
            "Title": "Ganesh Benzoplast Reports 26% Jump in H1 FY26 Profit, Plans 30,000-Ton Tank Expansion",
            "Summary": "Ganesh Benzoplast Limited achieved consolidated profit after tax of INR 419 million in H1 FY26 versus INR 329 million in the previous year, with quarterly EPS rising 44% to INR 3.30. The company has commenced construction of 30,000 tons of A-class petroleum tanks with INR 40 crores investment, expecting INR 400-500 per KL monthly rental and 90% EBITDA margins from the new capacity.",
            "Sentiment": "positive",
            "PublishDate": 1763363935777,
            "Source": "earnings"
        },
        {
            "Title": "Ganesh Benzoplast Reports Strong Q2 FY26 Performance with Revenue Growth and Margin Expansion",
            "Summary": "Ganesh Benzoplast Limited released its Q2 FY26 investor presentation showing consolidated revenue of INR 1,946 million and PAT of INR 419 million with 22% PAT margin. The company operates liquid storage terminals with 3,52,000 KL capacity across JNPT, Cochin, and Goa, alongside chemical manufacturing and rail logistics through subsidiary ILSL.",
            "Sentiment": "neutral",
            "PublishDate": 1763108517312,
            "Source": "earnings"
        },
        {
            "Title": "Ganesh Benzoplast Schedules Board Meeting for Quarterly Financial Results",
            "Summary": "Ganesh Benzoplast Limited has announced a Board of Directors meeting scheduled for November 13, 2025, to consider and approve standalone and consolidated unaudited financial results for the quarter and half year ended September 30, 2025. The company has implemented a trading window closure for designated persons and their immediate relatives, effective from October 1, 2025, which will remain closed until 48 hours after the conclusion of the board meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1762252890051,
            "Source": "corporate_action"
        },
        {
            "Title": "Income Tax Department Searches Ganesh Benzoplast Corporate Office and Promoter's Residence",
            "Summary": "The Income Tax Department has conducted searches at Ganesh Benzoplast's corporate office and the promoter's residence. The company stated that the proceedings are ongoing and it cannot determine any potential liability at this time.",
            "Sentiment": "negative",
            "PublishDate": 1760486793246,
            "Source": "stock"
        },
        {
            "Title": "Income Tax Department Completes Survey at Ganesh Benzoplast",
            "Summary": "The Income Tax Department has completed a survey/search operation at Ganesh Benzoplast. The company provided full cooperation during the proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1760340437449,
            "Source": "stock"
        },
        {
            "Title": "NCLT Dismisses Insolvency Petition Against Ganesh Benzoplast",
            "Summary": "The National Company Law Tribunal (NCLT) has dismissed an insolvency petition filed by Progfin against Ganesh Benzoplast. The tribunal's decision prevents the initiation of insolvency proceedings against the company at this time.",
            "Sentiment": "positive",
            "PublishDate": 1756811558761,
            "Source": "stock"
        },
        {
            "Title": "Ganesh Benzoplast Reports 9% Revenue Growth in Q1 FY26, Chemical Division Profit Surges 223%",
            "Summary": "Ganesh Benzoplast Limited reported consolidated revenue of INR 956 million in Q1 FY26, up 9% year-on-year from INR 875 million. Consolidated profit after tax increased 10% to INR 181 million, while earnings per share rose 11% to INR 2.52. The Chemical division showed strong performance with turnover increasing 26% to INR 494 million and profit before tax surging 223% to INR 71 million, attributed to plant upgrades and improved procurement policies. However, rental income declined 8% due to extensive maintenance work at JNPT terminal during April-June. The company's joint venture with BW for an LPG terminal has been called off after BW decided to focus on their core shipping business rather than onshore infrastructure. Ganesh Benzoplast retains the 11-acre land at JNPT and is evaluating options for liquid storage or scaled-down LPG facilities. The Morgan legal case has been settled and closed. Management expects 5-6% annual rental growth going forward and plans to decide on future land development by quarter-end.",
            "Sentiment": "positive",
            "PublishDate": 1755325147799,
            "Source": "earnings"
        },
        {
            "Title": "Ganesh Benzoplast Reports 9% Revenue Growth in Q1 FY2026, Appoints New Independent Woman Director",
            "Summary": "Ganesh Benzoplast Limited's Board approved Q1 FY2026 financial results showing consolidated revenue of Rs. 956 million, up 9% from Rs. 875 million in the corresponding quarter of the previous year. Consolidated profit after tax increased 10% to Rs. 181 million from Rs. 164 million. The Chemical division performed strongly with turnover rising 26% to Rs. 494 million and profit before tax surging 223% to Rs. 71 million, attributed to plant system upgrades and improved raw material procurement policies. Consolidated earnings per share grew 11% to Rs. 2.52. The Board appointed Ms. Amruta Pankaj Thali as Additional Director in the capacity of Independent Woman Director for a five-year term from August 11, 2025 to August 10, 2030. Mr. Niraj Nabh Kumar was re-appointed as Non-Executive Independent Director for a second five-year term from September 26, 2025 to September 25, 2030. The company scheduled its 38th Annual General Meeting for September 25, 2025 via video conferencing.",
            "Sentiment": "positive",
            "PublishDate": 1754908906488,
            "Source": "corporate_action"
        },
        {
            "Title": "Ganesh Benzoplast Obtains Court Order Against Fake Loan Case",
            "Summary": "Ganesh Benzoplast has secured a court order in response to a fake loan case involving ₹7.03 crore. The company took legal action to address the fraudulent loan situation, demonstrating its commitment to protecting its financial interests and reputation.",
            "Sentiment": "positive",
            "PublishDate": 1752594172000,
            "Source": "default"
        },
        {
            "Title": "NCLAT Approves Loksevak's Appeal in Ganesh Benzoplast Case",
            "Summary": "The National Company Law Appellate Tribunal (NCLAT) has approved an appeal by Loksevak in a case involving Ganesh Benzoplast. As a result of this decision, the case has been reinstated to the National Company Law Tribunal (NCLT). The specific details of the case and the nature of Loksevak's appeal are not provided in the given information.",
            "Sentiment": "neutral",
            "PublishDate": 1752064379000,
            "Source": "default"
        },
        {
            "Title": "Ganesh Benzoplast in Discussions as BW Group and CPIL Withdraw from JNPT LPG Terminal Project",
            "Summary": "Ganesh Benzoplast has announced that it is in discussions with BW Group and CPIL regarding the next steps following their withdrawal from the JNPT LPG terminal project. The company stated that both BW Group and CPIL have withdrawn from the project, which was to be located at Jawaharlal Nehru Port Trust (JNPT).",
            "Sentiment": "negative",
            "PublishDate": 1747728587000,
            "Source": "default"
        },
        {
            "Title": "Ganesh Benzoplast Q4 Results: EBITDA Up, Revenue Down",
            "Summary": "Ganesh Benzoplast reported mixed Q4 results. EBITDA increased to 315M rupees from 211M year-over-year, with EBITDA margin improving to 31.53% from 14.49%. However, the company posted a consolidated net loss of 132M rupees, slightly better than the 143M loss in the same quarter last year. Revenue declined to 999M rupees from 1.46B year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747225062000,
            "Source": "result"
        },
        {
            "Title": "Ganesh Benzoplast Secures Order Worth ₹169 Crore",
            "Summary": "Ganesh Benzoplast Limited has won a new order valued at 169 crore rupees. This significant contract represents a positive development for the company's business operations and potential revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1743500306000,
            "Source": "order&deals"
        },
        {
            "Title": "Ganesh Benzoplast Reports Improved Q3 EBITDA and Margin",
            "Summary": "Ganesh Benzoplast has reported an increase in its Q3 EBITDA to 270 million rupees, up from 241 million rupees in the same quarter last year. The company's EBITDA margin also improved significantly, rising to 30.27% from 22.69% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739345240000,
            "Source": "earnings"
        },
        {
            "Title": "Ganesh Benzoplast Reports Decline in Q3 Revenue",
            "Summary": "Ganesh Benzoplast Limited has reported a decrease in its third-quarter revenue. The company's revenue for Q3 stood at 892 million rupees, down from 1.06 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1739345087000,
            "Source": "earnings"
        },
        {
            "Title": "Ganesh Benzoplast Reports Increase in Q3 Consolidated Net Profit",
            "Summary": "Ganesh Benzoplast Limited has reported a consolidated net profit of 184 million rupees for the third quarter, showing an increase from 161 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739345065000,
            "Source": "earnings"
        },
        {
            "Title": "Ganesh Benzoplast Reports Q2 Financial Results",
            "Summary": "Ganesh Benzoplast has announced its Q2 financial results. The company's EBITDA for the quarter was 246 million rupees, compared to 255 million rupees in the same quarter last year. Despite a slight decrease in EBITDA, the EBITDA margin improved to 25.20% from 24.83% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731570907000,
            "Source": "result"
        },
        {
            "Title": "Ganesh Benzoplast Reports Q2 FY24 Financial Results",
            "Summary": "Ganesh Benzoplast Limited has announced its Q2 FY24 financial results. The company reported a consolidated net profit of 165 million rupees, up from 155 million rupees in the same quarter last year. However, revenue decreased to 976 million rupees from 1 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731570844000,
            "Source": "result"
        }
    ]
}