{
    "Symbol": "GANESHIN",
    "ISIN": "INE0TVT01024",
    "News": [
        {
            "Title": "Ganesh Infraworld Plans Rs 200-250 Crore Share Sale Through QIP",
            "Summary": "Ganesh Infraworld, a Kolkata-based engineering, procurement, and construction firm, is planning to raise Rs 200-250 crore through a qualified institutional placement. The company listed on the NSE SME Emerge platform on December 6 last year and has a market value of Rs 971.91 crore. The stock has gained more than 44% since its debut but fell 3.1% on Wednesday to close at Rs 227.5. The company has not disclosed the launch date or pricing details for the QIP.",
            "Sentiment": "neutral",
            "PublishDate": 1758782921396,
            "Source": "stock"
        },
        {
            "Title": "Ganesh Infraworld Secures ₹708 Crore Order",
            "Summary": "Ganesh Infraworld has secured a new order worth ₹708 crore. The company currently has a market capitalization of ₹1,100 crore.",
            "Sentiment": "positive",
            "PublishDate": 1756790998586,
            "Source": "order&deals"
        },
        {
            "Title": "Ganesh Infraworld Secures 2.04 Billion Rupee Contract",
            "Summary": "Ganesh Infraworld has been awarded a contract valued at 2.04 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1753229372854,
            "Source": "order&deals"
        },
        {
            "Title": "Ganesh Infraworld Secures Contract Worth 2.04 Billion Rupees",
            "Summary": "Ganesh Infraworld has been awarded a contract valued at 2.04 billion rupees. The announcement indicates a significant business development for the company.",
            "Sentiment": "positive",
            "PublishDate": 1753195436535,
            "Source": "stock"
        },
        {
            "Title": "Ganesh Infraworld Secures 129.8 Crore Rupee Water Management Contract in Kolkata",
            "Summary": "Ganesh Infraworld has been awarded a turnkey contract valued at 129.8 crore rupees for water management and civil works across various projects in Kolkata. The EPC (Engineering, Procurement, and Construction) project has a duration of 24 months.",
            "Sentiment": "positive",
            "PublishDate": 1740096471000,
            "Source": "order&deals"
        },
        {
            "Title": "Ganesh Infraworld Secures 129.8 Crore Rupee Contract for Water Management in Kolkata",
            "Summary": "Ganesh Infraworld has been awarded a turnkey contract worth 129.8 crore rupees for water management and civil works across various projects in Kolkata. The Engineering, Procurement, and Construction (EPC) project has a duration of 24 months.",
            "Sentiment": "positive",
            "PublishDate": 1740068711000,
            "Source": "order&deals"
        },
        {
            "Title": "Ganesh Infraworld Reports Improved Q3 EBITDA and Margin",
            "Summary": "Ganesh Infraworld, an SME company, has reported a significant increase in its Q3 EBITDA, rising to 159 million rupees from 95 million rupees in the same quarter last year. The company's EBITDA margin also improved, reaching 10.68% compared to 9.99% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738744608000,
            "Source": "earnings"
        },
        {
            "Title": "Ganesh Infraworld Reports Strong Q3 Financial Results",
            "Summary": "Ganesh Infraworld, an SME company, has announced its financial results for the third quarter. The company reported a net profit of 113 million rupees, up from 71 million rupees in the previous quarter. Revenue also saw significant growth, reaching 1.5 billion rupees compared to 950 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738744552000,
            "Source": "earnings"
        },
        {
            "Title": "Ganesh Infraworld: Stellar 90% Premium Listing on NSE SME",
            "Summary": "Ganesh Infraworld shares listed at ₹157.70 on NSE SME, a 90% premium to the issue price. The stock gained an additional 4.5% post-listing.",
            "Sentiment": "positive",
            "PublishDate": 1733459659000,
            "Source": "normal_news"
        }
    ]
}