{
    "Symbol": "GANESHHOU",
    "ISIN": "INE460C01014",
    "News": [
        {
            "Title": "Ganesh Housing Reports Q3 Net Loss of ₹94M vs Profit",
            "Summary": "Ganesh Housing Corporation swung to a net loss of ₹94 million in Q3 compared to a profit of ₹1.6 billion in the same quarter of the previous year, marking a significant year-on-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1770362452315,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ganesh Housing Board Approves Scheme of Arrangement with Wholly-Owned Subsidiary Gatil Properties",
            "Summary": "Ganesh Housing Limited's board approved a scheme of arrangement with its wholly-owned subsidiary Gatil Properties Private Limited, replacing a previously approved amalgamation scheme that was rescinded. The arrangement involves writing off a debit balance of Rs. 498.56 crores in Capital Reserve against Securities Premium Account, with no fresh share issuance or changes to shareholding pattern.",
            "Sentiment": "neutral",
            "PublishDate": 1764925799834,
            "Source": "corporate_action"
        },
        {
            "Title": "Ganesh Housing Reports Q2 FY26 Results with 15% Sequential Growth Despite Muted Annual Performance",
            "Summary": "Ganesh Housing Limited reported Q2 FY26 revenue of 174 crores with 16% quarter-on-quarter EBITDA growth to 148 crores, though annual growth remains challenged with management revising down FY26 profit growth guidance from 25-30% to maintaining last year's levels. The company completed name change from Ganesh Housing Corporation Limited to Ganesh Housing Limited and announced amalgamation of wholly owned subsidiary while progressing on multiple projects including Million Minds SEZ Phase-1 nearing 100% leasing and Malabar Retreat showing renewed booking traction.",
            "Sentiment": "neutral",
            "PublishDate": 1763043521278,
            "Source": "earnings"
        },
        {
            "Title": "Ganesh Housing Reports Strong Q2 Results and Approves Subsidiary Merger",
            "Summary": "Ganesh Housing Limited announced its quarterly results for the quarter ended September 30, 2025, showing revenue from operations of Rs 1,395.08 lakhs. The company reported a net profit of Rs 5,740.62 lakhs for the quarter. On a consolidated basis, revenue reached Rs 17,428.33 lakhs with net profit of Rs 10,808.94 lakhs. The Board of Directors approved a scheme of amalgamation with its wholly-owned subsidiary Gatil Properties Private Limited, with an appointed date of April 1, 2025. The merger aims to simplify corporate structure, achieve economies of scale, and consolidate operational capabilities. The scheme requires regulatory approvals including sanction from the National Company Law Tribunal. No cash or share consideration will be involved as Gatil Properties is wholly-owned by Ganesh Housing. The company's shareholding pattern will remain unchanged post-merger.",
            "Sentiment": "positive",
            "PublishDate": 1762439843633,
            "Source": "corporate_action"
        },
        {
            "Title": "Ganesh Housing Corp Reports Decline in Q2 Financial Performance",
            "Summary": "Ganesh Housing Corp reported Q2 EBITDA of 1.48 billion rupees compared to 2.02 billion rupees in the same period last year. The company's EBITDA margin decreased to 84.94% from 85.39% year-over-year. Consolidated net profit fell to 1.08 billion rupees from 1.6 billion rupees, while revenue dropped to 1.7 billion rupees from 2.4 billion rupees compared to the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762423263392,
            "Source": "earnings"
        },
        {
            "Title": "KDS Family Trust Acquires 3.76% Stake in Ganesh Housing Corporation",
            "Summary": "KDS Family Discretionary Trust acquired 31,33,333 equity shares of Ganesh Housing Corporation Limited through an off-market transaction on February 20, 2025. The acquisition represents 3.76% of the company's total share capital. The shares were purchased from Mr. Kunal Dhanpalbhai Shah, who also serves as the trustee of KDS Family Discretionary Trust. The transaction was disclosed under SEBI regulations for substantial acquisition of shares. Ganesh Housing Corporation has a total equity share capital of Rs. 83,38,70,900 divided into 8,33,87,090 equity shares of Rs. 10 each. The company's shares are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1761796210364,
            "Source": "corporate_action"
        },
        {
            "Title": "Ganesh Housing Corporation Renamed to Ganesh Housing Limited After MCA Approval",
            "Summary": "Ganesh Housing Corporation has been renamed to Ganesh Housing Limited following approval from the Ministry of Corporate Affairs (MCA).",
            "Sentiment": "neutral",
            "PublishDate": 1755181696495,
            "Source": "corporate_action"
        },
        {
            "Title": "Ganesh Housing Q1 FY26 Revenue Drops 30% to INR151 Crores Despite Strong Project Pipeline",
            "Summary": "Ganesh Housing Corporation reported quarterly revenue of INR151 crores, down 30% year-on-year, though EBITDA margins improved to 85% from 71%. PAT stood at INR93 crores versus INR114 crores previously. The company's Malabar Retreat premium residential project is 43% complete with sample flats ready. Million Minds SEZ Phase 1 has 80% of leasable area under active discussions with expected lease income starting Q3-Q4 FY26. The Godhavi Township project sold 10 acres during the quarter at INR30,000 per square feet, with majority of quarterly income coming from this project. One Thaltej commercial project of 1.8 million square feet is in final approval stages with estimated lifetime revenue of INR2,100 crores. The company maintains negligible debt and strong cash position across its 525-acre land bank.",
            "Sentiment": "neutral",
            "PublishDate": 1753277293654,
            "Source": "earnings"
        },
        {
            "Title": "Ganesh Housing Corporation Reports Q1 FY26 Results with Revenue of INR 1,510 Million",
            "Summary": "Ganesh Housing Corporation Limited released its quarterly results showing revenue of INR 1,510 million for Q1 FY26, down 32% year-over-year from INR 2,206 million in Q1 FY25. EBITDA margins improved to 84.8% from 70.5% in the previous year, while PAT margins expanded to 61.6% from 51.6%. The company reported PAT of INR 931 million and EPS of INR 11.16. The company maintains a net debt-free status for over 3 years. Key project updates include Malabar Retreat at 43% completion and Million Mind Tech Park Phase 1 nearing 90% completion. The company added One Thaltej project with 1.8 million square feet saleable area to its pipeline, currently in plan processing stage with construction expected to start post-monsoon.",
            "Sentiment": "neutral",
            "PublishDate": 1753099462291,
            "Source": "earnings"
        },
        {
            "Title": "Ganesh Housing Corp Reports Mixed Q1 Results with Revenue and Profit Decline Despite Margin Improvement",
            "Summary": "Ganesh Housing Corp reported quarterly results showing a decline in key financial metrics. Net profit dropped to 931 million rupees from 1.14 billion rupees year-over-year. Revenue fell to 1.5 billion rupees compared to 2.1 billion rupees in the same period last year. EBITDA decreased to 1.28 billion rupees from 1.55 billion rupees year-over-year. However, EBITDA margin improved significantly to 84.80% from 72.23% in the previous year period.",
            "Sentiment": "negative",
            "PublishDate": 1753081166298,
            "Source": "earnings"
        },
        {
            "Title": "Ganesh Housing Corp Reports Q4 Results and Declares Dividend",
            "Summary": "Ganesh Housing Corp announced its Q4 financial results and a dividend declaration. The company reported a consolidated net profit of 1.65 billion rupees, up from 1.12 billion rupees year-over-year. Revenue for Q4 was 2.5 billion rupees, compared to 2.77 billion rupees in the previous year. Additionally, the company declared a dividend of 5 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747208662000,
            "Source": "result"
        },
        {
            "Title": "Ganesh Housing Corp Reports Q3 Revenue Growth",
            "Summary": "Ganesh Housing Corp announced its third quarter financial results, reporting revenue of 2.6 billion rupees. This represents a significant increase from the 1.8 billion rupees reported in the same quarter of the previous year, indicating a year-over-year growth in the company's revenue.",
            "Sentiment": "positive",
            "PublishDate": 1737098764000,
            "Source": "earnings"
        },
        {
            "Title": "Ganesh Housing Corp Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Ganesh Housing Corp has announced its financial results for the third quarter, reporting a consolidated net profit of 1.6 billion rupees. This represents a substantial increase from the 1 billion rupees reported in the same quarter of the previous year, indicating a year-over-year growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1737098740000,
            "Source": "earnings"
        },
        {
            "Title": "Ganesh Housing Corporation to Consider Q3 Results on January 17",
            "Summary": "Ganesh Housing Corporation has announced that it will consider its financial results for the third quarter on January 17.",
            "Sentiment": "neutral",
            "PublishDate": 1736257112000,
            "Source": "result"
        },
        {
            "Title": "Ganesh Housing Corp Announces Ambitious Development Plans",
            "Summary": "Ganesh Housing Corp has revealed plans to develop approximately 33 million square feet of infrastructure and special projects, including an IT-SEZ called Million Minds and a township, over the next few years. The company estimates the total sales value of these projects to be around 175 billion Indian Rupees, as stated in their investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1729321812000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ganesh Housing Corp Reports Strong Q2 Financial Performance",
            "Summary": "Ganesh Housing Corp has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 2.02 billion rupees, up from 1.2 billion rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 85.39% from 74.34% in the previous year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1729245552000,
            "Source": "result"
        },
        {
            "Title": "Ganesh Housing Corp Reports Strong Q2 Revenue Growth",
            "Summary": "Ganesh Housing Corp has announced its Q2 revenue results, reporting 2.4 billion rupees compared to 1.6 billion rupees in the same quarter last year. This represents a significant year-over-year increase in revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1729245512000,
            "Source": "result"
        },
        {
            "Title": "Ganesh Housing Corp Reports Significant Profit Increase in Q2",
            "Summary": "Ganesh Housing Corp has announced its Q2 consolidated net profit of 1.6 billion rupees, compared to 860 million rupees in the same period last year, representing a substantial year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729245490000,
            "Source": "result"
        }
    ]
}