{
    "Symbol": "GANESHCP",
    "ISIN": "INE652V01016",
    "News": [
        {
            "Title": "Ganesh Consumer Products Files Q3 Call Transcript",
            "Summary": "Ganesh Consumer Products Limited has uploaded the transcript of its earnings conference call held on February 5th, 2026, to its investor relations section for stakeholder access.",
            "Sentiment": "neutral",
            "PublishDate": 1770728640755,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ganesh Consumer Products Board Meet on Feb 4, 2026",
            "Summary": "Ganesh Consumer Products Limited schedules board meeting for February 04, 2026 to consider Q3FY26 unaudited financial results. Trading window remains closed until 48 hours post-meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1769667982179,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ganesh Consumer Products Reports No Fund Utilization in Q2 FY26 IPO Monitoring Report",
            "Summary": "Ganesh Consumer Products Limited has not utilized any funds from its Rs. 130 crore IPO proceeds during the quarter ended September 30, 2025, with the entire amount remaining in bank accounts. The monitoring agency CARE Ratings found no deviation from stated objectives, while the company's planned fund deployment includes debt repayment (Rs. 60 crore), manufacturing unit setup (Rs. 45 crore), and general corporate purposes (Rs. 14.20 crore).",
            "Sentiment": "neutral",
            "PublishDate": 1763117728242,
            "Source": "stock"
        },
        {
            "Title": "Ganesh Consumer Products Declares Rs. 2.50 Per Share Interim Dividend for FY 2025-26",
            "Summary": "Ganesh Consumer Products Limited's Board of Directors declared an interim dividend of Rs. 2.50 per fully paid-up equity share of Rs. 10 each, representing a 25% dividend rate. The total dividend amount is Rs. 10,10,32,365. The record date for determining shareholder entitlement is November 14, 2025, and the dividend payment will be made on or before December 4, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762453946474,
            "Source": "corporate_action"
        },
        {
            "Title": "Ganesh Consumer Products Plans Expansion Beyond West Bengal, Targets 11% EBITDA Margins by FY28",
            "Summary": "Ganesh Consumer Products is targeting rapid expansion across packaged staples, spices, and emerging food segments. The company holds a 43% market share in Sattu and 31% in Sooji & Dalia in East India. The expansion strategy includes scaling distribution beyond West Bengal, enhancing B2C penetration, and implementing SAP, DMS, and WMS systems for operational efficiency. The company projects EBITDA margins to improve to 11% by FY28 through brand building initiatives, solar integration, and technology adoption.",
            "Sentiment": "positive",
            "PublishDate": 1762443332601,
            "Source": "stock"
        },
        {
            "Title": "Ganesh Consumer Products Reports 16.8% Growth in Q2 Net Profit",
            "Summary": "Ganesh Consumer Products reported a net profit of 111 million rupees in Q2, compared to 95 million rupees in the same period last year. The company's revenue increased to 2.39 billion rupees from 2.27 billion rupees year-over-year. EBITDA rose to 239 million rupees from 192 million rupees, while EBITDA margin improved to 10.02% from 8.6% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762436231998,
            "Source": "earnings"
        },
        {
            "Title": "Ganesh Consumer Products Reports Q1 FY26 Results with 7.8% Revenue Growth",
            "Summary": "Ganesh Consumer Products Limited reported unaudited financial results for the quarter ended June 30, 2025. Revenue from operations increased to Rs 20,295.55 lakhs compared to Rs 18,946.43 lakhs in the same quarter last year. Net profit declined to Rs 952.97 lakhs from Rs 1,342.96 lakhs in the corresponding quarter of the previous year. Basic earnings per share stood at Rs 2.62 versus Rs 3.69 in the year-ago quarter. The company operates in manufacturing, selling and distribution of packaged consumer staples including wheat-based products, gram-based products, spices and powder of various cereals and pulses. The company completed its IPO of 12,698,020 equity shares at Rs 322 per share, raising Rs 40,879.83 lakhs, with shares listed on NSE and BSE on September 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760601072860,
            "Source": "earnings"
        },
        {
            "Title": "Bengal Finance And Investment Holds 1.46% Stake In Ganesh Consumer Products",
            "Summary": "Bengal Finance And Investment, associated with Ashish Kacholia, appears as a stakeholder in Ganesh Consumer Products with a 1.46% stake during the second quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1760591793565,
            "Source": "stock"
        },
        {
            "Title": "Ganesh Consumer Products Cancels Q1 FY26 Earnings Call, to Combine with Q2 Results",
            "Summary": "Ganesh Consumer Products Limited cancelled its Q1 FY26 earnings conference call that was scheduled for October 16, 2025. The company will hold its board meeting on October 16, 2025 to approve Q1 FY26 financial results and release the outcome the same day. The earnings call will now be combined with the Q2 FY26 earnings call, which will be held after the Q2 results announcement. The company plans to announce Q2 FY26 results on or before November 15, 2025, with the earnings call date to be communicated later.",
            "Sentiment": "neutral",
            "PublishDate": 1760352506398,
            "Source": "corporate_action"
        }
    ]
}