{
    "Symbol": "GANECOS",
    "ISIN": "INE845D01014",
    "News": [
        {
            "Title": "Ganesha Ecosphere Q3FY26 Results Announced",
            "Summary": "Ganesha Ecosphere Limited reported standalone net profit of ₹1,594.29 lakh for Q3FY26, down from ₹1,957.16 lakh in Q3FY25. Revenue from operations reached ₹27,294.53 lakh.",
            "Sentiment": "negative",
            "PublishDate": 1770491652775,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ganesha Ecosphere faces ₹6.56 Cr GST demand notice",
            "Summary": "Ganesha Ecosphere Limited received a GST demand notice of ₹6.56 crores from SGST Moradabad, with additional interest and penalty claims totaling over ₹17 crores. Company plans to appeal.",
            "Sentiment": "negative",
            "PublishDate": 1770131788077,
            "Source": "stocks"
        },
        {
            "Title": "Ganesha Ecosphere Reports Q2 FY26 Loss Due to Inventory Costs and Regulatory Delays",
            "Summary": "Ganesha Ecosphere Limited reported negative net profits and compressed EBITDA margins of 6.1% for Q2 FY26, primarily due to inventory losses of INR 10-11 crores from raw material price volatility and delayed government notification affecting rPET deliveries. The company expects recovery from January 2026 as regulatory clarity emerges and legacy business shows improvement, with brownfield expansion of 22,500 tons capacity planned by March 2026.",
            "Sentiment": "negative",
            "PublishDate": 1763559497651,
            "Source": "earnings"
        },
        {
            "Title": "Axis Trustee Services Receives 7.46% Share Pledge in Ganesha Ecosphere",
            "Summary": "Axis Trustee Services Limited received a pledge of 20,00,000 equity shares (7.46% stake) in Ganesha Ecosphere Limited as debenture trustee on November 18, 2025. The pledgee clarifies it holds no beneficial interest in the shares, which were pledged as security for facility arrangements under SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763549718312,
            "Source": "corporate_action"
        },
        {
            "Title": "Ganesha Ecosphere Reports Proper Utilization of Rs 149.97 Crore Warrant Proceeds",
            "Summary": "Ganesha Ecosphere Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing no deviation in the utilization of Rs 149.97 crore raised through fully convertible equity warrants issued in January 2024. ICRA Limited confirmed that Rs 46.04 crore has been utilized as per disclosed objectives including plant machinery purchase, debt repayment, and general corporate purposes, with Rs 62.25 crore deployed in fixed deposits.",
            "Sentiment": "positive",
            "PublishDate": 1763109781809,
            "Source": "corporate_action"
        },
        {
            "Title": "Ganesha Ecosphere Reports Mixed Q2 Performance with Standalone Profit Growth",
            "Summary": "Ganesha Ecosphere Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 25,935.20 lakhs for the quarter compared to Rs 25,532.39 lakhs in the same quarter last year. Net profit for the quarter stood at Rs 4,293.26 lakhs versus Rs 4,947.61 lakhs in the previous year quarter. For the half-year period, standalone revenue was Rs 48,082.36 lakhs against Rs 49,941.32 lakhs last year, while net profit reached Rs 5,374.96 lakhs compared to Rs 10,311.97 lakhs in the corresponding period. On a consolidated basis, the company showed revenue from operations of Rs 36,886.61 lakhs for the quarter. The company had allotted 13,39,000 equity shares to the Promoter Group on July 17, 2025, at an issue price of Rs 1,035 per share, increasing the paid-up equity share capital to Rs 2,679.60 lakhs. A final dividend of Rs 3.00 per equity share was declared for the financial year 2024-25.",
            "Sentiment": "neutral",
            "PublishDate": 1762819824349,
            "Source": "earnings"
        },
        {
            "Title": "Ganesha Ecosphere Reports Q2 Net Loss of 5M Rupees, Revenue Declines to 3.64B Rupees",
            "Summary": "Ganesha Ecosphere reported a consolidated net loss of 5 million rupees in Q2, compared to a profit of 271 million rupees in the same period last year. Revenue decreased to 3.64 billion rupees from 3.87 billion rupees year-over-year. EBITDA fell significantly to 223.1 million rupees from 552.8 million rupees, while EBITDA margin compressed to 6.14% from 14.29% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762785047791,
            "Source": "earnings"
        },
        {
            "Title": "Ganesha Ecosphere Schedules Post-Results Conference Call for Q2FY26 Earnings",
            "Summary": "Ganesha Ecosphere Limited will participate in a post-results earnings conference call hosted by Antique Stock Broking Limited on November 12, 2025, at 12:00 noon IST. The call will discuss the company's unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. The senior management team participating includes Chief Financial Officer Gopal Agarwal, Senior Vice President Prashant Khandelwal, and Director Yash Sharma from Ganesha Ecopet Private Limited. The company trades on BSE with scrip code 514167 and on NSE with symbol GANECOS.",
            "Sentiment": "neutral",
            "PublishDate": 1762537136290,
            "Source": "earnings"
        },
        {
            "Title": "Ganesha Ecosphere Sets September 20, 2025 as Record Date for Dividend Eligibility and AGM",
            "Summary": "Ganesha Ecosphere Limited has set September 20, 2025 as the record date for determining shareholder eligibility for dividend distribution and participation in the Annual General Meeting. The company's register of members will remain closed from September 21 to September 27, 2025. The Annual General Meeting is scheduled for September 27, 2025, where dividend declaration will be considered. The announcement was communicated to NSE and BSE exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1757769956362,
            "Source": "corporate_action"
        },
        {
            "Title": "Ganesha Ecosphere Sets Book Closure Dates for AGM and Dividend Eligibility",
            "Summary": "Ganesha Ecosphere Limited announced that its Register of Members and Share Transfer Books will remain closed from September 21, 2025 to September 27, 2025 for the Annual General Meeting scheduled on September 27, 2025, and to determine dividend eligibility. The Board of Directors has recommended a dividend on equity shares, which requires approval at the Annual General Meeting. Shareholders whose names appear in the Register of Members or Register of Beneficial Owners by the close of business on September 20, 2025 will be eligible to receive the dividend. If approved, the dividend will be payable on or after October 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1756976651486,
            "Source": "corporate_action"
        },
        {
            "Title": "Ganesha Ecosphere Reports Challenging Q1 FY26 Results Due to Raw Material Price Spike",
            "Summary": "Ganesha Ecosphere Limited faced a difficult quarter with raw material costs rising to 70% of revenue from 64% in the previous quarter. The company's production capacity utilization dropped to 95% from 99%, while rPET granules business saw a 25% decline in production and sales volume. The legacy RPSF and yarn business recorded its lowest performance in several quarters due to PET bottle scrap prices reaching INR 55-56/kg and inability to fully pass on cost increases to customers. Despite challenges, exports increased to 12% of revenue from 9% in the previous year. The company maintains its FY26 revenue guidance of INR 1,500 crores and expects to surpass FY25 financial numbers. Management attributed the poor performance to temporary market conditions and has realigned business strategy accordingly. The company plans brownfield expansion of 22,500 tons at Warangal and targets 90,000 tons total capacity addition by FY27.",
            "Sentiment": "negative",
            "PublishDate": 1755871533755,
            "Source": "earnings"
        },
        {
            "Title": "Ganesha Ecosphere Shares Audio Recording Link for Quarterly Earnings Conference Call",
            "Summary": "Ganesha Ecosphere Limited provided the audio recording link for their earnings conference call held on August 14, 2025. The call discussed the company's unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company shared the recording link with stock exchanges NSE and BSE for information and records.",
            "Sentiment": "neutral",
            "PublishDate": 1755181023045,
            "Source": "earnings"
        },
        {
            "Title": "Ganesha Ecosphere Reports Decline in Q1 Profitability Despite Flat Revenue",
            "Summary": "Ganesha Ecosphere reported quarterly results showing EBITDA of 363 million rupees compared to 477 million rupees in the same period last year. The EBITDA margin contracted to 10.77% from 14.17% year-over-year. Consolidated net profit fell to 108 million rupees from 225 million rupees in the previous year. Revenue remained flat at 3.4 billion rupees compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1755098089358,
            "Source": "earnings"
        },
        {
            "Title": "GST Officials Inspect Ganesha Ecosphere Facility, Operations Unaffected",
            "Summary": "GST officials conducted an inspection at Ganesha Ecosphere's facility. The company reported that no documents were gathered during the inspection and expects no impact on its operations.",
            "Sentiment": "neutral",
            "PublishDate": 1752851602410,
            "Source": "stock"
        },
        {
            "Title": "Ganesha Ecosphere Converts Warrants to Equity Shares for Promoter Group",
            "Summary": "Ganesha Ecosphere has completed the conversion of warrants into equity shares for a promoter group entity. The total value of the issued equity shares is ₹103.93 Crore.",
            "Sentiment": "positive",
            "PublishDate": 1752759191000,
            "Source": "default"
        },
        {
            "Title": "Ganesha Ecosphere Reports Q4 Financial Results",
            "Summary": "Ganesha Ecosphere announced its Q4 financial results. The company's EBITDA increased to 511 million rupees from 471 million rupees year-over-year. However, the EBITDA margin decreased to 14.84% from 15.40% in the same period. The consolidated net profit rose to 238 million rupees from 216 million rupees year-over-year. Revenue for Q4 grew to 3.44 billion rupees from 3 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748227602000,
            "Source": "result"
        },
        {
            "Title": "Ganesha Ecosphere Invests in Recycling Chain Subsidiary",
            "Summary": "Ganesha Ecosphere has invested 24.5 million rupees in its subsidiary, Ganesha Recycling Chain.",
            "Sentiment": "positive",
            "PublishDate": 1744727192000,
            "Source": "default"
        },
        {
            "Title": "Ganesha Ecosphere Expands Odisha Plant Capacity",
            "Summary": "Ganesha Ecosphere has announced plans to increase the size of its expansion project in Odisha by an additional 45,000 TPA (Tonnes Per Annum). This expansion signifies a substantial growth in the company's production capabilities in the region.",
            "Sentiment": "positive",
            "PublishDate": 1738576509000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ganesha Ecosphere Reports Strong Q3 Financial Performance",
            "Summary": "Ganesha Ecosphere Ltd has reported a significant increase in its consolidated net profit for the third quarter. The company's net profit rose to 297 million rupees, compared to 127 million rupees in the same quarter last year and 271 million rupees in the previous quarter. Revenue also showed growth, reaching 3.97 billion rupees, up from 2.84 billion rupees year-over-year and 3.86 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738542306000,
            "Source": "earnings"
        },
        {
            "Title": "Ganesha Ecosphere Reports Strong Q3 Financial Performance",
            "Summary": "Ganesha Ecosphere Ltd has announced its Q3 consolidated financial results. The company's net profit increased significantly to 297 million rupees, up from 127 million rupees year-over-year and 271 million rupees quarter-over-quarter. Revenue also saw substantial growth, reaching 3.97 billion rupees compared to 2.84 billion rupees year-over-year and 3.86 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738518264000,
            "Source": "earnings"
        },
        {
            "Title": "Ganesha Ecosphere Forms Joint Venture with Race Eco Chain for PET Flake Washing Plants",
            "Summary": "Ganesha Ecosphere has entered into a joint venture agreement with Race Eco Chain. The newly formed JV company will be owned 49% by Ganesha Ecosphere and 51% by Race Eco Chain. The joint venture's primary objective is to establish washing plants for PET flakes, indicating a strategic move in the recycling and eco-friendly materials sector.",
            "Sentiment": "positive",
            "PublishDate": 1738339389000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ganesha Ecosphere Reports Strong Q2 Results and Announces Expansion",
            "Summary": "Ganesha Ecosphere reported a significant increase in Q2 consolidated net profit, rising to 271 million rupees from 28 million rupees year-over-year. Revenue also grew to 3.9 billion rupees from 2.78 billion rupees. The company declared an interim dividend of 1.50 rupees per share. Additionally, a company unit plans to set up a greenfield project with an investment of 4.5-5 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1731456145000,
            "Source": "result"
        }
    ]
}