{
    "Symbol": "GANGESSECU",
    "ISIN": "INE335W01016",
    "News": [
        {
            "Title": "Ganges Securities Q3FY26 Net Profit Drops 4.4% YoY",
            "Summary": "Ganges Securities reported Q3FY26 standalone net profit of ₹101.60 lakhs, down 4.4% YoY from ₹106.27 lakhs. Revenue declined 2.7% to ₹177.35 lakhs while nine-month profit rose 5.2% to ₹467.37 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1770809960311,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ganges Securities Board Meet Set for Feb 11, 2026",
            "Summary": "Ganges Securities Limited has scheduled a board meeting for February 11, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770013035680,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ganges Securities Receives Additional 15 Lakh Equity Shares from Morton Foods Rights Issue",
            "Summary": "Ganges Securities Limited received an allotment of 15,00,000 equity shares from Morton Foods Limited through a rights issue for Rs. 3,45,00,000 on November 1, 2025. The company's total holding in Morton Foods now stands at 70,25,000 equity shares, representing 19.68% of Morton Foods' paid-up equity share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1763468282550,
            "Source": "stock"
        },
        {
            "Title": "Ganges Securities Reports Rs 352.88 Lakh Net Profit and Approves Rs 3.45 Crore Investment in Morton Foods",
            "Summary": "Ganges Securities Limited posted a net profit of Rs 352.88 lakh for the quarter ended September 30, 2025, driven by interest income of Rs 59.71 lakh and dividend income of Rs 450.72 lakh. The company's board approved an investment of up to Rs 3.45 crore in Morton Foods Limited through subscription to equity shares in a rights issue, expanding its portfolio in the FMCG sector.",
            "Sentiment": "positive",
            "PublishDate": 1763139526759,
            "Source": "earnings"
        },
        {
            "Title": "Ganges Securities Limited Approves Unaudited Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Ganges Securities Limited's Board of Directors approved the unaudited financial results for the quarter ended June 30, 2025, during a meeting held on August 13, 2025. The meeting lasted from 3:00 PM to 4:30 PM. The company approved both standalone and consolidated financial results, which were submitted to stock exchanges including NSE and BSE. The results are also available on the company's website. The announcement was signed by Vikash Goyal, Chief Financial Officer of Ganges Securities Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1755086273704,
            "Source": "earnings"
        }
    ]
}