{
    "Symbol": "GARFIBRES",
    "ISIN": "INE276A01018",
    "News": [
        {
            "Title": "Garware Technical Fibres Fined ₹1.94 Lakh by Exchanges",
            "Summary": "Garware Technical Fibres receives identical fines of ₹1.94 lakh each from NSE and BSE for non-compliance with board composition requirements during Q2 FY26.",
            "Sentiment": "negative",
            "PublishDate": 1770810337179,
            "Source": "stocks"
        },
        {
            "Title": "Garware Technical Fibres Q3FY26 Results",
            "Summary": "Garware Technical Fibres reports Q3FY26 standalone net profit of ₹5,396.09 lakhs vs ₹4,239.20 lakhs YoY. Revenue from operations at ₹33,980.95 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770809485571,
            "Source": "co_actions_results"
        },
        {
            "Title": "Garware Technical Fibres receives BSE caution letter",
            "Summary": "BSE Limited issued a caution letter to Garware Technical Fibres for erroneous XBRL filing details in its Annual Secretarial Compliance Report for FY 2023-24, with no financial impact reported.",
            "Sentiment": "negative",
            "PublishDate": 1767180141734,
            "Source": "stocks"
        },
        {
            "Title": "Garware Technical Fibres Postal Ballot Results",
            "Summary": "Garware Technical Fibres shareholders approve appointment of Ms. Kirti Dharmesh Mangwani as Non-Executive Independent Director through postal ballot with 6.90 crore votes in favor.",
            "Sentiment": "positive",
            "PublishDate": 1766049173797,
            "Source": "stocks"
        },
        {
            "Title": "Garware Technical Fibres Fined Rs 1.65 Lakh Each by BSE and NSE for Board Composition Non-Compliance",
            "Summary": "Garware Technical Fibres received fines of Rs 1.65 lakh plus GST each from BSE and NSE for non-compliance with board composition requirements, including lack of minimum six directors and absence of a woman independent director for the quarter ended September 30, 2025. The non-compliance occurred due to delays in appointing Ms. Kirti Dharmesh Mangwani as Non-Executive Independent Director pending regulatory approval from DGCA, which was received and she was appointed effective November 25, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1764404381597,
            "Source": "corporate_governance"
        },
        {
            "Title": "Garware Technical Fibres Appoints Kirti Mangwani as Independent Director",
            "Summary": "Garware Technical Fibres appointed Ms. Kirti Dharmesh Mangwani as Additional Non-Executive Independent Director for a five-year term starting November 25, 2025, subject to member approval. The appointment brings three decades of experience in graphic design, visual arts, and material innovation to the company's board governance.",
            "Sentiment": "positive",
            "PublishDate": 1764074209417,
            "Source": "corporate_governance"
        },
        {
            "Title": "White Oak Capital Reduces Stake in Garware Technical Fibres to 2.14%",
            "Summary": "White Oak Capital Management Consultants LLP disposed of shares in Garware Technical Fibres Limited on November 11, 2025, reducing their holding to 21,23,647 shares representing 2.14% of the company's paid-up share capital. The disclosure was made under SEBI regulations for substantial acquisition of shares and takeovers, with the transaction conducted through open market sales.",
            "Sentiment": "neutral",
            "PublishDate": 1763112099683,
            "Source": "stock"
        },
        {
            "Title": "Garware Technical Fibres Declares Rs. 8 Per Share Interim Dividend for FY 2025-26",
            "Summary": "Garware Technical Fibres Limited's Board of Directors declared an interim dividend of Rs. 8 per equity share (80%) on 9,92,65,845 equity shares of Rs. 10 each for the financial year 2025-26. The dividend will be paid to eligible shareholders holding shares in demat or physical form as on the record date of November 14, 2025. The company has communicated to shareholders regarding tax deduction at source (TDS) on dividend payments, with TDS rates varying based on shareholder category and residential status. For resident shareholders with registered PAN, TDS will be deducted at 10%, while those without PAN or with invalid PAN will face 20% TDS. Non-resident shareholders will be subject to 20% TDS plus applicable surcharge and cess, though lower treaty rates may apply with proper documentation. Shareholders must submit required documents to the Registrar and Transfer Agent portal by November 18, 2025, to claim applicable tax benefits.",
            "Sentiment": "positive",
            "PublishDate": 1762801877345,
            "Source": "corporate_action"
        },
        {
            "Title": "Garware Technical Fibres Reports 52% Drop in Q2 Net Profit, Declares Rs. 8 Interim Dividend",
            "Summary": "Garware Technical Fibres reported consolidated net profit of Rs. 319 million in Q2, down from Rs. 659 million in the same period last year. Revenue declined to Rs. 3.5 billion from Rs. 4.2 billion year-on-year. EBITDA fell to Rs. 484 million compared to Rs. 884 million previously, with EBITDA margin contracting to 13.92% from 21.02%. The company announced an interim dividend of Rs. 8 per equity share.",
            "Sentiment": "negative",
            "PublishDate": 1762516998664,
            "Source": "corporate_action"
        },
        {
            "Title": "Garware Technical Fibres Reports Higher Q1 Revenue and Net Profit",
            "Summary": "Garware Technical Fibres reported Q1 consolidated net profit of 530.9 million rupees compared to 467.6 million rupees in the same period last year. Revenue increased to 3.67 billion rupees from 3.36 billion rupees year-over-year. EBITDA rose to 681 million rupees from 644 million rupees, though EBITDA margin declined to 18.55% from 19.15% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754648087406,
            "Source": "earnings"
        },
        {
            "Title": "Garware Technical Fibres Sets Book Closure Dates for AGM and Rs 1.5 Per Share Dividend",
            "Summary": "Garware Technical Fibres Ltd has announced book closure dates from August 27, 2025 to September 2, 2025 for its 48th Annual General Meeting scheduled on September 2, 2025. The Board of Directors has recommended a dividend of Rs 1.5 per share (15%) on 9,92,65,845 equity shares of Rs 10 each for financial year 2024-25, subject to shareholder approval at the AGM. The dividend, if approved, will be paid on or after September 2, 2025. For physical shares, eligibility is based on names in the Register of Members as of September 2, 2025, while for dematerialized shares, it's based on beneficial ownership records as of August 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753871728427,
            "Source": "corporate_action"
        },
        {
            "Title": "Garware Technical Fibres Completes Acquisition of Two Norwegian Companies",
            "Summary": "Garware Technical Fibres has announced the completion of its purchase of two Norwegian firms. The specific details of the acquisition, including the names of the Norwegian companies and the terms of the deal, were not provided in the given information.",
            "Sentiment": "positive",
            "PublishDate": 1751897836000,
            "Source": "default"
        },
        {
            "Title": "Garware Technical Fibres Transfers Norway Branch Operations to Local Subsidiary",
            "Summary": "Garware Technical Fibres has transferred its Norway branch operations to a local subsidiary. This move is described as a strategic adjustment for the company's operations in Norway.",
            "Sentiment": "neutral",
            "PublishDate": 1750870786000,
            "Source": "default"
        },
        {
            "Title": "Garware Technical Fibres: Strategic Acquisition of Norwegian Cordage Firm OTS",
            "Summary": "Garware Technical Fibres Ltd is acquiring Norway-based Offshore & Trawl Supply AS through its UK subsidiary. The acquisition aims to strengthen Garware's presence in offshore, aquaculture, and marine sectors across Europe. The deal will be funded through internal accruals and is expected to be EPS accretive.",
            "Sentiment": "positive",
            "PublishDate": 1750687341000,
            "Source": "corporate_action"
        },
        {
            "Title": "Garware Technical Fibres Acquires Norwegian Rope Companies",
            "Summary": "Garware Technical Fibres has approved the purchase of 100% equity in two companies, OTS and AMS, which operate in the synthetic fiber rope industry. The acquisition cost is set at NOK 122 million.",
            "Sentiment": "positive",
            "PublishDate": 1750683695000,
            "Source": "default"
        },
        {
            "Title": "Garware Technical Fibres Establishes New Subsidiary in Norway",
            "Summary": "Garware Technical Fibres has formed a new fully owned subsidiary in Norway. The company is expanding its international presence with this move.",
            "Sentiment": "positive",
            "PublishDate": 1750242230000,
            "Source": "default"
        },
        {
            "Title": "Garware Technical Fibres Reports Q4 Results and Dividend",
            "Summary": "Garware Technical Fibres has announced its Q4 financial results. The company's revenue increased to 4.33 billion rupees from 3.82 billion rupees year-over-year. Q4 EBITDA rose to 982.6 million rupees from 913.5 million rupees, while the EBITDA margin decreased to 22.72% from 23.9%. Consolidated net profit for Q4 slightly increased to 710.6 million rupees from 700.8 million rupees year-over-year, and from 477.7 million rupees quarter-on-quarter. The company has also recommended a dividend of 1.50 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747325658000,
            "Source": "result"
        },
        {
            "Title": "Garware Technical Fibres to Consider Q4 Results on May 15",
            "Summary": "Garware Technical Fibres has announced that it will consider its fourth quarter (Q4) financial results on May 15. This announcement indicates the company's scheduled date for reviewing and potentially approving its quarterly financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1746707275000,
            "Source": "default"
        },
        {
            "Title": "Garware Technical Fibres Reports Strong Q3 FY25 Performance",
            "Summary": "Garware Technical Fibres has reported a strong performance in the third quarter of fiscal year 2025. The company's CMD (Chairman and Managing Director) announced a 21% revenue growth, primarily driven by robust performance in the Geosynthetics and Aquaculture segments.",
            "Sentiment": "positive",
            "PublishDate": 1739181181000,
            "Source": "earnings"
        },
        {
            "Title": "Garware Technical Fibres Reports Q3 EBITDA Growth",
            "Summary": "Garware Technical Fibres has reported its Q3 financial results. The company's EBITDA increased to 646 million rupees, up from 535 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 18.43% from 18.48% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739179428000,
            "Source": "earnings"
        },
        {
            "Title": "Garware Technical Fibres Reports Q3 Revenue Growth",
            "Summary": "Garware Technical Fibres has announced its third-quarter revenue results. The company reported revenue of 3.5 billion rupees, compared to 2.89 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739179405000,
            "Source": "earnings"
        },
        {
            "Title": "Garware Technical Fibres Reports Q3 Profit Increase",
            "Summary": "Garware Technical Fibres has announced its consolidated net profit for the third quarter, which stands at 478 million rupees. This represents an increase from the 433 million rupees reported in the same period last year, indicating a year-over-year growth in the company's profitability.",
            "Sentiment": "positive",
            "PublishDate": 1739179359000,
            "Source": "earnings"
        },
        {
            "Title": "Garware Technical Fibres: Shares Slide 5% on Ex-Bonus Trading Day",
            "Summary": "Garware Technical Fibres shares dropped 4.75% to Rs 885 on BSE as the stock began trading ex-bonus. The company has set January 3, 2025, as the record date for its 4:1 bonus issue, marking its first-ever bonus share issuance.",
            "Sentiment": "neutral",
            "PublishDate": 1735883544000,
            "Source": "corporate_action"
        },
        {
            "Title": "Garware Technical Fibres: Bonus Shares Record Date Approaches",
            "Summary": "Garware Technical Fibres has set January 3, 2025, as the record date for its 4:1 bonus share issuance. Today is the last day to buy shares to be eligible for the bonus issue. This is the company's first-ever bonus share issuance.",
            "Sentiment": "positive",
            "PublishDate": 1735783471000,
            "Source": "corporate_action"
        },
        {
            "Title": "Garware Technical Fibres: Exploring $20 Million European Acquisition",
            "Summary": "Garware Technical Fibres is seeking a $20 million acquisition in Europe, aiming to be closer to customers and address supply chain challenges. The company is focused on 20% profit growth, with recent success in global aquaculture and geosynthetic businesses. Q2 profit after tax increased by 26% to Rs 66 crore.",
            "Sentiment": "positive",
            "PublishDate": 1732327580000,
            "Source": "corporate_action"
        },
        {
            "Title": "Garware Technical Fibres Announces 4:1 Bonus Share Issue",
            "Summary": "Garware Technical Fibres has approved the issuance of 4 bonus shares for every 1 existing share held by shareholders. This corporate action will increase the number of shares in circulation without affecting the company's market capitalization.",
            "Sentiment": "positive",
            "PublishDate": 1731595385000,
            "Source": "corporate_action"
        },
        {
            "Title": "Garware Technical Fibres Reports Q2 EBITDA Growth",
            "Summary": "Garware Technical Fibres announced its Q2 financial results, showing an EBITDA of 884 million rupees, up from 686 million rupees in the same quarter last year. The company's EBITDA margin also improved slightly to 21.02% from 20.88% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731584966000,
            "Source": "result"
        },
        {
            "Title": "Garware Technical Fibres Reports Strong Q2 Financial Results",
            "Summary": "Garware Technical Fibres announced its Q2 consolidated net profit of 659 million rupees, showing a significant increase from 524 million rupees year-over-year and 468 million rupees quarter-over-quarter. The company's Q2 revenue also rose to 4.2 billion rupees from 3.3 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731584905000,
            "Source": "result"
        }
    ]
}