{
    "Symbol": "GARUDA",
    "ISIN": "INE0JVO01026",
    "News": [
        {
            "Title": "Garuda Construction Reports Strong Q3 FY26 Results",
            "Summary": "Garuda Construction & Engineering delivered impressive Q3 FY26 performance with revenue of ₹14,005.41 lakhs and net profit of ₹3,297.00 lakhs, marking substantial growth over previous periods.",
            "Sentiment": "positive",
            "PublishDate": 1770869804046,
            "Source": "co_actions_results"
        },
        {
            "Title": "Garuda Construction & Engineering Announces E-Voting Results for Extraordinary General Meeting",
            "Summary": "Garuda Construction and Engineering Limited completed e-voting for three resolutions including raising funds through equity shares, increasing authorized share capital, and approval for related party transactions. All three resolutions were passed with overwhelming majority support, with the fund raising resolution receiving 99.99% approval and the share capital increase getting 100% favorable votes.",
            "Sentiment": "positive",
            "PublishDate": 1764683826526,
            "Source": "corporate_action"
        },
        {
            "Title": "Garuda Construction Appoints Shanti Lal Gaggar as Chief Operating Officer",
            "Summary": "Garuda Construction and Engineering Limited appointed Mr. Shanti Lal Gaggar as Chief Operating Officer and Key Managerial Personnel with effect from November 20, 2025. The company reported a current order book of 4,876.78 crores and achieved revenue of 241.61 crores with net profit of 55.15 crores in the first half while expanding operations to support fast-track business growth.",
            "Sentiment": "positive",
            "PublishDate": 1763635219227,
            "Source": "corporate_governance"
        },
        {
            "Title": "Garuda Construction and Engineering Approves ₹500 Crore QIP Fundraising Plan",
            "Summary": "Garuda Construction and Engineering Limited's board approved raising up to ₹500 crores through a Qualified Institutional Placement (QIP) of equity shares with a face value of ₹5 each. The board also approved increasing the company's authorized share capital from ₹50 crores to ₹80 crores by creating an additional 6 crore equity shares. A QIP committee was constituted to handle matters related to the proposed fundraising. The company will issue a notice for an Extraordinary General Meeting to seek shareholder approval for the fundraising and amendments to the Memorandum of Association. The board meeting was held on November 7, 2025, and concluded the same day.",
            "Sentiment": "positive",
            "PublishDate": 1762510564862,
            "Source": "corporate_action"
        },
        {
            "Title": "Garuda Construction Wins ₹1,416 Crore EPC Contract for Mumbai Luxury Project",
            "Summary": "Garuda Construction has secured a ₹1,416 crore EPC (Engineering, Procurement, and Construction) work order from Sumer Corporation for the 'Powai Heights' luxury residential project located in Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1762351403264,
            "Source": "order&deals"
        },
        {
            "Title": "Garuda Construction and Engineering Limited Schedules Board Meeting to Consider Share Capital Increase and Fund Raising",
            "Summary": "Garuda Construction and Engineering Limited has scheduled a Board of Directors meeting for November 7, 2025. The board will consider increasing the company's authorized share capital and making consequential amendments to the capital clause of the Memorandum of Association. The meeting will also discuss raising funds through various methods including equity shares, convertible securities, public issues, rights issues, ADRs/GDRs/FCCBs, debt issues, preferential allotment, private placement, qualified institutional placement (QIP), or other permissible modes. Additionally, the board will consider calling an Extraordinary General Meeting to seek equity shareholder approval for the proposed increase in authorized share capital and fund raising initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1762177693273,
            "Source": "corporate_action"
        },
        {
            "Title": "Garuda Construction Reports Strong H1 FY26 Performance with Revenue Matching Full FY25",
            "Summary": "Garuda Construction and Engineering Limited reported revenue of Rs 241.6 crores for H1 FY26, matching its entire FY25 revenue. The company achieved PAT of Rs 55.1 crores with margins of 22.8% for the half-year period. The construction company maintains a strong order book of Rs 3,461 crores as of October 27, 2025, providing visibility for the next three years. During the quarter, the company secured fresh orders worth Rs 353 crores despite challenging monsoon conditions that impacted on-ground progress. The company operates across multiple states including Maharashtra, Delhi, Rajasthan, Punjab, Karnataka, Tamil Nadu, and Arunachal Pradesh, with 16 ongoing projects spanning residential, commercial, industrial and infrastructure segments. Garuda Construction remains debt-free and focuses on high-margin, niche projects while avoiding contracts that could dilute margins.",
            "Sentiment": "positive",
            "PublishDate": 1761660435138,
            "Source": "earnings"
        },
        {
            "Title": "Garuda Construction Reports Strong Q2 Performance with 157% Jump in Net Profit",
            "Summary": "Garuda Construction and Engineering reported quarterly results showing significant growth across key metrics. Net profit increased to 271 million rupees from 102 million rupees year-over-year. EBITDA rose substantially to 344 million rupees compared to 134 million rupees in the same period last year. The company's EBITDA margin improved to 29.55% from 28.70% year-over-year, indicating enhanced operational efficiency alongside revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1761539471793,
            "Source": "earnings"
        },
        {
            "Title": "Garuda Construction Secures Rs. 231 Crore Mumbai Rehabilitation Project, Total Order Book Reaches Rs. 3,461 Crores",
            "Summary": "Garuda Construction and Engineering Limited received a work order valued at Rs. 231 crores for constructing a rehabilitation building in Chandivali, Mumbai. The project involves building approximately 6.17 lakh square feet with a 3-year completion timeline. With this new contract, the company's total order book has increased to Rs. 3,460.78 crores.",
            "Sentiment": "positive",
            "PublishDate": 1761196249752,
            "Source": "order&deals"
        },
        {
            "Title": "Garuda Construction Wins ₹144 Crore Mumbai Redevelopment Contract",
            "Summary": "Garuda Construction and Engineering received work orders worth ₹143.96 crore from Orbit Ventures Developers for civil works on the 'Shikhar-B' redevelopment project in Oshiwara, Mumbai. The EPC agreement has a 36-month contract period with payments based on allotment of earmarked flats. This order brings the company's total order book to ₹3,229.78 crore. The contract involves no related party transactions and will be executed entirely within India. Garuda Construction provides end-to-end civil construction services for residential, commercial, infrastructure and industrial projects, along with operations and maintenance services. Company shares closed at ₹188.46, down 0.43%.",
            "Sentiment": "positive",
            "PublishDate": 1759944622805,
            "Source": "order&deals"
        },
        {
            "Title": "Garuda Construction Secures ₹1.44 Billion Order",
            "Summary": "Garuda Construction has secured a new order worth ₹1.44 billion. The company announced this contract win, which represents a significant business development for the construction firm.",
            "Sentiment": "positive",
            "PublishDate": 1759932818767,
            "Source": "order&deals"
        },
        {
            "Title": "Garuda Construction Fully Utilizes INR 159.67 Crores from IPO Proceeds",
            "Summary": "Garuda Construction and Engineering Limited has fully utilized INR 159.67 crores raised from its Initial Public Offer for the quarter ended June 30, 2025. The company allocated INR 100 crores for working capital requirements and INR 59.67 crores for general corporate purposes including unidentified inorganic acquisitions. The IPO was conducted from October 8-10, 2024, with a total issue size of INR 264.10 crores comprising fresh issue of INR 173.85 crores and offer for sale of INR 90.25 crores at INR 95 per share. Monitoring agency Acuite Ratings & Research Limited reported no deviations from the stated objects and confirmed all utilizations were as per disclosures in the offer document.",
            "Sentiment": "neutral",
            "PublishDate": 1755097522326,
            "Source": "stock"
        },
        {
            "Title": "Garuda Construction Reports Significant Growth in Q1 Financial Results",
            "Summary": "Garuda Construction has announced its Q1 financial results, showing substantial year-over-year growth. The company's revenue increased to 1.25 billion rupees from 351.2 million rupees in the same quarter last year. EBITDA rose to 364 million rupees from 117 million rupees. The consolidated net profit for Q1 reached 280 million rupees, up from 86 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1752812737000,
            "Source": "default"
        },
        {
            "Title": "Garuda Construction Reports Q3 Financial Results",
            "Summary": "Garuda Construction has announced its financial results for the third quarter. The company reported a net profit of 129 million rupees, compared to 138 million rupees in the same quarter last year and 102 million rupees in the previous quarter. Revenue for Q3 stood at 622 million rupees, up from 575 million rupees in the corresponding period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739146345000,
            "Source": "earnings"
        },
        {
            "Title": "Garuda Construction Reports Q3 EBITDA Decline",
            "Summary": "Garuda Construction's Q3 EBITDA decreased to 172 million rupees from 186 million rupees year-over-year. The company's EBITDA margin also dropped to 27.69% from 32.29% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738940164000,
            "Source": "earnings"
        },
        {
            "Title": "Garuda Construction Reports Q3 Financial Results",
            "Summary": "Garuda Construction has announced its financial results for the third quarter. The company reported a net profit of 129 million rupees, compared to 138 million rupees year-over-year and 102 million rupees quarter-over-quarter. Revenue for Q3 stood at 622 million rupees, up from 575 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738940088000,
            "Source": "earnings"
        },
        {
            "Title": "Garuda Construction & Engineering to Consider Q3 Results",
            "Summary": "Garuda Construction & Engineering has announced that it will consider its third quarter (Q3) financial results on February 7. This indicates the company is preparing to release its latest earnings report, which will provide insight into its financial performance for the most recent quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738675181000,
            "Source": "earnings"
        },
        {
            "Title": "Garuda Construction: Shares Surge on Record Rs 1,087-Crore Contract",
            "Summary": "Garuda Construction and Engineering Ltd. secured its largest-ever contract worth Rs 1,087.34 crore from Gorakhpur Development Authority. The project involves building an International Convention Centre in Gorakhpur. The company's order book has now doubled to Rs 2,830 crore since its IPO in October 2024. Shares rose over 10% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1737005897000,
            "Source": "order&deals"
        },
        {
            "Title": "Garuda's Order Book Doubles to ₹2,830 Crore Since IPO",
            "Summary": "Garuda, an Indian company, has reported a significant increase in its order book value. The company's order book has doubled to ₹2,830 crore, up from ₹1,408.27 crore at the time of its Initial Public Offering (IPO) in October 2024. This substantial growth in orders indicates a positive business outlook for the company.",
            "Sentiment": "positive",
            "PublishDate": 1737000659000,
            "Source": "corporate_action"
        },
        {
            "Title": "Garuda Construction and Engineering Secures 11 Billion Rupee Order",
            "Summary": "Garuda Construction and Engineering has announced winning a significant order valued at 11 billion rupees. This substantial contract represents a major business development for the company, potentially boosting its project portfolio and financial outlook.",
            "Sentiment": "positive",
            "PublishDate": 1737000440000,
            "Source": "order&deals"
        },
        {
            "Title": "Investor Utpal H Sheth Acquires 4.8 Lakh Shares of Garuda Construction",
            "Summary": "Utpal H Sheth, a prominent investor, has purchased 480,000 shares of Garuda Construction through open market transactions. This significant acquisition suggests increased investor interest in the company.",
            "Sentiment": "positive",
            "PublishDate": 1735518035000,
            "Source": "block_deals"
        },
        {
            "Title": "Investor Utpal H Sheth Acquires 4.8 Lakh Shares of Garuda Construction",
            "Summary": "Investor Utpal H Sheth has purchased 4.8 lakh shares of Garuda Construction through the open market. This acquisition represents a significant investment in the company and may indicate confidence in its future prospects.",
            "Sentiment": "positive",
            "PublishDate": 1735383599000,
            "Source": "block_deals"
        },
        {
            "Title": "Garuda Construction and Engineering Reports Q2 EBITDA Growth",
            "Summary": "Garuda Construction and Engineering has reported its Q2 financial results. The company's EBITDA increased to 83 million rupees, up from 70 million rupees in the same quarter last year. However, the EBITDA margin decreased to 17.82% from 33.11% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731602075000,
            "Source": "result"
        },
        {
            "Title": "Garuda Construction and Engineering Reports Strong Q2 Financial Results",
            "Summary": "Garuda Construction and Engineering has announced its Q2 financial results, showing significant year-over-year growth. The company's net profit doubled to 102 million rupees from 51 million rupees in the same quarter last year. Revenue also saw a substantial increase, rising to 468 million rupees from 211 million rupees in the previous year's Q2.",
            "Sentiment": "positive",
            "PublishDate": 1731602021000,
            "Source": "result"
        },
        {
            "Title": "Garuda Construction And Engineer: Share Price Up 1.52% Amid Market Rally",
            "Summary": "Garuda Construction And Engineer's stock is trading at ₹87.54, up 1.52% on November 6, 2024. The stock has ranged between ₹85.8 and ₹88.0 during the day. It's trading above most key moving averages. Nifty and Sensex are also up 0.6% and 0.71% respectively.",
            "Sentiment": "positive",
            "PublishDate": 1730873072000,
            "Source": "normal_news"
        },
        {
            "Title": "Garuda Construction And Engineer: Shares Dip 3.57% Amid Mixed Market",
            "Summary": "Garuda Construction And Engineer shares are trading at ₹85.72, down 3.57% from the previous close. The stock hit a high of ₹89.9 and a low of ₹85.0 during the day. It's trading above 20, 50, 100, 300 days SMA but below 5, 10 day SMA. Nifty and Sensex are also down slightly.",
            "Sentiment": "negative",
            "PublishDate": 1730785894000,
            "Source": "normal_news"
        },
        {
            "Title": "Garuda Construction And Engineer: Shares Dip 2.7% Amid Market Decline",
            "Summary": "Garuda Construction And Engineer shares are trading at ₹88.32, down 2.7% from the previous close. The stock has ranged between ₹92.45 and ₹88.06 today. The broader market is also down, with Nifty falling 1.57% and Sensex dropping 1.59%.",
            "Sentiment": "negative",
            "PublishDate": 1730698595000,
            "Source": "normal_news"
        },
        {
            "Title": "Garuda Construction And Engineer: Share Price Dips 1% Amid Market Decline",
            "Summary": "Garuda Construction And Engineer's share price decreased by 1% to ₹90.24 on October 31, 2024. The stock fluctuated between ₹92.97 and ₹90.23 during the day. Nifty and Sensex also declined by 0.36% and 0.46% respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1730354424000,
            "Source": "normal_news"
        },
        {
            "Title": "Garuda Construction And Engineer: Shares Surge 2.9% Amid Market Dip",
            "Summary": "Garuda Construction And Engineer's stock price rose 2.9% to ₹91.6 on October 30, 2024, outperforming the broader market. The stock hit a daily high of ₹91.83 and a low of ₹88.13. It's trading above most key moving averages, indicating potential strength.",
            "Sentiment": "positive",
            "PublishDate": 1730266202000,
            "Source": "normal_news"
        },
        {
            "Title": "Garuda Construction And Engineer: Share Price Dips 1.91% Amid Market Rally",
            "Summary": "Garuda Construction And Engineer shares are trading at ₹87.5, down 1.91% from the previous close. The stock hit a high of ₹90.26 and a low of ₹85.21. Meanwhile, Sensex is up 1.04% at ₹80,227.97, and Nifty is up 0.99%.",
            "Sentiment": "negative",
            "PublishDate": 1730093412000,
            "Source": "normal_news"
        },
        {
            "Title": "Garuda Construction And Engineer: Shares Plummet 6.43% Amid Market Decline",
            "Summary": "Garuda Construction And Engineer shares are trading at ₹95.17, down 6.43% from the previous close. The stock hit a high of ₹102.1 and a low of ₹93.3 during the day. Sensex is down 0.3% at ₹80,907.74, while Nifty is down 0.21%.",
            "Sentiment": "negative",
            "PublishDate": 1729576559000,
            "Source": "normal_news"
        },
        {
            "Title": "Garuda Construction: Solid Stock Market Debut with 9.5% Premium",
            "Summary": "<p><span class='positive'>Garuda Construction and Engineering Limited</span> listed at <span class='positive'>Rs 105</span> on NSE, <span class='positive'>9.5% above</span> its IPO price of Rs 95. The <span class='neutral'>Rs 264.10 crore IPO</span> was <span class='positive'>oversubscribed 7.55 times</span>. The company aims to use funds for <b>working capital</b>, <b>corporate expenses</b>, and <b>potential acquisitions</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728969286000,
            "Source": "normal_news"
        }
    ]
}