{
    "Symbol": "GATECH",
    "ISIN": "INE224E01028",
    "News": [
        {
            "Title": "GACM Technologies Board Meet on Feb 11 for Q3FY26 Results",
            "Summary": "GACM Technologies Limited has scheduled a board meeting on February 11, 2026, to approve Q3FY26 unaudited financial results and consider major corporate decisions including fundraising and office relocation.",
            "Sentiment": "neutral",
            "PublishDate": 1770377880910,
            "Source": "co_actions_results"
        },
        {
            "Title": "GACM Technologies Reports Mixed Financial Performance for Q2 and Half-Year Ended September 2025",
            "Summary": "GACM Technologies Limited announced its unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. On a standalone basis, the company reported income from operations of ₹437.98 lakhs for Q2 2025 compared to ₹315.09 lakhs in Q2 2024. For the half-year period, standalone income from operations reached ₹1,024.96 lakhs versus ₹472.00 lakhs in the previous year. The company showed a net profit of ₹220.02 lakhs for Q2 2025, reversing from a loss of ₹37.66 lakhs in Q2 2024. On a consolidated basis, income from operations was ₹512.98 lakhs for Q2 2025 against ₹331.59 lakhs in Q2 2024, with half-year consolidated income at ₹1,182.96 lakhs compared to ₹495.52 lakhs previously. Consolidated net profit for Q2 2025 stood at ₹251.36 lakhs versus ₹41.37 lakhs in Q2 2024. The consolidated results include subsidiary Gayiadi Fintech Private Limited. The company operates in software and consultancy services with no separate reportable segments.",
            "Sentiment": "positive",
            "PublishDate": 1762945164433,
            "Source": "earnings"
        },
        {
            "Title": "GACM Technologies Approves 1.21 Billion Share Issuance for Strategic Acquisitions",
            "Summary": "GACM Technologies Limited's board approved issuing 1,210,077,200 equity shares at Rs. 1 each on preferential basis to non-promoters through share swap arrangements. The company will acquire a 5.34% stake in Market Simplified India Limited at an 80:1 swap ratio and a 21.06% stake in WEXL EDU Private Limited at a 120:1 swap ratio, valued at Rs. 121.01 crores. The board also approved increasing authorized share capital from Rs. 300 crores to Rs. 550 crores, subject to shareholder approval at the upcoming 30th Annual General Meeting. Material related party transactions were approved under Section 188 of Companies Act, 2013. The company noted a valuation report from independent registered valuator Gadiparthi Rambabu and appointed CARE Ratings Limited as monitoring agency for the preferential issue. All approvals are subject to regulatory and statutory clearances.",
            "Sentiment": "positive",
            "PublishDate": 1756194798249,
            "Source": "corporate_action"
        },
        {
            "Title": "GACM Technologies: Acquires 30% Stake in AI Edtech Firm WeXL",
            "Summary": "GACM Technologies is acquiring a 30% equity stake in AI-edtech company WeXL at a valuation of ₹500 crore. WeXL has confirmed orders worth ₹30 crore from Delhi and Tamil Nadu governments, and is in discussions with CBSE for a ₹200 crore deployment across 30,000+ schools. GACM aims to leverage WeXL's dataset and platform to build an advanced AI agent framework.",
            "Sentiment": "positive",
            "PublishDate": 1751027306000,
            "Source": "corporate_action"
        }
    ]
}