{
    "Symbol": "GATEWAY",
    "ISIN": "INE079J01017",
    "News": [
        {
            "Title": "Gateway Distriparks Declares Special Dividend",
            "Summary": "Gateway Distriparks announces special dividend of ₹1.25 per share for shareholders, reflecting company's commitment to returning value to investors through additional distributions.",
            "Sentiment": "positive",
            "PublishDate": 1770369337066,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gateway Distriparks Q3 Profit Rises 16.1% YoY",
            "Summary": "Gateway Distriparks reported profit before exceptional items of ₹748 million in Q3, marking a 16.1% increase from ₹644 million in the same quarter last year, reflecting improved operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1770369269545,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gateway Distriparks Board Meet on Feb 6 for Q3 Results",
            "Summary": "Gateway Distriparks Limited has scheduled its board meeting for February 06, 2026, to consider Q3FY26 unaudited financial results and second interim dividend declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1770036658246,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gateway Distriparks Expands to Central India",
            "Summary": "Gateway Distriparks acquires 25 acres in Indore for new ICD development with ₹150 crore investment, targeting 120,000 TEUs annual capacity in first Central India expansion.",
            "Sentiment": "positive",
            "PublishDate": 1770021468548,
            "Source": "stocks"
        },
        {
            "Title": "Gateway Distriparks sees promoter stake increase",
            "Summary": "Perfect Communications Private Limited acquires 1,042,273 equity shares of Gateway Distriparks through open market purchase, increasing promoter holding from 3.15% to 3.36%.",
            "Sentiment": "positive",
            "PublishDate": 1766576903298,
            "Source": "co_actions_results"
        },
        {
            "Title": "Perfect Communications Increases Stake in Gateway Distriparks to 3.15%",
            "Summary": "Perfect Communications Private Limited acquired 2,464,591 equity shares of Gateway Distriparks Limited through open market purchase, increasing its shareholding from 2.66% to 3.15%. The promoter entity now holds 15,732,340 shares in the logistics company, with the acquisition completed on December 4, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764912969145,
            "Source": "corporate_action"
        },
        {
            "Title": "Mirae Asset Mutual Fund Reduces Stake in Gateway Distriparks Limited",
            "Summary": "Mirae Asset Mutual Fund sold 181,000 shares of Gateway Distriparks Limited through open market transactions on November 24, 2025. The disposal reduced their shareholding from 5.892% to 5.856% in the logistics company listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1764071805133,
            "Source": "corporate_action"
        },
        {
            "Title": "Gateway Distriparks Seeks Shareholder Approval for New Independent Director Appointment",
            "Summary": "Gateway Distriparks has issued a postal ballot notice seeking member approval for the appointment of Mr. Raghav Chandra as Non-Executive Independent Director for a 5-year term from November 04, 2025 to November 03, 2030. The e-voting period runs from November 15, 2025 to December 14, 2025, with Mr. Chandra replacing Mr. Arun Gupta whose second term ended on November 04, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763061494235,
            "Source": "corporate_action"
        },
        {
            "Title": "Gateway Distriparks Reports Q2 FY26 Results with 45% Revenue Growth",
            "Summary": "Gateway Distriparks Limited reported consolidated total income of Rs. 570.4 crores for Q2 FY26, representing a 45% increase from Rs. 394.6 crores in the previous quarter. EBITDA stood at Rs. 123.4 crores with a margin of 21.64%. Profit after tax reached Rs. 66.3 crores, up 10% quarter-on-quarter, with PAT margin at 11.62%. For H1 FY26, total income was Rs. 1,124.5 crores, up 49% from Rs. 752.2 crores in H1 FY25. The company operates a network of 11 container terminals across India, including 6 rail-linked inland container depots and 5 container freight stations. Gateway has entered a 15-year exclusive agreement with Sawariya Group to operate container train services at the 120-acre Multi-Modal Logistics Park in New Ankleshwar, Gujarat. The company owns a fleet of 34 train sets and 560 tractor trailers. Snowman Logistics, in which Gateway holds a 50.01% stake, transitioned from an associate company to a subsidiary in December 2024.",
            "Sentiment": "positive",
            "PublishDate": 1762250947332,
            "Source": "earnings"
        },
        {
            "Title": "Gateway Distriparks Appoints New Independent Director, Reports Quarterly Results",
            "Summary": "Gateway Distriparks Limited's Board approved unaudited financial results for the quarter ended September 30, 2025. The company appointed Raghav Chandra as Non-Executive Independent Director for a five-year term starting November 4, 2025, subject to shareholder approval through postal ballot. Simultaneously, Arun Kumar Gupta ceased to be an Independent Director upon completion of his second consecutive five-year term. Raghav Chandra is a former Indian Administrative Service officer who previously served as Chairman of National Highways Authority of India and held various senior government positions. The Board meeting was held on November 4, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762249344681,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gateway Distriparks Reports 12% Growth in Q2 Net Profit to 670 Million Rupees",
            "Summary": "Gateway Distriparks reported quarterly net profit of 670 million rupees compared to 599 million rupees in the same period last year. Revenue increased significantly to 5.7 billion rupees from 3.9 billion rupees year-over-year. EBITDA rose to 1.2 billion rupees from 965 million rupees, though EBITDA margin declined to 21.21% from 24.75% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762246935785,
            "Source": "earnings"
        },
        {
            "Title": "Gateway Distriparks Launches Double Stack Train Service Between Ankleshwar and Garhi",
            "Summary": "Gateway Distriparks has launched its first double stack train service connecting MMLP Ankleshwar to ICD Garhi. This represents a new logistics service offering from the company.",
            "Sentiment": "positive",
            "PublishDate": 1760507224165,
            "Source": "stock"
        },
        {
            "Title": "Gateway Distriparks targets 4x growth in domestic cargo volumes through Ankleshwar logistics park deal",
            "Summary": "Gateway Distriparks Ltd signed a 15-year agreement with Sawariya Group of Industries for a Multi Modal Logistics Park in Ankleshwar, Gujarat. The company expects domestic container movement to grow from 1,000-1,500 TEUs per month initially to 4,000 TEUs monthly within two years. Domestic operations will begin immediately, while EXIM and ICD services are scheduled to start by April 2026. The region currently has only one other ICD operating at full capacity, creating opportunities to shift cargo from road to rail transport to JNPT. EXIM volumes could reach 5,000 TEUs per month initially and potentially scale to 10,000 TEUs over time. The venture operates as an asset-light model with zero investment from Gateway Distriparks, using leased trains and containers on an EBITDA-sharing basis. The company expects EBITDA of around ₹3,000 per TEU, though margins will be impacted by shorter lead distances compared to northern operations.",
            "Sentiment": "positive",
            "PublishDate": 1755081684764,
            "Source": "stock"
        },
        {
            "Title": "Gateway Distriparks Signs 15-Year Exclusive Container Train Operations Deal for Ankleshwar Logistics Park",
            "Summary": "Gateway Distriparks Limited has entered into a 15-year agreement to become the exclusive container train operator for the 120-acre Multi Modal Logistics Park at Ankleshwar, Gujarat, developed by Sawariya Group of Industries. The facility is strategically located near Surat and planned to have an annual capacity of 200,000 TEUs and 850,000 sq. ft. of warehousing space. The MMLP is equipped to handle domestic containers, EXIM containers, and bulk cargo, with capability to handle double stack trains and direct connection to the Western Dedicated Freight Corridor. Domestic operations have commenced immediately, with GDL holding exclusivity for regions where it operates its own Inland Container Depots, including Gurgaon, Faridabad, Ludhiana, Uttarakhand and Ahmedabad markets. The ICD portion for EXIM volumes is under construction and expected to start operations at the beginning of the next financial year. Under this asset-light model, GDL will provide rail services while Sawariya will handle terminal operations, allowing the company to scale without capital investment in the terminal infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1754643752733,
            "Source": "order&deals"
        },
        {
            "Title": "Gateway Distriparks Secures Container Train Operations Deal at MMLP Ankleshwar",
            "Summary": "Gateway Distriparks has entered into a deal for container train operations at MMLP, Ankleshwar. The company describes this arrangement as a unique deal in the logistics sector.",
            "Sentiment": "positive",
            "PublishDate": 1754642928580,
            "Source": "stock"
        },
        {
            "Title": "Gateway Distriparks Reports Strong Q1 FY26 Performance Despite Lower Rail Margins",
            "Summary": "Gateway Distriparks Limited reported strong year-on-year improvement in quarterly results, attributed to the absence of Red Sea disruption that impacted the previous year's first quarter. The company's rail business achieved EBITDA of INR9,100 per TEU, slightly down due to higher empty container running, lower double stacking at 39%, and increased trade imbalance from lack of exports. The CFS business showed improvement with EBITDA of INR1,500 per TEU. The company maintained market share in key regions: 16-17% in NCR, 27% in Ludhiana, and 37% in Uttarakhand. Management expects margins to recover to INR9,500 per TEU in coming quarters with improved double stacking and trade balance. Snowman Logistics added capacity in Calcutta, Krishnapatnam and Kundli, with trading and distribution segment showing 54% quarter-on-quarter growth. The company targets double-digit volume growth for the full year and has earmarked INR300 crores for two new terminals. Land acquisition challenges continue to delay expansion plans including the Jaipur ICD project.",
            "Sentiment": "neutral",
            "PublishDate": 1754374810575,
            "Source": "earnings"
        },
        {
            "Title": "Gateway Distriparks Reports Strong Q1 Results, Declares Rs 1.25 Interim Dividend",
            "Summary": "Gateway Distriparks Limited announced its quarterly results for the quarter ended June 30, 2025, showing consolidated revenue from operations of Rs 55,043 lakhs compared to Rs 35,311 lakhs in the same quarter last year. The company reported consolidated profit of Rs 6,218 lakhs for the quarter versus Rs 4,907 lakhs in the previous year. On a standalone basis, revenue was Rs 37,968 lakhs with profit of Rs 6,359 lakhs. The Board declared a first interim dividend of Rs 1.25 per equity share (12.5%) for financial year 2025-26, with August 2, 2025 as the record date and payment within 30 days. The company operates in inter-modal container logistics and cold-chain logistics segments. Earnings per share on consolidated basis was Rs 1.20 for the quarter. The results include subsidiary Snowman Logistics Limited, which became a subsidiary from December 24, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1753777352547,
            "Source": "corporate_action"
        },
        {
            "Title": "Gateway Distriparks Reports Strong Q1 Growth with 56% Revenue Jump",
            "Summary": "Gateway Distriparks delivered strong quarterly results with revenue rising to 5.5 billion rupees from 3.53 billion rupees year-over-year. Net profit increased to 603 million rupees compared to 486.7 million rupees in the same period last year. EBITDA grew to 1.19 billion rupees from 856 million rupees year-over-year, though EBITDA margin declined to 21.68% from 24.24%. The company's board declared a dividend of 1.25 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1753775906034,
            "Source": "earnings"
        },
        {
            "Title": "Gateway Distriparks Schedules Conference Call to Discuss Q1 Financial Results",
            "Summary": "Gateway Distriparks Limited will hold a conference call on July 29, 2025, at 4:00 PM IST to discuss financial results for the quarter ended June 30, 2025. The call will feature participation from senior management and will also include Snowman Logistics Limited. The company has provided registration details and access numbers for participants, including toll-free numbers for international participants from the USA, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1753190643565,
            "Source": "earnings"
        },
        {
            "Title": "Gateway Distriparks Schedules Board Meeting for Q1 FY2025-26 Results and Interim Dividend Declaration",
            "Summary": "Gateway Distriparks Limited has scheduled a Board of Directors meeting for July 29, 2025, to consider and approve unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The board will also consider declaring the first interim dividend for financial year 2025-26, with the record date for dividend entitlement set for August 2, 2025. The company's trading window for designated persons, connected persons, and their immediate relatives will remain closed until July 31, 2025, which is 48 hours after the declaration of the quarterly financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1753188996337,
            "Source": "corporate_action"
        },
        {
            "Title": "Gateway Distriparks: Q4 Revenue and EBITDA Surge, Stock Jumps 8%",
            "Summary": "Gateway Distriparks Ltd. reported a 42.7% increase in Q4 revenue to Rs 535 crore and a 29.4% rise in EBITDA to Rs 108 crore. However, the company incurred net losses of Rs 193 crore, including an exceptional loss of Rs 259 crore. The stock price surged 8% on high trading volume.",
            "Sentiment": "positive",
            "PublishDate": 1748410660000,
            "Source": "earnings"
        },
        {
            "Title": "Gateway Distriparks Reports Q4 Net Loss of 1.93b Rupees",
            "Summary": "Gateway Distriparks reported a consolidated net loss of 1.93 billion rupees in the latest quarter, compared to a profit of 565 million rupees in the same quarter last year. However, it showed a profit of 4.56 billion rupees compared to the previous quarter. The company's revenue increased to 5.35 billion rupees from 3.75 billion rupees year-over-year. An exceptional item of loss amounting to 2.59 billion rupees was reported. The profit before tax (PBT) for the quarter was 728.3 million rupees, up from 565.6 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1748390453000,
            "Source": "default"
        },
        {
            "Title": "Gateway Distriparks Reports Mixed Q4 Results",
            "Summary": "Gateway Distriparks announced its quarterly results. Revenue increased to 5.35 billion rupees from 3.75 billion rupees year-over-year. EBITDA rose to 1.08 billion rupees from 832 million rupees, but EBITDA margin decreased to 20.13% from 22.19%. The company reported an exceptional loss of 2.59 billion rupees. Profit before tax increased to 728.3 million rupees from 565.6 million rupees. However, the company reported a consolidated net loss of 1.93 billion rupees compared to a profit of 565 million rupees in the same quarter last year and a profit of 4.56 billion rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748345552000,
            "Source": "result"
        },
        {
            "Title": "Gateway Distriparks Reports Significant Profit Increase in Q3",
            "Summary": "Gateway Distriparks announced its Q3 financial results, showing a substantial increase in consolidated net profit to 4.55 billion rupees, compared to 633 million rupees in the same period last year. The company's revenue slightly increased to 4 billion rupees from 3.9 billion rupees year-over-year. An exceptional item of 3.9 billion rupees was reported. The profit before tax (PBT) slightly decreased to 644 million rupees from 663 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738628118000,
            "Source": "earnings"
        },
        {
            "Title": "Gateway Distriparks Ltd: Q3 Profit Soars 606% to ₹455.5 Crore, Declares Dividend",
            "Summary": "Gateway Distriparks reported a 606.2% YoY increase in Q3 net profit to ₹455.5 crore, including ₹390.77 crore exceptional income. Revenue rose 2.4% to ₹402.5 crore. The company declared a second interim dividend of ₹0.75 per share. Snowman Logistics became a subsidiary in December 2024.",
            "Sentiment": "positive",
            "PublishDate": 1738582761000,
            "Source": "earnings"
        },
        {
            "Title": "Gateway Distriparks Ltd: Expands Service to Kandla Port",
            "Summary": "Gateway Distriparks Limited launched a new container train service connecting five Inland Container Depots to Kandla Port. The expansion links ICDs in Gurgaon, Faridabad, Ahmedabad, Ludhiana, and Kashipur to the Western region port, requiring no additional capital expenditure or new rake deployment.",
            "Sentiment": "positive",
            "PublishDate": 1733132899000,
            "Source": "normal_news"
        }
    ]
}