{
    "Symbol": "GATECHDVR",
    "ISIN": "INE224E01036",
    "News": [
        {
            "Title": "GACM Technologies Shifts Registered Office in Hyderabad",
            "Summary": "GACM Technologies Limited has relocated its registered office within Hyderabad from Begumpet to Kavuri Hills following board approval on February 11, 2026. The administrative change does not impact operations.",
            "Sentiment": "neutral",
            "PublishDate": 1770899729709,
            "Source": "stocks"
        },
        {
            "Title": "GACM Technologies Fund-Raising Committee Approves Draft",
            "Summary": "GACM Technologies Limited's Fund-Raising Committee approved Draft Preliminary Placement Document for stock exchange filing on January 12, 2026, seeking prior approval from BSE and NSE.",
            "Sentiment": "positive",
            "PublishDate": 1768226337394,
            "Source": "stocks"
        },
        {
            "Title": "GACM Technologies Reports Mixed Financial Results for Quarter Ended September 2025",
            "Summary": "GACM Technologies Limited announced its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. On a standalone basis, the company reported income from operations of ₹437.98 lakhs for the quarter compared to ₹315.09 lakhs in the same period last year. Net profit for the quarter stood at ₹220.02 lakhs versus a loss of ₹37.66 lakhs in the previous year quarter. For the half year, standalone income from operations reached ₹1,024.96 lakhs with net profit of ₹522.91 lakhs. On consolidated basis, quarterly income from operations was ₹512.98 lakhs with net profit of ₹251.36 lakhs. The consolidated results include subsidiary Gayiadi Fintech Private Limited. The company operates in software and consultancy services business. Basic earnings per share for the consolidated half year results was ₹0.0527.",
            "Sentiment": "positive",
            "PublishDate": 1762946809099,
            "Source": "earnings"
        },
        {
            "Title": "GACM Technologies Board Approves Rs 400 Crore QIP and Share Swap Acquisitions",
            "Summary": "GACM Technologies Limited's Board of Directors approved several key resolutions on September 18, 2025. The company issued a corrigendum to its 30th AGM notice scheduled for September 25, 2025, making amendments to preferential share issue resolutions based on stock exchange suggestions. The Board approved raising funds up to Rs 400 crores through Qualified Institutional Placement (QIP), removing the earlier option of Foreign Currency Convertible Bonds. Additionally, the company approved share swap arrangements for acquiring stakes in two companies - 20.83% in WEXL EDU Private Limited and 5.09% in Market Simplified India Limited, valued at Rs 119.34 crores. WEXL EDU is an education technology firm providing AI-enabled academic solutions, while Market Simplified India focuses on digitizing products for financial institutions. The acquisitions will be executed through preferential allotment of up to 1,193,434,800 equity shares with ordinary and differential voting rights at Rs 1 per share to existing shareholders of the target companies.",
            "Sentiment": "positive",
            "PublishDate": 1758178054032,
            "Source": "corporate_action"
        },
        {
            "Title": "GACM Technologies Approves 1.21 Billion Share Preferential Issue for Strategic Acquisitions",
            "Summary": "GACM Technologies Limited's Board approved the issuance of 1,210,077,200 equity shares at Rs. 1 each to non-promoters through a preferential share swap arrangement. The company will acquire a 5.34% stake in Market Simplified India Limited at an 80:1 swap ratio and a 21.06% stake in WEXL EDU Private Limited at a 120:1 swap ratio, representing an enterprise value of Rs. 121.01 crores. The Board also approved increasing authorized share capital from Rs. 300 crores to Rs. 550 crores, subject to shareholder approval at the upcoming Annual General Meeting. Material related party transactions were approved, requiring member approval under the Companies Act 2013. CARE Ratings Limited was appointed as the monitoring agency for the preferential issue.",
            "Sentiment": "positive",
            "PublishDate": 1756194832365,
            "Source": "corporate_action"
        }
    ]
}