{
    "Symbol": "GAYAHWS",
    "ISIN": "INE287Z01012",
    "News": [
        {
            "Title": "Gayatri Highways Board Meet Set for Feb 10, 2026",
            "Summary": "Gayatri Highways Limited has scheduled its board meeting for February 10, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768908863571,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gayatri Highways Board Approves ₹450 Cr RPTs",
            "Summary": "Gayatri Highways Limited board approved material related party transactions worth ₹450 crores across three entities, subject to shareholder approval via postal ballot.",
            "Sentiment": "neutral",
            "PublishDate": 1765450327268,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gayatri Highways Reports Mixed Q2 Results with Standalone Loss and Consolidated Challenges",
            "Summary": "Gayatri Highways Limited reported a standalone net loss of Rs 508.82 lakhs for Q2 ended September 30, 2025, compared to a profit of Rs 3,152.31 lakhs in the same quarter last year, while consolidated results showed a total loss after tax of Rs 324.22 lakhs. The company faces significant financial challenges including defaulted term loan repayments of Rs 5,015.86 lakhs and qualified audit opinions highlighting impairment issues with jointly controlled entities worth Rs 4,820.51 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1763061801024,
            "Source": "earnings"
        },
        {
            "Title": "Gayatri Highways Limited Approves Amendments to Securities Purchase Agreement",
            "Summary": "Gayatri Highways Limited's Board of Directors approved amendments to a Securities Purchase, Subscription and Shareholders' Agreement on October 18, 2025. The original agreement was executed on April 28, 2021, and involves Kotak Special Situations Fund (a Category II alternative investment fund), HKR Roadways Limited, and Gayatri Highways Limited. The key amendment adds provisions requiring lender approval for any exercise of Call Rights that would result in the Investor holding less than 74% equity shareholding in HKR Roadways Limited. The amendment also restricts Promoters from exercising certain rights if a default has occurred under the Definitive Agreements.",
            "Sentiment": "neutral",
            "PublishDate": 1760787085773,
            "Source": "corporate_action"
        },
        {
            "Title": "Gayatri Highways Reports Strong Q1 Profit Turnaround, Reappoints Independent Directors",
            "Summary": "Gayatri Highways Limited reported a net profit of Rs. 3,152.31 lakhs for the quarter ended June 30, 2025, marking a significant turnaround from a loss of Rs. 505.84 lakhs in the previous quarter. The company's other income surged to Rs. 3,556.73 lakhs, primarily driven by dividend receipts of Rs. 3,459.50 lakhs from jointly controlled entities. However, the company continues to face financial challenges with outstanding defaulted term loans of Rs. 5,015.86 lakhs to IL&FS Financial Services Limited. The board approved the reappointment of two independent directors - Mr. D. Balarama Krishna and Ms. Venkata Sindhuja Pothapragada - for five-year terms starting August 28, 2025. The company also appointed M/s. V. Shankar & Co. as secretarial auditors for five years and scheduled its Annual General Meeting for September 29, 2025, via video conferencing.",
            "Sentiment": "positive",
            "PublishDate": 1754991974298,
            "Source": "earnings"
        }
    ]
}