{
    "Symbol": "GCSL",
    "ISIN": "INE199P01028",
    "News": [
        {
            "Title": "Gretex Corporate Services Promoter Group Reduces Stake",
            "Summary": "Talent Investment Co Private Limited, a promoter group entity of Gretex Corporate Services, sold 2,57,717 equity shares across two transactions, reducing its stake from 10.57% to 9.20%.",
            "Sentiment": "neutral",
            "PublishDate": 1769673681253,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gretex Gets Stock Exchange Approval for Warrant Issue",
            "Summary": "Gretex Corporate Services receives in-principle approval from NSE and BSE for issuing 1,00,000 warrants convertible into equity shares at Rs. 300/- each to non-promoters on preferential basis.",
            "Sentiment": "positive",
            "PublishDate": 1769514570949,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gretex Files SEBI AIF Registration Application",
            "Summary": "Gretex Corporate Services announces that Bahutex Ventures LLP has filed application with SEBI on January 24, 2026 for Category II Alternative Investment Fund registration under AIF Regulations 2012.",
            "Sentiment": "positive",
            "PublishDate": 1769254365449,
            "Source": "stocks"
        },
        {
            "Title": "Gretex Corporate Services Promoter Group Sells Shares",
            "Summary": "Talent Investment Co Private Limited, a promoter group entity of Gretex Corporate Services, sold 3,00,000 equity shares worth ₹9.00 crore through market transactions on NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1769249189757,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gretex Allots 3.3L Equity Shares via Warrant Conversion",
            "Summary": "Gretex Corporate Services allotted 3,30,000 equity shares at ₹379 per share through warrant conversion by promoter entity Talent Investment Company, generating ₹9.38 crores consideration.",
            "Sentiment": "positive",
            "PublishDate": 1769171339942,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gretex Corporate Services clarifies warrant issue terms",
            "Summary": "Gretex Corporate Services provides clarifications on its proposed preferential issue of 1,00,000 equity warrants at ₹300 per warrant following stock exchange observations.",
            "Sentiment": "neutral",
            "PublishDate": 1768571141183,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gretex Corporate Services Q3FY26 Earnings Call",
            "Summary": "Gretex Corporate Services Limited submits investor presentation for Q3FY26 earnings call under Regulation 30, showcasing financial performance and business updates for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768393273873,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gretex Corporate Services Faces ₹15 Lakh SEBI Penalty",
            "Summary": "SEBI imposed a penalty of ₹15 lakh on Gretex Corporate Services for alleged non-compliances with ICDR and Merchant Bankers regulations. Company states no material impact on operations.",
            "Sentiment": "negative",
            "PublishDate": 1768392227976,
            "Source": "stocks"
        },
        {
            "Title": "Gretex Corporate Services Faces SEBI Order",
            "Summary": "SEBI has issued an adjudication order concerning Gretex Corporate Services, though specific details of the regulatory action remain undisclosed in current filings.",
            "Sentiment": "negative",
            "PublishDate": 1768349966921,
            "Source": "stocks"
        },
        {
            "Title": "Gretex Corporate Services Allots 94,459 Equity Shares",
            "Summary": "Gretex Corporate Services Limited has allotted 94,459 equity shares at ₹379 per share following conversion of equity warrants by non-promoter investor Sandeep Kumar Agarwal, raising ₹2.69 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768325670940,
            "Source": "co_actions_results"
        },
        {
            "Title": "GRETEX Corporate Services SEBI Adjudication Update",
            "Summary": "GRETEX Corporate Services receives SEBI updates regarding adjudication order proceedings. The regulatory development affects the company's compliance status with market regulator requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1768305810301,
            "Source": "stocks"
        },
        {
            "Title": "Gretex Corporate Services Q3FY26 Earnings Call Jan 19",
            "Summary": "Gretex Corporate Services Limited has scheduled an earnings conference call for January 19, 2026, at 11:00 AM IST to discuss Q3FY26 financial results ending December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768304407140,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gretex Corporate Services Plans ₹100 Cr AIF Investment",
            "Summary": "Gretex Corporate Services announces strategic investment of ₹100 crores in Category II Alternative Investment Fund to support capital requirements and drive long-term business growth initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1768185243798,
            "Source": "stocks"
        },
        {
            "Title": "Gretex Plans ₹100 Cr AIF Investment via Bahutex LLP",
            "Summary": "Gretex Corporate Services and subsidiary Gretex Share Broking Limited propose to invest in Category II Alternative Investment Fund through Bahutex Ventures LLP partnership.",
            "Sentiment": "positive",
            "PublishDate": 1768057490830,
            "Source": "stocks"
        },
        {
            "Title": "Gretex Corporate Services Q3FY26 Results Announced",
            "Summary": "Gretex Corporate Services reported Q3FY26 financial results with standalone revenue of ₹820.55 lakhs and net profit of ₹234.64 lakhs. Board also approved investment in Category II AIF through Bahutex Ventures LLP.",
            "Sentiment": "positive",
            "PublishDate": 1768055320635,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gretex Corporate Q3 FY26 Results & AIF Investment",
            "Summary": "Gretex Corporate Services reported Q3 FY26 standalone net profit of ₹234.64 lakhs vs ₹781.46 lakhs YoY. Board approved investment in Category II AIF through Bahutex Ventures LLP with fund corpus up to ₹100 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1768054274320,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gretex Corporate Services Board Meet on Jan 10",
            "Summary": "Gretex Corporate Services Limited has scheduled a board meeting for January 10, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ending December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767426673705,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gretex Corporate Services Reports 197% Revenue Jump to INR 67.4 Crores in Q2 FY26",
            "Summary": "Gretex Corporate Services Limited posted strong quarterly results with total income rising 197% to INR 67.4 crores and PAT growing over 13 times to INR 12.9 crores, driven by increased IPO mandates and market-making operations. The merchant banking company currently has 21 IPO mandates under execution and plans to list its subsidiary Gretex Share Broking Limited while targeting INR 20,000 crores in fundraising over the next three years.",
            "Sentiment": "positive",
            "PublishDate": 1763982458340,
            "Source": "earnings"
        },
        {
            "Title": "Gretex Corporate Services Reports Strong Q2FY26 Performance with 197% Revenue Growth",
            "Summary": "Gretex Corporate Services delivered robust quarterly results with total income rising 197% to Rs 22.7 crores and PAT increasing 13 times to Rs 1.0 crore, driven by increased IPO mandates and market-making operations expansion. The merchant banking firm successfully completed 5 IPOs, 1 de-listing, 1 open offer, and 7 valuation advisory mandates during the quarter, strengthening its position in the SME capital markets segment.",
            "Sentiment": "positive",
            "PublishDate": 1763145064795,
            "Source": "earnings"
        },
        {
            "Title": "Gretex Corporate Services Targets 20%+ Annual Revenue Growth Through Service Expansion",
            "Summary": "Gretex Corporate Services is expanding its business operations into venture debt and M&A segments while strengthening its SME advisory, fund-raising services, capital markets consulting, and ESG advisory offerings. The company is targeting 20%+ annual revenue growth by enhancing its digital deal execution platform and building institutional partnerships for scalable expansion.",
            "Sentiment": "positive",
            "PublishDate": 1763135423560,
            "Source": "stock"
        },
        {
            "Title": "Gretex Corporate Services Reports Mixed Q2 Results with Profit Growth Despite Revenue Decline",
            "Summary": "Gretex Corporate Services posted Q2 consolidated net profit of 115 million rupees, up from 99 million rupees year-over-year, while revenue declined to 796 million rupees from 937 million rupees. The company's EBITDA surged to 318 million rupees from 167 million rupees, with EBITDA margin expanding significantly to 39.92% from 17.82% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1763074690441,
            "Source": "earnings"
        },
        {
            "Title": "Gretex Corporate Services Reports Strong Q2 Results and Approves Rs 3 Crore Preferential Issue",
            "Summary": "Gretex Corporate Services' board approved quarterly results for the period ended September 30, 2025, and sanctioned issuance of 1,00,000 equity warrants at Rs 300 each to raise Rs 3 crores on preferential basis. The company reported standalone profit of Rs 809.90 lakhs for the quarter and Rs 850.89 lakhs for the half-year, with the fundraising subject to shareholder approval through postal ballot.",
            "Sentiment": "positive",
            "PublishDate": 1763057733617,
            "Source": "earnings"
        },
        {
            "Title": "Gretex Corporate Services Plans Equity Fundraising",
            "Summary": "Gretex Corporate Services plans to raise funds through equity issuance.",
            "Sentiment": "neutral",
            "PublishDate": 1762345258489,
            "Source": "stock"
        },
        {
            "Title": "SEBI Imposes 21-Day Ban on Gretex Corporate Services for New Assignments",
            "Summary": "SEBI has banned Gretex Corporate Services from taking on new assignments for a period of 21 days. The regulatory action restricts the company's ability to accept fresh business during this timeframe.",
            "Sentiment": "negative",
            "PublishDate": 1761837247159,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gretex Corporate Services Rectifies Financial Filing Error, Reports Strong Half-Year Performance",
            "Summary": "Gretex Corporate Services Limited corrected discrepancies in its financial results filing after BSE noted that quarterly figures were submitted instead of half-yearly results for the period ended March 31, 2025. The company has uploaded revised half-yearly financial results in both PDF and XBRL formats. On a standalone basis, the company reported revenue from operations of Rs. 756.95 lakhs for the six months ended March 31, 2025, with profit after tax of Rs. 1,073.59 lakhs. Total comprehensive income reached Rs. 3,861.49 lakhs. On a consolidated basis, revenue from operations was Rs. 12,556.95 lakhs with a profit after tax of Rs. 1,972.12 lakhs. The company operates primarily in the capital market segment and has subsidiaries including Gretex Sharebroking Limited and Signageus Value Advisors Private Limited. The financial results were approved by the Board of Directors and audited by Jay Gupta & Associates, who issued an unmodified opinion.",
            "Sentiment": "neutral",
            "PublishDate": 1761825331269,
            "Source": "earnings"
        },
        {
            "Title": "Gretex Corporate Services Receives SEBI Show Cause Notice for Regulatory Non-Compliance",
            "Summary": "Gretex Corporate Services Limited received a Show Cause Notice from SEBI dated September 02, 2025, following an inspection of the company's operations as a SEBI-registered Merchant Banker for the period from April 01, 2022 to July 31, 2024. The notice alleges non-compliances under SEBI (Issue of Capital and Disclosure Requirements) Regulations 2018, SEBI (Merchant Bankers) Regulations 1992, and certain SEBI circulars. Specific violations include contraventions of Regulations 245 and 25 of SEBI (ICDR) Regulations 2018, Regulations 9A, 13, 21, and 27 of SEBI (Merchant Bankers) Regulations 1992, and clauses of the Code of Conduct for Merchant Bankers. The notice requires the company to show cause why an inquiry should not be held and penalties should not be imposed under Section 15HB and Section 15A(b) of the SEBI Act 1992. The company is working with legal advisers to provide necessary clarifications and cooperate with SEBI. The financial and operational impact cannot be quantified at this stage and will depend on the outcome of the proceedings.",
            "Sentiment": "negative",
            "PublishDate": 1757087128119,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gretext Corporate Services Receives NSE Approval to Move from BSE SME to Main Board",
            "Summary": "Gretext Corporate Services Ltd has received approval from the National Stock Exchange (NSE) to migrate from the BSE SME platform to the main board. Trading on the NSE main board is scheduled to commence on September 04, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1756880203901,
            "Source": "stock"
        },
        {
            "Title": "Gretex Corporate Services Appoints Rajeev Kanotra as Non-Executive Director at Material Subsidiary",
            "Summary": "Gretex Corporate Services Limited appointed Mr. Rajeev Kanotra as a Non-Executive (Non-Independent) Director on the board of its material subsidiary, Gretex Share Broking Limited, effective August 12, 2025. Kanotra brings over 30 years of experience in the Indian capital market, specializing in equity investment and hedging strategies. He holds a B.Com from University of Delhi and PGDBM from IMT Ghaziabad. His current activities include M&A, fund raising for pre and post IPO, managing proprietary funds, and delivering value to high net worth investors through research and portfolio construction.",
            "Sentiment": "positive",
            "PublishDate": 1756129966347,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gretex Industries Limited Becomes Associate Company Through Indirect Acquisition",
            "Summary": "Gretex Industries Limited has been indirectly acquired through common management control, resulting in its classification as an Associate Company. The target entity operates in trading and distribution of musical instruments, professional audio, and audiovisual equipment across Eastern and Northeastern India. The company reported a turnover of 329,226.29 thousand for FY 24-25, showing growth from 311,262.92 thousand in FY 23-24 and 220,271.54 thousand in FY 22-23. The acquisition involves 23.26% control through group entities and falls within the promoter group under common management. The transaction will result in consolidation of Gretex Industries Limited's financial results with the acquiring company's statements, expected to have material impact on consolidated financial position and performance.",
            "Sentiment": "neutral",
            "PublishDate": 1755340295212,
            "Source": "corporate_action"
        },
        {
            "Title": "Gretex Corporate Services Reports Mixed Q1 Results with Standalone Revenue Declining 33% YoY",
            "Summary": "Gretex Corporate Services Limited approved its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, revenue from operations fell to ₹494.85 lakhs from ₹744.30 lakhs in the same quarter last year, while net profit dropped to ₹38.85 lakhs from ₹128.23 lakhs. However, consolidated revenue declined to ₹2,198.42 lakhs from ₹3,961.38 lakhs year-over-year, though consolidated net profit attributable to owners improved to ₹76.62 lakhs compared to ₹502.35 lakhs in the previous year. The company's paid-up equity share capital increased significantly to ₹2,263.93 lakhs from ₹1,151.55 lakhs in the corresponding quarter last year. Basic earnings per share on standalone basis was ₹0.17 versus ₹1.11 in the same period last year. The company operates primarily in merchant banking services under capital markets.",
            "Sentiment": "negative",
            "PublishDate": 1755096797783,
            "Source": "earnings"
        },
        {
            "Title": "Gretex Corporate Services Appoints Arvind Harlalka as CFO of Material Subsidiary",
            "Summary": "Gretex Corporate Services Limited appointed Mr. Arvind Harlalka as Chief Financial Officer of its material subsidiary, Gretex Share Broking Limited, effective August 12, 2025. The appointment was made in compliance with Section 203 of the Companies Act, 2013. Harlalka is described as a professional with expertise in business strategy, financial governance, corporate governance, and research & innovation.",
            "Sentiment": "neutral",
            "PublishDate": 1755071092742,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gretex Corporate Services Receives BSE Approval to Migrate from SME Platform to Main Board",
            "Summary": "Gretex Corporate Services Limited has received in-principle approval from BSE Limited for migration of its equity shares from the SME Platform to the Main Board of BSE. The approval was granted through BSE's letter dated July 29, 2025, with reference number LO/Migration/SN/IP/198/2025-26. The migration is subject to compliance with applicable rules, regulations, and fulfillment of conditions specified by BSE Limited and other regulatory authorities. The company will take necessary steps to comply with the prescribed conditions and proceed with the migration process.",
            "Sentiment": "positive",
            "PublishDate": 1753883742482,
            "Source": "corporate_action"
        },
        {
            "Title": "Gretex Corporate Services Recommends Final Dividend of 30 Paise Per Share",
            "Summary": "Gretex Corporate Services has recommended a final dividend of 30 paise per share to its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1753118031285,
            "Source": "corporate_action"
        },
        {
            "Title": "Gretex Corporate Services Signs Agreement with Steel Maker in Chhattisgarh",
            "Summary": "Gretex Corporate Services has entered into an agreement with an unnamed steel manufacturer located in Chhattisgarh. The nature and details of the agreement are not specified in the provided news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752845337000,
            "Source": "default"
        },
        {
            "Title": "Gretex Corporate Signs Agreement with Chhattisgarh Tip-Trailer Manufacturer",
            "Summary": "Gretex Corporate has entered into an agreement with a tip-trailer manufacturer based in Chhattisgarh. The news briefly mentions the signing of this agreement but provides no further details about the terms, scope, or potential impact of the collaboration.",
            "Sentiment": "neutral",
            "PublishDate": 1752156916000,
            "Source": "default"
        },
        {
            "Title": "Gretex Corporate Services Migrates to Main Board of BSE and NSE",
            "Summary": "Gretex Corporate Services has successfully migrated from the SME platform of the Bombay Stock Exchange (BSE) to the main board platforms of both BSE and the National Stock Exchange (NSE). This move represents a significant milestone for the company, potentially offering greater visibility and liquidity for its shares.",
            "Sentiment": "positive",
            "PublishDate": 1735534074000,
            "Source": "corporate_action"
        },
        {
            "Title": "SEBI Rejects Gretex Corporate Services' Settlement Application",
            "Summary": "Gretex Corporate Services has announced that the Securities and Exchange Board of India (SEBI) has rejected the company's settlement application. This decision by SEBI indicates that the regulatory body has declined to resolve any potential issues or violations through a settlement process, which may have implications for the company's regulatory compliance status.",
            "Sentiment": "negative",
            "PublishDate": 1733788605000,
            "Source": "corporate_governance"
        },
        {
            "Title": "SEBI Rejects Gretex Corporate Services' Settlement Application",
            "Summary": "Gretex Corporate Services has announced that the Securities and Exchange Board of India (SEBI) has rejected the company's settlement application. This decision by SEBI indicates that the regulatory body has declined to resolve any pending issues or violations through a settlement process, potentially leading to further regulatory action or investigation.",
            "Sentiment": "negative",
            "PublishDate": 1733757305000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gretex Corporate Services Reports Significant Q2 EBITDA Improvement",
            "Summary": "Gretex Corporate Services has reported a substantial improvement in its Q2 EBITDA, turning a previous loss into a significant gain. The company's EBITDA for Q2 increased to 167 million rupees, compared to a loss of 5.5 million rupees in the same quarter of the previous year. Additionally, the company's Q2 EBITDA margin stood at 17.82%.",
            "Sentiment": "positive",
            "PublishDate": 1730983346000,
            "Source": "result"
        },
        {
            "Title": "Gretex Corporate Services Reports Significant Q2 Profit and Revenue Growth",
            "Summary": "Gretex Corporate Services has announced its Q2 financial results, showing substantial year-over-year and quarter-over-quarter growth. The consolidated net profit for Q2 reached 99 million rupees, up from 42 million rupees in the same quarter last year and 50 million rupees in the previous quarter. Revenue also saw a dramatic increase to 937 million rupees, compared to 61 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730983250000,
            "Source": "result"
        }
    ]
}