{
    "Symbol": "GEECEE",
    "ISIN": "INE916G01016",
    "News": [
        {
            "Title": "Geecee Ventures Q3FY26 Net Profit Drops 70% to ₹483.73 Cr",
            "Summary": "Geecee Ventures reported Q3FY26 net profit of ₹483.73 crores, down 70% YoY from ₹1,624.18 crores. Revenue declined 70% to ₹1,606.75 crores amid challenging market conditions.",
            "Sentiment": "negative",
            "PublishDate": 1770800900555,
            "Source": "co_actions_results"
        },
        {
            "Title": "Multiple Companies Report Q3FY26 Results & Regulatory Updates",
            "Summary": "Voltamp Transformers reports strong Q3FY26 performance with 30.30% revenue growth, while Cummins India, Semac Construction, Shiva Texyarn, and Hinduja Leyland Finance announce quarterly results. GEECEE Ventures and IRIS RegTech notify special window for physical securities transfer.",
            "Sentiment": "positive",
            "PublishDate": 1770370957133,
            "Source": "co_actions_results"
        },
        {
            "Title": "Geecee Ventures pays Rs 1.39 crores for AEL shares",
            "Summary": "Geecee Ventures Limited completed payment of Rs 1.39 crores towards first call notice for 30,912 partly paid-up equity shares of Adani Enterprises Limited at Rs 450 per share on January 27, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769523450401,
            "Source": "co_actions_results"
        },
        {
            "Title": "GeeCee Ventures Completes ₹1.33 Cr Investment in Fusion Finance",
            "Summary": "GeeCee Ventures Limited has completed its balance payment of ₹1.33 crores for partly paid-up equity shares in Fusion Finance Limited, bringing its total investment to approximately ₹2.67 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1765381020047,
            "Source": "co_actions_results"
        },
        {
            "Title": "GeeCee Ventures Gets 30,912 Shares in Adani Rights Issue",
            "Summary": "GeeCee Ventures received allotment of 30,912 partly paid-up equity shares of Adani Enterprises through rights issue at ₹1,800 per share, with total acquisition cost of ₹2.78 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1765380884309,
            "Source": "co_actions_results"
        },
        {
            "Title": "GeeCee Ventures Invests ₹25.18 Cr in Adani Green",
            "Summary": "GeeCee Ventures Limited acquired 2,57,800 equity shares of Adani Green Energy Limited for ₹25.18 crores through open market purchase, representing 0.0015% shareholding in the renewable energy company.",
            "Sentiment": "positive",
            "PublishDate": 1765380822795,
            "Source": "co_actions_results"
        },
        {
            "Title": "Geecee Ventures Allotted 2.85 Lakh Convertible Warrants in Welspun Enterprises for Rs. 15 Crores",
            "Summary": "Geecee Ventures Limited has been allotted 2,85,714 convertible warrants by Welspun Enterprises Limited at Rs. 525 per warrant, representing 0.18% of diluted share capital. The company has paid Rs. 3.75 crores (25% of total investment value) with the remaining 75% payable upon conversion of warrants into equity shares within 18 months.",
            "Sentiment": "positive",
            "PublishDate": 1764743946152,
            "Source": "corporate_action"
        },
        {
            "Title": "Geecee Ventures Invests Rs. 15 Crores in Welspun Enterprises Through Convertible Warrants",
            "Summary": "Geecee Ventures Limited has subscribed to 2,85,714 convertible warrants of Welspun Enterprises Limited at Rs. 525 per warrant, paying Rs. 3.75 crores as 25% initial payment. The investment gives Geecee a 0.18% stake in the diluted share capital of Welspun Enterprises, a rapidly expanding infrastructure company with Rs. 2,827.39 crores turnover.",
            "Sentiment": "positive",
            "PublishDate": 1764247273459,
            "Source": "order&deals"
        },
        {
            "Title": "GeeCee Ventures Completes Rs 19.10 Crore Investment in Tilaknagar Industries Through Warrant Conversion",
            "Summary": "GeeCee Ventures Limited converted 5,00,000 warrants into equity shares of Tilaknagar Industries Limited after paying the remaining 75% amount of Rs 14.33 crores, completing its total investment of Rs 19.10 crores. The acquisition gives GeeCee Ventures approximately 0.20% stake in the breweries and distilleries company, which reported a turnover of Rs 3,174.62 crores and profit after tax of Rs 239.43 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1763644591237,
            "Source": "order&deals"
        },
        {
            "Title": "GEECEE VENTURES Reports Decline in Q2 Financial Performance",
            "Summary": "GEECEE VENTURES reported consolidated net profit of 102 million rupees for Q2, down from 125 million rupees in the same quarter last year. The company's revenue also decreased to 177 million rupees compared to 292 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762875053128,
            "Source": "earnings"
        },
        {
            "Title": "Geecee Ventures Acquires Mumbai Land for ₹139 Crores",
            "Summary": "Geecee Ventures Limited purchased freehold land measuring 4,003.80 square meters in Goregaon West, Mumbai for ₹139 crores, excluding stamp duty and registration charges. The land is located at Plot No.1, Udyog Nagar Estate, Swami Vivekanand Road. The company plans to undertake development on this land. The seller is a third-party not connected to the promoter group, and the transaction does not involve any related party dealings or interest from promoters, directors, or key managerial persons.",
            "Sentiment": "positive",
            "PublishDate": 1762463020840,
            "Source": "stock"
        },
        {
            "Title": "GeeCee Ventures Completes Rs 14.33 Crore Payment for Tilaknagarr Industries Convertible Warrants",
            "Summary": "GeeCee Ventures Limited has completed the balance payment of Rs 14.33 crores (75% of total consideration) for 5,00,000 convertible warrants issued by Tilaknagar Industries Limited on October 31, 2025. The total cost of acquisition is Rs 19.10 crores at Rs 382 per warrant. GeeCee had previously paid 25% (Rs 4.77 crores) of the total consideration. Upon conversion of the warrants into equity shares at a ratio of one equity share per warrant, GeeCee will hold approximately 0.20% of Tilaknagar Industries' total share capital. The conversion is expected to be completed by November 30, 2025. Tilaknagar Industries is a listed company engaged in manufacturing Indian Made Foreign Liquor, with a turnover of Rs 3,174.62 crores and profit after tax of Rs 239.43 crores. The company is known for its flagship brand Mansion House Brandy and produces various alcoholic beverages including whisky, rum, vodka, and gin.",
            "Sentiment": "neutral",
            "PublishDate": 1761916181277,
            "Source": "order&deals"
        },
        {
            "Title": "GEECEE Ventures Invests Rs. 15 Crores in Welspun Enterprises Convertible Warrants",
            "Summary": "GEECEE Ventures Limited has agreed to invest in Welspun Enterprises Limited through a preferential issue of convertible warrants. The company will acquire 285,714 convertible warrants at Rs. 525 per warrant, totaling Rs. 15 crores. The warrants can be converted into equity shares within 18 months of allotment, with unconverted warrants lapsing after this period and amounts being forfeited. Welspun Enterprises' Board approved the preferential issue on October 15, 2025. Welspun Enterprises operates in civil construction and infrastructure sectors, with FY 2024-2025 turnover of Rs. 2,827.39 crores and profit after tax of Rs. 307.70 crores. The company has presence in transportation, water infrastructure, and oil & gas sectors through joint ventures. The investment exceeds the threshold specified in SEBI regulations, requiring disclosure. The transaction will proceed after obtaining requisite approvals from shareholders and stock exchanges as per Companies Act 2013 and SEBI ICDR regulations.",
            "Sentiment": "positive",
            "PublishDate": 1760542638335,
            "Source": "order&deals"
        },
        {
            "Title": "GeeCee Ventures Reports Q1 FY26 Results, Announces Board Appointments and AGM Schedule",
            "Summary": "GeeCee Ventures Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported standalone net profit of Rs 310.32 lakhs and consolidated net profit of Rs 333.43 lakhs. The Board scheduled the 41st Annual General Meeting for September 18, 2025, via video conferencing. Key appointments include M/s. Kishore Bhatia & Associates as Cost Auditors for FY 2025-26 and M/s. Avani Gandhi & Associates as Secretarial Auditors for five years (FY 2025-26 to FY 2029-30). The Board also approved the re-appointment of Mr. SureshKumar Vasudevan Vazhathara Pillai as Whole-Time Director for three years (May 28, 2026 to May 27, 2029) and Ms. Rupal Anand Vora as Independent Director for five years (August 13, 2026 to August 12, 2031), both subject to shareholder approval. The company fixed September 3, 2025 as the record date for final dividend entitlement for FY 2024-25.",
            "Sentiment": "neutral",
            "PublishDate": 1754490438764,
            "Source": "earnings"
        },
        {
            "Title": "GeeCee Ventures Invests Rs 1.23 Crores in Adani Energy Solutions and Rs 19.10 Crores in Tilaknagar Industries Warrants",
            "Summary": "GeeCee Ventures Limited made two strategic investments. The company acquired 15,000 equity shares of Adani Energy Solutions Ltd through open market purchase for Rs 1.23 crores, bringing its total investment in AESL to Rs 4.39 crores and total shareholding to 45,000 shares (0.003% of paid-up capital). Additionally, GeeCee Ventures agreed to invest Rs 19.10 crores in Tilaknagar Industries Limited through a preferential issue of 5,00,000 convertible warrants at Rs 382 per warrant. Each warrant is convertible into one equity share within 18 months of allotment, with 25% payment due at allotment and 75% at conversion. Post-acquisition, GeeCee Ventures will hold 0.20% of TIL's paid-up capital. AESL operates in power transmission and distribution with FY2025 turnover of Rs 1,937.75 crores, while TIL is engaged in manufacturing Indian Made Foreign Liquor with FY2025 turnover of Rs 3,174.62 crores.",
            "Sentiment": "positive",
            "PublishDate": 1753802269118,
            "Source": "order&deals"
        },
        {
            "Title": "GEECEE VENTURES Reports Q4 Results and Recommends Final Dividend",
            "Summary": "GEECEE VENTURES has announced its quarterly results and dividend recommendation. The company's Q4 consolidated net profit decreased to 39 million rupees from 179 million rupees year-over-year. Q4 revenue fell to 158 million rupees from 631 million rupees year-over-year. EBITDA for Q4 was 45 million rupees, down from 222 million rupees in the previous year, with EBITDA margin decreasing to 28.42% from 35.21%. The company has recommended a final dividend of 2 rupees per equity share.",
            "Sentiment": "negative",
            "PublishDate": 1747829758000,
            "Source": "result"
        },
        {
            "Title": "GeeCee Ventures Invests 3.8 Million Rupees in Precision Wires",
            "Summary": "GeeCee Ventures has made an investment of 3.8 million rupees in Precision Wires. This investment represents a corporate action by GeeCee Ventures, potentially indicating a strategic move to expand its portfolio or strengthen its position in a particular sector.",
            "Sentiment": "neutral",
            "PublishDate": 1745849365000,
            "Source": "default"
        },
        {
            "Title": "Geecee Ventures Reports Significant Increase in Q3 Profit and Revenue",
            "Summary": "Geecee Ventures has announced its Q3 financial results, showing a substantial year-over-year improvement. The company's consolidated net profit rose to 195 million rupees, up from 92 million rupees in the same quarter last year. Revenue also saw a dramatic increase, reaching 587 million rupees compared to 137 million rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1738714918000,
            "Source": "earnings"
        },
        {
            "Title": "GeeCee Ventures Reports Significant Increase in Q3 Profit and Revenue",
            "Summary": "GeeCee Ventures has announced its financial results for the third quarter. The company's consolidated net profit has more than doubled to 195 million rupees, compared to 92 million rupees in the same period last year. Revenue has seen a substantial increase, rising to 587 million rupees from 137 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738671070000,
            "Source": "earnings"
        },
        {
            "Title": "GeeCee Venture Reports Significant Profit and Revenue Growth in Q2",
            "Summary": "GeeCee Venture has announced its Q2 financial results, showing substantial year-over-year and quarter-over-quarter growth. The consolidated net profit for Q2 reached 126 million rupees, up from 45 million rupees in the same quarter last year and 108 million rupees in the previous quarter. Revenue also saw a significant increase, rising to 292 million rupees from 86 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731329803000,
            "Source": "result"
        }
    ]
}