{
    "Symbol": "GEMAROMA",
    "ISIN": "INE06XZ01023",
    "News": [
        {
            "Title": "Gem Aromatics schedules investor meet at Dahej plant",
            "Summary": "Gem Aromatics Limited announces investor meeting with New Berry Advisors on February 17, 2026, at its Unit 3 facility in Dahej, Gujarat, featuring plant visit and Q3 FY26 presentation.",
            "Sentiment": "neutral",
            "PublishDate": 1770879067662,
            "Source": "stocks"
        },
        {
            "Title": "Gem Aromatics Appoints New Non-Executive Director",
            "Summary": "Gem Aromatics Limited shareholders approve appointment of Shrenik Kishorbhai Vora as Non-Executive, Non-Independent Director through postal ballot with 99.98% votes in favour.",
            "Sentiment": "positive",
            "PublishDate": 1770643798878,
            "Source": "stocks"
        },
        {
            "Title": "Gem Aromatics Sets ₹1,050-1,100 Cr Revenue Target",
            "Summary": "Gem Aromatics has announced ambitious financial targets, aiming for revenue of ₹1,050-1,100 crores by FY28 with EBITDA margins of 16-18%, signaling strong growth expectations for the company.",
            "Sentiment": "positive",
            "PublishDate": 1769524564649,
            "Source": "stocks"
        },
        {
            "Title": "Gem Aromatics Q3FY26 Earnings Call Set for Jan 27",
            "Summary": "Gem Aromatics Limited announces investor conference call on January 27, 2026 at 5:30 PM IST to discuss Q3 and nine-month financial results ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769005896475,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gem Aromatics seeks shareholder approval for director",
            "Summary": "Gem Aromatics Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Shrenik Kishorbhai Vora as Non-Executive Director through remote e-voting from January 09 to February 07, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767878768166,
            "Source": "stocks"
        },
        {
            "Title": "Gem Aromatics Starts Commercial Production at Dahej",
            "Summary": "Gem Aromatics Limited has commenced commercial production of cooling agents and clove products at its Dahej facility through subsidiary Krystal Ingredients Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1765448138812,
            "Source": "stocks"
        },
        {
            "Title": "GEM Aromatics Reports Q2 FY26 Loss Amid US Tariff and GST Challenges",
            "Summary": "GEM Aromatics reported a net loss of Rs. 2.6 crore for Q2 FY26 with revenue of Rs. 89.5 crore, impacted by 50% US tariffs causing customer order deferrals and GST rate changes affecting mint product demand. The company is commissioning its Phase-II facility at Dahej by November 30th with 10,829 metric tons additional capacity for phenol derivatives and cooling agents, targeting Rs. 1,050-1,100 crore revenue by FY28.",
            "Sentiment": "negative",
            "PublishDate": 1763642312034,
            "Source": "earnings"
        },
        {
            "Title": "Gem Aromatics Reports Quarterly Results, Completes IPO Listing",
            "Summary": "Gem Aromatics Limited announced its unaudited standalone and consolidated financial results for the quarter and six months ended September 30, 2025, following board approval on November 13, 2025. The company successfully completed its Initial Public Offering of 1,38,84,615 equity shares at ₹325 per share and got listed on NSE and BSE on August 26, 2025, with executive directors waiving remuneration for FY2025-26.",
            "Sentiment": "positive",
            "PublishDate": 1763068546762,
            "Source": "order&deals"
        },
        {
            "Title": "Gem Aromatics Outlines Growth Strategy Through Export Expansion and Product Diversification",
            "Summary": "Gem Aromatics has outlined its strategic direction for steady export-led growth in fragrance and essential oils while expanding into natural extracts and bio-derivatives. The company expects margin expansion through automation and backward integration, with R&D efforts focused on developing high-value flavor compounds.",
            "Sentiment": "neutral",
            "PublishDate": 1763052291631,
            "Source": "stock"
        },
        {
            "Title": "Gem Aromatics Independent Director Resigns Due to Enhanced Role with Company",
            "Summary": "Gem Aromatics Limited announced the resignation of Mr. Shrenik Kishorbhai Vora (DIN: 08688950) from his position as Non-Executive Independent Director, effective November 10, 2025. Vora cited his interest in taking on an enhanced role and greater professional engagement with the company in the future, which may potentially affect his independence as per Companies Act, 2013 and SEBI regulations. The resignation was submitted via email on November 10, 2025, with immediate effect. Vora confirmed there are no other material reasons for his resignation beyond those mentioned. The director does not hold directorships in any other listed entities.",
            "Sentiment": "neutral",
            "PublishDate": 1762908657612,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gem Aromatics Company Secretary Resigns Due to Health Reasons",
            "Summary": "Pooja Padam Bhandari has resigned from her position as Company Secretary and Compliance Officer at Gem Aromatics Limited due to health reasons. Her resignation is effective from the close of business hours on November 07, 2025. Bhandari, who holds ACS certification number 73944, submitted her resignation letter on the same date. The company has accepted her resignation and disclosed the information to stock exchanges BSE and NSE as required under SEBI regulations. In her resignation letter, Bhandari confirmed there are no other material reasons for her departure beyond the health issues mentioned.",
            "Sentiment": "neutral",
            "PublishDate": 1762528740728,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gem Aromatics Reports Q1 FY26 Results with Revenue of ₹876 Million",
            "Summary": "Gem Aromatics Limited announced its quarterly results for the period ended June 30, 2025. The company reported standalone revenue from operations of ₹763.96 million and consolidated revenue of ₹876.33 million. Standalone profit for the quarter was ₹65.23 million, while consolidated profit reached ₹79.84 million. The company's earnings per share stood at ₹1.39 for standalone results and ₹1.70 for consolidated results. The company operates in manufacturing and sale of specialty ingredients, including essential oils and aroma chemicals. The results were approved by the Board of Directors in a meeting held on September 12, 2025. The company completed its IPO of 1,38,84,615 equity shares at ₹325 per share and got listed on NSE and BSE on August 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1757683226968,
            "Source": "earnings"
        }
    ]
}