{
    "Symbol": "GENCON",
    "ISIN": "INE854S01022",
    "News": [
        {
            "Title": "Generic Engineering Defers Fundraising Decision",
            "Summary": "Generic Engineering Construction and Projects Limited's board meeting on January 12, 2026 concluded without finalizing fundraising proposals, citing need for further market evaluation.",
            "Sentiment": "neutral",
            "PublishDate": 1768229132384,
            "Source": "stocks"
        },
        {
            "Title": "Generic Engineering Construction Board Meet Jan 12",
            "Summary": "Generic Engineering Construction And Projects has scheduled a board meeting for January 12, 2026, to discuss fundraising through equity or other securities. Trading window closed.",
            "Sentiment": "neutral",
            "PublishDate": 1767705389946,
            "Source": "stocks"
        },
        {
            "Title": "Generic Engineering Construction Reports Mixed Q2 Performance with Revenue Growth but Lower Profitability",
            "Summary": "Generic Engineering Construction and Projects Limited announced its quarterly results for the period ended September 30, 2025. The company reported revenue from operations of Rs. 6,159.29 lakhs for the quarter, compared to Rs. 5,137.82 lakhs in the same quarter last year. For the six-month period, revenue reached Rs. 11,355.13 lakhs versus Rs. 10,192.64 lakhs in the previous year. However, profit from continuing operations declined to Rs. 215.85 lakhs for the quarter from Rs. 200.88 lakhs year-over-year. The six-month profit from continuing operations was Rs. 415.90 lakhs compared to Rs. 392.89 lakhs previously. Basic earnings per share stood at Rs. 0.38 for the quarter and Rs. 0.73 for the six-month period. The company operates primarily in the engineering and construction segment. The Board of Directors meeting was held on November 12, 2025, where these unaudited financial results were approved following audit committee review.",
            "Sentiment": "neutral",
            "PublishDate": 1762996141221,
            "Source": "earnings"
        },
        {
            "Title": "Generic Engineering Construction Reports Rs 200.42 Lakh Profit in Q1 Results",
            "Summary": "Generic Engineering Construction and Projects Limited reported a standalone profit of Rs 200.42 lakh for the quarter ended June 30, 2025, compared to Rs 620.60 lakh in the same period last year. Revenue from operations declined to Rs 5,195.84 lakh from Rs 5,054.82 lakh year-over-year. Total income for the quarter was Rs 5,240.55 lakh versus Rs 11,367.42 lakh in the previous year. The company's consolidated results showed identical figures to standalone results. Basic earnings per share stood at Rs 0.35 compared to Rs 1.07 in the corresponding quarter last year. The Board of Directors approved these unaudited financial results on August 12, 2025, following review by the Audit Committee. The company operates primarily in the engineering and construction segment.",
            "Sentiment": "negative",
            "PublishDate": 1755017640778,
            "Source": "earnings"
        },
        {
            "Title": "Generic Engineering Construction & Projects: Q3 Profit Drops 27.2% Despite Revenue Surge",
            "Summary": "Generic Engineering Construction & Projects reported Q3 FY25 results with revenue up 58.2% YoY to ₹93.29 crore, but profit down 27.2% YoY to ₹1.82 crore. Operating income increased 10.65% YoY, while SG&A expenses rose 108.86% YoY. EPS improved to ₹0.53, up 23.26% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1741415460000,
            "Source": "earnings"
        },
        {
            "Title": "Generic Engineering to Build 110 Crore Ayodhya Bhakt Niwas Project for Maharashtra Government",
            "Summary": "Generic Engineering has been awarded a contract to construct the Ayodhya Bhakt Niwas project on behalf of the Maharashtra government. The project is valued at 110 crore rupees and was previously announced by the Chief Minister of Maharashtra.",
            "Sentiment": "positive",
            "PublishDate": 1733901040000,
            "Source": "order&deals"
        }
    ]
}