{
    "Symbol": "GENESYS",
    "ISIN": "INE727B01026",
    "News": [
        {
            "Title": "Genesys International Q3FY26 Results Show Mixed Performance",
            "Summary": "Genesys International reported Q3FY26 standalone revenue of ₹6,651.43 lakhs, down from ₹7,705.43 lakhs YoY. Net profit declined to ₹312.21 lakhs vs ₹1,788.90 lakhs in Q3FY25, impacted by exceptional charges.",
            "Sentiment": "negative",
            "PublishDate": 1770910248219,
            "Source": "co_actions_results"
        },
        {
            "Title": "Genesys International Wins ₹127.8m Project Contract",
            "Summary": "Genesys International Corp has been awarded a significant project contract valued at ₹127.8 million, marking a notable business development for the geospatial technology company.",
            "Sentiment": "positive",
            "PublishDate": 1769776076650,
            "Source": "co_actions_results"
        },
        {
            "Title": "Genesys International Auditor Firm Converts to LLP",
            "Summary": "Genesys International Corporation Limited announces that its statutory auditors M S K A & Associates have converted to LLP structure while continuing existing audit engagement without changes.",
            "Sentiment": "neutral",
            "PublishDate": 1768564460675,
            "Source": "stocks"
        },
        {
            "Title": "Genesys Allots 20,165 Shares Under ESOP Scheme",
            "Summary": "Genesys International Corporation Limited's Nomination and Remuneration Committee approved allotment of 20,165 equity shares under ESOP Scheme 2020, increasing paid-up capital to ₹20.90 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768307395480,
            "Source": "co_actions_results"
        },
        {
            "Title": "Genesys Wins SKOCH Gold Award for Varanasi Digital Twin",
            "Summary": "Genesys International Corporation received the prestigious SKOCH Award (Gold) 2025 for implementing Varanasi Smart City's 3D Digital Twin project in Urban Development category.",
            "Sentiment": "positive",
            "PublishDate": 1768287388025,
            "Source": "stocks"
        },
        {
            "Title": "Genesys International Independent Director Completes Tenure",
            "Summary": "Genesys International Corporation announces completion of Mr. Manish Patel's second term as Independent Director on December 23, 2025, leading to his cessation from multiple committee positions.",
            "Sentiment": "neutral",
            "PublishDate": 1766496556857,
            "Source": "stocks"
        },
        {
            "Title": "Genesys Launches India's First HD ADAS Maps",
            "Summary": "Genesys International launches India's first high-definition ADAS maps covering over 1 lakh km of national highways using Survey of India's CORS network, establishing new benchmark for automotive precision.",
            "Sentiment": "positive",
            "PublishDate": 1766033928884,
            "Source": "stocks"
        },
        {
            "Title": "Genesys International's Digital Twin Map Platform for Varanasi Wins GovConnect Award",
            "Summary": "Genesys International Corporation announced that its Digital Twin Map platform implementation for Varanasi city has been honored with the GovConnect Award for transformative impact on urban governance through spatial intelligence. The platform features high-precision 3D modeling at 5-cm accuracy, integrates over 2,500 CCTV cameras, and supports flood-prone zone detection and disaster modeling for the culturally significant city.",
            "Sentiment": "positive",
            "PublishDate": 1765174813285,
            "Source": "stock"
        },
        {
            "Title": "Genesys International Secures INR 17.38 Crore Order from Bureau Veritas for 3D Subsurface Mapping",
            "Summary": "Genesys International Corporation Ltd has received an INR 17.38 crore order from Bureau Veritas for 3D subsurface mapping services to support infrastructure development in India. The company confirmed that this contract involves no related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1764932318281,
            "Source": "order&deals"
        },
        {
            "Title": "Genesys International Allots 51,300 Shares Under ESOP 2020 and Grants 21,000 Options Under ESOP 2022",
            "Summary": "Genesys International Corporation's Nomination and Remuneration Committee approved the allotment of 51,300 equity shares of Rs. 5 face value each to eligible employees under ESOP Scheme-2020, increasing paid-up capital to Rs. 20,88,51,060 divided into 4,17,70,212 equity shares. The committee also granted 21,000 stock options to eligible employees under ESOP Scheme-2022 at an exercise price of Rs. 470 per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1763065797438,
            "Source": "corporate_action"
        },
        {
            "Title": "Genesys International Reports Q2 FY2026 Results with Revenue Growth and QIP Fundraise",
            "Summary": "Genesys International Corporation announced unaudited financial results for the quarter and half-year ended September 30, 2025, showing standalone revenue from operations of ₹5,952.42 lakhs for Q2 and ₹12,734.58 lakhs for H1. The company successfully raised ₹11,000 lakhs through a Qualified Institutional Placement (QIP) in May 2025 by allotting 17,39,625 equity shares at ₹632.32 per share, strengthening its financial position.",
            "Sentiment": "neutral",
            "PublishDate": 1763054004694,
            "Source": "corporate_action"
        },
        {
            "Title": "Genesys International Wins Native Navigation and ADAS Maps Contract from Tata Motors Passenger Vehicles",
            "Summary": "Genesys International Corporation Limited has been awarded a business contract by Tata Motors Passenger Vehicles Limited for Native Navigation and ADAS Maps. The contract involves supplying Native Navigation (Standard Definition Maps) and ADAS (High-Definition Maps) on Tata Motors' Software-Defined Vehicle platform for vehicles in India. The project will be executed over a 6-year period, with consideration based on licensee fees charged per automobile sold. This is a domestic contract with no related party transactions or promoter group interests involved.",
            "Sentiment": "positive",
            "PublishDate": 1760697278665,
            "Source": "order&deals"
        },
        {
            "Title": "Genesys International Corporation Reports Q1 FY2026 Financial Results with Mixed Performance",
            "Summary": "Genesys International Corporation Limited published its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported total income of Rs 2,925.93 lakhs compared to Rs 2,555.85 lakhs in the corresponding quarter of the previous year. Net profit after tax increased to Rs 505.86 lakhs from Rs 289.82 lakhs year-over-year. Basic and diluted earnings per share improved to Rs 1.76 from Rs 1.01. On a consolidated basis, total income reached Rs 6,878.26 lakhs versus Rs 5,666.67 lakhs in the same quarter last year. Consolidated net profit after tax was Rs 1,333.58 lakhs compared to Rs 1,159.84 lakhs previously. The company operates in a single segment of polymer processing. The results were reviewed by the audit committee and approved by the Board of Directors on August 14, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755247705545,
            "Source": "earnings"
        },
        {
            "Title": "Genesys International Corp Reports Strong Q1 Growth with 27% Revenue Increase",
            "Summary": "Genesys International Corp delivered robust quarterly performance with revenue rising to 709 million rupees from 558 million rupees year-over-year. The company's EBITDA increased significantly to 295 million rupees compared to 204 million rupees in the same period last year. EBITDA margin expanded to 41.63% from 36.6% year-over-year, indicating improved operational efficiency. Consolidated net profit grew to 70 million rupees from 53 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755093090389,
            "Source": "earnings"
        },
        {
            "Title": "Genesys Becomes First Indian Company to Integrate 2D, 3D, and Digipin Technologies in Dhruva Framework",
            "Summary": "Genesys has achieved a milestone by becoming the first company in India to combine 2D, 3D, and Digipin technologies within the Dhruva Framework for DPI-ready address infrastructure. This integration represents a technological advancement in digital address infrastructure capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1753073484534,
            "Source": "stock"
        },
        {
            "Title": "Genesys International Corp Reports Q4 Financial Results",
            "Summary": "Genesys International Corp has announced its Q4 financial results. The company's EBITDA increased to 498 million rupees from 362.6 million rupees year-over-year. The EBITDA margin improved to 52.86% from 50.94% in the same period. Consolidated net profit rose to 190 million rupees from 148.5 million rupees year-over-year and 207 million rupees quarter-over-quarter. Revenue for Q4 grew to 942 million rupees from 711.7 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748620195000,
            "Source": "result"
        },
        {
            "Title": "Genesys to Raise Funds via QIP at Discounted Price",
            "Summary": "Genesys plans to raise up to ₹110 crore through a Qualified Institutional Placement (QIP). The indicative price is set at ₹632.32 per share, which represents a 13% discount to the current market price and a 5% discount to the SEBI floor price of ₹665 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1747278621000,
            "Source": "default"
        },
        {
            "Title": "Genesys International Sets QIP Floor Price",
            "Summary": "Genesys International Corporation has announced that the floor price for its Qualified Institutional Placement (QIP) has been set at 665.60 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1747236766000,
            "Source": "default"
        },
        {
            "Title": "Genesys International Secures Rs 15 Crore Order for 3D Map Services in Pune",
            "Summary": "Genesys International has received an additional order worth Rs 15 crores for the adoption of its 3D map stacks and analytics services. The order is for expanding coverage to additional areas around Pune, indicating growing demand for the company's mapping technology in urban planning and development.",
            "Sentiment": "positive",
            "PublishDate": 1745194900000,
            "Source": "default"
        },
        {
            "Title": "Genesys International Secures Additional Order for 3D Map Technology",
            "Summary": "Genesys International has secured an additional order worth Rs 15 crores for the adoption of its 3D map stacks and analytics technology. The order is for expanding coverage to additional areas around Pune, India.",
            "Sentiment": "positive",
            "PublishDate": 1744890225000,
            "Source": "default"
        },
        {
            "Title": "Kochi to Implement Genesys International's Digital Twin Technology",
            "Summary": "Genesys International Corporation has announced that the city of Kochi will adopt its Digital Twin Stack technology. This implementation suggests a significant advancement in urban planning and management for Kochi, leveraging Genesys International's expertise in digital mapping and geospatial solutions.",
            "Sentiment": "positive",
            "PublishDate": 1744363140000,
            "Source": "order&deals"
        },
        {
            "Title": "Genesys International Secures 214.5 Million Rupee Contract",
            "Summary": "Genesys International Corporation has been awarded a contract worth 214.5 million rupees. The news indicates a significant business development for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1741579022000,
            "Source": "order&deals"
        },
        {
            "Title": "Genesys International Secures ₹56 Crore Land Records Modernization Project in West Bengal",
            "Summary": "Genesys International has been awarded a significant contract worth ₹56 crore for a land records modernization project in West Bengal. This project aims to digitize and update land records in the state, potentially improving land management and administration processes.",
            "Sentiment": "positive",
            "PublishDate": 1734419925000,
            "Source": "order&deals"
        },
        {
            "Title": "Genesys International: Multibagger Stock Soars 1,963% in 4 Years",
            "Summary": "Genesys International's stock has surged 171% in the past year, reaching ₹846 from ₹315. Over four years, it has delivered a 1,963% return. Elara Capital initiated coverage with a 'buy' rating and a target price of ₹1,370, citing the company's strong position in India's ₹293 billion geospatial market. Analysts project a 53.9% revenue CAGR for FY24-27E based on a robust order book and strategic contracts.",
            "Sentiment": "positive",
            "PublishDate": 1732612421000,
            "Source": "normal_news"
        },
        {
            "Title": "Genesys International: Elara Initiates Coverage with 81% Upside",
            "Summary": "Elara Capital initiates coverage on Genesys International with a 'buy' rating and Rs 1,370 target price. The geospatial solutions provider's stock surged over 10% on the news. Elara cites Genesys' leadership in India's growing geospatial market, technological advancements, and strong order book of Rs 3,900 crore as key factors. The firm projects 54% revenue CAGR for FY24-27.",
            "Sentiment": "positive",
            "PublishDate": 1732529637000,
            "Source": "normal_news"
        },
        {
            "Title": "Genesys International: Strategic Partnership with SatSure for Enhanced Geospatial Solutions",
            "Summary": "Genesys International and SatSure announced a partnership on October 30 to develop integrated geospatial solutions for aviation, forestry, disaster management, and utilities. The collaboration combines Genesys' 3D Digital Twin mapping with SatSure's satellite remote sensing and AI capabilities. Genesys International's stock rose 8.91% to ₹824.80 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1730271864000,
            "Source": "normal_news"
        },
        {
            "Title": "Genesys International Partners with SatSure for Enhanced Geospatial Solutions",
            "Summary": "Genesys International has formed a partnership with SatSure to improve geospatial solutions across various sectors including aviation, forestry, disaster management, and utilities. This collaboration aims to leverage both companies' expertise to provide advanced geospatial services.",
            "Sentiment": "positive",
            "PublishDate": 1730268328000,
            "Source": "corporate_action"
        },
        {
            "Title": "Genesys International Reports Profitable Q2 FY2024",
            "Summary": "Genesys International Corporation has reported a significant turnaround in its financial performance for Q2 FY2024. The company posted a consolidated net profit of 111 million rupees, compared to a loss of 34 million rupees in the same quarter last year. This represents a quarter-on-quarter increase from 53 million rupees profit. Revenue for the quarter stood at 720 million rupees, more than doubling from 332 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1730119498000,
            "Source": "result"
        }
    ]
}