{
    "Symbol": "GENUSPAPER",
    "ISIN": "INE949P01018",
    "News": [
        {
            "Title": "Genus Paper Boards Inter-se Share Transfer Disclosed",
            "Summary": "Genus Paper & Boards Limited disclosed inter-se transfer of equity shares among promoter group members under SEBI regulations, maintaining overall promoter holding at 50.84%.",
            "Sentiment": "neutral",
            "PublishDate": 1765781216567,
            "Source": "co_actions_results"
        },
        {
            "Title": "Genus Paper Boards Promoter Kailash Chandra Agarwal Reduces Stake Through Inter-se Transfer",
            "Summary": "Kailash Chandra Agarwal transferred 54,59,007 equity shares (2.123% stake) in Genus Paper Boards Limited to Parul Agarwal through inter-se transfer, reducing his individual holding from 5.172% to 3.049%. The promoter group's overall shareholding remains unchanged at 50.840% of the company's total paid-up capital of 257,125,940 equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764306945142,
            "Source": "corporate_action"
        },
        {
            "Title": "Genus Paper Boards Promoter Group Executes Inter-se Share Transfer of 3.25% Stake",
            "Summary": "Genus Paper Boards Limited promoter group completed an inter-se transfer of 83,65,444 equity shares (3.25% stake) between November 17-20, 2025, with Ishwar Chand Agarwal reducing his holding while other promoter entities increased theirs. The transaction maintains overall promoter group shareholding at 50.84% of the company's total equity capital of 25,71,25,940 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763971265013,
            "Source": "corporate_action"
        },
        {
            "Title": "Genus Paper Boards Reports Strong Q2 Performance with 156% Jump in Consolidated Profit",
            "Summary": "Genus Paper Boards Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. On a consolidated basis, the company reported revenue from operations of Rs. 24,449.26 lakhs for the quarter, compared to Rs. 21,108.64 lakhs in the same quarter last year. Profit after tax increased significantly to Rs. 382.04 lakhs from Rs. 42.44 lakhs loss in the corresponding quarter of the previous year. For the half-year period, consolidated revenue reached Rs. 49,994.69 lakhs versus Rs. 42,195.07 lakhs in the previous year, with profit after tax of Rs. 656.05 lakhs compared to Rs. 240.48 lakhs last year. On standalone basis, the company posted quarterly revenue of Rs. 24,260.97 lakhs and profit after tax of Rs. 449.28 lakhs. The company operates in three segments: Paper Business, Coke Business through its wholly-owned subsidiary Genus Paper and Coke Limited, and Strategic Investment Activity. The results were approved by the Board of Directors at their meeting held on November 13, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763030293620,
            "Source": "earnings"
        },
        {
            "Title": "Genus Paper & Boards Reports Q1 FY26 Results, Appoints New Executive Director",
            "Summary": "Genus Paper & Boards Limited announced its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 25,057.35 lakhs compared to Rs 20,629.23 lakhs in the same quarter last year. Profit after tax increased to Rs 415.99 lakhs from Rs 294.93 lakhs year-on-year. On a consolidated basis, total income reached Rs 25,548.24 lakhs versus Rs 21,094.12 lakhs in the previous year, with profit after tax of Rs 274.01 lakhs compared to Rs 282.91 lakhs. The company also appointed Mr. Sanjay Kumar Agarwal as Additional Director in the category of Executive Whole-Time Director for a three-year term, subject to shareholder approval. Agarwal, who has been with the company since 2004 and serves as CFO since 2014, is a Fellow Member of the Institute of Chartered Accountants of India with over 24 years of experience in accounts, finance, taxation, and corporate governance.",
            "Sentiment": "positive",
            "PublishDate": 1754990106693,
            "Source": "earnings"
        },
        {
            "Title": "Genus Paper & Boards Reports Q3 EBITDA Growth",
            "Summary": "Genus Paper & Boards has reported an increase in its Q3 EBITDA to 171 million rupees, up from 143 million rupees in the same quarter last year. However, the company's EBITDA margin decreased to 8.03% from 9.23% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739368429000,
            "Source": "earnings"
        },
        {
            "Title": "Genus Paper & Boards Reports Profit in Q3 FY2024",
            "Summary": "Genus Paper & Boards has reported a consolidated net profit of 5 million rupees in the third quarter, compared to a loss of 1 million rupees in the same period last year. The company's revenue increased to 2.13 billion rupees from 1.55 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739368419000,
            "Source": "earnings"
        },
        {
            "Title": "Genus Paper & Boards Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Genus Paper & Boards experienced a decrease in both EBITDA and EBITDA margin for Q2. The company's EBITDA fell to 149 million rupees from 191.9 million rupees year-over-year. The EBITDA margin also declined to 7.06% from 9.89% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731592799000,
            "Source": "result"
        },
        {
            "Title": "Genus Paper & Boards Reports Q2 Revenue Growth",
            "Summary": "Genus Paper & Boards has announced its second quarter revenue for the current fiscal year. The company reported revenue of 2.1 billion rupees, compared to 1.9 billion rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731592576000,
            "Source": "result"
        },
        {
            "Title": "Genus Paper & Boards Reports Q2 Net Loss",
            "Summary": "Genus Paper & Boards reported a consolidated net loss of 4.2 million rupees in the second quarter, compared to a profit of 41 million rupees in the same quarter last year. However, this represents an improvement from the previous quarter, where the company had a profit of 28 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1731592533000,
            "Source": "result"
        }
    ]
}