{
    "Symbol": "GENUSPOWER",
    "ISIN": "INE955D01029",
    "News": [
        {
            "Title": "Genus Power Q3 & 9MFY26 Earnings Call on Feb 11",
            "Summary": "Genus Power Infrastructures schedules earnings call for February 11, 2026 at 3:00 PM IST to discuss Q3 and nine-months FY26 operational and financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1770354441368,
            "Source": "stocks"
        },
        {
            "Title": "Genus Power Sets Record Date for Demerger Scheme",
            "Summary": "Genus Power Infrastructures Limited has fixed February 6, 2026, as the record date for determining shareholder entitlements under its demerger scheme with Genus Prime Infra Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1769164424817,
            "Source": "co_actions_results"
        },
        {
            "Title": "Genus Power Acquires 86.49% Stake in Newlectric Innovation",
            "Summary": "Genus Power Infrastructures Limited signed agreement to acquire 86.49% equity stake in Newlectric Innovation Private Limited for ₹25.23 crores, making it wholly-owned subsidiary within 30 days.",
            "Sentiment": "positive",
            "PublishDate": 1768919325216,
            "Source": "co_actions_results"
        },
        {
            "Title": "Genus Power's Auditor Firm Converts to LLP Structure",
            "Summary": "Genus Power Infrastructures announces that its joint statutory auditor M S K A & Associates has converted to Limited Liability Partnership structure effective January 13, 2026, continuing audit obligations.",
            "Sentiment": "neutral",
            "PublishDate": 1768481160884,
            "Source": "stocks"
        },
        {
            "Title": "5 Strong Small-Cap Stocks Trading at Deep Discounts",
            "Summary": "Genus Power Infrastructures and 4 other fundamentally strong small-cap stocks are trading 31-54% below their 52-week highs, presenting potential value opportunities for investors in current volatile market conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1767935148702,
            "Source": "stocks"
        },
        {
            "Title": "Genus Power Promoters File Revised Share Encumbrance Disclosure",
            "Summary": "Genus Power Infrastructure Limited's promoters submitted a revised disclosure regarding share encumbrance under SEBI takeover regulations, updating their previous filing from November 24, 2025 to specify the entity names in whose favor shares are encumbered. The disclosure covers multiple promoter entities including Kailash Chandra Agarwal and family members, with shares pledged to entities including Gemview Investment Pte. Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1765021347239,
            "Source": "corporate_action"
        },
        {
            "Title": "Genus Power Promoters Complete Inter-Se Transfer of 88.14 Lakh Shares",
            "Summary": "Promoters of Genus Power Infrastructures Limited executed inter-se transfers and open market transactions involving 88.14 lakh shares between March 14, 2025 and November 24, 2025. The promoter group's total shareholding remains at 39.36% of the company's equity capital of 30.41 crore shares, with transactions disclosed under SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764062201313,
            "Source": "corporate_action"
        },
        {
            "Title": "CRISIL Reaffirms Genus Power's Credit Ratings, Enhances Bank Loan Facilities to Rs. 4,927 Crore",
            "Summary": "CRISIL Ratings has reaffirmed Genus Power Infrastructures' long-term rating at CRISIL AA-/Stable and short-term rating at CRISIL A1, while enhancing total bank loan facilities from Rs. 3,861.66 crore to Rs. 4,927 crore. The rating agency also reaffirmed the CRISIL A1+ rating on the company's Rs. 100 crore commercial paper programme, indicating very strong degree of safety for timely payment of financial obligations.",
            "Sentiment": "positive",
            "PublishDate": 1763711688056,
            "Source": "stock"
        },
        {
            "Title": "Genus Power Reports 136% Revenue Jump, Raises FY26 Guidance to Rs 4,500 Crores",
            "Summary": "Genus Power's quarterly results showed standalone revenue surging 136% to Rs 1,149 crores with EBITDA more than tripling to Rs 244 crores, driven by progress in smart metering projects transitioning to operational phases. The company revised its FY26 revenue guidance upward from Rs 4,000 crores to Rs 4,500 crores with 20% EBITDA margins, while maintaining a 25% market share in the expanding smart meter sector under the RDSS scheme.",
            "Sentiment": "positive",
            "PublishDate": 1763174156095,
            "Source": "earnings"
        },
        {
            "Title": "Genus Power Infrastructures Reports Strong Q2 Growth with Net Profit Rising 154% Year-on-Year",
            "Summary": "Genus Power Infrastructures delivered robust quarterly results with net profit surging to 1.48 billion rupees from 583 million rupees in the same period last year. Revenue more than doubled to 11.5 billion rupees compared to 4.9 billion rupees year-on-year. EBITDA increased significantly to 2.44 billion rupees from 813.7 million rupees, while EBITDA margin improved to 21.27% from 16.71% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762475091914,
            "Source": "earnings"
        },
        {
            "Title": "Genus Power Reports Full Utilization of Rs 519 Crore Preferential Issue Proceeds",
            "Summary": "Genus Power Infrastructures Limited has fully utilized the proceeds from its preferential issue of share warrants worth Rs 519 crore. The company raised funds through 4.59 crore share warrants at Rs 112.88 per warrant during August-September 2023. The funds were deployed across three objectives: Rs 350 crore for investment in related parties for AMISP projects, Rs 150 crore for expanding smart meter manufacturing and working capital requirements, and Rs 19 crore for general corporate purposes. India Ratings Research Private Limited, serving as the monitoring agency, reported no deviation from the stated objects in their quarterly monitoring report. The company invested Rs 142.52 crore during the quarter in related party loans for AMISP projects across various subsidiaries including Genus Assam Package-4 SPV Limited and Maharashtra Akola Amaravati Smart Metering Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1762443272425,
            "Source": "corporate_action"
        },
        {
            "Title": "Genus Power Reports 15% Rise in Quarterly Net Profit to ₹148 Crore",
            "Summary": "Genus Power Infrastructures Limited reported net profit of ₹148.15 crore for the quarter ended September 30, 2025, compared to ₹128.49 crore in the previous quarter. Revenue from operations increased to ₹1,349 crore from ₹1,394 crore in the prior quarter. For the half-year period, net profit reached ₹276.64 crore versus ₹100.63 crore in the corresponding period last year. The company's total order book stands at ₹28,758 crore as of September 30, 2025, excluding taxes. During the quarter, the company issued equity shares to employees under stock option schemes. The Directorate of Enforcement conducted a search under the Prevention of Money Laundering Act at the company's corporate office and Chairman's residence in December 2024, with the company extending full cooperation.",
            "Sentiment": "positive",
            "PublishDate": 1762431185101,
            "Source": "earnings"
        },
        {
            "Title": "Genus Power Infrastructures Forms Employee Stock Option Trust",
            "Summary": "Genus Power Infrastructures Limited has established the 'Genus Employees Trust' to administer and implement its Employee Stock Option Plan 2019. The company executed a Trust Deed on October 28, 2025, with an initial corpus of Rs. 10,000. The trust is designed to acquire company shares through subscription or secondary market purchases and transfer them to eligible employees under the stock option scheme. Two trustees have been appointed: Udit Agarwal and Vikalp Sharma. The trust will operate as an irrevocable employee welfare trust in compliance with SEBI regulations for share-based employee benefits. The trust is authorized to hold shares, manage funds, and facilitate employee stock option exercises while being prohibited from voting on shares held or engaging in derivatives trading.",
            "Sentiment": "positive",
            "PublishDate": 1761654296223,
            "Source": "corporate_action"
        },
        {
            "Title": "Genus Power Expects to Exceed FY26 Margin Guidance on Strong Order Book",
            "Summary": "Genus Power Infrastructures is confident of surpassing its Ebitda margin guidance of 18-19% for FY26, driven by a robust order book. Joint MD Jitendra Kumar Agarwal stated the company expects to exceed its Rs 4,000 crore revenue guidance for the current financial year. The company anticipates 30-40% year-on-year revenue growth over the next three years. Genus Power's current order book stands at approximately Rs 29,000 crore, with Rs 2,000 crore from direct supply orders and Rs 27,000 crore from its AMISP business. Within the AMISP segment, 80% of revenue flows back under EPC, with 55-60% for meter supply and installation to be executed within two to three years, and 40% for Operations and Maintenance over seven to eight years. The company addressed high working capital concerns, explaining it's temporary due to their business model, with a funding platform called Gemstar created with Singapore's GIC. Agarwal expects positive cash flow by the end of the financial year as projects achieve operational efficiency. Shares closed flat at Rs 324.7.",
            "Sentiment": "positive",
            "PublishDate": 1757553463904,
            "Source": "stock"
        },
        {
            "Title": "Genus Power Denies Project Termination and Blacklisting Claims, Reports Strong Order Book",
            "Summary": "Genus Power has denied reports of termination of its Rajasthan project and blacklisting in Goa. The company confirmed it maintains a robust domestic order book and is making progress in smart metering initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1756458257900,
            "Source": "stock"
        },
        {
            "Title": "Genus Power Reports 128% Revenue Growth, Maintains FY26 Guidance Above Rs 4,000 Crores",
            "Summary": "Genus Power Infrastructures reported strong quarterly results with revenue of Rs 942 crores, representing 128% year-on-year growth. EBITDA reached Rs 199 crores with a margin of 21.2%, while PAT grew to Rs 128 crores with a 13.6% margin. The company installed 16 lakh smart meters during the quarter, bringing cumulative installations to 45 lakh meters. Genus maintains its order book at Rs 29,321 crores, providing 8-10 year revenue visibility. The company reaffirmed its FY26 guidance of revenue exceeding Rs 4,000 crores with an 18% EBITDA margin. Management targets installing 80-90 lakh smart meters in FY26 and 1.1-1.2 crore in FY27. The company faces challenges from elevated working capital requirements and higher finance costs during the project ramp-up phase. Genus is expanding into water meters, gas meter solutions, and international markets including ANZ, Middle East, Southeast Asia, and Africa.",
            "Sentiment": "positive",
            "PublishDate": 1755601705056,
            "Source": "earnings"
        },
        {
            "Title": "Genus Power Infrastructures Uploads Audio Recording of Q1 FY26 Investor Call",
            "Summary": "Genus Power Infrastructures Limited has uploaded the audio recording of their investor/analyst conference call discussing unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company filed this intimation on August 11, 2025, under SEBI listing regulations. The audio recording is available on the company's website, and the transcript will be shared with stock exchanges and uploaded on the company website. The filing was signed by Puran Singh Rathore, Joint Company Secretary & Compliance Officer. The company is listed on BSE (code: 530343) and NSE (symbol: GENUSPOWER).",
            "Sentiment": "neutral",
            "PublishDate": 1754915628083,
            "Source": "earnings"
        },
        {
            "Title": "Genus Power Infrastructures Reports Strong Q1 Growth with Net Profit Rising to 1.28 Billion Rupees",
            "Summary": "Genus Power Infrastructures delivered robust quarterly results with net profit surging to 1.28 billion rupees compared to 424 million rupees in the same period last year. Revenue more than doubled to 9.42 billion rupees from 4.14 billion rupees year-over-year. EBITDA increased significantly to 1.99 billion rupees versus 632 million rupees previously, while EBITDA margin improved to 21.17% from 15.27% in the comparable period.",
            "Sentiment": "positive",
            "PublishDate": 1754872020804,
            "Source": "earnings"
        },
        {
            "Title": "Genus Power Reports Strong Q1 Results with Revenue of Rs 942 Crores and Net Profit of Rs 128 Crores",
            "Summary": "Genus Power Infrastructures Limited reported quarterly results with revenue from operations of Rs 94,242.27 lakhs and net profit of Rs 12,848.82 lakhs from continuing operations. The company's consolidated results showed revenue of Rs 94,242.27 lakhs with net profit of Rs 13,732.23 lakhs. The company completed a demerger of its Strategic Investment Division to Genus Prime Infra Limited, which has been presented as discontinued operations. Genus Power now focuses solely on metering business and related services. The company reported a total executable order book of Rs 29,321 crores as of June 30, 2025, including Rs 27,448 crores from joint venture agreements through Gemstar Infra Pte. Ltd. Basic earnings per share stood at Rs 4.23 for standalone operations and Rs 4.97 for consolidated operations. The Directorate of Enforcement conducted a search at the company's corporate office and chairman's residence in December 2024, with management stating full cooperation was provided.",
            "Sentiment": "positive",
            "PublishDate": 1754653176343,
            "Source": "earnings"
        },
        {
            "Title": "Genus Power Infrastructure: GIC Affiliate's ₹650 Crore Block Deal Called Off",
            "Summary": "Chiswick Investment Pte. Ltd, an affiliate of Singapore's GIC, cancelled a planned block deal to sell up to 5.8% stake in Genus Power Infrastructure. The deal was valued at ₹650 crore with a floor price of ₹360 per share. Genus Power's shares declined 1.42% to ₹379.65 in early trading on June 13.",
            "Sentiment": "negative",
            "PublishDate": 1749788064000,
            "Source": "block_deals"
        },
        {
            "Title": "Genus Power Infrastructures: GIC Affiliate Launches ₹400 Crore Block Deal",
            "Summary": "Chiswick Investment Pte. Ltd, affiliated with GIC, is selling a 3.6% stake in Genus Power Infrastructures with an option to increase to 5.88%. The base deal is valued at ₹400 crore, potentially reaching ₹650 crore. The floor price is set at ₹360 per share, a 6.5% discount to the last closing price.",
            "Sentiment": "neutral",
            "PublishDate": 1749747184000,
            "Source": "block_deals"
        },
        {
            "Title": "Genus Power Provides Conservative EBITDA and Revenue Guidance",
            "Summary": "Genus Power has provided guidance for its EBITDA levels at 4.5 times, which is considered conservative. The company is also maintaining its guidance of 18% for the financial year 2026, which is also viewed as conservative. This information was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1748921759000,
            "Source": "default"
        },
        {
            "Title": "Genus Power Provides Long-Term Guidance and Growth Strategy",
            "Summary": "Genus Power has provided long-term guidance for 8-10 years due to the nature of their business in supplying and maintaining meters. The company is targeting a top line of INR4,000 crores for FY26, representing a year-on-year growth of almost 60%, with EBITDA margins of 18%. They are hesitant to provide quarter-on-quarter guidance due to unpredictable factors like weather conditions affecting installation rates. The company's cost control measures, backward integration of software, and forward integration of end-to-end solutions are expected to contribute to achieving the guided margins.",
            "Sentiment": "positive",
            "PublishDate": 1748921754000,
            "Source": "default"
        },
        {
            "Title": "Genus Power Infrastructure: Q4 Profit More Than Doubles, Shares Hit Six-Month High",
            "Summary": "Genus Power Infrastructure's Q4 profit rose to Rs 123 crore from Rs 24.3 crore year-on-year. Revenue nearly doubled to Rs 937 crore. Operational profitability increased to Rs 196 crore with margins expanding to 21%. The company's order book stands at Rs 30,110 crore as of March 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1748839176000,
            "Source": "earnings"
        },
        {
            "Title": "Genus Power Infrastructures Reports Significant Profit and Revenue Growth in Q4",
            "Summary": "Genus Power Infrastructures has reported a substantial increase in both net profit and revenue for the fourth quarter. The company's net profit rose to 1.3 billion rupees, up from 314 million rupees year-over-year and 682 million rupees quarter-over-quarter. Revenue also saw a significant increase, reaching 9.4 billion rupees compared to 4.2 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748823153000,
            "Source": "default"
        },
        {
            "Title": "Genus Power Infra Reports Substantial Order Book of Rs 30,110 Crore",
            "Summary": "Genus Power Infra has announced that its total order book, including all SPVs and GIC platform, stands at approximately Rs 30,110 crore as of March 31. The company provided this update on its current business position, indicating a significant volume of pending orders and potential future revenue.",
            "Sentiment": "positive",
            "PublishDate": 1748692294000,
            "Source": "default"
        },
        {
            "Title": "Genus Power Infrastructures: Q4 Profit Surges 5x, Revenue Doubles",
            "Summary": "Genus Power Infrastructures reported a net profit of ₹123 crore in Q4FY25, up from ₹24.3 crore YoY. Revenue doubled to ₹936.8 crore, with EBITDA margins expanding to 20.95%. The company's growth is driven by its smart metering business, positioning it as a key player in India's evolving power distribution sector.",
            "Sentiment": "positive",
            "PublishDate": 1748617863000,
            "Source": "earnings"
        },
        {
            "Title": "Genus Power Infrastructures Reports Significant Profit and Revenue Growth in Q4",
            "Summary": "Genus Power Infrastructures has reported a substantial increase in both net profit and revenue for the fourth quarter. The company's net profit rose to 1.3 billion rupees, up from 314 million rupees year-over-year and 682 million rupees quarter-over-quarter. Revenue for Q4 increased to 9.4 billion rupees, compared to 4.2 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748610911000,
            "Source": "result"
        },
        {
            "Title": "Genus Power Infrastructures Subsidiary to Acquire 13% Stake in Durg Rajnandgaon Jagdalpur Smart Metering",
            "Summary": "A subsidiary of Genus Power Infrastructures is set to acquire a 13% stake in Durg Rajnandgaon Jagdalpur Smart Metering. This move suggests an expansion in the smart metering sector, potentially strengthening Genus Power's position in the infrastructure and power management industry.",
            "Sentiment": "positive",
            "PublishDate": 1742170347000,
            "Source": "corporate_action"
        },
        {
            "Title": "Genus Power Infrastructures Subsidiary to Acquire 13% Stake in Smart Metering Project",
            "Summary": "A subsidiary of Genus Power Infrastructures is set to acquire a 13% stake in the Durg Rajnandgaon Jagdalpur Smart Metering project. This move indicates the company's expansion in the smart metering sector, potentially strengthening its position in the infrastructure and power management industry.",
            "Sentiment": "positive",
            "PublishDate": 1741871572000,
            "Source": "corporate_action"
        },
        {
            "Title": "Genus Power Forecasts Significant Revenue Growth",
            "Summary": "Genus Power has provided revenue guidance of Rs. 2,500 crore for the current fiscal year. The company also projects a substantial increase of 30% to 40% in revenue for the following year, indicating strong growth expectations.",
            "Sentiment": "positive",
            "PublishDate": 1740121575000,
            "Source": "earnings"
        },
        {
            "Title": "Genus Power Infrastructures Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Genus Power Infrastructures has announced its financial results for the third quarter. The company's net profit increased substantially to 682 million rupees, compared to 135 million rupees in the same period last year. Revenue also saw a significant rise, reaching 6 billion rupees, up from 2.58 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739233360000,
            "Source": "earnings"
        },
        {
            "Title": "Genus Power Infrastructures Reports Significant Growth in Q3 EBITDA",
            "Summary": "Genus Power Infrastructures has reported a substantial increase in its Q3 EBITDA, rising to 1.17 billion rupees from 272 million rupees year-over-year. The company's EBITDA margin also improved significantly, reaching 19.33% compared to 10.53% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739192525000,
            "Source": "earnings"
        },
        {
            "Title": "Genus Power Infrastructures Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Genus Power Infrastructures has reported a substantial increase in both net profit and revenue for the third quarter. The company's net profit rose to 682 million rupees, up from 135 million rupees in the same period last year. Revenue also saw a significant jump, reaching 6 billion rupees compared to 2.58 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739192518000,
            "Source": "earnings"
        },
        {
            "Title": "Genus Power Infra to Consider Q3 Results on February 10",
            "Summary": "Genus Power Infra has announced that it will consider and approve its financial results for the third quarter on February 10. This indicates the company is preparing to disclose its performance for the most recent fiscal period to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1738583932000,
            "Source": "earnings"
        },
        {
            "Title": "Genus Power Infrastructures Begins Commercial Production at New Smart Meter Facility in Assam",
            "Summary": "Genus Power Infrastructures has announced the commencement of commercial production at its new smart electronic energy meter manufacturing facility in Assam. This development marks the company's expansion into a new geographical area and potentially increases its production capacity for smart meters.",
            "Sentiment": "positive",
            "PublishDate": 1734310829000,
            "Source": "corporate_action"
        },
        {
            "Title": "Genus Power Infrastructures Begins Commercial Production at New Smart Meter Facility in Assam",
            "Summary": "Genus Power Infrastructures has announced the commencement of commercial production at its new smart electronic energy meter manufacturing facility located in Assam. This development marks an expansion of the company's production capabilities in the smart metering sector.",
            "Sentiment": "positive",
            "PublishDate": 1734089151000,
            "Source": "corporate_action"
        },
        {
            "Title": "Enforcement Directorate Conducts Search at Genus Power Infrastructure",
            "Summary": "The Directorate of Enforcement conducted a search at Genus Power Infrastructure's corporate office and the chairman's residence. The company stated that its operations remained unaffected during this search.",
            "Sentiment": "neutral",
            "PublishDate": 1733357054000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Enforcement Directorate Conducts Search at Genus Power Infrastructure",
            "Summary": "The Directorate of Enforcement conducted a search at Genus Power Infrastructure's corporate office and the chairman's residence. Despite this action, the company reports that its operations remained unaffected.",
            "Sentiment": "neutral",
            "PublishDate": 1733316095000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Genus Power Infrastructures Reports Significant Q2 EBITDA Growth",
            "Summary": "Genus Power Infrastructures has reported a substantial increase in its Q2 EBITDA, rising to 813.7 million rupees from 245.2 million rupees year-over-year. The company's EBITDA margin also improved significantly, reaching 16.71% compared to 9.47% in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730192912000,
            "Source": "result"
        },
        {
            "Title": "Genus Power Infrastructures Reports Significant Revenue Growth in Q2",
            "Summary": "Genus Power Infrastructures has reported a substantial increase in its second-quarter revenue. The company's revenue for Q2 reached 4.9 billion rupees, compared to 2.6 billion rupees in the same period last year, representing a year-over-year growth of approximately 88%.",
            "Sentiment": "positive",
            "PublishDate": 1730192742000,
            "Source": "result"
        },
        {
            "Title": "Genus Power Infrastructures Reports Significant Profit Growth in Q2",
            "Summary": "Genus Power Infrastructures has reported a substantial increase in net profit for the second quarter. The company's net profit rose to 580 million rupees, up from 110 million rupees in the same quarter of the previous year, marking a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730192719000,
            "Source": "result"
        },
        {
            "Title": "Genus Power: Emkay Initiates 'Buy' with 25% Upside Target",
            "Summary": "<p><span class='positive'>Emkay Global Financial Services</span> initiated coverage on <span class='neutral'>Genus Power</span> with a <span class='positive'>'buy' rating</span> and a <span class='positive'>Rs 500 target price</span>, implying <span class='positive'>25% upside</span>. The stock <span class='positive'>rallied 10%</span> in two days, reaching <span class='neutral'>Rs 399.75</span>. <span class='neutral'>Genus Power's</span> order book stands at <span class='positive'>Rs 32,500 crore</span>, providing visibility for <span class='positive'>8-10 years</span>. The company is <span class='positive'>poised to benefit</span> from <span class='neutral'>India's smart meter installation drive</span> under the <span class='neutral'>Rs 3 trillion revamped distribution sector scheme</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728452165000,
            "Source": "normal_news"
        }
    ]
}