{
    "Symbol": "GEOJITFSL",
    "ISIN": "INE007B01023",
    "News": [
        {
            "Title": "Geojit Financial Q3FY26 Profit Drops 65% YoY to ₹127cr",
            "Summary": "Geojit Financial Services reported Q3FY26 consolidated profit of ₹127cr, down 64.5% YoY. Revenue declined 6.7% to ₹1.6B. Company recorded exceptional charges due to new Labour Codes implementation.",
            "Sentiment": "negative",
            "PublishDate": 1768568294260,
            "Source": "co_actions_results"
        },
        {
            "Title": "Geojit Q3FY26 Profit Drops 62% to ₹1,273 Cr YoY",
            "Summary": "Geojit Financial Services reported Q3FY26 net profit of ₹1,272.71 cr, down 64.5% YoY. Revenue fell 13.4% to ₹16,010.75 cr. Company recorded exceptional item of ₹895.88 cr due to new Labour Codes impact.",
            "Sentiment": "negative",
            "PublishDate": 1768567611859,
            "Source": "co_actions_results"
        },
        {
            "Title": "Porinju Veliyath Acquires 1.43% Stake in GeoJit",
            "Summary": "Equity Intelligence India Private Limited, led by Porinju V Veliyath, has acquired a 1.43% stake in GeoJit Financial Services during Q3, marking a significant investment move in the financial services sector.",
            "Sentiment": "positive",
            "PublishDate": 1768275526716,
            "Source": "co_actions_results"
        },
        {
            "Title": "Geojit Financial Board Meet Set for Jan 16",
            "Summary": "Geojit Financial Services has scheduled a board meeting on January 16, 2026, to review Q3 FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767954666401,
            "Source": "co_actions_results"
        },
        {
            "Title": "Geojit targets Nifty at 29,150 by Dec 2026",
            "Summary": "Geojit Financial Services revises Nifty50 target to 29,150 by December 2026, implying 12% YoY returns. Recommends 60% large-cap allocation amid improving domestic indicators and policy support.",
            "Sentiment": "positive",
            "PublishDate": 1767176108559,
            "Source": "stocks"
        },
        {
            "Title": "Geojit submits revised ICRA rating intimation to BSE",
            "Summary": "Geojit Financial Services filed revised intimation to BSE regarding ICRA's reaffirmation and withdrawal of A+ rating for Rs. 100 crore instruments, acknowledging one-day delay due to administrative oversight.",
            "Sentiment": "neutral",
            "PublishDate": 1767005680374,
            "Source": "stocks"
        },
        {
            "Title": "Geojit Financial Services Block Trade Worth ₹210.76 Cr",
            "Summary": "Geojit Financial Services witnessed a significant block trade on NSE involving 3.10 crore shares at ₹68 per share, totaling ₹210.76 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1765770715830,
            "Source": "co_actions_results"
        },
        {
            "Title": "Geojit Financial Services Seeks Shareholder Approval for New Nominee Director Appointment",
            "Summary": "Geojit Financial Services has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. P. Vishnuraj IAS as Nominee Director of KSIDC, replacing Mr. Mir Mohammed Ali IAS with effect from September 24, 2025. The e-voting process will run from November 15, 2025 to December 14, 2025, with results to be declared by December 16, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763132414537,
            "Source": "corporate_action"
        },
        {
            "Title": "Geojit Financial Services Independent Director Radhakrishnan Nair Retires After Completing Second Term",
            "Summary": "Geojit Financial Services Limited announced that Mr. Radhakrishnan Nair retired from his position as Independent Director effective October 24, 2025. His retirement follows the completion of his second three-year term, which began on October 25, 2022. The directorate change was communicated to BSE and NSE as part of regulatory disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1761320036385,
            "Source": "corporate_governance"
        },
        {
            "Title": "Geojit Financial Services Reports 60% Decline in Q2 Net Profit",
            "Summary": "Geojit Financial Services reported a net profit of 223.7 million rupees for Q2, representing a significant decrease from 560.3 million rupees in the same period last year. The company's revenue also declined to 1.7 billion rupees compared to 2.18 billion rupees year-over-year. Both key financial metrics showed substantial declines in the quarterly performance.",
            "Sentiment": "negative",
            "PublishDate": 1761179467091,
            "Source": "earnings"
        },
        {
            "Title": "GeoJit Financial Outlines Growth Strategy Through Digital Wealth Platform and Market Expansion",
            "Summary": "GeoJit Financial has outlined its growth strategy focusing on several key areas. The company aims to develop a digital wealth management system and increase recurring assets under management (AUM). The firm plans to expand operations in the Gulf Cooperation Council (GCC) region while focusing on alternative investments. GeoJit intends to scale operations through technology-driven financial planning services and grow its Portfolio Management Services (PMS) and Alternative Investment Fund (AIF) offerings. The company is targeting clients in Tier-II and Tier-III cities as part of its expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1760969997981,
            "Source": "stock"
        },
        {
            "Title": "Geojit Financial Services Reports Q2 FY26 Results; Executive Director A Balakrishnan Retires After 27 Years",
            "Summary": "Geojit Financial Services Limited announced its quarterly results for the quarter ended September 30, 2025. On a consolidated basis, the company reported total revenue from operations of Rs 16,980.44 lakhs compared to Rs 21,845.77 lakhs in the same quarter last year. Profit after tax stood at Rs 2,218.37 lakhs versus Rs 5,558.23 lakhs in the corresponding quarter of the previous year. For the six-month period, consolidated revenue was Rs 32,295.71 lakhs against Rs 39,952.59 lakhs last year, with profit after tax at Rs 4,948.09 lakhs compared to Rs 10,012.26 lakhs. The company announced the retirement of Executive Director A Balakrishnan effective October 20, 2025, after serving for over twenty-seven years. He was instrumental in building India's first online stock broking platform at Geojit and will continue as an Advisor. Jayakrishnan Sasidharan, who joined in June 2025, will take over executive leadership responsibilities. The Board also decided to conduct a postal ballot for the appointment of Vishnuraj P as Nominee Director of Kerala State Industrial Development Corporation Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1760961338787,
            "Source": "earnings"
        },
        {
            "Title": "Geojit Financial Services Appoints New KSIDC Nominee Director",
            "Summary": "Geojit Financial Services Limited appointed Mr. Vishnuraj P IAS as a Nominee Director representing Kerala State Industrial Development Corporation Limited (KSIDC), effective September 24, 2025. He replaces Mr. Mir Mohammed Ali IAS on the company's board. Mr. Vishnuraj P is a 2019 batch Indian Administrative Service officer serving as Managing Director of KSIDC and Director of Department of Industries & Commerce. He holds a B.Tech from NIT Calicut, M.P.M. from JNU, and LL.M. from NLU Delhi. He has served in various administrative roles including Assistant Collector Malappuram, Sub Collector Ernakulam, and Director positions in PWD, PIEMD, and Sports & Youth Affairs. The appointment follows KSIDC's nomination through a letter dated September 23, 2025. Mr. Vishnuraj P is not related to any directors, key managerial personnel, or promoters of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1758716179731,
            "Source": "corporate_governance"
        },
        {
            "Title": "BNP Paribas Sells 5.79 Million Shares in Geojit Financial Services, Reduces Stake to 22.36%",
            "Summary": "BNP Paribas S.A. sold 5,789,000 equity shares of Geojit Financial Services Limited through open market transactions on the National Stock Exchange between June 4th and July 29th, 2025. The sale reduced BNP Paribas' shareholding from 24.43% to 22.36% of the total share capital. BNP Paribas, identified as a promoter of Geojit Financial Services, disposed of 2.07% of the company's voting rights through this transaction. Geojit Financial Services has an equity share capital of INR 279,025,452 consisting of 279,025,452 equity shares of INR 1 each. The disclosure was made under SEBI regulations governing substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1753935619063,
            "Source": "corporate_action"
        },
        {
            "Title": "Geojit Financial Services Reports Decline in Q1 Results",
            "Summary": "Geojit Financial Services has reported its quarterly results. The consolidated net profit for Q1 was 277 million rupees, down from 445 million rupees in the same quarter last year. Revenue also decreased to 1.5 billion rupees from 1.81 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1752625052000,
            "Source": "default"
        },
        {
            "Title": "Geojit Financial Services: Q1 Net Profit Drops 37% to ₹29 Crore",
            "Summary": "Geojit Financial Services reported a 37% year-on-year decline in Q1 FY2026 consolidated net profit to ₹28.67 crore. Revenue fell 15% to ₹153.30 crore. The company plans to transfer its securities business to its wholly owned subsidiary, Geojit Investments Ltd, on March 21, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1752609030000,
            "Source": "earnings"
        },
        {
            "Title": "Geojit Financial Services Reports Decline in Q1 Financial Results",
            "Summary": "Geojit Financial Services has reported its Q1 consolidated net profit at 277 million rupees, down from 445 million rupees in the same quarter last year. The company's Q1 revenue also decreased to 1.5 billion rupees from 1.81 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1752580320000,
            "Source": "result"
        },
        {
            "Title": "GeoJit Financial to Review Q1 Results on July 15",
            "Summary": "GeoJit Financial has announced plans to review its first quarter (Q1) results on July 15. The company has scheduled a meeting to discuss and analyze the financial performance for the most recent quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1751977230000,
            "Source": "default"
        },
        {
            "Title": "Geojit Financial Services: Revenue Down, AUM Milestone Achieved",
            "Summary": "Geojit Financial Services reported a 15% decrease in Q4 revenue to ₹177.48 crore and a 38% drop in net profit to ₹32.21 crore. FY25 saw a 15% rise in consolidated net profit to ₹172.49 crore. The company's AUM crossed ₹1 lakh crore. A final dividend of ₹1.50 per share was approved for FY25. Geojit Private Wealth received in-principle approval to operate in Dubai International Financial Centre.",
            "Sentiment": "neutral",
            "PublishDate": 1747913027000,
            "Source": "earnings"
        },
        {
            "Title": "Geojit Financial Services Reports Q4 Results and Dividend Recommendation",
            "Summary": "Geojit Financial Services has announced its quarterly results and dividend recommendation. The company's consolidated net profit for Q4 was 311 million rupees, compared to 505.8 million rupees year-over-year and 359 million rupees quarter-over-quarter. Q4 revenue stood at 1.8 billion rupees, down from 2.08 billion rupees year-over-year. The company has recommended a dividend of 1.5 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1747839271000,
            "Source": "result"
        },
        {
            "Title": "Geojit Financial Services to Invest in Unit's Convertible Debentures and Shares",
            "Summary": "Geojit Financial Services has announced plans to subscribe to convertible debentures worth up to 1 billion rupees and shares worth up to 850 million rupees issued by its subsidiary unit. This investment demonstrates the company's commitment to supporting and expanding its subsidiary operations.",
            "Sentiment": "positive",
            "PublishDate": 1742470615000,
            "Source": "corporate_action"
        },
        {
            "Title": "Geojit Financial Services Approves Non-Convertible Debentures Worth 100 Crore",
            "Summary": "Geojit Financial Services has approved the issuance of Non-Convertible Debentures (NCDs) worth 100 crore rupees. This decision represents a significant financial move for the company, potentially aimed at raising capital or refinancing existing debt.",
            "Sentiment": "neutral",
            "PublishDate": 1742460188000,
            "Source": "corporate_action"
        },
        {
            "Title": "Geojit Financial Services: Securities Business Transfer to Subsidiary Set for March 21",
            "Summary": "Geojit Financial Services will transfer its securities broking, margin financing, depository participant services, and research analyst business to its wholly owned subsidiary, Geojit Investments Ltd, on March 21, 2025. The transfer, structured as a slump sale, has received all necessary regulatory approvals. The securities business contributed ₹300.23 crore in revenue for FY23, representing 71.57% of Geojit's standalone turnover.",
            "Sentiment": "neutral",
            "PublishDate": 1740494752000,
            "Source": "corporate_action"
        },
        {
            "Title": "Geojit Financial Services Reports Q3 FY24 Financial Results",
            "Summary": "Geojit Financial Services announced its Q3 consolidated financial results. The company reported a net profit of 359 million rupees, compared to 369 million rupees in the same quarter last year and 560 million rupees in the previous quarter. Revenue for Q3 stood at 1.7 billion rupees, up from 1.5 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1738284255000,
            "Source": "earnings"
        },
        {
            "Title": "Geojit Financial Services Reports Q3 Financial Results",
            "Summary": "Geojit Financial Services announced its Q3 consolidated net profit of 359 million rupees, compared to 369 million rupees year-over-year and 560 million rupees quarter-over-quarter. The company's Q3 revenue increased to 1.7 billion rupees from 1.5 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738242221000,
            "Source": "earnings"
        },
        {
            "Title": "Geojit Financial Services to Consider Q3 Results",
            "Summary": "Geojit Financial Services has announced that it will consider its third quarter (Q3) financial results on January 30. This meeting is likely to review and potentially approve the company's performance for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737545985000,
            "Source": "earnings"
        },
        {
            "Title": "Geojit Financial Services to Transfer Securities Broking Business to Subsidiary",
            "Summary": "Geojit Financial Services has announced that its board has approved the transfer of its securities broking business to a subsidiary company. The company has entered into a business transfer agreement with GIL (presumably Geojit Investments Limited) for this purpose.",
            "Sentiment": "neutral",
            "PublishDate": 1734095042000,
            "Source": "corporate_action"
        },
        {
            "Title": "Geojit Financial Services: Q2 Profit Soars 53% YoY",
            "Summary": "Geojit Financial Services reported a 53% year-on-year increase in Q2 FY25 profit after tax to Rs 57.42 crore. Revenue rose by 50% to Rs 218.55 crore. Quarter-on-quarter, PAT grew by 25% and revenue by 21%.",
            "Sentiment": "positive",
            "PublishDate": 1729251870000,
            "Source": "result"
        },
        {
            "Title": "Geojit Financial Reports Strong PMS Performance",
            "Summary": "Geojit Financial Services has announced that their Portfolio Management Service (PMS) portfolios have consistently outperformed their respective benchmarks over an extended period. This indicates a successful long-term investment strategy and potentially strong returns for their clients.",
            "Sentiment": "positive",
            "PublishDate": 1729177971000,
            "Source": "result"
        },
        {
            "Title": "Geojit Financial Services Reports Strong Q2 Performance",
            "Summary": "Geojit Financial Services has reported significant year-over-year improvements in its Q2 financial results. The company's EBITDA increased to 941 million rupees from 568 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 43.05% from 39.44% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729157547000,
            "Source": "result"
        },
        {
            "Title": "Geojit Financial Services Reports Q2 Revenue Growth",
            "Summary": "Geojit Financial Services has announced its second quarter revenue of 2.1 billion rupees, compared to 1.44 billion rupees in the same quarter last year, representing a significant year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729157422000,
            "Source": "result"
        },
        {
            "Title": "Geojit Financial Services Reports Strong Q2 Profit Growth",
            "Summary": "Geojit Financial Services has reported a consolidated net profit of 560 million rupees for the second quarter, compared to 364 million rupees in the same period last year. This represents a significant year-over-year increase in profitability for the company.",
            "Sentiment": "positive",
            "PublishDate": 1729157357000,
            "Source": "result"
        },
        {
            "Title": "Geojit Financial Services to Consider Q2 Results on October 17",
            "Summary": "<p>Geojit Financial Services has announced a <span class='neutral'>board meeting</span> scheduled for <b>October 17</b> to <span class='neutral'>consider and approve</span> the company's <span class='neutral'>financial results</span> for the <b>second quarter</b> of the fiscal year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728475338000,
            "Source": "result"
        }
    ]
}