{
    "Symbol": "GESHIP",
    "ISIN": "INE017A01032",
    "News": [
        {
            "Title": "Great Eastern Shipping Declares Rs 9 Interim Dividend",
            "Summary": "Great Eastern Shipping Company announces Q3 FY26 results, declares third interim dividend of Rs 9 per share with record date February 4, 2026, and appoints new Lead Independent Director.",
            "Sentiment": "positive",
            "PublishDate": 1769700429107,
            "Source": "co_actions_results"
        },
        {
            "Title": "GE Shipping Delivers Kamsarmax Vessel Jag Aarati",
            "Summary": "The Great Eastern Shipping Company delivered its 2011-built Kamsarmax dry bulk carrier Jag Aarati to buyers, reducing fleet to 39 vessels totaling 3.14 mn dwt with additional transactions planned for Q4 FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1769153100469,
            "Source": "co_actions_results"
        },
        {
            "Title": "GE Shipping Takes Delivery of VLGC Jag Vijay",
            "Summary": "The Great Eastern Shipping Company took delivery of 2015-built Very Large Gas Carrier Jag Vijay with 84,048 cbm capacity on January 16, 2026. The vessel was financed entirely from internal accruals.",
            "Sentiment": "positive",
            "PublishDate": 1768567226489,
            "Source": "stocks"
        },
        {
            "Title": "Great Eastern Shipping Block Trade Worth ₹20.14 Cr",
            "Summary": "Great Eastern Shipping Company executed a significant block trade on NSE worth ₹20.14 crores involving 182,630 shares at ₹1,102.90 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767765474067,
            "Source": "co_actions_results"
        },
        {
            "Title": "GE Shipping Gets BWR AAA Rating Reaffirmed on NCDs",
            "Summary": "Brickwork Ratings reaffirmed BWR AAA/Stable rating on Great Eastern Shipping's ₹1,050 crore NCDs while withdrawing rating on ₹700 crore NCDs following full redemption.",
            "Sentiment": "positive",
            "PublishDate": 1767622519365,
            "Source": "stocks"
        },
        {
            "Title": "GE Shipping Expands Fleet with 51,565 DWT Tanker Acquisition",
            "Summary": "Great Eastern Shipping acquires secondhand tanker from South Korea, expanding owned fleet to 39 vessels with total capacity of 3.17 million DWT. Multiple vessel transactions planned for Q4 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1767181186514,
            "Source": "stocks"
        },
        {
            "Title": "G E Shipping Acquires Secondhand Medium Range Tanker",
            "Summary": "The Great Eastern Shipping Company Limited contracted to buy a secondhand Medium Range Tanker of 51,565 dwt on December 31, 2025. The 2013 South Korean built vessel will join the fleet in Q4 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1767179390122,
            "Source": "co_actions_results"
        },
        {
            "Title": "GE Shipping sells gas carrier 'Jag Vishnu' for ₹77,922 cbm",
            "Summary": "Great Eastern Shipping sells very large gas carrier Jag Vishnu built in 2002 with 77,922 cubic metre capacity, delivery in Q4 FY26, fleet to reduce to 39 vessels with additional transactions planned.",
            "Sentiment": "neutral",
            "PublishDate": 1766747812134,
            "Source": "co_actions_results"
        },
        {
            "Title": "NCLT Orders Dissolution of Greatship Oilfield Services",
            "Summary": "The National Company Law Tribunal has ordered the dissolution of Greatship Oilfield Services Limited following voluntary liquidation proceedings initiated by the company.",
            "Sentiment": "neutral",
            "PublishDate": 1766403464152,
            "Source": "co_actions_results"
        },
        {
            "Title": "Great Eastern Shipping Subsidiary GOSL Dissolved",
            "Summary": "The Great Eastern Shipping Company announces dissolution of Greatship Oilfield Services Limited (GOSL) by National Company Law Tribunal, completing voluntary liquidation process initiated in April 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766400926381,
            "Source": "stocks"
        },
        {
            "Title": "Great Eastern Shipping Buys Gas Carrier for Q4 FY26",
            "Summary": "Great Eastern Shipping Company announces acquisition of used Very Large Gas Carrier vessel, scheduled to join fleet operations in Q4 FY26, expanding maritime transportation capacity.",
            "Sentiment": "positive",
            "PublishDate": 1766149744973,
            "Source": "stocks"
        },
        {
            "Title": "GE Shipping Buys Gas Carrier, Expands Fleet to 40 Vessels",
            "Summary": "The Great Eastern Shipping Company acquired a secondhand Very Large Gas Carrier of 84,048 cbm capacity on December 19, 2025, expected to join fleet in Q4 FY26. Company operates at 100% capacity utilization.",
            "Sentiment": "positive",
            "PublishDate": 1766146943892,
            "Source": "co_actions_results"
        },
        {
            "Title": "Great Eastern Shipping Sells Bulk Carrier Vessel",
            "Summary": "Great Eastern Shipping contracts to sell 2011-built Kamsarmax dry bulk carrier 'Jag Aarati' to third party, with delivery expected in Q4 FY26. Fleet to reduce to 40 vessels post-sale.",
            "Sentiment": "neutral",
            "PublishDate": 1766035642649,
            "Source": "co_actions_results"
        },
        {
            "Title": "Great Eastern Shipping Block Trade Worth ₹78.23 Cr",
            "Summary": "Great Eastern Shipping Company executed a significant NSE block trade involving 707,304 shares at ₹1,106.00 per share, totaling ₹78.23 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1765514078883,
            "Source": "co_actions_results"
        },
        {
            "Title": "GE Shipping Delivers 2005-Built Medium Range Product Tanker Jag Pooja to Buyers",
            "Summary": "The Great Eastern Shipping Company Limited delivered its 2005-built Medium Range Product Tanker Jag Pooja to buyers, following a sale contract signed in October 2025. After this transaction, the company's current owned fleet stands at 40 vessels comprising 26 tankers and 14 dry bulk carriers, aggregating 3.32 million dwt.",
            "Sentiment": "neutral",
            "PublishDate": 1763634197434,
            "Source": "stock"
        },
        {
            "Title": "Great Eastern Shipping Reports Rs 581 Crore Net Profit in Q2FY26, Declares Rs 7.20 Interim Dividend",
            "Summary": "Great Eastern Shipping Company reported consolidated net profit of Rs 581 crore for Q2FY26 with NAV increasing by Rs 60 per share, declaring interim dividend of Rs 7.20. The company maintains strong cash position of Rs 550 million net cash while benefiting from improved crude tanker markets due to OPEC production cuts unwinding and Russian oil sanctions.",
            "Sentiment": "positive",
            "PublishDate": 1763126295982,
            "Source": "earnings"
        },
        {
            "Title": "Great Eastern Shipping Declares Second Interim Dividend of ₹7.20 Per Share",
            "Summary": "Great Eastern Shipping Co has announced a second interim dividend of ₹7.20 per share for FY 2025-26.",
            "Sentiment": "positive",
            "PublishDate": 1762529307700,
            "Source": "corporate_action"
        },
        {
            "Title": "Great Eastern Shipping Chairman K.M. Sheth Steps Down After 73 Years, Son Takes Over",
            "Summary": "The Great Eastern Shipping Company announced leadership changes effective November 9, 2025. K.M. Sheth will step down as Non-Executive Chairman and Board member due to age-related reasons after 73 years with the company. Sheth joined the company in 1952 at age 20, was appointed to the Board in 1970, and became Chairman Managing Director in 1992. The Board appointed him as Chairman Emeritus for life, an honorary position without remuneration, recognizing his role in building the company into India's largest private sector shipping company. Bharat K. Sheth, Deputy Chairman and Managing Director, will be re-designated as Chairman and Managing Director. Bharat K. Sheth joined the company in 1981, became Executive Director in 1989, and Managing Director in 1999. He is the son of K.M. Sheth and brother of Non-Executive Director Ravi K. Sheth.",
            "Sentiment": "positive",
            "PublishDate": 1762529259296,
            "Source": "corporate_governance"
        },
        {
            "Title": "Great Eastern Shipping Reports Mixed Q2 Results with Revenue Decline and Profit Growth",
            "Summary": "Great Eastern Shipping reported Q2 EBITDA of 7.3 billion rupees compared to 7.82 billion rupees in the same period last year. The company's EBITDA margin improved to 58.70% from 57.75% year-over-year. Consolidated net profit increased to 5.8 billion rupees versus 5.76 billion rupees in the previous year. However, revenue declined to 12.4 billion rupees from 13.54 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1762528801693,
            "Source": "earnings"
        },
        {
            "Title": "Great Eastern Shipping Signs Deal to Purchase Ultramax Dry Bulk Carrier",
            "Summary": "Great Eastern Shipping has entered into an agreement to purchase an Ultramax dry bulk carrier. The acquisition represents the company's expansion of its dry bulk fleet capacity.",
            "Sentiment": "positive",
            "PublishDate": 1761835227091,
            "Source": "stock"
        },
        {
            "Title": "Great Eastern Shipping Expands Fleet with New Suezmax Crude Carrier Acquisition",
            "Summary": "The Great Eastern Shipping Company has taken delivery of 'Jag Laadki,' a Suezmax crude carrier built in 2010 with a capacity of 164,716 DWT. The acquisition was financed entirely through internal funds. With this addition, the company's fleet has expanded to 41 vessels.",
            "Sentiment": "positive",
            "PublishDate": 1761817359932,
            "Source": "stock"
        },
        {
            "Title": "Great Eastern Shipping Sells 2005-Built Tanker Jag Pooja, Fleet Reduced to 40 Ships",
            "Summary": "Great Eastern Shipping has sold its 2005-built tanker vessel Jag Pooja to an unrelated buyer. The delivery of the vessel is expected by Q3 FY26. Following this transaction, the company's fleet size stands at 40 ships.",
            "Sentiment": "neutral",
            "PublishDate": 1760679316102,
            "Source": "stock"
        },
        {
            "Title": "Great Eastern Shipping Takes Delivery of Kamsarmax Dry Bulk Carrier 'Jag Anjali'",
            "Summary": "The Great Eastern Shipping Company Limited has completed delivery of a 2016-built Kamsarmax Dry Bulk Carrier named 'Jag Anjali' with a capacity of 81,922 dwt. The vessel acquisition was contracted in Q2 FY26 and has been financed entirely from internal accruals. The company's owned fleet now comprises 40 vessels, including 26 tankers and 14 dry bulk carriers, with a total capacity of 3.21 million dwt. Additionally, the company has contracted to purchase one secondhand Suezmax crude tanker and sell one secondhand Suezmax crude tanker in Q2 FY26, with both transactions expected to complete by Q3 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1760426534772,
            "Source": "stock"
        },
        {
            "Title": "Great Eastern Shipping Takes Delivery of Kamsarmax Dry Bulk Carrier 'Jag Amol'",
            "Summary": "The Great Eastern Shipping Company Limited has taken delivery of a 2015 built Kamsarmax Dry Bulk Carrier named 'Jag Amol' with a capacity of about 81,843 dwt. This acquisition was previously contracted in Q2 FY26 and was financed entirely from internal accruals. The company's owned fleet now comprises 39 vessels, including 26 tankers (5 crude carriers, 17 product tankers, 4 LPG carriers) and 13 dry bulk carriers, totaling 3.13 million dwt. The company has also contracted to purchase 1 secondhand Kamsarmax dry bulk carrier and 1 secondhand Suezmax crude tanker, while contracting to sell 1 secondhand Suezmax crude tanker, with these transactions expected to complete by Q3 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1758523266247,
            "Source": "stock"
        },
        {
            "Title": "Great Eastern Shipping Provides Rs 425 Crore Term Loan to Subsidiary Greatship India",
            "Summary": "The Great Eastern Shipping Company Limited has entered into a loan agreement with its wholly owned subsidiary, Greatship (India) Limited, for a term loan of Rs 425 crores. The loan carries an interest rate of 7.50% per annum payable quarterly, with a term of 2.5 years and prepayment options. The purpose is to enable Greatship India to prepay its existing External Commercial Borrowing facility with an outstanding amount of USD 70.9 million. The unsecured loan was executed on September 18, 2025, with no security provided. The transaction is conducted at arm's length basis, and promoters have no interest in the transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1758194716130,
            "Source": "stock"
        },
        {
            "Title": "Great Eastern Shipping Sells 2005-Built Suezmax Crude Tanker Jag Lok",
            "Summary": "The Great Eastern Shipping Company Limited has sold its 2005-built Suezmax crude tanker Jag Lok with a capacity of about 158,280 dwt to an unaffiliated third party. The vessel is scheduled for delivery by Q3 FY26. The company's fleet currently comprises 38 vessels totaling 3.04 million dwt, including 26 tankers and 12 dry bulk carriers. Great Eastern Shipping has also contracted to purchase 2 secondhand Kamsarmax dry bulk carriers and 1 Suezmax crude tanker in Q2 FY26, with all new vessels expected to join the fleet by Q3 FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1757933516281,
            "Source": "stock"
        },
        {
            "Title": "Great Eastern Shipping Acquires Suezmax Crude Carrier for Fleet Expansion",
            "Summary": "The Great Eastern Shipping Company Limited contracted to purchase a Suezmax Crude Carrier of approximately 164,715 dwt on August 25, 2025. The 2010-built vessel is expected to join the company's fleet in Q3 FY26. The company operates 38 vessels comprising 26 tankers and 12 dry bulk carriers totaling 3.04 million dwt, with capacity utilization close to 100%. The acquisition will be financed entirely from internal accruals for fleet expansion purposes. Including a previously contracted Kamsarmax Dry Bulk Carrier from July 2025, the company will have 40 vessels aggregating 3.29 million dwt after both deliveries.",
            "Sentiment": "positive",
            "PublishDate": 1756143191644,
            "Source": "stock"
        },
        {
            "Title": "GE Shipping May Receive Infrastructure Status to Ease Company Funding",
            "Summary": "GE Shipping could soon be granted infrastructure status, which would make funding easier for shipping companies. This potential designation would provide improved access to financing for the shipping sector.",
            "Sentiment": "positive",
            "PublishDate": 1755507466411,
            "Source": "stock"
        },
        {
            "Title": "Great Eastern Shipping Reports Q1 FY26 Results with 14th Consecutive Interim Dividend",
            "Summary": "The Great Eastern Shipping Company submitted transcripts of their Q1 FY26 earnings call held on August 1, 2025. The company declared its 14th consecutive interim dividend at Rs. 7.20 per share, representing a 27% payout on standalone earnings. Net profit was down significantly year-over-year but up versus Q4 FY25. Consolidated net asset value increased slightly quarter-on-quarter due to earnings accrual. Standalone net asset value stood at Rs. 1,120 per share, down from Rs. 1,181 a year ago but up from March levels. Crude tankers averaged $33,800 per day versus $46,000 in Q1 FY25, while product tankers dropped to under $25,000 from $37,000. LPG ships improved from $36,700 to $43,800, and bulk carriers declined from $18,000 to under $15,000. The company maintains net cash of approximately $600 million on standalone basis and $700 million on consolidated basis. All offshore rigs have secured contracts, with two rigs having short-term contracts starting after monsoon season. Management noted that 80% of shipping capacity remains exposed to spot markets, making earnings forecasts difficult due to market volatility.",
            "Sentiment": "neutral",
            "PublishDate": 1754460319388,
            "Source": "earnings"
        },
        {
            "Title": "Great Eastern Shipping Re-appoints Key Directors and Exempts Managing Director from Retirement by Rotation",
            "Summary": "The Great Eastern Shipping Company Limited announced multiple director re-appointments approved at its Annual General Meeting held on August 1, 2025. Mr. Ravi K. Sheth was re-appointed as Director, Mr. Shivshankar Menon as Independent Director for five years effective August 2, 2025, Mr. Bharat K. Sheth as Managing Director for five years effective April 1, 2026, and Mr. G. Shivakumar as Executive Director for five years effective November 14, 2025. The company also appointed M/s. Mehta & Mehta as Secretarial Auditors for five financial years from April 1, 2025. Additionally, shareholders approved an alteration to the Articles of Association exempting Mr. Bharat K. Sheth from retirement by rotation as long as he remains a Director. The AGM lasted from 3:00 p.m. to 3:59 p.m.",
            "Sentiment": "neutral",
            "PublishDate": 1754065188768,
            "Source": "corporate_governance"
        },
        {
            "Title": "Great Eastern Shipping Targets Double-Digit Returns Through Fleet Upgrades Despite Weak Freight Market",
            "Summary": "Great Eastern Shipping is focusing on maintaining double-digit returns by strengthening cash flows and upgrading its fleet. The company is pursuing growth opportunities while navigating challenging global freight market conditions that remain weak.",
            "Sentiment": "neutral",
            "PublishDate": 1753971657830,
            "Source": "stock"
        },
        {
            "Title": "Great Eastern Shipping Reports Q1 FY26 Net Profit of INR 505 Crores, Declares INR 7.20 Interim Dividend",
            "Summary": "The Great Eastern Shipping Company Limited reported consolidated net profit of INR 505 crores for Q1 FY26, compared to INR 812 crores in Q1 FY25. The company's consolidated revenue declined to INR 1,337 crores from INR 1,703 crores year-over-year. EBITDA decreased to INR 778 crores from INR 1,106 crores in the same period last year. The company declared its 14th consecutive quarterly interim dividend of INR 7.20 per share. Consolidated Net Asset Value stands at INR 1,431 per share as of June 30, 2025. The shipping segment saw reduced revenue days with 3,507 total revenue days compared to 3,873 in Q1 FY25, while offshore operations recorded 1,896 revenue days versus 1,956 in the previous year. Average Time Charter Yields showed mixed performance across vessel categories, with LPG carriers improving 19% year-over-year while crude and product carriers declined 27% and 33% respectively.",
            "Sentiment": "negative",
            "PublishDate": 1753970086052,
            "Source": "earnings"
        },
        {
            "Title": "Great Eastern Shipping Reports Decline in Q1 Earnings, Announces Interim Dividend",
            "Summary": "Great Eastern Shipping reported quarterly results showing a decline across key financial metrics. The company's EBITDA fell to 6.43 billion rupees from 9.78 billion rupees in the same period last year, while EBITDA margin decreased to 53.51% from 64.89%. Consolidated net profit dropped to 5.04 billion rupees compared to 8.12 billion rupees year-over-year. Revenue also declined to 12.01 billion rupees from 15.08 billion rupees. Despite the lower financial performance, the company recommended an interim dividend of 7.20 rupees per share.",
            "Sentiment": "negative",
            "PublishDate": 1753967072410,
            "Source": "corporate_action"
        },
        {
            "Title": "GE Shipping to Acquire 2015-Built Kamsarmax Dry Bulk Carrier",
            "Summary": "GE Shipping has announced plans to acquire a Kamsarmax dry bulk carrier that was built in 2015. The acquisition represents the company's expansion of its dry bulk shipping fleet.",
            "Sentiment": "positive",
            "PublishDate": 1753441280238,
            "Source": "order&deals"
        },
        {
            "Title": "Great Eastern Shipping Contracts to Purchase Kamsarmax Dry Bulk Carrier for Fleet Expansion",
            "Summary": "The Great Eastern Shipping Company Limited has contracted to purchase a Kamsarmax Dry Bulk Carrier of about 81,843 dwt. The 2015-built vessel is expected to join the company's fleet by Q3 FY26, expanding their fleet to 39 vessels with a total capacity of 3.13 mn dwt. The company's owned fleet comprises 38 vessels including 26 tankers and 12 dry bulk carriers aggregating 3.04 mn dwt, with capacity utilization close to 100%. The acquisition will be financed entirely from internal accruals for fleet modernization and expansion purposes.",
            "Sentiment": "positive",
            "PublishDate": 1753439887673,
            "Source": "stock"
        },
        {
            "Title": "Great Eastern Shipping: Dry Bulk Recovery Begins, Tanker Rates Remain Soft",
            "Summary": "GE Shipping reports a slight recovery in dry bulk shipping rates, while tanker markets remain weak. Offshore rig pricing has dropped significantly, with long-term rates down over 50% from late 2023. Short-term rig contracts are offering 50-60% higher rates than long-term deals.",
            "Sentiment": "neutral",
            "PublishDate": 1749018241000,
            "Source": "normal_news"
        },
        {
            "Title": "Great Eastern Shipping: Q4 Profit Plunges 60%, Declares Dividend",
            "Summary": "Great Eastern Shipping Company reported a 60% YoY decline in Q4 FY2025 net profit to ₹363 crore. Revenue fell 18.3% to ₹1,223 crore. The company declared a fourth interim dividend of ₹5.40 per share. Board approved re-appointments of key directors.",
            "Sentiment": "negative",
            "PublishDate": 1746807065000,
            "Source": "earnings"
        },
        {
            "Title": "Great Eastern Shipping Co. Reports Q4 Results and Dividend",
            "Summary": "Great Eastern Shipping Co. has announced its Q4 financial results and dividend. The company recommended a dividend of 5.4 rupees per equity share. Q4 EBITDA decreased to 5B rupees from 9.4B rupees year-over-year, with EBITDA margin falling to 41.05% from 62.55%. Q4 consolidated net profit declined to 3.6B rupees from 9.05B rupees year-over-year and 5.9B rupees quarter-over-quarter. Revenue for Q4 was 12.2B rupees, down from 14.97B rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1746796477000,
            "Source": "result"
        },
        {
            "Title": "Great Eastern Shipping Delivers Supramax Dry Bulk Carrier",
            "Summary": "Great Eastern Shipping Company has delivered its 2011-built Supramax dry bulk carrier named 'Jag Rishi'. This delivery indicates a potential sale or end of service for this particular vessel in the company's fleet.",
            "Sentiment": "neutral",
            "PublishDate": 1740113499000,
            "Source": "corporate_action"
        },
        {
            "Title": "Great Eastern Shipping Company: Q3 Profit Rises 10.31% YoY Despite Revenue Dip",
            "Summary": "Great Eastern Shipping Company reported Q3 FY25 results with profit up 10.31% YoY to ₹593.66 crore, despite a 0.66% decrease in revenue to ₹1236.87 crore. Operating income fell 18.42% YoY. EPS decreased to ₹23.34, down 34.01% YoY. Analysts maintain a Strong Buy recommendation.",
            "Sentiment": "positive",
            "PublishDate": 1738130649000,
            "Source": "earnings"
        },
        {
            "Title": "Great Eastern Shipping Co Reports Strong Q3 EBITDA Growth",
            "Summary": "Great Eastern Shipping Co has reported significant year-over-year improvements in its financial performance for the third quarter. The company's EBITDA increased to 8.76 billion rupees, up from 6.49 billion rupees in the same period last year. Additionally, the EBITDA margin expanded to 70.82% from 52.13% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738054163000,
            "Source": "earnings"
        },
        {
            "Title": "Great Eastern Shipping Co. Reports Q3 Revenue",
            "Summary": "Great Eastern Shipping Co. has reported its third-quarter revenue of 12.4 billion rupees, compared to 12.45 billion rupees in the same period last year. This represents a slight year-over-year decrease in revenue for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1738054145000,
            "Source": "earnings"
        },
        {
            "Title": "Great Eastern Shipping Co Reports Increase in Q3 Consolidated Net Profit",
            "Summary": "Great Eastern Shipping Co has announced its financial results for the third quarter. The company's consolidated net profit rose to 5.9 billion rupees, compared to 5.38 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738054110000,
            "Source": "earnings"
        },
        {
            "Title": "Great Eastern Shipping Declares Interim Dividend",
            "Summary": "Great Eastern Shipping Company has announced an interim dividend of 7.20 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1730998158000,
            "Source": "corporate_action"
        },
        {
            "Title": "Great Eastern Shipping Co. Reports Q2 Financial Results",
            "Summary": "Great Eastern Shipping Co. has released its Q2 financial results. The company's EBITDA for the quarter was 7.82 billion rupees, compared to 7.84 billion rupees in the same quarter last year. The EBITDA margin decreased to 57.75% from 63.84% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730998129000,
            "Source": "result"
        },
        {
            "Title": "Great Eastern Shipping Reports Q2 Revenue Increase",
            "Summary": "Great Eastern Shipping Company has reported a revenue of 13.54 billion rupees for the second quarter, compared to 12.3 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730998121000,
            "Source": "result"
        },
        {
            "Title": "Great Eastern Shipping Reports Q2 FY24 Financial Results",
            "Summary": "Great Eastern Shipping Co. has reported its consolidated net profit for the second quarter. The company's net profit stands at 5.76 billion rupees, showing a slight decrease from 5.95 billion rupees year-over-year. However, it represents a decrease from 8.12 billion rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1730998114000,
            "Source": "result"
        },
        {
            "Title": "G E Shipping to Sell Medium Range Product Tanker",
            "Summary": "G E Shipping has entered into a contract to sell its 2005-built medium range product tanker named 'JAG PADMA'.",
            "Sentiment": "neutral",
            "PublishDate": 1730355504000,
            "Source": "corporate_action"
        },
        {
            "Title": "G E Shipping Delivers Supramax Dry Bulk Carrier JAG RANI",
            "Summary": "G E Shipping has delivered its 2011-built Supramax dry bulk carrier named JAG RANI. This action suggests the company is managing its fleet, potentially as part of its ongoing business strategy in the shipping industry.",
            "Sentiment": "neutral",
            "PublishDate": 1729489498000,
            "Source": "corporate_action"
        }
    ]
}