{
    "Symbol": "GFLLIMITED",
    "ISIN": "INE538A01037",
    "News": [
        {
            "Title": "GFL Limited Board Approves Merger with Subsidiary",
            "Summary": "GFL Limited's board has approved a scheme to merge its wholly-owned subsidiary Inox Infrastructure Limited, subject to regulatory approvals including NCLT consent.",
            "Sentiment": "neutral",
            "PublishDate": 1770888512301,
            "Source": "co_actions_results"
        },
        {
            "Title": "GFL Limited Managing Director Devendra Kumar Jain Passes Away",
            "Summary": "GFL Limited announces the demise of Managing Director, CEO & Chairperson Shri Devendra Kumar Jain on December 29, 2025. Company operations remain stable under Board guidance.",
            "Sentiment": "negative",
            "PublishDate": 1767104477473,
            "Source": "stocks"
        },
        {
            "Title": "GFL Limited Reports Mixed Quarterly Results with Standalone Profit and Consolidated Loss",
            "Summary": "GFL Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. On a standalone basis, the company reported a profit of Rs. 90 lakhs for the quarter, compared to a loss of Rs. 3,477 lakhs in the same period last year. However, on a consolidated basis, the company posted a loss of Rs. 535 lakhs for the quarter versus a loss of Rs. 3,522 lakhs in the previous year. The consolidated results include subsidiary INOX Infrastructure Limited and associate PVRINOX Limited. The company's revenue from operations remained minimal across both standalone and consolidated financials. The Board of Directors approved these results at their meeting held on November 11, 2025. The results were reviewed by the Audit Committee and received an unmodified review report from statutory auditors.",
            "Sentiment": "neutral",
            "PublishDate": 1762859956408,
            "Source": "earnings"
        },
        {
            "Title": "GFL Limited Reports Mixed Q1 FY26 Results with Standalone Profit but Consolidated Loss",
            "Summary": "GFL Limited announced its quarterly results for the quarter ended June 30, 2025. On a standalone basis, the company reported a profit of Rs. 44 lakhs compared to Rs. 35 lakhs in the previous quarter and Rs. 38 lakhs in the same quarter last year. Revenue from operations increased to Rs. 92 lakhs from Rs. 84 lakhs in the previous quarter. However, on a consolidated basis, the company posted a loss of Rs. 816 lakhs compared to a loss of Rs. 1,829 lakhs in the previous quarter and Rs. 2,652 lakhs in the corresponding quarter of the previous year. The consolidated loss was primarily driven by a share of loss from associate of Rs. 1,004 lakhs. Basic and diluted earnings per share on standalone basis was Rs. 0.04, while on consolidated basis it was a loss of Rs. 0.74 per share. The company's consolidated results include its wholly-owned subsidiary INOX Infrastructure Limited and associate PVR INOX Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1755085684934,
            "Source": "earnings"
        }
    ]
}