{
    "Symbol": "GGBL",
    "ISIN": "INE0R8C01018",
    "News": [
        {
            "Title": "Ganesh Green Bharat Secures Rs. 50.53 Crore Order",
            "Summary": "Ganesh Green Bharat has secured a significant work order worth Rs. 50.53 crore from an independent power producer, marking a notable business development for the company.",
            "Sentiment": "positive",
            "PublishDate": 1770120793745,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ganesh Green Bharat Reports Strong H1 Growth with Revenue Surging 146% YoY",
            "Summary": "Ganesh Green Bharat delivered robust H1 performance with revenue jumping to 3.4B rupees from 1.38B rupees year-over-year, while net profit more than doubled to 329M rupees from 131M rupees. EBITDA increased significantly to 487M rupees from 212M rupees, though EBITDA margin compressed slightly to 14.29% from 15.39% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1763052526371,
            "Source": "earnings"
        },
        {
            "Title": "Ganesh Green Bharat Receives Updated Work Order from Zetwerk",
            "Summary": "Ganesh Green Bharat has announced an updated work order from Zetwerk, valued at ₹6.21 billion. The news indicates a significant business development for the company, potentially impacting its future operations and financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1750165447000,
            "Source": "default"
        },
        {
            "Title": "Ganesh Green Bharat Awarded Contract for Rooftop Solar Projects",
            "Summary": "Ganesh Green Bharat has been awarded a contract for 7,131 kW grid-connected rooftop solar projects. The contract is valued at 330.4 million rupees. This achievement highlights the company's involvement in renewable energy infrastructure and its success in securing significant projects in the solar power sector.",
            "Sentiment": "positive",
            "PublishDate": 1739405686000,
            "Source": "order&deals"
        },
        {
            "Title": "Ganesh Green Bharat Secures 330.4 Million Rupee Contract for Rooftop Solar Projects",
            "Summary": "Ganesh Green Bharat has been awarded a contract for 7,131 KW grid-connected rooftop solar projects. The contract is valued at 330.4 million rupees. This award signifies a significant development in the company's renewable energy initiatives and demonstrates their capability in executing large-scale solar projects.",
            "Sentiment": "positive",
            "PublishDate": 1739366645000,
            "Source": "order&deals"
        },
        {
            "Title": "Ganesh Green Bharat Secures 13 Crore Rupee Contract from Bihar Renewable Energy Agency",
            "Summary": "Ganesh Green Bharat has been awarded a work order worth 13 crore rupees from the Bihar Renewable Energy Development Agency. The contract includes a Comprehensive Maintenance Contract (CMC) for a period of 5 years. The company, which has a market capitalization of 1473 crore rupees, is classified as a Small and Medium Enterprise (SME).",
            "Sentiment": "positive",
            "PublishDate": 1735805287000,
            "Source": "order&deals"
        },
        {
            "Title": "Ganesh Green Bharat to Expand Solar PV Module Manufacturing Capacity",
            "Summary": "Ganesh Green Bharat plans to increase its solar photovoltaic (PV) module manufacturing capacity to 1.1 gigawatts (GW) by March 2025, according to an SME report.",
            "Sentiment": "positive",
            "PublishDate": 1734508604000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ganesh Green Bharat Secures 25 Crore Rupee Order",
            "Summary": "Ganesh Green Bharat has won a new order worth 25 crore rupees. This addition brings the company's total order book for ongoing projects to 394.5 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1733317399000,
            "Source": "order&deals"
        },
        {
            "Title": "Ganesh Green Bharat Secures 292.1 Million Rupee Order",
            "Summary": "Ganesh Green Bharat has received a significant order valued at 292.1 million rupees. This order represents a substantial business opportunity for the company.",
            "Sentiment": "positive",
            "PublishDate": 1732103896000,
            "Source": "normal_news"
        },
        {
            "Title": "Ganesh Green Bharat Wins MSEDCL Tender Worth 1.39 Billion Rupees",
            "Summary": "<p><span class=\"positive\">Ganesh Green Bharat</span> has <span class=\"positive\">emerged as the winner</span> for a <b>tender</b> issued by <span class=\"neutral\">Maharashtra State Electricity Distribution Company Limited (MSEDCL)</span>. The <b>Letter of Award (LOA)</b> for this tender is <span class=\"positive\">valued at 1.39 billion rupees</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728554170000,
            "Source": "corporate_action"
        }
    ]
}