{
    "Symbol": "GHCLTEXTIL",
    "ISIN": "INE0PA801013",
    "News": [
        {
            "Title": "GHCL Textiles schedules Q3FY26 earnings call Jan 30",
            "Summary": "GHCL Textiles Limited announces earnings conference call on January 30, 2026 at 12:00 noon IST to discuss Q3FY26 results, hosted by Go India Advisors with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1769232444165,
            "Source": "co_actions_results"
        },
        {
            "Title": "GHCL Textiles Gets Credit Rating Upgrade from CARE",
            "Summary": "CARE Ratings upgrades GHCL Textiles' credit ratings to CARE A; Stable/CARE A1 from CARE A-; Stable/CARE A2+ for ₹500 crore facilities, citing improved H1FY26 performance.",
            "Sentiment": "positive",
            "PublishDate": 1767976929185,
            "Source": "stocks"
        },
        {
            "Title": "GHCL Textiles Reports Mixed Q2 Results with Revenue Growth but Lower Net Profit",
            "Summary": "GHCL Textiles announced its Q2 financial results showing revenue growth to Rs 3.38 billion from Rs 3.04 billion year-over-year. However, net profit declined to Rs 160 million compared to Rs 206 million in the same period last year. The company's EBITDA improved to Rs 368.1 million from Rs 271.2 million year-over-year, with EBITDA margin expanding to 10.89% from 8.90% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1761993161321,
            "Source": "earnings"
        },
        {
            "Title": "Securities Appellate Tribunal Stays SEBI Order Against Anurag Dalmia in Golden Tobacco Case",
            "Summary": "The Securities Appellate Tribunal issued a stay order on October 8, 2025, halting SEBI's directive from August 29, 2025, concerning Anurag Dalmia related to Golden Tobacco Limited. The tribunal stayed the debarment and penalty recovery, requiring a 50% penalty deposit within four weeks. The next hearing is scheduled for January 9, 2026. GHCL Textiles Limited, which disclosed this information, stated the matter pertains to Golden Tobacco Limited and has no impact on its business or operations.",
            "Sentiment": "neutral",
            "PublishDate": 1760093795427,
            "Source": "corporate_governance"
        },
        {
            "Title": "GHCL Textiles Reports Mixed Q1 FY26 Results with Revenue Decline but Profit Growth",
            "Summary": "GHCL Textiles reported revenue of Rs. 270 crores for Q1 FY26, declining 6.5% year-on-year due to reduced yarn sales volumes amid challenging market conditions. However, EBITDA increased 10.5% to Rs. 32 crores and PAT grew 15% to Rs. 14 crores, driven by operational efficiency and cotton cost savings. The company successfully commissioned its new 25,000 spindle unit in June, expected to generate additional revenue of Rs. 250 crores annually with full ramp-up by Q3. Cotton prices firmed up to Rs. 58,000 per candy from Rs. 55,000 previously, while cotton-yarn spread compressed to Rs. 130 per kg in Q1 from Rs. 132 in Q4. Export revenue dropped significantly to 6% of total revenue from 11% in the previous quarter, primarily due to European market sluggishness. The company is proceeding with vertical integration plans, installing 15 knitting machines from October with Rs. 38 crores investment expected to generate Rs. 75-80 crores additional revenue. Management expects Q2 to remain challenging due to US tariff uncertainties affecting customer demand, with recovery anticipated in the second half pending tariff clarity.",
            "Sentiment": "neutral",
            "PublishDate": 1754049580043,
            "Source": "earnings"
        },
        {
            "Title": "GHCL Textiles Reports Quarterly Results for Quarter Ended June 30, 2025",
            "Summary": "GHCL Textiles Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025, prepared in compliance with Indian Accounting Standards. The company reported total outstanding loans and revolving facilities of ₹94.70 crore with no defaults. The company confirmed no deviation in fund utilization as no public or rights issues were applicable. The statutory auditor S.R. Batliboi & Co. LLP issued a Limited Review Report stating nothing came to their attention suggesting material misstatements in the financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1753780723217,
            "Source": "earnings"
        },
        {
            "Title": "GHCL Textiles Reports Mixed Q1 Results with Higher Profit Despite Revenue Decline",
            "Summary": "GHCL Textiles reported quarterly net profit of 135 million rupees compared to 118 million rupees in the same period last year. The company's EBITDA increased to 300 million rupees from 284 million rupees year-over-year, with EBITDA margin improving to 11.20% from 9.86%. However, revenue declined to 2.7 billion rupees from 2.88 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753779378696,
            "Source": "earnings"
        },
        {
            "Title": "GHCL Textiles Inaugurates Meenakshi Section at Paravai Unit in Tamil Nadu",
            "Summary": "GHCL Textiles Limited inaugurated the Meenakshi section of its Paravai unit in Tamil Nadu on July 02, 2025. The plant had commenced trial production on June 12, 2025, before the formal inauguration ceremony. The Paravai unit is located at Samayanallur Post, Madurai, Tamil Nadu. The inauguration was attended by dignitaries, and the company confirmed that all details from their earlier communication dated July 02, 2025, remain unchanged.",
            "Sentiment": "positive",
            "PublishDate": 1753761157860,
            "Source": "stock"
        },
        {
            "Title": "GHCL Textiles Begins Manufacturing at Paravai Unit's Meenakshi Section",
            "Summary": "GHCL Textiles has commenced manufacturing operations at the Meenakshi section of its Paravai unit. This marks a significant step in the company's production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1751457232000,
            "Source": "default"
        },
        {
            "Title": "GHCL Textiles Reports Q4 Financial Results",
            "Summary": "GHCL Textiles has released its Q4 financial results. The company reported revenue of 2.84 billion rupees, slightly down from 2.86 billion rupees year-over-year. However, EBITDA increased to 308 million rupees from 283 million rupees, with EBITDA margin improving to 10.83% from 9.9%. Net profit saw a significant rise to 142 million rupees, up from 102.5 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1746436005000,
            "Source": "result"
        },
        {
            "Title": "GHCL Textiles to Consider Q4 Results on May 5",
            "Summary": "GHCL Textiles has announced that it will consider its fourth quarter financial results on May 5. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1744805926000,
            "Source": "default"
        },
        {
            "Title": "GHCL Textiles Discontinues Production at Kaveri Section of Manaparai Unit",
            "Summary": "GHCL Textiles has announced the discontinuation of production at the Kaveri section of its Manaparai unit. The company cited high repair and maintenance costs associated with aging machinery as the reason for this decision.",
            "Sentiment": "negative",
            "PublishDate": 1742815569000,
            "Source": "corporate_action"
        },
        {
            "Title": "GHCL Textiles Reports Strong Q3 Financial Results",
            "Summary": "GHCL Textiles has announced its Q3 financial results, showing significant year-over-year growth. The company's net profit increased to 94 million rupees, up from 45 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 2.8 billion rupees compared to 2.44 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1738567628000,
            "Source": "earnings"
        },
        {
            "Title": "GHCL Textiles Reports Improved Q2 Financial Performance",
            "Summary": "GHCL Textiles has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 204 million rupees to 275 million rupees. Additionally, the EBITDA margin rose from 7.86% to 9.02% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730205078000,
            "Source": "result"
        },
        {
            "Title": "GHCL Textiles Reports Significant Profit Growth in Q2",
            "Summary": "GHCL Textiles has reported a substantial increase in net profit for the second quarter. The company's net profit rose to 206 million rupees, up from 61 million rupees year-over-year and 118 million rupees quarter-over-quarter. Revenue also increased to 3.04 billion rupees from 2.6 billion rupees compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730205031000,
            "Source": "result"
        }
    ]
}