{
    "Symbol": "GHCL",
    "ISIN": "INE539A01019",
    "News": [
        {
            "Title": "GHCL Q3 Net Profit Drops to ₹1.1B from ₹1.7B YoY",
            "Summary": "GHCL reports Q3 standalone net profit of ₹1.1 billion, marking a significant decline from ₹1.7 billion in the corresponding quarter of the previous year, representing a year-on-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1769675635612,
            "Source": "co_actions_results"
        },
        {
            "Title": "GHCL Achieves 92% Debt Reduction, Attracts Dolly Khanna",
            "Summary": "GHCL Limited transforms balance sheet with debt reduction from ₹1,254 crore to ₹97 crore, achieving net cash surplus of ₹1,047 crore while expanding into high-margin segments.",
            "Sentiment": "positive",
            "PublishDate": 1769341089673,
            "Source": "stocks"
        },
        {
            "Title": "GHCL Q3FY26 earnings call set for January 29, 2026",
            "Summary": "GHCL Limited announces investor conference call on January 29, 2026 at 4:00 PM IST to discuss Q3FY26 financial results with senior management including MD and CFO.",
            "Sentiment": "neutral",
            "PublishDate": 1769168863619,
            "Source": "co_actions_results"
        },
        {
            "Title": "GHCL to Announce Q3 Results on January 29",
            "Summary": "GHCL Ltd has scheduled its board meeting to consider and approve the third quarter financial results on January 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767777621439,
            "Source": "co_actions_results"
        },
        {
            "Title": "GHCL Limited Completes Buyback of 41.37 Lakh Equity Shares at ₹725 Per Share",
            "Summary": "GHCL Limited published a post-buyback public announcement for the completion of its buyback of 41,37,931 equity shares at ₹725 per share through tender offer route, with the tendering period running from November 20-26, 2025. The buyback was conducted on a proportionate basis for existing shareholders as of the record date November 14, 2025, with a total value of up to ₹300 crores excluding transaction costs.",
            "Sentiment": "neutral",
            "PublishDate": 1764842654430,
            "Source": "corporate_action"
        },
        {
            "Title": "GHCL Limited Announces Buyback of 41.37 Lakh Equity Shares at ₹725 Per Share",
            "Summary": "GHCL Limited has launched a buyback offer for 41,37,931 equity shares at ₹725 per share through the tender offer route on a proportionate basis to public shareholders. The offer opening advertisement was published on November 19, 2025, following SEBI observations and compliance with buyback regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763548428326,
            "Source": "corporate_action"
        },
        {
            "Title": "GHCL Q2 FY26 Results: Revenue Drops 9% YoY to ₹739 Crores Amid Pricing Pressures",
            "Summary": "GHCL Limited reported quarterly revenue of ₹739 crores compared to ₹810 crores in the corresponding quarter last year, reflecting a 9% year-on-year decline in realizations due to cheap imports and oversupply conditions. EBITDA stood at ₹175 crores with margins at 23.8%, down from ₹228 crores in Q2 FY25. PAT was ₹107 crores versus ₹155 crores last year. The company completed a planned maintenance shutdown in late September impacting production volumes. Domestic soda ash demand grew 5% year-to-date driven by various end-user sectors, but market remains oversupplied with imports running at 85,000 tons per month. The Board announced a ₹300 crore share buyback program under tender offer route. Bromine and vacuum salt projects are progressing with commissioning expected in Q4 FY26, projected to contribute ₹70-80 crores additional EBITDA with 40-45% margins. The company awaits Finance Ministry approval for anti-dumping duty recommendations on soda ash imports. Greenfield soda ash project faces delays due to pending land clearances, though environmental approvals are secured.",
            "Sentiment": "negative",
            "PublishDate": 1762513477698,
            "Source": "earnings"
        },
        {
            "Title": "GHCL Limited Announces Buyback of Equity Shares Worth ₹300 Crores",
            "Summary": "GHCL Limited has announced a buyback of up to 41,37,931 fully paid-up equity shares at ₹725 per share through tender offer route. The buyback size will not exceed ₹300 crores and will be conducted on a proportionate basis. The company's Board of Directors approved this buyback plan, and a public announcement was published in newspapers. The buyback is being conducted in accordance with the Companies Act 2013 and SEBI Buy-Back of Securities Regulations 2018.",
            "Sentiment": "neutral",
            "PublishDate": 1762310779918,
            "Source": "corporate_action"
        },
        {
            "Title": "GHCL Limited Approves ₹300 Crore Share Buyback at ₹725 Per Share",
            "Summary": "GHCL Limited's Board of Directors approved a buyback of up to 41,37,931 equity shares at ₹725 per share through tender offer route. The buyback represents 4.32% of paid-up equity capital and amounts to ₹300 crores, which is 8.73% and 8.71% of aggregate paid-up equity capital and free reserves based on standalone and consolidated audited financials respectively. The record date is set for November 14, 2025. All equity shareholders except promoters and promoter group members are eligible to participate. The company will use securities premium account, free reserves and other permitted sources for funding. A buyback committee has been constituted comprising Managing Director Ravi Shanker Jalan, CFO Executive Director Raman Chopra, and Executive Director Neelabh Dalmia. The buyback must be completed within one year from the board resolution date of November 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762172829972,
            "Source": "corporate_action"
        },
        {
            "Title": "GHCL Approves Share Buyback of 4.14 Million Shares at ₹725 Each Amid Declining Q2 Performance",
            "Summary": "GHCL's board has approved a buyback of 4,137,931 shares at ₹725 per share. The company reported Q2 revenue of ₹7.2 billion compared to ₹7.9 billion in the previous year. Net profit declined to ₹1.07 billion from ₹1.54 billion year-over-year. EBITDA dropped to ₹1.57 billion from ₹2.11 billion, with EBITDA margin contracting to 21.80% from 26.61% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1761988058861,
            "Source": "corporate_action"
        },
        {
            "Title": "GHCL Limited Approves ₹300 Crore Share Buyback and Reports Quarterly Results",
            "Summary": "GHCL Limited's board approved a share buyback program worth up to ₹300 crore at ₹725 per share, targeting 41,37,931 equity shares representing 4.32% of paid-up capital. The buyback excludes promoters and promoter group members, with record date set for November 14, 2025. The company also approved quarterly financial results for the period ended September 30, 2025. A buyback committee was constituted comprising Managing Director Ravi Shanker Jalan, CFO Executive Director Raman Chopra, and Executive Director Neelabh Dalmia. The company received approval for renewal of its mining lease for lignite mineral for 20 years, valid until December 8, 2043. GHCL operates in the chemical business segment and paid a dividend of ₹12 per share totaling ₹114.73 crores during the current quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761988042256,
            "Source": "corporate_action"
        },
        {
            "Title": "GHCL Schedules Board Meeting to Consider Equity Share Buyback Proposal",
            "Summary": "GHCL has announced a board meeting scheduled for November 1 to consider a proposal for equity share buyback.",
            "Sentiment": "neutral",
            "PublishDate": 1761739192455,
            "Source": "corporate_action"
        },
        {
            "Title": "GHCL Secures Land and Approvals for ₹6,500 Crore Soda Ash Facility",
            "Summary": "GHCL has secured land and necessary approvals for a ₹6,500 crore soda ash manufacturing facility. The company plans to begin construction within 6-7 months.",
            "Sentiment": "positive",
            "PublishDate": 1760603679698,
            "Source": "stock"
        },
        {
            "Title": "GHCL Limited VP Finance Manish Shah Passes Away, Raman Chopra Takes Temporary Charge",
            "Summary": "GHCL Limited announced the passing of Mr. Manish Shah, Vice President (Finance & Accounts), on July 3, 2025. The company has appointed Mr. Raman Chopra to temporarily take over Mr. Shah's duties. This leadership change affects the company's finance and accounts department operations.",
            "Sentiment": "negative",
            "PublishDate": 1760335399652,
            "Source": "corporate_governance"
        },
        {
            "Title": "SAT Stays SEBI Order Against Anurag Dalmia in Golden Tobacco Case",
            "Summary": "The Securities Appellate Tribunal issued a stay order on October 8, 2025, regarding SEBI's earlier decision dated August 29, 2025, concerning Mr. Anurag Dalmia in relation to Golden Tobacco Limited. SAT ordered a stay on debarment and recovery of penalty amount, subject to deposit of 50% of the penalty within four weeks. The next hearing is scheduled for January 9, 2026. GHCL Limited stated that this matter pertains to Golden Tobacco Limited and has no bearing on GHCL's business or operations, with no financial impact on the company.",
            "Sentiment": "neutral",
            "PublishDate": 1760092731995,
            "Source": "corporate_governance"
        },
        {
            "Title": "GHCL Seeks Anti-Dumping Duty Protection Against Chinese Soda Ash Imports",
            "Summary": "GHCL Ltd, India's second-largest soda ash producer, has petitioned the government for anti-dumping duties on soda ash imports from China and other exporters as cheap imports squeeze margins. Import share has doubled to 25-26% from a historical 15%, pressuring domestic producers who lack access to low-cost natural reserves. China controls 45% of global soda ash capacity and recently added over 10 million tonnes in Inner Mongolia, creating market surplus. The Directorate General of Trade Remedies is investigating following petitions from domestic firms. India extended minimum import price of Rs 20,108 per tonne until December 31, but GHCL's managing director R S Jalan says it provides limited benefit. Despite challenges, GHCL operates at 98% capacity utilization with 26% domestic market share. The company reported standalone net profit of Rs 145 crore on revenue of Rs 823 crore, with soda ash prices dropping 19% year-on-year while margins eroded only 5%. GHCL is expanding capacity to 2.2 million tonnes annually through a Rs 6,500-crore Gujarat plant to capture demand from India's solar energy expansion, projecting additional 1 million tonne demand over five years.",
            "Sentiment": "negative",
            "PublishDate": 1759388108969,
            "Source": "stock"
        },
        {
            "Title": "GHCL Limited Announces Annual Maintenance Shutdown of Soda Ash Plant",
            "Summary": "GHCL Limited will temporarily close its Soda Ash plant for planned maintenance activities from September 26, 2025 to October 12, 2025. The shutdown is expected to result in a production shortfall of approximately 22,000-25,000 tons. The company stated it has sufficient reserve stock of Soda Ash to meet customer requirements during this period, ensuring no adverse impact on supply commitments. The maintenance activities are being conducted to ensure efficient and safe operations of the plant.",
            "Sentiment": "neutral",
            "PublishDate": 1758864078297,
            "Source": "stock"
        },
        {
            "Title": "GHCL Plans to Nearly Double Soda Ash Capacity to 2.3 Million Tonnes by 2030",
            "Summary": "GHCL aims to expand its soda ash manufacturing capacity from 1.2 million tonnes per annum to 2.3 million tonnes per annum by 2030 through a new greenfield project. Managing Director RS Jalan stated the capacity addition will come online after three years, with margin expansion in the soda ash business expected at that time. The company expects to maintain EBITDA margins in the 25-30% range over the next two years. GHCL has allocated Rs 300 crore per year for capital expenditure over the next two years, focusing on bromine and vacuum salt businesses and operational efficiency improvements. Jalan projected return ratios of over 30% for new ventures and 20-22% overall for the company. The expansion comes despite short-term headwinds from global market dynamics, particularly China's influence with 45% of global soda ash capacity. GHCL shares closed 1% lower at Rs 543.05.",
            "Sentiment": "positive",
            "PublishDate": 1757492537889,
            "Source": "stock"
        },
        {
            "Title": "GHCL Warns of Continued Soda Ash Market Pressure from China Oversupply",
            "Summary": "GHCL Ltd. expects China's excess capacity and weak demand to continue pressuring the global soda ash market in the near term. Managing Director R.S. Jalan forecasts challenging conditions for Q2 and potentially one or two more quarters, citing China's impact on the Indian industry. GHCL holds a 26% market share as India's second largest soda ash manufacturer. The global soda ash market has experienced volatility due to massive capacity additions in China and softening demand over the past two years, creating oversupply. China controls approximately 45% of global soda ash capacity. Despite headwinds, GHCL has maintained profits through manufacturing efficiencies and cost optimization. The Indian government extended the Minimum Import Price for soda ash until December 2025 to support domestic companies. Jalan expects market conditions to improve over a longer time horizon.",
            "Sentiment": "negative",
            "PublishDate": 1757405336135,
            "Source": "stock"
        },
        {
            "Title": "GHCL Limited Transfers Senior General Manager Manu Jain to Ahmedabad Office with Additional Responsibilities",
            "Summary": "GHCL Limited announced the transfer of Mr. Manu Jain, Senior General Manager (Finance & Accounts), from the Noida Office to the Ahmedabad Office effective August 11, 2025. Jain will assume additional responsibilities previously held by the late Mr. Manish Shah while maintaining his existing terms and conditions. Jain is a qualified Chartered Accountant with over 20 years of experience in finance, investor relations, M&A, corporate strategy, business growth, and fundraising. He has been with GHCL since October 2020 and previously worked with S R Batliboi, Goldman Sachs, and EY TAS.",
            "Sentiment": "neutral",
            "PublishDate": 1754907793411,
            "Source": "corporate_governance"
        },
        {
            "Title": "GHCL Reports Q1 FY26 Results Amid Global Soda Ash Oversupply and Pricing Pressure",
            "Summary": "GHCL Limited reported quarterly revenue of INR 823 crores compared to INR 849 crores in the same quarter last year, with EBITDA at INR 225 crores versus INR 235 crores year-on-year. EBITDA margin remained stable at 27.3% compared to 27.7% in Q1 FY25, though it declined 290 basis points quarter-on-quarter. PAT decreased to INR 145 crores from INR 151 crores in the corresponding quarter. The company generated INR 191 crores in cash profit after tax and spent INR 121 crores on growth capex including bromine and vacuum salt projects. GHCL maintains a strong balance sheet with INR 1,142 crores in cash and investments. Management highlighted global soda ash oversupply with 10 million tonnes of capacity added over the last two years, primarily in China. Despite a 19% price drop over two years, the company's bottom line was impacted by less than 5% due to internal efficiencies and raw material cost reductions. The company expects Q2 to be challenging with continued pricing pressure, while bromine and vacuum salt projects are expected to be commissioned in FY26. GHCL's greenfield soda ash project phases are expected to be completed in the next 3-4 years with an estimated IRR of 17-18%.",
            "Sentiment": "neutral",
            "PublishDate": 1754478772411,
            "Source": "earnings"
        },
        {
            "Title": "GHCL Plans Expansion in Soda Ash, Bromine and Salt Production",
            "Summary": "GHCL is focusing on India's soda ash demand through new expansion plans. The company is making investments in bromine and salt production. GHCL aims for profit and growth while facing global price challenges in its operations.",
            "Sentiment": "positive",
            "PublishDate": 1753971662887,
            "Source": "stock"
        },
        {
            "Title": "GHCL Limited Reports Q1FY26 Results with Revenue of Rs 823 Crore, Announces Bromine Plant Progress",
            "Summary": "GHCL Limited reported quarterly results with revenue of Rs 823 crore, EBITDA of Rs 225 crore, and profit after tax of Rs 145 crore. The company experienced a 3% year-on-year revenue decline and 4% drop in EBITDA, attributed to global soda ash oversupply and softer realizations despite strong domestic demand. EBITDA margin stood at 27.3%. The company maintained operational efficiency with its soda ash plant running at industry-leading utilization levels. GHCL's bromine plant construction is progressing and expected to be commissioned by H2 FY26, with planned capacity of 2,800 MT targeting 40%+ EBITDA margins. The company is also developing vacuum salt capacity of 1.7 lakh MT. The Minimum Import Price protection for domestic soda ash industry has been extended until December 31, 2025. GHCL holds a 26% market share in India's soda ash market, with domestic demand expected to grow at 5-6% CAGR. The company generated cash inflows of Rs 191 crore and allocated Rs 121 crore for growth capex.",
            "Sentiment": "neutral",
            "PublishDate": 1753969559186,
            "Source": "earnings"
        },
        {
            "Title": "GHCL Reports Decline in Q1 Financial Performance Across Key Metrics",
            "Summary": "GHCL reported quarterly results showing a decline across major financial indicators. Net profit decreased to 1.44 billion rupees from 1.5 billion rupees in the same period last year. Revenue fell to 7.9 billion rupees compared to 8.3 billion rupees year-over-year. EBITDA dropped to 1.97 billion rupees from 2.16 billion rupees, while EBITDA margin contracted to 24.8% from 26.11% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1753951699126,
            "Source": "earnings"
        },
        {
            "Title": "GHCL Limited Shareholders Approve All Five Resolutions at 42nd Annual General Meeting",
            "Summary": "GHCL Limited conducted its 42nd Annual General Meeting on July 24, 2025, via video conference from 10:00 AM to 11:20 AM IST. All five proposed resolutions were approved by shareholders with requisite majority. The approved resolutions included adoption of audited standalone and consolidated financial statements for the financial year ended March 31, 2025, declaration of dividend, re-appointment of Mr. Ravi Shanker Jalan as Director liable to retire by rotation, and appointment of Chandrasekaran Associates as Secretarial Auditor for five consecutive years. The meeting was chaired by Shri Anurag Dalmia, with Managing Director Mr. Ravi Shanker Jalan addressing member queries. Remote e-voting was conducted from July 20-23, 2025, with additional e-voting facilities provided during the meeting through CDSL platform. CS Manoj R. Hurkat served as scrutinizer for the voting process. Out of 101,358 total shareholders on the cut-off date of July 17, 2025, 99 shareholders attended through video conferencing, including 37 from promoter group and 62 from public category.",
            "Sentiment": "positive",
            "PublishDate": 1753351715900,
            "Source": "corporate_action"
        },
        {
            "Title": "GHCL Secures 20-Year Lease Renewal for Gujarat Lignite Mines",
            "Summary": "GHCL Ltd. received a 20-year lease renewal for its Khadsaliya Lignite Mines from the Gujarat Industries and Mines Department, valid until December 8, 2043. The 171-hectare mines are located in Gujarat's Bhavnagar district. The company signed an ₹850 crore MoU with Gujarat Government in December 2023 for developing secondary minerals including Bentonite and Sand. The project will expand into a composite mining operation combining primary lignite mining with secondary mineral projects. GHCL shares closed 0.7% lower at ₹605, declining 18% in 2025 and trading 22% below its 52-week high of ₹779.",
            "Sentiment": "positive",
            "PublishDate": 1753052950053,
            "Source": "stock"
        },
        {
            "Title": "GHCL Reports Q4 Revenue Decline",
            "Summary": "GHCL, an Indian company, has reported its fourth quarter revenue as 7.8 billion rupees, down from 8.2 billion rupees in the same quarter of the previous year, indicating a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1746692678000,
            "Source": "result"
        },
        {
            "Title": "GHCL Reports Strong Q4 Financial Results",
            "Summary": "GHCL has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 2.18 billion rupees from 1.85 billion rupees in the previous year. The EBITDA margin also improved, rising to 28% from 22.48%. Additionally, GHCL's standalone net profit grew to 1.53 billion rupees, up from 1.25 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1746692641000,
            "Source": "result"
        },
        {
            "Title": "Investor Dolly Khanna Acquires 1.03% Stake in GHCL",
            "Summary": "According to the latest shareholding data, renowned investor Dolly Khanna has acquired a 1.03% stake in GHCL during the fourth quarter. This information appears in the company's shareholding pattern for Q4.",
            "Sentiment": "positive",
            "PublishDate": 1745206909000,
            "Source": "default"
        },
        {
            "Title": "GHCL Ltd: Expanding Soda Ash Production to Capture Solar Glass Market Share",
            "Summary": "GHCL Ltd plans to double its soda ash production capacity with a new plant in Gujarat, investing ₹3,500 crore for the first phase. The company aims to increase its market share from 26% to 34-35% by 2028-29, targeting the growing demand from India's solar glass industry. GHCL also plans to reduce carbon emissions by 30% annually, aiming for carbon neutrality by 2047.",
            "Sentiment": "positive",
            "PublishDate": 1742479461000,
            "Source": "corporate_action"
        },
        {
            "Title": "GHCL Receives Environmental Clearance for Greenfield Soda Ash Plant",
            "Summary": "GHCL's Managing Director announced that the company has received environmental clearance for its new greenfield soda ash plant. This development, along with the planned commissioning of vacuum salt and bromine projects in FY26, is expected to drive significant growth and expand GHCL's product portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1738314255000,
            "Source": "corporate_action"
        },
        {
            "Title": "GHCL Reports Q3 Revenue of 7.79 Billion Rupees",
            "Summary": "GHCL, a diversified company, has announced its third-quarter revenue results. The company reported revenue of 7.79 billion rupees, which represents a slight decrease compared to the 7.97 billion rupees reported in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1738313158000,
            "Source": "earnings"
        },
        {
            "Title": "GHCL Reports Significant Increase in Q3 Net Profit",
            "Summary": "GHCL Limited has announced its financial results for the third quarter, reporting a net profit of 1.7 billion rupees. This represents a substantial increase from the 999 million rupees reported in the same quarter of the previous year, indicating a year-over-year growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1738313127000,
            "Source": "earnings"
        },
        {
            "Title": "GHCL Receives Environmental Clearance for Soda Ash Project in Gujarat",
            "Summary": "The Government of India has granted environmental clearance for GHCL's soda ash greenfield project located in Kutch, Gujarat. This approval marks a significant milestone for the company's expansion plans in the chemical sector.",
            "Sentiment": "positive",
            "PublishDate": 1733990396000,
            "Source": "corporate_action"
        },
        {
            "Title": "GHCL Receives Environmental Clearance",
            "Summary": "GHCL Limited has obtained environmental clearance for an unspecified project or operation. This approval is a crucial step for companies to proceed with activities that may have environmental impacts, ensuring compliance with environmental regulations.",
            "Sentiment": "positive",
            "PublishDate": 1733990365000,
            "Source": "corporate_action"
        },
        {
            "Title": "GHCL Approves Additional Capex for Salt Field Development",
            "Summary": "GHCL has approved an additional capital expenditure of Rs 350 crore for the development of the Zara Zumara salt field in Kutch, Gujarat. This investment demonstrates the company's commitment to expanding its salt production capabilities in the region.",
            "Sentiment": "positive",
            "PublishDate": 1732690952000,
            "Source": "corporate_action"
        },
        {
            "Title": "GHCL to Consider Approval of Additional CAPEX",
            "Summary": "GHCL Limited has announced that it will hold a meeting on November 27 to consider and potentially approve a proposal for additional capital expenditure (CAPEX).",
            "Sentiment": "neutral",
            "PublishDate": 1732269739000,
            "Source": "corporate_action"
        },
        {
            "Title": "GHCL Aims for 15% CAGR in Profit Growth",
            "Summary": "GHCL has announced in its investor presentation that the company is targeting a compound annual growth rate (CAGR) of 15% in profits over the long term. This projection indicates the company's confidence in its future performance and growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1730215088000,
            "Source": "corporate_action"
        },
        {
            "Title": "GHCL: Q2 Profit Up 8.4%, Revenue Dips Slightly",
            "Summary": "GHCL Ltd reported Q2 FY24 net profit of ₹154.8 crore, up 8.4% YoY. Revenue decreased 1.6% to ₹792.8 crore due to lower realization. EBITDA margin improved to 26.6%. Company expects normalization of production volumes and plans expansion in Vacuum Salt and Bromine.",
            "Sentiment": "neutral",
            "PublishDate": 1730212433000,
            "Source": "result"
        }
    ]
}