{
    "Symbol": "GICHSGFIN",
    "ISIN": "INE289B01019",
    "News": [
        {
            "Title": "GICHFL Appoints Ajit Salunke as Legal Head",
            "Summary": "GIC Housing Finance Limited confirms the joining of Shri Ajit Salunke as Legal Head on contract basis, effective February 02, 2026, following earlier appointment announcement in November 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770054215449,
            "Source": "stocks"
        },
        {
            "Title": "GICHFL Holds Virtual Investor Meetings on AUM, NPAs",
            "Summary": "GIC Housing Finance conducted virtual one-to-one investor meetings on January 22, 2026, discussing AUM, growth outlook, NPAs, and capital adequacy ratio as of September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769084143469,
            "Source": "stocks"
        },
        {
            "Title": "GIC Housing Finance Gets ESG Rating of 55",
            "Summary": "GIC Housing Finance Ltd receives an ESG rating of 55 from SEBI-registered ESG Risk Assessments Insights Limited based on independent research and publicly available information.",
            "Sentiment": "neutral",
            "PublishDate": 1765435355203,
            "Source": "stocks"
        },
        {
            "Title": "GIC Housing Finance Legal Head R. Lalith Kumar Retires",
            "Summary": "R. Lalith Kumar, Assistant Vice President and Legal Head at GIC Housing Finance Ltd., retired from his position on November 28, 2025, at the close of business hours. The company confirmed this was a routine retirement with no other material reasons for the senior management personnel change.",
            "Sentiment": "neutral",
            "PublishDate": 1764329641263,
            "Source": "corporate_governance"
        },
        {
            "Title": "GIC Housing Finance Receives Nil Demand Order in GST Litigation with Uttar Pradesh Authorities",
            "Summary": "GIC Housing Finance Ltd successfully resolved its litigation with GST Authorities in Uttar Pradesh, receiving a Nil Demand Order confirming no outstanding liability. The resolution eliminates potential financial exposure for the housing finance company and provides regulatory clarity for its operations.",
            "Sentiment": "positive",
            "PublishDate": 1763383855736,
            "Source": "stock"
        },
        {
            "Title": "GIC Housing Finance Reports 37% Jump in Q2 Net Profit to 500 Million Rupees",
            "Summary": "GIC Housing Finance delivered strong quarterly results with net profit rising 37% year-on-year to 500 million rupees, while revenue grew to 2.7 billion rupees from 2.64 billion rupees. The housing finance company also improved its asset quality with Stage 3 ratio declining to 4.52% from 4.74% in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1763074526172,
            "Source": "earnings"
        },
        {
            "Title": "GIC Housing Finance Reports Q2 Results, Announces Senior Management Changes and NCD Fundraising Plans",
            "Summary": "GIC Housing Finance Limited approved unaudited financial results for the quarter and half-year ended September 30, 2025, alongside appointing new senior management personnel including Ajit Salunke as Legal Head and redesignating key executives across HR, Internal Audit, and Credit departments. The board also approved General Information Document and Key Information Document for raising funds through Secured Non-Convertible Debentures on private placement basis.",
            "Sentiment": "positive",
            "PublishDate": 1763050582631,
            "Source": "earnings"
        },
        {
            "Title": "GIC Housing Finance Allots Rs 175 Crore Non-Convertible Debentures on Private Placement",
            "Summary": "GIC Housing Finance Limited has allotted 17,500 Non-Convertible Debentures with a face value of Rs 1 lakh each, raising Rs 175 crore through private placement. The Series 10 NCDs carry an interest rate of 7.65% per annum and were allotted to four institutional investors: Royal Sundaram General Insurance Co Ltd, UTI Asset Management Company Ltd, Darshaw Co Pvt Ltd, and Reliance General Insurance Company Ltd. The allotment was completed based on board authorization from May 16, 2025, and the NCDs are proposed to be listed on BSE Limited.",
            "Sentiment": "positive",
            "PublishDate": 1762439814393,
            "Source": "corporate_action"
        },
        {
            "Title": "GIC Housing Finance Appoints Dinesh Waghela as Independent Director",
            "Summary": "GIC Housing Finance Limited announced that shareholders approved the appointment of Shri Dinesh Waghela (DIN 08072065) as an Independent Director through postal ballot. The e-voting process concluded on October 30, 2025, and the company informed BSE Limited about this board appointment on October 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761915723641,
            "Source": "corporate_governance"
        },
        {
            "Title": "GIC Housing Finance Approves ₹200 Crore Debenture Fundraising at 7.65% Interest Rate",
            "Summary": "GIC Housing Finance's board has approved a fundraising plan of ₹200 crores through secured non-convertible debentures. The debentures will carry an interest rate of 7.65% and are set to mature on February 29, 2028.",
            "Sentiment": "positive",
            "PublishDate": 1761895743407,
            "Source": "corporate_action"
        },
        {
            "Title": "GICHFL Appoints Dinesh Waghela as Additional Independent Director",
            "Summary": "GICHFL's Board of Directors approved the appointment of Shri Dinesh Waghela as an Additional Director (Non-Executive-Independent Director) effective September 23, 2025, subject to shareholder approval. Waghela brings over 35 years of experience in insurance and reinsurance, holding degrees in Commerce and Law and is an Associate Member of the Insurance Institute of India. He began his career with GIC Re in 1985 and held key roles across Management, Compliances, Finance, Reinsurance, Investments and HR. He served as General Manager and held joint charge as CMD at The Oriental Insurance Co. Ltd., and was CFO at The New India Assurance Company and The Oriental Insurance Company. The company confirmed that Waghela has not been debarred from holding directorship by SEBI or any other authority, and there are no inter-se relationships between directors.",
            "Sentiment": "positive",
            "PublishDate": 1758276938641,
            "Source": "corporate_governance"
        },
        {
            "Title": "Company Shareholders Approve Key Resolutions at 35th Annual General Meeting",
            "Summary": "Shareholders approved multiple resolutions at the 35th Annual General Meeting held on August 19, 2025. The approvals included re-appointment of Shri B. S. Rahul and Smt. Girija Subramanian as Non-Executive Directors, and re-appointment of Shri Damodharan Neelam as Independent Director. Shareholders also approved appointment of Shri Sanjay Joshi as Non-Executive Director. The meeting approved appointment of M/s. Gokhale & Sathe as Statutory Auditor for 3 years, replacing M/s. Chandabhoy & Jassoobhoy, and M/s. Mehta & Mehta as Secretarial Auditor for 5 years. Additionally, shareholders approved material related party transactions with promoter companies up to ₹1,000 crores and private placement of redeemable non-convertible debentures up to ₹2,500 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1755599979071,
            "Source": "corporate_action"
        },
        {
            "Title": "GIC Housing Finance Reports Net Profit of ₹735 Lakh for Q1 FY2026",
            "Summary": "GIC Housing Finance Ltd. reported quarterly results with net profit of ₹735 lakh compared to ₹3,896 lakh in the same quarter last year. Total income decreased to ₹26,543 lakh from ₹27,718 lakh year-on-year. The company faced a loss before tax of ₹2,040 lakh but benefited from a deferred tax credit of ₹3,675 lakh. Impairment provisions increased significantly to ₹7,797 lakh from ₹2,384 lakh in the previous year quarter. The company modified its Expected Credit Loss calculation method, resulting in increased ECL provision by ₹5,416 lakh. Additionally, repossessed properties worth ₹16,889 lakh were reclassified from Assets Held for Sale to Loans, leading to additional ECL provisioning of ₹2,731 lakh. Earnings per share stood at ₹1.36 compared to ₹7.23 in the corresponding quarter last year. The Stage 3 ratio increased to 4.74% from 3.98% year-on-year, while the Provision Coverage Ratio improved to 56.01% from 36.61%.",
            "Sentiment": "negative",
            "PublishDate": 1755005691519,
            "Source": "earnings"
        },
        {
            "Title": "GIC Housing Finance Reports Q4 Results and Dividend Recommendation",
            "Summary": "GIC Housing Finance has announced its Q4 results and dividend recommendation. The company's net profit for Q4 was 351 million rupees, down from 535.9 million rupees year-over-year and 496 million rupees quarter-over-quarter. Revenue for Q4 was 2.7 billion rupees, up from 2.6 billion rupees year-over-year. The company's Stage 3 assets decreased to 3.03% from 3.47% quarter-over-quarter. GIC Housing Finance has recommended a dividend of 4.5 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747401224000,
            "Source": "result"
        },
        {
            "Title": "GIC Housing Finance to Consider Q4 Results and Fund Raising on May 16",
            "Summary": "GIC Housing Finance has announced that it will hold a meeting on May 16 to consider the company's Q4 results and approve a proposal to raise funds worth 2500 crore rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1742973618000,
            "Source": "corporate_action"
        },
        {
            "Title": "GIC Housing Finance Reports Increased Q3 Profit and Revenue",
            "Summary": "GIC Housing Finance has announced its financial results for the third quarter. The company's net profit increased to 496 million rupees, up from 356 million rupees in the same quarter last year. Revenue also saw growth, rising to 2.69 billion rupees from 2.59 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739320428000,
            "Source": "earnings"
        },
        {
            "Title": "GIC Housing Finance Reports Increased Q3 Profit and Revenue",
            "Summary": "GIC Housing Finance has announced its financial results for the third quarter. The company's net profit increased to 496 million rupees, up from 356 million rupees in the same period last year. Revenue also saw growth, rising to 2.69 billion rupees from 2.59 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739282191000,
            "Source": "earnings"
        },
        {
            "Title": "GIC Housing to Consider Q3 Results on February 11",
            "Summary": "GIC Housing Finance Limited has announced that it will review and consider its financial results for the third quarter on February 11. This meeting is likely to involve the company's board of directors examining the financial performance for the quarter ended December 31.",
            "Sentiment": "neutral",
            "PublishDate": 1737031192000,
            "Source": "result"
        },
        {
            "Title": "GIC Housing Finance Partners with India Mortgage Guarantee Corporation",
            "Summary": "GIC Housing Finance has entered into an agreement with India Mortgage Guarantee Corporation to provide credit default guarantee for select housing loan products. This partnership aims to enhance the company's risk management capabilities in its housing loan portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1736242682000,
            "Source": "corporate_action"
        },
        {
            "Title": "GIC Housing Finance Reports Improvement in Q2 Stage 3 Ratio",
            "Summary": "GIC Housing Finance's Stage 3 ratio, which is an indicator of asset quality, has improved in the second quarter. The ratio decreased to 3.78% from 3.98% in the previous quarter, suggesting a reduction in non-performing assets.",
            "Sentiment": "positive",
            "PublishDate": 1731069850000,
            "Source": "result"
        },
        {
            "Title": "GIC Housing Finance Reports Q2 FY2024 Financial Results",
            "Summary": "GIC Housing Finance announced its Q2 FY2024 financial results. The company reported a net profit of 365 million rupees, up from 302 million rupees year-over-year and 390 million rupees quarter-over-quarter. Total revenue for the quarter stood at 2.64 billion rupees, slightly down from 2.7 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731069745000,
            "Source": "result"
        },
        {
            "Title": "GIC Housing Finance Board Meeting Scheduled for Q2 Results",
            "Summary": "<p><span class=\"neutral\">GIC Housing Finance</span> has announced a <span class=\"neutral\">board meeting</span> on <b>November 8</b> to <span class=\"neutral\">consider and approve</span> the <span class=\"neutral\">financial results</span> for the <span class=\"neutral\">second quarter</span> of the current <span class=\"neutral\">fiscal year</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728565289000,
            "Source": "result"
        }
    ]
}