{
    "Symbol": "GICRE",
    "ISIN": "INE481Y01014",
    "News": [
        {
            "Title": "GIC Re Reports Strong Q3 FY26 Performance",
            "Summary": "General Insurance Corporation of India showcases robust financial metrics with INR 32,976 crores GWP in 9M FY25-26, improved combined ratio of 106.9%, and strong solvency position at 387%.",
            "Sentiment": "positive",
            "PublishDate": 1770714182865,
            "Source": "stocks"
        },
        {
            "Title": "GIC Re Reports Strong Q3FY26 Performance",
            "Summary": "General Insurance Corporation of India reported robust nine-month results with gross premium income rising 7.11% to ₹32,976.26 crore and profit after tax surging 35.84% to ₹6,137.94 crore.",
            "Sentiment": "positive",
            "PublishDate": 1770471227341,
            "Source": "co_actions_results"
        },
        {
            "Title": "GIC India Board Meet on Feb 7 for Q3FY26 Results",
            "Summary": "General Insurance Corporation of India announces board meeting scheduled for February 7, 2026, to consider and approve Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769793849734,
            "Source": "co_actions_results"
        },
        {
            "Title": "GIC Re Appoints New CVO Under SEBI Regulation 30",
            "Summary": "General Insurance Corporation of India announces permanent transfer of Shri Uday Laxmandas Devi as Chief Vigilance Officer from Oriental Insurance to GIC Re, effective immediately until August 2028.",
            "Sentiment": "neutral",
            "PublishDate": 1769791080540,
            "Source": "stocks"
        },
        {
            "Title": "GIC Re Renews Appointed Actuary for One Year",
            "Summary": "General Insurance Corporation of India announces renewal of Shri Sateesh Bhat's appointment as Appointed Actuary and Key Managerial Personnel for one year effective January 20, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768889202599,
            "Source": "stocks"
        },
        {
            "Title": "GIC Re Appoints New Chief Vigilance Officer",
            "Summary": "General Insurance Corporation of India announces appointment of Shri Uday Laxmandas Devi as Chief Vigilance Officer with additional charge from December 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767377815888,
            "Source": "stocks"
        },
        {
            "Title": "GIC Re Gets CARE AAA Rating Reaffirmation",
            "Summary": "General Insurance Corporation of India receives reaffirmed CARE AAA rating with stable outlook from CARE Ratings Ltd, maintaining its strong credit profile in the insurance sector.",
            "Sentiment": "positive",
            "PublishDate": 1767254465559,
            "Source": "stocks"
        },
        {
            "Title": "GICRe Corrects Combined Ratio Error in Investor Presentation",
            "Summary": "General Insurance Corporation of India revised its investor presentation to correct a typographical error showing combined ratio as 117.9% instead of the accurate 108.8% on standalone basis. The correction was made in compliance with SEBI regulations with no other changes to the presentation content.",
            "Sentiment": "neutral",
            "PublishDate": 1764590309704,
            "Source": "corporate_action"
        },
        {
            "Title": "GIC Re Reports Strong Q2 FY26 Results with Combined Ratio Improving to 109.15%",
            "Summary": "General Insurance Corporation of India delivered improved quarterly performance with gross premium income rising to INR 9,601.70 crores and profit after tax increasing to INR 2,866.79 crores, while combined ratio improved to 109.15% from 114.05% year-on-year. The reinsurer maintained disciplined underwriting approach amid global uncertainties, with domestic premium growing 4.6% and international premium up 9.4%, though life segment faced challenges with 114% combined ratio due to reserve strengthening.",
            "Sentiment": "positive",
            "PublishDate": 1763724184547,
            "Source": "earnings"
        },
        {
            "Title": "GIC Re Reports Strong Q2 FY2026 Performance with 107.7% Combined Ratio and 19.8% ROE",
            "Summary": "General Insurance Corporation of India presented its quarterly results showing improved combined ratio of 107.7% and annualized ROE of 19.8%, with gross written premium of Rs 21,990 crores and profit after tax of Rs 4,619 crores. The reinsurer maintains its market leadership position with 51% domestic market share, healthy solvency ratio of 385%, and strong financial metrics across its diversified portfolio spanning 137 countries.",
            "Sentiment": "positive",
            "PublishDate": 1763175489114,
            "Source": "earnings"
        },
        {
            "Title": "GIC Re Reports 55.6% Jump in Profit Before Tax to ₹5,716 Crore for Half-Year Ended September 2025",
            "Summary": "General Insurance Corporation of India (GIC Re) announced its financial results for the half-year ended September 30, 2025. Gross Premium Income increased to ₹21,989.71 crore compared to ₹20,819.16 crore in the same period last year. Profit Before Tax rose 55.58% to ₹5,716.30 crore from ₹3,674.29 crore. Profit After Tax increased 59.43% to ₹4,619.02 crore versus ₹2,897.12 crore previously. The Incurred Claims ratio improved to 86.45% from 91.58%. Underwriting Loss reduced by 45.50% to ₹1,295.47 crore. Gross Investment Income was ₹6,986.77 crore compared to ₹6,166.41 crore. Solvency Ratio stood at 3.85 versus 3.42 in the previous year. Total Assets increased 1.91% to ₹1,98,612.62 crore. Net Worth (without fair value change account) reached ₹46,669.38 crore against ₹39,481.33 crore. Combined Ratio improved to 107.71% from 111.64%. The company has started providing Catastrophic Reserve on a quarterly basis instead of annually.",
            "Sentiment": "positive",
            "PublishDate": 1762995949127,
            "Source": "earnings"
        },
        {
            "Title": "General Insurance Corporation of India Appoints Deepak C.S. as Company Secretary and Compliance Officer",
            "Summary": "General Insurance Corporation of India's Board of Directors appointed Mr. Deepak C.S. as Company Secretary, Compliance Officer and Key Managerial Personnel. Deepak C.S. holds Fellowship membership of ICSI with membership number FCS-5060 and brings over 25 years of experience in secretarial operations and corporate compliance across listed companies. His background spans aviation, manufacturing, banking, and chemicals sectors, with previous roles including Company Secretary at GMR Hyderabad International Airport Ltd. and Senior General Manager and Company Secretary at APL Apollo Tubes Ltd. The appointment is effective from the date of taking charge, with the specific effective date to be communicated to stock exchanges later.",
            "Sentiment": "positive",
            "PublishDate": 1762995288695,
            "Source": "corporate_governance"
        },
        {
            "Title": "General Insurance Corp Reports 54% Jump in Q2 Net Profit to 28.7B Rupees",
            "Summary": "General Insurance Corp reported a net profit of 28.7 billion rupees for Q2, representing a 54% increase from 18.6 billion rupees in the same period last year. The company's revenue grew marginally to 89.2 billion rupees compared to 88.4 billion rupees year-over-year. The gross non-performing assets (GNPA) ratio improved to 1.06% from 1.09% in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762963761891,
            "Source": "earnings"
        },
        {
            "Title": "GIC Re Schedules Q2 FY26 Results Announcement and Earnings Call",
            "Summary": "General Insurance Corporation of India (GIC Re) will announce its second quarter FY26 results on November 12, 2025, followed by an earnings conference call on November 17, 2025 at 12:00 hrs IST. The earnings call will be hosted by Mr. Hitesh Joshi, Executive Director with Additional Charge of CMD, along with top management members to discuss the financial results for the period ended September 30, 2025. GIC Re is India's largest reinsurance company, accounting for approximately 51% of premiums ceded by Indian insurers to reinsurers during FY24. The company operates through its home office in Mumbai and has international presence through branch offices in London and Kuala Lumpur, with subsidiaries in the United Kingdom, South Africa, and Russia.",
            "Sentiment": "neutral",
            "PublishDate": 1762436991844,
            "Source": "earnings"
        },
        {
            "Title": "GIC Re Appoints Hitesh Joshi as Interim CMD with Administrative Powers",
            "Summary": "The Ministry of Finance has approved the entrustment of Chairman-cum-Managing Director powers to Hitesh Ramesh Chandra Joshi, Executive Director at General Insurance Corporation of India (GIC-Re). The appointment is effective from October 1, 2025, for three months or until a regular CMD is appointed. Joshi holds a post-graduate degree in Accountancy from Mumbai University and a Master's in Financial Management from Jamnalal Bajaj Institute. He has experience across reinsurance, retrocession, finance, internal audit, and investor relations. In his Executive Director role, he oversees International Business Operations, Human Resources, Information Technology, and Actuarial functions. Joshi is not related to existing directors and faces no regulatory restrictions.",
            "Sentiment": "neutral",
            "PublishDate": 1761319882040,
            "Source": "corporate_governance"
        },
        {
            "Title": "General Insurance Corporation of India Announces Rs. 10 Per Share Dividend with Tax Deduction Guidelines",
            "Summary": "General Insurance Corporation of India's Board of Directors recommended a dividend of Rs. 10 per equity share (nominal value Rs. 5 each) for the financial year ended March 31, 2025, subject to shareholder approval at the 53rd Annual General Meeting. The record date is set for September 5, 2025, with payment within 30 days of AGM approval. Due to Finance Act 2020 amendments, dividend income is now taxable in shareholders' hands, requiring the company to deduct tax at source. For resident shareholders, TDS rates are: nil for dividends up to Rs. 10,000, 10% for amounts exceeding Rs. 10,000 (with PAN), and 20% without PAN or unlinked Aadhaar. Non-resident shareholders face 20% TDS plus surcharge and cess, unless they provide required documentation for tax treaty benefits. The company has issued detailed guidelines for various shareholder categories including insurance companies, mutual funds, and other exempt entities to claim TDS exemptions by submitting appropriate forms and declarations before September 5, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755177150455,
            "Source": "corporate_action"
        },
        {
            "Title": "General Insurance Corporation Reports 70% Jump in Profit After Tax for Q1 FY2026",
            "Summary": "General Insurance Corporation of India reported profit after tax of ₹1,752.22 crores, up 70% year-on-year for Q1 FY2026. Profit before tax increased 61.04% to ₹2,243.54 crores. Gross premium income remained flat at ₹12,388.01 crores compared to ₹12,405.68 crores in the previous year. The combined ratio improved to 106.94% from 109.6% in Q1 FY2025. Gross investment income rose 18.37% to ₹3,228.51 crores. The company's solvency ratio strengthened to 3.85% from 3.36%, while net worth grew 17.19% to ₹45,275.48 crores. Management projects overall growth of 9-10% for FY2026, with domestic business expected to grow 6.5-7% and international business 17-20%. The company is focusing on underwriting discipline and profitable growth rather than top-line expansion, while expanding into new lines like surety, cyber, and trade credit insurance.",
            "Sentiment": "positive",
            "PublishDate": 1754981750288,
            "Source": "earnings"
        },
        {
            "Title": "General Insurance Corp Reports 68% Jump in Quarterly Net Profit to 17.5B Rupees",
            "Summary": "General Insurance Corp reported net profit of 17.5 billion rupees for the first quarter, representing a significant increase from 10.4 billion rupees in the same period last year. The company's revenue also grew to 111 billion rupees compared to 100.6 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754577913344,
            "Source": "earnings"
        },
        {
            "Title": "UCO Bank MD & CEO Ashwani Kumar Appointed as Non-Executive Director at General Insurance Corporation",
            "Summary": "The Ministry of Finance appointed Shri Ashwani Kumar, MD & CEO of UCO Bank, as a Non-executive director on the Board of General Insurance Corporation of India, effective July 30, 2025. The appointment is for three years or until the end of his tenure at UCO Bank, whichever is earlier. Kumar replaces Smt. A. Manimekhalai on the board. Kumar is a Chartered Accountant with over two decades of banking experience across multiple public sector banks including Bank of Baroda, Corporation Bank, Oriental Bank of Commerce, Punjab National Bank, and Indian Bank. He previously served as Executive Director of Indian Bank before joining UCO Bank as MD & CEO.",
            "Sentiment": "neutral",
            "PublishDate": 1754329862675,
            "Source": "corporate_governance"
        },
        {
            "Title": "GIC Re Schedules Earnings Call for August 8, 2025 to Discuss Q1FY26 Results",
            "Summary": "General Insurance Corporation of India (GIC Re) will announce its Q1FY26 results on August 7, 2025, followed by an earnings call with analysts and investors on August 8, 2025 at 11:00 AM IST. The call will be led by Chairman and Managing Director Mr. Ramaswamy N along with other top management members. GIC Re is India's largest reinsurance company, accounting for approximately 51% of premiums ceded by Indian insurers to reinsurers during FY24. The company provides reinsurance across multiple business lines including fire, marine, motor, engineering, agriculture, aviation, health, liability, credit, and life insurance. GIC Re operates through its Mumbai headquarters, branch offices in London and Kuala Lumpur, and subsidiaries in the UK, South Africa, and Russia, with a Lloyd's syndicate operational since April 2018. The company holds an 'A-' rating from AM Best.",
            "Sentiment": "neutral",
            "PublishDate": 1754311219190,
            "Source": "earnings"
        },
        {
            "Title": "General Insurance Corporation of India's General Manager Saroj Kumar Rath Retires Upon Superannuation",
            "Summary": "Saroj Kumar Rath, General Manager at General Insurance Corporation of India, has ceased to be part of the company's Senior Management effective July 31, 2025, after reaching superannuation age. The company disclosed this change in senior management to BSE and NSE stock exchanges. Satheesh Kumar, serving as CS & Compliance Officer, signed the disclosure document.",
            "Sentiment": "neutral",
            "PublishDate": 1753970174022,
            "Source": "corporate_governance"
        },
        {
            "Title": "General Insurance Corporation of India Appoints Tapan Kumar Mondal as Government Nominee Director",
            "Summary": "The Ministry of Finance has nominated Shri Tapan Kumar Mondal, Deputy Secretary of the Department of Financial Services, as Director on the Board of General Insurance Corporation of India, effective July 24, 2025. Mondal is a Central Secretariat Service officer from the 1990 batch with a B.Sc. degree from University of Calcutta. He has experience across various government departments including DGS&D, Department of Industrial Policy and Promotion, and Ministry of Defence. He works as Deputy Secretary (Vigilance) in the Department of Financial Services and serves as Nodal Officer for Andaman & Nicobar Islands Union Territory Level Bankers' Committee. The company confirmed that Mondal is not related to any existing directors and is not debarred from holding directorship by any regulatory authority.",
            "Sentiment": "neutral",
            "PublishDate": 1753805083689,
            "Source": "corporate_governance"
        },
        {
            "Title": "GICRE Reports Tax Demand Reduction of 562.4 Million Rupees",
            "Summary": "GICRE experienced a decrease in tax demand amounting to 562.4 million rupees. The company saw its tax obligations reduced by this significant amount.",
            "Sentiment": "positive",
            "PublishDate": 1753794022103,
            "Source": "stock"
        },
        {
            "Title": "General Insurance Corporation of India Appoints Ms. Jayashri Balkrishna as Executive Director",
            "Summary": "Ms. Jayashri Balkrishna has assumed the office of Executive Director at General Insurance Corporation of India effective July 23, 2025. She is a Post-Graduate in Commerce from Mumbai University, a Fellow of the Insurance Institute of India, and an Associate of the Chartered Insurance Institute, London. During her tenure at the corporation, she has managed investments operations and accounts, reinsurance operations including claims management, audit department, budgeting and forecasting, corporate communications, credit rating, broker relationship management and investor relations. She was serving as Chief Risk Officer overseeing Enterprise Risk Management, Corporate Social Responsibility, Investment Mid and Back Office operations, and management of Investment Non-Performing Assets. She is not related to any existing Directors of the Corporation and is not debarred from holding office of Director. She currently holds 1,222 equity shares in the Corporation.",
            "Sentiment": "positive",
            "PublishDate": 1753291984810,
            "Source": "corporate_governance"
        },
        {
            "Title": "GIC Re: Dubai Branch Receives Rs 90-Crore VAT Demand Notice",
            "Summary": "GIC Re's Dubai branch has received a VAT demand notice of approximately Rs 90.42 crore from the UAE's Federal Tax Authority for discrepancies in VAT returns from January 2018 to December 2020. The company plans to file a reconsideration request and states there is no material impact on financials or operations.",
            "Sentiment": "neutral",
            "PublishDate": 1751118582000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Government Considers Accelerating GIC Share Sale",
            "Summary": "The government is reportedly considering speeding up the sale of shares in GIC (General Insurance Corporation of India). No specific details about the timeline, amount of shares to be sold, or reasons for the potential acceleration were provided in the brief news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1750908566000,
            "Source": "default"
        },
        {
            "Title": "GIC Re: Q4 Profit Drops 17% on Negative Underwriting Performance",
            "Summary": "GIC Re reported a 17% decline in Q4 FY25 net profit to Rs 2,183 crore due to weaker underwriting performance. Combined ratio rose to 103.56%, resulting in an underwriting loss of Rs 392 crore. Gross premium income increased to Rs 10,367 crore. The board recommended a dividend of Rs 10 per share. Solvency ratio improved to 3.70.",
            "Sentiment": "negative",
            "PublishDate": 1748311363000,
            "Source": "earnings"
        },
        {
            "Title": "General Insurance Corporation of India: Q4 Profit Drops 17%, Dividend Proposed",
            "Summary": "GIC Re reported a 17% decline in Q4 net profit to ₹2,183 crore. Gross premium increased to ₹10,367 crore. The company proposed a dividend of ₹10 per share. Full-year profit rose 3% to ₹6,701 crore. Solvency ratio improved to 3.70.",
            "Sentiment": "neutral",
            "PublishDate": 1748276875000,
            "Source": "earnings"
        },
        {
            "Title": "General Insurance Corp Reports Q4 Results and Dividend Recommendation",
            "Summary": "General Insurance Corp has announced its Q4 results and dividend recommendation. The company's board has recommended a dividend of 10 rupees per equity share. For Q4, the Gross Non-Performing Assets (GNPA) stood at 1.13%, down from 1.81% in the previous quarter. Revenue increased to 113.64 billion rupees from 92.22 billion rupees year-over-year. However, the standalone net profit decreased to 21.83 billion rupees from 26.4 billion rupees year-over-year, but increased from 16.21 billion rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748271360000,
            "Source": "result"
        },
        {
            "Title": "Value Attics Reinsurance to Become First Private Sector Reinsurer After GIC Re",
            "Summary": "According to CNBC TV18, Value Attics Reinsurance is set to become the first private sector reinsurer in India after General Insurance Corporation of India (GIC Re). This development marks a significant change in the Indian reinsurance landscape, which has been dominated by the state-owned GIC Re.",
            "Sentiment": "neutral",
            "PublishDate": 1741857092000,
            "Source": "corporate_action"
        },
        {
            "Title": "General Insurance Corp Reports Increased Q3 Profit and Premium Earnings",
            "Summary": "General Insurance Corporation (GIC) has reported a rise in its third-quarter net profit to 16.2 billion rupees, up from 15.18 billion rupees in the same period last year. The company's premium earned also increased to 85.39 billion rupees from 77.58 billion rupees year-over-year. Additionally, GIC's Gross Non-Performing Assets (GNPA) slightly improved to 1.81% compared to 1.83% in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738627888000,
            "Source": "earnings"
        },
        {
            "Title": "General Insurance Corporation Reports Q3 FY2024 Financial Results",
            "Summary": "General Insurance Corporation (GIC) has announced its financial results for the third quarter. The company reported a net profit of 16.2 billion rupees, up from 15.18 billion rupees in the same quarter last year. Premium earned increased to 85.39 billion rupees from 77.58 billion rupees year-over-year. The Gross Non-Performing Assets (GNPA) ratio slightly improved to 1.81% from 1.83% in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738593506000,
            "Source": "earnings"
        },
        {
            "Title": "General Insurance Corporation of India: GIC Re Targets ₹41,000 Crore Premium in FY25",
            "Summary": "GIC Re expects 10% growth in premiums for the fiscal year 2025, aiming to reach ₹41,000 crore. This information was shared by the company's CMD Narayanan.",
            "Sentiment": "positive",
            "PublishDate": 1736063096000,
            "Source": "normal_news"
        },
        {
            "Title": "General Insurance Corp Reports Q2 Profit Increase",
            "Summary": "General Insurance Corp has reported a net profit of 18.6 billion rupees for Q2, up from 16.05 billion rupees year-over-year and 10.4 billion rupees quarter-over-quarter. However, the premium earned (net) decreased to 88.4 billion rupees from 99.58 billion rupees year-over-year. The Gross Non-Performing Assets (GNPA) slightly improved to 1.83% from 1.89% in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731455693000,
            "Source": "result"
        },
        {
            "Title": "GIC Re: Credit Ratings Upgraded to 'A-' by AM Best",
            "Summary": "<p>AM Best has <span class='positive'>upgraded</span> GIC Re's Financial Strength Rating and Long-Term Issuer Credit Rating to <span class='positive'>'A-' (Excellent)</span> from <span class='neutral'>'B++' (Good)</span>. The outlook for both ratings is <span class='positive'>stable</span>. The upgrade reflects GIC Re's <span class='positive'>strong balance sheet</span> and <span class='positive'>improved risk-adjusted capitalisation</span>. GIC Re is now <b>ranked as the 10th largest reinsurer globally</b> according to AM Best's latest rankings.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728659981000,
            "Source": "normal_news"
        }
    ]
}