{
    "Symbol": "GILLANDERS",
    "ISIN": "INE047B01011",
    "News": [
        {
            "Title": "Gillanders Arbuthnot Q3 FY26 Results Announced",
            "Summary": "Gillanders Arbuthnot reported Q3 FY26 standalone net profit of Rs 596.99 lakhs vs Rs 1,522.76 lakhs in Q3 FY25. Revenue from operations declined to Rs 10,408.71 lakhs from Rs 12,358.22 lakhs year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1770364564666,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gillanders Arbuthnot Board Meet Set for Feb 6",
            "Summary": "Gillanders Arbuthnot schedules board meeting on February 6, 2026 to approve Q3FY26 unaudited financial results. Trading window remains closed until 48 hours post-declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1769756622743,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gillanders Arbuthnot Reports Mixed Quarterly Performance with Tea Division Leading Growth",
            "Summary": "Gillanders Arbuthnot posted quarterly results for the period ended September 30, 2025, with Tea division generating Rs. 6,964.03 lakhs revenue while Textiles division reported losses of Rs. 78.34 lakhs before tax and interest. The company invested USD 50,000 in its Mauritius subsidiary during the quarter, with consolidated total income reaching Rs. 13,490.69 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1763061392348,
            "Source": "earnings"
        },
        {
            "Title": "Gillanders Arbuthnot Commences Commercial Production at New Structural Fabrication Workshop",
            "Summary": "Gillanders Arbuthnot and Company Limited has started commercial production at its newly established structural fabrication workshop within the Engineering Division (MICCO). The facility has a production capacity of 300 MT per annum. The company had previously provided intimation about this development on August 7, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758279270492,
            "Source": "stock"
        },
        {
            "Title": "Gillanders Arbuthnot Appoints New Company Secretary and Establishes Engineering Workshop",
            "Summary": "Gillanders Arbuthnot and Company Limited appointed Ms. Neha Singh as Company Secretary and Compliance Officer effective August 12, 2025. Singh, a Fellow Member of the Institute of Company Secretaries of India with over 11 years of experience, will serve as Key Managerial Personnel and is authorized to determine materiality of events for stock exchange disclosures. She previously served as Company Secretary at Texmaco Infrastructure & Holdings Limited and has expertise in SEBI regulations and capital market transactions. The Board also approved establishing a new structural fabrication workshop for its Engineering Division (MICCO) in Hoogly, West Bengal, with production capacity of 300 MT per annum. The company will inform stock exchanges when commercial production begins.",
            "Sentiment": "positive",
            "PublishDate": 1754568933293,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gillanders Arbuthnot Reports Quarterly Loss and Amends Insider Trading Code",
            "Summary": "Gillanders Arbuthnot and Company Limited approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported a standalone loss of Rs. 409 lakhs compared to Rs. 723.98 lakhs loss in the same quarter last year. Revenue from operations declined to Rs. 7,812.12 lakhs from Rs. 8,137.46 lakhs year-over-year. On a consolidated basis, the company posted a loss of Rs. 545.52 lakhs versus Rs. 982.22 lakhs loss in the previous year quarter. The Board also approved amendments to the Code of Practices & Procedures for Fair Disclosure of Unpublished Price Sensitive Information to align with regulatory requirements. The company operates across four segments: Tea, Engineering (MICCO), Textiles, and Property, with mixed performance across divisions.",
            "Sentiment": "negative",
            "PublishDate": 1754567677999,
            "Source": "earnings"
        },
        {
            "Title": "Gillanders Arbuthnot Reports Significant Profit Increase in Q2",
            "Summary": "Gillanders Arbuthnot has reported a substantial increase in its consolidated net profit for the second quarter. The company's net profit rose to 215 million rupees, compared to 36 million rupees in the same period last year. Additionally, the company's revenue increased to 1.3 billion rupees from 1 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731483262000,
            "Source": "result"
        }
    ]
}