{
    "Symbol": "GILLETTE",
    "ISIN": "INE322A01010",
    "News": [
        {
            "Title": "Gillette India Q3FY26 Results: 37% Profit Jump",
            "Summary": "Gillette India reports strong Q3FY26 performance with net profit rising 37% to Rs 172.46 crore. Company declares interim dividend of Rs 180 per share including Rs 60 special dividend.",
            "Sentiment": "positive",
            "PublishDate": 1769676256432,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gillette India Board to Consider Interim Dividend",
            "Summary": "Gillette India Limited has scheduled a board meeting for January 29, 2026, to consider declaring an interim dividend for FY26, as announced in their regulatory filing to stock exchanges.",
            "Sentiment": "positive",
            "PublishDate": 1768979097207,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gillette India Appoints Rohini Venkateswaran as Director",
            "Summary": "Gillette India shareholders approve appointment of Ms. Rohini Venkateswaran as Whole-time Director for five years via postal ballot, effective October 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1768221381743,
            "Source": "stocks"
        },
        {
            "Title": "Gillette India appoints Rohini Venkateswaran as Director",
            "Summary": "Gillette India Limited successfully completed postal ballot voting on January 12, 2026, approving the appointment of Ms. Rohini Venkateswaran as Whole-time Director with 96.36% shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1768221065600,
            "Source": "stocks"
        },
        {
            "Title": "Gillette India's Independent Director C P Gurnani Resigns",
            "Summary": "C P Gurnani resigned as Independent Director of Gillette India Limited effective January 6, 2026, citing personal reasons and increasing professional commitments.",
            "Sentiment": "neutral",
            "PublishDate": 1767761753291,
            "Source": "stocks"
        },
        {
            "Title": "Gillette India Limited Announces Director Changes: P.M. Srinivas Resigns, Rohini Venkateswaran Appointed",
            "Summary": "Gillette India Limited announced leadership changes at the director level. P.M. Srinivas resigned from his position as Executive Director effective October 30, 2025, citing other professional commitments, though he will continue as Chief Human Resources Officer. The Board of Directors appointed Ms. Rohini Venkateswaran as Additional Executive Director for five years, effective October 31, 2025. Venkateswaran serves as Head of Sales at the company and has extensive experience with Procter & Gamble across multiple geographies including India, Gulf countries, Dubai, and USA since 2005. She holds a Mechanical Engineering degree from RV College of Engineering, Bangalore, and an MBA from S.P. Jain Institute of Management, Mumbai. Her appointment is subject to Director Identification Number allotment and she will hold office until the 42nd Annual General Meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1761841049750,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gillette India Reports Quarterly Financial Results for September 2025",
            "Summary": "Gillette India Limited's Board of Directors approved unaudited financial results for the quarter ended September 30, 2025. The company operates two main segments: Grooming (producing shaving systems, cartridges, blades, toiletries) and Oral Care (toothbrushes and oral care products). For the quarter, Grooming segment revenue was ₹66,593 lakhs compared to ₹57,693 lakhs in the previous quarter, while Oral Care segment revenue was ₹14,488 lakhs versus ₹12,970 lakhs. Total income reached ₹81,081 lakhs. The company's cash and cash equivalents increased to ₹58,958 lakhs from ₹41,545 lakhs. Total assets stood at ₹249,617 lakhs while total equity was ₹162,872 lakhs. The financial results were reviewed by the Audit Committee and received limited review from statutory auditors.",
            "Sentiment": "neutral",
            "PublishDate": 1761832377752,
            "Source": "earnings"
        },
        {
            "Title": "Gillette India Reports Growth in Q2 Financial Performance",
            "Summary": "Gillette India reported Q2 net profit of 1.44 billion rupees compared to 1.33 billion rupees in the same period last year. Revenue increased to 8.1 billion rupees from 7.82 billion rupees year-over-year. EBITDA rose to 2.07 billion rupees versus 1.9 billion rupees, while EBITDA margin improved to 25.62% from 24.36%.",
            "Sentiment": "positive",
            "PublishDate": 1761819659137,
            "Source": "earnings"
        },
        {
            "Title": "Gillette India Reports Strong Nine-Month Performance with ₹418 Crore Profit",
            "Summary": "Gillette India Limited reported revenue of ₹2,235 crore and profit after tax of ₹418 crore for the nine-month period ended March 31, 2025. The company changed its financial year from July-June to April-March cycle, making this a transitional nine-month period. The Board recommended a final dividend of ₹47 per share, bringing total dividend for the period to ₹112 per share including interim dividend of ₹65. The grooming segment contributed 83.41% of turnover while oral care segment accounted for 16.59%. The company maintained strong market leadership in blades and razors category and continued its P&G Shiksha CSR program impacting over 50 lakh children.",
            "Sentiment": "positive",
            "PublishDate": 1754663810755,
            "Source": "earnings"
        },
        {
            "Title": "Gillette India Reports Strong Q1 Growth with Revenue Rising to 7.07 Billion Rupees",
            "Summary": "Gillette India delivered robust quarterly performance with revenue increasing to 7.07 billion rupees from 6.45 billion rupees in the previous year. Net profit grew to 1.46 billion rupees compared to 1.16 billion rupees year-over-year. The company's EBITDA rose to 2.1 billion rupees from 1.76 billion rupees, while EBITDA margin improved to 29.75% from 27.2% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1753946832735,
            "Source": "earnings"
        },
        {
            "Title": "Gillette India Appoints Kapil Sharma as Category Head - Grooming",
            "Summary": "Gillette India Limited has appointed Kapil Sharma as Category Head - Grooming, effective August 1, 2025. Sharma replaces Abhishek Desai, who has been promoted to a regional leadership role for Asia, Middle East and Africa, based in Dubai. Desai will step down from P&G India's leadership team on August 31, 2025, and relocate on September 1, 2025. Sharma currently leads Global Digital Commerce and Superior Retail Execution for P&G in Cincinnati, USA, and has experience in digital commerce, brand strategy, and global sales across multiple regions. He joined P&G in 2001 and holds an MBA from S.P. Jain Institute of Management & Research, Mumbai, and a degree in Electrical Engineering from the Institute of Engineering & Technology, Lucknow.",
            "Sentiment": "neutral",
            "PublishDate": 1753881827710,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gillette India: Q3 Revenue Grows 12.7%, Nirmal Bang Maintains 'Buy'",
            "Summary": "Gillette India reported Q3 FY25 revenue growth of 12.7% YoY to Rs 7.7 billion, exceeding estimates. EBITDA increased 40% YoY to Rs 2.3 billion. Nirmal Bang maintains a 'Buy' rating and raises the target price, citing a healthy outlook.",
            "Sentiment": "positive",
            "PublishDate": 1748438224000,
            "Source": "earnings"
        },
        {
            "Title": "Gillette India: Quarterly Profit Surges 60% on Strong Grooming Demand",
            "Summary": "Gillette India reported a 60% increase in Q3 profit, reaching 1.59 billion rupees. The grooming segment revenue grew 15.6% to 6.45 billion rupees. Shares rose nearly 10% post-results. The company increased ad spend by 61% to drive sales.",
            "Sentiment": "positive",
            "PublishDate": 1748252970000,
            "Source": "earnings"
        },
        {
            "Title": "Gillette India Reports Q4 Results and Declares Dividend",
            "Summary": "Gillette India announced its Q4 financial results. The company's EBITDA increased to 2.26 billion rupees from 1.6 billion rupees year-over-year. The EBITDA margin improved to 29.42% from 23.70% in the same period last year. Additionally, Gillette India declared a dividend of 47 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1748250236000,
            "Source": "result"
        },
        {
            "Title": "Gillette India Reports Strong Q4 Results",
            "Summary": "Gillette India has reported its Q4 financial results. The company's net profit increased to 1.59 billion rupees, up from 991 million rupees in the same quarter last year. Revenue for Q4 rose to 7.7 billion rupees, compared to 6.81 billion rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1748250196000,
            "Source": "result"
        },
        {
            "Title": "Gillette India to Consider Q4 Results on May 26",
            "Summary": "Gillette India has announced that it will consider and approve its financial results for the fourth quarter on May 26.",
            "Sentiment": "neutral",
            "PublishDate": 1742998969000,
            "Source": "result"
        },
        {
            "Title": "Gillette India: Share Price Surges 12% Post Q3 Results, Ahead of Dividend",
            "Summary": "Gillette India's share price jumped over 12% following Q3 results announcement. The stock reached ₹8,415.45 on BSE. This surge comes before the ₹65 per share dividend record date set for February 19, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1739862991000,
            "Source": "result"
        },
        {
            "Title": "Gillette India Reports Q3 Profit and Revenue Growth",
            "Summary": "Gillette India has announced its financial results for the third quarter. The company's net profit increased to 1.3 billion rupees from 1 billion rupees in the same period last year. Revenue also saw growth, rising to 6.9 billion rupees from 6.4 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739175149000,
            "Source": "earnings"
        },
        {
            "Title": "Gillette India: Board to Consider Interim Dividend for FY25",
            "Summary": "Gillette India's board will meet on February 10 to consider an interim dividend for FY25. The record date is set for February 19. The company will also approve financial statements for the quarter ended December 31, 2024. This potential dividend follows previous payouts in February and November 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1739155272000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gillette India to Consider Q3 Results on February 10",
            "Summary": "Gillette India has announced that it will consider and approve its financial results for the third quarter on February 10. This indicates the company is preparing to disclose its performance for the latest fiscal period to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1735374053000,
            "Source": "earnings"
        },
        {
            "Title": "P&G Increases Sourcing of Stainless Steel from India for Gillette Razor Blades",
            "Summary": "Procter & Gamble (P&G) is reportedly increasing its reliance on stainless steel sourced from India for the production of Gillette razor blades. This shift in sourcing strategy suggests a growing importance of Indian suppliers in P&G's global supply chain for its Gillette brand.",
            "Sentiment": "positive",
            "PublishDate": 1733396844000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gillette India: Stock Soars 27% Post Strong Q2 Results",
            "Summary": "Gillette India's stock has surged 27.33% in 7 sessions following impressive Q2 results. The company reported a 17% YoY revenue increase to ₹782 crore, with a 43% rise in PAT to ₹133 crore. The stock hit a new all-time high of ₹10,625, showing a 142.5% gain over the past 18 months.",
            "Sentiment": "positive",
            "PublishDate": 1730807333000,
            "Source": "result"
        },
        {
            "Title": "Gillette India Reports Strong Q2 Financial Performance",
            "Summary": "Gillette India has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased from 1.4 billion rupees to 1.9 billion rupees. Additionally, the EBITDA margin expanded from 20.63% to 24.36% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730134371000,
            "Source": "result"
        },
        {
            "Title": "Gillette India Reports Q2 Revenue Growth",
            "Summary": "Gillette India announced its second-quarter revenue of 7.82 billion rupees, compared to 6.7 billion rupees in the same period last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730134363000,
            "Source": "result"
        },
        {
            "Title": "Gillette India Reports Strong Q2 Profit Growth",
            "Summary": "Gillette India has announced its Q2 financial results, reporting a net profit of 1.33 billion rupees. This represents a significant year-over-year increase from 927 million rupees in the same quarter last year. The company also showed quarter-over-quarter growth, up from 1.16 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730134353000,
            "Source": "result"
        },
        {
            "Title": "Gillette India: Q1 Profit Soars 43.5% on Strong Grooming Demand",
            "Summary": "Gillette India reported a 43.5% increase in Q1 FY25 profit to ₹133 crore, driven by 23% growth in its core grooming segment. Total revenue grew 17.1%, with rural demand recovering. The company increased its advertising budget by 11% to capture market growth.",
            "Sentiment": "positive",
            "PublishDate": 1730121025000,
            "Source": "result"
        }
    ]
}