{
    "Symbol": "GINNIFILA",
    "ISIN": "INE424C01010",
    "News": [
        {
            "Title": "Ginni Filaments Reports Strong Q2 Performance with 31.7% Revenue Growth",
            "Summary": "Ginni Filaments Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported revenue from operations of ₹9,503.37 lakhs for the quarter, compared to ₹7,215.44 lakhs in the same period last year, representing a 31.7% increase. Net profit from continuing operations reached ₹1,002.86 lakhs versus ₹91.62 lakhs in the previous year quarter. For the half-year period, revenue grew to ₹19,657.86 lakhs from ₹13,471.85 lakhs, while net profit from continuing operations increased to ₹2,477.98 lakhs from ₹444.22 lakhs. The company's Board of Directors approved the closure of its Garment Division in May 2025, with related operations now classified as discontinued. The textile segment generated ₹5,744.71 lakhs in revenue for the quarter, while consumer products contributed ₹3,602.79 lakhs. Basic and diluted earnings per share from continuing operations stood at ₹1.17 for the quarter. The company's total assets increased to ₹30,649.19 lakhs from ₹33,598.45 lakhs in March 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762981612548,
            "Source": "earnings"
        },
        {
            "Title": "Fire at Ginni Filaments' Gujarat Nonwoven Unit Causes Minor Equipment Damage, Halts Production",
            "Summary": "A fire broke out at Ginni Filaments' nonwoven manufacturing unit in Gujarat, resulting in minor equipment damage. No injuries were reported from the incident. The company has temporarily halted production at the facility and has alerted insurance providers for damage evaluation.",
            "Sentiment": "negative",
            "PublishDate": 1757928818593,
            "Source": "stock"
        },
        {
            "Title": "Ginni Filaments Reports Quarterly Financial Results for June 2025",
            "Summary": "Ginni Filaments Limited published its unaudited financial results for the quarter ended June 30, 2025 in Business Standard and Dainik Jagran newspapers. The company reported total income from continuing operations of ₹10,186.64 crore for the quarter, compared to ₹9,267.84 crore in the previous quarter and ₹4,322.18 crore in the same quarter last year. Net profit from continuing operations after tax was ₹1,475.17 crore, significantly higher than ₹93.62 crore in the previous quarter and ₹26.80 crore in the corresponding quarter of the previous year. The company also reported losses from discontinued operations. Basic earnings per share from continuing operations stood at ₹1.72 for the quarter. The results were approved by the Board of Directors at their meeting held on August 5, 2025 and have been reviewed by statutory auditors. Complete financial results are available on the company's website and stock exchange portals, accessible through QR code and weblink provided in the advertisement.",
            "Sentiment": "positive",
            "PublishDate": 1754546539974,
            "Source": "earnings"
        },
        {
            "Title": "Ginni Filaments Reports Strong Q1 Results with 62% Revenue Growth, Announces Leadership Changes",
            "Summary": "Ginni Filaments Limited announced its quarterly results for the quarter ended June 30, 2025, showing revenue from operations of ₹10,154.49 lakhs compared to ₹6,256.41 lakhs in the same quarter last year, representing a 62% increase. Net profit from continuing operations rose to ₹1,475.12 lakhs from ₹352.60 lakhs year-over-year. However, the company reported a loss of ₹414.10 lakhs from discontinued operations related to its Garments Division closure. The Board approved the re-appointment of Shri Shishir Jaipuria as Managing Director for three years from April 2026 to March 2029, subject to shareholder approval. The company appointed M/s. Parveen Rastogi & Co. as Secretarial Auditors for five years from FY 2025-26 to FY 2029-30. The Board also approved alterations to the Memorandum of Association to include electricity generation for captive consumption as a main business object. The company recorded an exceptional loss of ₹545.79 lakhs on remeasurement of assets held for sale. The 42nd Annual General Meeting is scheduled for September 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754401693713,
            "Source": "earnings"
        }
    ]
}