{
    "Symbol": "GIPCL",
    "ISIN": "INE162A01010",
    "News": [
        {
            "Title": "GIPCL Board Meet Set for Feb 12 to Review Q3FY26 Results",
            "Summary": "Gujarat Industries Power Company Limited has scheduled a board meeting on February 12, 2026, to consider and approve standalone unaudited financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770350742701,
            "Source": "co_actions_results"
        },
        {
            "Title": "GIPCL Promotes CA Kamlesh Kumar Bhatt as Executive Director",
            "Summary": "Gujarat Industries Power Company Ltd. announces the promotion of CA Kamlesh Kumar Bhatt from CGM (Finance) & CFO to Executive Director (Finance) & CFO, effective January 1, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767873193058,
            "Source": "stocks"
        },
        {
            "Title": "GIPCL Appoints Executive Director (Mines) & Promotes GM",
            "Summary": "Gujarat Industries Power Company Limited announces appointment of Naresh Kumar Purohit as Executive Director (Mines) and promotion of Rajendra Prasad Paliwal to GM (RE Projects), both effective January 1, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767339046296,
            "Source": "stocks"
        },
        {
            "Title": "GIPCL Re-appoints Chief General Manager (Thermal)",
            "Summary": "Gujarat Industries Power Company Ltd announces re-appointment of Shri C S Jadeja as Chief General Manager (Thermal) effective January 1, 2026, as disclosed under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1767248804257,
            "Source": "stocks"
        },
        {
            "Title": "GIPCL Completes Final 135 MW Phase of Khavda Solar Project",
            "Summary": "Gujarat Industries Power Company successfully commissioned the fifth and final phase of 135 MW solar installation, completing its entire 600 MW solar project at Khavda renewable energy park.",
            "Sentiment": "positive",
            "PublishDate": 1766728031661,
            "Source": "stocks"
        },
        {
            "Title": "GIPCL Extends Mining Contract with PC Patel Infra",
            "Summary": "Gujarat Industries Power Company extends existing mining contract with M/s. PC Patel Infra Pvt. Ltd. for one year while cancelling tender awarded to H.D. Enterprise.",
            "Sentiment": "neutral",
            "PublishDate": 1765541258003,
            "Source": "stocks"
        },
        {
            "Title": "Gujarat Industries Power Expands Solar Capacity by 150 MW",
            "Summary": "Gujarat Industries Power has expanded its solar project by adding 150 MW capacity, bringing the total operational capacity to 465 MW. The expansion represents progress toward the company's target of 600 MW total solar capacity.",
            "Sentiment": "positive",
            "PublishDate": 1763617690985,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Industries Power Co Reports Mixed Q2 Results with Revenue Growth but Lower Profitability",
            "Summary": "Gujarat Industries Power Co reported Q2 revenue of 3.2 billion rupees, up from 2.76 billion rupees in the same period last year. However, the company's EBITDA declined to 776 million rupees from 813 million rupees year-over-year, while EBITDA margin compressed to 24.19% from 29.46%. Net profit also fell significantly to 213 million rupees compared to 347 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762949746351,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Industries Power Company Director Jai Prakash Shivahare Resigns Following Government Transfer",
            "Summary": "Jai Prakash Shivahare, IAS, resigned as Director from Gujarat Industries Power Company Limited's Board with immediate effect from November 6, 2025. The resignation follows his transfer from Managing Director of Gujarat Urja Vikas Nigam Limited to Joint Secretary, Department for Promotion of Industry Internal Trade, Government of India. The transfer was ordered on November 1, 2025, by the Department of Personnel Training. Shivahare served as a nominee director representing Gujarat Urja Vikas Nigam Limited on GIPCL's board.",
            "Sentiment": "neutral",
            "PublishDate": 1762505914809,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gujarat Industries Power Company Commissions Additional 105 MW Solar Capacity at Khavda Project",
            "Summary": "Gujarat Industries Power Company Limited has successfully commissioned the third phase of its solar power project, adding 105 MW capacity at Khavda in the Great Rann of Kutch. This brings the total commissioned capacity to 315 MW out of the planned 600 MW Solar Power Project. The project is located within a larger 2,375 MW Renewable Energy Park at Khavda. The company had previously communicated about this project in September 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761546076133,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Industries Power Adds 105 MW Solar Capacity at Khavda Project",
            "Summary": "Gujarat Industries Power has commenced operations of an additional 105 MW from its 600 MW solar project located at Khavda. With this addition, the company's total operational capacity at the site has reached 210 MW. The project represents a phased development approach toward the full 600 MW solar installation.",
            "Sentiment": "positive",
            "PublishDate": 1759138808420,
            "Source": "stock"
        },
        {
            "Title": "GIPCL Secures Approval for 700-750 MW Lignite Power Plant in Valia",
            "Summary": "Gujarat Industries Power Co (GIPCL) has received approval from the Gujarat Government and Gujarat Urja Vikas Nigam Limited (GUVNL) for a 700-750 MW lignite power plant project in Valia. The company has secured an initial agreement for a 25-year power purchase arrangement. The project is awaiting approval from the Gujarat Electricity Regulatory Commission (GERC).",
            "Sentiment": "positive",
            "PublishDate": 1756550263566,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Industries Power Company Announces Book Closure for Rs. 4.09 Dividend and 40th AGM Details",
            "Summary": "Gujarat Industries Power Company Ltd has announced book closure dates from September 13-20, 2025 for dividend entitlement of Rs. 4.09 per share for FY 2024-25, subject to shareholder approval. The company will hold its 40th Annual General Meeting on September 20, 2025 at 1:00 PM through video conferencing. Key agenda items include adoption of audited financial statements, dividend declaration, director appointments including Dr. Jayanti S. Ravi as Additional Director and Chairperson, appointment of K C Mehta & Co. LLP as statutory auditors for five years, and appointment of TNT & Associates as secretarial auditors. The company has also announced ratification of cost auditor remuneration of Rs. 1.55 lakh for FY 2025-26. Remote e-voting will be available from September 17-19, 2025, with cut-off date of September 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1756198150495,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Industries Power Company Reports Strong Q1 FY2026 Results with Net Profit Surging to ₹5,747 Crores",
            "Summary": "Gujarat Industries Power Company Limited published its standalone unaudited financial results for the first quarter of FY 2025-26 ended June 30, 2025. The power generation company reported total income from operations of ₹39,061.40 lakhs, net profit before tax of ₹7,932.45 lakhs, and net profit after tax of ₹5,746.83 lakhs. Earnings per share stood at ₹3.70 for the quarter. The company showed substantial growth with net profit before tax increasing from ₹1,620.61 lakhs in the same quarter of the previous year to ₹7,932.45 lakhs. GIPCL operates thermal and lignite-based power plants in Vadodara and Surat. The results were approved by the Board of Directors on August 12, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755146048199,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Industries Power Company Awards Rs 2,025 Crore Mining Contracts to H.D. Enterprises",
            "Summary": "Gujarat Industries Power Company Ltd's Board of Directors approved contracts worth approximately Rs 2,025 crores to H.D. Enterprises, Vadodara. The seven-year contracts cover turnkey mining operations for removal of overburden, raising, crushing and transportation of 250 mm size lignite from Valia Mine to Power Plant (about 22.75 MTe), re-handling of overburden dump at Valia Mine (about 21.00 MCuM), and re-handling of lignite at SLPP Power Plant (about 24.5 MCuM). The contracts are awarded to a domestic entity with no promoter group interest or related party transactions involved.",
            "Sentiment": "positive",
            "PublishDate": 1755012726272,
            "Source": "order&deals"
        },
        {
            "Title": "Gujarat Industries Power Co Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "Gujarat Industries Power Co reported Q1 net profit of 575 million rupees, down from 678 million rupees in the same period last year. Revenue increased to 3.7 billion rupees compared to 3.2 billion rupees year-over-year. EBITDA declined to 1.12 billion rupees from 1.16 billion rupees, while EBITDA margin compressed to 30.28% from 36.28% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1755005892834,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Industries Power Company Limited Announces Senior Management Redesignation",
            "Summary": "Gujarat Industries Power Company Limited has announced changes in its senior management personnel. Mr. H P Rao, who was serving as GM (HR&A), has been redesignated as Head of Management (HOM) - HR&A with immediate effect. The change represents a redesignation rather than a new appointment or departure from the company.",
            "Sentiment": "neutral",
            "PublishDate": 1754633801056,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gujarat Industries Power Company Appoints Dr. Jayanti S. Ravi as Additional Director and Chairperson",
            "Summary": "Gujarat Industries Power Company Limited has appointed Dr. Jayanti S. Ravi, IAS, as an Additional Director and Chairperson on its Board, effective August 2, 2025. Dr. Ravi serves as the nominee of the Government of Gujarat and holds the position of Additional Chief Secretary in the Revenue Department of the Government of Gujarat. The appointment was approved by the company's Board of Directors following recommendation from the Nomination and Remuneration Committee. Dr. Ravi is a 1991 Gujarat cadre IAS officer with educational qualifications including a Master's in Nuclear Physics from University of Madras, Master's in Public Administration from Harvard University, and Ph.D. in E-Governance from MS University, Baroda. She has previously served in various government roles including Principal Secretary of Health and Family Welfare, where she led COVID-19 pandemic response efforts. The company confirmed that Dr. Ravi is not related to any existing Directors and is not debarred from holding directorial positions.",
            "Sentiment": "positive",
            "PublishDate": 1754134329775,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shri Jagdish Prasad Gupta Ceases to be Director and Chairman of Gujarat Industries Power Company Due to Superannuation",
            "Summary": "Shri Jagdish Prasad Gupta, IAS, ceased to be the Director and Chairman of Gujarat Industries Power Company Ltd effective July 28, 2025, due to his superannuation from the position of Additional Chief Secretary, Tribal Development Department, Government of Gujarat. The company received intimation from the Energy and Petrochemicals Department, Government of Gujarat regarding this cessation. Gujarat Industries Power Company Ltd is listed on NSE (symbol: GIPCL) and BSE (code: 517300).",
            "Sentiment": "neutral",
            "PublishDate": 1753789053808,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gujarat Industries Power Starts 105 MW Operations from 600 MW Solar Project",
            "Summary": "Gujarat Industries Power has commenced operations of 105 MW capacity from its 600 MW solar project. The project is located at the 2,375 MW Renewable Energy Park in Khavda, Rann of Kutch.",
            "Sentiment": "positive",
            "PublishDate": 1751117153000,
            "Source": "default"
        },
        {
            "Title": "Gujarat Industries Power Initiates 25 MW of 75 MW Solar Project",
            "Summary": "Gujarat Industries Power Company has begun operating 25 MW of its 75 MW Vasta Group Solar Power Project. This represents the initial phase of a larger solar power initiative.",
            "Sentiment": "positive",
            "PublishDate": 1750920004000,
            "Source": "default"
        },
        {
            "Title": "Gujarat Industries Power Co Reports Q4 Financial Results",
            "Summary": "Gujarat Industries Power Co has announced its quarterly financial results. The company reported a net profit of 697 million rupees for the fourth quarter, compared to 662 million rupees in the same period last year. Revenue for the quarter stood at 3.4 billion rupees, down from 3.73 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747907328000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Industries Power Commissions First Phase of Solar Project",
            "Summary": "Gujarat Industries Power Company has commissioned the first phase of a 25 MW solar power project at Vastan. This marks a significant step in the company's renewable energy initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1745494145000,
            "Source": "default"
        },
        {
            "Title": "Gujarat Industries Power Approves 500 MW Solar PV Project Contract",
            "Summary": "Gujarat Industries Power Company has approved a contract for a 500 MW Solar PV project in Gujarat. This decision indicates a significant investment in renewable energy infrastructure by the company.",
            "Sentiment": "positive",
            "PublishDate": 1744098080000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Industries Power Co Reports Q3 Revenue Decline",
            "Summary": "Gujarat Industries Power Co has reported its third-quarter revenue figures. The company's revenue for Q3 stood at 3.2 billion rupees, compared to 3.54 billion rupees in the same quarter of the previous year, indicating a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1739266067000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Industries Power Co Reports Q3 Net Profit Decline",
            "Summary": "Gujarat Industries Power Co has reported a net profit of 392 million rupees for the third quarter, down from 466 million rupees in the same period last year. This represents a year-over-year decrease in the company's quarterly earnings.",
            "Sentiment": "negative",
            "PublishDate": 1739265966000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Industries Power Secures EPC Contract and Approves Debt Syndication for Solar Projects",
            "Summary": "Gujarat Industries Power has been awarded an EPC contract for a 500 MW (AC) Solar PV Project at Khavda in the Great Rann of Kutch, Gujarat. The company's board has also approved debt syndication plans to secure term loans for two additional solar projects: a 500 MW Solar Power Project (Phase-II) at Khavda and a 75 MW Solar Power Project at Vastan.",
            "Sentiment": "positive",
            "PublishDate": 1734437783000,
            "Source": "corporate_action"
        },
        {
            "Title": "SEBI Issues Administrative Warning to Gujarat Industries Power Company",
            "Summary": "The Securities and Exchange Board of India (SEBI) has issued an administrative warning letter to Gujarat Industries Power Company. No further details about the nature of the warning or the reasons behind it were provided in the given news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1730806584000,
            "Source": "corporate_action"
        }
    ]
}