{
    "Symbol": "GKENERGY",
    "ISIN": "INE1AG301022",
    "News": [
        {
            "Title": "GK Energy Gets Credit Rating Upgrade from CARE",
            "Summary": "GK Energy Limited receives upgraded credit ratings from CARE Ratings Limited for bank facilities worth ₹300 crore, with long-term/short-term facilities rated CARE BBB+; Stable/CARE A2.",
            "Sentiment": "positive",
            "PublishDate": 1770216542956,
            "Source": "stocks"
        },
        {
            "Title": "GK Energy Expands Into Retail Solar Rooftop Systems",
            "Summary": "GK Energy announces strategic expansion into the retail solar rooftop systems sector, marking a significant diversification move for the company.",
            "Sentiment": "positive",
            "PublishDate": 1770105405010,
            "Source": "stocks"
        },
        {
            "Title": "GK Energy, Saatvik Green anchor lock-ins end today",
            "Summary": "Three-month anchor lock-in periods end for GK Energy and Saatvik Green Energy, releasing nearly 5 million and 3 million shares respectively. Both stocks trade below IPO prices despite strong listing gains.",
            "Sentiment": "negative",
            "PublishDate": 1766587689447,
            "Source": "stocks"
        },
        {
            "Title": "GK Energy Secures ₹276.93 Cr Solar Pump Order",
            "Summary": "GK Energy Limited receives Letter of Empanelment from MSEDCL for 10,000 off-grid DC solar photovoltaic water pumping systems worth ₹276.93 crores under PM-Kusum B Scheme across Maharashtra state.",
            "Sentiment": "positive",
            "PublishDate": 1766559073800,
            "Source": "co_actions_results"
        },
        {
            "Title": "GK Energy Wins Two Contracts Worth ₹530 Crores",
            "Summary": "GK Energy Limited has successfully secured two significant contracts with a combined value of ₹530 crores, marking a major business development for the infrastructure company.",
            "Sentiment": "positive",
            "PublishDate": 1766558455719,
            "Source": "co_actions_results"
        },
        {
            "Title": "GK Energy Gets Credit Rating Upgrade from Infomerics",
            "Summary": "GK Energy Limited receives credit rating upgrades across all bank facilities from Infomerics, with long-term facilities upgraded to IVR BBB+/Stable and short-term to IVR A2, reflecting strong revenue growth and improved profitability.",
            "Sentiment": "positive",
            "PublishDate": 1765548471564,
            "Source": "stocks"
        },
        {
            "Title": "GK Energy Wins ₹366.63 Cr Solar Pump Contract",
            "Summary": "GK Energy Limited secured approval from Maharashtra State Electricity Distribution for 13,239 off-grid DC solar pump systems worth ₹366.63 crores, with 60-day installation timeline under PM Kusum B Scheme.",
            "Sentiment": "positive",
            "PublishDate": 1765440282804,
            "Source": "co_actions_results"
        },
        {
            "Title": "GK Energy Senior Manager Resigns for New Opportunities",
            "Summary": "GK Energy Limited announces resignation of Assistant General Manager Prashant M. Jadhav from Installation and Commissioning role, effective December 25, 2025, to pursue new challenges.",
            "Sentiment": "neutral",
            "PublishDate": 1765380714904,
            "Source": "stocks"
        },
        {
            "Title": "GK Energy Delivers 17% of Solar Pumps in MSEDCL's Guinness World Record Initiative",
            "Summary": "GK Energy Limited successfully installed 7,620 off-grid solar pumps in Maharashtra within 30 days, contributing 17% of the total 45,911 pumps under MSEDCL's Guinness World Record achievement. The company also served as Strategic Advisor to MSEDCL, handling concept development, planning, and coordination for the record-breaking solar irrigation initiative under the Magel Tyala Saur Krushi Pump Yojana program.",
            "Sentiment": "positive",
            "PublishDate": 1765166302315,
            "Source": "stock"
        },
        {
            "Title": "GK Energy Reports Strong Q2 FY26 Results with 51.75% Revenue Growth",
            "Summary": "GK Energy delivered robust quarterly results with core EPC business revenue growing 51.75% YoY to INR 636.82 crores in H1 FY26, while EBITDA increased 65.07% to INR 132.04 crores with margin expansion to 20.20%. The company installed 24,502 solar agri-pumps in H1 FY26 (50.77% increase) and maintains a strong order book of INR 863.98 crores representing 36,444 pumps to be installed by February 2026.",
            "Sentiment": "positive",
            "PublishDate": 1763823672976,
            "Source": "earnings"
        },
        {
            "Title": "GK Energy Reports 50.77% Growth in Solar Pump Installations with Order Book of ₹863.98 Crores",
            "Summary": "GK Energy Limited installed 24,502 solar-powered pump systems in H1FY26 compared to 16,251 in H1FY25, achieving consolidated revenue of ₹728.83 crores with EBITDA margin of 18.34%. The company maintains an order book of ₹863.98 crores for solar pumps and rooftop systems, with plans to establish 1GW SPV manufacturing capacity on 25 acres of acquired land.",
            "Sentiment": "positive",
            "PublishDate": 1763318822588,
            "Source": "stock"
        },
        {
            "Title": "GK Energy Reports Strong Quarterly Growth with 25% Jump in Net Profit",
            "Summary": "GK Energy posted consolidated net profit of 469 million rupees compared to 373 million rupees in the previous quarter, marking a significant increase. The company's revenue also grew substantially to 4.04 billion rupees from 3.25 billion rupees quarter-on-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1763215259552,
            "Source": "corporate_action"
        },
        {
            "Title": "GK Energy Limited Receives Credit Rating Upgrade from ICRA",
            "Summary": "GK Energy Limited announced that ICRA Limited has upgraded the credit ratings on the company's bank facilities. The long-term and short-term fund-based and non-fund based working capital facilities worth Rs. 300 crore have been assigned ratings of ICRA BBB (Stable) and ICRA A2 respectively. The rating letter was dated November 11, 2025. The ratings will be due for surveillance within one year from the date of rating communication.",
            "Sentiment": "positive",
            "PublishDate": 1762878078016,
            "Source": "stock"
        },
        {
            "Title": "GK Energy Limited Signs Agreement for 875 MW Solar PV Cells Procurement",
            "Summary": "GK Energy Limited entered into a definitive agreement with a domestic manufacturer for procurement of 875 MW of Solar Photovoltaic (PV) Cells under DCR (Domestic Content Requirement) category. The procurement includes 450 MW Mono PERC Solar Cells and 425 MW of Topcon Solar Cells, with deliveries scheduled up to March 31, 2027. The agreement covers supply, delivery timelines, and quality assurance parameters aligned with Government of India's Make-in-India and renewable energy policies. The procurement will support GK Energy's ongoing and upcoming solar projects across multiple states in India.",
            "Sentiment": "positive",
            "PublishDate": 1762011383509,
            "Source": "order&deals"
        },
        {
            "Title": "GK Energy Reports Strong Q2 Performance with Net Profit Doubling Year-on-Year",
            "Summary": "GK Energy delivered robust quarterly results with net profit surging to 369 million rupees from 169 million rupees in the same period last year. Revenue nearly doubled to 2.95 billion rupees compared to 1.5 billion rupees year-on-year. EBITDA more than doubled to 566 million rupees from 258 million rupees, while EBITDA margin improved to 19.17% from 17% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1760314560902,
            "Source": "earnings"
        },
        {
            "Title": "GK Energy Reports Strong Q2 Performance with Revenue Nearly Doubling Year-over-Year",
            "Summary": "GK Energy delivered robust quarterly results with consolidated net profit rising to 369 million rupees from 169 million rupees year-over-year. Revenue increased significantly to 2.95 billion rupees compared to 1.5 billion rupees in the same period last year. The company's EBITDA grew to 566 million rupees from 258 million rupees year-over-year, while EBITDA margin improved to 19.17% from 17% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1760105058380,
            "Source": "earnings"
        },
        {
            "Title": "GK Energy Limited Approves Unaudited Financial Results for Quarter Ended June 30, 2025",
            "Summary": "GK Energy Limited's Board of Directors approved the standalone and consolidated unaudited financial results for the quarter ended June 30, 2025, along with the limited review report from auditors. The board meeting was held on October 10, 2025, from 2:00 PM to 3:45 PM IST. The company will publish these results in newspapers and has informed the National Stock Exchange of India and BSE Limited about the outcome.",
            "Sentiment": "neutral",
            "PublishDate": 1760092006187,
            "Source": "earnings"
        }
    ]
}