{
    "Symbol": "GLAND",
    "ISIN": "INE068V01023",
    "News": [
        {
            "Title": "Gland Pharma Gets USFDA Nod for Zoledronic Acid",
            "Summary": "Gland Pharma receives USFDA approval for Zoledronic Acid injection targeting hypercalcemia of malignancy and multiple myeloma. US sales projected at USD 6.7 million by November 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770356678590,
            "Source": "stocks"
        },
        {
            "Title": "Gland Pharma COO Satnam Singh Loomba to Retire",
            "Summary": "Gland Pharma announces retirement of Chief Operating Officer Mr. Satnam Singh Loomba effective March 31, 2026, due to superannuation after serving since May 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1769684738501,
            "Source": "stocks"
        },
        {
            "Title": "Gland Pharma Q3 FY26: 22% Revenue Growth, Strong Margins",
            "Summary": "Gland Pharma reported strong Q3 FY26 results with consolidated revenue of ₹16,953.63 million (22% YoY growth) and adjusted PAT of ₹2,797 million (37% YoY growth). The company also reappointed Grant Thornton as internal auditors.",
            "Sentiment": "positive",
            "PublishDate": 1769602062595,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gland Pharma Exports Surge 62% Month-on-Month",
            "Summary": "Gland Pharma reports significant 62% month-on-month growth in exports, demonstrating strong international market performance and operational momentum in pharmaceutical business.",
            "Sentiment": "positive",
            "PublishDate": 1768290011420,
            "Source": "stocks"
        },
        {
            "Title": "Gland Pharma Board Meet Set for Jan 28 Q3 Results",
            "Summary": "Gland Pharma Limited announces board meeting on January 28, 2026 to approve Q3FY26 unaudited financial results for quarter ended December 31, 2025. Trading window reopens January 31.",
            "Sentiment": "neutral",
            "PublishDate": 1767943532926,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gland Pharma Gets USFDA Nod for Eye Drop Solution",
            "Summary": "Gland Pharma receives US FDA approval for Olopatadine Hydrochloride Ophthalmic Solution USP, 0.7% as over-the-counter medication, expanding its ophthalmic product portfolio in American market.",
            "Sentiment": "positive",
            "PublishDate": 1767834255396,
            "Source": "stocks"
        },
        {
            "Title": "Gland Pharma Gets USFDA Nod for Eye Drop Solution",
            "Summary": "Gland Pharma Limited receives USFDA approval for Olopatadine Hydrochloride Ophthalmic Solution USP, 0.7% (OTC), therapeutically equivalent to Alcon's Pataday Once Daily Relief for treating ocular itching.",
            "Sentiment": "positive",
            "PublishDate": 1767781889528,
            "Source": "stocks"
        },
        {
            "Title": "Gland Pharma Reports 6% Revenue Growth in Q2FY26, Maintains Mid-Teen Growth Guidance",
            "Summary": "Gland Pharma Limited reported consolidated revenue of INR 14,869 million for Q2FY26, marking a 6% year-on-year increase. The company's base business (excluding Cenexi) generated revenue of INR 10,767 million, while Cenexi contributed INR 4,102 million with 21% growth in rupee terms. Consolidated EBITDA reached INR 3,139 million with a 21% margin. For the first half of FY26, consolidated revenue stood at INR 29,925 million, up 7% year-on-year, with EBITDA of INR 6,817 million at 23% margin. The US business grew 8% year-on-year to INR 8,005 million in Q2, driven by seven new product launches including Daptomycin-RTU and Sumatriptan. The company launched Dalbavancin this quarter and expects stronger second-half performance. Cenexi reported EUR 40 million revenue in Q2 (8% growth) and EUR 88 million for H1 (10% growth), with EBITDA losses reducing to EUR 5 million from EUR 11 million. Management maintains mid-teen consolidated revenue growth guidance for FY26 and expects Cenexi to achieve EBITDA breakeven in Q3FY26. The company invested 5.8% of revenue in R&D, filed six ANDAs, and received five approvals during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762533734359,
            "Source": "earnings"
        },
        {
            "Title": "Gland Pharma Anticipates Growth Acceleration in Second Half",
            "Summary": "Gland Pharma expects improved growth in the second half driven by new product launches and recovery at Cenexi. The company anticipates these factors will contribute to enhanced performance in the coming period.",
            "Sentiment": "positive",
            "PublishDate": 1762183395176,
            "Source": "stock"
        },
        {
            "Title": "Gland Pharma Projects Mid-to-High Single-Digit Revenue Growth Through Product Diversification and Global Expansion",
            "Summary": "Gland Pharma expects mid-to-high single-digit revenue growth driven by complex injectables, biosimilars, and contract development and manufacturing organization (CDMO) scaling. The pharmaceutical company is expanding its manufacturing capabilities in India while broadening global product launches across the United States, Europe, and emerging markets.",
            "Sentiment": "positive",
            "PublishDate": 1762181793909,
            "Source": "stock"
        },
        {
            "Title": "Gland Pharma Plans to Expand GLP-1/Cartridge Production Capacity by 250%",
            "Summary": "Gland Pharma announced plans to significantly increase its GLP-1/cartridge production capacity from the current 40 million units to 140 million units. This expansion represents a substantial boost in manufacturing capabilities for the pharmaceutical company's GLP-1 and cartridge product lines.",
            "Sentiment": "positive",
            "PublishDate": 1762169358207,
            "Source": "stock"
        },
        {
            "Title": "Gland Pharma Reports Higher Q2 Net Profit and Revenue Growth",
            "Summary": "Gland Pharma reported Q2 consolidated net profit of 1.84 billion rupees compared to 1.64 billion rupees in the same period last year. Revenue increased to 14.87 billion rupees from 14.06 billion rupees year-over-year. EBITDA rose to 3.14 billion rupees from 2.97 billion rupees, while EBITDA margin remained relatively stable at 21.11% versus 21.13% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762168162302,
            "Source": "earnings"
        },
        {
            "Title": "Gland Pharma Sees Rs. 45.99 Crore Block Trade on NSE",
            "Summary": "Gland Pharma Ltd. witnessed a block trade worth Rs. 45.99 crores on the NSE. The transaction involved approximately 240,922 shares at a price of Rs. 1,909.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1757396529115,
            "Source": "order&deals"
        },
        {
            "Title": "Cancer Medications May Be Excluded From GST",
            "Summary": "There is a possibility that cancer medications might be excluded from GST. This development could impact Gland Pharma, a pharmaceutical company that operates in the cancer treatment segment.",
            "Sentiment": "positive",
            "PublishDate": 1756869475200,
            "Source": "stock"
        },
        {
            "Title": "Gland Pharma Receives Approval for Vasopressin in 5% Dextrose Injection",
            "Summary": "Gland Pharma has received approval for Vasopressin in 5% Dextrose Injection. The market size for this product is $45 million.",
            "Sentiment": "positive",
            "PublishDate": 1756189769601,
            "Source": "stock"
        },
        {
            "Title": "Gland Pharma Receives USFDA Approval for Norepinephrine Bitartrate Injection with 180-Day Exclusivity",
            "Summary": "Gland Pharma Limited received approval from the United States Food and Drug Administration for Norepinephrine Bitartrate in 5% Dextrose Injection in two dosage strengths: 4 mg/250 mL (16 mcg/mL) and 8 mg/250 mL (32 mcg/mL) Single-Dose Bags. The product is bioequivalent and therapeutically equivalent to Baxter Healthcare Corp's reference drug and is indicated to raise blood pressure in adult patients with severe, acute hypotension. Gland Pharma holds exclusive First-to-File status and is eligible for 180 days of generic drug exclusivity. According to IQVIA, the product had US sales of approximately USD 55 million for the twelve months ending June 2025. The approval was obtained through the company's Abbreviated New Drug Application filed via its partner.",
            "Sentiment": "positive",
            "PublishDate": 1754984127672,
            "Source": "stock"
        },
        {
            "Title": "Gland Pharma Receives USFDA Approval for Cangrelor Injection",
            "Summary": "Gland Pharma has received approval from the USFDA for Cangrelor Injection. The product has U.S. sales of approximately $122 million.",
            "Sentiment": "positive",
            "PublishDate": 1754983198328,
            "Source": "stock"
        },
        {
            "Title": "Gland Pharma Reports Strong Q1FY26 Results with 39% EBITDA Growth and Cenexi Turnaround",
            "Summary": "Gland Pharma delivered consolidated revenue of INR 15,056 million for Q1FY26, marking 7% year-over-year growth. The company achieved significant profitability improvement with consolidated EBITDA rising 39% to INR 3,678 million, expanding margins from 19% to 24%. A key highlight was Cenexi reaching EBITDA breakeven after several quarters of losses, with EUR 48 million revenue and EUR 0.9 million EBITDA. The base business excluding Cenexi showed strong performance with 35% EBITDA margin versus 29% in the prior year. US market contributed INR 7,443 million (49% of business) with nine new product launches including Epinephrine and Acetaminophen Bags. Other regulated markets grew 34% year-over-year, while Rest of World markets increased 5%. The company expanded pen and cartridge capacity from 40 million to 140 million units, with completion scheduled by September 2025. Liraglutide was launched in UK and Australian markets during the quarter. Net profit surged 50% to INR 2,155 million with PAT margin improving to 14% from 10%. Management expects to maintain mid-teen growth rates and confirmed Cenexi's path to sustainable profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754917216616,
            "Source": "earnings"
        },
        {
            "Title": "Gland Pharma Block Trade Worth Rs. 91.12 Crores Executed on NSE",
            "Summary": "A block trade involving Gland Pharma shares was executed on the National Stock Exchange (NSE) for approximately 455,110 shares at Rs. 2002.20 per share, totaling Rs. 91.12 crores. The transaction represents a significant institutional trade in the pharmaceutical company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1754460753086,
            "Source": "order&deals"
        },
        {
            "Title": "Gland Pharma's Cenexi Unit Achieves Breakeven EBITDA",
            "Summary": "Gland Pharma announced that its subsidiary Cenexi has reached breakeven EBITDA in the latest quarter. This milestone demonstrates the company's emphasis on cost management and operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1754405392209,
            "Source": "stock"
        },
        {
            "Title": "Gland Pharma Plans Significant Expansion with GLP-1 Devices and Product Development Pipeline",
            "Summary": "Gland Pharma is targeting multi-year growth through a 3.5x capacity expansion in GLP-1 devices. The company plans to file 20+ Ready-to-Use (RTU) bag applications and launch 15 co-developed products by FY28. This expansion strategy focuses on increasing manufacturing capabilities in the diabetes treatment device segment while building a substantial product pipeline through partnerships and regulatory filings.",
            "Sentiment": "positive",
            "PublishDate": 1754402643783,
            "Source": "stock"
        },
        {
            "Title": "Gland Pharma Reports Strong Q1 Growth with Net Profit Rising 53% to 2.2 Billion Rupees",
            "Summary": "Gland Pharma delivered robust quarterly performance with consolidated net profit increasing to 2.2 billion rupees from 1.44 billion rupees year-over-year. Revenue grew to 15 billion rupees compared to 14 billion rupees in the same period last year. The company's EBITDA rose significantly to 3.68 billion rupees from 2.6 billion rupees year-over-year, while EBITDA margin expanded to 24.42% from 18.86% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754391735341,
            "Source": "earnings"
        },
        {
            "Title": "Gland Pharma Schedules Q1 FY26 Earnings Conference Call for August 5, 2025",
            "Summary": "Gland Pharma Limited will host an earnings conference call for investors and analysts on August 5, 2025, at 18:30 hours IST. The 60-minute call will discuss the company's financial performance and business updates for the quarter ended June 30, 2025. The management team will present performance results and take questions related to the business. The audio recording and transcript of the conference call will be made available on the company's website at www.glandpharma.com after the call. Multiple dial-in options are provided including universal access numbers for India, USA, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1753160880567,
            "Source": "earnings"
        },
        {
            "Title": "Gland Pharma Sees Rs. 71.82 Crore Block Trade on NSE",
            "Summary": "Gland Pharma executed a block trade worth Rs. 71.82 crores on the National Stock Exchange. The transaction involved approximately 358,221 shares at a price of Rs. 2,005.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1753082592226,
            "Source": "order&deals"
        },
        {
            "Title": "Brookfield and EQT Lead Race to Acquire Gland Pharma from Fosun in Potential $3 Billion Deal",
            "Summary": "Buyout groups Brookfield and EQT are in active discussions to acquire Hyderabad-based pharmaceutical company Gland Pharma from China's Fosun Group. The deal could become one of the largest buyouts in the pharmaceutical segment this year. Fosun currently owns 51.8% of Gland Pharma, which would require a payout of Rs 17,141.28 crore ($1.9 billion) at current market prices. A change of control would trigger an open offer for an additional 26% from minority shareholders, potentially making it a Rs 25,711 crore ($3 billion) transaction. However, Gland Pharma's rising stock price poses a challenge, with shares appreciating 10% year-to-date and 16% in the past month, closing at Rs 2,000. The company's market capitalization has reached Rs 32,964.47 crore. Most investors view the stock as overpriced and are seeking discounts to current levels. Gland Pharma develops and manufactures generic injectables for nearly 90 countries, with focus on Indian and US markets. The company posted revenue of Rs 5,616 crore and after-tax profit of Rs 698 crore. Fosun has been attempting to sell Gland Pharma for several years, having previously aborted a sale process last year before reviving plans this summer.",
            "Sentiment": "neutral",
            "PublishDate": 1753059245740,
            "Source": "order&deals"
        },
        {
            "Title": "Gland Pharma's Pashamylaram Facility Receives GMP Compliance Certificate",
            "Summary": "Gland Pharma has announced that its Pashamylaram facility has been awarded a Good Manufacturing Practices (GMP) compliance certificate by the Danish Medicines Agency. This certification indicates that the facility meets the required quality standards for pharmaceutical manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1752451704000,
            "Source": "default"
        },
        {
            "Title": "Gland Pharma: Danish Regulator Certifies Pashamylaram Facility, FDA Issues EIR for Visakhapatnam Plant",
            "Summary": "Gland Pharma's Pashamylaram facility received GMP Compliance Certificate from Danish Medicines Agency. The Visakhapatnam facility received an Establishment Inspection Report from the US FDA following a pre-approval inspection in December 2024.",
            "Sentiment": "positive",
            "PublishDate": 1752239340000,
            "Source": "normal_news"
        },
        {
            "Title": "Gland Pharma's Pashamylaram Facility Receives GMP Compliance Certificate",
            "Summary": "Gland Pharma has announced that its Pashamylaram facility has received a Good Manufacturing Practice (GMP) compliance certificate from the Danish Medicines Agency. This certification indicates that the facility meets the required quality standards for pharmaceutical manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1752232805000,
            "Source": "default"
        },
        {
            "Title": "Gland Pharma: USFDA Closes Inspection at Visakhapatnam Unit",
            "Summary": "Gland Pharma received an Establishment Inspection Report (EIR) from USFDA for its Visakhapatnam facility, indicating closure of the inspection conducted in February 2025. The company's shares gained up to 3.2% following the news.",
            "Sentiment": "positive",
            "PublishDate": 1750747095000,
            "Source": "normal_news"
        },
        {
            "Title": "Gland Pharma Receives EIR from US FDA for Visakhapatnam Facility",
            "Summary": "Gland Pharma has received an Establishment Inspection Report (EIR) from the US Food and Drug Administration (FDA) for its JNPC facility located in Visakhapatnam. This indicates that the FDA has completed its inspection of the facility.",
            "Sentiment": "positive",
            "PublishDate": 1750741820000,
            "Source": "default"
        },
        {
            "Title": "Gland Pharma: Subsidiary Cenexi Receives 11 Observations from French Regulator",
            "Summary": "Gland Pharma's subsidiary Cenexi received 11 observations from France's drug regulator ANSM after a GMP inspection at its Fontenay facility. Cenexi submitted a CAPA plan to be implemented over 3-12 months, which ANSM accepted. The company stated that manufacturing operations at the site will not be impacted.",
            "Sentiment": "neutral",
            "PublishDate": 1749095157000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gland Pharma's Cenexi Facility in France Receives 11 Observations from ANSM Inspection",
            "Summary": "Gland Pharma has reported that the French National Agency for Medicines and Health Products Safety (ANSM) has completed its inspection of Cenexi's manufacturing facility in Fontenay, France. The final report includes 11 observations. Despite these findings, the company does not anticipate any disruption to its manufacturing operations at the facility.",
            "Sentiment": "neutral",
            "PublishDate": 1749082133000,
            "Source": "default"
        },
        {
            "Title": "ANSM Inspection at Gland Pharma's Cenexi Facility Concludes with 11 Observations",
            "Summary": "The French National Agency for the Safety of Medicines and Health Products (ANSM) has completed an inspection at Cenexi's Fontenay facility, which is owned by Gland Pharma. The final report includes 11 observations. Despite these findings, manufacturing operations at the facility continue without interruption.",
            "Sentiment": "neutral",
            "PublishDate": 1749043937000,
            "Source": "default"
        },
        {
            "Title": "Gland Pharma: FDA Approval for Blood Pressure Drug Boosts Shares",
            "Summary": "Gland Pharma received USFDA approval for Angiotensin II Acetate injection, a generic equivalent of GIAPREZA, for treating blood pressure in adults with septic shock. The company holds exclusive First-to-File status, granting 180 days of market exclusivity. The US market for this drug was valued at $58 million for the year ending March 2025.",
            "Sentiment": "positive",
            "PublishDate": 1749014310000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gland Pharma Receives Approval for Angiotensin II Acetate Injection",
            "Summary": "Gland Pharma has received approval for Angiotensin II Acetate Injection. The product has reported US sales of approximately USD 58 million.",
            "Sentiment": "positive",
            "PublishDate": 1749005477000,
            "Source": "default"
        },
        {
            "Title": "Gland Pharma: Q4 Results Show Core Weakness, Cenexi Challenges",
            "Summary": "Gland Pharma's earnings have deteriorated over the past three years due to increased competition in base products and operational losses at Cenexi. However, steady price erosion in base portfolio, new launches, and improving Cenexi performance are expected to drive 20% earnings CAGR over FY25-27.",
            "Sentiment": "neutral",
            "PublishDate": 1747807280000,
            "Source": "result"
        },
        {
            "Title": "Gland Pharma: Q4 Earnings Trigger Share Price Volatility",
            "Summary": "Gland Pharma's Q4 results showed mixed performance. Revenue fell 7.3% to Rs 1,425 crore, below estimates. Ebitda margin improved to 24.4%. Net profit decreased 3.1% to Rs 186 crore. Share price initially dropped 2.81% but later rose 3.78% to Rs 1,554.90.",
            "Sentiment": "neutral",
            "PublishDate": 1747801335000,
            "Source": "earnings"
        },
        {
            "Title": "Gland Pharma Reports Q4 Results and Dividend Announcement",
            "Summary": "Gland Pharma has reported its quarterly results. The consolidated net profit for Q4 is 1.87 billion rupees, compared to 1.92 billion rupees year-over-year and 2.05 billion rupees quarter-over-quarter. Revenue for Q4 is 14.25 billion rupees, down from 15.37 billion rupees year-over-year. The company has recommended a final dividend of 18 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747786954000,
            "Source": "default"
        },
        {
            "Title": "Gland Pharma: Q4 Profit and Revenue Decline, Misses Estimates",
            "Summary": "Gland Pharma reported Q4FY25 net profit down 3.1% YoY to ₹186.5 crore, below estimates. Revenue fell 7.3% to ₹1,424.9 crore. EBITDA margin improved to 24.4%. Company launched four new molecules in Q4, filed five ANDAs, and received seven approvals. Final dividend of ₹18 per share proposed. European subsidiary Cenexi saw 8% YoY revenue growth.",
            "Sentiment": "neutral",
            "PublishDate": 1747743888000,
            "Source": "earnings"
        },
        {
            "Title": "Gland Pharma Q4 Results and Dividend Announcement",
            "Summary": "Gland Pharma reported its quarterly results. The company's Q4 consolidated net profit was 1.87 billion rupees, compared to 1.92 billion rupees year-over-year and 2.05 billion rupees quarter-over-quarter. Q4 revenue stood at 14.25 billion rupees, down from 15.37 billion rupees year-over-year. EBITDA for Q4 was 3.46 billion rupees, slightly lower than 3.59 billion rupees in the previous year. However, the EBITDA margin improved to 24.39% from 23.33% year-over-year. The company has recommended a final dividend of 18 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747742544000,
            "Source": "result"
        },
        {
            "Title": "Gland Pharma: Q4 Results Preview Indicates Stable Performance",
            "Summary": "Gland Pharma is expected to report stable Q4 performance with 0.9% YoY revenue growth to Rs 1,551.73 crore. Ebitda likely to rise 5.54% to Rs 376.14 crore with margin expansion. US business momentum, new launches, and Cenexi recovery to offset seasonal weakness. Investors to watch for updates on China expansion and complex product pipeline.",
            "Sentiment": "neutral",
            "PublishDate": 1747648869000,
            "Source": "earnings"
        },
        {
            "Title": "Gland Pharma to Consider Q4 Results on May 20",
            "Summary": "Gland Pharma has announced that it will consider its fourth quarter (Q4) financial results on May 20. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746533175000,
            "Source": "default"
        },
        {
            "Title": "Gland Pharma: USFDA Approves New Blood Pressure Drug Application",
            "Summary": "Gland Pharma received USFDA approval for its ANDA for latanoprostene bunod ophthalmic solution, 0.024%. The product is bioequivalent to Bausch and Lomb's VYZULTA and is indicated for reducing intraocular pressure in glaucoma or ocular hypertension patients. As the exclusive first-to-file, Gland Pharma is eligible for 180 days of generic drug exclusivity. The product had US sales of $171 million for the 12 months ending February 2025.",
            "Sentiment": "positive",
            "PublishDate": 1746005013000,
            "Source": "order&deals"
        },
        {
            "Title": "Gland Pharma Receives USFDA Approval for Latanoprostene Bunod Ophthalmic Solution",
            "Summary": "Gland Pharma has obtained approval from the United States Food and Drug Administration (USFDA) for Latanoprostene Bunod Ophthalmic Solution. The drug has reported US sales of $171 million.",
            "Sentiment": "positive",
            "PublishDate": 1746002245000,
            "Source": "default"
        },
        {
            "Title": "Gland Pharma: ICICI Prudential MF Acquires Shares Amid Price Drop",
            "Summary": "ICICI Prudential Mutual Fund purchased 4,00,020 shares of Gland Pharma on April 11, 2025, increasing its stake to 5.08% despite a 10% fall in the company's stock price in April. The stock decline was due to fears of potential US pharma tariffs. Gland Pharma shares rose 0.8% to ₹1439 following the announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1744783906000,
            "Source": "block_deals"
        },
        {
            "Title": "Gland Pharma Receives Approval for Acetaminophen Injection",
            "Summary": "Gland Pharma has obtained approval for Acetaminophen Injection, a product with annual sales of $55 million in the US market. This approval represents a significant opportunity for the company to enter a lucrative pharmaceutical segment.",
            "Sentiment": "positive",
            "PublishDate": 1743659311000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gland Pharma: USFDA Inspection Results in Three Observations",
            "Summary": "USFDA conducted a pre-approval inspection at Gland Pharma's Visakhapatnam facility from February 19-25, 2025. The inspection concluded with three Form 483 observations, which the company states are procedural in nature and not related to data integrity. Gland Pharma will submit corrective actions within the stipulated period.",
            "Sentiment": "neutral",
            "PublishDate": 1740479251000,
            "Source": "corporate_governance"
        },
        {
            "Title": "US FDA Inspection Concluded at Gland Pharma's JNPC Facility",
            "Summary": "Gland Pharma has announced the conclusion of a United States Food and Drug Administration (US FDA) inspection at their JNPC facility. The inspection outcome was not specified in the provided news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1740475745000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Global PE Firms to Acquire Gland Pharma Stake from Chinese Owner",
            "Summary": "Three global private equity firms are reportedly in talks to purchase a stake in Gland Pharma from its current Chinese owner. This potential acquisition could lead to a significant ownership change for the Indian pharmaceutical company.",
            "Sentiment": "positive",
            "PublishDate": 1739351239000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gland Pharma: Stock Plummets 5% Following Downgrades and Target Cuts",
            "Summary": "Gland Pharma shares fell 5% to November 2023 lows after disappointing Q3 results. Analysts downgraded the stock and cut price targets due to weak revenue growth in base business and delays in Cenexi's recovery. Jefferies maintained 'Underperform' rating, lowering target to ₹1,350. Incred downgraded to 'Reduce' with ₹1,313 target. Kotak reiterated 'Reduce', cutting target to ₹1,525. Cenexi's breakeven timeline pushed to Q3FY26F.",
            "Sentiment": "negative",
            "PublishDate": 1738647132000,
            "Source": "earnings"
        }
    ]
}