{
    "Symbol": "GLAXO",
    "ISIN": "INE159A01016",
    "News": [
        {
            "Title": "GSK Pharma uploads analyst meet recording online",
            "Summary": "GlaxoSmithKline Pharmaceuticals Limited has uploaded the recording of its analyst and institutional investor meetings on its investor portal as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1770646316582,
            "Source": "stocks"
        },
        {
            "Title": "GSK India Q3 Revenue Crosses ₹1000 Cr Mark",
            "Summary": "GlaxoSmithKline Pharmaceuticals reported Q3 FY26 revenue of ₹1023 crores with 8.1% growth. PAT reached ₹277 crores while EBITDA margins expanded 520bps to 35.9%.",
            "Sentiment": "positive",
            "PublishDate": 1770632936513,
            "Source": "co_actions_results"
        },
        {
            "Title": "GSK Pharma Receives ₹35.07 Lakh GST Demand Order",
            "Summary": "GlaxoSmithKline Pharmaceuticals receives GST demand order of ₹35.07 lakhs from Maharashtra authorities for FY 2021-22, related to credit mismatch issues with suppliers.",
            "Sentiment": "negative",
            "PublishDate": 1767258699449,
            "Source": "stocks"
        },
        {
            "Title": "GSK Pharma Receives ₹8.57 Cr GST Demand from Karnataka",
            "Summary": "GlaxoSmithKline Pharmaceuticals receives GST demand order worth ₹8.57 crores from Karnataka authorities for FY 2021-22, related to GST rates on certain products.",
            "Sentiment": "negative",
            "PublishDate": 1767190825030,
            "Source": "stocks"
        },
        {
            "Title": "GSK Pharma Clarifies Volume Surge as Market-Driven",
            "Summary": "GlaxoSmithKline Pharmaceuticals responds to exchange queries about significant trading volume increase, confirming all regulatory disclosures are up-to-date and attributing surge to market forces.",
            "Sentiment": "neutral",
            "PublishDate": 1767190768745,
            "Source": "stocks"
        },
        {
            "Title": "GSK Pharma Faces ₹89.59 Lakh GST Demand Order",
            "Summary": "GlaxoSmithKline Pharmaceuticals receives GST demand order of ₹89.59 lakh from West Bengal authorities over credit mismatch issues. Company evaluating the order and planning appropriate action.",
            "Sentiment": "negative",
            "PublishDate": 1766387876168,
            "Source": "stocks"
        },
        {
            "Title": "GSK Pharma Faces ₹37.19 Cr Court Decree on Legacy Case",
            "Summary": "GlaxoSmithKline Pharmaceuticals receives court decree for ₹37.19 crores in a 24-year-old case involving mesne profits from office premises formerly occupied by Burroughs Wellcome.",
            "Sentiment": "negative",
            "PublishDate": 1766055217134,
            "Source": "stocks"
        },
        {
            "Title": "GSK Pharma Receives ₹52.53L GST Demand Order",
            "Summary": "GlaxoSmithKline Pharmaceuticals receives GST demand order of ₹52.53 lakh from Bihar CGST authorities for FY2021-22 related to credit mismatch issues with suppliers.",
            "Sentiment": "negative",
            "PublishDate": 1765552271482,
            "Source": "stocks"
        },
        {
            "Title": "GSK Pharma Block Trade Worth ₹18.56 Crores on NSE",
            "Summary": "GlaxoSmithKline Pharmaceuticals executed a significant block trade on NSE involving 72,065 shares at ₹2,575.00 per share, totaling ₹18.56 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1765517879489,
            "Source": "co_actions_results"
        },
        {
            "Title": "GSK Pharmaceuticals Announces Leadership Change: Juby Chandy to Take New Regional Role",
            "Summary": "GlaxoSmithKline Pharmaceuticals Limited announced that Juby Chandy will assume the position of Vice President, Finance Asia Pacific (APAC) region effective December 1, 2025. Chandy will continue serving as Chief Financial Officer until a successor is appointed while providing strategic leadership to finance functions across Asia Pacific markets.",
            "Sentiment": "neutral",
            "PublishDate": 1763564040589,
            "Source": "corporate_governance"
        },
        {
            "Title": "GSK Pharmaceuticals Q2 FY2026 Revenue Declines 2.6% to ₹974 Crores Despite EBITDA Margin Improvement",
            "Summary": "GlaxoSmithKline Pharmaceuticals Limited reported quarterly results with sales of ₹974 crores, representing a 2.6% decline. The company faced headwinds from a fire incident at a key contract manufacturing organization (CMO) impacting approximately ₹40 crores in revenue, and transitionary GST reform effects of ₹30-32 crores. Despite revenue challenges, EBITDA margins improved to 34.4%, a 250 basis point increase, driven by cost savings and better product mix. The company launched its oncology business on August 15, 2025, introducing Jemperli for endometrial cancer and Zejula for ovarian cancer. Vaccines business showed strong double-digit growth, while specialty products Nucala and Trelegy grew over 20%. The company maintains market share at 27.6% and reported EPS of ₹15.06, a 3% improvement. Management indicated the CMO fire impact and GST issues are resolved, with supply constraints expected to be behind them from Q3 onwards. GSK India is approaching its 102nd year of operations.",
            "Sentiment": "neutral",
            "PublishDate": 1762761109805,
            "Source": "earnings"
        },
        {
            "Title": "GlaxoSmithKline Pharmaceuticals Reports 15.1% Revenue Decline in Q2 2025, Approves Rs 1.74 Crore Solar Investment",
            "Summary": "GlaxoSmithKline Pharmaceuticals Limited reported revenue from operations of Rs 97,994 lakhs for the quarter ended September 30, 2025, compared to Rs 101,077 lakhs in the same quarter last year, marking a decline of approximately 3%. For the six-month period, revenue dropped to Rs 178,511 lakhs from Rs 182,542 lakhs year-over-year. Net profit after tax increased to Rs 25,500 lakhs for the quarter versus Rs 23,640 lakhs in the previous year. The company's Board approved an investment of Rs 1.74 crores for a Solar Power project at its Nashik plant under Group Captive mechanism. This involves acquiring a 26% shareholding in CleanMax Galapagos Private Limited, a special purpose vehicle set up to supply 4.95 MWp capacity renewable energy. The company reported exceptional items credit of Rs 264 lakhs from profit on sale of surplus residential properties. Basic and diluted earnings per share for the quarter stood at Rs 18.06 compared to Rs 27.14 in the corresponding quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1762438817532,
            "Source": "earnings"
        },
        {
            "Title": "GSK Strengthens Vaccine and Oncology Portfolios in India with Shingrix and Next-Gen Therapies",
            "Summary": "GSK is strengthening its vaccine and oncology portfolios by expanding adult immunization through Shingrix and launching next-generation respiratory and oncology therapies. The company is focusing on innovation-led brand equity and digital medical engagement. GSK aims to scale its oncology and respiratory divisions to become double-digit growth engines in India.",
            "Sentiment": "positive",
            "PublishDate": 1762438399094,
            "Source": "global"
        },
        {
            "Title": "GlaxoSmithKline Pharma Reports Mixed Q2 Results with Profit Growth Despite Revenue Decline",
            "Summary": "GlaxoSmithKline Pharma reported quarterly consolidated net profit of 2.57 billion rupees compared to 2.52 billion rupees in the same period last year. Revenue declined to 9.8 billion rupees from 10 billion rupees year-over-year. EBITDA increased to 3.36 billion rupees from 3.2 billion rupees, while EBITDA margin improved to 34.26% from 31.83% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762426844629,
            "Source": "earnings"
        },
        {
            "Title": "GlaxoSmithKline Pharma Launches Two Oncology Drugs in India",
            "Summary": "GlaxoSmithKline Pharma has entered India's oncology market by introducing two cancer treatment drugs - Jemperli and Zejula. Both medications are designed to provide targeted treatments specifically for gynecological cancers.",
            "Sentiment": "positive",
            "PublishDate": 1756100101865,
            "Source": "stock"
        },
        {
            "Title": "GSK Pharmaceuticals Reports Flat Q1 FY26 Growth, Launches Oncology Business",
            "Summary": "GlaxoSmithKline Pharmaceuticals Limited reported flat revenue growth for Q1 FY26, impacted by supply constraints from a CMO fire incident that reduced growth by 2% and muted performance in dermatology and anti-infective segments. Despite challenging topline performance, the company improved EBITDA margins to 31.2% (290 basis points improvement) and achieved 12.7% PAT growth. The vaccine business grew 8.6% while general medicines declined 2%. The company is launching two oncology drugs - Zejula for ovarian cancer and Jemperli for endometrial cancer - targeting approximately 5,000 and 1,000 eligible patients respectively. Management maintains confidence in achieving double-digit growth ambitions, supported by new growth platforms including Shingrix vaccine (selling 9,000-10,000 doses monthly), specialty products like Trelegy Ellipta and Nucala, and the upcoming oncology portfolio. The company operates with over 2,000 medical representatives and has expanded digital reach to 4.6 lakh healthcare practitioners.",
            "Sentiment": "neutral",
            "PublishDate": 1754630321436,
            "Source": "earnings"
        },
        {
            "Title": "GlaxoSmithKline Pharmaceuticals Reports Q1 FY26 Results with Margin Expansion Despite Revenue Decline",
            "Summary": "GlaxoSmithKline Pharmaceuticals Limited reported quarterly results showing revenue of ₹805 crores, declining 0.8% year-over-year. However, the company demonstrated strong profitability improvements with EBITDA of ₹205 crores at 25.6% margin (up 290 basis points) and PAT of ₹251 crores at 31.2% margin (also up 290 basis points), representing growth of 9.3% and 12.7% respectively. EPS increased 13% to ₹12.08. The General Medicine segment faced challenges due to softer seasonality and competitive pressures, while the Specialty segment drove growth led by respiratory focus. The company's pediatric vaccines portfolio showed growth driven by Boostrix, Varilrix, and Havrix brands. GSK is launching two oncology products - Jemperli and Zejula - targeting gynecological cancers. The company maintained healthy cash flow conversion at approximately 100% and improved field productivity by 1%. Key promoted brands continued outperforming in their represented markets while gaining market share.",
            "Sentiment": "positive",
            "PublishDate": 1754042758247,
            "Source": "stock"
        },
        {
            "Title": "GlaxoSmithKline Pharma Reports Higher Q1 Profit and Improved Margins",
            "Summary": "GlaxoSmithKline Pharma reported consolidated net profit of Rs 2.05 billion for Q1, up from Rs 1.82 billion in the same period last year. The company's EBITDA increased to Rs 2.51 billion from Rs 2.31 billion year-over-year. EBITDA margin improved to 31.2% compared to 28.3% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754032308229,
            "Source": "earnings"
        },
        {
            "Title": "GlaxoSmithKline Pharmaceuticals: Fire Disrupts Production at Contract Manufacturing Facility",
            "Summary": "A fire at a contract manufacturing facility of GlaxoSmithKline Pharmaceuticals Ltd has temporarily disrupted production. The company is assessing the impact and working to resume operations. GSK Pharma reported Q4 revenue of ₹966 crore, a 6% growth, and full-year revenue of ₹3,723 crore, a 9% increase. The board recommended a final dividend of ₹42 per share for FY ending March 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1747399879000,
            "Source": "normal_news"
        },
        {
            "Title": "Fire Incident at GlaxoSmithKline Pharma's Contract Manufacturing Facility",
            "Summary": "GlaxoSmithKline Pharma reported a fire incident at one of its contract manufacturing facilities. The incident has resulted in a temporary disruption of production operations at the affected site. The company is currently assessing the impact of the fire and is working closely with the site management to expedite the resumption of operations.",
            "Sentiment": "negative",
            "PublishDate": 1747396761000,
            "Source": "default"
        },
        {
            "Title": "GlaxoSmithKline Pharma Reports Q4 Results and Dividend",
            "Summary": "GlaxoSmithKline Pharma announced its Q4 consolidated net profit of 2.63 billion rupees, up from 2 billion rupees year-over-year and 2.3 billion rupees quarter-over-quarter. Q4 revenue increased to 9.74 billion rupees from 9.3 billion rupees year-over-year. The company has recommended a final dividend of 42 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747181921000,
            "Source": "default"
        },
        {
            "Title": "GlaxoSmithKline Pharmaceuticals: Q4 Profit at ₹260 Crore, Declares ₹42 Dividend",
            "Summary": "GlaxoSmithKline Pharmaceuticals reported Q4 FY2025 revenue of ₹966 crore with 6% growth. Full-year revenue reached ₹3,723 crore, up 9%. The company plans to launch oncology assets Zejula and Jemperli in FY2025-26. A final dividend of ₹42 per share was recommended.",
            "Sentiment": "positive",
            "PublishDate": 1747134848000,
            "Source": "earnings"
        },
        {
            "Title": "GlaxoSmithKline Pharma Reports Strong Q4 Results and Announces Dividend",
            "Summary": "GlaxoSmithKline Pharma has reported improved financial results for Q4. The company's revenue increased to 9.74 billion rupees from 9.3 billion rupees year-over-year. EBITDA rose to 3.33 billion rupees from 2.57 billion rupees, with EBITDA margin expanding to 34.2% from 27.67%. Consolidated net profit grew to 2.63 billion rupees from 2 billion rupees year-over-year. Additionally, the company has recommended a final dividend of 42 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747134585000,
            "Source": "result"
        },
        {
            "Title": "GlaxoSmithKline Pharma to Consider Q4 Results on May 13",
            "Summary": "GlaxoSmithKline Pharmaceuticals Limited has announced that it will consider its fourth quarter financial results on May 13. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1744893494000,
            "Source": "default"
        },
        {
            "Title": "GlaxoSmithKline Pharmaceuticals: Shares Surge 36% Following Strong Q3 Results",
            "Summary": "GlaxoSmithKline Pharmaceuticals' share price jumped 17% on Tuesday, extending a three-day rally after reporting robust Q3 FY25 results. The company's consolidated net profit increased 400% to ₹230 crore, while revenue grew 18% to ₹949.42 crore YoY. EBITDA rose 33.8% with margin expansion to 30.7%.",
            "Sentiment": "positive",
            "PublishDate": 1739868676000,
            "Source": "earnings"
        },
        {
            "Title": "GlaxoSmithKline Pharmaceuticals: Profit Soars 400% in Q3FY25",
            "Summary": "GlaxoSmithKline Pharmaceuticals reported a 400% increase in Q3FY25 net profit to ₹230 crore, with revenue up 18% to ₹949.42 crore. The company's stock hit a 20% upper circuit at ₹2,421.30 following the results announcement. Strong performance was noted across key product portfolios, including general medicines and respiratory products.",
            "Sentiment": "positive",
            "PublishDate": 1739770438000,
            "Source": "earnings"
        },
        {
            "Title": "GlaxoSmithKline Pharma Reports Improved Q3 EBITDA and Margin",
            "Summary": "GlaxoSmithKline Pharma has announced its Q3 financial results. The company's EBITDA increased to 2.91 billion rupees from 2.18 billion rupees in the same quarter last year. Additionally, the EBITDA margin improved to 30.75% from 27.08% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739527016000,
            "Source": "earnings"
        },
        {
            "Title": "GlaxoSmithKline Pharma Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "GlaxoSmithKline Pharma has reported a substantial increase in its third-quarter consolidated net profit. The company's net profit rose to 2.3 billion rupees, compared to 457 million rupees in the same period last year. This represents a significant year-over-year growth in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1739526930000,
            "Source": "earnings"
        },
        {
            "Title": "GlaxoSmithKline: GSK Launches $2.5B Buyback, Raises Sales Target After Strong Q4",
            "Summary": "GSK announced a £2 billion share buyback and increased its 2031 sales target to over £40 billion. Q4 results exceeded expectations with core EPS of 23.2 pence and sales of £8.12 billion. The company expects 3-5% revenue growth in 2025 despite anticipated vaccine sales decline.",
            "Sentiment": "positive",
            "PublishDate": 1738764122000,
            "Source": "corporate_action"
        },
        {
            "Title": "GlaxoSmithKline Pharma Reports Q2 Results",
            "Summary": "GlaxoSmithKline Pharma has reported its Q2 financial results. The company's Profit Before Tax (PBT) increased to 3.4 billion rupees from 2.9 billion rupees year-over-year. Additionally, the company reported an exceptional item of 47 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1730198697000,
            "Source": "result"
        },
        {
            "Title": "GlaxoSmithKline Pharma Announces Special Interim Dividend",
            "Summary": "GlaxoSmithKline Pharma has declared a special interim dividend of 12 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1730198210000,
            "Source": "corporate_action"
        },
        {
            "Title": "GlaxoSmithKline Pharma Reports Improved Q2 Financial Performance",
            "Summary": "GlaxoSmithKline Pharma has announced its Q2 financial results, showing improvements in both EBITDA and EBITDA margin compared to the same period last year. The company's EBITDA increased from 2.9 billion rupees to 3.2 billion rupees, while the EBITDA margin rose from 30.25% to 31.83%.",
            "Sentiment": "positive",
            "PublishDate": 1730198195000,
            "Source": "result"
        },
        {
            "Title": "GlaxoSmithKline Pharma Reports Q2 Revenue Growth",
            "Summary": "GlaxoSmithKline Pharma has announced its Q2 revenue, which stands at 10 billion rupees, compared to 9.6 billion rupees in the same quarter last year. This represents a year-over-year increase in revenue for the pharmaceutical company.",
            "Sentiment": "positive",
            "PublishDate": 1730198181000,
            "Source": "result"
        },
        {
            "Title": "GlaxoSmithKline Pharma Reports Q2 Profit Increase",
            "Summary": "GlaxoSmithKline Pharma has reported a consolidated net profit of 2.5 billion rupees for the second quarter. This represents an increase from 2.2 billion rupees year-over-year and 1.8 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730198173000,
            "Source": "result"
        }
    ]
}