{
    "Symbol": "GLENMARK",
    "ISIN": "INE935A01035",
    "News": [
        {
            "Title": "Glenmark Targets 23% EBITDA Margin, Eyes Growth",
            "Summary": "Glenmark Pharmaceuticals sets sustainable EBITDA margin target of 23% for current year and coming quarters, anticipates strong FY26 finish and launches Glenmark 3.0 growth strategy for 2027.",
            "Sentiment": "positive",
            "PublishDate": 1770089720899,
            "Source": "stocks"
        },
        {
            "Title": "Glenmark Q3 FY26 Results: Mixed Performance Amid Settlements",
            "Summary": "Glenmark Pharmaceuticals reported Q3 FY26 results with consolidated revenue of ₹39,006.15 million and net profit of ₹4,032.28 million, while standalone operations showed revenue of ₹23,599.35 million with profit of ₹2,820.66 million.",
            "Sentiment": "neutral",
            "PublishDate": 1769784505327,
            "Source": "co_actions_results"
        },
        {
            "Title": "Glenmark Pharmaceuticals Q3FY26 Earnings Call Feb 2",
            "Summary": "Glenmark Pharmaceuticals has scheduled its Q3FY26 results earnings call for February 02, 2026, from 8:30-9:30 AM IST. The company has provided multiple dial-in numbers for global participation.",
            "Sentiment": "neutral",
            "PublishDate": 1769081517598,
            "Source": "co_actions_results"
        },
        {
            "Title": "Glenmark launches Epinephrine Injection in US market",
            "Summary": "Glenmark Pharmaceuticals Inc., USA launches Epinephrine Injection USP, 30mg/30mL Multiple-Dose Vial, targeting a market worth approximately $67.60 million annually.",
            "Sentiment": "positive",
            "PublishDate": 1766460106684,
            "Source": "stocks"
        },
        {
            "Title": "Glenmark USA to Launch Leucovorin Injection Dec 2025",
            "Summary": "Glenmark Pharmaceuticals Inc., USA announces launch of Leucovorin Calcium For Injection USP, 350mg/vial in December 2025, targeting a $16.8 million annual market with bioequivalent product to Hospira's reference drug.",
            "Sentiment": "positive",
            "PublishDate": 1765423316505,
            "Source": "stocks"
        },
        {
            "Title": "Glenmark Pharmaceuticals Clears U.S. FDA Inspection at Chhatrapati Sambhajinagar Facility",
            "Summary": "The U.S. FDA completed its inspection of Glenmark Pharmaceuticals' Chhatrapati Sambhajinagar facility without identifying any regulatory issues. This clean inspection outcome supports the company's manufacturing compliance standards and maintains its ability to supply products to the U.S. market from this facility.",
            "Sentiment": "positive",
            "PublishDate": 1764560338978,
            "Source": "stock"
        },
        {
            "Title": "Glenmark Pharmaceuticals Receives FDA Clearance to Restart Manufacturing at Monroe Facility",
            "Summary": "Glenmark Pharmaceuticals received an Establishment Inspection Report with Voluntary Action Indicated status from the U.S. FDA for its Monroe, North Carolina facility following a June 2025 inspection. The company will restart commercial manufacturing at the site, which had been under Warning Letters since June 2023.",
            "Sentiment": "positive",
            "PublishDate": 1764219188291,
            "Source": "stock"
        },
        {
            "Title": "Glenmark Pharmaceuticals Launches First Nebulized Triple COPD Treatment",
            "Summary": "Glenmark Pharmaceuticals has introduced the first nebulized triple treatment for COPD, combining Glycopyrrolate, Formoterol, and Budesonide in a single therapy. The new treatment is designed to enhance lung function and provide better symptom control for COPD patients.",
            "Sentiment": "positive",
            "PublishDate": 1764041912626,
            "Source": "stock"
        },
        {
            "Title": "Glenmark and Cosmo Receive EU Marketing Authorization for Winlevi Acne Treatment",
            "Summary": "The European Commission granted marketing authorization for Winlevi (clascoterone 10mg/g cream) to treat acne vulgaris in adults and adolescents aged 12-18 years. Glenmark will commercialize the first-in-class topical treatment across 15 European countries including Bulgaria, Czech Republic, Denmark, Finland, France, Hungary, Iceland, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Spain and Sweden.",
            "Sentiment": "positive",
            "PublishDate": 1763457461989,
            "Source": "stock"
        },
        {
            "Title": "Glenmark Pharma Sets Growth Targets: 12-15% Revenue Growth and 23% EBITDA Margins",
            "Summary": "Glenmark Pharma has outlined financial targets including 12-15% revenue growth, initial EBITDA margins of 23% with plans to reach 25% plus later, and return ratios of 25-30% ROCE and 20-25% ROE. The company's IGI subsidiary plans annual spending of $70-75 million as part of its strategic growth initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1763436923740,
            "Source": "stock"
        },
        {
            "Title": "Glenmark Pharma Sets Ambitious Revenue Targets for FY26-27",
            "Summary": "Glenmark Pharma has established quarterly revenue goals of ₹1,150-1,200 crores from Q3 FY26 and over ₹4,800 crores for FY27. The pharmaceutical company is targeting total revenue of ₹17,000-18,000 crores for FY27, indicating significant growth expectations for its business operations.",
            "Sentiment": "positive",
            "PublishDate": 1763436316674,
            "Source": "stock"
        },
        {
            "Title": "Glenmark Pharma Sets Revenue Target of Rs 17,000-18,000 Crores by FY27",
            "Summary": "Glenmark Pharma has announced its revenue target of Rs 17,000-18,000 crores by the end of FY27. The pharmaceutical company shared this financial guidance during a conference call with stakeholders.",
            "Sentiment": "positive",
            "PublishDate": 1763351105146,
            "Source": "stock"
        },
        {
            "Title": "Glenmark Pharmaceuticals Secures $1.9 Billion AbbVie Partnership, Targets 23% EBITDA Margin",
            "Summary": "Glenmark Pharmaceuticals announced a $1.9 billion partnership with AbbVie that will fund R&D initiatives and debt reduction while focusing on high-growth therapeutic areas including respiratory, oncology, and dermatology. The company projects its consolidated EBITDA margin will rise to approximately 23% from H2 FY26, supported by expanding CRDMO capabilities and global commercialization in emerging markets.",
            "Sentiment": "positive",
            "PublishDate": 1763137081209,
            "Source": "order&deals"
        },
        {
            "Title": "Glenmark Pharmaceuticals Reports Mixed Q2 Results with Major Legal Settlements and Leadership Changes",
            "Summary": "Glenmark Pharmaceuticals approved quarterly results for the second quarter and half year ended September 30, 2025, while facing exceptional charges of Rs. 12,850.26 million primarily from US antitrust lawsuit settlements totaling $48.75 million. The Board reconstituted the ESG Committee with Mr. Pradeep Kumar Sinha as Chairman and approved an interim dividend of Rs. 2.50 per equity share, affecting shareholders and operational performance.",
            "Sentiment": "negative",
            "PublishDate": 1763135290208,
            "Source": "earnings"
        },
        {
            "Title": "Glenmark Pharma Reports Strong Q2 Performance with 72% Profit Growth",
            "Summary": "Glenmark Pharmaceuticals reported a 72.3% surge in net profit to Rs 610 crore and 76.1% revenue growth to Rs 6,047 crore in its second quarter results. The company's EBITDA margin expanded significantly to 39% from 17.5%, while shares closed 0.77% higher despite being down 23.6% over the past 12 months.",
            "Sentiment": "positive",
            "PublishDate": 1763129358639,
            "Source": "earnings"
        },
        {
            "Title": "Glenmark Pharma Settles Final Zetia-Vytorin Antitrust Case for $11M",
            "Summary": "Glenmark Pharma has settled its final antitrust case related to Zetia-Vytorin with UnitedHealthcare for $11 million. The settlement fully resolves all litigation matters between the parties, clearing legal uncertainties for the pharmaceutical company.",
            "Sentiment": "positive",
            "PublishDate": 1763115838049,
            "Source": "stock"
        },
        {
            "Title": "Glenmark Pharma Receives China Approval for RYALTRIS® Respiratory Product",
            "Summary": "Glenmark Pharma has obtained regulatory approval in China for RYALTRIS®, a respiratory treatment product. The approval strengthens the company's position in respiratory innovation and expands its market presence in China's pharmaceutical sector.",
            "Sentiment": "positive",
            "PublishDate": 1762769561902,
            "Source": "stock"
        },
        {
            "Title": "Glenmark Pharmaceuticals USA Launches Sodium Bicarbonate Injection in $63.8 Million Market",
            "Summary": "Glenmark Pharmaceuticals Inc., USA announced the launch of 8.4% Sodium Bicarbonate Injection USP, 50mEq/50mL Single-Dose Vial in November 2025. The product is bioequivalent and therapeutically equivalent to Abbott Laboratories' reference drug. According to IQVIA sales data for the 12-month period ending August 2025, the 8.4% Sodium Bicarbonate Injection market achieved annual sales of approximately $63.8 million. Marc Kikuchi, President Business Head, North America, stated the launch expands their injectable portfolio and reinforces their dedication to bringing quality and affordable alternatives to patients in need.",
            "Sentiment": "positive",
            "PublishDate": 1762227058022,
            "Source": "stock"
        },
        {
            "Title": "Glenmark Pharmaceuticals Completes Transfer of Consumer Care Business to Subsidiary",
            "Summary": "Glenmark Pharmaceuticals Limited has completed the transfer of its Consumer Care business to Glenmark Consumer Care Limited, a wholly owned subsidiary of the company. The transfer follows earlier intimations dated August 14, 2025 and September 15, 2025. The company has informed stock exchanges BSE and NSE about the completion of this business restructuring.",
            "Sentiment": "neutral",
            "PublishDate": 1761979400332,
            "Source": "corporate_action"
        },
        {
            "Title": "Glenmark Pharmaceuticals to Launch Ropivacaine Injection in November 2025",
            "Summary": "Glenmark Pharmaceuticals plans to introduce Ropivacaine Hydrochloride Injection USP in November 2025. The product will compete with Naropin®, which generates approximately $20.9 million in annual revenue.",
            "Sentiment": "positive",
            "PublishDate": 1761191425631,
            "Source": "stock"
        },
        {
            "Title": "Glenmark Pharma Sets October 1 as Last Day to Buy Shares for Interim Dividend Eligibility",
            "Summary": "Glenmark Pharmaceuticals has set October 1 as the final day for investors to purchase shares to qualify for its interim dividend, with the record date falling on October 3. The board approved an interim dividend of Rs 2.5 per equity share on face value of Rs 1 per share for financial year 2026, totaling Rs 70.5 crore. The dividend payment will be made within 30 days of declaration. Due to India's T+1 settlement cycle and October 2 being a market holiday, shares must be purchased by October 1 to qualify for the payout.",
            "Sentiment": "neutral",
            "PublishDate": 1759289814039,
            "Source": "corporate_action"
        },
        {
            "Title": "Glenmark Pharmaceuticals Announces Rs 2.5 Interim Dividend, Reports 86% Profit Drop",
            "Summary": "Glenmark Pharmaceuticals will trade ex-dividend this week, issuing an interim dividend of Rs 2.5 on October 3. Due to India's T+1 settlement cycle, investors must purchase shares by October 1 to qualify for the dividend, as October 2 is a market holiday for Gandhi Jayanti. The company's consolidated net profit fell 86% in the first quarter, dropping to Rs 46.80 crore from Rs 340.2 crore in the same quarter of the previous fiscal year, despite a one-time gain of Rs 323 crore in the June quarter.",
            "Sentiment": "negative",
            "PublishDate": 1759037137527,
            "Source": "corporate_action"
        },
        {
            "Title": "Glenmark Pharmaceuticals Declares ₹2.50 Interim Dividend, Reconstitutes Board Committees",
            "Summary": "Glenmark Pharmaceuticals announced an interim dividend of ₹2.50 per equity share for Financial Year 2025-26, totaling ₹705.50 million. The record date for dividend payment is October 3, 2025, with payment to be completed within 30 days of declaration. The Board also approved reconstitution of three committees effective October 1, 2025: the Stakeholders Relationship Committee will be chaired by Ms. Sona Saira Ramasastry, the Risk Management Committee by Mr. Dipankar Bhattacharjee, and the ESG Committee by Mr. Glenn Saldanha. The Board meeting was held on September 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758864086081,
            "Source": "corporate_action"
        },
        {
            "Title": "Glenmark Pharma Signs $1.1 Billion Deal with Hengrui for HER2-Targeting Cancer Therapy Rights",
            "Summary": "Glenmark Pharma has entered into a $1.1 billion agreement with Hengrui to acquire exclusive rights to a HER2-targeting cancer therapy across multiple regions. The deal provides Glenmark with exclusive access to this oncology treatment targeting HER2, a protein associated with certain types of cancer.",
            "Sentiment": "positive",
            "PublishDate": 1758709054240,
            "Source": "order&deals"
        },
        {
            "Title": "Glenmark Pharmaceuticals Revises Record Date to October 3, 2025 for Interim Dividend",
            "Summary": "Glenmark Pharmaceuticals has announced a revised record date of October 3, 2025, for the payment of interim dividend for the financial year 2025-26. The company had previously scheduled a board meeting for September 26, 2025, to consider and approve the interim dividend payment on equity shares. The announcement was communicated to BSE and NSE through a formal intimation signed by Company Secretary Harish Kuber.",
            "Sentiment": "neutral",
            "PublishDate": 1758543462548,
            "Source": "corporate_action"
        },
        {
            "Title": "Glenmark Pharmaceuticals Schedules Board Meeting to Consider Interim Dividend for FY 2025-26",
            "Summary": "Glenmark Pharmaceuticals has scheduled a Board of Directors meeting for September 26, 2025, to consider and approve payment of interim dividend on equity shares for the financial year 2025-26. The record date for dividend payment, if declared, is set for September 30, 2025. The company has closed the trading window for designated persons, which will remain closed until September 28, 2025, as per insider trading regulations.",
            "Sentiment": "positive",
            "PublishDate": 1758538111394,
            "Source": "corporate_action"
        },
        {
            "Title": "Glenmark Pharma Partners with Astria Therapeutics for Monoclonal Antibody Development",
            "Summary": "Glenmark Pharma has signed a deal with Astria Therapeutics for developing monoclonal antibodies. Astria Therapeutics has shared positive initial outcomes from its Phase 1A trial of STAR 0310.",
            "Sentiment": "positive",
            "PublishDate": 1758169085444,
            "Source": "stock"
        },
        {
            "Title": "Glenmark Pharmaceuticals Executes Business Transfer Agreement for Consumer Care Division",
            "Summary": "Glenmark Pharmaceuticals has executed a Business Transfer Agreement to transfer its Consumer Care business to Glenmark Consumer Care Limited, its wholly owned subsidiary. The agreement was signed on September 15, 2025, and the transaction is expected to be completed by December 31, 2025, subject to customary conditions. This follows an earlier intimation dated August 14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757937686689,
            "Source": "corporate_action"
        },
        {
            "Title": "Glenmark Pharma Unit IGI Receives $700 Million Upfront Payment from AbbVie for ISB 2001 Licensing Deal",
            "Summary": "Glenmark Pharma's unit IGI has secured a $700 million upfront payment from AbbVie through a licensing agreement for ISB 2001. The deal represents a significant financial transaction between the pharmaceutical companies involving the licensing of this particular asset.",
            "Sentiment": "positive",
            "PublishDate": 1757388624923,
            "Source": "order&deals"
        },
        {
            "Title": "Glenmark Pharmaceuticals Initiates Phase 3 Trial for Envafolimab in Lung Cancer Treatment",
            "Summary": "Glenmark Pharmaceuticals has commenced a Phase 3 clinical trial for Envafolimab, targeting Stage III Non-Small Cell Lung Cancer. The Drug Controller General of India (DCGI) has granted approval for patient enrollment in India. The company has also submitted applications to conduct trials in Russia, Brazil, and Mexico.",
            "Sentiment": "positive",
            "PublishDate": 1757046162983,
            "Source": "stock"
        },
        {
            "Title": "Glenmark Pharma: Cancer Medications May Get GST Exemption",
            "Summary": "Cancer medications may receive GST exemption, which could potentially impact Glenmark Pharma and the pharmaceutical sector.",
            "Sentiment": "positive",
            "PublishDate": 1756871141685,
            "Source": "stock"
        },
        {
            "Title": "Glenmark Pharma Ready to Launch Eribulin Mesylate Injection in U.S. Market",
            "Summary": "Glenmark Pharma is prepared to introduce Eribulin Mesylate Injection in single-dose vials in the United States market. The pharmaceutical company has reached readiness to launch this injectable medication product.",
            "Sentiment": "positive",
            "PublishDate": 1756789286748,
            "Source": "stock"
        },
        {
            "Title": "Glenmark Pharma Targets 19-20% Ebitda Margin in FY26 with Strong Global Performance",
            "Summary": "Glenmark Pharmaceuticals remains confident of achieving its FY26 guidance of 10-12% revenue growth and 19-20% Ebitda margin. Executive Director and CFO Anurag Mantri stated that margins will stabilize at 23% from Q3 onwards. The European business has grown over 25% CAGR for three years with double-digit momentum expected from Q2, supported by two new launches. The US business recorded 9% quarter-on-quarter growth in Q1FY26, driven by injectable product launches, with three additional injectable launches planned for Q2. However, the India business faced pressure in Q1 due to underperformance in its diabetes portfolio, though supply chain issues have been resolved and the company is targeting 20% CAGR growth in India. Consolidated revenue rose 0.6% to Rs 3,264.4 crore in Q1FY26, while adjusted profit after tax declined to Rs 312.9 crore from Rs 340.2 crore in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755597687772,
            "Source": "stock"
        },
        {
            "Title": "Glenmark Pharma's US Division to Launch Micafungin Injection as Mycamine Reaches $60.7M Annual Sales",
            "Summary": "Glenmark Pharma announced that Mycamine for Injection achieved annual sales of approximately $60.7 million. The company's US division is preparing to launch Micafungin Injection in 50 mg and 100 mg formulations.",
            "Sentiment": "positive",
            "PublishDate": 1755577267515,
            "Source": "stock"
        },
        {
            "Title": "Glenmark Pharmaceuticals Transfers Consumer Care Business to Wholly-Owned Subsidiary, Appoints New Independent Director",
            "Summary": "Glenmark Pharmaceuticals has approved the transfer of its Consumer Care business to newly incorporated wholly-owned subsidiary Glenmark Consumer Care Limited for approximately INR 240.40 crores. The Consumer Care business generated INR 514.7 crores in turnover for the year ended March 31, 2025, representing 5.6% of the company's standalone turnover. The company also appointed Ms. Patricia Andrews as Additional Non-Executive Independent Director for a five-year term from August 14, 2025 to August 13, 2030, subject to shareholder approval. Additionally, the board approved the appointment of Walker Chandiok & Co. LLP as Statutory Auditors and Rauthan & Associates LLP as Secretarial Auditors for five-year terms. The 47th Annual General Meeting is scheduled for September 26, 2025. The company reported Q1 FY26 consolidated revenue of INR 32,644 million with 0.6% year-over-year growth and EBITDA of INR 5,805 million with 17.8% margin.",
            "Sentiment": "positive",
            "PublishDate": 1755180267387,
            "Source": "corporate_action"
        },
        {
            "Title": "Glenmark Pharma Forecasts Double-Digit Growth in Europe and Emerging Markets from Q2",
            "Summary": "Glenmark Pharma anticipates its Europe and emerging markets region will deliver strong double-digit growth starting from Q2. The pharmaceutical company has provided this growth outlook for these specific geographical segments of its business.",
            "Sentiment": "positive",
            "PublishDate": 1755175226004,
            "Source": "stock"
        },
        {
            "Title": "Glenmark Pharma Reports Mixed Q1 Results with Sharp Decline in Net Profit",
            "Summary": "Glenmark Pharma reported Q1 consolidated net profit of 469 million rupees, significantly lower than 3.4 billion rupees in the same period last year and below estimates of 3.67 billion rupees. Revenue grew marginally to 32.6 billion rupees from 32.4 billion rupees year-over-year, though it fell short of estimates of 35.94 billion rupees. EBITDA declined to 5.8 billion rupees from 5.9 billion rupees year-over-year, missing estimates of 6.73 billion rupees. EBITDA margin compressed to 17.78% from 18.13% year-over-year, below the estimated 18.7%. Profit before tax decreased to 4.19 billion rupees from 4.62 billion rupees year-over-year. The company recorded an exceptional item of 3.23 billion rupees during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1755172953672,
            "Source": "earnings"
        },
        {
            "Title": "Glenmark Pharmaceuticals Block Trade Worth Rs. 49.38 Crores Executed on NSE",
            "Summary": "Glenmark Pharmaceuticals Ltd. witnessed a block trade on the National Stock Exchange involving approximately 243,522 shares at a price of Rs. 2,027.80 per share, totaling Rs. 49.38 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1755151735049,
            "Source": "order&deals"
        },
        {
            "Title": "Glenmark Pharma's US Unit Agrees to $37.75 Million Antitrust Settlement While Denying Liability",
            "Summary": "Glenmark Pharma's US subsidiary has agreed to pay $37.75 million to settle an antitrust class action lawsuit. The company denies any liability in the matter, with the settlement occurring amid ongoing legal uncertainty.",
            "Sentiment": "negative",
            "PublishDate": 1754493372885,
            "Source": "stock"
        },
        {
            "Title": "Glenmark Receives FDA Warning Letter for Pithampur Manufacturing Facility",
            "Summary": "The US Food and Drug Administration issued a Warning Letter to Glenmark Pharmaceuticals for its Pithampur manufacturing facility following an inspection conducted between February 3 and February 14, 2025. The facility's methods, controls, and operations failed to comply with Current Good Manufacturing Practice regulations. The FDA flagged inadequate investigations into dissolution failures in potassium chloride extended-release capsules and another product, citing insufficient scientific justification in the company's responses. The agency also raised concerns over delayed stability testing, which resulted in late detection of product failures and subsequent delays in initiating recalls and issuing field alerts. This marks Glenmark's fourth FDA warning letter, with previous warnings issued to its Himachal Pradesh plant in October 2019, Goa facility in November 2022, and North Carolina site in June 2023. The FDA has recommended that Glenmark engage a qualified CGMP consultant and undertake a comprehensive review of its global quality systems. Despite the warning letter, Glenmark shares were trading 0.48% higher at ₹2,149, with the stock gaining 33% in 2025.",
            "Sentiment": "negative",
            "PublishDate": 1753335264974,
            "Source": "stock"
        },
        {
            "Title": "India Ratings Revises Glenmark Pharmaceuticals Outlook to Positive on AbbVie Licensing Deal",
            "Summary": "India Ratings has revised the outlook on Glenmark Pharmaceuticals' long-term bank facilities to Positive from Stable while affirming the 'IND AA' rating. The revision reflects improved revenue visibility for subsidiary Ichnos Glenmark Innovation following an exclusive global licensing agreement with AbbVie Inc. for investigational asset ISB 2001. Under the agreement, Ichnos will receive an upfront payment of USD 700 million post regulatory clearance and is eligible for up to USD 1.225 billion in milestone payments plus tiered double-digit royalties. This represents one of the largest biotechnology licensing deals by an Indian company. The rating agency expects net leverage to remain strong over FY26-FY28 due to healthy operating profitability and significant cash buildup. Glenmark reported consolidated revenue growth of 12.8% to INR 133.2 billion in FY25, with EBITDA margin expanding to 17.7% from 10.1%. The India formulations business grew 31.9% while the US business declined 2.5%. The company faces ongoing regulatory challenges including a USFDA warning letter for its Indore facility and observations for the Monroe facility.",
            "Sentiment": "positive",
            "PublishDate": 1753269926389,
            "Source": "stock"
        },
        {
            "Title": "Glenmark Pharmaceuticals Uploads Investor Day 2025 Audio Recording to Company Website",
            "Summary": "Glenmark Pharmaceuticals Limited has uploaded the audio recording of its Investor Day 2025 event held on July 16, 2025, to the company website. The recording is available at the company's official website link. The company notified stock exchanges BSE and NSE about this upload on July 23, 2025, through a communication signed by Company Secretary & Compliance Officer Harish Kuber.",
            "Sentiment": "neutral",
            "PublishDate": 1753268212996,
            "Source": "stock"
        },
        {
            "Title": "Glenmark Pharmaceuticals Sees Rs. 28.84 Crore Block Trade on NSE",
            "Summary": "Glenmark Pharmaceuticals executed a block trade on the National Stock Exchange worth Rs. 28.84 crores. The transaction involved approximately 133,579 shares at a price of Rs. 2,158.70 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1753175129215,
            "Source": "order&deals"
        },
        {
            "Title": "Glenmark Pharmaceuticals Block Trade Worth Rs. 54.99 Crores Executed on NSE",
            "Summary": "A block trade involving Glenmark Pharmaceuticals shares was executed on the National Stock Exchange (NSE) for Rs. 54.99 crores. The transaction involved approximately 250,071 shares at a price of Rs. 2,199.10 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1753084451784,
            "Source": "order&deals"
        },
        {
            "Title": "Glenmark Pharmaceuticals Sees Rs. 16.23 Crore Block Trade on NSE",
            "Summary": "Glenmark Pharmaceuticals Ltd. witnessed a block trade worth Rs. 16.23 crores on the National Stock Exchange. The transaction involved approximately 73,422 shares at a price of Rs. 2,210.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1753080473361,
            "Source": "order&deals"
        },
        {
            "Title": "Glenmark Pharma Targets 70% Branded Products by 2030",
            "Summary": "Glenmark Pharma has announced plans to achieve 70% branded products in its portfolio by 2030. The pharmaceutical company is focusing on innovative medications as part of this strategic initiative.",
            "Sentiment": "positive",
            "PublishDate": 1752911994560,
            "Source": "stock"
        },
        {
            "Title": "Glenmark Pharmaceuticals: S&P Predicts Cash Positive Turn After AbbVie Deal",
            "Summary": "S&P Global Ratings reports Glenmark Pharmaceuticals will become net cash positive following its licensing deal with AbbVie for ISB 2001. The agreement is expected to reduce Glenmark's adjusted debt to 10-11 billion rupees in fiscal 2026. S&P projects 10% revenue growth in fiscal 2026 and 9-11% annually for the following three years, with stable EBITDA margins.",
            "Sentiment": "positive",
            "PublishDate": 1752774226000,
            "Source": "corporate_action"
        },
        {
            "Title": "S&P: Glenmark Pharma's Licensing Agreement to Improve Cash Position",
            "Summary": "S&P has stated that Glenmark Pharma's licensing agreement will result in the company becoming net cash positive. The specific details of the licensing agreement or the exact financial impact are not provided in the given snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752752309000,
            "Source": "default"
        },
        {
            "Title": "Glenmark Pharma Evolving into Global Innovation-Led Player",
            "Summary": "Glenmark Pharmaceuticals is transforming into a future-ready, innovation-driven global pharmaceutical company. The company is focusing on expanding its branded and specialty portfolio, unlocking value through its biotech division IGI, and driving sustainable growth. This strategy involves disciplined execution across high-potential therapeutic areas and geographical markets.",
            "Sentiment": "positive",
            "PublishDate": 1752711045000,
            "Source": "default"
        },
        {
            "Title": "Glenmark Pharma Outlines Global Expansion Strategy",
            "Summary": "Glenmark Pharma has announced its strategic goals to become a leading global pharmaceutical company. The company plans to achieve this by expanding its branded and specialty products, unlocking biotech potential through IGI, and focusing on sustainable growth in key therapeutic areas and regions.",
            "Sentiment": "positive",
            "PublishDate": 1752678624000,
            "Source": "default"
        }
    ]
}