{
    "Symbol": "GLFL",
    "ISIN": "INE540A01017",
    "News": [
        {
            "Title": "Gujarat Lease Financing Limited Reports Quarterly Profit Despite Accumulated Losses Exceeding Net Worth",
            "Summary": "Gujarat Lease Financing Limited reported a profit of Rs. 2.12 lakhs for the quarter ended September 30, 2025, compared to Rs. 2.45 lakhs in the corresponding quarter of 2024. However, the company's accumulated losses have exceeded its net worth, and total liabilities exceed total assets. The company generated total income of Rs. 10.56 lakhs entirely from other income, with no revenue from operations. Total expenses were Rs. 8.44 lakhs. For the six-month period, the company recorded a loss of Rs. 3.74 lakhs. The company has no business plan and does not intend to have any business activity in the near future, leading to financial statements being prepared on a non-going concern basis. The company's paid-up equity share capital stands at Rs. 2,712.58 lakhs with basic earnings per share of Rs. 0.01 for the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1760686984631,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Lease Financing Reports ₹5.86 Lakh Loss in Q1 2025, Accumulated Losses Exceed Net Worth",
            "Summary": "Gujarat Lease Financing Limited reported a net loss of ₹5.86 lakhs for the quarter ended June 30, 2025, compared to a loss of ₹6.16 lakhs in the same quarter last year. The company generated no revenue from operations and recorded other income of ₹10.48 lakhs. Total expenses stood at ₹16.34 lakhs, primarily driven by listing and custodian fees of ₹7.81 lakhs and employee benefits expense of ₹3.27 lakhs. The company's accumulated losses have exceeded its net worth, and total liabilities exceed total assets. The financial statements were prepared on a non-going concern basis as the company has no business plan and does not intend to have any business activity in the near future. The company's earnings per share stood at negative ₹0.02. The results were approved by the Board of Directors on July 25, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1753429868527,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Lease Financing: Q2 Profit Turnaround with Revenue Growth",
            "Summary": "Gujarat Lease Financing reported a Q2 profit of ₹0.02 crore, reversing last year's loss. Revenue increased by 2.94% YoY and 2.24% QoQ. Operating income surged 326.85% YoY, with EPS at ₹0.01, up 326.88% YoY. The company significantly reduced selling, general, and administrative expenses.",
            "Sentiment": "positive",
            "PublishDate": 1729230350000,
            "Source": "result"
        }
    ]
}