{
    "Symbol": "GLOBECIVIL",
    "ISIN": "INE0V3U01015",
    "News": [
        {
            "Title": "Globe Civil Projects Board Meet Set for Feb 14",
            "Summary": "Globe Civil Projects Limited has scheduled a board meeting for February 14, 2026, to approve Q3 FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770617814594,
            "Source": "co_actions_results"
        },
        {
            "Title": "Globe Civil Projects Secures Rs. 2.37 Crore Construction Contract from GGSIPU",
            "Summary": "Globe Civil Projects Limited received a Letter of Award worth Rs. 2,37,44,655 for construction of indoor sports complex flooring and light fixtures at Guru Gobind Singh Indraprastha University in Dwarka, New Delhi. The domestic project has a completion period of 45 days and was awarded at 0.21% below the estimated cost of Rs. 2,37,94,624.",
            "Sentiment": "positive",
            "PublishDate": 1765357579621,
            "Source": "order&deals"
        },
        {
            "Title": "Globe Civil Projects Reports Strong Q2 Growth, Order Book Crosses Rs 1,000 Crores",
            "Summary": "Globe Civil Projects delivered 40% quarter-on-quarter revenue growth to Rs 947.81 million in Q2 FY26, with consolidated order book exceeding Rs 1,000 crores providing multi-year revenue visibility. The company secured major EPC orders worth Rs 450 crores including projects from NBCC, sports infrastructure, and educational institutions, targeting 20-25% annual growth guidance.",
            "Sentiment": "positive",
            "PublishDate": 1764323932922,
            "Source": "earnings"
        },
        {
            "Title": "Globe Civil Projects Wins Court Case, ₹23.81 Lakh Recovery Suit Dismissed",
            "Summary": "The District Court dismissed a suit filed by P.D. Verma seeking recovery of ₹23.81 lakh from Globe Civil Projects, confirming the company had made full payment for work executed. The favorable judgment conclusively resolves the litigation and affirms Globe Civil Projects' position that it is not liable for any further dues.",
            "Sentiment": "positive",
            "PublishDate": 1764248724735,
            "Source": "stock"
        },
        {
            "Title": "Globe Civil Projects Wins Court Case, ₹23.81 Lakh Recovery Suit Dismissed",
            "Summary": "The District Court dismissed a ₹23.81 lakh recovery suit filed by P.D. Verma's legal heirs against Globe Civil Projects, ruling the company had made full and final payment for completed work. The judgment confirms Globe Civil Projects is not liable for any further dues and conclusively resolves the litigation in the company's favor.",
            "Sentiment": "positive",
            "PublishDate": 1763548749707,
            "Source": "stock"
        },
        {
            "Title": "Globe Civil Projects Schedules H1 FY26 Earnings Conference Call",
            "Summary": "Globe Civil Projects Limited has scheduled an earnings conference call on November 26, 2025, at 4:00 PM to discuss its performance for the half-year ended September 30, 2025. The call will be hosted by Equibridgex Advisors Private Limited with participation from the company's management team including Chairman and Managing Directors.",
            "Sentiment": "neutral",
            "PublishDate": 1763548109498,
            "Source": "stock"
        },
        {
            "Title": "Globe Civil Projects Reports 40% QoQ Revenue Growth in Q2 FY26",
            "Summary": "Globe Civil Projects Limited reported total income of ₹947.81 Mn in Q2 FY26, marking a 40.01% quarter-on-quarter growth, with EBITDA at ₹139.90 Mn and net profit margin of 6.79% for H1 FY26. The integrated EPC company secured new orders worth ₹450 crore during the period, including projects from Central University of Punjab and Haryana International Cricket Stadium, strengthening its order book above ₹1,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1763194577459,
            "Source": "earnings"
        },
        {
            "Title": "Globe Civil Projects Gets Credit Rating Outlook Upgraded to Positive by Infomerics",
            "Summary": "Globe Civil Projects Limited received a credit rating outlook revision from Infomerics Ratings, with the long-term bank facilities outlook upgraded from Stable to Positive while maintaining the IVR BBB rating. The upgrade was driven by strengthened capital structure following Rs 119 crore mobilization through IPO in July 2025 and projected debt reduction to Rs 120 crore by fiscal 2026 from Rs 155 crore in fiscal 2025. The company's operations expanded to Rs 325.99 crore in fiscal 2025, marking 11% growth, with operating margins improving to 16.43% from 15.10% in the previous year. As of September 2025, the company holds an order book of Rs 1,001.28 crore, representing 3.07 times its fiscal 2025 revenue. The rating reflects the company's experienced management team, established operational track record, and robust order book, while noting challenges from working capital-intensive operations and industry competition.",
            "Sentiment": "positive",
            "PublishDate": 1761843175974,
            "Source": "corporate_action"
        },
        {
            "Title": "Globe Civil Projects Receives Rs. 13.11 Crore Project Contract for NIT Delhi Sports Complex",
            "Summary": "Globe Civil Projects Limited received a letter of intent worth Rs. 13.11 crores from Telecommunications Consultants India Limited. The project involves construction of a Sports Complex and supply, execution, testing & commissioning of 11 KV HT electrical work at the National Institute of Technology Delhi. The contract is on EPC-II basis with a completion period of 12 months. The project is awarded by a domestic entity and does not involve any related party transactions or promoter group interests.",
            "Sentiment": "positive",
            "PublishDate": 1758523705679,
            "Source": "order&deals"
        },
        {
            "Title": "Globe Civil Projects Secures ₹13.11 Crore EPC Contract for NIT Delhi Sports Complex",
            "Summary": "Globe Civil Projects Limited received a Letter of Intent worth ₹13.11 crore from Telecommunications Consultants India Limited (TCIL) for constructing a sports complex and electrical infrastructure at the National Institute of Technology Delhi Campus on an EPC-II basis. The project involves construction of a sports complex and supply, erection, testing & commissioning of 11 KV HT Ring Main. Chairman Ved Prakash Khurana stated this order reinforces the company's reputation in delivering complex EPC projects within educational and institutional infrastructure segments, strengthening the order book and supporting presence in large-scale assignments. Globe Civil Projects is a New Delhi-based integrated EPC company operating across eleven states in India, specializing in transport, logistics, social and commercial infrastructure projects. The company completed its IPO of ₹119 crore and listed on NSE and BSE on July 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758279629708,
            "Source": "order&deals"
        },
        {
            "Title": "Globe Civil Projects Secures Rs 13.11 Crore Project Contract from Telecommunications Consultants India",
            "Summary": "Globe Civil Projects Limited received a Letter of Intent for a project valued at Rs 13.11 crores from Telecommunications Consultants India Limited. The project involves construction of a sports complex and supply, erection, testing and commissioning of 11 KV HT Ring Main at the National Institute of Technology Delhi campus on an Engineering, Procurement and Construction (EPC-II) basis. The project has a completion period of 12 months.",
            "Sentiment": "positive",
            "PublishDate": 1758029578793,
            "Source": "stock"
        },
        {
            "Title": "Globe Civil Projects Reports Rs. 1,000 Crore Order Book, Targets 20-25% Revenue Growth",
            "Summary": "Globe Civil Projects Limited disclosed its Q1 FY2026 earnings call details, revealing an order book worth Rs. 1,000 crores. The company secured Rs. 450 crores in new orders within 55 days of its July 1, 2025 IPO listing, including projects for Central University of Punjab (Rs. 172.99 crores), IIT Kanpur (Rs. 61.78 crores), and Haryana Cricket Association stadium (Rs. 220.2 crores). Management projects 20-25% revenue growth for FY2026 and the next 3-5 years, aiming to double turnover within 4-5 years. The company operates 15 ongoing projects with 6 scheduled for completion in FY2026. Nearly 90% of the portfolio consists of government-funded projects across 11 states. Management announced plans to begin dividend payments in FY2026 and highlighted their focus on high-margin, complex projects through selective bidding.",
            "Sentiment": "positive",
            "PublishDate": 1756383714467,
            "Source": "earnings"
        },
        {
            "Title": "Globe Civil Projects Limited Conducts Q1 FY 2025-26 Earnings Call with Analysts",
            "Summary": "Globe Civil Projects Limited held a conference call with analysts and institutional investors to discuss Q1 FY 2025-26 unaudited results. The company is listed on BSE (Scrip Code: 544424) and NSE (Symbol: GLOBECIVIL). The earnings call took place on August 25, 2025, at 4:00 P.M. The company has made an audio recording of the call available and provided additional details on their website. Vineet Rattan serves as the Company Secretary and Compliance Officer.",
            "Sentiment": "neutral",
            "PublishDate": 1756127563838,
            "Source": "earnings"
        },
        {
            "Title": "Globe Civil Projects Reports Order Book Exceeding ₹1,000 Crore with Market Cap at ₹490 Crore",
            "Summary": "Globe Civil Projects has achieved an order book value of over ₹1,000 crore. The company's market capitalization stands at ₹490 crore.",
            "Sentiment": "positive",
            "PublishDate": 1755757803445,
            "Source": "stock"
        },
        {
            "Title": "Globe Civil Projects Secures ₹222.20 Cr Order for International Cricket Stadium Construction in Haryana",
            "Summary": "Globe Civil Projects Limited received a ₹222.20 crore order from Haryana Cricket Association, Bhiwani, for constructing an International Cricket Stadium at Lohat, District Jhajjar, Haryana. The project has a completion timeline of 24 months and will be executed on BOQ basis. This marks the company's entry into the sports infrastructure segment. Chairman Ved Prakash Khurana stated the project reflects stakeholder confidence in the company's execution capabilities and will contribute to the state's sporting ecosystem. The order strengthens Globe Civil Projects' order book and expands its presence in large-scale infrastructure assignments. The company is a New Delhi-based EPC firm operating across eleven states, specializing in transport, logistics, social, commercial, and residential infrastructure projects.",
            "Sentiment": "positive",
            "PublishDate": 1755599313387,
            "Source": "order&deals"
        },
        {
            "Title": "Globe Civil Projects Reports 79% Drop in Net Profit Despite 68% Revenue Growth",
            "Summary": "Globe Civil Projects Limited reported mixed quarterly results with standalone total income rising 67.8% to ₹651.33 crore compared to ₹388.07 crore in the same period last year. However, net profit declined sharply by 79% to ₹50.58 crore from ₹240.51 crore. EBITDA also fell 79.5% to ₹68.20 crore from ₹332.97 crore. On a consolidated basis, the company saw total income decrease 45.3% to ₹673.50 crore from ₹1,230.18 crore, while net profit dropped 79% to ₹50.50 crore. Basic earnings per share fell to ₹1.16 from ₹5.52 in the previous year. The unaudited results were approved by the Board of Directors on August 14, 2025, and reviewed by statutory auditors.",
            "Sentiment": "negative",
            "PublishDate": 1755346023828,
            "Source": "earnings"
        },
        {
            "Title": "Globe Civil Projects Reports ₹67.70 Cr Consolidated Revenue in Q1 FY26, Secures ₹450 Cr New Orders",
            "Summary": "Globe Civil Projects Limited announced its Q1 FY26 results with consolidated revenue of ₹67.70 Cr, EBITDA of ₹11.88 Cr (17.55% margin), and PAT of ₹5.05 Cr (7.46% margin). Standalone results showed total income of ₹65.50 Cr with EBITDA margin of 18.14% and PAT margin of 7.72%. The company secured new orders worth ₹450 Cr in the last 45 days, with projects worth ₹225 Cr already commenced. Key project wins include IIT Kanpur project (₹61.78 Cr), Central University of Punjab project (₹172.99 Cr), and International Cricket Stadium in Haryana (₹222.20 Cr). The company maintains an order book of ₹1,000 Cr and has strategically focused solely on the contractual EPC segment, discontinuing trading business. Construction now contributes nearly 99% of profits. The company completed its IPO of ₹119 Cr and listed on NSE and BSE on July 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755345692888,
            "Source": "earnings"
        },
        {
            "Title": "Globe Civil Projects Secures Rs 222.20 Crore Contract for International Cricket Stadium in Haryana",
            "Summary": "Globe Civil Projects Limited has received a Letter of Award for constructing an International Cricket Stadium in Lohat, Jhajjar, Haryana. The project is valued at Rs 222.20 crores and has been awarded by the Haryana Cricket Association. The construction work is scheduled to be completed within 24 months.",
            "Sentiment": "positive",
            "PublishDate": 1755189300105,
            "Source": "stock"
        },
        {
            "Title": "Globe Civil Projects Reports Q1 FY26 Results with 51% Revenue Decline",
            "Summary": "Globe Civil Projects Limited reported unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. Standalone revenue from operations fell to ₹651.33 million from ₹991.04 million in the previous quarter. Net profit decreased to ₹50.58 million compared to ₹62.64 million in the prior quarter. On a consolidated basis, revenue from operations was ₹673.50 million versus ₹1,239.18 million in the previous quarter, while net profit remained relatively stable at ₹50.50 million compared to ₹62.64 million. The company completed its IPO during the quarter, allotting 16.76 million equity shares at ₹71 per share, raising ₹1,190 million. The shares were listed on NSE and BSE on July 15, 2025. Basic earnings per share stood at ₹1.16 for the quarter. The company operates primarily in the Engineering, Procurement & Construction (EPC) segment.",
            "Sentiment": "negative",
            "PublishDate": 1755186962313,
            "Source": "earnings"
        },
        {
            "Title": "Globe Civil Projects Reports 56% Jump in Net Profit, Eyes Bigger Government Contracts",
            "Summary": "Globe Civil Projects Limited reported strong financial performance for FY 2024-25, with total revenue growing 13.96% to INR 381.57 crores and net profit surging 56.39% to INR 24.05 crores. EBITDA expanded to INR 56.59 crores with margins improving to 14.83%. The company's debt-equity ratio improved from 1.60 to 1.40, and post-IPO it has fallen below 0.70. The EPC contractor maintains a pending order book of INR 850 crores to be executed over 21-24 months, with 40-60% expected completion in FY 2026. Globe Civil focuses primarily on central government projects (90% of business) including educational institutions, hospitals, and infrastructure. The company recently secured new projects worth INR 250 crores and is bidding for additional contracts worth INR 600-800 crores. Management expects 15-25% annual growth and is targeting larger projects of INR 300-500 crores compared to previous INR 150 crore projects.",
            "Sentiment": "positive",
            "PublishDate": 1753784457992,
            "Source": "earnings"
        },
        {
            "Title": "Globe Civil Projects Conducts Analyst Call for Q4 FY 2024-25 Results",
            "Summary": "Globe Civil Projects Ltd held a conference call with analysts and institutional investors on July 25, 2025, at 4:00 P.M. to discuss their Q4 FY 2024-25 audited results. The company has made an audio recording of the call available on their website and provided a Google Drive link for access. The meeting outcome was communicated to BSE and NSE as part of regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1753450886997,
            "Source": "earnings"
        },
        {
            "Title": "Globe Civil Projects Schedules Earnings Call for July 25, 2025",
            "Summary": "Globe Civil Projects Limited will host an earnings call with analysts and investors on July 25, 2025 at 4:00 PM IST to discuss financial results for the quarter and year ended March 31, 2025. The virtual call will feature senior management including Chairman Ved Prakash Khurana, Managing Director Vipul Khurana, and CFO Raghav Aggarwal. Participants can join via universal dial-in numbers or Diamond Pass login, with registration details provided. An audio replay will be made available on the company's website following the call.",
            "Sentiment": "neutral",
            "PublishDate": 1753190068591,
            "Source": "earnings"
        },
        {
            "Title": "Globe Civil Projects Reports Net Profit of ₹310.51 Million for FY2025",
            "Summary": "Globe Civil Projects Limited announced its audited financial results for the quarter and year ended March 31, 2025. The company reported a net profit of ₹310.51 million for the financial year, compared to ₹151.29 million in the previous year. Revenue from operations increased to ₹3,259.92 million from ₹2,949.05 million. The company operates in Engineering, Procurement & Construction (EPC) and Trading segments. Basic earnings per share stood at ₹5.52 for the year. The Board approved the results based on the Audit Committee's recommendation, with statutory auditors issuing an unmodified opinion. The company's equity shares were listed on NSE and BSE on July 1, 2025, following completion of its IPO of 1,67,60,560 equity shares at ₹71 per share.",
            "Sentiment": "positive",
            "PublishDate": 1753158319149,
            "Source": "earnings"
        },
        {
            "Title": "Globe Civil Project Secures Rs 172.99 Crore Project Contract",
            "Summary": "Globe Civil Project has received a Letter of Award for a project valued at Rs 172.99 crores. The company has been awarded this contract, which represents a significant business development for the organization.",
            "Sentiment": "positive",
            "PublishDate": 1753057649698,
            "Source": "stock"
        },
        {
            "Title": "Globe Civil Project Secures ₹172.99 Crore Contract Award",
            "Summary": "Globe Civil Project has received a Letter of Award for a project valued at ₹172.99 crore. The contract award represents a significant business development for the company.",
            "Sentiment": "positive",
            "PublishDate": 1752906066222,
            "Source": "order&deals"
        },
        {
            "Title": "Globe Civil Projects Lowest Bidder for IIT Kanpur Tender",
            "Summary": "Globe Civil Projects has emerged as the lowest bidder for a tender issued by the Indian Institute of Technology (IIT) Kanpur. The estimated cost of the project is 709.2 million rupees. No further details about the nature of the project or competing bids were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751637790000,
            "Source": "default"
        }
    ]
}