{
    "Symbol": "GLOBALE",
    "ISIN": "INE0URU01010",
    "News": [
        {
            "Title": "Global Tessile Reports Q3FY26 Loss of ₹37.2 Lacs",
            "Summary": "Global Tessile Limited posted a net loss of ₹37.2 lacs for Q3FY26 compared to ₹51.02 lacs loss in Q3FY25. Total income from operations declined to ₹271.83 lacs from ₹1213.17 lacs year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1770880634627,
            "Source": "co_actions_results"
        },
        {
            "Title": "Globale Tessile Limited Reports Q2 FY2026 Financial Results",
            "Summary": "Globale Tessile Limited's Board of Directors approved unaudited financial results for the second quarter and half year ended September 30, 2025, for Financial Year 2025-26. The company reported a profit before tax loss of ₹16.93 lakhs for the period compared to a loss of ₹106.44 lakhs in the previous year. The company's total assets stood at ₹2,551.54 lakhs as of September 30, 2025, compared to ₹2,383.45 lakhs as of March 31, 2025. Current liabilities increased to ₹1,541.83 lakhs from ₹1,250.40 lakhs. The company has identified only one reportable business segment and confirmed it has no subsidiary, associate, or joint venture companies. The results were reviewed by statutory auditors Jain Chowdhary Co., Chartered Accountants.",
            "Sentiment": "neutral",
            "PublishDate": 1762911424491,
            "Source": "earnings"
        },
        {
            "Title": "Globale Tessile Limited Appoints New CFO and Company Secretary",
            "Summary": "Globale Tessile Limited has made two key management appointments. The company appointed Shri Sumit Agarwal as Chief Financial Officer and Key Managerial Personnel with immediate effect on September 25, 2025. Agarwal is an Inter Chartered Accountant with a Bachelor of Commerce degree and over 8 years of experience in finance, accounts, and corporate strategy. He has expertise in financial procedures, accounting systems, budgeting, and has successfully implemented cost-reduction strategies. Additionally, the company appointed CS Palak Bhavsar as Company Secretary and Compliance Officer, also effective immediately. Bhavsar holds qualifications as a Company Secretary, LLB degree, and B.Com, with expertise in corporate governance, legal due diligence, and compliance advisement. Both appointments were approved by the Board of Directors during a meeting held on September 25, 2025. Neither appointee is related to existing Directors or Key Managerial Personnel of the company.",
            "Sentiment": "positive",
            "PublishDate": 1758797656046,
            "Source": "corporate_governance"
        },
        {
            "Title": "CS Dhaval Nagar Resigns as Company Secretary of Globale Tessile Limited",
            "Summary": "CS Dhaval Nagar has resigned from his position as Company Secretary and Compliance Officer of Globale Tessile Limited, effective September 15, 2025. He submitted his resignation on September 4, 2025, citing professional growth and better career opportunities as the reason for his departure. Nagar served as a Key Managerial Person of the company. The resignation was communicated to stock exchanges BSE and NSE by Chairman Jeetmal B. Parekh.",
            "Sentiment": "neutral",
            "PublishDate": 1757069803378,
            "Source": "corporate_governance"
        },
        {
            "Title": "Globale Tessile Reports 94% Revenue Decline but Improves Net Profit in Q1 FY2026",
            "Summary": "Globale Tessile Limited reported mixed quarterly results with total income from operations dropping significantly to ₹104.17 lakhs from ₹1,873.78 lakhs in the previous year, representing a 94.4% decline. Despite the revenue fall, the company improved its net profit after tax to ₹36.17 lakhs compared to ₹12.97 lakhs in the same quarter last year. Earnings per share increased to ₹0.34 from ₹0.14 year-on-year. Net profit before tax decreased to ₹4.68 lakhs from ₹51.57 lakhs in the previous year. The equity share capital remained unchanged at ₹1,062.03 lakhs. The results demonstrate the company's ability to improve bottom-line performance through cost management despite facing significant revenue challenges.",
            "Sentiment": "neutral",
            "PublishDate": 1755517776944,
            "Source": "earnings"
        },
        {
            "Title": "Globale Tessile Reports Loss of Rs 36.17 Lakhs in Q1 FY26 Results",
            "Summary": "Globale Tessile Limited reported a net loss of Rs 36.17 lakhs for the first quarter ended June 30, 2025, compared to a profit of Rs 42.97 lakhs in the same quarter last year. Revenue from operations declined significantly to Rs 104.17 lakhs from Rs 1,873.78 lakhs in the corresponding quarter of the previous year. Total revenue for the quarter was Rs 115.14 lakhs versus Rs 1,885.89 lakhs in Q1 FY25. The company's basic earnings per share stood at negative Rs 0.34. The company continues to face operational disruptions due to a fire incident at key vendor Mahalaxmi Fabric Mills Limited's premises in November 2024, which has impacted the supply chain and contributed to losses during the reporting period. Management is exploring alternative vendors and sourcing options to restore operations.",
            "Sentiment": "negative",
            "PublishDate": 1755100131757,
            "Source": "earnings"
        }
    ]
}