{
    "Symbol": "GLOBALVECT",
    "ISIN": "INE792H01019",
    "News": [
        {
            "Title": "Global Vectra Helicorp Reports Net Loss of Rs 1,294.97 Lakhs in Latest Quarter",
            "Summary": "Global Vectra Helicorp Limited reported a net loss of Rs 1,294.97 lakhs for the quarter ended September 30, 2025, compared to a net loss of Rs 804.42 lakhs in the previous quarter. For the half-year period, the company's net loss widened to Rs 2,099.39 lakhs from Rs 1,351.65 lakhs in the corresponding period last year. The company's total revenue from operations decreased to Rs 8,111.52 lakhs for the quarter from Rs 10,449.55 lakhs in the previous quarter. The Board of Directors approved these unaudited financial results at their meeting held on November 10, 2025. The company operates in helicopter services in India and has no subsidiary, associate, or joint venture companies. Total assets stood at Rs 94,932.49 lakhs as of September 30, 2025, compared to Rs 79,100.60 lakhs as of March 31, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762813331471,
            "Source": "earnings"
        },
        {
            "Title": "Vijay Kedia's Portfolio Stock Global Vectra Surges 20% in Single Session",
            "Summary": "Global Vectra, a stock in ace investor Vijay Kedia's portfolio, surged 20% to hit Rs 243.14 on the NSE amid high trading volumes. The stock extended its rally to 31% over three consecutive sessions. Kedia increased his stake in the company during the September quarter, purchasing nearly 2.6 lakh shares (1.86% stake) through Kedia Securities Private Limited, bringing his total holding to 4.86%. He already held 3% equity directly in his name. The stock is trading above its 50-day and 200-day moving averages and has delivered 325% returns over three years, though it declined 12% in the past year. Global Vectra Helicorp operates as the country's largest private helicopter operator. Kedia's portfolio consists of 15 stocks worth Rs 1,296.1 crore, with his Global Vectra holding valued at Rs 16.3 crore.",
            "Sentiment": "positive",
            "PublishDate": 1760616241988,
            "Source": "stock"
        },
        {
            "Title": "Global Vectra Helicorp Approves Q2 2025 Results, Sets AGM Date and Appoints New Secretarial Auditor",
            "Summary": "Global Vectra Helicorp Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025, along with a limited review report from the statutory auditor. The company scheduled its 27th Annual General Meeting for September 29, 2025. The board also approved the appointment of Mis. Shobha Ambure & Associates as Secretarial Auditor for a five-year term from F.Y. 2025-2026 to F.Y. 2029-2030, effective April 1, 2025, subject to shareholder approval. The appointed firm has 9 years of experience in Company Law, SEBI regulations, and capital markets. The board meeting was held on August 13, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755088334680,
            "Source": "corporate_action"
        },
        {
            "Title": "Global Vectra Helicorp: Vijay Kedia Reduces Stake in Q4 FY25",
            "Summary": "Ace investor Vijay Kedia, through Kedia Securities, reduced his stake in Global Vectra Helicorp from 2.07% to 1.86% in Q4 FY25 by selling 30,000 shares. The small-cap aviation stock has shown a 445% rally over 5 years. For Q3 FY25, the company reported a loss of ₹2.99 crore, narrowing from the previous quarter, with a 10% YoY increase in revenue to ₹142.57 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1744619833000,
            "Source": "normal_news"
        },
        {
            "Title": "Global Vectra Helicorp: Vijay Kedia Reduces Stake in Q4",
            "Summary": "Investor Vijay Kedia reduced his stake in Global Vectra Helicorp from 5.07% to 4.86% in Q4 FY2024. The company's stock has fallen 16% in the past six months but shows over 50% returns on a 1-year basis.",
            "Sentiment": "neutral",
            "PublishDate": 1744449718000,
            "Source": "normal_news"
        },
        {
            "Title": "Global Vectra Helicorp: Vijay Kedia Increases Stake in Q3 FY25",
            "Summary": "Ace investor Vijay Kedia raised his stake in Global Vectra Helicorp to 5.07% during Q3 FY25. The increase was through his firm Kedia Securities Private Limited, which now holds 2.07% stake, up from 1.86% in Q2. Kedia's personal holding remained stable at 3%.",
            "Sentiment": "positive",
            "PublishDate": 1738053627000,
            "Source": "normal_news"
        },
        {
            "Title": "Kedia Securities Private Limited Increases Stake in Global Vectra Helicorp",
            "Summary": "Kedia Securities Private Limited has increased its shareholding in Global Vectra Helicorp by 0.21% during the third quarter. Following this increase, Kedia Securities' total stake in the company now stands at 2.07%.",
            "Sentiment": "neutral",
            "PublishDate": 1736813484000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kedia Securities Increases Stake in Global Vectra Helicorp",
            "Summary": "Kedia Securities Private Limited has increased its stake in Global Vectra Helicorp by 0.21% during the third quarter. Following this acquisition, Kedia Securities' total shareholding in the company now stands at 2.07%.",
            "Sentiment": "neutral",
            "PublishDate": 1736772406000,
            "Source": "corporate_governance"
        }
    ]
}