{
    "Symbol": "GLOBUSSPR",
    "ISIN": "INE615I01010",
    "News": [
        {
            "Title": "Globus Spirits Benefits from New Rajasthan Policy",
            "Summary": "New Rajasthan excise policy effective April 1, 2026 increases net selling value by 5%, provides procurement flexibility, boosts volume by 8%, and cuts bottling fees by 50% for IMFL sold outside state.",
            "Sentiment": "positive",
            "PublishDate": 1769582219692,
            "Source": "stocks"
        },
        {
            "Title": "Globus Spirits Q3 FY26 Results Show Strong Growth",
            "Summary": "Globus Spirits reports 37% Y-o-Y volume growth in P&A segment excluding Delhi, with manufacturing margins at ₹7.50 per liter. Company expects 50% P&A growth in Q4 and UP distillery commissioning soon.",
            "Sentiment": "positive",
            "PublishDate": 1768833714587,
            "Source": "co_actions_results"
        },
        {
            "Title": "Globus Spirits Invests ₹200 Cr in New ENA Facility",
            "Summary": "Globus Spirits announces ₹200 crore investment in new grain ENA production facility, targeting 100,000 liters daily capacity boost in Q4 and 5 million cases by FY29.",
            "Sentiment": "positive",
            "PublishDate": 1768361733062,
            "Source": "stocks"
        },
        {
            "Title": "Globus Spirits Sets Ambitious Growth Targets for FY29",
            "Summary": "Globus Spirits targets 15-17% EBITDA margins for P&A segment by FY29, aiming for 5% market share in R&O segment with 5 million cases. Long-term strategy focuses on diversified revenue mix.",
            "Sentiment": "positive",
            "PublishDate": 1768361448076,
            "Source": "stocks"
        },
        {
            "Title": "Globus Spirits Eyes 50% Growth in Premium Segment",
            "Summary": "Globus Spirits projects 50% volume growth for prestige and above segment in Q4 FY26, targeting 40% consumer business margins while R&O segment expected to grow in mid-single digits.",
            "Sentiment": "positive",
            "PublishDate": 1768360887497,
            "Source": "stocks"
        },
        {
            "Title": "Globus Spirits Maintains EBITDA Margin Guidance",
            "Summary": "Globus Spirits reports Q3 manufacturing EBITDA margin of ₹7.50 per liter, maintaining FY27 guidance of ₹5-7 per liter with 80-85% capacity utilization target.",
            "Sentiment": "positive",
            "PublishDate": 1768360861149,
            "Source": "co_actions_results"
        },
        {
            "Title": "Globus Spirits Q3 FY26: 7,324% Net Profit Surge",
            "Summary": "Globus Spirits Limited reports exceptional Q3 FY26 results with net profit jumping 7,324.39% YoY to ₹30.44 crores, while revenue grows 6.27% to ₹938.36 crores. Stock surges 6.36% on strong performance.",
            "Sentiment": "positive",
            "PublishDate": 1768202330173,
            "Source": "co_actions_results"
        },
        {
            "Title": "Globus Spirits Reports Strong Q3 Growth",
            "Summary": "Globus Spirits delivered exceptional Q3 performance with net profit surging to ₹314.00 million from ₹7.00 million year-on-year, while revenue grew 6.82% to ₹9.40 billion and EBITDA margin expanded significantly.",
            "Sentiment": "positive",
            "PublishDate": 1768176799929,
            "Source": "co_actions_results"
        },
        {
            "Title": "Globus Spirits Q3 PAT surges to ₹30.44 crore",
            "Summary": "Globus Spirits reported multifold increase in Q3 FY26 PAT at ₹30.44 crore vs ₹0.41 crore last year, driven by revenue growth to ₹938.36 crore and strong manufacturing segment performance.",
            "Sentiment": "positive",
            "PublishDate": 1767973354409,
            "Source": "co_actions_results"
        },
        {
            "Title": "Globus Spirits Q3 EBITDA Surges 146% to ₹75.40 Crores",
            "Summary": "Globus Spirits reports remarkable Q3 performance with EBITDA jumping to ₹75.40 crores from ₹30.60 crores year-on-year, while EBITDA margin more than doubles to 8.04%.",
            "Sentiment": "positive",
            "PublishDate": 1767962065496,
            "Source": "co_actions_results"
        },
        {
            "Title": "Globus Spirits Q3 Net Profit Surges 4,385% YoY",
            "Summary": "Globus Spirits reports exceptional Q3 performance with net profit jumping to ₹314 million from ₹7 million year-on-year, while revenue grows 6.8% to ₹9.4 billion.",
            "Sentiment": "positive",
            "PublishDate": 1767961748552,
            "Source": "co_actions_results"
        },
        {
            "Title": "Globus Spirits Q3FY26 profit jumps 7,315% YoY",
            "Summary": "Globus Spirits reports consolidated net profit of ₹3,044.18 lacs for Q3FY26, marking a massive 7,315% increase from ₹41.12 lacs in Q3FY25. Revenue grew 6.27% to ₹93,836.42 lacs.",
            "Sentiment": "positive",
            "PublishDate": 1767957562825,
            "Source": "co_actions_results"
        },
        {
            "Title": "Globus Spirits Q3&9MFY26 earnings call on Jan 13",
            "Summary": "Globus Spirits Limited has scheduled its Q3&9MFY26 earnings conference call for January 13, 2026, at 3:00 PM IST to discuss quarterly and nine-month financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1767355662073,
            "Source": "co_actions_results"
        },
        {
            "Title": "Globus Spirits Calls EGM to Approve ₹500 Crore Fund Raising and Increase FPI Investment Limits",
            "Summary": "Globus Spirits Limited has scheduled an Extraordinary General Meeting on December 18, 2025, to seek shareholder approval for raising up to ₹500 crores through various modes including qualified institutional placements, private offerings, or other permitted methods. The company also proposes to increase Foreign Portfolio Investor (FPI) shareholding limits from 10% to 20% of paid-up equity share capital to widen its investor base and attract foreign investments.",
            "Sentiment": "positive",
            "PublishDate": 1764069484684,
            "Source": "corporate_action"
        },
        {
            "Title": "Globus Spirits Reports 47% EBITDA Growth in H1 FY26, Sets Vision for ₹2,200+ Crore Consumer Revenue by FY29",
            "Summary": "Globus Spirits Limited achieved standalone revenue of ₹1,360 crores in H1 FY26 (up 6% year-on-year) with EBITDA growing 47% to ₹123 crores at 9% margins, driven by steady Regular & Others category returns and reduced losses in Prestige Above category. The company announced its FY29 vision targeting over ₹2,200 crores in total consumer category revenue with 17%+ margins, where 25% will come from the Prestige Above category, supported by expansion to 17 states and upcoming UP distillery commissioning.",
            "Sentiment": "positive",
            "PublishDate": 1763734441776,
            "Source": "corporate_action"
        },
        {
            "Title": "Globus Spirits Sets Ambitious Revenue Target of Rs. 2,200 Crore by FY'29",
            "Summary": "Globus Spirits has announced a strategic goal to achieve over Rs. 2,200 crore in total consumer revenue by FY'29. The company is targeting 17% margins with 25% of revenue expected to come from the prestige category segment.",
            "Sentiment": "positive",
            "PublishDate": 1763437264331,
            "Source": "stock"
        },
        {
            "Title": "Globus Spirits Board to Consider Fundraising Proposal on November 20, 2025",
            "Summary": "Globus Spirits Limited has scheduled a board meeting for November 20, 2025, to evaluate a fundraising proposal through various instruments including equity shares, convertible securities, or debt instruments via private placement, public issue, or rights issue. The company may convene an extraordinary general meeting or postal ballot to seek shareholder approval if the board approves the proposal, with the trading window remaining closed for directors and senior employees.",
            "Sentiment": "neutral",
            "PublishDate": 1763356280493,
            "Source": "corporate_action"
        },
        {
            "Title": "Globus Spirits Reports Strong Q2 Performance with 44% Revenue Growth and Strategic Beer Segment Entry",
            "Summary": "Globus Spirits Limited announced its quarterly results for the period ended September 30, 2025. The company reported consolidated revenue from operations of ₹87,704.81 lacs compared to ₹49,233.60 lacs in the same period last year, representing significant growth. Profit after tax increased to ₹2,954.42 lacs from ₹1,405.17 lacs year-over-year. The company made a strategic investment of ₹99.84 lacs in a joint venture with ANSAMCAL Limited to enter the beer segment as part of portfolio diversification. During the period, 77,409 equity shares were allotted under the Employee Stock Option Plan 2021, increasing the equity share capital to 28,965,734 shares. The company received a favorable income tax order for assessment year 2012-2013, allowing previously disallowed expenses of ₹185.06 lacs. Globus Spirits continues to face ongoing income tax assessment matters totaling ₹5,649.00 lacs for multiple assessment years, against which appeals have been filed.",
            "Sentiment": "positive",
            "PublishDate": 1762937866384,
            "Source": "earnings"
        },
        {
            "Title": "Globus Spirits Reports Strong Q2 Performance with 15x Jump in Net Profit",
            "Summary": "Globus Spirits delivered robust quarterly results with revenue reaching 6.6 billion rupees compared to 6.4 billion rupees in the same period last year. The company's net profit surged significantly to 233 million rupees from 15 million rupees year-over-year. EBITDA nearly doubled to 626 million rupees from 331 million rupees, while EBITDA margin expanded to 9% from 5% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762933136098,
            "Source": "earnings"
        },
        {
            "Title": "Globus Spirits Limited Receives ICRA A+ Stable Rating for Bank Facilities Worth Rs 744 Crore",
            "Summary": "Globus Spirits Limited announced that ICRA Limited has assigned credit ratings to its bank facilities totaling Rs 744 crore. The company received an ICRA A+ (Stable) rating for both its long-term fund-based cash credit facility of Rs 390 crore and term loan facility of Rs 354 crore. The ratings are due for surveillance within one year from the rating communication date. ICRA reserves the right to review and revise the ratings based on new information or changing circumstances.",
            "Sentiment": "positive",
            "PublishDate": 1762807729541,
            "Source": "corporate_action"
        },
        {
            "Title": "Globus Spirits Launches New Product 'Doaab Expression 02: The Old Man & The Blossom'",
            "Summary": "Globus Spirits has launched a new product called 'Doaab Expression 02: The Old Man & The Blossom.' This represents a product expansion for the spirits company.",
            "Sentiment": "positive",
            "PublishDate": 1762427194161,
            "Source": "stock"
        },
        {
            "Title": "Globus Spirits Launches Premium Vodka Filtered With Amethyst Crystals",
            "Summary": "Globus Spirits has launched Terai India Craft Vodka, which the company describes as the world's first premium vodka filtered with amethyst crystals. The product represents a new offering in the premium vodka segment for the spirits manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1759148122351,
            "Source": "stock"
        },
        {
            "Title": "Globus Spirits Reports Rs 13.50 Crore Revenue Impact Due to Flooding at Haryana Plant",
            "Summary": "Globus Spirits Ltd experienced operational disruption at its Samalkha unit in Haryana due to flooding from August 15, 2025, lasting 23 days. The flooding caused road blockages and supply chain disturbances, forcing the plant to operate at 50% capacity. This resulted in a revenue impact of Rs. 13.50 crores for the affected period. The company confirmed no destruction of stocks and assets occurred, and the revenue impact is covered under insurance.",
            "Sentiment": "neutral",
            "PublishDate": 1757669702343,
            "Source": "stock"
        },
        {
            "Title": "Indian Alcohol Market Shifts Toward Premium and Basic Brands as Mid-Market Shrinks",
            "Summary": "The Indian alcoholic beverages industry is experiencing a dual-track growth pattern with consumers choosing either premium luxury products or affordable value brands, according to Globus Spirits executives. The traditional mid-market segment is shrinking as consumers move between price points based on occasions rather than sticking to rigid price barriers. Indian companies are building premium portfolios for global markets, targeting Europe, the US, Middle East, Africa and Australia, moving beyond traditional mass-market exports to African nations. Domestic consumers are showing increased confidence in homegrown labels over multinational brands. Globus Spirits has entered western markets including Mumbai and Goa, with plans to expand into Odisha, Assam and southern India. The company's luxury label Doaab India Craft Whisky aims to reimagine indigenous Indian spirits that were marginalized during colonial times. Globus Spirits plans to enter at least two new categories beyond whisky and rum next year, leveraging their family legacy in distilling dating to 1958.",
            "Sentiment": "positive",
            "PublishDate": 1756904076485,
            "Source": "stock"
        },
        {
            "Title": "Globus Spirits Reports Strong Q1 FY26 Results with Prestige Segment Nearing Breakeven",
            "Summary": "Globus Spirits delivered robust quarterly performance with consumer business contributing 39% to total revenues, growing 14% year-on-year and 9% quarter-on-quarter. The Prestige & Above segment achieved 50% year-on-year growth and 36% quarter-on-quarter growth, reaching near breakeven status ahead of expectations. Manufacturing business improved with EBITDA margins at INR6 per liter and 81% capacity utilization. The company expanded into Uttar Pradesh's IMIL market, recording 0.13 million cases with strong growth potential. Raw material costs declined with rice prices down 15% and maize prices down 20% from peak levels. The company secured forward contracts for 17-18% of annual maize demand to reduce margin volatility. Net debt decreased by INR40 crores, and the new UP distillery project remains on track for Q3 commissioning. Management expects manufacturing margins to average INR7 per liter going forward with reduced volatility.",
            "Sentiment": "positive",
            "PublishDate": 1754653441308,
            "Source": "earnings"
        },
        {
            "Title": "Globus Spirits Releases Q1 FY2026 Financial Results",
            "Summary": "Globus Spirits Ltd. approved and released its unaudited standalone and consolidated financial results for the first quarter ended June 30, 2025, along with the Limited Review Report from auditors. The Board of Directors meeting was held on August 4, 2025, commencing at 12:30 PM and concluding at 3:15 PM. The company has informed stock exchanges NSE and BSE about the outcome of the board meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1754303564221,
            "Source": "earnings"
        },
        {
            "Title": "Globus Spirits Reports Higher Q1 Profit and Revenue Growth",
            "Summary": "Globus Spirits reported net profit of 185 million rupees in Q1, up from 164 million rupees in the same period last year. The company's revenue increased to 7 billion rupees from 6.4 billion rupees year-over-year. EBITDA rose to 600 million rupees compared to 501 million rupees previously, while EBITDA margin improved to 9% from 8% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754299973817,
            "Source": "earnings"
        },
        {
            "Title": "Globus Spirits Schedules Q1FY26 Earnings Conference Call for August 4, 2025",
            "Summary": "Globus Spirits Ltd has announced a Q1FY26 earnings conference call scheduled for Monday, August 4, 2025, at 3:30 PM IST. The call will feature key company representatives including Joint MD Shekhar Swarup, CEO of Consumer Division Paramjit Gill, and CFO Nilanjan Sarkar to discuss quarterly financial results. The company has provided multiple access numbers for participants, including universal access numbers for domestic callers and international toll-free numbers for Hong Kong, Singapore, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1753189091009,
            "Source": "earnings"
        },
        {
            "Title": "Globus Spirits Reports Q4 Financial Results and Dividend Recommendation",
            "Summary": "Globus Spirits announced its Q4 financial results. The company reported a net profit of 63 million rupees, compared to 3.76 million rupees year-over-year and 7 million rupees quarter-over-quarter. Revenue for Q4 was 8.8 billion rupees, up from 7.8 billion rupees in the same quarter last year. Additionally, the company has recommended a dividend of 2.76 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747700322000,
            "Source": "default"
        },
        {
            "Title": "Globus Spirits: Q4 Profit Surges, Dividend Declared",
            "Summary": "Globus Spirits reported a significant increase in Q4FY25 net profit to ₹6.3 crore, up from ₹0.7 crore in Q3. Revenue rose 8.8% QoQ to ₹654.5 crore. EBITDA grew 14% QoQ to ₹39.2 crore. The company declared a dividend of ₹2.76 per share for FY2024-25, with a record date of August 11, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1747667855000,
            "Source": "earnings"
        },
        {
            "Title": "Globus Spirits Reports Q4 Results and Recommends Dividend",
            "Summary": "Globus Spirits has announced its Q4 results and dividend recommendation. The company's Q4 EBITDA increased to 392 million rupees from 205.8 million rupees year-over-year, with EBITDA margin improving to 4.48% from 2.64%. Net profit for Q4 rose to 63 million rupees, up from 3.76 million rupees year-over-year and 7 million rupees quarter-on-quarter. Q4 revenue stood at 8.8 billion rupees, compared to 7.8 billion rupees in the previous year. The company has recommended a dividend of 2.76 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747659461000,
            "Source": "result"
        },
        {
            "Title": "Globus Spirits Unit Launches Premium Strong Beer in Uttar Pradesh",
            "Summary": "Globus Spirits' subsidiary, Gapl, has begun production of Carib® Premium Strong Beer in 500 ml cans in Uttar Pradesh. The product is priced at ₹130 per can.",
            "Sentiment": "positive",
            "PublishDate": 1746490036000,
            "Source": "default"
        },
        {
            "Title": "Globus Spirits Subsidiary Launches Premium Beer in Uttar Pradesh",
            "Summary": "Globus Spirits' subsidiary, GAPL, has started production of CARIB® Premium Strong Beer in 500 ml cans in Uttar Pradesh. The product is priced at ₹130 per can.",
            "Sentiment": "positive",
            "PublishDate": 1746460656000,
            "Source": "default"
        },
        {
            "Title": "Globus Spirits Reports Significant Decline in Q3 Net Profit",
            "Summary": "Globus Spirits has reported a substantial decrease in its third-quarter net profit, which fell to 7.19 million rupees from 445 million rupees in the same period last year. The company's revenue remained stable at 8.8 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739349045000,
            "Source": "earnings"
        },
        {
            "Title": "Globus Spirits Announces Price Increase in Rajasthan Excise Policy",
            "Summary": "Globus Spirits has reported an update regarding the Rajasthan Excise Policy. According to the policy, the net selling value per unit of the company's regular and other brands will increase by 4.35% starting from April 1, 2025. This increase is based on the company's FY25 TTM (Trailing Twelve Months) volume mix.",
            "Sentiment": "positive",
            "PublishDate": 1738548876000,
            "Source": "corporate_action"
        },
        {
            "Title": "Income Tax Searches Underway at 360 ONE Offices",
            "Summary": "Income tax authorities are currently conducting searches at the offices of 360 ONE, a financial services company. The ongoing investigation suggests potential scrutiny of the company's financial practices or compliance issues.",
            "Sentiment": "negative",
            "PublishDate": 1738047106000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Globus Spirits Ltd: Share Price Surges on Rice Price Reduction for Ethanol Production",
            "Summary": "Globus Spirits Ltd's share price increased by over 17% following the government's decision to reduce rice prices for ethanol distilleries from Rs 28 to Rs 22.50 per kg. The center also lowered the reserve price of FCI rice under the Open Market Sale Scheme to Rs 2,250 for states and ethanol producers. Ethanol distilleries can purchase 24 lakh tonnes at this reduced rate until June 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1737354638000,
            "Source": "normal_news"
        },
        {
            "Title": "Rice Price Reduction for Ethanol Distilleries",
            "Summary": "The Ministry of Consumer Affairs, Food & Public Distribution has announced a reduction in the price of rice supplied to ethanol distilleries. The price has been lowered from Rs 28 per kg to Rs 22.50 per kg, as reported by Globus Spirits.",
            "Sentiment": "positive",
            "PublishDate": 1737349655000,
            "Source": "corporate_action"
        },
        {
            "Title": "Globus Spirits Launches New Brands in Uttar Pradesh",
            "Summary": "Globus Spirits has introduced two new brands, Shola Shabnam and Nimboo, in the Uttar Pradesh market. These products are priced between 50-70 rupees for a 180ml pack and are available in aseptic brick packaging.",
            "Sentiment": "positive",
            "PublishDate": 1734310777000,
            "Source": "corporate_action"
        },
        {
            "Title": "Globus Spirits Launches New Brands in Uttar Pradesh",
            "Summary": "Globus Spirits has introduced two new brands, 'Shola Shabnam' and 'Nimboo', in the Uttar Pradesh market. These products are priced between Rs. 50-70 for 180ml and are available in aseptic brick packs.",
            "Sentiment": "positive",
            "PublishDate": 1734093885000,
            "Source": "corporate_action"
        },
        {
            "Title": "Globus Spirits Launches Terai India Craft Gin",
            "Summary": "Globus Spirits has announced the launch of a new product, Terai India Craft Gin. This introduction represents the company's expansion into the premium craft gin market, potentially diversifying its product portfolio and targeting a new consumer segment.",
            "Sentiment": "positive",
            "PublishDate": 1733410668000,
            "Source": "corporate_action"
        },
        {
            "Title": "Globus Spirits Launches New Whisky Brand in Jaipur and Lucknow",
            "Summary": "Globus Spirits has introduced a new whisky brand called 'DŌAAB India Craft' in Jaipur and Lucknow markets. The company is expanding its product portfolio with innovative offerings and plans to launch more products in the second half of fiscal year 2025.",
            "Sentiment": "positive",
            "PublishDate": 1731403870000,
            "Source": "corporate_action"
        },
        {
            "Title": "Globus Spirits Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Globus Spirits has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 was 303 million rupees, down from 375 million rupees in the same quarter last year. The EBITDA margin also decreased to 3.46% from 5.08% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731402426000,
            "Source": "result"
        },
        {
            "Title": "Globus Spirits Reports Q2 Revenue Growth",
            "Summary": "Globus Spirits has announced its Q2 revenue, which increased to 8.7 billion rupees from 7.4 billion rupees in the same quarter last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731402341000,
            "Source": "result"
        },
        {
            "Title": "Globus Spirits Reports Significant Drop in Q2 Net Profit",
            "Summary": "Globus Spirits has reported a net profit of 15 million rupees for the second quarter, which represents a substantial decrease from 130 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731402311000,
            "Source": "result"
        }
    ]
}