{
    "Symbol": "GLOSTERLTD",
    "ISIN": "INE350Z01018",
    "News": [
        {
            "Title": "Gloster Reports Q3 Loss Despite Revenue Surge",
            "Summary": "Gloster swung to a consolidated net loss of ₹7.4 million in Q3 from ₹8.3 million profit year-ago, despite revenue more than doubling to ₹3.8 billion.",
            "Sentiment": "negative",
            "PublishDate": 1770198323205,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gloster Limited Seeks Shareholder Approval for Enhanced Borrowing Powers",
            "Summary": "Gloster Limited announces postal ballot to increase borrowing limits and asset mortgage powers from ₹250 crores to ₹500 crores. E-voting commences January 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767620638423,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gloster Board Approves ₹5 Cr Investment in Jute SPV",
            "Summary": "Gloster Limited's board authorized a ₹5 crore investment for 49% stake in a new SPV for jute gunny bag manufacturing, with first tranche completion targeted by March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767188496472,
            "Source": "stocks"
        },
        {
            "Title": "Gloster Limited Board Approves Modified Amalgamation Scheme with Two Wholly-Owned Subsidiaries",
            "Summary": "Gloster Limited's Board of Directors approved a modified Scheme of Amalgamation involving the merger of two wholly-owned subsidiaries - Gloster Lifestyle Limited and Gloster Specialities Limited - with the parent company. The scheme was originally approved in November 2024 and is now subject to requisite approvals under Sections 230 to 232 of the Companies Act, 2013. Gloster Limited reported a turnover of Rs. 62,668.27 lakhs for the year ended March 31, 2025, with a paid-up share capital of Rs. 10,94,32,600. Both transferor companies have a paid-up share capital of Rs. 4,00,000 each with nil turnover. The company stated the amalgamation will enable more efficient utilization of capital and assets, strengthening the foundation for future growth. No shares will be allotted in exchange as the subsidiaries are wholly-owned, and there will be no change in the shareholding pattern of the listed entity.",
            "Sentiment": "positive",
            "PublishDate": 1762961928303,
            "Source": "corporate_action"
        },
        {
            "Title": "Gloster Reports Mixed Q2 Results with Revenue Growth but Lower Profitability",
            "Summary": "Gloster reported quarterly results showing revenue growth to 2.1 billion rupees from 1.4 billion rupees year-over-year. EBITDA increased to 175 million rupees from 142 million rupees, but EBITDA margin declined to 8.32% from 10.23%. Net profit decreased to 76 million rupees compared to 111 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1762949794142,
            "Source": "earnings"
        },
        {
            "Title": "Gloster Limited Appoints M/s Singhi & Co. as Statutory Auditors Through Postal Ballot",
            "Summary": "Gloster Limited successfully appointed M/s Singhi & Co., Chartered Accountants, as Statutory Auditors through a postal ballot process. The ordinary resolution was passed with requisite majority on October 17, 2025, with 99.9972% of valid votes cast in favor. The remote e-voting period ran from September 19 to October 17, 2025. Out of 10,943,260 total shares, 9,064,985 votes were polled representing 82.84% participation. The scrutinizer Ms. Sweety Kapoor, Practicing Company Secretary, oversaw the voting process and submitted the results report. The resolution also covers fixing the auditors' remuneration.",
            "Sentiment": "positive",
            "PublishDate": 1760710794951,
            "Source": "corporate_action"
        },
        {
            "Title": "Gloster Limited Appoints Singhi & Co. as New Statutory Auditors Following Price Waterhouse Resignation",
            "Summary": "Gloster Limited and its material subsidiary Fort Gloster Industries Limited announced a change in statutory auditors on September 11, 2025. Price Waterhouse & Co Chartered Accountants LLP resigned from their positions, with no specific reasons provided beyond those mentioned in their resignation letter. The Board of Directors appointed Singhi & Co., Chartered Accountants as replacement auditors for both companies, effective September 11, 2025. The appointments are subject to shareholder approval at general meetings. Singhi & Co. is a chartered accountancy firm founded in 1940, employing over 600 people and serving more than 100 listed companies as clients. The firm has collaboration with Moore Global Network and provides services including audit, assurance, risk consulting, corporate finance, tax, and management consulting.",
            "Sentiment": "neutral",
            "PublishDate": 1757590932583,
            "Source": "corporate_governance"
        },
        {
            "Title": "Price Waterhouse & Co LLP Resigns as Statutory Auditor of Gloster Limited and Material Subsidiary",
            "Summary": "Price Waterhouse & Co Chartered Accountants LLP resigned as statutory auditors of Gloster Limited and its material subsidiary Fort Gloster Industries Limited, effective August 13, 2025. The resignation stems from a difference of opinion on revenue recognition adopted by the material subsidiary regarding a contract with a customer. The auditor issued a qualified conclusion on the consolidated financial results for the quarter ended June 30, 2025, citing this disagreement. Price Waterhouse had been serving as auditor for Gloster Limited since 2017 and was reappointed in 2022 for a second five-year term until 2027. For the material subsidiary, they were appointed in 2021 for a five-year term until 2026. The company's Audit Committee and Board will consider appointing new statutory auditors to fill the vacancy.",
            "Sentiment": "negative",
            "PublishDate": 1755101009863,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gloster Limited Reports Q1 FY26 Results; Board Addresses BSE Fine for Delayed Filing",
            "Summary": "Gloster Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 13,590.49 lakhs compared to Rs 27,833.89 lakhs in the previous quarter, with profit after tax of Rs 537.92 lakhs versus Rs 468.67 lakhs. On a consolidated basis, the company posted a loss after tax of Rs 232.22 lakhs compared to a profit of Rs 300.17 lakhs in the previous quarter. The Board also noted a fine imposed by BSE for delayed filing of related party statements for the half year ended March 31, 2025, and recommended paying the fine under protest while applying for a waiver, citing the delay was unintentional due to website/technical issues. The company operates in two segments - Jute Goods and Cables, with Cable business representing operations of subsidiary Fort Gloster Industries Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1754664639730,
            "Source": "earnings"
        },
        {
            "Title": "Gloster Reports 30% Jump in Quarterly Revenue to 1.7 Billion Rupees",
            "Summary": "Gloster reported quarterly revenue of 1.7 billion rupees compared to 1.3 billion rupees in the same period last year. Net profit increased to 53.7 million rupees from 46.8 million rupees year-over-year. EBITDA rose to 124 million rupees from 105 million rupees, though EBITDA margin declined to 7.31% from 7.94% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754663953034,
            "Source": "earnings"
        },
        {
            "Title": "DGTR Initiates Mid-Term Review of Anti-Dumping Duties on Jute Imports",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has started a mid-term review of anti-dumping duties on jute imports from Bangladesh and Nepal. This review has been initiated due to concerns over price drops and potential damage to local producers in the jute industry.",
            "Sentiment": "neutral",
            "PublishDate": 1751427526000,
            "Source": "default"
        },
        {
            "Title": "Gloster Reports Q4 Results and Recommends Dividend",
            "Summary": "Gloster has announced its Q4 financial results and dividend recommendation. The company's Q4 revenue increased to 1.97 billion rupees from 1.85 billion rupees year-over-year. However, Q4 EBITDA decreased to 146.2 million rupees from 234.9 million rupees, with EBITDA margin falling to 7.43% from 12.72%. Q4 net profit slightly increased to 141.4 million rupees from 138.7 million rupees year-over-year. The company has recommended a dividend of 20 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1748529520000,
            "Source": "result"
        },
        {
            "Title": "Gloster Reports Q2 Financial Results and Approves Amalgamation Scheme",
            "Summary": "Gloster reported its Q2 financial results with a slight decrease in net profit and revenue compared to the previous year. The company's net profit was 111 million rupees, down from 113 million rupees year-over-year. Revenue decreased to 1.4 billion rupees from 1.62 billion rupees. EBITDA also declined to 142 million rupees from 203 million rupees, with EBITDA margin dropping to 10.23% from 12.5%. Additionally, Gloster approved a scheme of amalgamation involving Gloster Lifestyle and Gloster Specialities.",
            "Sentiment": "neutral",
            "PublishDate": 1731549082000,
            "Source": "result"
        }
    ]
}