{
    "Symbol": "GLOTTIS",
    "ISIN": "INE0TQE01026",
    "News": [
        {
            "Title": "Glottis Board Meet Set for Feb 13 to Review Q3 Results",
            "Summary": "Glottis Limited has scheduled a board meeting on February 13, 2026, to consider and approve unaudited standalone financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770477436560,
            "Source": "co_actions_results"
        },
        {
            "Title": "Glottis Opens New Branch Office in Ahmedabad",
            "Summary": "Glottis Limited announces opening of new branch office in Ahmedabad's Thaltej area effective January 2, 2026, to expand operational reach and enhance customer service in the region.",
            "Sentiment": "positive",
            "PublishDate": 1767338135459,
            "Source": "stocks"
        },
        {
            "Title": "Glottis Limited Reports 27.7% Sequential Revenue Growth in Q2 FY26 Earnings Call",
            "Summary": "Glottis Limited reported revenue of INR 2,147 million for Q2 FY26, marking a 27.7% sequential increase, with EBITDA at INR 181 million (8.4% margin) and PAT at INR 124 million (5.8% margin). The logistics company plans to begin purchasing trailers and containers worth INR 130 crores from December 2025 using IPO proceeds, while expanding its sales team in western and northern regions to diversify beyond its current 47% renewable energy sector concentration.",
            "Sentiment": "positive",
            "PublishDate": 1763626218601,
            "Source": "earnings"
        },
        {
            "Title": "Glottis Reports Mixed Q2 Results with 25% Revenue Decline YoY Despite Sequential Growth",
            "Summary": "Glottis Ltd. reported Q2 FY26 revenue of ₹214.7 crore, down 25.2% year-on-year due to softer freight demand, while net profit fell 39.9% to ₹12.4 crore. The logistics company's shares remain 43% below its IPO price of ₹129, though sequential revenue improved 27.7% with encouraging performance in air segment operations.",
            "Sentiment": "neutral",
            "PublishDate": 1763343242580,
            "Source": "earnings"
        },
        {
            "Title": "Glottis Limited Settles GST Dispute, Pays Rs 1.18 Crore in Tax and Interest",
            "Summary": "Glottis Limited resolved a GST investigation by the Commercial Tax Officer, Chennai, paying Rs 1.18 crore covering short remittance of Reverse Charge Mechanism on import of services for FY 2019-20 and FY 2022-23. The company settled all outstanding amounts in September 2025, with the matter now concluded and no material impact on operations.",
            "Sentiment": "neutral",
            "PublishDate": 1763206571686,
            "Source": "stock"
        },
        {
            "Title": "GLOTTIS Reports 40% Decline in Q2 Net Profit to 123.5M Rupees",
            "Summary": "GLOTTIS reported Q2 net profit of 123.5M rupees, down from 205.7M rupees year-over-year, with revenue declining to 2.15B rupees from 2.87B rupees. The company's EBITDA fell to 181.3M rupees with margins compressing to 8.44% from 10% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1763129304667,
            "Source": "earnings"
        },
        {
            "Title": "Glottis Plans Rapid Expansion of Diagnostic and Healthcare Network",
            "Summary": "Glottis announced plans for rapid expansion of its diagnostic and specialty healthcare network. The company intends to leverage technology-enabled delivery systems and pursue international market penetration as part of its growth strategy to achieve margin improvements.",
            "Sentiment": "positive",
            "PublishDate": 1761755119052,
            "Source": "stock"
        },
        {
            "Title": "Glottis Limited Reports 12.6% Revenue Growth in Q1 Results",
            "Summary": "Glottis Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. Revenue from operations increased to ₹16,815.51 lakhs compared to ₹14,932.54 lakhs in the same quarter previous year, representing a 12.6% growth. Net profit for the quarter stood at ₹1,194.13 lakhs versus ₹1,075.58 lakhs in the prior year quarter. The company completed its IPO of 2,37,98,640 shares at ₹129 per share, raising ₹30,700.24 lakhs, with equity shares listed on NSE and BSE on October 7, 2025. Finance costs increased due to corporate office lease from October 1, 2024, and working capital loans. The company resolved a GST dispute where the department's appeal was dismissed by the Commissioner of GST and Central Excise on October 24, 2025. Earnings per share for the quarter was ₹1.49.",
            "Sentiment": "positive",
            "PublishDate": 1761569754544,
            "Source": "earnings"
        }
    ]
}