{
    "Symbol": "GMBREW",
    "ISIN": "INE075D01018",
    "News": [
        {
            "Title": "GM Breweries Holds EGM on February 05, 2026",
            "Summary": "GM Breweries Limited conducted an Extraordinary General Meeting on February 05, 2026, via video conferencing with 42 shareholders present, addressing key director appointments and reappointments.",
            "Sentiment": "neutral",
            "PublishDate": 1770274117496,
            "Source": "stocks"
        },
        {
            "Title": "GM Breweries Q3 Results: Profit Rises 91%; Shares Hit Life High",
            "Summary": "GM Breweries reports 91% profit growth to ₹42 crores in Q3, revenue up 21.9%. Shares hit life high of ₹1,328.80 before paring gains to trade 6.15% lower at ₹1,171.",
            "Sentiment": "positive",
            "PublishDate": 1767682276898,
            "Source": "co_actions_results"
        },
        {
            "Title": "GM Breweries Appoints Hardik Shah as Independent Director for Five Years",
            "Summary": "GM Breweries Limited announced the appointment of Mr. Hardik Shah as an Independent Director for a five-year term effective November 11, 2025. The decision was made during a Board of Directors meeting held on the same date. Mr. Shah is a Fellow Chartered Accountant with over two decades of experience across Media, Food & Beverage, and Retail sectors. He serves as a Virtual CFO Services Practitioner and holds multiple certifications from ICAI in Artificial Intelligence, International Financial Reporting Standards, and Information System Audit. He is also certified by the National Stock Exchange in Financial Market Surveillance and Depository Operations.",
            "Sentiment": "positive",
            "PublishDate": 1762846254284,
            "Source": "corporate_governance"
        },
        {
            "Title": "GM Breweries Reports 61% Jump in Net Profit with Improved Margins",
            "Summary": "GM Breweries Ltd. reported a 61% increase in net profit to Rs 35 crore compared to Rs 22 crore in the previous year. Revenue grew 21.2% to Rs 181 crore from Rs 149 crore. The company's EBITDA rose 59% to Rs 45 crore versus Rs 28 crore, while margins improved to 24.9% from 18.9%. Following the results, GM Breweries shares surged 15% to Rs 880, significantly outperforming the benchmark Nifty 50 which gained 0.3%.",
            "Sentiment": "positive",
            "PublishDate": 1759993749137,
            "Source": "earnings"
        },
        {
            "Title": "GM Breweries' Subsidiary to Explore Real Estate Investment Opportunities",
            "Summary": "GM Breweries announced that its wholly owned subsidiary plans to explore real estate opportunities. The company is looking to diversify into the real estate sector through its subsidiary unit.",
            "Sentiment": "positive",
            "PublishDate": 1759992988317,
            "Source": "stock"
        },
        {
            "Title": "GM Breweries Reports Strong Q2 Performance with 61% Jump in EBITDA",
            "Summary": "GM Breweries delivered robust quarterly results with EBITDA rising to 448 million rupees from 275 million rupees year-over-year. The company's EBITDA margin improved to 6.24% compared to 4.62% in the same period last year. Revenue grew to 7.2 billion rupees from 5.9 billion rupees year-over-year. Net profit increased significantly to 349 million rupees from 217 million rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1759992632565,
            "Source": "earnings"
        },
        {
            "Title": "GM Breweries Schedules Second Quarter Results Review for October 9",
            "Summary": "GM Breweries has announced that it will review its second quarter results on October 9. The company has set this date for the quarterly results review.",
            "Sentiment": "neutral",
            "PublishDate": 1758605120956,
            "Source": "earnings"
        },
        {
            "Title": "DeVANS' GianChand Adambaraa Wins Best Indian Single Malt at International Whisky Competition 2025",
            "Summary": "DeVANS Modern Breweries' single malt expression GianChand Adambaraa won first place in both 'Best Indian Single Malt' and 'Best Indian Whisky' categories at the International Whisky Competition 2025 in Las Vegas. The whisky received praise from global critic Jim Murray, who described it as the closest to a high-class Scottish malt he has found anywhere in the world. Produced in Jammu and Kashmir, the unpeated single malt is matured in American ex-bourbon casks and features tasting notes of dried apricot, honey, caramel and toffee. The product is currently available at duty-free outlets in Hyderabad and Delhi, with plans for wider retail expansion. This recognition strengthens India's position in the premium whisky segment.",
            "Sentiment": "positive",
            "PublishDate": 1752851740937,
            "Source": "stock"
        },
        {
            "Title": "GM Breweries: Q1 Profit Up 4%, Margin Narrows",
            "Summary": "GM Breweries reported a 4% increase in net profit to ₹26 crore for Q1 FY24. Revenue rose 6.8% to ₹162.8 crore, while EBITDA grew 2% to ₹30.9 crore. However, the company's margin contracted to 18.98% from 20.67% year-on-year. The stock fell 3% following the results announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1752568003000,
            "Source": "earnings"
        },
        {
            "Title": "GM Breweries Reports Q1 Financial Results",
            "Summary": "GM Breweries has released its Q1 financial results. The company reported a net profit of 258 million rupees, up from 249 million rupees in the same quarter last year. EBITDA for Q1 was 309 million rupees, down from 314 million rupees year-over-year. The EBITDA margin decreased to 4.84% from 5.24% in the previous year's quarter. Revenue for Q1 increased to 6.38 billion rupees from 6 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1752561904000,
            "Source": "result"
        },
        {
            "Title": "G. M. Breweries to Review Q1 Results on July 15",
            "Summary": "G. M. Breweries has announced that it will review its first quarter results on July 15. The company has not provided any additional details about the financial performance or expectations for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1750678458000,
            "Source": "default"
        },
        {
            "Title": "GM Breweries: Q4 Profit Down 30%, Declares ₹7.5 Dividend",
            "Summary": "GM Breweries reported a 30% drop in Q4 profit to ₹60.5 crore, despite 6% revenue growth to ₹169.3 crore. EBITDA increased 17% to ₹29 crore. The board recommended a final dividend of ₹7.5 per share for the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1744704649000,
            "Source": "earnings"
        },
        {
            "Title": "GM Breweries Declares Dividend of Rs 7.5 Per Equity Share",
            "Summary": "GM Breweries has announced a dividend of Rs 7.5 per equity share for its shareholders. This corporate action represents a distribution of the company's profits to its investors.",
            "Sentiment": "positive",
            "PublishDate": 1744700318000,
            "Source": "corporate_action"
        },
        {
            "Title": "GM Breweries Reports Improved Q4 EBITDA and Margin",
            "Summary": "GM Breweries has announced its Q4 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 287 million rupees, up from 252 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 4.33% from 4.04% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1744699633000,
            "Source": "earnings"
        },
        {
            "Title": "GM Breweries Reports 6.6% Year-over-Year Revenue Growth in Q4",
            "Summary": "GM Breweries has announced its fourth quarter financial results, reporting revenue of 6.6 billion rupees. This represents a 6.6% increase compared to the same quarter last year, when the company reported revenue of 6.2 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1744699594000,
            "Source": "earnings"
        },
        {
            "Title": "GM Breweries Reports Q4 Net Profit of 605 Million Rupees",
            "Summary": "GM Breweries has reported a net profit of 605 million rupees for the fourth quarter, compared to 866 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1744699544000,
            "Source": "earnings"
        },
        {
            "Title": "G. M. Breweries to Acquire Unit for Infrastructure Development Venture",
            "Summary": "G. M. Breweries has announced plans to acquire a unit to expand into infrastructure development. This move represents a significant diversification from the company's core brewing business, potentially opening up new revenue streams and growth opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1741244660000,
            "Source": "corporate_action"
        },
        {
            "Title": "G M Breweries to Consider Business Diversification",
            "Summary": "G M Breweries has announced a board meeting scheduled for March 6 to discuss potential business diversification strategies. This meeting indicates the company's interest in exploring new business opportunities or expanding its current operations.",
            "Sentiment": "neutral",
            "PublishDate": 1740476625000,
            "Source": "corporate_action"
        },
        {
            "Title": "GM Breweries Reports Q3 Revenue of 6.4 Billion Rupees",
            "Summary": "GM Breweries has announced its third-quarter revenue for the current fiscal year. The company reported revenue of 6.4 billion rupees, compared to 6.2 billion rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1736233189000,
            "Source": "earnings"
        },
        {
            "Title": "GM Breweries Reports Improved Q3 EBITDA and Margin",
            "Summary": "GM Breweries has announced its Q3 financial results, showing an improvement in both EBITDA and EBITDA margin compared to the same period last year. The company's EBITDA increased from 254 million rupees to 299 million rupees year-over-year. Additionally, the EBITDA margin rose from 4.11% to 4.65% during the same period.",
            "Sentiment": "positive",
            "PublishDate": 1736233140000,
            "Source": "earnings"
        },
        {
            "Title": "GM Breweries Reports Q3 Net Profit of 220 Million Rupees",
            "Summary": "GM Breweries has announced its financial results for the third quarter. The company reported a net profit of 220 million rupees, compared to 226 million rupees in the same quarter of the previous year, indicating a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1736233013000,
            "Source": "earnings"
        },
        {
            "Title": "GM Breweries Reports Q2 Financial Results",
            "Summary": "<p>GM Breweries has released its <span class='neutral'>Q2 financial results</span>. The company's <span class='neutral'>EBITDA</span> (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is <span class='negative'>275 million rupees</span>, down from 297 million rupees in the same quarter last year. The <span class='neutral'>EBITDA margin</span> has also <span class='negative'>decreased</span> from <b>5.00%</b> to <b>4.62%</b> year-over-year.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728542645000,
            "Source": "result"
        },
        {
            "Title": "GM Breweries Reports Q2 Revenue of 5.96 Billion Rupees",
            "Summary": "<p>GM Breweries has announced its <span class='neutral'>second quarter revenue</span> for the current fiscal year. The company reported revenue of <b>5.96 billion rupees</b>, showing a <span class='positive'>slight increase</span> from <b>5.94 billion rupees</b> in the same quarter of the previous year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728542578000,
            "Source": "result"
        },
        {
            "Title": "GM Breweries Reports Slight Decline in Q2 Net Profit",
            "Summary": "<p>GM Breweries has reported a <span class='neutral'>net profit</span> of <span class='neutral'>217 million rupees</span> for the second quarter, compared to <span class='neutral'>224 million rupees</span> in the same period last year, indicating a <span class='negative'>slight year-over-year decrease</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728542558000,
            "Source": "result"
        }
    ]
}