{
    "Symbol": "GMDCLTD",
    "ISIN": "INE131A01031",
    "News": [
        {
            "Title": "GMDC Appoints Sandeep Kumar as Non-Executive Director",
            "Summary": "Gujarat Mineral Development Corporation Limited announces the appointment of Shri Sandeep Kumar, IAS as Non-Executive Director effective January 22, 2026, replacing Ms. Arti Kanwar, IAS.",
            "Sentiment": "neutral",
            "PublishDate": 1769520555758,
            "Source": "stocks"
        },
        {
            "Title": "GMDC Gets BARC Tech for Rare Earth Processing",
            "Summary": "Gujarat Mineral Development Corporation receives indigenous rare earth processing technology from BARC for its Ambadungar project, marking a strategic milestone in India's critical mineral development.",
            "Sentiment": "positive",
            "PublishDate": 1768827898371,
            "Source": "stocks"
        },
        {
            "Title": "GMDC Gets ESG Rating of 77.7 from CareEdge",
            "Summary": "Gujarat Mineral Development Corporation receives provisional ESG rating of 77.7 (CareEdge-ESG 1) from CareEdge ESG Ratings Ltd., placing it in Leadership category for ESG risk management following comprehensive assessment.",
            "Sentiment": "positive",
            "PublishDate": 1767889789320,
            "Source": "stocks"
        },
        {
            "Title": "GMDC Gets ESG Rating of 77.7 from CareEdge",
            "Summary": "Gujarat Mineral Development Corporation Limited receives provisional ESG rating of 77.7 from CareEdge ESG Ratings Ltd, placing it in Leadership category for ESG risk management following comprehensive assessment.",
            "Sentiment": "positive",
            "PublishDate": 1767882302168,
            "Source": "stocks"
        },
        {
            "Title": "GMDC Independent Director Prof. Shailesh Gandhi Completes Tenure",
            "Summary": "Gujarat Mineral Development Corporation announces completion of Prof. Shailesh Gandhi's two consecutive terms as Independent Director on December 31, 2025, ceasing his board membership.",
            "Sentiment": "neutral",
            "PublishDate": 1767360510194,
            "Source": "stocks"
        },
        {
            "Title": "GMDC Non-Executive Director Resigns Due to Transfer",
            "Summary": "Gujarat Mineral Development Corporation announced resignation of Non-Executive Director Ms. Arti Kanwar effective December 29, 2025, following her administrative transfer by Gujarat Government.",
            "Sentiment": "neutral",
            "PublishDate": 1767092797317,
            "Source": "stocks"
        },
        {
            "Title": "GMDC Advances Baitarni-West Coal Mine Operations",
            "Summary": "Gujarat Mineral Development Corporation secures mining partner and key regulatory clearances for its 15 MTPA Baitarni-West coal mine in Odisha, marking significant progress in operational development.",
            "Sentiment": "positive",
            "PublishDate": 1765456886888,
            "Source": "stocks"
        },
        {
            "Title": "Government's Rare Earths Scheme Awaits Approval",
            "Summary": "The government's rare earths scheme is expected to receive approval. The development relates to GMDC and could impact the rare earths sector.",
            "Sentiment": "neutral",
            "PublishDate": 1764127078247,
            "Source": "stock"
        },
        {
            "Title": "GMDC Reports Strong Q2 FY26 Profit Growth Despite Lower Lignite Volumes",
            "Summary": "Gujarat Mineral Development Corporation delivered healthy margins and significantly higher Profit Before Tax of ₹634 crore in Q2 FY26 versus ₹183 crore in Q2 FY25, supported by disciplined cost management and a one-time exceptional gain of ₹474 crore from GST Input Tax Credit write-back. Despite softer lignite demand environment with revenue declining to ₹528 crore from ₹593 crore, the mining PSU maintained operational efficiency with EBITDA margin of 29% and showed growth in key projects like Bhavnagar and Umarsar.",
            "Sentiment": "neutral",
            "PublishDate": 1763174704153,
            "Source": "earnings"
        },
        {
            "Title": "Government Plans ₹7,350 Crore Program to Boost Domestic Rare Earth Magnet Production",
            "Summary": "The government is preparing to launch a ₹7,350 crore program aimed at enhancing local production of rare earth magnets. This initiative is expected to strengthen domestic manufacturing capabilities in the rare earth sector.",
            "Sentiment": "positive",
            "PublishDate": 1759980406168,
            "Source": "stock"
        },
        {
            "Title": "GMDC Shares Surge 13% to Record High, Poised for Best Month Since 2009",
            "Summary": "Gujarat Mineral Development Corporation (GMDC) shares gained 13% on Tuesday, September 23, reaching a record high. This marks the third time in 13 trading sessions that the lignite miner's stock has risen over 10% in a single day, following 11% gains on September 12 and 12% on September 5. Trading volumes were exceptionally strong with 3.7 crore shares changing hands, significantly above the 20-day average of 88 lakh shares. The stock has gained 58% month-to-date in September, potentially marking its best month since May 2009 when it gained 70%. DIPAM Secretary Arunish Chawla indicated the government could launch IPOs of state-run natural resource companies by the end of the financial year. The stock's RSI stands at 77, indicating overbought conditions. GMDC shares are trading at ₹632.5, up 96% year-to-date, after declining 21% in 2024 following a 178% gain in 2023.",
            "Sentiment": "positive",
            "PublishDate": 1758617150772,
            "Source": "stock"
        },
        {
            "Title": "GMDC Shares Drop 14% From Intraday High Despite Recent Rally on Rare Earth Developments",
            "Summary": "Gujarat Mineral Development Corporation Ltd. (GMDC) shares declined for the third consecutive trading session, falling over 14% from Thursday's intraday high. The stock had previously rallied more than 18% over two days following China's removal of restrictions on rare earth magnet exports to India. The government's renewed focus on rare earth minerals and India's Free Trade Agreement talks with Peru, which includes a dedicated chapter on rare earths for securing critical mineral supplies, had initially boosted GMDC shares.",
            "Sentiment": "negative",
            "PublishDate": 1757577576003,
            "Source": "stock"
        },
        {
            "Title": "India Partners With Myanmar for Rare-Earth Mineral Exploration",
            "Summary": "The Indian government has directed public sector undertakings (PSUs) and private companies to explore sample collection opportunities from rare-earth mineral mines in northeastern Myanmar. This collaboration aims to support India's acquisition of rare-earth minerals through partnerships with Myanmar's mining operations.",
            "Sentiment": "positive",
            "PublishDate": 1757493395088,
            "Source": "stock"
        },
        {
            "Title": "GMDC Shares Surge 35% in September, Hit 52-Week High on Rare Earth Mining Optimism",
            "Summary": "Gujarat Mineral Development Corporation (GMDC) shares surged 35.5% in September, reaching a fresh 52-week high of Rs 547. The rally is driven by investor interest in the company's rare earth mining initiatives and sectoral tailwinds. GMDC has delivered 107% returns over six months and 46.5% over one year, with five-year gains exceeding 1,100%. The company is developing rare earth deposits in Gujarat's Chhota Udaipur district, positioning itself strategically as these minerals are essential for electric vehicles and renewable energy equipment. Despite quarterly results showing consolidated net profit of Rs 164 crore (down 11% year-on-year) and revenue of Rs 810 crore (down 8% year-on-year), the stock continues attracting buyers due to growth prospects and strong balance sheet. India's second-largest lignite producer operates as a zero-debt company with diversification into thermal, wind, and solar energy. Nuvama maintained a 'Reduce' rating with a target price of Rs 231, citing expensive valuations and slower lignite mine ramp-up.",
            "Sentiment": "positive",
            "PublishDate": 1757317782714,
            "Source": "stock"
        },
        {
            "Title": "GMDC Shares Surge 13% to Hit Fresh 52-Week High of Rs 512",
            "Summary": "Gujarat Mineral Development Corporation (GMDC) shares jumped 13% to reach a fresh 52-week high of Rs 512, with high trading volumes of nearly 2.6 crore shares on NSE. The stock has delivered 126% returns over the past 6 months since its 52-week low of Rs 226 in March, driven by government push for rare earth mining. The company reported consolidated net profit of Rs 164 crore in the June quarter, down 11% from Rs 184 crore in the same period last year, while revenue dropped 8% to Rs 810 crore from Rs 878 crore. GMDC operates as India's second-largest lignite-producing company with zero debt and 5-year returns of 900%. Brokerage Nuvama maintains a 'Reduce' rating with target price of Rs 231, citing expensive valuation and noting they haven't heard anything about rare earth mining from the company. The stock trades above its 50-day and 200-day moving averages but shows overbought conditions with high volatility.",
            "Sentiment": "positive",
            "PublishDate": 1757065704084,
            "Source": "stock"
        },
        {
            "Title": "Modi States India Will Be Essential in Global Semiconductor Market",
            "Summary": "Prime Minister Modi stated that India will play an essential role in the global semiconductor market. The statement was made in connection with GMDC.",
            "Sentiment": "positive",
            "PublishDate": 1756791975984,
            "Source": "sectoral"
        },
        {
            "Title": "China Lifts Trade Restrictions on Fertilizers, Rare Earths, and Tunnel Boring Machines for India",
            "Summary": "China has removed restrictions on the export of fertilizers, rare earths, and tunnel boring machines to India. The development appears to be related to GMDC, though the specific connection is not detailed in the provided information.",
            "Sentiment": "positive",
            "PublishDate": 1755577608264,
            "Source": "stock"
        },
        {
            "Title": "Government Increases GMDC Rare Earth Investment Plan to ₹5000 Crore",
            "Summary": "The government has increased its rare earth investment plan for GMDC to ₹5000 crore, up from the previous allocation of ₹1350 crore. This represents a substantial increase in funding for rare earth development activities.",
            "Sentiment": "positive",
            "PublishDate": 1754279015313,
            "Source": "stock"
        },
        {
            "Title": "GMDC Reports Decline in Q1 Financial Performance with Lower Revenue and Profit",
            "Summary": "GMDC reported consolidated net profit of 1.6 billion rupees in Q1, down from 1.84 billion rupees in the same period last year. Revenue decreased to 7.3 billion rupees from 8.18 billion rupees year-over-year. EBITDA fell to 1.7 billion rupees compared to 2.11 billion rupees in the previous year, while EBITDA margin contracted to 22.99% from 25.85% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1753446325456,
            "Source": "earnings"
        },
        {
            "Title": "GMDC to Announce Q1 Results on July 25; Shares Surge 19.68% in Five Trading Sessions",
            "Summary": "Gujarat Mineral Development Corporation (GMDC), India's largest lignite-producing company, will announce its first quarter financial results on July 25. The state-owned mining company serves industries including textiles, ceramics, bricks, chemicals and captive power. In the previous quarter, GMDC reported a 20.8% increase in consolidated net profit to Rs 226.22 crore, with total income growing 10% to Rs 904.33 crore. The company's shares have performed strongly, gaining 19.68% in the past five trading sessions and 40.55% year-to-date. The stock reached a 52-week high of Rs 472.4 on July 23 and was trading at Rs 455.10 at the time of reporting. The trading window for designated persons remains closed until 48 hours after the results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1753345402842,
            "Source": "earnings"
        },
        {
            "Title": "GMDC Surges 21% in Five Sessions on Rare Earth Magnet Production Scheme Reports",
            "Summary": "Gujarat Mineral Development Corp. shares rose 20.98% over five trading sessions, becoming the top performer in the BSE PSU Index during this period. The stock reached a 52-week high of Rs 468 before closing at Rs 457.8, up 5% for the day. Year-to-date, GMDC shares have gained 43.54%, ranking as the third-best performer in the index. The surge follows media reports of the Union government proposing a Rs 1,345-crore scheme to boost domestic rare earth magnet production after China restricted exports. GMDC is developing a rare-earth deposit at Ambadungar, Gujarat, and plans to establish a complete rare earth elements value chain. The company is positioned to benefit from India's move away from Chinese imports of these materials, which are essential for electric vehicles, wind turbines, and electronics.",
            "Sentiment": "positive",
            "PublishDate": 1753187060433,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Mineral Development Corporation: Shares Surge 14% on Rare Earth Magnet Crisis Meeting",
            "Summary": "GMDC shares hit a 52-week high, rising over 14% due to news of a potential PMO meeting to discuss the rare earth magnet crisis. The stock saw high trading volumes with over 3 crore shares traded on NSE. The surge comes amid concerns over China's dominance in rare earth processing and new export restrictions affecting the EV industry.",
            "Sentiment": "positive",
            "PublishDate": 1752832202000,
            "Source": "normal_news"
        },
        {
            "Title": "PMO to Hold Meeting on Rare Earth Magnet Issue",
            "Summary": "The Prime Minister's Office (PMO) is expected to conduct an important meeting regarding the rare earth magnet issue. The news specifically mentions GMDC (Gujarat Mineral Development Corporation) in connection with this meeting. No further details about the timing, participants, or specific agenda of the meeting were provided in the brief news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1752818704000,
            "Source": "default"
        },
        {
            "Title": "Gujarat Mineral Development Corporation: Rare Earth Mining Stock Surges 18% Amid Supply Concerns",
            "Summary": "GMDC shares have rallied nearly 18% in the past eight trading sessions, with a 2.5% increase today. The stock has gained 40% in the past month, outperforming major indices. GMDC's Q4 consolidated net profit grew 9.2% YoY to Rs 226 crore, with revenue up 10% to Rs 904 crore.",
            "Sentiment": "positive",
            "PublishDate": 1749633271000,
            "Source": "normal_news"
        },
        {
            "Title": "Government Explores Rare-Earth Magnet Manufacturing by PSUs",
            "Summary": "The government is investigating the potential for Public Sector Undertakings (PSUs) to manufacture rare-earth magnets. GMDC, likely referring to Gujarat Mineral Development Corporation, is mentioned in connection with this initiative.",
            "Sentiment": "neutral",
            "PublishDate": 1749625241000,
            "Source": "default"
        },
        {
            "Title": "Indian Government Finalizing Incentive Program for Critical Minerals Recycling",
            "Summary": "The Indian government is in the final stages of developing an incentive program aimed at promoting the recycling of critical minerals. This information comes from official documents, suggesting a formal policy announcement may be imminent.",
            "Sentiment": "positive",
            "PublishDate": 1749191128000,
            "Source": "default"
        },
        {
            "Title": "GMDC Provides Guidance on Lignite Production and Financial Outlook",
            "Summary": "GMDC has provided guidance on its future operations and financial expectations. The company projects lignite production from Gujarat-based sources to reach 15 million tons in a decade. GMDC anticipates revenue and sales growth in the current year, with groundbreaking expected. The company does not plan to take on debt in the current or next financial year, but may do so towards the end of the next financial year.",
            "Sentiment": "positive",
            "PublishDate": 1748230557000,
            "Source": "default"
        },
        {
            "Title": "GMDC Reports Q4 Financial Results and Declares Dividend",
            "Summary": "Gujarat Mineral Development Corporation (GMDC) has announced its Q4 financial results. The company's EBITDA increased to 1.94 billion rupees from 1.89 billion rupees year-over-year, while the EBITDA margin slightly decreased to 24.62% from 25.13%. Revenue rose to 7.9 billion rupees from 7.5 billion rupees, and consolidated net profit jumped to 2.9 billion rupees from 1.9 billion rupees. Additionally, GMDC declared a dividend of 10.1 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747297695000,
            "Source": "result"
        },
        {
            "Title": "GMDC Signs Long-term Limestone Supply Agreement with City Gold Pipes",
            "Summary": "Gujarat Mineral Development Corporation (GMDC) has entered into a long-term supply agreement with City Gold Pipes Pvt. Ltd. for limestone from GMDC's Lakhpat Punrajpur mine in Kutch. This agreement signifies a strategic partnership between the two companies and potentially indicates a stable supply chain for limestone in the region.",
            "Sentiment": "positive",
            "PublishDate": 1746576752000,
            "Source": "default"
        },
        {
            "Title": "GMDC Signs Long-Term Limestone Supply Agreement with City Gold Pipes",
            "Summary": "Gujarat Mineral Development Corporation (GMDC) has entered into a long-term supply agreement with City Gold Pipes Pvt. Ltd. for limestone from the Lakhpat Punrajpur mine in Kutch. This partnership aims to ensure a steady supply of limestone for City Gold Pipes' operations.",
            "Sentiment": "positive",
            "PublishDate": 1746535265000,
            "Source": "default"
        },
        {
            "Title": "GMDC Reports Increased Q3 Profit and Revenue",
            "Summary": "Gujarat Mineral Development Corporation (GMDC) has announced its financial results for the third quarter. The company's consolidated net profit rose to 1.5 billion rupees, up from 1.17 billion rupees in the same period last year. Revenue also increased to 6.5 billion rupees from 5.6 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738312131000,
            "Source": "earnings"
        },
        {
            "Title": "GMDC Reports Significant Q2 EBITDA Growth",
            "Summary": "Gujarat Mineral Development Corporation (GMDC) has reported a substantial increase in its Q2 EBITDA, rising to 1.4 billion rupees from 529 million rupees year-over-year. The company's EBITDA margin also improved significantly, reaching 23.90% compared to 13.83% in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1729599806000,
            "Source": "result"
        },
        {
            "Title": "GMDC Reports Strong Q2 Financial Results",
            "Summary": "Gujarat Mineral Development Corporation (GMDC) has announced its Q2 financial results. The company's consolidated net profit increased to 1.3 billion rupees, up from 746 million rupees year-over-year. Revenue also saw significant growth, reaching 5.9 billion rupees compared to 3.8 billion rupees in the same quarter last year. Sequentially, net profit decreased from 1.84 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729599716000,
            "Source": "result"
        },
        {
            "Title": "GMDC Board Meeting Scheduled for Q2 Results",
            "Summary": "<p><span class='neutral'>Gujarat Mineral Development Corporation</span> (<span class='neutral'>GMDC</span>) has announced a <b>board meeting</b> to be held on <span class='neutral'>October 19</span> to <b>consider and approve</b> the company's <span class='neutral'>second quarter financial results</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728650258000,
            "Source": "result"
        }
    ]
}