{
    "Symbol": "GMMPFAUDLR",
    "ISIN": "INE541A01023",
    "News": [
        {
            "Title": "GMM Pfaudler Q3 FY26: Revenue ₹883 Cr, Order Intake Up 20%",
            "Summary": "GMM Pfaudler reports Q3 FY26 revenue of ₹883 crores with EBITDA of ₹105 crores. Order intake surged 20% YoY to ₹961 crores, while backlog reached ₹2,205 crores, up 27% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1770376135692,
            "Source": "co_actions_results"
        },
        {
            "Title": "GMM Pfaudler Signs ₹54.5 Cr Hyderabad Property Deal",
            "Summary": "GMM Pfaudler has entered into an agreement to sell its Hyderabad property for ₹54.5 crores, marking a significant asset divestment for the capital goods company.",
            "Sentiment": "neutral",
            "PublishDate": 1765891589737,
            "Source": "stocks"
        },
        {
            "Title": "GMM Pfaudler Sells Hyderabad Property for ₹54.5 Cr",
            "Summary": "GMM Pfaudler executed agreement to sell its Hyderabad facility for ₹54.5 crores to Topsun Power Private Limited. The facility generated ₹52 crores revenue in FY25, representing 5.6% of standalone revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1765883862758,
            "Source": "co_actions_results"
        },
        {
            "Title": "GMM Pfaudler's INR 300 Crore Bank Facilities Ratings Reaffirmed by ICRA",
            "Summary": "ICRA Limited has reaffirmed the credit ratings for GMM Pfaudler Limited's bank facilities totaling INR 300 crores, maintaining [ICRA]AA (Stable) and [ICRA]A1+ ratings. The rating reaffirmation indicates continued assessment of the company's creditworthiness and financial stability for its banking arrangements.",
            "Sentiment": "positive",
            "PublishDate": 1765277329345,
            "Source": "corporate_action"
        },
        {
            "Title": "GMM Pfaudler Reports Strong Q2 Performance with 14% Revenue Growth and Strategic Acquisitions",
            "Summary": "GMM Pfaudler achieved revenue of INR 902 crores in Q2, up 14% quarter-on-quarter and 12% year-on-year, with EBITDA rising 27% year-on-year to INR 122 crores at 13.5% margin. The company completed SEMCO acquisition for USD 18.5 million and secured strong order intake of INR 878 crores, building order backlog to INR 2,146 crores across diversified business lines including glass-lined, non-glass-lined, and heavy engineering segments.",
            "Sentiment": "positive",
            "PublishDate": 1763054665781,
            "Source": "earnings"
        },
        {
            "Title": "HDFC Mutual Fund Increases Stake in GMM Pfaudler to 9.55%",
            "Summary": "HDFC Mutual Fund has increased its shareholding in GMM Pfaudler Limited by 2.03% through open market purchases. The fund's aggregate holding rose from 7.52% as of September 26, 2024 to 9.55% as of November 7, 2025. The acquisition involved 9,13,165 shares, bringing total holdings to 42,92,197 shares. GMM Pfaudler's paid-up equity share capital comprises 4,49,57,224 equity shares of Rs. 2 each, totaling Rs. 8,99,14,448. The disclosure was made under SEBI regulations for substantial acquisition of shares.",
            "Sentiment": "neutral",
            "PublishDate": 1762857760512,
            "Source": "stock"
        },
        {
            "Title": "GMM Pfaudler Targets 15-20% Growth in Order Backlog for Next Fiscal Year",
            "Summary": "GMM Pfaudler announced plans to increase its order backlog by 15-20% in the next fiscal year compared to the previous year. This target was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1762487299119,
            "Source": "stock"
        },
        {
            "Title": "GMM Pfaudler Focuses on Global Capacity Scaling and Operational Integration",
            "Summary": "GMM Pfaudler is focusing on scaling its global glass-lined and critical process equipment capacity while integrating operations between the U.S. and China. The company aims to expand its aftermarket revenue share and improve margins through localization and supply-chain optimization. The strategy is supported by automation initiatives, cost discipline measures, and growing demand from the chemical, pharmaceutical, and green-tech sectors.",
            "Sentiment": "positive",
            "PublishDate": 1762438392563,
            "Source": "stock"
        },
        {
            "Title": "GMM Pfaudler Reports Strong Q2 Performance with 30.6% Revenue Growth and Declares Interim Dividend",
            "Summary": "GMM Pfaudler Limited reported consolidated revenue from operations of ₹902.34 crores for the quarter ended September 30, 2025, representing a 12% increase from ₹794.55 crores in the previous quarter and 30.6% growth compared to ₹805.42 crores in the same quarter last year. The company's consolidated profit for the quarter stood at ₹38.80 crores versus ₹15.24 crores in the corresponding period last year. For the half-year period, consolidated revenue reached ₹1,696.89 crores compared to ₹1,590.62 crores in the previous year. The Board approved an interim dividend of ₹1 per share for financial year 2025-26, with November 17, 2025 as the record date and payment by December 4, 2025. The company completed two acquisitions during the period: SEMCO Tecnologia em Processos Ltda in Brazil for approximately ₹62 crores and a 51% stake in GMM Inox sp.z.o.o for approximately ₹25.30 crores. Overseas operations contributed ₹645.16 crores to quarterly revenue while India operations generated ₹257.18 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762426479027,
            "Source": "corporate_action"
        },
        {
            "Title": "GMM Pfaudler Reports Strong Q2 Performance with Revenue Growth and Declares Interim Dividend",
            "Summary": "GMM Pfaudler delivered robust quarterly results with revenue of 8.05 billion rupees compared to the previous year's corresponding period. The company's EBITDA increased to 1.22 billion rupees from 935 million rupees year-over-year, while EBITDA margin improved to 13.47% from 11.61%. Net profit also showed growth compared to 172.6 million rupees in the same quarter last year. The company has recommended an interim dividend of 1 rupee per share.",
            "Sentiment": "positive",
            "PublishDate": 1762426100071,
            "Source": "earnings"
        },
        {
            "Title": "GMM Pfaudler Forms Strategic Partnership with Global Chemical Firm",
            "Summary": "GMM Pfaudler Limited has entered into a partnership with a global chemical company to expand its product offerings. The collaboration focuses on innovation and sustainability in chemical processing solutions.",
            "Sentiment": "positive",
            "PublishDate": 1758698753357,
            "Source": "order&deals"
        },
        {
            "Title": "GMM Pfaudler Reports 14% EBITDA Growth in Q1 FY26 with Strong Order Intake of ₹1,004 Crores",
            "Summary": "GMM Pfaudler delivered stable revenue with consolidated EBITDA up 14% year-on-year and India EBITDA growing 45% year-on-year in Q1 FY26. EBITDA margins improved to 12.7% at consolidated level and 15.7% on standalone basis. The company secured strong order intake of ₹1,004 crores, 14% higher year-on-year and 52% higher quarter-on-quarter, driven by systems and services business. Current backlog stands at ₹1,906 crores, up 7% year-on-year and 17% quarter-on-quarter. The company is completing SEMCO acquisition to enter South American markets, expanding its global mixing platform to $65 million. India business shows recovery with investments returning in pharma and chemicals, while international business remains cautious due to global uncertainties. The company faced ₹20 crores foreign exchange loss due to Euro appreciation and reported 68% tax rate due to international group structure.",
            "Sentiment": "positive",
            "PublishDate": 1755175013298,
            "Source": "earnings"
        },
        {
            "Title": "GMM Pfaudler's Brazilian Subsidiary Completes 100% Acquisition of SEMCO Tecnologia",
            "Summary": "GMM Pfaudler Ltd announced that its wholly owned subsidiary, Pfaudler Ltda., Brazil, has completed the acquisition of 100% share capital of SEMCO Tecnologia em Processos Ltda., Brazil on August 11, 2025. The acquisition was completed in Brasilia Standard Time and represents a full takeover of the Brazilian technology company by GMM Pfaudler's Brazilian operations.",
            "Sentiment": "positive",
            "PublishDate": 1755004586474,
            "Source": "order&deals"
        },
        {
            "Title": "Deutsche Bank Discloses Encumbrance Over 9.17% Stake in GMM Pfaudler for Term Loan Facilities",
            "Summary": "Deutsche Bank Group disclosed the creation of encumbrance over 4,121,960 equity shares of GMM Pfaudler Limited, representing 9.17% of the company's total share capital. The shares are held by Petunia Investments Limited (3,709,766 shares, 8.25%) and Carillon Investments B.V. (412,194 shares, 0.92%). Both shareholders obtained term loan facilities from Barclays Bank PLC through facility agreements dated August 7, 2025. The loans are secured by charges on their GMM Pfaudler shares, with composite share charge and pledge agreements executed on August 7, 2025. GMM Pfaudler's equity share capital stands at INR 89,914,448 comprising 44,957,224 equity shares of INR 2 each. The shareholders have agreed to certain covenants regarding encumbrance on their shares in GMM Pfaudler.",
            "Sentiment": "neutral",
            "PublishDate": 1754908917319,
            "Source": "corporate_action"
        },
        {
            "Title": "GMM Pfaudler Reports Stable Revenue, Strong India Performance in Q1 Results",
            "Summary": "GMM Pfaudler Limited shares traded at ₹1,285.80, down 0.37% on NSE. The corrosion-resistant technology company reported stable revenue of ₹795 crores for the first quarter, with consolidated EBITDA growing 14% year-on-year driven by strong India performance. Consolidated EBITDA margin improved to 12.7%, while standalone EBITDA margin reached 15.7%. India operations showed particularly strong performance with 45% EBITDA growth compared to the same quarter last year. Net profit after tax stood at ₹10 crores, including a non-cash foreign exchange loss of ₹19.8 crores from currency borrowing restatements. Order intake surged 14% year-on-year and 52% quarter-on-quarter to ₹1,004 crores, primarily driven by Systems and Services segments. Order backlog increased to ₹1,906 crores, up 7% from the previous year. Managing Director Tarak Patel noted that while the opportunity pipeline continues growing, global trade uncertainties and geopolitical instability may impact future investment decisions. The company entered an agreement to acquire 100% of Brazil's SEMCO Tecnologia em Processos Ltda through its Brazilian subsidiary to strengthen mixing technologies platform and access South American markets.",
            "Sentiment": "positive",
            "PublishDate": 1754638144123,
            "Source": "earnings"
        },
        {
            "Title": "GMM Pfaudler Plans Brazil Entry Through Semco Acquisition Amid Profit Challenges",
            "Summary": "GMM Pfaudler announced plans to expand its global mixing platform and enter the Brazilian market by acquiring Semco. The company is banking on a strong order book to drive long-term growth despite facing short-term profit challenges.",
            "Sentiment": "neutral",
            "PublishDate": 1754571441123,
            "Source": "order&deals"
        },
        {
            "Title": "GMM Pfaudler CEO Aseem Joshi Resigns to Pursue New Opportunities",
            "Summary": "GMM Pfaudler announced that CEO Aseem Joshi has resigned to pursue new opportunities, with his departure effective September 26, 2025. Managing Director Tarak Patel will assume Joshi's responsibilities following his exit. Joshi served as CEO for nearly four years and cited alignment with professional goals and personal aspirations as reasons for his decision. The company has launched a Global Transformation Program aimed at unifying operations, accelerating decision-making, driving growth, and enhancing profitability. As part of this program, GMM Pfaudler will evaluate the future requirement and scope for an India CEO role.",
            "Sentiment": "neutral",
            "PublishDate": 1754569344024,
            "Source": "corporate_governance"
        },
        {
            "Title": "GMM Pfaudler Reports Strong Q1 FY26 Results with Standalone Profit Rising 121% YoY",
            "Summary": "GMM Pfaudler Limited reported its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company achieved revenue from operations of ₹231.19 crores compared to ₹223.09 crores in the same quarter last year. Standalone profit surged to ₹16.70 crores from ₹7.54 crores in the previous year quarter, representing a 121% year-on-year growth. Earnings per share increased to ₹3.71 from ₹1.68 in the corresponding quarter. On a consolidated basis, revenue from operations reached ₹794.55 crores versus ₹785.20 crores in the prior year quarter. However, consolidated profit declined to ₹10.15 crores from ₹21.84 crores in the same quarter last year. The company operates through two segments - India (₹213.40 crores revenue) and Overseas (₹581.15 crores revenue). The Board meeting was held on August 7, 2025, where these results were approved.",
            "Sentiment": "positive",
            "PublishDate": 1754564764207,
            "Source": "earnings"
        },
        {
            "Title": "GMM Pfaudler Limited Shareholders Approve All 8 Resolutions at Annual General Meeting",
            "Summary": "GMM Pfaudler Limited held its 62nd Annual General Meeting on August 1, 2025, via video conferencing, where shareholders approved all eight proposed resolutions. The approved resolutions included adoption of financial statements for the year ended March 31, 2025, confirmation of interim dividend and declaration of final dividend, re-appointment of Mr. Ashok Patel as director (98.50% approval), appointment of S R B C & CO. LLP as statutory auditors (99.99% approval), ratification of cost auditors' remuneration (100% approval), appointment of Rathi & Associates as secretarial auditors (100% approval), approval of related party transactions with wholly owned subsidiaries (79.21% approval), and re-appointment of Mr. Tarak Patel as Managing Director for five years until May 31, 2030 (97.45% approval). The meeting had 55 shareholders attending through video conferencing, with 13 from promoter group and 42 from public category.",
            "Sentiment": "positive",
            "PublishDate": 1754145095499,
            "Source": "corporate_action"
        },
        {
            "Title": "GMM Pfaudler Schedules Q1-FY26 Earnings Call for August 7, 2025",
            "Summary": "GMM Pfaudler Limited will announce its first quarter results for the period ended June 30, 2025, on August 7, 2025. The company will host an earnings call on the same day at 18:00 hrs IST to discuss the financial results. GMM Pfaudler is a global leader in corrosion-resistant technologies, systems, and services for the chemical, pharmaceutical, and other process industries. The company operates 18 manufacturing locations across 4 continents and employs more than 2,000 people.",
            "Sentiment": "neutral",
            "PublishDate": 1753787417337,
            "Source": "earnings"
        },
        {
            "Title": "GMM Pfaudler Schedules Board Meeting on August 7, 2025 to Approve Quarterly Financial Results",
            "Summary": "GMM Pfaudler Limited has scheduled a Board of Directors meeting on August 7, 2025 to consider and approve the Unaudited Standalone and Consolidated Financial Results for the quarter ended June 30, 2025. The company's trading window for shares has been closed since June 30, 2025 and will remain closed until August 9, 2025. The announcement was made in compliance with insider trading regulations and the company's code of conduct.",
            "Sentiment": "neutral",
            "PublishDate": 1753447918126,
            "Source": "corporate_action"
        },
        {
            "Title": "GMM Pfaudler Acquires Brazil's Semco for $18.5 Million",
            "Summary": "GMM Pfaudler has purchased Semco, a Brazilian company, for $18.5 million (equivalent to 158 crore rupees). This acquisition is aimed at enhancing GMM Pfaudler's mixing technologies capabilities in the South American market. The move is expected to strengthen the company's presence and technological offerings in the region.",
            "Sentiment": "positive",
            "PublishDate": 1751603884000,
            "Source": "default"
        },
        {
            "Title": "GMM Pfaudler: German Subsidiary Secures €33.2 Million Defense Contract",
            "Summary": "GMM Pfaudler's German subsidiary, Pfaudler Normag Systems GmbH, has won a €33.2 million (₹330 crore) contract from a European defense manufacturer for acid recovery systems. The four-year contract involves designing, engineering, and supplying complete end-to-end acid recovery equipment. The company will receive a 30% upfront payment.",
            "Sentiment": "positive",
            "PublishDate": 1750354097000,
            "Source": "order&deals"
        },
        {
            "Title": "GMM Pfaudler Subsidiary Wins €33.2 Million Order in Europe",
            "Summary": "GMM Pfaudler's subsidiary, Pfaudler Normag Systems GmbH, located in Germany, has secured a significant international order valued at €33.2 million (approximately ₹330 crores) from a European-based customer.",
            "Sentiment": "positive",
            "PublishDate": 1750351824000,
            "Source": "default"
        },
        {
            "Title": "GMM Pfaudler: Q4 Revenue Up, Annual Figures Down Amid Restructuring",
            "Summary": "GMM Pfaudler reported Q4FY25 revenue of ₹807 crore, up 9% YoY, but full-year revenue declined 7%. Q4 EBITDA margin at 11.5%. Company executing global restructuring, closing UK and India sites, opening new facility in Poland. India business improved in H2, with Q4 revenue of ₹252 crore. Challenges from chemical and pharma sector slowdown noted. Final dividend of ₹1 per share declared.",
            "Sentiment": "neutral",
            "PublishDate": 1747895385000,
            "Source": "earnings"
        },
        {
            "Title": "Gmm Pfaudler Reports Q4 Loss, Declares Dividend",
            "Summary": "Gmm Pfaudler reported a consolidated net loss of 269.5 million rupees in Q4, compared to a profit of 276.3 million rupees in the same quarter last year. Revenue increased to 8.07 billion rupees from 7.41 billion rupees year-over-year. The company had an exceptional item of 476.6 million rupees. Loss before tax was 341.4 million rupees, compared to a profit of 310 million rupees in the previous year. The company has recommended a final dividend of 1 rupee per equity share.",
            "Sentiment": "negative",
            "PublishDate": 1747873041000,
            "Source": "default"
        },
        {
            "Title": "GMM Pfaudler: Q4 Loss and Dividend Declaration Amid Restructuring",
            "Summary": "GMM Pfaudler reported a Q4FY25 net loss of ₹27 crore, excluding one-time closure costs of ₹47.7 crore. Revenue increased 8.9% YoY to ₹806.6 crore. The company declared a final dividend of ₹1 per share, bringing the total annual dividend to ₹2 per share. GMM Pfaudler is optimizing its global manufacturing footprint and generated strong free cash flow of ₹318 crore in FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1747832933000,
            "Source": "earnings"
        },
        {
            "Title": "GMM Pfaudler Reports Q4 Results and Announces Dividend",
            "Summary": "GMM Pfaudler announced its quarterly results and a dividend declaration. The company reported Q4 revenue of 8.07 billion rupees, up from 7.41 billion year-over-year. However, it posted a consolidated net loss of 269.5 million rupees compared to a profit of 276.3 million in the same quarter last year. The EBITDA for Q4 was 832.3 million rupees, down from 897.9 million, with the EBITDA margin decreasing to 10.32% from 12.12%. The company also reported an exceptional item of 476.6 million rupees. GMM Pfaudler recommended a final dividend of 1 rupee per equity share.",
            "Sentiment": "negative",
            "PublishDate": 1747828577000,
            "Source": "result"
        },
        {
            "Title": "GMM Pfaudler to Consider Q4 Results on May 21",
            "Summary": "GMM Pfaudler has announced that it will consider its fourth quarter results on May 21. This indicates the company is preparing to release its financial performance for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1746792669000,
            "Source": "default"
        },
        {
            "Title": "GMM Pfaudler Ltd: Q3 Performance Stable Despite Share Price Dip",
            "Summary": "GMM Pfaudler reported stable Q3 FY25 results with improved EBITDA margins. Revenue was ₹801 crore, EBITDA ₹96 crore (12% margin), and net profit ₹40 crore. Order intake grew 5% QoQ to ₹798 crore. The company is diversifying into new sectors amid chemical industry weakness.",
            "Sentiment": "neutral",
            "PublishDate": 1738925226000,
            "Source": "earnings"
        },
        {
            "Title": "GMM Pfaudler Reports Decline in Q3 EBITDA and Margin",
            "Summary": "GMM Pfaudler has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter stood at 957 million rupees, down from 1.14 billion rupees in the same quarter last year. The EBITDA margin also decreased to 11.94% from 13.29% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738843743000,
            "Source": "earnings"
        },
        {
            "Title": "GMM Pfaudler Reports Q3 Financial Results",
            "Summary": "GMM Pfaudler announced its third-quarter financial results. The company's consolidated net profit increased to 415 million rupees, up from 289 million rupees in the same quarter last year. However, revenue decreased to 8.01 billion rupees from 8.56 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738843737000,
            "Source": "earnings"
        },
        {
            "Title": "GMM Pfaudler: German Subsidiary Acquires 51% Stake in Polish Company for Manufacturing Expansion",
            "Summary": "GMM Pfaudler's German subsidiary, Pfaudler GmbH, has acquired a 51% stake in a Polish company to establish a new manufacturing facility in Poland. The investment of PLN 12.2 million (₹25.3 crore) will be funded through internal accruals. This move aims to strengthen GMM Pfaudler's manufacturing capabilities in Europe and enhance its competitiveness in the global market.",
            "Sentiment": "positive",
            "PublishDate": 1734934207000,
            "Source": "corporate_action"
        },
        {
            "Title": "GMM Pfaudler's Subsidiary Acquires Stake in Polish Company",
            "Summary": "GMM Pfaudler's subsidiary, Pfaudler GmbH, has entered into an agreement to acquire a 51% stake in a limited liability company in Poland. The purpose of this acquisition is to establish an engineering and manufacturing facility in the country.",
            "Sentiment": "positive",
            "PublishDate": 1734775936000,
            "Source": "corporate_action"
        },
        {
            "Title": "GMM Pfaudler to Close Hyderabad Manufacturing Facility",
            "Summary": "GMM Pfaudler has announced the closure of its Hyderabad manufacturing facility. The company states that this decision is aimed at improving capacity utilization and reducing costs. Despite the closure, GMM Pfaudler assures that this move will not have a material impact on its overall operations.",
            "Sentiment": "neutral",
            "PublishDate": 1734101018000,
            "Source": "corporate_action"
        },
        {
            "Title": "GMM Pfaudler Declares Interim Dividend",
            "Summary": "GMM Pfaudler has announced an interim dividend of 1 rupee per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1730976223000,
            "Source": "corporate_action"
        },
        {
            "Title": "GMM Pfaudler Reports Decline in Q2 EBITDA and Margin",
            "Summary": "GMM Pfaudler's Q2 EBITDA decreased to 935 million rupees from 1.42 billion rupees year-over-year. The company's EBITDA margin also fell to 11.61% from 15.15% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730976216000,
            "Source": "result"
        },
        {
            "Title": "GMM Pfaudler Reports Q2 Revenue Decline",
            "Summary": "GMM Pfaudler, a manufacturing company, has reported its second quarter revenue for the current fiscal year. The company's revenue stood at 8.05 billion rupees, showing a decrease from 9.4 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1730976205000,
            "Source": "result"
        },
        {
            "Title": "GMM Pfaudler Reports Q2 Financial Results",
            "Summary": "GMM Pfaudler announced its Q2 consolidated net profit of 172.6 million rupees, showing a significant decrease from 683 million rupees year-over-year. However, it represents an increase from 252.6 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1730976192000,
            "Source": "result"
        }
    ]
}