{
    "Symbol": "GMRAIRPORT",
    "ISIN": "INE776C01039",
    "News": [
        {
            "Title": "GMR Airports Block Trade Worth Rs. 20.65 Crores",
            "Summary": "GMR Airports Ltd. witnessed a significant block trade on NSE worth Rs. 20.65 crores involving approximately 2,298,280 shares at Rs. 89.84 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769496511681,
            "Source": "co_actions_results"
        },
        {
            "Title": "GMR Airports Reports Mixed December Traffic Performance",
            "Summary": "GMR Airports handled 10.68 million passengers in December 2025, down 1.9% YoY, while Q3 FY26 saw record 31.89 million passengers with 2.6% growth. Delhi and Mopa airports achieved milestones.",
            "Sentiment": "neutral",
            "PublishDate": 1768561814677,
            "Source": "stocks"
        },
        {
            "Title": "GMR Airports Sees 9.67M Share Block Trade at ₹104.30",
            "Summary": "GMR Airports Limited witnessed a significant block trade involving 9.67 million shares executed at ₹104.30 per share, representing substantial institutional activity in the stock.",
            "Sentiment": "neutral",
            "PublishDate": 1767764274141,
            "Source": "co_actions_results"
        },
        {
            "Title": "GMR Bhogapuram Airport Completes Validation Flight",
            "Summary": "GMR's Bhogapuram Airport successfully conducted validation flight with Aviation Minister onboard. Project 90% complete, targeting June 2025 commercial launch with 6 million passenger capacity.",
            "Sentiment": "positive",
            "PublishDate": 1767508213398,
            "Source": "stocks"
        },
        {
            "Title": "GMR Group Qualifies for $800M Saudi Airport Project",
            "Summary": "GMR Group and Bengaluru Airport-Tamasuk consortium among five shortlisted bidders for the new Taif International Airport project in Saudi Arabia, valued at $800 million with a 30-year concession period.",
            "Sentiment": "positive",
            "PublishDate": 1766898455984,
            "Source": "co_actions_results"
        },
        {
            "Title": "GMR Airports Qualifies for $800M Saudi Airport Project",
            "Summary": "GMR Airports has qualified to compete for the new $800 million Taif Airport project in Saudi Arabia, advancing alongside four other consortia in the bidding process.",
            "Sentiment": "positive",
            "PublishDate": 1766730460782,
            "Source": "stocks"
        },
        {
            "Title": "GMR Airports Acquires 49.90% Stake in DDFS for ₹1,832 Cr",
            "Summary": "GMR Airports Limited acquired 49.90% equity stake in Delhi Duty Free Services Private Limited from subsidiary DIAL for ₹1,832.24 crores, increasing total shareholding to 66.93%.",
            "Sentiment": "positive",
            "PublishDate": 1766246803485,
            "Source": "co_actions_results"
        },
        {
            "Title": "GMR Airports Gets CARE A- Credit Rating",
            "Summary": "GMR Airports Limited receives CARE A- Stable/CARE A1 credit ratings from CARE Ratings Limited for ₹500 crores bank facilities, with existing ratings reaffirmed.",
            "Sentiment": "positive",
            "PublishDate": 1766246141935,
            "Source": "stocks"
        },
        {
            "Title": "GMR Airports Director Antoine Crombez Resigns",
            "Summary": "Antoine Roger Bernard Crombez, alternate director to Philippe Pascal at GMR Airports Limited, resigned with immediate effect on December 16, 2025, citing personal reasons and professional commitments.",
            "Sentiment": "neutral",
            "PublishDate": 1765908209101,
            "Source": "stocks"
        },
        {
            "Title": "GMR Airports Reports 7.4% Growth in November Traffic",
            "Summary": "GMR Airports recorded 11.1 million passengers in November, marking a 7.4% increase, while aircraft movements grew 7.9% to 65,922 during the same period.",
            "Sentiment": "positive",
            "PublishDate": 1765855562448,
            "Source": "stocks"
        },
        {
            "Title": "GMR Airports November 2025 Traffic Surges 7.4% YoY",
            "Summary": "GMR Airports reports strong November 2025 traffic with 11.07 million passengers across all airports, up 7.4% YoY. Delhi Airport achieves record 7.3 million passengers with 7.5% growth, while Hyderabad handles 2.7 million passengers.",
            "Sentiment": "positive",
            "PublishDate": 1765775455641,
            "Source": "co_actions_results"
        },
        {
            "Title": "TDSAT Ruling May Lead to Sharp Increase in Delhi Airport User Fees",
            "Summary": "A TDSAT ruling could result in a significant rise in user fees at Delhi Airport operated by GMR Airports due to a ₹50,000 crore shortfall. The decision affects airport users and GMR Airports' revenue recovery mechanism at one of India's busiest airports.",
            "Sentiment": "negative",
            "PublishDate": 1764559086391,
            "Source": "stock"
        },
        {
            "Title": "GMR Cargo And Logistics Secures ₹750 Crore Loan From Axis Bank For Delhi Airport Cargo City",
            "Summary": "GMR Cargo And Logistics Ltd, a unit of GMR Airports, has secured a ₹750 crore loan from Axis Bank to fund Phase 1 of the Delhi Airport Cargo City project. The financing will support the development of cargo infrastructure at Delhi Airport, enhancing GMR's logistics capabilities and expansion plans.",
            "Sentiment": "neutral",
            "PublishDate": 1764208298339,
            "Source": "stock"
        },
        {
            "Title": "GMR Airports Reports 68 Million Passengers in YTD FY26 with Mixed Growth Across Portfolio",
            "Summary": "GMR Airports served 68 million passengers across all airports in YTD FY26, with Delhi Airport handling 43.1 million passengers (down 3.5% YoY) while Hyderabad Airport achieved record performance with 18.0 million passengers (up 10.1% YoY). The company completed infrastructure upgrades including Delhi's enhanced Runway 10/28 reopening and upgraded Terminal 2 becoming operational, positioning for improved operational efficiency and traffic recovery.",
            "Sentiment": "neutral",
            "PublishDate": 1763270337494,
            "Source": "stock"
        },
        {
            "Title": "GMR Airports Declines Real Estate Capex Guidance, Sets Non-Aero Revenue Growth Target",
            "Summary": "GMR Airports management declined to provide guidance on real estate development capex and explicitly stated they don't provide guidance when pressed for FY26 numbers during a concall. The company set a target of 14-15% growth for non-aero revenue and indicated sustainable maintenance capex of INR 600-700 crore between their two major airports.",
            "Sentiment": "positive",
            "PublishDate": 1763201163246,
            "Source": "stock"
        },
        {
            "Title": "GMR Airports Reports Significant Improvement in Q2 Performance with Reduced Losses and Strong Revenue Growth",
            "Summary": "GMR Airports reported a consolidated net loss of 371 million rupees in Q2, a substantial improvement from the 2.8 billion rupees loss in the same period last year, while revenue surged 47% to 36.7 billion rupees from 24.95 billion rupees year-over-year. The company's EBITDA grew 56% to 15 billion rupees with margins expanding to 41.72% from 38.54%, indicating strong operational recovery and improved profitability metrics.",
            "Sentiment": "positive",
            "PublishDate": 1763074648193,
            "Source": "earnings"
        },
        {
            "Title": "GMR Airports Reshuffles Board with Six New Directors as Independent Director Resigns",
            "Summary": "GMR Airports Limited appointed six new directors including three independent directors (Normand Boivin, Dr. Mathilde Lemoine, Salil Anil Gupte) and three non-independent directors following the resignation of independent director Suresh Lilaram Narang due to personal reasons. The board restructuring brings aviation industry veterans and financial experts to strengthen governance, with all appointments effective November 13, 2025 for five-year terms subject to member approval.",
            "Sentiment": "neutral",
            "PublishDate": 1763057743706,
            "Source": "corporate_governance"
        },
        {
            "Title": "GMR Airports Infrastructure Sets 400 Million+ Passenger Capacity Target by 2030",
            "Summary": "GMR Airports Infrastructure announced plans to achieve 400 million+ passenger capacity by 2030 through commissioning new airports at Goa and Hyderabad expansion. The company aims to build integrated Aerocity ecosystems around Delhi and Goa while enhancing EBITDA margins through retail, cargo, and non-aeronautical revenue streams.",
            "Sentiment": "positive",
            "PublishDate": 1763056164014,
            "Source": "stock"
        },
        {
            "Title": "GMR Airports Reports 45% Revenue Growth and First Positive Profit in Three Years",
            "Summary": "GMR Airports Limited achieved total income of INR 3,754 Crores in Q2 FY26, up 45% year-on-year, with EBITDA rising 59% to a record high of INR 1,531 Crores. The company reported its first positive profit before tax in over three years, driven by strong performance at Delhi and Hyderabad airports which handled 27.8 million passengers combined.",
            "Sentiment": "positive",
            "PublishDate": 1763054723409,
            "Source": "earnings"
        },
        {
            "Title": "GMR Airports Independent Director Suresh Narang Resigns Due to Personal Reasons",
            "Summary": "Mr. Suresh Lilaramnarang (DIN: 08734030) resigned from his position as Independent Director of GMR Airports Limited effective November 13, 2025, citing personal reasons and other professional commitments. The resignation affects the company's board composition and governance structure, with Narang confirming no other reasons beyond those stated in his resignation letter.",
            "Sentiment": "neutral",
            "PublishDate": 1763051356635,
            "Source": "corporate_governance"
        },
        {
            "Title": "GMR Airports Board Meeting Scheduled to Approve Quarterly Financial Results",
            "Summary": "GMR Airports Limited has scheduled a Board of Directors meeting for November 13, 2025, to consider and approve the un-audited financial results (standalone and consolidated) for the quarter and half year ended September 30, 2025. The company has implemented a trading window closure for all designated persons from September 30, 2025, which will remain closed until 48 hours after the declaration of the financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1762815580530,
            "Source": "corporate_action"
        },
        {
            "Title": "GMR Airports' Hyderabad Subsidiary Gets Approval to Maintain Higher Tariff Rates",
            "Summary": "GMR Airports Limited announced that the Airports Economic Regulatory Authority of India (AERA) has accepted a request from its subsidiary GMR Hyderabad International Airport Limited (GHIAL) to maintain aeronautical charges at consistent rates. AERA issued an amendment on October 31, 2025, allowing GHIAL to collect landing charges, parking charges, and user development fees at the same rates applicable from April 1, 2025 to December 31, 2025, extending these rates through the final quarter of FY2025-26 (January 1, 2026 to March 31, 2026). The original tariff determination order from August 2021 had set slightly lower rates for this final quarter compared to other quarters of FY2025-26 for Rajiv Gandhi International Airport, Hyderabad.",
            "Sentiment": "positive",
            "PublishDate": 1762012678074,
            "Source": "corporate_action"
        },
        {
            "Title": "GMR Airports Reports Mixed Traffic Performance with Delhi Down 6.3% and Hyderabad Up 4.3% in September 2025",
            "Summary": "GMR Airports Limited released traffic data for September 2025, showing varied performance across its airport portfolio. Delhi Airport handled 5.84 million passengers, declining 6.3% year-over-year, while Hyderabad Airport served 2.39 million passengers, growing 4.3%. Mopa (Goa) Airport recorded strong growth of 17.3% with 392,344 passengers. International operations at Medan and Cebu showed declines of 11.4% and 2.3% respectively. For the first half of fiscal 2026, GMR airports collectively served approximately 58 million passengers. The company attributed Delhi's traffic decline to temporary disruptions from geopolitical events and runway upgrades, with the enhanced Runway 10/28 reopening on September 16, 2025. Hyderabad Airport achieved record performance with highest-ever passenger traffic and aircraft movements in H1 FY26, crossing 12.5 million domestic passengers. Delhi Airport handled record cargo volumes of 0.56 million metric tonnes in H1 FY26, up 2.8% year-over-year. The company highlighted infrastructure improvements including Delhi's upgraded Terminal 2 becoming operational from October 26, 2025, and various connectivity enhancements across airports.",
            "Sentiment": "neutral",
            "PublishDate": 1760543484229,
            "Source": "stock"
        },
        {
            "Title": "GMR Airports to Launch Delhi Airport Terminal 2 Operations on October 26",
            "Summary": "GMR Airports announced that Terminal 2 at Delhi Airport will commence operations on October 26. This represents the activation of additional terminal capacity at one of India's busiest airports.",
            "Sentiment": "positive",
            "PublishDate": 1757915717236,
            "Source": "stock"
        },
        {
            "Title": "GMR Airports Reports Mixed Traffic Performance in August 2025 with Delhi Declining 7.3% While Hyderabad Grows 4.8%",
            "Summary": "GMR Airports handled 48.7 million passengers across all airports in YTD FY2026, up 0.5% year-over-year. Delhi Airport saw passenger traffic decline 7.3% to 5.92 million in August 2025, affected by temporary flight disruptions from geopolitical events and ongoing runway upgrades. Hyderabad Airport achieved strong growth with 2.47 million passengers in August, up 4.8%, and recorded its highest-ever passenger traffic and aircraft movements in YTD FY2026. The airport also crossed the 10 million domestic passenger milestone. Mopa (Goa) Airport handled 378,818 passengers in August, up 3.5%. GMR AERO began operating Delhi Duty Free, becoming the largest duty-free operator in India and South Asia. The company received a Letter of Intent to develop Delhi Airport's Cargo City through 2036 with potential 30-year extension. Bhogapuram Airport construction is 86% complete as of August 31, 2025, with commercial operations expected by June 2026. The airport was declared a 'Major Airport' by AERA with the first control period set from April 2027 to March 2032.",
            "Sentiment": "neutral",
            "PublishDate": 1757737734579,
            "Source": "stock"
        },
        {
            "Title": "GMR Goa International Airport Wins Appeal Against AERA Tariff Order at TDSAT",
            "Summary": "GMR Goa International Airport Limited (GGIAL), a subsidiary of GMR Airports Limited, received a favorable judgment from the Telecom Disputes Settlement & Appellate Tribunal (TDSAT) in its appeal against the Airports Economic Regulatory Authority's (AERA) tariff order for Manohar International Airport, Goa. The TDSAT upheld GGIAL's contentions by quashing and setting aside various aspects of AERA's Tariff Order No. 27/2023-24 dated December 7, 2023. The tribunal directed AERA to reconsider several issues including project management consultancy expenses, determination of aeronautical and non-aeronautical revenue and taxes, tariff rate card finalization, and treatment of license fees. The original tariff order covered the determination of aeronautical charges for the first control period from April 1, 2023 to March 31, 2028.",
            "Sentiment": "positive",
            "PublishDate": 1757696287361,
            "Source": "stock"
        },
        {
            "Title": "GMR Airports Sees Rs 440.46 Crore Block Trade on NSE",
            "Summary": "GMR Airports Ltd. witnessed a block trade worth Rs 440.46 crores on the National Stock Exchange. The transaction involved approximately 50,337,884 shares traded at Rs 87.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1757658746613,
            "Source": "order&deals"
        },
        {
            "Title": "GMR Airports Incorporates New Subsidiary GMR Cargo and Logistics Limited for Delhi Airport Cargo Project",
            "Summary": "GMR Airports Limited has incorporated a wholly owned subsidiary named GMR Cargo and Logistics Limited on September 11, 2025. The new subsidiary was created to undertake the Cargo City Project at Indira Gandhi International Airport, New Delhi, awarded by Delhi International Airport Limited (DIAL), and to pursue other cargo and logistics opportunities. The subsidiary has an initial paid-up share capital of Rs. 10 crore, divided into 1 crore equity shares of Rs. 10 each. The incorporation follows board approval granted on August 21, 2025. The transaction is not considered a related party transaction, and no governmental or regulatory approvals were required for the acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1757646155308,
            "Source": "corporate_action"
        },
        {
            "Title": "GMR Airports Sees Block Trade Worth Rs. 445.84 Crores on NSE",
            "Summary": "GMR Airports Ltd. witnessed a block trade on the National Stock Exchange involving approximately 50,947,817 shares at a price of Rs. 87.51 per share. The total transaction value amounted to Rs. 445.84 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1757583142243,
            "Source": "order&deals"
        },
        {
            "Title": "GMR Airports Launches Duty-Free Retail Services at Hyderabad Airport",
            "Summary": "GMR Airports has commenced duty-free retail services at Hyderabad Airport through a long-term agreement. The company has expanded its retail operations at the airport facility.",
            "Sentiment": "positive",
            "PublishDate": 1757556076773,
            "Source": "stock"
        },
        {
            "Title": "Fitch Upgrades GMR Hyderabad International Airport Outlook to Positive, Maintains BB+ Rating",
            "Summary": "Fitch Ratings has updated the outlook for GMR Hyderabad International Airport to positive while maintaining its credit rating at 'BB+'. This rating action affects GMR Airports' infrastructure asset and indicates an improved credit perspective for the airport operations.",
            "Sentiment": "positive",
            "PublishDate": 1757500394769,
            "Source": "stock"
        },
        {
            "Title": "GMR Airports Board Approves ₹5,000 Crore Fundraising and Delhi Airport Cargo City SPV",
            "Summary": "GMR Airports' board has approved a fundraising initiative of up to ₹5,000 crore. The board also approved the creation of a Special Purpose Vehicle (SPV) for the Cargo City Project at Delhi Airport.",
            "Sentiment": "positive",
            "PublishDate": 1755779336122,
            "Source": "corporate_action"
        },
        {
            "Title": "GMR Airports Limited Announces Voluntary Redemption of Rs. 5,000 Crore Non-Convertible Bonds",
            "Summary": "GMR Airports Limited has announced the voluntary redemption of Non-Convertible Bonds worth Rs. 5,000 crores across three ISINs. The bonds comprise Rs. 1,950 crores (ISIN: INE776C08042), Rs. 800 crores (ISIN: INE776C08034), and Rs. 2,250 crores (ISIN: INE776C08026). The redemption will be completed on or before August 30, 2025, following consents received from bondholders as per the Bond Trust Deed provisions dated November 17, 2023. The Bond Trust Deed allows the company to voluntarily redeem the bonds, and notices have been served to NCB holders and the Bond Trustee.",
            "Sentiment": "neutral",
            "PublishDate": 1755523283263,
            "Source": "corporate_action"
        },
        {
            "Title": "GMR Airports Limited Schedules Board Meeting to Consider ₹5,000 Crore Fund Raising",
            "Summary": "GMR Airports Limited has scheduled a Board of Directors meeting on August 21, 2025, to consider an enabling resolution for raising funds up to ₹5,000 crore. The fund raising will be conducted in one or more tranches through various securities including Qualified Institutions Placement, Foreign Currency Convertible Bonds, or other securities. The proposal will require shareholder approval and is subject to regulatory and statutory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1755522484536,
            "Source": "corporate_action"
        },
        {
            "Title": "GMR Airports' ₹1,500-crore mutual fund bond tranche falls short, Morgan Stanley covers gap",
            "Summary": "GMR Airports' ₹1,500-crore mutual fund bond tranche received only ₹950 crore in bids despite offering a 10.35% yield for 18 months. Morgan Stanley stepped in to cover the shortfall after limited investor interest. HDFC Mutual Fund invested ₹400 crore, Aditya Birla MF ₹200 crore, Citibank ₹200 crore, and ₹75 crore each from Axis MF and Nippon India MF. In contrast, GMR's ₹4,400-crore bank tranche with three-year maturity at 10.50% was fully subscribed, with Deutsche Bank taking ₹1,500 crore and SBI Mutual Fund ₹1,050 crore among other investors. The restricted investor base and migration of the segment to AIFs and private credit funds contributed to subdued mutual fund interest. The fundraise is expected to reduce GMR Airports' average borrowing cost by nearly 3 percentage points. Crisil assigned an A+ rating to the newly-issued NCD.",
            "Sentiment": "negative",
            "PublishDate": 1755223799924,
            "Source": "stock"
        },
        {
            "Title": "GMR Airports Reports Mixed Traffic Performance in July 2025 with 1.5% YTD Growth",
            "Summary": "GMR Airports handled 39.4 million passengers across all airports in YTD FY2026, showing 1.5% year-over-year growth. July 2025 results were mixed, with Delhi Airport experiencing an 8.9% decline in passenger traffic to 5.81 million due to geopolitical events and runway upgrades, while Hyderabad Airport grew 7.5% to 2.46 million passengers. Hyderabad achieved record-high passenger traffic and aircraft movements in YTD FY2026. Mopa (Goa) Airport showed 6.6% growth to 358,022 passengers. International traffic grew 3.4% while domestic traffic increased 0.9% year-over-year. The company received regulatory updates including TDSAT's direction to AERA to recalculate Delhi Airport's tariff base, and GMR AERO began operating Delhi Duty Free operations. Delhi Airport also received a Letter of Intent for developing Cargo City through 2036 with potential 30-year extension.",
            "Sentiment": "neutral",
            "PublishDate": 1755191293085,
            "Source": "stock"
        },
        {
            "Title": "GMR Airports Wins Contract to Develop Cargo City at Delhi Airport",
            "Summary": "GMR Airports Limited received a Letter of Intent to Award from Delhi International Airport Limited (DIAL) to develop and operate the Cargo City at Indira Gandhi International Airport, New Delhi. The project involves developing cargo and logistics facilities over 50.5 acres, including a 10-acre optional land parcel for future use. The contract runs for an initial period up to 2036 with a potential 30-year extension. The project operates on a revenue share payment model with a Minimum Monthly Guarantee of Rs. 415.74 crores payable to DIAL for the initial period. The transaction is structured as a related party transaction on arms' length basis with necessary regulatory approvals obtained.",
            "Sentiment": "positive",
            "PublishDate": 1755106768090,
            "Source": "stock"
        },
        {
            "Title": "GMR Airport Raises ₹5,900 Crore Through Non-Convertible Bonds for Debt Refinancing",
            "Summary": "GMR Airport has raised ₹5,900 crore through the allotment of non-convertible bonds. The funds raised will be used for debt refinancing purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1755098101706,
            "Source": "stock"
        },
        {
            "Title": "GMR Airports Opens Special Window for Re-lodgement of Physical Share Transfer Deeds",
            "Summary": "GMR Airports Limited has opened a special window from July 07, 2025 to January 06, 2026 for re-lodgement of physical share transfer deeds that were rejected or returned prior to April 01, 2019. The window is available only for transfer deeds that were lodged before the April 01, 2019 deadline and were rejected, returned, or not processed due to document deficiencies or other issues. Re-lodged securities will be issued only in demat mode. Shareholders interested in this opportunity can contact the company's Registrar and Share Transfer Agent, KFin Technologies Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1754913990668,
            "Source": "corporate_action"
        },
        {
            "Title": "GMR Airports Raises Rs 6,000 Crore Through NCDs to Refinance Existing Debt",
            "Summary": "GMR Airports is raising Rs 6,000 crore through non-convertible debentures to refinance existing liabilities. The fundraise is split into two tranches - Rs 4,200 crore from banks including Barclays, Deutsche Bank and JP Morgan at around 10.50% for 3 years, and Rs 1,800 crore from mutual funds including ICICI Prudential AMC, HDFC AMC, UTI AMC and SBI Mutual Fund at around 10.35% for 18 months. Crisil has assigned an A+ rating to the NCDs. The refinancing will reduce the company's average borrowing cost by nearly 300 basis points. GMR Airports currently has Rs 6,100 crore in non-convertible bonds, with Rs 5,000 crore due for repayment in November 2026 and Rs 1,100 crore in February 2028. The company owns and operates major Indian airports including Delhi and Hyderabad.",
            "Sentiment": "positive",
            "PublishDate": 1754353817072,
            "Source": "stock"
        },
        {
            "Title": "GMR Airports Unit Acquires 60% Stake in Greek Operation for Crete Airport Expansion",
            "Summary": "GMR Airports announced that its unit has purchased a 60% stake in a Greek operation. The acquisition is aimed at expanding the non-aviation business at Crete Airport. The transaction represents GMR's strategic move to grow its international airport operations beyond traditional aviation services.",
            "Sentiment": "positive",
            "PublishDate": 1754273168330,
            "Source": "order&deals"
        },
        {
            "Title": "GMR Airports Subsidiary Acquires 60% Stake in Greek Company for INR 6 Crore",
            "Summary": "GMR Airports Greece Single Member S.A., a wholly owned step-down subsidiary of GMR Airports Limited, has acquired 60% stake in GMR Terna Commercial S.A. for approximately INR 6 crore. The acquisition involved subscribing to 6,00,000 shares of Euro 1 each, totaling Euro 6,00,000, in the newly incorporated Greek company. GMR Terna Commercial S.A. will handle non-aeronautical businesses at the New Heraklion International Airport in Crete, Greece, though business operations have not yet commenced. The transaction supports GMR's existing airport development, operation and maintenance activities at Crete airport and strengthens the company's airport-related businesses. The acquisition does not require governmental or regulatory approvals and is not considered a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1754228755943,
            "Source": "stock"
        },
        {
            "Title": "GMR Airports Plans Largest Bond Issue to Raise Over ₹60 Billion",
            "Summary": "GMR Airports has finalized terms for its biggest corporate debt issue, aiming to raise more than 60 billion rupees ($685.13 million). The airport operator will raise 18 billion rupees through 18-month bonds, primarily placed with mutual funds, and around 42 billion rupees through three-year bonds targeted at large foreign lenders. Both bond maturities will carry an annual coupon rate of 10.50%. The fundraising is expected to be completed within the next few days. GMR Airports manages multiple airports including Delhi and Hyderabad, and its bonds are rated A+ by Crisil.",
            "Sentiment": "neutral",
            "PublishDate": 1753952911253,
            "Source": "stock"
        },
        {
            "Title": "GMR Airports Targets 175 Million Passengers by FY30 with Strong EBITDA Growth",
            "Summary": "GMR Airports has outlined ambitious growth targets, aiming for strong EBITDA growth driven by operations at Delhi, Hyderabad, Goa, and Crete airports. The company targets handling 175 million passengers by FY30. Additionally, GMR expects to achieve positive free cash flow at both Delhi International Airport Limited (DIAL) and GMR Hyderabad International Airport Limited (GHIAL) by FY26.",
            "Sentiment": "positive",
            "PublishDate": 1753804698491,
            "Source": "stock"
        },
        {
            "Title": "GMR Airports Secures Approval for 60 Billion Rupee Bond Issuance, Reports Higher Q1 EBITDA",
            "Summary": "GMR Airports received approval to issue 60 billion rupees in non-convertible bonds. The company reported Q1 EBITDA of 12.8 billion rupees compared to 10.16 billion rupees in the same period last year. However, the EBITDA margin declined to 39.94% from 42.31% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1753802326119,
            "Source": "corporate_action"
        },
        {
            "Title": "GMR Airports Board Approves Q2 2025 Results, INR 6000 Crore Bond Issuance, and New Secretarial Auditor",
            "Summary": "GMR Airports Limited's Board approved unaudited financial results for Q2 2025 (quarter ended June 30, 2025) showing standalone revenue of Rs. 477.97 crore and a loss after tax of Rs. 178 crore. The company reported consolidated revenue of Rs. 3,205.23 crore with a loss after tax of Rs. 137.11 crore. The Board authorized issuance of non-convertible bonds worth up to INR 6000 crores for refinancing existing bonds and appointed M/s. V Sreedharan & Associates as Secretarial Auditor for a 5-year term from FY 2025-26 to FY 2029-30, subject to shareholder approval. The company started duty-free operations at Delhi Airport on July 28, 2025, following a license agreement signed in August 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1753802302211,
            "Source": "earnings"
        },
        {
            "Title": "GMR Airports Reports Wider Q1 Loss Despite Revenue Growth",
            "Summary": "GMR Airports reported a consolidated net loss of 2.11 billion rupees in Q1, compared to a loss of 1.41 billion rupees in the same period last year. The company's revenue increased to 32 billion rupees from 24 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1753801908106,
            "Source": "earnings"
        },
        {
            "Title": "GMR Airports Limited Begins Duty-Free Operations at Delhi Airport",
            "Summary": "GMR Airports Limited has commenced duty-free operations at Indira Gandhi International Airport, New Delhi, starting from July 28, 2025. The company had emerged as the selected bidder for the Delhi Duty Free Concession and entered into a license agreement on August 21, 2024. This marks GMR Airports' entry into duty-free retail operations at the Delhi airport, expanding beyond its core airport infrastructure business.",
            "Sentiment": "positive",
            "PublishDate": 1753670921057,
            "Source": "stock"
        },
        {
            "Title": "GMR Airports Limited Receives Credit Ratings for Rs 7,000 Crore Debt Facilities",
            "Summary": "GMR Airports Limited received credit ratings from Crisil Ratings Limited on July 25, 2025. The company's Non-Convertible Debentures worth Rs 6,000 crore were rated 'Crisil A+/Stable', while short-term bank facilities of Rs 1,000 crore received a 'CRISIL A1' rating. The ratings cover facilities that have been availed or are to be availed by the company.",
            "Sentiment": "positive",
            "PublishDate": 1753545747021,
            "Source": "stock"
        },
        {
            "Title": "GMR Airports Shareholders Approve Asset Sale by Material Subsidiary Delhi Duty Free Services",
            "Summary": "GMR Airports Limited shareholders approved a special resolution through postal ballot regarding the sale of assets by Delhi Duty Free Services Private Limited, a material subsidiary of the company. The voting concluded on July 23, 2025, with 92.39% of total paid-up equity share capital participating in the e-voting process. The resolution received overwhelming support with 99.998% of valid votes cast in favor and only 0.002% against. A total of 2,668 members participated in the voting process out of 832,928 total shareholders on record date of June 17, 2025. The postal ballot notice was issued on June 21, 2025, and the scrutinizer V Sreedharan submitted the voting results report on July 25, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753454294127,
            "Source": "corporate_action"
        }
    ]
}