{
    "Symbol": "GMRP&UI",
    "ISIN": "INE0CU601026",
    "News": [
        {
            "Title": "GMR Power & Urban Infra Q3FY26 Results Announced",
            "Summary": "GMR Power and Urban Infra Limited announced Q3FY26 financial results for quarter ended December 31, 2025, with Board meeting held February 6, 2026 approving unaudited standalone and consolidated results.",
            "Sentiment": "neutral",
            "PublishDate": 1770388810183,
            "Source": "co_actions_results"
        },
        {
            "Title": "GMR Power & Urban Infra Allots Shares Worth Rs 900 Cr",
            "Summary": "GMR Power & Urban Infra Limited completed allotment of 6.62 crore equity shares and 3.31 crore convertible warrants on preferential basis, raising Rs 899.99 crore from three investors including promoter group.",
            "Sentiment": "positive",
            "PublishDate": 1769579815069,
            "Source": "co_actions_results"
        },
        {
            "Title": "GMR Power Forms Solar Subsidiary in Odisha",
            "Summary": "GMR Power and Urban Infra Limited announces incorporation of GMR Utkal Solar Power Limited as wholly owned subsidiary for solar power development in Kamalanga, Odisha with ₹1.00 lakh paid-up capital.",
            "Sentiment": "positive",
            "PublishDate": 1767188240728,
            "Source": "stocks"
        },
        {
            "Title": "GMR Power Unit Cuts Debt Cost by 265 bps to 9.50%",
            "Summary": "GMR Kamalanga Energy refinances ₹2,700 cr debt, reducing borrowing cost from 12.15% to 9.50% p.a., with potential for further reduction to 9.25% on credit upgrade.",
            "Sentiment": "positive",
            "PublishDate": 1766426492917,
            "Source": "stocks"
        },
        {
            "Title": "GMR Power Approves ₹12,000 Cr Capital Raise Plan",
            "Summary": "GMR Power and Urban Infra approves issuing ₹8,000 crores worth of equity shares and ₹4,000 crores of convertible warrants for capital expansion.",
            "Sentiment": "positive",
            "PublishDate": 1765973899452,
            "Source": "co_actions_results"
        },
        {
            "Title": "GMR Power Plans ₹1,200 Crore Fundraise via Equity",
            "Summary": "GMR Power and Urban Infra will review a proposal to raise up to ₹1,200.00 crore through equity shares or warrants issuance on December 17, marking a significant capital raising initiative.",
            "Sentiment": "positive",
            "PublishDate": 1765509286571,
            "Source": "co_actions_results"
        },
        {
            "Title": "GMR Power Establishes Fully Owned Solar Power Subsidiary",
            "Summary": "GMR Power has formed a fully owned subsidiary named GMR Kalinga Solar Power. This move represents the company's expansion into the solar power sector through a dedicated subsidiary structure.",
            "Sentiment": "positive",
            "PublishDate": 1763987990781,
            "Source": "stock"
        },
        {
            "Title": "GMR Power's Subsidiary Incorporates New Solar Power Company for 10MW Project in Odisha",
            "Summary": "GMR Energy Limited, a wholly owned subsidiary of GMR Power and Urban Infra Limited, has incorporated GMR Kalinga Solar Power Limited with a paid-up capital of Rs. 1 lakh for developing a 10MW solar power project in Kamalanga, Odisha. The new subsidiary will focus on generation and transmission of solar power, expanding GMR's renewable energy portfolio through this Rs. 1 lakh investment.",
            "Sentiment": "positive",
            "PublishDate": 1763987470415,
            "Source": "corporate_action"
        },
        {
            "Title": "Vistra ITCL Pledges 3.6 Crore GMR Power Shares as Debenture Security",
            "Summary": "Vistra ITCL (India) Limited, acting as debenture trustee, pledged 3.6 crore equity shares of GMR Power and Urban Infra Limited to secure NCDs issuance. The pledge increased Vistra's total encumbered shareholding in GMR Power from 6.16% to 11.19% following the transaction completed on November 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763362344992,
            "Source": "corporate_action"
        },
        {
            "Title": "GMR Power Reports 28% Revenue Growth in Q2FY26 Driven by Smart Meter Business",
            "Summary": "GMR Power and Urban Infra Limited achieved total income of INR 19.2 billion in Q2FY26, up 28% year-on-year, primarily driven by smart meter revenue of INR 2.9 billion and increased international coal trading revenue. The company reported EBITDA of INR 4.8 billion with 25% margins, while achieving strong operational performance with 73% and 81% plant load factors at Warora and Kamalanga power plants respectively.",
            "Sentiment": "positive",
            "PublishDate": 1763200284438,
            "Source": "earnings"
        },
        {
            "Title": "GMR Power Urban Infra Reports Strong Q2 Results, Approves Rs 2,970 Crore Guarantee for Subsidiary",
            "Summary": "GMR Power Urban Infra's board approved quarterly results for September 2025 and a corporate guarantee of Rs 2,970 crore for subsidiary GKEL's refinancing from Power Finance Corporation. The company also approved changing B.V.N. Rao's designation from Non-Executive to Executive Director for three years, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1763142137731,
            "Source": "earnings"
        },
        {
            "Title": "GMR Power Promoters Pledge Shares for Rs 300 Crore Debt",
            "Summary": "GMR Enterprises Private Limited and GMR Business & Consultancy LLP have pledged shares in GMR Power And Urban Infra Limited as collateral. The encumbrance relates to secured, unlisted, unrated convertible debentures with Varalakshmi Enterprises involving an amount of Rs 3,00,00,00,000.",
            "Sentiment": "neutral",
            "PublishDate": 1763096652677,
            "Source": "corporate_action"
        },
        {
            "Title": "Vistra ITCL Releases 3.6 Crore GMR Power Shares from Encumbrance",
            "Summary": "Vistra ITCL (India) Limited, acting as Debenture Trustee and Security Trustee, released 3.6 crore equity shares of GMR Power and Urban Infra Limited from encumbrance. The release reduced Vistra's encumbered shareholding from 8 crore shares (11.19%) to 4.4 crore shares (6.15%). The shares were originally pledged to secure the issue of Non-Convertible Debentures (NCDs). GMR Power's total equity share capital remains unchanged at 71.48 crore shares with a face value of Rs. 5 each. Vistra filed this disclosure under SEBI takeover regulations as a precautionary measure, noting that the primary compliance responsibility lies with the lender and debenture holders.",
            "Sentiment": "neutral",
            "PublishDate": 1762968792718,
            "Source": "corporate_action"
        },
        {
            "Title": "GMR Power and Urban Infra Limited Re-appoints Three Independent Directors for Second Five-Year Term",
            "Summary": "GMR Power and Urban Infra Limited shareholders approved the re-appointment of three Independent Directors at their 6th Annual General Meeting held on September 29, 2025. Mr. Shantanu Ghosh, Dr. Fareed Ahmed, and Ms. Suman Naresh Sabnani were re-appointed for a second term of five years, effective from the conclusion of the 6th AGM until the conclusion of the 11th AGM. The re-appointments were based on recommendations from the Nomination and Remuneration Committee and Board of Directors. Mr. Ghosh brings 40 years of banking experience including roles at ING Vysya Bank and overseas banks in Oman. Dr. Ahmed has banking sector experience including serving as Executive Director at Punjab & Sind Bank and 34 years with Corporation Bank. Ms. Sabnani has over 30 years of managerial experience primarily with HSBC in senior leadership positions. All three directors meet independence criteria under the Companies Act, 2013 and SEBI Listing Regulations and are not related to any other company directors.",
            "Sentiment": "positive",
            "PublishDate": 1759284406240,
            "Source": "corporate_governance"
        },
        {
            "Title": "GMR Power And Urban Infra Discloses 77.19% Share Encumbrance by Promoter GMR Enterprises",
            "Summary": "GMR Power And Urban Infra Limited disclosed share encumbrance details by its promoter GMR Enterprises Private Limited. The encumbered shares represent 77.19% of promoter shareholding, exceeding both 50% of promoter holding and 20% of total share capital. The promoter holds 361,426,826 shares representing 50.56% of total share capital. A specific encumbrance of 9.5 million shares (1.33% of total share capital) was created on September 17, 2025, pledged to Arka Fincap Limited, an NBFC. The pledge relates to an existing facility with a value of ₹263.32 crores against an amount of ₹100 crores, providing a security cover ratio of 2.63. The borrowed amount is for personal use by promoters. Other entities in the agreement include GMR Infra Projects Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1758511520826,
            "Source": "corporate_action"
        },
        {
            "Title": "Supreme Court Upholds Pro-Rata Coal Allocation Ruling for GMR Kamalanga Energy",
            "Summary": "The Supreme Court dismissed appeals by Distribution Licensees of Haryana and GRIDCO, upholding the Appellate Tribunal for Electricity's December 2019 judgment. The ruling confirms that GMR Kamalanga Energy Limited's linkage coal should be allocated proportionately among three state DISCOMs - Haryana, Bihar, and Odisha - with whom GKEL has Power Purchase Agreements. The court's decision allows GKEL to recover outstanding payments from Haryana Discoms along with applicable interest. Haryana Discoms had been making partial payments for additional coal costs while the matter was pending before the Supreme Court.",
            "Sentiment": "positive",
            "PublishDate": 1757595906925,
            "Source": "stock"
        },
        {
            "Title": "GMR Power And Urban Infra Promoter Pledges 10.5 Million Shares to NBFC",
            "Summary": "GMR Power And Urban Infra Limited disclosed that its promoter, GMR Enterprises Private Limited, has encumbered shares representing 77.19% of promoter shareholding and exceeding 20% of total share capital. On September 4, 2025, the promoter pledged 10.5 million shares (1.47% of total share capital) to Arka Fincap Limited, an NBFC. The pledge was made for personal use by promoters, with the encumbered shares valued at ₹1,173.48 crores against an amount of ₹500 crores, providing a security cover ratio of 2.35. GMR Enterprises Private Limited holds 361.43 million shares, representing 50.56% of the company's total share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1757336333856,
            "Source": "corporate_action"
        },
        {
            "Title": "GMR Power And Urban Infra Approves Resolution To Raise Up To 30 Billion Rupees",
            "Summary": "GMR Power And Urban Infra has approved an enabling resolution for raising funds up to 30 billion rupees. The company has given approval for this fundraising initiative.",
            "Sentiment": "positive",
            "PublishDate": 1756080661269,
            "Source": "corporate_action"
        },
        {
            "Title": "GMR Power And Urban Infra Approves Fund Raising Plan Worth Up To 30 Billion Rupees",
            "Summary": "GMR Power And Urban Infra has approved a plan to raise funds of up to 30 billion rupees. The company's board has given approval for this fundraising initiative.",
            "Sentiment": "positive",
            "PublishDate": 1755864585419,
            "Source": "stock"
        },
        {
            "Title": "GMR Power and Urban Infra Limited to Consider ₹3000 Crore Fund Raising Proposal",
            "Summary": "GMR Power and Urban Infra Limited has scheduled a Board of Directors meeting on August 22, 2025 to consider and approve a proposal for raising funds up to ₹3000 Crore. The fund raising may be conducted in one or more tranches through various securities including Qualified Institutions Placement, Foreign Currency Convertible Bonds, or other securities. The proposal will require shareholder approval and other regulatory approvals as applicable.",
            "Sentiment": "positive",
            "PublishDate": 1755611320140,
            "Source": "corporate_action"
        },
        {
            "Title": "GMR Power and Urban Infra Reports Q1FY26 Results with Smart Meter Revenue Growth",
            "Summary": "GMR Power and Urban Infra Limited reported quarterly results with total income of INR 17.7 billion, up 2% year-over-year, driven by smart meter revenue recognition of INR 1.8 billion. EBITDA declined 19% year-over-year to INR 5.2 billion with margins at 29%. The company posted a net loss of INR 0.35 billion compared to a profit of INR 13.8 billion in the same quarter last year. Energy segment contributed 89.1% of EBITDA, while smart meters accounted for 10.5%. The Warora and Kamalanga power plants achieved plant load factors of 89% and 91% respectively. The company completed one-time settlement with lenders of GMR Rajahmundry Energy Limited and divested stakes in Bajoli Holi, Vemagiri and Rajahmundry projects. Smart meter project implementation is progressing with 13.1 lakh meters installed across project areas and operational go-live received for all three projects.",
            "Sentiment": "neutral",
            "PublishDate": 1754049530988,
            "Source": "earnings"
        },
        {
            "Title": "GMR Power and Urban Infra Board Approves Q1 FY26 Results and Key Appointments",
            "Summary": "GMR Power and Urban Infra Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs. 94.30 crore, down from Rs. 130.50 crore in the same quarter last year. Net profit stood at Rs. 24.17 crore compared to a loss of Rs. 204.19 crore in the previous year quarter. The Board reappointed Walker Chandiok & Co LLP as statutory auditors for a second five-year term and appointed new secretarial and cost auditors. Mr. Madhva Bhimacharya Terdal transitioned from Executive Director to Non-Executive Non-Independent Director due to superannuation. The company operates through subsidiaries in energy and road infrastructure projects, with significant investments in GMR Energy Limited and ongoing legal disputes in subsidiary companies.",
            "Sentiment": "neutral",
            "PublishDate": 1753881817246,
            "Source": "earnings"
        },
        {
            "Title": "GMR Power and Urban Infra Schedules Board Meeting for July 30 to Approve Quarterly Results",
            "Summary": "GMR Power and Urban Infra Limited has scheduled a Board of Directors meeting for July 30, 2025, to consider and approve unaudited financial results for the quarter ended June 30, 2025. The results will include both standalone and consolidated financials. The company's trading window for designated persons has been closed since June 30, 2025, and will remain closed until 48 hours after the financial results are declared.",
            "Sentiment": "neutral",
            "PublishDate": 1753554921457,
            "Source": "corporate_action"
        },
        {
            "Title": "GMR Power & Urban Infra Ltd.: Major Deleveraging Through Stake Sales and Spin-offs",
            "Summary": "GMR Power to reduce debt by ₹4,400 crore through stake sales in three power projects to Synergy Investments Holding Ltd. The deal includes divestment in a hydro-electric project and two gas-based power plants. The transaction, valued at ₹653 crore, is expected to complete by September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1744597529000,
            "Source": "corporate_action"
        },
        {
            "Title": "GMR Power & Urban Reports Increased Q3 Loss and Revenue",
            "Summary": "GMR Power & Urban reported a net loss of 1.06 billion rupees in Q3, compared to a loss of 454 million rupees in the same quarter last year. The loss has also increased from 2.6 billion rupees in the previous quarter. However, the company's revenue increased to 16.1 billion rupees, up from 11 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738197206000,
            "Source": "earnings"
        },
        {
            "Title": "GMR Power & Urban Reports Q3 EBITDA Growth",
            "Summary": "GMR Power & Urban announced its Q3 financial results, showing an increase in EBITDA to 4.9 billion rupees from 4.03 billion rupees year-over-year. However, the EBITDA margin decreased to 30.58% from 36.54% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738159505000,
            "Source": "earnings"
        },
        {
            "Title": "GMR Power & Urban Reports Increased Q3 Loss and Revenue",
            "Summary": "GMR Power & Urban reported a net loss of 1.06 billion rupees in Q3, compared to a loss of 454 million rupees in the same quarter last year. The loss also increased from 2.6 billion rupees in the previous quarter. However, the company's revenue grew to 16.1 billion rupees, up from 11 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738159427000,
            "Source": "earnings"
        },
        {
            "Title": "GMR Power and Urban Infra: Secures ₹2,128 Crore IREDA Loan for UP Smart Metering Project",
            "Summary": "GMR Power and Urban Infra Ltd has received approval for a ₹2,128 crore loan from IREDA to partially finance a ₹3,467.02 crore smart metering project in Uttar Pradesh. The project involves installing and maintaining 75.69 lakh smart meters across various zones in UP, in partnership with Bosch Global Software Technologies.",
            "Sentiment": "positive",
            "PublishDate": 1736315651000,
            "Source": "order&deals"
        }
    ]
}