{
    "Symbol": "GNA",
    "ISIN": "INE934S01014",
    "News": [
        {
            "Title": "GNA Axles postal ballot for director reappointments",
            "Summary": "GNA Axles Limited issues postal ballot notice for reappointment of three executive directors through e-voting from February 12 to March 13, 2026, seeking special resolutions for leadership continuity.",
            "Sentiment": "neutral",
            "PublishDate": 1770795446629,
            "Source": "stocks"
        },
        {
            "Title": "GNA Axles Q3 Net Profit Jumps 26% to ₹320 Million",
            "Summary": "GNA Axles reported a strong 26% year-on-year growth in Q3 net profit, rising to ₹320 million from ₹254 million in the same period last year, demonstrating solid operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1770370020530,
            "Source": "co_actions_results"
        },
        {
            "Title": "GNA Axles Limited Pays Rs. 1.68 Lakh Fine for SEBI Compliance Violations",
            "Summary": "GNA Axles Limited was fined Rs. 84,000 each by NSE and BSE (total Rs. 1.68 lakh including taxes) for non-compliance with SEBI listing regulations related to board composition and committee constitution during the quarter ended June 2025. The company's board attributed the violations to inadvertent oversight following the retirement of director Jasminder Singh Johal in June 2025, paid the fines, and committed to ensuring future compliance.",
            "Sentiment": "negative",
            "PublishDate": 1763634208143,
            "Source": "corporate_governance"
        },
        {
            "Title": "GNA Axles Reports Mixed Q2 Results with Higher Profitability Despite Revenue Decline",
            "Summary": "GNA Axles announced Q2 financial results showing EBITDA of 611 million rupees compared to 530 million rupees in the same period last year. The company's EBITDA margin improved to 17.57% from 13.7% year-over-year. Net profit increased to 312 million rupees from 285 million rupees in the previous year's corresponding quarter. However, revenue declined to 3.48 billion rupees from 3.9 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1762141400903,
            "Source": "earnings"
        },
        {
            "Title": "GNA Axles Reports Strong Q2 Performance with 12.63% Increase in Earnings Per Share",
            "Summary": "GNA Axles Limited announced its quarterly results for the second quarter and half year ended September 30, 2025. The company reported revenue from operations of Rs. 692.15 crores for the quarter, with a net profit of Rs. 31.19 crores. For the half-year period, revenue reached Rs. 1,539.74 crores with net profit of Rs. 54.22 crores. The company's earnings per share stood at Rs. 7.27 for the quarter and Rs. 12.63 for the half-year. The Board of Directors approved these unaudited financial results in their meeting held on November 1, 2025. The results were reviewed by the Audit Committee and the auditors issued an unmodified opinion in their limited review report. The company operates in the auto components segment, manufacturing rear axle shafts, transmission shafts and spindles.",
            "Sentiment": "positive",
            "PublishDate": 1761990250143,
            "Source": "earnings"
        },
        {
            "Title": "GNA Axles Reports Decline in Q1 Revenue and Profit Despite Margin Improvement",
            "Summary": "GNA Axles reported Q1 revenue of 3.44 billion rupees, down from 4 billion rupees in the same period last year. The company's net profit decreased to 230 million rupees from 278 million rupees year-over-year. EBITDA fell to 501 million rupees from 548 million rupees compared to the previous year. However, EBITDA margin improved to 14.56% from 13.72% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1753435541830,
            "Source": "earnings"
        },
        {
            "Title": "GNA Axles to Discuss Q1 Results on July 25",
            "Summary": "GNA Axles has announced that it will discuss its first quarter results on July 25. No further details about the financial performance or the specific time of the discussion were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1751885831000,
            "Source": "default"
        },
        {
            "Title": "GNA Axles: Q4 Profit Surges 50% on Strong Margin Growth",
            "Summary": "GNA Axles reported a 50% YoY increase in Q4 net profit to ₹25 crore. Revenue grew 1.8% to ₹377.5 crore. EBITDA rose 40% with margin expanding to 13%. The company announced a dividend of ₹3 per share.",
            "Sentiment": "positive",
            "PublishDate": 1745412421000,
            "Source": "earnings"
        },
        {
            "Title": "GNA Axles Reports Strong Q4 Financial Results",
            "Summary": "GNA Axles has announced its Q4 financial results, showing significant improvements across key metrics. Revenue increased to 3.77 billion rupees from 3.7 billion rupees year-over-year. EBITDA rose to 503 million rupees from 359 million rupees, with the EBITDA margin expanding to 13.33% from 9.67%. Net profit also saw a substantial increase, reaching 254 million rupees compared to 167 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1745227133000,
            "Source": "result"
        },
        {
            "Title": "GNA Axles to Consider Q4 Results on April 21",
            "Summary": "GNA Axles Limited has announced that it will consider its fourth quarter financial results on April 21. This indicates the company is preparing to release its earnings report for the final quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1744373477000,
            "Source": "result"
        },
        {
            "Title": "GNA Axles Reports Q3 Revenue Increase",
            "Summary": "GNA Axles has reported a revenue of 3.8 billion rupees for the third quarter, compared to 3.57 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1736500716000,
            "Source": "earnings"
        },
        {
            "Title": "GNA Axles Reports Improved Q3 EBITDA and Margin",
            "Summary": "GNA Axles has reported its Q3 financial results. The company's EBITDA increased to 524.5 million rupees, up from 471 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 13.98% from 13.19% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1736500701000,
            "Source": "earnings"
        },
        {
            "Title": "GNA Axles Reports Increased Q3 Net Profit",
            "Summary": "GNA Axles has announced its financial results for the third quarter. The company's net profit increased to 254 million rupees, up from 224 million rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1736500615000,
            "Source": "earnings"
        },
        {
            "Title": "GNA Axles Commissions 4 MW Rooftop Solar Power Plant",
            "Summary": "GNA Axles has announced the commissioning of a 4 MW rooftop solar power plant. This move indicates the company's investment in renewable energy sources, potentially aimed at reducing operational costs and environmental impact.",
            "Sentiment": "positive",
            "PublishDate": 1734007770000,
            "Source": "corporate_action"
        },
        {
            "Title": "GNA Axles Q2 Financial Results",
            "Summary": "GNA Axles reported its Q2 financial results. The company's EBITDA for the quarter was 530 million rupees, compared to 551 million rupees in the same quarter last year. The EBITDA margin slightly improved to 13.7% from 13.63% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1729242636000,
            "Source": "result"
        },
        {
            "Title": "GNA Axles Reports Q2 Revenue Decline",
            "Summary": "GNA Axles, an automotive components manufacturer, has reported its second quarter revenue for the current fiscal year. The company's revenue stood at 3.9 billion rupees, showing a slight decrease compared to 4 billion rupees in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1729242617000,
            "Source": "result"
        },
        {
            "Title": "GNA Axles Reports Slight Increase in Q2 Net Profit",
            "Summary": "GNA Axles has reported a net profit of 285 million rupees for the second quarter, compared to 276 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729242593000,
            "Source": "result"
        }
    ]
}