{
    "Symbol": "GNFC",
    "ISIN": "INE113A01013",
    "News": [
        {
            "Title": "GNFC Reports Q3 FY26 Financial Results",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Limited published unaudited financial results for Q3 FY26, showing total income from operations of ₹1,996 crores and net profit after tax of ₹150 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1770810804862,
            "Source": "co_actions_results"
        },
        {
            "Title": "GNFC Appoints Dr. Rajender Kumar as Additional Director",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Limited announces the appointment of Dr. Rajender Kumar, IAS as Additional Director effective February 10, 2026, following board approval based on committee recommendation.",
            "Sentiment": "positive",
            "PublishDate": 1770731382273,
            "Source": "stocks"
        },
        {
            "Title": "GNFC Updates Key Personnel Authorization Details",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Limited notifies stock exchanges about changes in authorization for determining materiality of events under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770730815882,
            "Source": "stocks"
        },
        {
            "Title": "GNFC Schedules Q3FY26 Results Call on Feb 11",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Limited has announced a conference call with investors and analysts on February 11, 2026, to discuss Q3FY26 financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1768908766843,
            "Source": "stocks"
        },
        {
            "Title": "GNFC Board Meet on Feb 10 for Q3FY26 Results",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Limited has scheduled its board meeting for February 10, 2026, to approve Q3FY26 unaudited financial results. Trading window remains closed until 48 hours post-declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1768293533661,
            "Source": "co_actions_results"
        },
        {
            "Title": "GNFC Board Meet on Feb 10 for Q3FY26 Results",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Limited has scheduled its board meeting for February 10, 2026, to consider Q3FY26 unaudited financial results. Trading window remains closed until 48 hours post-announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1768293245761,
            "Source": "co_actions_results"
        },
        {
            "Title": "GNFC Board Changes: New Managing Director Appointed",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals announces leadership transition with Shri Rajkumar Beniwal replacing Dr. T. Natarajan as Managing Director following Gujarat government notification.",
            "Sentiment": "neutral",
            "PublishDate": 1766580636167,
            "Source": "stocks"
        },
        {
            "Title": "GNFC Awards ₹360 Cr Contract for Ammonium Nitrate Plant",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Limited has awarded a ₹360 crore contract to Toyo Engineering India for supply of Ammonium Nitrate-II plant on LEPC basis, enhancing capacity by 94%.",
            "Sentiment": "positive",
            "PublishDate": 1766493133745,
            "Source": "co_actions_results"
        },
        {
            "Title": "GNFC Seeks Shareholder Approval for New Chairman Appointment and Cost Auditor Remuneration",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Limited has issued a postal ballot notice seeking shareholder approval for appointing Shri Manoj Kumar Das, IAS as Director and Chairman, and ratifying ₹1.10 lakh remuneration for cost auditor M/s. KG Goyal Associates for FY 2025-26. The e-voting process runs from December 3, 2025 to January 1, 2026, with results expected by January 5, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1764591663876,
            "Source": "corporate_governance"
        },
        {
            "Title": "GNFC Approves INR 450 Crore Ammonium Nitrate Melt Expansion, Total Capex Pipeline Reaches INR 2,800 Crores",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Limited's Board approved a 163,000 tonne Ammonium Nitrate Melt II project worth INR 450 crores, part of a broader INR 2,800 crore capex pipeline including weak nitric acid and power plant projects. The company reported improved quarterly results driven by reduced input costs and better volumes in WNA, AN Melt and technical grade urea, while facing margin pressure in aniline and acetic acid due to import competition and methanol sourcing issues.",
            "Sentiment": "positive",
            "PublishDate": 1763449416142,
            "Source": "earnings"
        },
        {
            "Title": "DGTR Recommends Extending Anti-Dumping Duty on Toluene Di-Isocyanate Imports for Gujarat Narmada Valley Fertilizers",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has recommended continuing anti-dumping duties on Toluene Di-Isocyanate imports from the European Union and Saudi Arabia for an additional five years. This recommendation affects Gujarat Narmada Valley Fertilizers & Chemicals, providing continued protection from potentially unfairly priced imports in this chemical segment.",
            "Sentiment": "positive",
            "PublishDate": 1763003386149,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Narmada Valley Fertilizers & Chemicals Appoints New Cost Auditors for FY2025-26",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Limited (GNFC) has appointed M/s. K.G. Goyal Associates, Cost Accountants, Jaipur as Cost Auditors for FY2025-26. The Board of Directors approved the appointment on November 12, 2025, based on the Audit Committee's recommendation. The appointment fills a casual vacancy caused by the resignation of M/s. Dhananjay V. Joshi Associates. K.G. Goyal Associates has been practicing for 35 years with five partners and offices in Jaipur, Delhi, and Mumbai. The firm has experience auditing Central PSUs, State Government Undertakings, and private sector companies across various industries including Power, Textile, Oil & Gas, Fertilizer, Cement, Metal, Engineering Goods, and Telecommunications.",
            "Sentiment": "neutral",
            "PublishDate": 1762972480843,
            "Source": "corporate_governance"
        },
        {
            "Title": "GNFC Plans Chemical-Led Growth with ₹2,800Cr Capex and Ammonium Nitrate Expansion",
            "Summary": "GNFC has outlined its growth strategy focused on chemical expansion, including a brownfield ammonium nitrate melt expansion with 163 KTPA capacity and a ₹2,800 crore capex pipeline. The company benefits from TDI anti-dumping duty extension until March 2026, which supports profitability. GNFC has engaged a strategic consultant for Phase-II growth planning and efficiency initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1762960715783,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Narmada Valley Fertilizers Reports Strong Q2 EBITDA Growth",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemical reported Q2 EBITDA of 1.85 billion rupees compared to 900 million rupees in the same period last year. The company's EBITDA margin improved to 9.40% from 4.69% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762951780150,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Narmada Valley Fertilizers Reports 80% Jump in Quarterly Net Profit",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemical reported quarterly net profit of 1.8 billion rupees compared to 1 billion rupees in the same period last year, representing an 80% increase. The company's quarterly revenue grew to 19.7 billion rupees from 19.2 billion rupees year-over-year, marking a 2.6% increase.",
            "Sentiment": "positive",
            "PublishDate": 1762949783392,
            "Source": "earnings"
        },
        {
            "Title": "GNFC Appoints Shri Manoj Kumar Das as Director and Chairman",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Limited (GNFC) announced the appointment of Shri Manoj Kumar Das, IAS as Director and Chairman of the company. The Board of Directors approved the appointment through a Circular Resolution passed on November 4, 2025, based on the recommendation of the Nomination and Remuneration Committee. The appointment is subject to shareholder approval. The company confirmed that Shri Manoj Kumar Das is not debarred from holding the office of Director by SEBI or any other authority.",
            "Sentiment": "neutral",
            "PublishDate": 1762282286461,
            "Source": "corporate_governance"
        },
        {
            "Title": "GNFC's Cost Auditors Resign for Financial Year 2025-26",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Limited (GNFC) announced that M/s Dhananjay V. Joshi Associates, Cost Accountants, have resigned from conducting the audit of cost records for Financial Year 2025-26. The auditing firm, registered under Firm Reg. No. 000030 and based in Pune, submitted their resignation letter dated November 3, 2025, with immediate effect. GNFC has taken the resignation on record and informed the stock exchanges BSE and NSE as required under SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762184132134,
            "Source": "corporate_governance"
        },
        {
            "Title": "GNFC Appoints Shri Manoj Kumar Das as Chairman and Director",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Limited (GNFC) announced the appointment of Shri Manoj Kumar Das, IAS (DIN: 06530792) as Chairman and Director, replacing Shri Pankaj Joshi, IAS (Retd.). The appointment was made by the Government of Gujarat's Energy Petrochemicals Department effective November 1, 2025. Das serves as Chief Secretary to Government of Gujarat and is a Senior IAS Officer of 1990 batch with B.Tech (Computer Science) from IIT-Kharagpur. He has extensive experience in revenue administration, urban management, and has served as Joint Managing Director at Gujarat State Petroleum Corporation Limited. His appointment is subject to approval of the Nomination and Remuneration Committee, Board of Directors and Shareholders of the Company.",
            "Sentiment": "neutral",
            "PublishDate": 1762078382374,
            "Source": "corporate_governance"
        },
        {
            "Title": "GNFC Chairman Shri Pankaj Joshi Resigns Following Superannuation from Gujarat Government",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Limited (GNFC) announced that Shri Pankaj Joshi, IAS (Retd.) (DIN: 01532892) has resigned from his position as Director and Chairman effective October 31, 2025. The resignation follows his superannuation as Chief Secretary to Government of Gujarat. The company received his resignation letter dated October 31, 2025 on November 1, 2025. Joshi also resigned from multiple other Gujarat state-owned companies including Gujarat State Fertilizers & Chemicals Limited, Gujarat State Petronet Limited, Gujarat State Petroleum Corporation Ltd., Gujarat Gas Limited, GSPL India Gasnet Limited, GSPL India Transco Limited, and Sardar Sarovar Narmada Nigam Limited where he held various positions as Chairman, CMD, Director or Nominee Director.",
            "Sentiment": "neutral",
            "PublishDate": 1761981385781,
            "Source": "corporate_governance"
        },
        {
            "Title": "GNFC Executive Director Murtaza I. Shamsi Steps Down Following Contract Conclusion",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Limited (GNFC) announced that Shri Murtaza I. Shamsi, Executive Director and Senior Managerial Personnel, ceased to be in the services of the Company with effect from the close of business hours on October 31, 2025. His departure follows the conclusion of his contract of employment. The company disclosed this information to BSE and NSE in compliance with SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1761914503028,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gujarat Narmada Valley Fertilizers Resumes TDI-II Plant Operations After Gas Leak Shutdown",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Limited has resumed operations at its TDI-II plant in Dahej on September 28, 2025, at 09:10 AM. The plant was shut down on September 19, 2025, due to a sudden gas leakage incident. The company completed necessary checks and remedial measures before restarting production. The company acknowledged the efforts of its employees, government agencies, and surrounding communities in facilitating the smooth and rapid restoration of operations.",
            "Sentiment": "positive",
            "PublishDate": 1759053288802,
            "Source": "stock"
        },
        {
            "Title": "GNFC Shuts Down TDI-II Plant at Dahej Following Minor Leakage",
            "Summary": "GNFC safely shut down its TDI-II plant at Dahej on September 19, 2025, due to a minor leakage incident. The company reported no damage or casualties from the incident.",
            "Sentiment": "neutral",
            "PublishDate": 1758500506412,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Narmada Valley Fertilizers Reports Leakage at TDI-II Plant, Shuts Down Operations",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Limited experienced a sudden leakage at its TDI-II Plant in Dahej on September 19, 2025, leading to an immediate precautionary shutdown. The company executed safe shutdown procedures promptly. The incident was contained within plant premises with no gas release beyond the boundary, no property damage, and no casualties. The TDI-II Plant will restart after completing necessary checks and remedial measures. No insurance claims are required due to the absence of property damage or losses.",
            "Sentiment": "neutral",
            "PublishDate": 1758284147663,
            "Source": "stock"
        },
        {
            "Title": "GNFC Reports Q1 FY26 Results with Production Shutdown Impact; TDI Prices Increased by Rs 12,000",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Limited held its quarterly earnings call discussing Q1 FY26 results. The company experienced significant production shutdowns during the quarter, impacting revenue by Rs 375 crores and bottom-line by Rs 148 crores. TDI production reached 16,000 metric tons for both plants combined, with the company maintaining expectations of 67,000 tons annually. The company increased TDI prices by Rs 12,000 effective August 1st, with 90% sales on contract basis and 10% spot sales. Fertilizer segment losses increased to Rs 100 crores due to lower urea production by 40,000 tons, energy under-recovery of Rs 13 crores, and higher repair costs of Rs 45 crores. The company expects energy and fixed cost revisions by Q3 FY26. Management confirmed no further plant shutdowns are expected for the rest of the year. Strategic consultant Kearney has been appointed for cost reduction initiatives and investment pathway planning, with implementation expected to begin in Q2.",
            "Sentiment": "neutral",
            "PublishDate": 1755000436059,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Narmada Valley Fertilizers & Chemicals Appoints Sanjeev Kumar as Additional Director",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Limited appointed Shri Sanjeev Kumar, IAS as an Additional Director on the company's Board effective August 11, 2025. Kumar is a 1998-batch IAS officer from Gujarat with a B.Tech from IIT Kharagpur and M.P.A. from University of Minnesota. He currently serves as Principal Secretary of the Forests & Environment Department, Government of Gujarat, bringing over 27 years of experience across finance, energy, petrochemicals, and environmental governance. Kumar has previously worked in various government departments and held leadership roles in state PSUs including GSPC Group, Gujarat Gas, and GSPL, while serving on boards of multiple national and state PSUs. He confirmed he has not been debarred from holding directorship by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1754917193709,
            "Source": "corporate_governance"
        },
        {
            "Title": "GNFC Plans Power Plant Launch in FY 2025-26 to Cut TDI Costs and Boost Dahej Margins",
            "Summary": "GNFC executive announced that the company's upcoming power plant launch in FY 2025-26 is expected to reduce operational costs for TDI production at the Dahej plant, which will enhance margins at the Dahej complex. The company also reported that production at the Bharuch complex has stabilized following the completion of its annual turnaround.",
            "Sentiment": "positive",
            "PublishDate": 1754492417957,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Narmada Valley Fertilizers Reports Lower Q1 Results Due to Annual Plant Turnaround",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Limited reported operating revenue of ₹1,601 crores in Q1 FY 25-26, down from ₹2,021 crores in the same quarter last year. Profit after tax declined to ₹78 crores from ₹115 crores year-on-year. The company attributed the lower performance to annual planned maintenance shutdown at its Bharuch complex during April, which impacted volumes and increased unproductive costs and repairs expenses. Both fertilizer and chemical segments faced challenges, with chemicals experiencing tough market conditions for products like TDI and Aniline. The company successfully extended Anti-Dumping Duty on Aniline till July 2030. Management noted significant cash flow improvement due to timely subsidy receipts and expects gradual improvements in Q2. Three projects are under execution including a coal-based power plant, ammonia expansion, and weak nitric acid capacity addition.",
            "Sentiment": "negative",
            "PublishDate": 1754486485846,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Narmada Valley Fertilizers & Chemicals Announces Board Changes with Two Director Appointments",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Limited announced changes to its Board of Directors on August 6, 2025. The company re-appointed Shri Bhadresh Mehta as an Independent Non-Executive Director for a second term of three consecutive years, effective from September 27, 2025 to September 26, 2028. Additionally, Shri Susanta Kumar Roy was appointed as an Additional Director in the Independent category for a three-year term from August 6, 2025 to August 5, 2028. Both appointments are subject to shareholder approval at the upcoming Annual General Meeting and were made based on recommendations from the Nomination and Remuneration Committee. Shri Bhadresh Mehta is a Chartered Accountant, Company Secretary and Cost Accountant with over 25 years of experience in finance, audit and information technology functions. Shri Susanta Kumar Roy brings over 40 years of experience in power station management from NTPC and the private power sector, including roles in operation, construction management, and board positions. Both directors confirmed they meet independence criteria under applicable regulations and have not been debarred from holding directorship positions.",
            "Sentiment": "positive",
            "PublishDate": 1754485633224,
            "Source": "corporate_governance"
        },
        {
            "Title": "GNFC Reports Sharp Decline in Q1 Financial Performance",
            "Summary": "GNFC reported significantly lower financial results for Q1. The company's EBITDA dropped to 310 million rupees compared to 1.53 billion rupees in the same period last year. EBITDA margin contracted to 1.94% from 7.57% year-over-year. Net profit decreased to 780 million rupees from 1.15 billion rupees previously. Revenue also declined to 16.01 billion rupees versus 20.2 billion rupees in the comparable period.",
            "Sentiment": "negative",
            "PublishDate": 1754478911865,
            "Source": "earnings"
        },
        {
            "Title": "DGTR Extends Anti-Dumping Duty on Chinese Aniline Imports for Five Years",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has extended anti-dumping duties on aniline imports from China for a five-year period. This measure is designed to protect the domestic industry, with Gujarat Narmada Valley Fertilizers & Chemicals being among the beneficiaries of this trade protection.",
            "Sentiment": "positive",
            "PublishDate": 1753068896864,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Narmada Valley Fertilizers & Chemicals: Q4 Profit Surges 62%, Stock Jumps",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Ltd. reported a 62.3% increase in Q4 net profit to Rs 211 crore. Consolidated revenue decreased by 2.6% to Rs 2,055 crore. EBITDA rose 65.5% to Rs 240 crore, with margin expanding to 11.7%. The company's share price surged 6.93% following the results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1748233209000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Narmada Valley Fertilizers & Chemicals Reports Q4 Results and Dividend",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals announced its Q4 results. The company reported a net profit of 2.1 billion rupees, up from 1.3 billion rupees year-over-year and 1.6 billion rupees quarter-over-quarter. Q4 revenue was 20.6 billion rupees, slightly down from 21 billion rupees in the same quarter last year. The company has recommended a dividend of 18 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748223255000,
            "Source": "default"
        },
        {
            "Title": "Gujarat Narmada Valley Fertilizers & Chemicals Reports Q4 Results and Dividend",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals announced its Q4 financial results. The company's EBITDA increased to 2.4 billion rupees from 1.45 billion rupees year-over-year, with EBITDA margin improving to 11.68% from 6.87%. Net profit rose to 2.1 billion rupees from 1.3 billion rupees year-over-year and 1.6 billion rupees quarter-over-quarter. Revenue slightly decreased to 20.6 billion rupees from 21 billion rupees year-over-year. The company has recommended a dividend of 18 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748008759000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Narmada Valley Fertilizers & Chemicals Ltd: Q4 Net Profit Surges 65% to ₹210 Crore",
            "Summary": "GNFC reported a 65.4% YoY increase in Q4 net profit to ₹210 crore. EBITDA rose 65.5% to ₹240 crore, with margins improving to 11.7%. Revenue slightly declined by 2.6% to ₹2,055 crore.",
            "Sentiment": "positive",
            "PublishDate": 1748008313000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Narmada Valley Fertilizers & Chemicals to Install New Weak Nitric Acid Plant",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals has entered into an agreement with TKUIPL for the supply of a Weak Nitric Acid-III plant on an LEPC (Lump Sum Turnkey Engineering, Procurement, and Construction) basis. The new plant will be based on Thyssenkrupp Uhde technology and is expected to strengthen the company's market presence for weak nitric acid in India.",
            "Sentiment": "positive",
            "PublishDate": 1742861532000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Narmada Valley Fertilizers & Chemicals Ltd: Awards Contract for New Nitric Acid Plant",
            "Summary": "GNFC has awarded a contract to thyssenkrupp Udhe India Private Ltd for a 2,00,000-MTPA weak nitric acid plant. This will increase GNFC's nitric acid production capacity by 57%, supporting downstream operations and indigenization efforts.",
            "Sentiment": "positive",
            "PublishDate": 1742816359000,
            "Source": "order&deals"
        },
        {
            "Title": "Gujarat Narmada Valley Fertilizers & Chemicals to Expand Weak Nitric Acid Production",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals (GNFC) has signed an agreement with TKUIPL for the supply of a Weak Nitric Acid-III plant on an LEPC (Lump Sum Turnkey Engineering, Procurement, and Construction) basis. This new plant, based on ThyssenKrupp Uhde technology, aims to strengthen GNFC's market presence for weak nitric acid in India.",
            "Sentiment": "positive",
            "PublishDate": 1742815402000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Narmada Valley Fertilizers & Chemicals to Install New Weak Nitric Acid Plant",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals (GNFC) has signed an agreement with TKUIPL for the supply of a Weak Nitric Acid-III Plant on an LEPC (Lump Sum Turnkey Engineering, Procurement, and Construction) basis. The new plant will utilize ThyssenKrupp Uhde technology, aiming to strengthen GNFC's market presence for weak nitric acid in India.",
            "Sentiment": "positive",
            "PublishDate": 1742815295000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Narmada Valley Fertilizers & Chemical Reports Q3 Financial Results",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemical announced its Q3 financial results. The company reported a net profit of 1.58 billion rupees, up from 950 million rupees in the same quarter last year. However, revenue decreased to 18.99 billion rupees from 20.88 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739751611000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Narmada Valley Fertilizers & Chemical Reports Strong Q3 Financial Performance",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemical has reported significant improvements in its financial performance for the third quarter. The company's EBITDA increased to 1.32 billion rupees, up from 840 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin expanded to 6.95% from 4.02% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1739534072000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Narmada Valley Fertilizers & Chemical Reports Q3 Financial Results",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemical announced its Q3 financial results. The company reported a net profit of 1.58 billion rupees, up from 950 million rupees in the same quarter last year. However, revenue decreased to 18.99 billion rupees from 20.88 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739534065000,
            "Source": "earnings"
        },
        {
            "Title": "GNFC to Consider Q3 Results on February 14",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Limited (GNFC) has announced that it will consider its third quarter results on February 14. This indicates the company is preparing to release its financial performance for the latest quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738847278000,
            "Source": "earnings"
        },
        {
            "Title": "Sunset Review Anti-Dumping Investigation on TDI Imports from EU and Saudi Arabia",
            "Summary": "A sunset review anti-dumping investigation has been initiated on imports of Toluene Di-Isocyanate (TDI) originating from or exported by the European Union and Saudi Arabia. This investigation affects Gujarat Narmada Valley Fertilizers & Chemicals Limited (GNFC), likely due to its involvement in the TDI market.",
            "Sentiment": "neutral",
            "PublishDate": 1735789436000,
            "Source": "corporate_action"
        },
        {
            "Title": "INEOS and GNFC to Explore Building New Acetic Acid Plant in India",
            "Summary": "INEOS Acetyls and Gujarat Narmada Valley Fertilizers & Chemicals Limited (GNFC) have signed a Memorandum of Understanding to explore the feasibility of constructing a new world-scale acetic acid plant. The proposed facility would have a capacity of 600,000 tonnes per year and would be located at GNFC's site in Bharuch, Gujarat, India.",
            "Sentiment": "positive",
            "PublishDate": 1732107871000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Narmada Valley Fertilizers & Chemical Reports Q2 Financial Results",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemical has announced its Q2 financial results. The company's EBITDA for the quarter was 900 million rupees, down from 1.69 billion rupees in the same quarter last year. The EBITDA margin also decreased to 4.69% from 8.13% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731502242000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Narmada Valley Fertilizers & Chemical Reports Q2 Revenue Decline",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemical has reported a revenue of 19.2 billion rupees for the second quarter, down from 20.8 billion rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731502104000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Narmada Valley Fertilizers & Chemical Reports Q2 Profit Decline",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemical has reported a net profit of 1 billion rupees for the second quarter, showing a decrease from 1.78 billion rupees in the same quarter last year. However, it represents a slight increase from 1.15 billion rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1731502055000,
            "Source": "result"
        }
    ]
}