{
    "Symbol": "GOACARBON",
    "ISIN": "INE426D01013",
    "News": [
        {
            "Title": "Goa Carbon Q3 FY26 Loss Widens to ₹23.37 Crores",
            "Summary": "Goa Carbon reported a net loss of ₹23.37 crores for Q3 FY26 vs ₹8.34 crores loss in Q3 FY25, despite revenue growth of 49.5% to ₹193.58 crores. Plant shutdowns impacted operations.",
            "Sentiment": "negative",
            "PublishDate": 1768996217951,
            "Source": "co_actions_results"
        },
        {
            "Title": "Goa Carbon Board Meet on Jan 21 for Q3FY26 Results",
            "Summary": "Goa Carbon Limited has scheduled a board meeting on January 21, 2026, to consider and approve unaudited financial results for the quarter ended December 31, 2025, as per SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768198963901,
            "Source": "co_actions_results"
        },
        {
            "Title": "Goa Carbon Gets BBB+ Rating from Acuité on ₹500 Cr Facilities",
            "Summary": "Acuité Ratings assigned BBB+ long-term and A2 short-term ratings with stable outlook on Goa Carbon's enhanced ₹500 crore bank facilities, reflecting the company's credit profile.",
            "Sentiment": "positive",
            "PublishDate": 1767023615617,
            "Source": "stocks"
        },
        {
            "Title": "Goa Carbon Receives Rs 0.76 Crore Tax Refund Following High Court Order",
            "Summary": "Goa Carbon Limited received a tax refund of Rs 0.76 crore from the Income Tax Department for Assessment Year 2010-11, following a consequential order that adjusted opening stock based on a Bombay High Court ruling for the previous year. The refund resulted from reduced taxable profits after stock adjustments were made in compliance with the court's decision.",
            "Sentiment": "positive",
            "PublishDate": 1764916260299,
            "Source": "stock"
        },
        {
            "Title": "Goa Carbon Receives Rs 7.61 Crores Tax Refund from Income Tax Department",
            "Summary": "Goa Carbon Limited received two tax refund orders totaling Rs 7.61 crores including interest - Rs 5.29 crores for Assessment Year 1999-2000 following a favorable High Court order, and Rs 2.32 crores for Assessment Year 2009-10 based on CIT(A) orders. The refunds relate to previously disallowed deductions under Section 80HHC of the Income Tax Act that were later overturned by appellate authorities.",
            "Sentiment": "positive",
            "PublishDate": 1764161892981,
            "Source": "stock"
        },
        {
            "Title": "Goa Carbon Temporarily Shuts Down Goa Unit for Maintenance Work",
            "Summary": "Goa Carbon Limited has temporarily shut down operations at its Goa Unit located at St. Jose de Areal, Salcete-Goa for maintenance work starting November 12, 2025. The company informed stock exchanges BSE and NSE about this operational shutdown through an official communication signed by Company Secretary Pravin Satardekar.",
            "Sentiment": "neutral",
            "PublishDate": 1762962539166,
            "Source": "stock"
        },
        {
            "Title": "Goa Carbon Seeks Shareholder Approval for Director Re-appointment and Increased Borrowing Limits",
            "Summary": "Goa Carbon Limited has issued a postal ballot notice seeking shareholder approval for three special resolutions. The company proposes to re-appoint Mr. Subodh Nadkarni as Independent Director for a second five-year term from January 7, 2026 to January 6, 2031. Additionally, the company seeks to increase its borrowing powers from Rs. 500 crores to Rs. 750 crores, superseding the previous resolution from July 2018. The third resolution authorizes the Board to create charges on company assets to secure these borrowings up to Rs. 750 crores. Remote e-voting will commence on November 15, 2025 at 9:00 AM and end on December 15, 2025 at 5:00 PM, with results to be declared by December 17, 2025. Mr. Nadkarni holds a Bachelor's degree in Commerce and has over 40 years of experience in finance, commerce, and international operations.",
            "Sentiment": "neutral",
            "PublishDate": 1762766749017,
            "Source": "corporate_action"
        },
        {
            "Title": "Goa Carbon Appoints Ms. Kshama Fernandes as Independent Director for Five-Year Term",
            "Summary": "Goa Carbon Limited appointed Ms. Kshama Fernandes as an Independent Director for a five-year term from July 7, 2025 to July 6, 2030. The appointment was approved by shareholders at the company's 57th Annual General Meeting held on September 9, 2025. Ms. Fernandes holds DIN 02539429. The company announced the voting results and stated that her brief profile and other requisite details were previously disclosed to stock exchanges on July 7, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757495586244,
            "Source": "corporate_governance"
        },
        {
            "Title": "Goa Carbon Resumes Operations at Goa Manufacturing Unit",
            "Summary": "Goa Carbon has resumed operations at its Goa unit starting September 5. The company had previously halted operations at this facility and has now restarted manufacturing activities.",
            "Sentiment": "positive",
            "PublishDate": 1757068275904,
            "Source": "stock"
        },
        {
            "Title": "Goa Carbon Settles Legal Case for Rs 11 Lakh Compensation",
            "Summary": "Goa Carbon Limited has settled a legal case with the spouse of a contractor's worker for Rs. 11,00,000 as compensation under the Employees' Compensation Act, 1923. The case has been disposed of by the Labour Court in Bilaspur, Chhattisgarh. The company stated that the settlement does not adversely affect its financials, going concern ability, or other activities.",
            "Sentiment": "neutral",
            "PublishDate": 1755191260845,
            "Source": "stock"
        },
        {
            "Title": "Goa Carbon Reports Net Loss of ₹795 Lakhs in Q1 FY2026 Despite 56% Revenue Growth",
            "Summary": "Goa Carbon Limited reported a net loss of ₹795.25 lakhs for the quarter ended June 30, 2025, compared to a net profit of ₹298.44 lakhs in the same quarter last year. Total income increased to ₹20,096.85 lakhs from ₹13,132.99 lakhs year-on-year, driven by higher product sales of ₹19,921.76 lakhs versus ₹12,760.52 lakhs. However, the company faced significantly higher material costs of ₹22,639.23 lakhs compared to ₹11,035.23 lakhs in the previous year. Basic earnings per share stood at negative ₹8.69 compared to positive ₹3.26 in the corresponding quarter. The company operates solely in manufacturing and sale of Calcined Petroleum Coke and has no subsidiaries. Goa Carbon is dealing with ongoing legal matters including a Supreme Court case regarding Goa Green Cess where it has deposited ₹349 lakhs under protest, and a recent High Court victory that quashed an income tax assessment order demanding ₹7,371 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1755092143344,
            "Source": "earnings"
        },
        {
            "Title": "Goa Carbon Shareholders Approve Re-appointment of Anupam Misra as Executive Director",
            "Summary": "Goa Carbon Limited shareholders approved the re-appointment of Mr. Anupam Misra as Whole-time Director and Executive Director for a two-year term effective May 28, 2025. The special resolution was passed through postal ballot via remote e-voting with 99.996% votes in favor and only 0.004% against. The e-voting process ran from June 28 to July 28, 2025, with 101 ballots supporting the resolution and 7 opposing it. Out of 30,009 total shareholders as of the cut-off date of June 20, 2025, the voting saw participation across promoter groups, public institutions, and non-institutional public shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1753778963398,
            "Source": "corporate_governance"
        },
        {
            "Title": "Goa Carbon Announces Temporary Shutdown of Goa Unit",
            "Summary": "Goa Carbon has announced a temporary shutdown of its Goa unit for maintenance purposes. The shutdown is scheduled to begin on June 9, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1749448692000,
            "Source": "default"
        },
        {
            "Title": "Goa Carbon Reports Q4 Financial Results",
            "Summary": "Goa Carbon has reported its Q4 financial results. The company experienced an EBITDA loss of 48 million rupees, compared to a gain of 139 million rupees in the same quarter last year. The net loss for Q4 was 65 million rupees, an improvement from the 93.6 million rupees loss in the previous year, but a decline from the 83 million rupees loss in the previous quarter. Revenue for Q4 stood at 1.32 billion rupees, down from 1.78 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1746627912000,
            "Source": "result"
        },
        {
            "Title": "Goa Carbon Resumes Operations at Goa Unit",
            "Summary": "Goa Carbon has announced the resumption of operations at its Goa unit. The company expects normal production levels to be restored shortly at this facility.",
            "Sentiment": "positive",
            "PublishDate": 1738928314000,
            "Source": "corporate_action"
        },
        {
            "Title": "Goa Carbon Resumes Operations at Paradeep Unit",
            "Summary": "Goa Carbon Limited has announced the resumption of operations at its Paradeep unit. This development indicates a return to normal production activities at the facility, which is likely to have a positive impact on the company's overall operations and output.",
            "Sentiment": "positive",
            "PublishDate": 1738754962000,
            "Source": "corporate_action"
        },
        {
            "Title": "Goa Carbon Reports Q3 Net Loss of 83 Million Rupees",
            "Summary": "Goa Carbon has reported a net loss of 83 million rupees for the third quarter, which is an improvement from the 346 million rupee loss in the same quarter last year. However, it represents a decline from the previous quarter's loss of 101 million rupees. The company's revenue for Q3 stood at 1.29 billion rupees, significantly lower than the 2.7 billion rupees reported in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1738284234000,
            "Source": "earnings"
        },
        {
            "Title": "Goa Carbon Reports Q3 EBITDA Loss",
            "Summary": "Goa Carbon Limited has reported an EBITDA loss of 85 million rupees for the third quarter, compared to a gain of 472 million rupees in the same period last year. This represents a significant year-over-year decline in the company's operational performance.",
            "Sentiment": "negative",
            "PublishDate": 1738245896000,
            "Source": "earnings"
        },
        {
            "Title": "Goa Carbon Reports Q3 Financial Results",
            "Summary": "Goa Carbon has reported its financial results for the third quarter. The company posted a net loss of 83 million rupees, which is an improvement compared to the loss of 346 million rupees in the same quarter last year. However, it represents a decline from the previous quarter's loss of 101 million rupees. The company's revenue for Q3 stood at 1.29 billion rupees, significantly lower than the 2.7 billion rupees reported in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738245809000,
            "Source": "earnings"
        },
        {
            "Title": "Goa Carbon Ltd: Bilaspur Unit Resumes Operations",
            "Summary": "Goa Carbon's Bilaspur unit in Chhattisgarh resumed operations on January 1, 2024. The unit, with a capacity of 40,000 TPA of Calcined Petroleum Coke, is the smallest of the company's three plants. The company's shares jumped 9.2% to ₹760.45 following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1735790434000,
            "Source": "normal_news"
        },
        {
            "Title": "Goa Carbon Resumes Operations at Bilaspur Unit",
            "Summary": "Goa Carbon Limited has announced the resumption of operations at its Bilaspur unit. This development indicates that the company has overcome any previous issues or maintenance that may have caused a temporary halt in production at this facility.",
            "Sentiment": "positive",
            "PublishDate": 1735733684000,
            "Source": "corporate_action"
        },
        {
            "Title": "Goa Carbon Reports Q2 Financial Results",
            "Summary": "Goa Carbon has reported a net loss of 101 million rupees for the second quarter, which is an improvement from the 290 million rupee loss in the same quarter last year. However, it represents a decline from the previous quarter's loss of 29.8 million rupees. The company's revenue for Q2 stood at 1.2 billion rupees, down from 2.2 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731067738000,
            "Source": "result"
        },
        {
            "Title": "Goa Carbon Resumes Operations at Bilaspur Unit",
            "Summary": "<p>Goa Carbon Limited has announced the <span class='positive'>resumption of operations</span> at its Bilaspur unit. This indicates that the company has <span class='positive'>overcome</span> any previous issues or maintenance that may have caused a <span class='neutral'>temporary halt</span> in production at this facility.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728279203000,
            "Source": "corporate_action"
        }
    ]
}