{
    "Symbol": "GOCLCORP",
    "ISIN": "INE077F01035",
    "News": [
        {
            "Title": "GOCL Corporation Q3FY26 Results Show Strong Growth",
            "Summary": "GOCL Corporation reported consolidated net profit of Rs. 21,027.21 lakhs for Q3FY26, driven by significant gains from discontinued operations and divestment activities.",
            "Sentiment": "positive",
            "PublishDate": 1770826225802,
            "Source": "co_actions_results"
        },
        {
            "Title": "GOCL Corp Board Approves Merger with HNPCL",
            "Summary": "GOCL Corporation's board approved merger scheme with Hinduja National Power Corporation Limited with share exchange ratio of 206:10,000, subject to shareholder approvals.",
            "Sentiment": "positive",
            "PublishDate": 1765800811938,
            "Source": "co_actions_results"
        },
        {
            "Title": "GOCL Corporation Confirms December 15 Board Meeting for HNPCL Merger",
            "Summary": "GOCL Corporation has officially confirmed its December 15 board meeting to consider the merger scheme with Hinduja National Power Corporation Limited under Companies Act provisions.",
            "Sentiment": "neutral",
            "PublishDate": 1765381681430,
            "Source": "co_actions_results"
        },
        {
            "Title": "GOCL Corporation's Credit Ratings Reaffirmed Under Rating Watch with Developing Implications",
            "Summary": "Infomerics Valuation and Rating reaffirmed GOCL Corporation's credit ratings for long-term bank facilities of Rs. 15 crores at IVR A/RWD and short-term facilities of Rs. 1,445 crores at IVR A1/RWD. Both ratings continue to remain under rating watch with developing implications, indicating ongoing evaluation of the company's creditworthiness.",
            "Sentiment": "neutral",
            "PublishDate": 1764230813601,
            "Source": "stock"
        },
        {
            "Title": "Apollo Micro Systems Completes Acquisition of IDL Explosives Limited Through Subsidiary",
            "Summary": "Apollo Defence Industries Private Limited, a subsidiary of Apollo Micro Systems Limited, has completed the 100% acquisition of IDL Explosives Limited from GOCL Corporation Limited, making IDL a step-down subsidiary. The acquisition strengthens Apollo Group's defence sector capabilities by adding next-generation defence-grade explosives, propellants and warhead systems to its existing weapon system electronics expertise, with strategic consolidation expected to commence from Q3 FY2026.",
            "Sentiment": "positive",
            "PublishDate": 1763373895404,
            "Source": "order&deals"
        },
        {
            "Title": "GOCL Corporation Shareholders Approve Registered Office Shift from Telangana to Andhra Pradesh",
            "Summary": "GOCL Corporation Limited shareholders approved two special resolutions through postal ballot on November 12, 2025, including shifting the company's registered office from Telangana to Andhra Pradesh and amendments to the Memorandum of Association. The resolutions were passed with requisite majority through remote e-voting, with 99.9979% votes in favor and only 0.0021% against for both proposals.",
            "Sentiment": "positive",
            "PublishDate": 1763108631418,
            "Source": "corporate_action"
        },
        {
            "Title": "GOCL Corporation Reports Strong Q2 Results with Major Land Sale and Subsidiary Divestment",
            "Summary": "GOCL Corporation approved quarterly results for the second quarter and half year ended September 30, 2025, featuring significant gains from land sales totaling Rs. 1,955.18 lakhs and Rs. 1,37,121.69 lakhs from continuing and discontinued operations respectively. The company completed divestment of its wholly-owned subsidiary IDL Explosives Limited to Apollo Defence Industries for Rs. 10,700 lakhs and sold 142.65 acres of its Kukatpally land under the MoU with Squarespace Builders.",
            "Sentiment": "positive",
            "PublishDate": 1763058121675,
            "Source": "earnings"
        },
        {
            "Title": "GOCL Corp Reports 159% Jump in Q2 Consolidated Net Profit Despite Revenue Decline",
            "Summary": "GOCL Corp's Q2 consolidated net profit surged to 140 million rupees from 54 million rupees year-on-year, marking a significant 159% increase. However, the company's total income declined to 557 million rupees from 616 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1763048122810,
            "Source": "earnings"
        },
        {
            "Title": "GOCL Corporation Seeks Shareholder Approval to Relocate Registered Office from Telangana to Andhra Pradesh",
            "Summary": "GOCL Corporation Limited has issued a postal ballot notice seeking shareholder approval for two special resolutions. The first resolution involves shifting the company's registered office from Telangana to Andhra Pradesh and making consequential amendments to the Memorandum of Association. The second resolution proposes amendments to the company's Memorandum of Association to align with the Companies Act, 2013. The e-voting period runs from October 14, 2025 to November 12, 2025, with results to be announced by November 14, 2025. The company has discontinued its Detonators & Accessories business and is divesting its wholly owned subsidiary IDL Explosives Limited. GOCL is currently engaged in Electronics Manufacturing Service and Realty businesses. The Board has approved the acquisition of thermal power business from Hinduja National Power Corporation Limited, with power plants located in Andhra Pradesh near Visakhapatnam. The company believes relocating the registered office will provide better logistics, port facility access, improved coal sourcing efficiency, and enhanced operational convenience.",
            "Sentiment": "neutral",
            "PublishDate": 1760342692224,
            "Source": "corporate_action"
        },
        {
            "Title": "GOCL Corporation's IDL Explosives Ban Reduced to 1 Year, Becomes Eligible for Coal India and PSU Tenders",
            "Summary": "A court has reduced the ban on IDL Explosives, a subsidiary of GOCL Corporation, to one year. Following this court decision, IDL Explosives is now eligible to participate in future tenders from Coal India and other public sector undertakings (PSUs).",
            "Sentiment": "positive",
            "PublishDate": 1757508619499,
            "Source": "stock"
        },
        {
            "Title": "GOCL Corporation Completes Sale of 142 Acres in Hyderabad, Gets Extension for Remaining Land",
            "Summary": "GOCL Corporation has completed the sale of 142 acres of land in Kukatpally, Hyderabad, from its total holding of 264.50 acres. The company has received an extension until August 2026 for the sale of the remaining land portion.",
            "Sentiment": "positive",
            "PublishDate": 1756971934049,
            "Source": "stock"
        },
        {
            "Title": "Gocl Corp Board Approves Acquisition of Hinduja National Power's 1,040 MW Thermal Power Plant",
            "Summary": "Gocl Corp's board has given in-principle approval for the acquisition of Hinduja National Power's 1,040 MW thermal power operations located near Visakhapatnam. The board's approval represents the initial step in the acquisition process for the thermal power facility.",
            "Sentiment": "positive",
            "PublishDate": 1756686492564,
            "Source": "order&deals"
        },
        {
            "Title": "GOCL Corp Approves Acquisition Plan for Hinduja National Power's 1,040 MW Thermal Power Operations",
            "Summary": "GOCL Corp has approved a plan to acquire Hinduja National Power's thermal power operations with a capacity of 1,040 MW located near Visakhapatnam. The acquisition represents GOCL Corp's expansion into the power generation sector through this thermal power asset purchase.",
            "Sentiment": "positive",
            "PublishDate": 1756475738896,
            "Source": "order&deals"
        },
        {
            "Title": "GOCL Corp Reports 43% Jump in Quarterly Net Profit Despite Revenue Decline",
            "Summary": "GOCL Corp announced consolidated net profit of 537 million rupees compared to 375 million rupees in the same period last year, marking a significant increase. However, total revenue decreased to 865 million rupees from 1.2 billion rupees year-over-year, indicating mixed quarterly performance with improved profitability amid lower sales.",
            "Sentiment": "neutral",
            "PublishDate": 1755013790540,
            "Source": "earnings"
        },
        {
            "Title": "GOCL Corporation Reports Exceptional Quarterly Results with Rs 1,22,254 Crores Net Profit",
            "Summary": "GOCL Corporation Limited reported consolidated net profit after tax of Rs 1,22,254.53 lakhs for the quarter ended June 30, 2025, compared to Rs 3,624.95 lakhs in the same quarter last year. The exceptional performance was primarily driven by discontinued operations which contributed Rs 1,16,882.05 lakhs profit after tax, mainly from land sales. The company sold 4.15 acres of land under joint development agreement and 114.85 acres of remaining land, recognizing gains of Rs 1,955.16 lakhs and Rs 1,37,121.69 lakhs respectively. Revenue from operations stood at Rs 339.18 lakhs. The company divested its entire equity shareholding in IDL Explosives Limited to Apollo Defence Industries Private Limited for Rs 10,700 lakhs, receiving Rs 3,500 lakhs during the quarter. Earnings per share for continuing and discontinued operations was Rs 246.62. The company also disbursed final dividend of Rs 10 per equity share aggregating Rs 4,957.25 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1755013362933,
            "Source": "earnings"
        },
        {
            "Title": "GOCL Corporation Director Sudhanshu Kumar Tripathi Retires by Rotation, Chooses Not to Seek Reappointment",
            "Summary": "Mr. Sudhanshu Kumar Tripathi, Non-Executive Non-Independent Director of GOCL Corporation Limited, retired by rotation at the company's 64th Annual General Meeting held on August 01, 2025. Tripathi chose not to seek reappointment to the board. The Board of Directors expressed appreciation for his leadership and guidance in the company's growth and transformation. GOCL Corporation is listed on BSE with scrip code 506480 and on NSE with symbol GOCLCORP.",
            "Sentiment": "neutral",
            "PublishDate": 1754052108487,
            "Source": "corporate_governance"
        },
        {
            "Title": "GOCL Corporation Reports Total Income of ₹1,030 Crores, Recommends 500% Dividend",
            "Summary": "GOCL Corporation shared its annual results presentation showing total income of ₹1,030 crores for FY25, with profit before tax at ₹217 crores and profit after tax at ₹157 crores. The company reported earnings per share of ₹31.71 and the Board recommended a dividend of ₹10 per share (500%). The Energetics segment generated income of ₹175.27 crores including land sale revenue, while the Bulk and Cartridge Explosives business achieved turnover of ₹541 crores under its subsidiary, though it faced margin pressure from volatile raw material costs and loss of a major PSU customer. The Electronics Manufacturing Service business recorded income of ₹8.22 crores. The company completed sale of approximately 142 acres from its 264.50 acres land bank at Kukatpally, Hyderabad, with proceeds deployed in inter-corporate loans and deposits. Export sales reached ₹39.03 crores despite subdued economic conditions in export markets. GOCL decided to fully disinvest from subsidiary IDL Explosives Limited, which reported a loss of ₹18.43 crores. The company is scaling up EMS facilities near Hyderabad and considering future business direction given the financial resources from land monetization.",
            "Sentiment": "neutral",
            "PublishDate": 1754051064140,
            "Source": "corporate_action"
        },
        {
            "Title": "GOCL Corp Reports Q4 Results and Dividend Recommendation",
            "Summary": "GOCL Corp has announced its quarterly results. The consolidated net profit for Q4 is 231 million rupees, compared to 49 million rupees in the same quarter last year. Revenue for Q4 is 1.4 billion rupees, down from 1.58 billion rupees in the previous year's corresponding quarter. The company has also recommended a dividend of 10 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747955883000,
            "Source": "default"
        },
        {
            "Title": "GOCL Corp Reports Q4 Results and Dividend Recommendation",
            "Summary": "GOCL Corp has announced its quarterly results and dividend recommendation. The company's consolidated net profit for Q4 is 231 million rupees, compared to 49 million rupees year-over-year and 924 million rupees quarter-over-quarter. Q4 revenue stands at 1.4 billion rupees, down from 1.58 billion rupees in the same quarter last year. Additionally, the company has recommended a dividend of 10 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747916078000,
            "Source": "result"
        },
        {
            "Title": "GOCL Corporation Approves Sale of IDL Explosives to Apollo Defence Industries",
            "Summary": "GOCL Corporation's board has approved the disinvestment of IDL Explosives. Apollo Defence Industries will acquire IDL Explosives for a consideration of 1.07 billion rupees. This sale involves the transfer of the entire equity of IDLEL (IDL Explosives Limited).",
            "Sentiment": "positive",
            "PublishDate": 1746403519000,
            "Source": "default"
        },
        {
            "Title": "GOCL Corporation: Sells IDL Explosives Subsidiary for ₹107 Crore",
            "Summary": "GOCL Corporation approved the sale of its wholly-owned subsidiary IDL Explosives Ltd for ₹107 crore. The transaction requires shareholder approval via postal ballot and is expected to complete within 2-3 months. IDL Explosives contributed 87% of GOCL's consolidated turnover in FY24 but only 0.71% of net worth.",
            "Sentiment": "neutral",
            "PublishDate": 1746202930000,
            "Source": "corporate_action"
        },
        {
            "Title": "GOCL Corporation to Divest IDL Explosives to Apollo Defence Industries",
            "Summary": "GOCL Corporation's board has approved the disinvestment of IDL Explosives. Apollo Defence Industries will acquire IDL Explosives for a consideration of 1.07 billion rupees, which represents the entire equity of IDLEL.",
            "Sentiment": "neutral",
            "PublishDate": 1746193343000,
            "Source": "default"
        },
        {
            "Title": "GOCL Corporation Reports Significant Increase in Q3 Net Profit",
            "Summary": "GOCL Corporation has announced its financial results for the third quarter. The company's consolidated net profit has risen substantially to 924 million rupees, compared to 154 million rupees in the same period last year. However, revenue for Q3 decreased to 1.38 billion rupees from 1.67 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1739492324000,
            "Source": "earnings"
        },
        {
            "Title": "GOCL Corporation Reports Significant Profit Increase in Q3",
            "Summary": "GOCL Corporation has reported a substantial increase in its consolidated net profit for the third quarter, rising to 924 million rupees from 154 million rupees in the same period last year. However, the company's revenue decreased to 1.38 billion rupees from 1.67 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739441742000,
            "Source": "earnings"
        },
        {
            "Title": "GOCL Corporation Monetizes 11 Acres of Hyderabad Land for 1.42 Billion Rupees",
            "Summary": "GOCL Corporation has successfully monetized 11 acres of land in Hyderabad for a sum of 1.42 billion rupees. This land monetization represents a significant corporate action, potentially impacting the company's financial position and asset portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1733357017000,
            "Source": "corporate_action"
        },
        {
            "Title": "GOCL Corporation Monetizes 11 Acres of Hyderabad Land for 1.42 Billion Rupees",
            "Summary": "GOCL Corporation has successfully monetized 11 acres of land in Hyderabad, India, for a sum of 1.42 billion rupees (approximately $17.1 million USD). This land sale represents a significant corporate action, potentially improving the company's financial position and providing capital for future investments or operations.",
            "Sentiment": "positive",
            "PublishDate": 1733321033000,
            "Source": "corporate_action"
        },
        {
            "Title": "GOCL Corp to Cease Detonators and Blasting Devices Manufacturing in Hyderabad",
            "Summary": "GOCL Corporation has made the decision to discontinue the production of detonators and blasting devices at its factory located in Hyderabad. This move represents a significant change in the company's operational strategy and may have implications for its business model and workforce.",
            "Sentiment": "negative",
            "PublishDate": 1732839707000,
            "Source": "corporate_action"
        },
        {
            "Title": "GOCL Corporation to Cease Detonators and Blasting Devices Manufacturing in Hyderabad",
            "Summary": "GOCL Corporation has made the decision to discontinue its manufacturing operations for detonators and blasting devices at its factory located in Hyderabad. This move represents a significant change in the company's operational strategy and may have implications for its business model and workforce.",
            "Sentiment": "neutral",
            "PublishDate": 1732798510000,
            "Source": "corporate_action"
        },
        {
            "Title": "GOCL Corp Reports Significant Decline in Q2 Profit",
            "Summary": "GOCL Corporation has reported a substantial decrease in its consolidated net profit for the second quarter. The profit dropped to 54 million rupees from 157 million rupees year-over-year, and from 362 million rupees quarter-over-quarter. The company's revenue also declined to 1.3 billion rupees from 1.63 billion rupees compared to the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1731073709000,
            "Source": "result"
        }
    ]
}