{
    "Symbol": "GOCOLORS",
    "ISIN": "INE0BJS01011",
    "News": [
        {
            "Title": "Go Fashion Board to Consider Q3FY26 Results & Buyback",
            "Summary": "Go Fashion (India) Limited has revised its board meeting agenda for January 29, 2026, to include consideration of Q3FY26 unaudited financial results and a proposal for equity share buyback.",
            "Sentiment": "neutral",
            "PublishDate": 1769430251317,
            "Source": "co_actions_results"
        },
        {
            "Title": "Go Colors Stake Reduced by Mirae Asset Mutual Fund",
            "Summary": "Mirae Asset Mutual Fund reduces its shareholding in Go Colors from 0.79% to 0.37% through open market sale of 229,470 shares on January 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768392503366,
            "Source": "co_actions_results"
        },
        {
            "Title": "Go Colors Promoter Pledges 12L Shares to Banks",
            "Summary": "Go Fashion (India) promoter Rahul Saraogi pledged 12 lakh equity shares to Kotak Mahindra Bank and IndusInd Bank on December 10, 2025, representing 2.22% of total share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1765446815451,
            "Source": "stocks"
        },
        {
            "Title": "Go Colors Shares Pledged Worth ₹20.4 Crores",
            "Summary": "Rahul Saraogi pledged 20.4 lakh equity shares of Go Fashion (India) Limited with Catalyst Trusteeship as security trustee, increasing total encumbered holding to 8.67% of share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1765422886965,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICRA Upgrades GoFashion's Credit Rating Outlook to Positive",
            "Summary": "ICRA Limited reaffirmed GoFashion (India) Limited's credit ratings across short-term and long-term instruments totaling Rs. 225 crore while upgrading the outlook from Stable to Positive. The rating actions cover unallocated limits of Rs. 20 crore (ICRA [A1]), letter of credit facilities of Rs. 146 crore (ICRA [A1]), and cash credit of Rs. 59 crore (ICRA [A] Positive).",
            "Sentiment": "positive",
            "PublishDate": 1763729437596,
            "Source": "stock"
        },
        {
            "Title": "GoFashion Corrects Appointment Date for New Independent Director Sakshi Vijay Chopra",
            "Summary": "GoFashion (India) Limited issued a corrigendum to correct the effective appointment date of Ms. Sakshi Vijay Chopra as Non-Executive Independent Director from November 7, 2025 to November 17, 2025. The appointment is for a five-year term until November 16, 2030, with Ms. Chopra bringing experience from PeakXV (previously Sequoia) and advisory roles across consumer and fintech companies.",
            "Sentiment": "neutral",
            "PublishDate": 1763386000976,
            "Source": "corporate_governance"
        },
        {
            "Title": "GoFashion Reports 7% Revenue Growth to INR 224 Crores in Q2 FY26, Cuts Store Expansion Target",
            "Summary": "GoFashion (India) Limited reported quarterly revenue of INR 224 crores with 7% year-on-year growth, while EBITDA grew 5% to INR 67 crores and PAT increased 6% to INR 22 crores. The company revised its annual store expansion guidance from 120 stores to 80-90 stores due to muted same-store sales growth and cautious approach amid market conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1763105871485,
            "Source": "earnings"
        },
        {
            "Title": "GO Fashion Reports Q2 Revenue Growth to 2.2 Billion Rupees with Higher Net Profit",
            "Summary": "GO Fashion reported Q2 revenue of 2.2 billion rupees compared to 2.15 billion rupees in the same quarter last year. The company's net profit increased to 218 million rupees from 206 million rupees year-over-year. EBITDA rose to 666 million rupees from 636 million rupees, though the EBITDA margin declined slightly to 29.7% from 30.5% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762499089463,
            "Source": "earnings"
        },
        {
            "Title": "Go Fashion (India) Completes Income Tax Search at Offices and Warehouse",
            "Summary": "Go Fashion (India) announced that an income tax search at its offices and warehouse has concluded. The search was conducted from October 7 to 11, 2025. The company stated it fully cooperated with the authorities during the process.",
            "Sentiment": "neutral",
            "PublishDate": 1760340852409,
            "Source": "stock"
        },
        {
            "Title": "Income Tax Department Conducts Search Operations at Go Fashion Facilities",
            "Summary": "The Income Tax Department has conducted search operations at Go Fashion (India) Ltd's offices, warehouses, and stores. The company has stated that its operations remain uninterrupted despite the ongoing search activities.",
            "Sentiment": "neutral",
            "PublishDate": 1759823368816,
            "Source": "stock"
        },
        {
            "Title": "Catalyst Trusteeship Reduces Stake in Go Fashion (India) Limited to 4.89%",
            "Summary": "Catalyst Trusteeship Limited, acting as Security Trustee on behalf of a lender, has reduced its shareholding in Go Fashion (India) Limited from 6.96% to 4.89%. The disposal involved 11,16,848 shares (2.07% of total shareholding) through the release of equity shares pledged by Rahul Saraogi. The transaction was completed on July 21, 2025. Post-disposal, Catalyst Trusteeship holds 26,41,752 shares in the Chennai-based fashion retailer. Go Fashion has a total equity share capital of 5,40,08,984 shares with a face value of Rs. 10 each, and is listed on both BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1758515487954,
            "Source": "corporate_action"
        },
        {
            "Title": "Go Fashion Reports Flat Q1 FY26 Revenue at INR 223 Crores Amid Supply Chain Disruptions",
            "Summary": "Go Fashion (India) Limited reported revenues of INR 223 crores for Q1 FY26, remaining broadly stable year-on-year. The company faced temporary headwinds in its Large Format Store (LFS) channel and supply chain disruptions from Bangladesh route blockade, which delayed shipments and affected product availability. Despite challenges, gross margins improved to 63% driven by easing raw material costs and favorable product mix. Same-store sales growth declined 2% primarily due to softer footfalls, while average selling price increased to INR 805. The company added 27 new stores, bringing total count to 803 stores, and remains on track for 120 net additions for the full year. EBITDA stood at INR 69 crores with 30.8% margin, while profit after tax was INR 22 crores with 10% margin. Go Fashion is piloting new categories including women's topwear and select menswear across 15-20 stores, with initial launch beginning in August. The company's Dubai store is showing positive initial traction. Cash and equivalents stood at INR 247 crores as of June 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754483834727,
            "Source": "earnings"
        },
        {
            "Title": "Go Fashion Reports 1% Revenue Growth to Rs 223 Crores in Q1 FY26 with Margin Improvements",
            "Summary": "Go Fashion (India) Limited reported revenue of Rs 223 crores for Q1 FY26, representing 1% growth compared to Rs 220 crores in Q1 FY25. The company achieved gross profit margins of 63%, an improvement of 120 basis points year-over-year, driven by easing raw material costs and favorable product mix. However, profit after tax declined 22% to Rs 22 crores from Rs 29 crores in the previous year quarter, with PAT margins at 10% versus 13% previously. EBITDA margins compressed to 30.8% from 32.8% due to increased employee costs from store expansion and annual increments. Same Store Sales Growth was negative at 2% for the quarter. The company added 27 new EBO stores during the quarter, bringing the total to 803 stores across 187 cities. Average selling price increased to Rs 805, reflecting a shift toward value-added products. The company maintains cash and cash equivalents of Rs 247 crores and reported recovery in the latter part of the quarter, particularly during the End of Season Sale period.",
            "Sentiment": "neutral",
            "PublishDate": 1754041189355,
            "Source": "earnings"
        },
        {
            "Title": "Go Fashion Reports Q1 Results and Board Changes with Multiple Director Appointments",
            "Summary": "Go Fashion (India) Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of ₹22,282.53 lakhs compared to ₹20,481.43 lakhs in the same quarter last year. Profit after tax stood at ₹2,225.99 lakhs versus ₹2,865.03 lakhs in the previous year quarter. Basic earnings per share was ₹4.12 compared to ₹5.30 in the corresponding quarter. The Board approved re-appointments of three Independent Directors - Mr. Srinivasan Sridhar, Mr. Dinesh Madanlal Gupta, and Mrs. Rohini Manian - for second consecutive terms of 5 years each, effective from June-July 2026, subject to shareholder approval. Managing Director Mr. Prakash Kumar Saraogi and Executive Director Mr. Gautam Saraogi were also re-appointed for 5-year terms. Mr. Vinod Kumar Saraogi was appointed as Additional Director (Non-Executive and Non-Independent) effective August 1, 2025. Mr. Rahul Saraogi resigned as Non-Executive and Non-Independent Director due to pre-occupation and other professional commitments. The company also appointed M/s. Sridharan & Sridharan Associates as Secretarial Auditor for five years and scheduled its 15th Annual General Meeting for September 4, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754037529188,
            "Source": "corporate_action"
        },
        {
            "Title": "GO Fashion Reports Flat Revenue Growth with Declining Profitability in Q1",
            "Summary": "GO Fashion reported Q1 revenue of 2.2 billion rupees, remaining flat compared to the same period last year. The company's net profit declined to 223 million rupees from 286 million rupees year-over-year. EBITDA decreased to 687 million rupees from 721 million rupees, while EBITDA margin compressed to 30.84% from 33% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754037136907,
            "Source": "earnings"
        },
        {
            "Title": "Catalyst Trusteeship Releases 11.17 Lakh Go Fashion Shares from Pledge",
            "Summary": "Catalyst Trusteeship Limited, acting as Security Trustee, has released 11,16,848 shares representing 2.07% of Go Fashion (India) Limited from pledge on behalf of a lender. The shares were pledged by Rahul Saraogi. Following this release on July 21, 2025, Catalyst Trusteeship's holding in Go Fashion decreased from 37,58,600 shares (6.96%) to 26,41,752 shares (4.89%). Go Fashion has a total equity share capital of 5,40,08,984 shares with a face value of Rs.10 each. The company's shares are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1753328152347,
            "Source": "corporate_action"
        },
        {
            "Title": "Go Fashion Opens First International Store in Dubai",
            "Summary": "Go Fashion has announced the opening of its first international store for its brand Go Colors in Dubai's Silicon Central Mall. This marks the company's expansion into the international market.",
            "Sentiment": "positive",
            "PublishDate": 1749109009000,
            "Source": "default"
        },
        {
            "Title": "Go Fashion: Q4 Profit Surges 54%, Stock Jumps 13%",
            "Summary": "Go Fashion reported a 54% YoY increase in Q4 FY25 net profit to ₹20 crore. Revenue grew 12.6% to ₹205 crore, while EBITDA rose 15.1%. Same-store sales growth recovered to 2.1%. The company added 62 stores in FY25, targeting 120 annual additions going forward.",
            "Sentiment": "positive",
            "PublishDate": 1746003153000,
            "Source": "earnings"
        },
        {
            "Title": "Go Fashion Aims to Expand Exclusive Brand Outlets",
            "Summary": "Go Fashion has announced plans to open 130-140 Exclusive Brand Outlets (EBOs) per year. The company also revealed that 80% of its revenue is generated from these EBO stores, highlighting the significance of this expansion strategy for their business model.",
            "Sentiment": "positive",
            "PublishDate": 1746002106000,
            "Source": "default"
        },
        {
            "Title": "GO FASHION Reports Strong Q4 Financial Performance",
            "Summary": "GO FASHION has announced its Q4 financial results, showing significant year-over-year growth. The company's revenue increased to 2.1 billion rupees from 1.8 billion rupees in the previous year. EBITDA also saw a substantial rise to 734.2 million rupees from 539 million rupees. Notably, the EBITDA margin improved to 35.85% from 29.66% in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1746000433000,
            "Source": "result"
        },
        {
            "Title": "Go Fashion Reports Q4 Net Profit Increase",
            "Summary": "Go Fashion has reported a net profit of 199 million rupees for the fourth quarter, compared to 131 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1746000235000,
            "Source": "result"
        },
        {
            "Title": "Go Fashion to Consider Q4 Results on April 30",
            "Summary": "Go Fashion has announced that it will consider its fourth quarter financial results on April 30. This indicates the company is preparing to release its latest earnings report, which will provide insights into its financial performance for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745415062000,
            "Source": "default"
        },
        {
            "Title": "GO Fashion Reports Q3 EBITDA and Margin Figures",
            "Summary": "GO Fashion has released its financial results for the third quarter. The company reported an EBITDA of 698 million rupees, compared to 675 million rupees in the same period last year, showing a year-over-year increase. However, the EBITDA margin decreased slightly to 32.5% from 33.41% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737946128000,
            "Source": "earnings"
        },
        {
            "Title": "Go Fashion Reports Q3 Revenue Increase",
            "Summary": "Go Fashion has reported a revenue of 2.14 billion rupees for the third quarter, showing an increase from 2 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1737946118000,
            "Source": "earnings"
        },
        {
            "Title": "Go Fashion Reports Increase in Q3 Net Profit",
            "Summary": "Go Fashion has reported a net profit of 243 million rupees for the third quarter, compared to 234 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737946109000,
            "Source": "earnings"
        },
        {
            "Title": "GO FASHION Reports Q2 EBITDA Growth",
            "Summary": "GO FASHION has announced its Q2 financial results. The company's EBITDA increased to 636 million rupees, up from 566 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 30.5% from 29.98% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729842058000,
            "Source": "result"
        },
        {
            "Title": "GO FASHION Reports Improved Q2 Financial Results",
            "Summary": "GO FASHION has announced its Q2 financial results, showing an increase in EBITDA from 566 million rupees to 636 million rupees year-over-year. The company's EBITDA margin also improved, rising from 29.98% to 30.50% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1729841910000,
            "Source": "result"
        },
        {
            "Title": "Go Fashion Reports Q2 Revenue Growth",
            "Summary": "Go Fashion has reported a revenue of 2.15 billion rupees for the second quarter, compared to 1.9 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729841877000,
            "Source": "result"
        },
        {
            "Title": "Go Fashion Reports Slight Increase in Q2 Net Profit",
            "Summary": "Go Fashion has reported a net profit of 206 million rupees for the second quarter, compared to 200 million rupees in the same period last year, showing a modest year-over-year increase.",
            "Sentiment": "neutral",
            "PublishDate": 1729841862000,
            "Source": "result"
        }
    ]
}