{
    "Symbol": "GODAVARIB",
    "ISIN": "INE497S01012",
    "News": [
        {
            "Title": "Godavari Biorefineries Gets NGT Order on Water Treatment",
            "Summary": "National Green Tribunal directs Godavari Biorefineries to construct trench along bioremediation area within two months to prevent runoff water from reaching Godavari River. Company states no material impact on financials or operations.",
            "Sentiment": "neutral",
            "PublishDate": 1770630445558,
            "Source": "stocks"
        },
        {
            "Title": "Godavari Biorefineries Partners With Synthomer",
            "Summary": "Godavari Biorefineries collaborates with Synthomer to develop sustainable alternatives to fossil-based monomers, accelerating transition to eco-friendly raw materials.",
            "Sentiment": "positive",
            "PublishDate": 1770362266947,
            "Source": "co_actions_results"
        },
        {
            "Title": "Godavari Biorefineries Board Meet on Feb 13, 2026",
            "Summary": "Godavari Biorefineries Limited has scheduled a board meeting on February 13, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770211015580,
            "Source": "co_actions_results"
        },
        {
            "Title": "Godavari Biorefineries Clarifies Share Price Movement",
            "Summary": "Godavari Biorefineries Ltd clarifies that recent share price movements are market-driven, with no undisclosed material information or pending corporate actions affecting the stock.",
            "Sentiment": "neutral",
            "PublishDate": 1766737364794,
            "Source": "stocks"
        },
        {
            "Title": "Godavari Biorefineries Secures US Patent for Anti-Cancer Compounds",
            "Summary": "Godavari Biorefineries received a US patent for compounds designed to stop uncontrolled cell growth by targeting cancer stem cells. The patented compounds may help treat breast and prostate cancer, potentially expanding the company's pharmaceutical capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1764922063894,
            "Source": "stock"
        },
        {
            "Title": "Godavari Biorefineries Reports 34% Revenue Growth in Q2 FY26 with Narrowed EBITDA Losses",
            "Summary": "Godavari Biorefineries delivered revenue growth of 34% year-on-year to INR 430.8 crores in Q2 FY26, while narrowing EBITDA losses to INR 4.4 crores from INR 31.5 crores in Q2 FY25. The company's bio-based chemicals segment posted 60% EBITDA growth and ethanol business returned to positive territory with INR 4.7 crores EBITDA, driven by improved product mix and strategic focus on specialty chemicals.",
            "Sentiment": "positive",
            "PublishDate": 1763643938868,
            "Source": "corporate_action"
        },
        {
            "Title": "Godavari Biorefineries Reports 34% Revenue Growth Despite Net Loss in Q2 FY26",
            "Summary": "Godavari Biorefineries shares declined 1.97% to ₹256.40 as the company reported consolidated revenue of ₹434.3 crore with 34% year-on-year growth but posted a net loss of ₹41.6 crore for Q2 FY26. The ethanol and bio-based chemicals manufacturer showed recovery signs with reduced EBITDA losses and segment-wise profitability improvements, while advancing its anti-cancer research program and planning a 200 KLPD distillery commissioning.",
            "Sentiment": "neutral",
            "PublishDate": 1763361261827,
            "Source": "stock"
        },
        {
            "Title": "Godavari Biorefineries Reports Strong Q2FY26 Growth with 35% Revenue Jump and Breakthrough CO2-to-DME Technology",
            "Summary": "Godavari Biorefineries achieved consolidated revenue growth of 35% YoY in Q2FY26 to Rs. 434.3 crores, with EBITDA losses contracting by Rs. 27.1 crores and ethanol segment revenue surging 246% to Rs. 101.2 crores. The company launched a revolutionary pilot project with ICT Mumbai for CO2-to-DME technology conversion and received successful clinical study reports for its novel anti-cancer molecule, while reducing finance costs significantly through Rs. 240 crore term debt repayment from IPO proceeds.",
            "Sentiment": "positive",
            "PublishDate": 1763061621394,
            "Source": "earnings"
        },
        {
            "Title": "Godavari Biorefineries Reports Loss in Q2 FY2026 Results",
            "Summary": "Godavari Biorefineries Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. The company reported a consolidated net loss of Rs 1,159.24 lakhs for the quarter compared to a loss of Rs 160.64 lakhs in the previous quarter. For the half-year period, the consolidated net loss was Rs 6,760.82 lakhs versus Rs 10,504.04 lakhs in the corresponding previous period. The company recognized an exceptional expense of Rs 2,665.59 lakhs related to additional harvest charges for the 2023-2024 sugar season to remain competitive with neighboring sugar mills. The company operates across multiple segments including Sugar, Cogeneration, Bio-based Chemicals, and Distillery. The results were approved by the Board of Directors at their meeting held on November 11, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762868766557,
            "Source": "earnings"
        },
        {
            "Title": "Godavari Biorefineries Partners With ICT Mumbai For CO2-To-DME Project, Receives K.V. Mariwala Award",
            "Summary": "Godavari Biorefineries has launched a CO2-to-DME project in collaboration with ICT Mumbai. The project aims to convert 450 metric tons of CO2 daily into sustainable fuel. The company has also won the K.V. Mariwala Award for strong industry partnership.",
            "Sentiment": "positive",
            "PublishDate": 1762765856892,
            "Source": "stock"
        },
        {
            "Title": "Godavari Biorefineries Secures European Patent for Anti-Cancer Compounds",
            "Summary": "Godavari Biorefineries has received a patent in Europe for anti-cancer compounds that target uncontrolled cell growth. The patented compounds show potential for treating breast and prostate cancer.",
            "Sentiment": "positive",
            "PublishDate": 1760589604785,
            "Source": "stock"
        },
        {
            "Title": "Godavari Biorefineries Wins ICC Award for Industry-Academia Partnership",
            "Summary": "Godavari Biorefineries Limited received the ICC – K. V. Mariwala Award for Effective Chemical Industry–Academia Partnership at the 60th Annual ICC Awards held in Mumbai. The company was recognized alongside the Institute of Chemical Technology (ICT), Mumbai for their collaboration in developing technology that converts CO₂ into di-methyl ether (DME) using a single-step catalytic conversion process. DME serves as a clean fuel substitute for LPG and diesel. The technology was developed under the guidance of Prof. G. D. Yadav and Mr. Samir Somaiya, CMD of GBL. The award recognizes partnerships that drive innovation, technology transfer, and sustainable solutions in India's chemical sector. GBL operates as an integrated biorefinery specializing in bio-based chemicals, ethanol, and sugar production with facilities in Maharashtra and Karnataka.",
            "Sentiment": "positive",
            "PublishDate": 1758523713761,
            "Source": "stock"
        },
        {
            "Title": "Godavari Biorefineries Receives ICC Award for Innovative CO₂ Conversion Technology",
            "Summary": "Godavari Biorefineries Ltd has received the ICC - K. V. Mariwala Award for Effective Chemical Industry Academia Partnership from the Indian Chemical Council. The company developed technology that converts biogenic CO₂ from ethanol fermentation into di-methyl ether (DME) using a single-step catalytic conversion process. The technology was jointly developed with the Institute of Chemical Technology, Mumbai, under Prof. G. D. Yadav's guidance and Mr. Samir Somaiya's leadership. DME serves as a clean fuel substitute for LPG and diesel, and as a chemical feedstock. Lab-scale validation confirms the technology's environmental and economic viability with potential for negative carbon intensity, making it scalable and globally replicable.",
            "Sentiment": "positive",
            "PublishDate": 1758301823180,
            "Source": "stock"
        },
        {
            "Title": "Godavari Biorefineries Reports Q1 FY26 Turnaround with Positive EBITDA and Strategic Expansion Plans",
            "Summary": "Godavari Biorefineries Limited reported revenue of INR 533.2 crores for Q1 FY26, up from INR 522.5 crores in the same quarter last year. The company achieved a positive EBITDA of INR 6.5 crores compared to a loss in Q1 FY25, marking an improvement of INR 16 crores. The bio-based chemical segment registered a 43% increase in EBITDA. Interest costs decreased by 22% year-on-year to INR 15 crores due to debt reduction efforts. The company is progressing with a 200 kiloliters per day grain-based ethanol distillery, expected to commence commercial production by end of calendar year 2025. Management projects 3x EBITDA growth from FY25 to FY29, driven by bio-based specialty chemicals and ethanol capacity expansion. The company received European patent validation for an anti-cancer molecule and completed safety trials without dose-limiting toxicity. Gross margin expanded by 512 basis points year-on-year to 19%. The new ethanol facility is expected to generate over INR 400 crores in revenue at current pricing levels.",
            "Sentiment": "positive",
            "PublishDate": 1755520753805,
            "Source": "earnings"
        },
        {
            "Title": "Godavari Biorefineries Wins ICC K.V. Mariwala Award for Chemical Industry-Academia Partnership",
            "Summary": "Godavari Biorefineries Ltd. has been awarded the ICC K.V. Mariwala Award for Effective Chemical Industry-Academia Partnership for 2024, in collaboration with the Institute of Chemical Technology Mumbai. The Awards Selection Committee of ICC evaluated the company's nomination and recommended conferring the award. The award recognizes outstanding achievements and contributions in various facets of the chemical industry. The presentation ceremony is scheduled for September 19, 2025, at the ICC Awards Presentation Function.",
            "Sentiment": "positive",
            "PublishDate": 1755281948340,
            "Source": "stock"
        },
        {
            "Title": "Godavari Biorefineries Reports Improved Q1 FY26 Performance with EBITDA Turnaround",
            "Summary": "Godavari Biorefineries reported total income of Rs. 534.0 crores in Q1 FY26, up 2% year-on-year. The company achieved a significant turnaround with EBITDA of Rs. 6.5 crores compared to negative Rs. 9.5 crores in Q1 FY25, while EBITDA margin improved to 1.2% from negative 1.8%. Net loss narrowed to Rs. 16.0 crores from Rs. 26.1 crores in the previous year. Finance costs decreased to Rs. 15.3 crores from Rs. 19.6 crores. The ethanol segment showed strong growth with revenue up 51% to Rs. 205.4 crores, while chemicals segment revenue declined 3% to Rs. 141.2 crores. Sugar & cogeneration segment revenue fell 24% to Rs. 177.5 crores. The company is expanding ethanol capacity with a 200 KLPD grain/maize distillery expected to commence commercial production by end of 2025, adding 60 million liters annual capacity. Management attributed the improved margins to restoration of the Ethanol Blending Program, specialty chemicals debottlenecking, and reduced finance costs. The company targets 3X EBITDA growth by FY29 from FY25 levels with an estimated investment of Rs. 325 crores for growth initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1754851646689,
            "Source": "earnings"
        },
        {
            "Title": "Godavari Biorefineries Reports Mixed Q1 FY26 Results with Revenue Growth but Losses Continue",
            "Summary": "Godavari Biorefineries Limited reported total income of Rs. 534.0 crores for Q1 FY26, up from Rs. 525.3 crores in Q1 FY25. The company achieved positive EBITDA of Rs. 6.5 crores compared to negative Rs. 9.5 crores in the previous year quarter, with EBITDA margin improving to 1.2% from -1.8%. However, the company recorded a loss after tax of Rs. 16.0 crores, though this was lower than the Rs. 26.1 crores loss in Q1 FY25. Revenue from operations reached Rs. 533.2 crores. The Bio-Based Chemicals segment showed strong performance with 43% year-on-year EBITDA growth. Ethanol production increased to 26,057 KL from 25,082 KL in the previous year. The company has made progress in drug discovery with European patent validation for an anti-cancer molecule and received a patent from China for another anti-cancer compound. CMD Samir Somaiya attributed the performance to resilience despite seasonal business segments and highlighted restoration of the Ethanol Blending Program and upcoming grain-based ethanol capacity as growth drivers.",
            "Sentiment": "neutral",
            "PublishDate": 1754585573237,
            "Source": "earnings"
        },
        {
            "Title": "Godavari Biorefineries Reports Q1 EBITDA Turnaround with Reduced Losses",
            "Summary": "Godavari Biorefineries achieved positive EBITDA of 47 million rupees in Q1, marking a significant improvement from a loss of 130 million rupees in the same period last year. The company's EBITDA margin improved to 0.90% compared to -2.52% year-over-year. Net losses narrowed to 166 million rupees from 269 million rupees in the previous year's corresponding quarter. Revenue grew to 5.23 billion rupees from 5.16 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754567900453,
            "Source": "earnings"
        },
        {
            "Title": "Godavari Biorefineries Secures Patent in China for Anti-Cancer Molecule",
            "Summary": "Godavari Biorefineries has obtained a patent in China for an anti-cancer molecule designed to treat cancer. The patent represents an expansion of the company's intellectual property portfolio in the pharmaceutical sector within the Chinese market.",
            "Sentiment": "positive",
            "PublishDate": 1753165238728,
            "Source": "stock"
        },
        {
            "Title": "Godavari Biorefineries Granted Patent for Cancer Treatment Compound",
            "Summary": "Godavari Biorefineries has been granted a patent by the China National Intellectual Property Administration (CNIPA) for a compound used in cancer treatment. The patent relates to a specific compound that has potential applications in treating cancer.",
            "Sentiment": "positive",
            "PublishDate": 1752625021000,
            "Source": "default"
        },
        {
            "Title": "Godavari Biorefineries Receives Patent for Cancer Treatment Compound",
            "Summary": "Godavari Biorefineries has been granted a patent by the China National Intellectual Property Administration (CNIPA) for a compound intended for cancer treatment. The news highlights the company's progress in pharmaceutical research and development, specifically in the area of oncology.",
            "Sentiment": "positive",
            "PublishDate": 1752582227000,
            "Source": "default"
        },
        {
            "Title": "Godavari Biorefineries: Anti-Cancer Patent Validated in Spain, UK, and EU",
            "Summary": "Godavari Biorefineries' European patent for a novel anti-cancer molecule has been validated in Spain, UK, and EU member states. The molecule, effective against cancer cells and stem cells, is in Phase 1a clinical trials for advanced solid tumours. This development strengthens the company's position in scientific innovation and aligns with its diversification into advanced scientific fields.",
            "Sentiment": "positive",
            "PublishDate": 1751868336000,
            "Source": "normal_news"
        },
        {
            "Title": "Godavari Biorefineries' Anti-Cancer Patent Confirmed in Multiple European Countries",
            "Summary": "Godavari Biorefineries has received confirmation of its anti-cancer patent in the United Kingdom, Spain, and various European Union countries. The company reports that clinical trials for this anti-cancer treatment are currently in progress.",
            "Sentiment": "positive",
            "PublishDate": 1751857329000,
            "Source": "default"
        },
        {
            "Title": "Godavari Biorefineries: European Patent Secured for Anticancer Molecule",
            "Summary": "Godavari Biorefineries Ltd has obtained a European patent for a novel anticancer molecule, validated in Spain, UK, and under the Unitary Patent system. The patent covers a potent compound effective against cancer and cancer stem cells. In Q4 FY25, the company reported a 10.37% YoY increase in net profit to ₹71.93 crore, despite a 5.80% decline in revenue. Full-year results show a net loss of ₹23.41 crore, but revenue grew 10.88% YoY to ₹1,870.25 crore.",
            "Sentiment": "positive",
            "PublishDate": 1751563706000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godavari Biorefineries Secures European Patent for Anti-Cancer Molecule",
            "Summary": "Godavari Biorefineries has been granted a patent in Europe for an anti-cancer molecule. The company's achievement in developing a potentially significant pharmaceutical compound has been recognized through this patent approval.",
            "Sentiment": "positive",
            "PublishDate": 1751556957000,
            "Source": "default"
        },
        {
            "Title": "Godavari Biorefineries Achieves Record Cane Crushing at Sameerwadi Unit",
            "Summary": "Godavari Biorefineries has announced that its Sameerwadi unit has surpassed 24.65 lakh tons of sugarcane crushing, marking the highest crushing volume in the company's history. This achievement represents a significant milestone in the company's operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1744157436000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godavari Biorefineries Achieves Record Cane Crushing at Sameerwadi Unit",
            "Summary": "Godavari Biorefineries has announced that its Sameerwadi unit has surpassed 24.65 lakh tons of sugarcane crushing, marking the highest crushing volume in the company's history. This achievement represents a significant milestone in the company's operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1744119945000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godavari Biorefineries Announces ₹130 Crore CAPEX for New Distillery",
            "Summary": "Godavari Biorefineries has announced a capital expenditure of ₹130 crore for a new 200 KLPD corn/grain-based distillery at Sameerwadi. The facility is expected to be operational by the fourth quarter of the fiscal year 2026.",
            "Sentiment": "positive",
            "PublishDate": 1734314549000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godavari Biorefineries Secures Exclusive License Agreement with Catalyxx Inc for Biobutanol Production",
            "Summary": "Godavari Biorefineries has entered into an exclusive license agreement with Catalyxx Inc for the production of biobutanol and higher alcohols. This strategic partnership allows Godavari Biorefineries to utilize Catalyxx's technology for manufacturing these bio-based chemicals, potentially expanding their product portfolio and enhancing their position in the renewable chemicals market.",
            "Sentiment": "positive",
            "PublishDate": 1733184414000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godavari Biorefineries Secures Exclusive License for Biobutanol Technology",
            "Summary": "Godavari Biorefineries has entered into an exclusive license agreement with Catalyxx Inc for biobutanol and higher alcohol production technology. This partnership aims to enhance the company's capabilities in producing sustainable biofuels and biochemicals.",
            "Sentiment": "positive",
            "PublishDate": 1733139444000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godavari Biorefineries: Madhuri Kela Acquires Stake Below IPO Price",
            "Summary": "Madhuri Madhusudan Kela purchased 5 lakh shares of Godavari Biorefineries at Rs 335.66 per share, totaling Rs 17 crore. The stock debuted at a 12% discount to its IPO price but closed 10.40% above its listing price. Godavari Biorefineries is a major ethanol producer planning to expand capacity from 600 KLPD to 1,000 KLPD.",
            "Sentiment": "neutral",
            "PublishDate": 1730301543000,
            "Source": "block_deals"
        },
        {
            "Title": "Godavari Biorefineries: Disappointing Stock Market Debut with 13% Discount",
            "Summary": "Godavari Biorefineries Ltd. shares listed at ₹308 on NSE, a 12.50% discount to its IPO price of ₹352. The IPO raised ₹555 crore, including a fresh issue of ₹325 crore and an OFS of ₹230 crore. The company plans to use ₹240 crore for debt repayment. Recent financials show a decline in profit and revenue for FY2024 and a loss in Q1 FY2025.",
            "Sentiment": "negative",
            "PublishDate": 1730262984000,
            "Source": "normal_news"
        },
        {
            "Title": "Godavari Biorefineries: Shares Debut 12.5% Below IPO Price",
            "Summary": "Godavari Biorefineries shares listed at ₹308 on NSE and ₹310.55 on BSE, down 12.5% and 11.78% respectively from the IPO price of ₹352. The ₹554.75 crore IPO was oversubscribed 1.76 times. The company plans to use the proceeds for debt repayment and general corporate purposes.",
            "Sentiment": "negative",
            "PublishDate": 1730262557000,
            "Source": "result"
        }
    ]
}