{
    "Symbol": "GODFRYPHLP",
    "ISIN": "INE260B01028",
    "News": [
        {
            "Title": "Godfrey Phillips clarifies volume surge to BSE",
            "Summary": "Godfrey Phillips India responds to BSE inquiry about recent trading volume increase, stating no unpublished price-sensitive information caused the surge and attributing it to market conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1770645336801,
            "Source": "stocks"
        },
        {
            "Title": "Godfrey Phillips Q3FY26 profit rises 6% to ₹353.61 crore",
            "Summary": "Godfrey Phillips India reported 6% growth in Q3FY26 net profit to ₹353.61 crore with revenue rising 15.5% to ₹2,187.88 crore. Board appointed Marco Mariotti as Additional Director.",
            "Sentiment": "positive",
            "PublishDate": 1769774873729,
            "Source": "co_actions_results"
        },
        {
            "Title": "Godfrey Phillips Faces ₹24.72L GST Penalty Order",
            "Summary": "Godfrey Phillips India receives GST order with penalty of ₹24.72 lakh for alleged irregular Input Tax Credit utilization. Company evaluates appeal options, states no material financial impact.",
            "Sentiment": "negative",
            "PublishDate": 1767780932273,
            "Source": "stocks"
        },
        {
            "Title": "Godfrey Phillips Faces GST Penalty of ₹11.98 Lakh",
            "Summary": "Godfrey Phillips India receives GST order with penalty of ₹11.98 lakh for alleged irregular Input Tax Credit utilization. Company evaluates appeal options, states no material impact on operations.",
            "Sentiment": "negative",
            "PublishDate": 1767076677979,
            "Source": "stocks"
        },
        {
            "Title": "Godfrey Phillips Files ₹344.49 Cr Insurance Claim",
            "Summary": "Godfrey Phillips India files insurance claim worth ₹344.49 crores for fire damage at third-party tobacco processing plant in Andhra Pradesh. Company expects no material impact on financials.",
            "Sentiment": "negative",
            "PublishDate": 1766495708886,
            "Source": "stocks"
        },
        {
            "Title": "Lok Sabha Approves New Excise Duty Bill Targeting Tobacco Products with Higher Tax Rates",
            "Summary": "The Lok Sabha has approved a new excise duty bill for tobacco products, proposing 60-70% duty on unmanufactured tobacco and 25% or ₹5,000 per 1,000 cigar sticks. The legislation will impact tobacco companies like Godfrey Phillips India through increased taxation on their products.",
            "Sentiment": "negative",
            "PublishDate": 1764775398097,
            "Source": "sectoral"
        },
        {
            "Title": "Godfrey Phillips India Receives GST Demand Order Worth Rs. 43.6 Lakh",
            "Summary": "Godfrey Phillips India Limited received a GST demand order on November 10, 2025, imposing a penalty of Rs. 43,60,652 each on the company and an independent director under the Central Goods and Services Tax Act, 2017. The order relates to alleged irregular availment and utilization of Input Tax Credit (ITC) under GST laws. The company stated that the order has no material impact on its financials, operations or other activities, and is evaluating all options including filing an appeal against the order.",
            "Sentiment": "negative",
            "PublishDate": 1762843340332,
            "Source": "corporate_action"
        },
        {
            "Title": "Godfrey Phillips Focuses on Volume Growth and Export Recovery Strategy",
            "Summary": "Godfrey Phillips is implementing a multi-pronged growth strategy centered on volume-led cigarette growth and export recovery in the second half. The company plans to launch premium products, strengthen its Marlboro partnership, and diversify into FMCG adjacencies. The company aims to maintain sustained double-digit profitability through these initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1762267808234,
            "Source": "stock"
        },
        {
            "Title": "Godfrey Phillips India Reports Strong Q2 Performance with 850% Interim Dividend Declaration",
            "Summary": "Godfrey Phillips India Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported total income from continuing operations of Rs. 173,902 lakhs for the quarter and Rs. 369,009 lakhs for the half-year. Net profit after tax from continuing operations stood at Rs. 30,174 lakhs for the quarter and Rs. 59,049 lakhs for the half-year. The Board declared an interim dividend of 850% (Rs. 17 per equity share of Rs. 2 each) for the financial year ending March 31, 2026, with November 10, 2025 fixed as the record date. During the quarter, the company allotted 103,987,840 bonus equity shares in the ratio of 2:1. The company's cigarettes, tobacco and related products segment generated revenue of Rs. 160,597 lakhs for the quarter. A fire incident occurred at a tobacco processing plant operated by a third party in Andhra Pradesh on October 10, 2025, but inventories were adequately covered by insurance policies with no material loss expected.",
            "Sentiment": "positive",
            "PublishDate": 1762174797707,
            "Source": "earnings"
        },
        {
            "Title": "Godfrey Phillips India Reports 20% Jump in Quarterly Net Profit to 3 Billion Rupees",
            "Summary": "Godfrey Phillips India reported consolidated net profit of 3 billion rupees for the quarter, compared to 2.5 billion rupees in the same period last year, marking a 20% increase. However, quarterly revenue declined to 16.3 billion rupees from 16.5 billion rupees year-over-year, representing a 1.2% decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1762174339711,
            "Source": "earnings"
        },
        {
            "Title": "Godfrey Phillips India Reports Major Fire at Third-Party Tobacco Processing Facility in Andhra Pradesh",
            "Summary": "Godfrey Phillips India experienced a major fire at a third-party tobacco processing plant and warehouse in District Prakasam, Andhra Pradesh, where the company processes and stores its tobacco leaf inventory. The fire broke out at approximately 2:30 AM with no injuries or loss of life reported. The cause of the fire is under investigation. The company is assessing the actual damage and has informed its insurance provider, noting that the inventory is adequately covered by insurance policies. Godfrey Phillips stated it is taking necessary steps to address the situation and will provide updates on any material developments.",
            "Sentiment": "negative",
            "PublishDate": 1760101544057,
            "Source": "stock"
        },
        {
            "Title": "Godfrey Phillips Shares Double in 2025 as Marlboro Brand Gains Market Share from ITC",
            "Summary": "Godfrey Phillips India shares have doubled in 2025 and delivered a 9x return over three years, while ITC shares declined 12% this year. Godfrey Phillips' exclusive agreement with Philip Morris International to manufacture and distribute Marlboro in India is driving growth, with the company achieving 22% revenue and EBIT CAGR over FY22-FY25 compared to ITC's 8%. Volume growth shows Godfrey Phillips at 27% and Marlboro at 42% versus ITC's 6.5% in Q1 FY26. Despite ITC maintaining over 75% market share by volume, Godfrey Phillips has increased its share to more than 14%. The Marlboro brand is gaining traction among younger, aspirational smokers through premium positioning and increased availability. Analysts project Godfrey Phillips volume growth of 20-25% for Q2 FY26 compared to ITC's estimated 5-6%. ITC faces challenges from taxation uncertainty, competitive pressure, and the growing popularity of slim cigarettes among urban consumers.",
            "Sentiment": "negative",
            "PublishDate": 1759292981489,
            "Source": "stock"
        },
        {
            "Title": "Godfrey Phillips Co Executive Director Samir Modi Arrested on Rape Charges",
            "Summary": "Samir Modi, Co Executive Director of Godfrey Phillips, has been arrested by Delhi Police on rape charges. Modi is currently in custody and is scheduled to appear in court tomorrow.",
            "Sentiment": "negative",
            "PublishDate": 1758205358557,
            "Source": "corporate_governance"
        },
        {
            "Title": "Godfrey Phillips Shares Jump 9% After 2:1 Bonus Issue Implementation",
            "Summary": "Godfrey Phillips India shares began trading adjusted for their 2:1 bonus issue, gaining over 9%. Under this arrangement, shareholders receive two bonus shares of ₹2 each for every existing share held. The bonus issue was funded by capitalizing ₹2,079.76 lakh from general reserves and retained earnings, marking the company's first bonus issue. The board also approved increasing authorized share capital to 50 crore from 25 crore. The company reported strong quarterly results with net profit rising 56% to ₹356.3 crore, revenue increasing 36.6% to ₹1,486 crore, and EBITDA growing 25.3% to ₹338 crore, though EBITDA margin contracted to 22.7% from 24.8%. Shares hit an intraday high of ₹3,720, trading up 7.2% at ₹3,656 around 10:15 am, despite declining 62.1% over the past month.",
            "Sentiment": "positive",
            "PublishDate": 1758001509517,
            "Source": "corporate_action"
        },
        {
            "Title": "Godfrey Phillips and GHV Infra Projects Set Bonus Share Record Date for September 16",
            "Summary": "Two companies are proceeding with bonus share allocations next week. Godfrey Phillips India has recommended a 2:1 bonus issue, meaning shareholders will receive two new shares for every one share held. GHV Infra Projects has recommended a 3:2 bonus issue of up to 4.32 crore shares at Rs 5 face value, giving three new shares for every two existing shares. Both companies have set September 16 as the record date to determine eligible shareholders. Under India's T+1 settlement cycle, investors must purchase shares at least one trading day before the record date to qualify for the bonus allocation.",
            "Sentiment": "positive",
            "PublishDate": 1757845430399,
            "Source": "corporate_action"
        },
        {
            "Title": "Godfrey Phillips India Shareholders Approve Key Appointments and Capital Increase at 88th AGM",
            "Summary": "Godfrey Phillips India held its 88th Annual General Meeting on September 4, 2025, where shareholders approved several key resolutions. The company re-appointed Mr. Sumant Bharadwaj as Independent Director for a second five-year term from February 13, 2026 to February 12, 2031. Bharadwaj is an advocate and partner at law firm Legal Remedy with memberships in various legal associations. Shareholders also approved the appointment of M/s Chandrasekaran Associates as Secretarial Auditors for five consecutive years from FY 2025-26 to FY 2029-30. The firm is a practicing company secretaries firm with over three decades of experience and peer review by ICSI. Additionally, the company increased its Authorized Share Capital to Rs. 50 crore, comprising 24.7 crore equity shares of Rs. 2 each and 60,000 preference shares of Rs. 100 each, with consequent changes to the Memorandum of Association.",
            "Sentiment": "positive",
            "PublishDate": 1757043624920,
            "Source": "corporate_action"
        },
        {
            "Title": "Godfrey Phillips Reports Potential GST Application on Tobacco Product MRP",
            "Summary": "Godfrey Phillips announced that GST may be applied to the Maximum Retail Price (MRP) of tobacco products. This potential tax structure change could impact the pricing mechanism for the company's tobacco product portfolio.",
            "Sentiment": "neutral",
            "PublishDate": 1756873855948,
            "Source": "stock"
        },
        {
            "Title": "Karnataka Mining Minister Proposes Additional Tax on Sin Goods Beyond GST",
            "Summary": "Karnataka's Mining Minister has suggested implementing an extra tax on sin goods in addition to the existing GST. The proposal specifically mentions implications for companies like Godfrey Phillips, which operates in sectors that could be classified under sin goods categories.",
            "Sentiment": "negative",
            "PublishDate": 1756454209481,
            "Source": "stock"
        },
        {
            "Title": "Godfrey Phillips India: Government May Maintain Tax Levels on Tobacco Products Post Compensation Cess Abolition",
            "Summary": "The government might suggest keeping taxes steady on tobacco, gutka, and cigarettes even after the abolition of compensation cess, potentially maintaining the tax incidence through NCCD (National Calamity Contingent Duty). This development relates to Godfrey Phillips India, a company in the tobacco sector.",
            "Sentiment": "neutral",
            "PublishDate": 1756373447291,
            "Source": "stock"
        },
        {
            "Title": "Godfrey Phillips India Becomes Top Stock Performer Despite Minimal Analyst Coverage",
            "Summary": "Cigarette maker Godfrey Phillips India has become the top-performing stock of 2025 with a 108% surge, following a 148% rally in 2024. The company has virtually no analyst coverage, with only one analyst providing a 'sell' recommendation. The stock's performance significantly outpaces broader market indices, with the Nifty 50 gaining nearly 6% and the Nifty 500 index up 3% over the same period.",
            "Sentiment": "positive",
            "PublishDate": 1756140452819,
            "Source": "stock"
        },
        {
            "Title": "Bengal Minister Proposes Higher GST on Tobacco and Pan Masala Products",
            "Summary": "A Bengal Minister has suggested increasing the Goods and Services Tax (GST) on tobacco and pan masala products. This proposal could impact companies operating in these sectors, including Godfrey Phillips, which manufactures tobacco products.",
            "Sentiment": "negative",
            "PublishDate": 1755765808751,
            "Source": "stock"
        },
        {
            "Title": "Government Proposes 40% GST Rate on Sin Products Including Tobacco",
            "Summary": "The government has suggested implementing a 40% GST rate on sin products, which would impact companies like Godfrey Phillips India that operate in the tobacco and related sectors.",
            "Sentiment": "negative",
            "PublishDate": 1755488099485,
            "Source": "stock"
        },
        {
            "Title": "Godfrey Phillips Shares Hit 52-Week High After Strong Quarterly Results and Bonus Issue Announcement",
            "Summary": "Godfrey Phillips India shares surged 16.4% over two sessions, reaching a 52-week high of Rs 10,464.1. The rally followed the company's strong quarterly performance, with consolidated net profit rising 56% year-on-year to Rs 356.28 crore, compared to Rs 228.55 crore in the previous year. Revenue from operations increased to Rs 1,813.26 crore from Rs 1,358.81 crore. The company's board approved a 2:1 bonus share issue, offering two fully paid-up bonus shares for every existing share, subject to shareholder and regulatory approvals. The stock has gained 107% year-to-date and nearly 420% over the past two years. Analysts maintain a 'Buy' recommendation with an average target price of Rs 1,787, suggesting 11% upside potential. The company's market capitalisation stands at Rs 54,106 crore.",
            "Sentiment": "positive",
            "PublishDate": 1754470542673,
            "Source": "stock"
        },
        {
            "Title": "Godfrey Phillips Targets Growth Through New Markets, Exports, and Ferrero Partnership",
            "Summary": "Godfrey Phillips is pursuing growth through expansion into new cigarette markets, increased export activities, and collaboration with Ferrero. The company is maintaining focus on strengthening its brand portfolio and improving operational efficiency as part of its growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1754403361605,
            "Source": "stock"
        },
        {
            "Title": "Godfrey Phillips Reports 56% Jump in Quarterly Profit",
            "Summary": "Godfrey Phillips India reported a 55.9% year-on-year increase in net profit to Rs 356 crore for Q1 FY26, compared to Rs 229 crore in the same quarter last year. The cigarette maker's revenue grew 36.5% to Rs 1,486 crore from Rs 1,088 crore. EBITDA increased 25.1% to Rs 338 crore versus Rs 270 crore, though margins declined to 22.7% from 24.8%. The company's board approved the issuance of 2:1 bonus equity shares and announced a record date for the final dividend from FY25.",
            "Sentiment": "positive",
            "PublishDate": 1754313491092,
            "Source": "earnings"
        },
        {
            "Title": "Godfrey Phillips India Approves 2:1 Bonus Share Issue and Reports Strong Q1 2025 Results",
            "Summary": "Godfrey Phillips India's Board approved a 2:1 bonus share issue, meaning shareholders will receive 2 new shares for every 1 existing share held. The record date is set for September 16, 2025. The company also increased its authorized share capital from Rs. 25 crore to Rs. 50 crore and announced its 88th Annual General Meeting for September 4, 2025. For the quarter ended June 30, 2025, the company reported strong financial performance with revenue from operations at Rs. 1,807 crore (standalone) and profit after tax of Rs. 365 crore from continuing operations. The Board recommended a final dividend of Rs. 60 per equity share for FY 2024-25, subject to shareholder approval. The company has discontinued its 24Seven retail business operations.",
            "Sentiment": "positive",
            "PublishDate": 1754312312719,
            "Source": "corporate_action"
        },
        {
            "Title": "Godfrey Phillips to Announce Q1FY26 Results on August 4, Considers 2:1 Bonus Share Issue",
            "Summary": "Godfrey Phillips India will announce its first quarter FY26 results on August 4, 2025. The Board of Directors will consider approving unaudited standalone and consolidated financial results for the quarter ended June 30, 2025, and will also consider issuing bonus shares in a 2:1 ratio. Under the proposed bonus issue, shareholders would receive 2 new fully paid-up equity shares of Rs 2 each for every 1 existing share. In the previous quarter (Q4FY25), the tobacco manufacturer reported a 30% year-on-year increase in consolidated net profit to Rs 279.61 crore, while total income jumped 67.8% to Rs 1,965.44 crore. The company's stock has performed strongly, rising 110.46% over the past year and 74.85% year-to-date. Shares closed at Rs 8,804 on Friday, down 3.36% for the day.",
            "Sentiment": "positive",
            "PublishDate": 1754127665036,
            "Source": "corporate_action"
        },
        {
            "Title": "Godfrey Phillips India Schedules Board Meeting to Approve Q2 Results and Consider 2:1 Bonus Share Issue",
            "Summary": "Godfrey Phillips India Limited has scheduled a Board of Directors meeting for August 4, 2025, with two key agenda items. The board will consider and approve the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. Additionally, the board will consider recommending a bonus equity share issuance in the ratio of 2:1 to shareholders, meaning 2 new fully paid-up equity shares of Rs. 2 each for every 1 existing fully paid-up equity share of Rs. 2 each, through capitalization of reserves. The trading window for company shares has been closed from July 1, 2025, and will remain closed until August 6, 2025, for designated persons and their immediate relatives.",
            "Sentiment": "positive",
            "PublishDate": 1753708022902,
            "Source": "corporate_action"
        },
        {
            "Title": "Godfrey Phillips India: Stock Soars 8%, Doubles in 6 Months",
            "Summary": "Godfrey Phillips India shares surged 8% to Rs 9,742, pushing market cap to Rs 50,590 crore. The stock has doubled in value over the past six months, delivering 101% returns. It's trading near its 52-week high of Rs 9,824, with strong bullish momentum across all key moving averages.",
            "Sentiment": "positive",
            "PublishDate": 1752567272000,
            "Source": "normal_news"
        },
        {
            "Title": "Godfrey Phillips Discusses Potential GST Rate Increase",
            "Summary": "Godfrey Phillips is reportedly discussing a possible increase in GST rates for cigarettes, carbonated beverages, and luxury vehicles. The news article does not provide any specific details about the discussions or potential rate changes.",
            "Sentiment": "neutral",
            "PublishDate": 1751447726000,
            "Source": "default"
        },
        {
            "Title": "Godfrey Phillips India: Court Dismisses Defamation Case Against Samir Modi",
            "Summary": "A Delhi Court quashed a defamation case filed by Godfrey Phillips India Ltd.'s directors against Samir Modi. The case was related to statements about an alleged assault during a board meeting. The court found no merit in the defamation charges, stating that reporting a police complaint should not be treated as defamatory.",
            "Sentiment": "neutral",
            "PublishDate": 1747751817000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Godfrey Phillips: Q4 Profit Soars 31%, Revenue Up 70%",
            "Summary": "Godfrey Phillips reported a 30.7% YoY increase in Q4 FY25 consolidated net profit to Rs 293.96 crore. Revenue from operations surged 70.6% to Rs 1,887.79 crore. For FY25, net profit grew 24.45% to Rs 1,152.89 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747367431000,
            "Source": "earnings"
        },
        {
            "Title": "Godfrey Phillips India Reports Q4 Financial Results and Dividend",
            "Summary": "Godfrey Phillips India announced its Q4 consolidated net profit of 2.8 billion rupees, compared to 2.15 billion rupees year-over-year and 3.2 billion rupees quarter-over-quarter. Q4 revenue increased to 18.9 billion rupees from 11.1 billion rupees year-over-year. The company has recommended a dividend of 60 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747354176000,
            "Source": "default"
        },
        {
            "Title": "Godfrey Phillips India: Q4 Profit Surges 30%, Announces ₹60 Dividend",
            "Summary": "Godfrey Phillips India reported a 30% YoY increase in Q4 net profit to ₹279.6 crore. Revenue grew 79.8% to ₹1,573.4 crore. EBITDA rose 41.2% to ₹269 crore, though margins contracted. The company announced a final dividend of ₹60 per share for FY25, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1747314773000,
            "Source": "earnings"
        },
        {
            "Title": "Godfrey Phillips India Announces Dividend of ₹60 per Share",
            "Summary": "Godfrey Phillips India has recommended a dividend of 60 rupees per equity share for its shareholders. This announcement represents a significant corporate action that will directly benefit the company's investors.",
            "Sentiment": "positive",
            "PublishDate": 1747312325000,
            "Source": "result"
        },
        {
            "Title": "Godfrey Phillips India Reports Strong Q4 Financial Results",
            "Summary": "Godfrey Phillips India announced its Q4 financial results, showing significant year-over-year growth. The company's EBITDA increased to 2.7 billion rupees from 1.88 billion rupees in the previous year. However, the EBITDA margin decreased slightly to 14.25% from 15.7%. The consolidated net profit rose to 2.8 billion rupees from 2.15 billion rupees year-over-year. Quarterly revenue saw a substantial increase to 18.9 billion rupees from 11.1 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747312214000,
            "Source": "result"
        },
        {
            "Title": "Godfrey Phillips India to Consider Q4 Results on May 15",
            "Summary": "Godfrey Phillips India has announced that it will consider its fourth quarter financial results on May 15. This indicates the company is preparing to disclose its performance for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1746706612000,
            "Source": "default"
        },
        {
            "Title": "Godfrey Phillips India Receives Administrative Warning from SEBI",
            "Summary": "Godfrey Phillips India has been issued an administrative warning by the Securities and Exchange Board of India (SEBI). The regulatory body alleges that the company has violated multiple regulations, though specific details of the violations were not provided in the news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1741081205000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Godfrey Phillips India: Share Price Doubles Despite Recent Dip",
            "Summary": "Godfrey Phillips India's stock has surged 103% over the past year, despite a recent 21% decline in five sessions due to potential GST increases on tobacco products. The company reported a 49% YoY growth in Q3FY25 consolidated net profit to ₹315.84 crore. Analysts view the recent correction as a buying opportunity, citing strong fundamentals and market position.",
            "Sentiment": "positive",
            "PublishDate": 1740396877000,
            "Source": "earnings"
        },
        {
            "Title": "Godfrey Phillips India: Shares Surge 55% in Three Days on Strong Q3 Results",
            "Summary": "Godfrey Phillips India's stock jumped 10% on February 18, extending a three-day rally to 54.84%. The company reported a 48.7% increase in Q3 net profit to ₹315.9 crore, with revenue up 27.3% to ₹1,591.2 crore. EBITDA rose 57.6% to ₹358.8 crore, with margin expanding to 22.6%.",
            "Sentiment": "positive",
            "PublishDate": 1739857938000,
            "Source": "earnings"
        },
        {
            "Title": "Godfrey Phillips India: Shares Surge 36% in Two Days Following Strong Q3 Results",
            "Summary": "Godfrey Phillips India's stock price rose 13.67% on Monday, following a 20% gain in the previous session, totaling a 36.4% increase over two days. The surge comes after the company reported a 48.7% increase in Q3 net profit to ₹315.9 crore and a 27.3% rise in revenue to ₹1,591.2 crore. EBITDA grew by 57.6% to ₹358.8 crore, with margins expanding to 22.6%.",
            "Sentiment": "positive",
            "PublishDate": 1739769750000,
            "Source": "earnings"
        },
        {
            "Title": "Godfrey Phillips India Reports Strong Q3 Financial Results",
            "Summary": "Godfrey Phillips India has announced its Q3 consolidated financial results. The company's net profit increased to 3.15 billion rupees, up from 2.12 billion rupees year-over-year and 2.5 billion rupees quarter-over-quarter. Revenue also saw significant growth, reaching 18.95 billion rupees compared to 14.87 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739492266000,
            "Source": "earnings"
        },
        {
            "Title": "Godfrey Phillips India Reports Strong Q3 Financial Performance",
            "Summary": "Godfrey Phillips India has announced its Q3 financial results, showing significant improvement in key metrics. The company's EBITDA increased to 3.6 billion rupees, up from 2.28 billion rupees in the same quarter last year. Additionally, the EBITDA margin improved to 18.93% from 15.31% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739450874000,
            "Source": "earnings"
        },
        {
            "Title": "Godfrey Phillips India Reports Strong Q3 Financial Results",
            "Summary": "Godfrey Phillips India has announced its Q3 consolidated financial results. The company's net profit increased to 3.15 billion rupees, up from 2.12 billion rupees year-over-year and 2.5 billion rupees quarter-over-quarter. Revenue also saw significant growth, reaching 18.95 billion rupees compared to 14.87 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739450823000,
            "Source": "earnings"
        },
        {
            "Title": "Godfrey Phillips India to Consider Q3 Results on February 13",
            "Summary": "Godfrey Phillips India Limited has announced that it will consider and approve its financial results for the third quarter of the current fiscal year on February 13. This meeting of the company's board of directors will review and potentially approve the quarterly performance figures.",
            "Sentiment": "neutral",
            "PublishDate": 1738851133000,
            "Source": "earnings"
        },
        {
            "Title": "Godfrey Phillips India Ltd: Receives ₹166 Crore GST Demand Order",
            "Summary": "Godfrey Phillips India Ltd received a GST demand order of ₹166 crore from CGST and Central Excise, Belapur, Navi Mumbai. The order includes ₹70.34 crore in GST, ₹12.56 crore in GST Compensation Cess, and ₹82.90 crore in penalties. The company plans to appeal the order, which alleges undervaluation of goods supply.",
            "Sentiment": "negative",
            "PublishDate": 1738694712958,
            "Source": "order&deals"
        },
        {
            "Title": "Godfrey Phillips India: New COO Appointment Boosts Shares",
            "Summary": "Godfrey Phillips India Ltd. shares surged over 9% following the appointment of Siddharth Chawla as Chief Operating Officer, effective January 7, 2025. Chawla brings 24 years of experience, including a background at ITC Ltd. The company recently reported a 23% rise in Q2 consolidated net profit.",
            "Sentiment": "positive",
            "PublishDate": 1735202521000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Twenty Four Seven Retail Stores Files Lawsuit Against Godfrey Phillips India",
            "Summary": "Godfrey Phillips India has reported that Twenty Four Seven Retail Stores has filed a lawsuit against the company regarding royalty payments. The suit demands royalty payments and damages amounting to 20 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1735052963000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Godfrey Phillips India: Declares ₹35 Interim Dividend, Q2 Profit Up 23%",
            "Summary": "Godfrey Phillips India announced an interim dividend of ₹35 per share, with a record date of November 29, 2024. The company reported a 23% increase in Q2 consolidated net profit to ₹248.31 crore, driven by higher sales. Revenue from operations rose to ₹1,651.42 crore. The cigarette and tobacco segment saw growth, while retail revenue declined.",
            "Sentiment": "positive",
            "PublishDate": 1732016832000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godfrey Phillips India Declares Interim Dividend",
            "Summary": "Godfrey Phillips India has announced an interim dividend of 35 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1732015950000,
            "Source": "corporate_action"
        }
    ]
}