{
    "Symbol": "GODIGIT",
    "ISIN": "INE03JT01014",
    "News": [
        {
            "Title": "Go Digit Q3 FY26 Results: Profit Jumps 37% to Rs. 163 Cr",
            "Summary": "Go Digit General Insurance reports 37% profit growth to Rs. 163 crores in Q3 FY26, with GDPI growing 20.9% to Rs. 2,557 crores. IFRS combined ratio improves to 105% from 106.2% last year.",
            "Sentiment": "positive",
            "PublishDate": 1769699639560,
            "Source": "co_actions_results"
        },
        {
            "Title": "Go Digit Q3 FY26 PBT Surges 37% to ₹163 Crore",
            "Summary": "Go Digit General Insurance reports strong Q3 FY26 performance with profit before tax jumping 36.9% to ₹163 crore. Nine-month PBT of ₹459 crore already exceeds full FY25 figure of ₹425 crore, demonstrating robust growth trajectory.",
            "Sentiment": "positive",
            "PublishDate": 1769087782033,
            "Source": "co_actions_results"
        },
        {
            "Title": "Go Digit schedules Q3FY26 earnings call for Jan 22",
            "Summary": "Go Digit General Insurance has announced its Q3 and nine months FY2026 results conference call scheduled for January 22, 2026, at 7:00 PM IST, hosted by ICICI Securities.",
            "Sentiment": "neutral",
            "PublishDate": 1768398786236,
            "Source": "co_actions_results"
        },
        {
            "Title": "Go Digit Reports 22% Premium Growth Year-on-Year",
            "Summary": "Go Digit General Insurance demonstrates strong business performance with a significant 22% increase in premium collections compared to the previous year, highlighting the company's growth trajectory.",
            "Sentiment": "positive",
            "PublishDate": 1767777412783,
            "Source": "co_actions_results"
        },
        {
            "Title": "Go Digit Insurance Credit Rating on Watch",
            "Summary": "CRISIL places Go Digit General Insurance's AA- credit rating on Rating Watch with Developing Implications following the company's proposed amalgamation scheme announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1767194711643,
            "Source": "stocks"
        },
        {
            "Title": "Go Digit Insurance Grants 25 Lakh Stock Options",
            "Summary": "Go Digit General Insurance's board committee approved granting 25,05,074 stock options to eligible employees under ESOP 2018 scheme on December 23, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766600626251,
            "Source": "stocks"
        },
        {
            "Title": "Go Digit Holds Conference Call on Amalgamation Scheme",
            "Summary": "Go Digit General Insurance conducted analyst conference call on December 24 to discuss amalgamation with holding company. Management clarified no capital raising needs with 226% solvency ratio.",
            "Sentiment": "neutral",
            "PublishDate": 1766164245439,
            "Source": "co_actions_results"
        },
        {
            "Title": "Go Digit General Insurance Shareholders Approve ESOP Amendment and Director Appointments",
            "Summary": "Go Digit General Insurance shareholders passed three resolutions through postal ballot, including amendment to Employee Stock Option Plan 2018 extending exercise period from 4 to 8 years and appointment of two new directors. Giridhar Aramane was appointed as Non-Executive Independent Director and Michael Wallace as Non-Executive Director, both effective November 1, 2025, with all resolutions receiving over 99% approval from voting shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1764680455835,
            "Source": "corporate_governance"
        },
        {
            "Title": "Go Digit General Insurance Reports Strong Q2 Performance with 15.6% Growth and Highest Motor Market Share",
            "Summary": "Go Digit General Insurance reported quarterly premium of INR 2,667 crores with a growth rate of 15.6% without I/n basis, outpacing industry growth of 10%. The company achieved its highest-ever Motor OD market share of 6.2% since inception. H1 premium reached INR 5,649 crores with overall market share of 3.4% and Motor market share of 6.5%. Profit before tax increased to INR 136 crores from INR 89 crores, while profit after tax was INR 117 crores at 14% tax rate. Combined ratio improved to 109.9% compared to 112.2% in the same quarter last year on a without I/n basis. The company's two-wheeler business now comprises 30% of motor mix, up from 27% last year, though this impacts profitability as commission for 5 years is provided upfront while premium is earned over the policy period. Assets under management increased to INR 21,345 crores with solvency ratio of 2.26. The company disclosed deferred acquisition cost of INR 1,708 crores as of September 30, with INR 710 crores expected to benefit H2 results. Net worth increased to INR 4,290 crores from INR 3,805 crores last year.",
            "Sentiment": "positive",
            "PublishDate": 1762203149779,
            "Source": "earnings"
        },
        {
            "Title": "Go Digit Insurance Reports Improved Claims Processing Times and Customer Service Metrics",
            "Summary": "Go Digit General Insurance Limited released its 13th Transparency Report covering the first half of fiscal year 2025-26. The company reported significant improvements in claims processing times across health and motor insurance. For health insurance, cashless pre-authorization averaged 26.9 minutes with fastest approval in 7 minutes, hospital discharge approvals averaged 52.5 minutes, and reimbursement claims were settled in an average of 2.4 days. Motor insurance work approval times improved by 52 minutes to 14 hours 44 minutes overall. Customer service metrics showed enhanced performance with social media first response time improving from 20 minutes to 6 minutes 15 seconds, and social media closure time dropping from 32.5 hours to 20.5 hours. The company's claims settlement ratio increased to 97.2% from 96.2% in the previous period. Go Digit also received 11 awards during the period, including the Best Fintech Insurance Award at the Financial Express Best Banks Awards 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762164423718,
            "Source": "stock"
        },
        {
            "Title": "GoDigit General Insurance Seeks Shareholder Approval for ESOP Amendment and Director Appointments",
            "Summary": "GoDigit General Insurance has issued a postal ballot notice seeking shareholder approval for three key resolutions. The company proposes to amend its Employee Stock Option Plan 2018 by extending the exercise period from 4 years to 8 years from the date of vesting. Additionally, shareholders will vote on appointing Giridhar Aramane as Non-Executive Independent Director for a five-year term and Michael Wallace as Non-Executive Director. The e-voting period runs from October 31, 2025, to November 29, 2025, with results to be announced by December 2, 2025. Giridhar Aramane is a former IAS officer with over 30 years of public service experience, including roles as Defense Secretary and Executive Director at IRDAI. Michael Wallace brings over 30 years of property casualty insurance experience and currently serves as Vice President at Fairfax Financial Holdings Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1761845540928,
            "Source": "corporate_action"
        },
        {
            "Title": "Go Digit General Insurance Shares Rise 1% as Brokerages Upgrade Targets After Strong Quarterly Results",
            "Summary": "Go Digit General Insurance shares traded 1.04% higher at ₹364.50 following brokerage upgrades after strong quarterly performance. Jefferies raised its target price to ₹440 from ₹410 with a 'Buy' rating, citing healthy motor insurance growth. Citi increased its target to ₹420 from ₹410, also maintaining 'Buy', highlighting improved underwriting loss ratio of -11.8% and rising market share. The insurer reported profit before tax of ₹136 crore, up 53% year-on-year, while profit after tax grew 31% to ₹117 crore. Gross written premium increased 12.6% to ₹2,667 crore. The combined ratio improved to 111.4% from 112.2% year-on-year. Assets under management reached ₹21,345 crore as of September 30, 2025, up 15.4% year-on-year. The company holds unrealized gains of ₹680 crore, representing 88% of H1 FY26 investment income, with solvency ratio at 2.26 times.",
            "Sentiment": "positive",
            "PublishDate": 1761719927942,
            "Source": "stock"
        },
        {
            "Title": "Go Digit General Insurance Reports 53% Jump in Q2 Profit, Appoints Two New Directors",
            "Summary": "Go Digit General Insurance reported quarterly results for the period ended September 30, 2025, showing profit before tax of ₹136 crore compared to ₹89 crore in the same quarter last year, representing a 53% increase. Profit after tax grew 31% to ₹117 crore from ₹89 crore. Gross Written Premium increased 12.6% to ₹2,667 crore from ₹2,369 crore. The company's combined ratio improved to 111.4% from 112.2% in the previous year quarter. Assets under management stood at ₹21,345 crore, up 15.4% from ₹18,502 crore. The solvency ratio was maintained at 2.26x, above the regulatory minimum of 1.50x. The board approved the appointment of Giridhar Aramane as Non-Executive Independent Director and Michael Wallace as Non-Executive Director, both effective November 1, 2025, subject to shareholder approval. The company's net retention ratio was 79.1% and loss ratio was 73.0% for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761656138787,
            "Source": "corporate_action"
        },
        {
            "Title": "Go Digit General Insurance Receives ₹11.66 Crore GST Notice",
            "Summary": "Go Digit General Insurance has received a GST notice worth ₹11.66 crore. The company plans to respond to the notice and states there will be no immediate financial impact from this development.",
            "Sentiment": "neutral",
            "PublishDate": 1758814558717,
            "Source": "stock"
        },
        {
            "Title": "India Considers Increasing Motor Third-Party Insurance Premiums",
            "Summary": "India is considering an increase in motor third-party insurance premiums. The potential premium hike would affect vehicle owners across the country who are required to maintain third-party insurance coverage.",
            "Sentiment": "negative",
            "PublishDate": 1757654382675,
            "Source": "sectoral"
        },
        {
            "Title": "Go Digit Reports Month-Over-Month Premium Decline",
            "Summary": "Go Digit has reported a significant decline in premiums compared to the previous month. The insurance company experienced a notable drop in its premium collections during this period.",
            "Sentiment": "negative",
            "PublishDate": 1757323640613,
            "Source": "stock"
        },
        {
            "Title": "Go Digit General Insurance Sees Rs. 15.63 Crore Block Trade on NSE",
            "Summary": "Go Digit General Insurance Ltd. witnessed a block trade worth Rs. 15.63 crores on the National Stock Exchange. The transaction involved approximately 423,956 shares at a price of Rs. 368.65 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1756094189399,
            "Source": "order&deals"
        },
        {
            "Title": "Go Digit General Insurance Reports 59% Jump in Profit Before Tax to INR 161 Crores in Q1 FY26",
            "Summary": "Go Digit General Insurance reported profit before tax of INR 161 crores for the quarter ended June 30, 2025, compared to INR 101 crores in the same period last year. The company expects to pay taxes for the first time at an estimated rate of 13.9% for the full year, resulting in profit after tax of INR 138 crores. Gross written premium grew 12.1% (14.5% excluding 1/n impact). The company's net retention ratio declined to 65.4% from 76.2% last year, primarily due to increased cessions in fire business and strong growth in 2-wheeler segment. Loss ratio improved slightly to 70.3% from 70.5% in the previous year. Assets under management increased significantly to INR 20,861 crores, up by roughly INR 3,100 crores year-on-year. The company showed strong growth in property business at 40% compared to industry's 17%. Net worth increased to INR 4,173 crores from INR 4,033 crores in March 2025, with solvency ratio remaining strong at 227%. Customer base grew to 7.1 crores.",
            "Sentiment": "positive",
            "PublishDate": 1753968344218,
            "Source": "earnings"
        },
        {
            "Title": "Go Digit General Insurance Reports 36.6% Jump in Quarterly Profit, Senior Executive Resigns",
            "Summary": "Go Digit General Insurance Limited reported profit after tax of ₹138 crore for the quarter ended June 30, 2025, compared to ₹101 crore in the same period last year, representing a 36.6% increase. Gross Written Premium grew 12.1% to ₹2,982 crore from ₹2,660 crore year-on-year. The company's combined ratio stood at 108.6% versus 105.4% in the previous year quarter. Assets under management increased 17.4% to ₹20,861 crore. The solvency ratio improved to 2.27x from 2.24x in March 2025, above the regulatory minimum of 1.50x. Separately, the company announced the resignation of Mr. Atul Mehta, Country Head – Retail Geographies & Key Partnerships, effective August 11, 2025, citing personal considerations. The company's expenses relating to insurance business exceeded regulatory limits for the quarter, and it has sought forbearance from IRDAI.",
            "Sentiment": "positive",
            "PublishDate": 1753706454333,
            "Source": "earnings"
        },
        {
            "Title": "Go Digit General Insurance Reports 40% Jump in Quarterly Net Profit",
            "Summary": "Go Digit General Insurance reported a net profit of 1.4 billion rupees for the quarter, representing a 40% increase from 1 billion rupees in the same period last year. The company's revenue grew to 18.65 billion rupees compared to 18.2 billion rupees year-over-year, marking a 2.5% increase. The results show strong profitability growth despite modest revenue expansion.",
            "Sentiment": "positive",
            "PublishDate": 1753705446989,
            "Source": "earnings"
        },
        {
            "Title": "Go Digit General Insurance Submits Digital Resignation Evidence for Nikhil Kamdar",
            "Summary": "Go Digit General Insurance Limited provided an update to stock exchanges regarding Nikhil Kamdar's resignation from senior management. The company submitted a screenshot from its internal HRMS portal as evidence of Kamdar's digital resignation, clarifying that no physical resignation letter was received as the company follows a digital resignation process. The update references previous disclosures made on March 28, 2025 and July 1, 2025 regarding Kamdar's resignation and Adarsh Agarwal's appointment, with no changes to those earlier submissions. The company stated this update should be read alongside the previous disclosures for regulatory compliance purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1753447878535,
            "Source": "corporate_governance"
        },
        {
            "Title": "Go Digit General Insurance Seeks Shareholder Approval for IFSC Insurance Office Setup",
            "Summary": "Go Digit General Insurance has issued a postal ballot notice seeking shareholder approval to establish an IFSC Insurance Office (IIO) in Gujarat International Finance Tech City (GIFT IFSC). The e-voting period runs from July 25 to August 23, 2025, with July 18, 2025 as the cut-off date for eligible shareholders. The proposed IIO would conduct various insurance activities including coverage for Non-Resident Indians, Overseas Citizens of India, group insurance for SEZ entities, inward reinsurance, and policies under the Liberalised Remittance Scheme. The Board approved this initiative in October 2024 and has recommended the resolution for shareholder approval. IIOs benefit from regulatory incentives including a 10-year income tax holiday, GST exemptions on specified services, and operate under a light-touch regulatory framework without mandatory assigned capital requirements within the IFSC.",
            "Sentiment": "positive",
            "PublishDate": 1753194984224,
            "Source": "corporate_action"
        },
        {
            "Title": "Bombay High Court Cancels ₹170 Crore Tax Demand Against Go Digit General Insurance",
            "Summary": "The Bombay High Court has canceled a tax demand of ₹170 crore against Go Digit General Insurance. The court's decision overturns the previously imposed tax liability on the company.",
            "Sentiment": "positive",
            "PublishDate": 1751644805000,
            "Source": "default"
        },
        {
            "Title": "Government Proposes 10% Increase in Third-Party Motor Insurance Premium",
            "Summary": "The Indian government has proposed a 10% increase in third-party motor insurance premiums. This proposal affects Go Digit General Insurance and potentially other insurance providers in the country. The news suggests a significant change in the motor insurance sector, which could impact both insurance companies and vehicle owners.",
            "Sentiment": "neutral",
            "PublishDate": 1750389362000,
            "Source": "default"
        },
        {
            "Title": "Go Digit Reports Potential Impact of Motor Third-Party Premium Increase",
            "Summary": "Go Digit has reported that an 18% increase in motor third-party premiums could potentially improve India's combined ratio by 400-500 basis points. This suggests a significant impact on the insurance industry's profitability metrics.",
            "Sentiment": "positive",
            "PublishDate": 1750227941000,
            "Source": "default"
        },
        {
            "Title": "Road Ministry Evaluating Increase in Motor Third Party Premiums",
            "Summary": "The Road Ministry is considering an increase in motor third party premiums for FY26. This evaluation comes after a request from the Insurance Regulatory and Development Authority of India (IRDAI) for an average rise of 18% in these premiums.",
            "Sentiment": "neutral",
            "PublishDate": 1749196650000,
            "Source": "default"
        },
        {
            "Title": "Go Digit General Insurance Reports Strong Q4 Profit Growth",
            "Summary": "Go Digit General Insurance has reported a significant increase in net profit for Q4, rising to 1.16 billion rupees from 527 million rupees year-over-year. This represents a 120% increase. The company also saw quarter-over-quarter growth from 1.19 billion rupees. Revenue for Q4 increased to 25.76 billion rupees, up from 23 billion rupees in the same quarter last year, showing a 12% growth.",
            "Sentiment": "positive",
            "PublishDate": 1745885415000,
            "Source": "default"
        },
        {
            "Title": "GO DIGIT GENERAL INSURANCE Reports Strong Q4 Financial Results",
            "Summary": "GO DIGIT GENERAL INSURANCE has announced its Q4 financial results. The company's revenue increased to 25.76 billion rupees, up from 23 billion rupees in the same quarter last year. The standalone net profit for Q4 rose significantly to 1.16 billion rupees, compared to 527 million rupees year-over-year and 1.19 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745848047000,
            "Source": "result"
        },
        {
            "Title": "Go Digit General Insurance Ltd: Q4 Net Profit Doubles, AUM Grows 25%",
            "Summary": "Go Digit General Insurance Ltd reported a 118.9% YoY increase in Q4 net profit to ₹116 crore. FY25 profit after tax rose 133.5% to ₹425 crore. Q4 gross written premium grew 13.5% to ₹2,652 crore. FY25 ROAE improved to 13%. AUM as of March 31, 2025, increased 25% to ₹19,703 crore. Solvency ratio strengthened to 2.24x.",
            "Sentiment": "positive",
            "PublishDate": 1745840936000,
            "Source": "earnings"
        },
        {
            "Title": "Go Digit General Insurance: Q4 Results Date Announced",
            "Summary": "Go Digit General Insurance will release Q4 and FY 2024-25 results on April 28, 2025. The Board meeting is scheduled for the same day to approve the audited financial results. An earnings call with investors and analysts is planned for 5 p.m. on April 28.",
            "Sentiment": "neutral",
            "PublishDate": 1745746179000,
            "Source": "corporate_action"
        },
        {
            "Title": "IRDAI Approves R2 Licence for Value Attics Reinsurance",
            "Summary": "The Insurance Regulatory and Development Authority of India (IRDAI) has granted an R2 licence to Value Attics Reinsurance, a subsidiary of Go Digit General Insurance. This approval allows Value Attics Reinsurance to operate as a reinsurance company in India, potentially expanding Go Digit's presence in the insurance sector.",
            "Sentiment": "positive",
            "PublishDate": 1741856939000,
            "Source": "corporate_action"
        },
        {
            "Title": "Go Digit General Insurance: Launches AQI-Based Parametric Insurance for Delhi-NCR Migrant Workers",
            "Summary": "Go Digit General Insurance partners with K.M. Dastur Reinsurance Brokers to offer parametric insurance for migrant construction workers in Delhi-NCR. The policy provides payouts up to ₹6,000 for 6,200 workers if AQI exceeds 400 on multiple occasions, protecting against wage loss during pollution-induced construction bans.",
            "Sentiment": "positive",
            "PublishDate": 1740476194000,
            "Source": "normal_news"
        },
        {
            "Title": "Go Digit General Insurance Reports Strong Q3 Financial Results",
            "Summary": "Go Digit General Insurance has announced its financial results for the third quarter. The company's net profit increased significantly to 1.19 billion rupees, compared to 429 million rupees in the same period last year. Revenue also saw growth, reaching 20.84 billion rupees, up from 19.8 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1737591183000,
            "Source": "earnings"
        },
        {
            "Title": "Go Digit General Insurance Reports Significant Profit Growth in Q3",
            "Summary": "Go Digit General Insurance has announced its financial results for the third quarter. The company reported a net profit of 1.19 billion rupees, a substantial increase from 429 million rupees in the same period last year. Revenue also saw growth, rising to 20.84 billion rupees from 19.8 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1737550755000,
            "Source": "earnings"
        },
        {
            "Title": "Go Digit General Insurance: Q3 Results Announcement Scheduled for January 22",
            "Summary": "Go Digit General Insurance Ltd. will release its Q3 FY2025 results on January 22, 2025, after a board meeting. An earnings call is scheduled for 7:30 p.m. the same day. The company will report unaudited financial results for the quarter and nine months ended December 31, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1737363643000,
            "Source": "corporate_action"
        },
        {
            "Title": "GO DIGIT GENERAL INSURANCE LTD. BLOCK TRADE ON NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for GO DIGIT GENERAL INSURANCE LTD. The transaction involved approximately 2,450,549 shares, traded at a price of Rs. 291.95 per share. The total value of the block trade amounted to Rs. 71.54 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1737353845000,
            "Source": "block_deals"
        },
        {
            "Title": "Go Digit General Insurance Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) involving Go Digit General Insurance Ltd. The transaction involved approximately 3,545,272 shares, traded at a price of Rs. 298.45 per share. The total value of the block trade amounted to Rs. 105.81 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1737088007000,
            "Source": "block_deals"
        },
        {
            "Title": "FTSE Rebalancing: Stock to Receive $19 Million Inflow",
            "Summary": "A stock is set to experience significant inflows of approximately $19 million (Rs 1.62 billion) due to the FTSE index rebalancing, which is scheduled to occur today at 3 PM.",
            "Sentiment": "positive",
            "PublishDate": 1734671177000,
            "Source": "corporate_action"
        },
        {
            "Title": "Go Digit General Insurance Reports 4% Decline in November 2024 Premium",
            "Summary": "Go Digit General Insurance has reported a 4% decrease in premium for November 2024 compared to the same month in the previous year. This contrasts with the 36% growth experienced in November 2023.",
            "Sentiment": "negative",
            "PublishDate": 1733823091000,
            "Source": "result"
        },
        {
            "Title": "Digit Insurance: Claims Processing Efficiency Highlighted in Transparency Report",
            "Summary": "Go Digit General Insurance Limited released its 11th Transparency Report, showcasing quick turnaround times for claims across various insurance verticals. Motor insurance claims were approved in an average of 12 hours, health insurance cashless pre-authorisations in 25.79 minutes, and travel insurance handled a ₹12.36 lakh emergency claim. The company settled 441,275 claims and sold over 5.7 million policies between April and September 2024.",
            "Sentiment": "positive",
            "PublishDate": 1733112176000,
            "Source": "normal_news"
        },
        {
            "Title": "GO DIGIT General Insurance Reports Strong Q2 Profit Growth",
            "Summary": "GO DIGIT General Insurance has reported a significant increase in net profit for Q2, rising to 895 million rupees from 277 million rupees year-over-year. This also represents a substantial increase from 1 billion rupees quarter-over-quarter. The company's net premium written for Q2 grew to 19.3 billion rupees, up from 18.2 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1729772667000,
            "Source": "result"
        },
        {
            "Title": "Go Digit: Q2 GWP Up 14%, Profit Triples",
            "Summary": "Go Digit General Insurance reported Q2 FY25 results: Gross written premium increased 14% to ₹2,369 crore. Profit after tax surged 221.4% to ₹89 crore. Premium retention ratio decreased to 81.4%. Total assets under management grew 17.4% to ₹18,502 crore. Combined ratio rose to 112.2%.",
            "Sentiment": "positive",
            "PublishDate": 1729768386000,
            "Source": "result"
        },
        {
            "Title": "Go Digit General Insurance Schedules Board Meeting for Q2 Results",
            "Summary": "<p><span class='neutral'>Go Digit General Insurance</span> has announced a <span class='neutral'>board meeting</span> scheduled for <b>October 24</b> to <span class='neutral'>consider and approve</span> the <span class='neutral'>financial results</span> for the <span class='neutral'>second quarter</span> of the current <span class='neutral'>fiscal year</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728629554000,
            "Source": "result"
        }
    ]
}