{
    "Symbol": "GODREJIND",
    "ISIN": "INE233A01035",
    "News": [
        {
            "Title": "Godrej Industries Q3FY26 Results Show Mixed Performance",
            "Summary": "Godrej Industries reported consolidated revenue of ₹5,697.59 crore for Q3FY26, up 11% YoY, with net profit of ₹352.68 crore. Nine-month revenue reached ₹17,706.25 crore, growing 14% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1770831413707,
            "Source": "co_actions_results"
        },
        {
            "Title": "Godrej Industries Board Meet Set for Feb 11, 2026",
            "Summary": "Godrej Industries Limited has scheduled a board meeting on February 11, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770224999403,
            "Source": "co_actions_results"
        },
        {
            "Title": "Godrej Industries Completes ₹3,862 Crore Investment",
            "Summary": "Godrej Industries completes ₹3,862 crore investment in new subsidiary Godrej Investment Limited and transfers full equity stake in Godrej Capital Limited, converting it into step-down subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1769659271159,
            "Source": "co_actions_results"
        },
        {
            "Title": "Godrej Industries Forms New Investment Subsidiary",
            "Summary": "Godrej Industries has established Godrej Investment Limited as a new wholly owned subsidiary to expand its corporate structure and investment capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1767711785901,
            "Source": "stocks"
        },
        {
            "Title": "Godrej Industries Incorporates New Subsidiary",
            "Summary": "Godrej Industries Limited has incorporated Godrej Investment Limited as a wholly owned subsidiary on January 5, 2026, to carry on financial services business following board and shareholder approvals.",
            "Sentiment": "positive",
            "PublishDate": 1767711762128,
            "Source": "co_actions_results"
        },
        {
            "Title": "Godrej Industries Plans ₹100+ Billion Investment",
            "Summary": "Godrej Industries announces major investment commitment of over ₹100 billion in Telangana, marking significant expansion plans for the chemical sector company.",
            "Sentiment": "positive",
            "PublishDate": 1765375145793,
            "Source": "stocks"
        },
        {
            "Title": "Godrej Industries Plans Major Investment in Telangana",
            "Summary": "Godrej Industries announced plans to invest over 100 billion rupees in Telangana state. The significant capital deployment represents a major expansion move by the diversified conglomerate in the region.",
            "Sentiment": "positive",
            "PublishDate": 1765322790296,
            "Source": "order&deals"
        },
        {
            "Title": "Godrej Industries Allots 1,705 Equity Shares Under Employee Stock Grant Scheme",
            "Summary": "Godrej Industries' Nomination and Remuneration Committee approved allotment of 1,705 equity shares at ₹1 per share under ESGS 2011, with employees exercising grants for ₹1,705. The company's paid-up equity share capital increased to ₹33,68,04,842 effective November 27, 2025, with new shares ranking equally with existing shares including dividend rights.",
            "Sentiment": "neutral",
            "PublishDate": 1764241416273,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Industries Grants 832 Stock Options Under ESGS 2011 Scheme",
            "Summary": "Godrej Industries' Nomination and Remuneration Committee approved the grant of 832 stock options to eligible employees at an exercise price of Re 1 per option, with vesting over 3 years. The committee also noted the lapse of 683 previously issued stock grants under the Employee Stock Grant Scheme 2011.",
            "Sentiment": "neutral",
            "PublishDate": 1763636444638,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Foundation Sells 3.33% Stake in Godrej Industries Through Block Deal",
            "Summary": "Godrej Foundation disposed of 1.12 crore shares representing 3.33% stake in Godrej Industries Limited through an open market block deal on November 14, 2025. The foundation's shareholding in the company reduced from 13.37% to 10.04% following the transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1763385265885,
            "Source": "corporate_action"
        },
        {
            "Title": "Anamudi Real Estates LLP Acquires Additional 1.09% Stake in Godrej Industries",
            "Summary": "Anamudi Real Estates LLP, part of Godrej Industries' promoter group, acquired 36,83,994 equity shares (1.09% stake) through open market block deal on November 14, 2025. The acquisition increased the promoter group's total holding to 74.64% from 71.31%, strengthening promoter control in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1763382021381,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Seeds & Genetics Acquires Additional 2.24% Stake in Godrej Industries Through Block Deal",
            "Summary": "Godrej Seeds & Genetics Limited acquired 75,29,766 equity shares (2.24% stake) in Godrej Industries Limited through an open market block deal on November 14, 2025. The acquisition increased the company's individual holding from 5.56% to 7.79%, while the combined promoter group holding rose from 65.75% to 66.85% in the target company.",
            "Sentiment": "neutral",
            "PublishDate": 1763381685754,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Industries Reports 23% Revenue Growth in Q2 FY26 Despite 16% Drop in Net Profit",
            "Summary": "Godrej Industries Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. Consolidated total income increased 23% to Rs 6,290 crore in Q2 FY26 compared to Rs 5,118 crore in Q2 FY25. However, net profit declined 16% to Rs 242 crore from Rs 288 crore in the previous year. For the half-year period, total income grew 16% to Rs 12,009 crore while net profit decreased 3% to Rs 592 crore. The company's real estate segment showed strong performance with Godrej Properties achieving 64% year-on-year growth in booking value to Rs 8,505 crore in Q2 FY26. The chemicals segment reported 29% revenue growth in Q2 FY26. Godrej Consumer Products, an associate company, recorded 4% sales growth in Q2 FY26. The Board of Directors approved these results at their meeting held on November 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762917016640,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Industries Targets 12-14% Revenue Growth, Projects FY26 EBITDA at ₹1,426 Crore",
            "Summary": "Godrej Industries has set a revenue growth target of 12-14% CAGR driven by its chemicals, FMCG, and real estate segments. The company projects EBITDA of ₹1,426 crore for FY26, representing an 11% year-on-year increase. The company plans to expand its oleochemicals and surfactant exports while its real estate division aims to add 10 million square feet to its launch pipeline. Godrej Industries is focusing on strengthening portfolio synergies across group entities, improving capital expenditure efficiency, and pursuing ESG-led growth initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1762875884860,
            "Source": "stock"
        },
        {
            "Title": "Godrej Industries Q2 Net Profit Falls 16% Despite Revenue Growth",
            "Summary": "Godrej Industries reported Q2 consolidated net profit of 2.42 billion rupees, down from 2.88 billion rupees in the same period last year. Revenue increased to 50.32 billion rupees from 48.05 billion rupees year-over-year. However, EBITDA declined significantly to 1.34 billion rupees from 5.74 billion rupees, while EBITDA margin compressed to 2.66% from 11.96% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762857321213,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Industries Reports ₹8 Crore Raw Material Loss During Transit",
            "Summary": "Godrej Industries reported a loss of ₹8 crore worth of raw materials during transit. The company has confirmed that this loss will not have a material impact on its operations.",
            "Sentiment": "neutral",
            "PublishDate": 1762349832646,
            "Source": "stock"
        },
        {
            "Title": "Godrej Industries Increases Stake in Subsidiary Godrej Capital to 91.11%",
            "Summary": "Godrej Industries Limited has increased its shareholding in subsidiary Godrej Capital Limited from 90.89% to 91.11% through a cash acquisition worth approximately Rs. 409 crore. The company acquired 22,107 equity shares through a rights issue by Godrej Capital. Godrej Capital is a Core Investment Company that holds equity shares of Godrej Housing Finance Limited and Godrej Finance Limited. The subsidiary's total consolidated income has grown significantly over three years, from Rs. 346.91 crore in March 2023 to Rs. 1,620.20 crore in March 2025. The transaction was conducted at arm's length and falls within shareholder-approved investment limits under Section 186 of the Companies Act, 2013.",
            "Sentiment": "positive",
            "PublishDate": 1760623523039,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Industries Raises ₹800 Crore Through Non-Convertible Debentures",
            "Summary": "Godrej Industries Limited has allotted two series of Non-Convertible Debentures totaling ₹800 crore through private placement. Series 1 comprises 40,000 debentures with a face value of ₹1 lakh each, aggregating ₹400 crore, with a 63-month tenor and maturity date of December 20, 2030. Series 2 also comprises 40,000 debentures of ₹1 lakh face value each, totaling ₹400 crore, with a 66-month tenor and maturity date of March 21, 2031. Both series offer a coupon rate of 7.89% per annum payable annually and are unsecured, rated, and listed on the National Stock Exchange. The proceeds will be used for business purposes, investments in body corporates, loan repayment, and general corporate purposes.",
            "Sentiment": "positive",
            "PublishDate": 1758535395727,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Industries Approves ₹800 Crore Non-Convertible Debentures Issue",
            "Summary": "Godrej Industries Limited's Management Committee approved the Key Information Document for issuing up to 80,000 rated, listed, unsecured, redeemable, non-convertible debentures with a face value of ₹1,00,000 each, totaling ₹800 crore through private placement. The issue comprises two series of 27,500 debentures each, worth ₹275 crore per series, with an option to retain over-subscription of ₹125 crore for each series, bringing the total potential to ₹400 crore per series. The debentures will be issued on a private placement basis.",
            "Sentiment": "neutral",
            "PublishDate": 1758012821226,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Industries Reports Mixed Q1 Results, Approves Major Corporate Restructuring",
            "Summary": "Godrej Industries Limited reported quarterly results for the period ended June 30, 2025. On a standalone basis, the company posted a loss of Rs 29.98 crore compared to a profit of Rs 105.26 crore in the same quarter last year. However, consolidated net profit attributable to owners increased to Rs 349.22 crore from Rs 322.49 crore year-on-year. Consolidated total income grew 9% to Rs 5,719 crore. The Board approved a significant corporate restructuring involving the divestment of its entire stake in subsidiary Godrej Capital Limited to a new wholly-owned subsidiary Godrej FS Limited for up to Rs 4,000 crore, subject to shareholder approval through postal ballot. The company also approved investment of up to Rs 5,000 crore in the new financial services entity. Key subsidiaries showed mixed performance - Godrej Properties achieved its highest quarterly net profit of Rs 600 crore, while Godrej Agrovet's total income increased to Rs 2,626 crore from Rs 2,360 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1755074608513,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Industries Reports Growth in Q1 Financial Results",
            "Summary": "Godrej Industries reported consolidated net profit of 3.5 billion rupees compared to 3.2 billion rupees in the same quarter last year. Revenue increased to 44.6 billion rupees from 42.4 billion rupees year-over-year. EBITDA rose to 3.96 billion rupees from 3.3 billion rupees, while EBITDA margin improved to 8.9% from 8% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755073945251,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Industries Sees Minimal Impact from US Tariffs on India",
            "Summary": "Nadir Godrej, chairperson of Godrej Industries Group, stated that 50% US tariffs on India will not significantly impact the company's business. Godrej explained that the Group has very few direct exports to the US, representing a small percentage that could be replaced with domestic market sales. He acknowledged potential second-hand effects through customers who export to the US, but noted these could be mitigated by exporting to other countries. Godrej expressed doubt that India could make sufficient concessions to reduce US duties below 25%, emphasizing the importance of protecting domestic industries like agriculture. He suggested the tariffs might encourage trade cooperation between affected countries including India, Europe, Asia, South America and Africa. Godrej identified opportunities for India's chemical industry to work with or substitute China in supply chains to other countries, though he noted the difficulty of replacing China entirely due to India's reliance on Chinese raw materials.",
            "Sentiment": "neutral",
            "PublishDate": 1754704979785,
            "Source": "stock"
        },
        {
            "Title": "Godrej Industries Files FIR Against Employee, Investigation Underway",
            "Summary": "Godrej Industries has confirmed that an FIR has been filed against an employee. The investigation is currently ongoing, and the company has stated that the impact remains uncertain at this time.",
            "Sentiment": "negative",
            "PublishDate": 1754317713209,
            "Source": "stock"
        },
        {
            "Title": "Godrej Industries: ₹750 Crore Investment for Chemical Business Expansion",
            "Summary": "Godrej Industries plans to invest over ₹750 crore to expand its chemicals business, aiming to become a $1 billion global player by 2030. The expansion includes doubling fatty alcohol and euric acid capacities, tripling speciality chemicals and fermentation capacities, doubling glycerine capacity, and increasing Primary Surfactants capacity. The company is also targeting 75% renewable energy usage.",
            "Sentiment": "positive",
            "PublishDate": 1751530760000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Industries Expands Chemical Production Capacity and Plans Major Investment",
            "Summary": "Godrej Industries has doubled its annual production capacity for fatty alcohol by 35,000 tons and euric acid by 20,000 tons. The company's chemicals business also plans to invest over ₹750 crores to further expand its operations.",
            "Sentiment": "positive",
            "PublishDate": 1751518346000,
            "Source": "default"
        },
        {
            "Title": "Godrej Industries Increases Ownership in Godrej Capital",
            "Summary": "Godrej Industries has raised its ownership percentage in Godrej Capital to 90.89%. The news indicates a significant increase in Godrej Industries' stake in its subsidiary, Godrej Capital.",
            "Sentiment": "positive",
            "PublishDate": 1751293544000,
            "Source": "default"
        },
        {
            "Title": "Godrej Industries Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 535,270 shares of Godrej Industries Ltd. was executed on the National Stock Exchange (NSE) at a price of Rs. 1371.80 per share. The total value of the trade amounted to Rs. 73.43 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1749461047000,
            "Source": "block_details"
        },
        {
            "Title": "Godrej Industries: Q4 Profit Turnaround Boosts Share Price",
            "Summary": "Godrej Industries reported a net profit of Rs 183 crore in Q4, reversing last year's loss. Revenue grew 26.5% to Rs 5,780 crore, with Ebitda up 29.4% to Rs 593.5 crore. Home care segment grew 14%, while personal care saw a 4% increase. Share price rose 3.13% following the results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1747370930000,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Industries Reports Q4 Profit of 1.8 Billion Rupees",
            "Summary": "Godrej Industries announced its Q4 financial results. The company reported a consolidated net profit of 1.8 billion rupees, compared to a loss of 3.12 billion rupees in the same quarter last year. This also represents an increase from 1.9 billion rupees in the previous quarter. Revenue for Q4 stood at 57.8 billion rupees, up from 45.67 billion rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1747354154000,
            "Source": "default"
        },
        {
            "Title": "Godrej Industries Reports Q4 Financial Results",
            "Summary": "Godrej Industries announced its Q4 financial results. The company's EBITDA increased to 5.9 billion rupees from 4.58 billion rupees year-over-year. The EBITDA margin improved to 10.28% from 10.03% year-over-year. Consolidated net profit for Q4 was 1.8 billion rupees, compared to a loss of 3.12 billion rupees in the same quarter last year and a profit of 1.9 billion rupees in the previous quarter. Q4 revenue rose to 57.8 billion rupees from 45.67 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747314391000,
            "Source": "result"
        },
        {
            "Title": "Godrej Industries: Q4 Profit Turnaround with 27% Revenue Growth",
            "Summary": "Godrej Industries reported a net profit of Rs 183 crore in Q4 FY25, reversing a loss of Rs 311.8 crore from the previous year. Revenue increased by 26.5% to Rs 5,780 crore, with EBITDA rising 29.4% to Rs 593.5 crore. The company saw growth across segments, with chemicals up 42% and home care up 14%.",
            "Sentiment": "positive",
            "PublishDate": 1747314058000,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Industries Receives Approval for NCD Listing",
            "Summary": "Godrej Industries has obtained approval for the listing of Non-Convertible Debentures (NCDs) worth 1000 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1745911539000,
            "Source": "default"
        },
        {
            "Title": "Godrej Industries Completes Business Transfer with Savannah Surfactants",
            "Summary": "Godrej Industries' Chemicals Business has announced the completion of a business transfer agreement with Savannah Surfactants. The deal involves the acquisition of Savannah Surfactants' food additives business by Godrej Industries. This strategic move is likely to expand Godrej Industries' portfolio in the chemicals sector, particularly in the food additives segment.",
            "Sentiment": "positive",
            "PublishDate": 1744677224000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Industries Acquires Savannah Surfactants' Food Additives Business",
            "Summary": "Godrej Industries has announced that its Chemicals Business has completed a business transfer agreement with Savannah Surfactants. This transaction involves the acquisition of Savannah Surfactants' food additives business by Godrej Industries, expanding their portfolio in the chemicals sector.",
            "Sentiment": "positive",
            "PublishDate": 1744635094000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Enterprises' Aerospace Unit Partners with 3D Printing Firm EOS",
            "Summary": "Godrej Enterprises' aerospace division has signed an agreement with EOS, a 3D printing technology company. This partnership is likely aimed at enhancing Godrej's capabilities in advanced manufacturing for the aerospace sector. The collaboration could potentially lead to improved production processes and innovative solutions in aerospace manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1743552552000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Enterprises' Aerospace Unit Partners with 3D Printing Company EOS",
            "Summary": "Godrej Enterprises' aerospace division has entered into an agreement with EOS, a leading player in the 3D printing industry. This partnership is likely aimed at enhancing Godrej's capabilities in advanced manufacturing for the aerospace sector.",
            "Sentiment": "positive",
            "PublishDate": 1743525040000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Industries: Promoters Increase Stake, Shares Rise 4%",
            "Summary": "Godrej Industries' shares increased by 4% in intra-day trading on March 20 following promoters' decision to raise their stake in the company.",
            "Sentiment": "positive",
            "PublishDate": 1742456629000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Industries Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for Godrej Industries Ltd. The transaction involved approximately 1,684,529 shares, valued at Rs. 193.43 crores. The shares were traded at a price of Rs. 1148.30 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1741770330000,
            "Source": "block_deals"
        },
        {
            "Title": "Godrej Industries Ltd. Block Trade: 250,112 Shares Sold for Rs. 28.76 Crores",
            "Summary": "A significant block trade of approximately 250,112 shares of Godrej Industries Ltd. occurred on the National Stock Exchange (NSE). The shares were traded at a price of Rs. 1150.00 per share, resulting in a total transaction value of Rs. 28.76 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1741599503000,
            "Source": "block_deals"
        },
        {
            "Title": "Godrej Industries Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 242,907 shares of Godrej Industries Ltd. was executed on the National Stock Exchange (NSE) at a price of Rs. 1153.45 per share. The total value of the transaction amounted to Rs. 28.02 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1741599482000,
            "Source": "block_deals"
        },
        {
            "Title": "Godrej Industries Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade occurred for Godrej Industries Ltd. on the National Stock Exchange (NSE). Approximately 379,521 shares were traded at a price of Rs. 1150.50 per share, resulting in a total transaction value of Rs. 43.66 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1741598224000,
            "Source": "block_deals"
        },
        {
            "Title": "Godrej Industries Invests ₹600 Crore in Chemical Unit Expansion",
            "Summary": "Godrej Industries is investing ₹600 crore to expand its chemical units in Gujarat and Maharashtra. The company's CEO has stated that they are targeting to double their turnover to ₹5,000 crore within the next 3-4 years. This expansion and growth strategy indicates a significant push in the chemical sector for Godrej Industries.",
            "Sentiment": "positive",
            "PublishDate": 1741577658000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Industries Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade of Godrej Industries Ltd. shares occurred on the National Stock Exchange (NSE). Approximately 408,119 shares were traded at a price of Rs. 1120.05 per share, totaling Rs. 45.71 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1741327152000,
            "Source": "block_deals"
        },
        {
            "Title": "Godrej Industries Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade occurred for Godrej Industries Ltd. on the National Stock Exchange (NSE). Approximately 377,193 shares were traded at a price of Rs. 1100.00 per share, resulting in a total transaction value of Rs. 41.49 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1740647077000,
            "Source": "block_deals"
        },
        {
            "Title": "Godrej Industries: Stock Surges 38% in Five Days on Strong Q3 Results",
            "Summary": "Godrej Industries' stock jumped 38% in the past five trading sessions, reaching ₹1,133 on Friday, following better-than-expected Q3 results. The company reported a 90% yearly growth in consolidated profits to ₹312.4 crore and a 34% increase in revenue to ₹4,824.83 crore for the quarter ending December 31.",
            "Sentiment": "positive",
            "PublishDate": 1740196356000,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Industries Ltd. Sees Block Trade of Rs. 15.32 Crores on NSE",
            "Summary": "A significant block trade occurred for Godrej Industries Ltd. on the National Stock Exchange (NSE). The transaction involved approximately 149,251 shares, traded at a price of Rs. 1026.70 per share. The total value of the block trade amounted to Rs. 15.32 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1740038351000,
            "Source": "block_deals"
        },
        {
            "Title": "Godrej Industries: Rural and Urban Demand Steady Despite Challenges",
            "Summary": "Nadir Godrej reports steady rural and urban demand despite rising input costs. Rural demand is picking up, while urban demand is slightly slowing. Cost pressures are easing, but some price hikes are still necessary. Volume growth is expected to be around 5%, down from previous 10-15%. The recent budget is expected to boost middle-class consumption. Strong agricultural season supports rural demand.",
            "Sentiment": "neutral",
            "PublishDate": 1739975245000,
            "Source": "normal_news"
        },
        {
            "Title": "Godrej Industries: US Tariffs Won't Impact Group, Says Chairman",
            "Summary": "Nadir Godrej, Chairperson of Godrej Industries, stated that US tariffs, including potential reciprocal tariffs on India, will not affect the Godrej Group. He discussed the recent split of the Godrej Group, emphasizing its amicable nature and practical reasons. Godrej also highlighted the importance of sustainability in business and the potential of AI in agriculture.",
            "Sentiment": "neutral",
            "PublishDate": 1739888336000,
            "Source": "normal_news"
        },
        {
            "Title": "Godrej Industries Reports Strong Q3 Results and Plans Investment in Godrej Capital",
            "Summary": "Godrej Industries announced its Q3 financial results, showing significant year-over-year growth. The consolidated net profit increased to 1.9 billion rupees from 1.06 billion rupees in the previous year. Revenue also saw a substantial rise to 48.24 billion rupees from 35.9 billion rupees. Additionally, the company plans to invest up to 5 billion rupees in Godrej Capital.",
            "Sentiment": "positive",
            "PublishDate": 1739405798000,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Industries to Invest Up to 5 Billion Rupees in Godrej Capital",
            "Summary": "Godrej Industries has announced plans to invest up to 5 billion rupees in Godrej Capital, its financial services subsidiary. This significant investment demonstrates Godrej Industries' commitment to expanding its presence in the financial services sector and supporting the growth of Godrej Capital.",
            "Sentiment": "positive",
            "PublishDate": 1739372803000,
            "Source": "corporate_action"
        }
    ]
}