{
    "Symbol": "GODREJPROP",
    "ISIN": "INE484J01027",
    "News": [
        {
            "Title": "Godrej Properties Eyes Strong FY27 Growth",
            "Summary": "Godrej Properties anticipates robust growth across key areas for FY27, including sales performance. The company maintains diverse product portfolio with strong demand across premium, luxury, and mid-segments.",
            "Sentiment": "positive",
            "PublishDate": 1770348550271,
            "Source": "stocks"
        },
        {
            "Title": "Godrej Properties Q3FY26 Results: Profit Jumps 73%",
            "Summary": "Godrej Properties reported strong Q3FY26 performance with consolidated profit after tax rising 73% to ₹193.87 crore. Revenue from operations declined 49% to ₹498.36 crore compared to previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770297075413,
            "Source": "co_actions_results"
        },
        {
            "Title": "Godrej Properties Grants 152 Stock Options to Employee",
            "Summary": "Godrej Properties' committee approved 152 stock options at ₹5 exercise price under ESGS scheme, while noting lapse of 1954 stock grants to eligible employees on February 05, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770286361685,
            "Source": "co_actions_results"
        },
        {
            "Title": "Godrej Properties Q3 Net Profit Rises 20% to ₹1.95B",
            "Summary": "Godrej Properties reported Q3 consolidated net profit of ₹1.95 billion, up 20% YoY from ₹1.62 billion, though falling short of analyst estimates of ₹2.43 billion.",
            "Sentiment": "neutral",
            "PublishDate": 1770276092720,
            "Source": "co_actions_results"
        },
        {
            "Title": "Godrej Properties sells plots worth over ₹1,000 crore",
            "Summary": "Godrej Properties achieves record sales of over ₹1,000 crore at launch of Evora Estate plotted development in Panipat, selling 600+ plots across 8 lakh sq ft since December 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770080828333,
            "Source": "stocks"
        },
        {
            "Title": "Godrej Properties sells homes worth over INR 2,000 crore",
            "Summary": "Godrej Properties announced sales worth over INR 2,000 crore at its luxury project Godrej Trilogy in Worli, Mumbai, selling nearly 100 homes since November 2025 launch with total inventory of INR 3,500 crore.",
            "Sentiment": "positive",
            "PublishDate": 1770006740282,
            "Source": "stocks"
        },
        {
            "Title": "Godrej Properties Acquires 8.5-Acre Pune Land",
            "Summary": "Godrej Properties announces acquisition of 8.5-acre land parcel in Mahalunge, Pune with estimated revenue potential of INR 2,000 crore for group housing development.",
            "Sentiment": "positive",
            "PublishDate": 1769734729554,
            "Source": "co_actions_results"
        },
        {
            "Title": "Godrej Properties Posts 19% Rise in CY25 Booking Value",
            "Summary": "Godrej Properties becomes India's largest listed residential real estate developer for second consecutive year with ₹34,171 crore booking value in CY2025, up 19% YoY, and collections of ₹18,979 crore, up 28% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1768468780840,
            "Source": "co_actions_results"
        },
        {
            "Title": "Godrej Properties Secures 5-Acre Hyderabad Land Parcel with ₹4,150 Crore Revenue Potential",
            "Summary": "Godrej Properties won the highest bid for a 5-acre land parcel in Neopolis, Kokapet, Hyderabad. The acquisition has an estimated revenue potential of ₹4,150 crore, expanding the company's development portfolio in the Hyderabad market.",
            "Sentiment": "positive",
            "PublishDate": 1764553748882,
            "Source": "stock"
        },
        {
            "Title": "Godrej Properties Incorporates Wholly-Owned Subsidiary in Dubai",
            "Summary": "Godrej Properties Limited has incorporated GODREJ REDCO CONSULTANCIES L.L.C. as a wholly-owned subsidiary in Dubai, UAE on November 28, 2025. The new entity will engage in real estate transactions, property management, mortgages, interiors, legal services and advisory services with the company subscribing up to AED 300,000 for 100% shareholding.",
            "Sentiment": "positive",
            "PublishDate": 1764431581551,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Properties Acquires 75-Acre Land in Nagpur, Surpasses FY26 Business Development Targets",
            "Summary": "Godrej Properties acquired a 75-acre land parcel in Nagpur, exceeding its FY26 business development goals ahead of schedule. The new project is projected to generate ₹755 crores in revenue for the real estate developer.",
            "Sentiment": "positive",
            "PublishDate": 1763689243007,
            "Source": "stock"
        },
        {
            "Title": "Godrej Properties Acquires Sarjapur Road Land, Expects ₹2,400 Crore Revenue Boost",
            "Summary": "Godrej Properties completed an acquisition on Sarjapur Road in Bengaluru, which is expected to generate ₹2,400 crore in revenue potential for the company. The land acquisition strengthens the real estate developer's presence in the Bengaluru market and adds significant revenue-generating capacity to its project portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1763605535934,
            "Source": "stock"
        },
        {
            "Title": "Godrej Properties Plans ₹22,000 Crore Property Launches in H2 FY26",
            "Summary": "Godrej Properties will launch housing units worth ₹22,000 crore in the second half of this fiscal year, having already launched ₹18,600 crore worth of properties in the first six months. The company remains on track to meet its annual guidance of ₹40,000 crore launches and ₹32,500 crore sales, with pre-sales growing 13% to ₹15,587 crore in H1 and consolidated net profit rising 21% to ₹402.99 crore in Q2.",
            "Sentiment": "positive",
            "PublishDate": 1763290313290,
            "Source": "stock"
        },
        {
            "Title": "Godrej Properties Reports Strong Q2 Performance with 64% Booking Growth and Raises FY28 ROE Target to 20%",
            "Summary": "Godrej Properties delivered robust quarterly results with net profit of INR 405 crores in Q2, marking 21% year-on-year growth. Booking value surged 64% year-on-year to INR 8,505 crores, representing the ninth consecutive quarter above INR 5,000 crores in sales. The company achieved its highest-ever first half booking value of INR 15,587 crores, reaching 48% of its annual guidance of INR 32,500 crores. Four key markets - Bangalore, Mumbai, NCR, and Hyderabad - each contributed over INR 1,500 crores to quarterly bookings. Notable project launches included Godrej Regal Pavilion in Hyderabad (INR 1,527 crores) and Godrej MSR City in Bangalore (INR 1,032 crores). The company added four new projects with estimated booking value of nearly INR 5,000 crores. Management announced a 20% ROE target for FY28, expecting significant profit growth driven by project completions. Collections grew 2% year-on-year to INR 4,066 crores, with management confident of achieving full-year guidance of INR 21,000 crores despite fourth-quarter skewing due to delivery schedules.",
            "Sentiment": "positive",
            "PublishDate": 1762856340494,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Properties Executive Chairman Forecasts Sales to Exceed ₹325 Billion by FY26",
            "Summary": "Godrej Properties' Executive Chairman has predicted that the company's sales could surpass ₹325 billion by FY26. This represents a significant growth projection for the real estate developer's future performance.",
            "Sentiment": "positive",
            "PublishDate": 1762745270802,
            "Source": "stock"
        },
        {
            "Title": "Godrej Properties Confident of Meeting Rs 32,500 Crore Sales Target on Strong Housing Demand",
            "Summary": "Godrej Properties Executive Chairperson Pirojsha Godrej expressed confidence that the company will meet or exceed its pre-sales target of Rs 32,500 crore for this fiscal year. The company achieved Rs 15,587 crore in pre-sales during the first six months, representing 13% growth and 48% of the annual guidance. For the first time, the company recorded sales bookings exceeding Rs 1,500 crore each in four cities - Delhi-NCR, Mumbai Metropolitan Region, Bengaluru and Hyderabad during the September quarter. The company plans to launch a large Worli project in Mumbai with estimated revenue over Rs 10,000 crore. Collections from customers totaled Rs 7,736 crore, representing 37% of the Rs 21,000 crore target, with delays attributed to monsoon and environmental issues. The company reported 21% increase in consolidated net profit to Rs 402.99 crore in the second quarter, with total income rising to Rs 1,950.05 crore from Rs 1,346.54 crore year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762681071998,
            "Source": "stock"
        },
        {
            "Title": "Godrej Properties Reports 64% YoY Growth in Booking Value to INR 8,505 Crore in Q2FY26",
            "Summary": "Godrej Properties achieved booking value of INR 8,505 crore in Q2FY26, marking 64% year-on-year growth and 20% quarter-on-quarter increase. The company sold 4,522 homes across 7.14 million sq.ft. during the quarter. For H1FY26, booking value reached INR 15,587 crore, up 13% year-on-year through sale of 8,753 homes. Net profit grew 21% to INR 405 crore in Q2FY26 compared to INR 335 crore in Q2FY25. Total income increased 39% to INR 1,867 crore while EBITDA surged 118% to INR 614 crore. The company added 4 new projects with estimated saleable area of 5.82 million sq.ft. and expected booking value of INR 4,850 crore during the quarter. Four markets - Bengaluru, MMR, NCR and Hyderabad - each contributed over INR 1,500 crore to quarterly booking value. The company delivered 2.2 million sq.ft. across 2 cities and launched 12 new projects across 8 cities with total sales potential of INR 10,100 crore. Godrej Properties achieved 48% of its annual guidance for booking value and remains on track to meet its FY26 guidance of INR 32,500 crore.",
            "Sentiment": "positive",
            "PublishDate": 1762457684344,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Properties Reports Strong Q2 FY26 Results with 1,017% Jump in Net Profit",
            "Summary": "Godrej Properties announced its unaudited financial results for the quarter and half-year ended September 30, 2025. On a standalone basis, the company reported revenue from operations of INR 922.61 crores for Q2 and INR 1,949.62 crores for H1. Net profit surged to INR 581.86 crores in Q2 compared to INR 52.06 crores in the previous quarter, marking a significant increase. For the half-year, net profit reached INR 697.62 crores versus INR 62.41 crores in the corresponding previous period. On a consolidated basis, revenue from operations was INR 985.48 crores for Q2 and INR 1,852.28 crores for H1. Consolidated net profit attributable to equity holders was INR 540.98 crores in Q2 and INR 1,008.20 crores for H1. The company's basic earnings per share increased to INR 38.70 for Q2 and INR 70.76 for H1. During the quarter, the company sold a 2.5% equity stake in joint venture entity Vivrut Developers Private Limited, resulting in a realized gain of INR 5.35 crores. The Board of Directors approved these results at their meeting held on November 6, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762451546747,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Properties Reports No Deviation in QIP Fund Utilization for September Quarter",
            "Summary": "Godrej Properties Limited submitted a monitoring agency report from ICRA Limited regarding the utilization of proceeds from its Qualified Institutional Placement for the quarter ended September 30, 2025. The report confirms no deviation from the stated objectives of the issue, with funds being utilized in line with the original purpose. The QIP raised Rs 6,000 crore with actual net proceeds of Rs 5,921 crore, which was Rs 6 crore higher than estimated due to lower actual offer-related expenses. The funds are allocated for acquisition of land and/or land development rights (Rs 5,300 crore) and general corporate purposes (Rs 621 crore). As of the quarter end, Rs 4,224.84 crore has been utilized, leaving Rs 1,696.16 crore unutilized. Both objectives remain on schedule with completion targeted for March 31, 2028.",
            "Sentiment": "neutral",
            "PublishDate": 1762416342428,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Properties Board Approves Merger with Wholly-Owned Subsidiary Embellish Houses",
            "Summary": "Godrej Properties Limited's Board of Directors approved a scheme of amalgamation with its wholly-owned subsidiary Embellish Houses Private Limited. The merger is subject to approvals from the National Company Law Tribunal, shareholders, creditors, and other competent authorities. Embellish Houses, incorporated on October 31, 2025 after conversion from a limited liability partnership, operates in real estate development. Godrej Properties holds 99.99% of Embellish Houses' paid-up equity share capital. The rationale includes consolidating real estate business operations, streamlining group structure, reducing legal entities and compliance requirements, pooling technical resources, and eliminating administrative duplications. No shares will be issued as consideration since the transferor company is wholly-owned by Godrej Properties, resulting in no change to the shareholding pattern.",
            "Sentiment": "positive",
            "PublishDate": 1762415749429,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Properties Confident of Exceeding FY26 Booking Value Targets",
            "Summary": "Godrej Properties expressed confidence in exceeding its booking value targets for FY26. The company attributes this optimism to strong demand, healthy financials, and a robust project pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1762411871570,
            "Source": "stock"
        },
        {
            "Title": "Godrej Properties Reports EBITDA Loss of ₹5.3 Billion in Q2",
            "Summary": "Godrej Properties recorded an EBITDA loss of ₹5.3 billion in the second quarter, compared to a gain of ₹320 million in the previous comparable period. This represents a significant deterioration in the company's earnings performance.",
            "Sentiment": "negative",
            "PublishDate": 1762411423669,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Properties Reports 19% Growth in Quarterly Net Profit to 4 Billion Rupees",
            "Summary": "Godrej Properties reported a consolidated net profit of 4 billion rupees for the second quarter, representing an increase from 3.35 billion rupees in the same period last year. This marks a year-over-year growth of approximately 19% in the company's quarterly earnings.",
            "Sentiment": "positive",
            "PublishDate": 1762410992377,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Properties Gets RERA Approval for Phase 1 of Worli Project Worth Over INR 10,000 Crore",
            "Summary": "Godrej Properties received project registration certificate from Maharashtra Real Estate Regulatory Authority (MahaRERA) for its residential development Godrej Trilogy in Worli, Mumbai. The development comprises three towers on a 2.63-acre plot with gross estimated revenue potential exceeding INR 10,000 crore. RERA approval covers two of three proposed towers with approximately 11 lakh square feet of saleable area in Phase 1. The first phase featuring towers named Seaturf and Seafront will be launched in the current quarter. The project is strategically located off Dr. Annie Besant Road, adjoining Mahalaxmi Racecourse, offering views of the Racecourse and Arabian Sea. MD & CEO Gaurav Pandey stated the project strengthens GPL's presence in South Mumbai and aligns with their strategy of developing high-potential urban land parcels.",
            "Sentiment": "positive",
            "PublishDate": 1761527065805,
            "Source": "stock"
        },
        {
            "Title": "Godrej Industries Increases Stake in Godrej Capital to 91.11% with Rs 4.09 Billion Share Purchase",
            "Summary": "Godrej Industries has acquired additional shares in Godrej Capital for Rs 4.09 billion, increasing its ownership stake to 91.11%. This transaction represents a significant investment by the parent company to strengthen its position in its financial services subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1760623996509,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Properties Acquires 26-Acre Land Parcel Near Sarjapur Road, Bengaluru",
            "Summary": "Godrej Properties Limited acquired a 26-acre land parcel in South Bengaluru near Sarjapur Road for developing a premium residential project. The project has an estimated revenue potential of INR 1,100 crore. The acquisition strengthens the company's presence in the Sarjapur Road corridor, which offers connectivity to key employment hubs including Whitefield, Outer Ring Road, and Electronic City. Godrej Properties has previously developed successful projects in the area including Godrej Park Retreat and Godrej Lakeside Orchards, both experiencing high customer uptake and sustained sales velocity. MD & CEO Gaurav Pandey highlighted Bengaluru's position as a dynamic real estate market and the Sarjapur Road corridor as a key growth hub.",
            "Sentiment": "positive",
            "PublishDate": 1760490490283,
            "Source": "stock"
        },
        {
            "Title": "Godrej Properties Faces ₹240.8 Crore Arbitration Award in GoldBricks Dispute",
            "Summary": "Godrej Properties disclosed that an arbitration award has been passed in its dispute with GoldBricks Infrastructure over the Anandam project in Nagpur. While GoldBricks had claimed approximately ₹1,366 crore, the arbitrator awarded only ₹240.8 crore plus 12% annual interest. The remaining claims by GoldBricks and Godrej Properties' counterclaims were rejected. Godrej Properties stated the award doesn't reflect their arguments and plans to challenge it at Bombay High Court. Separately, the company emerged as highest bidder for a 7.8-acre land parcel in Hyderabad with a bid value of ₹547.78 crore and estimated revenue potential of ₹3,800 crore. Shares closed at ₹1,950, down 0.67%.",
            "Sentiment": "negative",
            "PublishDate": 1757438307064,
            "Source": "stock"
        },
        {
            "Title": "Godrej Properties Receives Arbitration Award in Nagpur Project Dispute, Plans to Challenge Decision",
            "Summary": "Godrej Properties received a final arbitration award on September 8, 2025, in its dispute with GoldBricks Infrastructure Private Limited over the Godrej Anandam project in Nagpur. GoldBricks had claimed approximately Rs. 1,366 crore, but the arbitrator substantially rejected these claims, awarding only Rs. 240.8 crore with 12% annual interest from the award date until realization. The arbitrator rejected other claims from both parties, including Godrej Properties' counterclaims. Godrej Properties believes the award has shortcomings and does not fully reflect the company's arguments. The company is seeking legal advice and preparing to challenge the award in the Bombay High Court.",
            "Sentiment": "negative",
            "PublishDate": 1757433119991,
            "Source": "stock"
        },
        {
            "Title": "Godrej Properties Achieves ₹1,000 Crore Sales in Second Hyderabad Project Launch",
            "Summary": "Godrej Properties sold homes worth over ₹1,000 crore at the launch of its Godrej Regal Pavilion project in Hyderabad. This marks the company's second Hyderabad launch this year, with both projects crossing the ₹1,000 crore sales milestone at launch. The Regal Pavilion project has a developable potential of 4.14 million square feet and estimated revenue potential of ₹3,600 crore, located in Rajendra Nagar with access to Outer Ring Road and proximity to the airport. The company also won a bid for 7.8 acres in Kukatpally, Hyderabad for ₹547.78 crore, with estimated revenue potential of ₹3,800 crore. In quarterly results, net profit increased 15.4% to ₹600 crore while revenue declined 41% to ₹435 crore. The company reported an EBITDA loss of ₹243 crore. Shares closed flat at ₹2,053.1, down 26% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1756089369234,
            "Source": "stock"
        },
        {
            "Title": "Godrej Properties Achieves INR 1,000 Crore Sales at Hyderabad Project Launch",
            "Summary": "Godrej Properties sold homes worth over INR 1,000 crore at the launch of its Godrej Regal Pavilion project in Rajendra Nagar, Hyderabad. The company sold over 683 homes covering approximately 1.20 million square feet. This marks the second successful launch in Hyderabad this year, with both projects surpassing the INR 1,000 crore sales milestone at launch. The project has a developable potential of approximately 4.14 million square feet with an estimated revenue potential of INR 3,600 crore. MD & CEO Gaurav Pandey attributed the success to rising preference for trusted, branded residences and Hyderabad's strong growth potential.",
            "Sentiment": "positive",
            "PublishDate": 1756084826420,
            "Source": "stock"
        },
        {
            "Title": "Godrej Properties Wins ₹547.78 Crore Hyderabad Land Bid with ₹3,800 Crore Revenue Potential",
            "Summary": "Godrej Properties emerged as the highest bidder for a 7.8 acre land parcel in Kukatpally, Hyderabad with a bid value of ₹547.78 crore. The project has an estimated revenue potential of ₹3,800 crore and will feature premium residential apartments near HITEC City. The e-auction was conducted by Telangana Housing Board for residential group housing. The company also acquired a 7% stake in Godrej Skyline Developers for ₹9.25 lakh. Godrej Properties reported quarterly results showing net profit increased 15.4% to ₹600 crore while revenue declined 41% to ₹435 crore, with an EBITDA loss of ₹243 crore. The company has set sales targets of ₹32,500 crore for FY26 with expected collections of ₹21,000 crore. Shares closed 1.45% higher at ₹2,039.2 but have declined 15.2% in the past month and 26.56% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1755740907852,
            "Source": "stock"
        },
        {
            "Title": "Godrej Properties Acquires 7% Stake in Godrej Skyline",
            "Summary": "Godrej Properties has entered into a deal to acquire a 7% stake in Godrej Skyline. The transaction represents a strategic investment by the real estate developer in the related entity.",
            "Sentiment": "positive",
            "PublishDate": 1755694738229,
            "Source": "order&deals"
        },
        {
            "Title": "Godrej Properties Net Debt Surges 42% to ₹4,637 Crore as Company Expands Land Acquisition",
            "Summary": "Godrej Properties' net debt increased 42% to ₹4,637 crore in the June quarter, up from ₹3,269 crore at the end of the last fiscal year. The debt-to-equity ratio rose to 0.26 from 0.19. MD and CEO Gaurav Pandey stated the company has set an absolute cap of ₹10,000 crore for net debt. The company acquired five land parcels during the first quarter with revenue potential of ₹11,400 crore in Mumbai, Pune, Bengaluru and Panipat. Godrej Properties has given guidance to acquire land parcels worth ₹20,000 crore and maintains its sales bookings target of ₹32,500 crore for the fiscal year. The company reported 15% increase in consolidated net profit to ₹598.40 crore in the first quarter, while total income fell to ₹1,620.34 crore. Pre-sales declined 18% to ₹7,082 crore in the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1755423581684,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Properties Targets Rs 32,500 Crore Sales Bookings, Acquires Land Worth Rs 11,400 Crore Revenue Potential",
            "Summary": "Godrej Properties acquired five land parcels during April-June quarter in Mumbai, Pune, Bengaluru and Panipat with total revenue potential of Rs 11,400 crore through outright purchase and joint development agreements. Executive Chairperson Pirojsha Godrej stated the company's balance sheet remains strong due to robust operational cash flows and funds raised through Qualified Institutional Placement in December. The company expects to achieve its annual target of adding projects worth Rs 20,000 crore by second or third quarter of 2025-26. Godrej Properties is on track to meet or exceed Rs 32,500 crore sales bookings target for this fiscal, despite an 18% decline in quarterly pre-sales to Rs 7,082 crore attributed to high base effect and project launch delays. The company reported 15% increase in consolidated net profit to Rs 598.40 crore for the quarter, though total income fell to Rs 1,620.34 crore. Godrej Properties was the country's largest real estate firm by sales bookings for the last two financial years.",
            "Sentiment": "positive",
            "PublishDate": 1754820202468,
            "Source": "stock"
        },
        {
            "Title": "Godrej Properties Reports Record Quarterly Net Profit of ₹600 Crores, Achieves ₹7,082 Crores in Bookings",
            "Summary": "Godrej Properties delivered its highest ever quarterly net profit of ₹600 crores in Q1 FY26, marking a 15% year-on-year growth. The company achieved booking value of ₹7,082 crores from sale of 4,231 homes across 6.17 million square feet, representing an 18% decline year-on-year but a 77% two-year compounded annual growth rate. This marks the eighth consecutive quarter exceeding ₹5,000 crores in booking value. Major project launches included Godrej MSR City in Bengaluru (₹2,426 crores), Godrej Majesty in Greater Noida (₹1,000 crores), and Godrej Tiara in Bangalore (₹470 crores). Collections grew 22% to ₹3,670 crores while operating cash flow declined 4% to ₹947 crores due to low deliveries of under 1 million square feet. The company added 5 new projects with estimated saleable area of 9.24 million square feet and expected booking value of ₹11,400 crores, achieving 57% of annual business development guidance in the first quarter. Total income decreased 3% to ₹1,593 crores, EBITDA grew 18% to ₹915 crores. Management remains confident of achieving the bookings target of ₹32,500 crores for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1754306997179,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Properties Shares Rise Despite Revenue Drop as Profit Grows 12.5%",
            "Summary": "Godrej Properties shares traded higher following quarterly results showing profit increased 12.5% to Rs 205 crore from Rs 182 crore in the same period last year. However, revenue from operations declined 41% to Rs 435 crore compared to Rs 739 crore in the corresponding quarter. Jefferies maintained a 'buy' rating but reduced the target price to Rs 3,000 from Rs 3,200, citing a soft start but expecting improvement ahead. The brokerage noted that 10% sales growth guidance appears achievable given the strong launch pipeline. Shares rose as much as 0.89% to Rs 2,068.90 before paring gains to trade 0.12% higher at Rs 2,053. The stock has declined 31.20% over the last 12 months and 25.72% year-to-date. Among 21 analysts covering the company, 16 maintain 'buy' ratings, one recommends 'hold', and four suggest 'sell', with the average 12-month consensus price target implying 33.1% upside.",
            "Sentiment": "neutral",
            "PublishDate": 1754282026115,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Properties Plans 20 Billion Rupee Bond Issue, Its Largest to Date",
            "Summary": "Godrej Properties, the real estate unit of Godrej Industries, plans to raise around 20 billion rupees ($230 million) through its largest bond issue to date later this month. The company will issue shorter duration bonds with maturity of three to five years, rated 'AA+'. This marks the company's first bond issuance in nearly a year, following a 650 million rupee bond sale in September at 8.50% annual coupon. Since September 2023, Godrej Properties has borrowed 25 billion rupees through bonds, and the upcoming sale would bring total outstanding issuances to 45 billion rupees. The Mumbai-based firm recently acquired around 50 acres of land in Chhattisgarh for premium plotted residential units.",
            "Sentiment": "neutral",
            "PublishDate": 1754279075882,
            "Source": "stock"
        },
        {
            "Title": "Godrej Properties Sets Rs. 10,000 Crore Net Debt Limit, Achieves 57% of Annual Business Development Target",
            "Summary": "Godrej Properties has established a net debt limit of Rs. 10,000 crore. The company achieved 57% of its annual business development target in the first quarter. The company expects construction spending to increase by 30-40% compared to the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754278666179,
            "Source": "stock"
        },
        {
            "Title": "Godrej Properties Confident of Meeting Rs 32,500 Crore Pre-Sales Target Despite Q1 Decline",
            "Summary": "Godrej Properties Executive Chairperson Pirojsha Godrej expressed confidence that the company will meet or exceed its Rs 32,500 crore sales bookings target for the fiscal year, despite reporting an 18% decline in pre-sales to Rs 7,082 crore in the first quarter. Pirojsha attributed the quarterly decline to high base effect and slight delays in project launches. He noted that while the housing market has calmed down from the post-Covid exuberance, demand conditions remain strong. The company reported a 15% increase in consolidated net profit to Rs 598.40 crore for the first quarter, though total income fell to Rs 1,620.34 crore from Rs 1,699.48 crore year-over-year. Customer collections rose 22% to Rs 3,670 crore during the quarter. Godrej Properties achieved record sales bookings of Rs 29,444 crore in the previous fiscal year, representing a 31% increase, and was the country's largest real estate firm by sales bookings for two consecutive years.",
            "Sentiment": "positive",
            "PublishDate": 1754214425499,
            "Source": "stock"
        },
        {
            "Title": "Godrej Properties Shareholders Approve Gaurav Pandey's Re-appointment as MD & CEO for Three Years",
            "Summary": "Godrej Properties Limited shareholders approved the re-appointment of Gaurav Pandey as Managing Director and Chief Executive Officer for a three-year term from January 1, 2026 to December 31, 2028. The approval was granted at the company's 40th Annual General Meeting held on August 1, 2025. Pandey is an Economics Honours graduate from the University of Delhi with a post-graduate degree from IIM Kozhikode, bringing over 20 years of experience in the real estate sector. His expertise spans governance, finance and risk, strategy and business, industry expertise and market expertise. Pandey is not related to any Director or Key Managerial Personnel of the company and is not debarred from holding the office of Director.",
            "Sentiment": "positive",
            "PublishDate": 1754059880865,
            "Source": "corporate_governance"
        },
        {
            "Title": "Godrej Properties Reports Monitoring Agency Report for QIP Proceeds Utilization",
            "Summary": "Godrej Properties submitted a monitoring agency report for the quarter ended June 30, 2025, detailing the utilization of proceeds from its qualified institutional placement. The company raised Rs 6,000 crore through the QIP conducted from November 27 to December 2, 2024, with actual net proceeds of Rs 5,921 crore. ICRA Limited, the monitoring agency, reported no deviation from the stated objects of the issue. Out of the total proceeds, Rs 3,801.996 crore has been utilized for acquisition of land and/or land development rights, while Rs 621 crore was allocated for general corporate purposes. The unutilized amount of Rs 2,119.004 crore has been deployed in various mutual funds and fixed deposits, generating returns ranging from 7.18% to 8.65%. Both project objectives remain on schedule with completion targeted for March 31, 2028.",
            "Sentiment": "neutral",
            "PublishDate": 1754045236813,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Properties Reports 15.4% Net Profit Growth Despite Revenue Decline in Q1",
            "Summary": "Godrej Properties reported net profit of ₹600 crore for the June quarter, marking a 15.4% increase from the previous year. However, revenue declined 41% to ₹435 crore compared to the same quarter last year. The company posted an EBITDA loss of ₹243 crore for the quarter. Other income increased to ₹1,186 crore from ₹960 crore year-on-year. Booking value fell 18% to ₹7,082 crore from ₹8,637 crore in the previous year, though this marks the eighth consecutive quarter exceeding ₹5,000 crore in booking value. The Mumbai-based real estate developer added five new projects with 9.24 million sq ft of saleable area and expected booking value of ₹11,400 crore, achieving 57% of annual guidance. Management stated the company is on track to meet or exceed FY26 guidance. Shares traded 0.59% lower at ₹2,090.40 and are down 25% year-to-date.",
            "Sentiment": "neutral",
            "PublishDate": 1754035284831,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Properties Reports Mixed Q1 Results with EBITDA Growth but Lower Bookings",
            "Summary": "Godrej Properties reported Q1 EBITDA of 9.2 billion rupees compared to 7.7 billion rupees in the same period last year, representing year-over-year growth. However, the company experienced a 17.44% decrease in Q1 booking value compared to the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754033144215,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Properties Reports 5% Decline in Quarterly Total Income to ₹16.2 Billion",
            "Summary": "Godrej Properties recorded total income of ₹16.2 billion in its latest quarterly results, representing a decrease from ₹17 billion in the same quarter of the previous year. This reflects a year-over-year decline of approximately 5% in the company's total income.",
            "Sentiment": "negative",
            "PublishDate": 1754032682621,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Properties Reports 15% Growth in Quarterly Net Profit to ₹6 Billion",
            "Summary": "Godrej Properties reported a consolidated net profit of ₹6 billion for the quarter, representing a year-on-year increase from ₹5.2 billion in the same period last year. This marks a growth of approximately 15% in the company's quarterly earnings.",
            "Sentiment": "positive",
            "PublishDate": 1754032313969,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Properties Corrects Land Acquisition Details for Vadodara Project",
            "Summary": "Godrej Properties issued a correction to their press release regarding a land acquisition in Vadodara, clarifying that the estimated saleable area is approximately 9 lakh square feet, not 0.9 lakh square feet as previously stated due to a typographical error. The company acquired approximately 34 acres of land on Ajwa Road for a plotted development comprising premium residential units. This marks the company's entry into Vadodara and represents their second land acquisition in Gujarat within the last year, following a 3-acre acquisition in Vastrapur, Ahmedabad in October 2024. The development location offers connectivity to key city landmarks, commercial hubs, educational institutions, and is situated near Vadodara Airport.",
            "Sentiment": "neutral",
            "PublishDate": 1753968989670,
            "Source": "stock"
        },
        {
            "Title": "Godrej Properties Enters Vadodara Market with 34-Acre Land Acquisition",
            "Summary": "Godrej Properties has acquired approximately 34 acres of land in Vadodara for a plotted residential development with an estimated saleable area of 0.9 lakh square feet. The land is located on Ajwa Road, a growing real estate corridor with connectivity to key city landmarks, commercial hubs, educational institutions, and Vadodara Airport. This marks the company's second land acquisition in Gujarat within one year, following a 3-acre purchase in Vastrapur, Ahmedabad in October 2024. The development will comprise premium plotted residential units. MD & CEO Gaurav Pandey stated the acquisition aligns with the company's strategy of entering high-growth cities through plotted developments and aims to create a sustainable community while leveraging Vadodara's growth potential.",
            "Sentiment": "positive",
            "PublishDate": 1753962884796,
            "Source": "stock"
        },
        {
            "Title": "Godrej Properties Sees Rs. 24.45 Crore Block Trade on NSE",
            "Summary": "Godrej Properties Ltd. witnessed a block trade worth Rs. 24.45 crores on the National Stock Exchange. The transaction involved approximately 111,794 shares at a price of Rs. 2,187.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1753682712722,
            "Source": "order&deals"
        },
        {
            "Title": "Godrej Properties Receives Credit Rating Affirmation with Enhanced Debenture Limit",
            "Summary": "Godrej Properties Limited received credit rating affirmation from India Ratings and Research Private Limited. The company's Non-Convertible Debentures were rated IND AA+ (Stable) with an enhanced amount of Rs. 4,500 crore, increased from the previous Rs. 2,500 crore. The Commercial Paper program of Rs. 3,500 crore maintained its IND A1+ rating. The rating agency communicated these decisions through a letter dated July 23, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753279824343,
            "Source": "corporate_action"
        },
        {
            "Title": "ICRA Reaffirms Credit Ratings for Godrej Properties' Financial Instruments Worth Rs 20,500 Crore",
            "Summary": "ICRA Limited has reaffirmed and assigned credit ratings for Godrej Properties Limited's financial instruments totaling Rs 20,500 crore. The rating agency enhanced the non-convertible debentures limit from Rs 4,000 crore to Rs 6,000 crore while maintaining the [ICRA]AA+ (Stable) rating. Commercial paper worth Rs 3,500 crore retained its [ICRA]A1+ rating. Long/short-term fund-based and non-fund-based bank facilities of Rs 11,000 crore were reaffirmed with [ICRA]AA+ (Stable) for long-term and [ICRA]A1+ for short-term ratings. The stable outlook indicates consistent creditworthiness assessment for the real estate company's debt instruments.",
            "Sentiment": "positive",
            "PublishDate": 1753156733567,
            "Source": "stock"
        }
    ]
}