{
    "Symbol": "GODREJAGRO",
    "ISIN": "INE850D01014",
    "News": [
        {
            "Title": "Godrej Agrovet launches TAKAI insecticide for rice",
            "Summary": "Godrej Agrovet Limited launched TAKAI, a new insecticide for rice crops powered by Cyclapryn technology from ISK Japan, effective against Stem Borer and Leaf Folder pests.",
            "Sentiment": "positive",
            "PublishDate": 1770568418523,
            "Source": "stocks"
        },
        {
            "Title": "Godrej Agrovet Responds to BSE on Volume Surge Query",
            "Summary": "Godrej Agrovet confirms compliance with disclosure norms after BSE inquiry about significant trading volume increase, stating no undisclosed developments requiring mandatory disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1770122842682,
            "Source": "stocks"
        },
        {
            "Title": "Godrej Agrovet Q3 Net Profit Rises to ₹1.15 Billion",
            "Summary": "Godrej Agrovet reports consolidated net profit of ₹1.15 billion in Q3, marking growth from ₹1.11 billion in the same quarter last year, reflecting steady business performance.",
            "Sentiment": "positive",
            "PublishDate": 1770118445954,
            "Source": "co_actions_results"
        },
        {
            "Title": "Godrej Agrovet schedules Q3FY26 earnings call",
            "Summary": "Godrej Agrovet Limited announces conference call with investors and analysts on February 4, 2026 at 3:30 PM IST to discuss Q3FY26 and 9MFY26 financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1768555259257,
            "Source": "co_actions_results"
        },
        {
            "Title": "Godrej Agrovet Signs INR 70 Crore Investment MoU with Andhra Pradesh Government",
            "Summary": "Godrej Agrovet Limited signed a non-binding MoU with the Andhra Pradesh State Government to invest INR 70 Crore for expanding dairy processing capacity and establishing new Samadhan Centers for oil palm farmers. The investment will be executed through subsidiary Creamline Dairy Products Limited in three phases and includes setting up five new one-stop solution centers for oil palm farmers.",
            "Sentiment": "positive",
            "PublishDate": 1763041505155,
            "Source": "order&deals"
        },
        {
            "Title": "Godrej Agrovet Signs ₹700 Million Investment Agreement With Andhra Pradesh Government",
            "Summary": "Godrej Agrovet has entered into an agreement with the Andhra Pradesh Government for an investment of ₹700 million.",
            "Sentiment": "positive",
            "PublishDate": 1763038698319,
            "Source": "stock"
        },
        {
            "Title": "Godrej Agrovet Reports 5% Revenue Growth to INR 2,567 Crores in Q2 FY26",
            "Summary": "Godrej Agrovet Limited reported consolidated revenues of INR 2,567 crores for Q2 FY26, marking 5% year-on-year growth, while profit before tax remained flat at INR 125 crores excluding non-recurring items. For H1 FY26, the company achieved revenues of INR 5,182 crores with 8% growth and PBT of INR 313 crores, up 14% year-on-year. Animal Feed delivered strong 18% volume growth in cattle feed despite flat revenues due to lower commodity prices, with underlying margins improving by 70 basis points. Vegetable oil posted stellar 41% revenue growth with margins expanding to 22.4% driven by higher crude palm oil realizations and improved oil extraction ratio of 19%. The standalone Crop Protection segment faced challenges with 30% revenue decline and 62% drop in segment results due to excessive rainfall and lower acreages, compressing margins to 23.3% from 43.1%. Astec Life Sciences saw 25% revenue decline on cautious contract manufacturing demand, though enterprise category grew 15% and EBITDA improved. Creamline Dairy remained broadly flat on revenue and EBITDA with value-added products growing 10% and salience rising to 36%. Godrej Foods Limited reported 28% EBITDA growth driven by branded products despite 7% overall revenue decline, with branded salience rising to 86%.",
            "Sentiment": "neutral",
            "PublishDate": 1762975836465,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Agrovet Maintains Animal Feed EBIT Guidance, Revises FY26 Growth Expectations Due to Weather Impact",
            "Summary": "Godrej Agrovet expects to maintain its animal feed EBIT guidance of INR 1,900-2,000 per metric ton. The company had initially guided for 16-18% revenue and earnings growth for FY26, but this target will likely not be achieved due to weather impacts on crop protection business. Despite this revision, management still expects strong, healthy revenue growth. The company is developing a new strategic plan with FY30 targets that will be shared with investors by the end of March.",
            "Sentiment": "neutral",
            "PublishDate": 1762486904232,
            "Source": "stock"
        },
        {
            "Title": "Godrej Agrovet Reports Strong Q2 Performance with 77% Profit Growth",
            "Summary": "Godrej Agrovet Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company's standalone profit for the quarter increased to Rs. 177.07 crore compared to Rs. 131.94 crore in the same period last year. Revenue from operations reached Rs. 1,863.16 crore for the quarter versus Rs. 1,685.20 crore in the previous year. On a consolidated basis, quarterly profit stood at Rs. 84.34 crore against Rs. 95.79 crore last year, while revenue was Rs. 2,567.42 crore compared to Rs. 2,448.75 crore. For the half year period, standalone profit was Rs. 345.96 crore versus Rs. 268.33 crore, with revenue at Rs. 3,663.06 crore against Rs. 3,261.91 crore. The company's earnings per share for the quarter was Rs. 9.20 on standalone basis and Rs. 4.81 on consolidated basis. The Board of Directors approved these results at their meeting held on November 5, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762349011576,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Agrovet Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Godrej Agrovet reported quarterly results showing revenue growth to 25.67 billion rupees from 24.48 billion rupees year-over-year. However, net profit declined to 926 million rupees compared to 1.12 billion rupees in the same period last year. EBITDA decreased to 2.13 billion rupees from 2.23 billion rupees, while EBITDA margin compressed to 8.31% from 9.12% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762348658140,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Agrovvet Receives SEBI Warning Over Astec Lifesciences Acquisition Rule Violation",
            "Summary": "Godrej Agrovvet has received a warning from SEBI for breaking acquisition rules in relation to Astec Lifesciences. The regulatory action indicates non-compliance with prescribed acquisition procedures.",
            "Sentiment": "negative",
            "PublishDate": 1759152609083,
            "Source": "corporate_governance"
        },
        {
            "Title": "Godrej Agrovet Signs MoU with MoFPI for INR 960 Crore Investment in Food Processing and R&D",
            "Summary": "Godrej Agrovet has signed a Memorandum of Understanding (MoU) with the Ministry of Food Processing Industries (MoFPI) for an investment of INR 960 crore. The investment is aimed at boosting food processing capabilities, research and development activities, and regional development initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1759104680444,
            "Source": "stock"
        },
        {
            "Title": "Godrej Agrovet Signs MoU with MoFPI for INR 960 Crore Investment in Food Processing and R&D",
            "Summary": "Godrej Agrovet has signed a Memorandum of Understanding with the Ministry of Food Processing Industries (MoFPI) for an investment of INR 960 crore. The investment is aimed at boosting food processing capabilities, research and development activities, and regional development initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1758884695213,
            "Source": "stock"
        },
        {
            "Title": "Godrej Agrovet Sees Block Trade Worth Rs. 51.90 Crores on NSE",
            "Summary": "Godrej Agrovet Ltd. witnessed a block trade on the National Stock Exchange involving approximately 706,909 shares at a price of Rs. 734.15 per share. The total transaction value amounted to Rs. 51.90 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1758003774772,
            "Source": "order&deals"
        },
        {
            "Title": "Sunil Kataria Takes Over as CEO and Managing Director of Godrej Agrovet",
            "Summary": "Godrej Agrovet announced that Sunil Kataria has assumed the role of Chief Executive Officer and Managing Director for a five-year term. Kataria, who was appointed CEO and MD-designate in May 2025, brings over 20 years of experience in marketing, sales and leadership roles at companies including Marico Ltd, Godrej Consumer Products Ltd and Raymond Ltd. He succeeds Balram Singh Yadav, who served as managing director for more than three decades. Nadir Godrej, Chairman and Managing Director of parent company Godrej Industries Ltd, stated that Kataria's experience aligns with their intent to scale up Godrej Agrovet's different businesses while prioritising profitability. Kataria outlined his priorities as unlocking value across the company's portfolio by investing in capability building, strengthening go-to-market strategies, and scaling up high-potential businesses. Godrej Agrovet operates across agricultural inputs, animal feed, crop protection and consumer products in India's agriculture sector.",
            "Sentiment": "positive",
            "PublishDate": 1756799735691,
            "Source": "corporate_governance"
        },
        {
            "Title": "Godrej Agrovvet Launches New Herbicide 'Ashitaka' for Maize Crops",
            "Summary": "Godrej Agrovvet has introduced a new herbicide called 'Ashitaka' specifically designed for maize crops. The product represents the company's expansion in the agricultural chemicals segment targeting crop protection solutions for maize farmers.",
            "Sentiment": "positive",
            "PublishDate": 1755672991492,
            "Source": "stock"
        },
        {
            "Title": "Godrej Agrovet Reports 11% Revenue Growth in Q1 FY26, Driven by Strong Vegetable Oil Performance",
            "Summary": "Godrej Agrovet Limited reported consolidated revenue of Rs. 2,614 crore in Q1 FY26, up 11% from Rs. 2,351 crore in Q1 FY25. Profit before tax improved from Rs. 151 crore to Rs. 188 crore. The vegetable oil segment drove growth with 50% higher Fresh Fruit Bunch arrivals and improved oil extraction ratios. Animal feed volumes grew 8% across categories, while crop protection revenue increased marginally by 5%. Astec LifeSciences revenue improved 31% year-on-year with higher volumes in Enterprise and CDMO categories. The dairy segment remained flat despite 2% milk volume growth due to unseasonable rains affecting value-added products. The company launched a new maize herbicide Ashitaka with theoretical potential of Rs. 200 crores. Management expects early teens top-line growth for the full year and EBITDA break-even for Astec LifeSciences.",
            "Sentiment": "positive",
            "PublishDate": 1755177792991,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Agrovet Targets Multi-Sector Growth with Enhanced Operations Across Agriculture and Food Segments",
            "Summary": "Godrej Agrovet is pursuing growth across multiple business sectors through various operational improvements. The company reported a 52% increase in Fresh Fruit Bunch (FFB) arrivals and higher vegetable oil earnings. The company has released a new maize herbicide and improved its Astec capacity. Godrej Agrovet is focusing on branded poultry products and enhanced dairy offerings as part of its strategy to boost profits.",
            "Sentiment": "positive",
            "PublishDate": 1754490882306,
            "Source": "stock"
        },
        {
            "Title": "Godrej Agrovet Reports 24% Jump in Quarterly Profit to ₹169 Crore",
            "Summary": "Godrej Agrovet Limited reported a standalone net profit of ₹168.89 crore for the quarter ended June 30, 2025, marking a 23.8% increase from ₹136.39 crore in the same period last year. Revenue from operations rose 15.1% to ₹1,996.81 crore compared to ₹1,734.14 crore in the previous year quarter. On a consolidated basis, the company posted a net profit of ₹148.83 crore versus ₹131.63 crore in the year-ago period, while consolidated revenue grew 11.2% to ₹2,614.29 crore. The company's earnings per share stood at ₹8.78 for the quarter. During the period, Godrej Agrovet acquired an additional 36.79% stake in Creamline Dairy Products Limited for ₹708.58 crore, increasing its holding to 99.32%. The board of subsidiary companies declared interim dividends, with Godrej Foods Limited announcing ₹207.50 per share, Creamline Dairy Products Limited ₹5.75 per share, and Godvet Agrochem Limited ₹1.80 per share.",
            "Sentiment": "positive",
            "PublishDate": 1754474181638,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Agrovet Reports Higher Q1 EBITDA and Margin Growth",
            "Summary": "Godrej Agrovet reported Q1 EBITDA of 2.7 billion rupees compared to 2.3 billion rupees in the same period last year. The company's EBITDA margin improved to 10.3% from 9.62% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754473591063,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Agrovet Reports 10.4% Growth in Q1 Consolidated Net Profit",
            "Summary": "Godrej Agrovet's consolidated net profit increased to 1.49 billion rupees in Q1 compared to 1.35 billion rupees in the same quarter of the previous year, representing a year-on-year growth of approximately 10.4%.",
            "Sentiment": "positive",
            "PublishDate": 1754473126815,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Agrovet: Stock Plummets 20% from Peak Post Q4 Results",
            "Summary": "Godrej Agrovet's stock fell 8% on May 2, now down 20% from its 52-week high. Q4 results show flat revenue, EBITDA, and margins. Profitability up 24% due to crop protection, vegetable oil, and animal feed businesses. Subsidiary Astec Lifesciences faced challenges. Dairy and Godrej Foods segments saw margin declines.",
            "Sentiment": "negative",
            "PublishDate": 1746159857000,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Agrovet Reports Q4 FY23 Results and Dividend Declaration",
            "Summary": "Godrej Agrovet announced its Q4 FY23 consolidated net profit of 708 million rupees, up from 571.3 million rupees year-over-year. The company's Q4 revenue remained stable at 21.33 billion rupees compared to 21.34 billion rupees in the previous year. Additionally, Godrej Agrovet recommended a dividend of 11 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746144794000,
            "Source": "default"
        },
        {
            "Title": "Godrej Agrovet: Q4 Profit Up 24%, Declares ₹11 Final Dividend",
            "Summary": "Godrej Agrovet reported a 24% YoY increase in Q4FY25 net profit to ₹70.8 crore. Revenue remained flat at ₹2,134 crore, while EBITDA slightly decreased by 0.9% to ₹146.6 crore. The company announced a final dividend of ₹11 per share, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1746018287000,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Agrovet Recommends Dividend of 11 Rupees per Share",
            "Summary": "Godrej Agrovet has recommended a dividend of 11 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1746015838000,
            "Source": "result"
        },
        {
            "Title": "Godrej Agrovet Reports Q4 FY2023 Financial Results",
            "Summary": "Godrej Agrovet has released its Q4 FY2023 financial results. The company reported a consolidated net profit of 708 million rupees, up from 571.3 million rupees year-over-year. Revenue remained relatively stable at 21.33 billion rupees compared to 21.34 billion rupees in the same quarter last year. EBITDA slightly decreased to 1.47 billion rupees from 1.48 billion rupees, with the EBITDA margin marginally declining to 6.89% from 6.94% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1746015761000,
            "Source": "result"
        },
        {
            "Title": "Godrej Agrovet: Acquisition of Remaining Stake in Creamline Dairy Products",
            "Summary": "Godrej Agrovet signs agreement to acquire 47.38% stake in Creamline Dairy Products, following a previous announcement to buy 48.06% for Rs 930 crore. This will make Creamline Dairy Products a wholly owned subsidiary. Creamline Dairy unveils strategy for FY 2025-26, focusing on product expansion and innovation.",
            "Sentiment": "positive",
            "PublishDate": 1742555844000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Agrovet Targets ₹1000 Crore Value-Added Portfolio in Andhra Pradesh and Telangana",
            "Summary": "Godrej Agrovet has announced plans to achieve a value-added portfolio worth ₹1000 crore in the states of Andhra Pradesh and Telangana. This strategic move indicates the company's focus on expanding its presence and enhancing its product offerings in these key agricultural markets.",
            "Sentiment": "positive",
            "PublishDate": 1742539661000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Jersey Unveils 3X3 Strategy for FY26",
            "Summary": "Godrej Jersey, a subsidiary of Godrej Agrovet, has announced its '3X3 Strategy' for the fiscal year 2026. The strategy focuses on three key areas: three hero product categories, increasing household penetration, and expanding market presence. Additionally, the company plans to emphasize product innovation as part of its growth plan.",
            "Sentiment": "positive",
            "PublishDate": 1742539616000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Agrovet Acquires 48.06% Stake in Creamline Dairy Products",
            "Summary": "Godrej Agrovet has approved the acquisition of a 48.06% stake in Creamline Dairy Products for 9.3 billion rupees. This strategic move represents a significant investment in the dairy sector by Godrej Agrovet.",
            "Sentiment": "positive",
            "PublishDate": 1741739470000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Agrovet Acquires 48.06% Stake in Creamline Dairy Products",
            "Summary": "Godrej Agrovet has approved the acquisition of a 48.06% stake in Creamline Dairy Products. The deal is valued at 9.3 billion rupees (approximately $112 million USD). This strategic move is likely to strengthen Godrej Agrovet's position in the dairy sector.",
            "Sentiment": "positive",
            "PublishDate": 1741687900000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Agrovet: Targeting 10% EBITDA Margins by FY26 with Focus on Value-Added Products",
            "Summary": "Godrej Agrovet aims to stabilize EBITDA margins at 9-10% in FY26 by focusing on value-added products. The company reported a 4.5% YoY revenue increase to Rs 2,450 crore in Q3, with net profit up 17% YoY to Rs 99 crore. Managing Director Balram Singh Yadav expects similar momentum in Q4 and targets over 10% topline growth next year.",
            "Sentiment": "positive",
            "PublishDate": 1738649252000,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Agrovet Reports Q3 Profit Increase and Plans Additional Borrowings",
            "Summary": "Godrej Agrovet announced its Q3 consolidated net profit of 1.11 billion rupees, up from 918 million rupees year-over-year and 1.12 billion rupees quarter-over-quarter. The company's Q3 revenue rose to 24.5 billion rupees from 23.4 billion rupees in the previous year. Additionally, Godrej Agrovet plans to raise funds through additional borrowings of up to 10 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738359906000,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Agrovet to Raise Up to 10 Billion Rupees Through Additional Borrowings",
            "Summary": "Godrej Agrovet has announced plans to raise funds through additional borrowings of up to 10 billion rupees. This decision indicates the company's intent to increase its financial resources, potentially for expansion, debt refinancing, or other strategic initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1738325032000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Agrovet Reports Improved Q3 EBITDA and Margin",
            "Summary": "Godrej Agrovet has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 2.34 billion rupees from 1.72 billion rupees in the previous year. Additionally, the EBITDA margin expanded to 9.54% from 7.32% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738325023000,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Agrovet Reports Q3 Revenue Increase",
            "Summary": "Godrej Agrovet has reported a revenue of 24.5 billion rupees for the third quarter, compared to 23.4 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738325010000,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Agrovet Reports Increased Q3 Consolidated Net Profit",
            "Summary": "Godrej Agrovet has reported a consolidated net profit of 1.11 billion rupees for the third quarter, showing an increase from 918 million rupees in the same period last year. The profit also improved sequentially from 1.12 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738325003000,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Agrovet Launches Pride Hog Feed Range",
            "Summary": "Godrej Agrovet has introduced a new product line called Pride Hog Feed Range, designed to improve the health and immunity of pigs. This launch represents an expansion of the company's animal feed portfolio and aims to address the nutritional needs of the pig farming industry.",
            "Sentiment": "positive",
            "PublishDate": 1735884561000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Government Allots Land to Godrej Agrovet for Oil Palm Cultivation Expansion",
            "Summary": "The Government of Gujarat has allocated areas in three districts - Vadodara, Surat, and Tapi - to Godrej Agrovet for expanding oil palm cultivation. This initiative is part of the National Mission on Edible Oils - Oil Palm program.",
            "Sentiment": "positive",
            "PublishDate": 1734314191000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Agrovet Reports Improved Q2 Financial Performance",
            "Summary": "Godrej Agrovet has announced its Q2 financial results, showing an increase in EBITDA to 2.2 billion rupees from 2 billion rupees year-over-year. The company's EBITDA margin also improved, rising to 9.12% from 7.84% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730202377000,
            "Source": "result"
        },
        {
            "Title": "Godrej Agrovet Reports Q2 Revenue Decline",
            "Summary": "Godrej Agrovet has reported a revenue of 24.5 billion rupees for the second quarter, down from 25.71 billion rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1730202365000,
            "Source": "result"
        },
        {
            "Title": "Godrej Agrovet Reports Q2 FY24 Financial Results",
            "Summary": "Godrej Agrovet has announced its Q2 consolidated net profit of 958 million rupees, showing a decrease from 1.1 billion rupees year-over-year and 1.3 billion rupees quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1730202353000,
            "Source": "result"
        }
    ]
}