{
    "Symbol": "GODREJCP",
    "ISIN": "INE102D01028",
    "News": [
        {
            "Title": "Godrej Consumer Q3FY26: Strong 9% Revenue Growth",
            "Summary": "Godrej Consumer Products delivered robust Q3FY26 performance with 9% revenue growth, 16% EBITDA expansion, and healthy 7% underlying volume growth across all key metrics.",
            "Sentiment": "positive",
            "PublishDate": 1769775702753,
            "Source": "co_actions_results"
        },
        {
            "Title": "Godrej Consumer Products Q3FY26 Results & Dividend",
            "Summary": "Godrej Consumer Products reported strong Q3FY26 performance with consolidated revenue of ₹4,099.12 cr and net profit of ₹497.91 cr. Board declared interim dividend of ₹5 per share.",
            "Sentiment": "positive",
            "PublishDate": 1769164754980,
            "Source": "co_actions_results"
        },
        {
            "Title": "Godrej Consumer Products Shares Dip Despite Upgrades",
            "Summary": "Godrej Consumer Products shares fell 0.61% to ₹1,246.40 despite brokerages upgrading estimates after strong Q3 FY26 business update showing double-digit revenue growth and improved volume performance.",
            "Sentiment": "neutral",
            "PublishDate": 1767775557459,
            "Source": "stocks"
        },
        {
            "Title": "Godrej Consumer Reports Steady Demand Improvement",
            "Summary": "Godrej Consumer Products reported steady improvement in demand throughout the quarter, indicating positive momentum in the FMCG sector amid challenging market conditions.",
            "Sentiment": "positive",
            "PublishDate": 1767708906987,
            "Source": "stocks"
        },
        {
            "Title": "Godrej Consumer Products Q3FY26 Shows Strong Growth",
            "Summary": "Godrej Consumer Products reports double-digit revenue growth and improved EBITDA margins for Q3FY26, driven by robust Home Care performance and recovering Personal Care segment amid strengthening demand conditions.",
            "Sentiment": "positive",
            "PublishDate": 1767707206652,
            "Source": "co_actions_results"
        },
        {
            "Title": "Godrej Consumer Products Block Trade Worth ₹19.87 Cr",
            "Summary": "Godrej Consumer Products executed a significant NSE block trade worth ₹19.87 crores involving 161,545 shares at ₹1,229.90 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767345681929,
            "Source": "co_actions_results"
        },
        {
            "Title": "Godrej Consumer Products Sees Rs. 172.69 Crore Block Trade on NSE",
            "Summary": "Godrej Consumer Products Ltd. witnessed a block trade worth Rs. 172.69 crores involving approximately 1,534,198 shares at Rs. 1125.60 per share on the NSE. The transaction represents a significant institutional or bulk investor activity in the consumer goods company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764053651642,
            "Source": "order&deals"
        },
        {
            "Title": "Godrej Consumer Products Sees Rs. 58.46 Crore Block Trade on NSE",
            "Summary": "Godrej Consumer Products Ltd. witnessed a block trade worth Rs. 58.46 crores involving approximately 521,924 shares executed at Rs. 1,120.00 per share on NSE. The transaction represents a significant institutional or bulk investor activity in the FMCG company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1763705671161,
            "Source": "order&deals"
        },
        {
            "Title": "Godrej Consumer Products Sees Rs. 113.35 Crore Block Trade on NSE",
            "Summary": "Godrej Consumer Products Ltd. witnessed a block trade worth Rs. 113.35 crores involving approximately 1,012,067 shares at Rs. 1,120.00 per share on NSE. The transaction represents a significant institutional or bulk investor activity in the consumer goods company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1763699639207,
            "Source": "order&deals"
        },
        {
            "Title": "Godrej Consumer Products Allots 1.42 Lakh Equity Shares Under Employee Stock Grant Scheme",
            "Summary": "Godrej Consumer Products Limited allotted 1,41,977 equity shares of face value ₹1 each under its Employee Stock Grant Scheme 2011 at an exercise price of ₹1 per share on November 18, 2025. The company's paid-up equity share capital increased to ₹102,32,44,581 comprising 102,32,44,581 equity shares, with the new shares ranking pari passu with existing shares including dividend entitlement.",
            "Sentiment": "neutral",
            "PublishDate": 1763470597379,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Consumer Products Sees Rs. 57.25 Crore Block Trade on NSE",
            "Summary": "Godrej Consumer Products Ltd witnessed a block trade worth Rs. 57.25 crores involving approximately 506,439 shares executed at Rs. 1,130.50 per share on NSE. The transaction represents a significant institutional or bulk investor activity in the FMCG company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1763101985246,
            "Source": "order&deals"
        },
        {
            "Title": "Godrej Consumer Completes ₹450 Crore Acquisition of Men's Grooming Brand Muuchstac",
            "Summary": "Godrej Consumer Products Ltd has completed the acquisition of men's grooming brand Muuchstac for ₹450 crore, with founders Vishal Lohia and Ronak Bagadia continuing to run the business. The deal provides founders with a greater than 15,000x return on their ₹3 lakh initial investment, as Muuchstac expects ₹80 crore revenue with ₹30 crore EBITDA and holds the number 2 position in men's face washes online.",
            "Sentiment": "positive",
            "PublishDate": 1763059041171,
            "Source": "order&deals"
        },
        {
            "Title": "Godrej Consumer Products Completes Acquisition of TSPL's FMCG Business",
            "Summary": "Godrej Consumer Products Limited has completed its acquisition of the FMCG business of Trilogy Solutions Private Limited (TSPL) through a slump sale on a going concern basis. TSPL operates primarily in the male grooming category under the Muuchstac brand. The acquisition was previously announced on October 31, 2025, and was completed on November 10, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762819788471,
            "Source": "order&deals"
        },
        {
            "Title": "Godrej Consumer Products Reports 4% Revenue Growth Despite GST Transition Challenges",
            "Summary": "Godrej Consumer Products Limited reported consolidated revenue growth of 4% in INR terms for Q2 FY26, supported by 3% underlying volume growth. The company's India business grew 4% in sales and 3% in volumes, while facing GST-related trade disruptions that particularly impacted soaps and hair color categories. EBITDA margins stood at 19.3% and net profit before exceptions declined by 2%. The Indonesia business faced macro and pricing pressures with 2% volume growth but negative 7% revenue growth. In contrast, Africa, USA and Middle East delivered 25% sales growth in INR terms. The company announced the acquisition of men's grooming brand Muuchstac for approximately INR 300 crores, which generated INR 80 crores revenue and INR 30 crores EBITDA in the last 12 months. Management expects high single-digit underlying volume growth for the full year and anticipates margins to return to normative levels of 24-26% in the second half.",
            "Sentiment": "neutral",
            "PublishDate": 1762299091960,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Consumer Shares Surge 6% Despite Profit Decline as Goldman Sachs Raises Target Price",
            "Summary": "Godrej Consumer Products shares jumped 6% to Rs 1,185.95 following quarterly results and Goldman Sachs raising its target price to Rs 1,425. The company reported a consolidated net profit of Rs 459.3 crore, down 6.5% from Rs 491.3 crore in the same period last year. Revenue grew 4.3% year-on-year to Rs 3,825 crore, while EBITDA declined 3.5% to Rs 733.6 crore with operating margin falling to 19.2% from 20.7%. India operations showed steady growth with 4% sales increase and 3% volume growth, led by strong double-digit expansion in non-soap categories. CEO Sudhir Sitapati noted that GST rate cuts temporarily disrupted trade channels in soaps and hair colour segments. International performance was mixed - Indonesia saw mid-single-digit volume growth but 7% drop in constant-currency sales, while Africa, US, and Middle East recorded 25% growth in rupee terms. Latin America reported 9% decline in rupee revenue. Goldman Sachs maintained its Buy rating citing expected reversal of GST transition headwinds and highlighted the company's acquisition of men's face wash brand Muuchstac. Citi maintained Buy rating with Rs 1,350 target, while Elara Capital kept Accumulate rating with reduced target of Rs 1,240.",
            "Sentiment": "positive",
            "PublishDate": 1762144342262,
            "Source": "stock"
        },
        {
            "Title": "Godrej Consumer Products Forecasts High Single-Digit Growth for FY26",
            "Summary": "Godrej Consumer Products has forecasted high single-digit growth for both its India business and consolidated revenue for FY26. The company expects Indian business margins to be at the lower end of the 24-26% range during the second half of FY26. For the full year, the company anticipates double-digit EBITDA growth for both its Indian and GOM (Greater Overseas Markets) businesses.",
            "Sentiment": "positive",
            "PublishDate": 1761993880984,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Consumer Products Targets Mid-To-High Single-Digit Volume Growth Through Innovation and Expansion",
            "Summary": "Godrej Consumer Products has provided guidance for mid-to-high single-digit volume growth. The company plans to drive this growth through innovation across its home, personal, and household care product categories. The strategy includes accelerating rural market penetration, premiumization of products, and expanding its African portfolio to sustain margin improvement.",
            "Sentiment": "positive",
            "PublishDate": 1761922513245,
            "Source": "stock"
        },
        {
            "Title": "Godrej Consumer Products Reports 4% Revenue Growth, Announces Acquisition of Men's Grooming Brand Muuchstac",
            "Summary": "Godrej Consumer Products Limited reported consolidated sales growth of 4% in INR and constant currency terms for the quarter ended September 30, 2025, driven by 3% underlying volume growth. The company's standalone business achieved 3% volume growth and 4% sales growth year-on-year. EBITDA margins stood at 19.3% while consolidated net profit declined 2% year-on-year due to temporary headwinds. The company faced GST transition impacts in India and macroeconomic challenges in Indonesia. Indonesia sales declined 7% despite 2% volume growth, while Africa, USA, and Middle East delivered strong 25% sales growth in INR terms. The company signed a definitive agreement to acquire the FMCG business under the Muuchstac brand, one of India's fastest-growing men's grooming brands with a leadership position in men's facewash. Muuchstac recorded revenues of approximately ₹80 crore and EBITDA of around ₹30 crore over twelve months ending September 2025. The acquisition aims to strengthen GCPL's presence in the fast-growing men's grooming segment and expand participation in the premium skincare market.",
            "Sentiment": "positive",
            "PublishDate": 1761915749196,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Consumer Revenue Hit by GST Changes and Indonesia Market Decline",
            "Summary": "Godrej Consumer reported that its revenue was impacted by GST changes and a slump in Indonesia. The company expects demand to normalize as trade channels stabilize.",
            "Sentiment": "neutral",
            "PublishDate": 1761910522939,
            "Source": "stock"
        },
        {
            "Title": "Godrej Consumer Products Reports Mixed Q2 Results, Announces Dividend and Acquisition",
            "Summary": "Godrej Consumer Products reported quarterly revenue of 38.25 billion rupees, up from 36.66 billion rupees year-over-year. However, net profit declined to 4.59 billion rupees from 4.91 billion rupees, while EBITDA dropped to 7.33 billion rupees from 7.6 billion rupees. EBITDA margin compressed to 19.17% from 20.72%. The company recommended an interim dividend of 5 rupees per share and announced the acquisition of TrioLogy Solutions' FMCG business for 2.89 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1761909669319,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Consumer Products Head of Lightbox Creative Lab Resigns",
            "Summary": "Swati Bhattacharya, Head of Lightbox Creative Lab at Godrej Consumer Products Limited, has resigned from her position effective January 1, 2026. She cited that the role did not leverage her strengths and objectives as the reason for her departure. The company has acknowledged her resignation and expressed appreciation for her contributions during her tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1761324556701,
            "Source": "corporate_governance"
        },
        {
            "Title": "Godrej Consumer Products Schedules Board Meeting for Q2 Results and Interim Dividend Consideration",
            "Summary": "Godrej Consumer Products Limited has scheduled a Board of Directors meeting for October 31, 2025, to review unaudited financial results for the quarter and half year ended September 30, 2025. The board will also consider declaring an interim dividend during this meeting. If an interim dividend is declared, the record date for determining eligible shareholders will be November 7, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760623052698,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Consumer Expects Mid-Single Digit Q2 Revenue Growth Despite EBITDA Drop from GST Transition",
            "Summary": "Godrej Consumer anticipates mid-single digit revenue growth in Q2, driven by strong performance in international markets. The company expects double-digit value and volume growth in Africa, USA, and Middle East regions. However, the company projects a short-term profit impact and EBITDA decline due to GST transition effects during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1759846026625,
            "Source": "stock"
        },
        {
            "Title": "Godrej Consumer Products Infuses USD 85 Million in Mauritius Subsidiary",
            "Summary": "Godrej Consumer Products Limited infused USD 85 million in equity into its wholly owned subsidiary, Godrej Mauritius Africa Holdings Limited (GMAHL). The transaction involved acquiring 8,09,52,381 equity shares of USD 1.05 each. The company maintains 100% ownership of GMAHL following this primary capital infusion. The objective is to strengthen and deleverage GMAHL's balance sheet. GMAHL is an investment holding company incorporated in Mauritius in 2011 with no operational turnover. The transaction complies with foreign exchange regulations and does not increase the company's total financial commitment.",
            "Sentiment": "positive",
            "PublishDate": 1758293324471,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Consumer Products' Indonesian Unit Launches ₹250 Crore Manufacturing Expansion",
            "Summary": "Godrej Consumer Products' Indonesian subsidiary has initiated a ₹250 crore expansion project aimed at increasing manufacturing capacity. The expansion represents a significant investment in the company's Indonesian operations to enhance production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1757340607027,
            "Source": "stock"
        },
        {
            "Title": "Godrej Consumer Products Reports Mixed Q1 FY26 Results with 10% Revenue Growth but 3% EBITDA Decline",
            "Summary": "Godrej Consumer Products Limited delivered mixed quarterly results with consolidated revenue growing 10% year-on-year and underlying volume growth of 8%. However, consolidated EBITDA declined 3%. The India business showed 8% revenue growth and 5% volume growth, though India EBITDA fell 6%. The company's ex-soaps business in India performed strongly with mid-teens underlying volume growth. Household Insecticides delivered robust performance with high single-digit volume growth and double-digit growth in the Electrics segment, gaining market share through their new RNF molecule. The soaps segment faced challenges due to grammage cuts and poor seasonal conditions in North India. Geographically, Africa showed strong performance with 30% sales growth and 15% EBITDA growth, while Latin America achieved high single-digit underlying volume growth with double-digit EBITDA margins. Indonesia faced headwinds from macro conditions and competitive pressures. The company launched new products including Bloq antiperspirant, AirPlug, and Amazon Woods 4X, while achieving A&P savings of 150-200 basis points. Management expects mid-to-high single-digit underlying volume growth for the standalone business and double-digit consolidated EBITDA growth for FY26, with sequential improvement expected through the year.",
            "Sentiment": "neutral",
            "PublishDate": 1755154151800,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Consumer Forecasts Higher Volume Growth in India Market",
            "Summary": "Godrej Consumer announced during a conference call that it expects business volume growth in India to increase from mid-single-digits to high-single-digits in the upcoming quarters.",
            "Sentiment": "positive",
            "PublishDate": 1754624356023,
            "Source": "stock"
        },
        {
            "Title": "Godrej Consumer Targets Growth Through Product Innovation and Africa Expansion Amid EBITDA Pressures",
            "Summary": "Godrej Consumer is pursuing growth through new product launches and expanding exports to Africa while implementing cost adjustments. The company is facing EBITDA challenges but anticipates margin improvement in the second half driven by declining palm oil prices.",
            "Sentiment": "neutral",
            "PublishDate": 1754571455517,
            "Source": "stock"
        },
        {
            "Title": "Godrej Consumer Products Reports 10% Revenue Growth and Declares Rs. 5 Interim Dividend",
            "Summary": "Godrej Consumer Products Limited announced its quarterly results for the quarter ended June 30, 2025, showing consolidated revenue growth of 10% to Rs. 3,662 crore driven by 8% underlying volume growth. The company's standalone business grew 8% to Rs. 2,307 crore with 5% volume growth. However, EBITDA declined 3% on consolidated basis and 6% on standalone basis due to cost headwinds and commodity pressures. The Board declared an interim dividend of Rs. 5 per share (500% on face value) with record date of August 13, 2025 and payment by September 6, 2025. The company's India business performed well with Home Care growing 16% and strong performance in household insecticides and air fresheners. Indonesia faced challenges with flat volume growth and 4% sales decline due to macro headwinds and competitive pricing. Africa, USA and Middle East showed strong 30% sales growth.",
            "Sentiment": "neutral",
            "PublishDate": 1754563844939,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Consumer Products Reports Q1 FY26 Results, Declares Rs 5 Interim Dividend",
            "Summary": "Godrej Consumer Products Limited announced its unaudited financial results for the quarter ended June 30, 2025. On a consolidated basis, the company reported revenue from operations of Rs 3,661.86 crore compared to Rs 3,331.58 crore in the same quarter last year. Net profit after tax stood at Rs 452.45 crore versus Rs 450.69 crore in the previous year quarter. On a standalone basis, revenue was Rs 2,329.99 crore against Rs 2,162.93 crore last year, with net profit of Rs 354.69 crore compared to Rs 367.84 crore. The company declared an interim dividend of Rs 5 per share for FY 2025-26, with record date set for August 13, 2025, and payment by September 6, 2025. The results included exceptional items of Rs 19.54 crore related to litigation settlement in Indonesia.",
            "Sentiment": "neutral",
            "PublishDate": 1754563142080,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Consumer Products Sees Block Trade Worth Rs. 115.16 Crores on NSE",
            "Summary": "Godrej Consumer Products Ltd. witnessed a block trade on the National Stock Exchange involving approximately 953,206 shares at a price of Rs. 1,208.10 per share. The total transaction value amounted to Rs. 115.16 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1753854766523,
            "Source": "order&deals"
        },
        {
            "Title": "Godrej Consumer Products Sees Rs. 24.52 Crore Block Trade on NSE",
            "Summary": "Godrej Consumer Products Ltd. witnessed a block trade worth Rs. 24.52 crores on the NSE. The transaction involved approximately 201,485 shares at a price of Rs. 1,217.10 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1753674554825,
            "Source": "order&deals"
        },
        {
            "Title": "Godrej Consumer Products Ltd. Sees Rs. 30.52 Crores Block Trade on NSE",
            "Summary": "A block trade of approximately 239,924 shares of Godrej Consumer Products Ltd. took place on the National Stock Exchange (NSE). The trade was valued at Rs. 30.52 Crores, with shares priced at Rs. 1272.00 each.",
            "Sentiment": "neutral",
            "PublishDate": 1751956457000,
            "Source": "block_details"
        },
        {
            "Title": "Godrej Consumer Products: Q1FY26 Update Signals Strong Growth",
            "Summary": "Godrej Consumer Products expects high single-digit value growth and mid-single-digit volume growth for Q1FY26. Home Care segment projects double-digit growth. GAUM business to deliver double-digit value and volume growth. Company maintains full-year outlook but flags Q1 margin pressure. Nomura reiterates 'Buy' rating with Rs 1,485 target price.",
            "Sentiment": "positive",
            "PublishDate": 1751865025000,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Consumer Products Expects Growth in Q1 Across Segments",
            "Summary": "Godrej Consumer Products anticipates high single-digit value growth for its Q1 standalone business. The Home Care segment is expected to achieve double-digit value growth. The company projects double-digit INR revenue growth at the consolidated level for Q1. The GAUM (Godrej Africa, USA, Middle East) business is anticipated to deliver strong double-digit value growth for the second consecutive quarter. However, the standalone EBITDA margin in Q1 is likely to be below the normative range. The company expects performance to improve sequentially, though the specific fiscal year for this improvement is not mentioned.",
            "Sentiment": "positive",
            "PublishDate": 1751846917000,
            "Source": "default"
        },
        {
            "Title": "Godrej Consumer Products: Double-Digit Revenue Growth Expected in Q1 FY26",
            "Summary": "Godrej Consumer Products Ltd anticipates double-digit consolidated revenue growth in Q1 FY26, driven by high single-digit volume growth. Standalone business expects high single-digit value growth. Home care segment projected for double-digit growth, while personal care may see low single-digit growth. Standalone EBITDA margin for Q1 expected below normative range. Indonesian business facing pricing pressure, while GAUM business expects strong double-digit growth.",
            "Sentiment": "positive",
            "PublishDate": 1751632187000,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Consumer Products Anticipates Strong Q1 Performance",
            "Summary": "Godrej Consumer Products expects strong revenue growth in Q1, with double-digit value growth in their Gaum business for the second consecutive quarter. The company foresees better sequential performance, although standalone EBITDA margin in Q1 may be below the normal range. For the standalone business, high-single digit value growth is expected in Q1, with the Home Care business anticipating double-digit value growth.",
            "Sentiment": "positive",
            "PublishDate": 1751631616000,
            "Source": "default"
        },
        {
            "Title": "Godrej Consumer Products Ltd: Bullish on Demand Revival Amid Easing Inflation",
            "Summary": "GCPL expects consumer demand revival in 12-18 months due to easing food inflation, tax cuts, and pay commission hikes. Q4 saw 6% volume growth and 6.2% revenue increase. Company focuses on emerging categories like pet care and liquid detergents while facing challenges in soaps due to palm oil prices. GCPL anticipates mid-to-high single-digit volume growth in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1746629321000,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Consumer Products Reports Q4 Profit and Declares Dividend",
            "Summary": "Godrej Consumer Products announced its Q4 financial results. The company reported a consolidated net profit of 4.1 billion rupees, compared to a loss of 18.93 billion rupees in the same quarter last year. Revenue increased to 35.97 billion rupees from 33.86 billion rupees year-over-year. The company also declared a dividend of 5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746576812000,
            "Source": "default"
        },
        {
            "Title": "Godrej Consumer Products Reports Q4 Growth Amid Challenges",
            "Summary": "Godrej Consumer Products experienced mixed results in Q4FY25. While consolidated organic volumes grew by 6%, led by India (4%) and Indonesia (5%), the company faces challenges. A surge in palm oil prices by over 50% is negatively impacting EBITDA margins. Additionally, demand conditions in India continue to be affected by headwinds in urban consumption.",
            "Sentiment": "neutral",
            "PublishDate": 1746541957000,
            "Source": "default"
        },
        {
            "Title": "Godrej Consumer Products: Q4 Profit Misses Estimates",
            "Summary": "Godrej Consumer Products Ltd. reported a Q4 FY25 profit of Rs 412 crore, below analysts' estimates of Rs 490.8 crore. Revenue increased 6.2% YoY to Rs 3,598 crore. EBITDA rose 0.4% to Rs 759 crore, while margin narrowed to 21.1%.",
            "Sentiment": "neutral",
            "PublishDate": 1746541078000,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Consumer Products Q4 Results and Dividend Declaration",
            "Summary": "Godrej Consumer Products has announced its Q4 financial results and declared a dividend. The company reported a Q4 consolidated net profit of 4.1 billion rupees, compared to a loss of 18.93 billion rupees in the same period last year. Q4 revenue increased to 35.97 billion rupees from 33.86 billion rupees year-over-year. EBITDA for Q4 was 7.6 billion rupees, with an EBITDA margin of 21.12%. The company has also declared a dividend of 5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746538457000,
            "Source": "result"
        },
        {
            "Title": "Godrej Consumer Products: Q4 Results Date, Interim Dividend, and Investor Meet Announced",
            "Summary": "Godrej Consumer Products Ltd. will announce Q4 and FY 2024-25 results on May 6. The board will consider an interim dividend with a record date of May 13. An investor meet is scheduled for May 7. The trading window is closed from April 1 until 48 hours after results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1746420448000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Pet Care: Launches 'Godrej Ninja' with Rs 500 Crore Investment",
            "Summary": "Godrej Pet Care, a subsidiary of Godrej Consumer Products Ltd., has entered the Indian pet food market with 'Godrej Ninja'. The company plans to invest Rs 500 crore over five years. The brand offers scientifically formulated dog food, priced from Rs 20 to Rs 640 across various sizes. Godrej Pet Care aims to capitalize on the growing Rs 5,000 crore domestic pet food market within India's Rs 6,000 crore pet care industry.",
            "Sentiment": "positive",
            "PublishDate": 1744134097000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Consumer Products: Enters Pet Food Market with 'Ninja' Brand",
            "Summary": "Godrej Consumer Products Ltd. has launched 'Ninja', a dog food brand, in Tamil Nadu, aiming for Rs 500 crore revenue in five years. The company plans nationwide expansion and will invest Rs 500 crore, including setting up a manufacturing plant in Nashik.",
            "Sentiment": "positive",
            "PublishDate": 1744097476000,
            "Source": "normal_news"
        },
        {
            "Title": "Godrej Consumer Products Forecasts Mid-Single Digit UVG and High Single Digit Revenue Growth",
            "Summary": "Godrej Consumer Products expects standalone UVG (Underlying Volume Growth) to be in the mid-single digits and revenue growth to be in the high single digits. The company anticipates EBITDA margins to remain similar to Q3 FY25 levels, despite high inflation in palm and related derivatives.",
            "Sentiment": "neutral",
            "PublishDate": 1743994695000,
            "Source": "earnings"
        },
        {
            "Title": "Godrej Consumer Products to Create Over 1000 Jobs with New Plant",
            "Summary": "Godrej Consumer Products Limited (GCPL) has announced plans for a new manufacturing plant that will generate employment for more than 1000 people. This expansion indicates growth for the company and potential economic benefits for the local community.",
            "Sentiment": "positive",
            "PublishDate": 1741587396000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Consumer Products Launches First Integrated Greenfield Manufacturing Facility in Tamil Nadu",
            "Summary": "Godrej Consumer Products Limited (GCPL) has achieved a significant milestone with the launch of its first integrated greenfield manufacturing facility in Tamil Nadu. This new facility represents a major expansion of the company's manufacturing capabilities and is likely to enhance its production capacity and efficiency in the region.",
            "Sentiment": "positive",
            "PublishDate": 1741587348000,
            "Source": "corporate_action"
        },
        {
            "Title": "Godrej Consumer Products Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 251,490 shares of Godrej Consumer Products Ltd. was executed on the National Stock Exchange (NSE) for Rs. 26.41 Crores. The trade was conducted at a price of Rs. 1050.15 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1740630921000,
            "Source": "block_deals"
        },
        {
            "Title": "Godrej Consumer Products Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 168,236 shares of Godrej Consumer Products Ltd. was executed on the National Stock Exchange (NSE) at a price of Rs. 1071.25 per share. The total value of the transaction amounted to Rs. 18.02 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1740034138000,
            "Source": "block_deals"
        }
    ]
}