{
    "Symbol": "GOKEX",
    "ISIN": "INE887G01027",
    "News": [
        {
            "Title": "SBI Mutual Fund cuts stake in Gokaldas Exports to 7.76%",
            "Summary": "SBI Mutual Fund reduces shareholding in Gokaldas Exports by 2% to 7.7585% after selling 1,53,922 shares worth 0.2102% of paid-up capital under SEBI regulations disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1769752401208,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gokaldas Exports Board Meet on Jan 31 for Q3FY26 Results",
            "Summary": "Gokaldas Exports Limited has scheduled a board meeting on January 31, 2026, to consider Q3FY26 financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769603072085,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gokaldas Exports eyes EU growth amid US tariff woes",
            "Summary": "Gokaldas Exports welcomes India-EU FTA, expects EU revenue share to rise from 16-17% to 19-20% over 12 months. US tariffs cut margins to low single digits despite strong order pipeline through Q1 FY27.",
            "Sentiment": "neutral",
            "PublishDate": 1769485466536,
            "Source": "stocks"
        },
        {
            "Title": "Gokaldas Exports Plunges 13% on US Trade Concerns",
            "Summary": "Gokaldas Exports shares fell 13% to ₹597, now trading 50% below all-time high amid US trade uncertainty, tariff concerns, and critical order-booking window challenges.",
            "Sentiment": "negative",
            "PublishDate": 1767934499968,
            "Source": "stocks"
        },
        {
            "Title": "Gokaldas Exports Plunges 12% Amid US Trade Concerns",
            "Summary": "Gokaldas Exports shares fell 12% on January 8, marking the biggest single-day drop since April 2020. The stock is down 47% from its 52-week high amid US trade uncertainties.",
            "Sentiment": "negative",
            "PublishDate": 1767855498003,
            "Source": "stocks"
        },
        {
            "Title": "Gokaldas Exports Q2FY26 Results: 7% Revenue Growth Despite US Tariff Challenges",
            "Summary": "Gokaldas Exports reported total income of INR 1,003 crores in Q2FY26 with 7% growth, while India operations grew 14% year-on-year despite facing 50% US penalty tariffs that impacted margins by INR 12-15 crores. The company maintained business momentum through tariff burden-sharing agreements with customers and secured strong order books of INR 900+ crores for India and INR 240-250 crores for Africa operations.",
            "Sentiment": "neutral",
            "PublishDate": 1763557870860,
            "Source": "earnings"
        },
        {
            "Title": "Gokaldas Exports Reports 84% Drop in Q2 Net Profit to Rs 808 Lakhs",
            "Summary": "Gokaldas Exports reported a net profit of Rs 808.36 lakhs for the quarter ended September 30, 2025, representing an 84% decline from Rs 4,955.70 lakhs in the previous quarter. Revenue from operations increased to Rs 98,435.36 lakhs compared to Rs 95,578.61 lakhs in the previous quarter. For the half-year period, net profit reached Rs 4,955.70 lakhs on revenue of Rs 194,013.97 lakhs. The company's basic earnings per share for the quarter stood at Rs 1.10 compared to Rs 3.73 in the previous quarter. The Board approved these unaudited financial results in a meeting held on November 11, 2025. During the quarter, the company further acquired equity shares in BRFL Textiles Private Limited for Rs 1,631.96 lakhs, bringing its total equity interest to 19%. The Board has also approved a scheme of amalgamation of BRFL Textiles with the company, subject to regulatory approvals.",
            "Sentiment": "negative",
            "PublishDate": 1762915712872,
            "Source": "earnings"
        },
        {
            "Title": "Gokaldas Exports Reports 7% Revenue Growth Despite Africa Operations Decline and US Tariff Impact",
            "Summary": "Gokaldas Exports reported consolidated total income of Rs. 1,003 crores in Q2 FY26, representing 7% year-on-year growth. India operations showed strong 14% YoY growth against a backdrop of 2% decline in Indian apparel exports, while Africa operations declined 23% year-on-year due to lower volumes from delayed order placements amid AGOA rollover uncertainty. EBITDA remained flat at Rs. 84 crores despite the company sharing a considerable portion of US tariff burden with key customers. EBITDA margin was 8.3% compared to 8.7% in the previous year. The company reported PAT of Rs. 8 crores, down 71% YoY. Vice Chairman and Managing Director Sivaramakrishnan Ganapathi noted that performance was impacted by low volume in Africa business due to AGOA rollover uncertainty, US tariff impact, and startup costs from new business units. The company expects strong order book buildup in coming quarters for both India and Africa operations based on possible AGOA reinstatement.",
            "Sentiment": "neutral",
            "PublishDate": 1762882013185,
            "Source": "earnings"
        },
        {
            "Title": "Gokaldas Exports Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Gokaldas Exports reported Q2 EBITDA of 646 million rupees, down from 696 million rupees in the same period last year. The company's EBITDA margin also decreased to 6.56% from 7.49% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762877447935,
            "Source": "earnings"
        },
        {
            "Title": "Gokaldas Exports Reports 71% Drop in Quarterly Net Profit Despite Revenue Growth",
            "Summary": "Gokaldas Exports reported a consolidated net profit of 81 million rupees for the quarter, down from 282 million rupees in the same period last year. The company's revenue increased to 9.8 billion rupees compared to 9.3 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762876553006,
            "Source": "earnings"
        },
        {
            "Title": "Gokaldas Exports Focuses on Kenya, Europe Expansion Amid Tariff Challenges",
            "Summary": "Gokaldas Exports is navigating tariff headwinds while pursuing growth opportunities in Kenya and Europe. The company's Europe revenue has doubled, though from a low base, with management targeting to double growth over the next two years. The company is also diversifying its product portfolio, particularly focusing on synthetics where it sees strong long-term potential. Systematix maintains a Hold rating on the stock.",
            "Sentiment": "neutral",
            "PublishDate": 1757642921771,
            "Source": "stock"
        },
        {
            "Title": "Indian Exporters Plan Africa Expansion to Counter 50% US Tariffs",
            "Summary": "Indian companies are exploring production expansion in Africa following President Trump's imposition of 50% tariffs on Indian exports as punishment for Russian oil purchases. Gokaldas Exports and Raymond Lifestyle are among firms planning to leverage lower African tariffs of around 10% in countries like Kenya and Ethiopia, compared to the steep US levy on Indian goods. The tariffs, which began Wednesday, are expected to reduce exports of certain goods by up to 90% and could more than halve India's overall exports to the US, its biggest market. India exported over $20 billion in textile products, jewelry and diamonds to the US in 2023. Labor-intensive sectors including jewelry and apparel face the hardest impact. African countries like Ethiopia, Nigeria, Botswana, and Morocco offer incentives including tax holidays and duty exemptions to attract investment. However, the manufacturing shift will be time-consuming as companies renegotiate terms with US buyers amid order deferrals and cancellations.",
            "Sentiment": "negative",
            "PublishDate": 1756433778073,
            "Source": "stock"
        },
        {
            "Title": "Gokaldas Exports Shares Drop 7% as Trump's 50% Tariff Deadline Approaches",
            "Summary": "Gokaldas Exports shares declined up to 7% on Monday, August 25, ahead of the August 27 deadline for US President Donald Trump's additional 25% tariff on Indian goods. The new tariff will double existing trade penalties to 50% total, targeting India for buying Russian oil. Vice Chairman and MD Sivaramakrishnan Ganapathi warned that brands may gradually shift business to other countries if the 50% duty remains, potentially causing India to lose its foothold in the US market. He emphasized that pivoting to alternative markets takes at least a year, making immediate support critical for exporters, particularly MSMEs. Jefferies analyst Mahesh Nandurkar noted the tariffs could put India's $87 billion worth of exports to the US at risk, equivalent to 2.2% of GDP. Textiles, chemicals, auto ancillaries, and fisheries are expected to be most impacted, while pharmaceutical and electronics exports remain exempt.",
            "Sentiment": "negative",
            "PublishDate": 1756110435141,
            "Source": "stock"
        },
        {
            "Title": "Gokaldas Exports Reports 53% PAT Growth Despite Tariff Challenges in Q1 FY26",
            "Summary": "Gokaldas Exports delivered strong quarterly results with PAT growing 53% to INR 41 crores and EBITDA margin improving to 12.1% from 8.8% year-on-year. Total income grew 4% while excluding acquired entities showed 20% growth. The company faced margin pressure from customer discounts of INR 15 crores related to U.S. tariff absorption. Management expects continued tariff burden sharing of 2-2.5% of revenue through the financial year due to revised U.S. tariffs on India reaching 25%. The company is expanding capacity with three new factories in India and 500 additional machines in Africa coming online in Q3. European business contribution increased to 13.4% from 9% average in FY25 as part of geographical diversification strategy. BTPL fabric processing unit acquisition is progressing with total cost revised to INR 552 crores from earlier INR 588 crores estimate. Africa operations may benefit from lower 10% U.S. tariff compared to 20-25% for other countries. Management indicated Q2 will face similar margin challenges as Q1 due to pre-committed orders with tariff burden sharing arrangements.",
            "Sentiment": "neutral",
            "PublishDate": 1755106134556,
            "Source": "earnings"
        },
        {
            "Title": "Gokaldas Exports Board Approves Merger with BRFL Textiles to Create Vertically Integrated Garment Business",
            "Summary": "Gokaldas Exports Limited's board approved a draft scheme to merge with BRFL Textiles Private Limited. The merger combines Gokaldas Exports' garment manufacturing business (turnover of INR 2,476.70 crore, net worth of INR 2,144.92 crore) with BRFL Textiles' fabric manufacturing operations (turnover of INR 371.42 crore, net worth of INR 147.57 crore). BRFL Textiles shareholders can choose between two consideration options: 40 Gokaldas shares for every 3,581 BRFL shares, or 30 Gokaldas shares plus INR 8,952.50 cash for every 3,581 BRFL shares. The merger aims to create a vertically integrated business model, improve operating margins, achieve economies of scale, and optimize resource allocation. The scheme requires regulatory approvals from stock exchanges, National Company Law Tribunal, and shareholders of both companies. Post-merger, promoter shareholding in Gokaldas will decrease from 9.16% to between 8.53-8.68% depending on shareholder choices.",
            "Sentiment": "positive",
            "PublishDate": 1754710431831,
            "Source": "corporate_action"
        },
        {
            "Title": "Gokaldas Exports Faces Order Renegotiations as US Tariffs Loom",
            "Summary": "Gokaldas Exports is prioritizing shipment of existing orders before additional 25% US tariffs take effect, with third-quarter orders now under renegotiation due to looming 50% tariffs on Indian exports. Vice Chairman and Managing Director Sivaramakrishnan Ganapathi stated that orders through early October are contractually closed, but subsequent orders face discussions and renegotiations. The company, which derives 72% of consolidated revenue from the US market, is seeking to diversify but acknowledges the challenge of finding alternative capacity for India's $5 billion export volume at short notice. Ganapathi expects reducing US dependency from 72% to 50% could take one to two years, noting that new clients typically require a year to ramp up. The company reported increased European market contribution in the first quarter and remains cautiously optimistic for tariff resolution within 90 days. Management indicated willingness to sacrifice some margins to maintain relevance while continuing business investments. Gokaldas Exports shares traded 2.57% lower at Rs 704 on the NSE.",
            "Sentiment": "negative",
            "PublishDate": 1754641252669,
            "Source": "stock"
        },
        {
            "Title": "Gokaldas Exports Faces Margin Pressure from Higher US Tariffs Despite Strong Q1 Performance",
            "Summary": "Apparel exporter Gokaldas Exports reported a 52.6% year-on-year increase in consolidated net profit to ₹41.5 crore for the April-June 2025 quarter. However, the company faces challenges from higher US tariffs, with Vice Chairman and Managing Director S Ganapathi stating there is \"limited room to absorb\" a 25% tariff due to single-digit net profit margins. The company expects minimal business disruption in the July-September quarter as orders were placed in advance, but margin pressures are anticipated going forward. Ganapathi noted that while a 25% tariff was manageable, an additional 25% creates significant stress for the $5 billion India-US apparel trade. The company is exploring growth in African operations in Kenya and Ethiopia, which face only 10% tariffs compared to India's higher rates. Gokaldas currently has a market capitalization of ₹5,302.10 crore, though shares have declined over 24% in the past year.",
            "Sentiment": "negative",
            "PublishDate": 1754628796205,
            "Source": "stock"
        },
        {
            "Title": "Gokaldas Exports Plans European Market Expansion and Factory Addition Amid Near-Term Challenges",
            "Summary": "Gokaldas Exports aims to increase its European market share to the mid-20s by FY27. The company is adding three new factories in India during Q3 - one in Bhopal, one in Kolar Goldfield, and one knits factory in Ranchi. For BTPL (Bombay Rayon), the company expects FY27 revenue of Rs 800-900 crores and FY28 revenue of Rs 1,500-1,800 crores with 12% EBITDA. The company faces near-term margin challenges in Q2 FY26 and uncertainty in Q3/Q4 from tariffs, with stronger performance expected from FY27 post-tariff resolution. Gokaldas also faces challenges from India's limited synthetic fabric ecosystem compared to China and Vietnam, though it remains competitive despite importing synthetic fabrics.",
            "Sentiment": "neutral",
            "PublishDate": 1754538467023,
            "Source": "stock"
        },
        {
            "Title": "Gokaldas Exports Reports Strong Q1 Results, Approves Office Relocation and BRFL Textiles Stake Acquisition",
            "Summary": "Gokaldas Exports Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 56,394.84 lakhs and net profit of Rs 19,132.41 lakhs, with basic earnings per share of Rs 26.98. On a consolidated basis, revenue from operations was Rs 95,578.61 lakhs with net profit of Rs 2,717.96 lakhs and basic EPS of Rs 22.36. The Board also approved shifting the registered office from Karnataka to Maharashtra, subject to shareholder approval. Additionally, the company approved acquiring 1,63,19,637 equity shares (2.76% stake) in BRFL Textiles Private Limited for Rs 16.32 crores, which will increase Gokaldas' total shareholding in BTPL to 19%. BTPL operates textile manufacturing and fabric processing facilities in Maharashtra with revenue of Rs 371.42 crores in FY 2024-25. The acquisition aims to provide backward integration for sourcing high-quality fabric at competitive prices.",
            "Sentiment": "positive",
            "PublishDate": 1754388581436,
            "Source": "earnings"
        },
        {
            "Title": "Gokaldas Exports Reports Strong Q1 Performance with 30% Jump in Net Profit",
            "Summary": "Gokaldas Exports delivered robust quarterly results with net profit rising to 415 million rupees from 272 million rupees year-over-year. The company's EBITDA increased to 973 million rupees compared to 750 million rupees in the same period last year, while EBITDA margin expanded to 10.2% from 8.04%. Revenue grew to 9.6 billion rupees from 9.3 billion rupees year-over-year, showing steady top-line growth alongside improved profitability metrics.",
            "Sentiment": "positive",
            "PublishDate": 1754387495758,
            "Source": "earnings"
        },
        {
            "Title": "Trump Announces 25% Tariff on India, Four Textile Stocks Face US Market Exposure Risk",
            "Summary": "US President Donald Trump announced that India will face a 25% tariff starting August 1, along with penalties for purchasing oil from Russia. Four Indian textile companies are particularly exposed: Gokaldas Exports and Indo Count Industries derive 70% of their revenue from the US market, while Welspun Living gets 65% and Pearl Global 50%. India holds a 6% share of US ready-made garment imports, competing with Vietnam (19% share, 20% tariff) and Bangladesh (9% share, 35% tariff). China faces a 55% tariff and continues negotiations with a potential August 12 deadline extension. Gokaldas Exports previously indicated their products face 15-18% average tariffs, with management noting potential US market price increases and uncertain demand impact. Pearl Global plans to increase Vietnam capacity by 25-30% amid rising orders. Stock performance shows mixed results: Pearl Global gained 7% Wednesday and is up 10% year-to-date, while Gokaldas Exports fell 22%, Welspun Living dropped 20%, and Indo Count declined 18% in 2025.",
            "Sentiment": "negative",
            "PublishDate": 1753886754993,
            "Source": "stock"
        },
        {
            "Title": "Textile Stocks: US Imposes 35% Tariff on Bangladesh Exports",
            "Summary": "The US has announced a 35% tariff on Bangladesh textile exports, down from 37% in April but still higher than the 10% baseline. This may impact Indian textile companies' competitiveness. A US-India trade deal is expected soon, which could potentially improve India's market position if favorable terms are secured.",
            "Sentiment": "neutral",
            "PublishDate": 1751942346000,
            "Source": "normal_news"
        },
        {
            "Title": "Gokaldas Exports: Strong FY25 Growth Despite Margin Contraction",
            "Summary": "Gokaldas Exports reported 62.43% revenue growth to ₹3,864 crore in FY25, with PAT up 21% to ₹158.5 crore. Q4 revenue increased 24.94% to ₹1,015 crore. The company plans to pass on most of the 26% US tariff increase to customers. It expects to double UK revenue contribution after the FTA implementation.",
            "Sentiment": "positive",
            "PublishDate": 1747890258000,
            "Source": "earnings"
        },
        {
            "Title": "Gokaldas Exports Reports Improved Q4 Financial Results",
            "Summary": "Gokaldas Exports has announced its Q4 financial results. The company's EBITDA increased to 1.22 billion rupees from 845 million rupees year-over-year. The EBITDA margin improved to 12.07% from 10.4% in the same period last year. Consolidated net profit rose to 528 million rupees from 443 million rupees. Revenue for Q4 grew to 10.15 billion rupees, up from 8.12 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747880156000,
            "Source": "result"
        },
        {
            "Title": "Gokaldas Exports to Consider Q4 Results on May 21",
            "Summary": "Gokaldas Exports has announced that it will consider its fourth quarter financial results on May 21. This indicates the company is preparing to release its earnings report for the final quarter of its fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1747139987000,
            "Source": "default"
        },
        {
            "Title": "Gokaldas Exports Reports Increased Q3 Profit and Revenue",
            "Summary": "Gokaldas Exports has announced its financial results for the third quarter. The company's net profit rose to 494 million rupees, up from 391 million rupees in the same quarter last year. This represents a year-over-year increase and a quarter-over-quarter improvement from 526.3 million rupees. Revenue for Q3 reached 6.25 billion rupees, compared to 5.4 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739146337000,
            "Source": "earnings"
        },
        {
            "Title": "Gokaldas Exports: Q3 Profit Soars 65%, Revenue Hits Rs 1000 Crore Milestone",
            "Summary": "Gokaldas Exports reported a 65% increase in Q3FY25 profit after tax to Rs 50 crore, with total income jumping 79% to Rs 1001 crore. EBITDA margin improved sequentially to 11.9%. The company attributes growth to recent acquisitions and expects business volume to increase in upcoming quarters.",
            "Sentiment": "positive",
            "PublishDate": 1739019611000,
            "Source": "earnings"
        },
        {
            "Title": "Gokaldas Exports Reports Q3 EBITDA and Margin",
            "Summary": "Gokaldas Exports announced its Q3 financial results. The company reported an EBITDA of 725.6 million rupees, slightly lower compared to 728.6 million rupees in the same quarter last year. The EBITDA margin decreased to 11.61% from 13.37% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738946504000,
            "Source": "earnings"
        },
        {
            "Title": "Gokaldas Exports Reports Q3 Revenue Increase",
            "Summary": "Gokaldas Exports has announced its third quarter revenue, which stands at 6.25 billion rupees. This represents an increase from the previous year's figure of 5.4 billion rupees for the same quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738946487000,
            "Source": "earnings"
        },
        {
            "Title": "Gokaldas Exports Reports Q3 Net Profit Increase",
            "Summary": "Gokaldas Exports announced its Q3 financial results, reporting a net profit of 494 million rupees. This represents a year-over-year increase from 391 million rupees and a quarter-over-quarter decrease from 526.3 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738946480000,
            "Source": "earnings"
        },
        {
            "Title": "Gokaldas Exports: Shareholders Reject ESOP Resolutions",
            "Summary": "Shareholders of Gokaldas Exports voted against four special resolutions related to employee stock ownership plans (ESOPs), including a proposal to grant ESOPs exceeding 1% of equity to the managing director. The resolutions failed to achieve the required three-fourths majority, with 37% of participating shareholders voting against them.",
            "Sentiment": "negative",
            "PublishDate": 1737591907000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gokaldas Exports: Shareholders Reject Key ESOP Resolutions",
            "Summary": "Shareholders of Gokaldas Exports voted against four special resolutions related to employee stock ownership plans (ESOPs), including a proposal to grant ESOPs exceeding 1% of equity to the managing director. The resolutions failed to pass despite 63% support, as special resolutions require 75% approval. Advisory firm IiAS recommended voting against the ESOP-related resolutions, arguing that such plans should benefit a broader base of employees.",
            "Sentiment": "negative",
            "PublishDate": 1737567764000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gokaldas Exports: Weakening Rupee to Boost Competitiveness and Cut Costs",
            "Summary": "Gokaldas Exports' MD Sivaramakrishnan Ganapathi states that the recent weakening of the rupee will help reduce manufacturing costs and offset past cost increases. While immediate benefits won't be seen due to hedging, the company expects long-term advantages in competitiveness and margin accretion.",
            "Sentiment": "positive",
            "PublishDate": 1737184841000,
            "Source": "normal_news"
        },
        {
            "Title": "Gokaldas Exports: Multibagger Stock Soars 1260% in 4 Years",
            "Summary": "Gokaldas Exports' stock has shown remarkable growth, rising 1260% over 4 years and 2358% in 11 years. The company's strong performance is attributed to increased global demand for Indian apparel, supply chain diversification from China, and strategic expansions. JM Financial maintains a buy rating with a target price of ₹1,285, citing robust order books and positive industry outlook.",
            "Sentiment": "positive",
            "PublishDate": 1731996464000,
            "Source": "normal_news"
        },
        {
            "Title": "Gokaldas Exports: US and Europe Retail Growth Boosts Demand",
            "Summary": "Gokaldas Exports reports 28% like-for-like revenue growth, with total revenue up 85% due to acquisitions. Demand is increasing as brands optimize inventories and resume buying. The company expects continued growth momentum but faces temporary margin pressure from acquired entities. US and European retail sales growth of 3% YoY is driving demand for Indian exports.",
            "Sentiment": "positive",
            "PublishDate": 1731917097000,
            "Source": "result"
        },
        {
            "Title": "Gokaldas Exports Reports Q2 Financial Results",
            "Summary": "Gokaldas Exports announced its Q2 financial results. The company's EBITDA increased to 625 million rupees from 586 million rupees year-over-year. However, the EBITDA margin decreased to 9.89% from 11.80% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731430059000,
            "Source": "result"
        },
        {
            "Title": "Gokaldas Exports Reports Strong Q2 Financial Results",
            "Summary": "Gokaldas Exports announced its Q2 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's net profit increased to 526 million rupees, up from 310 million rupees in the same quarter last year and 365 million rupees in the previous quarter. Revenue also saw a substantial rise to 6.3 billion rupees, compared to 4.97 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731429994000,
            "Source": "result"
        }
    ]
}