{
    "Symbol": "GOKULAGRO",
    "ISIN": "INE314T01033",
    "News": [
        {
            "Title": "Gokul Agro Q3 Net Profit Rises 7.45% to ₹779M",
            "Summary": "Gokul Agro Resources reports consolidated net profit of ₹779M in Q3, up from ₹725M year-on-year. Revenue surged 26.25% to ₹63B compared to ₹49.9B in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1770296019947,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gokul Agro Shifts Solar Project Location in Gujarat",
            "Summary": "Gokul Agro Resources relocates 11.84 MW captive solar power project from Dalpura to Bamanva village in Gujarat due to technical reasons and regulatory delays. GETCO approves grid connectivity.",
            "Sentiment": "positive",
            "PublishDate": 1767180407730,
            "Source": "stocks"
        },
        {
            "Title": "Gokul Agro Resources Passes 7 Resolutions via E-voting",
            "Summary": "Gokul Agro Resources Limited successfully passed all seven resolutions through postal ballot e-voting, including borrowing power increases, director reappointments, and remuneration approvals with strong shareholder support.",
            "Sentiment": "positive",
            "PublishDate": 1765979543847,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gokul Agro Resources Reports 41% Jump in Q2 Net Profit to 1.01 Billion Rupees",
            "Summary": "Gokul Agro Resources reported quarterly net profit of 1.01 billion rupees compared to 715 million rupees in the same period last year. Revenue increased to 66.38 billion rupees from 48.1 billion rupees year-over-year. EBITDA rose to 1.86 billion rupees from 1.51 billion rupees, though EBITDA margin declined to 2.8% from 3.13% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762951748188,
            "Source": "earnings"
        }
    ]
}