{
    "Symbol": "GOKUL",
    "ISIN": "INE020J01029",
    "News": [
        {
            "Title": "Gokul Refoils Board Meet on Feb 13 for Q3FY26 Results",
            "Summary": "Gokul Refoils & Solvent Ltd schedules board meeting on February 13, 2026 to consider Q3FY26 financial results. Trading window remains closed until 48 hours post declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1770276465861,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gokul Refoils Reports Mixed Q2 Results; Independent Director Parth Shah's Tenure Ends",
            "Summary": "Gokul Refoils & Solvent Limited approved its unaudited standalone and consolidated financial results for the second quarter and half year ended September 30, 2025, showing varied performance across segments. The company also noted the completion of Independent Director Mr. Parth Shah's tenure on November 25, 2025, leading to reconstitution of key board committees including Audit, Nomination and Remuneration, Stakeholders Relationship, and Corporate Social Responsibility committees.",
            "Sentiment": "neutral",
            "PublishDate": 1763062878725,
            "Source": "earnings"
        },
        {
            "Title": "Gokul Refoils and Solvent Limited Publishes Q1 FY2026 Financial Results",
            "Summary": "Gokul Refoils and Solvent Limited published its standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The results were published in Financial Express on August 15, 2025, and submitted to BSE Ltd. and National Stock Exchange of India Ltd. The company fulfilled regulatory compliance requirements through the publication. No specific financial figures, management commentary, or strategic initiatives were disclosed in the available information.",
            "Sentiment": "neutral",
            "PublishDate": 1755524981245,
            "Source": "earnings"
        },
        {
            "Title": "Gokul Refoils Reports Strong Q1 Performance with Revenue Jump to Rs 92,643 Lakhs",
            "Summary": "Gokul Refoils and Solvent Limited's Board approved quarterly results for the quarter ended June 30, 2025. On a consolidated basis, the company reported revenue from operations of Rs 92,642.90 lakhs compared to Rs 78,805.40 lakhs in the same quarter last year. Net profit increased to Rs 385.90 lakhs from Rs 244.33 lakhs year-on-year. Basic earnings per share stood at Rs 0.39 versus Rs 0.25 in the previous year quarter. On a standalone basis, revenue from operations was Rs 16,411.74 lakhs with net profit of Rs 42.94 lakhs and basic EPS of Rs 0.04. The company operates primarily in edible and non-edible oils and agro-based commodities. The consolidated results include subsidiaries Gokul Agri International Limited, Professional Commodity Services Pvt. Ltd., and associate Gujarat Gokul Power Limited.",
            "Sentiment": "positive",
            "PublishDate": 1755164769863,
            "Source": "earnings"
        },
        {
            "Title": "Gokul Refoils & Solvent Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Gokul Refoils & Solvent has reported a decrease in its third quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 70 million rupees from 128 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin decreased to 0.70% from 1.59% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739454666000,
            "Source": "earnings"
        },
        {
            "Title": "Gokul Refoils & Solvent Reports Q3 Financial Results",
            "Summary": "Gokul Refoils & Solvent has announced its Q3 consolidated financial results. The company reported a net profit of 6 million rupees, down from 20 million rupees in the same quarter last year. However, revenue increased to 10.1 billion rupees from 8.07 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739454660000,
            "Source": "earnings"
        }
    ]
}