{
    "Symbol": "GOLDTECH",
    "ISIN": "INE805A01014",
    "News": [
        {
            "Title": "Aion-Tech Solutions Q3FY26 Results & Key Appointments",
            "Summary": "Aion-Tech Solutions reported Q3FY26 standalone revenue of ₹291.24 million with net profit of ₹20.03 million. Board appointed new CEO and approved major subsidiary investments totaling ₹8.00 crore.",
            "Sentiment": "positive",
            "PublishDate": 1770817744181,
            "Source": "co_actions_results"
        },
        {
            "Title": "Aion Tech Signs MoU with Theorems AD for Urban Mobility",
            "Summary": "Aion Tech Solutions partners with Bulgaria-based Theorems AD to launch First-Middle-Last Mile mobility pilots in Telangana and Karnataka, integrating EV fleets with AI-driven orchestration platforms.",
            "Sentiment": "positive",
            "PublishDate": 1766384139249,
            "Source": "co_actions_results"
        },
        {
            "Title": "AION-Tech Solutions Incorporates Wholly Owned Subsidiary in Dubai",
            "Summary": "AION-Tech Solutions Limited has incorporated a wholly owned subsidiary named GTL AION IT SOLUTIONS L.L.C in Dubai on November 28, 2025, with approval from the Ministry of Economy and Tourism, Government of Dubai. The company will hold 100% shareholding in the new entity, which was previously approved by the Board of Directors in their May 12, 2025 meeting, with investment details to be provided later.",
            "Sentiment": "positive",
            "PublishDate": 1764323422762,
            "Source": "corporate_action"
        },
        {
            "Title": "AION-Tech's ROQIT Partners with Indian Railways for AI-Powered Parcel Delivery Platform",
            "Summary": "Indian Railways awarded a contract to ROQIT, a wholly owned subsidiary of AION-Tech Solutions Limited, to design and deploy an AI-powered parcel logistics platform starting with South Central Railway in early 2026. The digital platform aims to transform India's lightweight to medium-weight parcel delivery through real-time tracking, predictive scheduling, and EV-based first and last-mile connectivity, targeting nationwide rollout after the pilot phase.",
            "Sentiment": "positive",
            "PublishDate": 1763468302522,
            "Source": "order&deals"
        },
        {
            "Title": "AION-TECH Solutions Invests Additional Rs 90 Lakh in Wholly-Owned Subsidiary ROQIT",
            "Summary": "AION-TECH Solutions Limited made a further equity investment of Rs 90 lakh in its wholly-owned subsidiary ROQIT GREENFLEET DIGITAL SOLUTIONS PRIVATE LIMITED, bringing total investment to Rs 8.50 crore. ROQIT, incorporated in December 2024, develops technology for zero-emission fleets in EV and hydrogen mobility and has completed pilot engagements but has not commenced considerable revenue generation.",
            "Sentiment": "positive",
            "PublishDate": 1763117478340,
            "Source": "corporate_action"
        },
        {
            "Title": "AION-Tech Solutions Reports Q2 Results, Announces Board Changes and Director Appointments",
            "Summary": "AION-Tech Solutions Limited announced its standalone and consolidated unaudited financial results for the second quarter and half year ended September 30, 2025. The Board approved these results following review by the Audit Committee. The company noted the resignation of Mr. Clinton Travis Caddell, a non-independent non-executive Director, effective November 12, 2025, due to other commitments and personal reasons. Simultaneously, the Board appointed Mr. Chanakya Bellam Radha Krishna as an Additional Director in the category of Non-Independent and Non-Executive Director, effective November 12, 2025, based on the recommendation of the Nomination and Remuneration Committee. The appointment is valid until the conclusion of the next Annual General Meeting. The company's consolidated results include subsidiaries ETO Motors Private Limited, Roqit Greenfleet Digital Solutions Private Limited, and Staytop Systems Inc., USA.",
            "Sentiment": "neutral",
            "PublishDate": 1762988651024,
            "Source": "earnings"
        },
        {
            "Title": "Aion-Tech Solutions Increases Stake in ETO Motors Through Debt-to-Equity Conversion",
            "Summary": "Aion-Tech Solutions Limited converted Rs. 8 crore loan into equity shares of its subsidiary ETO Motors Private Limited. ETO Motors allotted 7,32,608 equity shares at Rs. 10 face value with Rs. 100 premium per share to Aion-Tech on November 10, 2025. The transaction was structured as a rights issue with total consideration of Rs. 8,05,86,880. Following the allotment, Aion-Tech's shareholding in ETO Motors decreased from 58.5% to 56.29%, though the absolute number of shares held increased. ETO Motors operates in Electric Mobility as a Service (eMaaS) and Energy as a Service (EaaS) sectors, serving major e-commerce companies. The company has authorized share capital of Rs. 50 crore and was incorporated in 2018.",
            "Sentiment": "neutral",
            "PublishDate": 1762804382057,
            "Source": "corporate_action"
        },
        {
            "Title": "AION-TECH SOLUTIONS LIMITED Partners with Dharma Media Consultants for Public Relations Services",
            "Summary": "AION-TECH SOLUTIONS LIMITED has entered into an agreement with Dharma Media Consultants to provide public relations and media advisory services for the company and its subsidiaries. The services include strategy, counsel, media engagement, organizing participation in events and seminars, press releases and media interaction. Dharma Media Consultants holds no shareholding in AION-TECH SOLUTIONS and is not related to the promoter/promoter group. The agreement can be terminated by either party with one month's written notice, though the company can terminate immediately in case of material breach by Dharma Media Consultants.",
            "Sentiment": "neutral",
            "PublishDate": 1758625708104,
            "Source": "stock"
        },
        {
            "Title": "AION-TECH Solutions Reports Mixed Q1 Results, Appoints New Independent Director",
            "Summary": "AION-TECH Solutions Limited approved its unaudited financial results for Q1 ended June 30, 2025. On a standalone basis, revenue from operations declined 3.9% year-on-year to ₹158.12 crore, while profit after tax surged to ₹105.75 crore compared to ₹4.87 crore in the same quarter last year, primarily due to exceptional gains from land sale of ₹136.94 crore. Consolidated revenue grew 8.1% to ₹192.37 crore, with profit after tax at ₹59.39 crore versus a loss of ₹3.28 crore in Q1 FY2025. The company's business segments include Information Technology/Software Services, Software Licenses, and a new E-Vehicle Mobility segment following the acquisition of ETO Motors Private Limited in May 2025. The board appointed Ms. P Mounika Reddy as Additional Independent Woman Director, bringing over 15 years of experience in marketing, administration, and strategic consulting.",
            "Sentiment": "neutral",
            "PublishDate": 1754922102915,
            "Source": "earnings"
        }
    ]
}