{
    "Symbol": "GOLDIAM",
    "ISIN": "INE025B01025",
    "News": [
        {
            "Title": "Goldiam International Q3FY26 QIP Fund Monitoring Report",
            "Summary": "CARE Ratings confirms appropriate utilization of Rs. 202.05 crore QIP proceeds with Rs. 183.97 crore unutilized funds invested in NCDs, FDs, and alternative funds as of December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770662608281,
            "Source": "stocks"
        },
        {
            "Title": "Goldiam International Q3FY26 Results Strong Growth",
            "Summary": "Goldiam International reports robust Q3FY26 performance with consolidated revenue up 18% Y-o-Y at ₹3397 million and PAT growing 37% to ₹684 million. Board declares interim dividend of ₹2.75 per share.",
            "Sentiment": "positive",
            "PublishDate": 1770454963511,
            "Source": "co_actions_results"
        },
        {
            "Title": "Goldiam International Schedules Q3FY26 Earnings Call",
            "Summary": "Goldiam International Ltd announces post-result earnings conference call on February 10, 2026 at 4:00 p.m. to discuss Q3FY26 financial results and operations for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770276545387,
            "Source": "co_actions_results"
        },
        {
            "Title": "Goldiam International Secures Rs 80 Crore Export Orders",
            "Summary": "Goldiam International Ltd announced new export orders worth Rs 80 crores for lab-grown diamond jewellery from international clients in USA and Middle East, to be executed by April 30, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770193417204,
            "Source": "co_actions_results"
        },
        {
            "Title": "Goldiam International Secures ₹800M Lab-Grown Diamond Orders",
            "Summary": "Goldiam International has secured significant orders worth ₹800 million for lab-grown diamonds, marking a substantial business development for the diamond manufacturing company.",
            "Sentiment": "positive",
            "PublishDate": 1770192699485,
            "Source": "co_actions_results"
        },
        {
            "Title": "Goldiam Opens 14th Retail Store in Kolkata",
            "Summary": "Goldiam International Ltd inaugurated its 14th retail store at South City Mall, Kolkata on February 3, 2026, under the ORIGEM brand for lab-grown diamond jewellery.",
            "Sentiment": "positive",
            "PublishDate": 1770120339289,
            "Source": "stocks"
        },
        {
            "Title": "Goldiam International Board Meet on Feb 7 for Q3 Results",
            "Summary": "Goldiam International Limited has scheduled its board meeting for February 7, 2026, to consider Q3FY26 unaudited financial results and potential interim dividend declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1768299744912,
            "Source": "co_actions_results"
        },
        {
            "Title": "Goldiam Opens 13th Lab-Grown Diamond Store in Delhi",
            "Summary": "Goldiam International launches its 13th retail outlet for lab-grown diamonds under the Origem brand in Paschim Vihar, Delhi, expanding its retail footprint in the diamond jewelry segment.",
            "Sentiment": "positive",
            "PublishDate": 1767766510191,
            "Source": "stocks"
        },
        {
            "Title": "Goldiam International Signs LOIs for 12 New Origem Stores",
            "Summary": "Goldiam International has signed Letters of Intent for 12 new Origem retail stores across major Indian cities, with operations expected between December 2025 and August 2026.",
            "Sentiment": "positive",
            "PublishDate": 1766386295732,
            "Source": "stocks"
        },
        {
            "Title": "Goldiam International Posts 43% Revenue Growth Despite US Tariff Challenges, Raises INR 202 Crores for Retail Expansion",
            "Summary": "Goldiam International achieved 43% year-on-year revenue growth in Q2 FY26 and 41% growth in H1 despite facing steep US tariff increases from 16% to 56% on lab-grown diamond jewelry exports. The company successfully mitigated tariff impact through a US casting model and raised INR 202 crores via QIP to expand its ORIGEM retail brand from 11 to 20-25 stores by March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1763199557371,
            "Source": "earnings"
        },
        {
            "Title": "Goldiam International Submits Monitoring Report for Rs 202.05 Crore QIP Fund Utilization",
            "Summary": "Goldiam International Limited submitted its monitoring agency report for the quarter ended September 30, 2025, regarding the utilization of Rs 202.05 crore raised through Qualified Institutional Placement (QIP). CARE Ratings Limited, serving as the monitoring agency, reported no deviations from the stated objectives. The company utilized Rs 11.62 crore during the quarter for setting up new brand-exclusive stores, inventory, civil works, and issue expenses. Of the unutilized proceeds of Rs 190.43 crore, the company invested Rs 27.47 crore in non-convertible debentures with maturity dates in July and August 2027. The funds are being used for establishing 63 new brand-exclusive stores across India, inventory procurement, and general corporate purposes. The company derives 99% of its sales from exports, with the US contributing over 95% of revenue. Recent imposition of additional import tariffs on India could impact the company's performance in coming quarters.",
            "Sentiment": "neutral",
            "PublishDate": 1762995148003,
            "Source": "corporate_action"
        },
        {
            "Title": "Goldiam International Reports 42% Jump in Q2 Net Profit to 313M Rupees",
            "Summary": "Goldiam International reported Q2 consolidated net profit of 313 million rupees compared to 221 million rupees in the same period last year, marking a 42% increase. Revenue grew 41% to 1.93 billion rupees from 1.37 billion rupees year-over-year. EBITDA rose to 383 million rupees from 305 million rupees, though EBITDA margin declined to 20% from 22.28% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762935717208,
            "Source": "earnings"
        },
        {
            "Title": "Goldiam International Opens New Lab-Grown Diamond Store Under 'Origem' Brand in Mumbai",
            "Summary": "Goldiam International has opened a new store for lab-grown diamond jewelry at R City Mall in Ghatkopar, Mumbai. The store operates under the company's 'Origem' brand and commenced operations today.",
            "Sentiment": "positive",
            "PublishDate": 1761813822684,
            "Source": "stock"
        },
        {
            "Title": "Goldiam International Opens New Lab-Grown Diamond Store Under 'Origem' Brand in Noida",
            "Summary": "Goldiam International has opened a new lab-grown diamond store at Wave One Mall in Noida. The store operates under the brand name 'Origem' as part of the company's strategy to expand its retail presence and enhance customer connections.",
            "Sentiment": "positive",
            "PublishDate": 1760083510358,
            "Source": "stock"
        },
        {
            "Title": "Goldiam International Opens Eighth ORIGEM Store in Noida",
            "Summary": "Goldiam International Limited opened its eighth retail store for lab-grown diamond jewellery under the brand name 'ORIGEM' in Noida on September 22, 2025. The store is located at GF-5, Central 50, Sector 50, Gautam Budha Nagar, Noida. This expansion strengthens the company's retail footprint in Northern India. The company previously opened seven stores in locations including Borivali West, Kharghar, Turner Road Bandra West, Mulund West, Mumbai Airport Road, Andheri Link Road, and Bengaluru. The development aligns with the company's long-term strategy of expanding retail presence and strengthening customer engagement across key markets.",
            "Sentiment": "positive",
            "PublishDate": 1758517826231,
            "Source": "stock"
        },
        {
            "Title": "Goldiam International Implements U.S. Casting Strategy to Address Tariff Impact and Expands B2C Operations",
            "Summary": "Goldiam International has adopted a new casting strategy in the U.S. to counter the effects of a 50% tariff. The company is also focusing on boosting its business-to-consumer growth through expansion of its Origem operations.",
            "Sentiment": "positive",
            "PublishDate": 1758181015043,
            "Source": "stock"
        },
        {
            "Title": "Goldiam International Secures Rs 100 Crore Export Orders for Lab-Grown Diamond Jewelry",
            "Summary": "Goldiam International Ltd has received export orders worth Rs 100 crores for manufacturing and exporting lab-grown diamond jewelry to international clients in the USA. The orders are to be fulfilled by December 31, 2025. The figure excludes online orders and involves export orders for lab-grown diamond studded gold jewelry. The company expects these orders to provide strong momentum in the near term. The orders do not involve any promoter group interest and do not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1757488376507,
            "Source": "stock"
        },
        {
            "Title": "Goldiam International Raises ₹2.02 Billion Through QIP",
            "Summary": "Goldiam International has successfully raised ₹2.02 billion through a Qualified Institutional Placement (QIP). The fundraising indicates the company's capital mobilization efforts through institutional investors.",
            "Sentiment": "positive",
            "PublishDate": 1755771514041,
            "Source": "corporate_action"
        },
        {
            "Title": "Goldiam International Closes QIP, Raises ₹202 Crores Through Share Allocation",
            "Summary": "Goldiam International Limited completed its qualified institutions placement (QIP) on August 18, 2025, allocating 61,22,722 equity shares at ₹330 per share to eligible qualified institutional buyers. The QIP, which opened on August 12, 2025, raised approximately ₹202 crores for the company. The allocation price included a premium of ₹328 per share and represented a discount of ₹16.99 per share (4.90%) from the floor price of ₹346.99. The Fund Raising Committee approved the closure of the issue and finalized allocation confirmations to be sent to the institutional buyers.",
            "Sentiment": "positive",
            "PublishDate": 1755535754364,
            "Source": "corporate_action"
        },
        {
            "Title": "Goldiam International Launches QIP with Floor Price Set at ₹346.99 Per Share",
            "Summary": "Goldiam International Limited has launched a qualified institutions placement (QIP) of equity shares with a face value of ₹2 each. The company's Fund Raising Committee approved the preliminary placement document and authorized the opening of the issue on August 12, 2025. The floor price has been set at ₹346.99 per equity share based on SEBI ICDR Regulations pricing formula. The company may offer a discount of up to 5% on the floor price, with the final issue price to be determined in consultation with the book running lead manager. The initiative follows board approval from May 7, 2025, and shareholder approval through a special resolution passed on June 8, 2025. The trading window for designated persons remains closed during this process.",
            "Sentiment": "neutral",
            "PublishDate": 1755015854455,
            "Source": "corporate_action"
        },
        {
            "Title": "Goldiam Plans Major Expansion with 100+ Origem Stores and Lab-Grown Diamond Focus",
            "Summary": "Goldiam is planning significant growth through lab-grown diamonds and aims to open over 100 Origem stores. The company plans to leverage its debt-free financial position to expand omnichannel jewelry sales both in India and internationally.",
            "Sentiment": "positive",
            "PublishDate": 1754923107128,
            "Source": "stock"
        },
        {
            "Title": "Goldiam International Sets September 19, 2025 as Record Date for Final Dividend Payment",
            "Summary": "Goldiam International Limited has announced September 19, 2025 as the record date for payment of final dividend for the financial year 2024-2025. Shareholders holding shares in electronic form will be eligible based on beneficial ownership data from NSDL and CDSL as at the end of working hours on the record date, while those holding physical shares must appear on the Register of Members as on September 19, 2025. The company has informed both NSE and BSE about this dividend payment schedule.",
            "Sentiment": "positive",
            "PublishDate": 1754920462576,
            "Source": "corporate_action"
        },
        {
            "Title": "Goldiam International Reports 53% Jump in Q1 Net Profit to 336 Million Rupees",
            "Summary": "Goldiam International reported consolidated net profit of 336 million rupees in Q1, up from 220 million rupees in the same period last year. Revenue increased to 2.3 billion rupees from 1.65 billion rupees year-over-year. EBITDA rose to 471 million rupees compared to 342 million rupees in the previous year. However, EBITDA margin slightly declined to 20% from 20.1% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754907911414,
            "Source": "earnings"
        },
        {
            "Title": "Goldiam International Secures 40 Crore Rupee Order",
            "Summary": "Goldiam International has won a new order worth 40 crore rupees. The company announcement indicates a significant business development for the organization.",
            "Sentiment": "positive",
            "PublishDate": 1754642933460,
            "Source": "order&deals"
        },
        {
            "Title": "Goldiam International: Lab-Grown Diamonds to Drive Long-Term Margins",
            "Summary": "Goldiam International targets 18-22% long-term Ebitda margin, despite short-term softness due to US tariffs. The company plans to expand its lab-grown diamond retail brand, Origem, aiming for 20-25 stores in FY26 and 80-100 stores long-term. B2C operations under Origem yield 40-45% gross margins. The company has passed an enabling resolution for potential fundraising to support retail expansion.",
            "Sentiment": "positive",
            "PublishDate": 1748481070000,
            "Source": "normal_news"
        },
        {
            "Title": "Goldiam International Raises EBITDA Margin Guidance for FY25",
            "Summary": "Goldiam International has updated its EBITDA margin guidance for FY25 to 22%, up from the previous guidance of 20%. This represents an improvement in the company's projected profitability.",
            "Sentiment": "positive",
            "PublishDate": 1748247376000,
            "Source": "default"
        },
        {
            "Title": "Goldiam International Reports Strong Q4 Results and Declares Dividend",
            "Summary": "Goldiam International has reported its Q4 financial results. The company's EBITDA increased to 364 million rupees from 239 million rupees year-over-year, with EBITDA margin improving to 18.26% from 16.19%. Revenue grew to 2 billion rupees from 1.48 billion rupees in the same period last year. The consolidated net profit for Q4 rose to 232 million rupees from 178 million rupees year-over-year. Additionally, the company has declared a dividend of 1 rupee per share.",
            "Sentiment": "positive",
            "PublishDate": 1748247207000,
            "Source": "result"
        },
        {
            "Title": "Goldiam International Approves Fundraising of Up to Rs 400 Crore",
            "Summary": "Goldiam International has approved a fundraising initiative of up to Rs 400 crore through the issuance of equity shares or other eligible securities. The company plans to raise this capital via public or private offerings, which may include preferential allotment and qualified institutional placement (QIP).",
            "Sentiment": "positive",
            "PublishDate": 1746601155000,
            "Source": "default"
        },
        {
            "Title": "Goldiam International Secures ₹80 Crore Order",
            "Summary": "Goldiam International has won a new order valued at 80 crore rupees. This significant order is likely to boost the company's revenue and potentially impact its financial performance positively.",
            "Sentiment": "positive",
            "PublishDate": 1746432796000,
            "Source": "default"
        },
        {
            "Title": "Goldiam International to Discuss Fundraising in Upcoming Board Meeting",
            "Summary": "Goldiam International has announced that its board of directors will meet on May 7th to discuss potential fundraising options for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1745988666000,
            "Source": "default"
        },
        {
            "Title": "Goldiam International: Ambitious 200-Store Expansion Plan Unveiled",
            "Summary": "Goldiam International plans to expand to 150-200 stores in 3-5 years, with 20-25 new stores in metro regions by end of 2025. Initial expansion will be company-owned stores, funded by internal accruals, with potential franchise openings in future years. US B2B operations support Indian retail growth.",
            "Sentiment": "positive",
            "PublishDate": 1740292485000,
            "Source": "corporate_action"
        },
        {
            "Title": "Goldiam International Considers US Manufacturing Facility",
            "Summary": "Goldiam International is evaluating the possibility of establishing a manufacturing facility in the United States. This strategic move could potentially expand the company's production capabilities and market presence in North America.",
            "Sentiment": "neutral",
            "PublishDate": 1739870902000,
            "Source": "corporate_action"
        },
        {
            "Title": "Goldiam International Secures Order Worth 60 Crore",
            "Summary": "Goldiam International has announced that it has won a new order valued at 60 crore rupees. This significant order is likely to boost the company's revenue and potentially impact its financial performance positively.",
            "Sentiment": "positive",
            "PublishDate": 1739521577000,
            "Source": "order&deals"
        },
        {
            "Title": "Goldiam International Reports Strong Order Book Position",
            "Summary": "Goldiam International has announced that its order book position as of December 31, 2024, stands at approximately 1750 million rupees. The company expects to fulfill these orders within a 3-4 month timeframe.",
            "Sentiment": "positive",
            "PublishDate": 1738916108000,
            "Source": "order&deals"
        },
        {
            "Title": "Goldiam International Reports Strong Lab-Grown Diamond Jewelry Sales",
            "Summary": "Goldiam International has announced that lab-grown diamond jewelry contributed 80% to its Q3 revenue. Additionally, the company's online revenue accounted for 28% of total sales. This indicates a significant shift towards lab-grown diamonds and e-commerce in Goldiam's business model.",
            "Sentiment": "positive",
            "PublishDate": 1738916052000,
            "Source": "earnings"
        },
        {
            "Title": "Goldiam International Reports Q3 Revenue Increase",
            "Summary": "Goldiam International has announced its third-quarter revenue results. The company reported revenue of 2.8 billion rupees, compared to 2.01 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738915888000,
            "Source": "earnings"
        },
        {
            "Title": "Goldiam International Reports Strong Q3 EBITDA Growth",
            "Summary": "Goldiam International has reported significant year-over-year growth in its Q3 EBITDA, which increased to 625 million rupees from 406 million rupees. The company's EBITDA margin also improved, rising to 22.35% from 20.13% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738915880000,
            "Source": "earnings"
        },
        {
            "Title": "Goldiam International Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Goldiam International has announced its financial results for the third quarter. The company's consolidated net profit rose to 498 million rupees, compared to 324 million rupees in the same period last year, marking a substantial year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738915780000,
            "Source": "earnings"
        },
        {
            "Title": "Goldiam International Launches Website for Domestic Lab-Grown Diamond Brand 'Origem'",
            "Summary": "Goldiam International has successfully launched a dedicated website for its domestic retail lab-grown diamond brand, Origem. The new website can be accessed at www.origemindia.com. This launch represents a significant step in the company's efforts to expand its presence in the lab-grown diamond market within India.",
            "Sentiment": "positive",
            "PublishDate": 1736225479000,
            "Source": "corporate_action"
        },
        {
            "Title": "Goldiam International Launches Website for Domestic Lab-Grown Diamond Brand",
            "Summary": "Goldiam International has successfully launched a dedicated website for its domestic retail lab-grown diamond brand, Origem. This move signifies the company's expansion into the lab-grown diamond market and its efforts to establish a stronger online presence for its retail brand.",
            "Sentiment": "positive",
            "PublishDate": 1736225437000,
            "Source": "corporate_action"
        },
        {
            "Title": "Goldiam International to Consider Q3 Results and Second Interim Dividend",
            "Summary": "Goldiam International has announced that it will consider its third quarter (Q3) financial results and potentially declare a second interim dividend on February 7th.",
            "Sentiment": "neutral",
            "PublishDate": 1736165711000,
            "Source": "corporate_action"
        },
        {
            "Title": "Goldiam International Opens Second Lab-Grown Diamond Jewelry Store",
            "Summary": "Goldiam International has announced the opening of its second retail store for lab-grown diamond jewelry. The new store is located in Kharghar, Navi Mumbai, and operates under the brand name 'Origem'.",
            "Sentiment": "positive",
            "PublishDate": 1734064007000,
            "Source": "corporate_action"
        },
        {
            "Title": "Goldiam International: Lab-Grown Diamonds to Drive 80% of Revenue",
            "Summary": "Goldiam International expects lab-grown diamonds to contribute 80% of its revenue soon, up from 77% in Q2 FY24. The company sees growth potential in India and global markets, particularly the US. Managing Director Anmol Bhansali welcomes competition from large brands entering the lab-grown diamond space, viewing it as validation for the category and an opportunity for market education.",
            "Sentiment": "positive",
            "PublishDate": 1732247274000,
            "Source": "normal_news"
        },
        {
            "Title": "Goldiam International: Lab-Grown Diamond Market Surges Despite Q2 Profit Decline",
            "Summary": "Goldiam International's MD Anmol Bhansali reports strong growth in India's lab-grown diamond market, highlighting shifting consumer preferences. The company experienced a Q2 profit decrease but remains optimistic about H2FY25 outlook.",
            "Sentiment": "neutral",
            "PublishDate": 1732184713000,
            "Source": "normal_news"
        },
        {
            "Title": "Goldiam International Reports Improved Q2 EBITDA and Margin",
            "Summary": "Goldiam International has reported its Q2 financial results. The company's EBITDA increased to 305 million rupees from 273 million rupees year-over-year. Additionally, the EBITDA margin improved to 22.28% from 20.51% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730964061000,
            "Source": "result"
        },
        {
            "Title": "Goldiam International Reports Q2 Revenue Growth",
            "Summary": "Goldiam International has reported a revenue of 1.37 billion rupees for the second quarter, compared to 1.1 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730963944000,
            "Source": "result"
        },
        {
            "Title": "Goldiam International Reports Q2 Consolidated Net Profit",
            "Summary": "Goldiam International has reported a consolidated net profit of 221 million rupees for the second quarter, compared to 235 million rupees in the same period last year, indicating a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1730963881000,
            "Source": "result"
        }
    ]
}