{
    "Symbol": "GOODLUCK",
    "ISIN": "INE127I01024",
    "News": [
        {
            "Title": "Goodluck India Acquires Land in Ghaziabad for ₹520 Cr",
            "Summary": "Goodluck India Limited has purchased land in Ghaziabad, Uttar Pradesh for ₹520 million, marking a significant expansion move for the steel sector company.",
            "Sentiment": "positive",
            "PublishDate": 1766576714696,
            "Source": "stocks"
        },
        {
            "Title": "Goodluck India Acquires Property for ₹52 Crores",
            "Summary": "Goodluck India Limited purchases land and construction property in Ghaziabad for ₹52 crores from promoter group entities in related party transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1766576396109,
            "Source": "co_actions_results"
        },
        {
            "Title": "Goodluck Defence and Aerospace Secures USD 6 Million Export Order for Military Shells",
            "Summary": "Goodluck Defence and Aerospace Limited, a subsidiary of Goodluck India Limited, received an export order worth USD 6 million for supplying 155mm M107 Ready-to-Fill Shells. The order represents a significant defense contract for the subsidiary company in the military equipment supply sector.",
            "Sentiment": "positive",
            "PublishDate": 1763629202085,
            "Source": "order&deals"
        },
        {
            "Title": "Goodluck India Reports 30% EBITDA Growth in Q2FY26, Launches Defence Manufacturing Operations",
            "Summary": "Goodluck India Limited announced quarterly results with sales volume increasing 9.5% to 112,937 MT and total income growing 1.7% to Rs 997.59 crore. EBITDA surged 30.1% with margins expanding 214 basis points to 9.8%. The company achieved significant milestones in defence manufacturing through its subsidiary Goodluck Defence Aerospace, which received an industrial license for artillery shell manufacturing and inaugurated a facility with initial capacity of 150,000 shells per annum, planned to scale to 400,000 shells. The company operates six manufacturing plants with combined annual capacity of 500,000 MT and maintains capacity utilization at approximately 90%. Goodluck India also entered a tripartite MOU for the Advanced Medium Combat Aircraft programme and fulfilled its Rs 500 crore investment commitment under the UP Nivesh initiative.",
            "Sentiment": "positive",
            "PublishDate": 1762587014555,
            "Source": "earnings"
        },
        {
            "Title": "Goodluck India Plans Major Production Expansion with ₹500 Crore Investment",
            "Summary": "Goodluck India announced plans to significantly expand its empty shell production capacity from 150,000 units to 400,000 units. The company will invest approximately ₹500 crore to fund this expansion through a combination of debt and equity financing.",
            "Sentiment": "positive",
            "PublishDate": 1760078864244,
            "Source": "stock"
        },
        {
            "Title": "Goodluck India Commences Commercial Production at Defence and Aerospace Unit",
            "Summary": "Goodluck India Ltd has started commercial production at its subsidiary Goodluck Defence and Aerospace Limited. The production facility is located in Faridpur, Uttar Pradesh and operations began on October 8, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1759990436529,
            "Source": "stock"
        },
        {
            "Title": "Goodluck India's Subsidiary Receives License for Artillery Shell Manufacturing",
            "Summary": "Goodluck India Limited announced that its subsidiary, Goodluck Defence and Aerospace Limited, has received an industrial license under the Indian Arms Act, 1959 for manufacturing artillery shells of various sizes including 105mm, 120mm, 125mm, 130mm, and 155mm. The company plans an initial manufacturing capacity of 150,000 shells per annum with trial production expected to begin in Q3FY26. Additionally, Goodluck India entered into a tripartite MOU with BrahMos Aerospace Thiruvananthapuram Ltd and Axiscades Technologies Ltd to collaborate on the Advanced Medium Combat Aircraft (AMCA) programme and participate in the Expression of Interest floated by Aeronautical Development Agency. Chairman Mahesh Chandra Garg stated the artillery shell manufacturing approval positions the company among select distinguished suppliers and contributes to India's defense capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1759465226317,
            "Source": "stock"
        },
        {
            "Title": "Goodluck India Receives Industrial License for Defence Production Through Subsidiary",
            "Summary": "Goodluck India Limited has received an Industrial License under the Indian Arms Act, 1959, enabling its subsidiary Goodluck Defence and Aerospace Limited to begin production of empty shells for the Defence & Aerospace Industry. The company expects to start trial production by Q3 of FY 2025-26. This development follows an earlier announcement made on January 4, 2025, regarding the establishment of a new facility under the subsidiary to serve the Defence & Aerospace Industry.",
            "Sentiment": "positive",
            "PublishDate": 1759314546197,
            "Source": "stock"
        },
        {
            "Title": "Goodluck India Forms Alliance With BrahMos Aerospace And Axiscades Technologies For AMCA Manufacturing Bid",
            "Summary": "Goodluck India has formed an alliance with BrahMos Aerospace and Axiscades Technologies to bid for AMCA (Advanced Medium Combat Aircraft) manufacturing. The partnership brings together three companies to pursue opportunities in the defense manufacturing sector.",
            "Sentiment": "positive",
            "PublishDate": 1759309412135,
            "Source": "order&deals"
        },
        {
            "Title": "Goodluck India Appoints Iswarchandra Dayanidhi Agasti as Independent Director for Five-Year Term",
            "Summary": "Goodluck India Limited shareholders approved the appointment of Mr. Iswarchandra Dayanidhi Agasti as an Independent Director at the company's 39th Annual General Meeting held on September 25, 2025. The appointment is effective from October 1, 2025, for a five-year term until September 30, 2030, and is not subject to retirement by rotation. The appointment was based on recommendations from the Nomination and Remuneration Committee and Board approval. Mr. Agasti is a retired Principal Officer from IDBI Bank with 35 years of banking experience across branch banking, retail banking, corporate banking, operations, audit, and administration. He previously served as a director at Haldia Petrochemicals Limited and is not related to any existing directors of the company.",
            "Sentiment": "positive",
            "PublishDate": 1758807151084,
            "Source": "corporate_governance"
        },
        {
            "Title": "Goodluck India Secures Rs 48.87 Crore Solar Support Structure Order from Apraava Energy",
            "Summary": "Goodluck India Limited received an order worth Rs 48.87 crores from Apraava Energy Private Limited for supplying solar support structures. The domestic contract must be completed within 6 months, with payment terms including partial advance payment and balance on material supply. The order supports India's Green India Mission and the government's target to generate 1800 GW through renewable energy by 2047. Goodluck India maintains an order book of approximately Rs 400 crores for this segment and operates six manufacturing plants with a total capacity of 5,00,000 MTPA. Chairman Mahesh Chandra Garg stated the company aims to achieve consolidated revenue of USD 1 billion over the next 3-5 years and maintains guidance of 15-20% revenue and profit growth. The company serves over 600 customers globally and exports to more than 100 countries.",
            "Sentiment": "positive",
            "PublishDate": 1757930470382,
            "Source": "order&deals"
        },
        {
            "Title": "Goodluck Reduces Revenue Growth Target to 12% from 20% Amid Market Uncertainties",
            "Summary": "Goodluck has revised its topline growth expectations downward from 20% to 12%, citing uncertainties as the reason for the adjustment. The company has lowered its revenue growth projections in response to prevailing market conditions.",
            "Sentiment": "negative",
            "PublishDate": 1757481295989,
            "Source": "stock"
        },
        {
            "Title": "Goodluck India Appoints Sumeet Sharma as Chief Strategy Officer",
            "Summary": "Goodluck India Limited, a specialised engineered steel products manufacturer, has appointed Sumeet Sharma as Chief Strategy Officer. The appointment comes as the company aims to enter the billion-dollar club in the next three to four years. Sharma brings over 17 years of experience in M&A, business research, financial planning, and strategic decision-making. He previously worked with globally reputed organizations including EY India, Genpact, and ICICI Bank. Chairman M C Garg stated that Sharma will work with the leadership team to identify new opportunities and implement a strategic roadmap to support the company's growth plans. Goodluck India manufactures precision engineering steel products for automobile, aerospace, oil & gas, defense, and infrastructure sectors, with a presence in 100 countries and manufacturing capacity of 500,000 MT per annum.",
            "Sentiment": "positive",
            "PublishDate": 1754645633574,
            "Source": "corporate_governance"
        },
        {
            "Title": "Goodluck India Reports 7.7% Revenue Growth in Q1 FY26, Defence License Awaited",
            "Summary": "Goodluck India Limited reported income from operations of INR 983.29 crores in Q1 FY26, representing 7.7% year-on-year growth compared to INR 913.08 crores in the previous year. The company achieved 12% volume growth with overall volumes reaching 112,000 tonnes versus 102,000 tonnes last year. EBITDA increased 23% to INR 95.78 crores (9.71% margin) from INR 77.60 crores previously. Profit after tax grew 16.5% to INR 40.14 crores from INR 34.47 crores, with earnings per share rising to INR 12.60 from INR 10.80. The company's defence subsidiary has established a plant capable of manufacturing 150,000 artillery shells (155mm M107) annually with expected revenue potential of INR 270-275 crores at full capacity, but production remains pending government license approval. Value-added products increased 24% year-on-year while non-value-added segment showed minimal growth. The solar structure segment achieved 100% growth year-on-year. Management maintains 15-20% revenue growth guidance for FY26, expecting overall EBITDA margins of 9.5-9.7%. Export markets remained subdued due to geopolitical tensions and tariff uncertainties, while domestic sales growth offset these challenges.",
            "Sentiment": "positive",
            "PublishDate": 1753708095847,
            "Source": "earnings"
        },
        {
            "Title": "Goodluck India Reports 7.8% Revenue Growth and 23.4% EBITDA Jump in Q1 FY2026",
            "Summary": "Goodluck India Limited reported total income of Rs. 9,868 million for Q1 FY2026, representing a 7.8% year-over-year increase from Rs. 9,157 million in Q1 FY2025. The company's EBITDA grew significantly by 23.4% to Rs. 958 million compared to Rs. 776 million in the previous year quarter, with EBITDA margin expanding to 9.7% from 8.5%. Net profit increased 16.5% to Rs. 401 million, while earnings per share rose to Rs. 12.62 from Rs. 10.80. The company achieved sales volume of 112,741 MT during the quarter with total production capacity of 500,000 MTPA across six plants. Goodluck operates in four key segments: engineering structures and precision fabrication, forging products, precision pipes and auto tubes, and CR coils, pipes and tubes. The company commissioned a new hydraulic tubes plant in Bulandshahr in January 2025, which contributed to quarterly performance as an import-substitute initiative. Export sales accounted for 75% of total revenue, maintaining the same proportion as the previous year quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753187935377,
            "Source": "earnings"
        },
        {
            "Title": "GoodLuck India Reports Strong Q1 Performance, Targets Double-Digit Growth by FY26",
            "Summary": "GoodLuck India reported Q1 revenue of 9.83 billion rupees, up from 9.13 billion rupees in the previous year. The company's EBITDA increased to 957.8 million rupees from 776 million rupees year-over-year, with EBITDA margin improving to 9.7% from 8.5%. The company has set targets for double-digit revenue growth and margin improvement by FY26.",
            "Sentiment": "positive",
            "PublishDate": 1753173001976,
            "Source": "stock"
        },
        {
            "Title": "Goodluck India Reports 16% Growth in Quarterly Net Profit",
            "Summary": "Goodluck India reported a net profit of 401 million rupees in its latest quarterly results, representing a year-over-year increase from 344.7 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1753172612091,
            "Source": "earnings"
        },
        {
            "Title": "Goodluck India Ltd: Targets 18-20% Revenue Growth with Defence and Hydraulic Tube Expansion",
            "Summary": "Goodluck India Ltd aims for 18-20% annual revenue growth, driven by expansion into defence sector and hydraulic tube production. The company plans to start trial production of artillery shells in Q1 FY26, with commercial production expected by Q2 FY26. A new subsidiary, Goodluck Defence and Aerospace, will produce 150,000 precision components annually, with plans to expand to 350,000. The company is awaiting a critical government license for the defence vertical, which is expected to improve operating profit margins from 8% to 25%.",
            "Sentiment": "positive",
            "PublishDate": 1748395965000,
            "Source": "normal_news"
        },
        {
            "Title": "Goodluck India Reports Q4 Results and Declares Dividend",
            "Summary": "Goodluck India has announced its quarterly results and a dividend declaration. The company's Q4 revenue increased to 10.9 billion rupees from 8.9 billion rupees year-over-year. Net profit for Q4 rose to 421 million rupees from 355 million rupees in the same period last year. Additionally, the company has declared a dividend of 4 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747903051000,
            "Source": "result"
        },
        {
            "Title": "Goodluck India Reports Strong Q4 FY25 Performance",
            "Summary": "Goodluck India has announced its Q4 FY25 consolidated annual growth at 19%, surpassing the company's guidance of 15-20%. This performance indicates a robust financial year for the company, exceeding expectations and potentially signaling positive business momentum.",
            "Sentiment": "positive",
            "PublishDate": 1744346887000,
            "Source": "earnings"
        },
        {
            "Title": "Goodluck India Reports 19% Annual Growth in FY25 Sales Volume",
            "Summary": "Goodluck India has announced a significant 19% annual growth in sales volume for the fiscal year 2025. This impressive performance is attributed to increased sales in high-margin value-added products and successful expansion into international markets. The company's strategic focus on premium offerings and global reach has contributed to this substantial growth.",
            "Sentiment": "positive",
            "PublishDate": 1744346742000,
            "Source": "earnings"
        },
        {
            "Title": "Goodluck India Reports 12.75% Increase in Q4 FY25 Sales Volume",
            "Summary": "Goodluck India has announced a 12.75% growth in sales volume for the fourth quarter of fiscal year 2025 compared to the previous quarter. This increase indicates positive performance and potential revenue growth for the company in the latest financial period.",
            "Sentiment": "positive",
            "PublishDate": 1744346730000,
            "Source": "earnings"
        },
        {
            "Title": "GOODLUCK INDIA Reports Improved Q3 EBITDA and Margin",
            "Summary": "GOODLUCK INDIA has reported its Q3 financial results. The company's EBITDA increased to 801 million rupees, up from 742 million rupees in the same quarter last year. Additionally, the EBITDA margin improved slightly to 8.51% from 8.45% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738846099000,
            "Source": "earnings"
        },
        {
            "Title": "Goodluck India Reports Increased Q3 Profit and Revenue",
            "Summary": "Goodluck India has announced its financial results for the third quarter. The company's net profit increased to 401 million rupees, up from 317 million rupees in the same period last year. Revenue also saw growth, rising to 9.4 billion rupees from 8.8 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738846094000,
            "Source": "earnings"
        },
        {
            "Title": "Goodluck India to Start Commercial Production of Hydraulic Tubes in January 2025",
            "Summary": "Goodluck India has announced plans to commence commercial production at its new state-of-the-art hydraulic tubes manufacturing plant. The company expects operations to begin in the first week of January 2025, marking a significant expansion in its manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1735717370000,
            "Source": "corporate_action"
        },
        {
            "Title": "Goodluck India Reports Q2 Financial Results",
            "Summary": "Goodluck India has released its Q2 financial results. The company's EBITDA for the quarter was 710 million rupees, compared to 719 million rupees in the same quarter last year. The EBITDA margin decreased to 7.35% from 8.21% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731324700000,
            "Source": "result"
        },
        {
            "Title": "Goodluck India Reports Q2 Revenue Growth",
            "Summary": "Goodluck India has announced its second quarter revenue for the current fiscal year. The company reported revenue of 9.7 billion rupees, compared to 8.75 billion rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731324463000,
            "Source": "result"
        },
        {
            "Title": "Goodluck India Reports Q2 Net Profit Increase",
            "Summary": "Goodluck India has reported a net profit of 450.6 million rupees for the second quarter, showing a year-over-year increase from 347 million rupees and a quarter-over-quarter increase from 344.7 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1731324395000,
            "Source": "result"
        }
    ]
}