{
    "Symbol": "GOPAL",
    "ISIN": "INE0L9R01028",
    "News": [
        {
            "Title": "Gopal Snacks GST Demand of ₹17.46 Lakh Dropped",
            "Summary": "Gopal Snacks receives DRC-07 from CGST authorities dropping the proposed GST demand of ₹17,45,716 related to excess input tax credit claims from April 2020 to March 2023.",
            "Sentiment": "positive",
            "PublishDate": 1770903479158,
            "Source": "stocks"
        },
        {
            "Title": "Gopal Snacks Q3FY26 Results & Interim Dividend",
            "Summary": "Gopal Snacks reports Q3FY26 results with revenue of ₹4,007.66 million and net profit of ₹154.91 million. Board declares second interim dividend of ₹0.35 per share.",
            "Sentiment": "positive",
            "PublishDate": 1769518835048,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gopal Snacks Earnings Call Set for Jan 28 Post Q3 Results",
            "Summary": "Gopal Snacks Limited has scheduled an earnings conference call on January 28, 2026 at 3:00 PM IST to discuss Q3FY26 financial performance with investors and analysts following board meeting on January 27.",
            "Sentiment": "neutral",
            "PublishDate": 1767606394734,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gopal Snacks Promoter Pledges 47 Lakh Shares",
            "Summary": "Gopal Snacks promoter Bipinbhai Hadvani pledged 47 lakh equity shares to Tata Capital Limited for personal loan, representing 3.77% of total share capital as disclosed under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765975879905,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gopal Snacks Wafer Segment Agreement Update",
            "Summary": "Gopal Snacks announces new agreement in wafer segment expected to boost topline and margins, though specific details remain limited.",
            "Sentiment": "positive",
            "PublishDate": 1765783352956,
            "Source": "stocks"
        },
        {
            "Title": "Gopal Snacks Forecasts 7-7.5% Profit Margins",
            "Summary": "Gopal Snacks Limited projects profit margins between 7% to 7.5% for the second half of the current financial year, indicating the company's expectations for improved profitability.",
            "Sentiment": "positive",
            "PublishDate": 1765783009020,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gopal Snacks Gets Relief from ₹7.97 Cr GST Demand",
            "Summary": "Gopal Snacks Limited received DRC-07 notice dropping proposed GST liability of ₹7.97 crores for FY 2021-22, with no tax, interest or penalty payable after successful reconciliation.",
            "Sentiment": "positive",
            "PublishDate": 1765626850145,
            "Source": "stocks"
        },
        {
            "Title": "Gopal Snacks Announces Third-Party Manufacturing Deal",
            "Summary": "Gopal Snacks Limited enters third-party manufacturing arrangement for new facility in Manendragarh, Chhattisgarh with 2,240 MTPA wafer production capacity to strengthen operational footprint and enhance market reach.",
            "Sentiment": "positive",
            "PublishDate": 1765515643046,
            "Source": "stocks"
        },
        {
            "Title": "Gopal Snacks Starts Commercial Production at New Modasa Namkeen Facility",
            "Summary": "Gopal Snacks has commenced commercial production at its new namkeen manufacturing facility in Modasa, aimed at strengthening its supply chain and production capacity. The facility expansion comes as part of the company's efforts to enhance operations following an incident at its Rajkot location.",
            "Sentiment": "positive",
            "PublishDate": 1764595048763,
            "Source": "stock"
        },
        {
            "Title": "Gopal Snacks Reports 16.6% Sequential Revenue Growth Despite Missing Annual Guidance",
            "Summary": "Gopal Snacks achieved revenue of INR 375.7 crores in Q2 FY26 with EBITDA margin improving to 6.4%, while receiving INR 19.99 crores interim insurance payment for the Rajkot facility fire. The company acknowledged it will not meet its INR 1,750 crores annual revenue guidance due to delayed commissioning of the Modasa plant, which started trial production in November instead of the planned July-August timeline.",
            "Sentiment": "neutral",
            "PublishDate": 1763205112728,
            "Source": "earnings"
        },
        {
            "Title": "Gopal Snacks Makes Earnings Call Audio Recording Available Online",
            "Summary": "Gopal Snacks Limited has made the audio recording of its earnings conference call available on its website. The call was held with investors and analysts on November 11, 2025, to discuss the company's unaudited standalone financial results for the quarter and half year ended September 30, 2025. The recording can be accessed through a link provided on the company's website at gopalnamkeen.com.",
            "Sentiment": "neutral",
            "PublishDate": 1762895281856,
            "Source": "earnings"
        },
        {
            "Title": "Gopal Snacks Reports Strong Q2 Results, Declares Interim Dividend and Authorizes ₹200 Crore Acquisition Budget",
            "Summary": "Gopal Snacks Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company declared a first interim dividend of ₹0.25 per share (25%) on equity shares with face value of ₹1 each for financial year 2025-26, payable by December 9, 2025. The record date for dividend eligibility is set for November 17, 2025. The Board authorized Chairman and Managing Director Bipinbhai Vithalbhai Hadvani to evaluate acquisition opportunities up to ₹200 crores in similar business lines, with prior Board approval required for finalizing any acquisitions. The company reported net profit of ₹256.92 million for the quarter ended September 30, 2025, compared to ₹25.26 million in the previous quarter. Revenue from operations stood at ₹3,700.44 million for the quarter. The company reported an exceptional gain of ₹215.30 million related to insurance claims and scrap sales from a fire incident at its Rajkot plant in December 2024. Basic earnings per share was ₹2.06 for the quarter. The company continues operations through its Modasa and Nagpur facilities while the Rajkot facility remains temporarily closed, and has started a temporary manufacturing facility in Gondal to restore production capacity.",
            "Sentiment": "positive",
            "PublishDate": 1762807299544,
            "Source": "earnings"
        },
        {
            "Title": "Gopal Snacks Targets 20% Revenue Growth Through Geographic Expansion and Product Portfolio Enhancement",
            "Summary": "Gopal Snacks has outlined its growth strategy targeting 20% revenue growth. The company plans to expand its footprint in Western and Southern India while strengthening its premium namkeen and ready-to-eat product portfolio. The strategy includes launching new products in extruded and baked categories, investing in distribution automation, and expanding into rural markets. The company expects margin improvement through scale operations, backward integration, and product premiumization.",
            "Sentiment": "positive",
            "PublishDate": 1762784147781,
            "Source": "stock"
        },
        {
            "Title": "Gopal Snacks Reports Decline in Q2 Financial Performance",
            "Summary": "Gopal Snacks reported Q2 net profit of 256.9 million rupees, down from 288.9 million rupees in the same period last year. Revenue decreased to 3.76 billion rupees from 4.03 billion rupees year-over-year. EBITDA fell significantly to 241.5 million rupees compared to 467.7 million rupees in the previous year. The company's EBITDA margin compressed to 6.43% from 11.62% year-over-year, indicating reduced profitability.",
            "Sentiment": "negative",
            "PublishDate": 1762778474262,
            "Source": "earnings"
        },
        {
            "Title": "Gopal Snacks Receives Approval to Review Acquisition Proposals Worth Up to Rs 2 Billion",
            "Summary": "Gopal Snacks has obtained approval to review acquisition proposals valued at up to 2 billion rupees. The company is now positioned to evaluate potential acquisition opportunities within this financial framework.",
            "Sentiment": "positive",
            "PublishDate": 1762777996858,
            "Source": "order&deals"
        },
        {
            "Title": "Gopal Snacks Limited Schedules Earnings Conference Call for Q2FY26 Results",
            "Summary": "Gopal Snacks Limited will conduct an earnings conference call with investors and analysts on November 11, 2025, at 3:00 PM IST to discuss operational and financial performance for the quarter and half-year ended September 30, 2025. The call will be hosted by Naveen Gupta, Chief Business Officer, and Rigan Raithatha, Chief Financial Officer. Audio recording and transcript of the call will be published on the company's website. The conference call is organized by Emkay Global Financial Services Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1762161600066,
            "Source": "earnings"
        },
        {
            "Title": "Gopal Snacks Launches New Manufacturing Plant in Modasa, Gujarat",
            "Summary": "Gopal Snacks has started operations at a new manufacturing plant in Modasa, Gujarat. The facility helps the company recover production capacity that was lost due to a fire incident. The new plant is positioned to serve markets across Gujarat, Rajasthan, Madhya Pradesh, and Maharashtra.",
            "Sentiment": "positive",
            "PublishDate": 1761805072025,
            "Source": "stock"
        },
        {
            "Title": "Gopal Snacks Advised to Settle 79.7 Million Rupees in GST Dues",
            "Summary": "Gopal Snacks has been advised to settle GST dues amounting to 79.7 million rupees. The company faces this tax settlement requirement related to goods and services tax obligations.",
            "Sentiment": "negative",
            "PublishDate": 1757499919542,
            "Source": "stock"
        },
        {
            "Title": "Gopal Snacks Maintains Revenue Growth Forecast at 18-20% for FY26, Expects Volume Growth from GST Reductions",
            "Summary": "Gopal Snacks has maintained its revenue growth forecast at 18-20% for FY26. The company expects volume growth of 5-6% due to GST reductions.",
            "Sentiment": "positive",
            "PublishDate": 1757488496434,
            "Source": "stock"
        },
        {
            "Title": "Gopal Snacks Expands Production Through Third-Party Manufacturing Agreements in Karnataka and Uttarakhand",
            "Summary": "Gopal Snacks Limited has entered into long-term agreements for third-party manufacturing facilities in Hiryur, Karnataka and Kashipur, Uttarakhand. The Hiryur facility has an installed capacity of 4,400 MTPA and will produce wafers, snack pallets, and corn products to strengthen the company's presence in Southern India. The Kashipur facility has a capacity of 5,900 MTPA and will manufacture namkeen (including gathiya), snack pallets, and corn products to enhance market penetration in Northern India. Chairman Bipin Hadvani stated that these facilities will build a stronger and more flexible supply chain while maintaining quality and scale, supporting deeper market penetration and strengthening relationships with dealers and distributors across key regions.",
            "Sentiment": "positive",
            "PublishDate": 1757399906860,
            "Source": "stock"
        },
        {
            "Title": "Gopal Snacks Reports 9% Revenue Decline in Q1 FY26, Targets 20% Growth Despite Supply Chain Challenges",
            "Summary": "Gopal Snacks Limited reported revenue of Rs. 322.2 crores for Q1 FY26, marking a 9% year-over-year decline primarily due to supply chain disruptions from a fire at its Rajkot plant in December 2024. The company's EBITDA margin dropped significantly to 4.7% from 11.5% in the previous year, while gross margins fell to 26% from 29%. The Gondal unit is now operating at over 60% utilization as a replacement facility. Management expects the new Modasa plant to begin trial production by mid-September 2025, which will restore 60% of lost Rajkot capacity. Despite current challenges, the company maintains guidance for 20% revenue growth in FY26, targeting Rs. 1,750 crores total revenue. Raw material costs have shown improvement with palm oil prices declining 10% quarter-over-quarter. The company plans to add 60-70 new distributors by December and has stepped up marketing efforts with refreshed packaging and enhanced store visibility.",
            "Sentiment": "neutral",
            "PublishDate": 1754913050058,
            "Source": "earnings"
        },
        {
            "Title": "Gopal Snacks Plans Growth Through Capacity Expansion and Regional Strategy",
            "Summary": "Gopal Snacks is pursuing growth through capacity expansion, regional market penetration, and an omni-channel strategy to strengthen its market position. The company is experiencing improving margins as part of its strategic initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1754481899597,
            "Source": "stock"
        },
        {
            "Title": "Gopal Snacks Reports Sharp Decline in Q1 Profitability and Revenue",
            "Summary": "Gopal Snacks reported significantly weaker quarterly results with EBITDA falling to 152 million rupees from 409 million rupees in the same period last year. The company's EBITDA margin compressed to 4.72% compared to 11.54% previously. Net profit declined substantially to 25.2 million rupees from 243 million rupees year-over-year. Revenue also decreased to 3.22 billion rupees from 3.54 billion rupees in the comparable period.",
            "Sentiment": "negative",
            "PublishDate": 1754478933371,
            "Source": "earnings"
        },
        {
            "Title": "Gopal Snacks Reports Q4 Net Loss and Revenue Decline",
            "Summary": "Gopal Snacks has reported a net loss of 395 million rupees in the fourth quarter, compared to a loss of 261.1 million rupees in the same quarter last year and 53 million rupees in the previous quarter. The company's revenue for Q4 stood at 3.2 billion rupees, down from 3.59 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748223261000,
            "Source": "default"
        },
        {
            "Title": "Gopal Snacks Reports Significant Decline in Q4 EBITDA and Revenue",
            "Summary": "Gopal Snacks has reported its Q4 financial results. The company's EBITDA dropped to 21 million rupees from 388.2 million rupees year-over-year. The EBITDA margin decreased to 0.66% from 10.82% in the same period last year. The company reported a net loss of 395 million rupees, compared to a loss of 261.1 million rupees year-over-year and 53 million rupees quarter-over-quarter. Q4 revenue fell to 3.2 billion rupees from 3.59 billion rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748007449000,
            "Source": "result"
        },
        {
            "Title": "Gopal Snacks Ltd.: New CFO Appointed and Company Secretary Reappointed",
            "Summary": "Gopal Snacks Ltd. has appointed Rigan Hasmukhrai Raithatha as the new Chief Financial Officer. The company has also reappointed Mayur Popatbhai Gangani as the Secretary and Compliance Officer. Raithatha has experience in accounting and finance, while Gangani has over 17 years of experience in secretarial and legal matters.",
            "Sentiment": "neutral",
            "PublishDate": 1742217038000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gopal Snacks Ltd.: Aims for 11% Ebitda Margin in FY26 Despite Q3 Setback",
            "Summary": "Gopal Snacks targets 11% Ebitda margin for FY26 after Q3 challenges. Fire at Rajkot plant caused 70.3% YoY drop in Q3 net profit. Company recovering, expects 90% revenue recovery by March. Expanding distributor network in non-core states for growth.",
            "Sentiment": "neutral",
            "PublishDate": 1740634116000,
            "Source": "earnings"
        },
        {
            "Title": "Gopal Snacks Reports Q3 Financial Results",
            "Summary": "Gopal Snacks has released its Q3 financial results. The company reported a net profit of 53 million rupees, which is a significant decrease from 179 million rupees in the same quarter last year. However, revenue increased to 3.9 billion rupees from 3.67 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739320555000,
            "Source": "earnings"
        },
        {
            "Title": "Gopal Snacks Reports Significant Decline in Q3 EBITDA",
            "Summary": "Gopal Snacks has reported a substantial decrease in its third-quarter EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). The company's EBITDA for Q3 fell to 155 million rupees, compared to 353 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin contracted sharply, dropping to 3.94% from 9.60% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739273004000,
            "Source": "earnings"
        },
        {
            "Title": "Gopal Snacks Reports Q3 Financial Results",
            "Summary": "Gopal Snacks has announced its financial results for the third quarter. The company reported a net profit of 53 million rupees, which is a significant decrease from 179 million rupees in the same quarter of the previous year. However, the company's revenue increased to 3.9 billion rupees from 3.67 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739272998000,
            "Source": "earnings"
        },
        {
            "Title": "Gopal Snacks Limited Commences Trial Operations at New Gujarat Facility",
            "Summary": "Gopal Snacks Limited has initiated trial operations at its new manufacturing facility in Gujarat. The installed capacity of this new facility is reported to be 87,569 MTPA (Metric Tonnes Per Annum).",
            "Sentiment": "positive",
            "PublishDate": 1736760796000,
            "Source": "corporate_action"
        },
        {
            "Title": "CFO Resignation at Gopal Snacks",
            "Summary": "Mukesh Kumar Shah has resigned from his position as Chief Financial Officer (CFO) of Gopal Snacks.",
            "Sentiment": "neutral",
            "PublishDate": 1735025312000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gopal Snacks Restores 50% Supply Levels, Aims for Full Recovery",
            "Summary": "Gopal Snacks has announced that it has successfully restored 50% of its supply levels as of December 16. The company is actively working to reinstate maximum supply levels within the next 15 days.",
            "Sentiment": "positive",
            "PublishDate": 1734329939000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gopal Snacks Scales Up Production and Engages Third-Party Manufacturers",
            "Summary": "Gopal Snacks has increased production at its other manufacturing facilities and has engaged third-party manufacturers to enhance its supply capabilities. This move appears to be a strategic decision to boost production capacity and meet market demand.",
            "Sentiment": "positive",
            "PublishDate": 1734329851000,
            "Source": "corporate_action"
        },
        {
            "Title": "Fire Incident Causes Temporary Shutdown of Gopal Snacks Unit in Rajkot",
            "Summary": "Gopal Snacks has reported a temporary cessation of operations at one of its units in Rajkot due to a fire incident. The company has not provided further details about the extent of the damage or the expected duration of the shutdown.",
            "Sentiment": "negative",
            "PublishDate": 1734048761000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gopal Snacks: Fire at Gujarat Facility Impacts Share Price",
            "Summary": "Gopal Snacks shares dropped nearly 10% following a fire at its Rajkot I facility in Gujarat, later recovering to trade 4% lower. The company has shifted production to other facilities, engaged third-party manufacturers, and confirmed full insurance coverage. No casualties were reported, and critical business systems remain operational.",
            "Sentiment": "negative",
            "PublishDate": 1733978369000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gopal Snacks Ltd: Receives ₹13.76 Crore GST Show Cause Notice",
            "Summary": "Gopal Snacks Ltd received a Show Cause Notice from CGST Rajkot for ₹13.76 crore, including penalties, related to GST classification of their 'Papad' product for 2020-2021. The company plans to defend its case and doesn't anticipate immediate financial impact.",
            "Sentiment": "neutral",
            "PublishDate": 1733509328000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gopal Snacks: Margin Boost Targeted Through Product Mix Overhaul",
            "Summary": "<p>Gopal Snacks aims to <span class='positive'>increase</span> EBITDA margins to <b>14.5%</b> by FY 2026-27 through product mix changes and base expansion. The company plans to <span class='positive'>reduce</span> revenue contribution from Rs 5 SKUs from <b>70%</b> to <b>50-60%</b> by introducing larger, higher-priced packs. Q2 saw <span class='positive'>6% net profit growth</span> to Rs 28.89 crore and <span class='positive'>12.6% revenue growth</span> to Rs 402.64 crore, despite <span class='negative'>margin contraction</span> due to <span class='negative'>rising raw material costs</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1729045387000,
            "Source": "normal_news"
        },
        {
            "Title": "Gopal Snacks: Shares Dip 4% on Margin Squeeze and Rising Expenses",
            "Summary": "<p>Gopal Snacks shares <span class='negative'>fell 4.37%</span> to Rs 420.15 after Q2FY25 results showed a <span class='negative'>13.1% YoY increase in expenses</span> to Rs 3,649.9 crore. <span class='negative'>Ebitda margin contracted 111 bps</span> to 11.62%. <span class='positive'>Revenue grew 12.6% YoY</span> to Rs 4,026.4 crore, while <span class='positive'>profit rose 6.2%</span> to Rs 288.9 crore. The company <span class='positive'>added 161 new distributors</span> in six months and <span class='positive'>declared a Rs 1 per share interim dividend</span>.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728980295000,
            "Source": "result"
        },
        {
            "Title": "Gopal Snacks Reports Q2 Profit and Revenue Growth, Declares Interim Dividend",
            "Summary": "<p>Gopal Snacks announced its <b>Q2 financial results</b>, showing <span class='positive'>year-over-year and quarter-over-quarter growth</span> in both <span class='positive'>net profit and revenue</span>. The company reported a <b>net profit</b> of <span class='positive'>288.9 million rupees</span>, up from 272 million rupees year-over-year and 243 million rupees quarter-over-quarter. <b>Revenue</b> increased to <span class='positive'>3.99 billion rupees</span> from 3.56 billion rupees year-over-year and 3.49 billion rupees quarter-over-quarter. Additionally, the company declared its <span class='positive'>first interim dividend</span> of 1 rupee per share.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728951249000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gopal Snacks Expands Distribution Network and Achieves Significant Growth",
            "Summary": "<p><span class=\"positive\">Gopal Snacks</span> has reported a <span class=\"positive\">substantial expansion</span> of its distribution network, adding <b>211 new distributors</b> to reach a total of <b>828</b>. This represents a <span class=\"positive\">year-over-year growth of 34.2%</span> in their distribution network. Additionally, the company's <span class=\"neutral\">focus market</span> has achieved a <span class=\"positive\">notable year-over-year growth of 29.3%</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728914286000,
            "Source": "result"
        },
        {
            "Title": "Gopal Snacks Declares First Interim Dividend",
            "Summary": "<p>Gopal Snacks has announced its <span class='positive'>first interim dividend</span> of <span class='neutral'>₹1 per share</span>. This <b>corporate action</b> represents a <span class='positive'>direct financial benefit</span> to the company's <b>shareholders</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728904448000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gopal Snacks Reports Q2 EBITDA Growth",
            "Summary": "<p>Gopal Snacks has reported its Q2 financial results. The company's <span class='positive'>EBITDA increased</span> to ₹467.71 million, up from ₹455.3 million in the same quarter last year. However, the <span class='negative'>EBITDA margin decreased</span> to 11.73% from 12.80% year-over-year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728904133000,
            "Source": "result"
        },
        {
            "Title": "Gopal Snacks Reports Q2 Revenue Growth",
            "Summary": "<p><span class=\"neutral\">Gopal Snacks</span> has announced its <b>Q2 revenue figures</b>. The company reported <span class=\"positive\">revenue of 3.99 billion rupees</span>, showing an <span class=\"positive\">increase</span> from <span class=\"neutral\">3.56 billion rupees year-over-year</span> and <span class=\"neutral\">3.49 billion rupees quarter-over-quarter</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728904118000,
            "Source": "result"
        },
        {
            "Title": "Gopal Snacks Reports Q2 Net Profit Increase",
            "Summary": "<p>Gopal Snacks has reported a <span class='positive'>net profit</span> of <b>288.9 million rupees</b> for the second quarter, showing an <span class='positive'>increase</span> from <b>272 million rupees</b> year-over-year and <b>243 million rupees</b> quarter-over-quarter.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728904064000,
            "Source": "result"
        },
        {
            "Title": "Gopal Snacks: Emkay Initiates 'Buy' with 48% Upside Potential",
            "Summary": "<p>Emkay initiates coverage on <span class='neutral'>Gopal Snacks</span> with a <span class='positive'>'Buy'</span> rating and ₹600 price target, implying <span class='positive'>48% upside</span>. The brokerage cites <span class='positive'>improved management focus</span>, <span class='positive'>pan-India expansion plans</span>, and potential for <span class='positive'>valuation re-rating</span>. Emkay projects <b>15% sales CAGR</b> and <b>29% earnings CAGR</b> for FY24-27E.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728890376000,
            "Source": "normal_news"
        },
        {
            "Title": "Gopal Snacks Expands Manufacturing Capacity",
            "Summary": "<p>Gopal Snacks has announced the <span class='positive'>addition</span> of a <b>new manufacturing facility</b>, bringing their total to <span class='positive'>7 facilities</span> across India. This includes <b>3 primary facilities</b> and <b>4 ancillary facilities</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728458011000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gopal Snacks Anticipates Completion of Construction and Full-Scale Operations",
            "Summary": "<p>Gopal Snacks has announced that the remaining <span class='neutral'>construction</span> of their facility is expected to be <span class='positive'>completed</span> within the next <b>six months</b>. The company anticipates <span class='positive'>beginning full-scale operations</span> in the <b>first half of the fiscal year 2026</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728457975000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gopal Snacks Expands Manufacturing Capacity with New Facility",
            "Summary": "<p><span class=\"positive\">Gopal Snacks</span> has <span class=\"positive\">strengthened</span> its <b>backward integration</b> by <span class=\"positive\">launching</span> its <b>fourth vertically integrated manufacturing facility</b> in Gondal, Rajkot, Gujarat. This <span class=\"positive\">expansion</span> demonstrates the company's <span class=\"positive\">commitment</span> to <span class=\"positive\">increasing</span> production capacity and <span class=\"positive\">enhancing</span> its supply chain efficiency.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728457923000,
            "Source": "corporate_action"
        }
    ]
}