{
    "Symbol": "GPECO",
    "ISIN": "INE0S7E01015",
    "News": [
        {
            "Title": "GP Eco Solutions India Reports Strong H1 Performance with Doubled Net Profit",
            "Summary": "GP Eco Solutions India delivered robust H1 results with net profit more than doubling to 104 million rupees from 49 million rupees year-over-year. Revenue grew significantly to 1.2 billion rupees from 833 million rupees in the same period last year. EBITDA increased substantially to 151 million rupees compared to 72 million rupees year-over-year, while EBITDA margin expanded to 12.40% from 8.63% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762442070020,
            "Source": "earnings"
        },
        {
            "Title": "GP Eco Solutions Subsidiary Signs 3 GW Power Tester Deal for Major BESS Manufacturing Setup",
            "Summary": "GP Eco Solutions' subsidiary Invergy India has signed an MOU and supply agreement with Shenzhen Sinexcel for 3 GW power testers. The partnership aims to establish India's largest Battery Energy Storage System (BESS) testing and manufacturing facility.",
            "Sentiment": "positive",
            "PublishDate": 1757581946005,
            "Source": "order&deals"
        },
        {
            "Title": "GP Eco Solutions India Limited Receives Approval for 100 MW Solar Power Project Worth ₹350 Crores",
            "Summary": "GP Eco Solutions India Limited has received approval for a 100 MW solar power project with an estimated cost of ₹350 crores. The project will have a connection at 220 KV level. The company has a market capitalization of ₹690 crores.",
            "Sentiment": "positive",
            "PublishDate": 1756447086560,
            "Source": "stock"
        },
        {
            "Title": "GP Eco Solutions Secures ₹122 Crore Order",
            "Summary": "GP Eco Solutions has received an order worth ₹122 crore. The company's current market capitalization stands at ₹600 crore. This news is significant for the small and medium enterprise (SME) sector.",
            "Sentiment": "positive",
            "PublishDate": 1752137850000,
            "Source": "default"
        },
        {
            "Title": "GP ECO SOLUTIONS Secures 50 Crore Order",
            "Summary": "GP ECO SOLUTIONS, a company with a market capitalization of 400 crore rupees, has received an order worth 50 crore rupees. The company is listed in the SME (Small and Medium Enterprises) segment.",
            "Sentiment": "positive",
            "PublishDate": 1746001162000,
            "Source": "default"
        },
        {
            "Title": "GP Eco Solution Secures 200MW+ Solar Inverter Supply Order",
            "Summary": "GP Eco Solution has obtained an order to supply over 200MW of solar inverters. The execution of this order is scheduled to be completed by the end of March 2025. The company has a market capitalization of 300 crore rupees and is classified as a Small and Medium Enterprise (SME).",
            "Sentiment": "positive",
            "PublishDate": 1740373017000,
            "Source": "order&deals"
        },
        {
            "Title": "GP Eco Solutions India's Unit to Expand Manufacturing Capacity with Gigafactory Investment",
            "Summary": "GP Eco Solutions India has announced that its subsidiary is making investments to significantly expand its manufacturing capacity. The unit plans to establish a gigafactory, increasing its production capacity from the current 500 MWh to 5 GWh. This represents a tenfold increase in capacity, indicating a major expansion in the company's operations.",
            "Sentiment": "positive",
            "PublishDate": 1734946791000,
            "Source": "corporate_action"
        }
    ]
}