{
    "Symbol": "GPIL",
    "ISIN": "INE177H01039",
    "News": [
        {
            "Title": "Godawari Power Gets Consent for 6 MTPA Iron Ore Capacity",
            "Summary": "Godawari Power & Ispat receives operational consent for expanded Ari Dongri Iron Ore Mines, increasing capacity from 2.35 MTPA to 6 MTPA with enhanced mining lease area from 138.96 Ha to 213.01 Ha.",
            "Sentiment": "positive",
            "PublishDate": 1770699937293,
            "Source": "stocks"
        },
        {
            "Title": "Godawari Power Reports Q3FY26 Results & Major Deals",
            "Summary": "Godawari Power & Ispat Limited announced Q3FY26 results with net profit of ₹148.54 crores, approved ₹120 crores railway wagon purchase, and ₹90.87 crores stake disposal in associate company.",
            "Sentiment": "positive",
            "PublishDate": 1770381189042,
            "Source": "co_actions_results"
        },
        {
            "Title": "GPIL schedules Q3 & 9MFY26 earnings call for Feb 9",
            "Summary": "Godawari Power And Ispat Limited announces conference call for analysts and investors on February 9, 2026 at 12:00 PM IST to discuss Q3 & 9MFY26 financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1770217466964,
            "Source": "co_actions_results"
        },
        {
            "Title": "GPIL Gets Environmental Nod for Mine Expansion",
            "Summary": "Godawari Power & Ispat Limited receives environmental clearance to expand Ari Dongri Iron Ore Mines capacity from 2.35 MTPA to 6 MTPA, with mining lease area increasing to 213.01 hectares.",
            "Sentiment": "positive",
            "PublishDate": 1769877049105,
            "Source": "stocks"
        },
        {
            "Title": "Godawari Power Board Meet Set for Feb 6, 2026",
            "Summary": "Godawari Power & Ispat Limited announces board meeting on February 6, 2026, to consider Q3 FY26 unaudited standalone and consolidated financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769088273713,
            "Source": "co_actions_results"
        },
        {
            "Title": "Godawari Power Invests ₹300 Cr in Battery Storage",
            "Summary": "Godawari Power And Ispat Ltd announces ₹300 crore investment in subsidiary Godawari New Energy for battery energy storage plant development, completing initial equity allotment of ₹75.60 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768902103203,
            "Source": "stocks"
        },
        {
            "Title": "Godawari Power & Ispat Participates in Go India 2026",
            "Summary": "Godawari Power & Ispat Limited participated in Go India Top Ideas for 2026 Conference on January 08, 2026, conducting meetings with analysts and institutional investors in Mumbai.",
            "Sentiment": "neutral",
            "PublishDate": 1767877110991,
            "Source": "stocks"
        },
        {
            "Title": "GPIL Completes Environmental Clearance Presentation",
            "Summary": "Godawari Power & Ispat successfully presents to State Environmental Assessment Committee for expanding Ari Dongri iron ore mines capacity from 2.35 MTPA to 6 MTPA.",
            "Sentiment": "positive",
            "PublishDate": 1767797098014,
            "Source": "stocks"
        },
        {
            "Title": "Godawari Power & Ispat Allots 13.73 Lakh Equity Shares",
            "Summary": "Godawari Power & Ispat Limited allotted 13,72,500 equity shares following warrant conversion by two investors, raising ₹25.22 crores. The allotment increases paid-up capital to ₹67.12 crores.",
            "Sentiment": "positive",
            "PublishDate": 1767786127244,
            "Source": "co_actions_results"
        },
        {
            "Title": "Godawari Power & Ispat Executes Loan Termination Deal",
            "Summary": "Godawari Power & Ispat executes termination agreement following full repayment of ₹120.00 crore inter-corporate loan by Deccan Gold Mines Limited, completing the financial transaction.",
            "Sentiment": "positive",
            "PublishDate": 1767751113483,
            "Source": "stocks"
        },
        {
            "Title": "Godawari Power Terminates ₹120 Cr Loan Agreement",
            "Summary": "Godawari Power & Ispat executed termination agreement for ₹120 crores inter-corporate loan with Deccan Gold Mines following full repayment with interest on January 6, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767695692949,
            "Source": "co_actions_results"
        },
        {
            "Title": "GPIL Skips Deccan Gold Mines Rights Issue",
            "Summary": "Godawari Power & Ispat Limited decides not to participate in Deccan Gold Mines rights issue citing oversubscription as the reason for withdrawal.",
            "Sentiment": "neutral",
            "PublishDate": 1767168692423,
            "Source": "co_actions_results"
        },
        {
            "Title": "Godawari Power Invests ₹73.95 Cr in Energy Subsidiary",
            "Summary": "Godawari Power & Ispat approves ₹73.95 crores investment in wholly owned subsidiary Godawari New Energy through preference shares issuance for capital expenditure and working capital requirements.",
            "Sentiment": "positive",
            "PublishDate": 1765957930024,
            "Source": "stocks"
        },
        {
            "Title": "Godawari Power Invests ₹73.95 Cr in BESS Subsidiary",
            "Summary": "Godawari Power & Ispat Limited invests ₹73.95 crores in wholly owned subsidiary GNEPL through preference shares allotment for 20 GWh Battery Energy Storage System plant development.",
            "Sentiment": "positive",
            "PublishDate": 1765757253941,
            "Source": "stocks"
        },
        {
            "Title": "Godawari Power And Ispat Launches 2 MTPA Iron Ore Pellet Facility",
            "Summary": "Godawari Power And Ispat has commenced commercial operations of a new 2 MTPA iron ore pellet facility. The expansion increases the company's total pellet production capacity from 2.7 MTPA to 4.7 MTPA, representing a 74% capacity enhancement.",
            "Sentiment": "positive",
            "PublishDate": 1765176402138,
            "Source": "corporate_action"
        },
        {
            "Title": "Godawari Power and Ispat Limited Approves Investment in Deccan Gold Mines Rights Issue",
            "Summary": "Godawari Power and Ispat Limited's board approved acting as a specific investor in Deccan Gold Mines Limited's rights issue, committing to subscribe to unsubscribed portions at Rs 80 per share to ensure at least 90% subscription. The investment allows GPIL to increase its holding in the gold mining company while maintaining compliance with the 25% shareholding limit along with group companies.",
            "Sentiment": "positive",
            "PublishDate": 1764929656133,
            "Source": "order&deals"
        },
        {
            "Title": "Godawari Power And Ispat Receives Chhattisgarh Board Approval for 2 MTPA Plant and Capacity Expansion to 4.7 MTPA",
            "Summary": "Godawari Power And Ispat has secured approval from the Chhattisgarh Board for establishing a 2 MTPA plant and obtained consent for expanding its overall capacity to 4.7 MTPA. The approvals enable the company to significantly increase its production capabilities and operational scale in the state.",
            "Sentiment": "positive",
            "PublishDate": 1764766849405,
            "Source": "corporate_action"
        },
        {
            "Title": "Godawari Power and Ispat Allots 1,78,680 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Godawari Power and Ispat Limited allotted 1,78,680 equity shares of Re. 1 each at an exercise price of Rs. 116.20 per share under its ESOP-2023 scheme, raising Rs. 2,07,62,616. The allotment increased the company's paid-up share capital from Rs. 66,96,16,728 to Rs. 66,97,95,408, with diluted earnings per share calculated at Rs. 6.90.",
            "Sentiment": "neutral",
            "PublishDate": 1764411230812,
            "Source": "corporate_action"
        },
        {
            "Title": "Godawari Power And Ispat Receives ₹124.95 Crore Preference Share Allotment for Battery Storage Project",
            "Summary": "Godawari Power And Ispat received allotment of ₹124.95 crore preference shares in Godawari New Energy Pvt Ltd. The funding is designated for a 10 GWh Battery Energy Storage System (BESS) project expansion.",
            "Sentiment": "positive",
            "PublishDate": 1763596988076,
            "Source": "stock"
        },
        {
            "Title": "Godawari Power & Ispat Reports Q2 FY26 Results, Announces Major Capacity Expansions",
            "Summary": "Godawari Power & Ispat maintained stable revenue with 22% EBITDA and 14% PAT margins despite soft realizations, while pellet sales surged 71% in Q2 FY26. The company is expanding iron ore mining capacity from 2.35 million tons to 6 million tons annually and commissioning a 2 million ton pellet plant by November 2025, alongside new projects including a 0.7 million ton cold rolling mill complex and 10 gigawatt battery energy storage system.",
            "Sentiment": "positive",
            "PublishDate": 1763556668782,
            "Source": "earnings"
        },
        {
            "Title": "Godawari Power and Ispat Limited Allots Warrants to Promoter Group Members",
            "Summary": "Godawari Power and Ispat Limited allotted 22,04,200 warrants each to promoter group members Kumar Agrawal and Hanuman Prasad Agrawal through preferential allotment on November 14, 2025. Upon full conversion, Kumar Agrawal's shareholding will increase from 3.31% to 3.54% and Hanuman Prasad Agrawal's will rise from 0.14% to 0.46% of the enhanced paid-up share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1763527580181,
            "Source": "corporate_action"
        },
        {
            "Title": "Godawari Power and Ispat Promoter Dinesh Agrawal Acquires 12.25 Lakh Warrants Through Preferential Allotment",
            "Summary": "Dinesh Agrawal, promoter of Godawari Power and Ispat Limited, acquired 12,24,500 warrants through preferential allotment on November 14, 2025. Upon full conversion of these warrants into equity shares, his shareholding will increase from 2,42,78,425 equity shares (3.63%) to 2,55,02,925 equity shares (3.70%) of the enhanced paid-up share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1763527245560,
            "Source": "corporate_action"
        },
        {
            "Title": "Godawari Power and Ispat Allots 41.63 Lakh Warrants to Promoter Group Member",
            "Summary": "Godawari Power and Ispat Limited allotted 41,63,300 warrants to promoter group member Sarita Devi Agrawal through preferential allotment on November 14, 2025. Upon full conversion, her shareholding will increase from 70,31,130 equity shares (1.05% of existing paid-up share capital) to 1,11,94,430 equity shares (1.62% of enhanced paid-up share capital).",
            "Sentiment": "neutral",
            "PublishDate": 1763526936432,
            "Source": "corporate_action"
        },
        {
            "Title": "Godawari Power & Ispat Reports Mixed Q2 FY26 Results with Strong Production Growth",
            "Summary": "Godawari Power & Ispat Limited reported modest year-on-year growth in revenue (3%), EBITDA (5%), and PAT (1%) for Q2 FY26, driven by higher pellet and structural steel sales volumes, though quarterly performance softened due to lower sales realizations. The company achieved significant production increases with iron ore mining up 29%, pellets up 31%, and value-added steel products up 5% year-on-year, while advancing major expansion projects including a 0.7 million ton CRM complex and 250MW solar power project.",
            "Sentiment": "positive",
            "PublishDate": 1763208148412,
            "Source": "earnings"
        },
        {
            "Title": "Godawari Power & Ispat Allots Rs 500 Crore Warrants, Plans Rs 1,050 Crore Expansion",
            "Summary": "Godawari Power & Ispat allotted 2.04 crore equity warrants at Rs 245 each to promoters and investors, raising Rs 125 crore upfront with Rs 375 crore more on conversion. The company approved Rs 300 crore investment in subsidiary for battery storage systems and Rs 750 crore for 250MW solar power plant, targeting completion by March 2027.",
            "Sentiment": "positive",
            "PublishDate": 1763136237803,
            "Source": "earnings"
        },
        {
            "Title": "Godawari Power & Ispat Announces Major Expansion Plan With ₹3,400 Cr Investment",
            "Summary": "Godawari Power & Ispat outlined a massive capacity expansion across its steel and mining operations, including a 2.5 MTPA greenfield sponge-iron and pellet plant set for commissioning by FY27. The company plans to invest ₹3,400 crores in renewable energy integration to achieve carbon-neutral operations by 2030 while targeting EBITDA margin expansion to 25% through backward integration and power cost efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1763135434027,
            "Source": "stock"
        },
        {
            "Title": "Godawari Power and Ispat Completes Public Hearing for Iron Ore Mine Expansion",
            "Summary": "Godawari Power and Ispat Limited successfully concluded a public hearing for the proposed expansion of its Ari Dongri Iron Ore Mines. The expansion aims to increase mining capacity from existing 2.35 MTPA to 6 MTPA, with the mining lease area expanding from 138.96 hectares to 213.01 hectares. The public hearing was conducted at Kanker, Chhattisgarh for the purpose of obtaining environmental clearance and approval for the proposed expansion. The mines are located at Village Kachche, District Uttar Bastar, Kanker, Chhattisgarh.",
            "Sentiment": "positive",
            "PublishDate": 1763030438917,
            "Source": "stock"
        },
        {
            "Title": "Godawari Power and Ispat Secures 182.937 Hectare Land for Integrated Steel Plant in Chhattisgarh",
            "Summary": "Godawari Power and Ispat Limited has been allotted leasehold land of 182.937 hectares (452.03 acres) by Chhattisgarh State Industrial Development Corporation Limited at Village Sarora, Tehsil Tilda, District Raipur, Chhattisgarh. The lease deed dated October 31, 2025 was received by the company on November 6, 2025, with a lease period of 99 years extending until October 2124. The land allocation is for setting up an Integrated Steel Plant at Sarora, Raipur, Chhattisgarh.",
            "Sentiment": "positive",
            "PublishDate": 1762431212515,
            "Source": "stock"
        },
        {
            "Title": "Godawari Power And Ispat Resumes Iron Ore Pellet Plant Operations After Shutdown",
            "Summary": "Godawari Power And Ispat Ltd has resumed operations at its iron ore pellet plant following a shutdown. The company estimates a production loss of 150,000 metric tons due to the temporary halt in operations.",
            "Sentiment": "neutral",
            "PublishDate": 1761801148532,
            "Source": "stock"
        },
        {
            "Title": "NCLT Approves Godawari Energy-Godawari Power Merger Without Shareholder Meetings",
            "Summary": "The National Company Law Tribunal (NCLT) Cuttack bench has dispensed with the requirement of holding meetings for shareholders and creditors regarding the merger between Godawari Energy Limited and Godawari Power and Ispat Limited. The scheme involves amalgamation of Godawari Energy (transferor company) with its parent company Godawari Power and Ispat (transferee company), where Godawari Energy is a wholly-owned subsidiary. The NCLT waived meeting requirements as all equity shareholders, debenture holders, and unsecured creditors of the transferor company provided consent through affidavits. For the transferee company, meetings were dispensed with since the scheme does not involve any share issuance or compromise with existing shareholders and creditors. The appointed date for the amalgamation scheme is April 1, 2021. The merger aims to consolidate group structure, achieve operational synergies, and enhance financial efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1760613493664,
            "Source": "corporate_action"
        },
        {
            "Title": "Godawari Power and Ispat Holds EGM to Approve Warrant Issuance to Promoters",
            "Summary": "Godawari Power and Ispat Limited conducted an Extra-Ordinary General Meeting on October 15, 2025, through video conferencing. The meeting commenced at 11:30 A.M. and concluded at 12:00 Noon. The primary agenda was to approve the offer, issue and allotment of warrants convertible into equity shares to promoters, members of promoters' group, and other identified non-promoters on a preferential basis. Chairman cum Managing Director Bajrang Lal Agrawal, being interested in the proposed resolution, requested Director Vinod Pillai to chair the meeting. Bajrang Lal Agrawal, Siddharth Agrawal, and Abhishek Agrawal did not participate in discussions due to their interest in the resolution. Remote e-voting was conducted from October 11-14, 2025, with CS Brajesh R. Agrawal appointed as scrutinizer. The company provided both remote e-voting and electronic voting facilities during the meeting for members to cast their votes on the resolution.",
            "Sentiment": "neutral",
            "PublishDate": 1760512177169,
            "Source": "corporate_action"
        },
        {
            "Title": "Godawari Power and Ispat Schedules Public Hearing for Iron Ore Mine Expansion",
            "Summary": "Godawari Power and Ispat Limited announced a public hearing scheduled for November 13, 2025, for environmental clearance of their proposed expansion of Ari Dongri Iron Ore Mines. The expansion plans to increase mining capacity from 2.35 MTPA to 6 MTPA and extend the mining lease area from 138.96 hectares to 213.01 hectares. The iron ore mines are located at Village Kachche, District Uttar Bastar, Kanker, Chhattisgarh.",
            "Sentiment": "neutral",
            "PublishDate": 1760100396851,
            "Source": "stock"
        },
        {
            "Title": "Godawari Power & Ispat Awards Cold Rolling Mill Contract to John Cockerill",
            "Summary": "Godawari Power & Ispat Limited has awarded a contract to John Cockerill for a 6 Hi Reversible Cold Rolling Mill to be installed at Tilda, Raipur. This represents a business win for John Cockerill in the steel processing equipment sector.",
            "Sentiment": "positive",
            "PublishDate": 1759320359876,
            "Source": "order&deals"
        },
        {
            "Title": "Godawari Power & Ispat Temporarily Shuts Iron Ore Pellet Plant After Fatal Incident",
            "Summary": "Godawari Power and Ispat Limited experienced a serious incident at its iron ore pellet plant in Siltara Industrial Area, Raipur, Chhattisgarh on September 26, 2025, around 5:00 PM. The incident involved the collapse of refractory of side wall of travel grate during routine plant inspection, resulting in six employee fatalities and six injuries. One injured employee has been discharged while five others remain in stable condition and are expected to be discharged within a week. The company has temporarily closed the iron ore pellet plant operations pending completion of internal investigation and resetting of refractory lining. Other manufacturing activities including another pellet plant, DRI, and SMS continue operating normally. The company has insurance coverage for the entire plant and Group Term Life Policy providing Rs. 10 lakh compensation per employee for death cases, plus Group Personal Accident Policy covering Rs. 5-10 lakh for accidents. The quantum of production loss cannot be immediately determined and will be communicated later.",
            "Sentiment": "negative",
            "PublishDate": 1758958558249,
            "Source": "stock"
        },
        {
            "Title": "Godawari Power and Ispat to Hold EGM for ₹500 Crore Warrant Issue",
            "Summary": "Godawari Power and Ispat Limited has scheduled an Extra-Ordinary General Meeting on October 15, 2025, through video conferencing to approve the issuance of 2.04 crore warrants worth ₹500 crores at ₹245 per warrant. The warrants will be issued to promoters, promoter group members, and identified non-promoters on a preferential basis. Each warrant is convertible into one equity share within 18 months. The funds will be utilized for financing a Cold Rolling Mill project (₹200 crores), investment in subsidiary Godawari New Energy Private Ltd for Battery Energy Storage System projects (₹175 crores), and general corporate purposes (₹125 crores). Remote e-voting will be available from October 11-14, 2025, with the cut-off date set as October 8, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758615642662,
            "Source": "corporate_action"
        },
        {
            "Title": "Godawari Power & Ispat Corrects Investor Names in Rs 500 Crore Convertible Warrants Issue",
            "Summary": "Godawari Power & Ispat Limited issued a corrigendum to correct spelling errors in investor names for their preferential issue of convertible warrants. The company corrected names of three investors: Mrs Sarita Agrawal to Mrs Sarita Devi Agrawal, Shree Nakoda Pipes Impex Private Limited to Shree Nakoda Pipe Impex Private Limited, and Meridian Realtech Private Limited to Meridien Realtech Private Limited. The preferential issue involves up to 2.04 crore fully convertible warrants for Rs 500 crores to seven investors. Each warrant is priced at Rs 245 and convertible into one equity share within 18 months from allotment date. Post-conversion, promoter shareholding will decrease from 63.51% to 63.05%, while public shareholding will increase from 36.49% to 36.95%.",
            "Sentiment": "neutral",
            "PublishDate": 1758192423600,
            "Source": "corporate_action"
        },
        {
            "Title": "Godawari Power And Ispat Approves Warrant Issuance Worth Up To 5 Billion Rupees",
            "Summary": "Godawari Power And Ispat has approved the issuance of warrants valued at up to 5 billion rupees. The approval represents a significant capital raising initiative for the company.",
            "Sentiment": "positive",
            "PublishDate": 1758176815241,
            "Source": "corporate_action"
        },
        {
            "Title": "Godawari Power & Ispat Schedules Board Meeting to Consider Fund Raising Through Preferential Issue",
            "Summary": "Godawari Power & Ispat Limited has scheduled a Board of Directors meeting on September 18, 2025 to consider raising funds through preferential issue of securities, equity shares, or warrants. The company will determine the issue price subject to regulatory and statutory approvals. The trading window for designated persons will remain closed from September 16, 2025 until 48 hours after the board meeting outcome announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1757938143564,
            "Source": "corporate_action"
        },
        {
            "Title": "Godawari Power and Ispat Shares Surge Over 10% to Record High Despite Weak Quarterly Results",
            "Summary": "Godawari Power and Ispat shares gained over 10% on Monday, reaching an all-time high of ₹275 and closing at ₹269.7. This marked the stock's biggest single-day gain since March 2025. Trading volumes reached 4.5 crore shares, the highest since June 2023 and well above the 20-day average of 44 lakh shares. The stock has risen 33% this year and has delivered positive returns annually since 2019. Despite the stock surge, the company's quarterly results showed net profit declining 24.4% to ₹216 crore, revenue falling 2% to ₹1,345 crore, and EBITDA dropping 20.8% to ₹346 crore. EBITDA margin contracted to 25.7% from 31.8% in the previous year. The company achieved 25% of its FY26 production guidance for rolled products and 30% for ferro alloys by the June quarter end.",
            "Sentiment": "positive",
            "PublishDate": 1757930647973,
            "Source": "stock"
        },
        {
            "Title": "Godawari Power and Ispat Reports Strong Q4 Results, Recommends Rs 1 Dividend",
            "Summary": "Godawari Power and Ispat Limited approved audited financial results for the quarter and year ended March 31, 2025. The company reported standalone net profit of Rs 204.49 crores for Q4 FY25 compared to Rs 209.24 crores in Q4 FY24. For the full year, standalone net profit was Rs 769.64 crores versus Rs 917.44 crores in the previous year. Revenue from operations for FY25 stood at Rs 4,661.24 crores against Rs 5,042.12 crores in FY24. The Board recommended a final dividend of Re 1 per share (100%) for FY 2024-25, subject to shareholder approval. The company also approved capacity expansion plans including enhancement of steel melting capacity by 50,000 MTs and revision of solar power plant capacity from 95 MWp to 125 MWp. Additionally, the Board approved raising long-term debt of Rs 300 crores and incorporation of Godawari Education And Research Foundation as a Section 8 company for CSR activities.",
            "Sentiment": "positive",
            "PublishDate": 1757136120205,
            "Source": "earnings"
        },
        {
            "Title": "Godawari Power & Ispat Announces INR 1,600 Crore Capex for Cold Rolling Mill and Battery Storage Projects",
            "Summary": "Godawari Power & Ispat Limited reported quarterly results with EBITDA and PAT margins of 24% and 15% respectively. The company's Board approved INR 1,600 crores capex for two new projects: a INR 900 crore cold rolling mill complex with 0.7 million ton capacity to produce value-added steel products, and a INR 700 crore battery energy storage system project with 10-gigawatt capacity in Maharashtra. The cold rolling mill will convert hot-rolled coils into cold-rolled products including color-coated steel and zinc-aluminum-magnesium steel, funded through INR 600 crores debt and INR 300 crores equity. The battery storage project will manufacture battery packs and containers, with technology imported from China, targeting commissioning by March 2027. GPIL received approval from PGCIL to supply steel billets for transmission projects and environmental clearance for a 2 million ton greenfield integrated steel project. The company expects mining capacity expansion approval by Q3 FY26 and pellet plant commissioning in October.",
            "Sentiment": "positive",
            "PublishDate": 1754651930163,
            "Source": "earnings"
        },
        {
            "Title": "Godawari Power And Ispat Limited Submits Q1-FY26 Results Conference Call Recording",
            "Summary": "Godawari Power And Ispat Limited has submitted the audio recording of their Q1-FY26 results conference call held on August 6, 2025 to BSE and NSE. The results were approved by the Board at its meeting held on August 5, 2025. The audio recording is available on the company's website under the Investor section at Financial Reporting > Con Call Recording.",
            "Sentiment": "neutral",
            "PublishDate": 1754492202578,
            "Source": "earnings"
        },
        {
            "Title": "GPIL Announces Major Expansion Plan Worth ₹1,600 Crore to Double Mining Capacity by FY26",
            "Summary": "GPIL has unveiled an ambitious expansion strategy to significantly scale its operations by FY26. The company plans to double its mining capacity to 6 million tonnes and increase pellet production to 4.7 million tonnes. Key investments include a ₹900 crore Cold Rolled Mill (CRM) complex and a ₹700 crore 10GW Battery Energy Storage System (BESS) project aimed at diversifying operations. The Pellet 2.0 plant is scheduled for trials in October 2025, while solar capacity will be expanded to 290 MW. The expansion is backed by the company's strong cash position and favorable steel demand conditions.",
            "Sentiment": "positive",
            "PublishDate": 1754405416560,
            "Source": "stock"
        },
        {
            "Title": "Godawari Power and Ispat Corrects Acquisition Timeline for Battery Energy Storage Subsidiary",
            "Summary": "Godawari Power and Ispat Limited issued a corrigendum correcting the indicative completion time for its acquisition of Godawari New Energy Pvt Ltd from March 2026 to March 2027. The company will acquire 100% shareholding in GNEPL for Rs. 25.49 crores through the purchase of 2,54,90,000 equity shares at Rs. 10 each on a rights basis. GNEPL was incorporated on June 26, 2025, and will focus on setting up a Battery Energy Storage System plant. The subsidiary has not yet started business operations and will have its registered office in Raipur, Chhattisgarh, with operations planned in Maharashtra. The investment represents a related party transaction as GNEPL is a wholly owned subsidiary of Godawari Power and Ispat Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1754399267505,
            "Source": "corporate_action"
        },
        {
            "Title": "Godawari Power & Ispat Approves Subsidiary Merger, Rs 900 Crore Cold Rolling Mill Project",
            "Summary": "Godawari Power and Ispat Limited's Board approved a scheme of amalgamation with its wholly-owned subsidiary Godawari Energy Limited, subject to regulatory and shareholder approvals. The company also approved quarterly results for the period ended June 30, 2025, showing standalone net profit of Rs 200.50 crores and consolidated net profit of Rs 216.41 crores. The Board sanctioned a new 0.7 MTPA Cold Rolling Mill project worth Rs 900 crores at Sarora, Chhattisgarh, to be funded through Rs 600 crores debt and Rs 300 crores equity. Additionally, the company approved setting up a Battery Energy Storage System Plant with 10 GWh capacity through subsidiary Godawari New Energy Pvt Ltd at Rs 700 crores cost. The Board also approved Rs 7.94 crores investment in Godawari Education and Research Foundation and re-appointed Bajrang Lal Agrawal as Chairman-cum Managing Director for five years. The 26th Annual General Meeting is scheduled for September 20, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754397240783,
            "Source": "corporate_action"
        },
        {
            "Title": "Godawari Power and Ispat Approves Quarterly Results and Major Expansion Plans Worth Rs 1,600 Crores",
            "Summary": "Godawari Power and Ispat Limited's Board approved quarterly results for the quarter ended June 30, 2025, showing standalone net profit of Rs 200.50 crores and consolidated net profit of Rs 216.41 crores. The company approved a scheme of amalgamation with wholly-owned subsidiary Godawari Energy Limited. Major expansion plans include setting up a 0.7 MTPA Cold Rolling Mill project at an estimated cost of Rs 900 crores in Chhattisgarh, to be funded through Rs 600 crores debt and Rs 300 crores equity. The Board also approved establishing a Battery Energy Storage System Plant with 10 GWh capacity through subsidiary Godawari New Energy Pvt Ltd at Rs 700 crores cost. Additionally, the company approved Rs 7.94 crores investment in Godawari Education and Research Foundation and re-appointment of Bajrang Lal Agrawal as Chairman-cum Managing Director for 5 years. The 26th Annual General Meeting is scheduled for September 20, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754394435400,
            "Source": "earnings"
        },
        {
            "Title": "Godawari Power & Ispat Schedules Board Meeting for August 5, 2025 to Approve Quarterly Financial Results",
            "Summary": "Godawari Power & Ispat Limited has scheduled a Board of Directors meeting on August 5, 2025, to consider and approve the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company notified stock exchanges BSE and NSE about the board meeting through a formal notice dated July 21, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753101867828,
            "Source": "corporate_action"
        },
        {
            "Title": "Godawari Power And Ispat Receives Environmental Approval for New Steel Plant",
            "Summary": "Godawari Power And Ispat has obtained environmental approval for a new steel plant to be constructed in Chhattisgarh. This development suggests an expansion of the company's operations in the steel sector.",
            "Sentiment": "positive",
            "PublishDate": 1752670673000,
            "Source": "default"
        },
        {
            "Title": "Godawari Power Gains Approval for Steel Billet Production",
            "Summary": "Godawari Power has received approval from Power Grid Corporation of India to produce steel billets for galvanized fabricated steel structures.",
            "Sentiment": "positive",
            "PublishDate": 1751522582000,
            "Source": "default"
        },
        {
            "Title": "Godawari Power and Ispat Resumes Mining at Boria Tibu Iron Ore Mines",
            "Summary": "Godawari Power and Ispat has resumed mining operations at its Boria Tibu Iron Ore Mines. The company has received approval for an updated mining plan that extends until 2030.",
            "Sentiment": "positive",
            "PublishDate": 1748324399000,
            "Source": "default"
        }
    ]
}