{
    "Symbol": "GPPL",
    "ISIN": "INE517F01014",
    "News": [
        {
            "Title": "Gujarat Pipavav Port Q3FY26 Net Profit Jumps 24.1%",
            "Summary": "Gujarat Pipavav Port reported strong Q3FY26 results with net profit rising 24.1% YoY to ₹3,603.47 million for nine months. Revenue from operations grew 14.4% to ₹8,420.52 million despite quarterly challenges.",
            "Sentiment": "positive",
            "PublishDate": 1770726374768,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gujarat Pipavav Port schedules Q3FY26 results meet",
            "Summary": "Gujarat Pipavav Port Limited has scheduled its board meeting for February 10, 2026 to consider Q3FY26 financial results, with analyst call on February 11, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770012612034,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gujarat Pipavav Port Director Rajkumar Beniwal Resigns",
            "Summary": "Rajkumar Beniwal, IAS, resigned from Gujarat Pipavav Port's Board effective December 29, 2025, following his relief from Vice Chairman position at Gujarat Maritime Board.",
            "Sentiment": "neutral",
            "PublishDate": 1768847113672,
            "Source": "stocks"
        },
        {
            "Title": "Gujarat Pipavav Port Q3: Mixed cargo performance",
            "Summary": "Gujarat Pipavav Port reports 1.7% decline in container volumes to 174,000 TEUs in Q3 FY26, while dry bulk cargo surged 20.8% to 0.87 million tonnes. Company signed ₹17,000 crore investment MoU.",
            "Sentiment": "neutral",
            "PublishDate": 1767859024662,
            "Source": "stocks"
        },
        {
            "Title": "Gujarat Pipavav Port Reports Q3 FY26 Cargo Volumes",
            "Summary": "Gujarat Pipavav Port handled 174K TEUs containers, 0.87M MT dry bulk, and 0.40M MT liquid cargo in Q3 FY26. Year-to-date container handling reached 502K TEUs.",
            "Sentiment": "neutral",
            "PublishDate": 1767855236343,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gujarat Pipavav Port Signs MoU with NYK India to Enhance RoRo Infrastructure for Vehicle Exports",
            "Summary": "Gujarat Pipavav Port Limited signed a non-binding Memorandum of Understanding with NYK India Private Limited to develop specialized RoRo infrastructure capable of handling 500,000 cars annually. The strategic partnership focuses on enhancing facilities for India's growing vehicle exports and automotive logistics, including Electric Vehicles, while reducing dwell time and enabling seamless vessel-rail synchronization.",
            "Sentiment": "positive",
            "PublishDate": 1764746045789,
            "Source": "order&deals"
        },
        {
            "Title": "Gujarat Pipavav Port Raises EBIT Growth Forecast to 12-15% Amid Mixed Cargo Segment Outlook",
            "Summary": "Gujarat Pipavav Port has revised its EBIT growth forecast upward from 5-7% to 12-15%. The company projects end-year container growth to decline between -2% to 0%, while EBITDA margins are anticipated at 58-59%. Across different cargo segments, dry bulk is expected to grow by 30-40%, RORO growth is projected at 20-25% with 20% growth over the next three years, liquids growth around 10%, while containers are expected to remain steady.",
            "Sentiment": "positive",
            "PublishDate": 1762484545240,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Pipavav Port Reports 73% Jump in Net Profit to 1.58 Billion Rupees",
            "Summary": "Gujarat Pipavav Port reported net profit of 1.58 billion rupees compared to 915 million rupees in the same quarter last year, marking a 73% increase. Revenue grew to 2.99 billion rupees from 2.27 billion rupees year-over-year. EBITDA rose to 1.78 billion rupees from 1.33 billion rupees, while EBITDA margin improved to 59.41% from 58.39% in the corresponding period.",
            "Sentiment": "positive",
            "PublishDate": 1762330921195,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Pipavav Port Reports Strong Q2 Results, Declares Rs 5.40 Per Share Interim Dividend",
            "Summary": "Gujarat Pipavav Port Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The Board approved an interim dividend of Rs 5.40 per share for financial year 2025-26, with November 12, 2025 as the record date and payment expected by November 25, 2025. The company operates port services at Pipavav and has received unmodified limited review reports from auditors for both standalone and consolidated accounts. The company continues to face ongoing disputes with Gujarat Maritime Board regarding bank guarantee encashment of INR 185.35 million and additional demands totaling INR 370.95 million, with dispute resolution proceedings currently in progress. The company also has a pending arbitration matter with a customer involving an estimated amount of INR 671.64 million including interest costs.",
            "Sentiment": "neutral",
            "PublishDate": 1762328929361,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Pipavav Port Signs ₹17,000 Crore Investment MOU With Gujarat Maritime Board",
            "Summary": "Gujarat Pipavav Port has signed a Memorandum of Understanding with the Gujarat Maritime Board for future investments worth ₹17,000 crore. The agreement establishes a framework for significant capital deployment in port infrastructure and operations.",
            "Sentiment": "positive",
            "PublishDate": 1761718404968,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Pipavav Port Reports 10.68% Decline in Container Train Handling",
            "Summary": "Gujarat Pipavav Port experienced a 10.68% year-over-year decrease in container trains handled during its quarterly results. The port's container train operations showed reduced activity compared to the same period in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1760018040379,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Pipavav Port Secures 5-Year ONGC Contract for Port and Storage Facilities",
            "Summary": "Gujarat Pipavav Port Limited has been awarded a contract by ONGC for hiring port and storage facilities at Pipavav Port for a five-year period starting October 1, 2025. The company will provide marine support and storage facilities for ONGC's offshore supply base at the port. The notification letter will be translated into a formal agreement between the two companies.",
            "Sentiment": "positive",
            "PublishDate": 1758720169275,
            "Source": "order&deals"
        },
        {
            "Title": "Gujarat Pipavav Port Concludes 33rd AGM with Dividend Declaration and Key Appointments",
            "Summary": "Gujarat Pipavav Port Limited held its 33rd Annual General Meeting on September 4, 2025, with 42 shareholders attending via video conferencing, representing 44.01% of the company's capital. The meeting approved several resolutions including adoption of audited financial statements for the year ended March 31, 2025, declaration of final dividend of Rs. 4.20 per equity share and approval of interim dividend of Rs. 4.00 per equity share already paid. Key appointments were approved including re-appointment of directors Jonathan Richard Goldner and Steven Deloor who retired by rotation. The company appointed M/s M S K A & Associates as new statutory auditors replacing Price Waterhouse Chartered Accountants LLP, and M/s Rathi & Associates as secretarial auditors for a five-year term from April 2025 to March 2030. Shareholders also approved material related party transactions with Maersk A/S for the period April 2026 to September 2028, and re-appointment of Samir Chaturvedi as Independent Director for a second five-year term from November 2025 to November 2030.",
            "Sentiment": "positive",
            "PublishDate": 1757042486959,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Pipavav Port Sets Record Date for Rs 4.20 Final Dividend, Reports Q1 Results",
            "Summary": "Gujarat Pipavav Port Limited has set August 28, 2025 as the record date for determining shareholders eligible for a final dividend of Rs 4.20 per share for the financial year ended March 31, 2025, subject to approval at the Annual General Meeting on September 4, 2025. The company reported its unaudited financial results for the quarter ended June 30, 2025, which were approved by the board on August 13, 2025. The results include unmodified limited review reports from statutory auditors for both standalone and consolidated accounts.",
            "Sentiment": "neutral",
            "PublishDate": 1755069840448,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Pipavav Port Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "Gujarat Pipavav Port announced its Q1 financial results showing revenue of 2.5 billion rupees compared to 2.46 billion rupees in the same period last year. The company's net profit decreased to 1 billion rupees from 1.05 billion rupees year-over-year. EBITDA declined to 1.48 billion rupees from 1.5 billion rupees, while EBITDA margin compressed to 59.15% from 60.79% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1755068828251,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Pipavav Port Appoints New Auditors and Re-appoints Independent Director",
            "Summary": "Gujarat Pipavav Port Limited's Board of Directors has approved two key appointments subject to shareholder approval at the Annual General Meeting scheduled for September 4, 2025. The company will appoint M S K A & Associates as Statutory Auditors for a five-year term, replacing Price Waterhouse Chartered Accountants LLP. Additionally, Mr. Samir Chaturvedi will be re-appointed as Independent Director for a second five-year term from November 12, 2025 to November 11, 2030.",
            "Sentiment": "neutral",
            "PublishDate": 1753160350418,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gujarat Pipavav Port: Q1 Container Volume Flat, Dry Bulk Stable",
            "Summary": "Gujarat Pipavav Port handled 1.64 lakh TEUs of container cargo in Q1, down 0.6% YoY. Dry bulk cargo remained flat at 0.55 million tonnes, while liquid cargo volume increased. Container train volume declined slightly to 447, with containers handled on train reducing to 99,000 TEUs from 1.02 lakh TEUs last year.",
            "Sentiment": "neutral",
            "PublishDate": 1751983765000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Pipavav Port Reports Handling 164,000 TEUs in Q1 FY 2026",
            "Summary": "Gujarat Pipavav Port has reported stable operations for the first quarter of fiscal year 2026. The port handled 164,000 Twenty-Foot Equivalent Units (TEUs) during this period. This information suggests continued activity and performance at the port facility.",
            "Sentiment": "neutral",
            "PublishDate": 1751983321000,
            "Source": "default"
        },
        {
            "Title": "Gujarat Pipavav Port: Q1 FY26 Update Shows Mixed Performance",
            "Summary": "Gujarat Pipavav Port's Q1 FY26 update reveals flat container volumes at 164,000 TEUs, 11% YoY increase in Ro-Ro traffic to 42,000 units, and growth in liquid cargo to 0.41 million metric tonnes. Dry bulk volumes remained steady at 0.55 million metric tonnes. Rail container traffic decreased to 99,000 TEUs with 447 trains handled.",
            "Sentiment": "neutral",
            "PublishDate": 1751983101000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Pipavav Port Reports Q4 Results and Dividend",
            "Summary": "Gujarat Pipavav Port announced its Q4 results. The company's net profit increased to 1.1 billion rupees, up from 699.4 million rupees year-over-year and 940 million rupees quarter-over-quarter. Revenue for Q4 was 2.5 billion rupees, slightly down from 2.51 billion rupees in the same quarter last year. The company has recommended a dividend of 4.20 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748559777000,
            "Source": "default"
        },
        {
            "Title": "Gujarat Pipavav Port Ltd: Q4 Net Profit Surges 70.7% Despite Flat Revenue",
            "Summary": "Gujarat Pipavav Port Ltd reported a 70.7% YoY increase in Q4 net profit to ₹112.3 crore, with revenue marginally up by 0.2% to ₹251.7 crore. EBITDA slightly declined by 0.4% to ₹156.6 crore. The board recommended a final dividend of ₹4.20 per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748529557000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Pipavav Port Reports Q4 Results and Dividend Recommendation",
            "Summary": "Gujarat Pipavav Port has announced its quarterly results and dividend recommendation. The company's Q4 EBITDA was 1.6 billion rupees, compared to 1.57 billion rupees year-over-year. The EBITDA margin for Q4 was 62.23%, down from 62.59% in the previous year. Net profit for Q4 stood at 1.1 billion rupees, up from 699.4 million rupees year-over-year and 940 million rupees quarter-on-quarter. Q4 revenue was reported at 2.5 billion rupees, slightly down from 2.51 billion rupees year-over-year. The company has recommended a dividend of 4.20 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748528322000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Pipavav Port Reports Decline in Q4 Container Volume",
            "Summary": "Gujarat Pipavav Port handled 172,000 TEUs (Twenty-foot Equivalent Units) in the fourth quarter, compared to 188,000 TEUs in the same period last year, representing a year-over-year decrease in container volume.",
            "Sentiment": "negative",
            "PublishDate": 1744097868000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Pipavav Port Reports Q3 Financial Results",
            "Summary": "Gujarat Pipavav Port has announced its financial results for the third quarter. The company reported a net profit of 940 million rupees, down from 1.1 billion rupees in the same quarter last year. Revenue for Q3 stood at 2.63 billion rupees, slightly lower than the 2.69 billion rupees reported in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1739492305000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Pipavav Port Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Gujarat Pipavav Port has reported its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 1.39 billion rupees from 1.59 billion rupees in the same quarter last year. Additionally, the EBITDA margin declined to 52.80% from 59.05% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739443809000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Pipavav Port Reports Decline in Q3 Profit and Revenue",
            "Summary": "Gujarat Pipavav Port has reported its financial results for the third quarter. The company's net profit decreased to 940 million rupees from 1.1 billion rupees in the same period last year. Revenue also saw a slight decline, falling to 2.63 billion rupees from 2.69 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739443805000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Pipavav Port Reports 12.81% Decline in Q3 FY25 Container Handling",
            "Summary": "Gujarat Pipavav Port handled 177,000 TEUs (Twenty-foot Equivalent Units) in the third quarter of fiscal year 2025, representing a 12.81% decrease compared to the same period in the previous fiscal year when it handled 203,000 TEUs.",
            "Sentiment": "negative",
            "PublishDate": 1735888244000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Pipavav Port Reports Q2 Financial Results",
            "Summary": "Gujarat Pipavav Port has released its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is 1.3 billion rupees, compared to 1.5 billion rupees in the same quarter last year, showing a year-over-year decrease. The EBITDA margin for Q2 is 58.37%, down from 59.66% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1730873414000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Pipavav Port Reports Q2 Revenue Decline",
            "Summary": "Gujarat Pipavav Port has reported its second-quarter revenue for the current fiscal year. The company's revenue stood at 2.3 billion rupees, showing a decrease from 2.53 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1730873375000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Pipavav Port Reports Decline in Q2 Net Profit",
            "Summary": "Gujarat Pipavav Port has reported a net profit of 915 million rupees for the second quarter, down from 1.1 billion rupees in the same period last year. This represents a year-over-year decrease in profitability for the port operator.",
            "Sentiment": "negative",
            "PublishDate": 1730873353000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Pipavav Port: Container Volumes Drop 17% in Q2FY25",
            "Summary": "<p>Gujarat Pipavav Port reported a <span class='negative'>17% YoY decline</span> in container volume to 179,000 TEUs in Q2FY25. <b>Dry bulk cargo</b> <span class='negative'>fell 40.2% YoY</span> to 0.46 MMT, while <b>liquid cargo</b> <span class='positive'>increased 6.4% YoY</span> to 0.33 MMT. <b>Ro-Ro cargo</b> volume <span class='positive'>rose</span> to 33,000 units from 19,000 units last year. The company's shares <span class='negative'>dropped over 5%</span> following the announcement.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728287618000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Pipavav Port Reports Decrease in Container Volume",
            "Summary": "<p>Gujarat Pipavav Port's <span class='neutral'>container volume</span> transported by trains <span class='negative'>decreased</span> to <b>118,000 TEUs</b> in Q2 FY25, <span class='negative'>down from</span> <b>145,000 TEUs</b> in Q2 FY24.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728282766000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Pipavav Port Reports Decline in Container Handling",
            "Summary": "<p>Gujarat Pipavav Port experienced a <span class='negative'>significant decrease</span> in container handling during Q2 FY25. The port handled <b>179,000 TEUs</b> (Twenty-foot Equivalent Units) in this quarter, marking a <span class='negative'>17% decline</span> compared to the same period in the previous fiscal year (Q2 FY24), when it handled <b>216,000 TEUs</b>.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728282612000,
            "Source": "result"
        }
    ]
}