{
    "Symbol": "GRANULES",
    "ISIN": "INE101D01020",
    "News": [
        {
            "Title": "Granules India Reports Strong Q3 FY26 Results",
            "Summary": "Granules India delivered robust Q3 FY26 performance with consolidated revenue of ₹13,879.40 million and net profit of ₹1,502.11 million, showing strong growth despite USFDA challenges at Gagillapur facility.",
            "Sentiment": "positive",
            "PublishDate": 1769169693673,
            "Source": "co_actions_results"
        },
        {
            "Title": "Granules India Q3 FY26 Earnings Call Set for Jan 23",
            "Summary": "Granules India Limited has scheduled its Q3 FY26 earnings conference call for January 23, 2026 at 6:00 PM IST to discuss financial performance and business updates with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1767848121868,
            "Source": "co_actions_results"
        },
        {
            "Title": "Granules India Gets FDA Approval for ADHD Drug",
            "Summary": "Granules India's US subsidiary receives FDA tentative approval with 180-day exclusivity for generic Amphetamine Extended-Release Tablets targeting $41 million ADHD market, while shares remain flat.",
            "Sentiment": "positive",
            "PublishDate": 1767842320379,
            "Source": "stocks"
        },
        {
            "Title": "Granules India EGM Set for Jan 22 to Approve Fundraising",
            "Summary": "Granules India schedules EGM for January 22, 2026 to approve ₹1,762.50 cr fundraising through convertible warrants and equity shares. Remote e-voting from Jan 19-21, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1766466664593,
            "Source": "co_actions_results"
        },
        {
            "Title": "Granules Gets FDA Nod for Generic ADHD Drug with Exclusivity",
            "Summary": "Granules Pharmaceuticals receives FDA tentative approval with 180-day exclusivity for generic Amphetamine Extended-Release tablets, targeting USD 41 million ADHD market, marking second approval in weeks.",
            "Sentiment": "positive",
            "PublishDate": 1766370076724,
            "Source": "stocks"
        },
        {
            "Title": "Granules Life Sciences Completes FDA Inspection",
            "Summary": "Granules Life Sciences concluded FDA inspection with only five procedural observations, with no concerns raised regarding data integrity or product safety standards.",
            "Sentiment": "positive",
            "PublishDate": 1766154471084,
            "Source": "stocks"
        },
        {
            "Title": "Granules India Board Meet on Dec 23 for Fundraising",
            "Summary": "Granules India has scheduled a board meeting for December 23, 2025, to discuss fundraising through preferential issue and determine the issue price for the proposed capital raising initiative.",
            "Sentiment": "neutral",
            "PublishDate": 1766037233184,
            "Source": "co_actions_results"
        },
        {
            "Title": "Granules India Gets US FDA EIR for Life Sciences Unit",
            "Summary": "Granules India announced that its subsidiary Granules Life Sciences has received an Establishment Inspection Report (EIR) from the US FDA following inspection conducted from July 28 to August 1.",
            "Sentiment": "positive",
            "PublishDate": 1765533081681,
            "Source": "stocks"
        },
        {
            "Title": "Granules India Achieves Highest A Rating in CDP Climate",
            "Summary": "Granules India Limited receives A rating in Climate Change from Carbon Disclosure Project 2025, marking two-level improvement from previous B rating. Company also achieves B rating in Water Security.",
            "Sentiment": "positive",
            "PublishDate": 1765520313343,
            "Source": "stocks"
        },
        {
            "Title": "Granules India's US Packaging Facility Passes FDA Inspection with Zero Observations",
            "Summary": "Granules Consumer Health, LLC, a US subsidiary of Granules India Limited, successfully completed an FDA GMP inspection with zero observations at its packaging and distribution facility that processes controlled substances and OTC products. This marks the facility's second FDA inspection following a March 2023 audit that resulted in a No Action Indicated classification, reinforcing the company's regulatory compliance standards.",
            "Sentiment": "positive",
            "PublishDate": 1764831119525,
            "Source": "stock"
        },
        {
            "Title": "Granules India Inaugurates Two Research Centers at IIT Hyderabad for Peptide and Particle Engineering Development",
            "Summary": "Granules India has inaugurated two new research centers at IIT Hyderabad focused on peptide development and particle engineering. The initiative aims to enhance the company's research and development capabilities in pharmaceutical manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1764572190754,
            "Source": "stock"
        },
        {
            "Title": "Granules India Expands North American Operations with New Canadian Subsidiary",
            "Summary": "Granules Pharmaceuticals, Inc., a wholly-owned foreign subsidiary of Granules India Limited, has incorporated Granules Pharmaceuticals Canada, Inc. as a 100% owned subsidiary in Canada on November 26, 2025. The newly incorporated pharmaceutical company has not yet commenced business operations, representing Granules India's strategic expansion into the Canadian market through its existing U.S. subsidiary structure.",
            "Sentiment": "positive",
            "PublishDate": 1764224510589,
            "Source": "corporate_action"
        },
        {
            "Title": "Granules India Reports 34% Revenue Growth in Q2 FY26, FDA Meeting Scheduled for January 2026",
            "Summary": "Granules India achieved quarterly revenues of Rs. 12,970 million with 34% year-on-year growth and 65.7% gross margin, driven by formulations business in North America and Europe. The company secured FDA meeting for January 2026 regarding Gagillapur facility remediation and received first FDA approval for its Genome Valley facility, while Ascelis Peptides reported Rs. 200 million EBITDA loss.",
            "Sentiment": "positive",
            "PublishDate": 1763532093740,
            "Source": "earnings"
        },
        {
            "Title": "Granules India Reports 34% Revenue Growth in Q2FY26 with Strong Performance in North America and Europe",
            "Summary": "Granules India achieved revenue of ₹12,970 Mn in Q2FY26, marking 34% year-over-year growth driven by formulations business in North America and Europe, with EBITDA rising 37% to ₹2,782 Mn despite ₹200 Mn loss from Ascelis Peptides. The pharmaceutical company received 91 US FDA approvals to date, filed 3 ANDAs during the quarter, and maintained strong cash flow from operations at ₹1,937 Mn while investing ₹2,112 Mn in capex for expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1763063365257,
            "Source": "earnings"
        },
        {
            "Title": "Granules India Appoints New CHRO as Atul Dhavle Resigns",
            "Summary": "Granules India Limited announced leadership changes in its senior management. Vinodkumar Parur has been appointed as Chief Human Resources Officer (CHRO) effective November 17, 2025, and designated as Senior Management Personnel. Parur brings over 24 years of HR leadership experience across manufacturing, engineering, pharmaceuticals and infrastructure sectors, with previous senior roles at RR Kabel Limited and Nilkamal Limited. He holds a master's degree in management studies from PIMSR, Mumbai University. Meanwhile, Atul Dhavle will cease to be Senior Management Personnel effective November 16, 2025, following his resignation from the CHRO position to explore other opportunities. Dhavle will serve a notice period for transition purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1763029037308,
            "Source": "corporate_governance"
        },
        {
            "Title": "Granules India Reports 34% Jump in Q2 Net Profit to 1.3 Billion Rupees",
            "Summary": "Granules India reported consolidated net profit of 1.3 billion rupees for Q2, representing a significant increase from 972 million rupees in the same period last year. The company's EBITDA rose to 2.78 billion rupees compared to 2.03 billion rupees year-over-year. EBITDA margin improved to 21.45% from 21.04% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1763021259907,
            "Source": "earnings"
        },
        {
            "Title": "Granules India Receives First U.S. FDA Approval for Hyderabad Facility",
            "Summary": "Granules India has received its first U.S. FDA approval for its Hyderabad facility, marking progress in enhanced finished dosage production. The company expects to launch in the U.S. market soon following this regulatory milestone.",
            "Sentiment": "positive",
            "PublishDate": 1762840087119,
            "Source": "stock"
        },
        {
            "Title": "Granules India's US Subsidiary Receives FDA Inspection Report with Resolved Observation",
            "Summary": "The US FDA issued an Establishment Inspection Report to Granules Pharmaceuticals, Inc., a wholly-owned foreign subsidiary of Granules India Limited located in Chantilly, Virginia, USA. The inspection was a Pre-Approval Inspection conducted in June 2025 for a first-to-file controlled substance ANDA. The inspection resulted in one observation, which has been resolved.",
            "Sentiment": "neutral",
            "PublishDate": 1762315969956,
            "Source": "stock"
        },
        {
            "Title": "Granules India's Bonthapally API Unit Receives US FDA EIR with VAI Classification",
            "Summary": "Granules India's Bonthapally API manufacturing unit has received an Establishment Inspection Report (EIR) from the US FDA with a 'Voluntary Action Indicated' (VAI) classification. The company has addressed one observation noted during the inspection.",
            "Sentiment": "positive",
            "PublishDate": 1761721998285,
            "Source": "stock"
        },
        {
            "Title": "Granules India Stock Recovers 5% Despite Profit Decline on Strong Pipeline Prospects",
            "Summary": "Granules India's stock recovered 5% since August 11 despite reporting lower profits and margins in the June quarter, reducing its one-month loss to around 7%. The company's net profit dropped 16% to ₹112.6 crore while revenue grew 3% to ₹1,210.1 crore, including ₹29.1 crore from recently acquired Senn Chemicals. EBITDA margin declined to 20.4% from 22% due to higher manpower costs from the acquisition. Investor optimism stems from six products awaiting approval in Europe and the company's guidance for better growth in FY27. Granules acquired Switzerland-based Senn Chemicals for ₹450 crore and plans additional investments of ₹100 crore in the facility and ₹20-30 crore for R&D in FY26. The Gagillapur facility is in final stages of US FDA remediation and received EU GMP certificate from Denmark in July 2025. Motilal Oswal reduced earnings estimates by 5% and 2% for FY26 and FY27 due to delayed approvals and supply backlogs.",
            "Sentiment": "neutral",
            "PublishDate": 1755828522652,
            "Source": "stock"
        },
        {
            "Title": "Granules India Reports 3% Revenue Growth in Q1 FY26, Expects Strong Growth from FY27",
            "Summary": "Granules India achieved revenue of Rs. 12,101 million in Q1 FY26, marking a 3% year-over-year increase. The company's gross margin improved significantly to 64.9%, up 593 basis points year-over-year, while EBITDA margin declined to 20.4%. Net debt increased to Rs. 9,480 million following the Senn Chemicals acquisition, which enables entry into peptides and CDMO business. The company is in final stages of FDA remediation at its Gagillapur facility with re-audit expected by December. The new Genome Valley formulations facility cleared its first FDA pre-approval inspection and adds 10 billion doses capacity. Management expects FY27 to be a strong growth year, starting from the last quarter of FY26, driven by Genome Valley ramp-up, US operations growth, and Europe expansion. The company is focusing on ADHD and oncology as key therapeutic areas and expects the peptides business to match parent company return metrics within 12-18 months.",
            "Sentiment": "positive",
            "PublishDate": 1755596702570,
            "Source": "earnings"
        },
        {
            "Title": "Granules India Reports ₹2,806 Million Operating Cash Flow, Completes USFDA Audits",
            "Summary": "Granules India achieved strong operating cash flow of ₹2,806 million in the latest quarter. The company made progress on Gagillapur remediation efforts. USFDA audits were successfully completed at three facilities: Bonthapally API facility, GPI in Virginia, and Granules Life Sciences, with only minor observations noted across these locations.",
            "Sentiment": "positive",
            "PublishDate": 1754985313560,
            "Source": "stock"
        },
        {
            "Title": "Granules India Reports Decline in Q1 Profitability Metrics",
            "Summary": "Granules India reported Q1 EBITDA of 2.47 billion rupees, down from 2.59 billion rupees in the same period last year. The company's EBITDA margin decreased to 20.4% from 21.97% year-over-year. Consolidated net profit fell to 1.1 billion rupees compared to 1.35 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754983672315,
            "Source": "earnings"
        },
        {
            "Title": "Granules India Receives One Procedural Observation Following FDA Pre-approval Inspection",
            "Summary": "Granules India announced that the US FDA has completed a pre-approval inspection at one of its facilities. The inspection resulted in one procedural 483 observation from the FDA. A 483 observation is a notice issued by the FDA to document conditions that may constitute violations of regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1754266096215,
            "Source": "stock"
        },
        {
            "Title": "Granules India Receives One Procedural Observation from US FDA Pre-Approval Inspection",
            "Summary": "Granules India announced that the US FDA has completed a pre-approval inspection at one of the company's facilities. The inspection resulted in one procedural observation being issued to the company.",
            "Sentiment": "neutral",
            "PublishDate": 1754047633746,
            "Source": "stock"
        },
        {
            "Title": "Granules India Schedules Q1 FY26 Earnings Call for August 12",
            "Summary": "Granules India has scheduled its Q1 FY26 earnings call for August 12 at 4 PM. The call will provide insights into the company's quarterly financial performance and business updates.",
            "Sentiment": "neutral",
            "PublishDate": 1753077674514,
            "Source": "earnings"
        },
        {
            "Title": "Granules India: FDA Recall of Blood Pressure Medication in US",
            "Summary": "Granules India is recalling 33,024 bottles of Metoprolol Succinate extended-release tablets in the US due to failed dissolution specifications. The nationwide Class II recall was initiated on June 24 for the India-produced lot.",
            "Sentiment": "negative",
            "PublishDate": 1752053285000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Granules India Unit Completes FDA Inspection with One Resolved Observation",
            "Summary": "A unit of Granules India has completed a pre-approval inspection by the U.S. Food and Drug Administration (FDA). The inspection resulted in one 483 observation, which has been resolved. No further details about the specific unit, location, or nature of the observation were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751241469000,
            "Source": "default"
        },
        {
            "Title": "Granules India's Unit Passes US FDA Inspection with One Observation",
            "Summary": "Granules India announced that one of its units successfully completed a pre-approval inspection by the US Food and Drug Administration (FDA). The inspection resulted in one 483 observation, which has been resolved. This suggests a positive outcome for the company's manufacturing facility in terms of regulatory compliance.",
            "Sentiment": "positive",
            "PublishDate": 1751106592000,
            "Source": "default"
        },
        {
            "Title": "Granules India: US FDA Issues Observation at Telangana API Facility",
            "Summary": "Granules India's API Unit-1 facility in Bonthapally, Telangana, received an observation from the US FDA under Form 483 following an inspection. The company will respond within the stipulated time. This facility is Granules' largest API manufacturing site for paracetamol, also producing Metformin and Guaifenesin APIs.",
            "Sentiment": "negative",
            "PublishDate": 1750650190000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Granules India Completes USFDA Inspection with One Observation",
            "Summary": "Granules India has successfully completed a United States Food and Drug Administration (USFDA) inspection at its API Unit-I facility located in Bonthapally, Telangana. The inspection concluded with one Form 483 observation.",
            "Sentiment": "neutral",
            "PublishDate": 1750636751000,
            "Source": "default"
        },
        {
            "Title": "Granules India: FDA Inspection Concludes with One Observation",
            "Summary": "Granules India's API Unit-I facility in Bonthapally, Telangana completed a US FDA inspection from June 16-20, 2025, resulting in one Form 483 observation. The company will respond within the stipulated time. This facility is one of the world's largest single-location Paracetamol API manufacturing plants.",
            "Sentiment": "neutral",
            "PublishDate": 1750422436000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Granules India Completes USFDA Inspection at API Facility",
            "Summary": "Granules India has successfully completed a United States Food and Drug Administration (USFDA) inspection at its API Unit-I facility located in Bonthapally, Telangana. The inspection resulted in one Form 483 observation.",
            "Sentiment": "positive",
            "PublishDate": 1750417585000,
            "Source": "default"
        },
        {
            "Title": "Granules India: Gagillapur Facility to Resume Normal Operations by Q3",
            "Summary": "Granules India expects to resume normal operations at its Gagillapur facility by Q3 FY2025-26, following ongoing remediation efforts. The company plans to request FDA re-inspection around August. Despite current issues, production is gradually ramping up, and recent US product launches and the new GLS facility are helping offset shortfalls.",
            "Sentiment": "positive",
            "PublishDate": 1748565972000,
            "Source": "normal_news"
        },
        {
            "Title": "Granules India Reports Q4 and FY25 Financial Performance",
            "Summary": "Granules India has reported its financial performance for Q4 and FY25. The company achieved an EBITDA margin of 21% for FY25, which is within their guidance range of 20-22%. Additionally, Granules India's revenue share from North America increased to 79% in Q4FY25, compared to 70% in Q4FY24.",
            "Sentiment": "positive",
            "PublishDate": 1748420707000,
            "Source": "default"
        },
        {
            "Title": "Granules India: Q4 Results Show Flat Sales, Narrowing Margins",
            "Summary": "Granules India reported Q4 results with revenue up 1.8% YoY to ₹1,197.5 crore. EBITDA declined 1.4% YoY to ₹252 crore, with margins narrowing to 21.1%. Net profit increased 18% YoY to ₹152 crore. The company's Gagillapur facility received a USFDA warning letter in February.",
            "Sentiment": "neutral",
            "PublishDate": 1748420199000,
            "Source": "earnings"
        },
        {
            "Title": "Granules India Reports Q4 Financial Results and Dividend Declaration",
            "Summary": "Granules India has released its Q4 financial results. The company reported revenue of 12 billion rupees, up from 11.8 billion rupees year-over-year. EBITDA was 2.52 billion rupees, slightly down from 2.56 billion rupees in the previous year. The EBITDA margin decreased to 21.07% from 21.75% year-over-year. Consolidated net profit increased to 1.52 billion rupees from 1.3 billion rupees in the same period last year. Additionally, the company has declared a dividend of 1.5 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1748418870000,
            "Source": "result"
        },
        {
            "Title": "Granules India Completes Acquisition of Senn Chemicals",
            "Summary": "Granules India has announced the successful closing of its acquisition of Senn Chemicals. This strategic move strengthens Granules' capabilities in peptide therapeutics and CDMO (Contract Development and Manufacturing Organization) services. The acquisition marks Granules' entry into the CDMO space, expanding its service offerings and market presence.",
            "Sentiment": "positive",
            "PublishDate": 1744329930000,
            "Source": "corporate_action"
        },
        {
            "Title": "Granules India Approves Internal Restructuring of US Subsidiaries",
            "Summary": "Granules India's board has approved an internal restructuring plan for its US subsidiaries. The company has stated that this restructuring will not result in any changes to the ultimate ownership or the nature of its business operations in the United States.",
            "Sentiment": "neutral",
            "PublishDate": 1742947866000,
            "Source": "corporate_action"
        },
        {
            "Title": "Granules India: Board Approves US Subsidiary Restructuring Plan",
            "Summary": "Granules India's board approved an internal restructuring plan for its US subsidiaries. Granules USA, Inc. will transfer its business and assets to Granules Pharmaceutical, Inc. The plan aims to simplify organizational structure, reduce legal entities, and improve market focus. The company also appointed PN Baskaran as President – Head of API Manufacturing and Operations, effective April 2, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1742918370000,
            "Source": "corporate_action"
        },
        {
            "Title": "Granules India Approves Internal Restructuring of US Subsidiaries",
            "Summary": "Granules India's board has approved an internal restructuring plan for its US subsidiaries. The company emphasized that this restructuring will not result in any changes to the ultimate ownership or the nature of its business operations in the United States.",
            "Sentiment": "neutral",
            "PublishDate": 1742906839000,
            "Source": "corporate_action"
        },
        {
            "Title": "Granules Europe Voluntarily Dissolved",
            "Summary": "Granules India Limited has announced that its subsidiary, Granules Europe, has been voluntarily dissolved. This corporate action suggests a strategic restructuring or streamlining of the company's European operations.",
            "Sentiment": "neutral",
            "PublishDate": 1742297600000,
            "Source": "corporate_action"
        },
        {
            "Title": "USFDA Cites Granules India for Storage and Equipment Lapses at Telangana Plant",
            "Summary": "The U.S. Food and Drug Administration (USFDA) has issued a rebuke to Granules India for deficiencies in maintaining storage facilities and equipment at their plant in Telangana. This regulatory action highlights potential quality control issues at the pharmaceutical manufacturing site, which could impact the company's operations and compliance status with U.S. drug regulations.",
            "Sentiment": "negative",
            "PublishDate": 1741578109000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Granules India: USFDA Issues Warning Letter for Manufacturing Violations",
            "Summary": "The USFDA has issued a warning letter to Granules India for significant CGMP violations at its Telangana formulations plant. Issues include inadequate equipment maintenance, facility contamination, and improper record-keeping. The company must respond with corrective actions within 15 working days or risk approval delays for new applications.",
            "Sentiment": "negative",
            "PublishDate": 1741505617000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Granules India: FDA Warning Letter Impacts Gagillapur Facility",
            "Summary": "Granules India shares fell 3% after USFDA made public a warning letter for its Gagillapur unit. The letter cites data integrity, quality, and contamination issues. The facility contributes 70% of company revenue, and pending product approvals may be delayed.",
            "Sentiment": "negative",
            "PublishDate": 1741151710000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Granules India: LIC Increases Stake to Over 5%",
            "Summary": "Life Insurance Corporation of India (LIC) has raised its stake in Granules India Ltd. to 5.02% by purchasing 17.83 lakh additional shares between January 1 and March 3. This increase from the previous 4.26% holding has led to a nearly 3% jump in Granules India's share price.",
            "Sentiment": "positive",
            "PublishDate": 1740994677000,
            "Source": "block_deals"
        },
        {
            "Title": "FDA Issues Warning Letter to Granules India's Gagillapur Facility",
            "Summary": "The US Food and Drug Administration (FDA) has issued a warning letter to Granules India regarding its Gagillapur facility. While the FDA has not indicated further escalation, the warning letter may impact the review of pending submissions. However, the manufacturing of existing products from the Gagillapur facility continues unaffected.",
            "Sentiment": "negative",
            "PublishDate": 1740702262000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Granules India: FDA Warning Letter for Gagillapur Facility",
            "Summary": "Granules India received a Warning Letter from the US FDA for its Gagillapur facility following an August 2024 inspection. The facility remains under Official Action Indicated status. This may impact new product approvals but doesn't affect existing product manufacturing. The company is implementing a comprehensive remediation plan and will respond within the stipulated timeframe.",
            "Sentiment": "negative",
            "PublishDate": 1740654211000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Granules India to Acquire Senn Chemicals AG for 1.93 Billion Rupees",
            "Summary": "Granules India has announced its plan to acquire a 100% equity stake in Senn Chemicals AG. The acquisition deal is valued at 1.93 billion rupees (approximately $23.2 million USD). This strategic move is likely aimed at expanding Granules India's chemical manufacturing capabilities and market presence.",
            "Sentiment": "positive",
            "PublishDate": 1740355730000,
            "Source": "corporate_action"
        },
        {
            "Title": "Granules India to Acquire Senn Chemicals AG for 1.93 Billion Rupees",
            "Summary": "Granules India has announced its plan to acquire a 100% equity stake in Senn Chemicals AG. The acquisition deal is valued at 1.93 billion rupees (approximately $23.2 million USD). This strategic move is likely aimed at expanding Granules India's chemical manufacturing capabilities and global presence.",
            "Sentiment": "positive",
            "PublishDate": 1740146978000,
            "Source": "corporate_action"
        }
    ]
}