{
    "Symbol": "GRAPHITE",
    "ISIN": "INE371A01025",
    "News": [
        {
            "Title": "Graphite India Board Meet Set for Feb 9, 2026",
            "Summary": "Graphite India Limited announces board meeting on February 9, 2026 to consider Q3FY26 unaudited financial results. Trading window to reopen February 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770053917083,
            "Source": "co_actions_results"
        },
        {
            "Title": "Graphite India gets ICRA AA+ rating reaffirmation",
            "Summary": "ICRA reaffirms Graphite India's long-term rating at AA+ with stable outlook for Rs. 1400 crore credit facilities and Rs. 300 crore commercial paper programme.",
            "Sentiment": "positive",
            "PublishDate": 1769782318551,
            "Source": "stocks"
        },
        {
            "Title": "Graphite India Invests ₹4,330 Cr in Battery Materials",
            "Summary": "Graphite India's board approves major ₹4,330 crore investment in synthetic graphite anode materials for lithium-ion batteries, marking strategic expansion into new revenue streams.",
            "Sentiment": "positive",
            "PublishDate": 1769583441582,
            "Source": "stocks"
        },
        {
            "Title": "Graphite India Partners with Kivoro for Graphene Tech",
            "Summary": "Graphite India announces strategic partnership with Kivoro to commercialize graphene-based heat transfer additives, expanding into advanced materials technology applications.",
            "Sentiment": "positive",
            "PublishDate": 1765375202588,
            "Source": "stocks"
        },
        {
            "Title": "Graphite India Partners With Kivoro for Graphene-Based Heat Transfer Additives",
            "Summary": "Graphite India has entered into a partnership with Kivoro to commercialize graphene-based heat transfer additives. The collaboration aims to bring advanced heat transfer technology to market through the combined expertise of both companies.",
            "Sentiment": "positive",
            "PublishDate": 1765322818248,
            "Source": "order&deals"
        },
        {
            "Title": "Graphite India Reports 84% Drop in Q2 Net Profit to Rs 76 Crores",
            "Summary": "Graphite India Limited reported a net profit of Rs 76 crores for the quarter ended September 30, 2025, representing an 84% decline from Rs 481 crores in the same quarter last year. Revenue from operations fell 17% to Rs 729 crores compared to Rs 875 crores in the previous year quarter. For the half-year period, net profit dropped 55% to Rs 206 crores from Rs 463 crores, while revenue declined 5% to Rs 1,394 crores. The company attributed inventory write-downs to falling electrode prices, with Rs 78 crores written down as of September 30, 2025. Basic earnings per share for the quarter stood at Rs 3.91 compared to Rs 24.69 in the previous year. The Board of Directors approved these results at their meeting held on November 10, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762774270810,
            "Source": "earnings"
        },
        {
            "Title": "Graphite India Faces Price Competition and High Raw Material Costs",
            "Summary": "Graphite India's Co-Chair reported that the company is experiencing ongoing price competition in the graphite electrodes market while dealing with elevated raw material costs.",
            "Sentiment": "negative",
            "PublishDate": 1762765847990,
            "Source": "stock"
        },
        {
            "Title": "Graphite India Q2 Net Profit Drops 60% Despite Revenue Growth",
            "Summary": "Graphite India reported Q2 consolidated net profit of 770 million rupees, down from 1.95 billion rupees in the same quarter last year. The company's EBITDA fell to 430 million rupees from 1.1 billion rupees year-over-year, with EBITDA margin declining to 5.9% from 17.11%. Revenue increased to 7.3 billion rupees compared to 6.4 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762762425464,
            "Source": "earnings"
        },
        {
            "Title": "Graphite India Acquires 6.82% Stake in GrafTech International for ₹168.13 Crores",
            "Summary": "Graphite India has invested ₹168.13 crores to acquire a 6.82% stake in GrafTech International Ltd through secondary market transactions. GrafTech International is a major graphite electrodes manufacturer with a market value of $327.85 million.",
            "Sentiment": "positive",
            "PublishDate": 1758266400561,
            "Source": "order&deals"
        },
        {
            "Title": "Graphite Company Signs MOU with Maharashtra Government for Synthetic Graphite Anode Material Project",
            "Summary": "A graphite company has signed a memorandum of understanding with the Government of Maharashtra for a proposed investment in a synthetic graphite anode material (SGAM) and other related projects. The agreement is subject to final terms and requisite approvals.",
            "Sentiment": "positive",
            "PublishDate": 1756686538782,
            "Source": "order&deals"
        },
        {
            "Title": "Graphite Signs MOU with Maharashtra Government for Synthetic Graphite Anode Material Project",
            "Summary": "Graphite has signed a memorandum of understanding with the Maharashtra Government for a proposed investment in a synthetic graphite anode material project. The company is currently awaiting final terms and approvals for the project.",
            "Sentiment": "positive",
            "PublishDate": 1756541440355,
            "Source": "order&deals"
        },
        {
            "Title": "Graphite India Increases Stake in Godi India to 45.76% Through ₹18.65 Crore Rights Issue",
            "Summary": "Graphite India has increased its ownership stake in Godi India Pvt. Ltd. to 45.76% by subscribing to a rights issue worth ₹18.65 crore. This transaction represents a strategic investment by Graphite India to expand its shareholding in the subsidiary company.",
            "Sentiment": "positive",
            "PublishDate": 1756207023761,
            "Source": "corporate_action"
        },
        {
            "Title": "Graphite India Reports Strong Q1 Performance and Announces Rs 600 Crore Capacity Expansion",
            "Summary": "Graphite India Limited reported quarterly results for the period ended June 30, 2025. The company's standalone profit increased to Rs 145 crores compared to Rs 62 crores in the previous quarter, with revenue from operations at Rs 643 crores. Earnings per share stood at Rs 7.43. The Board approved an expansion plan for the Graphite Electrodes Division, adding 25,000 TPA capacity in two phases over 36 months. The expansion requires an investment of approximately Rs 600 crores, including Rs 100 crores for captive renewable energy power, to be funded through internal resources and debt. The company's existing capacity utilization is 80-85% of its 80,000 TPA Indian capacity. The expansion aims to meet anticipated growth in graphite electrodes demand.",
            "Sentiment": "positive",
            "PublishDate": 1754039123290,
            "Source": "earnings"
        },
        {
            "Title": "Graphite India Plans 25,000 TPA Expansion of Graphite Electrodes Division Over 3 Years",
            "Summary": "Graphite India has announced plans to expand its graphite electrodes division by 25,000 tonnes per annum (TPA) over a three-year period. This expansion represents the company's growth strategy for its electrodes business segment.",
            "Sentiment": "positive",
            "PublishDate": 1754038737058,
            "Source": "stock"
        },
        {
            "Title": "Graphite India Reports Decline in Q1 Financial Performance",
            "Summary": "Graphite India reported Q1 revenue of 6.7 billion rupees, down from 7.3 billion rupees in the same period last year. The company's consolidated net profit fell to 1.34 billion rupees compared to 2.4 billion rupees year-over-year. EBITDA decreased significantly to 430 million rupees from 1.13 billion rupees, while EBITDA margin contracted to 6.47% from 15.52% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754038355450,
            "Source": "earnings"
        },
        {
            "Title": "Graphite India Schedules Board Meeting for August 1 to Approve Quarterly Financial Results",
            "Summary": "Graphite India Limited has scheduled a Board of Directors meeting for August 1, 2025, to review and approve unaudited financial results for the quarter ended June 30, 2025. The company will consider both standalone and consolidated results. The trading window for the company's shares, which closed on July 1, 2025, will reopen on August 4, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753428074515,
            "Source": "corporate_action"
        },
        {
            "Title": "Graphite India Promotes Two Senior Executives to Senior Management Team",
            "Summary": "Graphite India Limited promoted two executives to its Senior Management team. Mahesh B Gote was promoted to Sr. Vice President - Satpur Plant and Power Division, while Ranadeep Chakraborty was promoted to Sr. Vice President – Durgapur (works). Both positions are one level below Whole time Director, with promotions effective from July 23, 2025. Gote joined the company in November 1996 as Trainee Engineer and holds a mechanical engineering degree from Pune University. He currently heads the Power Division and Plant at Satpur. Chakraborty joined in January 2021 and heads the Graphite plant in Durgapur. He has over 28 years of experience across various companies and holds a degree in Electrical and Electronics Engineering from BIT Mesra.",
            "Sentiment": "positive",
            "PublishDate": 1753362258542,
            "Source": "corporate_governance"
        },
        {
            "Title": "Japan Plans 5-Year Anti-Dumping Duty on Chinese Graphite",
            "Summary": "Japan intends to implement a 5-year anti-dumping duty on graphite imported from China. This news could potentially impact Graphite India, although the article does not provide specific details on how the company might be affected.",
            "Sentiment": "neutral",
            "PublishDate": 1751004636000,
            "Source": "default"
        },
        {
            "Title": "Graphite India Reports Q4 Revenue Decline",
            "Summary": "Graphite India's fourth quarter revenue for the fiscal year has decreased to 6.7 billion rupees from 7.2 billion rupees in the same quarter of the previous year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1747211973000,
            "Source": "result"
        },
        {
            "Title": "Graphite India Reports Q4 Financial Results and Dividend",
            "Summary": "Graphite India announced its Q4 financial results, showing significant improvement. The company's EBITDA turned positive, reaching 390 million rupees compared to a loss of 100 million rupees in the same quarter last year. The Q4 EBITDA margin was 5.86%. Additionally, consolidated net profit increased to 500 million rupees from 160 million rupees year-over-year. The company also declared a dividend of 11 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747211946000,
            "Source": "result"
        },
        {
            "Title": "Graphite India Reports Reduced Q3 EBITDA Loss",
            "Summary": "Graphite India has reported an EBITDA loss of 80 million rupees for the third quarter, showing an improvement from the 130 million rupee loss in the same period last year. This represents a year-over-year reduction in losses by 50 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1739346371000,
            "Source": "earnings"
        },
        {
            "Title": "Graphite India Reports Q3 Revenue Decline",
            "Summary": "Graphite India has reported a decrease in revenue for the third quarter. The company's revenue stood at 5.2 billion rupees, down from 6.9 billion rupees in the same quarter of the previous year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1739346364000,
            "Source": "earnings"
        },
        {
            "Title": "Graphite India Reports Q3 Consolidated Net Loss",
            "Summary": "Graphite India has reported a consolidated net loss of 200 million rupees for the third quarter, compared to a profit of 180 million rupees in the same period last year. This represents a significant year-over-year decline in the company's financial performance.",
            "Sentiment": "negative",
            "PublishDate": 1739346259000,
            "Source": "earnings"
        },
        {
            "Title": "Graphite India Reports Significant Q2 EBITDA Improvement",
            "Summary": "Graphite India has reported a substantial improvement in its Q2 EBITDA, moving from a loss of 300 million rupees in the previous year to a gain of 1.1 billion rupees. The company's Q2 EBITDA margin stands at 17.11%.",
            "Sentiment": "positive",
            "PublishDate": 1731314493000,
            "Source": "result"
        },
        {
            "Title": "Graphite India Reports Q2 Revenue Decline",
            "Summary": "Graphite India's second quarter revenue decreased to 6.4 billion rupees from 7.93 billion rupees in the same quarter last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1731314459000,
            "Source": "result"
        },
        {
            "Title": "Graphite India Reports Significant Profit Increase in Q2",
            "Summary": "Graphite India has reported a substantial increase in its consolidated profit before exceptional items for the second quarter. The company's profit rose to 2.5 billion rupees, up from 380 million rupees in the same period last year, marking a significant year-over-year improvement in financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1731314424000,
            "Source": "result"
        }
    ]
}