{
    "Symbol": "GRASIM",
    "ISIN": "INE047A01021",
    "News": [
        {
            "Title": "Grasim Industries Approves Q3FY26 Financial Results",
            "Summary": "Grasim Industries' Board of Directors approved unaudited financial results for quarter and nine months ended December 31, 2025, following Audit Committee recommendations during board meeting held February 10, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770801992853,
            "Source": "co_actions_results"
        },
        {
            "Title": "Grasim Industries Q3FY26 Monitoring Report Shows No Deviation",
            "Summary": "Grasim Industries Limited submitted its Q3FY26 monitoring agency report for its ₹3,999.80 crore rights issue, confirming no deviation in fund utilization as certified by CARE Ratings Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1770749041451,
            "Source": "co_actions_results"
        },
        {
            "Title": "Grasim Industries Grants 2,676 Stock Options to Staff",
            "Summary": "Grasim Industries' board committee approved 2,676 stock options comprising 1,720 ESOPs and 956 PSUs for eligible employees under its 2022 scheme, with vesting periods of 1-3 years.",
            "Sentiment": "positive",
            "PublishDate": 1770731561748,
            "Source": "co_actions_results"
        },
        {
            "Title": "Grasim Industries Re-appoints Two Independent Directors",
            "Summary": "Grasim Industries board approves re-appointment of V. Chandrasekaran and Adesh Kumar Gupta as Independent Directors for second five-year terms from May 24, 2026 to May 23, 2031, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1770728167043,
            "Source": "stocks"
        },
        {
            "Title": "Grasim Industries Board Meet Set for Feb 10, 2026",
            "Summary": "Grasim Industries Limited has scheduled its board meeting for February 10, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769759223477,
            "Source": "co_actions_results"
        },
        {
            "Title": "Grasim Issues Letter of Awareness for Canada JV",
            "Summary": "Grasim Industries provides letter of awareness to JP Morgan Chase Bank for AV Group NB Inc., Canada, supporting CAD 27 million credit facilities without financial commitment.",
            "Sentiment": "neutral",
            "PublishDate": 1769613702501,
            "Source": "stocks"
        },
        {
            "Title": "Grasim Industries CEO Satyaki Ghosh to Resign",
            "Summary": "Grasim Industries announces resignation of Satyaki Ghosh, CEO of Cellulosic Fashion Yarn Business, effective January 16, 2026. The leadership change affects the company's textile division operations.",
            "Sentiment": "neutral",
            "PublishDate": 1768894880312,
            "Source": "stocks"
        },
        {
            "Title": "Grasim names ex-ITC executive Sachin Sahay as Birla Opus CEO",
            "Summary": "Grasim Industries appoints Sachin Sahay as CEO of Birla Opus Paints, effective February 16, 2026. Sahay brings 30+ years experience from ITC, replacing Rakshit Hargave who resigned in November 2025.",
            "Sentiment": "positive",
            "PublishDate": 1768543973587,
            "Source": "stocks"
        },
        {
            "Title": "Grasim's Birla Opus Paints Appoints New CEO",
            "Summary": "Grasim Industries announces Sachin Sahay as CEO of Birla Opus Paints. Sahay joins from ITC where he served as Executive Vice President, bringing extensive industry experience to the paints division.",
            "Sentiment": "positive",
            "PublishDate": 1768543627098,
            "Source": "stocks"
        },
        {
            "Title": "Grasim Industries Q3FY26 Demat Certificate Filed",
            "Summary": "Grasim Industries filed its quarterly certificate for dematerialisation activities during Q3FY26, reporting 47,755 shares dematerialised with 99.53% of total equity now in demat form.",
            "Sentiment": "neutral",
            "PublishDate": 1768396214115,
            "Source": "stocks"
        },
        {
            "Title": "MOSL Sets ₹3,600 Target for Grasim Industries",
            "Summary": "Motilal Oswal maintains positive outlook on Aditya Birla Group's flagship company with BUY recommendation, citing multiple growth engines driving the business forward.",
            "Sentiment": "positive",
            "PublishDate": 1768286396158,
            "Source": "stocks"
        },
        {
            "Title": "Motilal Oswal Sets ₹3,600 Target for Grasim Industries",
            "Summary": "Motilal Oswal maintains BUY rating on Grasim Industries with ₹3,600 target, citing VSF margin recovery, stable chemicals business, and paints growth potential through SoTP valuation approach.",
            "Sentiment": "positive",
            "PublishDate": 1768285475806,
            "Source": "stocks"
        },
        {
            "Title": "Motilal Oswal Maintains Buy on Grasim Industries",
            "Summary": "Motilal Oswal Securities maintains its buy recommendation on Grasim Industries with a target price of ₹3600.00, indicating positive outlook for the diversified conglomerate.",
            "Sentiment": "positive",
            "PublishDate": 1768275752059,
            "Source": "stocks"
        },
        {
            "Title": "Grasim Industries Block Trade Worth ₹16.40 Crores",
            "Summary": "Grasim Industries witnessed a significant NSE block trade worth ₹16.40 crores involving 59,693 shares at ₹2,748.00 per share, indicating institutional investor activity in the diversified conglomerate.",
            "Sentiment": "neutral",
            "PublishDate": 1768195464509,
            "Source": "co_actions_results"
        },
        {
            "Title": "Grasim Industries CTO Dr. Aspi Patel to Retire",
            "Summary": "Grasim Industries announces superannuation of Chief Technology Officer Dr. Aspi Patel effective December 31, 2025, marking end of his tenure with the company.",
            "Sentiment": "neutral",
            "PublishDate": 1767178742548,
            "Source": "stocks"
        },
        {
            "Title": "Grasim Board Approves Composite Scheme for Renewable Energy",
            "Summary": "Grasim Industries board approves comprehensive composite scheme involving EMIL, Aditya Birla Renewables and subsidiaries to create consolidated renewable energy platform with enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1767015969516,
            "Source": "co_actions_results"
        },
        {
            "Title": "Grasim Industries Faces ₹64.39 Lakh Stamp Duty Demand",
            "Summary": "Madhya Pradesh Revenue Court orders Grasim Industries to pay ₹64.39 lakh stamp duty on 2002 Business Transfer Agreement, citing undervaluation of factory structures. Company states no material impact.",
            "Sentiment": "negative",
            "PublishDate": 1766581315928,
            "Source": "stocks"
        },
        {
            "Title": "Grasim Industries Announces Senior Management Changes",
            "Summary": "Grasim Industries announces resignation of CEO-Cellulosic Fashion Yarn Business Satyaki Ghosh effective January 16, 2026, and appointment of Ajit Rajagopalan as his successor from January 17, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766148377541,
            "Source": "stocks"
        },
        {
            "Title": "Grasim Industries Block Trade Worth ₹27.27 Crores",
            "Summary": "Grasim Industries executed a significant NSE block trade involving 96,272 shares at ₹2,832.20 per share, totaling ₹27.27 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1765775682377,
            "Source": "co_actions_results"
        },
        {
            "Title": "Grasim Industries Gets ESG Rating of 64 for FY2025",
            "Summary": "NSE Sustainability Ratings independently assigned an ESG rating of 64 to Grasim Industries for FY2025. The rating was provided voluntarily without company engagement, based on publicly available information.",
            "Sentiment": "neutral",
            "PublishDate": 1765381997496,
            "Source": "stocks"
        },
        {
            "Title": "Grasim Industries Receives ESG Rating of 64 from NSE Sustainability for FY2025",
            "Summary": "NSE Sustainability Ratings and Analytics Limited independently assigned an ESG rating of 64 to Grasim Industries for FY2025 based on publicly available information. The company clarified it did not engage NSE Sustainability for this rating, which was assigned voluntarily using the rating provider's own criteria and methodology.",
            "Sentiment": "neutral",
            "PublishDate": 1765357848322,
            "Source": "corporate_action"
        },
        {
            "Title": "Global Infrastructure Partners to Invest ₹3,000 Crores in Aditya Birla Renewables",
            "Summary": "Global Infrastructure Partners, part of BlackRock, will invest up to ₹3,000 crores ($335 million) in Aditya Birla Renewables for a minority stake. The investment strengthens Grasim Industries' renewable energy subsidiary with significant capital infusion from a major global infrastructure investor.",
            "Sentiment": "positive",
            "PublishDate": 1765322898664,
            "Source": "corporate_action"
        },
        {
            "Title": "Grasim Industries Announces Senior Management Changes in CFO Roles",
            "Summary": "Grasim Industries' Board approved the superannuation of Anil Rustogi as CFO-Cellulosic Fibres Business effective April 3, 2026, and the role change of Ashok Machher from CFO-Textiles Business to CFO-Cellulosic Fibres Business effective April 4, 2026. The changes represent a planned leadership transition within the company's finance operations, with Machher, a Chartered Accountant with 27 years at the Group, taking over the cellulosic fibres division.",
            "Sentiment": "neutral",
            "PublishDate": 1764847118392,
            "Source": "corporate_governance"
        },
        {
            "Title": "Grasim Industries Acquires 29% Stake in Solar Power Company for ₹3.60 Crore",
            "Summary": "Grasim Industries has agreed to purchase a 29% stake in a solar power company for ₹3.60 crore. The acquisition represents Grasim's strategic move into the renewable energy sector through this equity investment.",
            "Sentiment": "positive",
            "PublishDate": 1764167284831,
            "Source": "order&deals"
        },
        {
            "Title": "Grasim Industries Commences Commercial Production at Birla Opus Paints Resin Block in Kharagpur",
            "Summary": "Grasim Industries announced that its Resin Block at the Birla Opus Paints plant in Kharagpur, West Bengal, began commercial production on November 12, 2025, with an installed capacity of 24 Million Litres Per Annum (MLPA). This expansion increases the total installed capacity of Resin Blocks across all Birla Opus plants to 92 MLPA. The company also disclosed that the installed capacity of Emulsion Blocks across all Birla Opus plants stands at 376 MLPA. The production will serve the domestic market.",
            "Sentiment": "positive",
            "PublishDate": 1762985269532,
            "Source": "stock"
        },
        {
            "Title": "Grasim Industries Reports 26% Standalone Revenue Growth in Q2FY26, BirlaOpus CEO Rakshit Hargave Resigns",
            "Summary": "Grasim Industries delivered its 21st consecutive quarter of revenue growth with standalone revenue reaching INR 9,610 crores, up 26% year-on-year, while consolidated trailing 12-month revenues approached INR 1,60,000 crores. The company's paints business BirlaOpus commissioned its sixth and largest plant in Kharagpur with 236 million liters capacity, bringing total decorative paints capacity to 1,332 million liters per annum across six plants. BirlaOpus achieved double-digit market share including putty revenues and expanded distribution to over 10,000 towns. However, CEO Rakshit Hargave resigned effective December 6, 2025, with Managing Director Himanshu Kapania taking interim oversight. The cellulosic fibers segment saw revenue growth of 1% to INR 4,149 crores but EBITDA declined 29% to INR 350 crores due to higher input costs. Chemicals business reached two-year high revenue levels driven by caustic soda and specialty chemicals performance. UltraTech cement sales volume grew 6.9% year-on-year to 33.85 million metric tons. B2B e-commerce platform BirlaPivot showed 15% sequential revenue growth and expanded into polymers, solvents and textile chemicals. Net debt declined by INR 292 crores to INR 6,861 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762868178811,
            "Source": "earnings"
        },
        {
            "Title": "Grasim Industries Acquires 26% Stake in Two Renewable Energy SPVs",
            "Summary": "Grasim Industries has executed agreements to acquire 26% equity stakes in two Special Purpose Vehicles - Pro-Zeal Green Power Eighteen Private Limited and Pro-Zeal Green Power Nineteen Private Limited. The acquisitions are structured through Share Subscription-Cum-Shareholders Agreements and Power Purchase Agreements to serve as captive renewable energy users for the company's plants in Vilayat, Gujarat and Balabhadrapuram, Andhra Pradesh. Pro-Zeal Green Power Nineteen Private Limited was incorporated on September 24, 2025, and is developing a captive wind-solar hybrid power generation facility with approximately 21MW capacity. The transactions are cash considerations and not related party transactions, with completion expected within 30 days of agreement execution. The acquisitions aim to meet green energy needs, optimize energy costs, and comply with regulatory requirements for captive power consumption under electricity laws.",
            "Sentiment": "positive",
            "PublishDate": 1762606390483,
            "Source": "corporate_action"
        },
        {
            "Title": "Citi Raises Grasim Industries Target Price to Rs 3,450 Despite Birla Opus CEO Exit",
            "Summary": "Citi increased its target price for Grasim Industries from Rs 3,400 to Rs 3,450 while maintaining a 'buy' rating, despite the exit of Rakshit Hargave as CEO of Birla Opus. Jefferies and Morgan Stanley also remain optimistic about the stock. Hargave, who oversaw Birla Opus's launch over 18 months, is joining Britannia as Executive Director and CEO. While brokerages called his departure a 'negative surprise' that could cause near-term caution and concerns about the paints division's direction, they remain positive on Grasim following strong quarterly earnings. Birla Opus continues gaining market share against established players like Asian Paints and Berger Paints. Morgan Stanley maintained Grasim as a 'top pick' with an overweight rating and Rs 3,690 target price, while Jefferies kept its 'Buy' rating with a Rs 3,500 target.",
            "Sentiment": "positive",
            "PublishDate": 1762408524232,
            "Source": "stock"
        },
        {
            "Title": "Grasim Industries Reports 76% Jump in Net Profit for Q2 with Strong Revenue Growth",
            "Summary": "Grasim Industries reported a 76% year-on-year increase in consolidated net profit to Rs 553.48 crore for the second quarter, compared to Rs 314.63 crore in the same period last year. Revenue from operations grew 16.6% to Rs 39,899.58 crore from Rs 34,222.54 crore. Consolidated EBITDA rose 29% to Rs 5,217 crore, driven by improved profitability in cement and chemicals segments. The company's capital expenditure for the quarter was Rs 461 crore, with total paints business capex reaching Rs 9,727 crore. Nuvama maintained a 'Hold' rating with a target price of Rs 3,198, noting that Birla Opus decorative paints brand outpaced industry growth. The brokerage trimmed its EBITDA forecast by 3% due to earnings miss but highlighted Grasim as a value play given attractive valuation and long-term paint segment potential.",
            "Sentiment": "positive",
            "PublishDate": 1762402993752,
            "Source": "earnings"
        },
        {
            "Title": "Grasim Industries Grants 2,668 Stock Options to Employees Under ESOP Scheme",
            "Summary": "Grasim Industries Limited's Nomination and Remuneration Committee approved the grant of 2,668 stock options to eligible employees under the Grasim Industries Limited Employee Stock Option and Performance Stock Unit Scheme 2022. The grant comprises 2,407 stock options and 261 Performance Stock Units (PSUs). The stock options are priced at Rs. 2,882 per option based on market price, while PSUs are priced at Rs. 2 per unit. Stock options will vest 33% each over three years starting one year from grant date, while PSUs vest 100% after three years. Stock options can be exercised within five years of vesting. All options and PSUs are subject to performance conditions. The scheme is implemented through the Grasim Employees Welfare Trust and complies with SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1762377268828,
            "Source": "corporate_action"
        },
        {
            "Title": "Grasim Industries Reports No Deviation in Rights Issue Fund Utilization for Quarter Ended September 2025",
            "Summary": "Grasim Industries Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing no variation or deviation in the utilization of funds from its rights issue. CARE Ratings Limited, serving as the monitoring agency, confirmed that the company properly utilized the proceeds from its ₹3,999.80 crore rights issue conducted in January 2024. The rights issue offered 2,20,73,935 equity shares at ₹1,812 per share and was subscribed 1.97 times. The company allocated ₹3,000 crore for repayment of borrowings and ₹977.65 crore for general corporate purposes. During the quarter, funds were utilized for repayment of commercial paper worth ₹967.26 crore and salaries of ₹3.20 crore. The company reported a loss of ₹118.18 crore in the quarter on a standalone basis. An unutilized amount of ₹0.44 crore remains in the monitoring bank account with Axis Bank.",
            "Sentiment": "neutral",
            "PublishDate": 1762368610648,
            "Source": "corporate_action"
        },
        {
            "Title": "Grasim Executive Forecasts Double-Digit Growth for Paints Segment in Q3",
            "Summary": "Grasim's executive anticipates continued double-digit quarter-over-quarter growth for the company's paints segment in Q3. The executive expects this growth momentum to persist in the upcoming quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762343695161,
            "Source": "stock"
        },
        {
            "Title": "Grasim Reports Mixed Performance with Birla Opus Growth Amid Chemical Segment Challenges",
            "Summary": "Grasim's Birla Opus brand continues to gain market share across various markets. However, the company's specialty chemicals division faces profitability pressures due to rising input costs. The company has outlined expansion plans to achieve a total grey cement capacity of 240.8 MTPA by March 2028.",
            "Sentiment": "neutral",
            "PublishDate": 1762334561222,
            "Source": "stock"
        },
        {
            "Title": "Grasim Industries Acquires Stakes in Renewable Energy SPVs and CEO of Paints Division Resigns",
            "Summary": "Grasim Industries' Board approved the acquisition of 26% equity stakes in three Special Purpose Vehicles for renewable energy projects. The SPVs are being formed with Prozeal Green Energy Limited for plants in Gujarat and Andhra Pradesh, and with GMR Energy Limited for a plant in Odisha. These captive wind-solar hybrid power generation facilities will have approximately 50MW capacity each, aimed at meeting green energy needs and optimizing energy costs. The acquisitions involve cash consideration with equity investments up to Rs. 3.60 crores in tranches. Separately, Rakshit Hargave, CEO of Birla Opus Paints, resigned to pursue opportunities outside the company, effective December 5, 2025. Hargave joined in November 2021 and helped establish six integrated manufacturing facilities and scale distribution networks during the startup phase. Managing Director Himanshu Kapania will oversee the Paints business until a successor is announced.",
            "Sentiment": "neutral",
            "PublishDate": 1762334121270,
            "Source": "corporate_action"
        },
        {
            "Title": "Grasim Industries Reports Strong Q2 Performance with 804.55 Crore Net Profit",
            "Summary": "Grasim Industries Limited reported net profit of Rs 804.55 crore for the quarter ended September 30, 2025, compared to a loss of Rs 118.18 crore in the previous quarter. Revenue from operations increased to Rs 10,394.92 crore from Rs 9,283.37 crore in the prior quarter. The company's paint plant at Kharagpur commenced commercial production on October 15, 2025, bringing all six green-field plants into operation with total decorative paints capacity reaching 1,332 Million Litres Per Annum under the Birla Opus brand. Total comprehensive income for the quarter stood at Rs 1,408.39 crore. Basic earnings per share improved to Rs 11.86 from negative Rs 1.74 in the previous quarter. The Board of Directors approved the unaudited financial results at a meeting held on November 5, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762333723284,
            "Source": "earnings"
        },
        {
            "Title": "Grasim Industries to Acquire 26% Stake in Three Renewable Energy SPVs for ₹69 Crore",
            "Summary": "Grasim Industries will acquire a 26% stake in three renewable energy Special Purpose Vehicles (SPVs) in partnership with Prozeal and GMR. The investment amounts to ₹69 crore and is intended to power captive green energy requirements for the company's plants located in Gujarat, Andhra Pradesh, and Odisha.",
            "Sentiment": "positive",
            "PublishDate": 1762333345681,
            "Source": "order&deals"
        },
        {
            "Title": "Grasim Industries Reports 11.5% Growth in Q2 Net Profit to ₹8.04 Billion",
            "Summary": "Grasim Industries reported Q2 net profit of ₹8.04 billion compared to ₹7.21 billion in the same period last year. Revenue increased to ₹96.1 billion from ₹76.2 billion year-over-year. EBITDA rose to ₹3.66 billion from ₹3.25 billion, though EBITDA margin declined to 3.81% from 4.27% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762332099971,
            "Source": "earnings"
        },
        {
            "Title": "Grasim Industries Commences Commercial Production at Birla Opus Paints Plant in Kharagpur",
            "Summary": "Grasim Industries has started commercial production at its Birla Opus paints manufacturing plant in Kharagpur, which has a capacity of 1,332 MLPA (Million Litres Per Annum). With this facility becoming operational, all six new plants are now running commercially.",
            "Sentiment": "positive",
            "PublishDate": 1760507996469,
            "Source": "stock"
        },
        {
            "Title": "Grasim Industries Faces Rs 15 Lakh Bank Guarantee Forfeiture by Maharashtra Pollution Control Board",
            "Summary": "Grasim Industries Limited disclosed that the Maharashtra Pollution Control Board has forfeited a bank guarantee of Rs 15 lakh from its Premium Fabric Unit in Kolhapur. The action was taken under interim directions related to water and air pollution control acts, with allegations concerning effective operation and maintenance of effluent treatment plant and discharge of colored effluent outside premises. The board has also instructed the company to submit an additional top-up bank guarantee of Rs 30 lakh. Grasim stated that the financial impact is equivalent to the bank guarantee amount and there is no material impact on the company's financials or operations.",
            "Sentiment": "negative",
            "PublishDate": 1760439128142,
            "Source": "stock"
        },
        {
            "Title": "Grasim Industries Announces Retirement of Senior Management Personnel Sanjay Kumar Verma",
            "Summary": "Grasim Industries Limited announced that Mr. Sanjay Kumar Verma, Unit Head Birla Cellulose - Kharach & Grasim Cellulosic Division - Vilayat, will retire from the company effective October 31, 2025. Verma holds a senior management position within the company's cellulose operations. The company specified that his departure is due to planned superannuation with no other material reasons cited for his exit.",
            "Sentiment": "neutral",
            "PublishDate": 1758201181830,
            "Source": "corporate_governance"
        },
        {
            "Title": "Grasim Industries Market Cap Approaches Rs 2 Lakh Crore Milestone",
            "Summary": "Grasim Industries' market capitalisation reached approximately Rs 1,95,000 crore, approaching the Rs 2 lakh crore milestone, Chairman Kumar Mangalam Birla announced at the company's AGM. The Aditya Birla Group flagship reported consolidated revenue of nearly Rs 1,50,000 crore. The company invested Rs 67,000 crore in capital expenditure over five years between FY20 and FY25, with Rs 51,000 crore directed toward growth initiatives. Grasim expanded into decorative paints through Birla Opus and B2B e-commerce via Birla Pivot over the past 18 months. Birla Opus commissioned five manufacturing facilities and became the third-largest player in India's decorative paints industry within six months of launch, commanding approximately 24% of installed capacity. The paint business targets Rs 10,000 crore revenue by the third year of operations and aims to become the second-largest sector player.",
            "Sentiment": "positive",
            "PublishDate": 1756219755220,
            "Source": "stock"
        },
        {
            "Title": "Grasim Industries Reports 16% Revenue Growth in Q1 FY26, Driven by Paints and B2B E-commerce Expansion",
            "Summary": "Grasim Industries achieved consolidated revenue of ₹40,118 crores in Q1 FY26, marking 16% year-on-year growth. The company reported its 20th consecutive quarter of revenue growth with trailing 12-month revenue crossing ₹1,50,000 crores. Standalone revenue reached a record ₹9,223 crores, up 34% year-on-year. Consolidated EBITDA grew 36% to ₹6,430 crores, driven by higher profitability in cement and chemicals businesses. Birla Opus paints business reported double-digit quarter-on-quarter growth and claims 10% revenue market share when combined with Birla White putty business. The company's sixth paint plant in Kharagpur began trial production with commercial launch expected by end of Q2 FY26. Birla Pivot B2B e-commerce business maintained high single-digit sequential growth despite monsoon impact. UltraTech cement business grew 13% year-on-year with capacity reaching 192.3 million tons per annum. Chemical business revenue increased 16% to ₹2,391 crores with EBITDA growing 36%. The company announced ₹2,263 crores CAPEX plan for FY26. CFO Pavan Jain announced his retirement effective August 15, 2025, with Hemant Kadel taking over as CFO.",
            "Sentiment": "positive",
            "PublishDate": 1755169409725,
            "Source": "earnings"
        },
        {
            "Title": "Grasim Industries Reports No Deviation in Rights Issue Fund Utilization for Quarter Ended June 30, 2025",
            "Summary": "Grasim Industries Limited submitted its monitoring agency report for the quarter ended June 30, 2025, confirming no variation or deviation in the utilization of funds from its Rights Issue. The report was prepared by CARE Ratings Limited as the monitoring agency. The company raised Rs. 3,999.80 crore through a rights issue conducted from January 17-29, 2024, offering 2,20,73,935 equity shares at Rs. 1,812 per share. The issue was oversubscribed by 1.97 times. Out of the total proceeds, Rs. 3,000 crore was allocated for repayment of borrowings and Rs. 977.65 crore for general corporate purposes. As of the quarter end, Rs. 3,969.96 crore has been utilized, with Rs. 3,000 crore used for debt repayment and Rs. 969.96 crore for general corporate purposes including commercial paper repayment of Rs. 967.26 crore and salaries of Rs. 2.70 crore. The unutilized amount of Rs. 0.28 crore remains in the monitoring bank account. The promoter shareholding increased from 42.75% to 43.11% following the rights issue.",
            "Sentiment": "positive",
            "PublishDate": 1754651983323,
            "Source": "corporate_action"
        },
        {
            "Title": "Grasim Industries Reports 32% Jump in Net Profit to Rs 1,419 Crore",
            "Summary": "Grasim Industries reported consolidated net profit of Rs 1,418.68 crore for Q1 FY26, marking a 32% year-on-year growth from Rs 1,075 crore in the previous year. Revenue from operations increased 16% to Rs 40,118.08 crore compared to Rs 34,609.75 crore in the same quarter last year. EBITDA rose 36% to Rs 6,430 crore, driven by improved profitability in Cement and Chemicals businesses, though partially offset by investments in the Paints business Birla Opus. The Chemicals segment saw 36% EBITDA growth supported by improved performance in Caustic soda and Chlorine derivatives. Cement volumes grew 9.7% year-on-year including contributions from India Cements. The financial services segment's total lending portfolio expanded 30% to Rs 1,65,832 crore. Capital expenditure for the quarter stood at Rs 480 crore, with the board approving Rs 2,263 crore capex for the full financial year. Grasim shares traded 1.8% lower at Rs 2,694 following the earnings announcement.",
            "Sentiment": "positive",
            "PublishDate": 1754644649073,
            "Source": "earnings"
        },
        {
            "Title": "Grasim Industries Appoints New Company Secretary, Reports Strong Q1FY26 Results with 16% Revenue Growth",
            "Summary": "Grasim Industries appointed Mr. Neelabja Chakrabarty as Company Secretary and Compliance Officer effective October 1, 2025. The company reported consolidated revenue of ₹40,118 crores for Q1FY26, up 16% year-on-year, with EBITDA growing 36% to ₹6,430 crores. Key business segments showed mixed performance: Chemicals EBITDA increased 36% driven by improved caustic soda and chlorine derivatives performance, while Cellulosic Fibres EBITDA declined 20% due to higher input prices. Cement business consolidated volumes grew 9.7% including India Cements acquisition. The decorative paints business Birla Opus achieved double-digit quarterly revenue growth, while B2B e-commerce platform Birla Pivot maintained consistent growth. Financial Services segment saw total lending portfolio grow 30% to ₹1,65,832 crores. The company's TTM consolidated revenues crossed ₹1,50,000 crores milestone.",
            "Sentiment": "positive",
            "PublishDate": 1754644321464,
            "Source": "corporate_governance"
        },
        {
            "Title": "Grasim Industries Reports Q1 FY26 Results with Standalone Loss of ₹118 Crores",
            "Summary": "Grasim Industries announced its quarterly results for the period ended June 30, 2025. On a standalone basis, the company reported a net loss of ₹118.18 crores compared to a loss of ₹52.12 crores in the same quarter last year. Revenue from operations increased to ₹9,223.13 crores from ₹6,893.87 crores year-on-year. On a consolidated basis, the company performed better with net profit of ₹2,767.08 crores versus ₹2,065.97 crores in the previous year quarter. Consolidated revenue from operations grew to ₹40,118.08 crores from ₹34,609.75 crores. The company's earnings per share on a standalone basis was negative at ₹1.74 while consolidated EPS was positive at ₹20.91. The results were approved by the Board of Directors and reviewed by the Audit Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1754643700891,
            "Source": "earnings"
        },
        {
            "Title": "Grasim Industries Reports Mixed Q1 Results with Revenue Growth but Widening Losses",
            "Summary": "Grasim Industries reported quarterly revenue of 92 billion rupees, up from 69 billion rupees year-over-year, exceeding estimates of 90.64 billion rupees. EBITDA increased to 3.84 billion rupees from 3.25 billion rupees year-over-year, significantly beating estimates of 2.27 billion rupees. However, EBITDA margin declined to 4.2% from 4.72% in the previous year, though it surpassed the estimated 2.5%. The company posted a net loss of 1.2 billion rupees compared to a loss of 521 million rupees in the same period last year, indicating a widening of losses despite revenue growth.",
            "Sentiment": "neutral",
            "PublishDate": 1754642919423,
            "Source": "earnings"
        },
        {
            "Title": "Grasim Industries Expected to Report Wider Net Loss Despite 30%+ Revenue Growth",
            "Summary": "Grasim Industries is expected to report a significantly widened net loss in its quarterly results, with brokerages forecasting losses between Rs 178-309 crore compared to Rs 52 crore loss in the same period last year. Despite this, the company is projected to achieve robust revenue growth of over 30% year-on-year, with estimates ranging from Rs 8,965-9,195 crore. The widening losses are attributed to continued pressure in the viscose fibre (VSF) business, ongoing losses in the paints division, and expansion costs related to B2B e-commerce ventures. EBITDA is expected to decline 17-25% year-on-year to Rs 245-270 crore, though showing sequential improvement. EBITDA margins are projected at 2.7-2.8%, down approximately 190-206 basis points year-on-year. The chemicals segment shows marginal improvement with gradual recovery in domestic demand, while the building materials segment (paints and B2B e-commerce) is estimated to contribute Rs 2,200 crore in revenue. Key areas to monitor include the performance of new business verticals, VSF pricing trends, and demand momentum in the chemicals division.",
            "Sentiment": "negative",
            "PublishDate": 1754584262422,
            "Source": "earnings"
        },
        {
            "Title": "Grasim Industries Schedules Earnings Call for Quarter Ended June 30, 2025",
            "Summary": "Grasim Industries Limited has scheduled a conference call with analysts and institutional investors to discuss the unaudited financial results for the quarter ended June 30, 2025. The earnings call is scheduled for Friday, August 8, 2025, at 5:00 PM IST. The call will begin with a brief business update followed by an interactive Q&A session, with the company being represented by its senior management team. Press release and investor presentation will be made available on the company's website after the results announcement. The company has provided dial-in numbers for various countries including India, Hong Kong, Singapore, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1753790653687,
            "Source": "earnings"
        },
        {
            "Title": "Grasim Industries Faces ₹8.66 Crore Demand Over Alleged Stamp Duty Underpayment on 2011 Chemical Plant Acquisition",
            "Summary": "Grasim Industries has received an order from the District Magistrate of Sonebhadra, Uttar Pradesh, alleging underpayment of stamp duty on a 2011 acquisition. The order demands differential stamp duty of ₹8.26 crore with 18% annual interest, plus a penalty of ₹0.40 crore. The case relates to the acquisition of a Chlor-alkali chemical plant from Kanoria Chemicals & Industries Limited at Renukoot on July 8, 2011, by Aditya Birla Chemicals India Ltd., which merged with Grasim Industries on April 1, 2015. The company is evaluating the order and considering challenging it before appropriate authorities.",
            "Sentiment": "negative",
            "PublishDate": 1753710938548,
            "Source": "stock"
        }
    ]
}