{
    "Symbol": "GRAVITA",
    "ISIN": "INE024L01027",
    "News": [
        {
            "Title": "Gravita India to acquire RMIL for INR 565 crores",
            "Summary": "Gravita India Limited announces acquisition of up to 100% stake in Rashtriya Metal Industries Limited for INR 565 crores, expanding into copper recycling business through this strategic move.",
            "Sentiment": "positive",
            "PublishDate": 1770642313640,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gravity India Board Meet Set for Feb 6 for Q3FY26 Results",
            "Summary": "Gravity (India) Limited has scheduled a board meeting on February 06, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770040477123,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gravita India launches Li-ion battery recycling plant",
            "Summary": "Gravita India Limited announces launch of lithium-ion battery recycling facility at Mundra, Gujarat with 6,000 MTPA capacity and Rs. 14 crores investment from internal accruals.",
            "Sentiment": "positive",
            "PublishDate": 1769179018916,
            "Source": "stocks"
        },
        {
            "Title": "Gravita India Maintains Margin Guidance at ₹19-20/Tonne",
            "Summary": "Gravita India management reaffirms margin expectations of ₹19-20 per tonne during recent concall, while noting need for 6-month assessment to confirm sustainability of current margin levels.",
            "Sentiment": "neutral",
            "PublishDate": 1769151070108,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gravita India Reaffirms 7M Tonnes Capacity Target",
            "Summary": "Gravita India management confirms expansion delays will be addressed in upcoming quarters to achieve medium-term guidance of scaling up to 7 million tonnes per annum by FY28.",
            "Sentiment": "neutral",
            "PublishDate": 1769150570592,
            "Source": "stocks"
        },
        {
            "Title": "Gravita India Q3 FY26 Results: 25% PAT Growth",
            "Summary": "Gravita India reports strong Q3 FY26 performance with 25% growth in PAT to ₹98 crore, 13% EBITDA growth to ₹116 crore, and 2% revenue increase to ₹1,017 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769079012562,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gravita India Q3 Net Profit Jumps 25% to ₹97.70 Cr",
            "Summary": "Gravita India reports strong Q3 performance with net profit rising 25% YoY to ₹97.70 crores. Revenue grew 2% to ₹1,017 crores while EBITDA margin expanded significantly to 11.80%.",
            "Sentiment": "positive",
            "PublishDate": 1769041162172,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gravita India Q3 FY26 QIP Monitoring Report",
            "Summary": "ICRA Limited reports no deviations in Gravita India's QIP proceeds utilization for Q3 FY26. Company has utilized ₹909.47 crores of ₹1000 crores raised, with ₹90.53 crores remaining unutilized and invested in various instruments.",
            "Sentiment": "neutral",
            "PublishDate": 1769005765373,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gravita India Schedules Q3FY26 Earnings Call Jan 23",
            "Summary": "Gravita India Limited announces post-results conference call on January 23, 2026 at 12:00 PM IST to discuss Q3FY26 and 9MFY26 earnings, organized by Antique Stock Broking Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1768817751537,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gravity India Appoints New Statutory Auditors",
            "Summary": "Gravity (India) Limited's board approved appointment of M/s. AVKAS & Co. as statutory auditors to fill casual vacancy and for 5-year term, subject to shareholder approval at upcoming AGM.",
            "Sentiment": "neutral",
            "PublishDate": 1768299692100,
            "Source": "stocks"
        },
        {
            "Title": "Gravita India stock surges 1,938% in 5 years",
            "Summary": "Gravita India's share price jumped from ₹82.50 to ₹1,689 over five years, turning ₹1 lakh investment into ₹20.38 lakh. Q2 FY26 revenue grew 11.75% to ₹1,036 crore with 33% profit growth.",
            "Sentiment": "positive",
            "PublishDate": 1768023673135,
            "Source": "stocks"
        },
        {
            "Title": "Gravity India Shareholders Approve Capital Increase",
            "Summary": "Gravity (India) Limited shareholders approved increasing authorized share capital from ₹15 crores to ₹100 crores and expanding business objects through postal ballot voting concluded January 09, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767971936779,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gravity India Appoints New Executive Director & CFO",
            "Summary": "Gravity (India) Limited's board approved the appointment of Mr. Kuldipsinh Rathod as Additional Director (Executive) and Chief Financial Officer, effective January 09, 2025, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1767954084258,
            "Source": "stocks"
        },
        {
            "Title": "Gravity India Appoints New Auditors & Managing Director",
            "Summary": "Gravity India Limited announces appointment of AVKAS & Co. as statutory auditors and Mukesh Parmar as Managing Director following resignation of Manoj Ramavat on January 08, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767879517482,
            "Source": "stocks"
        },
        {
            "Title": "Gravity India Appoints New Auditors & Managing Director",
            "Summary": "Gravity (India) Limited announces appointment of AVKAS & Co. as statutory auditors and Mukesh Parmar as Managing Director following resignations, effective January 08, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767879296821,
            "Source": "stocks"
        },
        {
            "Title": "Gravity India MD Manoj Ramavat Resigns",
            "Summary": "Gravity (India) Limited announces resignation of Managing Director Manoj Kanhiyalal Ramavat effective January 08, 2026, citing other professional commitments as reason for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1767874985853,
            "Source": "stocks"
        },
        {
            "Title": "Gravity India's Auditors DDM & Associates Resign",
            "Summary": "Gravity (India) Limited announces resignation of statutory auditors M/s DDM & Associates effective November 14, 2025, citing pre-occupation with other assignments as the reason for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1767186844213,
            "Source": "stocks"
        },
        {
            "Title": "Gravita India Subsidiary Increases Stake in Romania Unit",
            "Summary": "Gravita Netherlands BV to acquire additional 15% stake in Gravita Europe S.R.L. for ₹7.24 crores, increasing shareholding from 80% to 95% in the Romanian recycling subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1766548400082,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gravita India Gets ESG Score of 60.8 from SES",
            "Summary": "Gravita India Limited receives an Environmental, Social, and Governance (ESG) score of 60.8 from SES ESG Research Private Limited based on FY2024-25 data.",
            "Sentiment": "neutral",
            "PublishDate": 1765951327938,
            "Source": "stocks"
        },
        {
            "Title": "Gravita India Seeks Shareholder Approval for Executive Pay Revisions Through Postal Ballot",
            "Summary": "Gravita India Limited has issued a postal ballot notice seeking shareholder consent for revised remuneration of three key executives - Chairman cum Managing Director Rajat Agrawal, CEO Yogesh Malhotra, and CFO Sunil Kansal, effective from April 1, 2025. The e-voting process runs from November 27 to December 26, 2025, with the revisions reflecting the company's growth trajectory and executive contributions to its global expansion across 13 manufacturing facilities.",
            "Sentiment": "neutral",
            "PublishDate": 1764146872485,
            "Source": "corporate_action"
        },
        {
            "Title": "Gravita India Announces Voluntary Closure of Step-Down Subsidiary in South Africa",
            "Summary": "Gravita India Limited has decided to voluntarily close Recyclers South Africa (PTY) Ltd., a step-down subsidiary held 100% by Gravita Netherlands B.V., due to lack of business activity. The closure will have no material financial impact on the company's books as the subsidiary contributed Rs. 3.05 lakhs (0.00%) to net worth with nil turnover contribution.",
            "Sentiment": "neutral",
            "PublishDate": 1763205468910,
            "Source": "corporate_action"
        },
        {
            "Title": "Gravita India Reports 13% Revenue Growth in H1 FY26, Expands Capacity to 7 Lakh Metric Tons by FY28",
            "Summary": "Gravita India Limited reported revenue of INR 275.44 crores in H1 FY26, marking 13% year-on-year growth. The company achieved adjusted EBITDA of INR 223.51 crores (16% growth) with margins at 10.77%. Profit after tax rose 36% to INR 189.25 crores. For quarterly results, revenue stood at INR 1,035.50 crores (12% growth) with PAT of INR 95.9 crores (33% increase). The company's current installed capacity is 3.40 lakh metric tons per annum, targeting expansion to over 7 lakh metric tons by FY28. Capex budget has been realigned to approximately INR 1,225 crores by FY28. Phase 1 of Mundra lead capacity expansion (30,000 metric tons) is expected by November 2025, with Phase 2 (50,000 metric tons) targeted for January 2026. Value-added products contributed 47% of revenue, with the company targeting 50% by Vision 2029. Lead margins stood at INR 23,196 per ton, aluminum at INR 14,786 per ton, and plastics at INR 10,122 per ton. The company maintains a net-debt-free balance sheet and operates across 70+ countries with 13 facilities.",
            "Sentiment": "positive",
            "PublishDate": 1762207721721,
            "Source": "earnings"
        },
        {
            "Title": "Gravita India Reports Strong Q2 Performance with Revenue Growth and Profit Increase",
            "Summary": "Gravita India Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported consolidated revenue from operations of Rs 1,362.08 crores for the quarter, compared to Rs 1,186.30 crores in the corresponding quarter of the previous year. Consolidated profit after tax increased to Rs 55.79 crores from Rs 51.92 crores year-on-year. On a standalone basis, revenue from operations reached Rs 952.20 crores versus Rs 786.30 crores in the same quarter last year, with profit after tax of Rs 72.61 crores compared to Rs 50.59 crores previously. The company's Board of Directors also approved a postal ballot notice seeking shareholders' approval. The results were reviewed by the Audit Committee and approved by the Board of Directors at their meeting held on October 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761848575802,
            "Source": "earnings"
        },
        {
            "Title": "Gravita India Sets Ambitious Growth Targets with ₹4,000 Cr Revenue Goal by FY27",
            "Summary": "Gravita India has announced ambitious growth targets, aiming for a compound annual growth rate (CAGR) above 25 percent by FY27. The company plans to achieve ₹4,000 crore in revenue and ₹600 crore in EBITDA through expanded battery recycling capacity of 410,000 tonnes per annum across lead, aluminum, and plastic verticals. The growth strategy includes expanding its global footprint in Africa and Asia, implementing backward integration to maintain sustainable margins above 15 percent, and achieving high return on capital employed.",
            "Sentiment": "positive",
            "PublishDate": 1761838480531,
            "Source": "stock"
        },
        {
            "Title": "Gravita India Reports 33% Jump in Q2 Net Profit to 960 Million Rupees",
            "Summary": "Gravita India reported quarterly net profit of 960 million rupees compared to 720 million rupees in the same period last year, marking a 33% increase. Revenue grew to 10.4 billion rupees from 9.3 billion rupees year-over-year, representing a 12% rise. EBITDA increased significantly to 1 billion rupees from 640 million rupees, while EBITDA margin expanded to 9.85% from 6.9% in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761830805555,
            "Source": "earnings"
        },
        {
            "Title": "Government May Introduce Incentive Program for Critical Minerals Recycling",
            "Summary": "The government is considering promoting an incentive program focused on recycling critical minerals. This development was reported in relation to Gravita, suggesting potential policy support for the critical minerals recycling sector.",
            "Sentiment": "positive",
            "PublishDate": 1756890344884,
            "Source": "stock"
        },
        {
            "Title": "Gravita India Reports Strong Q1 FY26 Results with 39% PAT Growth, Targets 7 Lakh MT Capacity by FY28",
            "Summary": "Gravita India delivered robust quarterly results with revenue growing 15% to INR 1,040 crores and profit after tax surging 39% to INR 93.26 crores. EBITDA increased 22% to INR 111.70 crores with margins at 10.74%. The company achieved 47% contribution from value-added products, moving closer to its VISION 2029 target of 50%. Total volumes grew 12% with improved EBITDA per ton across segments - INR 21,790 for lead, INR 17,140 for aluminum, and INR 10,213 for plastics. Current capacity stands at 3.40 lakh metric tons per annum, with plans to reach 7 lakh metric tons by FY28 through INR 1,500 crores capex investment. The company expects to add 100,000 metric tons capacity this year, primarily in lead, rubber, and lithium-ion recycling segments. A pilot lithium-ion battery recycling unit in Mundra is expected to be operational in Q2 FY26. Management guided sustainable lead margins of INR 19-20 per kg and aluminum margins of INR 14-15 per kg, while targeting volume CAGR exceeding 25% and profitability growth above 35%.",
            "Sentiment": "positive",
            "PublishDate": 1754029300459,
            "Source": "earnings"
        },
        {
            "Title": "Gravita India Plans Lithium-Ion Battery Recycling Unit, Projects Strong Growth Targets",
            "Summary": "Gravita India announced plans to establish a lithium-ion battery recycling unit in Mundra, with operations expected to begin in Q2 FY'26. The company projects 15-16% volume growth from existing businesses and 7-8% growth from new additions in FY26. Lead EBITDA margins are expected around Rs 19-20 per kg, while aluminum EBITDA margins are projected at Rs 14-15 per kg. The rubber sector anticipates EBITDA of Rs 7-8 per kg and revenue of Rs 300-400 crore by FY28. Long-term targets include volume growth exceeding 25%, profit growth above 35%, and return on invested capital over 25%.",
            "Sentiment": "positive",
            "PublishDate": 1753845989145,
            "Source": "stock"
        },
        {
            "Title": "Gravita India Uploads Q1 FY26 Earnings Call Audio Recording",
            "Summary": "Gravita India Limited has uploaded the audio recording of its earnings call for the quarter ended June 30, 2025, to its website. The earnings call was held on July 29, 2025. The company has made the recording accessible through a direct link on their website and informed stock exchanges BSE and NSE about this upload.",
            "Sentiment": "neutral",
            "PublishDate": 1753786429946,
            "Source": "earnings"
        },
        {
            "Title": "Gravita India Plans ₹1,500 Crore Investment to Reach 7 LTPA Capacity by FY28",
            "Summary": "Gravita India has announced plans to invest ₹1,500 crores with the goal of achieving 7 LTPA (lakh tonnes per annum) capacity by FY28. The company is targeting over 25% volume growth and more than 35% profit increase through non-lead products and global expansion by 2029.",
            "Sentiment": "positive",
            "PublishDate": 1753711001303,
            "Source": "stock"
        },
        {
            "Title": "Gravita India Reports Strong Q1FY26 Results with 15% Revenue Growth and 39% PAT Increase",
            "Summary": "Gravita India Limited delivered robust quarterly results with revenue growing 15% year-on-year to Rs 1,037 crores and profit after tax (PAT) surging 39% to Rs 93.26 crores. The recycling company achieved 12% volume growth and 22% EBITDA increase, maintaining healthy margins at 10.74%. Value-added product contribution grew 47% during the quarter. The company operates across four recycling verticals - lead, aluminium, plastic, and rubber - with global presence spanning 12 recycling plants. Gravita maintains its Vision 2029 targets of 25% volume CAGR, 35% profitability growth, and 25% ROIC while expanding capacity to over 7 lakh tonnes per annum by FY28. The company reported 26% revenue from overseas business and 25% profit contribution from international operations. Return on invested capital remained strong at 28%, supported by the company's back-to-back hedging mechanism and diversified customer base across 34 countries.",
            "Sentiment": "positive",
            "PublishDate": 1753708070749,
            "Source": "earnings"
        },
        {
            "Title": "Gravita India Reports No Deviations in QIP Proceeds Utilization for Q1 FY2026",
            "Summary": "Gravita India Limited submitted its monitoring agency report for the quarter ended June 30, 2025, showing proper utilization of proceeds from its qualified institutional placement. The company raised INR 1000 crores through QIP in December 2024, with net proceeds of INR 981.42 crores. ICRA Limited, the monitoring agency, reported no deviations from the stated objects of the issue. Out of total proceeds, INR 746.64 crores have been utilized, with INR 284.12 crores used for debt repayment, INR 242.52 crores for working capital, and INR 201.42 crores for general corporate purposes. The remaining INR 253.36 crores are deployed in fixed deposits and mutual funds, earning returns between 6.75% to 8.97%. All objects are on schedule for completion in FY2026.",
            "Sentiment": "positive",
            "PublishDate": 1753706942294,
            "Source": "corporate_action"
        },
        {
            "Title": "Gravita India Reports 39% Jump in Q1 Net Profit to 933 Million Rupees",
            "Summary": "Gravita India reported consolidated net profit of 933 million rupees in Q1, representing a 39% increase from 673 million rupees in the same period last year. The company's revenue also grew to 10.4 billion rupees compared to 9.08 billion rupees year-over-year, marking a 15% increase.",
            "Sentiment": "positive",
            "PublishDate": 1753703969706,
            "Source": "earnings"
        },
        {
            "Title": "Gravita India Schedules Q1 FY26 Earnings Conference Call for July 29, 2025",
            "Summary": "Gravita India Limited has scheduled an analyst and investor conference call on July 29, 2025, at 12:00 P.M. (IST) to discuss their Q1 FY26 earnings results. The call will be hosted by Antique Stock Broking Limited and will feature senior management from Gravita India, including CEO Yogesh Malhotra, CFO Sunil Kansal, and Executive Director Vijay Kumar Pareek. The company has provided dial-in details for both domestic and international participants across multiple countries.",
            "Sentiment": "neutral",
            "PublishDate": 1753275191878,
            "Source": "earnings"
        },
        {
            "Title": "Gravita India: Retail Shareholding Declines Despite 1,934% Stock Surge",
            "Summary": "Gravita India's stock price rose 1,934% over four years, from ₹90.5 to ₹1,832. Despite this growth, retail shareholding decreased from 22.9% to 15.8%. Promoters reduced their stake from 73% to 59.3%. FPIs and mutual funds increased their holdings significantly. The company specializes in lead metal manufacturing through recycling.",
            "Sentiment": "neutral",
            "PublishDate": 1751872925000,
            "Source": "normal_news"
        },
        {
            "Title": "India Plans Financial Aid for Scrap Processing Facilities",
            "Summary": "A government document reveals that India has a short-term plan to offer financial assistance for scrap processing facilities. This news potentially impacts Gravita India, a company likely involved in the scrap processing industry.",
            "Sentiment": "positive",
            "PublishDate": 1751612267000,
            "Source": "default"
        },
        {
            "Title": "Gravita India to Close Down Gravita USA Inc.",
            "Summary": "Gravita India has announced its decision to shut down its subsidiary, Gravita USA Inc. The company has not provided any specific reasons for this closure or any additional details about the impact of this decision.",
            "Sentiment": "negative",
            "PublishDate": 1750772693000,
            "Source": "default"
        },
        {
            "Title": "Gravita India: Multibagger Stock Soars 4725% in Five Years",
            "Summary": "Gravita India Ltd, a global recycling company, has seen its stock rally nearly 5000% in the last five years. The company reported a 38% surge in net profit for the March quarter, reaching Rs 95 crore. Analysts maintain a 'buy' rating with an average 12-month price target of Rs 2,438.67. The company plans to invest Rs 2,500 crore over the next four years and targets 25% CAGR growth in volumes.",
            "Sentiment": "positive",
            "PublishDate": 1750227048000,
            "Source": "earnings"
        },
        {
            "Title": "Gravita India Schedules Meeting with ValueQuest Investment Advisors",
            "Summary": "Gravita India has scheduled a meeting with ValueQuest Investment Advisors on June 12. ValueQuest Investment Advisors oversees assets worth ₹17,075 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1749028809000,
            "Source": "default"
        },
        {
            "Title": "Gravita India: Q4 Revenue and Profit Surge, Dividend Declared",
            "Summary": "Gravita India's Q4 revenue increased 20.2% to Rs 1,037 crore, with net profit up 38% to Rs 95 crore. EBITDA rose 27.8% to Rs 92 crore. The company declared an interim dividend of Rs 6.35 per share for FY2025, with May 8 as the record date.",
            "Sentiment": "positive",
            "PublishDate": 1746422926000,
            "Source": "earnings"
        },
        {
            "Title": "Gravita India Reports Strong Q4 Results and Declares Dividend",
            "Summary": "Gravita India announced its Q4 consolidated net profit of 951 million rupees, up from 689.8 million rupees year-over-year and 779 million rupees quarter-over-quarter. The company's Q4 revenue increased to 10.4 billion rupees from 8.63 billion rupees in the previous year. Additionally, Gravita India recommended a final dividend of 6.35 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746403585000,
            "Source": "default"
        },
        {
            "Title": "Gravita India Announces Final Dividend",
            "Summary": "Gravita India has recommended a final dividend of 6.35 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1746194240000,
            "Source": "result"
        },
        {
            "Title": "Gravita India Reports Strong Q4 Financial Results",
            "Summary": "Gravita India has announced its Q4 financial results, showing significant year-over-year growth. The company's EBITDA increased to 930 million rupees from 721.6 million rupees in the previous year, with EBITDA margin improving to 8.97% from 8.36%. Consolidated net profit rose to 951 million rupees from 689.8 million rupees year-over-year and 779 million rupees quarter-over-quarter. Revenue for Q4 reached 10.4 billion rupees, up from 8.63 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1746194170000,
            "Source": "result"
        },
        {
            "Title": "Gravita India to Consider Q4 Results on May 2",
            "Summary": "Gravita India has announced that it will consider and approve its financial results for the fourth quarter on May 2. This is a routine corporate announcement regarding the company's upcoming financial disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1745593402000,
            "Source": "default"
        },
        {
            "Title": "Gravita India Acquires European Rubber Recycling Plant",
            "Summary": "Gravita India has successfully completed the acquisition of a rubber recycling plant in Europe. The total investment for this transaction amounts to approximately 400 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1743082889000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gravita India Plans Significant Acquisitions and Reaffirms Growth Targets",
            "Summary": "Gravita India has announced plans to invest between Rs 800 crore to Rs 900 crore in mergers and acquisitions over the next three years. The company has also reaffirmed its guidance of achieving a 25% average increase in volume over a three-year period. This information was shared during a company conference call.",
            "Sentiment": "positive",
            "PublishDate": 1737688518000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gravita India Projects Strong Growth in Aluminum Segment",
            "Summary": "Gravita India has announced ambitious growth projections during a recent conference call. The company expects its aluminum segment to grow by approximately 40% over the next three to four years. Additionally, Gravita India has set an overall target growth rate of 25% for the same period.",
            "Sentiment": "positive",
            "PublishDate": 1737688450000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gravita India Reports Strong Q3 Financial Results",
            "Summary": "Gravita India has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 779 million rupees from 603 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 9.96 billion rupees compared to 7.58 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737591195000,
            "Source": "earnings"
        },
        {
            "Title": "Gravita India: Q3 Profit Surges 29.4%, Revenue Up 31.5%",
            "Summary": "Gravita India reported Q3 FY24 net profit of ₹78 crore, up 29.4% YoY. Revenue increased 31.5% to ₹996.4 crore. EBITDA rose 1% to ₹80.7 crore. The board approved reappointment of Yogesh Malhotra as CEO and recommended Shikha Sharma as independent director.",
            "Sentiment": "positive",
            "PublishDate": 1737549050000,
            "Source": "earnings"
        },
        {
            "Title": "Gravita India Reports Mixed Q3 Results",
            "Summary": "Gravita India has released its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q3 was 811 million rupees, showing a slight increase from 808 million rupees in the same quarter last year. However, the EBITDA margin decreased to 8.14% from 10.66% year-over-year, indicating a decline in profitability despite the marginal increase in absolute EBITDA.",
            "Sentiment": "neutral",
            "PublishDate": 1737546456000,
            "Source": "earnings"
        }
    ]
}