{
    "Symbol": "GREAVESCOT",
    "ISIN": "INE224A01026",
    "News": [
        {
            "Title": "Greaves Cotton Q3 Net Profit Rises 22.6% YoY",
            "Summary": "Greaves Cotton reports consolidated net profit of ₹255 million in Q3, marking a 22.6% increase from ₹208 million in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1770365294952,
            "Source": "co_actions_results"
        },
        {
            "Title": "Greaves Cotton Allots 51,676 Shares Under ESOP 2020",
            "Summary": "Greaves Cotton's board committee approved allotment of 51,676 equity shares at Rs. 2 each under Employee Stock Option Plan 2020, increasing paid-up capital to Rs. 46,57,92,522.",
            "Sentiment": "neutral",
            "PublishDate": 1770216790902,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ampere Magnus G Max launched at ₹94,999 with 100km range",
            "Summary": "Greaves Electric Mobility launches Magnus G Max e-scooter at ₹94,999 with 3kWh LFP battery, 142km certified range, 33-litre storage, and 65kmph top speed targeting family users.",
            "Sentiment": "positive",
            "PublishDate": 1768806767962,
            "Source": "stocks"
        },
        {
            "Title": "Greaves Cotton Issues ₹100 Cr Guarantee to IDFC Bank",
            "Summary": "Greaves Cotton Limited has issued a corporate guarantee of ₹100.00 crores to IDFC FIRST Bank Limited as security for working capital and term loan facilities availed by its material subsidiary Greaves Electric Mobility Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1767180731076,
            "Source": "co_actions_results"
        },
        {
            "Title": "Greaves Cotton Appoints Santosh Singh as Chief Strategy Officer",
            "Summary": "Greaves Cotton Limited has appointed Santosh Singh as Chief Strategy and AI Officer with effect from December 15, 2025, to strengthen execution across emerging business vectors and support the company's Greaves.NEXT strategy.",
            "Sentiment": "positive",
            "PublishDate": 1765820119549,
            "Source": "stocks"
        },
        {
            "Title": "Greaves Cotton Partners with Ligier Group to Supply Euro V Certified Diesel Engines for European Microcar Market",
            "Summary": "Greaves Cotton Limited has partnered with Ligier Group to supply 499cc REVOD diesel engines that are Euro V certified and manufactured at its Chhatrapati Sambhajinagar plant, powering Ligier's JS50 and Myli microcar models across 16 European countries. This collaboration positions Greaves as a trusted global supplier of advanced automotive technologies and marks its evolution from a powertrain supplier to a provider of end-to-end mobility solutions for international markets.",
            "Sentiment": "positive",
            "PublishDate": 1763450303700,
            "Source": "order&deals"
        },
        {
            "Title": "Greaves Cotton Reports 16% Revenue Growth, Unveils GREAVES.NEXT Strategy for FY30",
            "Summary": "Greaves Cotton Limited delivered consolidated revenue of Rs. 815 crore in Q2 FY26, marking 16% year-on-year growth. For H1 FY26, consolidated revenue reached Rs. 1,561 crore with 16% growth. Standalone revenue grew 18% year-on-year to Rs. 552 crore with EBITDA of Rs. 78 crore and PBT of Rs. 75 crore. The company launched GREAVES.NEXT strategy targeting 16-20% CAGR organic growth over next 4-5 years, focusing on three areas: Energy Solutions, Mobility, and Industrial Solutions. Engineering business recorded 31% year-on-year growth with revenue of Rs. 406 crore. Automotive business saw 48% increase driven by EuroV engine demand from European OEM partnerships. Genset business witnessed 24% growth with market share at around 4%. Electric mobility division reported Rs. 199 crore revenue in Q2 and Rs. 336 crore in H1. Greaves Electric Mobility's market share improved from 3.2% to 4.2% with strong regional positions including 12% share in Tamil Nadu, 14% in Bihar, and 6% in Orissa. The company maintains net cash positive position with ROCE at 30%+. Greaves Electric has filed DRHP with SEBI for IPO with Rs. 1,000 crore primary raise planned.",
            "Sentiment": "positive",
            "PublishDate": 1762934472454,
            "Source": "earnings"
        },
        {
            "Title": "Greaves Cotton Targets INR 15,000 Crores Revenue by 2030",
            "Summary": "Greaves Cotton has set a revenue target of INR 15,000 crores by 2030, planning to achieve this through a combination of growth initiatives and acquisitions. The company's management projects 16-20% organic revenue growth for its core businesses over the next 4-5 years while maintaining steady EBITDA margins.",
            "Sentiment": "positive",
            "PublishDate": 1762485585749,
            "Source": "stock"
        },
        {
            "Title": "Greaves Cotton Launches Greaves.Next Strategy for Growth in Energy, Mobility, and Industrial Sectors",
            "Summary": "Greaves Cotton has unveiled Greaves.Next, a strategic initiative focused on sustainable growth across three key sectors: energy, mobility, and industrial solutions.",
            "Sentiment": "positive",
            "PublishDate": 1762408601056,
            "Source": "stock"
        },
        {
            "Title": "Greaves Cotton Reports Strong Q2 Performance with Net Profit Surge to 260.1 Million Rupees",
            "Summary": "Greaves Cotton delivered robust Q2 results with consolidated net profit jumping to 260.1 million rupees from 32.2 million rupees year-over-year. Revenue grew to 8.15 billion rupees compared to 7.05 billion rupees in the same period last year. EBITDA more than doubled to 518.8 million rupees from 230.3 million rupees, while EBITDA margin expanded significantly to 6.36% from 3.27% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762388791899,
            "Source": "earnings"
        },
        {
            "Title": "Greaves Cotton Reports Mixed Q2 Results with Standalone Profit Growth but Consolidated Losses",
            "Summary": "Greaves Cotton announced its quarterly results for the quarter and half year ended September 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 467.52 crores and profit of Rs 52.50 crores for the quarter. However, on a consolidated basis, the company posted a loss of Rs 3.32 crores for the quarter despite revenue from operations of Rs 815.49 crores. The consolidated results were impacted by losses in the Electric Mobility & Other Vehicles segment, which reported a loss of Rs 49.70 crores. The Engines segment performed well with profits of Rs 95.05 crores, while Cables & Control Levers contributed Rs 11.32 crores. During the period, the company acquired an additional 10% stake in Excel Control Linkage Private Limited for Rs 65.8 crores and made further investment of Rs 22 crores in wholly owned subsidiary Greaves Finance Limited. The company also allotted 362,988 equity shares under its employee stock option plan.",
            "Sentiment": "neutral",
            "PublishDate": 1762256335556,
            "Source": "earnings"
        },
        {
            "Title": "Greaves Cotton Reports Strong Q2 Performance with 707% Jump in Net Profit",
            "Summary": "Greaves Cotton delivered robust quarterly results with consolidated net profit surging to 260.1 million rupees from 32.2 million rupees year-over-year. Revenue grew to 8.15 billion rupees compared to 7.05 billion rupees in the same period last year. EBITDA more than doubled to 518.8 million rupees from 230.3 million rupees, while EBITDA margin expanded significantly to 6.36% from 3.27% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762253014864,
            "Source": "earnings"
        },
        {
            "Title": "Greaves Cotton Schedules Earnings Call for Q2 H1 FY26 Results Discussion",
            "Summary": "Greaves Cotton Limited has announced a quarterly earnings call scheduled for November 6, 2025, at 11:00 AM IST to discuss the company's financial performance for the quarter and half year ended September 30, 2025. The results will be declared on November 4, 2025. The conference call will feature the senior management team and include a management discussion followed by a Q&A session. Greaves Cotton is described as a diversified engineering company with over 165 years of legacy, operating through five business units: Greaves Engineering, Greaves Electric Mobility Ltd., Greaves Retail, Greaves Finance Ltd., and Greaves Technologies Ltd. The company focuses on mobility solutions and aims to touch a billion lives by 2030.",
            "Sentiment": "neutral",
            "PublishDate": 1761848171139,
            "Source": "earnings"
        },
        {
            "Title": "Greaves Finance Issues Rs 25 Crore Non-Convertible Debentures to A.K. Capital Finance",
            "Summary": "Greaves Finance Limited, a wholly owned subsidiary of Greaves Cotton Limited, has issued and allotted Listed, Secured, Redeemable, Non-Convertible Debentures worth Rs 25 crores to A.K. Capital Finance Limited on a private placement basis. The debentures comprise 2,500 units of 10.50% NCDs with a face value of Rs 1 lakh each. Greaves Finance is an NBFC subsidiary of Greaves Cotton Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1759211912034,
            "Source": "corporate_action"
        },
        {
            "Title": "Greaves Cotton Appoints Swarnendu Jha as Vice President – Energy Solutions",
            "Summary": "Greaves Cotton Limited appointed Swarnendu Jha as Vice President – Energy Solutions effective September 22, 2025. Following this appointment, Abhijit Joshi, Head of Marketing and Sales, will report to Jha and will no longer be classified as Senior Management Personnel under listing regulations. Jha brings over 26 years of experience in the power generation industry, having worked with organizations including Kirloskar Oil Engines Limited, Cummins Generator Technologies India, Cummins India Limited, Power HF India, Kohler Power Systems, Greaves Cotton Limited, and MAR Al Bahar. He holds a Bachelor of Engineering in Mechanical from SES College of Engineering, University of Pune, and a PG Diploma in Sales & Marketing from Symbiosis Centre for Distance Learning, Pune.",
            "Sentiment": "positive",
            "PublishDate": 1758540424873,
            "Source": "corporate_governance"
        },
        {
            "Title": "Greaves Electric Mobility Launches Ampere Magnus Grand Electric Scooter with LFP Battery at ₹89,999",
            "Summary": "Greaves Electric Mobility launched the Ampere Magnus Grand electric scooter, featuring a Lithium Ferro Phosphate (LFP) battery with 5-year or 75,000 km warranty. The scooter is priced at ₹89,999 (ex-showroom) and includes dual-tone premium colors (Matcha Green and Ocean Blue), gold finish badging, refreshed digital display, strengthened grab rail, advanced braking technology, and spacious seating designed for family use. The Magnus Grand builds on the Magnus Neo brand and aims to redefine urban mobility with enhanced comfort, safety, and durability. Ampere has 17 years of electric mobility expertise and serves over 300,000 riders. The company targets touching a billion lives by 2030 as part of its sustainable mobility transition goals.",
            "Sentiment": "positive",
            "PublishDate": 1758175003211,
            "Source": "stock"
        },
        {
            "Title": "Greaves Cotton Approves ₹22 Crore Investment in Greaves Finance for E-Vehicle Financing Expansion",
            "Summary": "Greaves Cotton has approved an investment of ₹22 crore in Greaves Finance. The investment is intended to support expansion in retail e-vehicle financing services.",
            "Sentiment": "positive",
            "PublishDate": 1757902058971,
            "Source": "stock"
        },
        {
            "Title": "Greaves Cotton Seeks Shareholder Approval for Jehangir Ardeshir's Independent Director Appointment",
            "Summary": "Greaves Cotton Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Jehangir Ardeshir as an Independent Director. The remote e-voting period runs from September 12 to October 11, 2025, with results to be declared by October 13, 2025. Mr. Ardeshir, who holds DIN 02344835, was appointed as Additional Director on August 1, 2025, and the proposed term is for five consecutive years until July 31, 2030. He is an alumnus of IIT Kharagpur and IIM Bangalore, with extensive experience in the Tata Group including positions at Tata Steel, Tata Quality Management Services, and Tata Teleservices. He currently serves as Independent Director at Cyient DLM Ltd, Walchand PeopleFirst Ltd, Premium Transmission Ltd and Premium Care Pvt Ltd. The appointment requires approval through a Special Resolution via postal ballot.",
            "Sentiment": "neutral",
            "PublishDate": 1757602147836,
            "Source": "corporate_governance"
        },
        {
            "Title": "Greaves Cotton Increases Stake in Excel Controlinkage to 80% Through Additional 10% Acquisition",
            "Summary": "Greaves Cotton Limited acquired an additional 10% stake in Excel Controlinkage Private Limited through a secondary transaction, bringing its total shareholding to 80%. Excel Controlinkage, incorporated in 1994, is a leading manufacturer of mechanical and electronic motion control systems, specializing in push pull cables, levers, and sensors for commercial vehicles, construction equipment, agriculture, and marine sectors. The company reported revenues of Rs 105 crores in FY 2020, Rs 120 crores in FY 2021, and Rs 167 crores in FY 2022. This acquisition is part of Greaves Cotton's multi-tranche acquisition strategy that began with a binding term sheet executed in February 2023, with the initial 60% stake acquisition planned and subsequent annual tranches expected to be completed by August 2026.",
            "Sentiment": "positive",
            "PublishDate": 1755016826296,
            "Source": "order&deals"
        },
        {
            "Title": "Greaves Cotton Reports Strong Q1 FY26 Results with 22% Revenue Growth and Margin Expansion",
            "Summary": "Greaves Cotton delivered robust quarterly results with standalone revenues growing 22% year-on-year to Rs. 541 crore and consolidated revenue reaching Rs. 745 crore. Standalone EBITDA increased 51% to Rs. 76 crore with margins expanding by 270 basis points, driven by improved product mix and operational efficiencies. The engineering business recorded Rs. 385 crore in revenue, supported by strong export performance which contributed 14% of total revenue, particularly from Euro-V+ auto engines and CPCB IV+ gensets. The automotive segment grew 46% year-on-year while non-auto segments increased 19%, with gensets showing 30% growth and maintaining 4% market share. Greaves Retail business grew 5% to Rs. 155 crore despite flat auto aftermarket demand, while non-auto aftermarket surged 40%. Greaves Electric Mobility reported Rs. 137 crore in revenue with 84% year-on-year retail sales growth and improved market share from 3.4% to 4.2%. The company appointed Vikas Singh as Managing Director of GEML and maintains strong cash reserves of over Rs. 400 crore. GEML has received final observations from SEBI for its IPO filing.",
            "Sentiment": "positive",
            "PublishDate": 1754409925172,
            "Source": "earnings"
        },
        {
            "Title": "Greaves Cotton Plans ₹1,500 Crore Investment, Reports 178% Rise in EV Financing",
            "Summary": "Greaves Cotton announced plans to invest ₹1,500 crore for long-term growth initiatives. The company reported a 178% increase in EV financing and experienced strong export growth. The company's e-mobility division is preparing for an IPO to enhance sustainable last-mile mobility value.",
            "Sentiment": "positive",
            "PublishDate": 1753888378939,
            "Source": "stock"
        },
        {
            "Title": "Greaves Cotton Appoints New Independent Director, Reports Q1 FY26 Results",
            "Summary": "Greaves Cotton Limited appointed Mr. Jehangir Ardeshir as Additional Director (Non-Executive, Independent) for a five-year term starting August 1, 2025, subject to shareholder approval. Mr. Ardeshir is an IIT Kharagpur and IIM Bangalore alumnus with extensive experience at Tata Group companies and currently serves as Independent Director at multiple companies. The company also announced the resignation of Independent Director Mr. Firdose Vandrevala, effective October 14, 2025, before attaining 75 years of age. For the quarter ended June 30, 2025, Greaves Cotton reported standalone revenue from operations of Rs. 540.54 crore compared to Rs. 444.87 crore in the same quarter last year. Standalone profit for the period was Rs. 56.64 crore versus Rs. 36.55 crore in the previous year quarter. On a consolidated basis, revenue from operations was Rs. 745.43 crore compared to Rs. 639.70 crore in the corresponding quarter. Consolidated profit was Rs. 20.85 crore compared to a loss of Rs. 0.16 crore in the same quarter last year. The company allotted 3,11,149 equity shares under its employee stock option plan during the period.",
            "Sentiment": "positive",
            "PublishDate": 1753861083894,
            "Source": "corporate_action"
        },
        {
            "Title": "Greaves Cotton Reports Strong Q1 Performance with Revenue Up 17% and Profit Tripling",
            "Summary": "Greaves Cotton delivered robust Q1 results with revenue rising to 7.5 billion rupees from 6.4 billion rupees year-over-year. The company's consolidated net profit surged to 331 million rupees compared to 103 million rupees in the same period last year. EBITDA more than doubled to 569 million rupees from 273 million rupees, while EBITDA margin expanded significantly to 7.64% from 4.27% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1753860529171,
            "Source": "earnings"
        },
        {
            "Title": "Greaves Cotton Reschedules Q1 FY26 Earnings Call to 4:00 PM on July 31, 2025",
            "Summary": "Greaves Cotton Limited has rescheduled its Q1 FY26 earnings conference call from 12:00 PM to 4:00 PM IST on Thursday, July 31, 2025. The call will discuss the company's financial performance for the quarter ended June 30, 2025, with results to be declared on July 30, 2025. The conference will begin with a management discussion on quarterly results followed by a Q&A session. Senior management will be present on the call. Greaves Cotton is described as a diversified engineering company with 165 years of legacy, operating through five business units including Greaves Engineering, Greaves Electric Mobility Ltd., Greaves Retail, Greaves Finance Ltd., and Greaves Technologies Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1753262921348,
            "Source": "earnings"
        },
        {
            "Title": "Greaves Electric Mobility's Eltra City Xtra Sets New Range Record at 324 KM Per Charge",
            "Summary": "Greaves Electric Mobility has launched the new Eltra City Xtra electric vehicle, which has achieved a range of 324 kilometers per charge. This performance represents a new record for the company's electric mobility division.",
            "Sentiment": "positive",
            "PublishDate": 1753259730229,
            "Source": "stock"
        },
        {
            "Title": "Greaves Cotton's Unit GEML Increases Stake in MLR Auto to 67.41%",
            "Summary": "Greaves Electric Mobility Limited (GEML), a subsidiary of Greaves Cotton, has increased its ownership in MLR Auto to 67.41% through a ₹55 crore investment in a rights issue. This move strengthens GEML's position in MLR Auto.",
            "Sentiment": "positive",
            "PublishDate": 1750386419000,
            "Source": "default"
        },
        {
            "Title": "Greaves Cotton Subsidiary Converts 950M Rupees Loan to Equity",
            "Summary": "Greaves Cotton's subsidiary, Greaves Electric, has transformed a 950 million rupees loan into equity in BAPL (presumably Bestway Agencies Private Limited, though the full name is not specified in the article). This action represents a significant financial restructuring within the company's subsidiaries.",
            "Sentiment": "neutral",
            "PublishDate": 1749121498000,
            "Source": "default"
        },
        {
            "Title": "Greaves Cotton: Q4 Profit Soars, 10% Stock Jump, ₹2 Dividend Declared",
            "Summary": "Greaves Cotton reported Q4 FY25 consolidated net profit of ₹24 crore, up from ₹2.6 crore YoY. Revenue rose 22.3% to ₹822.8 crore. EBITDA nearly doubled to ₹45.7 crore with margin improving to 5.6%. Board recommended ₹2 per share dividend. Stock surged 10.5% post-results.",
            "Sentiment": "positive",
            "PublishDate": 1746001166000,
            "Source": "earnings"
        },
        {
            "Title": "Greaves Cotton Reports Strong Q4 FY23 Results, Declares Dividend",
            "Summary": "Greaves Cotton announced its Q4 FY23 results, showing significant year-over-year improvements. The company's EBITDA increased to 457 million rupees from 239 million rupees, with EBITDA margin rising to 5.56% from 3.56%. Revenue grew to 8.23 billion rupees from 6.7 billion rupees. Consolidated net profit jumped to 240 million rupees from 26 million rupees. The company also declared a dividend of 2 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1745999066000,
            "Source": "result"
        },
        {
            "Title": "Greaves Cotton Appoints New Managing Director and Group CEO",
            "Summary": "Greaves Cotton has announced the appointment of Parag Satpute as the company's new Managing Director and Group CEO.",
            "Sentiment": "neutral",
            "PublishDate": 1744633171000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Greaves Cotton Partners with Chara Technologies for Sustainable Mobility",
            "Summary": "Greaves Cotton has formed a partnership with Chara Technologies to develop and implement rare-earth-free motor technology for sustainable mobility solutions. This collaboration aims to advance environmentally friendly transportation options by utilizing innovative motor technology that doesn't rely on rare earth materials.",
            "Sentiment": "positive",
            "PublishDate": 1744202385000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greaves Cotton Subsidiary Launches New Electric Two-Wheeler",
            "Summary": "Greaves Cotton's subsidiary has introduced a new electric two-wheeler priced at Rs 59,900. This launch represents the company's continued expansion into the electric vehicle market, particularly in the two-wheeler segment.",
            "Sentiment": "positive",
            "PublishDate": 1744176569000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greaves Cotton's Unit Enters Battery Swapping Market with Indofast Energy Partnership",
            "Summary": "Greaves Cotton's subsidiary has entered the battery swapping market by partnering with Indofast Energy. This collaboration aims to enhance last-mile mobility solutions for fleets and ride-sharing services. The partnership is expected to improve efficiency and sustainability in the transportation sector.",
            "Sentiment": "positive",
            "PublishDate": 1741241390000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greaves Cotton Confirms Voluntary Dissolution of US Subsidiary",
            "Summary": "Greaves Cotton has received confirmation from the Secretary of the State of Delaware, USA, regarding the voluntary dissolution of Greaves Technologies Inc (GTI), a step-down wholly owned subsidiary of the company. This action represents a corporate restructuring move by Greaves Cotton.",
            "Sentiment": "neutral",
            "PublishDate": 1741220785000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greaves Cotton Confirms Voluntary Dissolution of US Subsidiary",
            "Summary": "Greaves Cotton has received confirmation from the Secretary of the State of Delaware, USA, regarding the voluntary dissolution of its step-down wholly owned subsidiary, Greaves Technologies Inc (GTI).",
            "Sentiment": "neutral",
            "PublishDate": 1741182435000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greaves Cotton: Porinju Veliyath's Equity Intelligence Acquires 0.51% Stake",
            "Summary": "Equity Intelligence India Private Limited, led by Porinju Veliyath, purchased 12.52 lakh shares (0.51% stake) of Greaves Cotton for ₹29.37 crore at ₹234.63 per share. The stock price rose about 5% following the announcement, reaching an intraday high of ₹258.00.",
            "Sentiment": "positive",
            "PublishDate": 1738036596000,
            "Source": "block_deals"
        },
        {
            "Title": "Greaves Cotton Aims for ₹15,000 Crore Revenue by 2030",
            "Summary": "Greaves Cotton has set an ambitious target to achieve ₹15,000 crore (USD 2 billion) in revenue by 2030. The company plans to reach this goal through a combination of organic growth strategies and strategic acquisitions, as revealed in their investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1737686952000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greaves Cotton Reports Mixed Q3 Financial Results",
            "Summary": "Greaves Cotton, an Indian engineering company, has reported its Q3 financial results. The company's consolidated net profit decreased to 208 million rupees from 580 million rupees in the same quarter last year. However, revenue increased to 7.51 billion rupees from 6.6 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737678305000,
            "Source": "earnings"
        },
        {
            "Title": "Greaves Cotton Reports Q3 EBITDA Growth",
            "Summary": "Greaves Cotton, an engineering company, has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 394 million rupees, up from 352 million rupees in the same quarter of the previous year. However, the EBITDA margin slightly decreased to 5.29% from 5.31% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737631025000,
            "Source": "earnings"
        },
        {
            "Title": "Greaves Cotton Reports Q3 Financial Results",
            "Summary": "Greaves Cotton, an Indian engineering company, has announced its financial results for the third quarter. The company reported a consolidated net profit of 208 million rupees, which is a significant decrease from 580 million rupees in the same quarter of the previous year. However, the company's revenue increased to 7.51 billion rupees from 6.6 billion rupees year-over-year, indicating growth in sales despite the decline in profits.",
            "Sentiment": "neutral",
            "PublishDate": 1737631019000,
            "Source": "earnings"
        },
        {
            "Title": "Greaves Cotton Subsidiary Launches Enhanced Electric Scooter",
            "Summary": "Greaves Cotton's subsidiary has introduced the Magnus Neo, an upgraded version of their Magnus EX electric scooter. The new model is priced starting at ₹79,999, offering consumers an enhanced electric vehicle option in the market.",
            "Sentiment": "positive",
            "PublishDate": 1736840860000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greaves Cotton: EV Innovation Showcase at Auto Expo 2025",
            "Summary": "Greaves Cotton Limited will participate in Auto Expo 2025, unveiling new electric two- and three-wheeler vehicles and fuel-agnostic solutions. The company's electric mobility arm, GEML, recently filed for an IPO. Greaves Cotton has transformed from a traditional engine manufacturer to a diversified mobility solutions provider, aiming to impact a billion lives by 2030 through green mobility initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1736416338000,
            "Source": "normal_news"
        },
        {
            "Title": "Greaves Cotton to Showcase Products Across Business Verticals",
            "Summary": "Greaves Cotton has announced plans to exhibit products and components from various business segments including engineering, retail, and electric mobility. This move suggests the company is aiming to showcase its diverse portfolio and potentially attract new customers or investors.",
            "Sentiment": "positive",
            "PublishDate": 1736404278000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greaves Cotton to Unveil New Electric Vehicle Products at Auto Expo 2025",
            "Summary": "Greaves Cotton has announced plans to showcase a range of innovative products across its electric two-wheeler and three-wheeler portfolio at the upcoming Auto Expo – The Motor Show 2025. This move indicates the company's commitment to expanding its presence in the electric vehicle market and highlights its focus on innovation in the sector.",
            "Sentiment": "positive",
            "PublishDate": 1736404230000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greaves Cotton Block Trade on NSE",
            "Summary": "A block trade of approximately 1,020,150 shares of Greaves Cotton Limited occurred on the National Stock Exchange (NSE) at a price of Rs 312.1 per share. The total value of the transaction was Rs 31.84 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1735545230000,
            "Source": "block_deals"
        },
        {
            "Title": "Greaves Cotton: Stock Hits All-Time High Amid EV Subsidiary IPO Plans",
            "Summary": "Greaves Cotton's stock reached a lifetime high of Rs 269 on Dec. 27, 2024, up 14.40%. The surge follows its EV subsidiary, Greaves Electric Mobility, filing for an IPO to raise Rs 1,000 crore. The stock has gained 80.47% over the past year, with a 44% increase in the last month alone.",
            "Sentiment": "positive",
            "PublishDate": 1735285286000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greaves Electric Mobility Limited Files for IPO",
            "Summary": "Greaves Electric Mobility Limited, a subsidiary of Greaves Cotton, has filed for an Initial Public Offering (IPO). The company plans to issue fresh shares worth up to 10 billion rupees. According to the draft prospectus, the proceeds from the IPO will be used to develop in-house battery assembly capabilities and expand manufacturing operations.",
            "Sentiment": "positive",
            "PublishDate": 1734998860000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greaves Electric Mobility Limited Files for IPO with Fresh Issue of Shares Worth Up to 10 Billion Rupees",
            "Summary": "Greaves Electric Mobility Limited, a subsidiary of Greaves Cotton, has filed for an Initial Public Offering (IPO). The company plans to raise up to 10 billion rupees through a fresh issue of shares, according to the draft prospectus.",
            "Sentiment": "positive",
            "PublishDate": 1734965322000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greaves Cotton Approves Share Sale for GEML IPO",
            "Summary": "Greaves Cotton has approved an offer for sale of shares in Greaves Electric Mobility Limited (GEML) as part of GEML's proposed Initial Public Offering (IPO). The final number of shares to be sold will depend on market conditions and regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1733914707000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greaves Cotton: Vijay Kedia Acquires Stake, Stock Dips",
            "Summary": "Investor Vijay Kedia acquired a 0.52% stake in Greaves Cotton Ltd for ₹25 crore on December 10, 2024. The company's shares fell 2.28% to ₹246.35 on December 11. This investment precedes the upcoming IPO of Greaves Electric Mobility Ltd, a subsidiary of Greaves Cotton.",
            "Sentiment": "neutral",
            "PublishDate": 1733901444000,
            "Source": "block_deals"
        }
    ]
}