{
    "Symbol": "GREENPLY",
    "ISIN": "INE461C01038",
    "News": [
        {
            "Title": "Greenply Promoters Increase Stake by 0.05%",
            "Summary": "Karuna Investment Pvt. Ltd. acquired 57,500 additional shares of Greenply Industries through open market transactions, raising promoter group shareholding to 51.85%.",
            "Sentiment": "neutral",
            "PublishDate": 1770784857486,
            "Source": "co_actions_results"
        },
        {
            "Title": "Greenply Appoints Ashok Jaiswar as Senior VP Marketing",
            "Summary": "Greenply Industries board approves appointment of Ashok Jaiswar as Senior Vice President - Marketing and Senior Management Personnel effective February 5, 2026. Jaiswar brings 25+ years of marketing experience.",
            "Sentiment": "positive",
            "PublishDate": 1770197263723,
            "Source": "stocks"
        },
        {
            "Title": "Greenply Industries Q3 Net Profit Drops 41% YoY",
            "Summary": "Greenply Industries reported consolidated net profit of 144 million rupees in Q3, marking a significant 41% decline from 244 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1770195400785,
            "Source": "co_actions_results"
        },
        {
            "Title": "Greenply Industries Q3FY26 Earnings Call Feb 5",
            "Summary": "Greenply Industries announces earnings conference call scheduled for February 05, 2026 at 12:00 PM IST to discuss Q3FY26 and 9M FY26 operational and financial performance with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1769580850424,
            "Source": "stocks"
        },
        {
            "Title": "Greenply Industries EVP HR & Admin Resigns",
            "Summary": "Manish Bhatia, Executive Vice President - HR & Admin at Greenply Industries, resigned on January 19, 2026, to pursue opportunities outside the organization and advance his professional journey.",
            "Sentiment": "neutral",
            "PublishDate": 1769001823846,
            "Source": "stocks"
        },
        {
            "Title": "Greenply Industries faces ₹30.45L tax demand order",
            "Summary": "Greenply Industries received tax demand order from Gujarat State Tax Officer for FY 2019-20 regarding ITC claim dispute, totaling ₹30.45 lakhs including interest and penalty.",
            "Sentiment": "negative",
            "PublishDate": 1767943447047,
            "Source": "stocks"
        },
        {
            "Title": "Greenply Subsidiary Faces ₹2.21 Cr GST Demand",
            "Summary": "Greenply Industries' subsidiary Greenply Speciality Panels receives tax order demanding ₹1.22 cr additional tax, ₹87.33 lakh interest, and ₹12.16 lakh penalty for excess ITC claims in FY 2021-22.",
            "Sentiment": "negative",
            "PublishDate": 1766820672078,
            "Source": "stocks"
        },
        {
            "Title": "Greenply Industries Promoters Acquire Additional Shares Through Open Market Purchase",
            "Summary": "Karuna Investment Pvt. Ltd. and its persons acting in concert acquired 47,700 equity shares of Greenply Industries Limited through open market transactions on December 4, 2025. The acquisition increased the promoter group's total shareholding to 8,94,01,805 shares, representing 71.64% of the company's total share capital of 12,48,87,795 equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1765000929818,
            "Source": "corporate_action"
        },
        {
            "Title": "Greenply Industries Seeks Shareholder Approval for CMD Re-appointment via Postal Ballot",
            "Summary": "Greenply Industries has issued a postal ballot notice seeking shareholder approval to re-appoint Rajesh Mittal as Chairman cum Managing Director for five years from January 1, 2026 to December 31, 2030, with proposed remuneration including basic salary of Rs. 23 lakh per month and commission up to 1.5% of net profit. The e-voting period runs from November 30, 2025 to December 29, 2025, with results to be announced on December 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764412316984,
            "Source": "corporate_action"
        },
        {
            "Title": "Greenply Industries Promoter Group Increases Shareholding Through Open Market Purchase",
            "Summary": "Karuna Investment Pvt. Ltd. and its persons acting in concert have acquired additional equity shares in Greenply Industries Limited through open market transactions on November 11, 2025. The promoter group's total shareholding increased from 51.69% to 51.73% after the acquisition. The company's total equity share capital stands at 12,48,87,795 shares of face value Re. 1 each. The increase follows the recent allotment of 7,000 equity shares under the Greenply Employee Stock Option Plan 2020 to certain employees on November 4, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763011161895,
            "Source": "corporate_action"
        },
        {
            "Title": "Greenply Industries Reports 7.5% Revenue Growth in Q2 FY26 with Margin Pressures",
            "Summary": "Greenply Industries achieved consolidated quarterly revenue of INR 688.6 crores in Q2 FY26, marking 7.5% year-on-year growth. Core EBITDA stood at INR 56.8 crores with margin of 8.2%, down from 9% in the corresponding quarter. For the half-year, consolidated revenue reached INR 1,289.4 crores (5.3% growth) with EBITDA of INR 118.4 crores (2.5% growth). The plywood segment saw significant demand in mid-value segments with average realization of INR 242 per square meter, a 3.5% year-on-year decrease. MDF business revenue grew 16.1% to INR 146.8 crores with volume at 47,018 CBM, though margins declined to 8.3% due to plant expansion-related shutdowns and inventory liquidation. The company expanded MDF manufacturing capacity from 800 CBM to 1,000 CBM per day. Management expects double-digit volume growth and 16% margins in MDF for H2 FY26, while targeting 10% volume growth in plywood. Consolidated net debt stood at INR 510 crores. The furniture and fitting joint venture reported sales of INR 11.4 crores with PAT loss of INR 11.8 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1762431206376,
            "Source": "earnings"
        },
        {
            "Title": "Greenply Industries Allots 7,000 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Greenply Industries Limited allotted 7,000 equity shares of face value Re. 1 each to eligible employees who exercised their stock options under the Greenply Employee Stock Option Plan 2020. The allotment was approved by the Nomination and Remuneration Committee on November 4, 2025. Following this allotment, the company's paid-up share capital increased from Rs. 12,48,80,795 to Rs. 12,48,87,795. The newly allotted shares rank pari-passu with existing equity shares of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1762305604465,
            "Source": "corporate_action"
        },
        {
            "Title": "Greenply Industries Makes Q2 H1 FY2026 Earnings Call Recording Available",
            "Summary": "Greenply Industries Limited has made the audio recording of its Q2 H1 FY2026 earnings conference call available on its website. The group conference call was held on November 4, 2025, and can be accessed through a link provided by the company. The company informed stock exchanges BSE and NSE about the availability of this recording.",
            "Sentiment": "neutral",
            "PublishDate": 1762297440603,
            "Source": "earnings"
        },
        {
            "Title": "Greenply Industries Board Approves Re-appointment of Chairman & MD, Sanctions Rs 15 Crore Loan to Subsidiary",
            "Summary": "Greenply Industries Limited's Board of Directors approved the re-appointment of Rajesh Mittal as Chairman cum Managing Director for a further period of 5 years from January 1, 2026, subject to member approval. The Board also approved a postal ballot notice for this re-appointment with November 24, 2025 as the cut-off date for voting rights. Additionally, the Board sanctioned a loan of up to Rs 15 crores to wholly-owned subsidiary Greenply Speciality Panels Private Limited for working capital requirements. The company also released its quarterly results presentation for the quarter and half-year ended September 30, 2025, showing consolidated revenue of Rs 688.6 crores in Q2FY26 with 7.5% year-on-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1762253905379,
            "Source": "corporate_action"
        },
        {
            "Title": "Greenply Industries Reports 2% Drop in Q2 Revenue to ₹521 Crore",
            "Summary": "Greenply Industries reported revenue from operations of ₹521.05 crore for the quarter ended September 30, 2025, compared to ₹501.78 crore in the corresponding quarter of the previous year. The company's profit for the period was ₹18.20 crore versus ₹26.17 crore in the same quarter last year. For the half-year period, revenue increased to ₹959.27 crore from ₹940.88 crore, while profit declined to ₹36.76 crore from ₹55.77 crore. The company operates in plywood and allied products segment. Basic earnings per share for the quarter was ₹1.46 compared to ₹2.10 in the previous year. The Board approved these results in their meeting held on November 4, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762248196968,
            "Source": "earnings"
        },
        {
            "Title": "Greenply Industries Reports Mixed Q2 Results with Revenue Growth and Profit Decline",
            "Summary": "Greenply Industries reported consolidated net profit of 160 million rupees for Q2, down from 176 million rupees in the same period last year. The company's revenue increased to 6.88 billion rupees compared to 6.4 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1762244864448,
            "Source": "earnings"
        },
        {
            "Title": "Greenply Industries Restarts MDF Plant Operations in Vadodara with Increased Capacity",
            "Summary": "Greenply Industries has restarted manufacturing operations at its MDF (Medium Density Fiberboard) plant located in Vadodara. The plant's daily production capacity has increased from 800 CBM to 1000 CBM, representing a 25% capacity enhancement.",
            "Sentiment": "positive",
            "PublishDate": 1758262699363,
            "Source": "stock"
        },
        {
            "Title": "Greenply Industries Temporarily Pauses Specialty Panels Operations While Boosting Production Capacity",
            "Summary": "Greenply Industries will temporarily pause operations of its specialty panels division. The company is increasing its daily production capacity from 800 CBM to 1000 CBM. Market supply will continue through existing inventory during the operational pause.",
            "Sentiment": "neutral",
            "PublishDate": 1754916119716,
            "Source": "stock"
        },
        {
            "Title": "Greenply Industries Reports 2.9% Revenue Growth to ₹601 Crores in Q1 FY26, Faces June Slowdown",
            "Summary": "Greenply Industries achieved consolidated revenue of ₹601 crores with 2.9% year-on-year growth in Q1 FY26. Core EBITDA grew 6.4% to ₹62 crores with margin improving to 10.3% from 9.9% in Q1 FY25. The company faced liquidity challenges and project delays, with June being particularly subdued compared to historical trends. Plywood segment saw 3.1% volume decline year-on-year due to weak June performance, though realizations increased 4.1% to ₹255 per sqm. MDF business performed well with 11.7% revenue growth to ₹147.3 crores and EBITDA margins improving to 17.4% from 15% in the previous quarter. The company plans MDF capacity expansion in August 2025 and expects HDF flooring production to start in September 2025. Net debt increased to ₹538 crores due to inventory buildup in plywood and MDF segments. Management reduced stake in Greenply Middle East from 49% to 19%, lowering guarantee exposure from $5.8 million to $3.8 million. The furniture and fittings joint venture generated ₹6.5 crores revenue but reported ₹10.8 crores PAT loss. Management expects Q2 FY26 to outperform Q1 and remains confident about achieving double-digit MDF growth and 16%+ margins for the full year.",
            "Sentiment": "neutral",
            "PublishDate": 1754053503896,
            "Source": "earnings"
        },
        {
            "Title": "Greenply Industries Appoints Sanjiv Keshri as CFO, Approves Corporate Guarantee for Subsidiary",
            "Summary": "Greenply Industries Limited appointed Sanjiv Keshri as Chief Financial Officer and Key Managerial Personnel effective July 29, 2025. Keshri, a qualified CA with 23 years of experience including 7+ years in CFO roles, has been authorized as the 'Determining Person' for materiality assessments and appointed as Chief Investor Relations Officer. The Board also reconstituted the Risk Management Committee with four members including the new CFO. Additionally, the company approved issuing a corporate guarantee up to INR 26.50 crores for credit facilities to wholly-owned subsidiary Greenply Speciality Panels Pvt. Ltd. for capital expenditure on PVC products. The guarantee will be disclosed as contingent liability in financial statements, with no expected impact on the company as the subsidiary's financials are consolidated.",
            "Sentiment": "positive",
            "PublishDate": 1753783204549,
            "Source": "corporate_governance"
        },
        {
            "Title": "Greenply Industries Co-CEO Sets Double-Digit Volume Growth and 16%+ Margin Targets for FY26",
            "Summary": "Greenply Industries' Co-CEO has expressed confidence about the company's ability to achieve double-digit volume growth and margins exceeding 16% for FY26. The executive's optimistic outlook suggests the company expects strong operational performance in the upcoming fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1753782772575,
            "Source": "stock"
        },
        {
            "Title": "Greenply Industries Reports Mixed Q1 Results with Revenue Growth but Lower Net Profit",
            "Summary": "Greenply Industries reported Q1 revenue of 6 billion rupees, up from 5.8 billion rupees in the same period last year. The company's EBITDA increased to 616 million rupees from 579 million rupees year-over-year, with EBITDA margin improving to 10.25% from 9.92%. However, consolidated net profit declined to 285 million rupees compared to 332 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1753781971246,
            "Source": "earnings"
        },
        {
            "Title": "Greenply Industries Schedules Q1 FY26 Earnings Conference Call for July 30, 2025",
            "Summary": "Greenply Industries Limited has scheduled an earnings conference call for Q1 FY26 on July 30, 2025, at 11:00 AM IST to discuss operational and financial performance with investors and analysts. The call will be led by company representatives Mr. Manoj Tulsian (Joint Managing Director & CEO) and Mr. Sanidhya Mittal (Joint Managing Director). The company has confirmed that no unpublished price sensitive information will be shared during the event. Dial-in numbers have been provided for participation, with Asian Market Securities coordinating the call.",
            "Sentiment": "neutral",
            "PublishDate": 1753160567244,
            "Source": "earnings"
        },
        {
            "Title": "Greenply Industries to Invest Rs 113 Crore in Subsidiary GSPPL",
            "Summary": "Greenply Industries plans to infuse Rs 113 crore into its wholly owned subsidiary GSPPL. The investment is intended to repay outstanding loans while maintaining 100% ownership. The transaction is scheduled for the fiscal year 2025-26.",
            "Sentiment": "positive",
            "PublishDate": 1748933684000,
            "Source": "default"
        },
        {
            "Title": "Greenply Industries to Divest Middle East Subsidiary",
            "Summary": "Greenply Industries has approved the disinvestment of its Middle East subsidiary (GMEL) to director Indraneel Bhan for USD 491,774. This is a related-party transaction conducted at arm's length and is expected to be completed by August 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1748933526000,
            "Source": "default"
        },
        {
            "Title": "Greenply Industries Misses EBITDA Margin Guidance",
            "Summary": "Greenply Industries reported that their actual EBITDA margins for the previous year were around 13-13.5%, falling short of their guidance of approximately 16%. The company attributed this underperformance to unplanned shutdowns.",
            "Sentiment": "negative",
            "PublishDate": 1745983306000,
            "Source": "default"
        },
        {
            "Title": "Greenply Industries Provides Positive Growth Outlook",
            "Summary": "Greenply Industries has provided a positive outlook during their recent conference call. The company expects double-digit volume growth in both MDF (Medium Density Fiberboard) and plywood segments for the year. Additionally, they have set an EBITDA margin guidance of around 16% for the full year.",
            "Sentiment": "positive",
            "PublishDate": 1745982496000,
            "Source": "default"
        },
        {
            "Title": "Greenply Industries Reports Q4 Financial Results",
            "Summary": "Greenply Industries announced its Q4 consolidated net profit of 166 million rupees, down from 284 million rupees year-over-year, but up from 243.6 million rupees quarter-over-quarter. The company's Q4 revenue increased to 6.49 billion rupees from 5.99 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1745885449000,
            "Source": "default"
        },
        {
            "Title": "Greenply Industries: Q4 Profit Drops 41.5% to Rs 16.6 Crore",
            "Summary": "Greenply Industries reported a 41.45% decline in Q4 consolidated net profit to Rs 16.60 crore. Revenue from operations increased by 8.16% to Rs 648.77 crore. Plywood business showed satisfactory growth, with margins improving to 9.2%. MDF business margins rose to 15%. For FY 2024-25, profit increased by 31.12% to Rs 91.72 crore, with revenue up 14.11% to Rs 2,487.58 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1745855179000,
            "Source": "earnings"
        },
        {
            "Title": "Greenply Industries Reports Q4 Profit Increase Despite Equity Loss",
            "Summary": "Greenply Industries reported a Q4 profit before share of loss of equity accounted investees and tax from continuing operations of 461 million rupees, up from 379 million rupees year-over-year. However, the company also reported a share of loss of equity accounted investees amounting to 216 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1745847720000,
            "Source": "result"
        },
        {
            "Title": "Greenply Industries Reports Improved Margins in Q4 FY'25",
            "Summary": "Greenply Industries announced improved margins for both its MDF and plywood businesses in Q4 FY'25. The MDF business saw margins increase to 15%, with expectations to exceed 16% in FY'26 alongside increased volume sales. The plywood business margins rose to 9.2% despite higher brand promotion costs, with an aim to achieve 10%+ EBITDA margin in FY'26.",
            "Sentiment": "positive",
            "PublishDate": 1745847449000,
            "Source": "default"
        },
        {
            "Title": "Greenply Industries Reports Improved Q4 Financial Results",
            "Summary": "Greenply Industries has announced its Q4 financial results, showing improvements in key metrics. The company's EBITDA increased to 681 million rupees from 576 million rupees year-over-year. The EBITDA margin also improved to 10.49% from 9.61% in the same period. Revenue for Q4 rose to 6.49 billion rupees from 5.99 billion rupees compared to the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1745841848000,
            "Source": "result"
        },
        {
            "Title": "Greenply Industries Reports Q4 Net Profit Decline",
            "Summary": "Greenply Industries announced its Q4 consolidated net profit of 166 million rupees, showing a year-over-year decrease from 284 million rupees. However, the profit increased quarter-over-quarter from 243.6 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1745841822000,
            "Source": "result"
        },
        {
            "Title": "Greenply Industries Installs India's First Evofuge 360 Steam Recovery System",
            "Summary": "Greenply Industries has installed India's first Evofuge 360 Steam Recovery System, marking a significant step towards sustainable manufacturing in the Medium Density Fiberboard (MDF) industry. This innovative system is expected to improve energy efficiency and reduce environmental impact in MDF production.",
            "Sentiment": "positive",
            "PublishDate": 1744006528000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greenply Industries Wins Tax Appeal in High Court",
            "Summary": "Greenply Industries has announced that the High Court has dismissed an appeal by the tax department. As a result, the previously reported tax effect of 184.4 million rupees has been reduced to nil. This ruling represents a significant legal victory for the company in its tax dispute.",
            "Sentiment": "positive",
            "PublishDate": 1741259400000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Greenply Industries Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Greenply Industries has reported a decrease in its Q3 EBITDA, which fell to 540 million rupees from 568 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 8.79% from 9.15% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738843730000,
            "Source": "earnings"
        },
        {
            "Title": "Greenply Industries Reports Q3 Financial Results",
            "Summary": "Greenply Industries has announced its Q3 financial results. The company's consolidated net profit decreased to 244 million rupees from 269 million rupees year-over-year. However, revenue increased to 6.14 billion rupees from 5.8 billion rupees compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738843724000,
            "Source": "earnings"
        },
        {
            "Title": "Greenply Industries: MDF Plant Shutdown Due to Machinery Breakdown",
            "Summary": "Greenply Industries' subsidiary, Greenply Speciality Panels Pvt. Ltd., has temporarily closed its MDF plant in Gujarat due to machinery breakdown. The company expects production to resume within a few days and states the issue is not major.",
            "Sentiment": "neutral",
            "PublishDate": 1734021032000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greenply Industries: Q2 Margins Underperform Expectations",
            "Summary": "Greenply Industries' Q2 results show lower-than-anticipated margins, impacting profitability according to IDBI Capital's review.",
            "Sentiment": "negative",
            "PublishDate": 1730262243000,
            "Source": "result"
        },
        {
            "Title": "Greenply Industries Expects 50% YoY Growth in MDF Business",
            "Summary": "Greenply Industries has announced during a conference call that it anticipates achieving its overall revenue growth guidance of 50% year-over-year in its Medium Density Fiberboard (MDF) business.",
            "Sentiment": "positive",
            "PublishDate": 1730257669000,
            "Source": "normal_news"
        },
        {
            "Title": "Greenply Industries Maintains Growth and Debt Guidance",
            "Summary": "Greenply Industries has reaffirmed its financial guidance during a conference call. The company expects to maintain its revenue growth projection of 8% to 10% for the full year. Additionally, Greenply Industries has reiterated its target closing debt of 450 crore rupees for the year.",
            "Sentiment": "positive",
            "PublishDate": 1730257526000,
            "Source": "normal_news"
        },
        {
            "Title": "Greenply Industries Reports Q2 Revenue Growth",
            "Summary": "Greenply Industries, a leading plywood manufacturer, has announced its second quarter revenue for the current fiscal year. The company reported revenue of 6.4 billion rupees, compared to 6.1 billion rupees in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730103941000,
            "Source": "result"
        },
        {
            "Title": "Greenply Industries Reports Q2 EBITDA Growth",
            "Summary": "Greenply Industries has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 576 million rupees, up from 513 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 9% from 8.44% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730103454000,
            "Source": "result"
        },
        {
            "Title": "Greenply Industries Reports Q2 Profit Increase",
            "Summary": "Greenply Industries has reported a consolidated net profit of 176 million rupees for the second quarter, compared to 139 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730103416000,
            "Source": "result"
        }
    ]
}