{
    "Symbol": "GREENLAM",
    "ISIN": "INE544R01021",
    "News": [
        {
            "Title": "Greenlam Industries Q3FY26 Results Show Mixed Performance",
            "Summary": "Greenlam Industries reported Q3FY26 standalone revenue of ₹549.28 crores vs ₹534.51 crores YoY, with net profit at ₹19.91 crores. Consolidated revenue reached ₹706.37 crores but posted net loss of ₹0.59 crores due to exceptional items.",
            "Sentiment": "neutral",
            "PublishDate": 1769699079614,
            "Source": "co_actions_results"
        },
        {
            "Title": "Greenlam Industries Q3 FY26 Earnings Call on Jan 30",
            "Summary": "Greenlam Industries has scheduled its earnings call for January 30, 2026, at 3:00 PM IST to discuss Q3 and 9M FY26 operational and financial performance with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1769090339706,
            "Source": "stocks"
        },
        {
            "Title": "Greenlam Industries Corrects FY22 PAT Figure in Investor Presentation, Reports Q2FY26 Results",
            "Summary": "Greenlam Industries revised its investor presentation to correct a PAT figure error for FY22 from Rs.187.0 crores to Rs.90.6 crores, while reporting quarterly results for the period ended September 30, 2025. The company achieved highest quarterly revenues of Rs.808.3 crores with 18.7% YoY growth, driven by strong performance across laminate, plywood and chipboard segments, though net profit declined 7.7% to Rs.31.8 crores due to forex fluctuations and higher expenses.",
            "Sentiment": "neutral",
            "PublishDate": 1763533383276,
            "Source": "earnings"
        },
        {
            "Title": "Greenlam Industries Receives Export Excellence Award for Decorative Laminates",
            "Summary": "Greenlam Industries Limited received the export excellence award as the highest exporter of decorative laminates for 2023-24 and 2024-25 from The Plastic Export Promotion Council. This marks the company's sixteenth consecutive year winning the top exporter of decorative laminates award, demonstrating sustained export leadership in the segment.",
            "Sentiment": "positive",
            "PublishDate": 1763366961807,
            "Source": "stock"
        },
        {
            "Title": "Greenlam Industries Reports 18.7% Revenue Growth to Rs 808 Crores in Q2 FY26",
            "Summary": "Greenlam Industries achieved quarterly revenue of Rs 808 crores with 18.7% year-on-year growth, driven by strong performance in its core laminates business which maintained 96% utilization and 18.7% EBITDA margins. The company announced a brownfield expansion of 2 million sheets capacity at its Andhra Pradesh facility and expects commercial production by Q4 FY27, while newer segments like chipboard and plywood continue to reduce losses.",
            "Sentiment": "positive",
            "PublishDate": 1763366199639,
            "Source": "earnings"
        },
        {
            "Title": "Greenlam Industries Reports Mixed Q2 Results with Revenue Growth but Lower Profit",
            "Summary": "Greenlam Industries reported Q2 consolidated net profit of 323.3 million rupees, down from 346.2 million rupees in the same quarter last year. Revenue increased to 8.08 billion rupees compared to 6.8 billion rupees year-over-year. EBITDA rose to 1.04 billion rupees from 814.2 million rupees, while EBITDA margin improved to 12.92% from 11.96% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762626426253,
            "Source": "earnings"
        },
        {
            "Title": "Greenlam Industries Reports 51% Jump in Quarterly Profit to ₹45.89 Crores",
            "Summary": "Greenlam Industries posted a standalone net profit of ₹45.89 crores for the quarter ended September 30, 2025, representing a 51% increase from ₹30.42 crores in the same period last year. Revenue from operations grew 11% to ₹652.97 crores compared to ₹586.20 crores previously. The Laminates & Allied Products segment generated ₹550.50 crores in revenue, while Plywood & Allied Products contributed ₹102.47 crores. On a consolidated basis, the company reported revenue of ₹808.26 crores and net profit of ₹32.33 crores. The company recognized an unrealized foreign exchange loss of ₹8.32 crores in consolidated results due to revaluation of External Commercial Borrowing for imported plant machinery. Basic earnings per share stood at ₹1.80 for the quarter. The Board meeting was held on November 8, 2025, to approve the quarterly results.",
            "Sentiment": "positive",
            "PublishDate": 1762609228102,
            "Source": "earnings"
        },
        {
            "Title": "Upnishad Holdings Acquires 7.4% Stake in Greenlam Industries Through Block Deal",
            "Summary": "Upnishad Holdings Private Limited acquired 1,88,72,960 equity shares (7.397%) of Greenlam Industries Limited through block deals executed on September 12 and September 16, 2025. The shares were transferred from Hydra Trading Private Limited, which previously held this stake. The transaction involved entities acting in concert including Smiti Holding and Trading Company Private Limited and Asiana Fund I, which holds 66,89,000 shares (2.621%). After the transaction, the combined group maintains a total holding of 2,55,61,960 shares representing 10.018% of Greenlam Industries' voting capital. None of the entities involved belong to the promoter group of Greenlam Industries.",
            "Sentiment": "neutral",
            "PublishDate": 1758084387693,
            "Source": "order&deals"
        },
        {
            "Title": "Greenlam Industries Promoters Complete Inter-se Share Transfer of 56.11 Lakh Shares",
            "Summary": "Saurabh Mittal acquired 56.11 lakh equity shares of Greenlam Industries through an inter-se transfer from promoter group members Shiv Prakash Mittal and Santosh Mittal on September 15, 2025. Following this transaction, Saurabh Mittal's shareholding increased from 9.13% to 11.33%, representing 2.89 crore shares. The transfer involved 50.60 lakh shares from Shiv Prakash Mittal and 5.51 lakh shares from Santosh Mittal. Other promoter group members including Parul Mittal, Jai Mittal, Jia Mittal, and three private limited companies continue to hold their existing stakes. The total promoter group holding stands at 50.98% of Greenlam Industries' equity share capital of 25.51 crore shares.",
            "Sentiment": "neutral",
            "PublishDate": 1758083428616,
            "Source": "corporate_action"
        },
        {
            "Title": "Greenlam Industries Reports Q1 Loss of ₹15.7 Crores Amid Chipboard Plant Ramp-Up",
            "Summary": "Greenlam Industries posted a net loss of ₹15.7 crores in Q1, primarily due to a notional loss of ₹18.8 crores on euro-denominated loans for its chipboard facility. Revenue grew 11.4% year-on-year to ₹674 crores, with domestic business up 22% while international business remained flat. The company achieved 30% capacity utilization at its new chipboard plant in Andhra Pradesh and expects EBITDA margins of 18-22% at near-full capacity. Gross margins improved 110 basis points to 53.1%, but EBITDA margins declined 250 basis points to 8.1% due to initial operating costs from the chipboard business. The company maintains its 18-20% revenue growth guidance and targets ₹4,500 crores revenue over the next 3-4 years. Greenlam received government incentives worth approximately ₹40 crores over 7-10 years for its Andhra Pradesh facility and has started chipboard exports to four countries.",
            "Sentiment": "neutral",
            "PublishDate": 1755599352223,
            "Source": "stock"
        },
        {
            "Title": "Greenlam Industries Presents Expansion Strategy and Chipboard Business Update at Investor Meet",
            "Summary": "Greenlam Industries held an investor and analyst meet presenting their transformation journey and expansion plans. The company completed greenfield and brownfield expansion projects across laminate, plywood and chipboard categories with a total capital outlay of Rs. 1,450 crores from FY23-25. They expanded from 2 to 5 manufacturing facilities, increased product lines from 3 to 6, and grew their workforce from 5,000+ to 9,000+ employees. The company's addressable market expanded 3.5 times to Rs. 49,400 crores post-expansion. For Q1FY26, revenue grew 11.4% to Rs. 673.8 crores with domestic business growing 22.2% year-on-year. However, the company reported a net loss of Rs. 15.7 crores primarily due to notional forex loss of Rs. 18.8 crores on EUR denominated loan and initial operating losses from the chipboard business. The chipboard facility at Naidupeta started commercial operations and achieved 30% capacity utilization. Greenlam expects the investment to generate Rs. 4,500 crores revenue in the next 3-4 years and aims to become a leading global laminate player and India's leading wood panel player.",
            "Sentiment": "neutral",
            "PublishDate": 1754907557634,
            "Source": "stock"
        },
        {
            "Title": "Greenlam Industries Reports Q1 Loss of 154M Rupees Despite Revenue Growth",
            "Summary": "Greenlam Industries reported quarterly results showing mixed performance. The company posted a consolidated net loss of 154 million rupees compared to a profit of 203 million rupees in the same period last year. Revenue increased to 6.74 billion rupees from 6.04 billion rupees year-over-year. However, profitability metrics declined significantly with EBITDA falling to 441 million rupees from 640 million rupees, while EBITDA margin compressed to 6.54% from 10.59% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754571513336,
            "Source": "earnings"
        },
        {
            "Title": "EU Imposes Anti-Dumping Duty on Chinese Decor Paper",
            "Summary": "The European Union has imposed a definitive anti-dumping duty on Chinese decor paper. This development relates to Greenlam Industries, which operates in the decorative laminates sector.",
            "Sentiment": "neutral",
            "PublishDate": 1754538075895,
            "Source": "stock"
        },
        {
            "Title": "Greenlam Industries Reappoints Ms. Matangi Gowrishankar as Independent Women Director for Second Term",
            "Summary": "Greenlam Industries Limited has reappointed Ms. Matangi Gowrishankar as an Independent Women Director for a second term of 5 consecutive years, effective from the conclusion of the 12th AGM held on July 31, 2025. The reappointment was approved by company members based on recommendations from the Nomination, Remuneration & Compensation Committee and the Board of Directors. Ms. Gowrishankar holds a post-graduate degree in Personnel Management & Industrial Relations from XLRI and brings over four decades of leadership experience across banking, financial services, IT, manufacturing, sports and fitness, and oil and gas industries in India and overseas. She has worked with organizations including Standard Chartered Bank, Reebok India, GE, Zensar Technologies, Cummins, and bp plc, with extensive international experience in the UK and Singapore. She is not related to any other director of the company and is not debarred from holding directorial positions.",
            "Sentiment": "positive",
            "PublishDate": 1754058174292,
            "Source": "corporate_governance"
        },
        {
            "Title": "Greenlam Industries Faces Rs 7.69 Crore Tax Recovery Demand Over IGST Refund Claims",
            "Summary": "Greenlam Industries has received Show Cause Notices from the Assistant Commissioner, State Taxes & Excise Circle-III Nalagarh, Himachal Pradesh for allegedly taking incorrect IGST refunds from Customs Department during 2018-2021. The notices demand recovery of tax, penalties, and interest totaling Rs. 7.69 crores. The company is reviewing the notices and considering legal options.",
            "Sentiment": "negative",
            "PublishDate": 1753706463017,
            "Source": "stock"
        },
        {
            "Title": "Greenlam Industries' Subsidiary Receives Special Incentive Package from Andhra Pradesh Government",
            "Summary": "Greenlam Industries Limited announced that the Government of Andhra Pradesh has granted a special package of incentives to its wholly owned subsidiary, Greenlam Limited, for its Particle Board project in Naidupeta. The incentives are part of the Andhra Pradesh Industrial Development Policy 2024-2029 and cover the establishment of the existing Particle Board (Chipboard) project and future investment up to March 2029. The incentives are subject to fulfillment of certain conditions stipulated by the concerned authorities.",
            "Sentiment": "positive",
            "PublishDate": 1753705360836,
            "Source": "stock"
        },
        {
            "Title": "Andhra Pradesh Government Extends Incentives to Greenlam Industries",
            "Summary": "Greenlam Industries has received extended incentives from the Andhra Pradesh Government. No additional details about the nature, value, or duration of these incentives were provided.",
            "Sentiment": "positive",
            "PublishDate": 1753704954936,
            "Source": "stock"
        },
        {
            "Title": "Greenlam Industries Plans ₹1,147 Crore Wood Laminate Plant in Andhra Pradesh",
            "Summary": "Greenlam Industries received approval from Andhra Pradesh government to establish a wood laminate and particle board manufacturing facility in Naidupeta with an investment of ₹1,147 crore. The plant will be the largest wood laminate manufacturing facility in South India, producing 7 million sheets of high-pressure laminate and 2.9 lakh cubic meters of wood-based particle board annually. The state government approved incentives worth over ₹329 crore under the Industrial Development Policy 2024-29, including 35% capital subsidy, 2.25% annual turnover incentive, and power tariff subsidies. The facility will use German-made Continuous Press System technology from Dieffenbacher GmbH. The company targets 18-20% topline growth in FY26 despite reporting 11.4% revenue growth in FY25, below initial guidance. Greenlam shares closed 1.73% lower at ₹241 and have declined 19% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1753180787805,
            "Source": "stock"
        },
        {
            "Title": "Greenlam Industries to Invest 11.47 Billion Rupees in Andhra Pradesh",
            "Summary": "Greenlam Industries plans to invest 11.47 billion rupees to set up a wood laminate facility in Andhra Pradesh. The Andhra Pradesh state government has agreed to provide 3.29 billion rupees in incentives for the project.",
            "Sentiment": "positive",
            "PublishDate": 1752711096000,
            "Source": "default"
        },
        {
            "Title": "Greenlam Industries to Invest ₹11.47 Billion in Andhra Pradesh",
            "Summary": "Greenlam Industries plans to invest ₹11.47 billion in Andhra Pradesh to establish a wood laminate facility. The state government has offered ₹3.29 billion in incentives for this project.",
            "Sentiment": "positive",
            "PublishDate": 1752666606000,
            "Source": "default"
        },
        {
            "Title": "Greenlam Industries Faces Demand for Duties and Penalty",
            "Summary": "Greenlam Industries has been issued a demand for ₹70.5 million in duties along with a penalty of ₹141 million. The total amount demanded from the company is ₹211.5 million. No further details about the nature of the duties or the reason for the penalty were provided in the given news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1752246058000,
            "Source": "default"
        },
        {
            "Title": "Greenlam Industries Reports Q4 Financial Results",
            "Summary": "Greenlam Industries has released its Q4 financial results. The company's EBITDA for Q4 was 640 million rupees, down from 835.4 million rupees year-over-year. The EBITDA margin decreased to 9.38% from 13.39% in the same period last year. The consolidated net profit for Q4 was 21 million rupees, a significant decrease from 410 million rupees year-over-year, but an improvement from 127 million rupees quarter-over-quarter. Q4 revenue increased to 6.8 billion rupees from 6.24 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748614261000,
            "Source": "result"
        },
        {
            "Title": "Greenlam Industries: Growth Forecast Cut, Recovery Expected Next Year",
            "Summary": "Greenlam Industries has reduced its growth guidance for FY25 but anticipates a recovery in the following year.",
            "Sentiment": "neutral",
            "PublishDate": 1738581570000,
            "Source": "earnings"
        },
        {
            "Title": "Greenlam Industries Revises Growth Guidance for FY25",
            "Summary": "Greenlam Industries has adjusted its growth guidance for the fiscal year 2025. The company has lowered its projected growth rate from the previously estimated 18-20% to a more conservative 12-13%. This revision suggests a potential slowdown in the company's expansion plans or a more cautious outlook on market conditions.",
            "Sentiment": "negative",
            "PublishDate": 1738563884000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greenlam Industries Reports Q3 Results and Announces Bonus Share Issue",
            "Summary": "Greenlam Industries has reported its Q3 consolidated net profit at 127 million rupees, down from 253 million rupees year-over-year, but up from 346 million rupees quarter-over-quarter. The company's Q3 revenue increased to 6 billion rupees from 5.63 billion rupees in the same quarter last year. Additionally, Greenlam Industries has announced a bonus share issue in a 1:1 ratio.",
            "Sentiment": "neutral",
            "PublishDate": 1738284238000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greenlam Industries Announces 1:1 Bonus Share Issue",
            "Summary": "Greenlam Industries has declared a bonus share issue in the ratio of 1:1, meaning shareholders will receive one additional share for each share they currently hold. This corporate action aims to increase the number of outstanding shares without changing the company's market capitalization.",
            "Sentiment": "positive",
            "PublishDate": 1738248856000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greenlam Industries Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Greenlam Industries has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 630 million rupees, down from 711.4 million rupees in the same quarter last year. The EBITDA margin also decreased to 10.47% from 12.63% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738245527000,
            "Source": "earnings"
        },
        {
            "Title": "Greenlam Industries Reports Q3 Financial Results",
            "Summary": "Greenlam Industries has announced its Q3 financial results. The company's consolidated net profit for the quarter stands at 127 million rupees, showing a decrease from 253 million rupees year-over-year, but an increase from 346 million rupees quarter-over-quarter. The Q3 revenue is reported at 6 billion rupees, up from 5.63 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738245474000,
            "Source": "earnings"
        },
        {
            "Title": "Greenlam Industries to Consider Bonus Share Issuance",
            "Summary": "Greenlam Industries has announced a board meeting scheduled for January 30 to consider a proposal for issuing bonus shares to its shareholders. This potential corporate action could increase the number of outstanding shares without affecting the company's market capitalization, effectively distributing additional shares to existing shareholders in proportion to their current holdings.",
            "Sentiment": "positive",
            "PublishDate": 1738023352000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greenlam Industries to Consider Bonus Share Issue",
            "Summary": "Greenlam Industries has announced a board meeting scheduled for January 30 to consider a proposal for issuing bonus shares to its shareholders. This potential corporate action, if approved, would increase the number of outstanding shares without changing the company's market capitalization.",
            "Sentiment": "positive",
            "PublishDate": 1737976333000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greenlam Industries Starts Chipboard Production at New Andhra Pradesh Facility",
            "Summary": "Greenlam Industries has begun commercial production of chipboard at its new manufacturing facility in Naidupeta, Andhra Pradesh. The facility has an installed production capacity of 292,380 cubic meters per annum and has the potential to generate annual revenue of up to Rs. 750 crores when operating at full capacity.",
            "Sentiment": "positive",
            "PublishDate": 1737678146000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greenlam Industries Commences Chipboard Production in Andhra Pradesh",
            "Summary": "Greenlam Industries has started commercial production of chipboard at its new manufacturing facility in Naidupeta, Andhra Pradesh. The facility has an installed production capacity of 292,380 cubic meters per annum and has the potential to generate annual revenue of up to Rs. 750 crores when operating at full capacity.",
            "Sentiment": "positive",
            "PublishDate": 1737644923000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greenlam Industries to Consider Q3 Results",
            "Summary": "Greenlam Industries has announced that it will consider its third quarter (Q3) financial results on January 30. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737642697000,
            "Source": "earnings"
        },
        {
            "Title": "Greenlam Industries to Begin Production at New Particle Board Plant",
            "Summary": "Greenlam Industries is set to commence production at its new greenfield particle board project in Naidupeta in January. This development marks a significant expansion of the company's manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1734912748000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greenlam Industries to Start Production at New Particle Board Plant in January",
            "Summary": "Greenlam Industries has announced that its new greenfield particle board project located in Naidupeta is set to commence production in January. This development marks a significant expansion of the company's manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1734694752000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greenlam Industries: New Business Venture May Impact Profitability",
            "Summary": "HDFC Securities reports that Greenlam Industries' entry into a new business segment is expected to negatively affect the company's profitability.",
            "Sentiment": "negative",
            "PublishDate": 1733457337000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greenlam Industries Reports Q2 Financial Results",
            "Summary": "Greenlam Industries has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is 820 million rupees, compared to 756 million rupees in the same quarter last year, showing a year-over-year increase. However, the EBITDA margin has slightly decreased to 12.04% from 12.52% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1730181099000,
            "Source": "result"
        },
        {
            "Title": "Greenlam Industries Reports Q2 Financial Results",
            "Summary": "Greenlam Industries has announced its Q2 financial results. The company's consolidated net profit decreased to 346 million rupees from 390 million rupees year-over-year. However, revenue increased to 6.8 billion rupees from 6 billion rupees compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730180958000,
            "Source": "result"
        }
    ]
}