{
    "Symbol": "GREENPOWER",
    "ISIN": "INE999K01014",
    "News": [
        {
            "Title": "Orient Green Power Projects to Generate Rs. 3,600 Lakhs",
            "Summary": "Orient Green Power's Co MD announces that combined projects are expected to generate Rs. 3,600 lakhs in annual EBITDA, marking a significant milestone for the renewable energy company.",
            "Sentiment": "positive",
            "PublishDate": 1770194371641,
            "Source": "stocks"
        },
        {
            "Title": "Orient Green Power Q3 Loss Narrows to ₹214M",
            "Summary": "Orient Green Power Company Limited reported a consolidated net loss of ₹214 million in Q3, showing improvement from the previous year's loss of ₹224 million, representing a 4.46% reduction in losses year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1770194276143,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orient Green Power Unit Wins ₹85.05 Crore Wind Deal",
            "Summary": "Gamma Green Power, subsidiary of Orient Green Power, secures EPC contract with Renfra Energy for 9.9 MW wind project in Tamil Nadu, scheduled for completion by April 30, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770042679151,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orient Green Power signs ₹32.87 crore wind energy deal",
            "Summary": "Orient Green Power's subsidiary Clarion Wind Farm signed contract with Suzlon Energy for supply of 6.3 MW wind energy generators worth ₹32.87 crores for Tamil Nadu re-powering project.",
            "Sentiment": "positive",
            "PublishDate": 1769658725953,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orient Green Power Secures ₹99.42 Cr Solar EPC Deal",
            "Summary": "Delta Renewable Energy signs EPC contract with Orient Green Power for 17.6 MW solar power project in Tamil Nadu worth ₹99.42 crores, strengthening company's renewable energy portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1767026064011,
            "Source": "stocks"
        },
        {
            "Title": "Orient Green Power Wins ₹99.42 Cr Solar EPC Deal",
            "Summary": "Orient Green Power's subsidiary Delta Renewable Energy secured a ₹99.42 crore EPC contract for developing a 17.60 MW AC solar power project in Tamil Nadu, to be completed by May 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767024322448,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orient Green Power Commissions First Solar Project, Expands Beyond Wind Energy",
            "Summary": "Orient Green Power Company Limited successfully commissioned a 7 MW AC solar power project through subsidiary Delta Renewable Energy Private Limited at Krishnasamudram Village, Tamil Nadu on December 6, 2025. The project marks the company's strategic entry into solar energy sector, complementing its wind power expertise and enhancing its renewable energy portfolio to serve existing clients under the Group Captive Model.",
            "Sentiment": "positive",
            "PublishDate": 1765174510457,
            "Source": "stock"
        },
        {
            "Title": "Orient Green Power Launches 7 MW Solar Project in Tamil Nadu",
            "Summary": "Orient Green Power has launched a 7 MW AC solar power project in Tamil Nadu with completion scheduled for December 5, 2025. The project will operate under a Group Captive model, expanding the company's renewable energy portfolio in the region.",
            "Sentiment": "positive",
            "PublishDate": 1764921773720,
            "Source": "stock"
        },
        {
            "Title": "Orient Green Power's Subsidiary Beta Wind Farm Gets Credit Rating Upgrade from Infomerics",
            "Summary": "Infomerics Valuation and Rating Limited upgraded Beta Wind Farm Private Limited's long-term bank facility rating from IVR BBB-/Stable to IVR BBB/Stable, with rated debt reduced from Rs. 598.53 crore to Rs. 518.95 crore. The upgrade is based on improved PLF performance, better liquidity position, and strengthened financial risk profile, which will reduce interest rates by 25 basis points and enhance financing flexibility for Orient Green Power Company Limited.",
            "Sentiment": "positive",
            "PublishDate": 1764560566996,
            "Source": "stock"
        },
        {
            "Title": "Orient Green Power's Subsidiary Beta Wind Farm Gets Credit Rating Upgrade to IVR BBB",
            "Summary": "Infomerics Valuation and Rating upgraded Beta Wind Farm Private Limited's credit rating to IVR BBB with stable outlook from IVR BBB- for its Rs. 518.95 crore long-term bank facility. The upgraded rating indicates moderate degree of safety for timely servicing of financial obligations with moderate credit risk for Orient Green Power's material subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1764332963339,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Green Power Loses Court Appeal, Faces Rs 6.5 Crore Arbitral Award Payment",
            "Summary": "The Delhi High Court dismissed Orient Green Power Company's appeal and upheld an arbitral award of Rs 6.5 crore in favor of SM Milkose Limited, stemming from a 2008 biomass power project dispute. The company will recognize an additional provision of Rs 3.17 crore in the current quarter, having already provisioned Rs 3.33 crore, and is evaluating legal options.",
            "Sentiment": "negative",
            "PublishDate": 1764313800309,
            "Source": "stock"
        },
        {
            "Title": "Orient Green Power Reports 22% Jump in Net Profit for Q2, Eyes 1000 MW Capacity Target",
            "Summary": "Orient Green Power Company Limited reported strong quarterly results with total income rising 10% year-on-year to ₹135.45 crores and net profit increasing 22% to ₹80.94 crores. For the first half, total income grew 20% to ₹228.62 crores while net profit surged 38% to ₹109.56 crores, marking the highest half-yearly net profit in recent years. The company attributed the performance to better wind generation (60% contribution) and improved machine availability (40% contribution) after completing major maintenance upgrades. Finance costs declined over 20% due to better credit ratings and timely repayments, with the company receiving a ₹16 crore refund from lenders for excess interest charged in earlier periods. Orient Green operates 382 MW of wind assets and has 25 MW of solar projects under development, with a 7 MW solar project expected to be commissioned by December 2025. The company targets reaching 1000 MW capacity through both organic growth including repowering existing assets and potential inorganic acquisitions, though specific timelines remain uncertain. Current debt levels stand at ₹525 crores with the company expecting surplus cash flows of ₹25-30 crores for reinvestment.",
            "Sentiment": "positive",
            "PublishDate": 1762956778454,
            "Source": "earnings"
        },
        {
            "Title": "Orient Green Power Acquires Additional Shares in Subsidiary Delta Renewable Energy",
            "Summary": "Orient Green Power Company Limited has been allotted 5,13,333 equity shares at Rs. 10 per share by its subsidiary Delta Renewable Energy Private Limited in a second tranche preferential issue. The company paid Rs. 51,33,330 for the shares, which were offered out of 7,33,333 equity shares available. Despite the additional investment, Orient Green Power's equity holding in Delta remains unchanged at 70%. Delta Renewable Energy was incorporated on November 29, 2023, and has a post-issue paid-up equity share capital of Rs. 3,83,14,900. The subsidiary is developing a 7MW AC solar power project expected to be commissioned by December 2025 but has not yet commenced business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1762595811681,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Green Power Submits Monitoring Report for Rs 250 Crore Rights Issue Proceeds",
            "Summary": "Orient Green Power Company Limited submitted a monitoring agency report from CRISIL Ratings for the quarter ended September 30, 2025, regarding utilization of Rs 250 crore raised through rights issue. The report shows no deviation from disclosed objects. The company utilized proceeds for developing a 25 MW solar power project through subsidiary Delta Renewable Energy, repaying unsecured loans from subsidiaries, and general corporate purposes. Rs 11,859.78 lakh remains unutilized and is deployed in fixed deposits with banks earning returns between 2.75% to 8.10%. The company made revisions to the solar project including changes in EPC contractor and project locations within Tamil Nadu while maintaining project costs within limits.",
            "Sentiment": "neutral",
            "PublishDate": 1762476306803,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Green Power Reports Record Half-Yearly PAT Above ₹100 Crores with 20% Revenue Growth",
            "Summary": "Orient Green Power Company Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. The company achieved its highest ever half-yearly consolidated profit after tax exceeding ₹100 crores. Half-yearly turnover, EBITDA, and profit before tax increased by 20%, 16%, and 60% respectively on a year-on-year basis. The company received a refund of ₹16 crores of excess interest charged in earlier periods during the quarter. Finance costs reduced by over 20% due to reduction in interest rates contributed by prompt repayment of principal and improved ratings. The company's 7MW solar power plant is expected to be commissioned by December 2025, with balance planned capacity addition expected to be completed by June 2026. Managing Director T Shivaraman noted that generation during the quarter was consistent and continued momentum from the previous quarter enabled a 20% year-on-year increase in operating revenues during the half-year.",
            "Sentiment": "positive",
            "PublishDate": 1762329967635,
            "Source": "earnings"
        },
        {
            "Title": "Catalyst Trusteeship Receives Pledge of 22.67% Stake in Orient Green Power from Janati Bio Power",
            "Summary": "Catalyst Trusteeship Limited, acting as debenture trustee, disclosed receiving a pledge of 26,59,52,084 equity shares (22.67% stake) in Orient Green Power Company Limited from Janati Bio Power Private Limited. The pledge was created on September 30, 2025, as security for debenture holders. Orient Green Power has a total equity share capital of INR 11,73,03,16,690 comprising 1,17,30,31,669 equity shares of INR 10 each. The company's shares are listed on BSE Limited and National Stock Exchange of India Limited. Catalyst Trusteeship does not belong to the promoter group of Orient Green Power.",
            "Sentiment": "neutral",
            "PublishDate": 1759488899184,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Green Power Promoter Pledges 1 Crore Shares for Loan Facility",
            "Summary": "Janati Bio Power Private Limited, a promoter of Orient Green Power Company Limited, has pledged 1,00,00,000 shares (0.85% of total share capital) in favor of SPV Finserve Private Limited for a loan facility. The pledge was created on August 22, 2025. Janati Bio Power holds 28,59,52,084 shares representing 24.38% of Orient Green Power's total share capital. Following this transaction, the total encumbered shares increased to 2,00,00,000 shares, representing 1.70% of the company's share capital. The disclosure was made under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1756126316916,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Green Power Reports 38.6% Revenue Growth and 446% Net Profit Jump in Q1 FY26",
            "Summary": "Orient Green Power Company Limited reported strong quarterly results with total income rising 38.6% to Rs. 93.17 crores and net profit surging 446% to Rs. 28.85 crores. EBITDA grew 46.4% to Rs. 65.92 crores with margin expansion to 70.75%. The renewable energy company generated 12.46 crore units of power compared to 9.5 crore units in the previous year. Performance was driven by improved wind conditions, component upgrades of previously non-operational turbines, and reduced interest costs. The company operates wind farms across multiple Indian states and is developing 25 MW of solar capacity. Management targets expanding total capacity to 1 GW over the next couple of years through acquisitions and repowering initiatives. The company plans to repay approximately Rs. 100 crores of debt during FY26 and aims to reduce interest rates from 9.25% to 8.75%.",
            "Sentiment": "positive",
            "PublishDate": 1755965792040,
            "Source": "earnings"
        },
        {
            "Title": "Orient Green Power Schedules Q1 FY26 Results Discussion Call for August 21",
            "Summary": "Orient Green Power Company Limited has scheduled an investors and analysts call to discuss Q1 FY26 financial results on August 21, 2025 at 11:00 AM. The call will be conducted by Kirin Advisors with management speakers including T. Shivaraman (Managing Director and CEO) and J. Kotteswari (Chief Financial Officer). The company has provided dial-in numbers and registration details for participants, recommending joining 10 minutes prior to the scheduled time.",
            "Sentiment": "neutral",
            "PublishDate": 1755512569591,
            "Source": "earnings"
        },
        {
            "Title": "Orient Green Power Reports 446% Jump in Net Profit for Q1 FY26",
            "Summary": "Orient Green Power Company Limited reported strong quarterly results with net profit surging 446% to ₹28.85 crores compared to ₹5.28 crores in the same period last year. Total income grew 38.56% to ₹93.17 crores while EBITDA increased 46.39% to ₹65.92 crores. EBITDA margin improved to 70.75% from 66.97%. The company attributed the performance to early onset of wind season, consistent wind availability, and resumption of certain windmills following component upgrades. Finance costs declined over 15% due to prompt repayments and improved credit ratings. Orient Green Power entered into an EPC contract for a 7MW solar power project in Tamil Nadu and expects to develop a 25MW AC solar project across multiple locations. The company operates 382.3 MW of wind power capacity across Tamil Nadu, Andhra Pradesh, Gujarat, and Karnataka, plus a 10.5 MW wind farm in Croatia.",
            "Sentiment": "positive",
            "PublishDate": 1755490915425,
            "Source": "earnings"
        },
        {
            "Title": "Orient Green Power Reports Strong Q1 Performance with 109% Revenue Growth",
            "Summary": "Orient Green Power Company Limited reported consolidated revenue from operations of Rs 8,738 lakhs for the quarter ended June 30, 2025, compared to Rs 4,176 lakhs in the previous quarter. The company posted a consolidated profit of Rs 2,862 lakhs for the quarter versus a loss of Rs 1,509 lakhs in the previous quarter. Revenue from continuing operations increased significantly from Rs 6,257 lakhs in the same quarter last year. The Board approved both standalone and consolidated unaudited financial results along with a limited review report. The company operates in renewable power generation and has utilized Rs 10,664 lakhs from its rights issue proceeds of Rs 25,000 lakhs raised in September 2024, with Rs 14,336 lakhs remaining in fixed deposits. Basic earnings per share from total operations was Rs 0.25 for the quarter compared to Rs 0.12 in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1755184854829,
            "Source": "earnings"
        },
        {
            "Title": "Orient Green Power Subsidiary Receives Rs. 9.31 Crore from RBI Ombudsman Award",
            "Summary": "Orient Green Power Company Limited announced that its subsidiary Beta Wind Farm Private Limited received Rs. 9.31 crore on July 22, 2025, following an award from the RBI Ombudsman in a matter against Bank of Baroda. The company stated this receipt is material in financial terms and will increase profitability for the current quarter and year by Rs. 9.31 crore.",
            "Sentiment": "positive",
            "PublishDate": 1753257392306,
            "Source": "stock"
        },
        {
            "Title": "Orient Green Power Announces Release and Re-Pledge of Preference Shares in Beta Wind Farm",
            "Summary": "Orient Green Power Company has announced the release and subsequent re-pledge of preference shares in Beta Wind Farm Private Limited. This action involves the company's holdings in its subsidiary, indicating a financial or structural adjustment within the corporate group.",
            "Sentiment": "neutral",
            "PublishDate": 1750775072000,
            "Source": "default"
        },
        {
            "Title": "TANGEDCO Files Petition Against Orient Green Power Subsidiary",
            "Summary": "TANGEDCO (Tamil Nadu Generation and Distribution Corporation) has filed a petition against Clarion Wind Farm, a subsidiary of Orient Green Power. The estimated claim in the petition amounts to 726.4 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1746021300000,
            "Source": "default"
        },
        {
            "Title": "Orient Green Power Reports Q4 Financial Results",
            "Summary": "Orient Green Power has released its Q4 financial results. Revenue increased to 415 million rupees from 360.2 million rupees year-over-year. EBITDA rose to 222 million rupees from 174 million rupees, with EBITDA margin improving to 46% from 44%. However, the company still reported a consolidated net loss of 151 million rupees, though this was reduced from a loss of 252.5 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1746002322000,
            "Source": "result"
        },
        {
            "Title": "Orient Green Power Enters Agreement with MUFG Intime and Cameo Corporate",
            "Summary": "Orient Green Power Company has entered into a tripartite agreement with MUFG Intime Solutions Private Limited and Cameo Corporate Services Limited. The specifics of the agreement and its implications are not provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1742947877000,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Green Power Enters Tripartite Agreement with MUFG Intime and Cameo Corporate",
            "Summary": "Orient Green Power Company has entered into a tripartite agreement with MUFG Intime and Cameo Corporate. The details of the agreement and its implications are not provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1742906171000,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Green Power Reports Increased Net Loss in Q3",
            "Summary": "Orient Green Power Company has reported a consolidated net loss of 240 million rupees for the third quarter, compared to a loss of 210 million rupees in the same period last year. The company's revenue slightly increased to 345 million rupees from 340 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1737723361000,
            "Source": "earnings"
        },
        {
            "Title": "Tangedco Files Petition Against Orient Green Power's Clarion Wind Farm",
            "Summary": "Orient Green Power Company has announced that Tamil Nadu Generation and Distribution Corporation (Tangedco) has filed a petition against its subsidiary, Clarion Wind Farm. The nature and details of the petition are not specified in the given news snippet, but it suggests a legal or regulatory challenge between the power distribution company and the wind farm operator.",
            "Sentiment": "negative",
            "PublishDate": 1737591080000,
            "Source": "corporate_governance"
        },
        {
            "Title": "TANGEDCO Files Petition Against Orient Green Power's Subsidiary",
            "Summary": "Orient Green Power Company has announced that TANGEDCO (Tamil Nadu Generation and Distribution Corporation) has filed a petition against its subsidiary, Clarion Wind Farm. The details of the petition and its potential implications for the company are not specified in the provided news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1737551010000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Orient Green Power Reports Q2 EBITDA and Margin Growth",
            "Summary": "Orient Green Power Company Limited has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.04 billion rupees from 1.02 billion rupees in the same quarter last year. The EBITDA margin also improved, rising to 83% from 82% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731312636000,
            "Source": "result"
        },
        {
            "Title": "Orient Green Power Reports Q2 Financial Results",
            "Summary": "Orient Green Power has announced its Q2 financial results. The company reported a consolidated net profit of 665 million rupees, down from 750 million rupees in the same quarter last year. Revenue for Q2 stood at 1.2 billion rupees, slightly lower than the 1.22 billion rupees reported in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1731312629000,
            "Source": "result"
        },
        {
            "Title": "Orient Green Power Releases 13.5% Pledge",
            "Summary": "<p>Orient Green Power Company's promoter has <span class='positive'>released</span> a <span class='neutral'>pledge</span> of <b>13.5%</b> of the company's shares on <b>October 10</b>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728966871000,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Green Power Schedules Q2 Results Board Meeting",
            "Summary": "<p>Orient Green Power Company has announced a <span class='neutral'>board meeting</span> scheduled for <span class='neutral'>October 23</span> to <span class='neutral'>consider and approve</span> the <span class='neutral'>financial results</span> for the <span class='neutral'>second quarter</span> of the current <span class='neutral'>fiscal year</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728385270000,
            "Source": "result"
        }
    ]
}