{
    "Symbol": "GREENPANEL",
    "ISIN": "INE08ZM01014",
    "News": [
        {
            "Title": "Greenpanel Q3FY26 Results: Revenue Up 15.8% YoY",
            "Summary": "Greenpanel Industries reported Q3FY26 revenue of ₹41,627.22 lakhs, up 15.8% YoY. Net profit stood at ₹1,024.06 lakhs vs ₹850.41 lakhs in Q3FY25. Company recognized ₹6,218 lakhs in approved subsidies.",
            "Sentiment": "positive",
            "PublishDate": 1769766054514,
            "Source": "co_actions_results"
        },
        {
            "Title": "Greenpanel Industries Q3FY26 Results Call on Jan 30",
            "Summary": "Greenpanel Industries Limited announces conference call for investors and analysts on January 30, 2026 at 4:00 p.m. IST to discuss Q3FY26 and nine-month financial results ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769091600311,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tata Mutual Fund Increases Stake in Greenpanel Industries",
            "Summary": "Tata Mutual Fund acquired 28.05 lakh shares of Greenpanel Industries on December 24, 2025, increasing its holding from 5.06% to 7.28% through various schemes under SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1766745925568,
            "Source": "co_actions_results"
        },
        {
            "Title": "Greenpanel Launches DuroBOIL BWP HDF Product",
            "Summary": "Greenpanel Industries launches DuroBOIL BWP HDF, India's strongest and toughest high-density fibreboard with ultra-high density of 1100 kg/m³, available in 12mm and 18mm thicknesses with 25-year warranty.",
            "Sentiment": "positive",
            "PublishDate": 1765801119958,
            "Source": "stocks"
        },
        {
            "Title": "Greenpanel Industries Reports Operational Turnaround in Q2 FY26 with Strong Volume Growth",
            "Summary": "Greenpanel Industries Limited reported a significant operational recovery in Q2 FY26 after a challenging Q1. The company achieved 30.5% year-on-year growth in domestic MDF volumes and 26.8% sequential growth, while export volumes remained flat. Consolidated revenue grew 17.1% year-on-year to INR 389.4 crore. The company implemented strategic pricing realignments with peers and launched new products including HCW Outdoors, Thin MDF, and Fire Retardant MDF. Overall realization was 4% lower year-on-year, with half attributed to product mix changes and half to pricing adjustments. Operational EBITDA (excluding forex impact) reached INR 39.7 crore or 10.2% of revenues. However, reported EBITDA was INR 27.8 crore due to INR 12.5 crore adverse forex impact on Euro borrowings. The company reduced net debt by INR 60 crore and improved working capital cycle by 17 days. Management revised guidance to expect domestic MDF volume growth in high teens for FY26 and operating EBITDA margins of high single-digit to early double-digit. MDF imports dropped significantly to less than 1,000 cubic meters monthly versus 20,000 cubic meters average in previous year's second half, attributed to stricter BIS implementation.",
            "Sentiment": "positive",
            "PublishDate": 1763002395199,
            "Source": "earnings"
        },
        {
            "Title": "Greenpanel Industries Reports Strong Q2 FY26 Performance with 30.5% Volume Growth in MDF Segment",
            "Summary": "Greenpanel Industries Limited delivered robust quarterly results for Q2 FY26 with MDF domestic volumes growing 30.5% year-on-year and 26.8% quarter-on-quarter. Revenue increased to Rs 389.4 crores, up 20.7% year-on-year. The company achieved gross margin of 47.7% and operating EBITDA of 10.2% versus 4.0% in Q1 FY26. Cash conversion cycle improved to 30 days from 47 days as of June 30, 2025. Net debt reduced to Rs 173 crores from Rs 233 crores in the previous quarter. The company launched new products including HDWR Door, Thin MDF, and FR MDF during the quarter. High-value product mix increased to 61% versus 52% in Q2 FY25. Credit ratings were reaffirmed by ICRA and CARE at A+ during the quarter. The plywood segment showed recovery with 18% volume growth versus Q1 FY26. Net profit remained impacted due to foreign exchange losses on Euro-denominated borrowings for the new MDF plant in Andhra Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1762768074345,
            "Source": "earnings"
        },
        {
            "Title": "Greenpanel Industries Reports Q2 Net Loss of 61M Rupees Against Previous Year's Profit",
            "Summary": "Greenpanel Industries reported a net loss of 61 million rupees in Q2, compared to a profit of 185 million rupees in the same quarter last year. The company's EBITDA declined to 248 million rupees from 299 million rupees year-over-year, with EBITDA margin falling to 6.26% from 8.87%. However, revenue increased to 3.9 billion rupees from 3.4 billion rupees compared to the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762765304036,
            "Source": "earnings"
        },
        {
            "Title": "Greenply Industries Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Greenply Industries reported Q2 EBITDA of 567 million rupees, down from 576 million rupees in the same quarter last year. The company's EBITDA margin also decreased to 8.24% from 9% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762244854593,
            "Source": "earnings"
        },
        {
            "Title": "Greenpanel Industries Shares Surge 17% on Record Trading Volumes",
            "Summary": "Greenpanel Industries shares gained 13% on Thursday, September 11, marking the fourth consecutive session of gains and the largest single-day increase since November 2019. The stock traded on record volumes with 1.5 crore shares changing hands, significantly above the 20-day average of 65,000 shares. The stock broke above its 50-day moving average of ₹283 and 200-day moving average of ₹290, reaching ₹321. Despite the recent rally, shares remain down 18% year-to-date following a 12% decline in 2024. The stock's RSI reached 73, indicating overbought conditions. Among 20 analysts covering the stock, 10 have buy ratings, 7 recommend hold, and 3 suggest sell.",
            "Sentiment": "positive",
            "PublishDate": 1757583205795,
            "Source": "stock"
        },
        {
            "Title": "Greenpanel Industries Submits Missing Resignation Letter of Chief Information Officer",
            "Summary": "Greenpanel Industries submitted the resignation letter of Jayanta Bhowmik, Chief Information Officer, to the stock exchange after acknowledging it was inadvertently omitted from previous communications. Bhowmik's resignation was effective from August 7, 2025, and had been disclosed to exchanges on July 30, 2025 and August 8, 2025. The company stated the omission was purely inadvertent and reaffirmed its commitment to regulatory compliance and corporate governance standards. According to internal records, Bhowmik joined the company on December 26, 2022, submitted his resignation on May 29, 2025, citing better career opportunities, and completed a 60-day notice period with no shortfall.",
            "Sentiment": "neutral",
            "PublishDate": 1755535760954,
            "Source": "corporate_governance"
        },
        {
            "Title": "Greenpanel Industries Appoints Vineet Bansal as Chief Information Officer",
            "Summary": "Greenpanel Industries Limited announced senior management changes with Vineet Bansal being appointed as Chief Information Officer effective August 8, 2025. Bansal replaces Jayanta Bhowmik, who resigned from the position effective August 7, 2025, citing better career opportunities. The Board of Directors approved Bansal's appointment on July 30, 2025, based on the Nomination and Remuneration Committee's recommendation. Bansal brings 29 years of experience in digital transformation, ERP implementations, IT governance, AI, cybersecurity, and infrastructure optimization. He has previously worked with companies including Surya Roshni Ltd., Greenply, and Mankind Pharma. Bansal is not related to any director of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1754641830568,
            "Source": "corporate_governance"
        },
        {
            "Title": "Greenpanel Industries Reports Challenging Q1 FY26 with Revenue Decline and Margin Pressure",
            "Summary": "Greenpanel Industries reported consolidated revenues of Rs. 323 crore for the quarter ended June 30, 2025, with MDF revenue declining 12% year-on-year. The company faced multiple headwinds including an 8.5% decline in domestic MDF volumes due to discontinuation of 37,000 cubic meters of commercial-grade MDF sales post-BIS implementation, though like-for-like domestic sales grew 47%. Export volumes fell 40% year-on-year due to geopolitical disruptions in the Middle East. The company reported negative EBITDA of Rs. 12.4 crore and negative PAT of Rs. 34.6 crore, impacted by Rs. 27.6 crore forex loss on Euro borrowings and stabilization costs from the new thin panel plant in Andhra Pradesh. Consolidated operating EBITDA excluding currency impact was Rs. 13 crore or 4% of revenues. Gross margins improved to 47% due to 7% sequential decline in timber prices. Management maintained volume and margin guidance despite pricing pressures, focusing on market share recovery through cost optimization and operating leverage. The company noted positive industry trends including reduced imports, no major capacity additions expected, and stricter BIS implementation for smaller players from August.",
            "Sentiment": "negative",
            "PublishDate": 1754329080632,
            "Source": "earnings"
        },
        {
            "Title": "Greenpanel Industries Plans Production Expansion and Product Mix Shift Despite Margin Pressure",
            "Summary": "Greenpanel Industries is implementing a strategic plan to increase MDF production and transition toward higher value products while boosting exports. The company experienced a short-term margin decline following the launch of a new plant. Management is focusing on cost reduction measures and network expansion to support growth objectives. The company aims to achieve MDF capacity of 891,000 CBM.",
            "Sentiment": "neutral",
            "PublishDate": 1753888802349,
            "Source": "stock"
        },
        {
            "Title": "DGGI Conducts Search Operations at Greenpanel Industries' Facilities",
            "Summary": "The Directorate General of GST Intelligence (DGGI), Meerut Zonal unit conducted search proceedings at Greenpanel Industries Limited's registered office in Gurugram, manufacturing unit in Uttarakhand, and guest house in Delhi. The searches commenced on July 29 and concluded on July 30, 2025. During the proceedings, officials requisitioned various documents and seized certain electronic gadgets for investigation purposes. The company provided authenticated printouts of documents as requested by officials. No official document regarding violations has been issued, and the financial impact cannot be determined in the absence of any official notice or order.",
            "Sentiment": "negative",
            "PublishDate": 1753880863115,
            "Source": "stock"
        },
        {
            "Title": "Greenpanel Industries Reports Loss of ₹3,462 Lakhs in Q1 FY2026, Appoints New CIO",
            "Summary": "Greenpanel Industries Limited announced its quarterly results for the quarter ended June 30, 2025, reporting a net loss of ₹3,462.36 lakhs compared to a profit of ₹1,571.49 lakhs in the same quarter last year. Revenue from operations declined to ₹32,819.35 lakhs from ₹36,495.12 lakhs year-on-year. The company faced significant foreign exchange losses of ₹2,754.27 lakhs due to adverse EURO-INR exchange rate movement from 92.06 to 100.50, primarily affecting its EUR 32.32 million ECB loan. The company operates in two segments: plywood and allied products (₹3,145.10 lakhs revenue) and medium density fibreboards and allied products (₹29,674.25 lakhs revenue). In management changes, Mr. Vineet Bansal was appointed as Chief Information Officer effective August 8, 2025, replacing Mr. Jayanta Bhowmik who resigned for career advancement. Bansal brings 29 years of experience in digital transformation and has previously worked with Surya Roshni Ltd., Greenply, and Mankind Pharma.",
            "Sentiment": "negative",
            "PublishDate": 1753870862603,
            "Source": "earnings"
        },
        {
            "Title": "Greenpanel Industries Reports Q1 Loss as EBITDA Swings to Negative Territory",
            "Summary": "Greenpanel Industries reported a net loss of 346 million rupees in Q1, compared to a profit of 157 million rupees in the same period last year. The company's EBITDA turned negative at a loss of 158 million rupees, versus a gain of 360 million rupees year-over-year. Revenue declined to 3.3 billion rupees from 3.6 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1753869587549,
            "Source": "earnings"
        },
        {
            "Title": "Greenpanel Industries: Q4 Results Show Mixed Performance with EPCG Grant Boost",
            "Summary": "Greenpanel's Q4 MDF revenue declined 15% YoY due to a 20% drop in volumes, despite 34% growth in exports. Domestic volumes fell 25% YoY following discontinuation of commercial grade MDF. Realizations improved 6% YoY, with domestic and export realizations up 7% and 10% respectively. IDBI Capital maintains a Hold rating.",
            "Sentiment": "neutral",
            "PublishDate": 1747994926000,
            "Source": "earnings"
        },
        {
            "Title": "Greenpanel Industries Reports Q4 Financial Results",
            "Summary": "Greenpanel Industries has released its Q4 financial results. The company reported an EBITDA of 479.5 million rupees, down from 515.5 million rupees year-over-year. The EBITDA margin was 12.8%, slightly lower than the previous year's 13%. Revenue for Q4 stood at 3.75 billion rupees, a decrease from 3.97 billion rupees in the same quarter last year. The standalone net profit for Q4 was 293.9 million rupees, compared to 298 million rupees year-over-year and 85 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747912844000,
            "Source": "result"
        },
        {
            "Title": "Greenpanel Industries Commences Trial Production at New MDF Plant",
            "Summary": "Greenpanel Industries has announced the commissioning of its new Medium Density Fiberboard (MDF) plant in Tirupati district. The company has begun trial production of thin MDF range at this facility.",
            "Sentiment": "positive",
            "PublishDate": 1740572539000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greenpanel Industries Reports Significant Decline in Q3 EBITDA",
            "Summary": "Greenpanel Industries has reported a substantial decrease in its Q3 EBITDA, which fell to 174 million rupees from 600 million rupees year-over-year. The company's EBITDA margin also declined sharply, dropping to 4.83% from 15.56% in the same period last year. This significant reduction in both EBITDA and EBITDA margin indicates a challenging quarter for the company.",
            "Sentiment": "negative",
            "PublishDate": 1738835654000,
            "Source": "earnings"
        },
        {
            "Title": "Greenpanel Industries Reports Q3 Revenue Decline",
            "Summary": "Greenpanel Industries has reported a revenue of 3.6 billion rupees for the third quarter, compared to 3.86 billion rupees in the same period last year, indicating a year-over-year decline in revenue.",
            "Sentiment": "negative",
            "PublishDate": 1738835641000,
            "Source": "earnings"
        },
        {
            "Title": "Greenpanel Industries Reports 69% Decline in Q3 Net Profit",
            "Summary": "Greenpanel Industries has reported a net profit of 85 million rupees for the third quarter, marking a significant 69% decrease compared to the 277 million rupees reported in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738835621000,
            "Source": "earnings"
        },
        {
            "Title": "Greenpanel Industries to Consider Q3 Results",
            "Summary": "Greenpanel Industries has announced that it will consider its third quarter (Q3) financial results on February 6. This indicates the company is preparing to release its earnings report for the latest fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738161394000,
            "Source": "earnings"
        },
        {
            "Title": "Greenpanel Industries Secures €15 Million Credit Facility from Proparco",
            "Summary": "Greenpanel Industries has entered into a loan agreement with Proparco, securing a credit facility of up to €15 million. This financial arrangement indicates the company's efforts to strengthen its capital position and potentially fund expansion or operational improvements.",
            "Sentiment": "positive",
            "PublishDate": 1733101026000,
            "Source": "corporate_action"
        },
        {
            "Title": "Greenpanel Industries Reports Significant Drop in Q2 EBITDA",
            "Summary": "Greenpanel Industries has reported a substantial decrease in its Q2 EBITDA, which fell to 299 million rupees from 691 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 8.87% from 17.33% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730119389000,
            "Source": "result"
        },
        {
            "Title": "Greenpanel Industries Reports Q2 Financial Results",
            "Summary": "Greenpanel Industries announced its Q2 financial results. The company's net profit decreased to 185 million rupees, down from 408 million rupees year-over-year and 157 million rupees quarter-over-quarter. Revenue for Q2 was 3.4 billion rupees, a decrease from 3.99 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1730119327000,
            "Source": "result"
        }
    ]
}