{
    "Symbol": "GRINFRA",
    "ISIN": "INE201P01022",
    "News": [
        {
            "Title": "GR Infraprojects Wins ₹1897.51 Cr Railway Project",
            "Summary": "GR Infraprojects Limited emerged as L-1 bidder for West Central Railway's ₹1897.51 crore railway construction project in Madhya Pradesh with 900-day completion timeline.",
            "Sentiment": "positive",
            "PublishDate": 1770815990096,
            "Source": "co_actions_results"
        },
        {
            "Title": "GR Infraprojects Board Meet on Feb 13 for Dividend",
            "Summary": "GR Infraprojects Limited has scheduled a board meeting on February 13, 2026, to consider interim dividend for FY26. Record date fixed as February 19, 2026, with trading window closure from February 11-17.",
            "Sentiment": "positive",
            "PublishDate": 1770733361133,
            "Source": "co_actions_results"
        },
        {
            "Title": "G R Infraprojects Q3 FY26 Results Show Strong Growth",
            "Summary": "G R Infraprojects reported consolidated revenue of ₹234,313.66 lakhs for Q3 FY26, up from ₹179,737.76 lakhs in Q3 FY25. Net profit after tax increased to ₹25,874.93 lakhs compared to ₹26,259.08 lakhs in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770716795312,
            "Source": "co_actions_results"
        },
        {
            "Title": "GR Infraprojects Board Meet Set for Feb 6, 2026",
            "Summary": "GR Infraprojects Limited has scheduled a board meeting on February 6, 2026, to consider and approve unaudited financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769791417508,
            "Source": "co_actions_results"
        },
        {
            "Title": "GR Infraprojects wins ₹488 cr NTPC BESS project",
            "Summary": "GR Infraprojects emerges as L1 bidder for ₹487.77 crore Battery Energy Storage System project at NTPC's Mouda plant in Maharashtra with 15-month completion timeline.",
            "Sentiment": "positive",
            "PublishDate": 1768587371403,
            "Source": "co_actions_results"
        },
        {
            "Title": "GR Infraprojects clarifies delayed disclosure timeline",
            "Summary": "GR Infraprojects Limited submits additional details to BSE regarding delayed disclosure of senior management resignation, citing ambiguity in regulatory timeline interpretation.",
            "Sentiment": "neutral",
            "PublishDate": 1767960886914,
            "Source": "stocks"
        },
        {
            "Title": "GR Infraprojects Gets Completion Certificate for NH Project",
            "Summary": "GR Infraprojects' subsidiary receives Provisional Completion Certificate-II for additional 13.895 km section of Bilaspur-Urga highway project under Bharatmala Pariyojana, bringing total completed length to 69.015 km.",
            "Sentiment": "positive",
            "PublishDate": 1767863521419,
            "Source": "stocks"
        },
        {
            "Title": "GR Infraprojects Senior Executive Resigns",
            "Summary": "GR Infraprojects announces resignation of President-Corporate Affairs Sibanarayan Nayak, effective December 31, 2025, citing desire for relaxed work life and social engagements.",
            "Sentiment": "neutral",
            "PublishDate": 1767684952360,
            "Source": "stocks"
        },
        {
            "Title": "GR Infraprojects Completes ₹1,085 Cr Gujarat Highway",
            "Summary": "GR Infraprojects subsidiary receives provisional completion certificate for NH-341 upgradation project from Bhimasar to Bhuj Airport Junction spanning 65.478 km in Gujarat under hybrid annuity mode.",
            "Sentiment": "positive",
            "PublishDate": 1766568357341,
            "Source": "stocks"
        },
        {
            "Title": "GR Infraprojects Receives Provisional Completion Certificate for Maharashtra Expressway Project",
            "Summary": "GR Infraprojects Limited announced that its wholly owned subsidiary GR Shirsad Masvan Expressway Private Limited received a provisional completion certificate for the construction of an eight-lane expressway project in Maharashtra under Bharatmala Pariyojana. The project, with a bid cost of INR 2747.00 crores, was declared fit for commercial operation with effect from 15 July 2025 by the Independent Engineer on 08 December 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765195470233,
            "Source": "stock"
        },
        {
            "Title": "G R Infra Receives Completion Certificate for Vadodara Mumbai Expressway Section",
            "Summary": "G R Infra has obtained a completion certificate for a portion of the Vadodara Mumbai Expressway project. This milestone indicates successful completion of construction work for the designated section of the infrastructure project.",
            "Sentiment": "positive",
            "PublishDate": 1765195176933,
            "Source": "stock"
        },
        {
            "Title": "G R Infraprojects Secures ₹290.23 Crore EPC Contract for Giridih Bypass Road Construction",
            "Summary": "G R Infraprojects Ltd has executed an EPC agreement for the construction of Giridih Bypass Road valued at ₹290.23 crores. The infrastructure project is scheduled for completion within 24 months, adding to the company's project portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1765151572246,
            "Source": "stock"
        },
        {
            "Title": "G R Infraprojects Secures ₹290.23 Crore EPC Contract for Giridh Bypass Road",
            "Summary": "G R Infraprojects Ltd has signed an EPC (Engineering, Procurement and Construction) contract worth ₹290.23 crore to build the Giridh Bypass Road. The infrastructure project is scheduled for completion within 24 months, adding to the company's construction portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1764936917450,
            "Source": "order&deals"
        },
        {
            "Title": "GR Infra Projects Receives Appointed Date for INR 826.28 Crore Railway Project",
            "Summary": "GR Infra Projects Limited received notification from Western Railways declaring November 15, 2025 as the appointed date for an EPC tender worth INR 826.28 crores for gauge conversion of 38.900 km track section. The project involves comprehensive railway infrastructure work including track conversion, bridges, stations and associated facilities with a completion period of 730 days from the appointed date.",
            "Sentiment": "positive",
            "PublishDate": 1763472084184,
            "Source": "order&deals"
        },
        {
            "Title": "GR Infra Projects Reports 9.4% Revenue Growth in Q2 FY26, Chairman Resigns Due to Health Issues",
            "Summary": "GR Infra Projects Limited reported standalone revenue of INR 1,234 crores in Q2 FY26, up 9.36% year-on-year, while EBITDA margin declined to 9.76% from 10.39% in the previous year. Chairman Vinod Kumar Agarwal resigned from his position due to health reasons after three decades with the company, as the infrastructure firm targets INR 20,000-25,000 crores in new project wins for the current year.",
            "Sentiment": "neutral",
            "PublishDate": 1763066219645,
            "Source": "earnings"
        },
        {
            "Title": "G R Infra Sets Ambitious Growth Targets with INR 20,000-25,000 Crores Order Expectations for FY26",
            "Summary": "G R Infra aims to secure INR 5,000-8,000 crores in annual orders for its transmission segment over the next 2-3 years. The company expects order inflow of INR 20,000-25,000 crores for FY26 and plans capital expenditure of around INR 100 crores, having already spent INR 50 crores in the first half. G R Infra projects 5-6% revenue growth for FY26 and targets 15% growth for FY27, with the higher target dependent on securing the anticipated INR 20,000-25,000 crores in orders for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1762918670842,
            "Source": "stock"
        },
        {
            "Title": "GR Infra Projects Chairman Vinod Kumar Agarwal Resigns Due to Health Reasons",
            "Summary": "Vinod Kumar Agarwal has resigned from his position as Chairman and Whole-time Director of GR Infra Projects Limited, effective November 10, 2025. Agarwal cited health reasons that have constrained his ability to devote the required time and attention to the company. He has been associated with the company since its inception in 1995, serving as one of its founders and promoters for nearly three decades. In his resignation letter, Agarwal expressed gratitude to the Board, management, employees, and shareholders for their support throughout his tenure. The company has informed stock exchanges BSE and NSE about the directorate change as required under SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762791304865,
            "Source": "corporate_governance"
        },
        {
            "Title": "G R Infraprojects Reports 7% Growth in Q2FY26 Revenue and PAT, Guides Multi-Year Growth with ₹21,114 Cr Order Book",
            "Summary": "G R Infraprojects reported Q2FY26 revenue of ₹13.5 billion, marking a 7% year-over-year increase. The company's profit after tax also grew 7% year-over-year to ₹1.3 billion. The infrastructure company maintains an order book worth ₹21,114 crore and is expanding into power, rail, and metro segments. The company has monetized 9 HAM (Hybrid Annuity Model) assets to strengthen its balance sheet. G R Infraprojects is focusing on design-led execution, working capital optimization, and backward integration strategies to drive margins and enable faster project delivery.",
            "Sentiment": "positive",
            "PublishDate": 1762790948433,
            "Source": "earnings"
        },
        {
            "Title": "G R Infraprojects Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "G R Infraprojects reported Q2 consolidated net profit of 1.9 billion rupees, down from 1.94 billion rupees in the same period last year. The company's revenue increased to 16 billion rupees compared to 13.94 billion rupees year-over-year. EBITDA rose to 3.57 billion rupees from 3.5 billion rupees, while EBITDA margin declined to 22.29% from 25.32% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762788463688,
            "Source": "earnings"
        },
        {
            "Title": "G R Infraprojects Completes Rs 365 Crore Bangalore Metro Construction Project",
            "Summary": "G R Infraprojects Limited completed construction of elevated structures and stations for a 7.50 km stretch of the Bangalore Metro Rail Project Phase-2. The project, valued at Rs. 364,87,65,045, involved construction from Gottigere to Swagath Road Cross including five metro stations: Gottigere, Hulimavu, IIMB, JP Nagar 4th Phase, and Swagath Road Cross. Bangalore Metro Rail Corporation Ltd issued the Taking Over Certificate on October 8, 2025, with the project completion effective from September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760447702801,
            "Source": "stock"
        },
        {
            "Title": "Income Tax Department Conducts Search Operation at G R Infraprojects Limited",
            "Summary": "The Income Tax Department conducted a search operation at G R Infraprojects Limited from October 9-14, 2025. The search covered the company's registered office, head office, corporate office, and other locations, along with residences of promoters, promoter group members, the Chief Financial Officer, and some employees. The company cooperated with the proceedings and stated that business operations remain unaffected and continue as usual. Details of any violations cannot be ascertained at this time, and the financial impact is not quantifiable in monetary terms currently.",
            "Sentiment": "neutral",
            "PublishDate": 1760441635669,
            "Source": "stock"
        },
        {
            "Title": "G R Infraprojects Secures ₹2.90 Billion Contract",
            "Summary": "G R Infraprojects has secured a contract valued at ₹2.90 billion.",
            "Sentiment": "positive",
            "PublishDate": 1759930801749,
            "Source": "stock"
        },
        {
            "Title": "G R Infraprojects Promoters Complete Inter-se Share Transfer Among Family Members",
            "Summary": "G R Infraprojects Limited disclosed an inter-se transfer of equity shares among promoter and promoter group members on September 29, 2025. The transfer involved multiple members of the Agarwal family, including Devki Nandan Agarwal, Vinod Kumar Agarwal, Mahendra Agarwal, Ajendra Agarwal, and Purshottam Agarwal, along with their respective family HUFs. The transaction involved approximately 26.87 lakh shares representing 2.78% of the company's total share capital. The promoter group's aggregate shareholding remained unchanged at 26.60% as no additional voting rights were acquired. The company stated this was part of realignment of shareholding amongst family members and did not affect public shareholders' interests. Additionally, similar inter-se transfers occurred in six promoter group companies including Lokesh Builders Private Limited, Jasamrit Construction Private Limited, and four other Jasamrit group entities.",
            "Sentiment": "neutral",
            "PublishDate": 1759338437163,
            "Source": "corporate_action"
        },
        {
            "Title": "G R Infraprojects Acquires Rajgarh Neemuch Power Transmission Limited for Rs 188.8 Crore",
            "Summary": "G R Infraprojects Limited has acquired Rajgarh Neemuch Power Transmission Limited for Rs 18.88 crore through a Share Purchase Agreement with REC Power Development and Consultancy Limited. The acquisition makes RNPTL a wholly owned subsidiary of G R Infraprojects. The company acquired all 50,000 equity shares of Rs 10 each through itself and six nominees. The acquisition was required as a condition for a power transmission project involving evacuation of power from renewable energy projects in Rajgarh (1500 MW) and Neemuch (1000 MW) in Madhya Pradesh. RNPTL operates in the power transmission and distribution sector and was incorporated on June 17, 2025, with an authorized and paid-up share capital of Rs 5 lakh. The transaction does not qualify as a related party transaction and promoters have no interest in the acquired entity.",
            "Sentiment": "positive",
            "PublishDate": 1759213801261,
            "Source": "corporate_action"
        },
        {
            "Title": "G R Infraprojects Acquires Power Transmission Company, Divests Highway Subsidiary",
            "Summary": "G R Infraprojects Limited's board approved two major transactions: the acquisition of 100% equity shares in Rajgarh Neemuch Power Transmission Limited and the divestment of its wholly owned subsidiary GR Bahadurganj Araria Highway Private Limited. The power transmission company acquisition follows G R Infraprojects emerging as the lowest bidder for transmission system projects in Rajgarh (1500 MW) and Neemuch (1000 MW) renewable energy zones in Madhya Pradesh. The target company has an authorized and paid-up share capital of Rs. 5 lakh, divided into 50,000 equity shares of Rs. 10 each, and was incorporated on June 17, 2025. The highway subsidiary being divested contributed Rs. 23,848.15 lakhs (3.14%) to consolidated income and Rs. 3,840.69 lakhs (0.45%) to consolidated net worth as of March 31, 2025. Indus Infra Trust has made a non-binding counteroffer to acquire the highway subsidiary along with assignment of unsecured loans. Both transactions are expected to complete by specific deadlines - the acquisition by October 31, 2025, and the divestment by November 30, 2025, subject to due diligence and regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1758882053333,
            "Source": "corporate_action"
        },
        {
            "Title": "G R Infraprojects Expands Business Scope to Include Energy and Solar Solutions",
            "Summary": "G R Infraprojects has expanded its business scope by amending its Memorandum of Association to include energy, solar, water infrastructure, and advanced power solutions. This strategic move broadens the company's operational focus beyond its existing business activities.",
            "Sentiment": "positive",
            "PublishDate": 1758500540824,
            "Source": "stock"
        },
        {
            "Title": "G R Infraprojects Shareholders Approve Expansion of Business Scope in Infrastructure and Energy Sectors",
            "Summary": "G R Infraprojects Limited shareholders approved alterations to the Object clause of the company's Memorandum of Association at the Annual General Meeting held on September 19, 2025. The amendments expand the company's business scope to include emerging opportunities in infrastructure and energy sectors. Key changes include enhanced power generation capabilities covering solar, battery energy storage systems, pump storage projects, hybrid power plants, solar inverters, batteries, and advanced metering infrastructure. The company also added manufacturing of electric panels, cabinets, and electrical equipment to its business activities. The modifications aim to provide clearer scope for various business operations and align with opportunities in infrastructure and energy sectors.",
            "Sentiment": "positive",
            "PublishDate": 1758287009979,
            "Source": "corporate_action"
        },
        {
            "Title": "G R Infraprojects Re-appoints Two Directors for Five-Year Terms Starting April 2026",
            "Summary": "G R Infraprojects Limited shareholders approved the re-appointment of two directors at their 29th Annual General Meeting held on September 19, 2025. Vikas Agarwal was re-appointed as Wholetime Director and Rajendra Kumar Jain as Independent Director, both for second terms of five consecutive years effective from April 1, 2026 to March 31, 2031. Agarwal has over 21 years of experience in road construction and oversees the company's running projects. Jain is a Corporate Advisor specializing in GST and Corporate Law with more than 30 years of post-qualification experience and serves as Honorary Secretary General of Mewar Chamber of Commerce & Industry. Both directors are not related to any other company directors and are not debarred from holding directorial positions.",
            "Sentiment": "neutral",
            "PublishDate": 1758286110351,
            "Source": "corporate_governance"
        },
        {
            "Title": "GR Infraprojects Subsidiary Completes Maharashtra Highway Project Worth ₹907 Crore",
            "Summary": "GR Infraprojects Limited announced that its wholly owned subsidiary GR Govindpur Rajura Highway Private Limited has provisionally completed a four-laning highway project on NH-353B in Maharashtra. The project involves upgrading a 56.101 km stretch from Govindpur to Rajura with a bid cost of ₹907 crore under the Hybrid Annuity Mode. The Independent Engineer issued a Provisional Completion Certificate on September 12, 2025, declaring the project fit for commercial operation from September 11, 2025. The project was originally appointed on October 17, 2022.",
            "Sentiment": "positive",
            "PublishDate": 1757684931221,
            "Source": "stock"
        },
        {
            "Title": "G R Infraprojects Secures ₹367 Crore Transmission Project in Madhya Pradesh",
            "Summary": "G R Infraprojects Limited received a Letter of Intent from REC Power Development and Consultancy Limited for establishing a transmission system to evacuate power from renewable energy projects in Madhya Pradesh. The project involves transmission systems for Rajgarh (1500 MW) SEZ Phase III and Neemuch (1000 MW) SEZ Phase II. The contract includes annual transmission charges of Rs. 3670.73 million with a 24-month completion timeline and 35-year operations and maintenance period under BOOT model. The project encompasses establishment of substations, creation of bus sections, transformer capacity augmentation, and construction of various transmission lines and equipment across multiple locations including Handiya, Neemuch, and Pachora.",
            "Sentiment": "positive",
            "PublishDate": 1756300889042,
            "Source": "stock"
        },
        {
            "Title": "GR Infraprojects Emerges as Top Bidder for ₹3.6 Billion Project",
            "Summary": "GR Infraprojects has become the top bidder for a project valued at ₹3.6 billion. The company has secured the leading position in the bidding process for this infrastructure project.",
            "Sentiment": "positive",
            "PublishDate": 1755151254699,
            "Source": "stock"
        },
        {
            "Title": "G R Infraprojects Reports Mixed Q1 FY2026 Results with Revenue Decline but Improved Profitability",
            "Summary": "G R Infraprojects Limited reported Q1 FY2026 results with standalone revenue declining 3.7% to ₹1,826.14 crores and consolidated revenue down 2% to ₹1,988 crores. However, consolidated EBITDA margin improved to 20% from 18% in the previous year, while standalone PAT surged to ₹1,216 crores from ₹152 crores. The company maintains a strong order book of ₹23,700 crores with 24 projects worth ₹15,000 crores under execution. Management targets order inflows of ₹22,000 crores for FY2026 and ₹30,000 crores for FY2027, projecting revenue growth of 10-15% for FY2026 and 15-20% for FY2027. The company reduced standalone debt to ₹364 crores with a debt-to-equity ratio of 0.04x and plans to transfer completed HAM projects to its InvIT for asset monetization.",
            "Sentiment": "neutral",
            "PublishDate": 1754918575971,
            "Source": "earnings"
        },
        {
            "Title": "G R Infraprojects Receives Provisional Completion Certificate for INR 1,577 Crore Highway Project",
            "Summary": "G R Infraprojects Limited announced the provisional completion of a highway project in Andhra Pradesh valued at INR 1,577 crore. The project involves four-laning of NH-71 from Madanapalli to Pileru spanning 55.900 km under the Bharatmala Pariyojna scheme, executed through Hybrid Annuity Mode. The Independent Engineer issued a Provisional Completion Certificate on August 4, 2025, declaring the project fit for commercial operation from June 30, 2025. The project was appointed on January 14, 2023, and is being executed by GR Madanapalli Pileru Highway Private Limited, a wholly owned subsidiary of G R Infraprojects Limited.",
            "Sentiment": "positive",
            "PublishDate": 1754466769052,
            "Source": "stock"
        },
        {
            "Title": "G R Infraprojects Projects 10-15% Revenue Growth for FY26 with Order Inflow Target of ₹22,000 Crore",
            "Summary": "G R Infraprojects expects revenue growth of 10-15% for FY26. The company projects EBITDA margins of 12-13% for both FY26 and FY27. The infrastructure company has set order inflow targets of ₹22,000 crore for FY26 and ₹30,000 crore for FY27.",
            "Sentiment": "positive",
            "PublishDate": 1754364628102,
            "Source": "stock"
        },
        {
            "Title": "G R Infraprojects Reports 8.8% QoQ Revenue Decline to Rs 19,424 Million in Q1 FY26",
            "Summary": "G R Infraprojects Limited reported total income of Rs 19,424 million for Q1 FY26, declining 8.78% quarter-on-quarter from Rs 21,293 million in Q4 FY25. Revenue from operations fell 8.25% to Rs 18,261 million. EBITDA margin compressed to 12.65% from 17.51% in the previous quarter, with EBITDA declining 33.67% to Rs 2,311 million. Profit after tax dropped 41.87% to Rs 2,158 million, with PAT margin at 11.82%. Year-on-year performance showed revenue declining 3.71% but PAT growing 42.01%. The company maintained its order book at Rs 194,104 million as of June 30, 2025, with potential to reach Rs 237,064 million including L1 projects worth Rs 42,960 million. Net working capital days remained stable at 121 days compared to 122 days in the previous year. The company operates 7 operational projects and has 19 projects under construction across highways, transmission, and ropeway segments.",
            "Sentiment": "negative",
            "PublishDate": 1754136488874,
            "Source": "earnings"
        },
        {
            "Title": "G R Infraprojects Board Recommends Changes to Business Objects for Expansion",
            "Summary": "G R Infraprojects Limited's Board of Directors recommended alterations to the Object Clause of the company's Memorandum of Association during a meeting held on August 1st, 2025. The proposed changes require shareholder approval at the upcoming Annual General Meeting. The Board stated the need to expand and diversify the company's business operations by aligning business objects with future growth plans. The alterations aim to provide clarity and flexibility to business operations and enable the company to explore and undertake a wider range of activities by broadening and reframing existing clauses.",
            "Sentiment": "positive",
            "PublishDate": 1754060780603,
            "Source": "corporate_action"
        },
        {
            "Title": "G R Infraprojects Reports Higher Q1 EBITDA and Improved Margins",
            "Summary": "G R Infraprojects reported Q1 EBITDA of 3.98 billion rupees compared to 3.68 billion rupees in the same period last year. The company's EBITDA margin improved to 20.03% from 18.13% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754059068447,
            "Source": "earnings"
        },
        {
            "Title": "G R Infraprojects Reports 57% Jump in Quarterly Net Profit to 2.44 Billion Rupees",
            "Summary": "G R Infraprojects reported consolidated net profit of 2.44 billion rupees for the quarter, representing a significant increase from 1.55 billion rupees in the same period last year. However, the company's revenue declined to 19.88 billion rupees compared to 20.3 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754058646058,
            "Source": "earnings"
        },
        {
            "Title": "G R Infraprojects Emerges as Top Bidder for Rs 2.9 Billion EPC Project in Jharkhand",
            "Summary": "G R Infraprojects has become the top bidder for an EPC (Engineering, Procurement, and Construction) project in Jharkhand. The contract is valued at 2.9 billion rupees. This development positions the company to potentially secure a significant infrastructure project that would contribute to its order book and revenue pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1753365956543,
            "Source": "stock"
        },
        {
            "Title": "G R Infraprojects Wins INR 290.23 Crore Highway Construction Contract in Jharkhand",
            "Summary": "G R Infraprojects Limited has been selected as the L-1 bidder for an EPC project to construct the Giridih Bypass road in Jharkhand. The project involves construction of a 26.672 km road with a contract value of INR 290.23 crores and must be completed within 24 months from the appointed date. The financial bid opening took place on July 24, 2025, and the project is being undertaken by the State Highway Authority of Jharkhand. The company has committed to provide updates on any further developments related to this project.",
            "Sentiment": "positive",
            "PublishDate": 1753365848264,
            "Source": "order&deals"
        },
        {
            "Title": "GR Infra Secures ₹1250 Crore Project",
            "Summary": "GR Infra has secured a new project valued at ₹1250 crore. The news indicates a significant business development for the company, likely in the infrastructure sector given the company's name. However, specific details about the project's nature, location, or timeline are not provided in the given information.",
            "Sentiment": "positive",
            "PublishDate": 1752043792000,
            "Source": "default"
        },
        {
            "Title": "GR Infra Provides Financial Guidance and Targets",
            "Summary": "GR Infra shared financial guidance during a concall update. The company will provide clearer growth guidance after six months. They are targeting ₹100-125 crore in capex for the next year and expect growth split over two years. For the current year, they aim for 11,500 (unit not specified) and ₹1,000 crore in equity investment across the current and next year.",
            "Sentiment": "positive",
            "PublishDate": 1747626113000,
            "Source": "default"
        },
        {
            "Title": "G R Infraprojects Reports Q4 Financial Results",
            "Summary": "G R Infraprojects announced its Q4 financial results. The company reported EBITDA of 6.1 billion rupees, up from 5.47 billion rupees year-over-year. EBITDA margin improved to 26.79% from 22% in the same period last year. Revenue decreased to 22.76 billion rupees from 24.85 billion rupees year-over-year. The company reported an exceptional item of 218.7 million rupees, down from 3.06 billion rupees in the previous year. Profit before tax (PBT) increased to 4.82 billion rupees from 3.87 billion rupees year-over-year. Consolidated net profit for Q4 was 4.03 billion rupees, down from 5.54 billion rupees year-over-year but up from 2.63 billion rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747326881000,
            "Source": "result"
        },
        {
            "Title": "G R Infraprojects Secures 2.62 Billion Rupee Contract",
            "Summary": "G R Infraprojects has been awarded a contract worth 2.62 billion rupees (approximately $31.5 million USD). The news indicates a significant project acquisition for the company, potentially boosting its order book and future revenue prospects.",
            "Sentiment": "positive",
            "PublishDate": 1746710426000,
            "Source": "default"
        },
        {
            "Title": "G R Infraprojects Secures ₹1,257.29 Crore BharatNet Project",
            "Summary": "G R Infraprojects has received an Advance Work Order from Bharat Sanchar Nigam Limited (BSNL), acting on behalf of the Department of Telecom (DoT), for a significant infrastructure project under the BharatNet initiative. The contract is valued at approximately ₹1,257.29 crore.",
            "Sentiment": "positive",
            "PublishDate": 1746490045000,
            "Source": "default"
        },
        {
            "Title": "G R Infraprojects Receives ₹1,257.29 Crore Contract for BharatNet Project",
            "Summary": "G R Infraprojects has been awarded an Advance Work Order (AWO) by Bharat Sanchar Nigam Limited (BSNL), acting on behalf of the Department of Telecom (DOT). The contract, valued at approximately ₹1,257.29 crore, is for a significant infrastructure project under the BharatNet initiative.",
            "Sentiment": "positive",
            "PublishDate": 1746460142000,
            "Source": "default"
        },
        {
            "Title": "G R Infraprojects Entitled to 1.06 Billion Rupees from Bihar Government",
            "Summary": "G R Infraprojects has announced that a tribunal has ruled in their favor, stating that the company is entitled to receive 1.06 billion rupees from the Bihar government. This decision appears to be the result of a dispute or claim between the infrastructure company and the state government.",
            "Sentiment": "positive",
            "PublishDate": 1743725182000,
            "Source": "corporate_governance"
        },
        {
            "Title": "G R Infraprojects Awarded 1.06 Billion Rupees by Tribunal in Case Against Bihar Government",
            "Summary": "G R Infraprojects has announced that a tribunal has ruled in their favor, entitling the company to receive 1.06 billion rupees from the Bihar government. This decision represents a significant financial outcome for the infrastructure company in its dispute with the state government.",
            "Sentiment": "positive",
            "PublishDate": 1743686117000,
            "Source": "corporate_governance"
        },
        {
            "Title": "G R Infraprojects Receives Letter of Acceptance for NHAI Project",
            "Summary": "G R Infraprojects has received a Letter of Acceptance (LoA) from the National Highways Authority of India (NHAI) for a new project. The estimated cost of the project is 42.63 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1742342769000,
            "Source": "order&deals"
        },
        {
            "Title": "G R Infraprojects: Secures Rs 4,263 Crore NHAI Contract and Declares Interim Dividend",
            "Summary": "G R Infraprojects received a letter of acceptance from NHAI for a Rs 4,262.8 crore greenfield project. The company also announced an interim dividend of Rs 12.50 per share with a record date of March 13.",
            "Sentiment": "positive",
            "PublishDate": 1742302762000,
            "Source": "order&deals"
        }
    ]
}