{
    "Symbol": "GRINDWELL",
    "ISIN": "INE536A01023",
    "News": [
        {
            "Title": "Grindwell Norton Q3 Net Profit Rises 9.68% YoY",
            "Summary": "Grindwell Norton reports consolidated net profit of ₹952 million in Q3, marking a 9.68% increase from ₹868 million in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1770369787048,
            "Source": "co_actions_results"
        },
        {
            "Title": "Grindwell Norton Gets GST Show Cause Notice",
            "Summary": "Grindwell Norton Limited received a show cause notice from GST authority demanding payment of ₹22.59 lakh including tax, interest and penalty related to Input Tax Credit for FY 2020-21.",
            "Sentiment": "negative",
            "PublishDate": 1769609859609,
            "Source": "stocks"
        },
        {
            "Title": "Grindwell Norton Board Meet Set for Feb 6, 2026",
            "Summary": "Grindwell Norton Limited has scheduled its board meeting for February 6, 2026, to approve Q3 FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768560595919,
            "Source": "co_actions_results"
        },
        {
            "Title": "Grindwell Norton Gets ESG Rating of 62 from NSRAL",
            "Summary": "Grindwell Norton Limited receives an ESG rating of 62 from NSE Sustainability Ratings and Analytics Ltd for FY 2024-25, based on publicly available data without company engagement.",
            "Sentiment": "neutral",
            "PublishDate": 1767882052240,
            "Source": "stocks"
        },
        {
            "Title": "Grindwell Norton Receives GST Demand Drop Order",
            "Summary": "GST Authority drops proceedings against Grindwell Norton's ₹23.57 crore demand, reducing it to ₹4.17 crores. Company plans further appeal with no material operational impact expected.",
            "Sentiment": "positive",
            "PublishDate": 1766751990426,
            "Source": "stocks"
        },
        {
            "Title": "Grindwell Norton Boosts Green Energy Investment",
            "Summary": "Grindwell Norton increases investment in Jamnagar Renewables Two Private Limited to ₹86.00 lakhs for green energy sourcing, while Company Secretary K. Visweswaran resigns effective February 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1765546285896,
            "Source": "stocks"
        },
        {
            "Title": "Grindwell Norton Boosts JRTPL Investment to ₹8.60 Million",
            "Summary": "Grindwell Norton's board has approved increasing its investment in JRTPL to ₹8.60 million, marking a strategic expansion of the company's investment portfolio in associated entities.",
            "Sentiment": "positive",
            "PublishDate": 1765546170833,
            "Source": "co_actions_results"
        },
        {
            "Title": "Grindwell Norton Gets ₹12.98 Cr GST Demand Dropped",
            "Summary": "Grindwell Norton receives favorable GST order dropping ₹12.98 crore demand to nil for 2021-22 Input Tax Credit mismatch, while ₹23.57 crore demand remains pending adjudication.",
            "Sentiment": "positive",
            "PublishDate": 1765524778467,
            "Source": "stocks"
        },
        {
            "Title": "Grindwell Norton Receives GST Order Worth ₹29.77 Lakhs",
            "Summary": "Grindwell Norton Limited received a GST order from Bengaluru tax authorities for ₹29.77 lakhs related to Input Tax Credit for FY 2021-22. The company is evaluating appeal options.",
            "Sentiment": "negative",
            "PublishDate": 1765454436616,
            "Source": "stocks"
        },
        {
            "Title": "Grindwell Norton Reports Revenue Growth to 7.75 Billion Rupees in Q2",
            "Summary": "Grindwell Norton reported quarterly revenue of 7.75 billion rupees compared to 6.9 billion rupees in the same period last year. The company's consolidated net profit reached 1.07 billion rupees versus 960 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761814169148,
            "Source": "earnings"
        },
        {
            "Title": "Grindwell Norton Block Trade Worth Rs. 29.88 Crores Executed on NSE",
            "Summary": "Grindwell Norton Ltd. saw a block trade executed on the National Stock Exchange worth Rs. 29.88 crores. The transaction involved approximately 181,005 shares at a price of Rs. 1,651.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1758002984945,
            "Source": "order&deals"
        },
        {
            "Title": "Grindwell Norton Acquires Land Worth ₹180 Million in Gujarat for Business Expansion",
            "Summary": "Grindwell Norton has purchased land valued at ₹180 million in Gujarat. The acquisition is intended to enhance the company's future business operations.",
            "Sentiment": "positive",
            "PublishDate": 1753446313040,
            "Source": "stock"
        },
        {
            "Title": "Grindwell Norton Reports ₹94.4 Crore Net Profit, Approves ₹18 Crore Land Purchase",
            "Summary": "Grindwell Norton Limited reported a net profit of ₹94.4 crore for the quarter ended June 30, 2025, compared to ₹91.9 crore in the same period last year. Revenue from operations remained stable at ₹693.9 crore versus ₹690.9 crore year-on-year. The company's Board approved the purchase of land in Halol, Gujarat, valued up to ₹18 crore on a freehold basis to support future business operations. The land acquisition is expected to be completed by March 31, 2026, and will be funded through cash consideration. The company operates across four segments: Abrasives (₹351.6 crore revenue), Ceramics & Plastics (₹285.3 crore), Digital Services (₹50.9 crore), and Others (₹10.9 crore). Earnings per share stood at ₹8.53 for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753432640430,
            "Source": "earnings"
        },
        {
            "Title": "Grindwell Norton Reports Mixed Q1 Results with Revenue Decline but Profit Growth",
            "Summary": "Grindwell Norton reported quarterly results showing revenue of 7 billion rupees compared to 7.1 billion rupees in the same period last year. EBITDA decreased to 1.3 billion rupees from 1.33 billion rupees year-over-year, with EBITDA margin declining to 18.46% from 18.9%. However, consolidated net profit increased to 944 million rupees from 932 million rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753432212193,
            "Source": "earnings"
        },
        {
            "Title": "Grindwell Norton Limited: ₹17 Dividend Proposed for FY25, Record Date Set",
            "Summary": "Grindwell Norton Limited has recommended a final dividend of ₹17 per equity share for FY25, with a record date of July 15, 2025. If approved at the upcoming AGM on July 25, 2025, the dividend will be paid from July 29, 2025. The AGM will also vote on director appointments and auditor remuneration.",
            "Sentiment": "positive",
            "PublishDate": 1751301077000,
            "Source": "corporate_action"
        },
        {
            "Title": "Grindwell Norton Q4 Results and Dividend Announcement",
            "Summary": "Grindwell Norton reported its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit was 925.4 million rupees, slightly lower than the previous year's 926 million rupees. Revenue increased to 7.1 billion rupees from 6.9 billion rupees year-over-year. EBITDA rose to 1.28 billion rupees from 1.25 billion rupees, while the EBITDA margin slightly decreased to 17.98% from 18.02%. The company has recommended a dividend of 17 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1746798492000,
            "Source": "result"
        },
        {
            "Title": "Grindwell Norton: Q3 Profit Dips 5.79% Despite Revenue Growth",
            "Summary": "Grindwell Norton reported Q3 FY25 results with revenue up 6.47% YoY to ₹702.61 crore, but profit down 5.79% to ₹86.82 crore. EPS decreased 6% to ₹7.84. Operating income fell 9.01% YoY. Analysts' consensus recommendation is Hold.",
            "Sentiment": "neutral",
            "PublishDate": 1739566557000,
            "Source": "earnings"
        },
        {
            "Title": "Grindwell Norton Reports Q3 Revenue Increase",
            "Summary": "Grindwell Norton, an industrial manufacturing company, has reported its third-quarter revenue for the current fiscal year. The company's revenue stood at 6.9 billion rupees, showing an increase from 6.6 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1739438660000,
            "Source": "earnings"
        },
        {
            "Title": "Grindwell Norton Reports Decline in Q3 Consolidated Net Profit",
            "Summary": "Grindwell Norton, a manufacturing company, has reported a decrease in its consolidated net profit for the third quarter. The company's net profit fell to 868 million rupees from 922 million rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1739438582000,
            "Source": "earnings"
        },
        {
            "Title": "Grindwell Norton Ltd: Major Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for Grindwell Norton Ltd. Approximately 330,686 shares were traded at a price of Rs. 2207.75 per share, totaling Rs. 73.01 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1730350139000,
            "Source": "block_deals"
        },
        {
            "Title": "Grindwell Norton Reports Q2 EBITDA and Margin",
            "Summary": "Grindwell Norton announced its Q2 financial results. The company reported an EBITDA of 1.29 billion rupees, slightly down from 1.3 billion rupees in the same quarter last year. The EBITDA margin decreased to 18.7% from 19.69% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730277744000,
            "Source": "result"
        },
        {
            "Title": "Grindwell Norton Reports Q2 Revenue Growth",
            "Summary": "Grindwell Norton, an industrial manufacturing company, has reported its second quarter revenue for the current fiscal year. The company's revenue for Q2 stood at 6.9 billion rupees, showing a slight increase from 6.7 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1730277681000,
            "Source": "result"
        },
        {
            "Title": "Grindwell Norton Reports Q2 Net Profit Decline",
            "Summary": "Grindwell Norton, an industrial manufacturing company, has reported a consolidated net profit of 960 million rupees for the second quarter, down from 1.01 billion rupees in the same period last year. This represents a year-over-year decrease in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1730277658000,
            "Source": "result"
        },
        {
            "Title": "Grindwell Norton Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade of Grindwell Norton Ltd shares occurred on the National Stock Exchange (NSE). The transaction involved approximately 172,829 shares, valued at Rs. 42.26 crores. The trade was executed at a price of Rs. 2,445.05 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1729053263000,
            "Source": "block_deals"
        }
    ]
}