{
    "Symbol": "GRMOVER",
    "ISIN": "INE192H01020",
    "News": [
        {
            "Title": "GRM Overseas Completes Warrant Conversion Worth ₹86.83 Cr",
            "Summary": "GRM Overseas Limited successfully converted 77,18,000 warrants into equity shares, raising ₹86,82,75,000 and increasing paid-up capital to ₹41,44,20,000 with additional bonus shares.",
            "Sentiment": "positive",
            "PublishDate": 1770386914378,
            "Source": "co_actions_results"
        },
        {
            "Title": "GRM Overseas Board Meet Set for Feb 4, 2026",
            "Summary": "GRM Overseas Limited has scheduled a board meeting on February 04, 2026, to consider and approve Q3FY26 unaudited standalone and consolidated financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769702047199,
            "Source": "co_actions_results"
        },
        {
            "Title": "GRM Overseas Allots 12.27 Crore Bonus Shares in 2:1 Ratio",
            "Summary": "GRM Overseas Limited has successfully allotted 12.27 crore bonus equity shares in a 2:1 ratio on December 26, 2025, increasing its paid-up share capital to ₹36.81 crores with 18.41 crore equity shares outstanding.",
            "Sentiment": "positive",
            "PublishDate": 1766731267267,
            "Source": "co_actions_results"
        },
        {
            "Title": "GRM Overseas promoter acquires 50,000 shares",
            "Summary": "Managing Director Atul Garg purchased 50,000 equity shares on December 10, 2025, increasing promoter group holding to 70.23% from 70.15% in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765445047335,
            "Source": "co_actions_results"
        },
        {
            "Title": "GRM Overseas Shareholders Approve Capital Increase & Bonus Issue",
            "Summary": "GRM Overseas Limited shareholders approved increasing authorized share capital from ₹20 crores to ₹45 crores and issuing bonus shares in 2:1 ratio at EGM held on December 09, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765381146123,
            "Source": "co_actions_results"
        },
        {
            "Title": "GRM Overseas Limited Conducts EGM to Approve Share Capital Increase and Bonus Issue",
            "Summary": "GRM Overseas Limited held an Extraordinary General Meeting on December 9, 2025, through video conferencing with 147 members attending to vote on three key resolutions. The company sought approval for increasing authorized share capital, issuing bonus shares to equity shareholders, and appointing Mr. Sumit Mittal as Non-Executive Independent Director.",
            "Sentiment": "neutral",
            "PublishDate": 1765286664144,
            "Source": "corporate_action"
        },
        {
            "Title": "GRM Overseas Schedules EGM for Authorized Capital Increase and 2:1 Bonus Share Issue",
            "Summary": "GRM Overseas Limited has called an Extra-Ordinary General Meeting on December 09, 2025, to approve increasing authorized share capital from Rs. 20 crores to Rs. 45 crores and issuing bonus shares in 2:1 ratio. The company will capitalize Rs. 27.63 crores from securities premium and free reserves to reward shareholders and improve equity liquidity.",
            "Sentiment": "positive",
            "PublishDate": 1763384848949,
            "Source": "corporate_action"
        },
        {
            "Title": "GRM Overseas Pivots to Consumer Food Business, Targets ₹2,000 Cr Revenue by FY28",
            "Summary": "GRM Overseas is shifting from B2B rice exports to B2C consumer packaged food business under its '10X' brand portfolio, focusing on ready-to-cook products and building distribution through modern retail and e-commerce channels. The company aims to achieve ₹2,000 crore revenue by FY28 through this strategic transformation toward higher-margin consumer products and export diversification.",
            "Sentiment": "positive",
            "PublishDate": 1763137092209,
            "Source": "stock"
        },
        {
            "Title": "GRM Overseas Reports Strong Q2FY26 Results with 60.5% PAT Growth and Announces 2:1 Bonus Issue",
            "Summary": "GRM Overseas Limited reported consolidated revenue of Rs. 372 crores for Q2FY26, up 16.2% YoY, with PAT surging 60.5% to Rs. 14.8 crores and EBITDA growing 53.9% to Rs. 24.5 crores. The company's board approved a bonus issue in the ratio of 2:1, while the rice exporter expanded internationally by establishing a UAE subsidiary and partnering with Seven Star Company Limited for Saudi Arabia distribution.",
            "Sentiment": "positive",
            "PublishDate": 1763136513215,
            "Source": "earnings"
        },
        {
            "Title": "GRM Overseas Partners with Seven Star Company for '10X' Basmati Rice Distribution in Saudi Arabia",
            "Summary": "GRM Overseas Limited has entered into a distribution agreement with Seven Star Company Limited for its '10X' basmati rice brand in the Saudi Arabian market. Seven Star Company Limited will distribute GRM's '10X' basmati rice in multiple pack sizes through its distribution and retail network across the region. GRM Overseas is described as one of India's leading basmati rice exporters and a fast-growing FMCG company. The company operates three rice processing units with an annual production capacity of 4,40,800 MT located in Panipat, Naultha, and Gandhidham. GRM exports rice to more than 50 countries and is among the top 5 rice exporters in India. The company sells products under brands '10X', 'Himalaya River' and 'Tanoush'.",
            "Sentiment": "positive",
            "PublishDate": 1760935343959,
            "Source": "order&deals"
        },
        {
            "Title": "Madhu Kela Family and Nikhil Vora Increase Stakes in GRM Overseas as Stock Surges 80% in 2025",
            "Summary": "Marquee investors including the Madhu Kela family and Nikhil Vora have increased their stakes in GRM Overseas, a smallcap packaged food company. The company's shares have rallied 80% in 2025. Promoters sold a 2.65% stake for over Rs 58 crore, reducing their holding to 68.20%. Nikhil Vora raised his stake from 0.33% to 0.85%, while Singularity Equity Fund I increased holdings from 2.20% to 3.35%. GRM Overseas has shifted focus to India's packaged food market through subsidiary GRM Foodkraft, which doubled revenue to Rs 539 crore in FY25 from Rs 257 crore previously. The parent company reported consolidated net profit of Rs 19.09 crore for the June quarter on revenue of Rs 334.43 crore. The stock is up 42% over the last 12 months and trades above six of eight key moving averages.",
            "Sentiment": "positive",
            "PublishDate": 1758886949721,
            "Source": "stock"
        },
        {
            "Title": "GRM Overseas Promoters Sell Combined 16.25 Lakh Shares Worth Rs. 3.25 Crore",
            "Summary": "Two promoters of GRM Overseas Limited sold equity shares on September 25, 2025. Mrs. Mamta Garg sold 6,25,000 equity shares (face value Rs. 2 each), reducing her holding from 71.17% to 70.15%. Mr. Atul Garg sold 10,00,000 equity shares (face value Rs. 2 each), decreasing his stake from 72.80% to 71.17%. Both transactions were executed through open market/block deals. The company's equity share capital remained unchanged at Rs. 12,27,04,000. Both promoters are part of the promoter group along with Mr. Hukam Chand Garg. The shares are listed on BSE and NSE under scrip code 531449 and symbol GRMOVER respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1758866653591,
            "Source": "corporate_action"
        },
        {
            "Title": "GRM Overseas Opens New Corporate Office in Gurugram",
            "Summary": "GRM Overseas has opened a new corporate office in Gurugram on September 25, 2025. The facility will focus on product development, sales, marketing, and client engagement activities.",
            "Sentiment": "positive",
            "PublishDate": 1758777997673,
            "Source": "stock"
        },
        {
            "Title": "GRM Overseas Schedules Board Meeting to Consider Bonus Share Issuance",
            "Summary": "GRM Overseas has scheduled a board meeting for August 20 to discuss the issuance of bonus shares to shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1755059651091,
            "Source": "corporate_action"
        },
        {
            "Title": "GRM Overseas Targets ₹3,500 Cr Revenue by FY28 Through FMCG Growth and D2C Acquisitions",
            "Summary": "GRM Overseas has set a revenue target of ₹3,500 crore by FY28. The company's growth strategy focuses on FMCG-led expansion in India, promoting premium basmati brands in international markets, and establishing a ₹200 crore 10X Ventures fund for acquiring new-age direct-to-consumer businesses.",
            "Sentiment": "positive",
            "PublishDate": 1755019594188,
            "Source": "stock"
        },
        {
            "Title": "GRM Overseas Reports Q1 Results and Approves UAE Subsidiary Formation",
            "Summary": "GRM Overseas Limited's board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of Rs 32,677.95 lakhs and net profit of Rs 1,909.15 lakhs for the quarter. On a standalone basis, revenue from operations was Rs 25,592.55 lakhs with net profit of Rs 1,631.99 lakhs. The board also approved formation of a wholly owned subsidiary in the UAE with proposed authorized capital of 5,00,000 AED to serve as a distribution and marketing hub for rice, food grains, and related food products in international markets. During the quarter, 13,52,000 share warrants were converted into equity shares, with 77,18,000 warrants remaining outstanding for conversion.",
            "Sentiment": "positive",
            "PublishDate": 1755017696786,
            "Source": "earnings"
        },
        {
            "Title": "GRM Overseas Reports Mixed Q1 Results with Higher Profitability Despite Revenue Decline",
            "Summary": "GRM Overseas announced quarterly results showing EBITDA of 240 million rupees compared to 234 million rupees in the same period last year. The company's EBITDA margin improved to 7.33% from 6.33% year-over-year. Consolidated net profit increased to 191 million rupees from 180 million rupees in the previous year. However, revenue declined to 3.27 billion rupees from 3.7 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1755015939706,
            "Source": "earnings"
        },
        {
            "Title": "GRM Overseas Reports Q4 Financial Results",
            "Summary": "GRM Overseas has released its Q4 financial results. The company's EBITDA increased to 326.5 million rupees from 218.3 million rupees year-over-year. The EBITDA margin improved to 11.2% from 5.38% year-over-year. However, revenue decreased to 2.91 billion rupees from 4.1 billion rupees year-over-year. The consolidated net profit slightly decreased to 204.8 million rupees from 212 million rupees year-over-year, but increased from 135.4 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748451520000,
            "Source": "result"
        },
        {
            "Title": "GRM Overseas: Stock Jumps After Salman Khan Ad Campaign Launch",
            "Summary": "GRM Overseas share price rose 2.5% to ₹283.5 from ₹276.5 on NSE after launching a new ad campaign for its 10X Zarda King Basmati rice brand, featuring Bollywood star Salman Khan. The #RishtaMubarak campaign aims to position the brand as the top choice for authentic biryani preparations.",
            "Sentiment": "positive",
            "PublishDate": 1743580182000,
            "Source": "normal_news"
        },
        {
            "Title": "GRM Overseas: Salman Khan Becomes Brand Ambassador, Stock Surges 8%",
            "Summary": "GRM Overseas, a small-cap FMCG company, appointed Bollywood star Salman Khan as brand ambassador for its 10X Classic Chakki Fresh Atta campaign. The stock surged 8% to ₹269.90 before settling 3.14% higher at ₹257.50, despite overall weak market trends.",
            "Sentiment": "positive",
            "PublishDate": 1741608430000,
            "Source": "corporate_action"
        },
        {
            "Title": "GRM Overseas: Promoter Stake Increase Drives Stock Rally",
            "Summary": "GRM Overseas shares rose 8% on March 7, continuing a five-day rally with a 15% gain. The surge is attributed to increased promoter stake and strong buying interest, despite market volatility.",
            "Sentiment": "positive",
            "PublishDate": 1741350108000,
            "Source": "corporate_action"
        },
        {
            "Title": "GRM Overseas Reports Decline in Q3 EBITDA and Margin",
            "Summary": "GRM Overseas has reported its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 123 million rupees from 183 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin declined to 3.32% from 4.78% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739455191000,
            "Source": "earnings"
        },
        {
            "Title": "GRM Overseas Reports Q3 Financial Results",
            "Summary": "GRM Overseas has released its Q3 consolidated financial results. The company reported a net profit of 135 million rupees, down from 155 million rupees year-over-year, but up from 92 million rupees quarter-over-quarter. Revenue for Q3 stood at 3.7 billion rupees, slightly lower than the 3.8 billion rupees reported in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739455133000,
            "Source": "earnings"
        },
        {
            "Title": "GRM Overseas Reports Improved Q2 EBITDA",
            "Summary": "GRM Overseas has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 111.7 million rupees, up from 79 million rupees in the same quarter last year. However, the EBITDA margin decreased slightly to 3.54% from 3.88% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731518199000,
            "Source": "result"
        },
        {
            "Title": "GRM Overseas Reports Significant Revenue Growth in Q2",
            "Summary": "GRM Overseas has announced its second-quarter revenue, which stands at 3.15 billion rupees. This represents a substantial increase from the 2 billion rupees reported in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731518194000,
            "Source": "result"
        },
        {
            "Title": "GRM Overseas Reports Increased Q2 Consolidated Net Profit",
            "Summary": "GRM Overseas has reported a consolidated net profit of 91.9 million rupees for the second quarter, showing an increase from 66 million rupees year-over-year and 180.2 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731518185000,
            "Source": "result"
        },
        {
            "Title": "GRM Overseas: FMCG Stock Surges 5% on Chilean Joint Venture",
            "Summary": "GRM Overseas share price rose 5% to ₹229.50 after announcing a partnership with Solariz Invest in Chile. The stock traded 3.73% higher at ₹226.70 around 11:40 am, outperforming the flat Sensex.",
            "Sentiment": "positive",
            "PublishDate": 1729750821000,
            "Source": "corporate_action"
        },
        {
            "Title": "GRM Overseas: Strategic Partnership in Chile Boosts Global Expansion",
            "Summary": "GRM Overseas partners with Solariz Invest to distribute its 'Tanoush' basmati rice brand in Chile. The company also unveils new packaging for its 10X brand line featuring Bollywood star Salman Khan. GRM's stock rose 4% on the NSE following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1729746276000,
            "Source": "normal_news"
        },
        {
            "Title": "GRM Overseas Expands to Chile with Tanoush Basmati Rice",
            "Summary": "GRM Overseas has partnered with Solariz Invest to introduce its basmati rice brand 'Tanoush' to the Chilean market. This move marks an expansion of GRM Overseas' global presence, specifically targeting consumers in Chile.",
            "Sentiment": "positive",
            "PublishDate": 1729676675000,
            "Source": "corporate_action"
        },
        {
            "Title": "GRM Overseas: Stock Surges 11% on New Packaging and Q1 Growth",
            "Summary": "<p>GRM Overseas stock <span class='positive'>jumped 11%</span> to Rs 236.9 following the <span class='positive'>launch of new packaging</span> for its 10X brand and <span class='positive'>positive Q1 results</span>. The company reported a <span class='positive'>net profit of Rs 18 crore</span>, up from Rs 17.4 crore year-over-year, and a <span class='positive'>39.89% increase in operating income</span> to Rs 370 crores. <b>Bollywood actor Salman Khan</b> is featured in the new packaging design.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728368002000,
            "Source": "normal_news"
        }
    ]
}