{
    "Symbol": "GROWW",
    "ISIN": "INE0HOQ01053",
    "News": [
        {
            "Title": "Groww Incorporates Wholly Owned Subsidiary Foundation",
            "Summary": "Billionbrains Garage Ventures Limited (Groww) has incorporated Groww Foundation as a wholly owned subsidiary on February 02, 2026, focusing on social development and philanthropic activities.",
            "Sentiment": "positive",
            "PublishDate": 1770049656981,
            "Source": "stocks"
        },
        {
            "Title": "Groww Updates CIN Following Stock Exchange Listing",
            "Summary": "Billionbrains Garage Ventures Limited (Groww) notifies exchanges of CIN change from U72900KA2018PLC109343 to L72900KA2018PLC109343 following November 2025 listing on NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1769752560290,
            "Source": "stocks"
        },
        {
            "Title": "Groww Mutual Fund Launches Nifty PSE ETF",
            "Summary": "Groww Mutual Fund launches new ETF tracking Nifty PSE Index with NFO open until February 5. The fund targets public sector enterprises with minimum investment of ₹500 and zero exit load.",
            "Sentiment": "positive",
            "PublishDate": 1769075019752,
            "Source": "mutualfunds"
        },
        {
            "Title": "Groww Launches Prime Feature for Fund Management",
            "Summary": "Groww introduces Groww Prime pilot program offering portfolio insights, 24/7 chat support, and personalised guidance for mutual fund investors on its direct investment platform.",
            "Sentiment": "positive",
            "PublishDate": 1768977361947,
            "Source": "mutualfunds"
        },
        {
            "Title": "Groww Shareholders Approve Employee Stock Option Amendments",
            "Summary": "Billionbrains Garage Ventures Limited (Groww) successfully passes all five special resolutions through postal ballot, including ESOP scheme amendments and Articles of Association changes with over 90% approval rates.",
            "Sentiment": "positive",
            "PublishDate": 1768830331386,
            "Source": "co_actions_results"
        },
        {
            "Title": "Smallcaps to see selective recovery in 2026: Groww MF",
            "Summary": "Anupam Tiwari of Groww Mutual Fund expects 2026 to be more constructive for smallcaps after 2025's correction, emphasizing bottom-up stock selection and quality-led growth over broad-based rallies.",
            "Sentiment": "positive",
            "PublishDate": 1768797015850,
            "Source": "mutualfunds"
        },
        {
            "Title": "Groww shares surge 10% on Q3 results, State Street deal",
            "Summary": "Billionbrains Garage Ventures shares jumped 10% following strong Q3 performance with 25% YoY revenue growth and State Street's ₹580 crore investment in Groww AMC for 23% stake.",
            "Sentiment": "positive",
            "PublishDate": 1768547437509,
            "Source": "stocks"
        },
        {
            "Title": "Groww Q3 profit drops 28% on one-off impact",
            "Summary": "Billionbrains Garage Ventures reports 27.8% decline in Q3 FY26 net profit to ₹546.93 crore due to one-time tax gain in previous year. Revenue grows 24.8% to ₹1,216.07 crore with strong market share gains.",
            "Sentiment": "neutral",
            "PublishDate": 1768536149687,
            "Source": "co_actions_results"
        },
        {
            "Title": "Groww publishes Q3 FY26 unaudited financial results",
            "Summary": "Billionbrains Garage Ventures Limited (Groww) has published its unaudited financial results for the quarter and nine months ended December 31, 2025, in Financial Express and Kannada Prabha newspapers as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1768453852505,
            "Source": "co_actions_results"
        },
        {
            "Title": "Groww Reports IPO Fund Utilization for Q3 FY26",
            "Summary": "Billionbrains Garage Ventures (Groww) utilized ₹2,513.09 million from its IPO proceeds during Q3 FY26, with major investments in cloud infrastructure, marketing, and subsidiary funding. ₹8,086.91 million remains unutilized.",
            "Sentiment": "neutral",
            "PublishDate": 1768406421777,
            "Source": "co_actions_results"
        },
        {
            "Title": "Groww Makes Q3FY26 Earnings Call Recording Available",
            "Summary": "Billionbrains Garage Ventures Limited (Groww) has made the audio recording of its Q3FY26 earnings conference call held on January 14, 2026, available on its website for analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1768397462729,
            "Source": "co_actions_results"
        },
        {
            "Title": "Groww Q3FY26 Total Income Jumps 26% YoY to ₹12,611 Mn",
            "Summary": "Billionbrains Garage Ventures reports strong Q3FY26 performance with total income of ₹12,611 Mn (+26% YoY), adjusted EBITDA of ₹7,418 Mn, and 20.4 Mn transacting users (+25% YoY). Platform diversification continues with new products gaining traction.",
            "Sentiment": "positive",
            "PublishDate": 1768376821985,
            "Source": "co_actions_results"
        },
        {
            "Title": "Groww Secures ₹580 Cr Investment from State Street",
            "Summary": "Billionbrains Garage Ventures (Groww) announces major investment deal with State Street Global Advisors worth up to ₹580.03 crores for 23% stake in Groww Asset Management Limited through primary and secondary transactions.",
            "Sentiment": "positive",
            "PublishDate": 1768376017409,
            "Source": "co_actions_results"
        },
        {
            "Title": "Groww Secures ₹580 Cr Investment from State Street",
            "Summary": "Billionbrains Garage Ventures (Groww) announces strategic investment of up to ₹580.03 crores from State Street Global Advisors in its asset management subsidiary, resulting in 23% dilution.",
            "Sentiment": "positive",
            "PublishDate": 1768375982802,
            "Source": "co_actions_results"
        },
        {
            "Title": "Groww Q3 FY26 Results Scheduled for January 14",
            "Summary": "Billionbrains Garage Ventures Ltd, parent of Groww, will announce Q3 FY26 results on January 14 with earnings call at 4:30 PM. Stock has gained over 40% since November listing.",
            "Sentiment": "neutral",
            "PublishDate": 1768287238505,
            "Source": "co_actions_results"
        },
        {
            "Title": "Groww shares surge 2% on Kotak's Buy rating",
            "Summary": "Billionbrains Garage Ventures shares extended gains for second session after Kotak Institutional Equities initiated coverage with Buy call and ₹190 target price, citing strong growth prospects.",
            "Sentiment": "positive",
            "PublishDate": 1768277890405,
            "Source": "stocks"
        },
        {
            "Title": "Groww shares can rise 20% more: Kotak",
            "Summary": "Kotak Institutional Equities initiates coverage on Groww with 'Buy' rating and ₹190 price target, citing durable growth prospects and expanding monetisation opportunities across multiple business segments.",
            "Sentiment": "positive",
            "PublishDate": 1768190338377,
            "Source": "stocks"
        },
        {
            "Title": "Kotak Securities Initiates Buy Rating on Groww",
            "Summary": "Kotak Securities has initiated coverage on Groww with a 'buy' rating and set a price target of ₹190.00 per share, indicating positive analyst sentiment for the digital investment platform.",
            "Sentiment": "positive",
            "PublishDate": 1768189243330,
            "Source": "stocks"
        },
        {
            "Title": "Kotak Securities Initiates Buy On Groww With ₹190 Target",
            "Summary": "Kotak Securities initiates coverage on Groww with Buy rating and ₹190 target price, citing strong growth prospects in wealth management and margin trading facility with 20% revenue CAGR expected over FY26-28.",
            "Sentiment": "positive",
            "PublishDate": 1768187749111,
            "Source": "stocks"
        },
        {
            "Title": "Groww Schedules Q3FY26 Earnings Call for Jan 14",
            "Summary": "Billionbrains Garage Ventures Limited (Groww) announces earnings conference call on January 14, 2026 at 4:30 PM IST to discuss Q3FY26 unaudited financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1767940743780,
            "Source": "co_actions_results"
        },
        {
            "Title": "Groww Mutual Fund Launches Small-Cap Equity Scheme",
            "Summary": "Groww Mutual Fund introduces new small-cap equity scheme with NFO opening January 8, 2026. Fund targets long-term capital appreciation through QGaRP framework with ₹500 minimum investment.",
            "Sentiment": "positive",
            "PublishDate": 1767782303382,
            "Source": "mutualfunds"
        },
        {
            "Title": "Groww Board Meet on Jan 14 for Q3FY26 Results",
            "Summary": "Billionbrains Garage Ventures (Groww) schedules board meeting for January 14, 2026 to approve Q3FY26 unaudited financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767782215683,
            "Source": "co_actions_results"
        },
        {
            "Title": "Groww shares surge 3% on Motilal Oswal Buy rating",
            "Summary": "Billionbrains Garage Ventures shares rally 3.2% to ₹160 after Motilal Oswal initiates Buy rating with ₹185 target price, citing strong market position and growth prospects.",
            "Sentiment": "positive",
            "PublishDate": 1767672810893,
            "Source": "stocks"
        },
        {
            "Title": "India's Investment Shift: Compounding Challenge Ahead",
            "Summary": "Bain-Groww report shows Indian household wealth at ₹1,300-1,400 lakh crore with only 15-20% in capital markets vs 50-60% in developed economies. SIP growth at 25% CAGR signals participation rise.",
            "Sentiment": "neutral",
            "PublishDate": 1766816315156,
            "Source": "mutualfunds"
        },
        {
            "Title": "Groww shares surge 9% on index inclusion news",
            "Summary": "Billionbrains Garage Ventures shares jumped 9.5% to ₹175.60 following BSE index inclusion announcement and launch of emergency trading platform Groww Lite. Stock up 75.6% from IPO price.",
            "Sentiment": "positive",
            "PublishDate": 1766588016322,
            "Source": "stocks"
        },
        {
            "Title": "Groww Issues Postal Ballot Notice for ESOP Amendments",
            "Summary": "Billionbrains Garage Ventures issues postal ballot notice for ESOP scheme amendments, subsidiary extension, secondary acquisition approval, and Articles of Association changes with voting from Dec 20, 2025 to Jan 18, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766142003064,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jefferies Initiates Buy Rating on Groww",
            "Summary": "Jefferies initiates coverage on Groww with a Buy rating and target price of ₹180.00, signaling positive outlook for the financial services platform.",
            "Sentiment": "positive",
            "PublishDate": 1766115289152,
            "Source": "stocks"
        },
        {
            "Title": "Groww Platform Restored After Brief Technical Outage Due to Cloudflare Disruption",
            "Summary": "Groww's online trading platform experienced a temporary technical interruption for a few minutes due to a technical glitch from third-party vendor Cloudflare, which was part of a global outage affecting multiple online platforms. The platform has been fully restored with all services operating normally, and the company reported no material impact on business and operations.",
            "Sentiment": "neutral",
            "PublishDate": 1765035493795,
            "Source": "stock"
        },
        {
            "Title": "Billionbrains Garage Ventures Injects ₹1,044.67 Million Into Subsidiary Finwizard Technology",
            "Summary": "Billionbrains Garage Ventures has invested ₹1,044.67 million into its fully owned subsidiary Finwizard Technology through a rights issue. The substantial capital injection demonstrates the parent company's commitment to funding its technology unit's operations and growth initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1764336277943,
            "Source": "corporate_action"
        },
        {
            "Title": "ICRA Reaffirms AA- Stable Rating for Billionbrains Garage Ventures (Groww)",
            "Summary": "ICRA Limited reaffirmed its AA- (Stable) issuer rating for Billionbrains Garage Ventures Limited, the holding company of Groww Group, citing strong market position in equity broking and healthy capitalisation. The rating reflects the company's leading position in securities broking through subsidiary GIT, which holds the highest market share in NSE active clients at 27% as of October 2025, supported by net worth of Rs. 5,676.9 crore as of June 2025.",
            "Sentiment": "positive",
            "PublishDate": 1764331077117,
            "Source": "corporate_action"
        },
        {
            "Title": "Groww Reports Strong Q2 FY26 Results in First Post-IPO Earnings Call",
            "Summary": "Billionbrains Garage Ventures Limited (Groww) held its first quarterly earnings conference call as a public company for Q2 and H1 FY26, with management discussing business performance across broking, lending, and wealth management segments. The company reported growth in margin trading facility (MTF) business, launched commodities trading, and completed the Fisdom acquisition contributing 3% to revenues, while maintaining 80% organic customer acquisition and focusing on building India's largest investing platform.",
            "Sentiment": "positive",
            "PublishDate": 1764155880656,
            "Source": "earnings"
        },
        {
            "Title": "Groww Reports Q2 FY26 Results with 13% QoQ Revenue Growth and 19 Million Transacting Users",
            "Summary": "Groww achieved revenue from operations of ₹10,187 million in Q2 FY26, up 13% quarter-on-quarter, with total transacting users reaching 19 million and customer assets growing to ₹2.7 trillion. The fintech platform expanded its market share across key segments including mutual fund SIP inflows (13.1%) and retail derivatives (17.3%), while completing the acquisition of wealth management firm Fisdom.",
            "Sentiment": "positive",
            "PublishDate": 1763702554485,
            "Source": "earnings"
        },
        {
            "Title": "Groww Reports Strong Q2 Performance with EBITDA Rising to 6.04B Rupees",
            "Summary": "Billionbrains Garage Ventures (Groww) reported Q2 EBITDA of 6.04 billion rupees compared to 5.5 billion rupees year-over-year, representing growth in profitability. The company's EBITDA margin improved significantly to 59.29% from 48.9% in the same period last year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1763701508959,
            "Source": "earnings"
        },
        {
            "Title": "Groww Reports 12% Growth in Quarterly Consolidated Net Profit",
            "Summary": "Billionbrains Garage (Groww) posted consolidated net profit of Rs 4.7 billion in Q2, representing a year-on-year increase from Rs 4.2 billion in the same quarter last year. The fintech platform's profit growth of approximately 12% demonstrates continued business expansion and improved financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1763701153330,
            "Source": "earnings"
        },
        {
            "Title": "Groww Shares Surge 7% on Second Trading Day, Up 48% from IPO Price",
            "Summary": "Billionbrains Garage Ventures Ltd., parent company of investment platform Groww, saw shares rally 7% to Rs 148, marking a 48% gain from its Rs 100 IPO issue price and 30% rise from BSE listing price of Rs 114. Market experts recommend allotted investors hold for long-term given the company's structural strengths and growth potential, while suggesting partial profit booking with medium-term targets of Rs 125-130.",
            "Sentiment": "positive",
            "PublishDate": 1763099873807,
            "Source": "stock"
        },
        {
            "Title": "Groww's IPO Success vs Zerodha's Private Path: Two Different Growth Strategies in India's Fintech Boom",
            "Summary": "Groww raised over Rs 6,000 crore through its well-received IPO, with stock surging 50% and creating over Rs 30,000 crore in investor value, becoming India's largest stock broker with 18 million users. Zerodha, India's second largest stockbroker, continues its bootstrapped private approach, with founders citing customer-centric focus and freedom from quarterly pressures as key advantages over public listing.",
            "Sentiment": "neutral",
            "PublishDate": 1763094831409,
            "Source": "stock"
        },
        {
            "Title": "Groww Co-founder Discusses Growth Strategy and Market Expansion Following Stock Exchange Debut",
            "Summary": "Groww made its stock exchange debut with Co-founder Ishan Bansal expressing optimism about the company's performance. The company operates in 98% of India's pin codes and aims to expand its customer base in an underpenetrated market that has grown from 50 lakh to 5 crore capital market participants. Groww has upgraded its infrastructure capacity and currently operates at 20-25% capacity with potential for 3x-4x growth. The company reported strong profitability in Q1 and has been profitable since inception except for FY24 due to merger-related one-offs. Key growth areas include margin trade funding, which contributes 3-4% of revenue and could grow 10x from current levels, commodities trading, and wealth management through the Fisdom acquisition. Bansal noted the company's resilience to regulatory changes, with revenue declining only 10% during recent derivatives regulations due to faster growth in non-derivatives revenue.",
            "Sentiment": "positive",
            "PublishDate": 1763017635803,
            "Source": "stock"
        },
        {
            "Title": "Groww Shares Debut at 14% Premium Over IPO Price",
            "Summary": "Groww shares listed at Rs 114 on BSE and Rs 112 on NSE against the IPO price of Rs 100, marking a 14% premium. The Rs 6,632-crore IPO received 17 times subscription overall, with retail portion subscribed 9 times and non-institutional investors 14 times. Founded in 2016 by former Flipkart executives, Groww operates as India's largest investment platform with over 10 crore registered users and more than 60 lakh active investors. The IPO comprised a fresh issue of Rs 1,060 crore and offer for sale of Rs 5,572 crore. Fresh issue proceeds will fund technology infrastructure expansion, new financial products, and potential acquisitions. Analysts view the company as benefiting from India's expanding financialisation trend and recommend holding for long-term investors while suggesting new investors consider entry on post-listing corrections.",
            "Sentiment": "positive",
            "PublishDate": 1762921847407,
            "Source": "stock"
        }
    ]
}