{
    "Symbol": "GRPLTD",
    "ISIN": "INE137I01015",
    "News": [
        {
            "Title": "GRP Limited Reports Q3FY26 Financial Results",
            "Summary": "GRP Limited announces Q3FY26 consolidated revenue of Rs. 1,347 Mn with EBITDA of Rs. 112 Mn. Company secured EUR 12 million ECB loan for strategic expansion projects.",
            "Sentiment": "neutral",
            "PublishDate": 1770907542326,
            "Source": "co_actions_results"
        },
        {
            "Title": "GRP Limited Board Meet Set for Feb 10 to Review Q3FY26",
            "Summary": "GRP Limited has scheduled a board meeting on February 10, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770117130524,
            "Source": "co_actions_results"
        },
        {
            "Title": "GRP Limited Invests ₹3.55 Lakh in BECIS Solar",
            "Summary": "GRP Limited completes first tranche investment of ₹3,54,865 in BECIS Solar 5 Private Limited, acquiring 26% stake through subscription of 3,51,351 equity shares for solar power procurement.",
            "Sentiment": "positive",
            "PublishDate": 1768223325953,
            "Source": "co_actions_results"
        },
        {
            "Title": "GRP Limited Promoter Group Completes Inter-se Transfer",
            "Summary": "GRP Limited's promoter group completed an inter-se transfer of 1,88,756 shares (3.54%) through gift without consideration on November 25, 2025, maintaining overall 22.13% holding.",
            "Sentiment": "neutral",
            "PublishDate": 1767941056714,
            "Source": "co_actions_results"
        },
        {
            "Title": "GRP Limited Invests ₹5 Crores in Subsidiary GCSL",
            "Summary": "GRP Limited has invested ₹5 crores in its wholly-owned subsidiary GRP Circular Solutions Limited through a rights issue of 50 lakh equity shares to strengthen its financial position and support future growth in the plastics recycling ecosystem.",
            "Sentiment": "positive",
            "PublishDate": 1766055775973,
            "Source": "co_actions_results"
        },
        {
            "Title": "GRP Limited Credit Rating Downgraded by CRISIL",
            "Summary": "CRISIL downgrades GRP Limited's credit rating from A-/Stable to BBB/Stable on ₹152.62 crore bank facilities due to weakening business profile from trade tariffs impact.",
            "Sentiment": "negative",
            "PublishDate": 1765441950662,
            "Source": "stocks"
        },
        {
            "Title": "Rajendra Gandhi Group Transfers 1.88 Lakh Shares in GRP Ltd Through Inter-se Gift Transaction",
            "Summary": "Rajendra Vadilal Gandhi and associated entities transferred 1,88,756 equity shares of GRP Ltd through an inter-se gift transaction without consideration, reducing their collective holding from 25.67% to 22.13%. The transaction involved multiple family members and entities including Rajendra Gandhi, his family members, HUFs, and related trusts, with the company's total equity capital remaining at 53.33 lakh shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764308304234,
            "Source": "corporate_action"
        },
        {
            "Title": "GRP Limited Reports Mixed Q2 FY26 Results Amid US Tariff Impact and New Pyrolysis Plant Operations",
            "Summary": "GRP Limited posted flat revenue growth at INR 1,331 million for Q2 FY26 with EBITDA rising 13% to INR 114 million, though profit after tax declined 22% due to US tariffs affecting export volumes and margins. The company successfully commenced pyrolysis operations at Solapur with expectations of INR 25-30 crores revenue in H2, while deciding to shut down its polymer composite business due to commercial unviability.",
            "Sentiment": "neutral",
            "PublishDate": 1763706868274,
            "Source": "earnings"
        },
        {
            "Title": "GRP Limited Reports Flat Revenue Growth Amid Global Headwinds in Q2H1FY26",
            "Summary": "GRP Limited posted total income of Rs. 1,331 million for the quarter with nominal year-over-year growth, while EBITDA margins compressed to 1.9% from 8.6% due to lower volumes and unfavorable geographic mix driven by geopolitical uncertainties and US tariffs. The company announced a strategic capex plan of up to Rs. 250 crores over three years to expand recycling capabilities and commissioned its continuous pyrolysis facility in Solapur, positioning for future growth in sustainable materials.",
            "Sentiment": "neutral",
            "PublishDate": 1763061681000,
            "Source": "earnings"
        },
        {
            "Title": "GRP Begins Production of Eco-Friendly Tyre Recycling Products",
            "Summary": "GRP has commenced manufacturing eco-friendly tyre recycling products. The company is now producing sustainable solutions for tyre waste management.",
            "Sentiment": "positive",
            "PublishDate": 1755853273497,
            "Source": "stock"
        },
        {
            "Title": "GRP Limited Reports 2% Revenue Decline in Q1 FY26 Amid Export Challenges and Raw Material Pressures",
            "Summary": "GRP Limited reported a 2% year-on-year decline in total income to Rs. 1,247 million for Q1 FY26, compared to Rs. 1,267 million in the previous year. The company faced a 7% volume reduction due to external market headwinds and operational downtime for plant upgrades. Export revenues declined 9% due to tariff-related uncertainties in key overseas markets and port congestion challenges, while domestic business grew 5%. EBITDA fell 18% to Rs. 109 million with margins dropping to 8.7% from 10.5% in the prior year. Profit after tax decreased significantly to Rs. 17 million from Rs. 44 million. The company cited sustained inflation in raw material costs for automotive inner tubes, particularly affecting butyl reclaim production which constitutes 35% by volume and 44% by value of total operations. Managing Director Harsh Gandhi noted that approximately 5% of quarterly volumes were impacted by newly implemented tariffs affecting North American tyre demand. The company's crumb rubber plant became operational and is targeting commercial operations for its tyre pyrolysis oil project in Q2. GRP expects revenues of Rs. 125-140 crores once the entire 30,000-ton pyrolysis capacity is fully commissioned.",
            "Sentiment": "negative",
            "PublishDate": 1754309218029,
            "Source": "earnings"
        },
        {
            "Title": "GRP Ltd Appoints New Directors and Secretarial Auditor at 51st Annual General Meeting",
            "Summary": "GRP Ltd announced multiple board changes approved at its 51st Annual General Meeting held on July 25, 2025. Rajendra V. Gandhi, a B.Tech from IIT Mumbai with over 50 years of rubber industry experience, was appointed as Non-executive Non-Independent Director. Hemal H. Gandhi was reappointed as Executive Director for the period from August 22, 2025 to March 31, 2028. She holds degrees in Human Development and Developmental Counselling and leads the company's Polymer Composite and Custom Die Form verticals while overseeing HR, Corporate Communications and CSR functions. Belur Krishna Murthy Sethuram was appointed as Independent Director for a five-year term from May 9, 2025 to May 8, 2030. He brings 38 years of experience in chemical and allied industries and serves as Independent Director in three other listed companies in the plastic and chemical segment. Additionally, Yogesh D. Dabholkar & Co. was appointed as Secretarial Auditor for five consecutive financial years from 2025-26 to 2029-30.",
            "Sentiment": "positive",
            "PublishDate": 1753713356281,
            "Source": "corporate_governance"
        },
        {
            "Title": "GRP Limited Shares Audio Recording Link for Q1 FY2026 Earnings Call",
            "Summary": "GRP Limited has made available the audio recording of its earnings call held on July 28, 2025 at 3:00 p.m. IST. The call discussed the company's operational and financial performance for Q1 FY2026. The audio recording can be accessed through the company's website at www.grpweb.com. Company Secretary & Compliance Officer Jyoti Sancheti communicated this information to both the National Stock Exchange of India Limited and BSE Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1753712432791,
            "Source": "earnings"
        },
        {
            "Title": "GRP Limited Shareholders Approve All Resolutions at 51st Annual General Meeting",
            "Summary": "GRP Limited held its 51st Annual General Meeting on July 25, 2025, through video conferencing. All 10 resolutions proposed in the AGM notice were passed with the required majority. The approved resolutions included adoption of audited standalone and consolidated financial statements for the year ended March 31, 2025, declaration of dividend of Rs. 14.50 per equity share, re-appointment of Hemal H. Gandhi as director, appointment of Rajendra V. Gandhi as Non-Executive Non-Independent Director, reappointment of Hemal H. Gandhi as Executive Director from August 22, 2025 to March 31, 2028, appointment of Belur Krishna Murthy Sethuram as Non-Executive Independent Director, appointment of Yogesh D. Dabholkar & Co. as Secretarial Auditor for five years, and ratification of remuneration for cost auditors. The company had 8,785 shareholders on record date, with 36 shareholders participating through video conferencing. Voting was conducted through remote e-voting and e-voting during the AGM, with 1,664,574 votes polled representing 31.21% of outstanding shares.",
            "Sentiment": "positive",
            "PublishDate": 1753711477230,
            "Source": "corporate_action"
        },
        {
            "Title": "GRP Limited's Executive Chairman Rajendra V. Gandhi Steps Down, Proposed for Non-Executive Role",
            "Summary": "Rajendra V. Gandhi ceased to be the Executive Chairman of GRP Limited upon conclusion of the 51st Annual General Meeting held on July 25, 2025. His departure follows the company's Nomination and Remuneration policy and a shareholders resolution passed at the 50th AGM held on August 2, 2024. The company has proposed Gandhi's appointment as a Non-executive Non-Independent Director through a special resolution at the same AGM, with voting results pending.",
            "Sentiment": "neutral",
            "PublishDate": 1753528862573,
            "Source": "corporate_governance"
        },
        {
            "Title": "GRP Reports 45% Decline in Q1 Net Profit to 33 Million Rupees",
            "Summary": "GRP reported quarterly net profit of 33 million rupees compared to 60 million rupees in the same period last year. Revenue declined to 1.2 billion rupees from 1.32 billion rupees year-over-year. EBITDA decreased to 103 million rupees from 131 million rupees, while EBITDA margin compressed to 8.67% from 10.72% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1753453743916,
            "Source": "earnings"
        },
        {
            "Title": "GRP Limited Approves Quarterly Results, Reduces EUR Borrowings and Invests in Solar Power Solutions",
            "Summary": "GRP Limited's Board of Directors approved unaudited provisional standalone and consolidated financial results for the quarter ended June 30, 2025. The board also approved reducing existing External Commercial Borrowings from EUR 15 million to EUR 12 million, originally sanctioned by PROPARCO. Additionally, the company will procure solar power for its Gujarat and Maharashtra manufacturing locations through investments in Amplus Energy Solutions Private Limited and GSE Renewables India Private Limited under group captive arrangements. The board meeting was held on July 25, 2025, lasting from 2:30 p.m. to 7:00 p.m.",
            "Sentiment": "positive",
            "PublishDate": 1753453703816,
            "Source": "earnings"
        },
        {
            "Title": "GRP Limited Schedules Board Meeting on July 25, 2025 to Approve Quarterly Financial Results",
            "Summary": "GRP Limited has scheduled a Board of Directors meeting for July 25, 2025, to consider and approve the unaudited financial results for the quarter ended June 30, 2025. The company will review both standalone and consolidated results. The trading window for company shares, which closed from the end of business hours on June 30, 2025, will remain closed until July 27, 2025, which is 48 hours after the conclusion of the board meeting. The company trades on BSE under scrip code 509152 and on NSE under symbol GRPLTD.",
            "Sentiment": "neutral",
            "PublishDate": 1753187866189,
            "Source": "corporate_action"
        },
        {
            "Title": "GRP Reports Strong Q4 Results and Announces Dividend",
            "Summary": "GRP has announced its Q4 financial results, showing significant year-over-year improvements. The company's Q4 net profit increased to 213 million rupees from 120.3 million rupees in the previous year. Revenue rose to 1.55 billion rupees from 1.38 billion rupees. EBITDA improved to 332 million rupees with a margin of 21.32%. Additionally, the company has recommended a dividend of 14.50 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746800588000,
            "Source": "result"
        },
        {
            "Title": "GRP Limited Commences Commercial Production at New Crumb Rubber Unit",
            "Summary": "GRP Limited has announced the start of commercial production of crumb rubber at its newly established unit. The company has invested 250 million rupees in this new facility, expanding its production capabilities in the rubber industry.",
            "Sentiment": "positive",
            "PublishDate": 1742894195000,
            "Source": "corporate_action"
        },
        {
            "Title": "GRP Reports Improved Q3 EBITDA and Margin",
            "Summary": "GRP has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 132 million rupees from 105.4 million rupees in the same quarter last year. Additionally, GRP's EBITDA margin improved to 10.22% from 9.61% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737728498000,
            "Source": "earnings"
        },
        {
            "Title": "GRP Limited Reports Increased Q3 Profit and Revenue",
            "Summary": "GRP Limited has announced its financial results for the third quarter. The company's net profit increased to 58 million rupees, up from 46.1 million rupees in the same quarter last year. Revenue also saw growth, reaching 1.3 billion rupees compared to 1.1 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737728491000,
            "Source": "earnings"
        },
        {
            "Title": "GRP Limited Secures €15 Million Credit Facility from PROPARCO",
            "Summary": "GRP Limited has entered into a loan agreement with PROPARCO to avail a credit facility of up to €15 million. This financial arrangement signifies a significant funding opportunity for the company, potentially supporting its growth initiatives or operational needs.",
            "Sentiment": "positive",
            "PublishDate": 1732880713000,
            "Source": "corporate_action"
        },
        {
            "Title": "GRP Q2 EBITDA Slightly Down Year-over-Year",
            "Summary": "GRP reported Q2 EBITDA of 109 million rupees, compared to 111 million rupees in the same quarter last year. The company's Q2 EBITDA margin decreased to 8.60% from 9.73% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731591982000,
            "Source": "result"
        },
        {
            "Title": "GRP Reports 16.7% Year-over-Year Revenue Growth in Q2",
            "Summary": "GRP has announced its second quarter financial results, reporting revenue of 1.4 billion rupees, compared to 1.2 billion rupees in the same quarter of the previous year. This represents a year-over-year revenue growth of approximately 16.7%.",
            "Sentiment": "positive",
            "PublishDate": 1731591971000,
            "Source": "result"
        },
        {
            "Title": "GRP Reports Q2 Net Profit of 47.6M Rupees",
            "Summary": "GRP has announced its Q2 financial results. The company reported a net profit of 47.6 million rupees, which represents a slight decrease from 50 million rupees in the same quarter last year (YoY). However, it shows a decline from 59.6 million rupees in the previous quarter (QoQ).",
            "Sentiment": "neutral",
            "PublishDate": 1731591688000,
            "Source": "result"
        },
        {
            "Title": "GRP Board to Consider Capital Raising via QIP or Other Modes",
            "Summary": "GRP has announced a board meeting scheduled for November 14 to discuss and consider raising capital through a Qualified Institutional Placement (QIP) or other potential methods.",
            "Sentiment": "neutral",
            "PublishDate": 1731334659000,
            "Source": "corporate_action"
        }
    ]
}