{
    "Symbol": "GRSE",
    "ISIN": "INE382Z01011",
    "News": [
        {
            "Title": "GRSE Signs MoU with HSL for Strategic Consortium",
            "Summary": "Garden Reach Shipbuilders & Engineers Ltd signed MoU with Hindustan Shipyard Limited on February 09, 2026, to form consortium for national shipbuilding programme under SCI tender.",
            "Sentiment": "positive",
            "PublishDate": 1770733056515,
            "Source": "co_actions_results"
        },
        {
            "Title": "GRSE Wins ₹33 Crore Seychelles Ship Refit Contract",
            "Summary": "Garden Reach Shipbuilders & Engineers secured a ₹33 crore contract from Ministry of External Affairs for the second refit of Seychelles Coast Guard Ship PS Zoroaster, scheduled for completion in three months.",
            "Sentiment": "positive",
            "PublishDate": 1770463936882,
            "Source": "co_actions_results"
        },
        {
            "Title": "GRSE Reports Strong Q3 FY26 Results with 74% Growth",
            "Summary": "Garden Reach Shipbuilders posts ₹17,077.27 lakh profit in Q3 FY26, up 74% YoY. Revenue jumps 49% to ₹1,89,569.31 lakh. Board declares ₹7.15 interim dividend.",
            "Sentiment": "positive",
            "PublishDate": 1769601213223,
            "Source": "co_actions_results"
        },
        {
            "Title": "GRSE Announces Senior Management Promotions",
            "Summary": "Garden Reach Shipbuilders & Engineers Ltd announced promotions of seven senior officers to Executive Director, Chief General Manager and General Manager positions effective January 1, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768199141417,
            "Source": "stocks"
        },
        {
            "Title": "GRSE Fined ₹19.54 Lakh by NSE and BSE for Board Composition Non-Compliance",
            "Summary": "Garden Reach Shipbuilders & Engineers received fines totaling ₹19.54 lakh from NSE and BSE for non-compliance with board composition requirements, including absence of required Independent Directors and Woman Independent Director during the quarter ended September 30, 2025. The company has requested waiver of fines, citing that director appointments are controlled by the Government of India through Presidential Orders and are beyond the company's control as a Central Public Sector Enterprise.",
            "Sentiment": "negative",
            "PublishDate": 1764399103352,
            "Source": "corporate_governance"
        },
        {
            "Title": "GRSE Promotes Aparajita Ghosh to Chief General Manager (Finance)",
            "Summary": "Garden Reach Shipbuilders Engineers Limited promoted Smt. Aparajita Ghosh from General Manager (Finance) to Chief General Manager (Finance) effective November 18, 2025. The promotion recognizes her vast experience and leadership qualities, with the order issued by the Competent Authority on November 22, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763957268555,
            "Source": "corporate_governance"
        },
        {
            "Title": "GRSE Signs MoU with Andhra Pradesh Maritime Board for Green Field Shipyard Project",
            "Summary": "Garden Reach Shipbuilders Engineers Limited entered into a non-binding Memorandum of Understanding with Andhra Pradesh Maritime Board for mutual cooperation to facilitate setting up a Green Field Shipyard in Andhra Pradesh. The agreement aims to establish shipbuilding infrastructure in the state through collaborative efforts between the defense PSU and the state maritime authority.",
            "Sentiment": "positive",
            "PublishDate": 1763132723159,
            "Source": "stock"
        },
        {
            "Title": "GRSE Reports 45% Revenue Growth in Q2FY26, Order Book Stands at ₹20,206 Crores",
            "Summary": "Garden Reach Shipbuilders Engineers Limited recorded revenue growth of 45% year-on-year from ₹1,153 crores to ₹1,677 crores in quarterly results, with profit after tax rising 57% from ₹98 crores to ₹154 crores. The company maintains an order book of ₹20,205.56 crores comprising 10 shipbuilding projects with 43 platforms including warships for Indian Navy, export projects, and expects to sign Next-Generation Corvette contract worth approximately ₹30,000 crores in next 3-4 months.",
            "Sentiment": "positive",
            "PublishDate": 1763121487248,
            "Source": "earnings"
        },
        {
            "Title": "GRSE Shares Jump 7% as Quarterly Net Profit Surges 57% to Rs 154 Crore",
            "Summary": "Garden Reach Shipbuilders and Engineers Ltd shares rallied 7% to Rs 2,748 following strong quarterly results. Net profit increased 57% to Rs 154 crore compared to Rs 98 crore in the same quarter last year. Total income rose 42% to Rs 1,746 crore while revenue from operations grew 45% to Rs 1,677 crore. EBITDA jumped 56% to Rs 225 crore. For the half-year period, total income increased 35% to Rs 3,128 crore and net profit grew 48% to Rs 274 crore. Management expressed confidence in maintaining strong financial performance for the remainder of the fiscal year, citing a strong order book and clear order visibility. Shares were trading up 4.6% at Rs 2,692 and have gained 63% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1762763333304,
            "Source": "earnings"
        },
        {
            "Title": "GRSE Shares Go Ex-Dividend Tuesday for Rs 5.75 Interim Payout",
            "Summary": "Garden Reach Shipbuilders & Engineers (GRSE) shares will turn ex-dividend on Tuesday, November 11. The company's Board of Directors approved an interim dividend of Rs 5.75 per equity share of face value Rs 10 each for FY 2025-26. The total payout amounts to Rs 65.87 crore, drawn from profits for the half-year period ended September 30, 2025. Investors must purchase the stock before the end of today's trading session to be eligible for the dividend. GRSE is a Government of India undertaking under the Ministry of Defence that manufactures warships and other naval platforms. Other companies also trading ex-dividend tomorrow include Chambal Fertilisers and Chemicals, Chalet Hotels, Siyaram Silk Mills, Steelcast Ltd, Nuvama Wealth Management, and Indian Metals & Ferro Alloys.",
            "Sentiment": "neutral",
            "PublishDate": 1762741613052,
            "Source": "corporate_action"
        },
        {
            "Title": "Garden Reach Shipbuilders Reports 53% Jump in Q2 Net Profit to 1.5 Billion Rupees",
            "Summary": "Garden Reach Shipbuilders & Engineers reported strong quarterly results with net profit rising to 1.5 billion rupees compared to 978 million rupees in the same period last year. Revenue increased significantly to 16.8 billion rupees from 11.5 billion rupees year-over-year. EBITDA more than doubled to 1.6 billion rupees from 687 million rupees, while EBITDA margin improved to 9.31% from 5.96% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762388707298,
            "Source": "earnings"
        },
        {
            "Title": "Garden Reach Shipbuilders Reports Strong Q2 Results and Declares Interim Dividend",
            "Summary": "Garden Reach Shipbuilders & Engineers announced an interim dividend of ₹5.75 per equity share for financial year 2025-26. The company reported strong Q2 performance with EBITDA rising to 1.6 billion rupees from 687 million rupees year-over-year. EBITDA margin improved to 9.31% from 5.96% in the same period last year. Net profit increased to 1.5 billion rupees compared to 978 million rupees year-over-year, while revenue grew to 16.8 billion rupees from 11.5 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762258218393,
            "Source": "corporate_action"
        },
        {
            "Title": "Garden Reach Shipbuilders to Announce Q2 Results on November 4, Considers Interim Dividend",
            "Summary": "Garden Reach Shipbuilders and Engineers Ltd. will release its financial results for the quarter and half-year ended September 30, 2025, on November 4, 2025. The Board will also consider declaring an interim dividend for financial year 2025-26, with November 11, 2025 set as the record date for eligible shareholders. The trading window for designated persons has been closed from October 1 until 48 hours after results declaration. In the previous quarter ended June 30, 2025, the company reported strong performance with net profit rising 37% year-on-year to Rs 120 crore and revenue increasing 29.7% to Rs 1,310 crore. The company's shares have declined 0.84% in the past five trading sessions and 6.11% over the last month, but gained 35.86% in six months and 55.02% year-to-date. Shares closed at Rs 2,558 on Friday, with a 52-week high of Rs 3,538.4 and low of Rs 1,184.9.",
            "Sentiment": "neutral",
            "PublishDate": 1762060235529,
            "Source": "earnings"
        },
        {
            "Title": "Garden Reach Shipbuilders Partners with Centum Electronics for Naval Navigation Systems Development",
            "Summary": "Garden Reach Shipbuilders & Engineers Ltd has signed an agreement with Centum Electronics for collaborative research and development of advanced naval navigation systems. The partnership aims to improve manufacturing facilities and upgrade current systems.",
            "Sentiment": "positive",
            "PublishDate": 1759917553738,
            "Source": "order&deals"
        },
        {
            "Title": "Indian Navy Launches Anti-Submarine Warfare Ship 'Androth' in Vizag",
            "Summary": "The Indian Navy has launched an anti-submarine warfare ship named 'Androth' in Visakhapatnam. The ship is associated with GRSE (Garden Reach Shipbuilders & Engineers).",
            "Sentiment": "positive",
            "PublishDate": 1759732146860,
            "Source": "stock"
        },
        {
            "Title": "Garden Reach Shipbuilders Shares Rise 6% on Five Strategic MoUs",
            "Summary": "Garden Reach Shipbuilders & Engineers (GRSE) shares surged 6% to Rs 2,760 after the company signed five memorandums of understanding with major industry players including Deendayal Port Authority, Syama Prasad Mookerjee Port Authority, Indian Port Rail & Ropeway Corporation, Shipping Corporation of India, and Modest Infrastructure. The MoUs establish frameworks for collaboration on green vessel construction, ship repair, port infrastructure development, multimodal logistics, and ropeway connectivity, supporting India's Maritime Amrit Kaal vision to become a top-five global shipbuilding nation by 2047. GRSE reported quarterly results showing profit after tax of Rs 120.17 crore, up 37.8% year-over-year from Rs 87.19 crore, while revenue from operations increased 29.7% to Rs 1,309.87 crore. However, net profit declined 51% sequentially from Rs 244.25 crore. The stock has gained 65% year-to-date and was trading 4% higher at Rs 2,707.",
            "Sentiment": "positive",
            "PublishDate": 1758518917096,
            "Source": "stock"
        },
        {
            "Title": "GRSE Signs $62.44 Million Contract with Germany's Carsten Rehder for Four Hybrid Vessels",
            "Summary": "GRSE has signed a $62.44 million contract with Germany's Carsten Rehder for the construction of four hybrid multi-purpose vessels. The deal is positioned as part of the 'Make in India, Make for World' shipbuilding initiative, representing an export order for the Indian shipbuilder.",
            "Sentiment": "positive",
            "PublishDate": 1758500516077,
            "Source": "order&deals"
        },
        {
            "Title": "GRSE Signs Five MoUs with Strategic Partners to Support India's Maritime Vision 2047",
            "Summary": "GRSE has signed five memorandums of understanding with strategic partners across shipbuilding, port, and infrastructure sectors. These partnerships are aimed at supporting India's maritime ambitions under the Maritime Amrit Kaal Vision 2047 initiative.",
            "Sentiment": "positive",
            "PublishDate": 1758354944715,
            "Source": "stock"
        },
        {
            "Title": "GRSE Signs USD 62.44 Million Contract with German Company for Four Hybrid Multi-Purpose Vessels",
            "Summary": "Garden Reach Shipbuilders & Engineers Ltd (GRSE) signed a contract with Carsten Rehder Schiffsmakler und Reederei GmbH & Co. KG in Hamburg, Germany for the construction of four Hybrid Multi-Purpose Vessels valued at USD 62.44 million. The contract extends GRSE's existing partnership with Carsten Rehder, following an ongoing 7,500 DWT Multi-Purpose Vessel project. The vessels will be 120 metres long and 17 metres wide, featuring battery-assisted hybrid propulsion systems and enhanced fuel efficiency aligned with International Maritime Organization decarbonization goals. The project has a provision for an additional two vessels and is scheduled for completion within 33 to 42 months from the contract's effective date. The agreement reinforces GRSE's commitment to the 'Make in India, Make for World' vision and expands the company's global footprint in commercial and green shipbuilding.",
            "Sentiment": "positive",
            "PublishDate": 1758291819740,
            "Source": "order&deals"
        },
        {
            "Title": "Indian Navy Receives Second Indigenous Anti-Submarine Warfare Ship Androth",
            "Summary": "The Indian Navy has received Androth, the second of eight anti-submarine warfare-shallow water craft built by Garden Reach Shipbuilders and Engineers (GRSE) in Kolkata. The ship was delivered on Saturday and is designed to boost India's maritime capabilities amid China's increasing presence in the Indian Ocean. The 77-meter vessel is the largest Indian Naval warship powered by a diesel engine-waterjet combination and features state-of-the-art lightweight torpedoes and indigenous anti-submarine warfare rockets. Named after Androth Island in the Lakshadweep archipelago, the ship contains over 80% indigenous content, supporting the government's 'Aatmanirbhar Bharat' vision. The ASW-SWC ships are being inducted to strengthen anti-submarine and coastal surveillance capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1757930553020,
            "Source": "stock"
        },
        {
            "Title": "GRSE Extends Additional Finance Director Charge for CMD by One Month",
            "Summary": "Garden Reach Shipbuilders & Engineers Limited announced that the government has extended the additional charge of Director (Finance) to Cmde Hari P R, Chairman & Managing Director, for one month starting September 1, 2025. The extension will continue until a regular appointment is made or further orders are issued, whichever comes first. This follows a Ministry of Defence letter dated September 3, 2025, allowing the CMD to continue holding both positions simultaneously.",
            "Sentiment": "neutral",
            "PublishDate": 1756984453531,
            "Source": "corporate_governance"
        },
        {
            "Title": "Japan's MOL Shows Interest in Acquiring GRSE-Built Ships for Indian Operations",
            "Summary": "Mitsui O.S.K. Lines (MOL), a Japanese shipping company, has expressed interest in acquiring ships manufactured by Garden Reach Shipbuilders & Engineers (GRSE) in India for its Indian fleet operations. This represents potential business opportunities for the Indian shipbuilder in the international market.",
            "Sentiment": "positive",
            "PublishDate": 1756868847334,
            "Source": "stock"
        },
        {
            "Title": "Indian Navy Commissions Two Nilgiri-Class Stealth Frigates INS Himgiri and INS Udaygiri",
            "Summary": "The Indian Navy inducted two Nilgiri-class stealth frigates, INS Himgiri and INS Udaygiri, in a ceremony at Visakhapatnam presided over by Defence Minister Rajnath Singh. INS Himgiri was built by Garden Reach Shipbuilders and Engineers in Kolkata, while INS Udaygiri was constructed by Mumbai's Mazagon Dock Shipbuilders. Both vessels fall under Project 17 Alpha (P-17A) and were built with 75% indigenous material. The frigates are 149 meters long with speeds of 28 knots and feature advanced weapon systems including BrahMos supersonic missiles and Barak-8 missiles. INS Udaygiri is noted as the fastest ship in this class to be delivered post-launch due to modular construction methodology. The vessels will join the Eastern Fleet and represent the Navy's Warship Design Bureau's 100th ship design. Both frigates are approximately 5% larger than Shivalik-class frigates while maintaining a lower radar cross-section.",
            "Sentiment": "positive",
            "PublishDate": 1756207426707,
            "Source": "stock"
        },
        {
            "Title": "Garden Reach Shipbuilders Reports Strong Order Book of ₹21,700 Crore, Plans Capacity Expansion",
            "Summary": "Garden Reach Shipbuilders & Engineers Limited reported a current order book of ₹21,700 crore comprising 10 projects with 40 marine platforms. The company delivered its first P-17A stealth frigate to the Indian Navy ahead of schedule and completed delivery of the third Survey Vessel. Revenue crossed ₹5,000 crore milestone with profit after tax exceeding ₹500 crore in the previous fiscal year. The company plans to expand capacity from current 28 ships to 40 ships by 2029 through additional facilities including a 30-acre greenfield shipbuilding facility in West Bengal. Management expects to sign the Next Generation Corvette contract worth ₹25,000 crore and is targeting contracts for additional multipurpose vessels. The order book consists of 98% shipbuilding operations with 86% defense and 14% non-defense projects.",
            "Sentiment": "positive",
            "PublishDate": 1756201865291,
            "Source": "earnings"
        },
        {
            "Title": "India's Foreign Ministry Reports Naval Discussions with Japan on Ship Maintenance",
            "Summary": "India's Foreign Ministry has reported that talks are taking place between the Indian Navy and Japan regarding ship maintenance. The discussions involve GRSE, though specific details about the nature or scope of the maintenance arrangements were not disclosed.",
            "Sentiment": "neutral",
            "PublishDate": 1756193620704,
            "Source": "stock"
        },
        {
            "Title": "₹65,000 Crore Grants For Shipping Sector Awaiting Approval",
            "Summary": "ZEE BUSINESS reports that grants worth ₹65,000 crore for the shipping sector are expected to be approved soon. The report mentions Garden Reach Shipbuilders in connection with this development.",
            "Sentiment": "positive",
            "PublishDate": 1755753788072,
            "Source": "sectoral"
        },
        {
            "Title": "Garden Reach Shipbuilders Shares Decline as Company Projects Similar Growth for Next Two Years",
            "Summary": "Garden Reach Shipbuilders shares fell after the company indicated that topline and bottomline growth over the next two financial years would be similar to the last fiscal. The company's order book decreased to ₹21,700 crore at the end of June quarter from ₹22,680 crore in the year-ago period, comprising 10 projects with 40 marine platforms. Contract negotiations for the next generation corvette project worth ₹25,000 crore are in progress, with the contract expected by December 2025 or end of FY2026. The Navy's P-17 Bravo project RFP worth ₹70,000 crore is likely to be floated by year-end and will be split between two shipyards. The company plans to increase shipbuilding capacity to 32 concurrent ships by 2026 from current 28 ships and establish greenfield facilities in West Bengal and either the west or east coast. Garden Reach Shipbuilders reported strong quarterly results with net profit up 38% to ₹87 crore, revenue increased 30% to ₹1,010 crore, and EBITDA jumped 99% to ₹56 crore with margins expanding to 5.58%. Shares traded 0.8% lower at ₹2,582.",
            "Sentiment": "neutral",
            "PublishDate": 1755664546199,
            "Source": "stock"
        },
        {
            "Title": "Garden Reach Shipbuilders Conducts Q1 FY25-26 Results Conference Call",
            "Summary": "Garden Reach Shipbuilders & Engineers Limited held an investor/analyst conference call on August 19, 2025, at 3:30 PM to discuss their unaudited financial results for Q1 FY25-26 (quarter ended June 30, 2025). The company has made the audio recording of the call available on their website at https://grse.in/investor-presentations/. The filing was signed by Company Secretary and Compliance Officer Sandeep Mahapatra and submitted to NSE (Symbol: GRSE) and BSE (Scrip Code: 542011) under SEBI LODR regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1755604457973,
            "Source": "earnings"
        },
        {
            "Title": "Shipping Sector May Gain Infrastructure Status to Improve Funding Access",
            "Summary": "The shipping sector may receive infrastructure status, which would ease funding challenges for shipping companies. This potential classification change could provide better access to capital for companies in the shipping industry.",
            "Sentiment": "positive",
            "PublishDate": 1755507462532,
            "Source": "sectoral"
        },
        {
            "Title": "Garden Reach Shipbuilders Reports Strong Q1 Performance with 38% Profit Growth",
            "Summary": "Garden Reach Shipbuilders & Engineers Ltd. reported strong quarterly results with net profit rising 37.8% to Rs 120 crore compared to Rs 87.2 crore in the same period last year. Revenue increased 29.7% to Rs 1,310 crore from Rs 1,010 crore. EBITDA nearly doubled, surging 98.9% to Rs 112 crore versus Rs 56.3 crore, while margins expanded to 8.5% from 5.6%. The company's shares were trading 0.85% lower at Rs 2,525.40, though the stock has gained 21.31% over the past 12 months and 56.57% year-to-date. Among five analysts covering the stock, three recommend 'buy' while two suggest 'sell', with the average 12-month price target indicating a potential 1.2% downside.",
            "Sentiment": "positive",
            "PublishDate": 1754646216392,
            "Source": "earnings"
        },
        {
            "Title": "Garden Reach Shipbuilders Reports Strong Q1 Growth with Revenue Up 30% and Profit Rising 38%",
            "Summary": "Garden Reach Shipbuilders & Engineers reported Q1 revenue of 13 billion rupees, up from 10 billion rupees in the same period last year. The company's net profit increased to 1.2 billion rupees from 872 million rupees year-over-year. EBITDA nearly doubled to 1.12 billion rupees from 563 million rupees, while EBITDA margin improved to 8.54% from 5.57% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754641166500,
            "Source": "earnings"
        },
        {
            "Title": "Garden Reach Shipbuilders Expected to Report 43% Revenue Growth in Quarterly Results",
            "Summary": "Garden Reach Shipbuilders shares declined 2.2% ahead of its quarterly results announcement. The company is estimated to report revenue growth of 43% to ₹1,441 crore, with EBITDA expected to increase 144% to ₹137 crore from ₹56.3 crore in the same quarter last year. Revenue growth is likely driven by advanced execution of P17A Frigates orders. EBITDA margin is projected to expand 395 basis points to 9.53% from 5.58%, while net profit may rise 75% to ₹153 crore year-on-year. Key focus areas include the award date for Next-gen Corvettes worth over ₹25,000 crore and progress on ASW Shallow Water Crafts execution. The company's order book stood at ₹22,680 crore as of the March quarter, with management expecting peak execution by the end of the current financial year. Shares traded 2.1% lower at ₹2,492, down 30% from the recent high of ₹3,538.",
            "Sentiment": "positive",
            "PublishDate": 1754638051645,
            "Source": "earnings"
        },
        {
            "Title": "Garden Reach Shipbuilders to Announce Q1 Results on August 8, 2025",
            "Summary": "Garden Reach Shipbuilders and Engineers Ltd. (GRSE) will announce its quarterly results on Friday, August 8, 2025. The Kolkata-based public sector undertaking operates under the Ministry of Defence and specializes in designing and manufacturing warships for the Indian Navy and Coast Guard. The company's trading window for designated persons has been closed since July 1 and will reopen 48 hours after the results announcement. In the previous quarter, GRSE reported strong performance with revenue increasing 62% to Rs 1,642 crore, net profit rising 119% to Rs 244 crore, and EBITDA margin improving to 13.5%. The company's shares have gained 71.13% in the last six months and 58.03% year-to-date, though they declined 9.83% in the past month. The stock hit a 52-week high of Rs 3,538.4 on June 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754459626026,
            "Source": "earnings"
        },
        {
            "Title": "GRSE Partners with Germany's Reintjes GmbH for Marine Engine Technology Enhancement",
            "Summary": "GRSE has entered into a partnership with Germany-based Reintjes GmbH to enhance marine engine technology. The collaboration aims to strengthen GRSE's capabilities in marine propulsion systems through German engineering expertise.",
            "Sentiment": "positive",
            "PublishDate": 1754032675744,
            "Source": "stock"
        },
        {
            "Title": "Government Plans to Offload Up to 10% Stake in GRSE to Boost CPSE Value",
            "Summary": "The government has announced plans for a limited stake sale in Garden Reach Shipbuilders & Engineers (GRSE), targeting up to 10% dilution. The divestment is aimed at increasing the value of the Central Public Sector Enterprise. The offloading represents a measured approach to reducing government ownership while maintaining majority control.",
            "Sentiment": "neutral",
            "PublishDate": 1753431321093,
            "Source": "corporate_action"
        },
        {
            "Title": "Garden Reach Launches Final Anti-Submarine Warfare Ship 'Ajay' for Indian Navy",
            "Summary": "Garden Reach Shipbuilders and Engineers Ltd. launched the eighth and final anti-submarine warfare shallow water craft named 'Ajay' for the Indian Navy. The ship was launched by Priya Deshmukh, wife of Vice Admiral Kiran Deshmukh, at a function in Kolkata. The Kolkata-based defense PSU has completed building all eight anti-submarine warfare shallow water crafts for the Indian Navy. These versatile warships measure 77.6 meters long and 10.5 meters wide, designed with low draughts for coastal operations. The ships are capable of sub-surface surveillance in coastal waters, low-intensity maritime operations, mine laying, and coordinated anti-submarine operations with aircraft. They are equipped with lightweight torpedoes, ASW rockets and mines for anti-submarine warfare.",
            "Sentiment": "positive",
            "PublishDate": 1753076933827,
            "Source": "stock"
        },
        {
            "Title": "Garden Reach Shipbuilders: Retail Shareholders Reduce Stake as Stock Declines",
            "Summary": "Garden Reach Shipbuilders Ltd. (GRSE) stock is down 3.5% on July 14, marking its third consecutive day of decline. Retail investors reduced their stake to 14.89% in June from 16.72% in March. Domestic mutual funds slightly decreased their holdings, while foreign portfolio investors increased their stake to 5.33%. The stock has fallen 25% from its recent all-time high, losing ₹10,000 crore in market capitalization since June 23.",
            "Sentiment": "negative",
            "PublishDate": 1752467484000,
            "Source": "normal_news"
        },
        {
            "Title": "Indian Navy Plans Proposals for Minesweepers and QRSAM Systems",
            "Summary": "The Indian Navy is planning to propose the acquisition of minesweepers valued at ₹40,000 crore and Quick Reaction Surface-to-Air Missile (QRSAM) systems worth ₹30,000 crore. Garden Reach Shipbuilders and Engineers (GRSE) is mentioned in connection with this news.",
            "Sentiment": "positive",
            "PublishDate": 1750929877000,
            "Source": "default"
        },
        {
            "Title": "GRSE to Establish New Shipyard to Increase Capacity",
            "Summary": "Garden Reach Shipbuilders and Engineers (GRSE) plans to set up a new shipyard outside Kolkata to increase its production capacity. The company's current capacity of 24 ships is expected to rise to 28 by the end of 2025, partly through the revival of idle assets. This expansion is in response to growing demand from both defense and commercial sectors.",
            "Sentiment": "positive",
            "PublishDate": 1750130909000,
            "Source": "default"
        },
        {
            "Title": "Garden Reach Shipbuilders: Secures Contract for Two Coastal Research Vessels",
            "Summary": "Garden Reach Shipbuilders & Engineers Ltd. has signed a contract to construct two coastal research vessels for the Geological Survey of India. Each vessel will be 64m long, 12m wide, with 450 tonne deadweight and facilities for 35 personnel. The ships will be equipped for offshore geological mapping, mineral exploration, and ocean environment monitoring.",
            "Sentiment": "positive",
            "PublishDate": 1749633361000,
            "Source": "order&deals"
        },
        {
            "Title": "GRSE Signs Agreement with GSI for Coastal Research Vessels",
            "Summary": "Garden Reach Shipbuilders and Engineers (GRSE) has signed an agreement with Geological Survey of India (GSI) for the construction of two coastal research vessels.",
            "Sentiment": "positive",
            "PublishDate": 1749631504000,
            "Source": "default"
        },
        {
            "Title": "Garden Reach Shipbuilders: Signs New MoUs in Sweden and Denmark",
            "Summary": "Garden Reach Shipbuilders signed two new MoUs: one with Berg Propulsion in Sweden for marine propulsion systems, and another with SunStoke in Denmark for expedition cruise vessels. These follow three MoUs and one MoI signed last week. The company's current order book is estimated at ₹47,680 crore.",
            "Sentiment": "positive",
            "PublishDate": 1749436511000,
            "Source": "corporate_action"
        },
        {
            "Title": "GRSE Signs MOUs in Sweden and Denmark for Marine Systems and Expedition Cruises",
            "Summary": "Garden Reach Shipbuilders and Engineers (GRSE) has signed Memorandums of Understanding (MOUs) with companies in Sweden and Denmark. These agreements aim to enhance GRSE's capabilities in marine systems and facilitate its entry into the expedition cruise segment. The move is part of GRSE's strategy to expand its business and technological expertise in the maritime industry.",
            "Sentiment": "positive",
            "PublishDate": 1749428027000,
            "Source": "default"
        },
        {
            "Title": "GRSE Signs MoUs in Sweden and Denmark for Marine Systems and Expedition Cruise Segment",
            "Summary": "Garden Reach Shipbuilders and Engineers (GRSE) has signed Memorandums of Understanding (MoUs) with companies in Sweden and Denmark. These agreements aim to enhance GRSE's capabilities in marine systems and facilitate its entry into the expedition cruise segment. The move is part of GRSE's strategy to expand its business and explore new markets.",
            "Sentiment": "positive",
            "PublishDate": 1749284963000,
            "Source": "default"
        },
        {
            "Title": "Garden Reach Shipbuilders & Engineers: Strategic MoUs in Sweden and Denmark for Marine Systems Expansion",
            "Summary": "GRSE signed MoUs with Berg Propulsion in Sweden for joint development of marine propulsion systems, and with SunStone in Denmark for collaboration on expedition cruise vessels. These partnerships aim to strengthen GRSE's marine engineering portfolio and explore new market segments.",
            "Sentiment": "positive",
            "PublishDate": 1749280413000,
            "Source": "corporate_action"
        },
        {
            "Title": "Garden Reach Shipbuilders: Signs MoUs with German Firm for Multi-Purpose Vessels",
            "Summary": "Garden Reach Shipbuilders and Engineers Ltd. signed MoUs with Germany's Carsten Rehder for four 7,500 DWT multi-purpose vessels. The final contract is expected by August 31, 2025. The new vessels will feature hybrid propulsion systems and updated cybersecurity standards. This follows a recent order from Norway's Kongsberg for India's first polar research vessel.",
            "Sentiment": "positive",
            "PublishDate": 1749101506000,
            "Source": "order&deals"
        },
        {
            "Title": "Block Trade of Garden Reach Shipbuilders & Engineers Ltd. Shares",
            "Summary": "A block trade of approximately 61,012 shares of Garden Reach Shipbuilders & Engineers Ltd. occurred on the NSE. The trade was valued at Rs. 21.39 Crores, with each share priced at Rs. 3505.50.",
            "Sentiment": "neutral",
            "PublishDate": 1749097714000,
            "Source": "block_details"
        },
        {
            "Title": "Garden Reach Shipbuilders: Signs MoUs with German Firm for Four Vessels",
            "Summary": "Garden Reach Shipbuilders and Engineers Ltd. signed memorandums of understanding with Germany's Carsten Rehder for four multi-purpose vessels. The final contract is expected by August 31.",
            "Sentiment": "positive",
            "PublishDate": 1749096880000,
            "Source": "corporate_action"
        },
        {
            "Title": "GRSE Signs MOUs for Offshore Expansion",
            "Summary": "Garden Reach Shipbuilders and Engineers (GRSE) has signed Memorandums of Understanding (MOUs) with two companies to expand its presence in the offshore market. The first MOU is with Aries Marine for offshore platform and vessel design. The second MOU is with an unnamed global engine manufacturer. These partnerships aim to broaden GRSE's capabilities in the offshore sector.",
            "Sentiment": "positive",
            "PublishDate": 1749096309000,
            "Source": "default"
        },
        {
            "Title": "Garden Reach Shipbuilders: Shares Hit Record High on Norwegian Polar Vessel Order",
            "Summary": "Garden Reach Shipbuilders and Engineers Ltd. shares rose 10% to a record high after winning an order from Norway's Kongsberg to build India's first polar research vessel. The company's order book stands at Rs 22,680 crore. Analysts suggest the stock is fully priced in short term but recommend buying on dips for long-term investors.",
            "Sentiment": "positive",
            "PublishDate": 1749016533000,
            "Source": "order&deals"
        }
    ]
}