{
    "Symbol": "GRWRHITECH",
    "ISIN": "INE291A01017",
    "News": [
        {
            "Title": "Garware Hi-Tech Films Reports Insider Trading Violation",
            "Summary": "Garware Hi-Tech Films reports code of conduct violation by immediate relative of connected person involving contra trade. Company's audit committee imposed Rs. 10,000 penalty.",
            "Sentiment": "negative",
            "PublishDate": 1770204869763,
            "Source": "stocks"
        },
        {
            "Title": "Garware Hi-Tech Films Q3FY26 Earnings Call Feb 2",
            "Summary": "Garware Hi-Tech Films announces earnings conference call on February 02, 2026 at 11:30 AM IST to discuss Q3 and 9MFY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769517469924,
            "Source": "stocks"
        },
        {
            "Title": "Garware Hi-Tech Films Board Changes & Dubai Expansion",
            "Summary": "Garware Hi-Tech Films appoints Uday V. Joshi as Whole-Time Director from February 2026, while Mohan S. Adsul steps down. Company also plans Dubai subsidiary establishment.",
            "Sentiment": "neutral",
            "PublishDate": 1769065656387,
            "Source": "stocks"
        },
        {
            "Title": "Garware Hi-Tech Films Shuts Down Plant for Maintenance",
            "Summary": "Garware Hi-Tech Films announces temporary shutdown of Chips Plant and production lines at Waluj facility for planned maintenance activities starting December 16, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765616152599,
            "Source": "stocks"
        },
        {
            "Title": "Garware Hi-Tech Films Reports 15% Sequential Growth Despite 50% US Tariff Impact",
            "Summary": "Garware Hi-Tech Films achieved 15% quarter-on-quarter revenue growth to INR 569.7 crores with 23.4% EBITDA margins, despite facing up to 50% additional US tariffs that impacted year-on-year performance by 8.2% decline. The company is managing tariff pressures through cost absorption and customer negotiations while maintaining strong liquidity of INR 697 crores and expanding capacity in Paint Protection Films and architectural segments.",
            "Sentiment": "neutral",
            "PublishDate": 1763465677115,
            "Source": "earnings"
        },
        {
            "Title": "Garware Hi-Tech Films Provides Growth and Margin Guidance Contingent on Tariff Changes",
            "Summary": "Garware Hi-Tech Films expects to maintain EBITDA margins of 22-25% (+/- 3%) if tariffs are reduced, but acknowledges maintaining this range will be challenging if 50% tariffs remain. The company projects revenue CAGR of 15-20% for FY26 and beyond, with EBITDA margins expected to improve by 1.5-2% after TPU plant commissioning at revenue levels between INR 2,000-2,500 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1763216136663,
            "Source": "stock"
        },
        {
            "Title": "Garware Hi Tech Films Reports Decline in Q2 Consolidated Profit and Revenue",
            "Summary": "Garware Hi Tech Films reported mixed quarterly results with consolidated net profit declining to 912 million rupees from 1.04 billion rupees year-over-year, while consolidated revenue dropped to 5.7 billion rupees from 6.2 billion rupees. However, standalone net profit increased to 1.07 billion rupees from 957 million rupees, with standalone revenue declining to 5.12 billion rupees from 6 billion rupees. Consolidated EBITDA fell to 1.2 billion rupees from 1.36 billion rupees, with EBITDA margin compressing to 20.97% from 22.1%. Standalone EBITDA decreased to 1 billion rupees from 1.2 billion rupees, with margin declining to 19.7% from 21.17%.",
            "Sentiment": "negative",
            "PublishDate": 1763023707453,
            "Source": "earnings"
        },
        {
            "Title": "Garware Hi-Tech Films Commences Production at New PPF Manufacturing Line in Maharashtra",
            "Summary": "Garware Hi-Tech Films has started production at its new Paint Protection Film (PPF) manufacturing line located in Waluj, Maharashtra. The facility represents an investment of ₹125 crores and has an annual production capacity of 300 LSF (Linear Square Feet). This expansion adds manufacturing capability to the company's operations in the specialty films segment.",
            "Sentiment": "positive",
            "PublishDate": 1758703675798,
            "Source": "stock"
        },
        {
            "Title": "Garware Hi-Tech Films Reports Record Financial Performance at 68th AGM",
            "Summary": "Garware Hi-Tech Films Limited held its 68th Annual General Meeting on September 24, 2025, where shareholders approved key business items including adoption of financial statements, final dividend declaration, and director appointments. The company reported record-breaking results for FY25 with consolidated revenue surging 26% to ₹2,109 crores, cash profits increasing 52% to ₹377 crores, and profit after tax rising 63% to ₹331 crores. The company maintains a net debt-free status and announced a dividend increase to 120% of par value from the previous 100%. Key developments include launching a new Paint Protection Film line, expanding their GAS distributor network to 250+, and receiving multiple industry awards including recognition from CII as a top 50 innovative company and Dun & Bradstreet's India's Top 500 Value Creators of 2024. The company is investing in a new Thermoplastic Polyurethane Plant for backward integration and launched Garware Home Solutions pilot project in key Indian cities. Ms. Monika Garware chaired the meeting in absence of Dr. S.B. Garware, with all proposed resolutions expected to pass with requisite majority.",
            "Sentiment": "positive",
            "PublishDate": 1758700352874,
            "Source": "corporate_action"
        },
        {
            "Title": "Garware Hi-Tech Films Submits Annual Secretarial Compliance Report for FY2025",
            "Summary": "Garware Hi-Tech Films Limited has submitted its Annual Secretarial Compliance Report for the financial year ended March 31, 2025. The report was prepared by Manish Ghia & Associates, Practicing Company Secretaries, and confirms the company's compliance with various SEBI regulations and guidelines. The compliance review covered multiple areas including listing obligations, disclosure requirements, prohibition of insider trading, and depositories regulations. The report indicates full compliance across all applicable areas, with confirmations that all required policies are adopted and updated timely, website maintenance and disclosures are proper, no directors are disqualified, performance evaluations were conducted, and related party transactions received prior audit committee approval. No actions were taken against the company by SEBI or stock exchanges during the review period, and no statutory auditor resignations occurred.",
            "Sentiment": "positive",
            "PublishDate": 1757137194615,
            "Source": "corporate_action"
        },
        {
            "Title": "Garware Hi-Tech Films Reports Mixed Q1 Results Amid U.S. Tariff Challenges and Early Monsoon Impact",
            "Summary": "Garware Hi-Tech Films reported revenue of ₹495 crores for the quarter ended June 30, 2025, marking 4.3% year-over-year growth. However, EBITDA declined to ₹123 crores from ₹130 crores in the same quarter last year, with margins dropping to 24.8% from 27.4%. Profit after tax decreased to ₹83 crores from ₹88.4 crores. The company faced headwinds from early monsoon affecting domestic demand and escalating U.S. tariffs that increased from 6.25% to 16.25% in April 2025, with an additional 15% tariff imposed from August 7, 2025. Paint Protection Films showed strong performance with 28% growth, while SunControl Films declined 7% and Industrial Products dropped 3%. The company maintains over ₹700 crores in cash and is expanding its studio network to 300 locations by March 2026. Management expects FY26 to remain challenging due to tariff uncertainties and has made its earlier revenue guidance of ₹2,500 crores uncertain.",
            "Sentiment": "negative",
            "PublishDate": 1754980586308,
            "Source": "earnings"
        },
        {
            "Title": "Garware Hi-Tech Films Faces Higher Tariff Challenges While Pursuing Middle East and Europe Expansion",
            "Summary": "Garware Hi-Tech Films is experiencing financial impact from higher tariffs while simultaneously pursuing growth opportunities in the Middle East and Europe markets.",
            "Sentiment": "neutral",
            "PublishDate": 1754980171371,
            "Source": "stock"
        },
        {
            "Title": "Garware Hi-Tech Films Reports Q1 FY26 Results with Revenue Growth Despite Global Challenges",
            "Summary": "Garware Hi-Tech Films Limited submitted its investor presentation for the quarter ended June 30, 2025. The company reported revenue from operations of ₹495 crores in Q1 FY26 compared to ₹475 crores in Q1 FY25. EBITDA stood at ₹123 crores with a margin of 24.8% versus ₹130 crores and 27.4% margin in the previous year. PAT was ₹83 crores with 16.8% margin compared to ₹88 crores and 18.6% margin in Q1 FY25. Chairman Dr. S B Garware highlighted the company's focus on cost optimization and innovation despite challenges from tariffs and geopolitical uncertainties. Vice Chairperson Ms. Monika Garware noted stable performance amid ongoing challenges and mentioned strategic investments in new PPF production line and TPU facility. The company maintains zero net debt with ₹704 crores cash surplus. Value-added products contributed 85% to revenue mix. The company is expanding TPU extrusion line capacity by 360 LSF per annum with estimated capital expenditure of ₹118 crores, expected to commence commercial production by October 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1754652045086,
            "Source": "earnings"
        },
        {
            "Title": "Garware Hi Tech Films Reports Decline in Q1 Profitability Despite Revenue Growth",
            "Summary": "Garware Hi Tech Films reported mixed quarterly results with revenue increasing to 4.53 billion rupees from 4.5 billion rupees year-over-year. However, the company experienced a decline in profitability with EBITDA falling to 966 million rupees from 1.16 billion rupees, while EBITDA margin compressed to 21.34% from 25.84%. Net profit also decreased to 746 million rupees compared to 1.04 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1754650974595,
            "Source": "earnings"
        },
        {
            "Title": "Garware Hi-Tech Films Notifies Shareholders of Unclaimed Dividends Transfer to IEPF",
            "Summary": "Garware Hi-Tech Films Limited has notified shareholders about unclaimed dividends from FY 2017-18 that are liable for transfer to the Investor Education and Protection Fund after seven consecutive years, as per Section 124(6) of the Companies Act, 2013. The company has sent letters to affected shareholders informing them that dividends from FY 2017-18 through FY 2023-24 remain unclaimed. Shareholders have until November 02, 2025 to claim their unpaid dividend from FY 2017-18, failing which both the dividend amount and corresponding shares will be transferred to IEPF. The company's registrar MUFG Intime India Private Limited can be contacted for claims and clarifications. Once transferred to IEPF, shareholders can reclaim their shares by filing e-form IEPF-5 with IEPF authorities.",
            "Sentiment": "neutral",
            "PublishDate": 1753794604558,
            "Source": "corporate_action"
        },
        {
            "Title": "DGTR Initiates Anti-Dumping Investigation on TPU-Based Protection Films from China",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has launched an investigation into alleged anti-dumping practices concerning TPU-based surface/paint protection films imported from China. This investigation potentially affects Garware Hi-Tech Films, an Indian company in the sector.",
            "Sentiment": "neutral",
            "PublishDate": 1750303714000,
            "Source": "default"
        },
        {
            "Title": "Garware Hi Tech Films Reports Strong Q4 Financial Performance",
            "Summary": "Garware Hi Tech Films announced its Q4 financial results, showing significant year-over-year growth. The company's revenue increased from 4.4 billion rupees to 5.2 billion rupees. EBITDA also improved, rising from 766 million rupees to 1 billion rupees. The EBITDA margin expanded from 17.45% to 19.38%.",
            "Sentiment": "positive",
            "PublishDate": 1747210851000,
            "Source": "result"
        },
        {
            "Title": "Garware Hi Tech Films Reports 27% Increase in Q4 Net Profit",
            "Summary": "Garware Hi Tech Films has reported a net profit of 736 million rupees for the fourth quarter, compared to 580 million rupees in the same period last year, representing a year-over-year increase of 27%.",
            "Sentiment": "positive",
            "PublishDate": 1747210745000,
            "Source": "result"
        },
        {
            "Title": "Garware Hi-Tech Films to Consider Q4 Results on May 14",
            "Summary": "Garware Hi-Tech Films has announced that it will consider and approve its financial results for the fourth quarter on May 14. This announcement indicates the company's adherence to regular financial reporting practices and provides investors with a specific date to expect the latest financial information.",
            "Sentiment": "neutral",
            "PublishDate": 1746538080000,
            "Source": "default"
        },
        {
            "Title": "Garware Hi-Tech Films: Penny Stock Transforms into Multibagger Over 25 Years",
            "Summary": "Garware Hi-Tech Films stock has grown from ₹4.40 to ₹4,201 in 25 years, offering 957 times returns. The company reported a 102.2% YoY increase in Q1FY25 PAT to ₹88.40 crore, with revenue growing 25% YoY to ₹474.50 crore. EBITDA rose 78.7% YoY to ₹130 crore, with margins improving to 27.4%.",
            "Sentiment": "positive",
            "PublishDate": 1740304264000,
            "Source": "earnings"
        },
        {
            "Title": "Garware Hi-Tech Films Approves INR 118 Crore Investment in TPU Extrusion Line",
            "Summary": "Garware Hi-Tech Films has approved an investment of INR 118 crores for a TPU (Thermoplastic Polyurethane) extrusion line at their Waluj plant. The new line will have an annual capacity of 360 LSF (Linear Square Feet). Production is expected to begin by October 2026.",
            "Sentiment": "positive",
            "PublishDate": 1738919479000,
            "Source": "corporate_action"
        },
        {
            "Title": "Garware Hi-Tech Films Approves New TPU Extrusion Plant Investment",
            "Summary": "Garware Hi-Tech Films has approved the establishment of a Thermoplastic Polyurethane (TPU) extrusion plant with a capital expenditure of 1.18 billion rupees. This investment represents a significant expansion of the company's manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1738919335000,
            "Source": "corporate_action"
        },
        {
            "Title": "Garware Hi Tech Films Reports Improved Q3 EBITDA and Margin",
            "Summary": "Garware Hi Tech Films announced its Q3 financial results, showing an increase in EBITDA to 780 million rupees from 700 million rupees year-over-year. The company's EBITDA margin also improved, rising to 17.65% from 16.17% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738919211000,
            "Source": "earnings"
        },
        {
            "Title": "Garware Hi Tech Films Reports Strong Q2 Financial Performance",
            "Summary": "Garware Hi Tech Films has reported significant year-over-year improvements in its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.2 billion rupees, up from 615 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 21.17% from 16.01% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1731572107000,
            "Source": "result"
        },
        {
            "Title": "Garware Hi Tech Films Reports Significant Revenue Growth in Q2",
            "Summary": "Garware Hi Tech Films has announced its second quarter revenue, which stands at 6.2 billion rupees. This represents a substantial increase from the previous year's Q2 revenue of 3.84 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1731571824000,
            "Source": "result"
        },
        {
            "Title": "Garware Hi Tech Films Reports Strong Q2 Profit Growth",
            "Summary": "Garware Hi Tech Films has reported a significant increase in net profit for the second quarter. The company's net profit rose to 1.04 billion rupees, up from 436 million rupees in the same period last year, representing a year-over-year growth of approximately 138%.",
            "Sentiment": "positive",
            "PublishDate": 1731571778000,
            "Source": "result"
        },
        {
            "Title": "Garware Hi-Tech Films: Stock Soars 153% in 5 Months",
            "Summary": "<p>Garware Hi-Tech Films (GHFL) stock hit a <span class='positive'>new high</span> of Rs 4,211.05, <span class='positive'>up 8%</span> intraday. The stock has <span class='positive'>surged 153%</span> in the last 5 months. Q1FY25 results showed <span class='positive'>102.2% YoY jump</span> in PAT to Rs 88.40 crore, with revenue <span class='positive'>up 25% YoY</span> to Rs 474.50 crore. EBITDA <span class='positive'>grew 78.7% YoY</span> to Rs 130 crore, with margins <span class='positive'>improving</span> to 27.4%.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728984835000,
            "Source": "normal_news"
        }
    ]
}