{
    "Symbol": "GSFC",
    "ISIN": "INE026A01025",
    "News": [
        {
            "Title": "GSFC Q3 FY26 Results: 32% PAT Growth, 5% Revenue Rise",
            "Summary": "Gujarat State Fertilizers & Chemicals reports strong Q3 FY26 performance with revenue growth of 5% to Rs. 2,894 crore and PAT surge of 32% to Rs. 157 crore, driven by record fertilizer production.",
            "Sentiment": "positive",
            "PublishDate": 1770642493087,
            "Source": "co_actions_results"
        },
        {
            "Title": "GSFC Senior VP A V Bhave Superannuates from Service",
            "Summary": "Gujarat State Fertilizers & Chemicals Limited announces superannuation of Mr. A V Bhave, Senior Vice President and Senior Management Personnel, effective December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769687479053,
            "Source": "stocks"
        },
        {
            "Title": "GSFC Appoints Mr. Ashwani Kumar, IAS as New Director",
            "Summary": "Gujarat State Fertilizers & Chemicals Limited announces the appointment of Mr. Ashwani Kumar, IAS as Director, replacing Mr. S J Haider, IAS (Retd.) following government nomination dated January 27, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769591732639,
            "Source": "stocks"
        },
        {
            "Title": "GSFC Schedules Q3FY26 Results Call on Feb 10",
            "Summary": "Gujarat State Fertilizers & Chemicals Limited has scheduled a conference call on February 10, 2026 at 3:30 PM IST to discuss Q3 FY 2025-26 financial results with senior management.",
            "Sentiment": "neutral",
            "PublishDate": 1769590974920,
            "Source": "co_actions_results"
        },
        {
            "Title": "GSFC Board Meeting Set for February 9 to Review Q3FY26",
            "Summary": "Gujarat State Fertilizers & Chemicals Limited has scheduled a board meeting on February 9, 2026, to consider Q3FY26 unaudited financial results. Trading window closed from December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768457848006,
            "Source": "co_actions_results"
        },
        {
            "Title": "GSFC Commences Sulphuric Acid Production at Vadodara",
            "Summary": "Gujarat State Fertilizers & Chemicals Limited announces commercial production start of its new Sulphuric Acid plant at Fertilizernagar, Vadodara with 600 MTPD capacity on January 7, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767768617475,
            "Source": "stocks"
        },
        {
            "Title": "GSFC Starts Commercial Operations at Vadodara Plant",
            "Summary": "Gujarat State Fertilizers & Chemicals has commenced commercial activities at its Vadodara manufacturing facility, marking a significant operational milestone for the fertilizer company.",
            "Sentiment": "positive",
            "PublishDate": 1767768276640,
            "Source": "stocks"
        },
        {
            "Title": "GSFC Appoints Dr. Rajender Kumar as Managing Director",
            "Summary": "Gujarat State Fertilizers & Chemicals' Nomination and Remuneration Committee has approved the appointment of Dr. Rajender Kumar, IAS as Managing Director, with board approval pending.",
            "Sentiment": "positive",
            "PublishDate": 1767693392153,
            "Source": "stocks"
        },
        {
            "Title": "GNFC Director Sanjeev Kumar Resigns from Board",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Limited announces resignation of Director Shri Sanjeev Kumar, IAS from the company's board effective January 2, 2026, following his cessation as Managing Director of GSFC.",
            "Sentiment": "neutral",
            "PublishDate": 1767431052090,
            "Source": "stocks"
        },
        {
            "Title": "Gujarat Alkalies & Chemicals Director S.J. Haider Resigns",
            "Summary": "S.J. Haider, IAS officer with DIN 02879522, resigned as Director of Gujarat Alkalies & Chemicals Limited effective December 31, 2025, following his superannuation from government service.",
            "Sentiment": "neutral",
            "PublishDate": 1767266604136,
            "Source": "stocks"
        },
        {
            "Title": "GNFC Leadership Change: Rajkumar Beniwal Named MD",
            "Summary": "Gujarat government withdraws T. Natarajan's nomination as Managing Director of Gujarat Narmada Valley Fertilizers & Chemicals and appoints Rajkumar Beniwal to the position.",
            "Sentiment": "neutral",
            "PublishDate": 1766714607380,
            "Source": "stocks"
        },
        {
            "Title": "Gujarat State Fertilizers Chemicals Limited Seeks Shareholder Approval for New Chairman Appointment",
            "Summary": "Gujarat State Fertilizers Chemicals Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Manoj Kumar Das, IAS as Director and Chairman, replacing Mr. Pankaj Joshi, IAS (Retd.). The e-voting process runs from November 21, 2025 to December 20, 2025, with results to be declared by December 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763621826475,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat State Fertilizers Reports Strong Q2 FY26 Performance with 21% Revenue Growth",
            "Summary": "Gujarat State Fertilizers & Chemicals Limited posted consolidated revenue of Rs. 3,187 crores in Q2 FY26, up 21% year-on-year, with profit after tax rising 9% to Rs. 324 crores driven by higher fertilizer sales volumes and improved industrial products segment. The company maintained strong financial health with no long-term debt and expects stable demand in Q3 with the commissioning of its Sulfuric Acid V project providing cost efficiency benefits.",
            "Sentiment": "positive",
            "PublishDate": 1763459870847,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Narmada Valley Fertilizers Reports 70% Profit Jump in Q2",
            "Summary": "Gujarat Narmada Valley Fertilizers & Chemicals Ltd (GNFC) reported net profit of ₹179 crore for Q2FY26, marking a 70.4% increase from ₹105 crore in the same period last year. Revenue grew 2.7% to ₹1,968 crore driven by improved sales volumes and cost efficiency. EBITDA nearly doubled to ₹185 crore from ₹90 crore, with margins expanding to 9.4% from 4.7%. Managing Director Dr T Natarajan credited the performance to better sales and declining input costs. The company expects enhanced competitiveness from revised government nutrient-based subsidy rates for Rabi season and extended anti-dumping duty on TDI imports until March 2026. GNFC has approved a brownfield investment for an ammonium nitrate melt plant and expects its power plant operationalisation in FY26 to boost cost efficiency at the Dahej TDI complex. The board approved a final dividend of ₹18 per equity share for FY25, totaling ₹264.49 crore. Shares closed 5.02% higher at ₹518.10.",
            "Sentiment": "positive",
            "PublishDate": 1762953795614,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat State Fertilizers & Chemicals Reports 8.7% Growth in Q2 Net Profit to 3.24 Billion Rupees",
            "Summary": "Gujarat State Fertilizers & Chemicals reported consolidated net profit of 3.24 billion rupees in Q2, up from 2.98 billion rupees in the same period last year. Revenue increased to 31.87 billion rupees from 26.35 billion rupees year-over-year. EBITDA rose to 3.37 billion rupees compared to 2.84 billion rupees previously. However, EBITDA margin declined slightly to 10.56% from 10.76% in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1762875035698,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat State Fertilizers & Chemicals Appoints Manoj Kumar Das as Director Chairman",
            "Summary": "Gujarat State Fertilizers & Chemicals Limited announced that its Nomination and Remuneration Committee approved the appointment of Manoj Kumar Das, IAS (DIN 06530792) as Director Chairman through a Circular Resolution. The committee has recommended this appointment for Board approval. The company informed BSE and NSE about this management change in compliance with SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762254589445,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gujarat State Fertilizers & Chemicals Appoints Manoj Kumar Das as Chairman",
            "Summary": "Gujarat State Fertilizers & Chemicals Limited has announced the appointment of Mr. Manoj Kumar Das, IAS (DIN 06530792) as Chairman of the Company. The Energy Petrochemicals Department, Government of Gujarat nominated Das for the position through a letter dated November 1, 2025. Das is a Senior IAS Officer from the 1990 batch with B.Tech (Computer Science) from IIT-Kharagpur, specializing in Revenue administration, Urban Management, and Disaster Management. He serves as Chief Secretary to Government of Gujarat and has extensive experience including roles as District Collector in multiple cities, Municipal Commissioner of Surat and Vadodara, and Joint Managing Director at Gujarat State Petroleum Corporation Limited. The company confirmed Das is not debarred from holding directorship and is not related to any existing directors. The appointment is subject to approval by the Nomination and Remuneration Committee and the Board.",
            "Sentiment": "positive",
            "PublishDate": 1762072935918,
            "Source": "corporate_governance"
        },
        {
            "Title": "Pankaj Joshi Resigns as Chairman of Gujarat State Fertilizers & Chemicals Limited",
            "Summary": "Pankaj Joshi, IAS (Retd.), has resigned as Chairman of Gujarat State Fertilizers & Chemicals Limited (GSFC) effective October 31, 2025. The resignation follows his superannuation as Chief Secretary to Government of Gujarat. Joshi also resigned from chairman and director positions at multiple other Gujarat state companies including Gujarat Narmada Valley Fertilizers & Chemicals Limited, Gujarat State Petronet Limited, Gujarat State Petroleum Corporation Ltd., Gujarat Gas Limited, GSPL India Gasnet Limited, GSPL India Transco Limited, and Sardar Sarovar Narmada Nigam Limited. The company has informed stock exchanges BSE and NSE about the leadership change.",
            "Sentiment": "neutral",
            "PublishDate": 1761979053398,
            "Source": "corporate_governance"
        },
        {
            "Title": "GSFC Initiates Anti-Dumping Investigation on Nylon 6 Imports from Four Countries",
            "Summary": "GSFC has launched an anti-dumping investigation targeting Nylon 6 imports from China, Russia, Taiwan, and Thailand. The investigation specifically covers Nylon 6 products with relative viscosity ranging from RV-3.0 to 3.6. This action suggests concerns about unfair pricing practices in these imports that may be affecting domestic market conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1759232423167,
            "Source": "stock"
        },
        {
            "Title": "Gujarat State Fertilizers Reports 59% Jump in PAT to Rs 139 Crores in Q1 FY26",
            "Summary": "Gujarat State Fertilizers and Chemicals Limited reported quarterly results with revenue growing marginally by 1% year-on-year to Rs 2,184 crores. Profit Before Tax rose 63% to Rs 184 crores while Profit After Tax increased 59% to Rs 139 crores compared to Rs 87 crores in the same quarter last year. The fertilizer segment delivered strong EBIT of Rs 137 crores, up from Rs 86 crores, supported by robust trading volumes in NPK and higher manufactured APS and AS sales. However, fertilizer production reduced by approximately 10% due to urea plant revamping project. The industrial products segment turned profitable with Rs 25 crores EBIT, aided by improved ammonia realization and HX crystals. Raw material costs remained mixed with natural gas and ammonia prices softening while phosphoric acid and sulphuric acid costs increased sharply. The company commissioned three major projects during the quarter including a 15 MW solar power project and urea energy revamp facilities. Management expects fertilizer volumes of 23-24 lakh tons for the full year and anticipates government subsidy revision from October 1st due to rising input costs.",
            "Sentiment": "positive",
            "PublishDate": 1755167380548,
            "Source": "earnings"
        },
        {
            "Title": "GSFC Plans Multi-Year Growth Strategy with Capital Investments and Renewable Energy Focus",
            "Summary": "GSFC has outlined a multi-year growth strategy that includes strategic capital expenditure, expansion into renewable energy, and leveraging resilience in the fertilizer industry despite facing raw material challenges.",
            "Sentiment": "positive",
            "PublishDate": 1754571449584,
            "Source": "stock"
        },
        {
            "Title": "Gujarat State Fertilizers & Chemicals Appoints New Managing Director and Auditors, Reports Q1 Results",
            "Summary": "Gujarat State Fertilizers & Chemicals Limited appointed Sanjeev Kumar as Managing Director for a five-year term effective August 1, 2025. The Board also approved unaudited financial results for the quarter ended June 30, 2025, showing standalone revenue from operations of Rs 2,171.65 crores and net profit of Rs 140.03 crores. The company appointed CNK & Associates LLP as Statutory Auditors for three years (FY 2025-26 to FY 2027-28) and Samdani Shah & Kabra as Secretarial Auditors for five years (FY 2025-26 to FY 2029-30), both subject to shareholder approval at the upcoming AGM. Basic earnings per share stood at Rs 3.51 for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754567421617,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gujarat Narmada Valley Fertilizers Reports 30% Profit Decline in June Quarter",
            "Summary": "Gujarat Narmada Valley Fertilizers and Chemicals reported a consolidated net profit of Rs 83 crore in the June quarter, down 30% from Rs 118 crore in the same period last year. The company's total income fell to Rs 1,751 crore from Rs 2,120 crore year-on-year. Fertilizer revenues declined to Rs 577 crore from Rs 701 crore, while chemical revenues dropped to Rs 1,005 crore from Rs 1,304 crore. The Managing Director attributed the decline to lower volume availability affecting both segments, tough market conditions for products like Aniline and TDI impacting realizations, and shutdown effects on operating results. In urea, higher energy costs compared to allowable energy widened losses, while some chemicals faced margin erosion due to lower realizations. The board approved the re-appointment of Bhadresh Mehta as Independent Non-Executive Director for a three-year term from September 2025 to September 2028, subject to shareholder approval.",
            "Sentiment": "negative",
            "PublishDate": 1754505572985,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat State Fertilizers & Chemicals Nomination Committee Approves Sanjeev Kumar as Managing Director",
            "Summary": "Gujarat State Fertilizers & Chemicals Limited's Nomination and Remuneration Committee approved the appointment of Shri Sanjeev Kumar (DIN 03600655) as Managing Director during a meeting held on August 5, 2025. The committee has recommended this appointment for Board approval. The company had previously submitted details regarding management changes on August 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754392459486,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gujarat State Fertilizers & Chemicals Limited Announces Leadership Transition as Managing Director Steps Down",
            "Summary": "Gujarat State Fertilizers & Chemicals Limited (GSFC) announced a change in its leadership structure. Kamal Dayani resigned as Managing Director effective July 31, 2025, due to superannuation. The Government of Gujarat has appointed Sanjeev Kumar, IAS, to hold additional charge as Managing Director through an order dated July 31, 2025. Kumar is a 1998 batch IAS officer with B.Tech from IIT Kharagpur and M.P.A. from University of Minnesota. He currently serves as Principal Secretary in Gujarat's Forests & Environment Department and has over 27 years of public administration experience. His formal appointment as Managing Director is subject to approval by the company's Nomination and Remuneration Committee and Board. The company confirmed that Kumar is not debarred by any regulatory authority and is not related to any existing directors.",
            "Sentiment": "neutral",
            "PublishDate": 1754057590741,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gujarat State Fertilizers Optimistic About Q1 FY25-26 Fertilizer Segment",
            "Summary": "Gujarat State Fertilizers has expressed an optimistic outlook for its fertilizer segment in the first quarter of the financial year 2025-2026. This positive view is based on a favorable monsoon forecast and government policy interventions. The information was shared during a company conference call.",
            "Sentiment": "positive",
            "PublishDate": 1747884644000,
            "Source": "default"
        },
        {
            "Title": "Gujarat State Fertilizers & Chemicals Reports Q4 Results and Dividend",
            "Summary": "Gujarat State Fertilizers & Chemicals announced its Q4 consolidated net profit of 716.8 million rupees, compared to 247.1 million rupees year-over-year and 1.34 billion rupees quarter-over-quarter. Q4 revenue was reported at 19.22 billion rupees, down from 19.65 billion rupees in the same quarter last year. The company has recommended a dividend of 5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747786958000,
            "Source": "default"
        },
        {
            "Title": "GSFC Reports Q4 Results and Recommends Dividend",
            "Summary": "Gujarat State Fertilizers & Chemicals (GSFC) has announced its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit increased to 716.8 million rupees from 247.1 million rupees year-over-year. EBITDA rose to 842 million rupees from 276 million rupees, with EBITDA margin improving to 4.38% from 1.4%. Revenue slightly decreased to 19.22 billion rupees from 19.65 billion rupees. The company has recommended a dividend of 5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747742106000,
            "Source": "result"
        },
        {
            "Title": "GSFC Begins Power Supply from Gujarat Industries Power Co",
            "Summary": "Gujarat State Fertilizers & Chemicals (GSFC) has announced the commencement of power supply from Gujarat Industries Power Company. This development suggests a new arrangement for GSFC's power needs, potentially impacting its operations and costs.",
            "Sentiment": "positive",
            "PublishDate": 1745582040000,
            "Source": "default"
        },
        {
            "Title": "Gujarat State Fertilizers & Chemicals Invests in VJSPL Rights Issue",
            "Summary": "Gujarat State Fertilizers & Chemicals (GSFC) has participated in a rights issue of VJSPL, investing 144 million rupees. This move indicates GSFC's commitment to supporting VJSPL's growth or financial needs through the purchase of additional shares.",
            "Sentiment": "neutral",
            "PublishDate": 1741356405000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat State Fertilizers & Chemicals Reports Q3 Financial Results",
            "Summary": "Gujarat State Fertilizers & Chemicals has announced its Q3 consolidated financial results. The company reported a net profit of 1.3 billion rupees, compared to 1.18 billion rupees in the same quarter last year, representing a year-over-year increase. However, this is a decrease from the previous quarter's net profit of 2.98 billion rupees. The company's Q3 revenue stood at 28 billion rupees, up from 20 billion rupees in the same period last year, showing significant growth in top-line performance.",
            "Sentiment": "positive",
            "PublishDate": 1739233342000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat State Fertilizers & Chemicals Reports Improved Q3 EBITDA and Margin",
            "Summary": "Gujarat State Fertilizers & Chemicals has reported its Q3 financial results. The company's EBITDA increased to 1.58 billion rupees, up from 1.08 billion rupees in the same quarter last year. The EBITDA margin also improved, rising to 5.63% from 5.36% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739190390000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat State Fertilizers & Chemicals Reports Q3 Financial Results",
            "Summary": "Gujarat State Fertilizers & Chemicals has announced its Q3 consolidated financial results. The company reported a net profit of 1.3 billion rupees, compared to 1.18 billion rupees in the same quarter last year, showing a year-over-year increase. However, this represents a decrease from the previous quarter's net profit of 2.98 billion rupees. The company's Q3 revenue stood at 28 billion rupees, up from 20 billion rupees in the same period last year, indicating significant revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1739190325000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat State Fertilizers & Chemicals: Margins Expected to Stabilize at 10% in H2",
            "Summary": "GSFC CFO SK Bajpai expects margins to remain around 10% in Q3 and Q4 due to rising raw material costs and end of fertilizer season. Q2 margins improved to 10.8%, but revenues fell 15.5% to Rs 2,635.17 crore. Three new projects set to complete by year-end may boost bottom line.",
            "Sentiment": "neutral",
            "PublishDate": 1731729122000,
            "Source": "result"
        },
        {
            "Title": "Gujarat State Fertilizers Expects Strong Q3 Despite Challenges",
            "Summary": "Gujarat State Fertilizers reports that despite facing tight margins due to Middle East uncertainties and competitive imports, the demand for their key industrial products remains strong. The company projects that their Q3 turnover will exceed that of Q2.",
            "Sentiment": "positive",
            "PublishDate": 1731469083000,
            "Source": "normal_news"
        },
        {
            "Title": "Gujarat State Fertilizers Plans Imports to Boost Q3 Sales",
            "Summary": "Gujarat State Fertilizers intends to supplement its fertilizer production with imports. The company expects to achieve sales of 5.0 lakh metric tons in the third quarter of the 2024-2025 fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1731469078000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat State Fertilizers & Chemicals Reports Q2 Financial Results and Investment Plan",
            "Summary": "Gujarat State Fertilizers & Chemicals announced its Q2 consolidated net profit of 2.98 billion rupees, slightly down from 3.1 billion rupees year-over-year, but up from 873 million rupees quarter-over-quarter. Q2 revenue decreased to 26.4 billion rupees from 31.19 billion rupees year-over-year. The company also plans to invest 288.5 million rupees in Vadodara Jal Sanchay.",
            "Sentiment": "neutral",
            "PublishDate": 1731455712000,
            "Source": "result"
        },
        {
            "Title": "GSFC Commissions New Manufacturing Plant for Hydroxylamine Sulphate Crystal",
            "Summary": "<p><span class='positive'>Gujarat State Fertilizers & Chemicals Limited (GSFC)</span> has announced the <b>commissioning</b> of a <span class='positive'>new manufacturing plant</span> at Fertilizernagar, Vadodara. The plant is dedicated to the production of <span class='neutral'>Hydroxylamine Sulphate Crystal</span>, also known as <span class='neutral'>FIX Crystal</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728645644000,
            "Source": "corporate_action"
        }
    ]
}