{
    "Symbol": "GSLSU",
    "ISIN": "INE0JSX01015",
    "News": [
        {
            "Title": "Global Surfaces Reports Q3FY26 Results & Major Decisions",
            "Summary": "Global Surfaces Limited announced Q3FY26 results with standalone profit of ₹4.90 crore but consolidated loss of ₹33.35 crore. Board approved ₹50 crore loan conversion to equity and Bagru unit closure.",
            "Sentiment": "negative",
            "PublishDate": 1770128232740,
            "Source": "co_actions_results"
        },
        {
            "Title": "Global Surfaces approves new auditor appointment",
            "Summary": "Global Surfaces Limited shareholders approve appointment of M/s Ummed Jain & Co as statutory auditors through postal ballot with 99.99% votes in favour, replacing resigned auditors M/s B. Khosla & Co.",
            "Sentiment": "positive",
            "PublishDate": 1767880225849,
            "Source": "co_actions_results"
        },
        {
            "Title": "Global Surfaces Seeks Shareholder Approval for New Statutory Auditor Appointment",
            "Summary": "Global Surfaces Limited has issued a postal ballot notice seeking member approval to appoint M/s Ummed Jain & Co. as statutory auditors to fill the casual vacancy caused by the resignation of M/s B. Khosla & Co. on November 13, 2025. The remote e-voting period will commence on December 10, 2025, and end on January 8, 2026, with the new auditors proposed to serve until the next AGM in 2026 at a remuneration of ₹17.50 lakh for FY 2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1765278561671,
            "Source": "corporate_governance"
        },
        {
            "Title": "Global Surfaces Reports Q2 FY26 Loss with Dubai Operations Showing Improvement",
            "Summary": "Global Surfaces Limited posted a consolidated net loss of INR 46 million for Q2 FY26 with revenue of INR 541 million, while EBITDA turned negative at INR -36 million with -6.65% margins. The Dubai manufacturing facility showed meaningful improvement with 53% utilization and stronger traction in Middle East and North America markets, though India operations remained soft due to US tariff uncertainty.",
            "Sentiment": "negative",
            "PublishDate": 1763375069876,
            "Source": "earnings"
        },
        {
            "Title": "Global Surfaces Reports Quarterly Loss and Auditor Resignation",
            "Summary": "Global Surfaces Limited reported a consolidated net loss of Rs. 48.83 million for the quarter ended September 30, 2025, compared to a loss of Rs. 64.28 million in the same period last year, while also announcing the resignation of statutory auditor B. Khosla & Co. The company faces significant exposure to U.S. market uncertainties due to elevated tariffs on India-originating goods, though it maintains multi-shore manufacturing capabilities including operations in Dubai's Jebel Ali Free Zone for potential mitigation.",
            "Sentiment": "positive",
            "PublishDate": 1763063680344,
            "Source": "earnings"
        },
        {
            "Title": "Global Surfaces Subsidiary Receives USD 709,842 Order from Caesarstone",
            "Summary": "Global Surfaces Limited announced that its wholly-owned subsidiary Global Surfaces FZE, located in Dubai, UAE, received a purchase order worth USD 709,842 (approximately Rs 6.30 crores) from Caesarstone Ltd. The order is for manufacturing and supplying engineered quartz surfaces in various designs and specifications, to be executed within one month. Following this order, the company's total unexecuted order book stands at approximately Rs 58 crores on a consolidated basis. The order is part of the company's ordinary business operations.",
            "Sentiment": "positive",
            "PublishDate": 1762280673360,
            "Source": "order&deals"
        },
        {
            "Title": "Global Surfaces Appoints Mayank Shah as CFO While Retaining Chairman and MD Roles",
            "Summary": "Global Surfaces has appointed Mayank Shah as Chief Financial Officer. Shah will continue to serve as Chairman and Managing Director of the company. He brings 20 years of experience in the stone industry to his expanded role.",
            "Sentiment": "positive",
            "PublishDate": 1760685700288,
            "Source": "corporate_governance"
        },
        {
            "Title": "Global Surfaces Reports Narrower Net Loss and Higher Revenue in Q1",
            "Summary": "Global Surfaces reported a consolidated net loss of 4 million rupees in Q1, an improvement from the 12 million rupees loss in the same period last year. The company's revenue increased to 745 million rupees compared to 571 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755164133381,
            "Source": "earnings"
        },
        {
            "Title": "Global Surfaces Limited Changes Auditors for UAE Subsidiary",
            "Summary": "Global Surfaces Limited announced a change in statutory auditors for its wholly owned material subsidiary, Global Surfaces FZE, incorporated in UAE's Jebel Ali Free Zone. M/s. Coast Accounting & Auditing completed their tenure at the close of the Annual General Meeting held on August 5, 2025. M/s. Unity Auditing and Management Consultants have been appointed as the new statutory auditors for Financial Year 2025-26, holding office until the next Annual General Meeting. Unity Auditing and Management Consultants are a JAFZA approved audit firm with a valid license from the UAE Ministry of Economy to practice as statutory auditors in JAFZA.",
            "Sentiment": "neutral",
            "PublishDate": 1754402440726,
            "Source": "corporate_action"
        },
        {
            "Title": "Global Surfaces Plans to Raise Up to ₹155 Crore Through Equity Share Issuance",
            "Summary": "Global Surfaces has announced plans to raise up to ₹155 crore by issuing equity shares in multiple tranches. The company intends to issue these shares in several portions, though specific details about the timing or number of tranches were not provided in the given information.",
            "Sentiment": "positive",
            "PublishDate": 1751301824000,
            "Source": "default"
        },
        {
            "Title": "Global Surfaces Reports Q4 EBITDA Loss",
            "Summary": "Global Surfaces has reported a quarterly EBITDA loss of 19 million rupees, compared to a gain of 162 million rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748444807000,
            "Source": "result"
        },
        {
            "Title": "Global Surfaces Reports Q4 Net Loss and Revenue Decline",
            "Summary": "Global Surfaces has reported a consolidated net loss of 105 million rupees for the fourth quarter, which is unchanged year-over-year but represents a loss of 104 million rupees quarter-over-quarter. The company's revenue for Q4 stood at 575 million rupees, showing a significant decline from 1.09 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748444756000,
            "Source": "result"
        },
        {
            "Title": "Global Surfaces' UAE Facility to Benefit from New US Tariffs",
            "Summary": "Global Surfaces, a company with operations in the UAE, is expected to benefit from newly implemented tariffs in the United States. The company's facility in the UAE is likely to see increased demand or improved competitive positioning as a result of these tariff changes.",
            "Sentiment": "positive",
            "PublishDate": 1744188458000,
            "Source": "corporate_action"
        },
        {
            "Title": "Global Surfaces Reports Q3 EBITDA Loss",
            "Summary": "Global Surfaces has reported a Q3 EBITDA loss of 33 million rupees, compared to a gain of 56 million rupees in the same quarter of the previous year. This represents a significant year-over-year decline in the company's operational performance.",
            "Sentiment": "negative",
            "PublishDate": 1739519027000,
            "Source": "earnings"
        },
        {
            "Title": "Global Surfaces Reports Decline in Q3 Profit and Revenue",
            "Summary": "Global Surfaces has reported a significant decrease in both net profit and revenue for the third quarter. The company's net profit fell to 21.7 million rupees from 54 million rupees in the same period last year. Similarly, revenue declined to 327 million rupees from 404 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739518990000,
            "Source": "earnings"
        },
        {
            "Title": "Global Surfaces Reports Significant Drop in Q2 EBITDA",
            "Summary": "Global Surfaces experienced a substantial decline in its Q2 EBITDA, falling to 14 million rupees from 55 million rupees year-over-year. The company's EBITDA margin also decreased significantly, dropping to 3.79% from 14.32% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731478497000,
            "Source": "result"
        },
        {
            "Title": "Global Surfaces Reports Q2 Financial Results",
            "Summary": "Global Surfaces has released its Q2 financial results. The company's net profit decreased to 34 million rupees from 57 million rupees year-over-year. Revenue also saw a slight decline, dropping to 369 million rupees from 384 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731478479000,
            "Source": "result"
        }
    ]
}