{
    "Symbol": "GSPL",
    "ISIN": "INE246F01010",
    "News": [
        {
            "Title": "GSPL Appoints Sandeep Kumar as Additional Director",
            "Summary": "Gujarat State Petronet Limited announces appointment of Shri Sandeep Kumar, IAS as Additional Director effective 28th January, 2026, nominated by Gujarat State Petroleum Corporation Limited.",
            "Sentiment": "positive",
            "PublishDate": 1770131509330,
            "Source": "stocks"
        },
        {
            "Title": "GSPL Reports Q3 FY26 Results with Mixed Performance",
            "Summary": "Gujarat State Petronet Limited announced Q3 FY26 financial results with standalone net profit of ₹114.27 crores, down from ₹135.58 crores YoY, while consolidated net profit rose to ₹379.05 crores from ₹335.43 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1769089535794,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gujarat State Petronet's Credit Rating Placed on Watch Following Proposed Amalgamation with Gujarat Gas",
            "Summary": "CARE Ratings has placed Gujarat State Petronet Limited's long-term bank facilities rating of CARE AA+ on Rating Watch with Developing Implications due to the proposed amalgamation with Gujarat Gas Limited and subsequent demerger of transmission business into separate entities. The company's total bank facilities of Rs 300 crore include reduced long-term facilities of Rs 50 crore and long-term/short-term facilities of Rs 250 crore, with the restructuring expected to be completed by January 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1765279757707,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat State Petronet's Credit Rating Placed on Watch with Developing Implications by CARE Ratings",
            "Summary": "CARE Ratings has placed Gujarat State Petronet Limited's bank facilities totaling Rs. 300 crore on Rating Watch with Developing Implications, reducing long-term facilities from Rs. 500 crore to Rs. 50 crore and long-term/short-term facilities from Rs. 300 crore to Rs. 250 crore. The rating action follows the company's operational and financial performance review and the announced amalgamation with Gujarat Gas Limited along with subsequent de-merger of transmission business into a separate listed entity.",
            "Sentiment": "negative",
            "PublishDate": 1764938757020,
            "Source": "stock"
        },
        {
            "Title": "Gujarat State Petronet Appoints New CFO, Completes Leadership Transition",
            "Summary": "Gujarat State Petronet Limited appointed Lokesh Agarwal as Chief Financial Officer and Key Managerial Personnel with effect from December 24, 2025, replacing interim CFO Amit Shah who ceased his role on the same date. The appointment completes the leadership transition that began in August 2025 when the board initially approved Agarwal's selection while Shah served as interim CFO during the transition period.",
            "Sentiment": "neutral",
            "PublishDate": 1764679548958,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gujarat State Petronet Approves Investment in GSPL India Gasnet",
            "Summary": "Gujarat State Petronet has approved an investment in GSPL India Gasnet.",
            "Sentiment": "positive",
            "PublishDate": 1762867575138,
            "Source": "stock"
        },
        {
            "Title": "Gujarat State Petronet Reports Decline in Quarterly Financial Performance",
            "Summary": "Gujarat State Petronet reported consolidated net profit of 2.61 billion rupees compared to 3.15 billion rupees in the previous quarter. Revenue decreased to 42.06 billion rupees from 43 billion rupees quarter-on-quarter. EBITDA fell to 6.21 billion rupees from 7.22 billion rupees, while EBITDA margin compressed to 14.76% from 16.8% in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762866613870,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat State Petronet Appoints Manoj Kumar Das as Chairman Managing Director",
            "Summary": "Gujarat State Petronet Limited (GSPL) appointed Shri Manoj Kumar Das, IAS as Chairman Managing Director effective November 1, 2025. Das, who serves as Chief Secretary to Government of Gujarat, was nominated by Gujarat State Petroleum Corporation Limited for the position. He holds a B.Tech in Computer Science from IIT-Kharagpur and has extensive experience in revenue administration, urban management, and disaster management. Das previously served as Joint Managing Director at Gujarat State Petroleum Corporation Limited and currently serves as Director on the boards of GSPC LNG Limited and Gujarat State Police Housing Corporation Limited. The company confirmed that Das is not debarred from holding directorship by any SEBI order and is not related to any existing director.",
            "Sentiment": "positive",
            "PublishDate": 1762172777591,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gujarat State Petronet Chairman Managing Director Shri Pankaj Joshi Resigns Due to Superannuation",
            "Summary": "Shri Pankaj Joshi, IAS (DIN: 01532892) resigned as Chairman Managing Director of Gujarat State Petronet Limited on October 31, 2025. The resignation occurred due to his superannuation as Chief Secretary to Government of Gujarat through GAD Notification No. AIS/35.2025/51/G dated October 28, 2025. The company received the resignation copy on November 1, 2025. Joshi also resigned from multiple other positions including Chairman roles at Gujarat State Fertilizers Chemicals Limited and Gujarat Narmada Valley Fertilizers Chemicals Limited, along with director positions at Gujarat State Petroleum Corporation Ltd., Gujarat Gas Limited, GSPL India Gasnet Limited, GSPL India Transco Limited, and Sardar Sarovar Narmada Nigam Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1761998601795,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gujarat State Petronet Limited Shareholders Approve Composite Scheme of Amalgamation Involving Five Companies",
            "Summary": "Gujarat State Petronet Limited held a meeting of equity shareholders on October 17, 2025, through video conferencing to consider and approve a composite scheme of amalgamation and arrangement. The meeting was directed by the Ministry of Corporate Affairs through an order dated September 10, 2025. The scheme involves five companies: Gujarat State Petroleum Corporation Limited (Transferor Company 1), Gujarat State Petronet Limited (Transferor Company 2), GSPC Energy Limited (Transferor Company 3), Gujarat Gas Limited (Transferee Company/Demerged Company), and GSPL Transmission Limited (Resulting Company). The meeting was chaired by Shri Pankaj Joshi, IAS, who is also the Chairman and Managing Director of the company. Shareholders voted on a resolution to approve the amalgamation scheme under Sections 230 to 232 of the Companies Act, 2013. The meeting commenced at 4:00 PM and concluded at 4:45 PM, with e-voting facility remaining open for an additional 15 minutes. M/s K K Patel & Associates was appointed as scrutinizer for the voting process.",
            "Sentiment": "neutral",
            "PublishDate": 1760712023712,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat State Petronet Appoints Jayant Misra as Independent Director",
            "Summary": "Gujarat State Petronet Limited appointed Shri Jayant Misra, a retired Indian Revenue Service officer, as an Independent Director effective October 22, 2025. The Board approved the appointment through a circular resolution on October 17, 2025. Misra holds qualifications including B.Sc., M.A., MBA (Finance), and LL.B., and previously served as Chairman of Customs & Excise Settlement Commission in New Delhi. The appointment is for a five-year term, subject to shareholder approval. Misra is not related to any existing directors or key managerial personnel of the company and is not debarred from holding directorship by any regulatory authority.",
            "Sentiment": "neutral",
            "PublishDate": 1760710778243,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gujarat State Petronet Limited Calls Shareholder Meeting for Composite Scheme Involving Five Companies",
            "Summary": "Gujarat State Petronet Limited has scheduled a shareholder meeting for October 17, 2025, to approve a Composite Scheme of Amalgamation and Arrangement. The scheme involves five companies: Gujarat State Petroleum Corporation Limited, Gujarat State Petronet Limited, GSPC Energy Limited, Gujarat Gas Limited, and GSPL Transmission Limited. The Ministry of Corporate Affairs directed the company to convene this meeting through its order dated September 10, 2025. The meeting will be conducted via video conferencing, with remote e-voting available from October 14-16, 2025. The scheme includes comprehensive documentation with audited financial statements, valuation reports, fairness opinions, and various regulatory compliance certificates for all participating entities.",
            "Sentiment": "neutral",
            "PublishDate": 1757859423795,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat State Petronet Schedules Shareholder Meeting for Composite Scheme Approval",
            "Summary": "Gujarat State Petronet Limited has scheduled a meeting of equity shareholders on October 17, 2025, at 4:00 P.M. through video conferencing to consider and approve a Composite Scheme of Amalgamation and Arrangement. The meeting is being held as per directions from the Ministry of Corporate Affairs dated September 10, 2025. The cut-off date for determining shareholder voting eligibility is October 10, 2025. Remote e-voting will be available from October 14-16, 2025, commencing at 9:00 A.M. and ending at 5:00 P.M. The meeting notice and explanatory statements will be sent electronically to shareholders whose email addresses are registered with the company or depositories.",
            "Sentiment": "neutral",
            "PublishDate": 1757690043825,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat State Petro Block Trade Worth Rs 60.78 Crore Executed on NSE",
            "Summary": "Gujarat State Petro witnessed a block trade on NSE involving approximately 2,003,272 shares at Rs 303.4 per share, totaling Rs 60.78 crore. The transaction represents a significant bulk deal in the company's shares.",
            "Sentiment": "neutral",
            "PublishDate": 1755675730027,
            "Source": "order&deals"
        },
        {
            "Title": "Gujarat State Petronet Reports 43% Jump in Quarterly Net Profit",
            "Summary": "Gujarat State Petronet reported consolidated net profit of 3.15 billion rupees in Q1, representing a significant increase from 2.2 billion rupees in the previous quarter. However, the company's revenue declined to 43 billion rupees from 44.8 billion rupees quarter-on-quarter, indicating mixed financial performance with strong profitability growth despite lower sales.",
            "Sentiment": "positive",
            "PublishDate": 1755009800351,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat State Petronet Ltd. Block Trade: 1.44 Million Shares at Rs. 333.90",
            "Summary": "A block trade of approximately 1,438,522 shares of Gujarat State Petronet Ltd. was executed on the National Stock Exchange (NSE) at a price of Rs. 333.90 per share. The total value of the transaction was Rs. 48.03 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1749532626000,
            "Source": "block_details"
        },
        {
            "Title": "Gujarat State Petronet: Q4 Results Miss Estimates",
            "Summary": "Gujarat State Petronet (GSPL) reported Q4 FY25 PAT of Rs 707 million, missing Nirmal Bang and Bloomberg estimates by 40.9% and 45.8% respectively. The miss was attributed to a 13.8% lower volume and higher other expenses and interest expenses than expected.",
            "Sentiment": "negative",
            "PublishDate": 1747980998000,
            "Source": "earnings"
        },
        {
            "Title": "GSPL: Q4 Results Show Sharp Decline in Volumes and Margins",
            "Summary": "GSPL reported a 9% revenue decline to ₹238 crore in Q4. Net profit halved to ₹71 crore, and EBITDA fell 35% YoY. Margins narrowed by over 20 percentage points to 52.1%. Volumes dropped 11% QoQ and 23% YoY. The company recommended a dividend of ₹5 per share.",
            "Sentiment": "negative",
            "PublishDate": 1747968070000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat State Petronet: Q4 Profit Plunges 54%, Declares Dividend",
            "Summary": "Gujarat State Petronet reported a 53.6% YoY drop in Q4 net profit to ₹220.3 crore. Revenue fell 4.6% to ₹4,477.5 crore. EBITDA decreased 40.8% to ₹574.3 crore, with margin shrinking 800 bps to 13.4%. The company declared a dividend of ₹5 per share for FY 2024-25.",
            "Sentiment": "negative",
            "PublishDate": 1747923595000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat State Petronet Recommends Dividend",
            "Summary": "Gujarat State Petronet has recommended a dividend of 5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747919012000,
            "Source": "result"
        },
        {
            "Title": "Gujarat State Petronet Reports Q4 EBITDA and Margin",
            "Summary": "Gujarat State Petronet has reported its quarterly financial results. The company's EBITDA for Q4 is 5.74 billion rupees, compared to 5.7 billion rupees in the previous quarter. The EBITDA margin for Q4 is 12.83%, up from 12.62% in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747917966000,
            "Source": "result"
        },
        {
            "Title": "Gujarat State Petronet Reports Q4 Financial Results",
            "Summary": "Gujarat State Petronet has announced its quarterly financial results. The company reported a consolidated net profit of 2.2 billion rupees, compared to 2.34 billion rupees in the previous quarter. Revenue for the quarter stood at 44.8 billion rupees, down from 45.4 billion rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747917899000,
            "Source": "result"
        },
        {
            "Title": "Gujarat State Petronet Commissions New Gas Pipeline",
            "Summary": "Gujarat State Petronet has successfully commissioned a new gas pipeline connecting to the Chhara LNG Terminal. This infrastructure enhancement, valued at 650 crore rupees, will improve gas supply in the vicinity of Gir National Park.",
            "Sentiment": "positive",
            "PublishDate": 1742779135000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat State Petronet Limits Project Capex to ₹2,051 Crore",
            "Summary": "Gujarat State Petronet has announced that the capital expenditure (capex) for an unspecified project will be capped at ₹2,051 crore. This information suggests a significant investment in the company's infrastructure or operations, while also indicating a clear budget limitation for the project.",
            "Sentiment": "neutral",
            "PublishDate": 1742182140000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat State Petronet: New Pipeline Approval Boosts Growth Prospects",
            "Summary": "Gujarat State Petronet Ltd. received approval for the Anjar-Palanpur pipeline, increasing total capacity to 45 mmscmd. Citi upgraded the stock to 'Buy' with a target price of Rs 325. The Rs 2,100 crore project is expected to complete in three years, connecting Mundra LNG terminal to the Mehsana-Bhatinda pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1742179769000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat State Petronet: Merger Scheme and Improved Risk-Reward Drive 'Buy' Rating",
            "Summary": "Nirmal Bang upgrades Gujarat State Petronet to 'Buy' based on the GSPC Group merger scheme and improved risk-reward profile. The valuation is derived from the implied value of GSPL post-merger and demerger transaction expected next year.",
            "Sentiment": "positive",
            "PublishDate": 1741323598000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat State Petronet: Restructuring Plans Announced",
            "Summary": "Gujarat State Petroleum Corporation group plans to restructure Gujarat State Petronet, merging it with Gujarat Gas (10:13 ratio) and creating a separate gas transmission unit named 'GSPL Transmission'. The move aims to improve operational focus and shareholder value.",
            "Sentiment": "positive",
            "PublishDate": 1739163596000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat State Petronet Reports Q3 Financial Results",
            "Summary": "Gujarat State Petronet has announced its financial results for the third quarter. The company reported a consolidated net profit of 2.34 billion rupees, which is a decrease compared to the previous quarter's 2.82 billion rupees. However, the revenue for Q3 increased to 45.4 billion rupees from 41.6 billion rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1739146359000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat State Petronet Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Gujarat State Petronet has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q3 stood at 5.7 billion rupees, down from 7.07 billion rupees in the previous quarter. The EBITDA margin also decreased to 12.62% from 16.99% quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1738938276000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat State Petronet Reports Q3 Financial Results",
            "Summary": "Gujarat State Petronet has announced its financial results for the third quarter. The company reported a consolidated net profit of 2.34 billion rupees, down from 2.82 billion rupees in the previous quarter. However, revenue increased to 45.4 billion rupees from 41.6 billion rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738938219000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat State Petronet: Q2 Results Show Weak Performance",
            "Summary": "Gujarat State Petronet's Q2 results indicate weak volumes and tariffs, impacting core performance according to Yes Securities analysis.",
            "Sentiment": "negative",
            "PublishDate": 1731036487000,
            "Source": "result"
        },
        {
            "Title": "Gujarat State Petronet to Invest in Joint Venture CSPL India Casnet",
            "Summary": "Gujarat State Petronet has announced an additional contribution of 420.3 million rupees to its joint venture company, CSPL India Casnet.",
            "Sentiment": "neutral",
            "PublishDate": 1730985585000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat State Petronet Reports Significant Increase in Q2 Other Income",
            "Summary": "Gujarat State Petronet has reported a substantial increase in its other income for the second quarter. The company's other income rose to 2.9 billion rupees, compared to 328 million rupees in the previous quarter, representing a significant quarter-over-quarter growth.",
            "Sentiment": "positive",
            "PublishDate": 1730982967000,
            "Source": "result"
        },
        {
            "Title": "Gujarat State Petronet Reports Q2 EBITDA Decline",
            "Summary": "Gujarat State Petronet's Q2 EBITDA decreased to 1.9 billion rupees from 3 billion rupees in the previous quarter. The company's EBITDA margin also fell to 74.79% from 84.95% quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1730982917000,
            "Source": "result"
        },
        {
            "Title": "Gujarat State Petronet Reports Q2 Financial Results",
            "Summary": "Gujarat State Petronet has announced its financial results for the second quarter. The company's net profit increased to 3.9 billion rupees, up from 2.1 billion rupees in the previous quarter. However, revenue decreased to 2.6 billion rupees from 3.5 billion rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1730982861000,
            "Source": "result"
        },
        {
            "Title": "Gujarat State Petronet: Merger on Horizon for FY26",
            "Summary": "<p><span class='neutral'>Gujarat State Petronet</span> is expected to undergo a <span class='positive'>significant merger</span> in the fiscal year <b>2026</b>, according to a report by <span class='neutral'>Motilal Oswal</span>. This merger is highlighted as a <span class='positive'>key event</span> to watch for the company's future.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728285737000,
            "Source": "corporate_action"
        }
    ]
}