{
    "Symbol": "GSS",
    "ISIN": "INE871H01011",
    "News": [
        {
            "Title": "GSS Infotech Q3FY26 Results: Standalone PAT Jumps 69%",
            "Summary": "GSS Infotech reported strong Q3FY26 standalone results with PAT rising 69% YoY to ₹25.17 lakhs. Board approved director appointment and preference share conversion plans.",
            "Sentiment": "positive",
            "PublishDate": 1770910336612,
            "Source": "co_actions_results"
        },
        {
            "Title": "GSS Infotech Reports Q2 FY26 Results with Mixed Performance Across Segments",
            "Summary": "GSS Infotech Limited's board approved standalone and consolidated unaudited financial results for the quarter and half-year ended September 30, 2025, showing standalone revenue of ₹222.00 lakhs and consolidated revenue of ₹1,914.33 lakhs from operations. The company's consolidated results reflect a loss before tax of ₹0.11 lakhs compared to profit in previous periods, with software business segment showing negative results while maintaining operations across multiple subsidiaries.",
            "Sentiment": "neutral",
            "PublishDate": 1763057904415,
            "Source": "earnings"
        },
        {
            "Title": "GSS Infotech Reports Mixed Q1 Results with Standalone Profit but Consolidated Loss",
            "Summary": "GSS Infotech Limited's Board of Directors approved standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue of ₹197.64 lakhs with a profit after tax of ₹8.60 lakhs, compared to ₹70.34 lakhs profit in the same quarter last year. However, consolidated results showed revenue of ₹2,307.68 lakhs from operations but posted a loss after tax of ₹152.21 lakhs, compared to a profit of ₹10.39 lakhs in the previous quarter. The consolidated results include wholly owned subsidiaries GSS Infotech INC, GSS IT Solutions Pvt Ltd, GSS Healthcare IT Solutions Pvt Ltd, POLIMERAAS LTD and Polimeraas Retail Pvt Ltd. The board deferred decisions on the AGM notice and Board's Report for FY 2024-2025. The company operates in software services as its primary business segment, with trading business as an additional segment in consolidated results.",
            "Sentiment": "negative",
            "PublishDate": 1754413707026,
            "Source": "earnings"
        }
    ]
}