{
    "Symbol": "GTL",
    "ISIN": "INE043A01012",
    "News": [
        {
            "Title": "GTL Limited Announces Board Changes and Sets 37th AGM Date for September 30, 2025",
            "Summary": "GTL Limited's Board of Directors made several key decisions during their meeting. The company scheduled its 37th Annual General Meeting for September 30, 2025, to be conducted through video conferencing. The board approved the appointment of Virendra G. Bhatt as Secretarial Auditor for five consecutive years from FY 2025-26 to FY 2029-30, subject to shareholder approval. Sunil Valavalkar, a Whole-time Director, will not seek re-appointment and will cease to be a Director effective September 30, 2025. The board appointed Rufina Juliana Fernandes as Additional Director from September 4, 2025, and as Whole-time Director for three years starting October 1, 2025, subject to requisite approvals. Fernandes brings 36 years of experience across telecom, education, and IT sectors, and holds 9,400 equity shares in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1756988528018,
            "Source": "corporate_governance"
        },
        {
            "Title": "GTL Limited Appoints Harshad Kulkarni as New Chief Financial Officer",
            "Summary": "GTL Limited has appointed Harshad Kulkarni as Chief Financial Officer and Key Managerial Personnel effective August 7, 2025, following the retirement of Milind Bapat. The Board of Directors approved the appointment based on recommendations from the Nomination and Remuneration Committee and Audit Committee. Kulkarni, aged 52, is a Chartered Accountant and Cost Accountant with over 28 years of experience in financial accounting, budgeting, taxes, internal audit, and Oracle Financials systems development. He was working as Assistant Vice President - Finance & Accounts at GTL Limited before his promotion to CFO.",
            "Sentiment": "neutral",
            "PublishDate": 1754484711952,
            "Source": "corporate_governance"
        },
        {
            "Title": "GTL Limited Reports Quarterly Profit of ₹1,560 Crore Despite Financial Challenges",
            "Summary": "GTL Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of ₹6,990 crore, up from ₹5,573 crore in the same quarter last year. Net profit reached ₹1,560 crore compared to ₹1,289 crore in the previous year quarter. Earnings per share stood at ₹0.99 after exceptional items. The company recorded exceptional items of ₹1,129 crore representing one-time revenue. However, GTL did not pay or provide interest on borrowings during the quarter. Had interest been recognized, the company would have reported a loss of ₹7,738 crore with negative EPS of ₹4.93. The company's net worth remains eroded with current liabilities exceeding current assets. GTL has settled dues with ten secured lenders including Canara Bank, which has filed for withdrawal of proceedings before NCLT Mumbai. The company continues operations on a going concern basis while awaiting arbitration proceedings outcomes.",
            "Sentiment": "neutral",
            "PublishDate": 1754481688230,
            "Source": "earnings"
        }
    ]
}