{
    "Symbol": "GTLINFRA",
    "ISIN": "INE221H01019",
    "News": [
        {
            "Title": "GTL Infrastructure Resolves Canara Bank Dispute as NCLT Dismisses Petition",
            "Summary": "The National Company Law Tribunal, Mumbai dismissed Canara Bank's petition against GTL Infrastructure as withdrawn after the company settled all dues through an OTS (One Time Settlement) arrangement. GTL Infrastructure completed all payments and resolved disputes with Canara Bank, with no further actions required and no financial implications expected.",
            "Sentiment": "positive",
            "PublishDate": 1765278549801,
            "Source": "stock"
        },
        {
            "Title": "GTL Infrastructure Reports Quarterly Loss Amid Ongoing Financial Challenges and Asset Dismantling",
            "Summary": "GTL Infrastructure announced unaudited financial results for the quarter and half year ended September 30, 2025, while continuing to face significant operational challenges including tower site dismantling and debt restructuring efforts. The company completed a One-Time Settlement with a secured lender and received a No Dues Certificate, with legal proceedings before NCLT and DRT in the process of being withdrawn, though material uncertainty about going concern remains.",
            "Sentiment": "negative",
            "PublishDate": 1763113663984,
            "Source": "earnings"
        },
        {
            "Title": "GTL Infrastructure Appoints Ajit Shanbhag as New CFO, Replacing Bhupendra Kiny",
            "Summary": "GTL Infrastructure Limited's Board of Directors approved the appointment of Mr. Ajit Shanbhag as Chief Financial Officer and Key Managerial Personnel effective August 8, 2025. The appointment was based on recommendations from the Nomination and Remuneration Committee and Audit Committee. Mr. Bhupendra Kiny will cease to be CFO on August 7, 2025, transitioning to a new role within the company. Shanbhag, aged 52, is a qualified Chartered Accountant with 27 years of post-qualification experience in financial planning, budgeting, cost management, credit control, audit, taxation and statutory compliances. He has been associated with GTL Infrastructure for over 18 years and has demonstrated expertise in handling complex financial matters.",
            "Sentiment": "neutral",
            "PublishDate": 1754572770673,
            "Source": "corporate_governance"
        },
        {
            "Title": "GTL Infra Reports Wider Net Loss Despite Marginal Revenue Growth in Q1",
            "Summary": "GTL Infra posted a net loss of 2.32 billion rupees in Q1, compared to a loss of 2.02 billion rupees in the same period last year. The company's revenue increased slightly to 3.34 billion rupees from 3.32 billion rupees year-over-year. The telecommunications infrastructure company saw its losses deepen by approximately 15% despite the modest revenue improvement.",
            "Sentiment": "negative",
            "PublishDate": 1754566803740,
            "Source": "earnings"
        },
        {
            "Title": "GTL Infrastructure: Shares Surge 42% in Two Days Amid Telecom Sector Momentum",
            "Summary": "GTL Infrastructure stock rallied 42% over two trading sessions, reaching Rs 2.16 on BSE. The surge is driven by speculative interest, bullish technical indicators, and optimism in 5G infrastructure. High trading volumes indicate increased retail participation. However, the company reported a widened net loss of Rs 248.89 crore for Q4 FY2025.",
            "Sentiment": "positive",
            "PublishDate": 1749709912000,
            "Source": "normal_news"
        },
        {
            "Title": "GTL Infrastructure Reports Q4 Financial Results",
            "Summary": "GTL Infrastructure announced its Q4 financial results. The company's EBITDA increased to 457.3 million rupees from 403 million rupees year-over-year, with EBITDA margin improving to 13.57% from 12.17%. Revenue rose slightly to 3.37 billion rupees from 3.3 billion rupees. However, the company reported a standalone net loss of 2.49 billion rupees, compared to a loss of 2.15 billion rupees in the same quarter last year and 2.1 billion rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746707037000,
            "Source": "result"
        },
        {
            "Title": "GMR Infrastructure: Delhi Airport Tariff Hike Boosts Earnings Outlook",
            "Summary": "AERA approves tariff order for Delhi Airport, allowing up to 148% increase in revenue per passenger. New User Development Fee structure introduced for both arriving and departing passengers. Jefferies maintains 'buy' rating with Rs 92 target price, expecting 40% YoY Ebitda growth in FY2026.",
            "Sentiment": "positive",
            "PublishDate": 1743483337000,
            "Source": "corporate_action"
        },
        {
            "Title": "GTL Infrastructure Reports Increased Net Loss in Q3",
            "Summary": "GTL Infrastructure has reported a net loss of 2.1 billion rupees in the third quarter, compared to a loss of 1.94 billion rupees in the same period last year. The company's revenue slightly increased to 3.4 billion rupees from 3.37 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738801377000,
            "Source": "earnings"
        },
        {
            "Title": "GTL Infrastructure Reports Improved Q3 EBITDA and Margin",
            "Summary": "GTL Infrastructure has announced its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 907 million rupees, up from 747 million rupees in the same period last year. Additionally, the EBITDA margin improved to 26.79% from 22.12% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738750635000,
            "Source": "earnings"
        },
        {
            "Title": "GTL Infrastructure Reports Increased Net Loss in Q3",
            "Summary": "GTL Infrastructure has reported a net loss of 2.1 billion rupees for the third quarter, compared to a loss of 1.94 billion rupees in the same period last year. The company's revenue slightly increased to 3.4 billion rupees from 3.37 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738750630000,
            "Source": "earnings"
        }
    ]
}