{
    "Symbol": "GTPL",
    "ISIN": "INE869I01013",
    "News": [
        {
            "Title": "GTPL Hathway Shares Q3FY26 Conference Call Recording",
            "Summary": "GTPL Hathway Limited makes available audio recording of post-results conference call for Q3FY26 unaudited financial results held on January 13, 2026, covering quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768310272986,
            "Source": "co_actions_results"
        },
        {
            "Title": "GTPL Hathway Shares Fall 3.21% Despite 14% PBT Growth",
            "Summary": "GTPL Hathway shares dropped to ₹93.50 despite reporting 14% YoY profit growth in Q3 FY26. The stock hit a fresh 52-week low amid heavy selling pressure, even as revenue grew 5% to ₹938.2 crore.",
            "Sentiment": "negative",
            "PublishDate": 1768291460402,
            "Source": "co_actions_results"
        },
        {
            "Title": "GTPL Hathway shares surge 13% on strong Q3 results",
            "Summary": "GTPL Hathway shares jumped 13% following Q3FY26 results showing 57% QoQ net profit growth to ₹11.60 crores, despite 2.7% revenue decline to ₹933 crores. Cable TV subscriber base reached 9.4 million.",
            "Sentiment": "positive",
            "PublishDate": 1768285546413,
            "Source": "co_actions_results"
        },
        {
            "Title": "GTPL Hathway Q3 Results Drive 12% Share Price Jump",
            "Summary": "GTPL Hathway shares surged over 12% following Q3FY26 results showing 8.9% net profit growth to ₹11 crore and 5.1% revenue increase to ₹932.6 crore, with expanding broadband operations.",
            "Sentiment": "positive",
            "PublishDate": 1768279418205,
            "Source": "co_actions_results"
        },
        {
            "Title": "GTPL Hathway Q3 profit rises 8.9%, margins expand",
            "Summary": "GTPL Hathway reported 8.9% growth in Q3 net profit to ₹11 crore with revenue up 5.1% to ₹932.6 crore. EBITDA margins expanded to 12.1% while broadband subscriber base grew by 18,000 users.",
            "Sentiment": "positive",
            "PublishDate": 1768271916828,
            "Source": "co_actions_results"
        },
        {
            "Title": "GTPL Hathway Q3 Results: 7.8% Net Profit Growth",
            "Summary": "GTPL Hathway reports ₹110.00 million net profit in Q3, up 7.8% YoY. Revenue grows 4.8% to ₹9.30 billion with EBITDA margin improving to 12.16%.",
            "Sentiment": "positive",
            "PublishDate": 1768262950770,
            "Source": "co_actions_results"
        },
        {
            "Title": "GTPL Hathway launches GTPL Infinity HITS platform",
            "Summary": "GTPL Hathway launched its GTPL Infinity HITS platform on November 29, 2025, offering pan-India content delivery with 800 channels. Q3 FY26 revenue grew 5% YoY to ₹9,382 million.",
            "Sentiment": "positive",
            "PublishDate": 1768228616886,
            "Source": "stocks"
        },
        {
            "Title": "GTPL Hathway Q3 FY26: Revenue Grows 5% YoY to ₹9,382 Mn",
            "Summary": "GTPL Hathway reports Q3 FY26 revenue of ₹9,382 million, up 5% YoY. EBITDA stands at ₹1,189 million with 12.7% margin. Company maintains 9.40 million cable TV and 1.06 million broadband subscribers.",
            "Sentiment": "positive",
            "PublishDate": 1768228034426,
            "Source": "co_actions_results"
        },
        {
            "Title": "GTPL Hathway Q3FY26 Results: Revenue Rises to ₹9,326cr",
            "Summary": "GTPL Hathway reported consolidated revenue of ₹9,326.21 crores for Q3FY26, with net profit of ₹115.59 crores. Company faces ongoing DoT license fee demands of ₹9,754.15 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1768227201411,
            "Source": "co_actions_results"
        },
        {
            "Title": "GTPL Hathway Q3 EBITDA Grows 6.6% to ₹113 Crores",
            "Summary": "GTPL Hathway reports improved Q3 performance with EBITDA rising to ₹113.00 crores from ₹106.00 crores year-on-year, while EBITDA margin expands to 12.16% from 11.89% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1768223790559,
            "Source": "co_actions_results"
        },
        {
            "Title": "GTPL Hathway Q3 Net Profit Rises 7.8% to ₹110 Crores",
            "Summary": "GTPL Hathway reported consolidated net profit of ₹110 crores in Q3, up from ₹102 crores year-on-year. Revenue grew to ₹930 crores from ₹887 crores in the same period.",
            "Sentiment": "positive",
            "PublishDate": 1768223767704,
            "Source": "co_actions_results"
        },
        {
            "Title": "GTPL Hathway Wins Appeal Against ₹45.90 Lakh Penalty",
            "Summary": "Joint Commissioner sets aside ₹45.90 lakh penalty imposed on GTPL Hathway by Assistant Commissioner, Rudrapur, directing full refund of amount paid by the company.",
            "Sentiment": "positive",
            "PublishDate": 1768035093421,
            "Source": "stocks"
        },
        {
            "Title": "GTPL Hathway Board Meet on Jan 12 for Q3FY26 Results",
            "Summary": "GTPL Hathway Limited has scheduled a board meeting on January 12, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767615740143,
            "Source": "co_actions_results"
        },
        {
            "Title": "GTPL Hathway faces ₹13.56 cr GST penalty order",
            "Summary": "GTPL Hathway receives GST penalty order of ₹13.56 crore from tax authorities for alleged excess input tax credit availment. Company plans to file appeal against the order.",
            "Sentiment": "negative",
            "PublishDate": 1766828317960,
            "Source": "stocks"
        },
        {
            "Title": "GTPL Hathway Launches New Entertainment Platform 'GTPL Infinity'",
            "Summary": "GTPL Hathway has launched a new platform called 'GTPL Infinity' designed to provide easy access to entertainment content. The platform launch represents the company's expansion into digital entertainment services for its customer base.",
            "Sentiment": "positive",
            "PublishDate": 1764559598351,
            "Source": "stock"
        },
        {
            "Title": "GTPL Hathway Launches HITS Platform 'GTPL Infinity' for Nationwide Content Distribution",
            "Summary": "GTPL Hathway Limited launched GTPL Infinity, a Headend in the Sky (HITS) platform backed by one of the world's largest C-Band teleport setups in Ahmedabad, offering 800 channels including 100 HD channels with PAN-India availability. The platform enables rapid deployment with single dish antenna setup, reduces delivery costs, and opens new monetization avenues while supporting digital inclusion across metro, rural and remote areas through partnership with PT Telkomsat Satellite Indonesia.",
            "Sentiment": "positive",
            "PublishDate": 1764423746729,
            "Source": "stock"
        },
        {
            "Title": "GTPL Hathway Reports 12% Revenue Growth Despite Subscriber Base Decline in Q2 FY26",
            "Summary": "GTPL Hathway's consolidated revenue grew 12% year-on-year to INR 9,649 million in Q2 FY26, though digital cable TV subscribers declined to 9.50 million from 9.6 million in the previous quarter. The company maintained 8.80 million paying subscribers and broadband subscribers at 1.05 million. Broadband ARPU increased to INR 465, up INR 5 from the previous year. Consolidated EBITDA stood at INR 1,101 million with 11.4% margin, while operating EBITDA margin remained at 22%. Management attributed the subscriber decline to excessive rainfall and lack of major sporting events during the quarter, expressing optimism for recovery in Q3 and Q4. The company is preparing to launch its HITS platform in Q3 and continues expanding its broadband footprint with 5.95 million homepasses, 75% of which are FTTX-ready.",
            "Sentiment": "neutral",
            "PublishDate": 1760771979942,
            "Source": "earnings"
        },
        {
            "Title": "GTPL Hathway Plans Nationwide Hits Platform Launch and Broadband Expansion",
            "Summary": "GTPL Hathway announced plans for significant growth through a nationwide launch of its Hits platform scheduled for Q3 FY26. The company is expanding operations into new states and focusing on rapid broadband growth to serve digitizing Indian households.",
            "Sentiment": "positive",
            "PublishDate": 1760456109161,
            "Source": "stock"
        },
        {
            "Title": "GTPL Hathway Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "GTPL Hathway reported quarterly results showing revenue growth to 9.59 billion rupees from 8.56 billion rupees year-over-year. However, consolidated net profit declined to 92 million rupees from 128 million rupees compared to the same period last year. EBITDA decreased to 1.04 billion rupees from 1.07 billion rupees year-over-year, while EBITDA margin compressed to 10.87% from 12.55% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1760445907059,
            "Source": "earnings"
        },
        {
            "Title": "GTPL Hathway Acquires Remaining 49% Stake in GTPL Vision Services, Making it Wholly Owned Subsidiary",
            "Summary": "GTPL Hathway Limited completed the acquisition of the remaining 49% equity stake in GTPL Vision Services Private Limited on August 05, 2025. The company acquired 1,00,000 equity shares of Rs. 10/- each from existing shareholders, converting GTPL Vision from a subsidiary to a wholly owned subsidiary. The transaction was completed at around 11:00 p.m. on the specified date.",
            "Sentiment": "positive",
            "PublishDate": 1754458285476,
            "Source": "corporate_action"
        },
        {
            "Title": "GTPL Hathway: Q1 Net Profit Drops 27% Amid Stable Subscriber Base",
            "Summary": "GTPL Hathway reported a 27% YoY decline in Q1 net profit to Rs 10.5 crore. Revenue rose 7% to Rs 909.1 crore. Cable TV revenue slightly decreased, but subscriber base remained stable at 9.6 million. Broadband ARPU increased to Rs 465, with data consumption up 17% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1752288425000,
            "Source": "earnings"
        },
        {
            "Title": "GTPL Hathway Reports Q1 Financial Results",
            "Summary": "GTPL Hathway has announced its Q1 consolidated financial results. The company reported a net profit of 106 million rupees, compared to 142.9 million rupees in the same period last year. Revenue for Q1 increased to 9 billion rupees from 8.43 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1752155729000,
            "Source": "result"
        },
        {
            "Title": "GTPL Hathway Reports Q1 EBITDA and Margin Decline",
            "Summary": "GTPL Hathway reported its quarterly results. The company's EBITDA decreased to 1.07 billion rupees from 1.13 billion rupees in the same quarter last year. The EBITDA margin also declined to 11.82% from 13.43% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1752155725000,
            "Source": "result"
        },
        {
            "Title": "GTPL Hathway Reports Q1 Financial Results",
            "Summary": "GTPL Hathway has reported its Q1 consolidated financial results. The company's net profit decreased to 106 million rupees from 142.9 million rupees in the same quarter last year. However, revenue increased to 9 billion rupees from 8.43 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1752155674000,
            "Source": "default"
        },
        {
            "Title": "GTPL Hathway Extends Timeline for GTPL Vision Stake Purchase",
            "Summary": "GTPL Hathway has extended the timeline for its stake purchase in GTPL Vision to September 30, 2025. The original deadline for this corporate action has been pushed back, indicating a change in the acquisition timeline.",
            "Sentiment": "neutral",
            "PublishDate": 1751286235000,
            "Source": "default"
        },
        {
            "Title": "GTPL Hathway: Revenue Surpasses Rs 3,500 Crore in FY25, Broadband Growth Continues",
            "Summary": "GTPL Hathway reported 8% YoY revenue growth to Rs 3,507.2 crore in FY25. Q4 revenue up 10% to Rs 898.9 crore. Broadband revenue increased 4% annually. Digital cable TV subscribers reached 9.60 million, broadband subscribers at 1.045 million. Board recommends 20% dividend.",
            "Sentiment": "positive",
            "PublishDate": 1744851135000,
            "Source": "earnings"
        },
        {
            "Title": "GTPL Hathway Reports Q4 Financial Results and Dividend Declaration",
            "Summary": "GTPL Hathway announced its Q4 consolidated net profit of 106 million rupees, down from 131.8 million rupees year-over-year but up from 102 million rupees quarter-over-quarter. The company's Q4 revenue increased to 8.9 billion rupees from 8.1 billion rupees in the previous year. Additionally, GTPL Hathway recommended a dividend of 2 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1744848442000,
            "Source": "default"
        },
        {
            "Title": "GTPL Hathway Reports Q4 Results and Dividend Announcement",
            "Summary": "GTPL Hathway has released its Q4 financial results. The company's EBITDA for Q4 was 1.06 billion rupees, down from 1.13 billion rupees year-over-year. The EBITDA margin decreased to 11.95% from 13.97% in the same period last year. Additionally, the company has recommended a dividend of 2 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1744814672000,
            "Source": "result"
        },
        {
            "Title": "GTPL Hathway Reports Q4 Financial Results",
            "Summary": "GTPL Hathway announced its Q4 consolidated net profit of 106 million rupees, down from 131.8 million rupees year-over-year but up from 102 million rupees quarter-over-quarter. The company's Q4 revenue increased to 8.9 billion rupees from 8.1 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1744814390000,
            "Source": "result"
        },
        {
            "Title": "GTPL Hathway to Consider Q4 Results on April 16",
            "Summary": "GTPL Hathway, a telecommunications company, has announced that it will consider its fourth quarter (Q4) financial results on April 16. This indicates that the company is preparing to release its earnings report for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1744381154000,
            "Source": "earnings"
        },
        {
            "Title": "GTPL Hathway Secures 10-Year Permission for HITS Services",
            "Summary": "GTPL Hathway has received permission to operate Headend-In-The-Sky (HITS) broadcasting services for a period of 10 years. This authorization allows the company to expand its broadcasting capabilities and potentially reach a wider audience.",
            "Sentiment": "positive",
            "PublishDate": 1743150739000,
            "Source": "corporate_action"
        },
        {
            "Title": "GTPL Hathway: Q3 Profit Plunges 57%, Stock Hits 52-Week Low",
            "Summary": "GTPL Hathway reported a 57.03% drop in Q3FY25 net profit to ₹10.17 crore. Revenue increased 4.27% to ₹887.27 crore. EBITDA fell 12.76% to ₹113.80 crore with margin contraction. Despite financial challenges, the company saw growth in digital cable TV and broadband subscribers.",
            "Sentiment": "negative",
            "PublishDate": 1736486182000,
            "Source": "earnings"
        },
        {
            "Title": "GTPL Hathway Reports Decline in Q3 EBITDA and Margin",
            "Summary": "GTPL Hathway, an Indian cable TV and broadband service provider, has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 1.06 billion rupees from 1.2 billion rupees year-over-year. Additionally, the EBITDA margin dropped to 11.89% from 14.19% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1736433158000,
            "Source": "earnings"
        },
        {
            "Title": "GTPL Hathway Reports Q3 Financial Results",
            "Summary": "GTPL Hathway announced its Q3 consolidated financial results. The company reported a net profit of 102 million rupees, down from 237 million rupees year-over-year and 128 million rupees quarter-over-quarter. Revenue for Q3 increased to 8.87 billion rupees from 8.5 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1736433079000,
            "Source": "earnings"
        },
        {
            "Title": "GTPL Hathway Ltd: Stock Surges 17% Ahead of Q3 Earnings Report",
            "Summary": "GTPL Hathway's stock price rose nearly 17% as investors anticipate Q3 earnings release on Thursday. The company's Q2 showed mixed results with a 61.8% YoY decline in net profit but a 9.8% YoY increase in revenue. The company maintains a strong subscriber base with 9.50 million active and 8.80 million paying subscribers.",
            "Sentiment": "positive",
            "PublishDate": 1736399915000,
            "Source": "earnings"
        },
        {
            "Title": "GTPL Hathway to Acquire 49% Stake in GTPL Vision Services",
            "Summary": "GTPL Hathway has announced its decision to acquire a 49% equity stake in GTPL Vision Services for 113.1 million Indian rupees. This strategic move represents a significant corporate action that will likely impact the company's market position and operations in the cable TV and broadband services sector.",
            "Sentiment": "positive",
            "PublishDate": 1735645882000,
            "Source": "corporate_action"
        },
        {
            "Title": "GTPL Hathway Reports Q2 Financial Results",
            "Summary": "<p>GTPL Hathway, an Indian <span class='neutral'>cable TV and broadband service provider</span>, has announced its <span class='neutral'>Q2 financial results</span>. The company's <b>EBITDA</b> (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is <span class='negative'>1.1 billion rupees</span>, compared to <span class='positive'>1.2 billion rupees</span> in the same quarter last year. The <b>EBITDA margin</b> has <span class='negative'>decreased from 15.95% to 12.54%</span> year-over-year.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728478335000,
            "Source": "result"
        },
        {
            "Title": "GTPL Hathway Reports Q2 Financial Results",
            "Summary": "<p>GTPL Hathway announced its Q2 financial results. The company's consolidated <span class='negative'>net profit decreased</span> to <b>128 million rupees</b> from <b>342 million rupees</b> year-over-year. However, <span class='positive'>revenue increased</span> to <b>8.6 billion rupees</b> from <b>7.8 billion rupees</b> compared to the same period last year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728478226000,
            "Source": "result"
        }
    ]
}