{
    "Symbol": "GUFICBIO",
    "ISIN": "INE742B01025",
    "News": [
        {
            "Title": "Gufic Biosciences Q3FY26 Earnings Call on Feb 16",
            "Summary": "Gufic Biosciences Limited has scheduled its Q3FY26 earnings conference call for February 16, 2026 at 4:30 PM IST to discuss financial performance and business prospects with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1770731592987,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gufic Biosciences Faces ₹4.33 Cr IT Demand",
            "Summary": "Gufic Biosciences receives income tax demand of ₹4.33 crores for AY 2024-25 due to expenditure disallowance. Company plans to file appeal with Commissioner of Income Tax.",
            "Sentiment": "negative",
            "PublishDate": 1768921313418,
            "Source": "stocks"
        },
        {
            "Title": "Gufic Biosciences Receives GST Penalty of ₹15.64L",
            "Summary": "Gufic Biosciences received GST penalty order totaling ₹15,64,052 for FY2018-19 to FY2022-23 related to excess Input Tax Credit claims and short payment of tax liability. Company plans to appeal.",
            "Sentiment": "negative",
            "PublishDate": 1766853654403,
            "Source": "stocks"
        },
        {
            "Title": "Gufic Biosciences Reports Q2 FY26 Results with Advanced Injectable Facility Operational",
            "Summary": "Gufic Biosciences Limited submitted its investor presentation for quarterly and half-year results ended September 30, 2025, highlighting the commencement of production at its new Indore lyophilized injectable facility in October 2024. The company is scaling its hospital injectable platform across critical care and women's health segments, with the advanced facility designed to meet WHO GMP, EU GMP, ANVISA, MHRA, and USFDA standards for both domestic and export markets.",
            "Sentiment": "positive",
            "PublishDate": 1763148026898,
            "Source": "stock"
        },
        {
            "Title": "Gufic Biosciences Reports Quarterly Financial Results for Quarter Ended September 30, 2025",
            "Summary": "Gufic Biosciences Limited's Board approved unaudited financial results for the quarter and half year ended September 30, 2025, including standalone and consolidated statements. The pharmaceutical company also established a new wholly owned subsidiary, Gufic Ireland Limited, through initial share capital subscription on August 25, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763143527876,
            "Source": "earnings"
        },
        {
            "Title": "Gufic Biosciences Reports Mixed Q2 Results with Revenue Growth but Lower Profitability",
            "Summary": "Gufic Biosciences posted Q2 revenue of 2.3B rupees compared to 2B rupees year-over-year, showing growth in top-line performance. However, the company's EBITDA declined to 358M rupees from 386M rupees and net profit dropped to 149M rupees from 217M rupees, with EBITDA margin compressing to 15.54% from 18.92%.",
            "Sentiment": "neutral",
            "PublishDate": 1763127810470,
            "Source": "earnings"
        },
        {
            "Title": "Gufic Biosciences Promotes Shekhar Aley to President of Critical Care Division",
            "Summary": "Gufic Biosciences Limited promoted Shekhar Tarbir Aley to President - Critical Care SBUs, Nepal & Institution, effective September 16, 2025. Aley was promoted from his previous role as Senior Vice President based on the Board of Directors' approval following the Nomination & Remuneration Committee's recommendation. Aley brings over 30 years of pharmaceutical experience with specialization in Critical Care therapies. He previously led the launch of Prima Care Division to capture critical care business opportunities in smaller Indian towns and has experience building relationships with hospitals across India and Nepal. He holds a B.SC. degree in Pure Science with certifications in people and business management, and is pursuing a Doctorate in Business Administration.",
            "Sentiment": "positive",
            "PublishDate": 1758029137861,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gufic Biosciences Plans Growth Through Complex Injectables and International Expansion",
            "Summary": "Gufic Biosciences has outlined its growth strategy focusing on new complex injectables, international market penetration, and Contract Research and Manufacturing Services (CRAMS). The company plans capacity expansion and is developing a strong R&D pipeline to enhance profitability.",
            "Sentiment": "positive",
            "PublishDate": 1755102903430,
            "Source": "stock"
        },
        {
            "Title": "Gufic Biosciences Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "Gufic Biosciences reported quarterly results showing revenue growth to 2.3 billion rupees from 2 billion rupees in the same period last year. However, net profit declined to 121 million rupees compared to 208 million rupees in the previous year. EBITDA decreased to 323 million rupees from 358 million rupees, while EBITDA margin compressed to 14.25% from 17.64% in the corresponding period last year.",
            "Sentiment": "negative",
            "PublishDate": 1755093046396,
            "Source": "earnings"
        },
        {
            "Title": "Gufic Biosciences Reports Q4 Financial Results",
            "Summary": "Gufic Biosciences has reported its Q4 financial results. The company's EBITDA decreased to 266 million rupees from 342.3 million rupees year-over-year. The EBITDA margin fell to 12.99% from 17.55% in the same period last year. Net profit declined to 80 million rupees from 200 million rupees year-over-year and 193 million rupees quarter-over-quarter. Revenue increased to 2.05 billion rupees from 1.95 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748613647000,
            "Source": "result"
        },
        {
            "Title": "Gufic Biosciences Reports Q3 EBITDA Decline",
            "Summary": "Gufic Biosciences has reported a decrease in its Q3 EBITDA, which fell to 340 million rupees from 365 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 16.34% from 18.07% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739539131000,
            "Source": "earnings"
        },
        {
            "Title": "GUFIC BIOSCIENCES Reports Q3 Financial Results",
            "Summary": "GUFIC BIOSCIENCES announced its Q3 financial results. The company reported a net profit of 193 million rupees, down from 222 million rupees year-over-year and 218 million rupees quarter-over-quarter. Revenue for Q3 was 2.08 billion rupees, slightly up from 2.02 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739539065000,
            "Source": "earnings"
        },
        {
            "Title": "Gufic Biosciences Invests in UAE Subsidiary Veira Life FZE",
            "Summary": "Gufic Biosciences has made an investment of AED 200,000 in its subsidiary, Veira Life FZE, which operates in the pharmaceuticals sector. This investment represents a corporate action aimed at strengthening the company's presence in the UAE market.",
            "Sentiment": "positive",
            "PublishDate": 1736813413000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gufic Biosciences Invests in UAE Subsidiary Veira Life FZE",
            "Summary": "Gufic Biosciences has made an investment of AED 200,000 in its subsidiary Veira Life FZE. The subsidiary operates in the pharmaceuticals sector. This investment indicates Gufic Biosciences' commitment to expanding its presence in the UAE market and potentially strengthening its pharmaceutical operations.",
            "Sentiment": "positive",
            "PublishDate": 1736781458000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gufic Biosciences Reports Q2 EBITDA and Margin",
            "Summary": "Gufic Biosciences announced its Q2 financial results. The company reported an EBITDA of 386 million rupees, compared to 394 million rupees in the same quarter last year. The EBITDA margin improved to 18.92% from 18.32% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731593238000,
            "Source": "result"
        },
        {
            "Title": "Gufic Biosciences Reports Q2 Revenue Decline",
            "Summary": "Gufic Biosciences, a pharmaceutical company, reported a revenue of 2 billion rupees for the second quarter, down from 2.15 billion rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731593108000,
            "Source": "result"
        },
        {
            "Title": "Gufic Biosciences Reports Q2 Net Profit of 217M Rupees",
            "Summary": "Gufic Biosciences announced its Q2 financial results. The company reported a net profit of 217 million rupees, which is lower compared to 232 million rupees in the same quarter last year (YoY). However, it shows an increase from 208.6 million rupees in the previous quarter (QoQ).",
            "Sentiment": "neutral",
            "PublishDate": 1731593073000,
            "Source": "result"
        }
    ]
}