{
    "Symbol": "GUJALKALI",
    "ISIN": "INE186A01019",
    "News": [
        {
            "Title": "GACL Q3FY26: Revenue up 0.70%, EBITDA jumps 19%",
            "Summary": "Gujarat Alkalies and Chemicals reported Q3FY26 revenue of Rs.1,04,446 lakhs, up 0.70% YoY. EBITDA increased 19% to Rs.135 crores. Board approved Rs.1,029 crore capex for boilers, phosphoric acid plant, and capacity expansion.",
            "Sentiment": "positive",
            "PublishDate": 1770383507828,
            "Source": "co_actions_results"
        },
        {
            "Title": "GACL Board Meet on Feb 6 for Q3FY26 Results",
            "Summary": "Gujarat Alkalies and Chemicals Limited has scheduled its board meeting for February 6, 2026, to consider Q3FY26 financial results. Trading window remains closed until February 8, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768985689427,
            "Source": "co_actions_results"
        },
        {
            "Title": "GACL Senior Management Personnel Resigns",
            "Summary": "Gujarat Alkalies and Chemicals Limited announces resignation of Chief General Manager Vasant Tupsamudre from Material Management division effective January 20, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768910947366,
            "Source": "stocks"
        },
        {
            "Title": "GACL Appoints Maulik Gandhi as GM IT & Digital",
            "Summary": "Gujarat Alkalies and Chemicals Limited announces the appointment of Shri Maulik Gandhi as General Manager (IT & Digital Transformation) effective January 2, 2026, bringing 25+ years of experience.",
            "Sentiment": "positive",
            "PublishDate": 1767352783693,
            "Source": "stocks"
        },
        {
            "Title": "GACL Appoints Sanjay Joshi as Independent Director",
            "Summary": "Gujarat Alkalies and Chemicals Limited announced the appointment of Mr. Sanjay Joshi as Additional and Non-Executive Independent Director effective January 1, 2026, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1767184208958,
            "Source": "stocks"
        },
        {
            "Title": "GACL ESG Rating Improves to 68.3 from 63.8",
            "Summary": "Gujarat Alkalies and Chemicals Limited receives ESG score of 68.3 (Grade B) for FY2024-25, up from 63.8 in FY2023-24, as assigned by SESES ESG Research Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1766223006717,
            "Source": "stocks"
        },
        {
            "Title": "Gujarat Alkalies Invests Rs. 19.42 Crore in Renewable Energy Project",
            "Summary": "Gujarat Alkalies and Chemicals Limited acquired 26% equity stake in Cleanmax Sphere Energy Private Limited for Rs. 19,42,08,200 through a rights issue participation. The investment is for setting up a 75.9 MW renewable hybrid power project for 100% captive use by GACL, strengthening the company's green energy initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1763116592001,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Alkalies and Chemicals Reports 10% Revenue Growth in Q2 FY2025-26",
            "Summary": "Gujarat Alkalies and Chemicals Limited (GACL) reported sales revenue of Rs. 1,063 crores for the second quarter of FY2025-26, marking a 10% increase from Rs. 966 crores in the corresponding quarter of the previous year. The company achieved higher production across major products through increased capacity utilization and better sales realization. EBITDA for the quarter rose 7% to Rs. 133 crores compared to Rs. 124 crores in the previous year's corresponding quarter. For the half-year period, EBITDA increased 28% to Rs. 258 crores from Rs. 201 crores. The company earned profit before tax of Rs. 13 crores during the second quarter and Rs. 23 crores for the half-year. Energy costs decreased due to increased use of renewable power. GACL has engaged AT Kearney as strategic consultant under project Ahvaan for operational efficiency improvements. The company's material subsidiary, GACL-NALCO Alkalies Chemicals Private Limited, earned its first profit before tax of Rs. 10 lacs during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762668785787,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Alkalies Reports Q2 Results, Appoints New Internal Auditors and Approves Renewable Power Expansion",
            "Summary": "Gujarat Alkalies and Chemicals Limited announced its quarterly results for the second quarter and half year ended September 30, 2025. The company reported standalone revenue from operations of Rs. 1,907.32 lakhs for the quarter. The Board approved appointment of M/s Talati Talati LLP as Internal Auditors for two years from July 1, 2026 to June 30, 2028. Independent Director Rajiv Lochan Jain's second term will complete on December 31, 2025. The Board granted in-principle approval for setting up an additional 42.9 MW Renewable Hybrid Power facility, adding to ongoing 62.7 MW-75 MW renewable energy projects. During the quarter, the company made provisions of Rs. 1,549.24 lakhs for goods damaged due to fire at contract manufacturer Sanghvi Organics Pvt Ltd in Ankleshwar, Gujarat. Employee benefits expense included Rs. 3,784.43 lakhs for pay revision of employees during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762567899617,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Alkalies & Chemicals Reports Q2 Net Profit of 163.4M Rupees After Previous Year Loss",
            "Summary": "Gujarat Alkalies & Chemicals posted a consolidated net profit of 163.4 million rupees in Q2, compared to a loss of 182 million rupees in the same period last year. Revenue increased to 10.83 billion rupees from 9.91 billion rupees year-over-year. However, EBITDA declined to 739 million rupees from 749 million rupees, while EBITDA margin compressed to 6.82% from 7.56% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762519762622,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Alkalies Executes Shareholders Agreement for 75.9 MW Renewable Hybrid Power Project",
            "Summary": "Gujarat Alkalies and Chemicals Limited (GACL) executed a shareholders agreement with CleanMax Enviro Energy Solutions Limited and Special Purpose Vehicle CleanMax Sphere Energy Private Limited for setting up a 75.9 MW Renewable Hybrid Power Project. GACL holds 26% equity stake in the SPV while CleanMax Enviro Energy holds 74%. The project is designed for 100% captive power consumption by GACL. The Power Consumption Agreement is valid for 25 years unless terminated earlier. GACL acquired its 26% equity stake at face value of Rs. 10 per share and will appoint a nominee director on the SPV's board. Both shareholders will maintain their proportionate shareholdings and contribute equity from time to time.",
            "Sentiment": "positive",
            "PublishDate": 1762355938921,
            "Source": "corporate_action"
        },
        {
            "Title": "GACL Acquires 26% Stake in Clean Max SPV for 75.9 MW Renewable Power Project",
            "Summary": "Gujarat Alkalies and Chemicals Limited has executed a Share Purchase Agreement with Clean Max Enviro Energy Solutions Limited to develop a 75.9 MW Renewable Hybrid Power Project. GACL will acquire 26% shareholding in Clean Max Sphere Energy Private Limited, which serves as the Special Purpose Vehicle for the project. The equity investment ratio between GACL and Clean Max will be 26:74 for establishing the hybrid renewable power plant. The entire power generated will be used by GACL for captive consumption. The acquisition is being made at face value through cash consideration, with completion expected shortly. Clean Max Sphere Energy Private Limited was incorporated on June 12, 2020, with authorized and paid-up share capital of Rs. 1,00,000, and has not yet commenced business operations.",
            "Sentiment": "positive",
            "PublishDate": 1760787079900,
            "Source": "order&deals"
        },
        {
            "Title": "Gujarat Alkalies and Chemicals Prepays USD 34.35 Million ECB Loan from SBI",
            "Summary": "Gujarat Alkalies and Chemicals Limited has prepaid its outstanding External Commercial Borrowing (ECB) loan of USD 34.35 million from State Bank of India by securing a rupee term loan from HDFC Bank Limited. The company received a No Dues Certificate from SBI on September 18, 2025, confirming full repayment of the ECB facility. The original ECB agreement was for USD 70 million, entered into on February 24, 2021, with SBI acting through its London Branch. The prepayment represents the balance outstanding amount from the original borrowing facility.",
            "Sentiment": "positive",
            "PublishDate": 1758282114363,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Alkalies Reports Fire Damage at Contract Manufacturer Facility",
            "Summary": "Gujarat Alkalies and Chemicals Limited disclosed that a fire incident occurred at Sanghvi Organics Private Limited, one of its contract manufacturers located in Ankleshwar, Gujarat. The fire caused damage to the company's raw materials and finished goods stored at the facility. The company is currently assessing the full extent of the damages to determine the financial impact.",
            "Sentiment": "negative",
            "PublishDate": 1757921715058,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Alkalies and Chemicals Appoints Vrajesh Parikh as Executive Director (Technical)",
            "Summary": "Gujarat Alkalies and Chemicals Limited appointed Shri Vrajesh Parikh as Executive Director (Technical) effective September 4, 2025. Parikh is a Chemical Engineer from DDIT, Nadiad, Gujarat University, with a Post Graduate Diploma in Business Management from Bhartiya Vidya Bhavans, Vadodara. He brings over 31 years of experience in the chemicals industry, covering both specialty and commodity chemicals. His expertise spans process engineering, project execution, strategic planning, crisis management, technology transfer, and supplier management. Prior to joining GACL, Parikh worked with several organizations including Grasim Industries Ltd, Atul Ltd, Gulbrandsen Pvt Ltd, Dishman Pharmaceuticals Ltd, and Transpek Ltd. Most recently, he served as Joint President in Central Technical Cell at Grasim Industries Ltd.",
            "Sentiment": "positive",
            "PublishDate": 1756984015227,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gujarat Alkalies and Chemicals Appoints Sekar Balasubramanian as General Manager",
            "Summary": "Gujarat Alkalies and Chemicals Limited appointed Sekar Balasubramanian as General Manager (Materials Management) effective August 13, 2025. Balasubramanian is a Graduate Engineer in Metallurgy from NIT Durgapur and holds a Post Graduate degree in International Business from IIFT Delhi, along with certification in Supply Management from ISM, USA. He brings over 33 years of experience in global sourcing of project procurement, capex, spares, raw materials, and packaging materials, including expertise in sourcing from low-cost countries and international logistics covering shipping and customs. He has also implemented process excellence programs and led IT projects in ERP implementation.",
            "Sentiment": "positive",
            "PublishDate": 1755096383079,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gujarat Alkalies Reports Sharp Decline in Chemical Exports",
            "Summary": "Gujarat Alkalies experienced a significant drop in chemical exports, with a 97% decline compared to the previous year and an 89% decrease from the previous month. The company reported these substantial reductions in its export performance.",
            "Sentiment": "negative",
            "PublishDate": 1754976443682,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Alkalies & Chemicals Reports Narrower Q1 Loss Despite Revenue Growth",
            "Summary": "Gujarat Alkalies & Chemicals reported a consolidated net loss of 138 million rupees in Q1, significantly lower than the 445 million rupee loss in the same quarter last year. Revenue increased to 11 billion rupees from 9.8 billion rupees year-over-year. EBITDA improved to 1.16 billion rupees compared to 738 million rupees previously, while EBITDA margin expanded to 10.55% from 7.55% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754872052775,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Alkalies & Chemicals Reports Higher Q1 Revenue and Improved EBITDA Margin Despite Net Loss",
            "Summary": "Gujarat Alkalies & Chemicals reported Q1 revenue of 11 billion rupees compared to 9.8 billion rupees in the previous year. The company's EBITDA increased to 1.16 billion rupees from 738 million rupees, while EBITDA margin improved to 10.55% from 7.55%. Despite the revenue growth and margin expansion, the company recorded a consolidated net loss of 138 million rupees, though this was lower than the previous year's loss of 445 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1754656831847,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Alkalies And Chemicals Initiates First Shipment from New Chlorotoluenes Facility",
            "Summary": "Gujarat Alkalies And Chemicals has begun its first shipment of Benzyl Alcohol and Benzaldehyde from what is described as India's largest Chlorotoluenes facility. This marks a significant milestone for the company's production capabilities in these chemical products.",
            "Sentiment": "positive",
            "PublishDate": 1751855254000,
            "Source": "default"
        },
        {
            "Title": "Gujarat Alkalies And Chemicals Announces Full Operation of 50 MW Solar Power Plant",
            "Summary": "Gujarat Alkalies And Chemicals has announced that its 50 MW solar power plant from GIPCL is now fully operational. The company has successfully integrated renewable energy into its operations, potentially improving its energy efficiency and sustainability profile.",
            "Sentiment": "positive",
            "PublishDate": 1750938262000,
            "Source": "default"
        },
        {
            "Title": "Gujarat Alkalies & Chemicals Reports Q4 Profit and Announces New Plants",
            "Summary": "Gujarat Alkalies & Chemicals reported a consolidated net profit of 88.2 million rupees in Q4, compared to a loss of 461.9 million rupees in the same quarter last year. Revenue increased to 10.75 billion rupees from 10 billion rupees year-over-year. The company recommended a dividend of 15.80 rupees per equity share. Additionally, they approved the installation of three Chlorotoluenes plants with an estimated investment of 810 million rupees, expected to add annual revenues up to 1.56 billion rupees. The company also plans to install a 90-120 MTPD HCl synthesis unit.",
            "Sentiment": "positive",
            "PublishDate": 1747613617000,
            "Source": "default"
        },
        {
            "Title": "Gujarat Alkalies and Chemicals Reports Q4 Results and Approves New Projects",
            "Summary": "Gujarat Alkalies and Chemicals has announced its Q4 results, showing a consolidated net profit of 88.2 million rupees compared to a loss in the previous year. The company's Q4 revenue increased to 10.75 billion rupees from 10 billion rupees year-over-year. EBITDA for Q4 rose to 1.14 billion rupees with a margin of 10.58%. The company has recommended a dividend of 15.80 rupees per equity share. Additionally, Gujarat Alkalies has approved the installation of three Chlorotoluenes plants with an estimated investment of 810 million rupees, expected to add annual revenues up to 1.56 billion rupees. The company is also installing a 90-120 MTPD HCL synthesis unit.",
            "Sentiment": "positive",
            "PublishDate": 1747397719000,
            "Source": "default"
        },
        {
            "Title": "Gujarat Alkalies and Chemicals Begins Benzyl Chloride Production",
            "Summary": "Gujarat Alkalies and Chemicals Limited (GACL) has initiated the first dispatch of Benzyl Chloride from its newly established Chlorotoluenes plant. This marks the beginning of commercial production for this particular chemical product at the facility.",
            "Sentiment": "positive",
            "PublishDate": 1745333671000,
            "Source": "default"
        },
        {
            "Title": "Gujarat Alkalies and Chemicals Dispatches First Benzyl Chloride Consignment from Dahej Plant",
            "Summary": "Gujarat Alkalies and Chemicals Limited (GACL) has announced the dispatch of its first consignment of benzyl chloride from its plant located in Dahej. This marks a significant milestone for the company's operations at the Dahej facility.",
            "Sentiment": "positive",
            "PublishDate": 1745242450000,
            "Source": "default"
        },
        {
            "Title": "Gujarat Alkalies & Chemicals Reports Q3 Results and Approves New Unit",
            "Summary": "Gujarat Alkalies & Chemicals reported a consolidated net loss of 112 million rupees in Q3, an improvement from the 1.15 billion rupee loss in the same period last year. Revenue increased to 10.3 billion rupees from 9.2 billion rupees year-over-year. The company also approved the installation of a 200 TPD caustic soda flaking unit.",
            "Sentiment": "neutral",
            "PublishDate": 1739320464000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Alkalies and Chemicals Approves Installation of Caustic Soda Flaking Unit",
            "Summary": "Gujarat Alkalies and Chemicals has approved the installation of a 200 TPD (tonnes per day) caustic soda flaking unit. This decision represents a significant expansion of the company's production capabilities in the chemical manufacturing sector.",
            "Sentiment": "positive",
            "PublishDate": 1739283048000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Alkalies & Chemicals Reports Significant Q3 EBITDA Growth",
            "Summary": "Gujarat Alkalies & Chemicals has reported a substantial increase in its Q3 EBITDA, rising to 980 million rupees from 73 million rupees year-over-year. The company's EBITDA margin also saw a significant improvement, increasing to 9.52% from 0.79% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739280956000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Alkalies & Chemicals Reports Q3 Financial Results",
            "Summary": "Gujarat Alkalies & Chemicals has reported its Q3 consolidated financial results. The company recorded a net loss of 112 million rupees, which is an improvement from the 1.15 billion rupees loss in the same quarter of the previous year. Revenue for Q3 increased to 10.3 billion rupees from 9.2 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739280949000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Alkalies & Chemicals Reports Improved Q2 EBITDA",
            "Summary": "Gujarat Alkalies & Chemicals has reported a significant increase in its Q2 EBITDA, rising to 749 million rupees from 452 million rupees year-over-year. The company's EBITDA margin also improved, increasing to 7.56% from 4.65% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730969845000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Alkalies & Chemicals Reports Q2 Revenue",
            "Summary": "Gujarat Alkalies & Chemicals has reported a quarterly revenue of 9.9 billion rupees for Q2, compared to 9.7 billion rupees in the same quarter last year, showing a slight year-over-year increase.",
            "Sentiment": "neutral",
            "PublishDate": 1730969788000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Alkalies & Chemicals Reports Q2 Net Loss",
            "Summary": "Gujarat Alkalies & Chemicals has reported a consolidated net loss of 182 million rupees for the second quarter, compared to a loss of 184 million rupees in the same period last year. This indicates a marginal improvement in the company's financial performance year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730969765000,
            "Source": "result"
        }
    ]
}