{
    "Symbol": "GUJAPOLLO",
    "ISIN": "INE826C01016",
    "News": [
        {
            "Title": "Gujarat Apollo Board Meet Set for Feb 14 Q3 Results",
            "Summary": "Gujarat Apollo Industries has scheduled its board meeting for February 14, 2026, to consider Q3FY26 unaudited financial results. Trading window closed from January 1 to February 16, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770364025875,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ashish Kacholia Raises Stake in Gujarat Apollo Industries",
            "Summary": "Prominent investor Ashish Kacholia increased his shareholding in Gujarat Apollo Industries by 1.2% during the third quarter, demonstrating confidence in the company's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1768878895798,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gujarat Apollo Industries Road Equipment Testing Phase",
            "Summary": "Gujarat Apollo Industries completes product development for asphalt mixing plants and paver finishers, now in technical testing phase with Q4 FY2026 commercial launch planned.",
            "Sentiment": "positive",
            "PublishDate": 1766124372248,
            "Source": "stocks"
        },
        {
            "Title": "Gujarat Apollo Industries Reports Mixed Q2 Performance with Revenue Growth but Profit Decline",
            "Summary": "Gujarat Apollo Industries Limited announced unaudited financial results for the quarter ended September 30, 2025, showing revenue from operations of Rs 2,896.05 lakhs but a net loss after tax of Rs 25.73 lakhs on standalone basis. The Board of Directors approved both standalone and consolidated financial results along with limited review reports, with the company operating in construction and mining machinery manufacturing segment.",
            "Sentiment": "neutral",
            "PublishDate": 1763144153092,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Apollo Industries Proposes Re-appointment of Independent Director and Commission Payment for Non-Executive Director",
            "Summary": "Gujarat Apollo Industries' Board of Directors has proposed two key resolutions for shareholder approval at the upcoming AGM scheduled for September 30, 2025. The Board proposed to re-appoint Mrs. Jheel Ajay Shah as an Independent Director for a second term of five consecutive years from September 28, 2025 to September 27, 2030. Mrs. Shah brings experience in education, mentoring, training and advisory services, and is connected with educational institutions. Additionally, the Board proposed to approve commission payment of up to 2% of net profits annually for three consecutive financial years starting from FY 2025-26 to Mr. Anand A. Patel, a Non-Executive Director, in addition to sitting fees for board and committee meetings. Both proposals are subject to shareholder approval at the AGM to be held in physical mode at the company's registered office.",
            "Sentiment": "neutral",
            "PublishDate": 1757336366621,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Apollo Industries Reports Mixed Q1 Results, Announces Business Expansion into Road Construction Equipment",
            "Summary": "Gujarat Apollo Industries Limited reported quarterly results for the period ended June 30, 2025. On standalone basis, the company posted a profit after tax of Rs 9.77 lakhs compared to Rs 69.50 lakhs in the same quarter last year. Revenue from operations declined to Rs 662.35 lakhs from Rs 1,436.46 lakhs year-on-year. On consolidated basis, profit after tax was Rs 128.50 lakhs versus Rs 423.24 lakhs in the previous year quarter, while revenue from operations increased to Rs 1,108.06 lakhs from Rs 853.47 lakhs. The Board approved the 38th Annual General Meeting scheduled for September 30, 2025, and fixed the record date as September 23, 2025 for dividend payment. The company announced expansion into two new product lines: Road Construction Equipment with an estimated investment of approximately Rs 50 crores over three years, and Material Handling Equipment (Pick and Carry Cranes) with an investment of approximately Rs 15 crores over two years. The company operates in manufacturing and sale of Construction and Mining Machineries and spare parts.",
            "Sentiment": "neutral",
            "PublishDate": 1755091899822,
            "Source": "earnings"
        },
        {
            "Title": "Ashish Kacholia Acquires 1.06% Stake in Gujarat Apollo Industries",
            "Summary": "Investor Ashish Kacholia has acquired a 1.06% stake in Gujarat Apollo Industries. The news indicates a new investment position taken by a notable investor in the company.",
            "Sentiment": "positive",
            "PublishDate": 1752238236000,
            "Source": "default"
        },
        {
            "Title": "Gujarat Apollo Industries' Subsidiary to Acquire Fieldtrack Earthmovers",
            "Summary": "Gujarat Apollo Industries has announced that its subsidiary will acquire a 100% stake in Fieldtrack Earthmovers Private Limited. This acquisition represents a significant corporate action that could potentially expand the company's operations or market presence in the earthmoving equipment sector.",
            "Sentiment": "positive",
            "PublishDate": 1733707460000,
            "Source": "corporate_action"
        }
    ]
}