{
    "Symbol": "GUJGASLTD",
    "ISIN": "INE844O01030",
    "News": [
        {
            "Title": "Gujarat Gas Appoints Ashwini Kumar as Director",
            "Summary": "Gujarat Gas Limited announces appointment of Shri Ashwini Kumar, IAS as Additional Director effective 27th January, 2026. Kumar brings 29 years of public administration experience as Principal Secretary, Energy & Petrochemicals Department.",
            "Sentiment": "positive",
            "PublishDate": 1769689219012,
            "Source": "stocks"
        },
        {
            "Title": "Gujarat Gas Targets 60-70% Long-Term Gas Sourcing",
            "Summary": "Gujarat Gas aims to increase long-term gas sourcing to 60-70% of total volumes by end of FY27, as announced during recent concall discussions with management.",
            "Sentiment": "positive",
            "PublishDate": 1769049690412,
            "Source": "stocks"
        },
        {
            "Title": "Gujarat Gas Projects Volume Growth in Morbi Industrial",
            "Summary": "Gujarat Gas expects Morbi industrial volumes to rise from current 2.2 MMSCMD to 3-3.2 MMSCMD by February-March, indicating significant operational expansion in the region.",
            "Sentiment": "positive",
            "PublishDate": 1769049664693,
            "Source": "stocks"
        },
        {
            "Title": "Gujarat Gas Targets 13% CNG Volume Growth",
            "Summary": "Gujarat Gas sets ambitious growth targets with 13% CNG volume expansion and plans to establish over 1,000 CNG stations within the next two to three years during recent concall.",
            "Sentiment": "positive",
            "PublishDate": 1769049637221,
            "Source": "stocks"
        },
        {
            "Title": "Gujarat Gas Plans ₹650-700 Cr Annual Capex",
            "Summary": "Gujarat Gas announces capital expenditure guidance of ₹650-700 crores for the full financial year, with similar investment levels planned for upcoming years to support business expansion.",
            "Sentiment": "positive",
            "PublishDate": 1769049588964,
            "Source": "stocks"
        },
        {
            "Title": "Gujarat Gas appoints B N Patel as Executive Director",
            "Summary": "Gujarat Gas Limited announces the appointment of Shri B N Patel, GAS (Selection Scale), as Executive Director effective January 21st, 2026, following government notification.",
            "Sentiment": "positive",
            "PublishDate": 1769008930351,
            "Source": "stocks"
        },
        {
            "Title": "Gujarat Gas Q3 Net Profit Drops to ₹2.65 Billion",
            "Summary": "Gujarat Gas reported a net profit of ₹2.65 billion in Q3, declining from ₹2.81 billion in the previous quarter, representing a sequential decrease of 5.69%.",
            "Sentiment": "negative",
            "PublishDate": 1768899416838,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gujarat Gas Q3FY26 Earnings Call on Jan 21",
            "Summary": "Gujarat Gas Limited has scheduled its post-results earnings conference call for Q3FY26 on January 21, 2026, at 4:00 PM IST to discuss quarterly performance with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1768318469756,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gujarat Gas Director S J Haider Resigns Due to Retirement",
            "Summary": "Gujarat Gas Limited announces resignation of Director Shri S J Haider, IAS (Retd.) effective January 1, 2026, following his superannuation from government service on December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767276962655,
            "Source": "stocks"
        },
        {
            "Title": "Gujarat Gas urges physical shareholders to dematerialize",
            "Summary": "Gujarat Gas Limited requests physical shareholders to convert holdings to demat form ahead of composite scheme implementation, with new shares to be issued only in dematerialized format.",
            "Sentiment": "neutral",
            "PublishDate": 1767276462292,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gujarat Gas Appoints New Managing Director",
            "Summary": "Gujarat Gas Limited announces appointment of Smt. Avantika Singh Aulakh, IAS as new Managing Director, replacing Shri Milind Torawane who has been transferred to Education Department.",
            "Sentiment": "neutral",
            "PublishDate": 1766592097499,
            "Source": "stocks"
        },
        {
            "Title": "Gujarat Gas Board Meet Set for Q3 FY26 Results",
            "Summary": "Gujarat Gas Limited announces Board meeting on January 20, 2026, to consider Q3 FY26 financial results. Trading window closes from January 1-22, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766133548986,
            "Source": "co_actions_results"
        },
        {
            "Title": "India Ratings Affirms Gujarat Gas Bank Facilities at IND AAA/Stable Rating",
            "Summary": "India Ratings affirmed Gujarat Gas Limited's INR 47,000 million bank loan facilities at IND AAA/Stable/IND A1+ rating, considering the ongoing amalgamation with parent company GSPC expected by end-FY26. The rating reflects GGL's strong operational profile as India's largest city gas distribution entity with 27 geographical areas, healthy EBITDA generation, net cash position, and expected revenue growth from gas trading business post-merger.",
            "Sentiment": "positive",
            "PublishDate": 1764182628792,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Gas Q2 FY26 Results: Revenue Flat at ₹3,979 Cr, EBITDA Drops to ₹520 Cr Amid Morbi Volume Decline",
            "Summary": "Gujarat Gas reported Q2 FY26 revenue of ₹3,979 crores versus ₹3,949 crores last year, while EBITDA declined to ₹520 crores from ₹553 crores and PAT dropped to ₹281 crores from ₹307 crores. Industrial segment volumes fell 8% to 4.34 MMSCMD with Morbi volumes declining from 2.51 MMSCMD to 2.13 MMSCMD due to propane price competition, though CNG segment showed strong 13% growth and the company expects merger scheme approval by December 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763489989503,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Gas Reports Q2 Standalone Net Profit of ₹281 Crores, Down 36% YoY",
            "Summary": "Gujarat Gas Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The company reported standalone net profit of ₹281.01 crores for Q2, compared to ₹439.87 crores in the same quarter last year, representing a 36% decline. For the half year, standalone net profit was ₹609.77 crores versus ₹817.80 crores in the previous year. Total income for Q2 stood at ₹4,052.02 crores compared to ₹4,124.77 crores in Q2 of the previous year. On a consolidated basis, Q2 net profit was ₹281.01 crores versus ₹439.87 crores last year. The company's earnings per share for Q2 was ₹4.08 compared to ₹6.39 in the same quarter last year. The Board of Directors approved these unaudited financial results in a meeting held on November 10, 2025. The company operates primarily in the Natural Gas Business segment.",
            "Sentiment": "negative",
            "PublishDate": 1762809213225,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Gas Targets Double-Digit Volume Growth Over 3 Years",
            "Summary": "Gujarat Gas has outlined its growth strategy focusing on volume recovery across industrial and PNG segments. The company is investing in gas infrastructure expansion and CNG station network development. Gujarat Gas is targeting double-digit volume CAGR over a three-year period while focusing on cost efficiency and long-term LNG contract optimization to sustain margins.",
            "Sentiment": "positive",
            "PublishDate": 1762788103487,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Gas Reports Decline in Quarterly Financial Performance",
            "Summary": "Gujarat Gas reported quarterly net profit of 2.81 billion rupees, down from 3.27 billion rupees in the previous quarter. Revenue decreased to 39.79 billion rupees from 40.65 billion rupees quarter-on-quarter. EBITDA fell to 4.47 billion rupees compared to 5.2 billion rupees in the prior quarter, while EBITDA margin compressed to 11.24% from 12.79% quarter-on-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762778963921,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Gas Appoints Manoj Kumar Das as Additional Director Chairman",
            "Summary": "Gujarat Gas Limited appointed Shri Manoj Kumar Das, IAS, Chief Secretary of Government of Gujarat, as Additional Director Chairman on the Board effective November 24, 2025. Das is a senior IAS officer from the 1990 batch with B.Tech in Computer Science from IIT-Kharagpur. He has extensive experience in revenue administration, urban management, and disaster management, having served in various capacities including District Collector, Municipal Commissioner, and Principal Secretary across different departments. The appointment was made following a letter from the Energy & Petrochemicals Department, Government of Gujarat. Das serves as a Promoter-Nominee and is not debarred from holding directorship by any regulatory authority. None of the existing directors are related to Das.",
            "Sentiment": "neutral",
            "PublishDate": 1762067862657,
            "Source": "corporate_governance"
        },
        {
            "Title": "Pankaj Joshi Resigns as Chairman of Gujarat Gas Limited Following Superannuation",
            "Summary": "Pankaj Joshi, IAS (Retd.), has resigned as Director Chairman from the Board of Directors of Gujarat Gas Limited due to superannuation. His resignation is effective from November 1, 2025. Joshi's superannuation as Chief Secretary to Government of Gujarat was notified on October 28, 2025. As part of his resignation from multiple positions, he has stepped down from chairman and director roles across several companies including Gujarat State Fertilizers & Chemicals Limited, Gujarat Narmada Valley Fertilizers & Chemicals Limited, Gujarat State Petronet Limited, Gujarat State Petroleum Corporation Ltd., GSPL India Gasnet Limited, and GSPL India Transco Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1761984810002,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gujarat Gas Limited Shareholders Meet to Approve Multi-Company Merger Scheme",
            "Summary": "Gujarat Gas Limited held an equity shareholders meeting on October 17, 2025, through video conferencing to consider a Composite Scheme of Amalgamation and Arrangement. The meeting was convened following directions from the Ministry of Corporate Affairs dated September 10, 2025. The proposed merger involves five companies: Gujarat State Petroleum Corporation Limited, Gujarat State Petronet Limited, GSPC Energy Limited, Gujarat Gas Limited, and GSPL Transmission Limited. The meeting was chaired by Pankaj Joshi, IAS, and managed by Company Secretary Sandeep Dave. Shareholders were provided with remote e-voting facilities through Central Depository Services (India) Limited, with voting available before, during, and 15 minutes after the meeting. The special resolution requires approval from the Ministry of Corporate Affairs and other regulatory authorities. The meeting concluded at 3:30 PM with voting results to be published on the company website and forwarded to NSE and BSE where Gujarat Gas shares are listed.",
            "Sentiment": "neutral",
            "PublishDate": 1760707701827,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Gas Schedules Quarterly Results Review for November 7",
            "Summary": "Gujarat Gas has announced it will review its second quarter results on November 7. The company has set this date for the quarterly earnings review.",
            "Sentiment": "neutral",
            "PublishDate": 1758886916374,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Gas Shareholders to Vote on Three-Way Merger with GSPC and GSPL",
            "Summary": "Gujarat Gas held a shareholders' meeting on September 17 to approve a proposed amalgamation scheme involving GSPC, GSPL, and Gujarat Gas. Under the merger terms, GSPC shareholders will receive 10 Gujarat Gas shares for every 305 shares held, while GSPL shareholders will get 10 shares for every 13 held. The deal includes a demerger of the Gas Transmission business into GSPL Transmission Ltd., with Gujarat Gas shareholders receiving one transmission company share for every three shares owned. Antique Stock Broking noted the merger provides immediate value creation for Gujarat Gas through ₹7,200 crore in carry-forward losses from GSPC and synergy benefits. Equirus called it a well-structured deal that strengthens Gujarat Gas's position as India's second-largest gas trading company. Gujarat Gas shares closed 1.15% higher at ₹436, though the stock is down 14% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1757989274478,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Gas Schedules Shareholder Meeting for October 17, 2025 to Approve Composite Scheme of Amalgamation",
            "Summary": "Gujarat Gas Limited has scheduled a meeting of equity shareholders on October 17, 2025 at 3:00 PM via video conferencing to consider and approve a Composite Scheme of Amalgamation and Arrangement. The meeting follows directions from the Ministry of Corporate Affairs issued on September 10, 2025. Remote e-voting will be available from October 14-16, 2025, with the cut-off date for determining voting eligibility set as October 10, 2025. Meeting notices and explanatory statements will be sent electronically to shareholders whose email addresses are registered with the company or depositories.",
            "Sentiment": "neutral",
            "PublishDate": 1757688106018,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Gas Reports Q1 FY26 Results, Announces Entry into Propane Distribution Business",
            "Summary": "Gujarat Gas Limited reported quarterly results with revenue from operations at Rs 4,065 crores compared to Rs 4,615 crores in the previous year's corresponding quarter. EBITDA stood at Rs 579 crores versus Rs 574 crores year-over-year, while profit after tax was Rs 327 crores against Rs 330 crores. The company's EBITDA margin per SCM improved to Rs 7.17 from Rs 5.75 in the previous quarter. Industrial segment volumes decreased 6% to 4.71 MMSCMD, with Morbi volumes declining from 2.87 MMSCMD to 2.51 MMSCMD due to customers shifting to propane amid higher price differentials. CNG segment showed strong performance with 12% year-over-year growth in sales volumes reaching 3.72 MMSCMD. The company added approximately 36,000 new domestic connections and commissioned 3 new CNG stations during the quarter. Gujarat Gas announced board approval to enter propane and LPG sourcing and sales business, targeting 25% of the Morbi propane market. The company expects annual CAPEX of Rs 800-1,000 crores and projects EBITDA margins of Rs 4.5-5.5 per SCM for the financial year.",
            "Sentiment": "neutral",
            "PublishDate": 1755019513642,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Gas Reports Mixed Quarterly Results with Higher Profit but Lower Revenue",
            "Summary": "Gujarat Gas reported net profit of 3.27 billion rupees in its latest quarterly results, representing an increase from 2.87 billion rupees in the previous quarter. However, the company's revenue declined to 40.65 billion rupees compared to 42.88 billion rupees in the prior quarter. The results show improved profitability despite lower top-line performance.",
            "Sentiment": "neutral",
            "PublishDate": 1754398575957,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Gas Partners with Waree Energy for Sustainable Energy Solutions",
            "Summary": "Gujarat Gas has entered into a collaboration with Waree Energy to develop sustainable energy solutions aimed at reducing carbon footprint. The partnership focuses on environmental sustainability initiatives between the two companies.",
            "Sentiment": "positive",
            "PublishDate": 1753961223378,
            "Source": "order&deals"
        },
        {
            "Title": "Gujarat Gas Cuts Morbi Industrial Gas Prices by Rs 3.25-3.5 per SCM",
            "Summary": "Gujarat Gas has reduced industrial gas prices in the Morbi region by Rs 3.25-3.5 per standard cubic metre, effective from August 1. The price cut aims to compete with alternative fuels that have been attracting demand away from piped natural gas. The move is expected to impact the company's unit margins in the second quarter. Morbi, a ceramic industry hub, represents a key consumption area for Gujarat Gas, making regional fuel pricing crucial for volumes and profitability. The company had previously raised industrial gas prices for Morbi customers by Rs 2.27 per scm in December, bringing prices to Rs 46.95 per scm. Gujarat Gas shares closed 0.85% lower at Rs 448.",
            "Sentiment": "negative",
            "PublishDate": 1753881931423,
            "Source": "stock"
        },
        {
            "Title": "Analysts Predict Negative Impact on Gujarat Gas from PNGRB Notifications",
            "Summary": "Analysts are forecasting potential negative effects on Gujarat Gas due to recent notifications from the Petroleum and Natural Gas Regulatory Board (PNGRB). However, the exact impact of these notifications is currently difficult to determine. The article does not provide specific details about the notifications or their potential consequences.",
            "Sentiment": "negative",
            "PublishDate": 1751608983000,
            "Source": "default"
        },
        {
            "Title": "Gujarat Gas Expansion Plans and Financial Outlook",
            "Summary": "Gujarat Gas has launched its FDODO scheme to add approximately 70 new CNG stations in the next financial year, with 60 already under construction or awaiting permissions. The company holds exclusive LNG supply rights in Morbi due to a Delhi High Court order. Gujarat Gas has provided a capital expenditure (CAPEX) guidance of approximately Rs 1,000 crores. The company expects to maintain a growth rate of 12% in the current financial year.",
            "Sentiment": "positive",
            "PublishDate": 1747885246000,
            "Source": "default"
        },
        {
            "Title": "Gujarat Gas: Q4 Profit Surges 30%, Dividend Declared",
            "Summary": "Gujarat Gas reported Q4 FY25 net profit of ₹287.2 crore, up 29.6% QoQ. EBITDA rose 18.5% to ₹449.5 crore with margins expanding to 11%. Revenue slightly declined to ₹4,102 crore. CNG volume reached 3.22 mmscmd, up 3% QoQ. Board recommended dividend of ₹5.82 per share.",
            "Sentiment": "positive",
            "PublishDate": 1747666510000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Gas Reports Q4 Results and Dividend Recommendation",
            "Summary": "Gujarat Gas has announced its Q4 financial results and dividend recommendation. The company's Q4 EBITDA increased to 4.5 billion rupees from 3.8 billion rupees in the previous quarter. The EBITDA margin improved to 10.50% from 8.77% quarter-on-quarter. Net profit for Q4 rose to 2.9 billion rupees from 2.22 billion rupees in the previous quarter. However, revenue slightly decreased to 42.9 billion rupees from 43.33 billion rupees quarter-on-quarter. The company has recommended a dividend of 5.82 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747662782000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Gas Reports Mixed Q3 Results",
            "Summary": "Gujarat Gas has announced its Q3 financial results. The company reported a net profit of 2.22 billion rupees, which is lower than the previous quarter's 3.1 billion rupees and below the estimated 2.72 billion rupees. However, the revenue for Q3 stood at 43.33 billion rupees, surpassing both the previous quarter's 39.5 billion rupees and the estimated 39.57 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1738801234000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Gas Reports Lower Q3 EBITDA and Margin",
            "Summary": "Gujarat Gas has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q3 was 3.8 billion rupees, down from 5.1 billion rupees in the previous quarter. This figure fell short of the estimated 4.7 billion rupees. The EBITDA margin also decreased to 8.77% from 13.02% in the previous quarter, below the estimated 11.88%.",
            "Sentiment": "negative",
            "PublishDate": 1738764338000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Gas Reports Q3 Financial Results",
            "Summary": "Gujarat Gas has announced its financial results for the third quarter. The company reported a net profit of 2.22 billion rupees, down from 3.1 billion rupees in the previous quarter, falling short of the estimated 2.72 billion rupees. However, revenue increased to 43.33 billion rupees from 39.5 billion rupees quarter-over-quarter, surpassing the estimated 39.57 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1738764330000,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Gas Receives No Adverse Observation Letter from BSE on Scheme of Arrangement and Amalgamation",
            "Summary": "Gujarat Gas has announced that it has received a no adverse observation letter from the Bombay Stock Exchange (BSE) regarding its scheme of arrangement and amalgamation. The company is still awaiting an observation letter from the National Stock Exchange (NSE).",
            "Sentiment": "positive",
            "PublishDate": 1738588644000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Gas: Revision in Basic Customs Duty for Propane",
            "Summary": "Gujarat Gas has announced a change in the Basic Customs Duty (BCD) for propane. The effective BCD was previously set at 2.5% with a potential ceiling of up to 15%. This has now been revised to a flat rate of 2.5%, removing the higher ceiling.",
            "Sentiment": "neutral",
            "PublishDate": 1738555370000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Gas: BCD for Propane Tariff Change Effective 2025",
            "Summary": "YES Securities reports that Gujarat Gas will implement a Basic Customs Duty (BCD) for propane under the tariff rate changes category. This change is set to take effect from May 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1738555338000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Gas Increases CNG Prices",
            "Summary": "Gujarat Gas has announced a price increase of 1.5 rupees per kilogram for compressed natural gas (CNG). This information was reported by CNBC Awaaz.",
            "Sentiment": "neutral",
            "PublishDate": 1735707180000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Gas Faces Potential Sales Impact from Morbi Ceramic Association Shutdown",
            "Summary": "The Morbi Ceramic Association is considering a one-month shutdown, which could significantly impact Gujarat Gas's sales volume growth. If the shutdown occurs, the company's total sales volume growth for FY25 is projected to be less than 2%, falling short of the management's guidance of 7%.",
            "Sentiment": "negative",
            "PublishDate": 1735621400000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Gas Increases Prices for Morbi Customers",
            "Summary": "Gujarat Gas has raised the gas prices for its customers in Morbi by Rs 2.27 per standard cubic meter (SCM). The new price is set at Rs 46.76 per SCM.",
            "Sentiment": "neutral",
            "PublishDate": 1733818708000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Gas Increases Industrial Gas Prices",
            "Summary": "Gujarat Gas, a natural gas distribution company, has announced an increase in industrial gas prices. This information was reported by CNBC TV18, a prominent business news channel in India. The specifics of the price hike, including the percentage increase or affected regions, were not provided in the brief news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1733818576000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Gas Expects Growth in Domestic and Commercial Segment",
            "Summary": "Gujarat Gas anticipates an increase in numbers for its domestic and commercial segment as new areas mature over time. The company maintains its previous guidance of 5% to 7% volume growth, subject to price volatility and demand increase, as stated in a recent conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1731037050000,
            "Source": "normal_news"
        },
        {
            "Title": "Gujarat Gas: Morbi Slowdown Impacts Q2 Volumes",
            "Summary": "Gujarat Gas experienced a slowdown in volumes during Q2, primarily due to decreased demand in the Morbi industrial area. This information is based on a review by Dolat Capital.",
            "Sentiment": "negative",
            "PublishDate": 1731035084000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Gas: CNG Volumes Up 12%, Revenue Dips Slightly in Q2",
            "Summary": "Gujarat Gas reported Q2 FY2024-25 results with CNG volumes growing 12% YoY to 2.93 mmscmd. Revenue slightly decreased to ₹3,949 crore, while EBITDA rose 5% to ₹553 crore and PAT increased 3% to ₹307 crore. Total sales volumes fell to 8.75 mmscmd, but half-year volumes grew 6%. The company added 38,500 new domestic connections and 9 CNG stations.",
            "Sentiment": "positive",
            "PublishDate": 1730895492000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Gas: Q2 Profit Dips 7% But Beats Estimates",
            "Summary": "Gujarat Gas reported a 7% quarter-on-quarter decline in net profit to Rs 309 crore for Q2 FY25, surpassing analysts' expectations. Revenue fell 15% to Rs 3,782 crore, while EBITDA decreased 4% to Rs 514 crore. The company's margin improved to 13.6% from 12% in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1730892252000,
            "Source": "result"
        }
    ]
}