{
    "Symbol": "GUJRAFFIA",
    "ISIN": "INE610B01024",
    "News": [
        {
            "Title": "Gujarat Raffia Industries Reports Mixed Quarterly Performance with Revenue Decline",
            "Summary": "Gujarat Raffia Industries Limited announced unaudited financial results for the quarter ended September 30, 2025, showing revenue from operations of Rs. 25.58 lakhs compared to Rs. 83.38 lakhs in the previous year quarter. The company reported a net profit of Rs. 33.76 lakhs for the current quarter versus Rs. 25.78 lakhs in the corresponding period last year, with earnings per share improving to Rs. 0.35 from Rs. 0.27.",
            "Sentiment": "neutral",
            "PublishDate": 1763057549816,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Raffia Industries Appoints New Company Secretary and Promotes Director to CFO Role",
            "Summary": "Gujarat Raffia Industries Limited's Board of Directors approved two key appointments on November 6, 2025. The company appointed Mr. Rishi Jaithlia as Company Secretary and Compliance Officer, effective immediately. Jaithlia is a qualified Company Secretary with membership number A69646 from the Institute of Company Secretaries of India, holds a Masters degree in Commerce, and has over two years of client-facing experience as a corporate secretary. Additionally, the Board approved changing Mr. Abhishek Bhutoria's designation from Non-Executive Director to Whole Time Director cum Chief Financial Officer for a five-year term, subject to shareholder ratification at the next General Meeting. Bhutoria has been associated with the company as a Director since September 2015, possesses extensive experience in finance, accounts, and business management, and holds a Master's degree in Business Administration from California State University, USA. He is the son of Mr. Pradeep Bhutoria, Managing Director, and Ms. Sushma Bhutoria, Whole Time Director of the company.",
            "Sentiment": "positive",
            "PublishDate": 1762453024506,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gujarat Raffia Industries Reports Delayed Disclosure of Company Secretary Resignation Due to Technical Issues",
            "Summary": "Gujarat Raffia Industries Limited disclosed that Mr. Mehulkumar Dulabhai Desai resigned from his positions as Company Secretary, Compliance Officer, and Key Managerial Personnel effective August 27, 2025. The company experienced a delay in filing the required disclosure due to technical issues with OTP receipt on their registered mobile number while accessing BSE Listing Centre. The disclosure was eventually filed on September 1, 2025. The company stated the delay was unintentional and purely technical in nature.",
            "Sentiment": "neutral",
            "PublishDate": 1758715578722,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gujarat Raffia Industries Board Approves Quarterly Financial Results",
            "Summary": "Gujarat Raffia Industries Limited's Board of Directors approved the unaudited financial results for the quarter ended June 30, 2025. The board meeting was held on August 14, 2025, at the company's registered office from 3:00 PM to 3:45 PM. The results include a Limited Review Report issued by M/s. KPSJ Associates & LLP, the company's statutory auditors. The trading window for insiders has been closed since July 1, 2025, and will remain closed until 48 hours after the financial results are made public. This closure applies to all Directors, Key Managerial Personnel, Designated Employees and Connected Persons as defined in the company's Code of Conduct for Prohibition of Insider Trading.",
            "Sentiment": "neutral",
            "PublishDate": 1755169426372,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Raffia Industries Submits Annual Report Following 39th AGM",
            "Summary": "Gujarat Raffia Industries Limited has submitted its Annual Report for financial year 2024-25 after completing its 39th Annual General Meeting on August 12, 2025. The company reported total revenue of Rs. 3,057.43 lakhs compared to Rs. 3,180.04 lakhs in the previous year. Profit before tax decreased to Rs. 62.03 lakhs from Rs. 66.65 lakhs, while profit after tax was Rs. 52.24 lakhs versus Rs. 53.92 lakhs in 2023-24. The board has not recommended any dividend for the year to conserve resources for business expansion and working capital requirements. The company operates in manufacturing PE Tarpaulin, Plastic Sheeting, HDPE Woven Bags, and related products, with significant export presence targeting over 40% of production for exports.",
            "Sentiment": "neutral",
            "PublishDate": 1755000198896,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Raffia Industries Reports Audited Results and Company Secretary Resignation",
            "Summary": "Gujarat Raffia Industries Limited's board of directors approved audited financial results for the quarter and year ended March 31, 2025. The company reported revenue from operations of ₹795.51 lakhs for the quarter and ₹3,004.14 lakhs for the year, compared to ₹3,091.21 lakhs in the previous year. Net profit for the year was ₹52.24 lakhs versus ₹51.92 lakhs in the prior year. Earnings per share stood at ₹0.97 for the year. The board also accepted the resignation of Mrs. Neha Shyamsingh Tomar from her position as Company Secretary. The company operates in manufacturing of P.E. Tarpaulin, HDPE/P.P Woven Sacks, and Fabrics Business as its single reportable segment.",
            "Sentiment": "neutral",
            "PublishDate": 1754573333797,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Raffia Industries CFO Gopesh Patel Resigns, Avinash Salunke Appointed as Internal Auditor",
            "Summary": "Gujarat Raffia Industries Limited announced the resignation of Gopesh Nileshbhai Patel from his position as Chief Financial Officer and Key Managerial Personnel, effective August 1, 2025. The Board of Directors accepted his resignation during their meeting held on August 7, 2025. Simultaneously, the company appointed Avinash Appasaheb Salunke as Internal Auditor, effective August 7, 2025, commencing from the second quarter of FY 2025-26. Salunke brings approximately 7 years of corporate experience as Chief Finance Officer and Compliance Officer, holding a Master's degree in Commerce with expertise in financial analysis, strategic thinking, and leadership skills.",
            "Sentiment": "neutral",
            "PublishDate": 1754546530495,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gujarat Raffia Industries CFO Gopesh Nileshbhai Patel Resigns",
            "Summary": "Gujarat Raffia Industries Limited announced that Gopesh Nileshbhai Patel has resigned from his position as Chief Financial Officer and Key Managerial Personnel, effective August 1, 2025. The Board of Directors accepted his resignation in their board meeting held on August 1, 2025. The company has informed BSE, NSE, and CSE about this management change. The resignation letter with detailed reasons has been enclosed as an annexure to the regulatory filing.",
            "Sentiment": "neutral",
            "PublishDate": 1754053529586,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gujarat Raffia Industries Opens Special Window for Physical Share Transfer Re-lodgment",
            "Summary": "Gujarat Raffia Industries Limited has announced a special window from July 07, 2025 to January 06, 2026 for shareholders to re-lodge transfer requests for physical shares. This window applies specifically to transfer deeds that were lodged before April 01, 2019 but were rejected or returned due to deficiencies in documents or processes. The company has advised eligible shareholders to contact their Registrar and Share Transfer Agent, Accurate Securities and Registry Private Limited, or the company directly for assistance with the re-lodgment process. The announcement follows SEBI circular no. SEBI/HO/MIRSD/MIRSD-PoD/P/CIR/2025/97 dated July 2, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753786951759,
            "Source": "corporate_action"
        }
    ]
}