{
    "Symbol": "GUJTHEM",
    "ISIN": "INE942C01045",
    "News": [
        {
            "Title": "Gujarat Themis Biosyn Q3FY26 Results & Leadership Changes",
            "Summary": "Gujarat Themis Biosyn reports Q3FY26 net profit of ₹1,246.46 lakhs with revenue of ₹4,336.82 lakhs. Company announces CFO transition and independent director re-appointment.",
            "Sentiment": "positive",
            "PublishDate": 1770292787853,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gujarat Themis Biosyn pledges 3.5L shares to Jio Credit",
            "Summary": "Themis Medicare pledged 3,50,000 equity shares of Gujarat Themis Biosyn to Jio Credit Limited on January 12, 2026, against ₹10 crore borrowing facility to reduce finance costs.",
            "Sentiment": "neutral",
            "PublishDate": 1768374456468,
            "Source": "co_actions_results"
        },
        {
            "Title": "Themis Medicare pledges 9.2L shares of Gujarat Themis",
            "Summary": "Themis Medicare Limited pledged 9,20,000 equity shares of Gujarat Themis Biosyn Limited on December 30, 2025, against ₹10 crore borrowing from Jio Credit Limited to reduce finance costs.",
            "Sentiment": "neutral",
            "PublishDate": 1767417093726,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gujarat Themis Biosyn Reports Strong Financial Results and Expands Board Leadership",
            "Summary": "Gujarat Themis Biosyn Limited announced its quarterly and half-year results ended September 30, 2025, showing total income of ₹4,234.08 lakhs for the quarter compared to ₹3,587.28 lakhs in the previous year quarter. Net profit after tax reached ₹442.64 lakhs for the quarter versus ₹306.46 lakhs in the corresponding period last year. The company appointed Mr. Rajneesh Anand as Additional Non-Executive Non-Independent Director for a five-year term effective November 10, 2025. Anand, a mechanical engineering graduate with management qualifications, has been associated with Themis Group since 1977 and serves as Director of Themis Medicare Limited. The company completed expansion of its Fermentation Block at Vapi, Gujarat, with commercial production of Rifamycin-S and Rifamycin-O commencing October 18, 2025. This expansion increased overall fermentation capacity from 450KL to 990KL, strengthening manufacturing capabilities for multiple fermentation products.",
            "Sentiment": "positive",
            "PublishDate": 1762769514618,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Themis Biosyn Reports 35% Jump in Q2 Net Profit to 143 Million Rupees",
            "Summary": "Gujarat Themis Biosyn reported a net profit of 143 million rupees in Q2, up from 106 million rupees in the same period last year. The company's EBITDA increased to 209 million rupees from 154 million rupees year-over-year. EBITDA margin improved to 49.46% compared to 44.33% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762767705078,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Themis Biosyn Commences Commercial Production at Expanded Fermentation Facility",
            "Summary": "Gujarat Themis Biosyn Limited has started commercial production at its expanded Fermentation Block in Vapi, Gujarat. The first batch of commercial production of Rifamycin-S and Rifamycin-O commenced on October 18, 2025. The expansion has increased the company's overall fermentation capacity from 450 KL to 990 KL, more than doubling its manufacturing capabilities to produce multiple fermentation products. The company states this capacity expansion positions it to capitalize on growth opportunities in the fermentation segment.",
            "Sentiment": "positive",
            "PublishDate": 1760764966210,
            "Source": "stock"
        },
        {
            "Title": "Gujarat Themis Biosyn Shareholders Approve All 10 Resolutions at 44th Annual General Meeting",
            "Summary": "Gujarat Themis Biosyn Limited held its 44th Annual General Meeting on September 12, 2025, where shareholders approved all 10 proposed resolutions with requisite majority. The resolutions included adoption of audited financial statements for the year ended March 31, 2025, declaration of dividend on equity shares, re-appointment of Dr. Dinesh S. Patel as director, appointment and re-designation of Dr. Sachin D. Patel as Managing Director, ratification of cost auditor remuneration for 2025-26, appointment of secretarial auditor, commission payments to directors, and appointment of Mr. Nihar Ajay Parikh as Independent Director. The meeting had 28,930 shareholders on record date with 61 shareholders present either in person or through proxy. Voting was conducted through remote e-voting and physical poll, with scrutinizer Mr. Ketan Shirwadkar overseeing the process.",
            "Sentiment": "positive",
            "PublishDate": 1757690803754,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Themis Biosyn Reports 17.6% Drop in Net Profit, Announces 44th AGM for September 12",
            "Summary": "Gujarat Themis Biosyn Limited reported a net profit of Rs 487.7 crores for FY2025, down 17.6% from Rs 591.6 crores in the previous year. Revenue declined 11.2% to Rs 1,532.3 crores from Rs 1,741.9 crores. The pharmaceutical intermediates and APIs manufacturer has scheduled its 44th Annual General Meeting for September 12, 2025. The Board recommended a dividend of Rs 0.67 per equity share. During the year, the company completed a bonus share issue in 1:2 ratio and commissioned a new API manufacturing facility. The Board initially approved a merger with Themis Medicare Limited but later decided not to proceed with the proposal.",
            "Sentiment": "negative",
            "PublishDate": 1755621248948,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Themis Biosyn Reports Strong Q1 Results, Announces Board Changes and Dividend Record Date",
            "Summary": "Gujarat Themis Biosyn Limited approved its unaudited standalone financial results for the quarter ended June 30, 2025. The company reported total income of ₹3,614.72 lakhs compared to ₹3,935.17 lakhs in the same quarter last year, with net profit after tax of ₹926.16 lakhs versus ₹1,323.62 lakhs in the previous year quarter. The board set September 5, 2025 as the record date for dividend distribution for the financial year ended March 31, 2025. In board composition changes, Nihar Parikh has been appointed as Additional Non-Executive Independent Director effective August 15, 2025, while Siddharth Kusumgar will cease to be Independent Director on September 20, 2025 upon completion of his second consecutive term. Parikh will replace Kusumgar on all board committees including Audit, Nomination & Remuneration, Corporate Social Responsibility, Stakeholders Relationship and Risk Management Committees. The company commenced commercial production at its new API plant in Vapi, Gujarat on May 1, 2025, designed for manufacturing Active Pharmaceutical Ingredients and intermediates for pharmaceutical industry use.",
            "Sentiment": "neutral",
            "PublishDate": 1754037116424,
            "Source": "corporate_action"
        },
        {
            "Title": "Gujarat Themis Biosyn Reports Decline in Q1 Financial Performance",
            "Summary": "Gujarat Themis Biosyn reported quarterly results showing a decline across key financial metrics. Net profit dropped to 91 million rupees from 132 million rupees in the same period last year. Revenue decreased to 359 million rupees compared to 389 million rupees year-over-year. EBITDA fell to 139 million rupees from 185 million rupees, while EBITDA margin contracted to 38.81% from 47.65% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754036405378,
            "Source": "earnings"
        },
        {
            "Title": "Gujarat Themis Biosyn Reports Q4 Financial Results",
            "Summary": "Gujarat Themis Biosyn has released its Q4 financial results. The company's EBITDA for Q4 was 160.4 million rupees, down from 209 million rupees in the same quarter last year. The EBITDA margin decreased to 42.5% from 49.82% year-over-year. Revenue for Q4 was 377.4 million rupees, compared to 420 million rupees in the previous year. The company's standalone net profit for Q4 was 120 million rupees, down from 160 million rupees year-over-year and 129.7 million rupees quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747757075000,
            "Source": "result"
        },
        {
            "Title": "Gujarat Themis Biosyn Starts Production at New API Plant",
            "Summary": "Gujarat Themis Biosyn has begun commercial production at its newly established API (Active Pharmaceutical Ingredient) plant in Gujarat. This new facility is expected to enhance the company's forward integration initiatives and strengthen its position in export markets, particularly in the United States and Europe.",
            "Sentiment": "positive",
            "PublishDate": 1746524657000,
            "Source": "default"
        },
        {
            "Title": "Gujarat Themis Biosyn Reports Q2 Financial Results",
            "Summary": "Gujarat Themis Biosyn has released its Q2 financial results. The company reported a net profit of 105 million rupees, down from 125 million rupees in the same quarter last year. Revenue for Q2 stood at 347 million rupees, compared to 396 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1729843100000,
            "Source": "result"
        }
    ]
}