{
    "Symbol": "GULFPETRO",
    "ISIN": "INE586G01017",
    "News": [
        {
            "Title": "GP Petroleums CEO-Lubricants Resigns Due to Personal Reasons",
            "Summary": "GP Petroleums Limited announces resignation of CEO-Lubricants Pradeep Kishore Mittal effective January 31, 2026, citing personal reasons for departure from the company.",
            "Sentiment": "neutral",
            "PublishDate": 1769600085335,
            "Source": "stocks"
        },
        {
            "Title": "GP Petroleums Wins ₹38.13 Crore BPCL Bitumen Contract",
            "Summary": "GP Petroleums secured a one-year contract from BPCL worth ₹38.13 crores for supplying 7,800 MT of bulk bitumen (VG30 & VG40) at Pipavav Port, with potential extension for another year.",
            "Sentiment": "positive",
            "PublishDate": 1769509778213,
            "Source": "co_actions_results"
        },
        {
            "Title": "GP Petroleums Acquires Warehouse for Rs 30 Crores",
            "Summary": "GP Petroleums Limited completed acquisition of 4.625-acre warehouse property in Haryana from related party Aspam Caravan Logistics Parks for Rs 30 crores to enhance operational stability.",
            "Sentiment": "positive",
            "PublishDate": 1769176325423,
            "Source": "co_actions_results"
        },
        {
            "Title": "GP Petroleums Issues Postal Ballot for CMD Appointment",
            "Summary": "GP Petroleums Limited announces postal ballot notice for appointment of Ayush Goel as Chairman & Managing Director with annual remuneration of ₹1.00 crore, e-voting from January 14 to February 12, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768295686899,
            "Source": "co_actions_results"
        },
        {
            "Title": "GP Petroleums Appoints Ayush Goel as Chairman & MD",
            "Summary": "GP Petroleums Limited announces major leadership changes including Ayush Goel's elevation to Chairman & Managing Director for 5-year term and strategic re-designations across senior management.",
            "Sentiment": "positive",
            "PublishDate": 1767707815455,
            "Source": "stocks"
        },
        {
            "Title": "GP Petroleums Head RPO & Exports Resigns Jan 2026",
            "Summary": "GP Petroleums Limited announces resignation of Mr. Farooque Warsi, Head – RPO & Exports, effective January 09, 2026, due to personal reasons under SEBI Regulation 30 compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1767012803684,
            "Source": "stocks"
        },
        {
            "Title": "GP Petroleums Recovers Rs 2.14 Crore Insurance Claim After Legal Victory",
            "Summary": "GP Petroleums successfully recovered Rs 2,13,84,431 including interest from August 2013 through execution proceedings at the District Consumer Forum following Bajaj Allianz's withdrawal of revision petitions. The recovery stems from disputed insurance claims that were resolved in the company's favor at the National Consumer Disputes Redressal Commission.",
            "Sentiment": "positive",
            "PublishDate": 1763462021218,
            "Source": "stock"
        },
        {
            "Title": "GP Petrolewums Limited Reports Strong Q2 Performance with 21.7% Revenue Growth",
            "Summary": "GP Petrolewums Limited approved unaudited financial results for the quarter and half year ended September 30, 2025, showing revenue from operations of INR 15,216.13 lakhs compared to INR 12,511.20 lakhs in the same quarter last year. The company also reconstituted its Risk Management Committee with four members including Mrs. Stuti Kacker, Mr. Ashok Kumar Gupta, Mr. Pradeep Kishore Mittal, and Mr. Dilip Vaswani effective November 15, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763174221246,
            "Source": "earnings"
        },
        {
            "Title": "GP Petroleums Partners with Modern International FZE for Manufacturing and Marketing Operations",
            "Summary": "GP Petroleums has entered into a partnership agreement with Modern International FZE. The deal focuses on manufacturing and marketing activities between the two companies.",
            "Sentiment": "positive",
            "PublishDate": 1760012115225,
            "Source": "order&deals"
        },
        {
            "Title": "GP Petroleums Reports Q1 Results and Sets AGM Date for September 2025",
            "Summary": "GP Petroleums Limited approved its unaudited financial results for the quarter ended June 30, 2025, and scheduled its 42nd Annual General Meeting for September 26, 2025, via video conferencing. The company reported revenue from operations of INR 15,819.40 lakhs compared to INR 16,591.11 lakhs in the same quarter last year. Profit for the period increased to INR 644.19 lakhs from INR 619.31 lakhs year-over-year. Basic earnings per share stood at INR 1.26 versus INR 1.21 in the previous year's quarter. The company operates through manufacturing and trading segments, with manufacturing contributing INR 12,266 lakhs and trading INR 3,553 lakhs to segment revenue. GP Petroleums entered a joint venture agreement with West Coast Oils LLP in May 2025 for specialty bitumen products manufacturing and trading, though operations have not yet commenced. The register of members will remain closed from September 20-26, 2025, for AGM purposes.",
            "Sentiment": "positive",
            "PublishDate": 1754991143792,
            "Source": "earnings"
        },
        {
            "Title": "GP Petroleums Secures 2.23 Billion Rupee Bulk Bitumen Supply Agreement",
            "Summary": "GP Petroleums has entered into a supply agreement for bulk bitumen VG30 grade. The total deliverable value of the agreement is 2.23 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1732880326000,
            "Source": "order&deals"
        },
        {
            "Title": "GP Petroleums to Enter Joint Venture with West Coast Oils",
            "Summary": "<p>GP Petroleums has announced plans to enter into a <span class=\"positive\">joint venture</span> agreement with West Coast Oils. The size of the joint venture is reported to be <b>220 million rupees</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728537099000,
            "Source": "corporate_action"
        }
    ]
}