{
    "Symbol": "GULFOILLUB",
    "ISIN": "INE635Q01029",
    "News": [
        {
            "Title": "Gulf Oil Reports Record Q3 Revenue of ₹997.92 Cr",
            "Summary": "Gulf Oil Lubricants India achieved record Q3 FY26 revenue of ₹997.92 crores, up 10.28% YoY, with EBITDA of ₹130.27 crores. Company declares interim dividend of ₹21 per share.",
            "Sentiment": "positive",
            "PublishDate": 1770690686498,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gulf Oil Lubricants Shareholders Approve Key Appointments",
            "Summary": "Gulf Oil Lubricants India shareholders approved appointment of Manish Kumar Gangwal as Director and Whole-Time Director through postal ballot with overwhelming majority support.",
            "Sentiment": "positive",
            "PublishDate": 1770624950041,
            "Source": "stocks"
        },
        {
            "Title": "Gulf Oil Lubricants Board Meet on Feb 9 for Q3 Results",
            "Summary": "Gulf Oil Lubricants India Limited has scheduled its board meeting for February 9, 2026, to approve Q3FY26 unaudited financial results and consider interim dividend declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1770016246673,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gulf Oil Lubricants seeks postal ballot for director",
            "Summary": "Gulf Oil Lubricants India Limited has published newspaper notices for postal ballot seeking shareholder approval to appoint Manish Kumar Gangwal as Whole-Time Director. E-voting period runs from January 9 to February 7, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767790126464,
            "Source": "stocks"
        },
        {
            "Title": "Gulf Oil Lubricants seeks shareholder nod for director",
            "Summary": "Gulf Oil Lubricants India Limited has issued a postal ballot notice seeking shareholder approval for appointing Manish Kumar Gangwal as Whole-Time Director. E-voting opens January 9, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767706086640,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gulf Oil Launches Syntrac Engine Oil at IBW 2025",
            "Summary": "Gulf Oil Lubricants India Limited announces the launch of its new Syntrac 100% fully synthetic premium motorcycle engine oil range at India Bike Week 2025, Asia's largest motorcycling festival.",
            "Sentiment": "positive",
            "PublishDate": 1767010305007,
            "Source": "stocks"
        },
        {
            "Title": "Gulf Oil Lubricants Launches New Gulf Syntrac Engine Oil",
            "Summary": "Gulf Oil Lubricants India has introduced its new Gulf Syntrac engine oil product, expanding its lubricant portfolio in the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1767009861898,
            "Source": "stocks"
        },
        {
            "Title": "Gulf Oil Lubricants Reports 12.6% Revenue Growth in Q2 FY26, Board Approves Increased Stake in EV Charger Subsidiary",
            "Summary": "Gulf Oil Lubricants India delivered 12.6% revenue growth to Rs 956.78 crores in Q2 FY26 with EBITDA growing 10.6% to Rs 118.46 crores, driven by strong performance across B2C automotive and B2B industrial segments. The Board approved increasing stake in EV charger subsidiary Tirex by 14% to 65%, which recorded 75% revenue growth in H1 FY26, while the company was recognized as one of India's Best Managed Companies 2025 by Deloitte India.",
            "Sentiment": "positive",
            "PublishDate": 1763361182724,
            "Source": "earnings"
        },
        {
            "Title": "Gulf Oil Lubricants Increases Stake in Subsidiary Tirex Transmission to 65.18%",
            "Summary": "Gulf Oil Lubricants India Limited acquired an additional 14.18% stake in its subsidiary Tirex Transmission Private Limited for ₹38.09 crores, purchasing 11,71,929 equity shares at ₹325 per share from existing shareholders. The acquisition increases Gulf Oil's ownership in Tirex to 65.18%, totaling 53,86,584 equity shares, strengthening its control over the subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1763135119161,
            "Source": "order&deals"
        },
        {
            "Title": "Gulf Oil Lubricants Reports 9.5% Volume Growth in Q2, Plans to Increase Tirex Stake to 65%",
            "Summary": "Gulf Oil Lubricants India Limited reported 9.5% volume growth in lubricants for the second quarter, reaching 40,500 KL, with AdBlue volumes growing 24% to 36,000 KL. The company achieved 12.6% revenue growth for the first half and 10.56% EBITDA growth for the quarter. However, rupee depreciation of 3.5% during the quarter impacted gross margins and resulted in Rs. 6 crore mark-to-market forex losses in finance costs. The Board approved increasing the stake in EV charger subsidiary Tirex from 51% to 65% with an investment of Rs. 38 crore. Tirex recorded 75% growth with revenues of Rs. 42 crore in H1 versus Rs. 24 crore last year. The company maintains its EBITDA margin guidance of 12-14% and expects to continue growing at 2-3 times the market rate. Most key segments including passenger car motor oils, motorcycle oils, OEM franchise workshops, and agriculture showed double-digit growth.",
            "Sentiment": "positive",
            "PublishDate": 1762953118080,
            "Source": "earnings"
        },
        {
            "Title": "Gulf Oil Lubricants Provides Growth and Margin Guidance During Conference Call",
            "Summary": "Gulf Oil Lubricants shared its business outlook during a conference call. The company expects margins to improve if the rupee stabilizes at current levels and noted downward trends in base oil prices. For volume growth, Gulf Oil aims to grow at 2-3 times the industry growth rate of 3-4%. The company maintains an EBITDA margin guidance of 12-14%, with performance trending toward the higher end during good quarters and lower end during challenging periods. For its Tirex EV charging subsidiary, management expects revenue to reach INR 300-400 crore within 3-4 years.",
            "Sentiment": "positive",
            "PublishDate": 1762486881698,
            "Source": "stock"
        },
        {
            "Title": "Gulf Oil Lubricants Reports Higher Q2 Net Profit and Revenue Growth",
            "Summary": "Gulf Oil Lubricants reported net profit of 871.3 million rupees for Q2, up from 844.4 million rupees in the same period last year. Revenue increased to 9.57 billion rupees compared to 8.49 billion rupees year-over-year. EBITDA rose to 1.18 billion rupees from 1.07 billion rupees, while EBITDA margin decreased slightly to 12.38% from 12.62% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762350589149,
            "Source": "earnings"
        },
        {
            "Title": "Gulf Oil Lubricants Reports Q2 Results and Increases Stake in Subsidiary Tirex Transmission",
            "Summary": "Gulf Oil Lubricants India Limited announced its unaudited financial results for the second quarter and half year ended September 30, 2025. The Board also approved the acquisition of an additional 14.18% stake in subsidiary Tirex Transmission Private Limited for ₹38.09 crores at ₹325 per share. This acquisition will increase Gulf Oil's shareholding in Tirex from the current level to 65.18%. Tirex operates in the e-mobility sector, designing and manufacturing AC/DC fast chargers for electric vehicles. The company has shown significant revenue growth, with turnover increasing from ₹13.26 crores in FY2022-23 to ₹78.71 crores in FY2024-25. The acquisition is part of Gulf Oil's strategic investment initiative, considering Tirex's growth potential and performance since its initial acquisition in 2023. The transaction involves purchasing 11,71,929 equity shares of face value ₹10 each from existing shareholders and is expected to complete in approximately 2-3 months.",
            "Sentiment": "positive",
            "PublishDate": 1762350192423,
            "Source": "earnings"
        },
        {
            "Title": "Gulf Oil Lubricants India Schedules Q2 FY26 Earnings Conference Call",
            "Summary": "Gulf Oil Lubricants India Limited has scheduled an earnings conference call with analysts and institutional investors for Thursday, November 6, 2025 at 3:30 p.m. IST. The call will discuss the company's unaudited financial results for the second quarter and half year ended September 30, 2025, along with business operations. The call will be represented by Managing Director and CEO Ravi Chawla and Chief Financial Officer Manish Gangwal. ICICI Securities is coordinating the conference call with multiple access numbers provided for different regions including India, Singapore, Hong Kong, UK and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1761657457801,
            "Source": "earnings"
        },
        {
            "Title": "Gulf Oil Lubricants Reports Strong Q1 FY2026 Results, Approves Key Leadership Re-appointments",
            "Summary": "Gulf Oil Lubricants India Limited reported robust quarterly results for Q1 FY2026 ended June 30, 2025. Standalone revenue from operations increased to Rs 99,636.28 lakhs compared to Rs 88,507.31 lakhs in the same quarter last year. Net profit rose to Rs 9,665.93 lakhs from Rs 8,802.26 lakhs year-on-year. Basic earnings per share improved to Rs 19.60 from Rs 17.90. The Board approved re-appointment of Mr. Munesh Narinder Khanna as Independent Director for a five-year term from November 6, 2025 to November 5, 2030, and Mr. Ravi Shamlal Chawla as Managing Director & CEO for three years from June 6, 2026 to June 5, 2029, both subject to shareholder approval. The company scheduled its 17th Annual General Meeting for September 30, 2025, and set September 19, 2025 as the record date for final dividend payment of Rs 28 per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1755102539731,
            "Source": "earnings"
        },
        {
            "Title": "Gulf Oil Lubricants Reports Higher Q1 Profit and Revenue Despite Margin Decline",
            "Summary": "Gulf Oil Lubricants reported Q1 net profit of 967 million rupees, up from 880 million rupees in the same period last year. Revenue increased to 9.96 billion rupees from 8.85 billion rupees year-over-year. EBITDA rose to 1.27 billion rupees from 1.16 billion rupees, though EBITDA margin decreased to 12.70% from 13.13% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755101336415,
            "Source": "earnings"
        },
        {
            "Title": "Gulf Oil Expects Market Share Growth Across Segments",
            "Summary": "Gulf Oil has provided guidance indicating their expectation to grow at twice the market rate and gain market share across all segments. The company expressed confidence in achieving higher growth in key segments such as diesel engine oil and MCO (motorcycle oil), where they claim to have good strength. This information was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1747971167000,
            "Source": "default"
        },
        {
            "Title": "Gulf Oil Lubricants Recommends Dividend",
            "Summary": "Gulf Oil Lubricants has recommended a dividend of Rs. 28 per share.",
            "Sentiment": "positive",
            "PublishDate": 1747838656000,
            "Source": "result"
        },
        {
            "Title": "Gulf Oil Lubricants: Q4 Profit Up 6.7%, ₹28 Dividend Proposed",
            "Summary": "Gulf Oil Lubricants India Ltd reported a 6.7% YoY increase in Q4 net profit to ₹92.2 crore. Revenue rose 9.6% YoY to ₹952.7 crore. EBITDA grew 9.7% YoY to ₹128.7 crore with margins at 13.5%. The board recommended a final dividend of ₹28 per equity share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1747838592000,
            "Source": "earnings"
        },
        {
            "Title": "Gulf Oil Lubricants Reports Q4 Financial Results",
            "Summary": "Gulf Oil Lubricants has released its Q4 financial results. The company's EBITDA increased to 1.24 billion rupees from 1.15 billion rupees year-over-year. The EBITDA margin improved to 13.60% from 13.49% in the same period. Net profit rose to 916 million rupees from 854.3 million rupees year-over-year, but decreased from 982 million rupees quarter-on-quarter. Revenue for Q4 grew to 9.15 billion rupees from 8.53 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747838573000,
            "Source": "result"
        },
        {
            "Title": "Gulf Oil Lubricants India Ltd.: Targets 7-10% Annual Volume Growth Despite EV Expansion",
            "Summary": "Gulf Oil Lubricants India Ltd. aims for 7-10% annual volume growth over the next decade, despite EV market expansion. The company's CFO, Manish Gangwal, expects the Indian lubricant market to grow at 3-4% annually. Gulf Oil plans to achieve this growth through innovation and market share acquisition. The company reported a 21.6% YoY increase in Q3 net profit to Rs 98 crore and a 10.7% rise in revenue to Rs 905 crore.",
            "Sentiment": "positive",
            "PublishDate": 1740541324000,
            "Source": "earnings"
        },
        {
            "Title": "Gulf Oil Lubricants: Positive Outlook Despite EV Growth",
            "Summary": "Gulf Oil expects EV penetration to reach 18-20% by FY28E, maintaining strong lubricants demand. Factors supporting growth include large population, low per capita consumption, infrastructure development, and government support.",
            "Sentiment": "positive",
            "PublishDate": 1740135082000,
            "Source": "normal_news"
        },
        {
            "Title": "Gulf Oil Lubricants India: Q3 Results and Dividend Announcement",
            "Summary": "Gulf Oil Lubricants India reported strong Q3 results, with AdBlue segment expected to maintain double-digit growth. The company declared an interim dividend of Rs 20 per share, up from Rs 16 last year. Systematix maintains a 'Buy' rating and has increased the target price.",
            "Sentiment": "positive",
            "PublishDate": 1739157894000,
            "Source": "result"
        },
        {
            "Title": "Gulf Oil Lubricants Declares Interim Dividend",
            "Summary": "Gulf Oil Lubricants has announced an interim dividend of Rs 20 per share for its shareholders. This corporate action represents a significant return of value to the company's investors.",
            "Sentiment": "positive",
            "PublishDate": 1738851393000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gulf Oil Lubricants Reports Q3 EBITDA Growth",
            "Summary": "Gulf Oil Lubricants has announced its Q3 financial results. The company's EBITDA increased to 1.22 billion rupees, up from 1.11 billion rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 13.5% from 13.59% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738851388000,
            "Source": "earnings"
        },
        {
            "Title": "Gulf Oil Lubricants Reports Strong Q3 Financial Results",
            "Summary": "Gulf Oil Lubricants has announced its financial results for the third quarter. The company's net profit increased to 982 million rupees, up from 807 million rupees in the same period last year. Revenue also saw growth, reaching 9.05 billion rupees compared to 8.17 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738851383000,
            "Source": "earnings"
        },
        {
            "Title": "Gulf Oil Lubricants Partners with Nayara Energy for Nationwide Distribution",
            "Summary": "Gulf Oil Lubricants has formed a partnership with Nayara Energy to distribute its premium automotive lubricants and AdBlue products across more than 6,500 fuel stations throughout India. This collaboration aims to expand Gulf Oil's reach and make its products more accessible to consumers nationwide.",
            "Sentiment": "positive",
            "PublishDate": 1735021492000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gulf Oil Lubricants Partners with Nayara Energy",
            "Summary": "Gulf Oil Lubricants has announced a partnership with Nayara Energy. This collaboration likely aims to strengthen Gulf Oil's market presence and distribution network through Nayara Energy's extensive retail outlets.",
            "Sentiment": "positive",
            "PublishDate": 1735021486000,
            "Source": "corporate_action"
        },
        {
            "Title": "Paragon Fine and Speciality Chemicals Acquires Land for Expansion",
            "Summary": "Paragon Fine and Speciality Chemicals has acquired land for ₹2.22 crore to expand its operational capacity. This move indicates the company's plans for growth and increased production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1734428086000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gulf Oil Lubricants Renews Exclusive Partnership with Piaggio India",
            "Summary": "Gulf Oil Lubricants has renewed its exclusive partnership with Piaggio India until 2032. The agreement allows Gulf Oil to continue providing high-quality lubricants for Piaggio's two-wheeler segment in India. This long-term renewal suggests a successful ongoing collaboration between the two companies in the automotive lubricants market.",
            "Sentiment": "positive",
            "PublishDate": 1734427633000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gulf Oil Lubricants: Subsidiary Tirex Transmission Targets Rs 500-Crore Turnover",
            "Summary": "Gulf Oil Lubricants India expects its subsidiary Tirex Transmission to reach Rs 500 crore turnover in 3-4 years. Tirex's H1 FY24 turnover was Rs 25 crore, up 300% year-on-year. Gulf Oil aims to double Tirex's turnover annually for the next 3-5 years. The company is expanding its presence in the EV charging segment through strategic acquisitions.",
            "Sentiment": "positive",
            "PublishDate": 1732941023000,
            "Source": "normal_news"
        },
        {
            "Title": "Gulf Oil Lubricants Renews Partnership with Piaggio Vehicles",
            "Summary": "Gulf Oil Lubricants has announced the renewal of its long-term partnership with Piaggio Vehicles. The agreement focuses on marketing high-performance lubricant solutions for Piaggio's commercial vehicles business. This extended collaboration will remain effective until the end of 2030.",
            "Sentiment": "positive",
            "PublishDate": 1732581738000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gulf Oil Lubricants Renews Partnership with Piaggio Vehicles",
            "Summary": "Gulf Oil Lubricants has announced the renewal of its long-term partnership with Piaggio Vehicles for marketing high-performance lubricant solutions for commercial vehicles. The renewed agreement will be effective until the end of 2030.",
            "Sentiment": "positive",
            "PublishDate": 1732531683000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gulf Oil Lubricants MD Expresses Confidence in India's Lubricants Sector",
            "Summary": "The Managing Director of Gulf Oil Lubricants has expressed a positive outlook for demand in India's lubricants sector, particularly in the medium to long term. The company maintains its growth momentum through strategic brand investments, improved product capabilities, and industry-leading initiatives aimed at driving profitable growth across its focus segments.",
            "Sentiment": "positive",
            "PublishDate": 1731765785000,
            "Source": "normal_news"
        },
        {
            "Title": "Gulf Oil Lubricants Reports Improved Q2 EBITDA and Margin",
            "Summary": "Gulf Oil Lubricants has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.1 billion rupees, up from 1 billion rupees in the same quarter last year. Additionally, the EBITDA margin improved slightly to 12.62% from 12.52% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730894255000,
            "Source": "result"
        },
        {
            "Title": "Gulf Oil Lubricants Reports Q2 Profit and Revenue Growth",
            "Summary": "Gulf Oil Lubricants has reported a net profit of 844 million rupees for the second quarter, showing an increase from 736 million rupees year-over-year and 880 million rupees quarter-over-quarter. The company's revenue for Q2 reached 8.5 billion rupees, up from 8.02 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730894194000,
            "Source": "result"
        }
    ]
}