{
    "Symbol": "GULPOLY",
    "ISIN": "INE255D01024",
    "News": [
        {
            "Title": "Gulshan Polyols Q3FY26 earnings call on Feb 12",
            "Summary": "Gulshan Polyols Limited announces earnings conference call scheduled for February 12, 2026 at 12:15 PM IST to discuss Q3FY26 financial results with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1770659875860,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gulshan Polyols Halts Bourgain Factory Operations",
            "Summary": "Gulshan Polyols has temporarily suspended operations at its Bourgain facility following the death of a contract worker, prioritizing safety and investigation procedures.",
            "Sentiment": "negative",
            "PublishDate": 1768220334466,
            "Source": "stocks"
        },
        {
            "Title": "Gulshan Polyols Submits Trust Compliance Certificates",
            "Summary": "Gulshan Polyols Limited has received compliance certificates from four trusts for FY2024-25, confirming adherence to SEBI exemption order requirements under takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1766562455503,
            "Source": "stocks"
        },
        {
            "Title": "Gulshan Polyols Reports Strong Q2 Performance with 23% Revenue Growth and 1,000% PAT Jump",
            "Summary": "Gulshan Polyols Limited delivered robust quarterly results with 23% year-on-year revenue growth and 140% EBITDA increase, alongside a remarkable 1,000% growth in profit after tax. The multi-product company, operating nine plants across India producing ethanol and specialty chemicals, received Rs. 5.34 crores PLI from MP government and expects additional incentives of Rs. 14-15 crores from MP and Rs. 5 crores from Assam government in the second half.",
            "Sentiment": "positive",
            "PublishDate": 1763378623208,
            "Source": "earnings"
        },
        {
            "Title": "Gulshan Polyols Reports Strong FY25 Performance with 47% Revenue Growth to Rs 1,187 Cr",
            "Summary": "Gulshan Polyols Limited delivered robust financial performance in FY25 with revenue growing 47% and EBITDA rising 64%. The ethanol segment led growth with 14.1 crore liters in sales volume (112% year-on-year increase) and revenue of Rs 1,187 crores (141% growth). The grain processing division faced challenges with revenue declining 7% to Rs 729 crores due to geopolitical disruptions and commodity market realignments. The mineral processing segment maintained stable performance with revenue of Rs 104 crores (5% growth). The company operates across three main segments: ethanol distillery with 810 KLPD capacity across plants in Madhya Pradesh and Assam, grain processing producing starch and derivatives, and mineral processing manufacturing calcium carbonate products. For FY26, the company expects full capacity utilization of its 810 KLPD distillery targeting 25 crore liters, recovery in grain segment demand, and stable mineral operations. The company has also undertaken a feasibility study for bio-diesel production.",
            "Sentiment": "positive",
            "PublishDate": 1762479005181,
            "Source": "stock"
        },
        {
            "Title": "Gulshan Polyols Plans to Double Production Capacity by FY27 Through Green Energy Expansion",
            "Summary": "Gulshan Polyols aims to double its specialty chemical and grain processing capacity by FY27. The expansion will be supported by ventures in green methanol, ethanol, and carbon capture technologies. The company plans to expand exports to over 35 countries and leverage the government's green hydrogen initiative to drive diversified, high-margin growth.",
            "Sentiment": "positive",
            "PublishDate": 1762439913872,
            "Source": "stock"
        },
        {
            "Title": "Gulshan Polyols Reports Strong Q2 Performance with Net Profit Surge",
            "Summary": "Gulshan Polyols reported consolidated net profit of 158 million rupees in Q2, significantly higher than 12.8 million rupees in the same quarter last year. The company's revenue increased to 5.4 billion rupees compared to 4.4 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762432578670,
            "Source": "earnings"
        },
        {
            "Title": "Gulshan Polyols De-registers Wholly-Owned Dubai Subsidiary",
            "Summary": "Gulshan Polyols Limited has de-registered its wholly-owned subsidiary GULSHAN OVERSEAS-FZCO, which was registered with Dubai Silicon Oasis Authority on September 08, 2021. The subsidiary had not commenced any business operations, transactions or activities since incorporation. The company noted that it was not a material subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1761568453254,
            "Source": "corporate_action"
        },
        {
            "Title": "Gulshan Polyols Secures 11.85 Billion Rupee Ethanol Supply Contract",
            "Summary": "Gulshan Polyols has been allocated ethanol supply contracts with an estimated order value of 11.85 billion rupees. The company received allocation for supplying ethanol to Oil Marketing Companies (OMCs) under the Ethanol Blended Petrol Programme.",
            "Sentiment": "positive",
            "PublishDate": 1761179482204,
            "Source": "order&deals"
        },
        {
            "Title": "Gulshan Polyols Secures ₹11,849 Crore Ethanol Supply Contract for 2025-26",
            "Summary": "Gulshan Polyols Limited has been allocated 175,652 kiloliters of ethanol for supply to Oil Marketing Companies under the Ethanol Blended Petrol Programme for the Ethanol Supply Year 2025-26. The contract has an estimated order value of ₹11,848,656,380. The allocation was awarded by four major oil companies: Bharat Petroleum Corporation Limited (BPCL), Indian Oil Corporation Limited (IOCL), Hindustan Petroleum Corporation Limited (HPCL), and Mangalore Refinery And Petrochemicals Limited (MRPL). The company participated in tender number 1000423858 (C1) for ethanol supply at various locations across the country. This is a domestic contract with no related party transactions or promoter group interests involved.",
            "Sentiment": "positive",
            "PublishDate": 1761048763194,
            "Source": "order&deals"
        },
        {
            "Title": "Gulshan Polyols Receives Rs. 5.37 Crore Production Linked Fiscal Assistance from Madhya Pradesh Government",
            "Summary": "Gulshan Polyols Limited received Production Linked Fiscal Assistance (PLFA) of Rs. 5.3754 crore for financial year 2023-24 from MP Industrial Development Corporation Limited. The assistance was granted under the MP Investment Promotion Assistance Scheme, 2014. The company disclosed this information to stock exchanges BSE and NSE under regulatory compliance requirements.",
            "Sentiment": "positive",
            "PublishDate": 1761048403732,
            "Source": "stock"
        },
        {
            "Title": "Gulshan Polyols Appoints Two New Non-Executive Directors",
            "Summary": "Gulshan Polyols Limited appointed two new non-executive directors effective October 1, 2025. Rahul Jain was appointed as Non-Executive Independent Director for a two-year term ending September 30, 2027, while Anubha Gupta was appointed as Non-Executive and Non-Independent Director. The appointments were approved at the 25th Annual General Meeting held on September 18, 2025. Jain is a Fellow Member of the Institute of Cost Accountants of India with over 15 years of experience and founder of Rahul Jain & Associates. Gupta holds a postgraduate diploma in History of Art from University of London and has over a decade of business experience managing investment interests across hydropower, hospitality, and strategic investments. Gupta is a company promoter and daughter of Dr. Chandra Kumar Jain, who is also a promoter.",
            "Sentiment": "positive",
            "PublishDate": 1758193239681,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gulshan Polyols Appoints Two New Directors and Reports Strong Q1FY26 Performance",
            "Summary": "Gulshan Polyols Limited appointed Mr. Rahul Jain as Non-Executive Independent Director for a two-year term and Ms. Anubha Gupta as Non-Executive Non-Independent Director, both effective October 1, 2025, subject to shareholder approval. The company reported strong quarterly results with revenue of Rs 593.2 crore (31% YoY growth), EBITDA of Rs 38.5 crore (50% YoY growth), and profit after tax of Rs 13.2 crore (36% YoY growth). The ethanol segment performed well with 6 crore liters volume and Rs 403 crore revenue, while the grain processing division faced margin pressures due to oversupply. The company expects maximum capacity utilization of its 810 KLPD distillery in FY26, targeting 25 crore liters production.",
            "Sentiment": "positive",
            "PublishDate": 1754574768573,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gulshan Polyols Plans ₹2.50 Billion Fundraise as Q1 EBITDA Jumps 56%",
            "Summary": "Gulshan Polyols announced plans to raise up to ₹2.50 billion. The company reported Q1 EBITDA of ₹366 million compared to ₹235 million in the same period last year, representing a year-on-year increase. The EBITDA margin improved to 6.17% from 5.18% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754569622321,
            "Source": "stock"
        },
        {
            "Title": "Gulshan Polyols Reports 36% Jump in Net Profit to 132M Rupees",
            "Summary": "Gulshan Polyols reported net profit of 132 million rupees compared to 97 million rupees in the same quarter last year, marking a 36% increase. The company's revenue grew to 5.9 billion rupees from 4.5 billion rupees year-over-year, representing a 31% rise in quarterly revenue.",
            "Sentiment": "positive",
            "PublishDate": 1754567872036,
            "Source": "earnings"
        },
        {
            "Title": "CRISIL Revises Gulshan Polyols' Rating Outlook to Negative, Maintains A Rating",
            "Summary": "CRISIL Ratings has reaffirmed Gulshan Polyols Limited's long-term rating at CRISIL A but revised the outlook from stable to negative. The short-term rating remains at CRISIL A1. These ratings apply to bank loan facilities totaling Rs. 525 crore across multiple banks including State Bank of India, HSBC, and HDFC Bank. The facilities include cash credit limits, term loans, and non-fund based limits. State Bank of India has the largest exposure with Rs. 276.47 crore in total facilities, followed by HSBC with Rs. 174.37 crore.",
            "Sentiment": "negative",
            "PublishDate": 1753444666542,
            "Source": "stock"
        },
        {
            "Title": "Gulshan Polyols CMD Participates in NDTV Profit Media Interaction",
            "Summary": "Dr. Chandra Kumar Jain, Chairman & Managing Director of Gulshan Polyols Limited, participated in a live media interaction on NDTV Profit's 'Business Outlook' program on July 22, 2025 at 1:30 PM. The company confirmed that no unpublished price sensitive information was shared during the discussion about the company's business outlook. The program recording has been made available on the company's website for reference.",
            "Sentiment": "neutral",
            "PublishDate": 1753187429284,
            "Source": "stock"
        },
        {
            "Title": "Gulshan Polyols Reports Q4 Financial Results",
            "Summary": "Gulshan Polyols has announced its Q4 financial results. The company's EBITDA increased to 288.8 million rupees from 193.3 million rupees year-over-year. The EBITDA margin improved to 5.61% from 4.77% in the same period. Revenue rose to 5.15 billion rupees from 4.06 billion rupees year-over-year. The standalone net profit for Q4 was 70.2 million rupees, up from 63.7 million rupees year-over-year and 67.8 million rupees quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747757129000,
            "Source": "result"
        },
        {
            "Title": "Gulshan Polyols Secures Large Ethanol Order Under EBPP",
            "Summary": "Gulshan Polyols has been allocated 55,476 kiloliters of ethanol under the Ethanol Blending Petrol Programme (EBPP). The estimated value of this order is 3.63 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1746144525000,
            "Source": "default"
        },
        {
            "Title": "Gulshan Polyols Secures Large Ethanol Order Under EBPP",
            "Summary": "Gulshan Polyols has been allocated 55,476 kiloliters of ethanol under the Ethanol Blending Petrol Programme (EBPP). The estimated value of this order is 3.63 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1746107869000,
            "Source": "default"
        },
        {
            "Title": "Gulshan Polyols Allocated Ethanol Supply for 2024-25",
            "Summary": "Gulshan Polyols has been allocated 21,220 kiloliters of ethanol under the Ethanol Blended Petrol Programme (EBPP) for the ethanol supply year 2024-25. The estimated order value for this allocation is ₹124.13 crores.",
            "Sentiment": "positive",
            "PublishDate": 1740010497000,
            "Source": "order&deals"
        },
        {
            "Title": "Gulshan Polyols Allocated Ethanol Supply for EBPP 2024-25",
            "Summary": "Gulshan Polyols has been allocated 21,220 kiloliters of ethanol under the Ethanol Blended Petrol Programme (EBPP) for the Ethanol Supply Year (ESY) 2024-25. The estimated order value for this allocation is ₹124.13 crores.",
            "Sentiment": "positive",
            "PublishDate": 1739973640000,
            "Source": "order&deals"
        },
        {
            "Title": "Gulshan Polyols Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Gulshan Polyols has announced its financial results for the third quarter. The company's net profit increased to 68 million rupees, up from 46 million rupees year-over-year and 13 million rupees quarter-over-quarter. Revenue also saw substantial growth, reaching 6.1 billion rupees compared to 3.7 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738284261000,
            "Source": "earnings"
        },
        {
            "Title": "Gulshan Polyols Reports Significant EBITDA Growth in Q3",
            "Summary": "Gulshan Polyols has announced its Q3 financial results, showing substantial year-over-year improvement. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 268 million rupees, up from 108 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 4.39% from 2.91% in the previous year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738240689000,
            "Source": "earnings"
        },
        {
            "Title": "Gulshan Polyols Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Gulshan Polyols has announced its financial results for the third quarter. The company's net profit increased to 68 million rupees, up from 46 million rupees year-over-year and 13 million rupees quarter-over-quarter. Revenue also saw substantial growth, reaching 6.1 billion rupees compared to 3.7 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738240632000,
            "Source": "earnings"
        },
        {
            "Title": "Gulshan Polyols Receives Production Linked Incentive for Bio-Ethanol",
            "Summary": "Gulshan Polyols has announced that it has received a Production Linked Incentive (PLI) of 2 rupees per litre for bio-ethanol production. The company expects to benefit by 500 million rupees over the next three years from this incentive.",
            "Sentiment": "positive",
            "PublishDate": 1734521798000,
            "Source": "corporate_action"
        },
        {
            "Title": "Gulshan Polyols Q2 EBITDA Remains Stable, Margin Declines",
            "Summary": "Gulshan Polyols reported Q2 EBITDA of 162.9 million rupees, slightly up from 162 million rupees in the same quarter last year. However, the EBITDA margin decreased to 3.70% from 5.27% year-over-year, indicating pressure on profitability despite maintaining revenue levels.",
            "Sentiment": "neutral",
            "PublishDate": 1731503033000,
            "Source": "result"
        },
        {
            "Title": "Gulshan Polyols Reports Q2 Revenue Growth",
            "Summary": "Gulshan Polyols has announced its Q2 revenue, which stands at 4.4 billion rupees, compared to 3.08 billion rupees in the same quarter last year, representing a significant year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731502897000,
            "Source": "result"
        },
        {
            "Title": "Gulshan Polyols Reports Q2 Net Profit Decline",
            "Summary": "Gulshan Polyols has reported a net profit of 12.8 million rupees for the second quarter, down from 22 million rupees in the same period last year. This represents a year-over-year decline in profits. However, compared to the previous quarter, where the net profit was 97 million rupees, there has been a significant quarter-over-quarter decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731502847000,
            "Source": "result"
        },
        {
            "Title": "Gulshan Polyols Secures Large Ethanol Allocation",
            "Summary": "Gulshan Polyols has been allocated 142,222 kiloliters of ethanol, with an estimated order value of 9.94 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1729600572000,
            "Source": "corporate_action"
        }
    ]
}