{
    "Symbol": "GVPIL",
    "ISIN": "INE878A01011",
    "News": [
        {
            "Title": "GE Power India's Company Secretary Resigns",
            "Summary": "Ms. Kamna Tiwari, Company Secretary & Compliance Officer of GE Power India Limited, has resigned effective April 2, 2026, to pursue career opportunities outside the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1770204558420,
            "Source": "stocks"
        },
        {
            "Title": "GE Power India Faces ₹41.57 Cr GST Demand Notice",
            "Summary": "GE Power India Limited receives GST demand notice of ₹41.57 crores from tax authorities for alleged non-compliance on advance payments during FY2018-2021. Company plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1765379543526,
            "Source": "stocks"
        },
        {
            "Title": "GE Power India Reports 45% Growth in Core Services Orders, Settles Major Disputes with BHEL and Jaypee",
            "Summary": "GE Power India Limited achieved INR 281 crores revenue for Q2 FY2025-26 with core services orders growing 45% to INR 162 crores, while settling disputes with BHEL for INR 340 crores recovery and Jaypee for INR 25 crores. The company completed strategic demerger of Durgapur facility to JSW Energy and expanded international presence across 7 countries, strengthening its focus on profitable services business.",
            "Sentiment": "positive",
            "PublishDate": 1763706879913,
            "Source": "earnings"
        },
        {
            "Title": "GE Power India Reports 45% QoQ Order Growth, Announces Durgapur Business Demerger to JSW Energy",
            "Summary": "GE Power India achieved 45% quarter-on-quarter order growth in core services with revenue up 29% in Q2 2025-26, driven by major orders including Wanakbori Turbine upgrade worth INR 243 crores and settlement agreement with BHEL. The company's board approved a demerger scheme transferring its Durgapur manufacturing business to JSW Energy, with shareholders receiving 10 JSW Energy shares for every 139 GVPIL shares held.",
            "Sentiment": "positive",
            "PublishDate": 1763111427627,
            "Source": "earnings"
        },
        {
            "Title": "GE Power India Reports 25.6% Revenue Growth in Q2 FY26 with Improved Profitability",
            "Summary": "GE Power India Limited reported total income of INR 3,069.6 million for Q2 FY26, up 25.6% from INR 2,444.5 million in the same quarter last year, with profit before tax from continuing operations rising to INR 461.0 million from INR 244.0 million. The company's order backlog decreased 28.7% to INR 18,250 million due to termination of two FGD EPC contracts worth INR 775 crores, while EBITDA margin improved to 17.7% from 15.2%.",
            "Sentiment": "positive",
            "PublishDate": 1763066113565,
            "Source": "earnings"
        },
        {
            "Title": "GE Power India Approves Demerger of Boiler Manufacturing Business to JSW Energy",
            "Summary": "GE Power India Limited's board approved a scheme of arrangement with JSW Energy Limited involving the demerger of its boiler manufacturing business. The demerger transfers GE Power India's business of manufacturing and supplying power boiler components, pressure vessels, piping, and coal mills for thermal power plants at the Durgapur Facility to JSW Energy. Under the share exchange ratio, JSW Energy will issue 10 fully paid equity shares of INR 10 each for every 139 shares held in GE Power India. The demerged business generated INR 529.5 million in turnover, representing 5.1% of GE Power India's total revenue. The transaction requires approvals from shareholders, creditors, NCLT, SEBI, and stock exchanges. GE Power India aims to focus on strategic growth areas, while JSW Energy seeks to enter the boiler pressure parts manufacturing business and achieve vertical integration. JSW Energy reported revenue of INR 12,639.49 crores for the financial year ended March 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758212893286,
            "Source": "corporate_action"
        },
        {
            "Title": "GE Power India Deposits ₹775 Crore After Delhi High Court Modifies Bank Guarantee Injunction Order",
            "Summary": "GE Power India Limited filed petitions in Delhi High Court seeking to prevent Jaiprakash Power Ventures Limited from invoking bank guarantees worth ₹775 crore related to previously announced contracts. The court initially granted an injunction in favor of GE Power India on August 1 and 4, 2025. However, in subsequent hearings, the court appeared inclined to vacate the injunction. GE Power India then requested to deposit an equivalent amount of ₹775 crore with Jaiprakash Power Ventures in exchange for the return of un-encashed advance bank guarantees. The court accepted this proposal and disposed of the petitions accordingly. The company is evaluating further steps on the matter.",
            "Sentiment": "neutral",
            "PublishDate": 1756384881352,
            "Source": "stock"
        },
        {
            "Title": "GE Power India Reports Strong Quarterly Turnaround with 316M Rupees Net Profit",
            "Summary": "GE Power India achieved a net profit of 316 million rupees in its latest quarter, marking a significant turnaround from a loss of 107 million rupees in the same period last year. The company's revenue grew to 2.9 billion rupees compared to 2.46 billion rupees year-over-year, representing an increase in both profitability and top-line performance.",
            "Sentiment": "positive",
            "PublishDate": 1755093026771,
            "Source": "earnings"
        },
        {
            "Title": "GE Power India Schedules Board Meeting for Quarterly Results on August 13, 2025",
            "Summary": "GE Power India Limited has scheduled a Board of Directors meeting on August 13, 2025, to consider and approve the standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The company has implemented a trading window closure effective from July 1, 2025, which will remain in place until 48 hours after the quarterly financial results are made public.",
            "Sentiment": "neutral",
            "PublishDate": 1754646060293,
            "Source": "corporate_action"
        },
        {
            "Title": "GE Power India Schedules Board Meeting on August 13 to Approve Quarterly Financial Results",
            "Summary": "GE Power India Limited has scheduled a Board of Directors meeting for August 13, 2025, to consider and approve the standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The company has implemented a trading window closure effective July 1, 2025, which will remain in place until 48 hours after the quarterly results are made public. The announcement was made by Company Secretary & Compliance Officer Kamna Tiwari to both NSE and BSE stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1754404068321,
            "Source": "corporate_action"
        },
        {
            "Title": "GE Power India Reports Loss in Q4",
            "Summary": "GE Power India has reported a loss before tax (LBT) of 300 million rupees in the latest quarter, compared to a profit of 124 million rupees in the same period last year. The company also reported an exceptional item of 2.4 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1748533912000,
            "Source": "result"
        },
        {
            "Title": "GE Power India Reports Q4 Financial Results",
            "Summary": "GE Power India has reported its quarterly financial results. The company's net profit for Q4 stands at 1.6 billion rupees, compared to 231 million rupees in the same quarter last year, showing a significant year-over-year increase. However, it represents a loss of 196 million rupees compared to the previous quarter. The company's Q4 revenue is 2.7 billion rupees, up from 2.5 billion rupees in the same quarter last year.",
            "Sentiment": "mixed",
            "PublishDate": 1748533785000,
            "Source": "result"
        },
        {
            "Title": "GE Power India Secures 382 Million Rupee Order from NTPC",
            "Summary": "GE Power India has received an order worth 382 million rupees from NTPC, India's largest power utility. This order signifies a business transaction between the two companies, potentially for power generation equipment or related services.",
            "Sentiment": "positive",
            "PublishDate": 1743639181000,
            "Source": "order&deals"
        },
        {
            "Title": "GE Power India Secures 382 Million Rupee Order from NTPC",
            "Summary": "GE Power India has received an order worth 382 million rupees from NTPC, India's largest power utility. This order signifies a significant business deal for GE Power India and potentially strengthens its position in the Indian power sector.",
            "Sentiment": "positive",
            "PublishDate": 1743595872000,
            "Source": "order&deals"
        },
        {
            "Title": "GE Power India Secures Additional Contract Worth 2.74 Billion Rupees from Greenko",
            "Summary": "GE Power India has announced an expansion in its contract scope with Greenko. The additional contract is valued at 2.74 billion rupees (approximately $33 million USD). This development suggests a growing business relationship between the two companies and potentially indicates increased activity in India's power sector.",
            "Sentiment": "positive",
            "PublishDate": 1740702254000,
            "Source": "order&deals"
        },
        {
            "Title": "GE Power India Ltd: Secures ₹273.5 Crore Additional Contract for Greenko's Hydro Project",
            "Summary": "GE Power India Ltd has obtained an additional contract worth ₹273.5 crore from GREENKO KA01 IREP Private Ltd for the Saundatti Hydro Project in Karnataka. The contract involves engineering, manufacturing, and installation of electromechanical equipment for an additional 320 MW unit.",
            "Sentiment": "positive",
            "PublishDate": 1740656881000,
            "Source": "order&deals"
        },
        {
            "Title": "GE Power India Secures Additional Contract Worth 2.74 Billion Rupees from Greenko",
            "Summary": "GE Power India has announced an expansion in its contract scope with Greenko. The additional contract is valued at 2.74 billion rupees (approximately $33 million USD). This development suggests a growing business relationship between the two companies and potentially indicates increased activity in India's power sector.",
            "Sentiment": "positive",
            "PublishDate": 1740655981000,
            "Source": "order&deals"
        },
        {
            "Title": "GE Power Secures 403.4 Million Rupee Order",
            "Summary": "GE Power has won an order valued at 403.4 million rupees. The news brief does not provide additional details about the nature of the order or the client.",
            "Sentiment": "positive",
            "PublishDate": 1740032290000,
            "Source": "order&deals"
        },
        {
            "Title": "GE Power India Reports Increased Q3 Net Loss and Revenue",
            "Summary": "GE Power India has reported financial results for the third quarter. The company's net loss widened to 196 million rupees, compared to a loss of 19 million rupees in the same period last year. However, revenue increased to 3.2 billion rupees from 2.94 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739405858000,
            "Source": "earnings"
        },
        {
            "Title": "GE Power India Reports Increased Q3 Net Loss",
            "Summary": "GE Power India has reported a net loss of 196 million rupees for the third quarter, compared to a loss of 19 million rupees in the same period last year. Despite the increased loss, the company's revenue grew to 3.2 billion rupees from 2.94 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739363151000,
            "Source": "earnings"
        },
        {
            "Title": "GE Power India Secures 137.5 Million Rupee Order from NTPC",
            "Summary": "GE Power India has received a purchase order from NTPC (National Thermal Power Corporation) for an amount of 137.5 million rupees. This order signifies a new business deal between the two companies, potentially for power generation equipment or services.",
            "Sentiment": "positive",
            "PublishDate": 1738759373000,
            "Source": "order&deals"
        },
        {
            "Title": "GE Power India Receives Purchase Order Extension from MP Power Generating Co.",
            "Summary": "GE Power India has been granted an extension of a purchase order from MP Power Generating Co. Ltd. The extended order is valued at 182.7 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1734319258000,
            "Source": "order&deals"
        },
        {
            "Title": "GE Power India Reports Exceptional Gain of 583 Million Rupees",
            "Summary": "GE Power India has announced an exceptional gain of 583 million rupees. This significant financial development could potentially impact the company's overall financial performance for the reporting period.",
            "Sentiment": "positive",
            "PublishDate": 1730886338000,
            "Source": "result"
        },
        {
            "Title": "GE Power India Reports Q2 Revenue Decline",
            "Summary": "GE Power India has reported a revenue of 2.2 billion rupees for the second quarter, down from 2.4 billion rupees in the same quarter last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1730886214000,
            "Source": "result"
        },
        {
            "Title": "GE Power India Reports Profit in Q2 FY24",
            "Summary": "GE Power India has reported a net profit of 660 million rupees in the second quarter, compared to a loss of 620 million rupees in the same period last year. This represents a significant turnaround in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1730886174000,
            "Source": "result"
        },
        {
            "Title": "GE Power India: Secures ₹2,404 Million Hydropower Contract in Nepal",
            "Summary": "<p><span class='positive'>GE Power India Limited (GEPIL)</span> has <span class='positive'>won</span> a <span class='positive'>contract</span> worth <b>₹2,404 million plus NPR 340 million</b> from Blue Energy Limited for the <b>100MW Super Trishuli hydropower project</b> in Nepal. The <b>42-month</b> contract includes <span class='neutral'>design, engineering, and supply of equipment</span>. The project will be <span class='neutral'>executed</span> by <span class='neutral'>GE Vernova Hydro Power India Private Limited</span> due to a previous business transfer agreement.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727773976000,
            "Source": "normal_news"
        }
    ]
}