{
    "Symbol": "GVT&D",
    "ISIN": "INE200A01026",
    "News": [
        {
            "Title": "Multiple Companies Report Q3 FY26 Results",
            "Summary": "Several companies including GE Vernova T&D India, Shemaroo Entertainment, Tata Motors, Mangal Electrical Industries, and Sagility announced their quarterly results for Q3 FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769768639253,
            "Source": "co_actions_results"
        },
        {
            "Title": "GE Vernova T&D Plans INR 1,000 Crore Investment",
            "Summary": "GE Vernova T&D announces investment plans of around INR 1,000 crore with projects extending until FY26-27 or FY27-28. Export orders boost profit margins while pricing adjusts to raw material costs.",
            "Sentiment": "positive",
            "PublishDate": 1769660579219,
            "Source": "stocks"
        },
        {
            "Title": "GE Vernova T&D Updates on Adani Khavda HVDC Project",
            "Summary": "GE Vernova T&D announces project updates will follow after reaching key commercial milestones. Major export order expected to be finalized in second half of next financial year due to customer delays.",
            "Sentiment": "neutral",
            "PublishDate": 1769660548611,
            "Source": "stocks"
        },
        {
            "Title": "GE Vernova T&D Targets Mid-20s EBITDA Margins",
            "Summary": "GE Vernova T&D expects strong EBITDA performance for the financial year, targeting mid-20s margins with no major dilution anticipated ahead.",
            "Sentiment": "positive",
            "PublishDate": 1769660520541,
            "Source": "global"
        },
        {
            "Title": "GE Vernova T&D India Q3FY26 Results & Board Updates",
            "Summary": "GE Vernova T&D India reports strong Q3FY26 performance with revenue of Rs 17,006.4 million and net profit of Rs 2,908.0 million. Board approves key appointments including new Independent Director.",
            "Sentiment": "positive",
            "PublishDate": 1769604645578,
            "Source": "co_actions_results"
        },
        {
            "Title": "GE Vernova T&D India Block Trade Worth Rs. 54.64 Crores",
            "Summary": "GE Vernova T&D India executed a significant block trade on NSE worth Rs. 54.64 crores involving 202,177 shares at Rs. 2702.40 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769500560813,
            "Source": "co_actions_results"
        },
        {
            "Title": "GE Vernova T&D India Board Meet on Jan 28, 2026",
            "Summary": "GE Vernova T&D India Limited has scheduled its Board meeting for January 28, 2026, to consider Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769008537133,
            "Source": "co_actions_results"
        },
        {
            "Title": "GE Vernova T&D India Block Trade Worth ₹38.75 Crores",
            "Summary": "GE Vernova T&D India Ltd. witnessed a significant NSE block trade of ₹38.75 crores involving 140,312 shares at ₹2,761.50 per share, indicating substantial institutional activity in the electrical equipment sector.",
            "Sentiment": "neutral",
            "PublishDate": 1768536229155,
            "Source": "co_actions_results"
        },
        {
            "Title": "GE Vernova T&D Faces ₹9.99 Cr GST Penalty Orders",
            "Summary": "GE Vernova T&D India receives GST penalty orders totaling ₹9.99 crores from Delhi and Chhattisgarh tax authorities for FY2021-22 compliance issues, plans appeals.",
            "Sentiment": "negative",
            "PublishDate": 1767182869799,
            "Source": "stocks"
        },
        {
            "Title": "GE Vernova T&D India announces senior management changes",
            "Summary": "GE Vernova T&D India Limited announces leadership transition in HR department effective January 1, 2026, with Ms. Poonam Mathur appointed as new Head of Human Resources replacing Mr. Amresh Singh.",
            "Sentiment": "neutral",
            "PublishDate": 1767164338713,
            "Source": "stocks"
        },
        {
            "Title": "GE Vernova T&D India surges 47% on record orders",
            "Summary": "GE Vernova T&D India shares rise 47% in 2025 driven by record order backlog of ₹13,100 crore and major contract wins including HVDC projects worth over ₹8,000 crore from Adani and PGCIL.",
            "Sentiment": "positive",
            "PublishDate": 1767058038835,
            "Source": "stocks"
        },
        {
            "Title": "Nomura Sets Buy Rating for GE Vernova T&D at ₹4,000",
            "Summary": "Nomura initiates coverage on GE Vernova T&D with a Buy recommendation and target price of ₹4,000, signaling positive outlook for the electrical equipment manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1766375137876,
            "Source": "stocks"
        },
        {
            "Title": "GE Vernova T&D Wins ₹2500MW HVDC Contract",
            "Summary": "GE Vernova T&D India Limited secures major contract from AESL Projects Limited for design and establishment of 2500MW, 500kV HVDC VSC Terminal Station for renewable power evacuation from Khavda to South Olpad.",
            "Sentiment": "positive",
            "PublishDate": 1766229648231,
            "Source": "co_actions_results"
        },
        {
            "Title": "GE Vernova T&D Faces ₹2.12 Cr GST Penalty",
            "Summary": "GE Vernova T&D India receives GST penalty of ₹2.12 crores from West Bengal authorities for input tax credit mismatch during FY2021-22. Company plans to file appeal against the order.",
            "Sentiment": "negative",
            "PublishDate": 1766209099097,
            "Source": "stocks"
        },
        {
            "Title": "GE Vernova T&D Faces ₹52.86L GST Demand for FY19",
            "Summary": "GE Vernova T&D India receives GST demand of ₹52.86 lakh including penalty and interest for e-waybill reconciliation issues during FY2018-19. Company plans to file appeal against the order.",
            "Sentiment": "negative",
            "PublishDate": 1766146158863,
            "Source": "stocks"
        },
        {
            "Title": "GE Vernova T&D Wins HVDC Upgrade Order from PGCIL",
            "Summary": "GE Vernova T&D India Limited secures long-term high voltage direct current upgrade contract from Power Grid Corporation of India Limited to enhance the 2×500 MW Chandrapur transmission link infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1766024895790,
            "Source": "global"
        },
        {
            "Title": "GE Vernova T&D Wins Major PGCIL HVDC Contract",
            "Summary": "GE Vernova T&D India Limited secures Letter of Award from Power Grid Corporation of India Limited for refurbishment of 2x500MW HVDC Chandrapur back-to-back link between Northern and Southern India.",
            "Sentiment": "positive",
            "PublishDate": 1765990840884,
            "Source": "co_actions_results"
        },
        {
            "Title": "GE Vernova T&D India Sees Rs. 58.30 Crore Block Trade on NSE",
            "Summary": "GE Vernova T&D India executed a block trade worth Rs. 58.30 crores involving approximately 200,833 shares at Rs. 2,902.90 per share on the NSE. The transaction represents a significant institutional trading activity for the power transmission and distribution equipment company.",
            "Sentiment": "neutral",
            "PublishDate": 1764822582654,
            "Source": "order&deals"
        },
        {
            "Title": "GE Vernova T&D India Faces GST Penalty of INR 89.28 Lakh for Transportation Charges",
            "Summary": "GE Vernova T&D India Limited received a GST penalty totaling INR 89,28,324 (tax and penalty of INR 44,64,162 each plus applicable interest) from Vadodara GST authorities for non-payment of GST on transportation charges from April 2018 to March 2023. The company plans to appeal the order and states there will be no material impact on its financial or operational activities beyond the extent of the penalty order.",
            "Sentiment": "negative",
            "PublishDate": 1763223107404,
            "Source": "stock"
        },
        {
            "Title": "GE Vernova T&D India Challenges Madras High Court Decision Through Legal Action",
            "Summary": "GE Vernova T&D India has initiated legal proceedings to challenge a ruling made by the Madras High Court. The company is pursuing legal remedies against the court's decision, though specific details of the ruling and legal grounds were not disclosed.",
            "Sentiment": "negative",
            "PublishDate": 1763127902853,
            "Source": "stock"
        },
        {
            "Title": "GE Vernova T&D India Reports 39% Revenue Growth, Announces INR 8 Billion Capacity Expansion",
            "Summary": "GE Vernova T&D India Limited delivered strong quarterly results with revenue of INR 15.4 billion, up 39% year-over-year from INR 11.1 billion. The company reported robust EBITDA margin expansion to 25.8%, representing a 700 basis point improvement. Order bookings stood at INR 16.1 billion, down from INR 46.8 billion in the previous year quarter, primarily due to large orders received last year. The order backlog remains healthy at INR 131.1 billion. The company announced additional capex of INR 8 billion focused on advanced grid technologies, expanding capacities at Vadodara for transformers and reactors, and new lines for bushings and air core reactors at Hosur. Cash and cash equivalents increased to INR 15.2 billion. Management expects strong demand driven by India's energy transition goals, including 500 GW of non-fossil fuel capacity and significant HVDC opportunities. The company maintains guidance for mid-20s EBITDA margins for the financial year.",
            "Sentiment": "positive",
            "PublishDate": 1762803189307,
            "Source": "earnings"
        },
        {
            "Title": "GE Vernova T&D India Targets INR 5,500-6,000 Crores Revenue for FY25",
            "Summary": "GE Vernova T&D India has set revenue targets of INR 5,500-6,000 crores for FY25, representing approximately 35% growth from the previous year. The company aims to maintain margins above 20% and expects mid-20s EBITDA margins for the fiscal year. The company is focusing on absolute EBITDA growth through increased volumes. Long-term margin predictions were not provided in their recent conference call.",
            "Sentiment": "positive",
            "PublishDate": 1762228039594,
            "Source": "stock"
        },
        {
            "Title": "GE Vernova TSD India Approves INR 806 Crore Investment for Manufacturing Expansion",
            "Summary": "GE Vernova TSD India Limited's Board of Directors approved an investment of INR 806 crore to expand existing facilities at Vadodara, Hosur, and Padappai. The expansion will increase transformer and reactor capacity by more than 50% and GIS AIS products capacity by up to 25%. The project includes establishing new manufacturing lines for Air Core Reactors and Bushing at the Hosur facility. The expansion is scheduled for completion by 2028 and will be funded through internal accruals. The company also approved its unaudited financial results for the quarter ended September 30, 2025, showing revenue from operations of INR 15,384.6 million for the quarter and INR 28,685.9 million for the six-month period.",
            "Sentiment": "positive",
            "PublishDate": 1762159607563,
            "Source": "earnings"
        },
        {
            "Title": "GE Vernova T&D India Reports Strong Q2 Performance with Doubled Net Profit",
            "Summary": "GE Vernova T&D India delivered robust quarterly results with net profit rising to 3 billion rupees from 1.44 billion rupees year-over-year. Revenue increased to 15 billion rupees compared to 11 billion rupees in the same period last year. EBITDA grew significantly to 3.96 billion rupees from 2.05 billion rupees, while EBITDA margin expanded to 25.77% from 18.49% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762158787100,
            "Source": "earnings"
        },
        {
            "Title": "GE Vernova T&D India Re-appoints Sanjay Sagar as Independent Director, Names New Secretarial Auditor",
            "Summary": "GE Vernova T&D India Limited shareholders approved the re-appointment of Sanjay Sagar as Independent Director for a second five-year term from July 1, 2025 to June 30, 2030. Sagar, aged 67, brings over four decades of experience including his role as Joint Managing Director & CEO of JSW Energy Ltd. from 2012 to 2017, where he helped double the company's generation capacity and grow profitability seven-fold. Shareholders also appointed RMG & Associates as Secretarial Auditor for five years from FY 2025-26 to FY 2029-30. RMG & Associates is a Delhi-based company secretaries firm established in 2001 with 24 years of experience in corporate secretarial and regulatory matters. Both appointments were approved at the company's 69th Annual General Meeting held on September 10, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1757591102897,
            "Source": "corporate_governance"
        },
        {
            "Title": "GE Vernova T&D India Reports Strong Q1 FY26 Results with 39% Revenue Growth and 1000 bps EBITDA Expansion",
            "Summary": "GE Vernova T&D India delivered robust quarterly results with revenue rising 39% year-on-year to INR13.3 billion versus INR9.6 billion in Q1 FY25. Order bookings surged 57% to INR16.2 billion compared to INR10.3 billion in the previous year quarter. EBITDA margin expanded significantly by 1000 basis points to 29.1% for the quarter. Profit before tax and exceptional items more than doubled to INR3.9 billion from INR1.8 billion in the corresponding quarter last year. The company generated positive cash flow of INR1.7 billion during the quarter, with cash and cash equivalents increasing to INR12.2 billion from INR10.5 billion as of March 2025. Export orders contributed 39% of quarterly revenue, with the company maintaining an order backlog of INR129.6 billion. Management expects both the South Olpad-Khavda and Barmer-South Kalamb HVDC projects to be finalized during the current financial year. The company announced a capex plan of INR2.5 billion and proposed dividend of INR1.3 billion subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1754385906613,
            "Source": "earnings"
        },
        {
            "Title": "GE Vernova T&D Cautions Against High Q1 Margin Expectations, Targets 19% EBITDA Margin by FY25",
            "Summary": "GE Vernova T&D has warned stakeholders not to consider its high Q1 margins as a new standard for future performance. The company is targeting a 19% EBITDA margin improvement by FY25. This guidance suggests the company experienced strong margins in Q1 but expects performance to normalize going forward while working toward longer-term margin enhancement goals.",
            "Sentiment": "neutral",
            "PublishDate": 1753846338538,
            "Source": "stock"
        },
        {
            "Title": "GE Vernova T&D India Focuses on Energy Transition Projects for Profit Growth",
            "Summary": "GE Vernova T&D India aims to boost profit growth through a robust order pipeline and energy transition projects. The company confirms its leadership position in grid modernization and sustainable transmission and distribution infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1753798357002,
            "Source": "stock"
        },
        {
            "Title": "GE Vernova T&D India Reports Strong Quarterly Performance with 56% Jump in Net Profit",
            "Summary": "GE Vernova T&D India Limited reported net profit of Rs 2,912 million for the quarter ended June 30, 2025, compared to Rs 1,345.4 million in the same quarter last year. Revenue from operations increased to Rs 13,301.3 million from Rs 9,583.4 million year-over-year. Total income rose to Rs 13,464.3 million versus Rs 9,701.4 million in the previous year quarter. Basic and diluted earnings per share improved to Rs 11.3 from Rs 5.25. However, the company recognized a loss of Rs 1,713.7 million in other comprehensive income due to fair value changes on derivatives designated as cash flow hedges. The Board of Directors approved these unaudited financial results at a meeting held on July 29, 2025. The company operates in a single segment relating to products, projects and systems for electricity transmission and related activities.",
            "Sentiment": "positive",
            "PublishDate": 1753789620949,
            "Source": "earnings"
        },
        {
            "Title": "GE Vernova T&D India Schedules Earnings Call for July 29, 2025",
            "Summary": "GE Vernova T&D India Limited has scheduled an earnings conference call with analysts and institutional investors on July 29, 2025, at 6:00 P.M. (IST). The call will discuss the company's un-audited financial results for the quarter ended June 30, 2025, of Financial Year 2025-26. Call details will be available on the company's website. The company was formerly known as GE T&D India Limited and trades under the symbol GVT&D.",
            "Sentiment": "neutral",
            "PublishDate": 1753161014248,
            "Source": "earnings"
        },
        {
            "Title": "GE Vernova T&D India: Q4 Profit Triples, Stock Soars 3,117% in 5 Years",
            "Summary": "GE Vernova T&D India reported a threefold increase in Q4 net profit to Rs 186.49 crore. Order bookings jumped 124% to Rs 29.9 billion in the quarter. The company recommended a final dividend of 250% (Rs 5 per share). The stock has delivered 3,117.8% returns over the past five years and 84.4% gain in 2025 so far.",
            "Sentiment": "positive",
            "PublishDate": 1749633581000,
            "Source": "earnings"
        },
        {
            "Title": "GE Vernova T&D India: Q4 Results Spark 10% Stock Surge",
            "Summary": "GE Vernova T&D India's shares hit 10% upper circuit following strong Q4 results. EBITDA margin at 21.9%, highest among peers. Management confident about long-term demand. Nomura reiterates 'Buy' rating with ₹2,600 target. Analysts project 36% earnings CAGR over FY25-27.",
            "Sentiment": "positive",
            "PublishDate": 1748234916000,
            "Source": "earnings"
        },
        {
            "Title": "GE Vernova T&D India: Q4 Profit Soars Nearly Threefold",
            "Summary": "GE Vernova T&D India reported a consolidated net profit of Rs 186.4 crore in Q4, up from Rs 66.2 crore year-over-year. Revenue increased 26% to Rs 1,153 crore. The company declared a final dividend of Rs 5 per equity share, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1748008210000,
            "Source": "earnings"
        },
        {
            "Title": "GE Vernova: ₹140 Crore Investment to Expand Indian Manufacturing",
            "Summary": "GE Vernova plans to invest ₹140 crore ($16 million) to expand its manufacturing and engineering operations in India. The investment includes a new manufacturing line in Chennai for HVDC and STATCOM valves, and a new engineering and test lab in Noida. The Chennai expansion will be operational by early 2027, while the Noida facility is expected to be ready by the end of 2025.",
            "Sentiment": "positive",
            "PublishDate": 1747201109000,
            "Source": "corporate_action"
        },
        {
            "Title": "GE Vernova to Invest ₹1,400 Million in India's Grid Infrastructure",
            "Summary": "GE Vernova's T&D India division plans to invest ₹1,400 million to expand its manufacturing capabilities in India. This investment aims to meet the growing demand for advanced grid infrastructure in the country. The expansion signifies GE Vernova's commitment to supporting India's evolving energy needs and modernizing its power distribution network.",
            "Sentiment": "positive",
            "PublishDate": 1747191183000,
            "Source": "default"
        },
        {
            "Title": "GE Vernova T&D India to Supply Transformers for Renewable Energy Projects",
            "Summary": "GE Vernova T&D India has secured a contract to deliver extra high-voltage transformers and shunt reactors for renewable energy corridors in India. The company will supply 70 units of 765 kV transformers to Powergrid, supporting the expansion of India's renewable energy infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1746144545000,
            "Source": "default"
        },
        {
            "Title": "GE Vernova T&D India to Supply Transformers for Renewable Energy Corridors",
            "Summary": "GE Vernova T&D India has secured a contract to deliver extra high-voltage transformers and shunt reactors for renewable energy corridors in India. The company will supply 70 units of 765 kV transformers to Powergrid, supporting the expansion of India's renewable energy infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1746104382000,
            "Source": "default"
        },
        {
            "Title": "GE Vernova T&D India Ltd. Executes Block Trade on NSE",
            "Summary": "A block trade of approximately 116,291 shares of GE Vernova T&D India Ltd. was executed on the National Stock Exchange (NSE) for Rs. 16.27 Crores. The trade was conducted at a price of Rs. 1398.70 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1741159776000,
            "Source": "block_deals"
        },
        {
            "Title": "GE Vernova T&D India: Penny Stock Soars from ₹7 to ₹1400 in 21 Years",
            "Summary": "GE Vernova T&D India's stock has risen from ₹7 to ₹1400 over 21 years, turning a ₹1 lakh investment into ₹2 crore. The company reported a 189% YoY increase in Q3 FY25 net profit to ₹142.7 crore, with revenue growing 27.8% to ₹1,073.7 crore. However, order bookings decreased by 12% to ₹2,080 crore in Q3 FY25.",
            "Sentiment": "positive",
            "PublishDate": 1741158041000,
            "Source": "earnings"
        },
        {
            "Title": "GE Vernova T&D India Secures Three Orders Worth 5 Billion Rupees from Power Grid Corporation of India",
            "Summary": "GE Vernova T&D India has received three orders from Power Grid Corporation of India, collectively valued at 5 billion rupees. These orders are likely for transmission and distribution equipment or services, given the company's specialization in this sector.",
            "Sentiment": "positive",
            "PublishDate": 1741134364000,
            "Source": "order&deals"
        },
        {
            "Title": "GE Vernova T&D India: Secures ₹500-Crore Orders from Power Grid",
            "Summary": "GE Vernova T&D India has received three orders worth approximately ₹500 crore from Power Grid Corporation of India Ltd for supplying and installing 765kV class transformers and reactors. The orders are to be executed within 36 months.",
            "Sentiment": "positive",
            "PublishDate": 1741094422000,
            "Source": "order&deals"
        },
        {
            "Title": "GE Vernova T&D India: Q3 Profit Triples, Beats Forecast",
            "Summary": "GE Vernova T&D India reported a 189% YoY increase in Q3 net profit to ₹142.7 crore, surpassing estimates. Revenue rose 27.8% to ₹1,073.7 crore. EBITDA margin improved to 16.7%. The company secured significant orders in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1738756752000,
            "Source": "earnings"
        },
        {
            "Title": "GE Vernova: Profit Rises but Revenue Misses Estimates",
            "Summary": "GE Vernova reported a rise in Q4 profit, with core profit in electrification up 68% to $283 million. However, quarterly revenue of $10.56 billion missed analyst estimates of $10.79 billion. Wind segment orders decreased 41% year-over-year. The company expects mid-single digit organic revenue growth and EBITDA losses of $200-400 million in the wind segment for the current year.",
            "Sentiment": "neutral",
            "PublishDate": 1737553534000,
            "Source": "earnings"
        },
        {
            "Title": "GE Vernova's T&D India Secures Major Order Worth Over 4 Billion Rupees",
            "Summary": "GE Vernova's subsidiary, T&D India, has received a significant order valued at more than 4 billion rupees (approximately $48 million USD). This order represents a substantial business opportunity for the company in the transmission and distribution sector of India's power industry.",
            "Sentiment": "positive",
            "PublishDate": 1734654934000,
            "Source": "order&deals"
        },
        {
            "Title": "GE Vernova T&D India Secures Order Worth Over 4 Billion Rupees",
            "Summary": "GE Vernova T&D India has received an order valued at more than 4 billion rupees. This significant order represents a substantial business opportunity for the company in the transmission and distribution sector.",
            "Sentiment": "positive",
            "PublishDate": 1734608672000,
            "Source": "order&deals"
        },
        {
            "Title": "GE Vernova: Secures Rs 400 Crore Order from Sterlite Power",
            "Summary": "GE Vernova T&D India Ltd. has received orders worth Rs 400 crore from Sterlite Power to supply 765-kilovolt power transformers and reactors for Khavda. The contract will be executed over two years.",
            "Sentiment": "positive",
            "PublishDate": 1733797550000,
            "Source": "order&deals"
        },
        {
            "Title": "GE Vernova T&D India Secures 4 Billion Rupee Order from Sterlite Power",
            "Summary": "GE Vernova T&D India has received a significant order from Sterlite Power valued at 4 billion rupees. The order is for the supply and supervision of 765kV power transformers and reactors for the Khavda project. This deal highlights GE Vernova's strong position in the power transmission equipment market and Sterlite Power's ongoing infrastructure development efforts.",
            "Sentiment": "positive",
            "PublishDate": 1733788531000,
            "Source": "order&deals"
        },
        {
            "Title": "GE Vernova T&D India Announces Offer for Sale of Up to 8.38% Stake",
            "Summary": "GE Vernova T&D India, a grid equipment company, has proposed to sell up to 8.38% of its stake through an offer for sale (OFS). The floor price for the OFS has been set at 1,550 rupees per share, as per the company's filing.",
            "Sentiment": "neutral",
            "PublishDate": 1732581676000,
            "Source": "corporate_action"
        },
        {
            "Title": "GE Vernova T&D India: Promoter Announces 8.38% Stake Sale via OFS",
            "Summary": "Grid Equipments Private Ltd, promoter of GE Vernova T&D India Ltd, announces an offer for sale (OFS) to divest up to 8.38% stake. The floor price is set at ₹1,550 per share. The OFS opens for non-retail investors on November 26, 2024, and for retail investors on November 27, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1732538576000,
            "Source": "corporate_action"
        },
        {
            "Title": "GE T&D India: Shareholders Approve Name Change to GE Vernova T&D India",
            "Summary": "GE T&D India shareholders approved changing the company name to GE Vernova T&D India Ltd at the 68th AGM. The Registrar of Companies has also approved the change. Separately, promoters plan to sell 11.7% stake with a 3.9% greenshoe option. The company recently secured orders for high-voltage products from Middle East and France.",
            "Sentiment": "neutral",
            "PublishDate": 1729176889000,
            "Source": "corporate_action"
        }
    ]
}