{
    "Symbol": "HAL",
    "ISIN": "INE066F01020",
    "News": [
        {
            "Title": "HAL Reports Strong Q3 FY26 Results, Declares Dividend",
            "Summary": "Hindustan Aeronautics Limited posted impressive Q3 FY26 results with revenue of ₹7,69,887 lakhs and net profit of ₹1,85,172 lakhs. Board declared first interim dividend of ₹35 per share.",
            "Sentiment": "positive",
            "PublishDate": 1770884608676,
            "Source": "co_actions_results"
        },
        {
            "Title": "HAL's LCA Mk1A Fighter Jet Delivery Faces Delays",
            "Summary": "Hindustan Aeronautics Limited faces another deadline miss for indigenous LCA Mk1A fighter jet deliveries, with at least five jets built but not ready for induction beyond May.",
            "Sentiment": "negative",
            "PublishDate": 1770262142915,
            "Source": "stocks"
        },
        {
            "Title": "HAL Board Meeting Set for Feb 12 to Review Q3 Results",
            "Summary": "Hindustan Aeronautics Limited has scheduled a board meeting on February 12, 2026, to consider Q3FY26 audited financial results and declare first interim dividend for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1770204039562,
            "Source": "co_actions_results"
        },
        {
            "Title": "HAL Awaits DRDO Updates on AMCA Fighter Program",
            "Summary": "Hindustan Aeronautics Limited confirms it has not received any updates from DRDO regarding the Advanced Medium Combat Aircraft (AMCA) program development.",
            "Sentiment": "neutral",
            "PublishDate": 1770188121837,
            "Source": "stocks"
        },
        {
            "Title": "HAL Issues Clarification on Defense PSU Stock Movement",
            "Summary": "Hindustan Aeronautics Limited clarifies that defense PSU stock movements exceeding 5% have no significant impact on company's stock price, following earlier clarification dated January 28, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769612261752,
            "Source": "stocks"
        },
        {
            "Title": "HAL Clarifies Pawan Hans Dhruv NG Helicopter Deal Status",
            "Summary": "Hindustan Aeronautics Limited confirms ongoing negotiations with Pawan Hans for 10 Dhruv NG helicopters procurement contract, stating terms and conditions are still being finalized before signing.",
            "Sentiment": "neutral",
            "PublishDate": 1769607552064,
            "Source": "stocks"
        },
        {
            "Title": "HAL Records Rs. 26.97 Crore NSE Block Trade",
            "Summary": "Hindustan Aeronautics Ltd. witnessed a significant block trade on NSE worth Rs. 26.97 crores involving 61,161 shares at Rs. 4409.70 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769572440140,
            "Source": "co_actions_results"
        },
        {
            "Title": "HAL's Dhruv NG Helicopter Takes Inaugural Flight",
            "Summary": "Civil Aviation Minister flags off next-generation Dhruv NG helicopter in Bengaluru. The 5.5-tonne multi-role helicopter features advanced safety systems and configurable cabin for civilian operations.",
            "Sentiment": "positive",
            "PublishDate": 1767074265049,
            "Source": "stocks"
        },
        {
            "Title": "US Embassy Highlights Boeing Apache Helicopters Arrival",
            "Summary": "US Embassy emphasizes arrival of Boeing Apache helicopters as significant progress in US-India defense cooperation, enhancing regional security and boosting collaboration in co-production, training, and technology.",
            "Sentiment": "positive",
            "PublishDate": 1765954830211,
            "Source": "stocks"
        },
        {
            "Title": "HAL Gas Turbine Engine Project Faces Test-Bed Delays",
            "Summary": "Parliamentary committee reports delays in Hindustan Aeronautics' gas turbine engine project due to test-bed approval issues, highlighting infrastructure challenges in defence manufacturing.",
            "Sentiment": "negative",
            "PublishDate": 1765524692573,
            "Source": "stocks"
        },
        {
            "Title": "HAL Cuts Aircraft Delivery Targets Due To Engine Issues",
            "Summary": "Hindustan Aeronautics Limited has reportedly reduced its delivery targets for LCA MK-1A fighter jets and HTT-40 trainer aircraft for FY26 due to ongoing engine supply constraints affecting production schedules.",
            "Sentiment": "negative",
            "PublishDate": 1765518382205,
            "Source": "stocks"
        },
        {
            "Title": "HAL Sees ₹65.89 Cr NSE Block Trade at ₹4,299.50",
            "Summary": "Hindustan Aeronautics Limited witnessed a significant block trade on NSE worth ₹65.89 crores involving 153,244 shares at ₹4,299.50 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1765376315161,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Aeronautics Block Trade Worth Rs. 65.89 Crores Executed on NSE",
            "Summary": "A block trade involving 153,244 shares of Hindustan Aeronautics Ltd was executed on NSE at Rs. 4,299.50 per share, totaling Rs. 65.89 crores. The transaction represents a significant institutional trading activity in the aerospace company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1765343530341,
            "Source": "order&deals"
        },
        {
            "Title": "Defence Secretary Criticizes HAL's Delivery Capabilities",
            "Summary": "The Defence Secretary has publicly stated that Hindustan Aeronautics Limited (HAL) makes commitments that exceed its actual delivery capabilities. This criticism highlights concerns about HAL's operational execution and reliability in meeting defense sector obligations.",
            "Sentiment": "negative",
            "PublishDate": 1764306661918,
            "Source": "stock"
        },
        {
            "Title": "HAL MD Declares Tejas Fighter Aircraft Best in the World",
            "Summary": "Hindustan Aeronautics Limited's Managing Director made a bold statement claiming the indigenous Tejas fighter aircraft is the best aircraft globally. This declaration highlights HAL's confidence in its flagship defense product and could impact the company's marketing efforts for domestic and international aircraft sales.",
            "Sentiment": "positive",
            "PublishDate": 1764305150896,
            "Source": "stock"
        },
        {
            "Title": "HAL Clarifies Dubai Airshow Incident Has No Business Impact",
            "Summary": "Hindustan Aeronautics Limited addressed an incident during an aerial display at the Dubai Airshow, describing it as an isolated occurrence due to exceptional circumstances. The company assured that there is no impact on business operations, financial performance, or future deliveries, and is cooperating with investigating agencies.",
            "Sentiment": "neutral",
            "PublishDate": 1763967320603,
            "Source": "stock"
        },
        {
            "Title": "Indian Air Force Tejas Fighter Jet Crashes at Dubai Air Show",
            "Summary": "An Indian Air Force Tejas fighter jet crashed during the Dubai Air Show, with the incident officially confirmed by military authorities. The crash affects HAL and the Indian Air Force's participation in the international aviation exhibition, with investigation details currently pending.",
            "Sentiment": "negative",
            "PublishDate": 1763721936301,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Aeronautics to Begin Tejas MK1A Fighter Jet Deliveries",
            "Summary": "Hindustan Aeronautics announced it will start delivering 8 Tejas MK1A fighter jets within a 24-36 month timeframe. The delivery schedule affects the company's defense manufacturing operations and represents progress in India's indigenous fighter aircraft program.",
            "Sentiment": "positive",
            "PublishDate": 1763533018534,
            "Source": "stock"
        },
        {
            "Title": "HAL Signs MoU with Russia's UAC for SJ-100 Aircraft Production in India",
            "Summary": "HAL has signed a memorandum of understanding with Russia's United Aircraft Corporation (UAC) in Moscow for the production of the SJ-100 civil commuter aircraft in India. The twin-engine, narrow-body SJ-100 aircraft is currently operational with over 200 units across 16 global airlines. The aircraft production is expected to enhance short-haul connectivity under India's UDAN scheme.",
            "Sentiment": "positive",
            "PublishDate": 1763010557706,
            "Source": "stock"
        },
        {
            "Title": "HAL Reports Half-Year Margins at 24.8%, Below Annual Guidance of 31%",
            "Summary": "HAL reported margins of 24.8% for the half-year period, which is below the company's annual guidance of 31%. This indicates the company's profitability performance is currently trailing its full-year margin expectations.",
            "Sentiment": "negative",
            "PublishDate": 1762939414252,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Aeronautics Reports Mixed Q2 Results with Revenue Growth but Lower EBITDA",
            "Summary": "Hindustan Aeronautics reported Q2 consolidated net profit of 16.7 billion rupees, up from 15 billion rupees year-over-year, though below the estimated 17.5 billion rupees. Revenue increased to 66.3 billion rupees from 60 billion rupees year-over-year, slightly missing the estimate of 67.5 billion rupees. However, EBITDA declined to 15.6 billion rupees from 16.4 billion rupees year-over-year, significantly below the estimated 18.6 billion rupees. The EBITDA margin compressed to 23.50% from 27.44% year-over-year, falling short of the estimated 27.5%.",
            "Sentiment": "neutral",
            "PublishDate": 1762938154548,
            "Source": "earnings"
        },
        {
            "Title": "HAL Announces Board Meeting Date for Q2 Results; Shares Rise 4.23% in Five Sessions",
            "Summary": "Hindustan Aeronautics Ltd. will announce its quarterly and half-year financial results on November 12. The defense aviation company, which manufactures aircraft, helicopters and engines, reported a 9.5% increase in standalone total income to Rs 5,568 crore in Q1, though net profit declined 4% to Rs 1,377.15 crore. The trading window for company securities has been closed since September 30 and will remain closed until November 14. HAL shares have gained 4.23% in the past five trading sessions and are up 16.62% year-to-date. The stock hit a 52-week high of Rs 5,165 on May 16 and a 52-week low of Rs 3,046.05 on March 3.",
            "Sentiment": "neutral",
            "PublishDate": 1762836740385,
            "Source": "earnings"
        },
        {
            "Title": "HAL Signs Agreement with GE for 113 Aircraft Engines Worth $2.4 Billion",
            "Summary": "Hindustan Aeronautics Limited (HAL) entered into an agreement with General Electric Company, USA, for the supply of 113 F404-GE-IN20 engines and support package to power 97 Light Combat Aircraft (LCA) Mk1A units. The engine deliveries are scheduled from 2027 to 2032, supporting the LCA Mk1A programme execution. The main contract for the 97 LCA Mk1A aircraft was signed in September 2025. HAL's stock performance shows mixed results with a 4.35% gain over one year and 10.96% year-to-date returns, though it declined 4.39% in the past month. Shares closed 0.8% higher at Rs 4,626.95 on Friday.",
            "Sentiment": "positive",
            "PublishDate": 1762745311903,
            "Source": "stock"
        },
        {
            "Title": "HAL Signs Engine Supply Deal With GE for 113 Units",
            "Summary": "Hindustan Aeronautics Limited (HAL) has entered into an agreement with General Electric (GE) for the supply of 113 engines. The delivery schedule spans from 2027 to 2032.",
            "Sentiment": "positive",
            "PublishDate": 1762518854233,
            "Source": "order&deals"
        },
        {
            "Title": "Hindustan Aeronautics Signs Moscow Agreement for SJ-100 Aircraft Production in India",
            "Summary": "Hindustan Aeronautics has signed an agreement in Moscow for SJ-100 aircraft production. This marks the first full passenger plane to be manufactured in India. The initiative aims to enhance regional connectivity and create employment opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1761630758981,
            "Source": "stock"
        },
        {
            "Title": "HAL's Tejas Mk1A Completes Maiden Flight as Defence Minister Inaugurates New Production Lines",
            "Summary": "The Tejas Mark 1A fighter aircraft completed its maiden flight from HAL's Nashik facility. Defence Minister Rajnath Singh inaugurated the second production line of the Hindustan Turbo Trainer and the third production line of the Tejas Mark 1A. HAL plans to deliver 83 Tejas Mark 1A aircraft to the Indian Air Force over the next four years, though delays in American engine supply have set the program back by one and a half to two years. The Tejas Mk1A features AESA radar, enhanced electronic warfare systems, mid-air refueling capability, and over 50% indigenous components. HAL secured a Rs 48,000 crore contract in 2021 for 83 Mk1A jets and another Rs 62,370 crore deal in September 2025 for 97 additional aircraft. The Air Force currently operates 29 squadrons following the recent retirement of two MiG-21 squadrons.",
            "Sentiment": "positive",
            "PublishDate": 1760688341113,
            "Source": "stock"
        },
        {
            "Title": "Defence Minister to Launch HAL's Third Tejas Production Line in Nashik",
            "Summary": "The Defence Minister is set to launch Hindustan Aeronautics Limited's (HAL) third production line for Tejas aircraft in Nashik. This represents an expansion of HAL's manufacturing capacity for the indigenous fighter aircraft program.",
            "Sentiment": "positive",
            "PublishDate": 1760673047014,
            "Source": "stock"
        },
        {
            "Title": "HAL Plans to Increase MK1 Production Capacity to 24 Units Per Year",
            "Summary": "Hindustan Aeronautics Limited (HAL) has announced plans to boost its MK1 production capacity to 24 units annually. The aerospace company is looking to expand its manufacturing capabilities for the MK1 aircraft.",
            "Sentiment": "positive",
            "PublishDate": 1760343858086,
            "Source": "stock"
        },
        {
            "Title": "HAL Opens New Nashik Unit With Rs 150 Crore Investment, Rolls Out LCA MK1A Aircraft",
            "Summary": "Hindustan Aeronautics Limited (HAL) has opened a new manufacturing unit in Nashik with an investment of approximately Rs 150 crore. The company has rolled out the LCA MK1A aircraft from this Nashik facility, marking a significant milestone in the company's manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1760343442443,
            "Source": "stock"
        },
        {
            "Title": "HAL's Tejas Mk1A Fighter Jet Scheduled for Maiden Flight on October 17",
            "Summary": "Hindustan Aeronautics Limited (HAL) has scheduled the first flight of its Tejas Mk1A aircraft for October 17 at HAL Nashik. The aircraft features modern capabilities and incorporates high levels of local content, supporting India's domestic defense manufacturing initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1760082827783,
            "Source": "stock"
        },
        {
            "Title": "Government Considers Changes at HAL to Improve Efficiency and Military Delivery Speed",
            "Summary": "The government is considering changes at Hindustan Aeronautics Limited (HAL) aimed at boosting efficiency and accelerating military deliveries. HAL currently holds an order book worth ₹2.7 lakh crore.",
            "Sentiment": "positive",
            "PublishDate": 1759114670140,
            "Source": "stock"
        },
        {
            "Title": "HAL's Order Book Reaches Record ₹2.7 Lakh Crore on Indigenous Tejas Fighter Program Expansion",
            "Summary": "Hindustan Aeronautics Limited (HAL) has achieved a record order backlog of ₹2.7 lakh crore, driven by the Defence Ministry's ₹62,370 crore order for 97 Tejas Mk1A fighter aircraft. The company plans to deliver the first Mk1A aircraft this month and complete deliveries of 188 Tejas aircraft by FY32. HAL has invested ₹2,000 crore to expand production capacity to three lines, with private sector adding a fourth, targeting annual output of 30 jets by 2027. The company has concluded price negotiations with General Electric for 113 F404-IN20 engines worth over $1 billion, with contract signing expected by October and deliveries beginning in 2027-28. HAL is also pursuing future projects including LCA Mk2 and Advanced Medium Combat Aircraft (AMCA), with 28 entities expressing interest in collaboration on the fifth-generation AMCA programme.",
            "Sentiment": "positive",
            "PublishDate": 1758823519139,
            "Source": "stock"
        },
        {
            "Title": "HAL Shares Rise 2% on Rs 62,370 Crore Defence Contract for 97 Tejas Mk-1A Jets",
            "Summary": "Hindustan Aeronautics Limited (HAL) shares surged 2.2% to Rs 4,827.95 after the Ministry of Defence signed a Rs 62,370 crore contract for 97 Tejas Mk-1A fighter jets. The contract includes 68 fighter variants and 29 twin-seater aircraft, with deliveries scheduled to begin in 2027-28. This represents HAL's second major order, following a Rs 48,000 crore deal for 83 jets in February 2021. The Mk-1A variant features over 64% indigenous content and will replace the Indian Air Force's aging MiG-21 fleet. The IAF currently operates 31 fighter squadrons, below the sanctioned strength of 42. The multi-role aircraft is designed for air defence, strike, and maritime reconnaissance operations.",
            "Sentiment": "positive",
            "PublishDate": 1758801158512,
            "Source": "stock"
        },
        {
            "Title": "HAL to Sign ₹67,000 Crore Tejas Mk-1A Fighter Jet Deal; CLSA Maintains Outperform Rating",
            "Summary": "HAL shares rose 2% after three consecutive sessions of losses as the Ministry of Defence prepares to sign a ₹67,000 crore contract for 97 Tejas Mark-1A fighter jets. The acquisition proposal was approved in August, with the commercial contract set to be finalized. This follows a previous ₹47,000 crore contract for 83 Tejas fighters signed in February 2021. CLSA maintains an 'Outperform' rating with a price target of ₹5,436, noting HAL achieved a milestone with the first flight of the 13th LCA Mk 1A aircraft, exceeding its target of 12 deliveries. GE has committed to delivering 12 engines in 2025 and 20 in 2026. The new order could add 35% to HAL's existing $22 billion backlog, with the company's decadal pipeline at $54 billion. CLSA views the large fighter aircraft order and GE engine deal visibility as major catalysts for HAL.",
            "Sentiment": "positive",
            "PublishDate": 1758778600502,
            "Source": "order&deals"
        },
        {
            "Title": "Defence Minister to Sign Contract for 97 Tejas Mark-1A Fighter Jets with HAL",
            "Summary": "The Defence Minister will officially sign a contract with Hindustan Aeronautics Limited (HAL) for 97 Tejas Mark-1A fighter jets. The contract signing is scheduled to take place today.",
            "Sentiment": "positive",
            "PublishDate": 1758777564085,
            "Source": "order&deals"
        },
        {
            "Title": "India Reviews Purchase of Two Squadrons of Russian Su-57 Aircraft",
            "Summary": "India is considering the purchase of two squadrons of Su-57 aircraft from Russia. The country will also assess a proposal for local production of these aircraft through HAL (Hindustan Aeronautics Limited).",
            "Sentiment": "neutral",
            "PublishDate": 1758606025204,
            "Source": "stock"
        },
        {
            "Title": "HAL's Tejas Jet Deliveries Face Delays Due to Engine Supply Shortage from General Electric",
            "Summary": "Hindustan Aeronautics Ltd faces delivery delays for its Tejas fighter jets due to engine supply shortfalls from US-based General Electric. HAL's Chief Managing Director Dr DK Sunil confirmed that five aircraft are built and ready for delivery, with one undergoing flight trials, but the company is waiting for engines. The third engine from GE arrived recently and is being fitted. HAL promised to deliver 12 aircraft this financial year, though this depends on GE supplies, with a worst-case scenario of 10 deliveries. The company has also experienced minor software issues and missile firing problems, which are expected to be resolved this month. GE has committed to speeding up the supply process and provided special safety checks following a past crash.",
            "Sentiment": "neutral",
            "PublishDate": 1758103461133,
            "Source": "stock"
        },
        {
            "Title": "India Plans to Finalize 114 Rafale Jets Deal Next Year with Ready-to-Fly Delivery Option",
            "Summary": "India is planning to finalize a deal for 114 Rafale fighter jets as early as next year. The agreement includes provisions for some aircraft to be delivered in ready-to-fly condition. HAL (Hindustan Aeronautics Limited) is mentioned in connection with this defense procurement plan.",
            "Sentiment": "positive",
            "PublishDate": 1758084857070,
            "Source": "stock"
        },
        {
            "Title": "Defense Minister Says GE Engine Deal Unaffected by Trade Tensions",
            "Summary": "The Defense Minister announced that there are no problems with the GE engine deal despite ongoing trade tensions. The minister stated that trade issues will not impact the defense sector, specifically mentioning Hindustan Aeronautics Limited (HAL).",
            "Sentiment": "positive",
            "PublishDate": 1757662664074,
            "Source": "stock"
        },
        {
            "Title": "HAL Receives Third GE-404 Engine from U.S. for LCA Mark-1A Fighter Jet Project",
            "Summary": "Hindustan Aeronautics Limited (HAL) has received the third GE-404 engine from the United States for its LCA Mark-1A fighter jet project. This delivery represents continued progress in HAL's aircraft development program involving U.S.-supplied engines.",
            "Sentiment": "positive",
            "PublishDate": 1757565580559,
            "Source": "stock"
        },
        {
            "Title": "HAL Signs Technology Transfer Agreement for Small Satellite Launch Vehicle with ISRO, IN-SPACe, and NSIL",
            "Summary": "Hindustan Aeronautics Limited (HAL) signed a technology transfer agreement with ISRO, IN-SPACe, and NSIL for the Small Satellite Launch Vehicle (SSLV) on September 10, 2025, in Bengaluru. The SSLV is a three-stage vehicle designed to launch satellites weighing less than 500 kg into Lower Earth Orbit. Under the agreement, HAL will absorb the technology over the first two years, followed by a 10-year production phase. HAL receives a non-exclusive, non-transferable license covering comprehensive design, manufacturing, quality control, integration, launch operations, and post-flight analysis documentation, plus training and support. The company will be responsible for mass production of SSLV to meet Indian and global demands. This transfer enables HAL to transition from a component supplier to a comprehensive launch service provider, allowing the company to build, own and operate the launch vehicle as part of establishing a dedicated space vertical.",
            "Sentiment": "positive",
            "PublishDate": 1757482139737,
            "Source": "stock"
        },
        {
            "Title": "HAL Addresses Dhruv Helicopter Safety Issues, Works With Indian Army On Fleet-Wide Checks",
            "Summary": "Hindustan Aeronautics Ltd. is collaborating with the Indian Army to investigate glitches in the Dhruv advanced light helicopter fleet. The company confirmed a one-time maintenance check was issued following a defect in the Tail Drive Shaft, which transfers engine power to the tail rotor and affects helicopter directional stability. An incident occurred on Thursday, prompting the Directorate General of Electronics & Mechanical Engineers (Aviation) to order priority safety checks across all units, including air force and navy helicopters. The Dhruv helicopter has been involved in approximately 15 accidents over the past five years. HAL emphasized that the ALH Dhruv fleet has accumulated over 450,000 flight hours and served for more than two decades across Indian Armed Forces, Coast Guard, and civil operators. The company stressed the importance of following all maintenance directives for continued airworthiness.",
            "Sentiment": "negative",
            "PublishDate": 1757232476480,
            "Source": "stock"
        },
        {
            "Title": "HAL Expected to Deliver First Two Tejas Mark-1A Jets Next Month",
            "Summary": "Hindustan Aeronautics Ltd (HAL) is expected to deliver two Tejas Mark-1A fighter jets by the end of September with weapons integration, according to Defence Secretary R K Singh. The government plans to sign a fresh contract for an additional 97 Tejas jets worth Rs 67,000 crore after these deliveries, but only after HAL demonstrates a complete package. Currently, 38 Tejas jets are in service with another 80-odd being manufactured under a Rs 48,000 crore contract for 83 jets signed in February 2021. Delivery delays have occurred primarily due to US defense company GE Aerospace missing deadlines for engine supplies. The Indian Air Force has raised concerns about these delays and currently operates 31 fighter squadrons against a sanctioned strength of 42. The single-engine Mk-1A jets will replace the IAF's MiG-21 fighters and are designed for air defense, maritime reconnaissance and strike roles.",
            "Sentiment": "neutral",
            "PublishDate": 1756624645638,
            "Source": "stock"
        },
        {
            "Title": "India to Sign $1 Billion Deal with GE for 113 Fighter Jet Engines",
            "Summary": "India is set to sign a $1 billion agreement with General Electric for the supply of 113 fighter jet engines. The deal involves Hindustan Aeronautics Limited (HAL) and is expected to be finalized next month.",
            "Sentiment": "positive",
            "PublishDate": 1756264232480,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Aeronautics Ltd Announces Retirement of General Manager P Mallikarjuna Rao",
            "Summary": "Hindustan Aeronautics Ltd announced the retirement of Shri P Mallikarjuna Rao, General Manager (IMM), effective August 31, 2025, due to superannuation. The company informed stock exchanges BSE and NSE about this senior management change through a regulatory filing.",
            "Sentiment": "neutral",
            "PublishDate": 1756118627615,
            "Source": "corporate_governance"
        },
        {
            "Title": "India Partners with Safran to Manufacture Fifth-Generation Fighter Jet Engines",
            "Summary": "Defence Minister Rajnath Singh announced India will begin manufacturing engines for fifth-generation fighter jets in collaboration with French aerospace company Safran. This initiative is part of India's broader goal to develop indigenous fifth-generation fighter aircraft capabilities. Singh also revealed that India recently placed a new order with HAL to manufacture 97 Tejas fighter planes at approximately ₹66,000 crore, following a previous order for 83 aircraft worth ₹48,000 crore. Safran currently manufactures engines for fighter aircraft including the Mirage and Dassault Rafale jets. Singh acknowledged challenges in the endeavour but expressed confidence in establishing full fighter aircraft manufacturing capabilities in India.",
            "Sentiment": "positive",
            "PublishDate": 1755874781265,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Aeronautics Expected to Receive Large Order Boost",
            "Summary": "Hindustan Aeronautics Ltd., the state-run defence equipment manufacturer, is likely to receive a large order that would boost its order book guidance for the full year. The article mentions five major triggers ahead for the defence PSU, though specific details of these triggers are not provided in the available content.",
            "Sentiment": "positive",
            "PublishDate": 1755771191353,
            "Source": "stock"
        },
        {
            "Title": "HAL Stock Recovers After CCS Approves ₹62,000 Crore Order for 97 LCA Mk-1A Jets",
            "Summary": "Hindustan Aeronautics Ltd. (HAL) shares recovered from early losses to trade higher at ₹4,498.80 after the Cabinet Committee on Security approved procurement of 97 Light Combat Aircraft Mk-1A jets valued at ₹62,000 crore for the Indian Air Force. This marks HAL's second MK1A order following one received in February 2021. The LCA Mark1A is an upgraded version of the Tejas fighter jet designed to replace aging MiG-21 aircraft. UBS maintains a 'Neutral' rating with a ₹4,900 price target, expecting deliveries to begin with 6 jets in the current financial year. Among 22 analysts covering HAL, 17 recommend 'Buy', 3 suggest 'Hold', and 2 advise 'Sell'. The stock has gained 7% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1755750202662,
            "Source": "stock"
        },
        {
            "Title": "HAL Successfully Tests Agni 5 Intermediate Range Ballistic Missile",
            "Summary": "Hindustan Aeronautics Limited (HAL) has successfully conducted tests of the Agni 5 intermediate range ballistic missile, according to the Indian Government. The test represents a milestone in the country's defense capabilities and HAL's role in missile development programs.",
            "Sentiment": "positive",
            "PublishDate": 1755708316989,
            "Source": "stock"
        },
        {
            "Title": "HAL Announces Rs 15 Final Dividend with August 20 Last Purchase Date",
            "Summary": "Hindustan Aeronautics Ltd. set August 20 as the last day for investors to buy shares to qualify for its final dividend of Rs 15 per share for financial year 2024-25. The record date is August 21, with the company distributing Rs 1,003 crore total dividends. The central government, holding 71.64% stake, will receive Rs 718.6 crore, while over 13 lakh retail investors will get nearly Rs 70 crore. This marks HAL's second dividend for fiscal 2025, following an interim dividend of Rs 25 per share paid in February. The company paid a final dividend of Rs 13 per share in fiscal 2024. HAL shares closed 1.4% lower at Rs 4,514.3, with the stock up 6.6% over 12 months but down 6% year-to-date. The company has a dividend yield of 0.9%.",
            "Sentiment": "positive",
            "PublishDate": 1755657602206,
            "Source": "corporate_action"
        }
    ]
}