{
    "Symbol": "HALDER",
    "ISIN": "INE115S01010",
    "News": [
        {
            "Title": "Halder Venture Shares to List on NSE January 2026",
            "Summary": "Halder Venture Limited announces listing of 1,24,38,135 equity shares on NSE starting January 19, 2026, marking company's entry into public trading.",
            "Sentiment": "positive",
            "PublishDate": 1768401482271,
            "Source": "co_actions_results"
        },
        {
            "Title": "Halder Venture Limited Responds to BSE Price Movement Inquiry, Cites Bonus Share Allotment",
            "Summary": "Halder Venture Limited clarified to BSE that it has made all necessary disclosures and has not withheld any material information regarding significant price movement in its equity shares. The company issued and allotted 82,92,090 bonus equity shares in a 2:1 ratio to eligible members as of September 02, 2025 record date, with BSE adjusting prices accordingly for the bonus issue.",
            "Sentiment": "neutral",
            "PublishDate": 1764392739552,
            "Source": "corporate_action"
        },
        {
            "Title": "Koustuv Halder Receives 385,500 Shares of Halder Venture Limited Through Transmission Following Rekha Haldar's Death",
            "Summary": "Koustuv Halder disclosed the transmission of 385,500 shares of Halder Venture Limited from the demat account of Rekha Haldar following her death. The shares were transmitted on September 8, 2025, as Halder was the nominee of Rekha Haldar's demat account. Following the transmission, Halder's total shareholding in Halder Venture Limited increased to 415,500 shares, representing 3.3405% of the company's total voting capital. Both Rekha Haldar and Koustuv Halder are promoters of Halder Venture Limited. The company's total equity share capital remains unchanged at 12,43,81,350 shares. The depository participant confirmed completion of the transmission process and closure of Rekha Haldar's demat account on September 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758007945866,
            "Source": "corporate_action"
        },
        {
            "Title": "Halder Venture Limited Reports Share Transmission Between Promoters Following Demise",
            "Summary": "Halder Venture Limited disclosed a change in shareholding due to transmission of shares from Mrs. Rekha Haldar to Mr. Keshab Kumar Halder, both promoters. The transmission occurred following Mrs. Rekha Haldar's demise and the closure of demat account IN30400410001697. The company completed necessary formalities and received confirmation from the Depository Participant via email dated 10-09-2025. The disclosure was made under Regulation 29(2) of SEBI (Substantial Acquisition of Shares and Takeovers) Regulations, 2011.",
            "Sentiment": "neutral",
            "PublishDate": 1757671823531,
            "Source": "corporate_action"
        },
        {
            "Title": "Halder Venture Limited Revises Record Date for 2:1 Bonus Issue to September 2, 2025",
            "Summary": "Halder Venture Limited has revised the record date for its bonus issue of equity shares to Tuesday, September 2, 2025, from the previously announced date of Monday, September 1, 2025. The bonus issue maintains a 2:1 ratio, where shareholders will receive 2 new fully paid-up equity shares of ₹10 each for every 1 existing fully paid-up equity share of ₹10 each. The revision was made following communication from BSE on August 28, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1756360314738,
            "Source": "corporate_action"
        },
        {
            "Title": "Halder Venture Limited Shareholders Approve Bonus Share Issuance and Articles Alteration via Postal Ballot",
            "Summary": "Halder Venture Limited completed a postal ballot through remote e-voting, with shareholders approving two key resolutions. The company passed a special resolution for alteration of Articles of Association and an ordinary resolution for issuance of bonus shares, both receiving the requisite majority. The remote e-voting process concluded on August 26, 2025, at 5:00 PM IST. Mr. Manoj Kumar Shaw, a Practicing Company Secretary, served as the appointed Scrutinizer and submitted his report confirming the results. The voting results and Scrutinizer's report are available on the company's website and National Securities Depository Limited's website.",
            "Sentiment": "positive",
            "PublishDate": 1756218208958,
            "Source": "corporate_action"
        },
        {
            "Title": "Halder Venture Limited Reports Quarterly Results and Board Decisions",
            "Summary": "Halder Venture Limited's board approved standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs. 70,671.66 lakhs and net profit of Rs. 489.04 lakhs for the quarter. On a consolidated basis, revenue from operations was Rs. 74,698.61 lakhs with net profit of Rs. 285.87 lakhs. The board reappointed Gautam K Dutta and Associates as Internal Auditor for financial year 2025-2026. The company operates in two segments - Rice and Edible Oil. A bonus share issue in 2:1 ratio has been approved with record date of September 1, 2025, subject to shareholder approval in an ongoing postal ballot concluding August 26, 2025. The company acquired Haldia Manufacturing Unit of K.S. Oil Limited with effect from March 28, 2025, with the acquisition amount of Rs. 6,391.85 lakhs recorded as Capital Advance.",
            "Sentiment": "neutral",
            "PublishDate": 1755104725426,
            "Source": "earnings"
        },
        {
            "Title": "Halder Venture Limited Seeks Shareholder Approval for Bonus Share Issue and Articles Amendment",
            "Summary": "Halder Venture Limited has issued a postal ballot notice seeking shareholder approval for two key resolutions. The company proposes to issue bonus shares in a 2:1 ratio, where shareholders will receive 2 new bonus equity shares of Rs. 10 each for every 1 existing equity share held. The record date for determining eligible shareholders is September 1, 2025. Additionally, the company seeks approval to amend its Articles of Association, including modifications to director remuneration provisions and adding a new clause to facilitate capitalization of profits and reserves for bonus share issuance. The e-voting period runs from July 28 to August 26, 2025, with results to be declared by August 28, 2025. The bonus shares will be issued using funds from the securities premium account and will rank equally with existing shares. Shareholders holding shares in physical form will have their bonus shares transferred to a Demat Suspense Account as per SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1753429933137,
            "Source": "corporate_action"
        },
        {
            "Title": "Halder Venture Limited Clarifies Timely Disclosure of CRISIL Credit Rating Update to BSE",
            "Summary": "Halder Venture Limited responded to BSE's query regarding compliance with material event disclosure regulations. The company clarified that it received a credit rating letter from CRISIL Ratings Limited on June 30, 2025 at 8:32 PM and communicated it to the exchange on July 1, 2025 at 5:56 PM, which was within the statutory timeline. CRISIL had reviewed and reaffirmed Halder Venture's long-term rating at BBB- with a positive outlook (revised from stable) for total bank loan facilities of Rs. 387.27 crores (enhanced from Rs. 50 crores). The rating letter remains valid until March 31, 2026. The company's bank facilities include cash credit lines with Bank of India (Rs. 75 crores) and ICICI Bank Limited (Rs. 15 crores), along with proposed fund-based bank limits.",
            "Sentiment": "neutral",
            "PublishDate": 1753269847668,
            "Source": "corporate_action"
        },
        {
            "Title": "Halder Venture Limited Board Approves 2:1 Bonus Share Issue and Articles Amendment",
            "Summary": "Halder Venture Limited's board has approved the issuance of bonus shares in a 2:1 ratio, meaning shareholders will receive 2 new equity shares of ₹10 each for every 1 existing share held. The bonus issue is subject to shareholder approval through postal ballot and will be funded from the company's securities premium account. The record date for determining bonus share entitlement is set for September 1, 2025. Based on the board approval date, approximately 82.92 lakh bonus shares worth ₹82.92 crore will be issued, though the final number will depend on the paid-up capital on the record date. The company's issued and paid-up capital will increase from ₹41.46 crore to approximately ₹124.38 crore post-bonus issue. The board also approved alterations to the Articles of Association, including provisions for director remuneration and capitalization of profits and reserves. Bonus shares are expected to be credited within two months of board approval, by September 22, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753264422390,
            "Source": "corporate_action"
        }
    ]
}