{
    "Symbol": "HALEOSLABS",
    "ISIN": "INE320X01016",
    "News": [
        {
            "Title": "Haleos Labs Receives ₹87.58 Lakh Demand Notice from Telangana Power Distribution Company",
            "Summary": "Haleos Labs Limited received a demand notice for ₹87,58,901 towards CSS amount for the period from April 2015 to June 2016 from Southern Power Distribution Company of Telangana Limited. The company stated there is no material impact on its financial or operational activities and will pursue all legal remedies while making suitable representations before appropriate authorities.",
            "Sentiment": "negative",
            "PublishDate": 1765028078520,
            "Source": "stock"
        },
        {
            "Title": "Haleos Labs Limited Adopts New Logo Following Company Name Change",
            "Summary": "Haleos Labs Limited's Board of Directors approved the adoption of a new logo through circular resolution dated November 25, 2025, following the company's name change from SMS Lifesciences India Limited. The company unveiled its refreshed brand identity to reflect a distinctive presence and renewed commitment to excellence in the industry.",
            "Sentiment": "neutral",
            "PublishDate": 1764075662486,
            "Source": "corporate_action"
        },
        {
            "Title": "Haleos Labs Reports 33% Rise in Net Profit for Q2 FY2026",
            "Summary": "Haleos Labs Limited (formerly SMS Lifesciences India Limited) reported a net profit of Rs 497.77 lakhs for the quarter ended September 30, 2025, compared to Rs 600.83 lakhs in the same quarter last year. Revenue from operations declined to Rs 7,784.38 lakhs from Rs 7,849.62 lakhs year-over-year. For the half-year period, net profit reached Rs 1,013.54 lakhs versus Rs 1,246.82 lakhs in the previous year, while revenue decreased to Rs 15,688.63 lakhs from Rs 16,506.68 lakhs. The company's name was officially changed from SMS Lifesciences India Limited to Haleos Labs Limited effective August 21, 2025. The pharmaceutical company manufactures Active Pharmaceutical Ingredients and their intermediates. Basic earnings per share for the quarter stood at Rs 16.46 compared to Rs 19.87 in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762805710544,
            "Source": "earnings"
        },
        {
            "Title": "Haleos Labs Temporarily Withholds Dividend Payments Due to Incomplete KYC Details",
            "Summary": "Haleos Labs Limited (formerly SMS Lifesciences India Limited) has temporarily withheld dividend payments to shareholders who have not updated their KYC details or have incorrect bank account information. The company approved a dividend of 15% (₹1.50 per equity share of ₹10 each) for financial year 2024-25 at their 19th Annual General Meeting held on September 30, 2025, with a record date of September 24, 2025. The dividend withholding affects shareholders due to non-updation of KYC details including PAN, address, email ID, mobile number, or bank mandate, and rejection of dividend payments by banks due to incorrect bank account details. The company has sent individual letters to affected shareholders on November 6, 2025, informing them that dividends will be released only upon compliance with KYC requirements as per SEBI regulations. Shareholders need to submit required documents to the company's Registrar and Share Transfer Agent, Aarthi Consultants Private Limited, or update details with their Depository Participant for electronic shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1762461493359,
            "Source": "corporate_action"
        },
        {
            "Title": "Haleos Labs Limited Completes Brazilian Health Authority Audit of API Manufacturing Facility",
            "Summary": "Haleos Labs Limited announced that its API manufacturing facility in Telangana has successfully completed an inspection by the Brazilian Health Authority (ANVISA) conducted from September 22-26, 2025. The company stated this inspection reaffirms compliance with international quality standards and creates opportunities for entry into Brazil, described as the largest pharmaceutical market in South America. The company was formerly known as SMS Lifesciences India Limited and is currently in the process of adopting the new name in compliance with regulatory requirements.",
            "Sentiment": "positive",
            "PublishDate": 1758888314333,
            "Source": "stock"
        },
        {
            "Title": "SMS Lifesciences Sets September 24, 2025 Record Date for Dividend and AGM Voting Rights",
            "Summary": "SMS Lifesciences India Limited has fixed September 24, 2025 as the record date for determining shareholder eligibility for dividend payments for 2024-25 and voting rights at the 19th Annual General Meeting scheduled for September 30, 2025 at 3:00 pm. The dividend, if approved by shareholders, will be paid within 30 days subject to tax deduction at source through direct bank account credits. The company has launched the 'Saksham Niveshak' 100-day campaign running from July 28 to November 6, 2025, aimed at reducing unclaimed dividends by facilitating KYC updates, bank mandate registrations, and claims for unpaid dividends from 2018-19 to 2023-24. The initiative seeks to prevent transfer of shares and dividends to the Investor Education and Protection Fund Authority by encouraging shareholders to update records and claim entitlements directly from the company.",
            "Sentiment": "neutral",
            "PublishDate": 1756384367458,
            "Source": "corporate_action"
        },
        {
            "Title": "SMS Lifesciences India Reports Quarterly Results and Schedules Annual General Meeting",
            "Summary": "SMS Lifesciences India Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 7,904.27 lakhs compared to Rs 8,657.06 lakhs in the same quarter last year. Net profit decreased to Rs 515.77 lakhs from Rs 645.99 lakhs year-over-year. Earnings per share stood at Rs 17.06 versus Rs 21.37 in the previous year quarter. On a consolidated basis, revenue from operations was Rs 8,250.46 lakhs against Rs 9,254.82 lakhs in the corresponding quarter of the previous year. The company scheduled its 19th Annual General Meeting for September 30, 2025, to be conducted through video conferencing. The Board also approved various policies including Code of Conduct for Prevention of Insider Trading and Policy on determination of material events information.",
            "Sentiment": "negative",
            "PublishDate": 1754906127293,
            "Source": "earnings"
        },
        {
            "Title": "SMS Lifesciences India Shareholders Approve Six Resolutions Including Name Change and Executive Director Reappointment",
            "Summary": "SMS Lifesciences India Limited announced the results of a postal ballot conducted from July 1-30, 2025, where shareholders approved six resolutions through e-voting. The approved resolutions include: change of company name with amendments to corporate documents, reappointment of Mr. TV Praveen as Executive Director for three years, increases in individual and overall managerial remuneration limits for executive directors, and approval of material related party transactions for both the company and its material subsidiary for 2025-26. All resolutions passed with requisite majority, with most receiving over 99% approval from voting shareholders. The postal ballot process was scrutinized by C. Sudhir Babu, and results were deemed effective from July 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754034777416,
            "Source": "corporate_action"
        },
        {
            "Title": "SMS Lifesciences Opens Special Window for Physical Share Transfer Re-lodgment",
            "Summary": "SMS Lifesciences India Limited has opened a special window for re-lodgment of physical share transfer requests that were previously rejected, returned, or not processed due to documentation deficiencies. The facility is available from July 7, 2025 to January 6, 2026, and applies only to transfer deeds originally lodged before April 1, 2019. Re-lodgment will be processed only in dematerialized form during this period. The company has also reminded shareholders to claim their unclaimed dividends, warning that both dividends and corresponding shares will be transferred to the Investor Education & Protection Fund Authority if not claimed within 7 years. Eligible shareholders can submit their requests to the company's Registrar & Transfer Agent, Aarthi Communication Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1753258137009,
            "Source": "corporate_action"
        },
        {
            "Title": "SMS Lifesciences Receives VAI Status from USFDA for API Facility",
            "Summary": "SMS Lifesciences has received Voluntary Action Indicated (VAI) status from the United States Food and Drug Administration (USFDA) for its Active Pharmaceutical Ingredient (API) manufacturing facility located in Telangana, India. This status indicates that the facility has minor issues that need to be addressed, but is generally compliant with good manufacturing practices.",
            "Sentiment": "positive",
            "PublishDate": 1752647668000,
            "Source": "default"
        },
        {
            "Title": "SMS Lifesciences Plans ₹145 Crore Investment for API Production Expansion",
            "Summary": "SMS Lifesciences has announced a ₹145 crore investment plan aimed at increasing production in specialized APIs. The company is focusing on backward integration and USFDA-compliant manufacturing to achieve global leadership in its sector by FY28. This investment strategy is designed to enhance the company's capabilities in producing specialized active pharmaceutical ingredients.",
            "Sentiment": "positive",
            "PublishDate": 1752510305000,
            "Source": "default"
        },
        {
            "Title": "SMS Lifesciences India Reports Q4 Financial Results",
            "Summary": "SMS Lifesciences India has reported its quarterly financial results. The company's net profit for Q4 was 30 million rupees, compared to 59 million rupees in the same quarter last year, showing a year-over-year decrease. Revenue for Q4 was 891 million rupees, slightly down from 900 million rupees in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748519927000,
            "Source": "result"
        },
        {
            "Title": "USFDA Inspection of SMS Lifesciences India's API Facility Concludes",
            "Summary": "The United States Food and Drug Administration (USFDA) has completed an inspection of SMS Lifesciences India's Active Pharmaceutical Ingredient (API) manufacturing facility located in Telangana. The inspection resulted in one observation.",
            "Sentiment": "neutral",
            "PublishDate": 1746783529000,
            "Source": "default"
        }
    ]
}