{
    "Symbol": "HAPPYFORGE",
    "ISIN": "INE330T01021",
    "News": [
        {
            "Title": "Happy Forgings Q3FY26 Monitoring Report Filed",
            "Summary": "Happy Forgings Limited submitted its Q3FY26 monitoring agency report by ICRA Limited, showing no deviation from IPO objects with ₹76.469 crore remaining unutilized for equipment purchases.",
            "Sentiment": "neutral",
            "PublishDate": 1770632105252,
            "Source": "stocks"
        },
        {
            "Title": "Happy Forgings Q3FY26 Results: Strong Growth Continues",
            "Summary": "Happy Forgings Limited reports robust Q3FY26 performance with revenue of ₹39,130.70 lacs and net profit of ₹7,894.68 lacs. Company also announces ₹32 crore land acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1770630831818,
            "Source": "co_actions_results"
        },
        {
            "Title": "Happy Forgings secures 80-acre land lease for solar plant",
            "Summary": "Happy Forgings Limited executed a long-term lease agreement for approximately 80 acres in Muktsar, Punjab, to establish a solar power plant under a 29-year and 11-month lease term.",
            "Sentiment": "positive",
            "PublishDate": 1768304703066,
            "Source": "stocks"
        },
        {
            "Title": "Happy Forgings Allots 23,651 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Happy Forgings Limited allotted 23,651 equity shares to employees through its Employee Stock Options Scheme exercise. The company's paid-up share capital increased from Rs. 18,86,08,540 to Rs. 18,86,55,842, with total equity shares rising to 9,43,27,921 shares of Rs. 2 each.",
            "Sentiment": "positive",
            "PublishDate": 1764675574862,
            "Source": "corporate_action"
        },
        {
            "Title": "Happy Forgings Reports Strong Q2 Performance with 60% Gross Margin Despite Export Challenges",
            "Summary": "Happy Forgings Limited delivered robust quarterly results with revenue of INR 377 crores, reflecting 4.5% year-on-year growth. The company achieved its highest quarterly gross margin of around 60% and EBITDA margin of approximately 31%. Gross profit grew 7% to INR 228 crores, while EBITDA increased 10% to INR 116 crores. Profit after tax grew 10% on adjusted basis to INR 73 crores. Domestic market drove growth across commercial vehicles, farm, industrial and passenger vehicle sectors, while export volumes remained low due to global market weakness and U.S. tariff uncertainties. The company maintains strong balance sheet with cash liquidity of approximately INR 315 crores and debt-equity ratio below 0.1. Management is progressing with INR 650 crores strategic capex program and has secured INR 350 crores of annual orders for new infrastructure. Commercial vehicles contributed 37% of revenue in H1 FY26, farm equipment 34%, passenger vehicles 5%, off-highway 10%, and industrials 13%.",
            "Sentiment": "positive",
            "PublishDate": 1763025552898,
            "Source": "earnings"
        },
        {
            "Title": "Happy Forgings Limited Makes Earnings Call Recording Available",
            "Summary": "Happy Forgings Limited has made the audio recording of its earnings conference call available on its website. The earnings call discussed financial results for the quarter and half year ended September 30, 2025, and was held on November 7, 2025. The recording can be accessed through a link provided on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1762507736952,
            "Source": "earnings"
        },
        {
            "Title": "Happy Forgings Limited Pays Fine for Non-Compliance with Nomination and Remuneration Committee Requirements",
            "Summary": "Happy Forgings Limited received notices from BSE and NSE regarding non-compliance with Regulation 19(1) and 19(2) of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, related to the composition of the Nomination and Remuneration Committee for the quarter ended June 2025. The company was fined Rs. 14,160 (including 18% GST) by both exchanges. Happy Forgings' Board of Directors acknowledged that the non-compliance was not willful and confirmed the fine has been paid. The company stated it has undertaken necessary steps to strengthen its processes to avoid such inadvertent delays in the future.",
            "Sentiment": "negative",
            "PublishDate": 1762479928768,
            "Source": "corporate_governance"
        },
        {
            "Title": "Happy Forgings Reports Strong Q2 Performance with 73% Revenue Growth",
            "Summary": "Happy Forgings Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported total income of Rs 383.36 crores compared to Rs 336.41 crores in the previous quarter, representing significant growth. Net profit for the quarter stood at Rs 73.36 crores versus Rs 27.14 crores in the prior quarter. For the half-year period, total income reached Rs 719.77 crores compared to Rs 647.28 crores in the previous year, while net profit increased to Rs 100.50 crores from Rs 36.76 crores. The company paid a final dividend of Rs 3 per share for FY2024-25, totaling Rs 25.90 crores. Happy Forgings utilized Rs 94.66 crores from IPO proceeds for equipment and machinery purchases, with Rs 76.47 crores remaining unutilized and temporarily invested in fixed deposits. The company operates in auto components and engineering parts manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1762424005252,
            "Source": "earnings"
        },
        {
            "Title": "Happy Forgings Reports Growth in Q2 Financial Performance",
            "Summary": "Happy Forgings reported Q2 EBITDA of 1.16 billion rupees compared to 1.05 billion rupees year-over-year. The company's EBITDA margin improved to 30.7% from 29.2% in the same period last year. Net profit increased to 734 million rupees from 714 million rupees year-over-year, while revenue grew to 3.8 billion rupees from 3.6 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762422356443,
            "Source": "earnings"
        },
        {
            "Title": "Happy Forgings Reports 3.6% Revenue Growth to Rs. 354 Crores with Margin Stability",
            "Summary": "Happy Forgings Limited reported revenue from operations of Rs. 354 crores, up 3.6% year-over-year for the quarter ended June 30, 2025. The company maintained EBITDA margin at 28.6% (Rs. 101 crores) and PAT margin at 18.6% (Rs. 66 crores). Volume increased 3.8% to 14,457 MT while realization remained flat at Rs. 245 per kg despite raw material price corrections. The commercial vehicles segment (39% of revenue) faced mid-single digit decline, while farm equipment (32% of revenue) showed better-than-overall growth. The company invested Rs. 110 crores in new machining lines and announced a Rs. 650 crore CAPEX plan for heavyweight precision components. New order wins include Rs. 250 crores from European farm equipment OEM, Rs. 300 crores for wind energy components, and Rs. 180 crores annually for data center applications. Management expects medium-term growth of 15-18% and anticipates domestic CV and farm equipment segments to show high single-digit growth.",
            "Sentiment": "positive",
            "PublishDate": 1755499799229,
            "Source": "earnings"
        },
        {
            "Title": "Happy Forgings Limited Makes Q1 FY2026 Earnings Call Recording Available",
            "Summary": "Happy Forgings Limited has made the audio recording of its Q1 FY2026 earnings conference call available on its website. The earnings call was held on August 11, 2025, covering the quarter ended June 30, 2025. The company filed this information with the National Stock Exchange of India Ltd. and BSE Ltd. The audio recording can be accessed through the company's website link provided in the regulatory filing.",
            "Sentiment": "neutral",
            "PublishDate": 1754913958506,
            "Source": "earnings"
        },
        {
            "Title": "Happy Forgings Reports 3.6% Revenue Growth to Rs 354 Crores in Q1 FY26",
            "Summary": "Happy Forgings Limited reported revenue of Rs 354 crores for Q1 FY26, representing a 3.6% year-on-year increase. EBITDA grew 3.6% to Rs 101 crores while PAT rose 3.0% to Rs 66 crores. The company maintained stable EBITDA margins at 28.6% and improved gross profit margins by 140 basis points to 57.9%. Finished goods volume increased 3.8% to 14,457 MT with realization per kg remaining stable at Rs 245. The forging capacity utilization improved from 57% to 59% while machining capacity utilization decreased from 83% to 77%. The company plans Rs 80 crores capex in FY26 for passenger vehicle segment scaling and Rs 650 crores for heavy forgings capacities by FY27. Management noted resilient performance despite headwinds in end-user industries and deflationary steel prices, with healthy domestic demand in passenger vehicles, farm equipment, and industrial segments, though exports were impacted by sluggish demand and tariff uncertainties.",
            "Sentiment": "positive",
            "PublishDate": 1754735019553,
            "Source": "earnings"
        },
        {
            "Title": "Happy Forgings Reports Q1 FY26 Results and Appoints New Internal Auditors",
            "Summary": "Happy Forgings Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 35,380.34 lacs and profit for the period of Rs 6,569.02 lacs. Basic earnings per share stood at Rs 6.97. The Board also appointed SCV & Co. LLP and KPMG Assurance and Consulting Services LLP as internal auditors for financial year 2025-26. The company has utilized Rs 30,135.43 lacs from its IPO proceeds, with Rs 7,646.90 lacs remaining unutilized and temporarily invested in fixed deposits. During the quarter, 43,811 employee stock options were exercised under the company's ESOP scheme.",
            "Sentiment": "neutral",
            "PublishDate": 1754730438498,
            "Source": "earnings"
        },
        {
            "Title": "Happy Forgings Q4 Results and Dividend Announcement",
            "Summary": "Happy Forgings reported its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit was 676 million rupees, compared to 658 million rupees in the same period last year. Revenue increased to 3.52 billion rupees from 3.43 billion rupees year-over-year. EBITDA rose to 1.02 billion rupees from 971 million rupees, with EBITDA margin improving to 29.05% from 28.29%. The company has recommended a final dividend of 3 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747482363000,
            "Source": "result"
        },
        {
            "Title": "Happy Forgings Signs MoU for Long-term Supply of Industrial Components",
            "Summary": "Happy Forgings has entered into a Memorandum of Understanding (MoU) for the long-term supply of heavy, forged, and precision machined industrial components. The agreement includes annual committed volumes of 950 million rupees, with a peak revenue potential of 1.60 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739320340000,
            "Source": "order&deals"
        },
        {
            "Title": "Happy Forgings Signs MOU for Long-Term Supply of Industrial Components",
            "Summary": "Happy Forgings has entered into a Memorandum of Understanding (MOU) for the long-term supply of heavy, forged, and precision machined industrial components. The agreement includes annual committed volumes worth 950 million rupees, with a peak revenue potential of 1.60 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739273372000,
            "Source": "order&deals"
        },
        {
            "Title": "Happy Forgings Reports Increased Q3 Profit and Revenue",
            "Summary": "Happy Forgings has announced its Q3 financial results, showing improvements in both profit and revenue compared to the same period last year. The company's consolidated net profit rose to 645 million rupees from 579 million rupees year-over-year. Revenue also increased to 3.54 billion rupees from 3.4 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1739146478000,
            "Source": "earnings"
        },
        {
            "Title": "Happy Forgings Reports Improved Q3 EBITDA and Margin",
            "Summary": "Happy Forgings has announced its Q3 financial results, showing an increase in EBITDA to 1.01 billion rupees, up from 952 million rupees in the same quarter last year. The company's EBITDA margin also improved to 28.64% from 27.83% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738928974000,
            "Source": "earnings"
        },
        {
            "Title": "Happy Forgings Reports Increased Q3 Profit and Revenue",
            "Summary": "Happy Forgings has announced its Q3 financial results. The company's consolidated net profit rose to 645 million rupees, up from 579 million rupees in the same quarter last year. Revenue also increased to 3.54 billion rupees, compared to 3.4 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738928969000,
            "Source": "earnings"
        },
        {
            "Title": "Happy Forgings: SBI Mutual Fund Increases Stake, Business Excellence Trust Reduces",
            "Summary": "SBI Mutual Fund acquired an additional 3.8% stake in Happy Forgings Ltd. for Rs 341 crore, increasing its total holding to 5.77%. Concurrently, Business Excellence Trust III sold 4.2% stake for Rs 371 crore, reducing its holding to 4.1%.",
            "Sentiment": "neutral",
            "PublishDate": 1737740283000,
            "Source": "block_deals"
        },
        {
            "Title": "Happy Forgings Approves ₹650 Crore Capex for New Facilities",
            "Summary": "Happy Forgings has approved a capital expenditure budget of ₹650 crore to establish new facilities for the production of heavy weight forged and machined components. This investment indicates the company's commitment to expanding its manufacturing capabilities and potentially entering new market segments.",
            "Sentiment": "positive",
            "PublishDate": 1736142912000,
            "Source": "corporate_action"
        },
        {
            "Title": "Happy Forgings Secures 1.4 Billion Rupee Crankshaft Order for Domestic Passenger Vehicles",
            "Summary": "Happy Forgings has obtained a significant order worth 1.4 billion rupees to supply crankshafts for the domestic passenger vehicle segment. This order represents a major business opportunity for the company in the automotive components sector.",
            "Sentiment": "positive",
            "PublishDate": 1734310736000,
            "Source": "order&deals"
        },
        {
            "Title": "Happy Forgings Secures 1.4 Billion Rupee Order for Crankshafts",
            "Summary": "Happy Forgings has secured an order worth 1.4 billion rupees to supply crankshafts for the domestic passenger vehicle segment. This order represents a significant business opportunity for the company in the automotive component manufacturing sector.",
            "Sentiment": "positive",
            "PublishDate": 1734178371000,
            "Source": "order&deals"
        },
        {
            "Title": "Happy Forgings: Secures ₹145 Crore Export Order from North American Client",
            "Summary": "Happy Forgings Limited has won a five-year export order worth ₹135-145 crores from a North American power generation equipment manufacturer. The order involves supplying precision-engineered components, starting from Q2 FY2026 through FY2031, with potential extension. Expected annual revenue is around ₹28 crore at full volume.",
            "Sentiment": "positive",
            "PublishDate": 1731578410000,
            "Source": "normal_news"
        },
        {
            "Title": "Happy Forgings: Expansion Plans for Growth",
            "Summary": "<p><span class=\"positive\">Happy Forgings</span> is reportedly focusing on <span class=\"positive\">growth-centric capability expansion</span>, according to a research report by <b>Yes Securities</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728977375000,
            "Source": "normal_news"
        }
    ]
}