{
    "Symbol": "HAPPSTMNDS",
    "ISIN": "INE419U01012",
    "News": [
        {
            "Title": "Happiest Minds Q3 FY26 Results Show Mixed Performance",
            "Summary": "Happiest Minds Technologies reports Q3 FY26 revenue of ₹65,744 lakhs with 4.8% YoY growth, but net profit drops 19.6% YoY to ₹4,030 lakhs due to new wage code costs and acquisition-related expenses.",
            "Sentiment": "neutral",
            "PublishDate": 1770655246449,
            "Source": "co_actions_results"
        },
        {
            "Title": "Happiest Minds Partners with IBSFINtech for Treasury",
            "Summary": "Happiest Minds Technologies announces strategic alliance with IBSFINtech to transform enterprise treasury operations, serving as reseller and system integration partner for AI-powered treasury management solutions.",
            "Sentiment": "positive",
            "PublishDate": 1769760453259,
            "Source": "co_actions_results"
        },
        {
            "Title": "Happiest Minds Chairman Explores Stake Sale Options",
            "Summary": "Ashok Soota, Co-founder and Executive Chairman of Happiest Minds Technologies, is exploring options to sell his stake valued at approximately Rs 1,980 crore and has engaged a banker to assess potential opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1769666237486,
            "Source": "co_actions_results"
        },
        {
            "Title": "Happiest Minds Earns Top Employer India 2026 Award",
            "Summary": "Happiest Minds Technologies receives Top Employer India 2026 certification with 92% score, well above 85% industry benchmark, after assessment across 2,400+ global organizations.",
            "Sentiment": "positive",
            "PublishDate": 1769515968913,
            "Source": "stocks"
        },
        {
            "Title": "Happiest Minds Unveils AI-First Strategy",
            "Summary": "Happiest Minds Technologies announces comprehensive AI integration strategy with 32 use cases in development across healthcare, edtech, retail, and hi-tech sectors.",
            "Sentiment": "positive",
            "PublishDate": 1768891890932,
            "Source": "stocks"
        },
        {
            "Title": "Happiest Minds Clarifies GAVS Middle East Acquisition",
            "Summary": "Happiest Minds Technologies clarifies it acquired GAVS' Middle East operations through three entities - Innovazit Technologies LLC (Dubai), GAVS Technologies LLC (Oman), and GAVS Technologies Saudi Arabia via share purchase agreements.",
            "Sentiment": "neutral",
            "PublishDate": 1767612128140,
            "Source": "co_actions_results"
        },
        {
            "Title": "Happiest Minds Technologies Wins Runner-up Award for Excellence in People Analytics at SHRM Excellence Awards 2025",
            "Summary": "Happiest Minds Technologies Limited has been recognized as Runner-up for Excellence in People Analytics at the SHRM Excellence Awards 2025, highlighting their People One Dashboard platform that provides real-time intelligence across employee journeys. The recognition reflects the company's commitment to data-driven people practices and building a future-ready workplace shaped by data intelligence and transparency.",
            "Sentiment": "positive",
            "PublishDate": 1765351633851,
            "Source": "stock"
        },
        {
            "Title": "Happiest Minds Recognized Among 2025 Best Companies for Women in IT for Third Consecutive Year",
            "Summary": "Happiest Minds Technologies has been recognized by Avtar and Seramount among the 2025 Best Companies for Women in India in IT for the third consecutive year and named an Exemplar of Inclusion in the 2025 Most Inclusive Companies Index. The recognition reflects the company's sustained commitment to fostering workplace diversity, prioritizing belonging, and ensuring equitable access to opportunities through initiatives like the Women in Break program and AURA leadership development.",
            "Sentiment": "positive",
            "PublishDate": 1764745232698,
            "Source": "stock"
        },
        {
            "Title": "Happiest Minds Launches ELAIRA AI-Powered Digital Co-Worker for Enterprise Support",
            "Summary": "Happiest Minds Technologies launched ELAIRA, an intelligent digital co-worker integrated with ELLIPSE 2.0 platform, designed to transform enterprise support operations with conversational self-service and advanced AI capabilities. The platform delivers up to 40% Tier-1 ticket deflection, 50% reduction in average handling time, and 20% improvement in First Contact Resolution, targeting significant cost optimization across enterprise environments.",
            "Sentiment": "positive",
            "PublishDate": 1764228649705,
            "Source": "stock"
        },
        {
            "Title": "Happiest Minds Reports Strong H1 FY26 Results with 11.8% Growth, Raises Growth Commitment to Four Years",
            "Summary": "Happiest Minds Technologies delivered robust H1 FY26 performance with revenues of $129.5 million, growing 11.8% in constant currency and EBITDA margins of 20.8%. The company's Generative AI business unit (GBS) was a standout performer, delivering 77.8% year-on-year growth in constant currency for Q2 and 79% for H1, along with 15.3% sequential growth. The Net New Sales initiative added 30 new clients generating approximately $9 million in revenues, representing potential of $50-60 million over the next 3 years. Based on strong performance and pipeline visibility, the company raised its growth commitment from three to four consecutive years of double-digit growth through FY28. Company-wide utilization improved to 80.7%, the highest in 3 years. The Board declared a dividend of INR 2.75 per share.",
            "Sentiment": "positive",
            "PublishDate": 1762255099210,
            "Source": "earnings"
        },
        {
            "Title": "Happiest Minds Reports 13.2% Revenue Growth in H1 FY26 with Strong Operational Metrics",
            "Summary": "Happiest Minds Technologies delivered total income of ₹1,175 crore for the half year ended September 30, 2025, representing 13.2% year-on-year growth. Revenue grew 11.8% in constant currency terms. The company reported EBITDA of ₹244 crore with a margin of 20.8% and PAT of ₹111 crore, up 10.6% year-on-year. For the quarter, total income stood at ₹595 crore, up 8.5% year-on-year. Operating revenues in USD reached $129.5 million for H1 and $65.1 million for Q2. The company improved operational efficiency with DSO reducing from 91 days to 88 days and utilization reaching 80.7%, the highest in three years. Employee count stood at 6,554 with trailing 12-month attrition at 17.4%. The Board declared an interim dividend of ₹2.75 per equity share with a record date of November 4, 2025. The company added 13 new clients during the quarter, bringing total clients to 290.",
            "Sentiment": "positive",
            "PublishDate": 1761851775158,
            "Source": "earnings"
        },
        {
            "Title": "Happiest Minds Tech Maintains FY26 Growth Forecast, Extends Revenue Commitment to FY28",
            "Summary": "Happiest Minds Tech management expressed confidence in Q3 results, citing strong pipeline, Q2 deals carrying over, seasonal increase in banking contracts, and launch of new GenAI billing. The company maintains its FY26 forecast of double-digit revenue growth in constant currency and EBITDA margins of 20-22%. The company has extended its commitment to four years of double-digit revenue growth until FY28.",
            "Sentiment": "positive",
            "PublishDate": 1761795566297,
            "Source": "stock"
        },
        {
            "Title": "Happiest Minds Focuses on Generative AI and Digital Engineering for Growth Strategy",
            "Summary": "Happiest Minds is betting on generative AI and full-stack digital engineering to drive double-digit growth. The company is expanding its Centers of Excellence (CoEs), cloud operations, cybersecurity services, and global delivery capabilities as part of its strategy to maintain profitable margin leadership.",
            "Sentiment": "positive",
            "PublishDate": 1761666935593,
            "Source": "stock"
        },
        {
            "Title": "Happiest Minds Reports 11.8% Revenue Growth in H1 FY26, Extends Growth Commitment to Four Years",
            "Summary": "Happiest Minds Technologies announced consolidated results for the quarter ended September 30, 2025. The company delivered H1 FY26 revenue of $129.5 million with 11.8% growth in USD constant currency and EBITDA margin of 20.8%. For the quarter, revenue stood at $65.1 million with 2.3% quarter-on-quarter growth in constant currency and 4.4% year-on-year growth. EBITDA was ₹12,027 lakhs at 20.2% of total income, while PAT reached ₹5,402 lakhs representing 9.1% of total income with 9.1% year-on-year growth. The company added 13 new clients during the quarter, bringing total client count to 290. Employee strength stood at 6,554 with trailing 12-month attrition of 17.4%. The company's Generative AI Business Unit has developed 22 transformative use cases with sales potential of nearly $50 million, while 30 new client additions in H1 represent revenue potential of $50-60 million over three years. The Board declared an interim dividend of ₹2.75 per equity share with record date of November 4, 2025. Management extended their commitment from three to four consecutive years of double-digit growth.",
            "Sentiment": "positive",
            "PublishDate": 1761660987363,
            "Source": "earnings"
        },
        {
            "Title": "Happiest Minds Tech Reports Mixed Q2 Results with Revenue Growth and Profit Decline",
            "Summary": "Happiest Minds Tech announced Q2 consolidated net profit of 540.2 million rupees, down from 571.3 million rupees in the previous quarter. The company's revenue increased to 5.74 billion rupees from 5.5 billion rupees quarter-over-quarter. EBIT rose to 764.6 million rupees from 716.6 million rupees, with EBIT margin improving to 13.33% from 13.03%. The company recommended an interim dividend of 2.75 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1761658702316,
            "Source": "corporate_action"
        },
        {
            "Title": "Happiest Minds Technologies Receives NCLT Approval for Subsidiary Amalgamation",
            "Summary": "Happiest Minds Technologies Limited has received approval from the National Company Law Tribunal, Bengaluru Bench for the amalgamation of its wholly-owned subsidiary, Sri Mookambika Infosolutions Private Limited. The tribunal approved the scheme through an order dated September 25, 2025, with the appointed date for the merger set as April 1, 2025. The company received the certified true copy of the order on October 16, 2025. The amalgamation involves Sri Mookambika Infosolutions Private Limited as the transferor company and Happiest Minds Technologies Limited as the transferee company.",
            "Sentiment": "positive",
            "PublishDate": 1760620157866,
            "Source": "corporate_action"
        },
        {
            "Title": "Happiest Minds Technologies Implements AI Solutions for South African Insurance Firm",
            "Summary": "Happiest Minds Technologies has deployed Agentic AI and Smart Document Processing solutions to enhance operations at MUA Insurance Acceptances, a South African insurance company. The implementation aims to improve operational efficiency through advanced artificial intelligence and automated document processing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1760077834026,
            "Source": "stock"
        },
        {
            "Title": "Happiest Minds Technologies Receives NCLT Approval for Subsidiary Merger",
            "Summary": "Happiest Minds Technologies Limited received approval from the National Company Law Tribunal, Bengaluru Bench for the merger of its wholly-owned subsidiary, Happiest Minds Edutech Private Limited, with the parent company. The tribunal approved the scheme of amalgamation on September 22, 2025, with the appointed date for the merger being April 18, 2024. The company received the certified true copy of the order on September 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758905956346,
            "Source": "corporate_action"
        },
        {
            "Title": "Happiest Minds Technologies Reports Minimal Impact from H-1B Visa Fee Hike",
            "Summary": "Happiest Minds Technologies announced that the recent H-1B visa fee increase will have negligible impact on its business operations. The company had only 4 employees travel to the U.S. on H-1B visas in 2024 and 2 in 2025. CEO Joseph Anantharaju highlighted their 'H-1B Outlier Advantage' strategy of maintaining a larger offshore footprint while reducing visa dependencies. Managing Director Venkatraman Narayanan noted that 94% of their workforce is based in India and nearly 95% of revenues are generated outside U.S. onsite operations. The company has built an offshore-centric delivery model over 14 years, which drives cost efficiencies and enables consistent delivery of digital solutions to global clients.",
            "Sentiment": "positive",
            "PublishDate": 1758619151002,
            "Source": "stock"
        },
        {
            "Title": "PureSoftware's Arttha Platform Wins Two Awards at IBSi Digital Banking Awards 2025",
            "Summary": "PureSoftware, a subsidiary of Happiest Minds Technologies, received two honors at the IBSi Digital Banking Awards 2025 for its Arttha digital banking platform. Arttha won as Functional Area Winner in Digital Wallet for G-Money Financial Services, a subsidiary of GCB Bank in Ghana, and as Regional Winner for Africa for EcoCash. The cloud-native platform provides digital banking solutions including digital lending, payments, retail and SME banking, core banking, and agency banking. GCB Bank uses Arttha for an omnichannel wallet platform, while EcoCash utilizes it for instant micro-loans to support financial inclusion. The awards recognize Arttha's role in delivering scalable digital solutions that streamline operations and reduce time to market for financial services across Africa and other high-growth markets.",
            "Sentiment": "positive",
            "PublishDate": 1755076324076,
            "Source": "stock"
        },
        {
            "Title": "Happiest Minds Seeks Shareholder Approval for Re-appointment of Two Whole-time Directors",
            "Summary": "Happiest Minds Technologies has issued a postal ballot notice seeking shareholder approval for the re-appointment of two key executives. The company proposes to re-appoint Joseph Vinod Kumar Anantharaju as Co-Chairman & CEO and Venkatraman Narayanan as Managing Director, both for five-year terms from November 04, 2025 to November 03, 2030. Both executives have been with the company for over a decade - Anantharaju for fourteen years as a co-founder and key growth driver, and Narayanan for ten years handling financial strategies. The e-voting period runs from August 06, 2025 to September 04, 2025, with results to be announced within two working days. Anantharaju's re-appointment requires Central Government approval as he is a non-resident Indian. Both resolutions are proposed as special resolutions requiring higher approval thresholds.",
            "Sentiment": "neutral",
            "PublishDate": 1754387449927,
            "Source": "corporate_action"
        },
        {
            "Title": "Happiest Minds Reports 17.5% YoY Growth with Strong Margin Performance in Q1 FY26",
            "Summary": "Happiest Minds Technologies delivered strong quarterly results with 17.5% year-on-year growth in constant currency and maintained EBITDA margin at 21.4%. The company reported total income of ₹580 crores, representing 18.5% year-on-year growth. Sequential revenue growth stood at 2.3% in dollar terms at $64.4 million. The Generative AI Business Services unit achieved breakeven at operating margin level, swinging from a loss of ₹2.53 crores in the previous quarter to a marginal profit of ₹24 lakhs. Active customers increased from 281 to 285, while million-dollar customers grew from 57 to 59. BFSI emerged as the largest vertical contributing 26% to revenues. The company maintained its double-digit growth guidance for the year while targeting EBITDA margins in the 20-22% range. Utilization improved to 78.9%, the highest in nine quarters, though attrition increased to 18.2%. Management highlighted successful integration of previous acquisitions and continued investments in AI capabilities and new sales initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1754319161974,
            "Source": "earnings"
        },
        {
            "Title": "Happiest Minds Technologies Wins Top Workplaces 2025 Recognition in US Technology Category",
            "Summary": "Happiest Minds Technologies Limited received the Top Workplaces 2025 Recognition in the Technology category by Top Workplaces USA. The recognition was based on feedback from US team members through an independent survey that evaluated employee connection to work, leadership, and company direction. Out of more than 500 participating companies, Happiest Minds was selected for creating a workplace where employees feel respected, supported, and aligned with company values. This marks the company's first people-focused recognition in the US. The Top Workplaces program is run by Energage and is entirely survey-driven based on employee experiences, with no applications or payments involved.",
            "Sentiment": "positive",
            "PublishDate": 1754302036186,
            "Source": "stock"
        },
        {
            "Title": "Happiest Minds Technologies Reports 17.5% Revenue Growth and 20th Consecutive Quarter of Sequential Growth",
            "Summary": "Happiest Minds Technologies delivered total income of ₹580 crore for the quarter ended June 30, 2025, representing 18.5% year-on-year growth. The company achieved revenue of $64.4 million in constant currency, marking 2.3% quarter-on-quarter and 17.5% year-on-year growth. This marks the company's 20th consecutive quarter of sequential growth. EBITDA stood at ₹124 crore with a margin of 21.4%, while PAT reached ₹5,713 lakhs, showing 68% quarter-on-quarter and 12% year-on-year growth. The company serves 285 clients with 6,523 employees and achieved utilization of 78.9%. Key project wins include partnerships with global companies across retail, logistics, healthcare, insurance, education, mining, and furniture sectors, focusing on GenAI services, cloud migration, and digital transformation. The company won the CNBC-TV18 India Risk Management Award 2025 and received recognition from AIM Research and Everest Group for its capabilities in data engineering and process automation.",
            "Sentiment": "positive",
            "PublishDate": 1753969591960,
            "Source": "earnings"
        },
        {
            "Title": "Happiest Minds Targets 20-22% EBITDA Margin by FY26 Through Generative AI Business",
            "Summary": "Happiest Minds Technologies is targeting EBITDA margins of 20-22% in FY26, driven by investments in its generative AI business. Managing Director Venkatraman Narayanan stated that the generative AI division achieved operational break-even with a small profit of Rs 24 lakh in Q1FY26 after five to six quarters of investment. The company maintains its vision of reaching $1 billion in revenue by FY31, requiring a 22-23% CAGR. For Q1FY26, the company reported consolidated profit after tax of Rs 57.13 crore (up 12% YoY), revenue of Rs 549.9 crore (up 18.6% YoY), and EBITDA margin of 21.4% compared to 23.9% in the previous year. Shares traded 0.54% higher at Rs 622.7.",
            "Sentiment": "positive",
            "PublishDate": 1753926580846,
            "Source": "stock"
        },
        {
            "Title": "Happiest Minds Reports Q1 FY26 Revenue Growth of 17.5% YoY in Constant Currency, EBITDA at 21.4%",
            "Summary": "Happiest Minds Technologies announced quarterly results with revenue of $64.4 million, growing 2.3% quarter-on-quarter and 17.5% year-on-year in constant currency. The company reported EBITDA of ₹12,405 lakhs at 21.4% margin and PAT of ₹5,713 lakhs at 9.9% margin. The Board approved the amalgamation scheme of wholly-owned subsidiary Aureustech Systems Private Limited with the parent company. Joseph Anantharaju and Venkatraman Narayanan were re-appointed as Whole-time Directors for five-year terms from November 2025 to November 2030, subject to regulatory and shareholder approvals. The company added 17 new clients during the quarter, bringing total active clients to 285. Employee count stood at 6,523 with utilization at 78.9% and trailing 12-month attrition at 18.2%.",
            "Sentiment": "positive",
            "PublishDate": 1753774544745,
            "Source": "corporate_action"
        },
        {
            "Title": "Happiest Minds Reports Strong Q1 FY26 Results with 17.5% YoY Growth and Leadership Re-appointments",
            "Summary": "Happiest Minds Technologies reported quarterly results with revenue of $64.4 million, showing 2.3% quarter-on-quarter and 17.5% year-on-year growth in constant currency. The company achieved total income of ₹57,993 lakhs with EBITDA of ₹12,405 lakhs at 21.4% margin. Profit after tax reached ₹5,713 lakhs representing 9.9% of total income. The board approved re-appointment of Joseph Anantharaju as Co-Chairman & CEO and Venkatraman Narayanan as Managing Director for five-year terms from November 2025 to November 2030. Additionally, the company approved a scheme of amalgamation with wholly-owned subsidiary Aureustech Systems Private Limited. The company serves 285 active clients with 6,523 employees and maintains 94.4% digital revenue mix.",
            "Sentiment": "positive",
            "PublishDate": 1753773985790,
            "Source": "earnings"
        },
        {
            "Title": "Happiest Minds Technologies Reports Strong Q1 Performance with 68% Jump in Net Profit",
            "Summary": "Happiest Minds Technologies delivered robust Q1 results with revenue rising to 5.49 billion rupees from 5.45 billion rupees in the previous quarter. The company's consolidated net profit surged significantly to 570 million rupees compared to 340 million rupees in the prior quarter. EBIT increased to 717 million rupees from 613 million rupees, while EBIT margin expanded to 13% from 11.26% quarter-over-quarter, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1753773490721,
            "Source": "earnings"
        },
        {
            "Title": "Happiest Minds Technologies Schedules Q1FY26 Earnings Call for July 30, 2025",
            "Summary": "Happiest Minds Technologies Limited has scheduled an earnings call to discuss Q1FY26 results on July 30, 2025, at 09:00 AM IST. Key executives including Chairman Ashok Soota, Co-Chairman & CEO Joseph Anantharaju, Managing Director Venkatraman Narayanan, Executive Director Rajiv Shah, and CFO Anand Balakrishnan will participate in the call. The session will cover financial results and highlights for the quarter ended June 30, 2025, followed by a Q&A segment. The call will be accessible through multiple dial-in numbers including toll-free options for international participants from Singapore, Hong Kong, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1753100046617,
            "Source": "earnings"
        },
        {
            "Title": "Happiest Minds Technologies Schedules Board Meeting for July 29, 2025 to Approve Quarterly Financial Results",
            "Summary": "Happiest Minds Technologies Limited has scheduled a Board of Directors meeting on July 29, 2025, to consider and approve the unaudited financial statements for the quarter ended June 30, 2025. The meeting will address both standalone and consolidated financial statements prepared in accordance with Indian Accounting Standards (IndAS). The company is listed on BSE with stock codes 543227, 974820 & 975101, and on NSE with stock code HAPPSTMNDS.",
            "Sentiment": "neutral",
            "PublishDate": 1753096907891,
            "Source": "corporate_action"
        },
        {
            "Title": "Happiest Minds Technologies Unit Launches FuzionX Gaming Studio",
            "Summary": "Happiest Minds Technologies has announced that one of its units has introduced FuzionX Gaming Studio. This new initiative aims to transform B2B casino gaming services. The studio appears to be focused on providing innovative solutions in the casino gaming industry for business-to-business clients.",
            "Sentiment": "positive",
            "PublishDate": 1751961360000,
            "Source": "default"
        },
        {
            "Title": "Happiest Minds Technologies: Inorganic Growth Strategy Reshapes Revenue Mix",
            "Summary": "Happiest Minds Technologies is focusing on inorganic growth, with recent acquisitions reshaping its revenue mix. The company invested $90 million in three acquisitions, expanding its presence in BFSI and healthcare sectors. Despite revenue growth of 26.84% to Rs 2,000 crore in FY25, EBIT and net profit declined due to higher costs. The company remains open to further acquisitions, particularly in cybersecurity.",
            "Sentiment": "neutral",
            "PublishDate": 1750238151000,
            "Source": "normal_news"
        },
        {
            "Title": "Happiest Minds Technologies: Shares Surge 10% on 'Buy' Rating",
            "Summary": "Happiest Minds Technologies shares rose 10% after Anand Rathi initiated coverage with a 'buy' rating and ₹790 price target. The brokerage cites inorganic growth in BFSI and Healthcare segments, appointment of a Chief Growth Officer, and a dedicated AI business unit as positive factors. However, US market slowdown and Edutech vertical performance remain concerns.",
            "Sentiment": "positive",
            "PublishDate": 1750147287000,
            "Source": "normal_news"
        },
        {
            "Title": "Happiest Minds Tech Anticipates Growth and New Product Launch",
            "Summary": "Happiest Minds Technologies expects to launch a revolutionary healthcare product in Q1 FY27, subject to board approval. The company anticipates the new business to be cash positive in its first year (FY27) with minimal impact on capital expenditure. Additionally, the company projects healthy double-digit organic growth for both FY26 and FY27, attributed to momentum from ten strategic transformational changes.",
            "Sentiment": "positive",
            "PublishDate": 1747193501000,
            "Source": "default"
        },
        {
            "Title": "Happiest Minds Technologies: Double-Digit Growth Targeted for FY26, Led by BFSI and Healthcare",
            "Summary": "Happiest Minds Technologies expects BFSI and healthcare verticals to drive growth in FY26. The company missed FY25 revenue guidance but maintained margins. For FY26, they target double-digit revenue growth and 20-22% EBITDA margins. BFSI currently contributes 26% to revenue, which management considers optimal.",
            "Sentiment": "positive",
            "PublishDate": 1747117430000,
            "Source": "earnings"
        },
        {
            "Title": "Happiest Minds Technologies: Q4 Profit Plunges 53% YoY, Revenue Up 30.5%",
            "Summary": "Happiest Minds Technologies reported a 52.8% YoY decline in Q4FY25 profit at Rs 34.01 crore, while revenue increased 30.5% to Rs 544.57 crore. The company added 14 new clients in Q4. The board recommended a final dividend of Rs 3.5 per share for FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1747107431000,
            "Source": "earnings"
        },
        {
            "Title": "Happiest Minds Technologies Reports Q4 Financial Results",
            "Summary": "Happiest Minds Technologies announced its Q4 financial results. The company's EBIT decreased to 613 million rupees from 729 million rupees in the previous quarter. The EBIT margin also declined to 11.26% from 13.74%. Consolidated net profit fell to 340 million rupees from 501 million rupees quarter-over-quarter. The company reported an exceptional item of 122 million rupees in Q4, with profit before tax at 625 million rupees compared to 689 million rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747104016000,
            "Source": "result"
        },
        {
            "Title": "Happiest Minds Technologies: AI Investment Solution Launched on Microsoft Azure Marketplace",
            "Summary": "Happiest Minds Technologies has released its generative AI-powered Investment Companion solution on the Microsoft Azure Marketplace. The solution aims to enhance investor relations by providing interactive responses through a chat interface, improving efficiency and engagement.",
            "Sentiment": "positive",
            "PublishDate": 1743569955000,
            "Source": "normal_news"
        },
        {
            "Title": "Happiest Minds' GenAI Solution Available on Microsoft Azure Marketplace",
            "Summary": "Happiest Minds Technologies has announced that its GenAI-enabled solution, Investment Companion, is now available on the Microsoft Azure Marketplace. This availability on a major cloud platform marketplace indicates a significant step in the company's product distribution and accessibility strategy.",
            "Sentiment": "positive",
            "PublishDate": 1743493383000,
            "Source": "corporate_action"
        },
        {
            "Title": "Happiest Minds Anticipates Strong Revenue Growth for FY26 and FY27",
            "Summary": "Happiest Minds' Co-Chairman has expressed optimism about the company's future performance, stating that they expect healthy organic revenue growth in FY26 and FY27. The growth is projected to be in double digits for both fiscal years. Additionally, the company plans to announce a new organizational structure within the next 6-8 weeks.",
            "Sentiment": "positive",
            "PublishDate": 1743034533000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Happiest Minds Expects Double-Digit Organic Revenue Growth for FY26 and FY27",
            "Summary": "The Chairman of Happiest Minds Technologies has expressed optimism about the company's future performance. He anticipates healthy organic revenue growth in the fiscal years 2026 and 2027, specifically projecting double-digit growth rates. Additionally, the company plans to unveil a new organizational structure within the next 6 to 8 weeks.",
            "Sentiment": "positive",
            "PublishDate": 1742987374000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Happiest Minds Technologies: Leadership Transition Announced for 2025",
            "Summary": "Happiest Minds Technologies' board approves re-designation of Ashok Soota as Chairman and Chief Mentor, and Joseph Vinod Anantharaju as Co-Chairman and CEO, effective March 19, 2025. Soota's term extends to March 31, 2029, while Anantharaju's role is until November 3, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1742469419000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Happiest Minds Technologies: Major Leadership Restructuring Announced",
            "Summary": "Happiest Minds Technologies has restructured its top leadership. Joseph Anantharaju promoted to Co-Chairman and CEO, overseeing all business divisions. Venkatraman Narayanan continues as Managing Director and CFO. Ashok Soota transitions to Chairman and Chief Mentor role. Changes aimed at accelerating growth and streamlining operations.",
            "Sentiment": "positive",
            "PublishDate": 1742378348000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Happiest Minds Technologies Ltd. Sees Significant Block Trade on NSE",
            "Summary": "A block trade of approximately 353,934 shares of Happiest Minds Technologies Ltd. was executed on the National Stock Exchange (NSE) at a price of Rs. 703.50 per share. The total value of the transaction amounted to Rs. 24.90 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1741237550000,
            "Source": "block_deals"
        },
        {
            "Title": "Happiest Minds Technologies Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade of approximately 303,647 shares of Happiest Minds Technologies Ltd. took place on the National Stock Exchange (NSE) at a price of Rs. 702.40 per share. The total value of the transaction amounted to Rs. 21.33 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1740635913000,
            "Source": "block_deals"
        },
        {
            "Title": "Happiest Minds Introduces Reusable Generative AI Solution for Research",
            "Summary": "Happiest Minds Technologies has developed a reusable generative AI solution that is transforming research across various industries. This innovative tool is designed to enhance and streamline research processes, potentially improving efficiency and outcomes in multiple sectors.",
            "Sentiment": "positive",
            "PublishDate": 1739950979000,
            "Source": "corporate_action"
        },
        {
            "Title": "Happiest Minds Technologies: SBI Mutual Fund Increases Stake Above 5%",
            "Summary": "SBI Mutual Fund has raised its stake in Happiest Minds Technologies Ltd from 4.9023% to 5.0297% through open market purchases. The fund acquired 1,93,968 additional shares on February 11, 2025, bringing its total holding to 76,58,958 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1739517218000,
            "Source": "block_deals"
        },
        {
            "Title": "Happiest Minds Technologies Forecasts 30-35% Revenue Growth",
            "Summary": "During a conference call, Happiest Minds Technologies reiterated its previously mentioned forecast of 30% to 35% revenue growth for the year. The company emphasized that this is a forecast and not an official guidance.",
            "Sentiment": "positive",
            "PublishDate": 1739266107000,
            "Source": "earnings"
        },
        {
            "Title": "Happiest Minds Technologies Aims to Meet Annual Margin Guidance",
            "Summary": "Happiest Minds Technologies has stated in a concall that they aim to close the year with margins within their guided range of 20% to 22%. The company reports that for the nine-month period, they are already ahead of their guidance numbers.",
            "Sentiment": "positive",
            "PublishDate": 1739266050000,
            "Source": "earnings"
        },
        {
            "Title": "Happiest Minds Technologies: Targeting 30% Revenue Growth Through Key Segments",
            "Summary": "Happiest Minds Technologies aims for 30% revenue growth in the current fiscal year, focusing on healthcare, high tech, and BFSI segments. Q3 revenue grew 27% YoY to Rs 627.19 crore. Management expects 27-28% constant currency growth, slightly below the 30% target. BFSI leads growth, with healthcare and high-tech showing promise.",
            "Sentiment": "positive",
            "PublishDate": 1738825817000,
            "Source": "earnings"
        }
    ]
}