{
    "Symbol": "HARDWYN",
    "ISIN": "INE626Z01029",
    "News": [
        {
            "Title": "Hardwyn India Clarifies No Material Info Behind Volume",
            "Summary": "Hardwyn India Limited clarifies to BSE that recent volume spurt is market-driven with no undisclosed material information requiring regulatory disclosure under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768472790001,
            "Source": "stocks"
        },
        {
            "Title": "Hardwyn India Appoints Merlin Capital as IR Agency",
            "Summary": "Hardwyn India Limited has appointed Merlin Capital Advisors as its Investor Relations Agency to strengthen investor communication and enhance transparency in capital markets.",
            "Sentiment": "positive",
            "PublishDate": 1765976735023,
            "Source": "stocks"
        },
        {
            "Title": "Hardwyn India Limited Explains Delay in September 2025 Quarter Financial Results Submission",
            "Summary": "Hardwyn India Limited disclosed to stock exchanges that its financial results submission for the quarter ended September 30, 2025 was delayed due to board meeting adjournments caused by financial figure mismatches requiring reconciliation with auditors. The company's board meeting was rescheduled multiple times from November 14 to November 19, 2025, when results were finally submitted, with the company stating the delay was unintentional and reaffirming commitment to regulatory compliance.",
            "Sentiment": "negative",
            "PublishDate": 1765022842235,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hardwyn India Revises Preferential Issue Price to ₹13.84 Per Share",
            "Summary": "Hardwyn India Limited revised the minimum issue price for its proposed preferential issue to ₹13.84 per equity share from the earlier ₹13.79 per share, based on updated trading data and stock exchange clarifications. The revised price is calculated as the higher of the 90-day and 10-day volume weighted average prices on NSE, in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764079458059,
            "Source": "corporate_action"
        },
        {
            "Title": "Hardwyn India Reports 7.7% Revenue Growth and 48.9% Profit Surge in Q2 FY2026",
            "Summary": "Hardwyn India Limited posted consolidated revenue of Rs 5,068.70 lakhs in Q2 FY2026, up from Rs 5,164.74 lakhs in Q2 FY2025, with profit after tax jumping 7.7% to Rs 435.28 lakhs from Rs 404.01 lakhs year-over-year. The company's half-yearly consolidated revenue reached Rs 9,363.15 lakhs with profit after tax of Rs 798.62 lakhs, reflecting strong operational performance across its core business segments.",
            "Sentiment": "positive",
            "PublishDate": 1763562668200,
            "Source": "earnings"
        },
        {
            "Title": "Hardwyn India Limited Independent Director Nidhi Sethi Resigns Due to Personal Reasons",
            "Summary": "Nidhi Sethi has resigned from her position as Independent Director of Hardwyn India Limited, effective October 25, 2025. The resignation was submitted due to personal reasons and has been accepted by the company. Sethi confirmed there are no other material reasons for her departure beyond those stated. She holds directorship in Efficient Devices Private Limited and does not hold any directorships in other listed entities or board committee memberships. The company has disclosed this information to BSE and NSE in compliance with regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1761399745785,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hardwyn India Limited Approves Equity Share Allotment Through Share Swap and Increases Authorized Capital to INR 55 Crores",
            "Summary": "Hardwyn India Limited's board approved the allotment of equity shares through preferential basis via share swap, acquiring 33.50% stake (22,06,674 shares) in Fiba Hardwyn Locks Limited at Rs. 184 per share. The company increased its authorized share capital from INR 50 crores to INR 55 crores. The board appointed M/s. Amit Saxena & Associates as Secretarial Auditors for five years (April 2025 to March 2030) and M/s. S.S Periwal & Company as Statutory Auditor for five consecutive years from the 8th to 13th Annual General Meeting. Fiba Hardwyn Locks Limited operates in hardware manufacturing/metal fabrication with a turnover of Rs. 3977.23 lakhs as of March 2024. The share swap involves issuing 2,53,76,751 securities worth Rs. 4,66,93,22,184 to four investors including Tanya Sayal, Sukhleen Kaur Sayal, Swaran Jeet Singh, and Rubaljeet Singh Sayal. All appointments and capital increase are subject to shareholder approval at the upcoming AGM.",
            "Sentiment": "positive",
            "PublishDate": 1760534857983,
            "Source": "corporate_action"
        },
        {
            "Title": "Hardwyn Launches BIS-Certified 3D Cabinet Hinges",
            "Summary": "Hardwyn has introduced BIS-certified 3D cabinet hinges, which the company positions as raising standards in the furniture hardware sector. The new product line has received Bureau of Indian Standards certification.",
            "Sentiment": "positive",
            "PublishDate": 1759155698375,
            "Source": "stock"
        },
        {
            "Title": "Hardwyn India Limited Reports 16.67% Revenue Growth and 22.32% Net Profit Increase in Q1 FY2026",
            "Summary": "Hardwyn India Limited reported revenue of ₹60.06 crore for Q1 FY2026, representing a 16.67% increase from ₹51.48 crore in Q1 FY2025. Net profit grew 22.32% to ₹4.11 crore compared to ₹3.36 crore in the previous year. The company achieved an EBITDA of ₹7.14 crore with an EBITDA margin of 11.89% and net profit margin of 6.84%. The Board of Directors approved these results on August 13, 2025, and the company published the financial results in Financial Express and Jansatta newspapers.",
            "Sentiment": "positive",
            "PublishDate": 1755244135455,
            "Source": "earnings"
        },
        {
            "Title": "Hardwyn India Limited Reports Strong Q1 FY2026 Results with 95% Jump in Consolidated Net Profit",
            "Summary": "Hardwyn India Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of Rs 4,294.45 lakhs, up from Rs 4,092.74 lakhs in the same quarter last year. Consolidated net profit after tax increased significantly to Rs 363.34 lakhs compared to Rs 133.97 lakhs in the previous year quarter. On a standalone basis, revenue from operations reached Rs 3,194.60 lakhs versus Rs 3,090.18 lakhs in the corresponding quarter of the previous year, while standalone net profit grew to Rs 350.75 lakhs from Rs 120.22 lakhs. The company's consolidated earnings per share stood at Rs 0.07 for the quarter. The results include consolidated figures from subsidiaries Fiba Hardwyn Locks Private Limited (33% shareholding) and Slimx Interior Solutions Private Limited (85% shareholding).",
            "Sentiment": "positive",
            "PublishDate": 1755101066526,
            "Source": "earnings"
        },
        {
            "Title": "Hardwyn India Reports Q3 Financial Results",
            "Summary": "Hardwyn India has announced its Q3 financial results. The company's consolidated net profit stood at 40 million rupees, compared to 43 million rupees year-over-year and 40.4 million rupees quarter-over-quarter. Revenue for Q3 increased to 464 million rupees from 399 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739540370000,
            "Source": "earnings"
        },
        {
            "Title": "Hardwyn India: Small-Cap Stock Enters President of India Portfolio",
            "Summary": "Hardwyn India, a small-cap architectural hardware manufacturer, has entered the President of India's portfolio with a 0.46% stake as of Q4 2023. The company recently executed a 2:5 bonus share allotment, its third since 2022. Despite recent share price declines, retail investor ownership has increased significantly.",
            "Sentiment": "positive",
            "PublishDate": 1737352731000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hardwyn India: Stock Trades Ex-Date for 2:5 Bonus Share Issuance",
            "Summary": "Hardwyn India's stock price declined up to 6.5% as it traded ex-date for 2:5 bonus share issuance. The company fixed December 27 as the record date for the bonus issue. This follows previous bonus issues in June 2023 (1:3) and July 2022 (1:2). The company recently increased its authorized share capital to accommodate the bonus issue.",
            "Sentiment": "neutral",
            "PublishDate": 1735287853000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hardwyn India: Record Date Set for Bonus Share Issuance",
            "Summary": "Hardwyn India, a small-cap stock trading under ₹50, has fixed December 27, 2024, as the record date for issuing bonus shares to eligible shareholders. The company's shares closed at ₹29.14 on December 19, with a market capitalization of ₹1,016.64 crore.",
            "Sentiment": "positive",
            "PublishDate": 1734608092000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hardwyn India: Stock Surges 11.5% Amid Bonus Share Consideration",
            "Summary": "Hardwyn India Ltd's stock price increased by 11.5% to Rs 39.59. The company's board is set to consider issuing bonus shares. Hardwyn recently launched a wholly-owned subsidiary, Slim-X, focusing on ultra-slim aluminium profile design. The company reported growth in Q4FY24 and Q1FY24 financials.",
            "Sentiment": "positive",
            "PublishDate": 1731403287000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hardwyn India: New Subsidiary Boosts Stock Performance",
            "Summary": "Hardwyn India Ltd's stock analysis improved following the incorporation of Slim-X, a new subsidiary. The stock price reached 39.55, up 11.30% from the previous assessment. Slim-X will manufacture slim aluminum profiles for the architectural hardware market. Hardwyn reported Q4FY24 net sales of Rs 36.98 Crores, up 23.6% YoY, with a net profit of Rs 3.30 Crores. FY24 consolidated results show net sales of Rs 157.84 crores and profit of Rs 10.23 crores.",
            "Sentiment": "positive",
            "PublishDate": 1729763278000,
            "Source": "normal_news"
        },
        {
            "Title": "Hardwyn India: Stock Surges 9.86% Amid Market Rally",
            "Summary": "Hardwyn India's stock gained 9.86% on October 16, 2024, outperforming sector peers by 7.26%. The company's subsidiary, Slim-X, specializing in ultra-slim aluminum profiles, is expected to drive future growth. Q1 FY2024 results showed 11.03% YoY revenue increase and 20.67% YoY net profit growth.",
            "Sentiment": "positive",
            "PublishDate": 1729069350000,
            "Source": "normal_news"
        }
    ]
}