{
    "Symbol": "HARIOMPIPE",
    "ISIN": "INE00EV01017",
    "News": [
        {
            "Title": "Hariom Pipe Industries Q3FY26 Call on Feb 9",
            "Summary": "Hariom Pipe Industries Limited has scheduled an investor conference call on February 9, 2026 at 2:00 PM IST to discuss Q3FY26 and 9M FY26 operational and financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1770113532475,
            "Source": "stocks"
        },
        {
            "Title": "Hariom Pipe Industries Forms Metal Mart Subsidiary",
            "Summary": "Hariom Pipe Industries Limited incorporated Metal Mart Private Limited as a subsidiary company on January 22, 2026, with 70% shareholding to expand its metal and steel trading business operations.",
            "Sentiment": "positive",
            "PublishDate": 1769157229899,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hariom Pipe Industries Senior Manager Resigns",
            "Summary": "Hariom Pipe Industries announces resignation of K. Ramesh, GM Sales & Marketing for Tamil Nadu Division, effective January 20, 2026, citing personal reasons for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1768916621941,
            "Source": "stocks"
        },
        {
            "Title": "Hariom Pipe Industries Forms Metal Trading Subsidiary",
            "Summary": "Hariom Pipe Industries Ltd board approves incorporation of Metal Mart Private Limited subsidiary for metal and steel trading operations, acquiring 70% stake with completion expected within 10-20 days.",
            "Sentiment": "positive",
            "PublishDate": 1767777540158,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hariom Pipe Appoints VP Sales & Marketing",
            "Summary": "Hariom Pipe Industries Limited appoints Mr. Ramavtar Sharma as Vice President - Sales and Marketing effective January 01, 2026, bringing 30 years of experience including 25 years in steel industry.",
            "Sentiment": "positive",
            "PublishDate": 1767101881243,
            "Source": "stocks"
        },
        {
            "Title": "Hariom Pipe Industries Senior Manager Resigns",
            "Summary": "Deepak Kumar, CGM Operations at Hariom Pipe Industries' Hyderabad Division, resigned from his senior management position due to health concerns, effective December 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765543349710,
            "Source": "stocks"
        },
        {
            "Title": "Hariom Pipe Industries Appoints New COO",
            "Summary": "Hariom Pipe Industries Limited has appointed Mr. Sanjay Madanlalji Bhansali as Chief Operations Officer effective December 12, 2025. The appointment was approved by the Board of Directors based on the Nomination and Remuneration Committee's recommendation.",
            "Sentiment": "positive",
            "PublishDate": 1765384726531,
            "Source": "stocks"
        },
        {
            "Title": "Hariom Pipe Industries' Subsidiary HPEPL Allots Shares Worth Rs 11.77 Crore, Ceases to be Wholly Owned",
            "Summary": "Hariom Power and Energy Private Limited (HPEPL) allotted 1.17 crore equity shares at Rs 10 per share for total consideration of Rs 11.77 crore to Hariom Pipe Industries Limited and certain investors including promoters on November 20, 2025. Following this preferential allotment, HPEPL ceased to be a wholly owned subsidiary and became a subsidiary of Hariom Pipe Industries Limited, changing the ownership structure.",
            "Sentiment": "neutral",
            "PublishDate": 1763812879174,
            "Source": "corporate_action"
        },
        {
            "Title": "Hariom Pipe Industries Reports 21% Revenue Growth in H1 FY26, Signs MOU for Maharashtra Steel Plant",
            "Summary": "Hariom Pipe Industries achieved 21% year-on-year growth in both volumes (1.38 lakh metric tonnes) and revenue (INR 797 crore) for H1 FY26, despite Q2 softness due to planned maintenance shutdown and extended monsoons. The company signed an MOU with Maharashtra Government to establish a 1.5 million tonne integrated steel plant at Gadchiroli under the mega project policy, with substantial fiscal incentives including GST reimbursements and power tariff support.",
            "Sentiment": "positive",
            "PublishDate": 1763467715753,
            "Source": "earnings"
        },
        {
            "Title": "Hariom Pipe Industries Reports Strong H1FY26 Performance with 21% YoY Growth Across Key Metrics",
            "Summary": "Hariom Pipe Industries achieved 21% year-over-year growth in volume, revenue, and value-added products for H1FY26, with EBITDA rising 15% YoY and ROCE at 20.8%. The company has developed innovative pre-galvanized tubular sections for solar structures and received a Letter of Award for a 60MW solar power plant with Maharashtra State Electricity Board.",
            "Sentiment": "positive",
            "PublishDate": 1763061940143,
            "Source": "earnings"
        },
        {
            "Title": "Hariom Pipe Plans Capacity Expansion and Backward Integration for Multi-Year Growth",
            "Summary": "Hariom Pipe is implementing backward integration from sponge iron to steel tubes while doubling production capacity from 2.5 lakh to 5 lakh TPA and expanding its dealer network across South India. The company targets 20%+ volume growth and margin stability through cost optimization and product diversification strategies.",
            "Sentiment": "positive",
            "PublishDate": 1763051894280,
            "Source": "stock"
        },
        {
            "Title": "Hariom Pipe Reports Mixed Q2 Results with Revenue Growth but Lower Profit",
            "Summary": "Hariom Pipe announced quarterly results showing net profit of 104.1 million rupees compared to 157.5 million rupees in the same period last year, representing a decline. Revenue increased to 3.36 billion rupees from 3.14 billion rupees year-over-year. EBITDA rose slightly to 427 million rupees from 424 million rupees, while EBITDA margin decreased to 12.72% from 13.49% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762951596531,
            "Source": "earnings"
        },
        {
            "Title": "Hariom Pipe Industries Reports 7% Growth in Quarterly Sales Volume",
            "Summary": "Hariom Pipe Industries reported quarterly sales of 60,150 metric tons, representing a 7% increase compared to the same period in the previous year. The company achieved this growth in sales volume during its latest quarterly results.",
            "Sentiment": "positive",
            "PublishDate": 1759324069810,
            "Source": "stock"
        },
        {
            "Title": "Hariom Pipe Industries Signs MOU with Maharashtra Government for Rs 3,135 Crore Steel Plant",
            "Summary": "Hariom Pipe Industries Limited has entered into a Memorandum of Understanding with the Government of Maharashtra on September 19, 2025, to establish an Integrated Steel Plant in Gadchiroli, Maharashtra. The company proposes to invest up to Rs 3,135 crores in this project. Under the agreement, the Maharashtra government will facilitate the company in providing fiscal incentives and obtaining necessary permissions, registrations, approvals, and clearances from concerned departments as per existing policies, rules, and regulations. The parties are not related to the promoter/promoter group, and the transaction does not fall within related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1758276192400,
            "Source": "stock"
        },
        {
            "Title": "Hariom Pipe Industries Sets Record Date for Final Dividend of Rs 0.61 Per Share",
            "Summary": "Hariom Pipe Industries Limited has set September 23, 2025, as the record date for determining shareholder eligibility for a final dividend of Rs 0.61 per equity share for FY 2024-25. The dividend represents 6.10% of the face value of Rs 10 per share. The Board of Directors recommended this dividend at their meeting held on May 9, 2025, subject to approval by members at the 18th Annual General Meeting scheduled for September 30, 2025. If approved, the dividend will be paid within statutory timelines under the Companies Act, 2013.",
            "Sentiment": "positive",
            "PublishDate": 1757143306927,
            "Source": "corporate_action"
        },
        {
            "Title": "Hariom Pipe Industries Presents Growth Strategy at Nuvama Conference, Targets 30% Volume CAGR",
            "Summary": "Hariom Pipe Industries participated in the Nuvama Home Improvement Conference on August 25, 2025, sharing its investor presentation. The company operates with 785,232 MTPA total installed capacity across five manufacturing units in Southern India, producing 800+ SKUs of steel products. With 18+ years of industry experience, the company serves 900+ dealers and B2B clients, generating ~85% sales through dealer network and ~15% through direct B2B sales. The company achieved record sales of 2.45 lakh MT with revenue of ₹1,357 crore in latest results. Key highlights include backward integration capabilities, focus on thin pipes and coils (0.3-2.5mm thickness), and 13% market share in the specialized thin steel category. The company targets 30% volume CAGR over the next 2 years, supported by capacity expansion in value-added products, deeper penetration into Tier 2/3 markets, and strengthening dealer network in Western and Northern India. Recent developments include receiving LOA for 60 MW solar power plant with Maharashtra State Electricity Board and incorporating Hariom Power and Energy Pvt. Ltd. for solar projects. The company maintains EBITDA margin of 12.9% with current solar renewable capacity of 3.4 MW across facilities.",
            "Sentiment": "positive",
            "PublishDate": 1756130360731,
            "Source": "stock"
        },
        {
            "Title": "Ansh Golas Increases Stake in Hariom Pipe Industries Through Open Market Purchase",
            "Summary": "Ansh Golas, a promoter group member of Hariom Pipe Industries Limited, acquired 220 equity shares through open market purchase on August 11, 2025. The transaction increased his shareholding from 146,500 shares (0.47%) to 146,720 shares (0.47%) of the company's total equity capital. The purchase was valued at Rs. 105,305.96. Hariom Pipe Industries has an equity share capital of Rs. 30.97 crores divided into 30,967,289 equity shares of Rs. 10 each. The company is listed on both NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1755492717790,
            "Source": "corporate_action"
        },
        {
            "Title": "Hariom Pipe Industries Reports 35% Volume Growth in Q1 FY26, Exceeds Annual Target",
            "Summary": "Hariom Pipe Industries delivered strong quarterly results with sales volumes reaching 78,221 metric tons, reflecting 35% year-on-year growth and 5% sequential increase. Revenue from operations grew 34% to INR460.96 crore compared to the same quarter last year. EBITDA excluding other income stood at INR57.58 crore with margins maintained at 12.49%, while PAT increased 35% year-on-year to INR23.61 crore with margins improving to 5.11%. The company's average selling price improved 9% sequentially to INR58,931 per metric ton. Value-added products contributed 98% of revenues. The company has started trial production of solar structure products with initial orders of approximately 200 tons per month. Management confirmed their annual volume growth guidance of 30% and expects to maintain current EBITDA per ton levels of around INR7,362. The company's subsidiary Hariom Power Energy has signed a 25-year PPA with MSEDCL to supply 60 MW solar power at INR2.96 per unit, with project completion targeted by September 2026.",
            "Sentiment": "positive",
            "PublishDate": 1755167146145,
            "Source": "earnings"
        },
        {
            "Title": "Hariom Pipes Reports Strong Q1 Growth with Revenue Up 35% and Net Profit Rising 35%",
            "Summary": "Hariom Pipes delivered strong quarterly results with revenue increasing to 4.6 billion rupees from 3.4 billion rupees year-over-year, representing significant growth. Net profit rose to 236 million rupees compared to 175 million rupees in the same period last year. EBITDA improved to 576 million rupees from 446 million rupees year-over-year, though EBITDA margin slightly declined to 12.49% from 13% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754656774865,
            "Source": "earnings"
        },
        {
            "Title": "Hariom Pipe Announces 10-Day Maintenance Shutdown at Telangana Plant",
            "Summary": "Hariom Pipe has announced a 10-day maintenance shutdown at its plant in Telangana. The purpose of this shutdown is to upgrade the technology at the facility.",
            "Sentiment": "neutral",
            "PublishDate": 1752765828000,
            "Source": "default"
        },
        {
            "Title": "Hariom Pipe Industries Reports 35% Increase in Q1 Sales Volume",
            "Summary": "Hariom Pipe Industries has reported a 35% year-over-year increase in total sales volume for the first quarter. The company experienced significant growth in its sales performance compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1751638603000,
            "Source": "default"
        },
        {
            "Title": "Hariom Pipe Targets 30% Volume CAGR Over Next 2 Years",
            "Summary": "Hariom Pipe Industries has announced an ambitious growth target, aiming for a 30% Compound Annual Growth Rate (CAGR) in volume over the next two years. This indicates the company's confidence in its market position and future prospects within the pipe manufacturing industry.",
            "Sentiment": "positive",
            "PublishDate": 1746857392000,
            "Source": "default"
        },
        {
            "Title": "Hariom Pipes Reports Q4 FY2023 Financial Results",
            "Summary": "Hariom Pipes announced its Q4 financial results. EBITDA increased to 488 million rupees from 420 million rupees year-over-year. However, EBITDA margin decreased slightly to 12.22% from 12.7%. Net profit rose marginally to 172 million rupees from 168 million rupees year-over-year, and significantly from 112 million rupees quarter-over-quarter. Revenue grew to 4 billion rupees from 3.3 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1746800247000,
            "Source": "result"
        },
        {
            "Title": "Hariom Pipe Industries Reports 46% YoY Growth in Q4 FY25 Value-Added Products Sales",
            "Summary": "Hariom Pipe Industries has announced a significant increase in its value-added products sales for the fourth quarter of fiscal year 2025. The company reported a 46% year-over-year growth, with sales reaching 72,149 metric tons.",
            "Sentiment": "positive",
            "PublishDate": 1743639078000,
            "Source": "result"
        },
        {
            "Title": "Hariom Pipe Industries Reports 46% YoY Growth in Q4 FY25 Value-Added Products Sales",
            "Summary": "Hariom Pipe Industries has announced a significant increase in its value-added products sales for the fourth quarter of fiscal year 2025. The company reported a 46% year-over-year growth, with sales reaching 72,149 metric tonnes.",
            "Sentiment": "positive",
            "PublishDate": 1743601310000,
            "Source": "result"
        },
        {
            "Title": "Hariom Pipe Industries Modifies Asset Acquisition to Long-Term Lease",
            "Summary": "Hariom Pipe Industries has altered its plan to acquire Ultra Pipes assets. Instead of purchasing, the company has opted for a 40-year lease agreement. This strategic decision allows Hariom Pipe Industries to access the assets without the immediate capital expenditure of an outright purchase.",
            "Sentiment": "neutral",
            "PublishDate": 1741306859000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hariom Pipe Industries Modifies Asset Acquisition to Long-Term Lease",
            "Summary": "Hariom Pipe Industries has altered its plan to acquire Ultra Pipes assets. Instead of an outright purchase, the company has now entered into a 40-year lease agreement for the assets. This modification in strategy suggests a long-term commitment to utilizing Ultra Pipes' assets while potentially reducing immediate capital expenditure.",
            "Sentiment": "neutral",
            "PublishDate": 1741271678000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hariom Pipe Industries Secures 60 MW Solar Power Project with Fixed Tariff",
            "Summary": "Hariom Pipe Industries has secured a 60 MW (AC) solar power capacity project with a fixed Power Purchase Agreement (PPA) tariff of Rs. 2.96 per kilowatt-hour. The agreement is set for a duration of 25 years and includes a subsidy of Rs. 1.05 crore per megawatt.",
            "Sentiment": "positive",
            "PublishDate": 1741073799000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hariom Pipe Industries Secures 60 MW Solar Project Contract",
            "Summary": "Hariom Pipe Industries has received a Letter of Award (LOA) for a 60 MW (AC) solar power project under the 'Mukhyamantri Saur Krushi Vahini Yojana' scheme. This initiative appears to be a state-level solar energy program, likely aimed at promoting solar power in agriculture.",
            "Sentiment": "positive",
            "PublishDate": 1741073751000,
            "Source": "order&deals"
        },
        {
            "Title": "Hariom Pipes Reports Improved Q3 EBITDA and Margin",
            "Summary": "Hariom Pipes has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 326 million rupees to 396 million rupees. Additionally, the EBITDA margin expanded from 11.64% to 13.21%, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739183046000,
            "Source": "earnings"
        },
        {
            "Title": "Hariom Pipes Reports Q3 Financial Results",
            "Summary": "Hariom Pipes has announced its financial results for the third quarter. The company's net profit increased to 112 million rupees, up from 98 million rupees in the same period last year. Revenue also saw growth, reaching 2.99 billion rupees compared to 2.80 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739183041000,
            "Source": "earnings"
        },
        {
            "Title": "Hariom Pipe Industries: Specialised Products to Reach 55% of Production Capacity by FY26",
            "Summary": "Hariom Pipe Industries aims to increase specialised, cold-rolled galvanised products to 55% of total production capacity by FY26. The company is shifting focus to high-value segments like engineering, automobile, and packaging industries. Despite a soft market, galvanised product sales grew 38% year-on-year in the last nine months. The recently commissioned CR Tandem mill will enable production of a wide range of high-quality products.",
            "Sentiment": "positive",
            "PublishDate": 1736562600000,
            "Source": "normal_news"
        }
    ]
}