{
    "Symbol": "HARRMALAYA",
    "ISIN": "INE544A01019",
    "News": [
        {
            "Title": "Harrisons Malayalam Q3FY26 Results Show Strong Growth",
            "Summary": "Harrisons Malayalam Limited reports Q3FY26 profit of ₹763.76 lakhs vs ₹1,120.59 lakhs in Q3FY25. Nine-month profit surged to ₹2,002.41 lakhs from ₹970.81 lakhs YoY.",
            "Sentiment": "positive",
            "PublishDate": 1770643186463,
            "Source": "co_actions_results"
        },
        {
            "Title": "Harrisons Malayalam Board Meet Set for Feb 9, 2026",
            "Summary": "Harrisons Malayalam Limited schedules board meeting on February 9, 2026 to consider Q3FY26 unaudited financial results. Trading window remains closed until February 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769593261607,
            "Source": "co_actions_results"
        },
        {
            "Title": "Harrisons Malayalam Reports Strong Q2 Performance with ₹1,238.65 Lakh Profit Before Tax",
            "Summary": "Harrisons Malayalam Limited reported unaudited financial results for the quarter and half year ended September 30, 2025. The company posted a profit before tax of ₹1,238.65 lakh for the half year, compared to a loss of ₹149.78 lakh in the same period last year. Revenue from operations reached ₹25,086.18 lakh for the half year versus ₹23,495.40 lakh previously. The board designated two executives as part of senior management: Akhilesh Gopinath as Head-Finance and Benil John as Head-Tea Business. The company paid a ₹2,000 penalty to BSE for a one-day delay in filing its annual report for FY2024-25. A new civil suit has been filed by the Government of Kerala challenging ownership of land in tea estates in Wayanad district. The company operates in tea and rubber segments through plantation estates and factories in Kerala and Tamil Nadu.",
            "Sentiment": "positive",
            "PublishDate": 1762990654222,
            "Source": "earnings"
        },
        {
            "Title": "Harrisons Malayalam Limited Head Finance Joby Mathew Resigns",
            "Summary": "Harrisons Malayalam Limited announced the resignation of Joby Mathew, Head Finance, effective from the close of business hours on August 31, 2025. He will cease to be a Senior Managerial Personnel of the company from that date. The company has accepted his resignation. Mathew cited pursuing new challenges and opportunities as the reason for his departure.",
            "Sentiment": "neutral",
            "PublishDate": 1756295457971,
            "Source": "corporate_governance"
        },
        {
            "Title": "Harrisons Malayalam Limited Appoints Ms. Rusha Mitra as Chairperson, Reports Quarterly Profit of ₹596.44 Lakhs",
            "Summary": "Harrisons Malayalam Limited announced key board appointments and quarterly results. Ms. Rusha Mitra, a law graduate and partner at Khaitan & Co., has been appointed as Chairperson of the Board from August 08, 2025 till October 1, 2025, and reappointed as Independent Director for a second five-year term starting February 11, 2026. The company reported unaudited standalone profit of ₹596.44 lakhs for the quarter ended June 30, 2025, compared to a loss of ₹561.20 lakhs in the same quarter last year. Revenue from operations increased to ₹11,645.94 lakhs from ₹9,765.85 lakhs year-on-year. The company operates in tea and rubber production through plantation estates in Kerala and Tamil Nadu. M/s. SEP & Associates has been appointed as Secretarial Auditors for five years from FY 2025-26 to FY 2029-30, subject to shareholder approval. The 48th Annual General Meeting details will be communicated separately.",
            "Sentiment": "positive",
            "PublishDate": 1754647293907,
            "Source": "corporate_governance"
        },
        {
            "Title": "Harrisons Malayalam Reports Increased Q3 Profit and Revenue",
            "Summary": "Harrisons Malayalam has announced its financial results for the third quarter. The company's net profit rose to 112 million rupees, up from 67 million rupees in the same period last year. Revenue also increased to 1.4 billion rupees, compared to 1.3 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739492207000,
            "Source": "earnings"
        },
        {
            "Title": "Harrisons Malayalam Reports Improved Q3 EBITDA and Margin",
            "Summary": "Harrisons Malayalam has reported a significant improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 138 million rupees, up from 88 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin improved to 9.73% from 6.80% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739457554000,
            "Source": "earnings"
        },
        {
            "Title": "Harrisons Malayalam Reports Increased Q3 Profit and Revenue",
            "Summary": "Harrisons Malayalam has announced its financial results for the third quarter. The company's net profit increased to 112 million rupees, up from 67 million rupees in the same period last year. Revenue also saw growth, rising to 1.4 billion rupees from 1.3 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739457550000,
            "Source": "earnings"
        },
        {
            "Title": "Harrisons Malayalam Reports Significant Q2 EBITDA Growth",
            "Summary": "Harrisons Malayalam has reported a substantial increase in its Q2 EBITDA, rising to 74 million rupees from 10 million rupees in the same period last year. The company's EBITDA margin also improved significantly, reaching 5.35% compared to 0.85% in the previous year's Q2.",
            "Sentiment": "positive",
            "PublishDate": 1731339353000,
            "Source": "result"
        },
        {
            "Title": "Harrisons Malayalam Reports Q2 Profit of 41M Rupees",
            "Summary": "Harrisons Malayalam has reported a net profit of 41 million rupees for the second quarter, compared to a loss of 21 million rupees in the same period last year. This marks a significant turnaround for the company. However, it's worth noting that the company reported a loss of 56 million rupees in the previous quarter. Revenue for Q2 increased to 1.37 billion rupees from 1.22 billion rupees year-over-year, indicating improved sales performance.",
            "Sentiment": "positive",
            "PublishDate": 1731339305000,
            "Source": "result"
        }
    ]
}