{
    "Symbol": "HARSHA",
    "ISIN": "INE0JUS01029",
    "News": [
        {
            "Title": "Harsha Engineers China Unit Plans $9.94M Expansion",
            "Summary": "Harsha Engineers International's Chinese subsidiary announces major expansion project worth $9.94 million to boost production capacity by 5.84 million pieces over two years.",
            "Sentiment": "positive",
            "PublishDate": 1770275633614,
            "Source": "stocks"
        },
        {
            "Title": "Harsha Engineers Q3 Net Profit Jumps 25.84% YoY",
            "Summary": "Harsha Engineers International Limited reported consolidated net profit of 336 million rupees in Q3, marking significant growth from 267 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1770275173465,
            "Source": "co_actions_results"
        },
        {
            "Title": "Harsha Engineers Board Meet Set for Feb 5, 2026",
            "Summary": "Harsha Engineers International Limited has scheduled its Board of Directors meeting for February 5, 2026, to consider and approve Q3 FY26 standalone and consolidated unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769065258371,
            "Source": "co_actions_results"
        },
        {
            "Title": "Harsha Engineers Reports Mixed Q2 Performance with Romania Subsidiary Turnaround",
            "Summary": "Harsha Engineers International Limited reported quarterly results with consolidated engineering business revenue of INR 363 crores versus INR 349 crores in the previous quarter. The company achieved 15% topline growth quarter-over-quarter and 10% growth on half-yearly basis for India Engineering business. Romania subsidiary posted strong 38% topline growth and positive EBITDA after several quarters of losses, driven by improved finished product sales and semi-finished casting demand. Combined subsidiary losses reduced to INR 2 crores in first half from INR 17 crores in previous full year. However, EBITDA margins declined due to raw material price pass-through lag and operational challenges at the new Bhayla facility under Harsha Advantek subsidiary, which reported INR 5.7 crores loss in first half. Bronze bushing vertical showed robust 25% sales growth at INR 55 crores, while large-sized cases grew 33% to INR 27 crores. The company spent INR 68 crores on capex in first half and developed 258 new SKUs. Management maintains guidance for high single-digit consolidated topline growth for the full year.",
            "Sentiment": "neutral",
            "PublishDate": 1762887609099,
            "Source": "earnings"
        },
        {
            "Title": "Harsha Engineers Reports Mixed Q2 Results with Higher Revenue and Profit",
            "Summary": "Harsha Engineers reported Q2 consolidated net profit of 364 million rupees, up from 290 million rupees year-over-year. Revenue increased to 3.8 billion rupees from 3.5 billion rupees in the same period last year. The company's EBITDA figures show conflicting data with one report stating 535 million rupees versus 539 million rupees year-over-year, while another correction shows 35 million rupees versus 539 million rupees year-over-year. EBITDA margin decreased to 14.14% from 15.29% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762414537312,
            "Source": "earnings"
        },
        {
            "Title": "Harsha Engineers' Subsidiary Completes Plant Relocation in Ahmedabad",
            "Summary": "Harsha Engineers International Limited announced that its wholly owned subsidiary, Harsha Engineers Advantek Limited, has completed shifting its entire plant machinery and operations from a leased facility to a new plant location in Ahmedabad, Gujarat. The relocation was completed on October 31, 2025, with the company moving from Plot No. A-17 in Steel Town to Survey No. 376-379 in Bhayla. The leased entity contributed Rs 768.11 lakhs in turnover (0.55% of consolidated turnover) and Rs 79.57 lakhs in profit after tax (0.89% of consolidated PAT) in FY25. The company stated that no material impact on financial performance is anticipated from this operational shift.",
            "Sentiment": "neutral",
            "PublishDate": 1761923440919,
            "Source": "stock"
        },
        {
            "Title": "Harsha Engineers Reports Revenue Growth to INR 349 Crores in Q1 FY2026",
            "Summary": "Harsha Engineers International Limited reported consolidated revenue of INR 349 crores in Q1 FY2026, up from INR 330 crores in Q4 FY2025 and INR 327 crores in Q1 FY2025. The engineering business generated EBITDA of INR 65.2 crores while the solar division contributed INR 16.4 crores in revenue with INR 0.9 crores EBITDA. The company commissioned Phase 1 of its greenfield facility Harsha Advantek in May 2025 and secured a long-term bushing contract with peak annual sales potential of INR 117 crores. India engineering business performed at par with the previous quarter, with significant improvement in large-sized cages and strong bushing business traction. Romania operations achieved one of their highest sales in recent quarters while China operations continued positive performance. The company expects low-teens top-line growth for India engineering business and higher single-digit consolidated growth in FY2026, with bushing revenue projected to grow at least 30%. However, challenges include sluggish auto sector demand in India, softening U.S. demand, and ongoing losses at Romania and China subsidiaries.",
            "Sentiment": "positive",
            "PublishDate": 1754974912741,
            "Source": "earnings"
        },
        {
            "Title": "Harsha Engineers Reports 5.3% Growth in Q1 Net Profit to 379 Million Rupees",
            "Summary": "Harsha Engineers reported quarterly consolidated net profit of 379 million rupees compared to 360 million rupees in the same period last year. Revenue increased to 3.65 billion rupees from 3.43 billion rupees year-over-year. EBITDA rose marginally to 554 million rupees from 552 million rupees, though EBITDA margin declined to 14.2% from 16.1% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754466238428,
            "Source": "earnings"
        },
        {
            "Title": "Harsha Engineers Secures INR 117 Crore Annual Contract with Multinational Company",
            "Summary": "Harsha Engineers International Limited has entered into a long-term agreement with a leading multinational company for the supply of journal bearings and bushings. The agreement is effective from July 31, 2025, and covers both the company and its subsidiaries as suppliers. The contract has an initial period of three years and is valued at approximately INR 117 crores per annum. The agreement involves recurring supply of journal bearings and bushings for both domestic and international markets. The multinational entity awarding the contract is an international company, and there are no related party transactions or promoter group interests involved in this deal.",
            "Sentiment": "positive",
            "PublishDate": 1754053523723,
            "Source": "order&deals"
        },
        {
            "Title": "Harsha Engineers Begins Production at New Ahmedabad Plant",
            "Summary": "Harsha Engineers has commenced production and invoicing operations at its new manufacturing facility in Ahmedabad. The company has started commercial production and begun generating revenue from this new plant.",
            "Sentiment": "positive",
            "PublishDate": 1750928796000,
            "Source": "default"
        },
        {
            "Title": "Harsha Engineers Reports Q4 FY2023 Financial Results",
            "Summary": "Harsha Engineers International Limited has released its Q4 FY2023 financial results, showing a significant decline in performance compared to the same period last year. The company reported a Q4 EBITDA of 185 million rupees, down from 623 million rupees year-over-year. The EBITDA margin decreased to 4.96% from 16.37%. Revenue slightly decreased to 3.7 billion rupees from 3.8 billion rupees. The company reported a consolidated net loss of 24 million rupees, compared to a profit of 370 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1746690084000,
            "Source": "result"
        },
        {
            "Title": "Harsha Engineers Signs LOI for Stamping Products Supply",
            "Summary": "Harsha Engineers has signed a Letter of Intent (LOI) with a leading multinational group for the supply of stamping products. The agreement is expected to generate an estimated annual revenue of 18 crore rupees over a period of 5 years.",
            "Sentiment": "positive",
            "PublishDate": 1745662316000,
            "Source": "default"
        },
        {
            "Title": "Harsha Engineers International Reports Improved Q3 EBITDA and Margin",
            "Summary": "Harsha Engineers International has reported its Q3 financial results. The company's EBITDA increased to 428 million rupees from 398 million rupees year-over-year. Additionally, the EBITDA margin improved to 12.62% from 12.25% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739432539000,
            "Source": "earnings"
        },
        {
            "Title": "Harsha Engineers International Reports Q3 Revenue Growth",
            "Summary": "Harsha Engineers International announced its third-quarter revenue of 3.3 billion rupees, showing an increase from 3.25 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1739432438000,
            "Source": "earnings"
        },
        {
            "Title": "Harsha Engineers International Reports Q3 Consolidated Net Profit",
            "Summary": "Harsha Engineers International has reported a consolidated net profit of 267 million rupees for the third quarter, compared to 297 million rupees in the same period last year, indicating a year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1739432390000,
            "Source": "earnings"
        },
        {
            "Title": "Harsha Engineers International Secures Major Agreement with Bearing Company",
            "Summary": "Harsha Engineers International has entered into an agreement with a bearing company. The estimated order value from this agreement is expected to be between 6 to 10 million euros per annum.",
            "Sentiment": "positive",
            "PublishDate": 1733405279000,
            "Source": "order&deals"
        },
        {
            "Title": "Harsha Engineers International Receives $1M Insurance Settlement",
            "Summary": "Harsha Engineers International has announced that their insurance company has settled a claim, paying out $1 million to the company.",
            "Sentiment": "positive",
            "PublishDate": 1732620689000,
            "Source": "corporate_action"
        },
        {
            "Title": "Harsha Engineers International Reports Q2 EBITDA Growth",
            "Summary": "Harsha Engineers International has reported its Q2 financial results. The company's EBITDA increased to 418 million rupees from 352 million rupees year-over-year. The EBITDA margin also improved, rising to 11.87% from 10.38% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731310618000,
            "Source": "result"
        },
        {
            "Title": "Harsha Engineers International Reports Q2 Profit Growth",
            "Summary": "Harsha Engineers International has announced its Q2 consolidated net profit of 290 million rupees, showing an increase from 204 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731310479000,
            "Source": "result"
        }
    ]
}