{
    "Symbol": "HATHWAY",
    "ISIN": "INE982F01036",
    "News": [
        {
            "Title": "Hathway Cable Q3 EBITDA Falls 7% to ₹772M",
            "Summary": "Hathway Cable reports Q3 EBITDA of ₹772M vs ₹831M YoY, with EBITDA margin declining to 14.38% from 16.25%, despite strong 58% net profit growth to ₹217M.",
            "Sentiment": "neutral",
            "PublishDate": 1768489702178,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hathway Cable Reports Q3FY26 Financial Results",
            "Summary": "Hathway Cable and Datacom Limited announced Q3FY26 results with consolidated revenue of ₹536.56 crores and net profit of ₹21.71 crores for the quarter ended December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767790877040,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hathway Cable Sells Entire Stakes in Four Companies for ₹40",
            "Summary": "Hathway Cable and Datacom Limited sold its complete equity stakes in three subsidiaries and one associate company to Infomedia and Networking Private Limited for a total consideration of ₹40. The divested companies were non-operating entities with nil contribution to Hathway's consolidated turnover and net worth for FY 2024-25, and have ceased to be subsidiaries/associates of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1763551363438,
            "Source": "corporate_action"
        },
        {
            "Title": "Hathway Cable Appoints Amrish Kumar as Vice President of Billing & Collection",
            "Summary": "Hathway Cable and Datacom Limited's Board of Directors approved the appointment of Mr. Amrish Kumar as Vice President of Billing & Collection, effective November 17, 2025. The appointment was based on the recommendation of the Nomination and Remuneration Committee. Kumar brings over 22 years of experience in billing, collections, and customer lifecycle management. He holds an MCA degree from Punjab University and an MBA from Sikkim Manipal University. Kumar joins from Vodafone Idea Ltd., where he served as General Manager – Prepaid Operations and Retention Head.",
            "Sentiment": "positive",
            "PublishDate": 1760533573175,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hathway Cable Reports Q2 FY26 Results with Net Profit of ₹18.25 Crores",
            "Summary": "Hathway Cable and Datacom Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported consolidated revenue from operations of ₹536.67 crores compared to ₹512.74 crores in the same quarter last year. Net profit stood at ₹18.25 crores versus ₹25.78 crores in the previous year quarter. For the half-year period, revenue increased to ₹1,067.17 crores from ₹1,015.35 crores, while net profit rose to ₹49.28 crores from ₹44.10 crores. The company operates through three segments: Broadband Business (₹146.85 crores revenue), Cable Television Business (₹378.51 crores revenue), and Dealing in Securities (₹10.98 crores revenue). Earnings per share for the quarter was ₹0.10. The company continues to face demands from the Department of Telecommunications totaling ₹3,201.93 crores, which it is contesting based on legal advice.",
            "Sentiment": "neutral",
            "PublishDate": 1760532605721,
            "Source": "earnings"
        },
        {
            "Title": "Hathway Cable Settles Arbitration Case with No Financial Impact",
            "Summary": "Hathway Cable and Datacom Limited has reached a settlement in an arbitration case with minority shareholders of its joint venture, Hathway Rajesh Multichannel Private Limited. The arbitrator passed an award on July 29, 2025, based on mutually agreed consent terms between the company and the minority shareholders. The company stated there is no financial impact from the arbitration award and no effect on its business or operations. The settlement resolves the arbitration that was initially disclosed by the company in August 2023.",
            "Sentiment": "positive",
            "PublishDate": 1753954217017,
            "Source": "stock"
        },
        {
            "Title": "Hathway Cable & Datacom Reports Increased Q1 Profits and Revenue",
            "Summary": "Hathway Cable & Datacom has reported its Q1 consolidated financial results. The company's net profit increased to 310 million rupees from 183.7 million rupees in the same quarter last year. Revenue rose to 5.3 billion rupees from 5.03 billion rupees year-over-year. EBITDA improved to 873 million rupees from 806.7 million rupees, with the EBITDA margin increasing to 16.44% from 16.05% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1752625041000,
            "Source": "default"
        },
        {
            "Title": "Hathway Cable & Datacom Reports Q1 Financial Results",
            "Summary": "Hathway Cable & Datacom has reported its Q1 financial results. The company's EBITDA increased to 873 million rupees from 806.7 million rupees year-over-year. The EBITDA margin improved to 16.44% from 16.05% in the same period last year. Consolidated net profit rose to 310 million rupees from 183.7 million rupees year-over-year. Revenue for Q1 increased to 5.3 billion rupees from 5.03 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1752580690000,
            "Source": "result"
        },
        {
            "Title": "Hathway Cable and Datacom Reports Q4 Financial Results and Subsidiary Amalgamation",
            "Summary": "Hathway Cable and Datacom announced the amalgamation of five step-down wholly-owned subsidiaries with Hathway Digital. The company reported Q4 financial results, showing improvements in EBITDA and revenue. Q4 EBITDA increased to 907.5M rupees from 802.1M rupees year-over-year, with EBITDA margin rising to 17.68% from 16.26%. Revenue grew to 5.13B rupees from 4.93B rupees. Consolidated net profit for Q4 was 346.8M rupees, slightly up from 345.7M rupees year-over-year and 136.7M rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745331823000,
            "Source": "default"
        },
        {
            "Title": "Hathway Cable & Datacom to Consider Q4 Results on April 22",
            "Summary": "Hathway Cable & Datacom has announced that its board of directors will meet on April 22 to consider and approve the company's financial results for the fourth quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1744722123000,
            "Source": "default"
        },
        {
            "Title": "Hathway Cable and Datacom to Sell 49% Stake in Hathway Patiala",
            "Summary": "Hathway Cable and Datacom has announced its decision to sell a 49% equity stake in Hathway Patiala for 2.5 million rupees. This move represents a significant corporate action that will alter the ownership structure of the subsidiary company.",
            "Sentiment": "neutral",
            "PublishDate": 1742825446000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hathway Cable & Datacom: Q3 Profit Drops 38.81% YoY Amid Marginal Revenue Growth",
            "Summary": "Hathway Cable & Datacom reported Q3 FY25 results with profit falling 38.81% YoY to ₹13.67 crore. Revenue increased marginally by 1.3% to ₹511.15 crore. Operating income improved 42.51% YoY but declined 176.92% QoQ. EPS decreased to ₹0.08, down 38.46% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1737006964000,
            "Source": "earnings"
        },
        {
            "Title": "Hathway Cable & Datacom Reports Q3 Financial Results",
            "Summary": "Hathway Cable & Datacom has released its Q3 financial results. The company reported a consolidated net profit of 137 million rupees, down from 223 million rupees in the same quarter last year. Revenue for Q3 increased slightly to 5.11 billion rupees, up 1.19% from 5.05 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1736900229000,
            "Source": "earnings"
        },
        {
            "Title": "Hathway Cable & Datacom Reports Q3 EBITDA Growth",
            "Summary": "Hathway Cable & Datacom announced its Q3 financial results. The company's EBITDA increased to 831 million rupees from 825 million rupees year-over-year. However, the EBITDA margin slightly decreased to 16.25% from 16.33% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1736852184000,
            "Source": "earnings"
        },
        {
            "Title": "Hathway Cable & Datacom Reports Q3 Financial Results",
            "Summary": "Hathway Cable & Datacom has announced its Q3 consolidated financial results. The company reported a net profit of 137 million rupees, down from 223 million rupees in the same quarter last year. Revenue for the quarter increased slightly to 5.11 billion rupees, compared to 5.05 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1736852170000,
            "Source": "earnings"
        },
        {
            "Title": "Hathway Cable and Datacom Acquires Majority Stake in Hathway Cable MCN Nanded",
            "Summary": "Hathway Cable and Datacom has announced the acquisition of a 61.15% equity stake in Hathway Cable MCN Nanded Private Limited. This move represents a significant expansion of Hathway's ownership in the regional cable network operator.",
            "Sentiment": "positive",
            "PublishDate": 1732720727000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hathway Cable & Datacom Reports Q2 EBITDA Growth",
            "Summary": "<p>Hathway Cable & Datacom announced its <span class='neutral'>Q2 financial results</span>. The company's <span class='positive'>EBITDA increased</span> to <b>862.6 million rupees</b> from 826.3 million rupees year-over-year. However, the <span class='negative'>EBITDA margin slightly decreased</span> to <b>16.82%</b> from 17.08% in the same period last year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728646311000,
            "Source": "result"
        },
        {
            "Title": "Hathway Cable & Datacom Reports Q2 Revenue Growth",
            "Summary": "<p>Hathway Cable & Datacom has reported a <span class='neutral'>revenue</span> of <b>5.13 billion rupees</b> for the second quarter, showing an <span class='positive'>increase</span> from <b>4.84 billion rupees</b> year-over-year and <b>5.03 billion rupees</b> quarter-over-quarter.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728646301000,
            "Source": "result"
        },
        {
            "Title": "Hathway Cable & Datacom Reports Q2 Profit Increase",
            "Summary": "<p>Hathway Cable & Datacom has reported a consolidated <span class='positive'>net profit</span> of <b>258 million rupees</b> for the second quarter, showing an <span class='positive'>increase</span> from <b>201 million rupees</b> year-over-year and <b>183.7 million rupees</b> quarter-over-quarter.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728646292000,
            "Source": "result"
        },
        {
            "Title": "Hathway Cable and Datacom Schedules Q2 Results Board Meeting",
            "Summary": "<p><span class=\"neutral\">Hathway Cable and Datacom</span> has announced a <b>board meeting</b> on <span class=\"neutral\">October 11</span> to <span class=\"neutral\">consider and approve</span> the company's <b>financial results</b> for the <span class=\"neutral\">second quarter</span> of the current fiscal year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728053201000,
            "Source": "corporate_action"
        }
    ]
}