{
    "Symbol": "HATSUN",
    "ISIN": "INE473B01035",
    "News": [
        {
            "Title": "Hatsun's Arun Icecreams Sets Guinness World Record",
            "Summary": "Arun Icecreams brought together 5,113 children in Hyderabad to create the largest ice cream social party, setting a new Guinness World Record and surpassing the previous record of 962 people.",
            "Sentiment": "positive",
            "PublishDate": 1770396903018,
            "Source": "stocks"
        },
        {
            "Title": "Hatsun Agro Shareholders Approve Director Reappointment",
            "Summary": "Hatsun Agro Product Limited shareholders approved the reappointment of Mr. V R Muthu as Non-Executive Independent Director for a second five-year term through postal ballot voting concluded on January 21, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769155894032,
            "Source": "stocks"
        },
        {
            "Title": "Arun Icecreams Sets Guinness World Record in Chennai",
            "Summary": "Hatsun Agro's Arun Icecreams brand achieved a Guinness World Record on January 21, 2026, with 4,008 children forming the longest chain of people licking ice cream in Chennai, surpassing Canada's 15-year-old record.",
            "Sentiment": "positive",
            "PublishDate": 1768994744463,
            "Source": "stocks"
        },
        {
            "Title": "Hatsun Agro Gets ESG Score 56.2 from SES Research",
            "Summary": "Hatsun Agro Product Limited receives voluntary ESG rating of 56.2 from SEBI-licensed SES ESG Research Private Limited based on publicly available information without company engagement.",
            "Sentiment": "neutral",
            "PublishDate": 1768905475367,
            "Source": "stocks"
        },
        {
            "Title": "Hatsun Agro Q3: Revenue, net profit surge on steady demand",
            "Summary": "Hatsun Agro Product reported 48% YoY growth in net profit to ₹60.6 crore for Q3FY26. Revenue increased 17.6% to ₹2,364 crore driven by steady consumer demand across dairy categories and stable milk procurement.",
            "Sentiment": "positive",
            "PublishDate": 1768806132632,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hatsun Agro Q3 Revenue Jumps 15% to ₹2,314 Cr",
            "Summary": "Hatsun Agro Product reported Q3 revenue of ₹2,314 crores, up 15% YoY from ₹2,010 crores. EBITDA rose 20% to ₹257 crores with improved margins. Net profit surged 64% to ₹67.10 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768805780219,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hatsun Agro Gets Credit Rating Upgrade from CRISIL",
            "Summary": "CRISIL upgraded Hatsun Agro Product's long-term credit rating to AA/Stable from AA-/Positive on bank loan facilities worth ₹2,120 crores, reflecting improved creditworthiness of the dairy company.",
            "Sentiment": "positive",
            "PublishDate": 1768380177108,
            "Source": "stocks"
        },
        {
            "Title": "Hatsun Agro CFO Gets Caution Letter for Q3 Results Leak",
            "Summary": "Hatsun Agro issued caution letter to CFO H Ramachandran after inadvertent disclosure of Q3 financial results on WhatsApp status. Company formed investigation committee and froze trading for 19 exposed persons.",
            "Sentiment": "negative",
            "PublishDate": 1768327869195,
            "Source": "stocks"
        },
        {
            "Title": "Hatsun Agro Reports WhatsApp UPSI Leak Incident",
            "Summary": "Hatsun Agro Product Limited submits action taken report to stock exchanges after CFO inadvertently posted draft financial information on WhatsApp status, exposing 19 people to UPSI.",
            "Sentiment": "negative",
            "PublishDate": 1768321755757,
            "Source": "stocks"
        },
        {
            "Title": "Hatsun Agro Board Meet Set for Jan 19 to Review Q3 Results",
            "Summary": "Hatsun Agro Product Limited has scheduled a board meeting on January 19, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767958283050,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hatsun Agro: Top executive uploads draft Q3 results on WhatsApp status by mistake",
            "Summary": "Hatsun Agro Product disclosed that a key managerial personnel accidentally uploaded draft Q3 financial statements on personal WhatsApp status, viewed by 19 contacts including insiders before deletion within an hour.",
            "Sentiment": "negative",
            "PublishDate": 1767616528294,
            "Source": "stocks"
        },
        {
            "Title": "Hatsun Agro Products Gets Credit Rating Reaffirmation from CRISIL",
            "Summary": "CRISIL Ratings Limited reaffirmed Hatsun Agro Products' credit rating at AA-/Positive for bank loan facilities worth Rs. 2,120 crores, with no rating change from previous assessment. The rating reaffirmation indicates maintained creditworthiness for the dairy and food products company's substantial borrowing facilities.",
            "Sentiment": "positive",
            "PublishDate": 1764320089320,
            "Source": "stock"
        },
        {
            "Title": "Hatsun Agro Chairman Outlines High-Protein Product Launch and Expansion Strategy",
            "Summary": "Hatsun Agro Products Chairman RG Chandramogan announced plans to launch high-protein products within 3-6 months during an interview with ET Now. The company operates 4,300 retail outlets and claims to be the top private milk seller in India and among the top two ice cream players. Chandramogan stated the current dairy to value-added products ratio is 55:45, with value-added products expected to grow. The company has invested 1,200 crores in infrastructure over 7-8 years and operates with 100% refrigerated transportation for milk and curd. Hatsun plans to expand Arun Ice Cream outlets from 820-834 to 1,200 within two years and Ibaco outlets from 226 to 280-300. The company achieved 17.5% growth in the latest quarter compared to market growth of 8-10%. Chandramogan emphasized that 98% of their business is value-added, with branded products sold directly to consumers through their retail network.",
            "Sentiment": "positive",
            "PublishDate": 1762830027053,
            "Source": "stock"
        },
        {
            "Title": "Hatsun Agro Product Limited Confirms News Article Publication in Hindu Business Line",
            "Summary": "Hatsun Agro Product Limited informed stock exchanges BSE and NSE about a news article published in Hindu Business Line on November 10, 2025. The company filed this disclosure under SEBI listing regulations. The article, titled 'Hatsun earns its place in the sun' and 'Dairy sweepstakes: Hatsun milks the margins,' discusses the company's position as India's largest private dairy company with the highest industry margins. The article mentions the company's performance and market position in the dairy sector.",
            "Sentiment": "positive",
            "PublishDate": 1762756549063,
            "Source": "stock"
        },
        {
            "Title": "Hatsun Agro Product Reports Quarterly Results and Pays Rs 133.65 Crore Interim Dividend",
            "Summary": "Hatsun Agro Product Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company declared and paid an interim dividend of Rs 6 per equity share (600%) on 22.27 crore shares, totaling Rs 133.65 crores. This represents the first interim dividend for financial year 2025-26. The company operates in the milk and milk products segment and has a pending scheme for amalgamation with its wholly-owned subsidiary Milk Mantra Dairy Private Limited, subject to NCLT approval. The Board also noted related party transactions for the reporting period.",
            "Sentiment": "positive",
            "PublishDate": 1761546112133,
            "Source": "earnings"
        },
        {
            "Title": "Hatsun Agro Product Reports Strong Q2 Performance with 87% Jump in Net Profit",
            "Summary": "Hatsun Agro Product delivered robust quarterly results with net profit surging to 1.2 billion rupees from 643 million rupees year-over-year. Revenue grew to 23.8 billion rupees compared to 20.7 billion rupees in the same period last year. The company's EBITDA increased to 3.31 billion rupees from 2.42 billion rupees, while EBITDA margin improved to 13.64% from 11.68% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1761545494492,
            "Source": "earnings"
        },
        {
            "Title": "Hatsun Agro Gets NCLT Approval to Skip Shareholder Meetings for Milk Mantra Merger",
            "Summary": "The National Company Law Tribunal, Cuttack Bench, approved dispensing with shareholder and creditor meetings for Hatsun Agro Product Limited's merger with its wholly-owned subsidiary Milk Mantra Dairy Private Limited. The tribunal's order dated September 26, 2025, eliminates the need for meetings as all equity shareholders, preference shareholders, and over 90% of unsecured creditors provided written consent through affidavits. The merger aims to consolidate business activities, achieve operational synergies, and strengthen the combined entity's financial position. Both companies operate in the dairy products business, with the appointed date for amalgamation set as April 1, 2025. The scheme does not involve issuing new shares or affecting Hatsun Agro's capital structure, as Milk Mantra is already 100% owned by Hatsun Agro.",
            "Sentiment": "positive",
            "PublishDate": 1758980410425,
            "Source": "corporate_action"
        },
        {
            "Title": "Hatsun Agro Chairman Expects Significant Growth from Proposed GST Rate Cut on Dairy Products",
            "Summary": "Hatsun Agro Product Limited's Chairman R G Chandramogan discussed the potential impact of proposed GST rate changes on dairy products in an interview. The proposed GST reduction from current rates of 12% (up to 18% on ice cream) to a flat 5% rate is expected to boost demand meaningfully and improve export competitiveness. The company reported weak Q1 FY26 performance with 9% revenue growth versus 15% guidance and margins of 13.9% against expected 14-15%. However, management expects 15% growth for H1 FY26 with better H2 performance, and describes FY27 as potentially 'glorious'. The company currently exports ice cream to 8 countries and sees significant export opportunities, expecting exports to increase from H2 FY26. The GST reduction is anticipated to enable better farmer payments, increase production, and help India become more competitive in global dairy markets. India currently exports only 1 million tons of dairy products compared to New Zealand's 20 million tons, despite India's production of 240 million tons.",
            "Sentiment": "positive",
            "PublishDate": 1756213288655,
            "Source": "stock"
        },
        {
            "Title": "Hatsun Agro Chairman Sees GST Cut on Dairy Products as Key to Export Growth",
            "Summary": "RG Chandramogan, Chairman of Hatsun Agro Product, stated that reducing GST on dairy products from 12% to 5% could transform India's dairy industry by empowering farmers, spurring demand, and positioning India as a global dairy export leader. He advocated for a uniform 5% GST rate on all dairy products, including ice cream, replacing the current multi-tier structure of 5%, 12%, and 18%. India produces 240 million tonnes of milk annually but exports only one million tonnes, compared to New Zealand's 20 million tonnes which represents 35% of global dairy trade. Chandramogan attributed this export gap to heavy taxation, particularly the 12% GST on products like ghee. He expressed optimism about Prime Minister Modi's announcement regarding next-generation GST reforms expected by Diwali. The proposed GST reduction is anticipated to deliver better consumer prices, higher farmer earnings, and increased export potential. Chandramogan predicted the second half of FY26 could be better with the following year being glorious. Regarding trade negotiations, he expressed doubt about US dairy products entering India due to different feeding practices and consumer preferences, identifying New Zealand as a more significant competitive threat. Hatsun Agro shares closed 0.27% lower at Rs 910 on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1755847633854,
            "Source": "stock"
        },
        {
            "Title": "Hatsun Agro Shares Jump 9% on Strong Quarterly Results and Margin Expansion",
            "Summary": "Hatsun Agro Product Ltd. shares surged 9% following strong quarterly results. The company achieved gross margins of 32.3%, marking a multi-quarter high, up from 31.6% in the previous quarter. Revenue grew 9% year-on-year, driven by summer demand in the ice cream segment and contributions from the Milk Mantra acquisition. The company benefited from retail milk price increases of ₹1.5 to ₹2.5 per litre and higher sales of value-added products like ghee and butter. EBITDA rose 9% with gross margins expanding 60-70 basis points. Net profit growth was modest due to higher depreciation and acquisition-related costs. Despite the rally, the stock remains 24% below its 52-week high and down 18% over the past year.",
            "Sentiment": "positive",
            "PublishDate": 1753077023915,
            "Source": "earnings"
        },
        {
            "Title": "Hatsun Agro Product Announces Interim Dividend",
            "Summary": "Hatsun Agro Product has declared an interim dividend of 6 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1752842055000,
            "Source": "default"
        },
        {
            "Title": "Hatsun Agro Product Reports Q1 Financial Results",
            "Summary": "Hatsun Agro Product has released its Q1 financial results. The company's EBITDA increased to 3.7 billion rupees from 3.3 billion rupees year-over-year. The EBITDA margin improved to 14.60% from 13.91% in the same period last year. Net profit rose to 1.4 billion rupees from 1.31 billion rupees, while revenue grew to 25.35 billion rupees from 23.75 billion rupees compared to the previous year's Q1.",
            "Sentiment": "positive",
            "PublishDate": 1752841843000,
            "Source": "result"
        },
        {
            "Title": "Hatsun Agro Products: Q1 Profit Up 3%, Announces ₹6 Interim Dividend",
            "Summary": "Hatsun Agro Products reported a 3.45% YoY increase in Q1 FY2026 net profit to ₹135 crore. Revenue rose 9.1% to ₹2,590 crore. EBITDA grew 9.1% to ₹361 crore with a stable 14% margin. The company declared a ₹6 per share interim dividend, payable by August 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1752841240000,
            "Source": "earnings"
        },
        {
            "Title": "Hatsun Agro Product Reports Q4 Financial Results",
            "Summary": "Hatsun Agro Product announced its Q4 financial results. The company reported a net profit of 496 million rupees, compared to 521.6 million rupees year-over-year and 409 million rupees quarter-over-quarter. Revenue for Q4 was 22 billion rupees, up from 20.47 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1745844104000,
            "Source": "result"
        },
        {
            "Title": "Hatsun Agro Product Ltd: Milestone 4,000th Daily Outlet Opens in Andhra Pradesh",
            "Summary": "Hatsun Agro Product Ltd has launched its 4,000th daily outlet in Bhimavaram, Andhra Pradesh, expanding its retail presence. The outlet offers various dairy brands including Arun Icecreams, Arokya, Hatsun, and Hanobar. The company plans further expansion across multiple states in India.",
            "Sentiment": "positive",
            "PublishDate": 1742381717000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hatsun Agro Increases Stake in Milk Mantra Dairy",
            "Summary": "Hatsun Agro Product Limited has increased its shareholding in Milk Mantra Dairy to 99.84%. This significant increase in ownership suggests a strategic move by Hatsun Agro to strengthen its position in the dairy sector.",
            "Sentiment": "positive",
            "PublishDate": 1741056567000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hatsun Agro Product: SBI Mutual Fund Boosts Stake to Nearly 8%",
            "Summary": "SBI Mutual Fund increased its stake in Hatsun Agro Product to 7.9710% through market purchases on January 20, 2025. The fund acquired 12,82,661 shares, representing a 0.5758% increase from its previous 7.3952% holding.",
            "Sentiment": "neutral",
            "PublishDate": 1737534768000,
            "Source": "block_deals"
        },
        {
            "Title": "Hatsun Agro Product Acquires Milk Mantra Dairy",
            "Summary": "Hatsun Agro Product has acquired a 100% stake in Milk Mantra Dairy for Rs 233 crore. This acquisition represents a significant corporate action in the dairy industry, potentially expanding Hatsun Agro Product's market presence and production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1737424693000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hatsun Agro Product Reports Q3 Results and Approves Investment",
            "Summary": "Hatsun Agro Product announced its Q3 financial results, reporting a net profit of 409 million rupees, down from 574 million rupees in the same quarter last year. Revenue increased to 20.09 billion rupees from 18.9 billion rupees year-over-year. The company also approved an investment of 12 million rupees in FP Solar Shakti.",
            "Sentiment": "neutral",
            "PublishDate": 1737073349000,
            "Source": "earnings"
        },
        {
            "Title": "Hatsun Agro Product Approves Investment in FP Solar Shakti",
            "Summary": "Hatsun Agro Product has approved an investment of 12 million rupees in FP Solar Shakti. This decision represents a strategic move by the company, potentially aimed at expanding its renewable energy capabilities or diversifying its investment portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1737029506000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hatsun Agro Product Reports Q3 Financial Results",
            "Summary": "Hatsun Agro Product has released its Q3 financial results. The company's EBITDA for the quarter stood at 2.14 billion rupees, compared to 2.13 billion rupees in the same quarter last year, showing a slight increase. However, the EBITDA margin decreased from 11.27% in the previous year to 10.65% in the current quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737028583000,
            "Source": "earnings"
        },
        {
            "Title": "Hatsun Agro Product Reports Q3 Financial Results",
            "Summary": "Hatsun Agro Product has announced its financial results for the third quarter. The company reported a net profit of 409 million rupees, down from 574 million rupees in the same quarter last year. However, revenue increased to 20.09 billion rupees from 18.9 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737028575000,
            "Source": "earnings"
        },
        {
            "Title": "Hatsun Agro: Q2 Revenue Growth Below Expectations, Margins Expand",
            "Summary": "Hatsun Agro reported lower-than-expected revenue growth in Q2, but maintained strong margin expansion according to ICICI Securities' review.",
            "Sentiment": "neutral",
            "PublishDate": 1730794365000,
            "Source": "result"
        },
        {
            "Title": "Hatsun Agro Product Reports Q2 Revenue Growth",
            "Summary": "Hatsun Agro Product, an Indian dairy company, has reported its second quarter revenue for the current fiscal year. The company's revenue increased to 20.7 billion rupees, up from 19.05 billion rupees in the same quarter of the previous year, representing year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730704395000,
            "Source": "result"
        },
        {
            "Title": "Hatsun Agro Product Reports Q2 EBITDA Growth",
            "Summary": "Hatsun Agro Product announced its Q2 financial results. The company's EBITDA increased to 2.42 billion rupees, up from 2.19 billion rupees in the same quarter last year. The EBITDA margin also improved slightly to 11.68% from 11.48% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730704377000,
            "Source": "result"
        },
        {
            "Title": "Hatsun Agro Product Reports Q2 Net Profit Decline",
            "Summary": "Hatsun Agro Product, an Indian dairy company, has reported a net profit of 643 million rupees for the second quarter, down from 776 million rupees in the same period last year. This represents a year-over-year decrease in profits.",
            "Sentiment": "negative",
            "PublishDate": 1730704332000,
            "Source": "result"
        }
    ]
}