{
    "Symbol": "HAVELLS",
    "ISIN": "INE176B01034",
    "News": [
        {
            "Title": "Havells India Gets Accumulate Rating with ₹1,634 Target",
            "Summary": "Prabhudas Lilladher maintains accumulate rating on Havells India with target price of ₹1,634, citing moderate Q3FY26 growth driven by 32.8% surge in wires & cables segment and strong heating product demand.",
            "Sentiment": "positive",
            "PublishDate": 1768893924768,
            "Source": "co_actions_results"
        },
        {
            "Title": "Havells India Stock Falls 4.5% After Q3 Results",
            "Summary": "Havells India shares declined over 4.5% following the release of Q3 financial results, reflecting investor reaction to the consumer electrical goods maker's quarterly performance.",
            "Sentiment": "negative",
            "PublishDate": 1768891674921,
            "Source": "co_actions_results"
        },
        {
            "Title": "Havells Warns of Demand Impact from Rising Raw Material Costs",
            "Summary": "Havells India management indicates that escalating raw material prices may negatively affect short-term product demand, highlighting cost pressures facing the electrical equipment manufacturer.",
            "Sentiment": "negative",
            "PublishDate": 1768886325106,
            "Source": "stocks"
        },
        {
            "Title": "CLSA Sets Outperform Rating on Havells with ₹1,670 Target",
            "Summary": "CLSA maintains an Outperform rating on Havells India with a target price of ₹1,670, indicating positive analyst sentiment for the electrical equipment manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1768880693454,
            "Source": "stocks"
        },
        {
            "Title": "Nomura Issues Buy Rating on Havells with ₹1,798 Target",
            "Summary": "Nomura Securities has issued a Buy recommendation for Havells India with a target price of ₹1,798 per share, indicating positive analyst sentiment for the electrical equipment manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1768880668236,
            "Source": "stocks"
        },
        {
            "Title": "Goldman Sachs Raises Havells Target to ₹1,880",
            "Summary": "Goldman Sachs maintains Buy rating on Havells India, raising target price to ₹1,880 from ₹1,730, indicating strong confidence in the electrical equipment manufacturer's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1768880645333,
            "Source": "stocks"
        },
        {
            "Title": "Motilal Oswal Maintains Neutral on Havells at ₹1,590",
            "Summary": "Motilal Oswal Securities maintains neutral rating on Havells India with target price of ₹1,590, reflecting measured outlook on the electrical equipment manufacturer's prospects.",
            "Sentiment": "neutral",
            "PublishDate": 1768880619316,
            "Source": "stocks"
        },
        {
            "Title": "Morgan Stanley Cuts Havells Target Price to ₹1,532",
            "Summary": "Morgan Stanley maintains Equal Weight rating on Havells India but reduces target price from ₹1,660 to ₹1,532, reflecting revised valuation expectations for the electrical equipment manufacturer.",
            "Sentiment": "neutral",
            "PublishDate": 1768880596199,
            "Source": "stocks"
        },
        {
            "Title": "Citi Maintains Neutral Rating on Havells at ₹1,600",
            "Summary": "Citi Research continues its 'Neutral' stance on Havells India with a target price of ₹1,600, reflecting measured outlook on the electrical equipment manufacturer's prospects.",
            "Sentiment": "neutral",
            "PublishDate": 1768880541186,
            "Source": "stocks"
        },
        {
            "Title": "Jefferies Sets Hold Rating on Havells at ₹1,555",
            "Summary": "Jefferies maintains Hold rating on Havells with target price of ₹1,555, reflecting cautious outlook on the electrical equipment manufacturer's near-term prospects.",
            "Sentiment": "neutral",
            "PublishDate": 1768880515129,
            "Source": "stocks"
        },
        {
            "Title": "Havells Plans Cautious AC Production Strategy",
            "Summary": "Havells adopts cautious production approach for summer products like ACs while focusing on inventory clearance. Solar segment margins show mixed performance with future growth optimism.",
            "Sentiment": "neutral",
            "PublishDate": 1768878952643,
            "Source": "stocks"
        },
        {
            "Title": "Havells Plans ₹1,000 Cr Capex for FY27 Growth",
            "Summary": "Havells India announces major capital expenditure of ₹1,000 crores for FY27, focusing on cables, wires, and new R&D center despite facing industry challenges from price increases and commodity costs.",
            "Sentiment": "positive",
            "PublishDate": 1768878928728,
            "Source": "stocks"
        },
        {
            "Title": "Havells Q3FY26: Revenue up 14.3%, net profit rises 8%",
            "Summary": "Havells India reported Q3FY26 consolidated revenue of ₹5,587.89 crores, up 14.3% YoY, with net profit at ₹300.05 crores. Board declared interim dividend of ₹4 per share with record date January 23, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768824967011,
            "Source": "co_actions_results"
        },
        {
            "Title": "Havells Q3FY26: Revenue beats estimates, profit misses",
            "Summary": "Havells India Q3FY26 revenue grew 14.2% to ₹5,573 cr, beating estimates of ₹5,354 cr, but net profit of ₹301 cr missed Street expectations of ₹346 cr. EBITDA margin improved to 9.4% with ₹4 interim dividend declared.",
            "Sentiment": "neutral",
            "PublishDate": 1768823885100,
            "Source": "co_actions_results"
        },
        {
            "Title": "Havells Q3FY26: Revenue up 14.1%, profit rises 6.6%",
            "Summary": "Havells India reported Q3FY26 consolidated revenue of ₹55.87 billion (up 14.3% YoY) and net profit of ₹3.00 billion (up 7.1% YoY), missing analyst estimates. Board declared interim dividend of ₹4 per share.",
            "Sentiment": "positive",
            "PublishDate": 1768822294602,
            "Source": "co_actions_results"
        },
        {
            "Title": "Havells India Schedules Q3FY26 Earnings Call",
            "Summary": "Havells India Limited announces earnings conference call on January 19, 2026, at 5:45 PM IST to discuss Q3FY26 and nine-month financial results ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768329208282,
            "Source": "co_actions_results"
        },
        {
            "Title": "Havells India schedules Q3FY26 earnings call for Jan 19",
            "Summary": "Havells India Limited has scheduled an earnings conference call on January 19, 2026, at 5:45 PM IST to discuss Q3FY26 financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768326966458,
            "Source": "co_actions_results"
        },
        {
            "Title": "Havells India Block Trade Worth ₹45.04 Crores",
            "Summary": "Havells India witnessed a significant block trade on NSE worth ₹45.04 crores involving 301,828 shares at ₹1,492.30 per share, indicating substantial institutional activity in the stock.",
            "Sentiment": "neutral",
            "PublishDate": 1767942631701,
            "Source": "co_actions_results"
        },
        {
            "Title": "Havells India Board Meet Jan 19 for Q3FY26 Results",
            "Summary": "Havells India Limited has scheduled a board meeting on January 19, 2026, to consider Q3FY26 financial results and interim dividend payment under Regulation 29.",
            "Sentiment": "neutral",
            "PublishDate": 1767848065398,
            "Source": "co_actions_results"
        },
        {
            "Title": "Havells India Block Trade Worth ₹25.82 Crores",
            "Summary": "Havells India witnessed a significant NSE block trade involving 174,104 shares at ₹1,483.00 per share, totaling ₹25.82 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1767690371350,
            "Source": "co_actions_results"
        },
        {
            "Title": "Havells Clarifies Volume Movement to BSE",
            "Summary": "Havells India responds to BSE inquiry about significant trading volume increase, confirming compliance with disclosure regulations and stating no unpublished price-sensitive information exists.",
            "Sentiment": "neutral",
            "PublishDate": 1767263005671,
            "Source": "stocks"
        },
        {
            "Title": "Havells India faces ₹1.10 cr IT penalty for FY10",
            "Summary": "Havells India Limited received income tax penalty of ₹1.10 crores for financial year 2009-10. Company plans to file appeal, expects no material impact on operations.",
            "Sentiment": "negative",
            "PublishDate": 1767262293860,
            "Source": "stocks"
        },
        {
            "Title": "HC Clarifies GST Council Role on Air Purifier Tax Cut",
            "Summary": "High Court states GST rate reduction on air purifiers is policy decision for GST council comprising all state members, cannot give concrete instructions to individual states.",
            "Sentiment": "neutral",
            "PublishDate": 1766568816631,
            "Source": "stocks"
        },
        {
            "Title": "Havells Appoints Reshu Madan as President SBU Head",
            "Summary": "Havells India Limited announces the appointment of Mr. Reshu Madan as President SBU Head, bringing nearly three decades of proven leadership experience across diverse industries including roles at Sterlite Electric and TBEA Energy.",
            "Sentiment": "positive",
            "PublishDate": 1765971851508,
            "Source": "stocks"
        },
        {
            "Title": "Havells Appoints Manjit Singh Sethi as President-Cables",
            "Summary": "Havells India Limited announces the appointment of Manjit Singh Sethi as President-Cables, effective December 15, 2025. Sethi brings over 35 years of electrical industry experience from ABB India and KEC International.",
            "Sentiment": "positive",
            "PublishDate": 1765785368623,
            "Source": "stocks"
        },
        {
            "Title": "Morgan Stanley Maintains Equal-weight on Havells",
            "Summary": "Morgan Stanley maintains Equal-weight rating on Havells India with price target of ₹1,660.00, reflecting analyst confidence in the consumer durables company's market position.",
            "Sentiment": "neutral",
            "PublishDate": 1765770436882,
            "Source": "stocks"
        },
        {
            "Title": "Havells India Acquires 26% Stake in Kundan Solar for 15 MW Solar Power Project",
            "Summary": "Havells India will purchase a 26% stake in Kundan Solar (Pali) Pvt Ltd as part of a 15 MW solar power project. The acquisition represents Havells' strategic move into renewable energy infrastructure development.",
            "Sentiment": "positive",
            "PublishDate": 1764159863526,
            "Source": "order&deals"
        },
        {
            "Title": "Havells India Settles Trademark Dispute with HPL Group for Rs. 129.60 Crores",
            "Summary": "Havells India Limited has signed a settlement agreement with HPL Group and its promoters, resolving all pending disputes and litigations related to the use of the HAVELLS trademark. The disputes included suits filed in various courts including the Delhi High Court and Special Leave Petitions in the Supreme Court. The Delhi High Court had referred these disputes to mediation, and the settlement was executed on November 8, 2025. Under the agreement, HPL Group acknowledges Havells India Limited's absolute rights to the HAVELLS mark since 1971 and has waived any claims to the trademark. HPL Group has undertaken not to use or challenge the mark and agreed to change the corporate names of Havells Private Limited and Havells Electronics Private Limited to names not containing HAVELLS. As a one-time settlement, Havells India Limited will pay Rs. 129.60 crores to HPL Group.",
            "Sentiment": "positive",
            "PublishDate": 1762660794486,
            "Source": "stock"
        },
        {
            "Title": "LIC Increases Stake in Havells India to 7.043% Through Market Purchases",
            "Summary": "Life Insurance Corporation of India has acquired additional shares in Havells India Ltd through market purchases between May 26, 2025 and November 6, 2025. LIC's shareholding increased from 5.004% to 7.043% of the total share capital. The acquisition involved 12,793,294 shares representing 2.039% of Havells' equity share capital. The total holding after acquisition stands at 44,183,676 shares. Havells' total equity share capital remains at 62,72,56,842 shares. The disclosure was made under SEBI regulations for substantial acquisition of shares.",
            "Sentiment": "neutral",
            "PublishDate": 1762531672195,
            "Source": "corporate_action"
        },
        {
            "Title": "Havells India Executive Vice President Vivek Yadav Retires Due to Superannuation",
            "Summary": "Havells India Limited announced a change in its senior management with the retirement of Vivek Yadav, Executive Vice President, on October 31, 2025, due to superannuation. The company informed stock exchanges NSE and BSE about this senior management change as required under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1761897942745,
            "Source": "corporate_governance"
        },
        {
            "Title": "Havells India Plans ₹60 Crore Washing Machine Capacity Expansion at Ghiloth Plant",
            "Summary": "Havells India Limited announced plans to expand its washing machine production capacity at its Ghiloth manufacturing plant. The company will add 1,50,000 units per annum to its existing capacity of 6,80,000 units per annum. The expansion requires an investment of approximately ₹60 crores, which will be funded through internal accruals. The capacity addition is expected to be completed by December 2026. The company's existing capacity utilization stands at 52% based on production volume. The expansion aims to cater to the market with a complete range of washing machines.",
            "Sentiment": "positive",
            "PublishDate": 1761652585900,
            "Source": "stock"
        },
        {
            "Title": "Havells India Appoints Pankaj Mohan Arora as Executive President - Finance",
            "Summary": "Havells India Limited has appointed Pankaj Mohan Arora as Executive President - Finance, effective October 27, 2025. Arora brings extensive experience from his role as Managing Director at Russell Reynolds Associates for over six years, where he led the consumer sector practice and worked in the Board and CEO practice. He previously served as a Partner with KPMG India for over five years in their Governance, Risk, and Compliance practice, where he established and led their Board Leadership Centre. Arora also held the position of Managing Director at Protiviti Consulting and began his career in 1996 with Arthur Andersen, later working with EY and American Express Financial Advisors. He holds a Bachelor of Commerce with Honours from Shri Ram College of Commerce and is a Chartered Accountant, having achieved all India ranks in both intermediate and final examinations.",
            "Sentiment": "positive",
            "PublishDate": 1761566031450,
            "Source": "corporate_governance"
        },
        {
            "Title": "Havells India Reports Decent Q2 Performance Despite Summer Product Weakness and High Channel Inventories",
            "Summary": "Havells India delivered decent overall performance in Q2 FY26 but faced challenges in summer products including air conditioners, fans and coolers which experienced revenue decline year-on-year due to shorter summer season and elevated channel inventories. The company expects channel inventories to normalize by end of Q3. Cables business maintained steady growth momentum driven by strong power cables performance, with the company acquiring 39 acres of land adjacent to existing Alwar facility for capacity expansion. LED price stabilization in lighting showed initial pickup in residential demand. Lloyd segment faced significant decline in contribution margins due to customer support schemes offered to clear channel inventories, though these schemes have been withdrawn following GST changes. Higher working capital levels, especially for cables and Lloyd, led to reduced cash balances and lower interest income. The company remains optimistic about second half performance following recent GST rate reductions on air conditioners, TVs and solar products. Management indicated capex of INR 1,450 crores for FY26 and estimated INR 1,000 crores for FY27, with focus on premiumization strategy across product categories.",
            "Sentiment": "neutral",
            "PublishDate": 1761146087483,
            "Source": "earnings"
        },
        {
            "Title": "Havells India Q2 Revenue Grows 5% YoY But Misses Estimates; Yes Securities Maintains Add Rating",
            "Summary": "Havells India reported 5% year-over-year revenue growth in Q2, falling short of analyst estimates by 2% and consensus estimates by 1%. The revenue miss was attributed to a steeper-than-expected decline in summer products, with ECD segment dropping 1.8% YoY and Lloyd declining 18.5% YoY. However, B2B infrastructure products showed positive momentum, with switchgears growing 8.0% YoY and cables and wires expanding 12.4% YoY. Yes Securities has reiterated its Add rating on the stock with expectations of normalcy returning from Q4 onwards.",
            "Sentiment": "neutral",
            "PublishDate": 1760948066690,
            "Source": "earnings"
        },
        {
            "Title": "Havells India Reports 19% Growth in Quarterly Net Profit to 3.19 Billion Rupees",
            "Summary": "Havells India delivered quarterly net profit of 3.19 billion rupees, up from 2.68 billion rupees year-over-year, beating estimates of 3.05 billion rupees. Revenue grew to 47.79 billion rupees from 45.39 billion rupees, matching estimates of 47.7 billion rupees. EBITDA increased to 4.38 billion rupees from 3.75 billion rupees, though fell short of estimates of 4.55 billion rupees. EBITDA margin improved to 9.17% from 8.26%, but remained below the estimated 9.5%.",
            "Sentiment": "positive",
            "PublishDate": 1760919260803,
            "Source": "earnings"
        },
        {
            "Title": "Havells India Reports 16.5% Net Profit Growth in Q2 FY26 Despite Summer Product Weakness",
            "Summary": "Havells India reported net revenue of Rs 4,767 crores in Q2 FY26, marking 5.2% year-over-year growth. Net profit increased 16.5% to Rs 317 crores, while EBITDA grew 16.3% to Rs 442 crores with margins improving to 9.3% from 8.4% in the previous year. The cables segment showed strong performance with 12.4% revenue growth and improved margins, while Lloyd Consumer faced challenges with 18.5% revenue decline due to weak summer demand and higher channel inventory. The company's electrical consumer durables segment declined 1.8% primarily due to weakness in fans and air coolers. Other income included Rs 45.27 crores from asset sales following the relocation of switchgear business. For the half-year period, net revenue declined 1.2% to Rs 10,204 crores with net profit down 2% to Rs 670 crores. The company maintained cash and cash equivalents of Rs 1,449 crores and invested Rs 600 crores in acquiring a stake in Goldi Solar during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1760700300626,
            "Source": "earnings"
        },
        {
            "Title": "Havells India Reports Quarterly Results for Second Quarter Ended September 30, 2025",
            "Summary": "Havells India Limited submitted its unaudited standalone and consolidated financial results for the second quarter and half-year ended September 30, 2025. The Board of Directors approved the results during a meeting held on October 17, 2025. The financial statements include standalone and consolidated results, balance sheets, and cash flow statements. Price Waterhouse & Co Chartered Accountants LLP conducted a limited review of the results. The consolidated results include four subsidiaries and one associate company. The financial statements show various operational metrics including cost of raw materials, employee benefits expense, finance costs, and depreciation expenses across different reporting periods.",
            "Sentiment": "neutral",
            "PublishDate": 1760697329007,
            "Source": "earnings"
        },
        {
            "Title": "Havells International to Acquire 20% Stake in Salesmark Ventures LLC",
            "Summary": "Havells International has announced plans to acquire a 20% stake in Salesmark Ventures LLC. The acquisition represents the company's expansion into new business ventures through strategic partnerships.",
            "Sentiment": "positive",
            "PublishDate": 1759753454136,
            "Source": "order&deals"
        },
        {
            "Title": "Havells Schedules Q2 Financial Results Review for October 17",
            "Summary": "Havells has announced it will review its Q2 financial results on October 17. The company has set this date for examining its quarterly performance.",
            "Sentiment": "neutral",
            "PublishDate": 1759469383283,
            "Source": "earnings"
        },
        {
            "Title": "Havells India Launches Lloyd Kolors Refrigerator on Flipkart",
            "Summary": "Havells India has launched the Lloyd Kolors Refrigerator on the Flipkart platform. The product is positioned as a smart and stylish cooling solution aimed at Indian households.",
            "Sentiment": "positive",
            "PublishDate": 1758625774204,
            "Source": "stock"
        },
        {
            "Title": "Havells India Receives Land Offer from RIICO to Expand Cable Manufacturing at Alwar Plant",
            "Summary": "Havells India Limited has been offered additional land measuring 158,200 square meters by the Rajasthan State Industrial Development & Investment Corporation Limited (RIICO) in Alwar. The land allotment is intended for expanding the company's cable manufacturing capacities and is located adjacent to Havells' existing manufacturing facility at Alwar. This development follows the company's earlier announcement in May about proposed enhancement of cable manufacturing capacities at its Alwar plant.",
            "Sentiment": "positive",
            "PublishDate": 1758101949554,
            "Source": "stock"
        },
        {
            "Title": "Havells India Grants Rs 250 Crore to Establish Management School at Ashoka University",
            "Summary": "Havells India announced a Rs 250 crore grant to establish the Havells School of Management and Leadership at Ashoka University. The school will offer undergraduate programs in Applied Liberal Arts and Management, marking the first such program in India, with aspirations to become a top ten global undergraduate management program. The school will also provide integrated postgraduate programs in partnership with leading business schools. This represents Havells India's third and largest commitment to Ashoka University, following the legacy of founder Qimat Rai Gupta who first made a grant to the university in 2014. The endowment will be distributed over a period of time. The school aims to combine management education with liberal arts foundations and will include academic and industry partnerships for student exchange programs, joint programs, and executive education. Ashoka University's existing InfoEdge Centre for Entrepreneurship will be integrated into the new school.",
            "Sentiment": "positive",
            "PublishDate": 1757132162551,
            "Source": "stock"
        },
        {
            "Title": "Havells India Projects Solar Business to Cross Rs 1,500 Crore Despite Q1 Revenue Decline",
            "Summary": "Havells India's Chairman and Managing Director Anil Rai Gupta projected the company's solar business could reach Rs 1,000-1,500 crore in the next couple of years, citing huge growth potential in the solar segment. The company invested Rs 600 crore in PV module manufacturer Goldi Solar during the first quarter to expand its renewable energy portfolio. However, Havells reported declining quarterly results with revenue down 6% to Rs 5,437.81 crore, EBITDA falling 9.9% to Rs 519.91 crore, and net profit dropping 14% to Rs 352.34 crore. Gupta described the Q1 challenges as transitory and expects gradual improvement in coming quarters. Havells shares closed 1.17% lower at Rs 1,474, with the stock declining 18.55% over the last 12 months. Among 43 analysts, 31 maintain buy ratings with an average price target suggesting 15.2% potential upside.",
            "Sentiment": "neutral",
            "PublishDate": 1754926603558,
            "Source": "earnings"
        },
        {
            "Title": "Havells India Block Trade Worth Rs. 58.44 Crores Executed on NSE",
            "Summary": "Havells India executed a block trade on the National Stock Exchange involving approximately 395,025 shares at Rs. 1,479.50 per share, totaling Rs. 58.44 crores. The transaction represents a significant institutional trading activity for the electrical equipment manufacturer.",
            "Sentiment": "neutral",
            "PublishDate": 1754891920987,
            "Source": "order&deals"
        },
        {
            "Title": "Havells India Reports Challenging Q1 FY26 Results Amid Weak Summer Demand, Invests Rs 600 Crores in Goldi Solar",
            "Summary": "Havells India faced a challenging first quarter with unexpected weak summer conditions and prolonged subdued consumer demand affecting cooling products revenue. The decline was particularly pronounced due to a strong base from the previous year. However, the Cables & Wires segment showed robust growth driven by infrastructure and industrial demand, with the company announcing additional CAPEX commitment of over Rs 340 crores for capacity expansion. During the quarter, Havells invested Rs 600 crores in Goldi Solar to accelerate growth in the renewable sector and expand its solar portfolio through module manufacturing capabilities. The company reported that rural sales comprise 5-6% of overall consumer product revenues but are growing faster than urban areas. Lloyd business maintained margin improvements despite revenue challenges, with management indicating continued investment in brand building and distribution. Cable and wire business achieved 27% value growth and 20-21% volume growth, with capacity doubling planned from FY24 to FY27. Management expects Q1 challenges to be transitory and anticipates revenue growth and margin improvements in coming quarters.",
            "Sentiment": "neutral",
            "PublishDate": 1753353138208,
            "Source": "earnings"
        },
        {
            "Title": "Havells India Shares Worth Rs. 61.73 Crores Traded in NSE Block Deal",
            "Summary": "Havells India witnessed a block trade on NSE involving approximately 404,026 shares at a price of Rs. 1,527.80 per share. The total transaction value amounted to Rs. 61.73 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1753167332030,
            "Source": "order&deals"
        },
        {
            "Title": "Havells Plans ₹600 Cr Solar Investment Amid Consumer Weakness",
            "Summary": "Havells is focusing on long-term growth strategies including industrial demand expansion and a ₹600 crore investment in solar business. The company is also working on improving operational efficiency while facing short-term weakness in consumer demand.",
            "Sentiment": "neutral",
            "PublishDate": 1753117028489,
            "Source": "stock"
        },
        {
            "Title": "Havells Q1 Profit Falls 14% to Rs 352 Crore as Weak Summer Hurts AC Sales",
            "Summary": "Havells India reported a 14% decline in standalone net profit to Rs 352 crore for the first quarter ending June, with net sales dropping 6% to Rs 5,438 crore. The company attributed the decline to an unexpectedly weak summer that impacted sales of air-conditioners, fans and air-coolers. The large appliance business under the Lloyd brand fell 34% to Rs 1,262 crore, while electrical consumer durables declined 14% to Rs 906 crore. However, the switchgears business grew 9% to Rs 630 crore and cables business surged 27% to Rs 1,933 crore. Chairman Anil Rai Gupta noted high channel inventory for ACs will take 1-2 quarters to liquidate, with production being adjusted accordingly. He expects the challenges to be transitory with revenue growth and margin improvements in coming quarters.",
            "Sentiment": "negative",
            "PublishDate": 1753113847366,
            "Source": "earnings"
        },
        {
            "Title": "Havells India Reports Decline in Q1 Financial Performance",
            "Summary": "Havells India reported consolidated net profit of 3.48 billion rupees in Q1, down from 4.1 billion rupees in the same period last year. Revenue decreased to 54.55 billion rupees from 58.1 billion rupees year-over-year. EBITDA fell to 5.16 billion rupees compared to 5.73 billion rupees previously, while EBITDA margin compressed to 9.46% from 9.87% in the prior year period.",
            "Sentiment": "negative",
            "PublishDate": 1753094393879,
            "Source": "earnings"
        },
        {
            "Title": "Havells Schedules Q1 Earnings Call for July 21",
            "Summary": "Havells has announced its Q1 earnings call, which is scheduled for July 21 at 5:15 PM. The company will discuss its quarterly financial results during this call.",
            "Sentiment": "neutral",
            "PublishDate": 1752650228000,
            "Source": "default"
        }
    ]
}