{
    "Symbol": "HAVISHA",
    "ISIN": "INE293B01029",
    "News": [
        {
            "Title": "Sri Havisha Hospitality Reports Loss of ₹329.35 Lakhs in Q2 FY2025-26",
            "Summary": "Sri Havisha Hospitality And Infrastructure Limited reported a net loss of ₹329.35 lakhs for the second quarter ended September 30, 2025, compared to a loss of ₹160.07 lakhs in the same quarter last year. Revenue from operations declined to ₹312.30 lakhs from ₹423.50 lakhs year-over-year. For the half-year period, the company posted a loss of ₹645.08 lakhs versus ₹781.61 lakhs in the previous year. The company's total assets stood at ₹7,468.82 lakhs as of September 30, 2025. Cash and cash equivalents decreased significantly to ₹8.02 lakhs from ₹47.96 lakhs at the end of March 2025. The company made a payment of ₹89.99 lakhs to Telangana State Power Distribution Company towards cross subsidy surcharge for electricity from grid power generators dating back 25-30 years, which is currently under legal challenge.",
            "Sentiment": "negative",
            "PublishDate": 1762934336670,
            "Source": "earnings"
        },
        {
            "Title": "Sri Havisha Hospitality Reappoints Abhaya Shankar as Independent Director for Second 5-Year Term",
            "Summary": "Sri Havisha Hospitality And Infrastructure Limited has approved the reappointment of Mr. Abhaya Shankar as Non-Executive Independent Director for a second term of 5 years, effective September 20, 2025. The 69-year-old director brings over 44 years of management experience, including more than 20 years as CEO/MD, with expertise in business transformation and strategic guidance across various industries. The reappointment was approved by the Board of Directors based on the recommendation of the Nomination and Remuneration Committee. Shankar currently holds directorships in several other companies including Kellton Tech Solutions Limited, UCAL Limited, and HIL Limited.",
            "Sentiment": "positive",
            "PublishDate": 1758432013721,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sri Havisha Hospitality Publishes Q1 FY2025 Financial Results; Multiple Banks Issue Asset Recovery Notices",
            "Summary": "Sri Havisha Hospitality And Infrastructure Limited published its unaudited financial results for the quarter ended June 30, 2025, which were approved by the Board of Directors on August 11, 2024. The results were published in Financial Express and Ninadam on August 13, 2025. Separately, multiple financial institutions including IDBI Bank, HDFC Bank, and Karnataka Bank have issued various recovery notices and e-auction announcements for defaulted loans. IDBI Bank issued possession notices for properties worth Rs. 61.84 lakh and Rs. 20.59 lakh respectively. HDFC Bank issued a notice under Section 13(2) for outstanding liabilities of Rs. 26.47 lakh. Karnataka Bank announced e-auctions for immovable properties with secured debts of Rs. 1.59 crore and Rs. 1.31 crore. Additionally, Telogica Limited reported quarterly results showing revenue from operations of Rs. 314.74 lakh for Q1 FY2025 compared to Rs. 207.89 lakh in the previous year, with a profit before tax of Rs. 15.87 lakh.",
            "Sentiment": "negative",
            "PublishDate": 1755065082143,
            "Source": "earnings"
        },
        {
            "Title": "Sri Havisha Hospitality Reports Q1 2025 Loss of Rs 178.28 Lakhs, Schedules 32nd AGM for September 20",
            "Summary": "Sri Havisha Hospitality and Infrastructure Limited reported a net loss of Rs 178.28 lakhs for the quarter ended June 30, 2025, compared to a loss of Rs 167.51 lakhs in the same period last year. Total income increased to Rs 306.70 lakhs from Rs 307.74 lakhs year-over-year. The Board approved the quarterly results and scheduled the 32nd Annual General Meeting for September 20, 2025, via video conferencing. Key agenda items include re-appointment of Mr. Dharmin Dontamsetti as director and Mr. Abhaya Shankar as Non-Executive Independent Director. The company also approved related party transactions with Managing Director Mr. Venkat Manohar Dontamsetti and the issuance of sweat equity shares to him. M/s Krishna Kumar & Associates was appointed as Secretarial Auditor for five years from FY 2025-26 to FY 2029-30. The company paid Rs 99.91 lakhs under protest to Telangana State Power Distribution Company for Cross Subsidy Surcharge, with the matter currently pending before Telangana High Court.",
            "Sentiment": "negative",
            "PublishDate": 1754926073443,
            "Source": "corporate_action"
        }
    ]
}