{
    "Symbol": "HBLENGINE",
    "ISIN": "INE292B01021",
    "News": [
        {
            "Title": "HBL Engineering Q3FY26 Net Profit Surges 254% YoY",
            "Summary": "HBL Engineering reported stellar Q3FY26 results with net profit jumping 254% YoY to ₹217.69 crores. Revenue grew 90% to ₹863.65 crores driven by strong Electronics segment performance.",
            "Sentiment": "positive",
            "PublishDate": 1770487980004,
            "Source": "co_actions_results"
        },
        {
            "Title": "HBL Engineering Wins Rs.575 Crore KAVACH Order",
            "Summary": "HBL Engineering Limited secures major order worth Rs.575 crores from Integral Coach Factory, Chennai for supply, testing and commissioning of On-board KAVACH equipment (Ver.4.0) to be completed within 12 months.",
            "Sentiment": "positive",
            "PublishDate": 1769844937435,
            "Source": "co_actions_results"
        },
        {
            "Title": "HBL Engineering shares fall 13% on Kavach tender loss",
            "Summary": "HBL Engineering shares declined 14% after failing to secure CLW's 6,300-unit Kavach locomotive tender due to competitive pricing. Company maintains FY27 Kavach sales target of ₹1,900 crore.",
            "Sentiment": "negative",
            "PublishDate": 1768538952600,
            "Source": "stocks"
        },
        {
            "Title": "HBL Engineering Misses Kavach Tender, Projects ₹1,900 Cr",
            "Summary": "HBL Engineering failed to secure CLW locomotive Kavach tender for 6,300 units due to higher pricing but maintains revenue projections of ₹1,900 crores for FY2027 from remaining Kavach business.",
            "Sentiment": "neutral",
            "PublishDate": 1768474544949,
            "Source": "stocks"
        },
        {
            "Title": "HBL Engineering Ships 1,659 Loco TCAS Units",
            "Summary": "HBL Engineering delivered 1,659 out of 2,200 locomotive TCAS units by December 13, 2025, with 541 units cancelled. Company projects demand of 18,429 units for next year.",
            "Sentiment": "positive",
            "PublishDate": 1766042622366,
            "Source": "stocks"
        },
        {
            "Title": "HBL Engineering Reports Strong Q2 Performance with 382% Jump in Net Profit",
            "Summary": "HBL Engineering Limited reported net profit of ₹382.20 crores for the quarter ended September 30, 2025, compared to ₹80.50 crores in the same quarter last year. Total income from operations increased to ₹1,203.16 crores from ₹520.48 crores year-on-year. For the half-year period, net profit reached ₹521.93 crores versus ₹154.75 crores in the previous year. The company noted that Q2 has been extraordinarily good and management does not expect such results in any single quarter in the next few years. The company also stated that FY26 as a whole would be an exceptional year and should not be a basis for future performance expectations. Exceptional items of ₹23.82 crores included ₹23.65 crores pertaining to unrecoverable costs incurred during development of high-performance batteries for torpedoes.",
            "Sentiment": "positive",
            "PublishDate": 1762606761538,
            "Source": "earnings"
        },
        {
            "Title": "HBL Engineering Secures ₹54 Crore New Contract",
            "Summary": "HBL Engineering has secured a new contract worth ₹54 crore.",
            "Sentiment": "positive",
            "PublishDate": 1754971284078,
            "Source": "stock"
        },
        {
            "Title": "HBL Engineering Shares Surge 14% to Eight-Month High on Strong Q1 Results",
            "Summary": "HBL Engineering Ltd. reported strong quarterly results with consolidated net profit rising 79% to Rs 143 crore from Rs 80 crore in the previous year. Revenue increased 15.7% to Rs 602 crore from Rs 520 crore, while EBITDA jumped 74% to Rs 192 crore from Rs 110 crore. Profit margin expanded to 31.9% from 21.2%. The Hyderabad-based battery and power system company serves defense, aviation, electric mobility, electronics, and battery energy storage sectors globally. Shares jumped 14.04% to Rs 684, reaching the highest level since December 20, 2024. Trading volume was 21 times the 30-day average, with the RSI at 72.84 indicating overbought conditions. Two analysts maintain buy ratings with an average price target suggesting 28.5% upside potential.",
            "Sentiment": "positive",
            "PublishDate": 1754892876065,
            "Source": "earnings"
        },
        {
            "Title": "HBL Engineering Reports Strong Q1 Results with 88% Jump in Net Profit, Reappoints Chairman for 5 Years",
            "Summary": "HBL Engineering Limited reported robust quarterly results with net profit surging 88.2% to ₹139.73 crores compared to ₹74.25 crores in the same period last year. Revenue from operations grew 15% to ₹587.68 crores, while EBITDA margin expanded significantly to 34.3% from 22% year-on-year. The Board reappointed Dr. Aluru Jagadish Prasad as Chairman and Managing Director for another five-year term starting October 1, 2025, subject to shareholder approval. The company set book closure dates from September 13-25, 2025, and record date as September 12, 2025 for e-voting and dividend eligibility. All three business segments - Industrial Batteries, Defence & Aviation Batteries, and Electronics - contributed to the strong performance, with the Electronics segment showing particularly improved profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754746462106,
            "Source": "earnings"
        },
        {
            "Title": "HBL Engineering: Secures Rs 133 Crore Railway Contract for Kavach Safety System",
            "Summary": "HBL Engineering won a Rs 132.95 crore contract from South Central Railway to implement the Kavach safety system on the Vijayawada–Ballarshah section. The company also received a Rs 30.67 crore contract to upgrade Kavach in the Mudkhed–Manmad section. HBL's total order book now stands at Rs 4,029.05 crore.",
            "Sentiment": "positive",
            "PublishDate": 1750054306000,
            "Source": "order&deals"
        },
        {
            "Title": "HBL Engineering Secures ₹133 Crore Order from South Central Railway",
            "Summary": "HBL Engineering has been awarded a contract worth ₹133 crores by South Central Railway for work on the Vijayawada–Ballarshah line. The order is related to railway infrastructure development, though specific details of the project are not provided in the given information.",
            "Sentiment": "positive",
            "PublishDate": 1750039661000,
            "Source": "default"
        },
        {
            "Title": "HBL Engineering Wins ₹30.67 Crore Contract from South Central Railway",
            "Summary": "HBL Engineering has secured a contract worth ₹30.67 crore from South Central Railway. The contract involves upgrading the Kavach system to Version 4.0 over a stretch of 350 kilometers. Kavach is likely a railway safety or signaling system, though the article doesn't provide specific details about its function.",
            "Sentiment": "positive",
            "PublishDate": 1750038714000,
            "Source": "default"
        },
        {
            "Title": "HBL Engineering Secures ₹132.95 Crore Contract for Kavach Systems Installation",
            "Summary": "HBL Engineering has been awarded a contract by South Central Railway for the installation of Kavach systems at 48 stations. The contract is valued at ₹132.95 crores. Kavach is likely a railway safety or signaling system, though the specific details are not provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1749974162000,
            "Source": "default"
        },
        {
            "Title": "IRCON International Issues Letter of Acceptance to HBL Engineering",
            "Summary": "HBL Engineering has announced that IRCON International has issued a Letter of Acceptance worth 1.02 billion rupees to the company.",
            "Sentiment": "positive",
            "PublishDate": 1748346376000,
            "Source": "default"
        },
        {
            "Title": "HBL Engineering Reports Decline in Q4 Financial Performance",
            "Summary": "HBL Engineering has released its Q4 financial results, showing a decrease in key metrics compared to the same period last year. The company's consolidated net profit fell to 449 million rupees from 815 million rupees year-over-year. Revenue decreased to 4.76 billion rupees from 6.1 billion rupees. EBITDA declined to 795 million rupees from 1.31 billion rupees, with the EBITDA margin dropping to 16.71% from 21.55%.",
            "Sentiment": "negative",
            "PublishDate": 1748223228000,
            "Source": "default"
        },
        {
            "Title": "HBL Engineering Reports Decline in Q4 EBITDA and Margin",
            "Summary": "HBL Engineering has reported its quarterly results. The company's Q4 EBITDA decreased to 795 million rupees from 1.31 billion rupees year-over-year. The Q4 EBITDA margin also declined to 16.71% from 21.55% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1748087184000,
            "Source": "result"
        },
        {
            "Title": "HBL Engineering Reports Decline in Q4 Financial Results",
            "Summary": "HBL Engineering has reported its latest quarterly financial results. The company's consolidated net profit for Q4 decreased to 449 million rupees from 815 million rupees in the same quarter last year. Revenue also declined to 4.76 billion rupees from 6.1 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748086973000,
            "Source": "result"
        },
        {
            "Title": "HBL Engineering: Q4 EBITDA Drops 40.7%, Margin Contracts",
            "Summary": "HBL Engineering reported Q4 FY24 results: Net profit down 23.3% to ₹51.3 crore, revenue declined 24% to ₹459.8 crore, EBITDA fell 40.7% to ₹78 crore, and margin contracted to 16.94% from 21.74% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748083325000,
            "Source": "earnings"
        },
        {
            "Title": "HBL Engineering: Kavach System 4.0 Approval Boosts Stock",
            "Summary": "HBL Engineering received RDSO approval for Kavach System Version 4.0, becoming the first Indian company to do so. The company can now deliver against its ₹3,763.83 crore order book, expected to be completed within 24 months. The stock surged 6% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1747198440000,
            "Source": "normal_news"
        },
        {
            "Title": "HBL Engineering: First to Secure Kavach 4.0 Approval",
            "Summary": "HBL Engineering received approval from RDSO for Kavach System Version 4.0, becoming the first company to do so. The company will begin deliveries against an order book of ₹3,763.83 crore, expected to complete within 24 months. Recently, HBL also received a ₹145.83 crore contract from Western Railway for Kavach implementation across 48 stations.",
            "Sentiment": "positive",
            "PublishDate": 1747197577000,
            "Source": "order&deals"
        },
        {
            "Title": "HBL Engineering Secures Large Order Book and RDSO Approval",
            "Summary": "HBL Engineering has reported a total accumulated order book of Rs. 3,763.83 crores, with contracts to be completed within 24 months. Additionally, the company has received approval from the Research Designs and Standard Organization (RDSO) for Version 4.0 of the Kavach Systems, making it the first company to obtain this approval.",
            "Sentiment": "positive",
            "PublishDate": 1747194343000,
            "Source": "default"
        },
        {
            "Title": "HBL Engineering: Secures ₹146 Crore Kavach Order from Western Railway",
            "Summary": "HBL Engineering received a Letter of Acceptance from Western Railway for implementing Kavach across 48 stations, covering 428 kilometers. The contract is valued at ₹145.83 crore (including GST) and is to be completed within 18 months. This is the company's second Kavach order in a month, following five Letters of Acceptance in April for ₹762.56 crore.",
            "Sentiment": "positive",
            "PublishDate": 1746159780000,
            "Source": "order&deals"
        },
        {
            "Title": "HBL Engineering Secures 1.46 Billion Rupee Contract",
            "Summary": "HBL Engineering has been awarded a contract valued at 1.46 billion rupees. The news indicates a significant business development for the company, potentially impacting its financial performance and market position.",
            "Sentiment": "positive",
            "PublishDate": 1746144556000,
            "Source": "default"
        },
        {
            "Title": "HBL Engineering Secures 1.46 Billion Rupee Contract",
            "Summary": "HBL Engineering has been awarded a significant contract valued at 1.46 billion rupees. This order represents a substantial business opportunity for the company and could potentially impact its financial performance positively.",
            "Sentiment": "positive",
            "PublishDate": 1746100165000,
            "Source": "default"
        },
        {
            "Title": "HBL Engineering: Secures ₹146 Crore Railway Contract for Kavach System",
            "Summary": "HBL Engineering has won a ₹146 crore contract from Indian Railways to implement the Kavach system across 48 stations, covering 428 kilometers. The project has a 730-day completion timeline. This follows recent acceptances from Central Railway worth ₹762.56 crores and ₹499.68 crore as part of a consortium.",
            "Sentiment": "positive",
            "PublishDate": 1746091073000,
            "Source": "order&deals"
        },
        {
            "Title": "HBL Engineering Secures Orders Worth ₹763 Crore",
            "Summary": "HBL Engineering has won new orders valued at ₹763 crore. This significant order acquisition demonstrates the company's strong market position and potential for future growth in its engineering business.",
            "Sentiment": "positive",
            "PublishDate": 1745552383000,
            "Source": "default"
        },
        {
            "Title": "HBL Engineering Secures Five Contracts Worth 7.63 Billion Rupees",
            "Summary": "HBL Engineering and its consortium partner Shivakriti have been awarded five contracts totaling 7.63 billion rupees. Two of these contracts, specifically mentioned in the news, are valued at 2.45 billion rupees and 2.55 billion rupees respectively. The company has received letters of acceptance for these projects.",
            "Sentiment": "positive",
            "PublishDate": 1743466194000,
            "Source": "order&deals"
        },
        {
            "Title": "HBL Engineering: Secures ₹500 Crore KAVACH Orders from Indian Railways",
            "Summary": "HBL Engineering received two Letters of Acceptance for installing KAVACH (version 4.0) on key railway routes. The orders, worth ₹244.68 crore and ₹255 crore, are for Western Railway's Rajkot Division and North Central Railway's Jhansi Division respectively. The total contract value is ₹499.68 crore, including GST.",
            "Sentiment": "positive",
            "PublishDate": 1743157967000,
            "Source": "order&deals"
        },
        {
            "Title": "HBL Engineering Limited: Secures ₹148.44 Crore Railway Contract for KAVACH System",
            "Summary": "HBL Engineering Limited received a ₹148.44 crore letter of acceptance from Indian Railways' Bhopal Division for implementing the KAVACH automatic train protection system. The project covers the BinaItarsi-Jujharpur section and is to be completed within 540 days. The company's shares rose 3.17% to ₹438 following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1741079305000,
            "Source": "order&deals"
        },
        {
            "Title": "HBL Engineering Reports Q3 Financial Results",
            "Summary": "HBL Engineering has announced its Q3 consolidated financial results. The company reported a net profit of 646 million rupees, which is lower compared to 790 million rupees in the same quarter last year and 872 million rupees in the previous quarter. The Q3 revenue stood at 4.5 billion rupees, down from 6 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1739233354000,
            "Source": "earnings"
        },
        {
            "Title": "HBL Engineering Reports Mixed Q3 Financial Results",
            "Summary": "HBL Engineering has released its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 936 million rupees, down from 1.13 billion rupees in the same quarter last year. However, the EBITDA margin improved to 20.77% from 18.89% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739187782000,
            "Source": "earnings"
        },
        {
            "Title": "HBL Engineering Reports Q3 Financial Results",
            "Summary": "HBL Engineering has announced its Q3 consolidated financial results. The company reported a net profit of 646 million rupees, which is lower compared to both the previous year (790 million rupees) and the previous quarter (872 million rupees). Revenue for Q3 stood at 4.5 billion rupees, down from 6 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1739187722000,
            "Source": "earnings"
        },
        {
            "Title": "HBL Engineering: Secures ₹1,522 Crore KAVACH Order, Shares Hit Record High",
            "Summary": "HBL Engineering won a ₹1,522.4 crore order from Chittaranjan Locomotive Works for supplying and installing KAVACH (Train Collision Avoidance System) in 2,200 locomotives. The project is to be completed within 12 months. Shares surged 6% to a record high on the news.",
            "Sentiment": "positive",
            "PublishDate": 1734321603000,
            "Source": "order&deals"
        },
        {
            "Title": "HBL Power Systems Secures 15.22 Billion Rupee Order for Train Collision Avoidance System",
            "Summary": "HBL Power Systems has won a significant order worth 15.22 billion rupees from Chittaranjan Locomotive Works. The contract involves the supply, installation, and commissioning of On-Board Train Collision Avoidance System (TCAS), also known as Kavach equipment. This order represents a major project in railway safety technology implementation.",
            "Sentiment": "positive",
            "PublishDate": 1734158107000,
            "Source": "order&deals"
        },
        {
            "Title": "HBL Power Systems Reports Q2 Financial Results",
            "Summary": "HBL Power Systems Ltd. has announced its Q2 consolidated financial results. The company reported a net profit of 872 million rupees, up from 686 million rupees year-over-year and 800 million rupees quarter-over-quarter. Revenue for Q2 stood at 5.20 billion rupees, which is lower than the 5.56 billion rupees reported in the same quarter last year but unchanged from the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731284266000,
            "Source": "result"
        }
    ]
}