{
    "Symbol": "HBSL",
    "ISIN": "INE550B01022",
    "News": [
        {
            "Title": "HB Stockholdings Reports Loss of Rs 460.30 Lakh in Q2 FY2025",
            "Summary": "HB Stockholdings Limited reported a net loss of Rs 460.30 lakh for the quarter ended September 30, 2025, compared to a profit of Rs 745.59 lakh in the same quarter of the previous year. For the half-year period, the company posted a profit of Rs 285.29 lakh versus Rs 656.66 lakh in the corresponding period last year. The company's revenue from operations was Rs 40.96 lakh in Q2 FY2025, significantly lower than Rs 1009.75 lakh in Q2 FY2024. Total expenses increased to Rs 566.98 lakh from Rs 150.10 lakh year-on-year, primarily due to net loss on fair value changes of Rs 329.35 lakh and net loss in equity derivative trading of Rs 41.53 lakh. The company paid a dividend of Rs 1 per equity share during the quarter. Basic and diluted earnings per share stood at negative Rs 6.44 for the quarter. The Board of Directors approved these unaudited financial results in a meeting held on November 12, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762940353305,
            "Source": "earnings"
        },
        {
            "Title": "HB Stockholdings Reports Strong Q1 Performance with 746% Profit Jump, Appoints New Company Secretary",
            "Summary": "HB Stockholdings Limited reported a significant turnaround in its Q1 financial results for the quarter ended June 30, 2025. The company posted a standalone profit of Rs. 746.20 lakhs compared to a loss of Rs. 712.93 lakhs in the previous quarter, driven primarily by net gains on fair value changes of Rs. 787.83 lakhs and profits from equity derivative trading of Rs. 193.66 lakhs. Revenue from operations surged to Rs. 1,009.75 lakhs from Rs. 28.35 lakhs in the previous quarter. The company appointed Ms. Pooja Jain as Company Secretary and Compliance Officer effective August 8, 2025. Mrs. Asha Mehra will complete her tenure as Independent Director on September 8, 2025, after serving two consecutive terms of 5 years each. The Board also reconstituted various committees including Audit, Nomination & Remuneration, Stakeholders Relationship, and Risk Management committees. Earnings per share improved to Rs. 10.45 from a loss of Rs. 9.99 per share in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754645101772,
            "Source": "earnings"
        },
        {
            "Title": "Western Railway Suburban Trains to Get Kavach Safety Feature by Next Year End",
            "Summary": "Western Railway suburban trains will be equipped with the Kavach safety feature by the end of next year. The enhancement aims to improve safety systems for the suburban rail network.",
            "Sentiment": "positive",
            "PublishDate": 1754278212581,
            "Source": "stock"
        }
    ]
}