{
    "Symbol": "HCC",
    "ISIN": "INE549A01026",
    "News": [
        {
            "Title": "Vedanta Plans Oversubscription for Hindustan Zinc Sale",
            "Summary": "Vedanta announces intention to exercise oversubscription option for Hindustan Zinc share sale, with total offer size reaching up to 4,75,77,066 shares in the divestment process.",
            "Sentiment": "neutral",
            "PublishDate": 1769605239416,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mukul Agrawal Buys 1.68% Stake in HCC Despite Revenue Drop",
            "Summary": "Investor Mukul Agrawal acquired 1.68% stake in Hindustan Construction Company despite 31.7% revenue decline in Q2 FY26, betting on debt reduction from Rs 4,851 cr to Rs 1,001 cr and Rs 13,152 cr order backlog.",
            "Sentiment": "neutral",
            "PublishDate": 1769247713379,
            "Source": "co_actions_results"
        },
        {
            "Title": "HSBC upgrades Hindustan Zinc to Buy, raises targets",
            "Summary": "HSBC upgraded Hindustan Zinc to Buy from Hold with ₹750 target price ahead of Q3 results. Also raised target prices for Hindalco to ₹1,240 and NALCO to ₹420 on improved metal price forecasts.",
            "Sentiment": "positive",
            "PublishDate": 1768817543867,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Zinc Silver Production Drops 12% in 9 Months",
            "Summary": "Hindustan Zinc reports refined metal silver production at 451 MT for nine months, down 12% from 511 MT in the previous year, reflecting challenges in silver output.",
            "Sentiment": "negative",
            "PublishDate": 1768817154464,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Zinc Plans 510KTPA Fertilizer Plant by Q1 FY27",
            "Summary": "Hindustan Zinc announces plans to complete construction of its 510KTPA capacity fertilizer plant by the first quarter of FY27, marking a significant expansion into the fertilizer sector.",
            "Sentiment": "positive",
            "PublishDate": 1768816685193,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Zinc Silver Output Jumps 10% QoQ to 158 MT",
            "Summary": "Hindustan Zinc reports silver production of 158 MT with 10% quarter-on-quarter growth, contributing 44% to company profits as it positions for silver market opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1768816591875,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Zinc Q3 Results: Record Profit Surges 46%",
            "Summary": "Hindustan Zinc reports highest-ever quarterly profit of ₹3,916 crore, up 46% YoY, with record revenue of ₹10,980 crore and industry-leading EBITDA margin of 55%.",
            "Sentiment": "positive",
            "PublishDate": 1768815780085,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Zinc Earnings Call Set for Jan 19, 2026",
            "Summary": "Hindustan Zinc Limited has scheduled an earnings conference call for January 19, 2026, at 16:00 hours IST to discuss Q3FY26 results following board meeting approval under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768378322089,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Zinc gains on silver rally to record high",
            "Summary": "Silver prices surge 3% to record $89.60/oz, boosting Hindustan Zinc shares. White metal up 26% in 2026, driving focus on top-5 global silver producer with 800-tonne annual capacity.",
            "Sentiment": "positive",
            "PublishDate": 1768361705206,
            "Source": "stocks"
        },
        {
            "Title": "Mukul Agrawal buys 1.68% stake in HCC, stock up 10%",
            "Summary": "Ace investor Mukul Agrawal acquired 4.40 crore shares in Hindustan Construction Company for ₹86 crore. The stock rallied 10% in two sessions following his entry into the infrastructure company.",
            "Sentiment": "positive",
            "PublishDate": 1768293626876,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Zinc jumps 3% as silver hits record high",
            "Summary": "Hindustan Zinc shares rose over 3% as silver futures reached lifetime high of ₹2.64 lakh per kg. Silver ETFs gained 4% amid geopolitical tensions boosting safe-haven demand.",
            "Sentiment": "positive",
            "PublishDate": 1768192858793,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Zinc Shows Bearish Reversal Pattern",
            "Summary": "Hindustan Zinc Ltd exhibits double top formation on 4-hour chart, breaking below ₹605 support with increased selling volumes, signaling potential downward momentum ahead.",
            "Sentiment": "negative",
            "PublishDate": 1767937637976,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Zinc Block Trade Worth ₹41.97 Crores",
            "Summary": "Hindustan Zinc Ltd. witnessed a significant block trade on NSE involving 709,966 shares valued at ₹41.97 crores, executed at ₹591.20 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1767851071977,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Zinc Q3 Mined Metal Output Up 4%",
            "Summary": "Hindustan Zinc reported 4% growth in mined metal production to 2,76,000 tonnes in Q3, driven by higher ore production. Saleable metal output also rose 4%, though silver production declined 1%.",
            "Sentiment": "positive",
            "PublishDate": 1767415468564,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Zinc Drops 3.2% as Silver Falls 8% from High",
            "Summary": "Hindustan Zinc shares fell 3.2% to ₹616.60 as silver prices declined over 8% after hitting an all-time high of $68 per ounce, snapping the stock's four-day gaining streak on Monday.",
            "Sentiment": "negative",
            "PublishDate": 1766983659061,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Zinc shares surge as silver hits $82 record",
            "Summary": "Silver prices reached a new record high of $82 per troy ounce, boosting focus on Hindustan Zinc, one of the world's top five silver producers with 800-tonne annual capacity.",
            "Sentiment": "positive",
            "PublishDate": 1766979408950,
            "Source": "stocks"
        },
        {
            "Title": "HCC Rights Issue Oversubscribed by 200%",
            "Summary": "Hindustan Construction Company's rights issue receives overwhelming response with applications worth ₹2,008 crores against issue size of ₹999.99 crores, leading to equity expansion of 79.99 crore shares.",
            "Sentiment": "positive",
            "PublishDate": 1766473956103,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCC Credit Rating Reaffirmed at ICRA JBB (Stable)",
            "Summary": "ICRA Limited reaffirmed Hindustan Construction Company's long-term rating at ICRA JBB (Stable) for Non-Convertible Debentures worth ₹823.90 crores, citing adequate order book position and improved operating margins.",
            "Sentiment": "neutral",
            "PublishDate": 1766125797016,
            "Source": "stocks"
        },
        {
            "Title": "HCC Wins ₹901 Cr NFR Tunnel Contract with 65% JV Stake",
            "Summary": "Hindustan Construction Company secures major railways contract from Northeast Frontier Railway for 3.5-km tunnel construction on Tupul-Imphal line through joint venture with 65% stake.",
            "Sentiment": "positive",
            "PublishDate": 1766124347064,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jefferies Initiates Buy Call on Hindustan Zinc at ₹660",
            "Summary": "Jefferies has initiated a buy recommendation on Hindustan Zinc with a target price of ₹660, signaling positive outlook for the mining company's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1765770115567,
            "Source": "stocks"
        },
        {
            "Title": "HCC Reduces Corporate Guarantee by ₹3,364 Crore",
            "Summary": "Hindustan Construction Company significantly reduces its corporate guarantee for Prolific Resolution Private Limited by ₹3,364 crore, with remaining obligation now at ₹571 crore representing 20% of principal amount.",
            "Sentiment": "positive",
            "PublishDate": 1765427331352,
            "Source": "stocks"
        },
        {
            "Title": "HCC Clarifies Significant Volume Surge is Market-Driven",
            "Summary": "Hindustan Construction Company responded to BSE's inquiry about significant trading volume increases, stating the surge is purely market-driven with no pending material announcements. The company confirmed compliance with disclosure regulations and assured timely reporting of any future material events.",
            "Sentiment": "neutral",
            "PublishDate": 1764755573740,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Construction Company Approves ₹1,000 Crore Rights Issue",
            "Summary": "Hindustan Construction Company has approved a ₹1,000 crore rights issue to fund its growth initiatives and strengthen its balance sheet. The capital raising exercise will provide the infrastructure company with additional financial resources for expansion and improved financial positioning.",
            "Sentiment": "positive",
            "PublishDate": 1764640587569,
            "Source": "corporate_action"
        },
        {
            "Title": "HCC Schedules Committee Meeting to Finalize Rs 1000 Crore Rights Issue Terms",
            "Summary": "Hindustan Construction Company Limited will hold a Securities Issuance Committee meeting on December 1, 2025, to determine specific terms of its previously approved rights issue worth up to Rs 1000 crore. The committee will decide key parameters including the rights issue price, payment mechanism, entitlement ratio, record date and timing for the equity share offering.",
            "Sentiment": "positive",
            "PublishDate": 1764156162912,
            "Source": "corporate_action"
        },
        {
            "Title": "HCC Schedules Securities Issuance Committee Meeting for Rights Issue Consideration",
            "Summary": "Hindustan Construction Company Limited will hold a Securities Issuance Committee meeting on November 26, 2025, to consider capital raising through a rights issue of fully paid-up equity shares. The company has closed its trading window from November 22 to December 4, 2025, for all designated persons in connection with the proposed capital raising under its approved Rs. 1500 Crore fundraising authorization.",
            "Sentiment": "neutral",
            "PublishDate": 1763817807783,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Construction Company Submits QIP Monitoring Report for Quarter Ended September 2025",
            "Summary": "Hindustan Construction Company Limited submitted its monitoring agency report for the quarter ended September 30, 2025, related to its Rs. 600 crore QIP issue of equity shares. The report was prepared by CARE Ratings Limited and reviewed by the company's Audit Committee. The company had utilized Rs. 366.88 crore towards loan repayment, working capital requirements, and general corporate purposes by the previous quarter, with no utilization during the current quarter. The QIP issue period was from December 16, 2025 to December 19, 2025. The monitoring report shows no deviations from the disclosed objects of the issue, with funds being deployed as per the original plan for debt repayment (Rs. 390 crore), working capital augmentation (Rs. 150 crore), general corporate purposes (Rs. 22.86 crore), and issue expenses (Rs. 37.14 crore). Rs. 200 crore remains unutilized from the total issue proceeds.",
            "Sentiment": "neutral",
            "PublishDate": 1762472420566,
            "Source": "corporate_action"
        },
        {
            "Title": "HCC Reports Net Profit of ₹36.7 Crore in Q2FY26, Secures Orders Worth ₹2,770 Crore",
            "Summary": "Hindustan Construction Company Limited reported standalone turnover of ₹957.8 crore and net profit of ₹36.7 crore for Q2FY26, compared to ₹1,203 crore turnover and ₹50.2 crore net profit in Q2FY25. EBITDA margins stood at 16.1% versus 17.8% in the previous year. The company's order book reached ₹13,152 crore as of September 30, 2025. HCC secured three new orders totaling ₹2,770 crore, including two packages of Patna Metro and an Aluminium smelter expansion project from Hindalco. The company is also the lowest bidder for a project worth ₹840 crore. Consolidated revenue was ₹960.7 crore in Q2FY26 versus ₹1,406.9 crore in Q2FY25. The company achieved significant progress in deleveraging initiatives with lender prepayments of ₹80 crore during the quarter, bringing year-to-date debt repayment to ₹215 crore. Key infrastructure projects advanced including Mumbai Metro Line 3 inauguration by Prime Minister Modi and progress on various hydropower projects.",
            "Sentiment": "neutral",
            "PublishDate": 1762449776985,
            "Source": "earnings"
        },
        {
            "Title": "HCC Secures ₹2,770 Cr New Orders, Plans ₹1,000-1,100 Cr Rights Issue for Q3",
            "Summary": "HCC secured ₹2,770 crore in new orders including projects for Patna Metro and Hindalco Smelter. The company maintains an order book of ₹13,152 crore with a bid pipeline of ₹57,000 crore. HCC completed ₹339 crore in prepayments as part of deleveraging efforts and plans a rights issue of ₹1,000-1,100 crore in Q3. The company is focusing on hydro, transport, and water projects while maintaining margin stability at 16.1% and pursuing nationwide infrastructure expansion.",
            "Sentiment": "positive",
            "PublishDate": 1762438958827,
            "Source": "stock"
        },
        {
            "Title": "HCC Reports 25% Decline in Q2 Net Profit to 478 Million Rupees",
            "Summary": "HCC reported quarterly consolidated net profit of 478 million rupees compared to 639 million rupees in the same period last year. Revenue decreased to 9.6 billion rupees from 14.1 billion rupees year-over-year. EBITDA fell to 1.47 billion rupees from 2.4 billion rupees, while EBITDA margin compressed to 15.38% from 17.22% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762427873678,
            "Source": "earnings"
        },
        {
            "Title": "HCC Independent Director Arun Karambelkar Passes Away",
            "Summary": "Hindustan Construction Company Limited announced the demise of Mr. Arun Karambelkar, Independent Director, on November 2, 2025. Karambelkar had been associated with the Board since 2011 and contributed significantly to the company's governance and operations during his tenure. Following his demise, he has ceased to be an Independent Director of the company with immediate effect. The Board of Directors and employees conveyed their sincere condolences to his family.",
            "Sentiment": "negative",
            "PublishDate": 1762152361531,
            "Source": "corporate_governance"
        },
        {
            "Title": "HCC Secures ₹204 Crore Contract from Hindalco for Fabrication Work",
            "Summary": "HCC has won a contract worth approximately ₹204 crore from Hindalco for pot shell and superstructure fabrication work.",
            "Sentiment": "positive",
            "PublishDate": 1760314508717,
            "Source": "order&deals"
        },
        {
            "Title": "HCC Secures ₹204 Crore Hindalco Contract for Aluminium Smelter Expansion in Odisha",
            "Summary": "Hindustan Construction Company (HCC) has secured a ₹204 crore contract from Hindalco Industries for fabrication, supply, and erection of pot shell and superstructure components for the Aditya Aluminium Smelter Expansion Project in Odisha. The project will increase Hindalco's aluminium smelting capacity by 200,000 tonnes per annum. HCC also signed a strategic MoU with Konkan Railway Corporation Ltd on September 30, 2025, to jointly pursue railway and multi-modal transport infrastructure projects in India and abroad. The partnership will focus on underground and elevated metro systems, NATM tunneling, railway bridges, and large-scale EPC contracts. HCC shares closed 3.35% higher at ₹28.69 on NSE on Friday, October 10.",
            "Sentiment": "positive",
            "PublishDate": 1760103735821,
            "Source": "order&deals"
        },
        {
            "Title": "HCC Secures ₹204 Crore Contract from Hindalco for Aluminium Smelter Project",
            "Summary": "Hindustan Construction Company (HCC) has won a ₹204 crore contract from Hindalco Industries Limited for fabrication, supply, and erection of pot shell and superstructure for the Aditya Aluminium smelter expansion project in Odisha. The project is part of Hindalco's initiative to enhance its aluminium smelting capacity by 200,000 tonnes per annum. HCC will utilize its fabrication expertise and execution capabilities to deliver the large-scale industrial project to international standards. The contract strengthens HCC's presence in specialized private sector projects and supports India's industrial growth.",
            "Sentiment": "positive",
            "PublishDate": 1760096329472,
            "Source": "order&deals"
        },
        {
            "Title": "Hindustan Zinc Reports 35% Jump in Net Profit Despite Mixed Production Performance",
            "Summary": "Hindustan Zinc delivered strong financial results with net profit surging 35% YoY to ₹2,327 crore, exceeding analyst estimates of ₹2,256 crore. Revenue increased 22% YoY to ₹8,252 crore, driven by higher London Metal Exchange zinc prices and recovering silver volumes. EBITDA rose 31% YoY to ₹4,123 crore with margins expanding 380 basis points to 50%. However, operational performance was mixed - mined metal output grew 1% YoY to 258 kt but saleable metal production declined 6% YoY to 246 kt. Zinc production increased 2% YoY to 202 kt while refined lead output dropped 29% YoY to 45 kt. The company announced a ₹327 crore investment in Serentica Renewables for renewable power projects. Shares closed 2.2% higher at ₹492.30, gaining 11% year-to-date but remaining 14% below the 52-week high of ₹575.40.",
            "Sentiment": "positive",
            "PublishDate": 1759512750134,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Zinc Achieves Record Q2 Mined Metal Production Despite Mixed Results",
            "Summary": "Hindustan Zinc reported its highest ever second-quarter mined metal production at 258 kilotonnes, representing a 1% year-on-year increase. The company also achieved its highest ever mined metal production at 523 kilotonnes, driven by better mine metal grades and improved recoveries. However, refined metal production declined 6% to 246 KT year-on-year and 1% quarter-on-quarter due to plant availability and shutdown issues. Refined zinc production increased 2% year-on-year to 202 KT, while refined lead production dropped significantly by 29% to 45 KT due to pyro operations and lower plant availability. Saleable silver production fell 22% year-on-year to 144 tonnes. Wind power generation increased 2% year-on-year to 132 MU. The stock closed 2.27% lower at Rs 492.30 despite rising 3.17% during the day. Analyst sentiment remains mixed with six buy ratings, three hold, and seven sell recommendations out of 16 analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1759504873285,
            "Source": "stock"
        },
        {
            "Title": "HCC Completes Merger of Two Subsidiaries, Consolidating Operations Under Badarpur Faridabad Tollway Ltd",
            "Summary": "HCC has completed the merger of two subsidiaries, with HCC O&M Ltd being merged into Badarpur Faridabad Tollway Ltd. The consolidation reduces the company's subsidiary structure from two entities to one.",
            "Sentiment": "positive",
            "PublishDate": 1759237169798,
            "Source": "corporate_action"
        },
        {
            "Title": "HCC and KRCL Sign Strategic MoU for Large-Scale Transport Infrastructure Projects",
            "Summary": "Hindustan Construction Company Limited (HCC) has signed a strategic Memorandum of Understanding with Konkan Railway Corporation Limited (KRCL) to jointly pursue and execute large-scale railway and multi-modal transport infrastructure projects across India and international markets. The collaboration combines HCC's expertise in heavy civil construction and project execution with KRCL's capabilities in rail systems, operations, and project implementation. The partnership will focus on complex assignments including underground and elevated metro systems, NATM tunnelling, railway bridges, and large-scale EPC contracts. Both organizations will jointly identify and bid for opportunities under various contractual frameworks including EPC, design-build, unit-rate contracts, and PPP arrangements. The MoU provides for formation of joint ventures, consortia, or other collaborative structures tailored to project requirements. According to Arjun Dhawan, Vice Chairman & Managing Director of HCC, the partnership aims to expand presence in domestic and international markets while delivering integrated transport solutions. Santosh Kumar Jha, Chairman & Managing Director of KRCL, stated the alliance positions both companies to execute complex projects and contribute to modern transport network advancement.",
            "Sentiment": "positive",
            "PublishDate": 1759208773038,
            "Source": "order&deals"
        },
        {
            "Title": "Hindustan Zinc Plans to Double Production Capacity to 2 Million Tonnes with Rs 30,000-35,000 Crore Investment",
            "Summary": "Hindustan Zinc announced plans to double its metal production to 2 million tonnes annually over the next three to five years, requiring a capital expenditure of Rs 30,000-35,000 crore. CEO Arun Misra stated the company has 450 million tonnes of ore reserves equivalent to 30 million tonnes of metal, sufficient to support the expansion from current production of 1 million tonnes. The company is working with an Australian mining consultant to increase operational efficiency by 30% and boost annual mining capacity from 17 million tonnes to 21-22 million tonnes. Hindustan Zinc will expand mines both horizontally and by depth, constructing over 100 kilometres of tunnels annually. The expansion will be self-funded through the company's estimated annual profit after tax of Rs 10,000 crore, eliminating the need for debt financing. All orders for new smelters, concentrators and mine expansion will be placed by November 2025. The company aims to maintain production costs below $1,000 per ton to strengthen its global market position. Shares traded 2.66% higher at Rs 464.95.",
            "Sentiment": "positive",
            "PublishDate": 1758796850916,
            "Source": "stock"
        },
        {
            "Title": "HCC Wins ₹2,566 Crore Contracts for Patna Metro Underground Construction",
            "Summary": "Hindustan Construction Company Limited (HCC) has been awarded two contracts worth ₹1,418.3 crore and ₹1,147.51 crore by Patna Metro Rail Corporation Limited for Phase I of the Patna Metro Rail Project. The contracts involve constructing 10.67 km of underground tunnels using Tunnel Boring Machines and six metro stations. Package PC-05 includes twin tunnels, underground ramp at Mithapur, and three stations (Vikas Bhawan, Vidyut Bhawan, Patna Station). Package PC-06 covers underground ramp at Rukanpura and three stations (Rukanpura, Raja Bazar, Patna Zoo). Both packages include architectural finishing and utility systems for the Danapur-Khemnichak Corridor. HCC is currently working on metro projects in Mumbai, Indore, and Chennai, and has previously contributed to Delhi Metro, Bangalore Metro, Mumbai Metro Line I, and Kolkata Metro.",
            "Sentiment": "positive",
            "PublishDate": 1758612390643,
            "Source": "order&deals"
        },
        {
            "Title": "Hindustan Zinc Partners With SG Finserv For Sustainable Growth Initiative",
            "Summary": "Hindustan Zinc has entered into a partnership with SG Finserv aimed at promoting sustainable growth and value creation.",
            "Sentiment": "positive",
            "PublishDate": 1757046498804,
            "Source": "order&deals"
        },
        {
            "Title": "Hindustan Zinc Approves ₹3,823 Crore Investment for India's First Tailings Reprocessing Plant",
            "Summary": "Hindustan Zinc's board approved establishing a 10 million tonnes per annum tailings reprocessing plant with capital expenditure of up to ₹3,823 crore. The facility will be India's first of its kind, designed to recover metals from accumulated tailing dumps as part of the company's 2X growth plan to double capacity. The project aims to reduce environmental footprint from traditional wet tailings disposal while improving mineral recovery. Shares closed at ₹426 on NSE, down 0.15%. The company reported quarterly consolidated net profit of ₹2,234 crore, beating estimates of ₹2,156 crore but declining 4.7% year-on-year from ₹2,345 crore. Revenue fell 4.4% to ₹7,771 crore from ₹8,130 crore, missing Street expectations of ₹7,850 crore.",
            "Sentiment": "positive",
            "PublishDate": 1755517909986,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Zinc Targets ₹65,000 Crore Revenue with Production Capacity Doubling",
            "Summary": "Hindustan Zinc plans to double its production capacity to 2 million tonnes, targeting annual revenue of ₹62,000-65,000 crore and EBITDA of ₹34,000-36,000 crore. The Vedanta subsidiary recorded ₹34,083 crore revenue and ₹17,465 crore EBITDA in FY25. The company announced ₹12,000 crore capital expenditure to expand its Debari smelter capacity by 250,000 tonnes to 1.38 million tonnes over 36 months. This initial expansion phase targets revenue of ₹40,000-42,000 crore and EBITDA of ₹21,000-22,000 crore. Silver production is expected to increase to 1,500 tonnes from current 700 tonnes. Production costs are projected to decrease to $1,000 per tonne from the current $1,052 per tonne. The government holds a 27.92% stake in the company.",
            "Sentiment": "positive",
            "PublishDate": 1755223378075,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Construction Company Shareholders Approve ₹1,500 Crore Fundraising Authority",
            "Summary": "Hindustan Construction Company Ltd shareholders approved the Board's authority to raise up to ₹1,500 crore through various securities issuance methods at their 99th Annual General Meeting held on August 12, 2025. The approved fundraising options include equity shares, fully or partly convertible debentures, non-convertible debentures with warrants, equity-based securities, Global Depository Receipts (GDRs), and American Depository Receipts (ADRs). The securities can be issued through qualified institutional placements, preferential allotments, private placements, or other permitted methods. The Board has discretion to determine the specific terms, conditions, and method of issuance subject to regulatory approvals. The meeting ran from 11:00 a.m. to 12:28 p.m.",
            "Sentiment": "positive",
            "PublishDate": 1755000028595,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Construction Company Appoints Arjun Dhawan as Vice Chairman & MD, Increases Authorized Share Capital",
            "Summary": "Hindustan Construction Company Ltd announced the appointment of Mr. Arjun Dhawan as Vice Chairman & Managing Director for a 5-year term, effective June 26, 2025, as approved by shareholders at the 99th Annual General Meeting. Dhawan, who has a 16-year association with HCC Group and previously served as Group Chief Executive Officer from 2017-2025, is the son-in-law of Chairman Mr. Ajit Gulabchand. The company also increased its authorized share capital from Rs. 210 crore to Rs. 300 crore, with equity shares increasing from 200 crore to 290 crore shares of Rs. 1 each, and consequential changes to the Memorandum of Association. Under Dhawan's previous leadership, HCC achieved its highest-ever turnover and profitability, secured nearly Rs. 10,000 crore in new orders in the past year, and completed debt restructuring and capital raising transactions totaling over Rs. 6,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1754998796422,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hindustan Construction Company Makes Quarterly Results Presentation Transcript Available",
            "Summary": "Hindustan Construction Company Ltd has released the transcript of a presentation covering their unaudited financial results for the quarter ended June 30, 2025. The presentation was delivered to analysts and institutional investors on August 7, 2025. The company is listed on NSE under the symbol HCC and on BSE under code 500185. The transcript covers both standalone and consolidated unaudited results and is available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1754916777786,
            "Source": "earnings"
        },
        {
            "Title": "HCC Leverages ₹11,000 Crore Order Book and ₹6,500 Crore Pipeline for Revenue Growth",
            "Summary": "HCC is focusing on its ₹11,000 crore order book and ₹6,500 crore lowest bidder pipeline to drive steady revenue growth. The company aims to enhance operations through claim monetization and increased project execution.",
            "Sentiment": "positive",
            "PublishDate": 1754573551931,
            "Source": "stock"
        },
        {
            "Title": "HCC Reports Strong Turnaround with Q1 Net Profit of 507.3M Rupees",
            "Summary": "HCC achieved a consolidated net profit of 507.3 million rupees in Q1, marking a significant turnaround from a loss of 25 million rupees in the same period last year. However, revenue declined to 10.91 billion rupees compared to 18.16 billion rupees year-over-year. The company's operational performance improved substantially, with EBITDA rising to 1.79 billion rupees from 1.52 billion rupees, while EBITDA margin nearly doubled to 16.45% from 8.39% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754564118216,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Zinc Chairperson Highlights Strong Fundamentals and 68% Shareholder Returns",
            "Summary": "Hindustan Zinc Chairperson Priya Agarwal Hebbar described fiscal 2025 as a defining year of transformation for the company. She highlighted the company's position as the world's largest integrated zinc producer and India's only primary silver producer. The company delivered total shareholder returns of 68%, outperforming both the Nifty and Nifty Metal indices. Hindustan Zinc maintained a 77% market share in India's primary zinc segment while reducing production costs by 6% to $1,052 per tonne, the lowest in 15 quarters. The company launched EcoZen, Asia's first low-carbon zinc with 75% lower carbon footprint than industry average. Renewable energy expanded to 13% of total energy mix, and the company achieved a 3.32x water positivity score. The company outlined plans to double refined metal capacity to 2 million tonnes by 2030 through strategic investments in digitalisation, safety systems, and circular economy initiatives. CSR efforts reached 2.3 million lives, up from 1.9 million previously, with over 6.5 lakh women and children as direct beneficiaries.",
            "Sentiment": "positive",
            "PublishDate": 1754333471076,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Zinc CEO Dismisses Viceroy's Brand Fee Violation Claims Against Vedanta",
            "Summary": "Hindustan Zinc CEO Arun Misra rejected allegations by US short-seller Viceroy Research that Vedanta violated its brand fee agreement with the government. Misra stated that proper board procedures were followed, including legal vetting and sharing proposals with the Government of India nominee director before board meetings. Viceroy had alleged that Vedanta's imposition of a brand fee on HZL in October 2022 was uncommercial and breached the shareholder agreement with the government. The government currently holds a 27.92% stake in HZL while Vedanta owns 61.84%. Vedanta acquired its stake in HZL from the government in 2002 as part of the privatisation process. Viceroy Research has published multiple reports targeting Vedanta and its subsidiaries recently.",
            "Sentiment": "negative",
            "PublishDate": 1752848964210,
            "Source": "stock"
        },
        {
            "Title": "HCC Emerges as Top Bidder for ₹2,400 Crore Project in Patna",
            "Summary": "HCC (Hindustan Construction Company) has emerged as the top bidder for a project in Patna valued at ₹2,400 crore. The competitive bidding results indicate that HCC has a strong position in the construction sector.",
            "Sentiment": "positive",
            "PublishDate": 1749532572000,
            "Source": "default"
        }
    ]
}