{
    "Symbol": "HCG",
    "ISIN": "INE075I01017",
    "News": [
        {
            "Title": "HCG Board to Consider Rights Issue on Feb 17",
            "Summary": "HealthCare Global Enterprises has scheduled a board meeting on February 17, 2026, to consider a fund raise proposal through rights issue of equity shares, with trading window closed from Feb 9-26.",
            "Sentiment": "neutral",
            "PublishDate": 1770554169714,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCG Q3FY26 Revenue Grows 13% to ₹6,331 Mn",
            "Summary": "Healthcare Global Enterprises reports Q3FY26 revenue of ₹6,331 Mn, up 13% YoY, with adjusted EBITDA rising 20% to ₹1,108 Mn and margins expanding 98 bps to 17.5%.",
            "Sentiment": "positive",
            "PublishDate": 1770398715416,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCG Board Approves Employee Stock Option Scheme 2026",
            "Summary": "HealthCare Global Enterprises board approved HCG ESOS 2026 covering 74,21,455 stock options with exercise price of INR 495, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1770306747439,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCG Appoints Pankaj Gautam as Chief Information Officer",
            "Summary": "HealthCare Global Enterprises Limited announces the appointment of Mr. Pankaj Gautam as Chief Information Officer, effective February 15, 2026, following Board approval on February 05, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770305998493,
            "Source": "stocks"
        },
        {
            "Title": "HCG Reports Q3 Loss Despite Revenue Growth",
            "Summary": "Healthcare Global Enterprises posted a consolidated net loss of ₹94 million in Q3 compared to ₹70 million profit last year, while revenue grew to ₹6.3 billion from ₹5.56 billion year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1770303042386,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCG Shareholders Approve Dr Ajaikumar Consultancy Deal",
            "Summary": "Healthcare Global Enterprises shareholders overwhelmingly approved variations to consultancy arrangement with Dr B.S. Ajaikumar through postal ballot with 98.32% votes in favor.",
            "Sentiment": "positive",
            "PublishDate": 1769077344947,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCG CEO Outlines Growth Strategy at Investor Meet",
            "Summary": "Healthcare Global Enterprises CEO Dr. Manish Mattoo presented the company's strategic vision, targeting revenue growth ahead of industry averages with improved EBITDA margins and enhanced clinical outcomes.",
            "Sentiment": "positive",
            "PublishDate": 1765458591308,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCG Presents Business Strategy and Growth Plans at Virtual Investor Meet",
            "Summary": "HealthCare Global Enterprises Limited held a virtual investor and analyst meet to share updates on the company's business strategy and long-term growth plans. The cancer care hospital chain, which operates 25 comprehensive cancer centers across India and Africa, outlined its expansion roadmap including adding 1,000 beds and 10 LINACs over the next 5 years while targeting revenue growth above industry rates.",
            "Sentiment": "positive",
            "PublishDate": 1764842642247,
            "Source": "corporate_action"
        },
        {
            "Title": "HCG Appoints Chief Internal Auditor Vijay S Shanbhag as Internal Auditor for 6-Month Term",
            "Summary": "Healthcare Global Enterprises Limited's Board approved the appointment of Mr. Vijay S Shanbhag, currently Chief Internal Auditor, as Internal Auditor under Section 138 of the Companies Act, 2013, effective December 01, 2025, for a 6-month term. Ernst & Young LLP will continue supporting the internal audit function in a co-sourced capacity, while Shanbhag brings over two decades of experience and holds multiple certifications including CIA, CISA, and CFE.",
            "Sentiment": "neutral",
            "PublishDate": 1764582712609,
            "Source": "corporate_governance"
        },
        {
            "Title": "HCG Appoints Dr. Manish Mattoo as Interim CFO",
            "Summary": "Healthcare Global Enterprises Limited appointed Dr. Manish Mattoo, Executive Director and CEO, as interim Chief Financial Officer effective December 01, 2025. The appointment will remain in force until a new CFO is appointed by the Board of Directors, with Dr. Mattoo bringing over two decades of healthcare business leadership experience.",
            "Sentiment": "neutral",
            "PublishDate": 1764582168393,
            "Source": "corporate_governance"
        },
        {
            "Title": "HealthCare Global Enterprises Approves INR 150 Crore Investment in Three Wholly Owned Subsidiaries",
            "Summary": "HealthCare Global Enterprises Limited's Board of Directors approved investments in three wholly owned subsidiaries during their November 12, 2025 meeting. The company will invest up to INR 110 crore in HCG Kolkata Cancer Care LLP, INR 15 crore in HCG Oncology Hospitals LLP, and INR 25 crore in HCG NCHRI Oncology LLP. The investments are intended for repayment of dues, working capital, and general corporate purposes. HCG Kolkata operates a 74-bed cancer hospital with revenue of INR 82.14 crore for the financial year ended March 31, 2025. HCG Borivali runs a 69-bed cancer hospital in Mumbai with revenue of INR 90.38 crore. HCG Nagpur operates diagnostic business and PET-CT services with revenue of INR 89.80 crore. The cash investments will be completed by March 31, 2026, and the company will maintain 100% ownership in all three subsidiaries.",
            "Sentiment": "positive",
            "PublishDate": 1762998218708,
            "Source": "corporate_action"
        },
        {
            "Title": "HCG Approves 10% Stake Acquisition in Kenya Subsidiary and USD 1.8 Million Guarantee",
            "Summary": "HealthCare Global Enterprises Limited's Board approved two key decisions: acquiring up to 10% shares in Cancer Care Kenya Limited (CCK), its step-down subsidiary, for up to INR 7 crore, and issuing a Standby Letter of Credit guarantee for CCK's USD 1.8 million term loan for business expansion. CCK operates a cancer hospital with radiation and chemotherapy services including a 15-bed Day Care Centre in Nairobi. CCK reported revenue of INR 42.53 crore and profit after tax of INR 10.83 crore for the year ended March 2025, showing significant growth from INR 9.07 crore revenue in 2022-23. The acquisition will be completed by March 31, 2026, with HCG's guarantee liability capped at 105% of CCK's outstanding loan amount. The guarantee will be treated as a contingent liability for the company.",
            "Sentiment": "positive",
            "PublishDate": 1762970409457,
            "Source": "corporate_action"
        },
        {
            "Title": "HealthCare Global Enterprises Appoints Manu Shankar Das as Chief Marketing Officer",
            "Summary": "HealthCare Global Enterprises Limited's Board of Directors approved the appointment of Manu Shankar Das as Chief Marketing Officer, effective on or before December 20, 2025. The appointment was made based on the recommendation of the Nomination and Remuneration Committee during a board meeting held on November 12, 2025. Das will be part of the company's Senior Management Personnel. He brings over 15 years of cross-industry marketing experience spanning Healthcare, Interior Design, Food Hospitality, Travel, FMCG, and Information Technology. His expertise covers performance marketing, brand strategy, product marketing, digital marketing, and sales promotions. Das has previously worked with organizations including MediBuddy, Rebbus, Bonito Designs, and Flavors Unlimited, and has a background as a software engineer with more than 12 years in marketing and branding.",
            "Sentiment": "positive",
            "PublishDate": 1762968732120,
            "Source": "corporate_governance"
        },
        {
            "Title": "Healthcare Global Enterprises Outlines Multi-Year Growth Strategy Focused on Oncology Expansion",
            "Summary": "Healthcare Global Enterprises has outlined a multi-year growth strategy centered on oncology expansion, clinical excellence, and regional network deepening. The company plans to invest in new cancer centers across Tier-1 and Tier-2 cities. The growth outlook includes strong margin expectations supported by high-occupancy hospitals and operational efficiency. The strategy emphasizes precision oncology and digital health platforms as key drivers for long-term growth.",
            "Sentiment": "positive",
            "PublishDate": 1762967324194,
            "Source": "stock"
        },
        {
            "Title": "Healthcare Global Enterprises Reports Mixed Q2 Results with Revenue Growth but Lower Profits",
            "Summary": "Healthcare Global Enterprises reported Q2 consolidated net profit of 163 million rupees, down from 180 million rupees in the same period last year. Revenue increased to 6.45 billion rupees from 5.52 billion rupees year-over-year. EBITDA rose to 1.23 billion rupees compared to 1.03 billion rupees previously, while EBITDA margin improved to 19.11% from 18.7% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1762965522377,
            "Source": "earnings"
        },
        {
            "Title": "HCG Enterprises Approves Quarterly Results and Employee Stock Option Allotment",
            "Summary": "HealthCare Global Enterprises Limited's Board approved unaudited financial results for the quarter and six months ended September 30, 2025. The company also approved the issue and allotment of 7,537 equity shares of INR 10 each upon exercise of Employee Stock Options under the Employee Stock Option Scheme, 2021. The Board meeting was held on November 12, 2025, commencing at 10:30 a.m. and concluding at 5:30 p.m. The financial results were accompanied by Limited Review Reports from BSR & Co. LLP for both standalone and consolidated results.",
            "Sentiment": "neutral",
            "PublishDate": 1762956746662,
            "Source": "earnings"
        },
        {
            "Title": "Healthcare Global Enterprises Approves Investment of Up to 10% in Cancer Care Kenya",
            "Summary": "Healthcare Global Enterprises has approved an investment of up to 10% in Cancer Care Kenya.",
            "Sentiment": "positive",
            "PublishDate": 1762955110490,
            "Source": "stock"
        },
        {
            "Title": "Motilal Oswal Mutual Fund Schemes Acquire Additional Stake in HealthCare Global Enterprises",
            "Summary": "Multiple schemes of Motilal Oswal Mutual Fund acquired 1,54,556 shares of HealthCare Global Enterprises Ltd through market transactions. The acquisition increased their collective holding from 69,51,902 shares (4.93%) to 71,06,458 shares (5.04%) of the company's total share capital. The transaction was completed on October 29, 2025, and reported under SEBI substantial acquisition regulations. HealthCare Global Enterprises has an equity share capital of 14,10,00,100 shares with a face value of Rs. 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1762230199543,
            "Source": "corporate_action"
        },
        {
            "Title": "Aceso Company Pte. Ltd. Sells 5.65% Stake in HealthCare Global Enterprises",
            "Summary": "Aceso Company Pte. Ltd. sold 79,66,310 equity shares of HealthCare Global Enterprises Limited, representing approximately 5.65% of the company's total share capital. The transaction occurred through on-market sales over two days - 79,41,913 shares on September 10, 2025, and 24,397 shares on September 11, 2025. Following the sale, Aceso's holding in HealthCare Global Enterprises reduced from approximately 5.72% to 0.006%, retaining only 8,991 shares. The company disclosed this transaction under SEBI regulations for substantial acquisition of shares and takeovers. HealthCare Global Enterprises is listed on both the National Stock Exchange of India and BSE Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1757755956150,
            "Source": "order&deals"
        },
        {
            "Title": "HealthCare Global Enterprises Appoints Gopi Lama as Head of Domestic Sales",
            "Summary": "HealthCare Global Enterprises Limited appointed Mr. Gopi Lama as Head of Domestic Sales, effective September 15, 2025. The appointment was approved by the Board of Directors based on the Nomination and Remuneration Committee's recommendation. Gopi Lama brings over 30 years of experience in the healthcare sector, including 13+ years in hospital operations. He has previously worked with leading organizations like Apollo, Fortis, Narayana Health, and SRCC Children's Hospital. His track record includes driving cluster revenues beyond INR 700 Cr and expertise in sales operations, brand strategy, consultant empanelment, and stakeholder engagement.",
            "Sentiment": "positive",
            "PublishDate": 1757688508044,
            "Source": "corporate_governance"
        },
        {
            "Title": "Morgan Stanley, Nippon India MF Lead Rs 438 Crore Share Purchase in HCG from CVC Capital",
            "Summary": "Morgan Stanley, Nippon India Mutual Fund, Motilal Oswal MF, and Plutus Wealth Management collectively purchased 63 lakh equity shares of HealthCare Global Enterprises (HCG) worth Rs 438 crore through open market transactions. The buyers acquired a 4.52% stake at Rs 695 per share on the National Stock Exchange. CVC Capital Partners, through its affiliate Aceso Company Pte Ltd, sold these shares at the same price. Following this transaction, Aceso Company's holding in HCG decreased from 8.76% to 4.24%. HCG shares closed 1.31% lower at Rs 685.95. In February, KKR announced agreements to acquire up to 54% equity stake in HCG from CVC for approximately USD 400 million, making KKR the largest shareholder. HCG, founded in 1989, operates 25 medical care centres across 19 cities and is one of India's largest oncology hospital chains.",
            "Sentiment": "neutral",
            "PublishDate": 1757606865458,
            "Source": "order&deals"
        },
        {
            "Title": "Aceso Company Sells 6% Stake in Healthcare Global for ₹552 Crore",
            "Summary": "Aceso Company, part of the CVC Network, sold nearly 6% stake in HealthCare Global Enterprises through a block deal on NSE, raising ₹552 crore at ₹695 per share. Nippon India Mutual Fund was the largest buyer, purchasing 44 lakh shares worth ₹306 crore, increasing its total stake to 5.7%. Other buyers included Plutus Wealth Management (₹50 crore), Axis Mutual Fund (₹66 crore), and Morgan Stanley Asia Singapore (₹61 crore). This follows CVC Capital's exit from its controlling position nine months earlier, selling majority stake to KKR at ₹445 per share. Aceso's stake in HCG dropped from 60.4% to 8.8% between March and June. HCG shares have rallied 42% year-to-date, significantly outperforming the NSE 500 index's 3% gain. The company reported net profit of ₹44 crore on revenues of ₹2,223 crore. Seven of eight Bloomberg analysts rate the stock as 'Buy' with Ambit Capital setting a 12-month target of ₹860.",
            "Sentiment": "positive",
            "PublishDate": 1757524036122,
            "Source": "order&deals"
        },
        {
            "Title": "HCG Targets 20% Margin Goal as KKR Acquires Majority Stake for $400 Million",
            "Summary": "HealthCare Global Enterprises (HCG) expects to achieve its 20% margin target by the last quarter of the current financial year, according to Executive Chairman BS Ajai Kumar. The company's Bengaluru and Ahmedabad centres already operate at 20-30% margins, with plans to scale this across all locations. HCG reported 15% growth and aims to expand through a hub-and-spoke model in niche areas like infusion centres. American private equity firm KKR acquired up to 54% stake in the hospital chain from CVC Asia V for $400 million. Following the transaction, Kumar retains 10.8% stake, CVC's ownership drops to 6.5-7%, and KKR holds 44-54%. The company recently acquired MG Hospital in Vijayawada and is currently in consolidation phase. HCG has a market capitalization of ₹9,386 crore, with shares trading at ₹672.95 and gaining 73% over the past year.",
            "Sentiment": "positive",
            "PublishDate": 1755855683886,
            "Source": "stock"
        },
        {
            "Title": "HealthCare Global Enterprises Submits Restated Articles of Association Following Shareholder Approval",
            "Summary": "HealthCare Global Enterprises Limited has submitted restated Articles of Association to stock exchanges after shareholders approved the changes through postal ballot on August 10, 2025. The amendments reflect changes related to a promoter agreement between the company, BSA Promoter Group (Dr. B.S. Ajaikumar and family members), and new investors Hector Asia Holdings II Pte. Ltd. and KIA EBT II Scheme 1. The restated articles establish governance structures including board composition, investor rights, transfer restrictions, and operational controls. Key provisions include investor nomination rights for directors, reserved matters requiring investor consent, and restrictions on BSA Promoter Group's ability to transfer equity securities without following specified procedures.",
            "Sentiment": "neutral",
            "PublishDate": 1754998865723,
            "Source": "corporate_action"
        },
        {
            "Title": "Healthcare Global Enterprises Reports 61% Drop in Q1 Net Profit Despite Revenue Growth",
            "Summary": "Healthcare Global Enterprises reported Q1 consolidated net profit of 47.5 million rupees, down from 121 million rupees in the same period last year. Revenue increased to 6.11 billion rupees from 5.25 billion rupees year-over-year. EBITDA rose to 1.08 billion rupees from 909 million rupees, while EBITDA margin improved slightly to 17.62% from 17.33%.",
            "Sentiment": "neutral",
            "PublishDate": 1754050562442,
            "Source": "earnings"
        },
        {
            "Title": "HealthCare Global Enterprises Cancels Q1 FY26 Earnings Call",
            "Summary": "HealthCare Global Enterprises Limited has cancelled its Q1 FY26 earnings call for the quarter ended June 30, 2025, which was scheduled for August 4, 2025. The company had previously announced the earnings call on July 10, 2025. HealthCare Global stated it remains committed to fair and transparent communication and will continue to follow due disclosure processes for future investor and analyst engagement.",
            "Sentiment": "neutral",
            "PublishDate": 1753274191047,
            "Source": "earnings"
        },
        {
            "Title": "Health Care Global Enterprises Ltd: Karnataka Government Demands Probe into Alleged Unfair Clinical Trials",
            "Summary": "Karnataka government has requested the Drug Controller General of India to investigate alleged unfair clinical trials at Health Care Global Enterprises Ltd (HCG) in Bengaluru. The request follows concerns raised by the former chairperson of HCG's Institutional Ethics Committee regarding patient safety, regulatory compliance, and institutional integrity in various clinical trials.",
            "Sentiment": "negative",
            "PublishDate": 1751392477000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Healthcare Global Enterprises: Expansion Plans Aim to Maintain 20% EBITDA Margin",
            "Summary": "Healthcare Global Enterprises plans to add 1,000 beds over three years using a hybrid expansion model. The company aims to maintain a 20% EBITDA margin despite expansion. Q4FY25 saw 18% revenue growth, but PAT declined 65% YoY. Overall revenue growth of 15% expected over next three years.",
            "Sentiment": "neutral",
            "PublishDate": 1749534116000,
            "Source": "earnings"
        },
        {
            "Title": "Healthcare Global Aims to Maintain Profit Margins",
            "Summary": "Healthcare Global has announced its goal to maintain profit margins between 19% and 20%. The company's target suggests a focus on financial stability and operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1749451337000,
            "Source": "default"
        },
        {
            "Title": "Healthcare Global Enterprises Ltd Reports Q4 Financial Results",
            "Summary": "Healthcare Global Enterprises Ltd has announced its quarterly financial results. The company reported a consolidated net profit of 67 million rupees, compared to 234 million rupees in the same quarter last year and 77 million rupees in the previous quarter. Revenue for the quarter stood at 5.83 billion rupees, up from 4.93 billion rupees year-over-year and 5.57 billion rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748223221000,
            "Source": "default"
        },
        {
            "Title": "CCI Approves KKR's Acquisition in Healthcare Global Enterprises",
            "Summary": "The Competition Commission of India (CCI) has approved a proposed combination involving the acquisition of shares in Healthcare Global Enterprises Limited. The acquisition will be carried out by KKR through its entities Hector Asia Holdings and KIA EBT II Scheme.",
            "Sentiment": "neutral",
            "PublishDate": 1746144530000,
            "Source": "default"
        },
        {
            "Title": "CCI Approves KKR's Acquisition in Healthcare Global Enterprises",
            "Summary": "The Competition Commission of India (CCI) has approved a proposed combination involving the acquisition of Healthcare Global Enterprises Limited by KKR through Hector Asia Holdings and KIA EBT II Scheme.",
            "Sentiment": "neutral",
            "PublishDate": 1746106454000,
            "Source": "default"
        },
        {
            "Title": "KKR Acquires Controlling Stake in Healthcare Global Enterprises",
            "Summary": "Private equity firm KKR has acquired a controlling stake in Healthcare Global Enterprises (HCG) for USD 400 million. The deal is expected to result in KKR holding an equity stake between 54% and 77% in the company, making it the largest and controlling shareholder of HCG.",
            "Sentiment": "positive",
            "PublishDate": 1740365117000,
            "Source": "corporate_action"
        },
        {
            "Title": "HealthCare Global Enterprises Ltd: KKR Acquires Controlling Stake in $400 Million Deal",
            "Summary": "KKR is acquiring a controlling stake in HealthCare Global Enterprises Ltd (HCG) from CVC for ₹445 per share, totaling about $400 million. KKR will initially acquire 51% and launch an open offer for 26%. The deal is expected to close by Q3 2025, subject to approvals. Dr. BS Ajaikumar, HCG's founder, will become non-executive chairman.",
            "Sentiment": "positive",
            "PublishDate": 1740329673000,
            "Source": "corporate_action"
        },
        {
            "Title": "Healthcare Global Enterprises: Q3 Profit Rises 22.46% YoY",
            "Summary": "Healthcare Global Enterprises reported Q3 FY25 results with profit at ₹6.98 crore, up 22.46% YoY, and revenue at ₹557.55 crore, up 18.89% YoY. However, profit decreased 61.2% QoQ despite a 0.92% revenue growth. Operating income fell 40.07% QoQ and 8.05% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1739653178000,
            "Source": "earnings"
        },
        {
            "Title": "Healthcare Global Enterprises Reports Q3 EBITDA Growth",
            "Summary": "Healthcare Global Enterprises has reported its Q3 financial results. The company's EBITDA increased to 884 million rupees, up from 786 million rupees in the same quarter last year. However, the EBITDA margin decreased to 15.85% from 16.77% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739518850000,
            "Source": "earnings"
        },
        {
            "Title": "Healthcare Global Enterprises Reports Increased Q3 Profit and Revenue",
            "Summary": "Healthcare Global Enterprises has announced its Q3 financial results, showing improvements in both profit and revenue. The company's consolidated net profit rose to 70 million rupees, up from 57 million rupees in the same quarter last year. Revenue also saw a significant increase, reaching 5.6 billion rupees compared to 4.69 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739518631000,
            "Source": "earnings"
        },
        {
            "Title": "Healthcare Global Enterprises to Consider Q3 Results",
            "Summary": "Healthcare Global Enterprises has announced that it will consider its third quarter (Q3) financial results on February 13. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738760535000,
            "Source": "result"
        },
        {
            "Title": "HealthCare Global Enterprises Reports Q2 Financial Results",
            "Summary": "HealthCare Global Enterprises has announced its Q2 financial results. The company's EBITDA increased to 1.03 billion rupees, up from 846 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 18.7% from 17.42% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731236952000,
            "Source": "result"
        },
        {
            "Title": "Healthcare Global Enterprises Reports Q2 FY2024 Financial Results",
            "Summary": "Healthcare Global Enterprises has announced its Q2 financial results. The company's consolidated net profit increased to 180 million rupees from 136 million rupees in the same quarter last year. Revenue also saw growth, rising to 5.52 billion rupees from 4.86 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731236822000,
            "Source": "result"
        },
        {
            "Title": "HealthCare Global to Transfer Diagnostic Business 'Triesta' and PET-CT/Cyclotron Unit",
            "Summary": "HealthCare Global Enterprises Ltd. has announced the transfer of its diagnostic business 'Triesta' and PET-CT/Cyclotron unit to a company unit through a Business Transfer Agreement (BTA). The deal is valued at 135 crore rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1731236117000,
            "Source": "corporate_action"
        },
        {
            "Title": "KKR in Talks to Acquire HCG Cancer Hospital Chain from CVC Capital",
            "Summary": "Private equity firm KKR is reportedly in discussions to acquire Healthcare Global Enterprises (HCG), a cancer hospital chain, from CVC Capital Partners. This potential acquisition indicates significant interest in the healthcare sector and could lead to changes in HCG's ownership and management structure.",
            "Sentiment": "neutral",
            "PublishDate": 1730099942000,
            "Source": "corporate_action"
        }
    ]
}