{
    "Symbol": "HCL-INSYS",
    "ISIN": "INE236A01020",
    "News": [
        {
            "Title": "HCL Infosystems Board Meet Set for Feb 13, 2026",
            "Summary": "HCL Infosystems Limited announces board meeting on February 13, 2026 to consider Q3FY26 unaudited financial results for quarter ended December 31, 2025. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770621115919,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCL Infosystems Allots Rs 100 Crore Debentures",
            "Summary": "HCL Infosystems Limited completes allotment of 10,00,000 unlisted unsecured non-convertible debentures worth Rs. 100 crore to HCL Capital Private Limited through private placement on 28.01.2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769609176775,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCL Infosystems Gets Court Nod to Withdraw ₹4.96 Cr",
            "Summary": "High Court of Himachal Pradesh allows HCL Infosystems' subsidiary to withdraw ₹4.96 crores from RAPDRP project deposit against bank guarantee in ongoing litigation with HPSEBL.",
            "Sentiment": "positive",
            "PublishDate": 1768302620338,
            "Source": "stocks"
        },
        {
            "Title": "HCL Infosystems Allots ₹100 Cr Debentures to HCL Capital",
            "Summary": "HCL Infosystems Limited has allotted 10,00,000 unsecured non-convertible debentures worth ₹100 crores to HCL Capital Private Limited through private placement on January 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767713473410,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCL Infosystems Gets Court Nod to Withdraw ₹26.93 Cr",
            "Summary": "Himachal Pradesh High Court allows HCL Infosystems' subsidiary to withdraw ₹26.93 crore deposited by HPSEBL against bank guarantee and undertaking in ongoing litigation matter.",
            "Sentiment": "positive",
            "PublishDate": 1767352065943,
            "Source": "stocks"
        },
        {
            "Title": "HCL Infosystems Receives ₹4.38 Cr GST Demand Order",
            "Summary": "HCL Infosystems receives GST demand order of ₹4.38 crores for FY 2021-22 over alleged mismatch between GSTR-3B and GSTR-7 returns. Company plans to challenge the order citing timing differences.",
            "Sentiment": "negative",
            "PublishDate": 1766155989440,
            "Source": "stocks"
        },
        {
            "Title": "HCL Infosystems Gets Credit Rating Withdrawn by CARE Ratings at Company's Request",
            "Summary": "CARE Ratings Limited has withdrawn the credit rating assigned to HCL Infosystems Limited for its bank facilities following the company's request made via email on November 12, 2025. The rating agency confirmed the withdrawal in compliance with its withdrawal policy and will announce it through a press release, with HCL Infosystems required to cease using the ratings for any purpose.",
            "Sentiment": "neutral",
            "PublishDate": 1764253692663,
            "Source": "corporate_action"
        },
        {
            "Title": "HCL Infosystems Reports Revenue Drop to Rs 506.73 Lakhs, Receives Rs 10,280.85 Lakhs Arbitration Award",
            "Summary": "HCL Infosystems announced quarterly results with revenue of Rs 506.73 lakhs, down from Rs 702.71 lakhs in the previous quarter. The decline was attributed to one-time revenue of Rs 201.28 lakhs from Facility Management Services under the Jharkhand RAPDRP project in the prior quarter. Loss Before Tax increased to Rs 550.26 lakhs from Rs 449.84 lakhs previously, driven by delayed receipts on system integration contracts, low margin contracts, and litigation costs. The company received favorable arbitration awards totaling Rs 10,280.85 lakhs from a central government authority related to the Aadhaar program, while counterclaims of Rs 7,270.90 lakhs against the company were dismissed. Additionally, Rs 500 lakhs from HP RAPDRP arbitration award was released. Legal expenses reached Rs 548.57 lakhs during the quarter. HCL Capital Private Limited approved financial support up to Rs 1,50,000 lakhs. The company faces tight liquidity and lacks adequate resources for new business initiatives. Other income increased by Rs 627.27 lakhs due to write-back of old payables and provisions.",
            "Sentiment": "negative",
            "PublishDate": 1762434545332,
            "Source": "earnings"
        },
        {
            "Title": "HCL Infosystems Board Approves ₹355 Crore NCD Fundraising Through Private Placement",
            "Summary": "HCL Infosystems' Board of Directors approved raising funds through issuance of 35,50,000 unsecured, unlisted, redeemable non-convertible debentures (NCDs) with a face value of ₹1,000 each via private placement. The NCDs will have a maximum tenure of 10 years from allotment date, with an option for early redemption upon mutual agreement. The instruments will carry an interest rate of 0.001% and will be unsecured. The allotment date will be determined later, and redemption will be made either from profits or fresh issue. The board meeting was held on November 6, 2025, lasting from 12:30 PM to 4:15 PM.",
            "Sentiment": "neutral",
            "PublishDate": 1762429810695,
            "Source": "corporate_action"
        },
        {
            "Title": "HCL Infosystems Reports Rs 1,049 Lakh Loss in H1 FY26, Current Liabilities Exceed Assets by Rs 45,982 Lakh",
            "Summary": "HCL Infosystems Limited reported a net loss of Rs 1,049 lakhs for the six months ended September 30, 2025, compared to Rs 1,251 lakhs loss in the same period last year. The company's quarterly loss stood at Rs 621 lakhs for Q2 FY26 versus Rs 428 lakhs in Q2 FY25. Current liabilities exceeded current assets by Rs 45,982 lakhs as of September 30, 2025. The company has continuously made losses for several years and its net worth is fully eroded. Revenue from operations was Rs 75 lakhs for the quarter and Rs 188 lakhs for the half-year. The company received a final arbitration award of Rs 10,281 lakhs against UIDAI contract, though financial impact has not been recognized pending final resolution. HCL Corporation Private Limited has approved financial support including corporate guarantees of Rs 44,600 lakhs and interest-free unsecured loans of Rs 35,500 lakhs. The auditors have issued an unmodified review report but highlighted material uncertainty about the company's ability to continue as a going concern.",
            "Sentiment": "negative",
            "PublishDate": 1762428991730,
            "Source": "earnings"
        },
        {
            "Title": "HCL Infosystems Receives INR 1.23 Crore Tax Demand from Haryana Authorities",
            "Summary": "HCL Infosystems Limited received a demand order in Form GST DRC-07A from the Excise and Taxation Officer, Haryana on October 30, 2025, for INR 1.23 crores. The demand is recoverable under Section 142 of the CGST Act, 2017, relating to non-payment of dues from the pre-GST period covering April 2012 to March 2016 under the Haryana VAT Act, 2003. The company is evaluating the order and examining legal remedies in accordance with the law.",
            "Sentiment": "negative",
            "PublishDate": 1761932105687,
            "Source": "stock"
        },
        {
            "Title": "HCL Infosystems Wins Appeal Against Rs. 312.34 Crore Tax Demand",
            "Summary": "HCL Infosystems Limited received a favorable order from CESTAT, Allahabad, which allowed the company's appeal and set aside a demand of Rs. 312.34 crores plus interest and penalty. The original demand was issued by the Central Goods and Services Tax Commissionerate, Noida in March 2021 under CENVAT Credit Rules, 2004. The company had filed an appeal challenging this order, and CESTAT has now ruled in favor of HCL Infosystems, eliminating the tax liability.",
            "Sentiment": "positive",
            "PublishDate": 1760714431511,
            "Source": "stock"
        },
        {
            "Title": "HCL Infosystems Wins ₹103 Crore Arbitration Award Against UIDAI",
            "Summary": "HCL Infosystems has received a final arbitration decision awarding the company ₹103 crore against the Unique Identification Authority of India (UIDAI). The arbitration process has concluded in favor of HCL Infosystems.",
            "Sentiment": "positive",
            "PublishDate": 1759720225816,
            "Source": "stock"
        },
        {
            "Title": "HCL Infosystems Completes Acquisition of Remaining 15% Stake in Pimpri Chinchwad e-services, Making it Wholly-Owned Subsidiary",
            "Summary": "HCL Infosystems Limited has completed the acquisition of the remaining 15% stake (7,500 shares) in its subsidiary Pimpri Chinchwad e-services Limited for Rs. 7,500 at Rs. 1 per share. The transaction was completed on September 4, 2025, making Pimpri Chinchwad e-services a wholly-owned subsidiary. The company had previously held an 85% stake in the subsidiary. Pimpri Chinchwad e-services was incorporated on September 21, 2010, as a special purpose vehicle intended to provide WiFi connectivity services to Pimpri Chinchwad Municipal Corporation through a joint venture between IL&FS, Software Technology Parks of India, and HCL Infosystems. However, the subsidiary has negative net worth, nil turnover, and no business operations since inception. Shareholder approval for the acquisition was obtained on September 18, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1756994191910,
            "Source": "corporate_action"
        },
        {
            "Title": "HCL Infosystems Reports Rs 428 Lakh Loss for Quarter Ended June 30, 2025",
            "Summary": "HCL Infosystems Limited reported a net loss of Rs 428 lakhs for the quarter ended June 30, 2025, compared to Rs 412 lakhs loss in the same quarter last year. Revenue from operations declined to Rs 39 lakhs from Rs 120 lakhs year-over-year. The company's current liabilities exceeded current assets by Rs 45,032 lakhs as of June 30, 2025. The company continues to face challenges from delayed receipts on system integration contracts, low margin contracts, and ongoing litigation costs. HCL Corporation Private Limited has provided financial support through corporate guarantees of Rs 39,600 lakhs and interest-free loans of Rs 35,500 lakhs. The company has scheduled its 39th Annual General Meeting for September 17, 2025, to be held through video conferencing. Auditors have highlighted material uncertainty regarding the company's ability to continue as a going concern due to continuous losses and fully eroded net worth.",
            "Sentiment": "negative",
            "PublishDate": 1754481853981,
            "Source": "earnings"
        },
        {
            "Title": "HCL Infosystems Schedules Board Meeting for August 6 to Approve Quarterly Financial Results",
            "Summary": "HCL Infosystems Limited has scheduled a Board of Directors meeting for August 6, 2025, to consider and approve unaudited financial results on standalone and consolidated basis for the quarter ended June 30, 2025. The meeting will be held at the company's board room in Noida. The company has closed its trading window from July 1, 2025, until 48 hours after the results declaration for directors, promoters, designated persons and connected persons. No investor conference call will be held this time.",
            "Sentiment": "neutral",
            "PublishDate": 1753952794896,
            "Source": "corporate_action"
        },
        {
            "Title": "EMS Secures Major Order Worth 7.8 Billion",
            "Summary": "EMS has secured a significant order valued at 7.8 billion. The company's market capitalization is reported to be 33 billion.",
            "Sentiment": "positive",
            "PublishDate": 1750754450000,
            "Source": "default"
        },
        {
            "Title": "EMS Secures Lowest Bidder Status for 1 Billion Rupee UP Jal Nigam Project",
            "Summary": "EMS has been awarded the Lowest Bidder (L-1) status by UP Jal Nigam for a project valued at 1 billion rupees. This status indicates that EMS has submitted the most competitive bid for the project.",
            "Sentiment": "positive",
            "PublishDate": 1750636700000,
            "Source": "default"
        },
        {
            "Title": "EMS Secures ₹1.84 Billion Contract",
            "Summary": "EMS, a company, has secured a contract valued at ₹1.84 billion. No further details about the nature of the contract, the client, or the timeframe were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750162034000,
            "Source": "default"
        },
        {
            "Title": "HCL Infosystems: Losses Narrow in Q3, Revenue Declines",
            "Summary": "HCL Infosystems reported Q3 losses of ₹5.25 crore, down from ₹9.30 crore year-over-year. Revenue fell 30.14% to ₹5.70 crore. The company faces challenges in receiving timely customer payments and is initiating arbitration proceedings against several customers. Ritu Arora to retire as Independent Director in April 2025, and Rita Gupta appointed as Additional Non-Executive Director.",
            "Sentiment": "neutral",
            "PublishDate": 1739027857000,
            "Source": "earnings"
        },
        {
            "Title": "HCL Infosystems Reports Reduced Q3 Loss",
            "Summary": "HCL Infosystems has reported a consolidated net loss of 53 million rupees for the third quarter, an improvement from the 93 million rupee loss in the same period last year. However, the company's revenue decreased to 57 million rupees from 82 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738938522000,
            "Source": "earnings"
        }
    ]
}