{
    "Symbol": "HCLTECH",
    "ISIN": "INE860A01027",
    "News": [
        {
            "Title": "HCLTech Achieves Three AWS Competencies in Key Areas",
            "Summary": "HCLTech has been awarded AWS Competencies in Supply Chain, Security and High Performance Computing, reflecting its deep technical expertise and proven ability to deliver high-quality cloud solutions for complex business-critical workloads.",
            "Sentiment": "positive",
            "PublishDate": 1770648285644,
            "Source": "stocks"
        },
        {
            "Title": "HCLTech Named Leader in Digital Workplace Services",
            "Summary": "HCLTech recognized as Leader in Everest Group's Digital Workplace Services PEAK Matrix Assessment 2025, highlighting its GenAI-powered solutions and end-to-end IT services capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1770356926530,
            "Source": "stocks"
        },
        {
            "Title": "HCL Technologies Partners with Circles for Telecom AI",
            "Summary": "HCL Technologies announces strategic partnership with Circles to enhance connectivity innovations for global telecom industry through AI and product engineering capabilities for MVNO and MVNE platforms.",
            "Sentiment": "positive",
            "PublishDate": 1770356209998,
            "Source": "stocks"
        },
        {
            "Title": "HCLTech Partners with HAESL for Aviation MRO Transformation",
            "Summary": "HCL Technologies announces strategic partnership with Hong Kong Aero Engine Services Limited to transform maintenance operations using iMRO/4 asset management solution integrated with SAP S/4HANA.",
            "Sentiment": "positive",
            "PublishDate": 1770172869116,
            "Source": "stocks"
        },
        {
            "Title": "HCLTech Partners with Guardian Life for AI Transformation",
            "Summary": "HCL Technologies announces multi-year strategic partnership with Guardian Life Insurance Company to accelerate AI-driven technology transformation and deliver seamless customer experience.",
            "Sentiment": "positive",
            "PublishDate": 1769616181298,
            "Source": "stocks"
        },
        {
            "Title": "HCL Technologies Partners With Western Union",
            "Summary": "HCL Technologies announces strategic partnership with Western Union to expand Global Capability Center in Hyderabad, focusing on advanced AI and new platform operating model for future payments systems.",
            "Sentiment": "positive",
            "PublishDate": 1769501173322,
            "Source": "stocks"
        },
        {
            "Title": "HCLTech Acquires Singapore's Finergic for $19M",
            "Summary": "HCL Technologies announces acquisition of Singapore-based Finergic Solutions for 19 million Singapore Dollars to strengthen wealth management capabilities, expected to close by April 30, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769178762382,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCL Technologies Announces Strategic Partnerships",
            "Summary": "HCL Technologies partners with Carahsoft Technology Corp for US public sector distribution and Team Global Express for AI-powered digital transformation in Australia and New Zealand.",
            "Sentiment": "positive",
            "PublishDate": 1768977775222,
            "Source": "stocks"
        },
        {
            "Title": "HCL Technologies Expands Partnership with Team Global",
            "Summary": "HCL Technologies selected by Team Global Express, Australia and New Zealand's largest multimodal logistics organization, to accelerate digital transformation with AI-powered solutions and end-to-end managed IT services.",
            "Sentiment": "positive",
            "PublishDate": 1768963206755,
            "Source": "stocks"
        },
        {
            "Title": "HCL Technologies Partners with Carahsoft for US Govt",
            "Summary": "HCL Technologies announces strategic partnership with Carahsoft Technology Corp to accelerate digital transformation for U.S. Federal, State, Local and Education agencies through advanced AI-driven solutions.",
            "Sentiment": "positive",
            "PublishDate": 1768919478460,
            "Source": "stocks"
        },
        {
            "Title": "HCLTech Named Leader in IDC MarketScape SASE Services",
            "Summary": "HCL Technologies recognized as Leader in IDC MarketScape: Worldwide Managed SASE Services 2025 Vendor Assessment, highlighting its multivendor ecosystem and AI-driven platforms.",
            "Sentiment": "positive",
            "PublishDate": 1768891261464,
            "Source": "stocks"
        },
        {
            "Title": "HCLTech Delivers 29% Returns Amid IT Sector Slump",
            "Summary": "HCLTech outperformed IT peers with 28.86% stock gains since 2022, while TCS, Infosys, and Wipro declined. Company's proactive AI strategy and stable growth drove investor confidence in challenging market conditions.",
            "Sentiment": "positive",
            "PublishDate": 1768836318917,
            "Source": "stocks"
        },
        {
            "Title": "HCLTech Wins Innovation Award at Ericsson Supplier Awards",
            "Summary": "HCL Technologies recognized by Ericsson for AI-driven capabilities and automation contributions enhancing operational efficiency through multi-year collaboration focused on zero-touch operations.",
            "Sentiment": "positive",
            "PublishDate": 1768828890619,
            "Source": "stocks"
        },
        {
            "Title": "HCLTech targets $2.5bn AI revenue in 2-3 years",
            "Summary": "HCLTech CEO C Vijayakumar reveals ambitious plans to scale AI-led businesses to $2-2.5 billion revenue in 2-3 years, driven by 'AI factory' and physical AI opportunities worth billions each.",
            "Sentiment": "positive",
            "PublishDate": 1768825287923,
            "Source": "stocks"
        },
        {
            "Title": "HCLTech Q3 FY26: Strong 4.8% YoY Growth, $3B Bookings",
            "Summary": "HCLTech delivers robust Q3 FY26 performance with revenue of $3.79 billion, up 4.8% YoY. Company crosses $15 billion annualized revenue milestone with strong AI-driven bookings of $3 billion.",
            "Sentiment": "positive",
            "PublishDate": 1768577688106,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCLTech Elevates Sandeep Saxena as Chief Growth Officer",
            "Summary": "HCL Technologies announces elevation of company veteran Sandeep Saxena to Chief Growth Officer for India and strategic markets, strengthening focus on India's growth opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1768395879994,
            "Source": "stocks"
        },
        {
            "Title": "HCL Tech Reports $3B Bookings on AI Demand Surge",
            "Summary": "HCL Technologies delivered exceptional $3 billion TCV bookings in Q3, driven by AI-led discretionary spending and advanced AI revenue growing 20% sequentially to $146 million with stable margins at 18.6%.",
            "Sentiment": "positive",
            "PublishDate": 1768362670912,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCS vs HCL Tech: Q3 Results Drive Mixed Brokerage Views",
            "Summary": "TCS and HCL Technologies delivered strong Q3 FY26 performance with revenue growth of 4.87% and 13.32% YoY respectively, driven by robust AI services expansion and strategic partnerships, though brokerages remain divided on valuations.",
            "Sentiment": "positive",
            "PublishDate": 1768301071346,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCL Tech outpaces TCS with strong Q3 growth, deal wins",
            "Summary": "HCL Technologies reports 4.2% sequential growth and $3 billion TCV, raising FY26 guidance, while TCS shows modest 0.8% growth with declining deal wins, highlighting divergent performance in IT sector demand recovery.",
            "Sentiment": "positive",
            "PublishDate": 1768298303843,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCLTech CEO on AI revenue growth and future strategy",
            "Summary": "HCLTech reports $146 million in advanced AI revenue for Q3 with 46% sequential growth. CEO C Vijayakumar discusses AI impact on deal renewals and transformation of IT services delivery models.",
            "Sentiment": "positive",
            "PublishDate": 1768297849961,
            "Source": "stocks"
        },
        {
            "Title": "Morgan Stanley Initiates Buy Rating on HCL Tech",
            "Summary": "Morgan Stanley has initiated a tactical buy rating on HCL Technologies, citing expectations of near-term outperformance driven by improving FY27 growth visibility and margin targets of approximately 18%.",
            "Sentiment": "positive",
            "PublishDate": 1768297821127,
            "Source": "stocks"
        },
        {
            "Title": "HCLTech Q3 Strong Performance Boosts FY27 Confidence",
            "Summary": "HCLTech reports robust Q3FY26 with ₹33,872 cr revenue and ₹4,076 cr profit. Strong bookings up 30% YoY give management confidence for FY27 despite global volatility. Restructuring costs capped at 50 bps.",
            "Sentiment": "positive",
            "PublishDate": 1768292066454,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCL Tech Q3 Results Beat Estimates, Raises Guidance",
            "Summary": "HCL Technologies reported strong Q3FY26 results with 13.3% YoY revenue growth to ₹33,872 crore and raised FY26 guidance. Stock gained 0.11% despite mixed analyst views following better-than-expected performance.",
            "Sentiment": "positive",
            "PublishDate": 1768289598091,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Securities Maintains Hold on HCL Tech at ₹1,590",
            "Summary": "HCL Technologies beats revenue estimates with 4.2% QoQ growth, driven by software products and strong deal momentum. ICICI Securities sets target price at ₹1,590 with Hold rating.",
            "Sentiment": "neutral",
            "PublishDate": 1768289540150,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCLTech Gets 'Hold' Rating After Revenue Beat",
            "Summary": "ICICI Securities maintains 'Hold' rating on HCLTech following strong Q3 performance with 4.2% QoQ constant currency growth, beating estimates of 2.2% and consensus of 2.8%.",
            "Sentiment": "positive",
            "PublishDate": 1768288561896,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCL Tech Q3 beats estimates; Motilal sets ₹2200 target",
            "Summary": "HCL Technologies reported strong Q3FY26 results with revenue of $3.80 billion, up 4.20% QoQ in constant currency, beating estimates. Motilal Oswal maintains BUY rating with target price of ₹2,200.",
            "Sentiment": "positive",
            "PublishDate": 1768283075179,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCL Tech Gets Buy Rating with ₹1,910 Target Price",
            "Summary": "Prabhudas Lilladher recommends buying HCL Technologies with target price of ₹1,910, citing strong Q3 revenue growth of 4.2% QoQ and robust performance across services and software segments.",
            "Sentiment": "positive",
            "PublishDate": 1768281501777,
            "Source": "stocks"
        },
        {
            "Title": "HCL Tech Q3 results drive 2% stock surge Tuesday",
            "Summary": "HCL Technologies shares gained nearly 2% following mixed Q3 FY26 results featuring steady revenue growth and margin expansion, reported Monday by the Noida-based IT services company.",
            "Sentiment": "positive",
            "PublishDate": 1768279388960,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCLTech Downgraded Despite Q3 Beat Performance",
            "Summary": "Dolat Capital downgrades HCLTech to 'Reduce' rating citing limited near-term upside potential despite the company's strong Q3 performance, accelerating deal conversions, and resilient margins following recent stock price gains.",
            "Sentiment": "negative",
            "PublishDate": 1768278649095,
            "Source": "stocks"
        },
        {
            "Title": "HCLTech Q3 Net Profit Falls 3.8% Due to Labour Code Impact",
            "Summary": "HCL Technologies reported Q3 net profit of ₹4,076 crore, down 3.8% QoQ due to ₹956 crore one-time impact from new labour codes. Revenue grew 6% to ₹33,872 crore with strong AI segment performance.",
            "Sentiment": "neutral",
            "PublishDate": 1768278625279,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCL Tech Q3 profit drops 11% YoY despite revenue growth",
            "Summary": "HCL Technologies reported 11% decline in Q3 net profit to ₹4,076 crore despite 13% revenue growth to ₹33,872 crore. Share price fell over 1% following results announcement.",
            "Sentiment": "negative",
            "PublishDate": 1768277825348,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCL Tech shares slip despite strong Q3 performance",
            "Summary": "HCL Technologies stock dropped 0.50% in early trade following Q3 FY26 results as brokerages remain cautious about near-term upside despite solid operational performance and guidance upgrade.",
            "Sentiment": "neutral",
            "PublishDate": 1768277662840,
            "Source": "co_actions_results"
        },
        {
            "Title": "CLSA Sets Hold Rating on HCL Tech at ₹1,661",
            "Summary": "CLSA maintains Hold rating on HCL Technologies with target price of ₹1,661.00, reflecting cautious outlook on the IT services major's near-term prospects.",
            "Sentiment": "neutral",
            "PublishDate": 1768276491785,
            "Source": "stocks"
        },
        {
            "Title": "Nomura Upgrades HCL Tech with ₹1,810 Target Price",
            "Summary": "Global brokerage firm Nomura has issued a buy recommendation for HCL Technologies with a target price of ₹1,810 per share, indicating positive outlook for the IT services company.",
            "Sentiment": "positive",
            "PublishDate": 1768276469314,
            "Source": "stocks"
        },
        {
            "Title": "HSBC Sets Hold Rating on HCL Tech at ₹1,815",
            "Summary": "HSBC maintains Hold rating on HCL Technologies with target price of ₹1,815, reflecting cautious outlook on the IT services major's near-term prospects.",
            "Sentiment": "neutral",
            "PublishDate": 1768276449617,
            "Source": "stocks"
        },
        {
            "Title": "CITI Sets Neutral Rating on HCL Tech at ₹1,700",
            "Summary": "CITI maintains neutral stance on HCL Technologies with target price of ₹1,700, reflecting cautious outlook on the IT services major's near-term prospects.",
            "Sentiment": "neutral",
            "PublishDate": 1768276429133,
            "Source": "stocks"
        },
        {
            "Title": "Macquarie Sets HCL Tech Target at ₹2,080",
            "Summary": "Macquarie maintains outperform rating on HCL Technologies with a target price of ₹2,080, indicating positive analyst sentiment for the IT services major.",
            "Sentiment": "positive",
            "PublishDate": 1768276410501,
            "Source": "stocks"
        },
        {
            "Title": "Morgan Stanley Raises HCL Tech Target to ₹1,760",
            "Summary": "Morgan Stanley maintains Equal Weight rating on HCL Technologies with revised target price of ₹1,760 per share, reflecting updated valuation assessment.",
            "Sentiment": "neutral",
            "PublishDate": 1768276389776,
            "Source": "stocks"
        },
        {
            "Title": "Kotak Maintains 'Reduce' on HCL Tech at ₹1,680",
            "Summary": "Kotak Securities maintains its 'Reduce' rating on HCL Technologies with a price target of ₹1,680, reflecting cautious outlook on the IT services major's near-term prospects.",
            "Sentiment": "negative",
            "PublishDate": 1768276368071,
            "Source": "stocks"
        },
        {
            "Title": "HCL Tech Q3: Strong fundamentals, cautious outlook",
            "Summary": "HCL Technologies delivered robust Q3 performance with 43% YoY jump in deal TCV and upgraded guidance to 4.75-5.25%, but brokerages remain cautious on near-term stock prospects citing seasonality concerns.",
            "Sentiment": "neutral",
            "PublishDate": 1768276198762,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCL Tech Q3 profit drops 11% YoY despite revenue growth",
            "Summary": "HCL Technologies reported 11% decline in Q3FY26 net profit to ₹4,076 crore, while revenue grew 13% YoY to ₹33,872 crore. Brokerages maintain positive outlook with target prices up to ₹1,810.",
            "Sentiment": "neutral",
            "PublishDate": 1768275122887,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCL Tech Updates Guidance Parameters in Concall",
            "Summary": "HCL Technologies clarifies guidance methodology, excluding new acquisitions from projections while incorporating restructuring costs into margin guidance during recent conference call.",
            "Sentiment": "neutral",
            "PublishDate": 1768273851508,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCL Tech Q3 Operating Margin Dips 13 Basis Points YoY",
            "Summary": "HCL Technologies reports a slight decline in Q3 operating margin by 13 basis points year-over-year. Management remains optimistic about future recovery prospects during conference call.",
            "Sentiment": "neutral",
            "PublishDate": 1768273828683,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCL Tech Raises FY Services Revenue Growth Forecast",
            "Summary": "HCL Technologies has increased its full-year services revenue growth forecast to 4.75%-5.25% in constant currency, while maintaining EBIT margin guidance at 17%-18%.",
            "Sentiment": "positive",
            "PublishDate": 1768273503480,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCLTech Q3 beats estimates; analysts raise targets",
            "Summary": "HCL Technologies reported strong Q3 performance with 4.2% constant-currency revenue growth, beating estimates. Company raised FY26 guidance while analysts increased price targets despite valuation concerns.",
            "Sentiment": "positive",
            "PublishDate": 1768273303077,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCLTech Revises Q3 Dividend Record Date to Jan 17",
            "Summary": "HCL Technologies shifts Q3 dividend record date to January 17 due to BMC election holiday, maintaining ₹12 per share payout. Company reports mixed Q3 results with revenue growth but profit decline.",
            "Sentiment": "neutral",
            "PublishDate": 1768270605905,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCLTech Q3 Results: Brokerages Hike Target Prices",
            "Summary": "HCLTech reported Q3 profit of ₹4,076 crore, impacted by ₹956 crore labour code provision. Morgan Stanley, Kotak Securities, and Citi raised target prices despite mixed performance signals.",
            "Sentiment": "neutral",
            "PublishDate": 1768270174618,
            "Source": "co_actions_results"
        },
        {
            "Title": "IT Q3 earnings: TCS, HCL Tech beat estimates",
            "Summary": "TCS and HCL Technologies reported better-than-expected Q3 results. HCL Tech achieved nine-quarter high order booking of $3.01 billion and raised FY26 guidance, while TCS maintained $9.30 billion in new deals.",
            "Sentiment": "positive",
            "PublishDate": 1768264964306,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCL Technologies Q3 Results: Revenue Rises, Profit Dips",
            "Summary": "HCL Technologies reported Q3 revenue of ₹3,387.40 crores, up from ₹3,194.20 crores QoQ, but net profit declined to ₹407.60 crores from ₹423.50 crores, missing estimates.",
            "Sentiment": "neutral",
            "PublishDate": 1768263068290,
            "Source": "co_actions_results"
        },
        {
            "Title": "HCL Technologies Shifts Dividend Record Date",
            "Summary": "HCL Technologies changes interim dividend record date from January 16 to January 17, 2026 due to Maharashtra Municipal Corporation Elections trading holiday, while maintaining payment date of January 27, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768241011254,
            "Source": "co_actions_results"
        }
    ]
}