{
    "Symbol": "HDBFS",
    "ISIN": "INE756I01012",
    "News": [
        {
            "Title": "HDB Financial Services Allots 2.38 Lakh ESOP Shares",
            "Summary": "HDB Financial Services allotted 2,37,865 equity shares to employees under ESOP on January 23, 2026, increasing paid-up share capital to 83,02,76,045 shares of Rs. 10 each.",
            "Sentiment": "positive",
            "PublishDate": 1769174026592,
            "Source": "co_actions_results"
        },
        {
            "Title": "HDB Financial Services Chairman Arijit Basu Resigns",
            "Summary": "Mr. Arijit Basu stepped down as Independent Director & Chairman of HDB Financial Services with immediate effect on January 23, 2026, citing conflict of interest due to new banking sector opportunity.",
            "Sentiment": "neutral",
            "PublishDate": 1769139540039,
            "Source": "stocks"
        },
        {
            "Title": "HDB Financial Plans Credit Cost Reduction Strategy",
            "Summary": "HDB Financial Services aims to reduce credit costs by 10-20 basis points from current 2.5% rate over long term, expects growth in commercial vehicle and construction equipment segments.",
            "Sentiment": "positive",
            "PublishDate": 1768534363014,
            "Source": "stocks"
        },
        {
            "Title": "HDB Financial Projects Steady Growth & NIM Outlook",
            "Summary": "HDB Financial Services expects book growth to match nominal GDP plus 6-7% from Q3 FY26, with NIM projected between 7.9-8% and current 8.09% to remain steady in upcoming quarters.",
            "Sentiment": "positive",
            "PublishDate": 1768534308338,
            "Source": "stocks"
        },
        {
            "Title": "HDB Financial Q3 results prompt brokerage downgrades",
            "Summary": "HDB Financial Services reported 36% profit jump to ₹644 crore in Q3, but mixed performance led to brokerage downgrades with concerns over loan growth and credit costs.",
            "Sentiment": "neutral",
            "PublishDate": 1768522828812,
            "Source": "co_actions_results"
        },
        {
            "Title": "HDB Financial Services Reports No IPO Fund Deviation",
            "Summary": "HDB Financial Services filed Q3 FY26 compliance statement confirming no deviation in utilization of ₹2,500 crore IPO proceeds raised in June 2025, with CARE Ratings monitoring fund usage.",
            "Sentiment": "neutral",
            "PublishDate": 1768393001990,
            "Source": "stocks"
        },
        {
            "Title": "HDB Financial Q3 Net Profit Surges 36.3% to ₹644 Cr",
            "Summary": "HDB Financial Services reports Q3 net profit of ₹644 crore vs ₹472 crore YoY, with 22.1% NII growth and 12% AUM expansion to ₹1,14,853 crore amid strong loan portfolio growth.",
            "Sentiment": "positive",
            "PublishDate": 1768392832971,
            "Source": "co_actions_results"
        },
        {
            "Title": "HDB Financial Services Lock-in Period Ends",
            "Summary": "HDB Financial Services sees 481.5 million shares worth ₹37,000 crore become eligible for trading as six-month lock-in period expires on January 2, with stock trading above IPO price.",
            "Sentiment": "neutral",
            "PublishDate": 1767249147997,
            "Source": "stocks"
        },
        {
            "Title": "HDB Financial Services Reports Strong Q3FY26 Results",
            "Summary": "HDB Financial Services announced Q3FY26 results with net profit of ₹6,439 crores, up 36.3% YoY. Revenue from operations grew 12.8% to ₹46,735 crores with improved financial metrics.",
            "Sentiment": "positive",
            "PublishDate": 1766993783744,
            "Source": "co_actions_results"
        },
        {
            "Title": "HDB Financial Services highlights digital lending trends",
            "Summary": "HDB Financial Services observes 99% digital loan processing and rising premium product demand across India's retail credit landscape, with growth spanning from metros to Tier 2-3 cities.",
            "Sentiment": "positive",
            "PublishDate": 1766647788229,
            "Source": "stocks"
        },
        {
            "Title": "Jefferies Maintains Buy Rating on HDB Financial",
            "Summary": "Jefferies maintains 'Buy' rating on HDB Financial Services with price target of ₹900.00, reflecting positive analyst outlook on the financial services company.",
            "Sentiment": "positive",
            "PublishDate": 1765943517878,
            "Source": "stocks"
        },
        {
            "Title": "HDB Financial Services Allots 2.8 Lakh Equity Shares Under Employee Stock Option Plan",
            "Summary": "HDB Financial Services Limited allotted 2,80,496 equity shares to employees under its Employee Stock Option Schemes on November 28, 2025. The company's paid-up share capital increased from 82,95,66,727 equity shares to 82,98,47,223 equity shares of Rs. 10 each following the allotment.",
            "Sentiment": "neutral",
            "PublishDate": 1764334311856,
            "Source": "corporate_action"
        },
        {
            "Title": "HDB Financial Services Allots Rs 500 Crore Subordinated Bonds on Private Placement",
            "Summary": "HDB Financial Services has allotted 5,000 unsecured redeemable non-convertible subordinated bonds worth Rs 50 crore each, totaling Rs 500 crore through private placement. The bonds are proposed to be listed on BSE's Wholesale Debt Market Segment with maturity scheduled for June 4, 2035.",
            "Sentiment": "neutral",
            "PublishDate": 1764226043923,
            "Source": "corporate_action"
        },
        {
            "Title": "HDB Financial Services Allots Rs 3,030 Crore NCDs on Private Placement Basis",
            "Summary": "HDB Financial Services Limited allotted 30,300 secured redeemable non-convertible debentures with face value of Rs 1 lakh each, raising Rs 3,030 crore through private placement. The NCDs are proposed to be listed on BSE's Wholesale Debt Market Segment with varying maturity periods and are secured by first charge on company's receivables.",
            "Sentiment": "positive",
            "PublishDate": 1764224517906,
            "Source": "corporate_action"
        },
        {
            "Title": "HDB Financial Services Allots Rs 460 Crore NCDs on Private Placement Basis",
            "Summary": "HDB Financial Services Limited has allotted 46,000 secured redeemable non-convertible debentures (NCDs) with a face value of Rs 1,00,000 each, raising Rs 460 crore through private placement. The allotment comprises two tranches: 18,500 NCDs worth Rs 185 crore and 27,500 NCDs worth Rs 275 crore. The debentures are proposed to be listed on the Wholesale Debt Market Segment of BSE Limited. The NCDs are secured by first and exclusive charge through hypothecation over present and future receivables of the company, with minimum asset cover of 1.0 times the principal outstanding and accrued interest. The debentures have varying maturity schedules, with the first tranche maturing in August 2028 and the second tranche maturing in October 2030. The NCDs are redeemable at par value.",
            "Sentiment": "neutral",
            "PublishDate": 1762864703765,
            "Source": "corporate_action"
        },
        {
            "Title": "HDB Financial Services Issues ₹250 Crore Secured Debentures with 7.33% Interest Rate",
            "Summary": "HDB Financial Services has issued 25,000 secured redeemable debentures valued at ₹250 crore. The debentures will be listed on BSE with a tenure of 1,806 days and carry an interest rate of 7.3268%.",
            "Sentiment": "neutral",
            "PublishDate": 1761290926603,
            "Source": "corporate_action"
        },
        {
            "Title": "HDB Financial Services Reports 13% Loan Growth, Credit Costs Rise to 2.7% in Q2",
            "Summary": "HDB Financial Services reported gross loan book growth of 13% year-on-year to ₹111,409 crores for the quarter ended September 30, 2025. Net interest income increased 19.6% year-on-year to ₹2,192 crores, while net interest margin improved to 7.9% from 7.5% in the same quarter last year. Profit after tax rose to ₹581 crores from ₹568 crores in the previous quarter. However, credit costs increased to ₹748 crores from ₹670 crores, with gross Stage 3 assets rising to 2.81% from 2.56%. The company faced challenges in commercial vehicle financing due to monsoon-related vehicle idling and asset quality pressures. Management expects improvement in coming quarters driven by festive season demand, GST rate cuts, and better rural consumption. The customer base grew to 21 million, up 19.6% year-on-year, with secured loans comprising 73% of the total loan book.",
            "Sentiment": "neutral",
            "PublishDate": 1760782810141,
            "Source": "earnings"
        },
        {
            "Title": "HDB Financial Shares Drop Below IPO Price After Mixed Q2 Results",
            "Summary": "HDB Financial Services shares opened lower and fell below their IPO price following mixed quarterly performance. The company reported a 1.7% decline in profit to ₹581 crore, missing analyst estimates due to higher provisions. Net interest income grew 20% to ₹2,192 crore with margins improving 20 basis points to 7.9%. Pre-provision operating profit surged 24% to ₹1,530 crore. However, credit costs rose to 2.7%, the highest since Covid, driven by stress in the commercial vehicle segment. The loan book grew 13% to ₹1,11,409 crore while disbursements remained flat. Morgan Stanley maintains 'Equalweight' rating with ₹805 target, while Jefferies has 'Buy' rating with ₹900 target. Management expects credit costs to moderate to 2.2% and targets 18-20% loan growth over the next 3-5 years.",
            "Sentiment": "negative",
            "PublishDate": 1760587766541,
            "Source": "earnings"
        },
        {
            "Title": "HDB Financial Services Reports 99.92% Utilization of Rs 2,500 Crore IPO Proceeds",
            "Summary": "HDB Financial Services Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing utilization of Rs 2,456.62 crore out of Rs 2,500 crore raised through its IPO. The company's IPO was conducted from June 27-29, 2025, with a total issue size of Rs 12,500 crore comprising Rs 2,500 crore fresh issue and Rs 10,000 crore offer for sale. CARE Ratings Limited, serving as the monitoring agency, reported no deviations from stated objectives. The proceeds were utilized for augmenting the company's Tier-I capital base to meet future capital requirements for onward lending across Enterprise Lending, Asset Finance and Consumer Finance verticals. Rs 2 crore remains held in escrow by book running lead managers pending confirmation of final offer expenses, while Rs 41.38 crore allocated for offer expenses remains unutilized in escrow account. The monitoring agency confirmed all utilization was in accordance with the offer document disclosures.",
            "Sentiment": "positive",
            "PublishDate": 1760539127781,
            "Source": "stock"
        },
        {
            "Title": "HDB Financial Services Reports Mixed Q2 Results with Interim Dividend Declaration",
            "Summary": "HDB Financial Services declared an interim dividend of 2 rupees per share. The company reported quarterly revenue of 45.45 billion rupees compared to 40 billion rupees in the same period last year, showing growth. However, net profit declined to 5.81 billion rupees from 5.91 billion rupees year-over-year. The gross stage 3 ratio increased to 2.81% from 2.56% quarter-over-quarter, indicating a rise in non-performing assets.",
            "Sentiment": "neutral",
            "PublishDate": 1760527609029,
            "Source": "corporate_action"
        },
        {
            "Title": "HDB Financial Shares Down 16% from Listing Price Ahead of Q2 Results",
            "Summary": "HDB Financial Services, HDFC Bank's non-bank subsidiary, will announce its September-quarter results today. The stock has declined 16% from its listing price after debuting two months ago following a Rs 10,000 crore IPO. Analysts expect loan growth of 13% year-on-year and 2% sequentially, with margins expanding by 5 basis points. However, credit costs are projected to rise by 10 basis points to 2.6%. The company continues expanding its branch network and digital channels in Tier 2 and 3 cities. Technical analysts note the stock is consolidating above the Rs 700-740 support zone, with potential upside to Rs 800-850 if it sustains above Rs 740.",
            "Sentiment": "neutral",
            "PublishDate": 1760495303170,
            "Source": "earnings"
        },
        {
            "Title": "HDB Financial Services Announces Q2 Results Date and Interim Dividend Consideration",
            "Summary": "HDB Financial Services will announce its quarterly results on October 15, with the Board of Directors meeting to approve unaudited standalone financial results for the quarter and half-year ending September 30. The Board will also consider declaring an interim dividend on equity shares for financial year 2025-26. An earnings call with investors and analysts is scheduled for 6:30 p.m. on the same day. The company's trading window remains closed from October 1 to October 17 for designated persons, promoters, directors and their immediate relatives. HDB Financial Services shares have declined 1.62% in the past five trading sessions and 6.94% over the past month. Since listing in July, the stock has dropped 12.90%, with a high of Rs 891.90 on July 3 and a low of Rs 728.30 on October 9.",
            "Sentiment": "neutral",
            "PublishDate": 1760340877716,
            "Source": "earnings"
        },
        {
            "Title": "HDB Financial Services Raises ₹200 Crore Through Private Debenture Allocation",
            "Summary": "HDB Financial Services has allocated 20,000 secured debentures worth ₹200 crore through private placement. The debentures will be listed on BSE's wholesale debt market and carry a 7.18% coupon rate with a term of 1,079 days. This debt issuance provides the company with capital while offering investors a fixed-income investment option.",
            "Sentiment": "neutral",
            "PublishDate": 1759993003730,
            "Source": "corporate_action"
        },
        {
            "Title": "HDB Financial Shares Rise 3% After RBI Governor Removes Proposed Business Overlap Restrictions",
            "Summary": "HDB Financial Services shares gained up to 3% following remarks by RBI Governor Sanjay Malhotra about finalized guidelines that removed proposed regulatory restrictions on business overlap between banks and group entities. The restriction removal addresses a key concern highlighted in HDB Financial's IPO prospectus, where the company warned that RBI might prohibit it from offering the same products as its promoter HDFC and group entities like HDFC Sales Private Limited and HDFC Securities Limited. The decision on business overlap has been left to bank boards' discretion. HDB Financial shares had previously fallen below their IPO price of ₹740 after reaching a post-listing high of ₹891, with the shareholder lock-in period recently ending. Shares closed 2.6% higher at ₹769.7.",
            "Sentiment": "positive",
            "PublishDate": 1759295564064,
            "Source": "stock"
        },
        {
            "Title": "HDB Financial Shares Face Key Trading Session as Lock-in Period Expires",
            "Summary": "HDB Financial Services will see its three-month shareholder lock-in period end on Monday, September 29, making 2.28 crore shares (3% of outstanding equity) worth ₹1,723 crore eligible for trading. The stock has declined from its post-listing high of ₹891.9 back to near its IPO price of ₹740, closing at ₹755.85 on Friday. The company reported 18.3% year-on-year growth in Net Interest Income for the June quarter, but provisions increased by over 60%, impacting net profit. The stock has declined 3% in the past month.",
            "Sentiment": "neutral",
            "PublishDate": 1759064540278,
            "Source": "stock"
        },
        {
            "Title": "HDB Financial Schedules Q2 Results Review for October 15",
            "Summary": "HDB Financial has announced it will review its Q2 results on October 15. The company has set this date for examining its quarterly financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1758884329568,
            "Source": "earnings"
        },
        {
            "Title": "HDB Financial Services Raises Rs 275 Crore Through Private Placement of NCDs",
            "Summary": "HDB Financial Services Limited allotted 27,500 secured redeemable non-convertible debentures with a face value of Rs 1,00,000 each, raising Rs 275 crore through private placement. The NCDs carry a coupon rate of 7.3274% and have a tenure of 1,044 days, maturing on August 4, 2028. The debentures are secured by a first and exclusive charge on the company's present and future receivables with minimum asset cover of 1.0 times. Interest payments are scheduled for August 4, 2026, August 4, 2027, and at maturity. The NCDs are proposed to be listed on the Wholesale Debt Market Segment of BSE Limited and will be redeemable at par.",
            "Sentiment": "neutral",
            "PublishDate": 1758780612608,
            "Source": "corporate_action"
        },
        {
            "Title": "HDB Financial Services Shareholders Approve Three Employee Stock Option Scheme Ratifications",
            "Summary": "HDB Financial Services Limited successfully passed three special resolutions through postal ballot on September 4, 2025, ratifying Employee Stock Option Schemes from 2014, 2017, and 2022. The voting involved 1,263,623 total shareholders on record. Promoter and Promoter Group voted 100% in favor across all three resolutions with 615,461,535 shares. Public institutional investors showed mixed support, with approximately 50.67% voting in favor for the 2014 and 2017 schemes, but only 39.59% supporting the 2022 scheme. Public non-institutional investors demonstrated strong support with over 97% approval across all three resolutions. Overall voting participation was 86.23% of outstanding shares, with the 2014 and 2017 schemes receiving 93.47% approval, while the 2022 scheme received 92.01% approval.",
            "Sentiment": "positive",
            "PublishDate": 1757042926234,
            "Source": "corporate_action"
        },
        {
            "Title": "HDB Financial Services Raises Rs. 200 Crore Through Private Placement of NCDs",
            "Summary": "HDB Financial Services Limited allotted 20,000 secured redeemable non-convertible debentures worth Rs. 200 crore through private placement. The NCDs carry a face value of Rs. 1,00,000 each with a tenure of 1135 days and offer a coupon rate of 7.18% payable annually. The debentures are scheduled to mature on September 22, 2028, and are proposed to be listed on the Wholesale Debt Market Segment of BSE Limited. The NCDs are secured by a first and exclusive charge over present and future receivables of the company with minimum asset cover of 1.0 times the principal outstanding and accrued interest.",
            "Sentiment": "positive",
            "PublishDate": 1755152528715,
            "Source": "corporate_action"
        },
        {
            "Title": "HDB Financial Services Raises Rs. 500 Crore Through Private Placement of NCDs",
            "Summary": "HDB Financial Services Limited allotted 50,000 secured redeemable non-convertible debentures worth Rs. 500 crore through private placement. The NCDs have a face value of Rs. 1 lakh each with a tenure of 881 days, maturing on January 5, 2028. The debentures offer a coupon rate of 7.9611% with annual payments and final payment at maturity. The NCDs are secured by first and exclusive charge over present and future receivables with minimum asset cover of 1.0 times. The debentures are proposed to be listed on the Wholesale Debt Market Segment of BSE Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1754551678903,
            "Source": "corporate_action"
        },
        {
            "Title": "HDB Financial Services Faces Lock-in Expiry as 23 Million Shares Become Tradeable",
            "Summary": "HDB Financial Services shares are expected to be in focus as the lock-in period for certain shareholders expires, releasing approximately 23 million shares for trading, representing about 3% of the company's total equity. Lock-in periods are restrictions that prevent major stakeholders from selling shares immediately after listing to provide market stability. The stock closed flat at Rs 745.05, trading just 0.6% above its issue price of Rs 740 and nearly 10% below its listing price of Rs 835. The company reported quarterly results showing net profit declined 2% to Rs 568 crore from Rs 582 crore in the same quarter last year, while net interest income grew 18% to Rs 2,092 crore driven by strong advances growth.",
            "Sentiment": "neutral",
            "PublishDate": 1753847246587,
            "Source": "stock"
        },
        {
            "Title": "HDB Financial Services Reports Mixed Q1 FY26 Results with Rising Credit Costs and Slower Disbursements",
            "Summary": "HDB Financial Services reported quarterly results with total gross loans of ₹1.09 lakh crores, growing 2.3% sequentially and 14.3% year-on-year. Net interest income increased 6.0% quarter-on-quarter to ₹2,092 crores, with net interest margin expanding to 7.7% from 7.6% in the previous quarter. However, disbursements declined 14.0% sequentially and 8.1% year-on-year to ₹15,171 crores. Credit costs rose to ₹670 crores from ₹634 crores in the prior quarter, while gross Stage 3 assets increased to 2.56% from 2.26% in March 2025. The company reported profit after tax of ₹568 crores versus ₹531 crores in the previous quarter. Management cited weakness in commercial vehicle financing and unsecured business loans as key challenges, attributing some stress to seasonal factors and economic conditions. Asset Finance disbursements were down 15% year-on-year, while the company maintained its customer base grew to 20.1 million. Return on assets stood at 1.94% annualized, with management noting this would be 2.02% when adjusted for IPO proceeds.",
            "Sentiment": "neutral",
            "PublishDate": 1753158533551,
            "Source": "earnings"
        },
        {
            "Title": "HDB Financial Services: Analysts Remain Bullish Despite Weak Q1",
            "Summary": "Emkay Global and InCred Equities maintain positive outlook on HDB Financial Services, projecting up to 10% stock price increase despite weak Q1 results. Analysts cite expected margin improvements, shift to higher-yielding segments, and potential credit cost normalization from Q2FY26. Q1 saw modest loan growth, rising credit costs, but NIM expanded by 10bps.",
            "Sentiment": "positive",
            "PublishDate": 1752656178000,
            "Source": "earnings"
        },
        {
            "Title": "HDB Financial Services: Q1 Profit Dips 2% Despite Strong NII Growth",
            "Summary": "HDB Financial Services reported a 2% YoY decline in Q1FY26 net profit to Rs 568 crore, despite 18% NII growth. Total income rose 14%, loans grew 14%, and AUM increased 15%. However, provisions surged and asset quality weakened with gross stage 3 loans rising to 2.56%.",
            "Sentiment": "neutral",
            "PublishDate": 1752633724000,
            "Source": "earnings"
        },
        {
            "Title": "HDB Financial Services Reports Q1 Financial Results",
            "Summary": "HDB Financial Services has reported its Q1 financial results. The company's net profit for the quarter was 5.68 billion rupees, compared to 5.8 billion rupees in the same quarter last year. Total revenue from operations increased to 44.65 billion rupees from 38.8 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1752625047000,
            "Source": "default"
        },
        {
            "Title": "HDB Financial Services Reports Increase in Q1 Gross Stage 3 Loans",
            "Summary": "HDB Financial Services has reported an increase in its Gross Stage 3 loans for the first quarter. The figure has risen to 2.56% from 2.26% in the previous quarter, indicating a quarter-on-quarter increase.",
            "Sentiment": "negative",
            "PublishDate": 1752584362000,
            "Source": "result"
        },
        {
            "Title": "HDB Financial Services Reports 14.7% YoY AUM Growth",
            "Summary": "HDB Financial Services announced that its Assets Under Management (AUM) reached 1.10 trillion rupees as of June 30. This represents a year-over-year increase of 14.7% in AUM.",
            "Sentiment": "positive",
            "PublishDate": 1752580767000,
            "Source": "default"
        },
        {
            "Title": "HDB Financial Services Reports Q1 Financial Results",
            "Summary": "HDB Financial Services has released its Q1 financial results. The company reported a net profit of 5.68 billion rupees, compared to 5.8 billion rupees in the same quarter last year. Total revenue from operations increased to 44.65 billion rupees from 38.8 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1752580492000,
            "Source": "result"
        },
        {
            "Title": "HDB Financial Services: Q1 Profit Dips 2.4% Despite 18% NII Growth",
            "Summary": "HDB Financial Services reported a 2.4% year-on-year decline in Q1 net profit to Rs 568 crore, despite an 18% increase in net interest income to Rs 2,092 crore. Total income rose 15% to Rs 4,465 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1752579593000,
            "Source": "earnings"
        },
        {
            "Title": "HDB Financial Services: Q1 Results Anticipated Today",
            "Summary": "HDB Financial Services, HDFC Bank's NBFC subsidiary, will announce its Q1 earnings today. This marks the company's first quarterly results since its listing on July 2. The company's IPO of Rs 12,500 crore was oversubscribed 17.65 times. Emkay Global initiated coverage with a 'Buy' rating and a target price of Rs 900.",
            "Sentiment": "positive",
            "PublishDate": 1752545389000,
            "Source": "earnings"
        },
        {
            "Title": "HDB Financial Services: Q1FY26 Results Announcement Scheduled",
            "Summary": "HDB Financial Services will announce Q1FY26 results on July 15, 2025. The Board meeting is scheduled for the same day, followed by an earnings call at 6:30 p.m. The trading window for insiders is closed from July 1 until 48 hours after results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1752384256000,
            "Source": "corporate_action"
        },
        {
            "Title": "HDB Financial Services: Limited Upside Potential, Says Macquarie Analyst",
            "Summary": "Macquarie's Suresh Ganapathy states HDB Financial shares have limited upside from current levels after 13% listing gain. Concerns include stress in vehicle finance segment, rising credit costs, and high valuation multiples. The stock is trading at 2.7-2.8 times forward price-to-book.",
            "Sentiment": "neutral",
            "PublishDate": 1751532869000,
            "Source": "normal_news"
        },
        {
            "Title": "HDB Financial Services: Share Price Surges 6% Post-Debut",
            "Summary": "HDB Financial Services Ltd. shares rose over 6% on Thursday, a day after its market debut. The stock opened at Rs 835 on Wednesday, 13% above its IPO price of Rs 740. The Rs 12,500-crore IPO was oversubscribed 17 times last week, marking one of the largest NBFC offerings in recent years.",
            "Sentiment": "positive",
            "PublishDate": 1751517792000,
            "Source": "normal_news"
        }
    ]
}