{
    "Symbol": "HDFCAMC",
    "ISIN": "INE127D01025",
    "News": [
        {
            "Title": "HDFC AMC Q3 Revenue Grows 15% YoY to ₹10.8b",
            "Summary": "Motilal Oswal maintains BUY rating with ₹3,200 target as HDFC AMC reports strong quarterly performance with 15% revenue growth and 81.5% EBITDA margin.",
            "Sentiment": "positive",
            "PublishDate": 1768842809972,
            "Source": "co_actions_results"
        },
        {
            "Title": "Citi Maintains Neutral Rating on HDFC AMC at ₹2,875",
            "Summary": "Citigroup maintains neutral stance on HDFC Asset Management Company with target price of ₹2,875, reflecting cautious outlook on the asset management firm's prospects.",
            "Sentiment": "neutral",
            "PublishDate": 1768539250941,
            "Source": "stocks"
        },
        {
            "Title": "HDFC AMC Reports 17% YoY AUM Growth",
            "Summary": "HDFC Asset Management Company achieved quarterly average Assets Under Management growth of 17% year-on-year, demonstrating strong performance in the asset management sector.",
            "Sentiment": "positive",
            "PublishDate": 1768383777719,
            "Source": "mutualfunds"
        },
        {
            "Title": "HDFC AMC Q3: AUM grows 5% QoQ, market share rises",
            "Summary": "HDFC AMC's quarterly average AUM increased 5% QoQ to ₹9.24 lakh crore with equity market share rising to 13%. Operating profit jumped 9% QoQ to ₹876 crore on lower expenses.",
            "Sentiment": "positive",
            "PublishDate": 1768368313819,
            "Source": "co_actions_results"
        },
        {
            "Title": "HDFC AMC-IFC partnership formalized for ₹2,500 cr fund",
            "Summary": "HDFC AMC officially announces IFC partnership for Structured Credit Fund-I with ₹1,290 crore first close, targeting mid-market enterprises with alternative debt financing solutions.",
            "Sentiment": "positive",
            "PublishDate": 1767605673561,
            "Source": "stocks"
        },
        {
            "Title": "HDFC AMC Partners with IFC for Mid-Market Credit",
            "Summary": "HDFC Asset Management Company teams up with International Finance Corporation to enhance private credit access for mid-market businesses across India.",
            "Sentiment": "positive",
            "PublishDate": 1767577753883,
            "Source": "stocks"
        },
        {
            "Title": "HDFC AMC uploads Q3FY26 earnings call audio recording",
            "Summary": "HDFC Asset Management Company Limited has uploaded the audio recording of its Q3FY26 earnings call conducted on January 14, 2026, on its official website under regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1767354162184,
            "Source": "co_actions_results"
        },
        {
            "Title": "HDFC Asset Management Receives ESG Rating of 74 from NSE Sustainability Ratings",
            "Summary": "NSE Sustainability Ratings and Analytics Limited assigned an ESG rating of 74 to HDFC Asset Management Company Limited for FY2025. The rating was independently prepared based on publicly available information without any engagement from HDFC Asset Management Company.",
            "Sentiment": "neutral",
            "PublishDate": 1765282885803,
            "Source": "mutualfunds"
        },
        {
            "Title": "HDFC Asset Management Completes 1:1 Bonus Share Allotment",
            "Summary": "HDFC Asset Management Company allotted 21,41,54,246 bonus equity shares in a 1:1 ratio to shareholders as of the November 26, 2025 record date. The company's paid-up share capital doubled to Rs. 2,14,15,42,460 divided into 42,83,08,492 equity shares of Rs. 5 each following the allotment approval on November 27, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1764219950260,
            "Source": "corporate_action"
        },
        {
            "Title": "HDFC Asset Management Shareholders Approve Bonus Share Issue via E-Voting",
            "Summary": "HDFC Asset Management Company Limited shareholders passed an ordinary resolution approving the issuance of bonus shares through postal ballot e-voting that concluded on November 16, 2025. The resolution received overwhelming support with 97.5082% votes in favor from 2,704 members holding 18,14,97,669 equity shares, out of total 4,45,397 eligible shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1763307293602,
            "Source": "corporate_action"
        },
        {
            "Title": "SEBI Reviews Mutual Fund Revamp Proposals in Consultation Process",
            "Summary": "SEBI has stated that mutual fund revamp proposals are currently under consultation. HDFC AMC is mentioned in connection with these ongoing discussions regarding potential changes to mutual fund regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762234068620,
            "Source": "mutualfunds"
        },
        {
            "Title": "HDFC Asset Management Allots 1.43 Lakh Equity Shares Under Employee Stock Option Scheme",
            "Summary": "HDFC Asset Management Company Limited allotted 1,42,964 equity shares of Rs. 5 each to eligible employees under its Employee Stock Option Scheme 2020. The Share Allotment Committee approved the allotment through a circular resolution. Following this allotment, the company's paid-up share capital increased to Rs. 1,07,07,33,575, consisting of 21,41,46,715 equity shares of Rs. 5 each. The allotted shares bear distinctive numbers from 21,40,03,752 to 21,41,46,715.",
            "Sentiment": "neutral",
            "PublishDate": 1761564674663,
            "Source": "corporate_action"
        },
        {
            "Title": "HDFC AMC Reports 16% Revenue Growth, Announces 1:1 Bonus Share Issue",
            "Summary": "HDFC Asset Management Company reported revenue from operations of Rs.10,260 million for the quarter ended September 30, 2025, representing 16% year-on-year growth. The company's Assets Under Management (AUM) reached Rs.8.7 trillion with an 11.5% market share. Operating profit grew 13% year-on-year to Rs.7,796 million. Profit after tax stood at Rs.7,179 million, which included a Rs.468 million reversal of income tax provision from earlier periods. The Board of Directors approved a 1:1 bonus share issue, subject to shareholder approval. The company launched two new fund offerings during the quarter - HDFC Innovation Fund collecting Rs.24 billion and HDFC Diversified Equity All Cap Active FoF collecting Rs.11 billion. Equity-oriented AUM reached Rs.5.4 trillion with a 12.9% market share. The company serves 14.5 million unique investors and maintains market leadership among individual investors with 13.1% market share.",
            "Sentiment": "positive",
            "PublishDate": 1760701007212,
            "Source": "earnings"
        },
        {
            "Title": "HDFC Asset Management Seeks Shareholder Approval for 1:1 Bonus Share Issue",
            "Summary": "HDFC Asset Management Company Limited has issued a postal ballot notice seeking shareholder approval for a 1:1 bonus share issue. Under the proposal, shareholders will receive one bonus equity share of ₹5 face value for every existing fully paid-up equity share held as on November 26, 2025 (record date). The bonus issue will be funded by capitalizing ₹52.41 crores from Capital Redemption Reserve Account and up to ₹65 crores from Securities Premium Account. The e-voting period runs from October 18, 2025 (9:00 AM) to November 16, 2025 (5:00 PM). The company manages ₹8,73,000 crores in assets under management as of September 30, 2025, and serves 1.45 crore unique investors. The board stated the bonus issue aims to reward shareholders and enhance share liquidity by making shares more affordable. Bonus shares will be allotted only in dematerialized form, with physical shareholders required to provide demat account details by November 24, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760687417290,
            "Source": "corporate_action"
        },
        {
            "Title": "HDFC AMC Provides ESOP Expense Guidance and Operating Cost Projections",
            "Summary": "HDFC AMC has released its Employee Stock Option Plan (ESOP) expense guidance for the coming years. The company estimates ESOP expenses of ₹42 crores for H2 FY26, ₹67 crores for FY27, ₹53 crores for FY28, and ₹33 crores for FY29. The asset management company expects operating costs to increase by 12-15% annually while targeting to maintain operating margins between 33-35 basis points. Additionally, HDFC AMC anticipates that its Total Expense Ratio will decrease steadily in the future.",
            "Sentiment": "neutral",
            "PublishDate": 1760585705088,
            "Source": "stock"
        },
        {
            "Title": "HDFC Asset Management Uploads Q2 FY26 Earnings Call Audio Recording",
            "Summary": "HDFC Asset Management Company Limited conducted its quarterly earnings call on October 15, 2025, to discuss financial results for the quarter and half year ended September 30, 2025. The company has uploaded the audio recording of the earnings call on its website at https://www.hdfcfund.com/about-us/financial/shareholders-presentation. The earnings call was previously announced on October 8, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760544774380,
            "Source": "earnings"
        },
        {
            "Title": "HDFC AMC Reports Strong Q2 Results with 16% Revenue Growth and Announces 1:1 Bonus Issue",
            "Summary": "HDFC AMC reported quarterly revenue of 10.3 billion rupees, up from 8.9 billion rupees year-over-year. The company's net profit increased to 7.2 billion rupees compared to 5.8 billion rupees in the same period last year. Additionally, HDFC AMC approved a bonus share issue in the ratio of 1:1 for shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1760520266247,
            "Source": "earnings"
        },
        {
            "Title": "HDFC Asset Management Schedules Board Meeting to Consider Bonus Share Issue and Financial Results",
            "Summary": "HDFC Asset Management Company Limited will hold a board meeting on October 15, 2025, to consider a proposal for issuing bonus equity shares, subject to shareholder approval. The board will also review the company's unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company has implemented a trading window closure for designated persons and their immediate relatives until October 17, 2025, in compliance with insider trading regulations.",
            "Sentiment": "positive",
            "PublishDate": 1760100360502,
            "Source": "corporate_action"
        },
        {
            "Title": "HDFC Asset Management Company Block Trade Worth Rs. 109.02 Crores on NSE",
            "Summary": "HDFC Asset Management Company executed a block trade on the National Stock Exchange worth Rs. 109.02 crores. The transaction involved approximately 194,673 shares at a price of Rs. 5,600 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1759473966617,
            "Source": "order&deals"
        },
        {
            "Title": "HDFC AMC Schedules Board Meeting on October 15 to Review Q2 Results",
            "Summary": "HDFC AMC has scheduled a board meeting for October 15 to review its Q2 results. The meeting will focus on examining the company's quarterly financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1759317229697,
            "Source": "earnings"
        },
        {
            "Title": "HDFC AMC Schedules Q2 Earnings Review for October 15",
            "Summary": "HDFC AMC has announced it will review its Q2 earnings on October 15. The asset management company has set this date for its quarterly results review.",
            "Sentiment": "neutral",
            "PublishDate": 1758878998358,
            "Source": "earnings"
        },
        {
            "Title": "HDFC Asset Management Sees Rs. 44.61 Crore Block Trade on NSE",
            "Summary": "HDFC Asset Management Company Ltd. witnessed a block trade worth Rs. 44.61 crores on the National Stock Exchange. The transaction involved approximately 77,493 shares executed at a price of Rs. 5,756.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1757564462024,
            "Source": "order&deals"
        },
        {
            "Title": "HDFC Life Insurance Sees Block Trade Worth Rs. 82.90 Crores on NSE",
            "Summary": "HDFC Life Insurance Company executed a block trade on the National Stock Exchange worth Rs. 82.90 crores. The transaction involved approximately 1,051,072 shares at a price of Rs. 788.70 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1756104432870,
            "Source": "order&deals"
        },
        {
            "Title": "HDFC AMC Reports 25% Revenue Growth, AUM Crosses ₹8.5 Trillion in Q1 FY26",
            "Summary": "HDFC Asset Management Company reported strong quarterly results with revenue from operations growing 25% year-on-year to ₹9,678 million. The company's Assets Under Management (AUM) crossed ₹8.5 trillion with an overall market share of 11.5% and 21% year-on-year growth. Profit after tax increased 24% to ₹7,480 million. The company added 500,000 unique customers during the quarter, bringing total unique investor penetration to 25% of mutual fund investors in India. Systematic transactions reached ₹40.1 billion in June 2025, up from ₹32 billion in June 2024. The company announced a new Employee Stock Option Plan (ESOP) and Performance Stock Units (PSU) scheme covering over 800 employees, representing 50% of the workforce. HDFC AMC has received SEBI approval to set up a Specialized Investment Fund (SIF), opening new product avenues. Operating profit grew 30% year-on-year with stable margins of 36 basis points of AUM.",
            "Sentiment": "positive",
            "PublishDate": 1753175035041,
            "Source": "earnings"
        },
        {
            "Title": "HDFC Asset Management Company Block Trade on NSE",
            "Summary": "A block trade of approximately 181,724 shares of HDFC Asset Management Company Ltd. occurred on the National Stock Exchange (NSE) for Rs. 101.50 crores. The trade was executed at a price of Rs. 5585.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1752830976000,
            "Source": "block_details"
        },
        {
            "Title": "HDFC Asset Management Company Reports Block Trade on NSE",
            "Summary": "A block trade of approximately 108,386 shares of HDFC Asset Management Company Ltd. was reported on the National Stock Exchange (NSE). The trade was valued at Rs. 60.37 crores, with shares priced at Rs. 5570.00 each.",
            "Sentiment": "neutral",
            "PublishDate": 1752816835000,
            "Source": "block_details"
        },
        {
            "Title": "HDFC Asset Management Company Block Trade on NSE",
            "Summary": "A block trade of approximately 153,763 shares of HDFC Asset Management Company Ltd. occurred on the National Stock Exchange (NSE) for Rs. 86.02 crores. The trade was executed at a price of Rs. 5594.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1752813863000,
            "Source": "block_details"
        },
        {
            "Title": "HDFC AMC Expands Product Range and Reports Growth in SIP AUM",
            "Summary": "HDFC AMC has expanded its product range to include passive funds such as index funds, ETFs, market cap indices, smart beta, and sector thematic funds. The company has received SEBI approval for a specialized investment fund to match investment strengths and risk management. Additionally, HDFC AMC reported that their SIP AUM exceeded Rs 2 trillion in the latest quarter.",
            "Sentiment": "positive",
            "PublishDate": 1752810333000,
            "Source": "default"
        },
        {
            "Title": "HDFC Asset Management Company: New ESOP and PSU Scheme Announced",
            "Summary": "HDFC AMC has introduced a new scheme granting 1 million ESOP and 0.2 million PSUs, effective June 2025. The estimated expense for this scheme is Rs 2.05-2.10 billion over FY26-FY30, compared to Rs 1.8 billion in the previous five years. The ESOP cost impact is projected to be 0.8 bps in FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1752810274000,
            "Source": "corporate_action"
        },
        {
            "Title": "HDFC Asset Management Company: Q1 Profit Surges 24%, Analysts Positive Despite Cost Concerns",
            "Summary": "HDFC AMC reported a 24% YoY increase in Q1 net profit to Rs 748 crore, with revenue up 25% to Rs 968 crore. Average AUM grew 23% YoY to Rs 8.3 lakh crore. Analysts praise strong AUM growth and revenue yields but warn of potential cost pressures. Morgan Stanley raised its price target to Rs 4,910, while Jefferies increased to Rs 6,100, both citing strong fundamentals despite valuation concerns.",
            "Sentiment": "positive",
            "PublishDate": 1752808075000,
            "Source": "earnings"
        },
        {
            "Title": "HDFC AMC Reports 21% Increase in AUM for Q1",
            "Summary": "HDFC Asset Management Company (AMC) has reported a 21% year-over-year increase in Assets Under Management (AUM) for the first quarter. This growth indicates a positive performance for the company in the asset management sector.",
            "Sentiment": "positive",
            "PublishDate": 1752742602000,
            "Source": "default"
        },
        {
            "Title": "HDFC Asset Management Company: Q1 Profit Jumps 24%, Revenue Up 25%",
            "Summary": "HDFC AMC reported a net profit of ₹748 crore for Q1 FY26, up 24% year-on-year. Revenue increased 25% to ₹968 crore. Total income rose 26.5% to ₹948 crore compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1752742282000,
            "Source": "earnings"
        },
        {
            "Title": "HDFC AMC Reports Q1 Financial Results",
            "Summary": "HDFC AMC has announced its Q1 financial results. The company's revenue increased to 9.68 billion rupees from 7.75 billion rupees in the same quarter last year. The standalone net profit rose to 7.5 billion rupees from 6.04 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1752740528000,
            "Source": "result"
        },
        {
            "Title": "HDFC Asset Management Company: Stock Hits Record High, Up 5x from IPO Price",
            "Summary": "HDFC Asset Management Company's stock reached a record high on July 16, 2025, gaining 26% year-to-date. The stock has risen 5x from its 2018 IPO price of ₹1,100. Quarterly Average Assets Under Management grew 7% from the previous quarter, with Equity AUM up 8%. Nomura raised its price target to ₹5,500, maintaining a 'buy' recommendation.",
            "Sentiment": "positive",
            "PublishDate": 1752642201000,
            "Source": "normal_news"
        },
        {
            "Title": "HDFC Asset Management Co to Review Q1 Results on July 17",
            "Summary": "HDFC Asset Management Co has announced that it will review its first quarter results on July 17. No additional details about the expected financial performance or specific metrics were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1751027434000,
            "Source": "default"
        },
        {
            "Title": "HDFC Mutual Fund: Launches Innovation-Themed Equity Scheme",
            "Summary": "HDFC Asset Management is launching HDFC Innovation Fund, an open-ended equity scheme focusing on innovation-led businesses. The NFO opens on June 27 and closes on July 11. The fund will invest at least 80% in equity instruments, targeting companies demonstrating innovation across sectors and market caps. Minimum investment is ₹100, with both Direct and Regular plans available.",
            "Sentiment": "positive",
            "PublishDate": 1750675378000,
            "Source": "corporate_action"
        },
        {
            "Title": "HDFC Asset Management Company: JPMorgan Downgrades Stock to 'Neutral'",
            "Summary": "JPMorgan downgraded HDFC AMC to 'Neutral' from 'Overweight', maintaining a ₹5,000 price target. The downgrade is due to limited near-term catalysts following a 33% rally over three months. Equity inflows have slowed, but SIP flows remain resilient. The stock closed at Rs 4,959 on Friday, down 1.44%.",
            "Sentiment": "neutral",
            "PublishDate": 1750042324000,
            "Source": "normal_news"
        },
        {
            "Title": "HDFC Asset Management Company Block Trade on NSE",
            "Summary": "A block trade of approximately 95,931 shares of HDFC Asset Management Company Ltd. occurred on the National Stock Exchange (NSE) for Rs. 49.61 Crores. The trade was executed at a price of Rs. 5171.60 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1749619671000,
            "Source": "block_details"
        },
        {
            "Title": "HDFC Asset Management Co.: Last Day to Buy Shares for Record Dividend",
            "Summary": "June 5 is the last day to buy HDFC AMC shares to qualify for the Rs 90 per share final dividend for FY2025, the highest in company history. The record date is June 6, with total dividend payout around Rs 1,924 crore. Q4 net profit rose 18% to Rs 638 crore, with total income up 20.5% to Rs 1,025 crore.",
            "Sentiment": "positive",
            "PublishDate": 1749102343000,
            "Source": "corporate_action"
        },
        {
            "Title": "HDFC Asset Management Company Reports Block Trade on NSE",
            "Summary": "A block trade of approximately 61,002 shares of HDFC Asset Management Company Ltd. was executed on the National Stock Exchange (NSE) for Rs. 27.49 crores. The trade was conducted at a price of Rs. 4506.30 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1745302744000,
            "Source": "block_details"
        },
        {
            "Title": "HDFC Asset Management Company: Q4 Profit Rises 18%, Declares Rs 90/Share Dividend",
            "Summary": "HDFC AMC reported a consolidated net profit of Rs 639 crore in Q4, up 18% YoY. Revenue from operations increased 30% YoY to Rs 901 crore. The board recommended a final dividend of Rs 90 per equity share for FY 2025.",
            "Sentiment": "positive",
            "PublishDate": 1744883446000,
            "Source": "earnings"
        },
        {
            "Title": "HDFC AMC Reports Strong Q4 Results and Declares Dividend",
            "Summary": "HDFC Asset Management Company (AMC) has reported its Q4 financial results. The company's revenue increased to 9 billion rupees from 6.95 billion rupees year-over-year. Net profit rose to 6.4 billion rupees from 5.41 billion rupees in the same period last year. Additionally, HDFC AMC has declared a dividend of 90 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1744882836000,
            "Source": "result"
        },
        {
            "Title": "HDFC Asset Management Company: Launches WhatsApp-Based Mutual Fund Investment Feature",
            "Summary": "HDFC AMC introduces Tap2Invest, an industry-first feature allowing KYC-verified investors to invest in mutual funds through a click-based interface on WhatsApp. The platform supports SIPs, lumpsum investments, and various digital payment options.",
            "Sentiment": "positive",
            "PublishDate": 1743591556000,
            "Source": "normal_news"
        },
        {
            "Title": "HDFC Asset Management Company Block Trade on NSE",
            "Summary": "A block trade of approximately 50,047 shares of HDFC Asset Management Company Ltd. was executed on the National Stock Exchange (NSE) at a price of Rs. 4085.00 per share. The total value of the transaction amounted to Rs. 20.44 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1742875886000,
            "Source": "block_deals"
        },
        {
            "Title": "HDFC Asset Management Company Reports Block Trade on NSE",
            "Summary": "A block trade of approximately 50,657 shares of HDFC Asset Management Company Ltd. was executed on the National Stock Exchange (NSE) for Rs. 19.67 crores. The average price per share in this transaction was Rs. 3,882.95.",
            "Sentiment": "neutral",
            "PublishDate": 1741329376000,
            "Source": "block_deals"
        },
        {
            "Title": "HDFC Asset Management Company: Stock Extends Losing Streak Despite Strong Financials",
            "Summary": "HDFC AMC stock has declined 15% over the past four months, despite reporting a 31% YoY increase in Q3FY25 net profit. Brokerages maintain bullish outlook with Motilal Oswal setting a target price of ₹4,800 and Prabhudas Lilladher revising to ₹4,450.",
            "Sentiment": "neutral",
            "PublishDate": 1740644049000,
            "Source": "earnings"
        },
        {
            "Title": "HDFC AMC: Launches Rs 250 Monthly SIP Initiative",
            "Summary": "HDFC AMC, along with other fund houses, is reducing the minimum SIP amount to Rs 250 per month for certain funds. This initiative, guided by SEBI and AMFI, aims to make mutual fund investments more accessible and affordable to a wider range of investors. The company is collaborating with ecosystem partners to ensure the sustainability of this program.",
            "Sentiment": "positive",
            "PublishDate": 1740366900000,
            "Source": "normal_news"
        },
        {
            "Title": "HDFC Mutual Fund: Launches Nifty100 Quality 30 Index Fund",
            "Summary": "HDFC Asset Management introduces HDFC Nifty100 Quality 30 Index Fund, a passive fund tracking the Nifty100 Quality 30 Total Returns Index. The NFO opens from January 31 to February 14, 2025, with a minimum investment of ₹100. The fund aims for long-term wealth creation by investing in high-quality, stable companies.",
            "Sentiment": "positive",
            "PublishDate": 1738137058000,
            "Source": "corporate_action"
        },
        {
            "Title": "HDFC Asset Management Company: Stock Fluctuates Amid Mixed Market Signals",
            "Summary": "HDFC AMC shares traded at Rs 4049.35, showing a 0.16% increase. The stock hit a high of Rs 4087.85 and a low of Rs 4012.70. Q3 FY2024 results show consolidated sales of Rs 1027.72 crore, down 2.88% QoQ but up 26.23% YoY. Net profit stood at Rs 641.36 crore, up 31.45% YoY. MACD signals a bullish trend.",
            "Sentiment": "neutral",
            "PublishDate": 1737439773000,
            "Source": "normal_news"
        },
        {
            "Title": "HDFC Asset Management Company: Stock Trades at Rs 4050.65, Up 0.56%",
            "Summary": "HDFC Asset Management Company's stock traded at Rs 4050.65 on BSE, up 0.56% from the previous close. The company's market value stood at Rs 86525.52 crore. Foreign portfolio investors held 21.32% stake, while domestic institutional investors owned 10.43%.",
            "Sentiment": "neutral",
            "PublishDate": 1737354509000,
            "Source": "normal_news"
        }
    ]
}