{
    "Symbol": "HEADSUP",
    "ISIN": "INE759V01019",
    "News": [
        {
            "Title": "Heads Up Ventures Statutory Auditor Resigns",
            "Summary": "J. Singh & Associates resigned as statutory auditor of Heads Up Ventures Limited effective January 21, 2026, citing partner resignation and staff constraints as key reasons for the decision.",
            "Sentiment": "negative",
            "PublishDate": 1769097029681,
            "Source": "stocks"
        },
        {
            "Title": "Heads Up Ventures Limited Managing Director Passes Away",
            "Summary": "Mr. Hansraj Rathor (DIN: 07567833), Managing Director of Heads Up Ventures Limited, passed away on December 04, 2025. The company has informed stock exchanges BSE and NSE about the unexpected demise, which is described as an irreparable loss to the organization.",
            "Sentiment": "negative",
            "PublishDate": 1764857005815,
            "Source": "corporate_governance"
        },
        {
            "Title": "Heads Up Ventures Limited Independent Director Resigns Due to Professional Commitments",
            "Summary": "Mr. Akash Jitendrakumar Patel resigned from his position as Non-Executive and Independent Director of Heads Up Ventures Limited effective November 14, 2025, citing pre-occupation with other professional assignments. The resignation affects the company's board composition and governance structure, with Patel also serving as Chairman of the Audit Committee at Tirupati Innovar Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1763111043386,
            "Source": "corporate_governance"
        },
        {
            "Title": "HeadsUp Ventures India Reports Quarterly Results and Appoints New Director",
            "Summary": "HeadsUp Ventures India Limited approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025, during a board meeting held on November 13, 2025. The board also appointed Asmitaben Ravikumar Patel as Additional Non Executive Non Independent Director effective November 14, 2025, following recommendation from the Nomination and Remuneration Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1763050648767,
            "Source": "earnings"
        },
        {
            "Title": "Heads Up Ventures Limited Approves Quarterly Financial Results and Registered Office Relocation",
            "Summary": "Heads Up Ventures Limited's Board of Directors approved the Standalone and Consolidated Unaudited Financial Results for the quarter ended June 30, 2025, along with a Limited Review Report. The board also approved shifting the company's registered office within the same city from Plot No. E-132, MIDC, Tarapur Industrial Area, Boisar, Palghar to Office No. 12, K 3/5, Ostwal Empire, Navapur, Boisar, Palghar, Maharashtra. The board meeting was held on August 1, 2025, commencing at 02:30 P.M. and concluding at 03:00 P.M. The company was formerly known as The Mandhana Retail Ventures Limited and trades on BSE with scrip code 540210 and on NSE under the symbol HEADSUP.",
            "Sentiment": "neutral",
            "PublishDate": 1754041956675,
            "Source": "earnings"
        }
    ]
}