{
    "Symbol": "HECPROJECT",
    "ISIN": "INE558R01013",
    "News": [
        {
            "Title": "HEC Infra Projects Secures ₹163.5 Crore Work Order",
            "Summary": "HEC Infra Projects has received a significant work order valued at ₹163.50 crores, marking a notable business development for the infrastructure company in its project portfolio expansion.",
            "Sentiment": "positive",
            "PublishDate": 1768394646853,
            "Source": "co_actions_results"
        },
        {
            "Title": "HEC Infra Projects Secures Orders Worth ₹48 Crore for Power and Water Infrastructure",
            "Summary": "HEC Infra Projects secured two new orders totaling ₹48 crore. The company won a ₹28.75 crore contract from BGP Infra for establishing a 66 kV substation at Borosil with underground cable work, scheduled for completion within one year. Additionally, HEC Infra received a ₹19 crore order from JP Construction Company for a water supply scheme under Jal Jeevan Mission at Village Varli, Pindwara, Rajasthan, involving household tap connections to be completed in 12 months. Managing Director Gaurang Shah stated these orders reinforce confidence in the company's technical expertise and strengthen its presence in both power and water infrastructure segments. HEC Infra Projects has executed over 300 projects across various states. The company's shares traded down 1% at ₹149.",
            "Sentiment": "positive",
            "PublishDate": 1759736189374,
            "Source": "stock"
        },
        {
            "Title": "HEC Infra Projects Secures ₹19.23 Crore Order",
            "Summary": "HEC Infra Projects has secured a new order worth ₹19.23 crores. The company has a market capitalization of ₹163 crores.",
            "Sentiment": "positive",
            "PublishDate": 1759306547244,
            "Source": "order&deals"
        },
        {
            "Title": "HEC Infra Projects Secures ₹21.70 Crore Water Infrastructure Contract from Ahmedabad Municipal Corporation",
            "Summary": "HEC Infra Projects has received a work order worth ₹21.70 crores from Ahmedabad Municipal Corporation. The project involves upgrading a water distribution station and constructing a 5 LL capacity ESR (Elevated Storage Reservoir). The company has 36 months to complete the project.",
            "Sentiment": "positive",
            "PublishDate": 1756797024277,
            "Source": "order&deals"
        },
        {
            "Title": "HEC Infra Projects Secures Rs. 3.08 Crore Order from Ahmedabad Municipal Corporation",
            "Summary": "HEC Infra Projects has received an order worth Rs. 3.08 crores from the Ahmedabad Municipal Corporation. The project is to be completed within 8 months. The company's current market capitalization is reported to be Rs. 186 crores.",
            "Sentiment": "positive",
            "PublishDate": 1751270366000,
            "Source": "default"
        }
    ]
}