{
    "Symbol": "HEG",
    "ISIN": "INE545A01024",
    "News": [
        {
            "Title": "HEG Limited Q3FY26 Results Show Strong Growth",
            "Summary": "HEG Limited reported robust Q3FY26 performance with net profit rising 43.65% YoY to ₹141.25 crores. Revenue increased 37.45% to ₹655.66 crores driven by strong graphite segment performance.",
            "Sentiment": "positive",
            "PublishDate": 1770733593799,
            "Source": "co_actions_results"
        },
        {
            "Title": "HEG Limited Q3FY26 Earnings Call on Feb 11, 2026",
            "Summary": "HEG Limited announces earnings conference call scheduled for February 11, 2026 at 17:00 hrs IST to discuss Q3FY26 financial results through SKP Securities Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1770128362893,
            "Source": "co_actions_results"
        },
        {
            "Title": "HEG Limited Shares Webinar Transcript on Scheme",
            "Summary": "HEG Limited releases transcript of webinar held on January 19, 2026, providing updates on Composite Scheme of Arrangement. Document available on company website for investor reference.",
            "Sentiment": "neutral",
            "PublishDate": 1769176591933,
            "Source": "stocks"
        },
        {
            "Title": "HEG Limited Schedules Demerger Update Webinar",
            "Summary": "HEG Limited announces investor presentation on January 19, 2026, covering composite scheme of arrangement and Greentech business overview including battery materials and renewable energy ventures.",
            "Sentiment": "neutral",
            "PublishDate": 1768558708655,
            "Source": "stocks"
        },
        {
            "Title": "HEG Limited Schedules Demerger Update Webinar",
            "Summary": "HEG Limited announces demerger update webinar scheduled for January 19, 2026 at 16:00 hrs IST through SKP Securities, featuring senior management including Vice Chairman and key executives.",
            "Sentiment": "neutral",
            "PublishDate": 1768311894386,
            "Source": "stocks"
        },
        {
            "Title": "HEG Limited Schedules Demerger Update Webinar",
            "Summary": "HEG Limited announces demerger update webinar scheduled for January 19, 2026 at 16:00 hrs IST, organized through SKP Securities with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1768311666437,
            "Source": "stocks"
        },
        {
            "Title": "HEG Board Meeting Set for Feb 10 to Review Q3 Results",
            "Summary": "HEG Limited has scheduled a board meeting on February 10, 2026, to consider Q3FY26 unaudited financial results. Trading window remains closed until February 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768306332802,
            "Source": "co_actions_results"
        },
        {
            "Title": "HEG Gets Exchange Nod for Arrangement Plan",
            "Summary": "BSE and NSE have issued observation letters to HEG regarding its corporate arrangement plan involving HEG Graphite and Bhilwara Energy, marking a key regulatory milestone.",
            "Sentiment": "neutral",
            "PublishDate": 1767963671410,
            "Source": "stocks"
        },
        {
            "Title": "SBI Mutual Fund cuts HEG stake to 5.71%",
            "Summary": "SBI Mutual Fund reduces shareholding in HEG Limited by 0.38% through market sales, bringing total holding down to 5.71% from previous 6.09% as of January 06, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767937144407,
            "Source": "co_actions_results"
        },
        {
            "Title": "HEG and Graphite India surge on EU carbon rules",
            "Summary": "Shares of HEG Ltd and Graphite India surged up to 10% as investors anticipate benefits from EU's Carbon Border Adjustment Mechanism starting 2026, boosting demand for cleaner steel production.",
            "Sentiment": "positive",
            "PublishDate": 1767176569586,
            "Source": "stocks"
        },
        {
            "Title": "HEG's Associate Bhilwara Energy Acquires 76MW Hydro Project",
            "Summary": "Bhilwara Energy Limited, associate company of HEG Limited, announced acquisition of 100% stake in 76MW Phata Byung Hydroelectric Project in Uttarakhand from Statkraft IH Holding AS.",
            "Sentiment": "positive",
            "PublishDate": 1766580362474,
            "Source": "co_actions_results"
        },
        {
            "Title": "HEG Subsidiary Faces ₹43,550 RBI Compounding Fee",
            "Summary": "HEG Limited's wholly-owned subsidiary Bhilwara Infotechnology Limited receives RBI compounding order for delayed FC-GPR reporting with penalty of ₹43,550.00 for FEMA compliance violation.",
            "Sentiment": "negative",
            "PublishDate": 1765460493469,
            "Source": "stocks"
        },
        {
            "Title": "HEG Maintains EBITDA Guidance of Rs 450-500 Crores, Reports Market Share Growth",
            "Summary": "HEG reported operating EBITDA between Rs 450-500 crores and plans to maintain the same range for next year, while also announcing increased market stake with both short and long-term value. The company expects to see benefits from its demerger process, indicating strategic restructuring efforts are progressing.",
            "Sentiment": "positive",
            "PublishDate": 1764134624651,
            "Source": "stock"
        },
        {
            "Title": "HEG Limited Executive Director Manish Gulati Purchases 4,000 Equity Shares",
            "Summary": "Manish Gulati, Executive Director of HEG Limited, acquired 4,000 equity shares at Rs 497.09 per share through market purchase on NSE, increasing his shareholding to 0.002%. The transaction was disclosed under SEBI insider trading regulations as part of mandatory continual disclosure requirements for designated persons.",
            "Sentiment": "neutral",
            "PublishDate": 1764068760692,
            "Source": "corporate_action"
        },
        {
            "Title": "Redrose Vanijya LLP Increases Stake in HEG Limited Through Open Market Purchase",
            "Summary": "Redrose Vanijya LLP, a promoter group entity, acquired 6,74,000 equity shares of HEG Limited from the open market on November 25, 2025. The acquisition increased their shareholding from 28.95% to 29.30% of the total voting capital, strengthening the promoter group's control in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1764061056012,
            "Source": "corporate_action"
        },
        {
            "Title": "HEG Limited Receives ESG Score of 66.2 from SESES ESG Research",
            "Summary": "HEG Limited has been assigned an Environmental, Social and Governance (ESG) score of 66.2 by SESES ESG Research Pvt Ltd based on publicly available data. The company clarified that it did not engage SESES ESG Research for this rating, and the report was prepared independently using information available in the public domain.",
            "Sentiment": "neutral",
            "PublishDate": 1763626819967,
            "Source": "stock"
        },
        {
            "Title": "HEG Limited Reports Strong Q2 Performance with 90% Capacity Utilization Despite Industry Challenges",
            "Summary": "HEG Limited recorded revenue of INR 697 crores and EBITDA of INR 226 crores in Q2FY26, driven entirely by higher sales volumes while maintaining 90% capacity utilization amid challenging graphite electrode market conditions. The company remains debt-free with treasury of INR 1,167 crores and announced a 15,000-ton capacity expansion worth INR 650 crores to be completed by 2027, while progressing with its demerger process expected to receive NCLT approval by April 2026.",
            "Sentiment": "positive",
            "PublishDate": 1763395254998,
            "Source": "earnings"
        },
        {
            "Title": "HEG Management Expects NCLT Approval for Demerger by April 2026",
            "Summary": "HEG management expressed confidence about receiving exchange approval for their demerger proposal, which will then be submitted to the National Company Law Tribunal (NCLT). The company anticipates receiving NCLT approval by April 2026.",
            "Sentiment": "positive",
            "PublishDate": 1762936965468,
            "Source": "corporate_action"
        },
        {
            "Title": "HEG Limited Reports Financial Results for Quarter Ended September 30, 2025",
            "Summary": "HEG Limited, the world's largest single-site graphite electrode plant, shared its financial results for the quarter ended September 30, 2025. The company operates with a capacity of 100,000 tons since November 2023 and exports approximately 65-70% of its production to about 35 countries. HEG announced plans to expand capacity by another 15,000 tons to reach 115,000 tons by end of 2027. The company highlighted challenging market conditions, with global crude steel production falling 1.5% year-over-year in the first nine months of 2025. China's weak domestic demand led to increased steel exports, putting downward pressure on steel and electrode prices. India remained a bright spot with 10.5% growth in crude steel production. The company noted that graphite electrode demand remains soft due to overall global production weakness, with spot market prices under sustained pressure.",
            "Sentiment": "negative",
            "PublishDate": 1762878136902,
            "Source": "earnings"
        },
        {
            "Title": "HEG Reports 73% Jump in Net Profit to ₹143 Crore on Strong Revenue Growth",
            "Summary": "Hindustan Electro Graphites (HEG) Ltd reported a 72.7% increase in net profit to ₹143 crore for the quarter ended September 2025, compared to ₹82.8 crore in the same period last year. Revenue grew 23.2% to ₹699.2 crore from ₹567.6 crore, while EBITDA rose 23% to ₹118.4 crore. Operating margin remained flat at 17%. The board approved subscription to optionally convertible debentures of subsidiary TACC Limited for up to ₹633 crore and noted the proposed sale of a 26% stake in Texnere India Private Limited. Puneet Anand was appointed as President and Group Chief Strategy Officer effective December 1, 2025. The company received show-cause notices from GST authorities regarding IGST refunds for FY 2019-20 and FY 2020-21, with proposed penalties of ₹282.34 crore for each period. HEG expressed confidence that the refunds are in order and expects the notices to be dropped. Shares closed at ₹519.65, down 5.39%.",
            "Sentiment": "positive",
            "PublishDate": 1762779473862,
            "Source": "earnings"
        },
        {
            "Title": "HEG Board Approves 6.33 Billion Rupee Investment in TACC Debentures and Texnere India Stake Sale",
            "Summary": "HEG's board has approved an investment of 6.33 billion rupees in TACC debentures. Additionally, the company plans to sell its stake in Texnere India.",
            "Sentiment": "neutral",
            "PublishDate": 1762777586529,
            "Source": "corporate_action"
        },
        {
            "Title": "HEG Reports 111% Jump in Quarterly Net Profit to 1.31 Billion Rupees",
            "Summary": "HEG reported quarterly net profit of 1.31 billion rupees compared to 621 million rupees in the same period last year, marking a 111% increase. Revenue grew to 6.97 billion rupees from 5.7 billion rupees year-over-year. EBITDA rose to 1.19 billion rupees from 968 million rupees, while EBITDA margin remained stable at 17.01% versus 17.06% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762777122660,
            "Source": "earnings"
        },
        {
            "Title": "HEG Limited Schedules Board Meeting for November 10 to Approve Quarterly Financial Results",
            "Summary": "HEG Limited has scheduled a Board of Directors meeting for November 10, 2025, to consider and approve unaudited financial results for the quarter and half year ended September 30, 2025. The company's trading window has been closed since October 1, 2025, and will remain closed until November 12, 2025, before reopening on November 13, 2025. The meeting will address both standalone and consolidated financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1760704176168,
            "Source": "corporate_action"
        },
        {
            "Title": "HEG's Subsidiary TACC Secures Rs. 1,230 Crore Credit Facility from SBI for Lithium-ion Battery Grade Graphite Plant",
            "Summary": "HEG Limited announced that State Bank of India has sanctioned a credit facility of Rs. 1,230 crores to TACC Limited, HEG's wholly owned subsidiary. The funding will provide partial financing for developing a greenfield manufacturing plant in Dewas, Madhya Pradesh, designed to produce 20,000 MTPA of lithium-ion battery grade graphite anode. The credit facility represents financial assistance for part of the overall project funding requirements.",
            "Sentiment": "positive",
            "PublishDate": 1760513742568,
            "Source": "stock"
        },
        {
            "Title": "HEG Board Approves ₹210 Crore Unsecured Loan to Bhilwara Energy Limited",
            "Summary": "HEG's board has approved an unsecured loan of ₹210 crore to Bhilwara Energy Limited for growth purposes. The loan carries a 9% interest rate and has a tenure of one year.",
            "Sentiment": "positive",
            "PublishDate": 1758617908824,
            "Source": "stock"
        },
        {
            "Title": "LNJ Bhilwara Group Acquires Statkraft's 49% Stake in Malana Power Company",
            "Summary": "Bhilwara Energy Limited, an associate company of HEG Limited, has acquired Statkraft's 49% minority stake in Malana Power Company Limited, making LNJ Bhilwara Group the sole owner. The transaction includes stakes in the Malana Hydropower Plant (86 MW) and Allain Duhangan Hydropower Plant (192 MW) in Himachal Pradesh. These plants have operated as a 51:49 joint venture since 2004. The acquisition aligns with Statkraft's strategy to divest its India platform and focus on core markets in Europe and South America. LNJ Bhilwara Group aims to scale its presence in the power sale business and explore new renewable energy opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1757416241607,
            "Source": "order&deals"
        },
        {
            "Title": "HEG's Subsidiary TACC Partners with Ceylon Graphene Technologies for Graphene Commercialization",
            "Summary": "TACC Ltd., a wholly owned subsidiary of HEG, has entered into a technical collaboration agreement with Ceylon Graphene Technologies. The partnership aims to accelerate the commercialization and large-scale adoption of graphene and its derivatives.",
            "Sentiment": "positive",
            "PublishDate": 1756686137471,
            "Source": "order&deals"
        },
        {
            "Title": "TACC Ltd. Forms Partnership With Ceylon Graphene Technologies for Graphene Commercialization",
            "Summary": "TACC Ltd. has entered into a partnership with Ceylon Graphene Technologies aimed at enhancing the commercial use of graphene and its products. The collaboration focuses on expanding the commercial applications of graphene technology.",
            "Sentiment": "positive",
            "PublishDate": 1756545482669,
            "Source": "stock"
        },
        {
            "Title": "HEG's Subsidiary TACC Partners with CRRI to Develop Graphene-Enhanced Road Pavements in India",
            "Summary": "TACC Limited, a wholly owned subsidiary of HEG Limited, signed a Memorandum of Agreement with the Central Road Research Institute (CRRI) to develop graphene-enhanced pavements using TACC's graphene-based additives. The collaboration aims to create stronger and more durable roads by infusing graphene's properties into Indian pavements, while minimizing binder usage to reduce carbon emissions and support India's Net Zero vision. The agreement was signed in the presence of Professor Manoranjan Parida (Director CRRI), Dr. Ambika Behl (Project Lead CRRI), Mr. Riju Jhunjhunwala (Director TACC), and Mr. Ankur Khaitan (MD & CEO TACC). TACC Limited is described as an innovation-driven venture of the LNJ Bhilwara Group specializing in synthetic graphite and graphene derivatives, while CRRI is a national research laboratory established in 1952 under CSIR that focuses on roadway design and pavement evaluation.",
            "Sentiment": "positive",
            "PublishDate": 1755082523992,
            "Source": "stock"
        },
        {
            "Title": "HEG Limited Reports Strong Q1 FY26 Results, Announces 15,000-Ton Capacity Expansion",
            "Summary": "HEG Limited reported revenue of INR 613 crores for Q1 FY26, up from INR 571 crores in the corresponding quarter of the previous year. EBITDA increased significantly to INR 154 crores from INR 59 crores year-on-year. Net profit after tax rose to INR 72 crores on standalone basis and INR 105 crores on consolidated basis, compared to INR 3 crores and INR 23 crores respectively in the previous year. The company operated at over 90% capacity utilization on its expanded 100,000-ton capacity. HEG announced a new expansion plan to increase capacity from 100,000 tons to 115,000 tons with a capex of INR 650 crores, expected to be completed by January-March 2028. The company remains debt-free with treasury of INR 977 crores. Management highlighted challenging market conditions due to global steel production decline of 1.9% in the first six months of 2025, though noted the long-term growth potential from the transition to electric arc furnace steelmaking. The demerger scheme has been filed with stock exchanges and NCLT approval is expected by end of calendar year 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754660511680,
            "Source": "earnings"
        },
        {
            "Title": "HEG Limited Reports Q1 FY26 Results with 11% Profit Margin Despite Weak Global Demand",
            "Summary": "HEG Limited released its quarterly results for the quarter ended June 30, 2025, showing revenue from operations of Rs 613 crores and profit after tax of Rs 72 crores, representing an 11% profit margin. The company's EBITDA stood at Rs 154 crores with a 23% margin. Global crude steel production declined 1.9% year-on-year in H1 2025 to 934.3 million tonnes, with graphite electrode demand remaining weak due to sustained pressure on spot market prices. HEG announced an expansion plan to increase capacity from 100,000 tons to 115,000 tons, requiring a total capex of Rs 650 crores, with commissioning expected by end of January 2028. The company maintains its position as the third largest graphite electrode producer in the western world following capacity expansion to 100,000 tons since November 2023. The expansion is driven by anticipated demand from new electric arc furnaces globally due to decarbonization initiatives, which could contribute approximately 200,000 tonnes of additional graphite electrode demand by 2030.",
            "Sentiment": "neutral",
            "PublishDate": 1754148088509,
            "Source": "earnings"
        },
        {
            "Title": "HEG Shares Jump 12% Following Strong Quarterly Earnings Performance",
            "Summary": "HEG Ltd. shares surged 12% after reporting quarterly results showing significant improvement across key metrics. Revenue from operations grew 8% to ₹616.93 crore from ₹571.5 crore in the same period last year. EBITDA increased dramatically by 172% to ₹105 crore from ₹39 crore, while margins expanded to 17.1% from 6.8% in the year-ago period. Net profit jumped 355% to ₹104.8 crore compared to ₹23.04 crore previously. Other expenses declined 14% to ₹128.4 crore, with the company benefiting from mark-to-market gains on its Graftech International holdings after experiencing losses in the prior year. The company announced a 15,000 ton capacity expansion requiring ₹650 crore capital expenditure, to be funded through internal accruals and debt if needed. Current capacity utilization stands at 85-90% of the existing 100,000 ton base. The stock was trading 11.91% higher at ₹597.9 and has gained 17.11% over the past month.",
            "Sentiment": "positive",
            "PublishDate": 1753947724932,
            "Source": "earnings"
        },
        {
            "Title": "HEG: Tax Authority Ends Efforts to Recover ₹2.82 Billion from Company",
            "Summary": "The tax authority has concluded its efforts to recover ₹2.82 billion from HEG. The company is no longer subject to this tax recovery action.",
            "Sentiment": "positive",
            "PublishDate": 1753879208181,
            "Source": "stock"
        },
        {
            "Title": "HEG Limited Reports Q1 FY26 Results and Approves Rs. 650 Crore Capacity Expansion",
            "Summary": "HEG Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue of Rs. 612.78 crores and net profit of Rs. 71.80 crores for the quarter. On a consolidated basis, revenue stood at Rs. 616.93 crores with net profit of Rs. 104.77 crores. The Board approved a capacity expansion plan for graphite electrodes and related products, adding 15,000 TPA to the existing 100,000 TPA capacity. The expansion requires an investment of approximately Rs. 650 crores and is expected to be completed within 30 months. The company plans to finance the expansion through internal accruals and debt if required. Current capacity utilization stands at 85% to 90%. The expansion is driven by structural changes in the industry boosting demand for electrodes and healthy payback expectations.",
            "Sentiment": "positive",
            "PublishDate": 1753876486736,
            "Source": "earnings"
        },
        {
            "Title": "HEG Reports Strong Q1 Performance with EBITDA Rising to 1.06B Rupees",
            "Summary": "HEG reported Q1 EBITDA of 1.06 billion rupees compared to 388 million rupees in the same period last year. The company's EBITDA margin improved to 17.29% versus 6.79% year-over-year, indicating enhanced profitability and operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1753876001087,
            "Source": "earnings"
        },
        {
            "Title": "HEG Reports Strong Q1 Performance with Net Profit Surge to 718M Rupees",
            "Summary": "HEG reported net profit of 718 million rupees for Q1, significantly higher than 26 million rupees in the same period last year. The company's revenue increased to 6.13 billion rupees compared to 5.7 billion rupees year-over-year, representing growth in both profitability and top-line performance.",
            "Sentiment": "positive",
            "PublishDate": 1753875625089,
            "Source": "earnings"
        },
        {
            "Title": "HEG Limited Opens Special Window for Physical Share Transfer Re-lodgement Until January 2026",
            "Summary": "HEG Limited has announced a special six-month window from July 7, 2025 to January 6, 2026 for shareholders to re-lodge transfer requests for physical shares that were previously rejected or returned due to deficiencies. This facility is available only for transfer deeds lodged prior to April 1, 2019 and targets shareholders who missed the March 31, 2021 deadline. Re-lodged shares will be transferred only in demat mode upon submission of complete documents to the company's registrar MCS Share Transfer Agent Limited. The company also reminded shareholders holding physical shares to update their KYC details, convert to dematerialized form, and claim unclaimed dividends before they are transferred to IEPFA after seven years. Additionally, dividend payments for physical shareholders will only be made electronically after they provide PAN, contact details, bank account information and specimen signatures.",
            "Sentiment": "neutral",
            "PublishDate": 1753510763221,
            "Source": "corporate_action"
        },
        {
            "Title": "TACC Limited Partners with National Council for Cement and Building Materials to Develop Graphene-Enhanced Concrete",
            "Summary": "TACC Limited, a wholly owned subsidiary of HEG Limited, has signed a Memorandum of Understanding with the National Council for Cement and Building Materials (NCB) to develop sustainable, durable, and high-performance concrete using graphene-based additives. The collaboration aims to integrate graphene's exceptional properties into concrete to enhance strength, durability, and overall performance while contributing to lowering carbon emissions in alignment with India's net-zero emissions vision. TACC Limited is an innovation-driven venture of the LNJ Bhilwara Group specializing in synthetic graphite and graphene derivatives, while NCB is a premier research body under the Department for Promotion of Industry and Internal Trade, Ministry of Commerce and Industry, focused on technology development for cement and construction industries.",
            "Sentiment": "positive",
            "PublishDate": 1753169201446,
            "Source": "order&deals"
        },
        {
            "Title": "TACC And NCB Partner On Graphene-Enhanced Sustainable Concrete Solutions",
            "Summary": "TACC and NCB have entered into a collaboration focused on promoting sustainable high-performance concrete innovations through the use of graphene additives. The partnership aims to advance concrete technology by incorporating graphene materials to enhance performance while maintaining sustainability objectives.",
            "Sentiment": "positive",
            "PublishDate": 1753168815461,
            "Source": "stock"
        },
        {
            "Title": "HEG Receives Tax Recovery Notice for 2.82 Billion Rupees",
            "Summary": "HEG has received a notice for the recovery of tax refunds and penalties amounting to 2.82 billion rupees. The notice appears to be related to tax matters, but no further details about the nature of the refunds or penalties are provided in the given information.",
            "Sentiment": "negative",
            "PublishDate": 1751372918000,
            "Source": "default"
        },
        {
            "Title": "Japan to Impose Anti-Dumping Duty on Chinese Graphite Imports",
            "Summary": "Japan will implement a five-year anti-dumping duty on graphite imports from China. This measure aims to protect domestic industries from unfair competition by imposing additional tariffs on Chinese graphite products.",
            "Sentiment": "neutral",
            "PublishDate": 1751004605000,
            "Source": "default"
        },
        {
            "Title": "HEG Ltd: Q4 Results Show Improvement Despite Higher Expenses",
            "Summary": "HEG Ltd reported Q4 revenue of ₹542 crore, down 1% YoY. The company posted an EBITDA loss of ₹56 crore due to a 147% surge in other expenses, mainly from mark-to-market losses on investments. Adjusted EBITDA margin improved to 18.7% from 9.2% YoY. Net loss stood at ₹73.7 crore. The stock rallied on news of a competitor halting production in China and Malaysia, potentially impacting graphite electrode supply and pricing.",
            "Sentiment": "neutral",
            "PublishDate": 1747706092000,
            "Source": "earnings"
        },
        {
            "Title": "HEG Reports Q4 Net Loss and Dividend Announcement",
            "Summary": "HEG reported a net loss of 617 million rupees in Q4, compared to a loss of 352 million rupees in the same quarter last year and 983 million rupees in the previous quarter. The company's revenue for Q4 was 5.4 billion rupees, down from 5.5 billion rupees year-over-year. HEG has recommended a dividend of 1.80 rupees per equity share.",
            "Sentiment": "negative",
            "PublishDate": 1747700316000,
            "Source": "default"
        },
        {
            "Title": "HEG Reports Q4 Loss and Announces Dividend",
            "Summary": "HEG has reported its latest quarterly results. The company experienced a Q4 EBITDA loss of 490 million rupees, compared to a gain of 450 million rupees in the same quarter last year. The standalone net loss for Q4 widened to 617 million rupees, up from 352 million rupees year-over-year and 983 million rupees quarter-over-quarter. Q4 revenue stood at 5.4 billion rupees, slightly down from 5.5 billion rupees in the previous year. Despite the losses, HEG has recommended a dividend of 1.80 rupees per equity share.",
            "Sentiment": "negative",
            "PublishDate": 1747662531000,
            "Source": "result"
        },
        {
            "Title": "HEG Limited Increases Stake in GrafTech International",
            "Summary": "HEG Limited has increased its stake in GrafTech International to 9.98% through a secondary market investment worth Rs. 34.59 crore.",
            "Sentiment": "positive",
            "PublishDate": 1746586787000,
            "Source": "default"
        },
        {
            "Title": "HEG to Consider Q4 Results on May 19",
            "Summary": "HEG Limited has announced that it will consider its fourth quarter financial results on May 19. This indicates the company is preparing to release its earnings report for the final quarter of its fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1745501999000,
            "Source": "default"
        },
        {
            "Title": "HEG Ltd: Rs 3,500 Crore Project Implementation Post Graphite Business Demerger",
            "Summary": "HEG Ltd plans to implement projects worth Rs 3,000-3,500 crore following the demerger of its graphite business. The company will raise Rs 500 crore in two tranches, with Rs 250 crore already invested by Singularity AMC. The demerger will create HEG Ltd for graphite electrodes and HEG Greentech Ltd for green energy initiatives. The new entity is expected to be formed by December, with listing by January 2026.",
            "Sentiment": "positive",
            "PublishDate": 1741917765000,
            "Source": "corporate_action"
        },
        {
            "Title": "HEG and Bhilwara Energy Report Significant Cash Reserves",
            "Summary": "HEG Limited has reported cash reserves of Rs 750 crore, while its subsidiary Bhilwara Energy has Rs 300 crore in cash, according to NDTV Profit.",
            "Sentiment": "positive",
            "PublishDate": 1741840555000,
            "Source": "corporate_governance"
        },
        {
            "Title": "HEG Plans to List New Companies by January 26",
            "Summary": "HEG, a company, has announced plans to list new companies on the stock exchange by January 26. This information was reported by NDTV Profit. No further details about the number or nature of these new companies were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1741840491000,
            "Source": "corporate_action"
        },
        {
            "Title": "HEG's ₹500 Crore Fund Raise to Support ₹3000 Crore Capex Plan",
            "Summary": "HEG Limited has recently raised ₹500 crore in funds. This, combined with existing cash reserves in HEG and Bhilwara, will support the company's ₹3000 crore capital expenditure plan. The news indicates a significant investment strategy by the company to potentially expand or upgrade its operations.",
            "Sentiment": "positive",
            "PublishDate": 1741840362000,
            "Source": "corporate_action"
        }
    ]
}