{
    "Symbol": "HEIDELBERG",
    "ISIN": "INE578A01017",
    "News": [
        {
            "Title": "HeidelbergCement Wins Two Limestone Mining Leases",
            "Summary": "HeidelbergCement India declared preferred bidder for two limestone blocks in Madhya Pradesh with combined reserves of 167.12 million tonnes across 700 hectares.",
            "Sentiment": "positive",
            "PublishDate": 1769164457049,
            "Source": "stocks"
        },
        {
            "Title": "HeidelbergCement India ESG Rating Improves to 68",
            "Summary": "HeidelbergCement India's ESG rating has been revised upward from 67.1 for FY 2023-24 to 68 for FY 2024-25 by SES ESG Research Private Limited, reflecting improved sustainability performance.",
            "Sentiment": "positive",
            "PublishDate": 1767599003858,
            "Source": "stocks"
        },
        {
            "Title": "HeidelbergCement India faces ₹32.77 cr GST demands",
            "Summary": "HeidelbergCement India receives two GST authority orders demanding recovery of ₹32.77 crores for alleged excess ITC claims and non-payment issues from FY 2018-19 and FY 2021-22.",
            "Sentiment": "negative",
            "PublishDate": 1767012075256,
            "Source": "stocks"
        },
        {
            "Title": "HeidelbergCement India Reports 10.9% Revenue Growth in Q2",
            "Summary": "HeidelbergCement India reported quarterly revenue of 5.1 billion rupees compared to 4.6 billion rupees in the same period last year, representing year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1761729178872,
            "Source": "earnings"
        },
        {
            "Title": "HeidelbergCement India Reports Strong Q2 Performance with EBITDA Rising to 575M Rupees",
            "Summary": "HeidelbergCement India reported Q2 EBITDA of 575 million rupees compared to 373 million rupees in the same period last year. The company's EBITDA margin improved to 11.2% from 8.08% year-over-year. Net profit for the quarter reached 249 million rupees, up from 112 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761728745321,
            "Source": "earnings"
        },
        {
            "Title": "HeidelbergCement India Reports 12.3% Revenue Growth in Q1, Reappoints Managing Director",
            "Summary": "HeidelbergCement India Limited announced its quarterly results with revenue rising 12.3% to ₹5,975.4 million driven by 10.9% higher sales volumes and 1% price improvement. Net profit increased 20.9% to ₹482.3 million while EBITDA grew 13.4% to ₹885 million with margins at 14.8%. The company increased non-grid power share to over 50% of consumption through wind-solar hybrid power agreements and raised alternate fuel usage to 13%. The Board reappointed Joydeep Mukherjee as Managing Director for three years from April 2026, subject to shareholder approval. The company also appointed DMK Associates as Secretarial Auditors for five years from FY 2025-26 to FY 2029-30. Cash and bank balance stood at ₹5,704 million against interest-free borrowings of ₹687 million.",
            "Sentiment": "positive",
            "PublishDate": 1753792484039,
            "Source": "corporate_action"
        },
        {
            "Title": "HeidelbergCement India Reports Strong Q1 Performance with 11% Sales Volume Growth",
            "Summary": "HeidelbergCement India delivered robust quarterly results with sales volume growing 11% year-over-year. Revenue increased to 5.97 billion rupees from 5.3 billion rupees in the previous year. EBITDA rose to 885 million rupees compared to 780 million rupees, while EBITDA margin improved slightly to 14.8% from 14.7%. Net profit grew to 482 million rupees from 400 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1753782765535,
            "Source": "stock"
        },
        {
            "Title": "HeidelbergCement Outlines Growth and Investment Plans",
            "Summary": "HeidelbergCement shared updates during a conference call. The company expects significant capital expenditure over the next 3-4 years. They anticipate a 2-3% increase in green power by financial year 2026, following a recent 5.5 megawatt agreement. The company's growth guidance is set between 6-7%, aligning with cement and GDP growth projections for India.",
            "Sentiment": "positive",
            "PublishDate": 1748575094000,
            "Source": "default"
        },
        {
            "Title": "HeidelbergCement India: Q4 Profit Rises 4.7%, Sales Up 2.6%",
            "Summary": "HeidelbergCement India reported a 4.75% increase in Q4 FY25 net profit to Rs 50.45 crore. Revenue from operations grew 2.66% to Rs 612.46 crore, driven by a 2% increase in sales volume and 1% increase in prices. However, full-year FY25 net profit declined 36.4% to Rs 106.75 crore, with consolidated income down 9.33% to Rs 2,194.35 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1748537451000,
            "Source": "earnings"
        },
        {
            "Title": "HeidelbergCement India: Q4 Profit Dips, Revenue Up, Declares ₹7 Dividend",
            "Summary": "HeidelbergCement India reported a 3% YoY decrease in Q4FY25 net profit to ₹50 crore, while revenue increased 2.7% to ₹612.4 crore. EBITDA rose 2% to ₹90.6 crore. The company expanded non-grid power usage to 46%. For FY25, pricing pressure led to a 20% drop in EBITDA per tonne. The board recommended a dividend of ₹7 per share for FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1748434364000,
            "Source": "earnings"
        },
        {
            "Title": "HeidelbergCement India Reports Q4 Results and Recommends Dividend",
            "Summary": "HeidelbergCement India has announced its quarterly results and dividend recommendation. The company's Q4 revenue increased to 6.12 billion rupees from 5.97 billion rupees year-over-year. EBITDA rose to 906.4 million rupees from 888.9 million rupees, with a slight decrease in EBITDA margin to 14.8% from 14.9%. Net profit for Q4 improved to 504.5 million rupees, up from 482 million rupees in the previous year and 51.9 million rupees in the previous quarter. The company has recommended a dividend of 7 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748433633000,
            "Source": "result"
        },
        {
            "Title": "HeidelbergCement India to Consider Q4 Results on May 28",
            "Summary": "HeidelbergCement India has announced that it will consider its quarterly results for the fourth quarter on May 28.",
            "Sentiment": "neutral",
            "PublishDate": 1747827525000,
            "Source": "default"
        },
        {
            "Title": "HeidelbergCement India Reports Significant Decline in Q3 Profit and Revenue",
            "Summary": "HeidelbergCement India has reported a substantial decrease in its third-quarter financial results. The company's net profit dropped to 52 million rupees from 315 million rupees in the same quarter last year. Additionally, revenue declined to 5.4 billion rupees from 6.07 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738226171000,
            "Source": "earnings"
        },
        {
            "Title": "HeidelbergCement India Responds to Acquisition Rumors",
            "Summary": "HeidelbergCement India has issued a clarification regarding reports suggesting that UltraTech Cement is in advanced talks to acquire the company. In response to these market rumors, HeidelbergCement India stated that they do not comment on such speculations.",
            "Sentiment": "neutral",
            "PublishDate": 1738023345000,
            "Source": "corporate_governance"
        },
        {
            "Title": "HeidelbergCement India Clarifies on Acquisition Rumors",
            "Summary": "HeidelbergCement India has issued a clarification regarding reports suggesting that UltraTech Cement is in advanced talks to acquire the company. In response to these market rumors, HeidelbergCement India stated that they do not comment on such speculations.",
            "Sentiment": "neutral",
            "PublishDate": 1737980231000,
            "Source": "corporate_governance"
        },
        {
            "Title": "UltraTech Cement in Talks to Acquire HeidelbergCement India",
            "Summary": "UltraTech Cement, a major player in the Indian cement industry, is reportedly in discussions to acquire HeidelbergCement India. This potential acquisition could significantly impact the cement market landscape in India, potentially consolidating UltraTech's position in the industry.",
            "Sentiment": "neutral",
            "PublishDate": 1737957389000,
            "Source": "corporate_action"
        },
        {
            "Title": "HeidelbergCement India Signs Share Purchase Agreement with Continuum MP Windfarm Development",
            "Summary": "HeidelbergCement India has entered into a share purchase agreement with Continuum MP Windfarm Development. This suggests a potential acquisition or investment in the wind energy sector by HeidelbergCement India.",
            "Sentiment": "neutral",
            "PublishDate": 1731071940000,
            "Source": "corporate_action"
        },
        {
            "Title": "HeidelbergCement India Reports Decline in Q2 EBITDA and Margin",
            "Summary": "HeidelbergCement India has reported a significant decrease in its Q2 EBITDA, which fell to 373 million rupees from 695 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 8.08% from 12.27% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730106333000,
            "Source": "result"
        },
        {
            "Title": "HeidelbergCement India Reports Q2 Revenue Decline",
            "Summary": "HeidelbergCement India has reported a revenue of 4.6 billion rupees for the second quarter, which is a decrease from 5.67 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1730106236000,
            "Source": "result"
        },
        {
            "Title": "HeidelbergCement India Reports Q2 Net Profit Decline",
            "Summary": "HeidelbergCement India has reported a net profit of 112 million rupees for the second quarter, down from 358 million rupees in the same period last year. This represents a significant year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1730106226000,
            "Source": "result"
        },
        {
            "Title": "HeidelbergCement India Denies Adani Group Acquisition Rumors",
            "Summary": "<p><span class='neutral'>HeidelbergCement India</span> has issued a <span class='positive'>clarification</span> regarding <span class='neutral'>media reports</span> suggesting that the <span class='neutral'>Adani Group</span> is looking to <span class='neutral'>acquire</span> the company. The company states that it is <b>unaware</b> of any such development, effectively <span class='negative'>denying</span> the <span class='neutral'>rumors</span> of a potential acquisition.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728294672000,
            "Source": "corporate_action"
        }
    ]
}