{
    "Symbol": "HERANBA",
    "ISIN": "INE694N01015",
    "News": [
        {
            "Title": "Heranba Industries to Set Up UAE Subsidiary",
            "Summary": "Heranba Industries announces establishment of fully owned subsidiary in UAE with initial investment of up to ₹2.00 crores, requiring no government approval for the expansion.",
            "Sentiment": "positive",
            "PublishDate": 1768384119169,
            "Source": "stocks"
        },
        {
            "Title": "Heranba Industries Reports Mixed Q2 Results with Revenue Growth but Margin Decline",
            "Summary": "Heranba Industries posted Q2 revenue of 6.06B rupees, up from 4.58B rupees year-over-year, while net profit declined to 320.4M rupees from 339.6M rupees. The company's EBITDA margin compressed to 7.38% from 10.12% year-over-year despite revenue growth, indicating pressure on profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1763127891968,
            "Source": "earnings"
        },
        {
            "Title": "Heranba Industries Internal Auditor Kamal Dharewa Resigns Due to Professional Commitments",
            "Summary": "Heranba Industries announced the resignation of Internal Auditor Mr. Kamal Dharewa, a Chartered Accountant from K D Practice Consulting Pvt Ltd, effective October 15, 2025. The resignation was attributed to preoccupation with other professional commitments. The company confirmed that no concerns were raised by the Internal Auditor regarding management and there were no material reasons for the resignation. The Audit Committee and Board will consider appointing a new Internal Auditor.",
            "Sentiment": "neutral",
            "PublishDate": 1760618571943,
            "Source": "corporate_governance"
        },
        {
            "Title": "Heranba Industries Reports Strong Q1 Performance with 61% Revenue Growth and New CFO Appointment",
            "Summary": "Heranba Industries Limited announced its quarterly results for the period ended June 30, 2025. The company reported standalone revenue from operations of Rs. 489.84 crores compared to Rs. 304.35 crores in the same quarter last year, representing significant growth. Net profit after tax increased to Rs. 22.02 crores from Rs. 34.46 crores in the previous year quarter. On a consolidated basis, revenue from operations reached Rs. 452.43 crores versus Rs. 296.25 crores in the corresponding quarter. The Board approved the appointment of Mr. Pravin Babu Shetty as Chief Financial Officer, effective September 20, 2025. The company scheduled its 33rd Annual General Meeting for September 24, 2025, through video conferencing. The Board fixed September 17, 2025, as the record date for final dividend eligibility. Heranba Industries operates in the manufacture and sale of agro and chemical products, with consolidated revenue split between India (74.66%) and international markets (25.34%) for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755005586662,
            "Source": "earnings"
        },
        {
            "Title": "Heranba Industries Starts Commercial Production at Sarigam Unit",
            "Summary": "Heranba Industries has commenced commercial production at its Sarigam unit. The company expects Phase-I and Phase-II of the Sarigam unit to generate annual revenue of Rs 375 to Rs 475 crores, which is anticipated to add approximately 30% to the company's total revenue.",
            "Sentiment": "positive",
            "PublishDate": 1750928073000,
            "Source": "default"
        },
        {
            "Title": "Heranba Industries Reports Q4 Results and Dividend",
            "Summary": "Heranba Industries reported a net loss of 53 million rupees in Q4, compared to a loss of 131.1 million rupees in the same quarter last year. The company's revenue increased to 3.95 billion rupees from 2.61 billion rupees year-over-year. Heranba Industries has recommended a final dividend of 1 rupee per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1748223272000,
            "Source": "default"
        },
        {
            "Title": "Heranba Industries Reports Q4 Loss and Recommends Dividend",
            "Summary": "Heranba Industries has recommended a final dividend of 1 rupee per equity share. For Q4, the company reported an EBITDA loss of 10 million rupees, compared to a gain of 196 million rupees in the same quarter last year. The net loss for Q4 was 53 million rupees, compared to a profit of 131.1 million rupees year-over-year, and a loss of 91 million rupees quarter-over-quarter. Q4 revenue increased to 3.95 billion rupees from 2.61 billion rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748001596000,
            "Source": "result"
        },
        {
            "Title": "Heranba Industries Commences Commercial Production at Saykha Unit",
            "Summary": "Heranba Industries has started commercial production at its Saykha unit. The production capacity of Phase-I of the Saykha unit is approximately 6000 MTPA. The company expects this phase to generate annual revenue between Rs. 280 crore to Rs. 300 crore.",
            "Sentiment": "positive",
            "PublishDate": 1745832084000,
            "Source": "default"
        },
        {
            "Title": "Heranba Industries Reports Q3 EBITDA Loss",
            "Summary": "Heranba Industries has reported an EBITDA loss of 90 million rupees for the third quarter, compared to a profit of 283 million rupees in the same period last year. This represents a significant year-over-year decline in the company's operational performance.",
            "Sentiment": "negative",
            "PublishDate": 1739516901000,
            "Source": "earnings"
        },
        {
            "Title": "Heranba Industries Reports Q3 Revenue Growth",
            "Summary": "Heranba Industries has reported a revenue of 3.38 billion rupees for the third quarter, compared to 3.02 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739516897000,
            "Source": "earnings"
        },
        {
            "Title": "Heranba Industries Reports Q3 Net Loss of 91 Million Rupees",
            "Summary": "Heranba Industries has reported a net loss of 91 million rupees for the third quarter, compared to a profit of 192 million rupees in the same period last year. This represents a significant year-over-year decline in the company's financial performance.",
            "Sentiment": "negative",
            "PublishDate": 1739516857000,
            "Source": "earnings"
        },
        {
            "Title": "Heranba Industries Q2 EBITDA and Margin Decline",
            "Summary": "Heranba Industries reported Q2 EBITDA of 460 million rupees, down from 470 million rupees year-over-year. The company's Q2 EBITDA margin also decreased to 10.04% from 10.93% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731487358000,
            "Source": "result"
        },
        {
            "Title": "Heranba Industries Reports Q2 Revenue Growth",
            "Summary": "Heranba Industries, an agrochemical company, has announced its financial results for the second quarter. The company reported revenue of 4.6 billion rupees, compared to 4.3 billion rupees in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731487285000,
            "Source": "result"
        },
        {
            "Title": "Heranba Industries Reports Q2 Net Profit Increase",
            "Summary": "Heranba Industries has reported a net profit of 340 million rupees for the second quarter, compared to 325 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731487242000,
            "Source": "result"
        },
        {
            "Title": "Heranba Industries Expects Significant Revenue from Sarigam Unit",
            "Summary": "<p>Heranba Industries anticipates its <span class='neutral'>Sarigam unit</span> to generate annual revenue between <span class='positive'>Rs. 280 to Rs. 300 crores</span>. The <b>production capacity</b> of the Sarigam unit is set at a maximum of <span class='neutral'>9000 MTPA</span> (Metric Tonnes Per Annum).</p>",
            "Sentiment": "positive",
            "PublishDate": 1728370952000,
            "Source": "corporate_action"
        },
        {
            "Title": "Heranba Industries Starts Commercial Production at Sarigam Unit",
            "Summary": "<p><span class='positive'>Heranba Industries</span> has announced the <b>commencement of commercial production</b> at its <span class='positive'>new unit</span> located in <span class='neutral'>GIDC, Sarigam, Taluka-Umbergaon, District-Valsad, Gujarat</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728370915000,
            "Source": "corporate_action"
        }
    ]
}