{
    "Symbol": "HERITGFOOD",
    "ISIN": "INE978A01027",
    "News": [
        {
            "Title": "Kohinoor Foods Board Meeting Set for February 13, 2026",
            "Summary": "Kohinoor Foods Ltd schedules board meeting to review Q3FY26 unaudited financial results for quarter ended December 31, 2025, and consider CFO appointment under LODR regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770381365924,
            "Source": "co_actions_results"
        },
        {
            "Title": "Heritage Foods VP Marketing Puneet Kusumbia Resigns",
            "Summary": "Heritage Foods announces resignation of Mr. Puneet Kusumbia, Vice President (Marketing) and Senior Management Personnel, effective May 5, 2026, due to personal reasons after 3 years with the company.",
            "Sentiment": "neutral",
            "PublishDate": 1770380361294,
            "Source": "stocks"
        },
        {
            "Title": "Heritage Foods Q3FY26 Profit Drops 26% YoY to ₹304.91M",
            "Summary": "Heritage Foods reported Q3FY26 standalone net profit of ₹304.91 million, down 26.2% YoY, despite revenue growth of 7.0% to ₹10,914.08 million. Nine-month profit declined 21.0% to ₹1,166.53 million.",
            "Sentiment": "negative",
            "PublishDate": 1769599994044,
            "Source": "co_actions_results"
        },
        {
            "Title": "Heritage Foods Gets ₹77.95 Lakh GST Refund Order",
            "Summary": "Heritage Foods Limited receives GST refund order worth ₹77.95 lakhs from Chennai tax authorities for flavoured milk classification dispute covering July 2017 to October 2021 period.",
            "Sentiment": "positive",
            "PublishDate": 1768976617516,
            "Source": "stocks"
        },
        {
            "Title": "Heritage Foods Receives FSSAI Notice for Product Quality",
            "Summary": "Heritage Foods Limited received notice from FSSAI authority regarding sub-standard milk fat content in Heritage Total Curd sample, resulting in ₹1.00 lakh compounding fee with no material financial impact.",
            "Sentiment": "negative",
            "PublishDate": 1768225233482,
            "Source": "stocks"
        },
        {
            "Title": "Heritage Foods MD Wins Outstanding Dairy Award 2025",
            "Summary": "Mrs. N. Bhuvaneswari, Vice Chairperson & Managing Director of Heritage Foods Limited, has been honoured with the Outstanding Dairy Professional Award 2025 (Andhra Pradesh) at the Indian Dairy Association conclave.",
            "Sentiment": "positive",
            "PublishDate": 1768030876965,
            "Source": "stocks"
        },
        {
            "Title": "Heritage Foods Completes 51% Stake Acquisition in PBJ",
            "Summary": "Heritage Foods Limited successfully completed acquisition of 51% equity share capital of Peanutbutter and Jelly Private Limited on January 08, 2026, with shareholders agreement executed on January 09, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767963621287,
            "Source": "co_actions_results"
        },
        {
            "Title": "Devyani International Sells 51% PB&J Stake to Heritage",
            "Summary": "Devyani International's subsidiary Sky Gate Hospitality will sell its entire 51% stake in Peanutbutter and Jelly Private Ltd to Heritage Foods for ₹9 crore, with transaction completion expected by January 31, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767097398606,
            "Source": "co_actions_results"
        },
        {
            "Title": "Heritage Foods Executive Director Wins Business Award",
            "Summary": "Mrs. Nara Brahmani, Executive Director of Heritage Foods Limited, received recognition at the Business Today Most Powerful Women in Business Awards 2025 held in Mumbai on December 12, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765779835282,
            "Source": "stocks"
        },
        {
            "Title": "Heritage Foods Executes Share Purchase Agreement",
            "Summary": "Heritage Foods Limited has executed the Share Purchase Agreement for acquiring 51% stake in Peanutbutter and Jelly Private Limited on December 30, 2025, with share transfer currently in process.",
            "Sentiment": "positive",
            "PublishDate": 1765377652688,
            "Source": "co_actions_results"
        },
        {
            "Title": "Heritage Foods Receives Favorable GST Refund Order Worth Rs. 77.95 Lakhs",
            "Summary": "Heritage Foods Limited received a favorable order from Joint Commissioner, Central Tax, Chennai, sanctioning GST refund of Rs. 77.95 Lakhs by setting aside earlier refund rejection orders dated 02-05-2025. The refund relates to differential GST amount paid under protest on Flavoured Milk supplies in Tamil Nadu from July 1, 2017 to October 31, 2021.",
            "Sentiment": "positive",
            "PublishDate": 1764063157917,
            "Source": "stock"
        },
        {
            "Title": "Heritage Foods Receives Golden Peacock Award for Corporate Governance Excellence 2025",
            "Summary": "Heritage Foods Limited has been awarded the Golden Peacock Award for Excellence in Corporate Governance 2025 by the Institute of Directors (IOD), India. The award was presented at the IOD Annual London Global Convention on Corporate Governance Sustainability held on November 04, 2025 in London. The award was received by Smt. Bhuvaneswari Nara, Vice-Chairperson & Managing Director, and Sri. Umakanta Barik, Company Secretary & Compliance Officer. Additionally, Smt. Bhuvaneswari Nara was conferred with the IOD's Distinguished Fellowship-2025 at the same event, recognizing her exceptional leadership, business acumen, and commitment to advancing corporate governance and sustainability practices.",
            "Sentiment": "positive",
            "PublishDate": 1762381708103,
            "Source": "corporate_governance"
        },
        {
            "Title": "Heritage Foods Clarifies Board Approval Status for Peanut Butter and Jelly Acquisition",
            "Summary": "Heritage Foods issued a clarification regarding its press release dated October 27, 2025, about acquiring a majority stake in Peanut Butter and Jelly Private Limited. The company clarified that its Board approved a proposal to acquire 51% shareholding through secondary buyouts from existing investors, rather than having completed the acquisition. The transaction remains subject to closing of the share purchase agreement and necessary corporate approvals. Heritage Foods stated the clarification was issued to avoid misinterpretation of its regulatory disclosure and expressed regret for any inconvenience caused.",
            "Sentiment": "neutral",
            "PublishDate": 1761913311233,
            "Source": "corporate_action"
        },
        {
            "Title": "DSP Mutual Fund Increases Stake in Heritage Foods to 5.24% Through Rights Issue",
            "Summary": "DSP Small Cap Fund acquired 25,68,989 shares of Heritage Foods Limited on February 27, 2023, through a rights issue, increasing DSP's total shareholding to 5.24% of the company's paid-up capital. The acquisition triggered disclosure requirements as the holding crossed the 5% threshold. DSP's total shareholding increased from 22,92,047 shares to 48,61,036 shares. Heritage Foods' equity share capital doubled from 4,63,98,000 shares to 9,27,96,000 shares following the rights issue. DSP Trustee Private Limited acts as trustee for DSP Mutual Fund schemes and DSP Alternative Investment Fund, with DSP Investment Manager Private Limited serving as the investment manager.",
            "Sentiment": "neutral",
            "PublishDate": 1761795432186,
            "Source": "corporate_action"
        },
        {
            "Title": "Heritage Foods Acquires 51% Stake in Healthy Dessert Brand Get-A-Way for Rs 9 Crore",
            "Summary": "Heritage Foods Limited's board approved the acquisition of 51% equity stake in Peanutbutter and Jelly Private Limited for Rs 9 crore. The target company operates under the brand name 'Get-A-Way' and specializes in healthy desserts including protein ice creams, keto desserts, vegan ice pops, and low-calorie kulfis sold through e-commerce and retail stores. The company reported turnover of Rs 18.08 crore in FY 2024-25, showing growth from Rs 7.89 crore in FY 2022-23. Heritage Foods will purchase the stake from Sky Gate Hospitality Private Limited through a Share Purchase Agreement, with completion expected within 45 days. The acquisition will make the target company a subsidiary of Heritage Foods. Heritage Foods plans to acquire an additional 20% stake from existing promoters after March 2026. The acquisition aims to expand Heritage Foods' presence in the healthy desserts and ice cream market.",
            "Sentiment": "positive",
            "PublishDate": 1761545457843,
            "Source": "order&deals"
        },
        {
            "Title": "Heritage Foods Reports 9% Revenue Growth to INR 11,125 Million Despite Weather Challenges in Q2 FY26",
            "Summary": "Heritage Foods Limited reported consolidated revenue of INR 11,125 million for Q2 FY26, marking 9% year-on-year growth and the second consecutive quarter above INR 11 billion. The company faced challenges from extended monsoon, lean milk season, and butter shortage. Value-added products portfolio grew 18% to INR 4,132 million, contributing 38% of total sales, with double-digit growth in curd, paneer, drinkables and ice cream categories. EBITDA stood at INR 772 million with 6.9% margin, while PAT reached INR 510 million, up 5% year-on-year. EBITDA margins declined 122 basis points due to 6.3% increase in milk procurement costs versus 4.5% rise in realizations. Milk procurement averaged 16.1 lakh liters per day, down 2% year-on-year, while milk sales grew 1.1% to 12.1 lakh liters per day. Subsidiary Heritage Nutrivet delivered strong performance with revenue of INR 581 million (34% increase) and PBT of INR 54 million (80% increase). The company expanded distribution by 60 points and added 6,000 retail outlets during the quarter. Management expects margins to normalize as milk costs ease and supply stabilizes in the flush season.",
            "Sentiment": "neutral",
            "PublishDate": 1761116141196,
            "Source": "earnings"
        },
        {
            "Title": "Heritage Foods Anticipates Strong Second Half Performance",
            "Summary": "Heritage Foods expects a strong second half driven by festive demand, GST benefits, and capacity growth. The company's value-added products segment is approaching a 40% share of its business.",
            "Sentiment": "positive",
            "PublishDate": 1760547121016,
            "Source": "stock"
        },
        {
            "Title": "Heritage Foods Reports Mixed Q2 Results with Higher Profit but Lower EBITDA",
            "Summary": "Heritage Foods reported consolidated net profit of 511 million rupees for Q2, up from 490 million rupees in the same quarter last year. However, the company's EBITDA declined to 771 million rupees from 832 million rupees year-over-year. The EBITDA margin also compressed to 6.94% compared to 8.16% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1760521108330,
            "Source": "earnings"
        },
        {
            "Title": "Heritage Foods Appoints Amit Vijay Shetty as Chief Human Resources Officer",
            "Summary": "Heritage Foods Limited appointed Mr. Amit Vijay Shetty as Chief Human Resources Officer, effective October 1, 2025. Shetty will lead the company's HR function, focusing on strategic talent management, leadership development, organizational culture, employee engagement, performance management, and diversity initiatives while aligning HR strategy with business objectives. He brings over 16 years of HR experience across FMCG, manufacturing, chemical, and cement sectors, holding a Masters in Management Studies with HR specialization and a Bachelor of Engineering in Instrumentation from Mumbai University. His expertise includes leadership development, talent management, learning & development, and HR business partnering. Shetty has previously led leadership programs, capability-building workshops, workforce development initiatives, and projects to enhance managerial competencies and employee engagement. He is not related to any director of the company.",
            "Sentiment": "positive",
            "PublishDate": 1759302746722,
            "Source": "corporate_governance"
        },
        {
            "Title": "Heritage Foods Limited Wins Golden Peacock Award for Excellence in Corporate Governance 2025",
            "Summary": "Heritage Foods Limited has been awarded the Golden Peacock Award for Excellence in Corporate Governance for 2025 by the Institute of Directors. The award will be presented at a ceremony in London on November 4, 2025, during IOD India's Annual London Global Convention on Corporate Governance & Sustainability. The company stated this recognition reflects their commitment to transparency, accountability, and ethical practices across operations.",
            "Sentiment": "positive",
            "PublishDate": 1758860158679,
            "Source": "corporate_governance"
        },
        {
            "Title": "Heritage Foods Cuts Dairy Product Prices Following GST Rationalization",
            "Summary": "Heritage Foods announced substantial price reductions across its dairy product portfolio, passing on the complete benefits of the Government of India's GST rationalization to consumers ahead of the festive season. The price cuts, effective September 22, 2025, include ₹3 per litre reduction for long shelf-life UHT milk, ₹50 per litre reduction for ghee, ₹50 per kg reduction for butter and cheese, ₹25 per kg reduction for paneer, and ₹35 off 950ml ice cream packs with ₹20 off 700ml packs. Executive Director Brahmani Nara stated the GST rate rationalization makes it possible to pass the entire benefit to consumers, making dairy products more accessible to families across India including Tier 2 and Tier 3 cities. Heritage Foods operates across 17 states and was founded in 1992, working with a network of dairy farmers and 500+ quality experts performing over 25 daily quality tests.",
            "Sentiment": "positive",
            "PublishDate": 1758188504805,
            "Source": "stock"
        },
        {
            "Title": "Heritage Foods Reports Record Q1 Revenue of ₹1,137 Crores Despite Weather Challenges",
            "Summary": "Heritage Foods achieved its highest quarterly revenue of ₹1,137 crores in Q1 FY26, marking the third consecutive quarter of double-digit revenue growth. The company faced weather-related challenges including erratic monsoon and unseasonably cool summer across core markets, which temporarily impacted demand for value-added products like curd, buttermilk, flavored milk and ice cream. EBITDA stood at ₹739 million with 6.5% margin, while PAT was ₹405 million with 3.6% margin. Milk procurement increased 10% year-on-year to 17.8 lakh liters per day from over 300,000 farmers across 9,000+ villages. Value-added products revenue reached ₹4,540 million, growing 7.4% year-on-year and contributing over 40% to total revenue. The company acquired additional 44.4% stake in Heritage Novandie Foods, increasing holding to 94.4%. Heritage Nutrivet subsidiary performed strongly with 26% revenue growth to ₹533 million and 130% surge in profit before tax to ₹67 million. Management expects normalization in coming quarters as volume-led operating leverage kicks in, with business recovery already visible in June.",
            "Sentiment": "positive",
            "PublishDate": 1753095700826,
            "Source": "earnings"
        },
        {
            "Title": "Heritage Foods Ltd: Q1 Profit Drops 31% YoY, Margin Contracts",
            "Summary": "Heritage Foods reported Q1FY26 net profit of ₹40.5 crore, down 30.7% YoY. Revenue increased 10.1% to ₹1,136.7 crore. EBITDA fell 21.2% to ₹73.8 crore, with margin contracting to 6.5% from 9%. Stock fell 3.17% on NSE after earnings release.",
            "Sentiment": "negative",
            "PublishDate": 1752746536000,
            "Source": "earnings"
        },
        {
            "Title": "Heritage Foods Reports Q1 Financial Results",
            "Summary": "Heritage Foods has released its Q1 financial results. The company's EBITDA decreased to 739 million rupees from 938 million rupees year-over-year. The EBITDA margin declined to 6.50% from 9.08% in the same period last year. Revenue increased to 11.4 billion rupees from 10.3 billion rupees year-over-year. The consolidated net profit for Q1 was 405 million rupees, down from 584 million rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1752743882000,
            "Source": "result"
        },
        {
            "Title": "Heritage Foods Schedules Meeting with Abakkus Asset Manager",
            "Summary": "Heritage Foods has scheduled a meeting with Abakkus Asset Manager Pvt Ltd on June 12. No further details about the purpose or content of the meeting were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1749460285000,
            "Source": "default"
        },
        {
            "Title": "Heritage Foods Declares Dividend of Rs 2.5 Per Share",
            "Summary": "Heritage Foods has announced a dividend of Rs 2.5 per share. No additional details about the timing, record date, or fiscal period were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747396205000,
            "Source": "result"
        },
        {
            "Title": "Heritage Foods Reports Q4 Financial Results",
            "Summary": "Heritage Foods announced its Q4 financial results. The company's EBITDA increased to 799 million rupees from 702 million rupees year-over-year. The EBITDA margin improved to 7.62% from 7.39% in the same period. Consolidated net profit decreased to 382 million rupees from 405 million rupees year-over-year, but increased from 431 million rupees quarter-over-quarter. Revenue grew to 10.5 billion rupees from 9.5 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747396168000,
            "Source": "result"
        },
        {
            "Title": "Heritage Foods to Consider Q4 Results on May 16",
            "Summary": "Heritage Foods has announced that it will consider its fourth quarter (Q4) financial results on May 16. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746445281000,
            "Source": "default"
        },
        {
            "Title": "Heritage Foods: Q3 Profit Soars 60%, Revenue Up 9.87%",
            "Summary": "Heritage Foods reported Q3 FY25 results with profit rising 60.04% YoY to ₹43.05 crore and revenue increasing 9.87% YoY to ₹1033.94 crore. EPS grew 60% to ₹4.64. Operating income jumped 54.47% YoY despite a 14.57% QoQ decline. Analysts maintain a Strong Buy recommendation.",
            "Sentiment": "positive",
            "PublishDate": 1737609505000,
            "Source": "earnings"
        },
        {
            "Title": "Heritage Foods Reports 9.6% Revenue Growth in Q3",
            "Summary": "Heritage Foods has announced its financial results for the third quarter, reporting a revenue of 10.3 billion rupees. This represents a 9.6% increase compared to the same period last year when the company recorded revenue of 9.4 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1737538235000,
            "Source": "earnings"
        },
        {
            "Title": "Heritage Foods Reports Significant Increase in Q3 EBITDA and Margin",
            "Summary": "Heritage Foods has announced its Q3 financial results, showing a substantial year-over-year improvement. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) rose to 741 million rupees from 493 million rupees in the same quarter last year. Additionally, the EBITDA margin increased to 7.17% from 5.34% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1737538212000,
            "Source": "earnings"
        },
        {
            "Title": "Heritage Foods Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Heritage Foods has announced its financial results for the third quarter, reporting a consolidated net profit of 430 million rupees. This represents a substantial increase from the 269 million rupees reported in the same period of the previous year, indicating a year-over-year growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1737538161000,
            "Source": "earnings"
        },
        {
            "Title": "Heritage Foods: 82% of Andhra CM Naidu's Wealth Tied to Family Shares",
            "Summary": "Heritage Foods, a dairy product retailer founded in 1992, accounts for 82% of Andhra Pradesh Chief Minister N Chandrababu Naidu's reported ₹931 crore wealth. The company, listed in 1994, has a current market value of ₹4400 crores and operates in 12 states. Naidu's wife, Bhuvaneswari Nara, owns a 24.37% stake worth about ₹763 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1735740622000,
            "Source": "normal_news"
        },
        {
            "Title": "Heritage Foods Reports Strong Q2 Financial Performance",
            "Summary": "Heritage Foods has announced its Q2 financial results, showing significant improvement in EBITDA and EBITDA margin compared to the same period last year. The company's EBITDA increased from 470 million rupees to 811 million rupees year-over-year. Additionally, the EBITDA margin improved from 4.81% to 7.95% in the same period.",
            "Sentiment": "positive",
            "PublishDate": 1729674963000,
            "Source": "result"
        },
        {
            "Title": "Heritage Foods Reports Q2 Revenue Growth",
            "Summary": "Heritage Foods has announced its second quarter revenue for the current fiscal year. The company reported revenue of 10 billion rupees, compared to 9.8 billion rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729674928000,
            "Source": "result"
        },
        {
            "Title": "Heritage Foods Reports Significant Profit Increase in Q2",
            "Summary": "Heritage Foods has announced a substantial year-over-year increase in consolidated net profit for the second quarter. The company's net profit rose to 490 million rupees, up from 224 million rupees in the same period last year, marking a significant improvement in financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1729674891000,
            "Source": "result"
        }
    ]
}