{
    "Symbol": "HEROMOTOCO",
    "ISIN": "INE158A01026",
    "News": [
        {
            "Title": "Hero MotoCorp Eyes Double-Digit Q4 Growth",
            "Summary": "Hero MotoCorp anticipates strong double-digit growth in two-wheeler sales for Q4, signaling positive momentum in the domestic motorcycle market amid favorable industry conditions.",
            "Sentiment": "positive",
            "PublishDate": 1770355205370,
            "Source": "stocks"
        },
        {
            "Title": "Hero MotoCorp Reports Record Q3 FY26 Results",
            "Summary": "Hero MotoCorp delivered highest ever quarterly revenue of Rs. 12,328 crore (+21%) and normalized PAT of Rs. 1,439 crore (+20%) for Q3 FY26, while declaring interim dividend of Rs. 110 per share.",
            "Sentiment": "positive",
            "PublishDate": 1770306053460,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hero MotoCorp Records 26% Growth in January 2026",
            "Summary": "Hero MotoCorp maintains 25 consecutive years of market leadership with 557,871 units dispatched in January 2026, marking 26% growth. VIDA business posts 21% month-on-month growth with 13,000 registrations.",
            "Sentiment": "positive",
            "PublishDate": 1769943765624,
            "Source": "stocks"
        },
        {
            "Title": "Hero MotoCorp schedules Q3FY26 earnings call for Feb 6",
            "Summary": "Hero MotoCorp announces earnings conference call with analysts and investors scheduled for February 6, 2026 at 10:30 AM to discuss Q3FY26 financial results following board meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1769869861948,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hero MotoCorp Q3 Results on Feb 5",
            "Summary": "Hero MotoCorp has announced that its board will meet on February 5 to consider and approve the company's third quarter financial results for the current fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1768989888489,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hero MotoCorp Receives ₹4.97 Crore GST Demand Order",
            "Summary": "Hero MotoCorp received a GST demand order of ₹4.97 crore from Additional Commissioner CGST Vadodara for FY 2019-20. Company assesses demand as legally unmaintainable and plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1768905929338,
            "Source": "stocks"
        },
        {
            "Title": "Hero MotoCorp Sees ₹15.38 Cr NSE Block Trade",
            "Summary": "Hero MotoCorp witnessed a significant block trade on NSE worth ₹15.38 crores involving approximately 25,572 shares at ₹6,015.00 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767591668751,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hero MotoCorp December Sales Rise 40% to 4,56,479 Units",
            "Summary": "Hero MotoCorp reported 40% growth in December 2025 wholesales to 4,56,479 units with strong Q3FY26 performance. ICE scooter segment grew 45% during the quarter, while exports surged 41%.",
            "Sentiment": "positive",
            "PublishDate": 1767277664091,
            "Source": "stocks"
        },
        {
            "Title": "Hero MotoCorp Launches Dirt.E K3 Electric Bike for Kids",
            "Summary": "Hero MotoCorp introduces size-adjustable electric motorcycle for children aged 4-10, priced at ₹69,990 for first 300 units. Sales commence January 15, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1765522813414,
            "Source": "stocks"
        },
        {
            "Title": "Elara Reports Declining Farm Earnings in Rural India Affecting Hero Moto",
            "Summary": "Elara has reported that farming earnings in rural India are experiencing a significant decline. This development impacts Hero Moto, as rural income levels directly influence demand for two-wheelers in the company's key market segment.",
            "Sentiment": "negative",
            "PublishDate": 1765339578206,
            "Source": "stock"
        },
        {
            "Title": "Hero MotoCorp November Sales Jump 31.5% to 604,490 Units, Beating Estimates",
            "Summary": "Hero MotoCorp reported November sales of 604,490 units compared to 459,805 units in the same month last year, representing a significant year-over-year increase. The motorcycle manufacturer's performance exceeded market estimates of 580,080 units, indicating strong demand momentum.",
            "Sentiment": "positive",
            "PublishDate": 1764633560379,
            "Source": "stock"
        },
        {
            "Title": "Hero Fincorp Submits Addendum Document",
            "Summary": "Hero Fincorp Limited has submitted an addendum as announced by its parent company Hero MotoCorp. The submission represents a formal documentation process by the financial services subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1763447261430,
            "Source": "stock"
        },
        {
            "Title": "Hero MotoCorp Shares Worth Rs. 54.06 Crores Traded in NSE Block Deal",
            "Summary": "Hero MotoCorp witnessed a block trade on NSE involving 93,053 shares valued at Rs. 54.06 crores, executed at Rs. 5,810 per share. The transaction represents a significant institutional or bulk investor activity in the two-wheeler manufacturer's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1763445818644,
            "Source": "order&deals"
        },
        {
            "Title": "Hero MotoCorp Provides Growth and Margin Guidance for FY26",
            "Summary": "Hero MotoCorp expects 8-10% industry growth in H2 FY26 and around 5-6% for the full year FY26, while maintaining its EBITDA margin guidance of 14-16%. The company anticipates commodity cost inflation to remain range-bound at 1-2% for Q3 FY26, affecting its cost structure and profitability outlook.",
            "Sentiment": "positive",
            "PublishDate": 1763203139567,
            "Source": "stock"
        },
        {
            "Title": "Hero Moto Reports Strong Sales Recovery in 100CC Two-Wheeler Segment",
            "Summary": "Hero Moto announced a strong sales recovery in its 100CC two-wheeler segment during a conference call update. The recovery indicates improved performance in the company's core motorcycle category, potentially benefiting investors and stakeholders in the two-wheeler market.",
            "Sentiment": "positive",
            "PublishDate": 1763097932728,
            "Source": "stock"
        },
        {
            "Title": "Hero MotoCorp Reports 16% YoY Growth in Q2 Net Profit to Rs 1,393 Crore",
            "Summary": "Hero MotoCorp reported a 16% year-on-year increase in standalone net profit to Rs 1,393 crore for the second quarter, with revenue rising 16% to Rs 12,126 crore and vehicle volumes growing 11% to 16.91 lakh units. The company gained 40 basis points in market share during the festive season, while its electric arm Vida achieved 11.7% EV market share and international business saw 77% dispatch growth.",
            "Sentiment": "positive",
            "PublishDate": 1763092038127,
            "Source": "earnings"
        },
        {
            "Title": "Hero MotoCorp Approves Rs. 170 Crore Investment for New Parts Center, Company Secretary Resigns",
            "Summary": "Hero MotoCorp's Board approved unaudited financial results for the quarter and half year ended September 30, 2025, and sanctioned an additional investment of up to Rs. 170 crore for setting up Global Part Center 2.0 at Tirupati, Andhra Pradesh, with commercial operations expected to commence during FY 2027-28. Company Secretary and Compliance Officer Dhiraj Kapoor resigned effective November 14, 2025, to pursue opportunities outside the organization.",
            "Sentiment": "positive",
            "PublishDate": 1763049600427,
            "Source": "stock"
        },
        {
            "Title": "Hero MotoCorp Sees Rs. 100.30 Crore Block Trade on NSE",
            "Summary": "Hero MotoCorp executed a block trade worth Rs. 100.30 crores on the National Stock Exchange. The transaction involved approximately 180,687 shares at a price of Rs. 5,551 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1763006614610,
            "Source": "order&deals"
        },
        {
            "Title": "Hero MotoCorp Allots 13,752 Equity Shares Under Employee Incentive Scheme",
            "Summary": "Hero MotoCorp's Nomination Remuneration Committee allotted 13,752 equity shares of face value Rs. 2 each to eligible employees who exercised stock options under the Employee Incentive Scheme 2014. The allotment includes shares from various categories: 1,160 Stock Options from 2018, 3,841 Performance Restricted Stock Units from 2022, 2,490 Restricted Stock Units from 2022, 3,929 from 2023, and 1,207 from 2024. The company's paid-up share capital increased to Rs. 40,01,63,224 divided into 20,00,81,612 equity shares. The committee also approved grants of 820 Restricted Stock Units vesting over 3 years and 1,843 Performance Restricted Stock Units vesting after 3 years, both at face value of Rs. 2 per unit.",
            "Sentiment": "neutral",
            "PublishDate": 1762987946047,
            "Source": "corporate_action"
        },
        {
            "Title": "Hero MotoCorp Issues Final Reminder for Unclaimed FY2018-19 Interim Dividend Before IEPF Transfer",
            "Summary": "Hero MotoCorp has sent reminder notices to shareholders regarding unclaimed interim dividend from FY2018-19 that remains unpaid. The company warned that unclaimed dividends and corresponding shares will be transferred to the Investor Education and Protection Fund (IEPF) Authority during 2026 if not claimed by February 15, 2026. Under the Companies Act 2013, dividends remaining unclaimed for seven years must be transferred to IEPF, along with the associated shares. The interim dividend was declared on January 31, 2019, with the IEPF transfer due date of March 5, 2026. Shareholders need to submit required documentation including PAN, address proof, cancelled cheque, and specific forms to claim their dividends. The company's registrar KFin Technologies Limited will process the claims. Once transferred to IEPF, shareholders can still claim their dividends and shares by applying through the prescribed IEPF-5 form on the IEPF website.",
            "Sentiment": "neutral",
            "PublishDate": 1762290188248,
            "Source": "corporate_action"
        },
        {
            "Title": "Hero MotoCorp Unveils Electric Vehicle Strategy and New Product Lineup at EICMA 2025",
            "Summary": "Hero MotoCorp presented its eco-friendly electric transportation plan at EICMA 2025. The company launched the VIDA Novus lineup alongside new conventional models including the Hunk 440 SX and XPulse 210 Dakar Edition. Hero MotoCorp also showcased global electric vehicles including the VIDA VX2 scooter and concept UBEX motorcycle.",
            "Sentiment": "positive",
            "PublishDate": 1762274734994,
            "Source": "stock"
        },
        {
            "Title": "Hero MotoCorp Shares Drop 5.17% as October Sales Miss Expectations Despite Price Cuts",
            "Summary": "Hero MotoCorp shares fell 5.17% on Tuesday, marking the sharpest single-day decline since February, after October sales numbers missed market expectations. The company reported an 8% year-on-year decline in domestic sales to 6.5 lakh units, worse than the Street's estimated 3% drop. Total two-wheeler sales declined 6.4% to 6.36 lakh units. Despite implementing price cuts of up to Rs 15,743 following GST rate reduction from 28% to 18% on two-wheelers under 350cc, the price reductions failed to boost sales. In contrast, competitors Bajaj Auto, TVS Motor and Eicher Motors posted 8-13% growth. The stock has risen 33% since August and trades at 19.5 times forward price-to-earnings, above its five-year average of 18 times. Analysts cite market share losses and limited earnings visibility as concerns, with consensus estimates suggesting only 5% potential upside from current levels.",
            "Sentiment": "negative",
            "PublishDate": 1762248263060,
            "Source": "stock"
        },
        {
            "Title": "Hero MotoCorp Shares Drop 3% as October Sales Fall 6% Despite Strong Export Growth",
            "Summary": "Hero MotoCorp shares declined 3% to Rs 5,382 after reporting a 6.3% drop in October sales to 6,35,808 units compared to the same month in the previous fiscal year. Motorcycle sales fell 10.22% to 5,70,753 units, while domestic sales dropped 8% to 6,04,829 units. However, scooter sales surged over 50% to more than 65,000 units, and exports jumped 43% to nearly 31,000 units. The company recorded 994,690 unit registrations on VAHAN during the festive season and expanded into European markets including Italy, Spain, the UK, and France with Euro 5+ compliant models. Citi maintained its Buy rating with a target price of Rs 6,100, noting that VAHAN registrations rose 70% year-on-year indicating strong festive retail demand. The brokerage expects retail momentum to remain firm, potentially leading to inventory restocking in November and December.",
            "Sentiment": "neutral",
            "PublishDate": 1762234128304,
            "Source": "stock"
        },
        {
            "Title": "Hero MotoCorp October Sales Drop 8% Despite GST Rate Cuts and Price Reductions",
            "Summary": "Hero MotoCorp reported an 8% decline in domestic sales for October, with total domestic sales falling to 6.5 lakh units compared to 6.57 lakh units in the previous year. Total two-wheeler sales decreased 6.4% to 6.36 lakh units year-on-year, falling short of estimates of 6.56 lakh units. Exports showed strong growth, rising 42.8% to 30,979 units versus 21,688 units. Following a GST rate reduction on two-wheelers under 350cc from 28% to 18%, the company implemented price cuts of up to Rs 15,743 across its motorcycle range, with the Karizma 210 seeing the largest reduction. The Xpulse 210 and Xtreme 250R models saw price cuts of Rs 14,516 and Rs 14,055 respectively. Scooter models including Pleasure Plus, Destini 125 and Xoom 160 also received price reductions. The substantial price cuts did not translate into increased domestic sales across the company's two-wheeler segments.",
            "Sentiment": "negative",
            "PublishDate": 1762168571891,
            "Source": "stock"
        },
        {
            "Title": "Hero MotoCorp Reports Nearly 10 Lakh Retail Sales in October 2025 with Strong Festive Performance",
            "Summary": "Hero MotoCorp recorded 9.95 lakh unit registrations through VAHAN in October 2025, marking strong festive season performance. The company achieved its second consecutive month of over 6 lakh wholesale dispatches with 635,808 units in October 2025. The performance was driven by robust demand across popular models including Splendor, Xpulse, Glamour X and the scooter range. VIDA electric scooters showed significant growth with approximately 16,000 VAHAN registrations in October 2025, representing 117% year-on-year growth and 24% growth over the previous month. Hero MotoCorp expanded into European markets including Italy, Spain, UK, and France with Euro 5+ compliant models led by Hunk 440 and Xpulse 200, bringing its presence to 52 countries across 5 continents. The Global Business segment delivered 175,997 units in the first half with 54% year-on-year growth and reported October 2025 global sales of 30,979 units, marking 42.8% growth over the same period last year. The company attributed the positive performance to sustained festive momentum, renewed customer confidence, favorable market conditions, and GST benefits.",
            "Sentiment": "positive",
            "PublishDate": 1762165263114,
            "Source": "stock"
        },
        {
            "Title": "Hero MotoCorp Acquires 26% Stake in Clean Max Karakoram SPV for Solar Power Project",
            "Summary": "Hero MotoCorp has completed a 26% acquisition in Clean Max Karakoram SPV, a special purpose vehicle focused on solar power wheeling projects. This investment represents the company's entry into renewable energy infrastructure through a strategic partnership.",
            "Sentiment": "positive",
            "PublishDate": 1761842334629,
            "Source": "order&deals"
        },
        {
            "Title": "Hero MotoCorp Enters UK Market, Expanding to 51 Countries Globally",
            "Summary": "Hero MotoCorp announced its official entry into the United Kingdom market through a partnership with MotoGB Ltd., marking its 51st international market. The company will introduce its Euro 5+ range led by the Hunk 440 motorcycle, priced starting at £3,499. MotoGB will distribute Hero MotoCorp products through an initial network of 25+ sales and service outlets, with plans to expand to 35+ locations by 2026. This expansion follows Hero MotoCorp's recent entries into Italy and Spain, strengthening its European footprint. The company maintains its position as the world's largest motorcycle and scooter manufacturer for 24 consecutive years, with over 125 million customers globally. Hero MotoCorp offers a 2-year warranty on all UK products and operates manufacturing facilities across six countries with a presence spanning Asia, Africa, Europe, and Latin America.",
            "Sentiment": "positive",
            "PublishDate": 1761217143684,
            "Source": "stock"
        },
        {
            "Title": "Hero MotoCorp Enters Spanish Market Through Partnership, Expands to 50 International Markets",
            "Summary": "Hero MotoCorp has entered the Spanish market through a partnership with Noria Motos, bringing its total international presence to 50 markets. The company is unveiling two motorcycle models in this expansion: the Hunk 440 and Xpulse 200.",
            "Sentiment": "positive",
            "PublishDate": 1760528062570,
            "Source": "stock"
        },
        {
            "Title": "Hero MotoCorp Enters Italian Market Through Partnership with Pelpi International",
            "Summary": "Hero MotoCorp has launched operations in Italy by partnering with Pelpi International. The company is introducing three motorcycle models in the Italian market, including the Hunk 440 and Xpulse 200. Hero MotoCorp is offering a 5-year warranty on these models as part of its Italian market entry strategy.",
            "Sentiment": "positive",
            "PublishDate": 1760348002067,
            "Source": "stock"
        },
        {
            "Title": "Hero MotoCorp September Sales Rise 7.9% to 687,220 Units, Beats Estimates",
            "Summary": "Hero MotoCorp reported September total sales of 687,220 units compared to 637,050 units in the same period last year, representing a year-over-year increase. The sales figure exceeded the estimated 650,050 units. The company achieved its highest ever dispatches to global markets at approximately 40,000 units, outperforming industry growth rates.",
            "Sentiment": "positive",
            "PublishDate": 1759456952497,
            "Source": "stock"
        },
        {
            "Title": "Hero MotoCorp September Sales Rise 7.9% to 687,220 Units, Beats Estimates",
            "Summary": "Hero MotoCorp reported September sales of 687,220 units, representing an increase from 637,050 units in the same period last year. The sales figures exceeded market estimates of 650,050 units. The company also achieved record global dispatches of approximately 40,000 units, outperforming industry growth rates.",
            "Sentiment": "positive",
            "PublishDate": 1759322351649,
            "Source": "stock"
        },
        {
            "Title": "BNP Paribas Acquires Rs 1,035 Crore Stake in Hero MotoCorp Through Bulk Deal",
            "Summary": "BNP Paribas Financial Markets acquired a 0.97% stake in Hero MotoCorp worth Rs 1,035.16 crore through a bulk deal on NSE, purchasing 19.52 lakh shares at Rs 5,302.91 per share. The mutual fund house also bought stakes in Max Healthcare (0.85% for Rs 921.64 crore) and IndusInd Bank (1.37% for Rs 771.71 crore) while making some partial divestments. Hero MotoCorp expects a record-breaking festive season with double the showroom traffic compared to last year and strong consumer sentiment across urban and rural markets. The company reported 13% growth in festive season sales to 15.98 lakh units during a 32-day period in 2024. Hero MotoCorp shares closed 0.52% lower at Rs 5,300.50, with the stock down 11.03% over 12 months but up 27.40% year-to-date. Analyst consensus shows 24 buy ratings, 13 hold, and 5 sell recommendations with an average price target of Rs 5,326.44.",
            "Sentiment": "positive",
            "PublishDate": 1759162022391,
            "Source": "order&deals"
        },
        {
            "Title": "Hero MotoCorp Expects Record Festive Season Sales Driven by GST Benefits",
            "Summary": "Hero MotoCorp anticipates a record-breaking festive season following strong early indicators. The company reported 13% growth in sales to 15.98 lakh units during the 32-day festive period in 2024. Chief Business Officer Ashutosh Varma noted double the showroom traffic compared to last year, with significant increases in consumer sentiment, enquiries and bookings. The GST Council reduced rates for bikes under 350cc to 18%, while bikes above 350cc face 40% GST. Hero is passing on 100% of GST benefits to customers and offering additional benefits up to Rs 15,000 for first-time buyers. Strong demand is seen across both entry-level and premium segments, with particular traction in 100cc and 125cc commuter motorcycles. The company is witnessing robust demand in urban and rural markets, with rural demand expected to improve further as harvesting season concludes.",
            "Sentiment": "positive",
            "PublishDate": 1759137293956,
            "Source": "stock"
        },
        {
            "Title": "Hero MotoCorp Appoints Madhuri Mehta as Chief Human Resources Officer",
            "Summary": "Hero MotoCorp announced the appointment of Madhuri Mehta as Chief Human Resources Officer, effective October 1, 2025. Mehta brings over 24 years of HR experience across diverse industries and will lead the company's global people strategy, culture transformation, and capability-building initiatives. She joins from Emaar India where she served as CHRO and Head of Communities. Her previous experience includes 16 years at Dalmia Bharat Group in various leadership roles and earlier work at Bharti Airtel. Executive Chairman Dr. Pawan Munjal stated her experience in linking people strategy with business outcomes will support the company's growth journey and global expansion. Mehta was recently honored as Best HR Leader of the Year at the Economic Times Human Capital Awards 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758857441036,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hero Splendor Prices Drop Up To Rs 7,253 Following GST Reduction on Two-Wheelers",
            "Summary": "The revised GST framework (GST 2.0) reduced tax rates on two-wheelers with engine capacities up to 350cc from 28% to 18%, effective September 22. Hero MotoCorp announced it will pass the full tax benefit to customers, resulting in price reductions across Splendor variants. The Super Splendor Xtec Disc sees the highest reduction of Rs 7,253, now priced at Rs 85,594 in Delhi. Other variants see decreases ranging from Rs 6,262 to Rs 6,949. The timing coincides with the festive season, traditionally a strong period for two-wheeler sales. Nearly 98% of two-wheelers sold in India have engines under 350cc, making this GST reduction applicable to most models in the market.",
            "Sentiment": "positive",
            "PublishDate": 1758685405420,
            "Source": "stock"
        },
        {
            "Title": "Hero MotoCorp Launches New Destini 110 Scooter with ₹72,000 Starting Price",
            "Summary": "Hero MotoCorp has launched the new Destini 110 scooter targeting families and new buyers. The scooter offers a mileage of 56.2 KMPL and features a 785 mm seat length. The company has set introductory prices at ₹72,000 and ₹79,000 for the new model.",
            "Sentiment": "positive",
            "PublishDate": 1758605568298,
            "Source": "stock"
        },
        {
            "Title": "Hero MotoCorp Expects Strong Festive Sales to Maintain Two-Wheeler Market Leadership",
            "Summary": "Hero MotoCorp anticipates the ongoing festival season will be among its best for sales, helping maintain its leadership in India's two-wheeler market. The company expects GST rate cuts on two-wheelers to boost demand and offset earlier sales losses. Chief Business Officer Ashutosh Varma described current conditions as the best macro environment in years, with strong booking pipelines expected to materialize during Navratri. The company leads the market by approximately 200,000 units through August and sold 54,45,251 units compared to Honda's 47,89,283 units. Hero MotoCorp plans to leverage 12 new products experiencing their first festive season, while focusing on growth across 100cc, 125cc, scooter, and premium segments. The company is expanding its EV product range nationally and continuing its Harley-Davidson partnership with new product development.",
            "Sentiment": "positive",
            "PublishDate": 1758461152486,
            "Source": "stock"
        },
        {
            "Title": "Hero MotoCorp Passes Full GST 2.0 Benefits to Customers Starting September 22",
            "Summary": "Hero MotoCorp announced it will pass the complete benefit of GST 2.0 reforms directly to customers effective September 22, 2025. The company offers price benefits up to ₹15,743 on select models in Delhi, with the Karizma 210 receiving the maximum benefit. Other popular models include Splendor+ (up to ₹6,820), Glamour X (up to ₹7,813), and various Xoom and Xtreme variants with benefits ranging from ₹6,597 to ₹14,516. CEO Vikram Kasbekar stated this move will enhance accessibility and affordability, particularly in rural and semi-urban regions, and support India's journey to a $5 trillion economy. The initiative targets the festive season to make two-wheelers more accessible for India's consumer base.",
            "Sentiment": "positive",
            "PublishDate": 1757480864558,
            "Source": "stock"
        },
        {
            "Title": "Hero MotoCorp Appoints Harshavardhan Chitale as CEO Effective January 2026",
            "Summary": "Hero MotoCorp has appointed Harshavardhan Chitale as Chief Executive Officer effective January 5, 2026. The Board of Directors approved this appointment on September 8, 2025. Chitale brings over three decades of global leadership experience across B2B and B2C sectors, with expertise in industrial automation, lighting, IT services, and digital transformation. He previously served as Global CEO of Signify's €4 billion Professional Business, leading 12,000 employees across 70 countries. He also held leadership positions at Philips Lighting India, HCL Infosystems, and Honeywell Automation India. Chitale is an IIT Delhi alumnus and recipient of the Director's Gold Medal. Upon Chitale's appointment, Vikram Kasbekar will step down from his role as Acting CEO and continue serving as Executive Director and Chief Technology Officer.",
            "Sentiment": "positive",
            "PublishDate": 1757302308864,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hero MotoCorp August Sales Rise 8% to 5.53 Lakh Units, Beats Estimates",
            "Summary": "Hero MotoCorp reported August sales of 5,53,727 units, representing an increase from 5,12,360 units in the same month last year. The sales figures exceeded market estimates of 5,30,300 units for the month.",
            "Sentiment": "positive",
            "PublishDate": 1756739087539,
            "Source": "stock"
        },
        {
            "Title": "Hero MotoCorp Chairman Supports Potential GST Cut on Two-Wheelers",
            "Summary": "Hero MotoCorp Chairman Pawan Munjal welcomed the government's decision for GST reforms and a possible reduction in GST rates on two-wheelers. He stated that lower GST would boost affordability and provide relief to first-time buyers, particularly in rural and semi-urban areas where two-wheelers are essential for personal mobility. Munjal emphasized that the two-wheeler industry is a key economic driver, contributing to government revenues and employment generation. Currently, two-wheelers up to 350cc are taxed at 28% GST, while those above 350cc face 28% GST plus 3% compensation cess. The GST Council meeting is scheduled for September 3-4 to discuss reforms that would restructure most goods to either 5% or 18% tax rates.",
            "Sentiment": "positive",
            "PublishDate": 1756718298595,
            "Source": "stock"
        },
        {
            "Title": "Hero MotoCorp Launches All-New Glamour X 125 Motorcycle with Advanced Technology Features",
            "Summary": "Hero MotoCorp launched the all-new Glamour X 125, positioned as India's most futuristic 125cc motorcycle. The motorcycle features several first-in-segment innovations including the world's first Low Battery Kick Startability powered by AERA (Advanced Electronic Ride Assist) Tech, Ride-by-Wire technology, Cruise Control, three ride modes (Eco, Road, Power), and Panic Brake Alert system. The bike is powered by a Sprint-EBT engine producing 11.4 BHP at 8250 RPM and comes with a Multi-Colour LCD instrument cluster with Bluetooth connectivity and Turn-by-Turn Navigation. The Glamour X 125 is available in two variants - Drum at INR 89,999 and Disc at INR 99,999 (ex-showroom Delhi). The company positions this launch as part of its strategy to expand reach across various sub-segments in the growing 125cc motorcycle market, building on the Glamour brand's legacy with over 8 million customers.",
            "Sentiment": "positive",
            "PublishDate": 1755615094778,
            "Source": "stock"
        },
        {
            "Title": "Hero MotoCorp Appoints Latika Taneja as Head of Corporate Communications and CSR",
            "Summary": "Hero MotoCorp, the world's largest manufacturer of motorcycles and scooters, appointed Ms. Latika Taneja as Head of Corporate Communications, Corporate Affairs, and Corporate Social Responsibility effective August 19, 2025. Taneja brings over 23 years of experience across corporate communications, government relations, and CSR, having held senior positions at Shell, Mastercard, DuPont, Alcatel-Lucent, and MetLife. She previously served as Head of Corporate Relations at Shell India. Executive Chairman Dr. Pawan Munjal stated her appointment comes at a transformative moment as the company shapes the future of mobility, and her expertise will strengthen stakeholder trust and drive sustainable growth. Taneja has been recognized among India's Top 100 Public Relations Professionals and received the Women Disruptor Award for Excellence in PR in 2019.",
            "Sentiment": "positive",
            "PublishDate": 1755575451754,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hero MotoCorp Reports Strong Q1 FY26 Performance with EV Market Share Reaching 7%",
            "Summary": "Hero MotoCorp reported quarterly revenue of ₹9,579 crores, EBITDA of ₹1,382 crores and PAT of ₹1,126 crores for Q1 FY26. The company's Vahan market share recovered to 30.9%, representing a sequential increase of 1%. EBITDA margin for ICE business improved to 16.8%, while overall EBITDA margin remained flat at 14.4% after accounting for ₹189 crores investment in EV business. The EV business achieved its highest quarterly market share of 7%, which further increased to over 10% in July. Average selling price increased 6% year-on-year driven by mix and price improvements. The company launched VIDA VX2 with Battery-as-a-Service model and HF Deluxe Pro with segment-first features. Consolidated PAT stood at ₹1,706 crores, including a one-time gain of ₹722 crores from dilution of investment in associate companies. Global business reported 27% dispatch growth year-on-year. The company expanded Premia channel to 90 stores covering over 40% of premium industry footprint.",
            "Sentiment": "positive",
            "PublishDate": 1755005538834,
            "Source": "earnings"
        },
        {
            "Title": "Hero MotoCorp Targets 40% Export Growth and 10% Global Revenue Share",
            "Summary": "Hero MotoCorp aims to boost exports by over 40% this year and plans to generate 10% of revenue from global business. The company achieved a record 7% market share in the EV segment, more than doubling year-over-year, with July share exceeding 10%. Hero MotoCorp expects 6-7% growth in the two-wheeler industry for the year, though Q1 retail growth was only 3-3.5%. EBITDA margins are anticipated to range between 14-16%, with short-term margins likely at the lower end. The company plans to introduce two new 125cc motorcycles in Q2 FY26 - one featuring advanced technology and another sporty variant. For Harley-Davidson, a new model is expected in Q2, with additional models planned for 2026.",
            "Sentiment": "positive",
            "PublishDate": 1754623558889,
            "Source": "stock"
        },
        {
            "Title": "Hero MotoCorp Reports Strong Growth in Electric Mobility and Global Operations",
            "Summary": "Hero MotoCorp executives reported strong growth in their electric mobility division (Vida) and global operations, which are outpacing industry standards. The company anticipates strong demand during the festive season supported by new product launches.",
            "Sentiment": "positive",
            "PublishDate": 1754490759006,
            "Source": "stock"
        },
        {
            "Title": "Hero MotoCorp Reports Mixed Q1 Results with Revenue Decline and Profit Growth",
            "Summary": "Hero MotoCorp announced its Q1 financial results showing mixed performance. The company's revenue declined to 95.79 billion rupees from 101.4 billion rupees year-over-year, falling short of the 97.22 billion rupee estimate. However, net profit increased to 11.26 billion rupees compared to 11.22 billion rupees in the previous year, exceeding the estimated 10.5 billion rupees. EBITDA decreased to 13.82 billion rupees from 14.6 billion rupees year-over-year, though it surpassed the 13.55 billion rupee estimate. EBITDA margin improved slightly to 14.42% from 14.39% year-over-year, but remained below the estimated 13.9%.",
            "Sentiment": "neutral",
            "PublishDate": 1754483861529,
            "Source": "earnings"
        },
        {
            "Title": "Hero MotoCorp Expected to Report Revenue and Profit Decline in Quarterly Results",
            "Summary": "Hero MotoCorp is expected to report declining financial performance in its quarterly results, with revenue projected to fall 6% year-on-year and net profit declining about 5% according to brokerage estimates. The weakness is attributed to volume declines of 11-12% to 1.37 million units, driven by production challenges in April and continued demand weakness in the entry-level 110cc motorcycle segment. While realizations are expected to rise 7-10% due to richer product mix, price hikes, and higher contribution from spare parts and exports, this is unlikely to offset the volume impact. Brokerages forecast EBITDA margin contractions ranging from 26-60 basis points, with margins expected between 13.8-14.1%. The pressure comes from weak ICE sales, higher EV contribution, product launch expenses, and lower operational scale. Key focus areas include management commentary on rural and entry-level segment demand outlook and updates on the company's EV roadmap.",
            "Sentiment": "negative",
            "PublishDate": 1754378599002,
            "Source": "earnings"
        },
        {
            "Title": "Hero MotoCorp Block Trade Worth Rs. 23.02 Crores Executed on NSE",
            "Summary": "Hero MotoCorp Ltd. witnessed a block trade on the National Stock Exchange involving approximately 50,432 shares at a price of Rs. 4,563.60 per share. The total transaction value amounted to Rs. 23.02 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1754373103289,
            "Source": "order&deals"
        },
        {
            "Title": "Hero MotoCorp Discontinues Mavrick 440 Motorcycle After 18 Months Due to Poor Sales",
            "Summary": "Hero MotoCorp has discontinued its premium motorcycle Mavrick 440 after launching it in early 2024. The company has stopped production and dispatches, with dealerships halting bookings. The motorcycle sold only 3,214 units in FY2025, significantly underperforming compared to the Harley-Davidson X440's 8,974 units on the same platform. Sales dropped to single digits by April 2025, with no units produced or shipped in the last three months. The bike was priced between Rs 2.00-2.25 lakh and featured a 440cc engine with 27 BHP. Experts cite weak marketing, uninspiring styling, and lack of aspirational value as reasons for failure. The discontinuation allows Hero to focus on the successful Harley X440 and potentially introduce new models on the same platform.",
            "Sentiment": "negative",
            "PublishDate": 1754372750989,
            "Source": "stock"
        }
    ]
}