{
    "Symbol": "HESTERBIO",
    "ISIN": "INE782E01017",
    "News": [
        {
            "Title": "Hester Biosciences Q3 FY26 Earnings Call Recording",
            "Summary": "Hester Biosciences makes Q3 FY26 earnings conference call audio recording available on company website following teleconference held on 30 January 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769769698509,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hester Biosciences Q3FY26 Results Call on Jan 30",
            "Summary": "Hester Biosciences Limited has scheduled an earnings conference call on January 30, 2026, at 2:00 PM IST to discuss Q3FY26 and nine-month financial results with senior management.",
            "Sentiment": "neutral",
            "PublishDate": 1769158983876,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hester Biosciences Appoints Ashish Desai as CFO and Updates KMP Authorization",
            "Summary": "Hester Biosciences' Board of Directors approved the appointment of Ashish Desai as Chief Financial Officer and Key Managerial Personnel, leading to changes in authorized KMPs for material disclosure determinations. The company updated its contact details for regulatory compliance under SEBI listing regulations, with Vinod Mali serving as the single point of contact for disclosure requirements.",
            "Sentiment": "positive",
            "PublishDate": 1763612763838,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hester Biosciences Reports Mixed Q2/H1 FY26 Results with 13% Revenue Decline in India Business",
            "Summary": "Hester Biosciences reported standalone sales of INR 64 crores in Q2 and INR 128 crores in H1 FY26, marking declines of 12% and 13% respectively, with EBITDA and net profit falling 13% and 15% for the half-year period. The company's Poultry Healthcare division showed growth of 18% in Q2 and 10% in H1, while Animal Healthcare declined 50% in Q2 due to delays in government immunization programs, though management expects improved performance in the second half driven by new facility capitalization and H9N2 vaccine commercialization.",
            "Sentiment": "neutral",
            "PublishDate": 1763136388584,
            "Source": "earnings"
        },
        {
            "Title": "Hester Biosciences CFO Divyesh Maru Resigns to Pursue Other Career Interests",
            "Summary": "Divyesh Maru has resigned from his position as Chief Financial Officer and Key Managerial Personnel at Hester Biosciences Limited, effective from the close of office hours on 13 November 2025. The resignation was submitted to pursue other career interests, with the company acknowledging his contributions during his tenure as CFO.",
            "Sentiment": "neutral",
            "PublishDate": 1763050487136,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hester Biosciences Reports Mixed Q2 Results with Standalone Revenue Down 12%, Consolidated Profit Up 71%",
            "Summary": "Hester Biosciences announced quarterly results with standalone divisional product sales declining 12% to INR 645.06 million and profit down 23% to INR 72.09 million. The Poultry Healthcare Division grew 18% driven by volume gains and sustained vaccine demand, while Animal Healthcare Division fell 50% due to delays in government immunisation programmes for PPR and Lumpy Skin Disease. On consolidated basis, revenue declined 15% to INR 709.69 million but profit surged 71% to INR 143.31 million. The company received market authorisation for H9N2 vaccine and expects institutional demand recovery in Q4. Hester Nepal reported net loss of INR 10.99 million while Hester Africa posted profit of INR 48.20 million. The company plans to reduce dependence on tender-based revenues and strengthen commercial markets.",
            "Sentiment": "neutral",
            "PublishDate": 1762927394916,
            "Source": "earnings"
        },
        {
            "Title": "Rajiv Gandhi Acquires 1,111 Hester Biosciences Shares as Gift from Dr. Bhupendra Gandhi",
            "Summary": "Rajiv Gandhi acquired 1,111 equity shares of Hester Biosciences Limited as a gift from Dr. Bhupendra Vithaldas Gandhi through an off-market transaction on September 4, 2025. The transaction represents an inter-se promoter transfer that does not change the overall promoter and promoter group holdings of the company. Following the acquisition, Rajiv Gandhi's shareholding increased from 10.47% to 10.48%, while Dr. Bhupendra Gandhi's holding decreased from 4.69% to 4.68%. The total promoter group shareholding remains unchanged at 53.73%. Hester Biosciences has an equity share capital of INR 8,50,68,650 divided into 85,06,865 equity shares of INR 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1757066632774,
            "Source": "corporate_action"
        },
        {
            "Title": "Hester Biosciences Passes All Six Resolutions at 38th AGM with Strong Shareholder Support",
            "Summary": "Hester Biosciences Limited conducted its 38th Annual General Meeting on August 13, 2025, via video conferencing from 10:33 a.m. to 11:22 a.m. All six resolutions were approved with requisite majority through electronic voting. The resolutions included adoption of standalone and consolidated financial statements for the year ended March 31, 2025, declaration of dividend on equity shares, re-appointment of Dr. Bhupendra Gandhi as Director, appointment of Secretarial Auditor, and ratification of Cost Auditors' remuneration for the year ending March 31, 2026. Out of 12,475 total shareholders as of the cut-off date of August 6, 2025, 54 shareholders attended the meeting via video conferencing. The voting saw strong support with most resolutions receiving 100% approval, while two resolutions (director re-appointment and secretarial auditor appointment) received 99.99% approval. Mr. Tapan Shah served as the scrutinizer to ensure fair and transparent voting process.",
            "Sentiment": "positive",
            "PublishDate": 1755075777367,
            "Source": "corporate_action"
        },
        {
            "Title": "Hester Biosciences Reports Mixed Q1 Results with Strong Africa Turnaround Despite India Business Headwinds",
            "Summary": "Hester Biosciences reported mixed quarterly results with standalone revenue declining 14% to INR 63 crores and PAT falling 7%, primarily due to delayed government immunization programs for PPR and lumpy skin disease in the Animal Health division. The Animal Health division saw a 33% decline due to deferred execution of large immunization programs, while the Poultry Healthcare division recorded modest 2% growth driven by Newcastle disease and Marek's vaccines. However, consolidated PAT grew over 100% driven by improved international performance. Hester Africa achieved a significant turnaround, posting INR 5 crores profit on INR 17 crores revenue compared to INR 3 crores revenue in the same quarter last year. The Tanzania facility has stabilized and the company is expanding presence in African markets with high demand for ruminant and poultry vaccines. Management expects institutional demand to normalize and growth to return in coming quarters, with the avian influenza vaccine launch pending regulatory clearances.",
            "Sentiment": "neutral",
            "PublishDate": 1754315616667,
            "Source": "earnings"
        },
        {
            "Title": "Hester Biosciences Reports Strong Q1 Performance with Net Profit Surging 160%",
            "Summary": "Hester Biosciences delivered robust quarterly results with revenue rising to Rs 841 million from Rs 823 million year-over-year. The company's consolidated net profit jumped significantly to Rs 164 million compared to Rs 63 million in the same period last year. EBITDA performance showed conflicting figures - one report indicated Rs 228 million versus Rs 176 million with margins at 27.13% versus 21.4%, while company statements showed Rs 262 million versus Rs 197 million with margins at 31% versus 24%. The company continues to focus on developing its Avian Influenza vaccine and expanding its feed supplement and disinfectant product portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1754031242336,
            "Source": "earnings"
        },
        {
            "Title": "Hester Biosciences Schedules Q1FY26 Earnings Conference Call for August 1, 2025",
            "Summary": "Hester Biosciences Limited has scheduled an earnings conference call for investors on August 1, 2025, at 2:00 p.m. IST to discuss financial results for the quarter ended June 30, 2025. The call will be held after the announcement of Q1FY26 results and will feature key executives including CEO & Managing Director Rajiv Gandhi, Executive Director Priya Gandhi, and Chief Financial Officer Divyesh Maru. ICICI Securities is coordinating the conference call with registration details provided for investor participation.",
            "Sentiment": "neutral",
            "PublishDate": 1753355402654,
            "Source": "earnings"
        },
        {
            "Title": "Hester Biosciences Declares Dividend and Reports Q4 Results",
            "Summary": "Hester Biosciences has declared a dividend of 7 rupees per share. The company also reported its Q4 consolidated net profit, which stands at 13 million rupees, down from 49.5 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1746771319000,
            "Source": "result"
        },
        {
            "Title": "Hester Biosciences Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Hester Biosciences, a pharmaceutical company, has reported a substantial increase in its consolidated net profit for the third quarter. The company's net profit rose to 117 million rupees, compared to 40 million rupees in the same period last year, representing a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738219107000,
            "Source": "earnings"
        },
        {
            "Title": "Hester Biosciences Reports Improved Q2 Financial Performance",
            "Summary": "Hester Biosciences, a pharmaceutical company, has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 192 million rupees, up from 132 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 22.94% from 18.72% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730098691000,
            "Source": "result"
        },
        {
            "Title": "Hester Biosciences Reports Strong Q2 Financial Results",
            "Summary": "Hester Biosciences, a pharmaceutical company, has announced its Q2 consolidated financial results. The company's net profit increased significantly to 84 million rupees, up from 41 million rupees in the same quarter last year. Revenue also saw growth, reaching 837 million rupees compared to 705 million rupees in the previous year's Q2.",
            "Sentiment": "positive",
            "PublishDate": 1730098589000,
            "Source": "result"
        }
    ]
}