{
    "Symbol": "HEXATRADEX",
    "ISIN": "INE750M01017",
    "News": [
        {
            "Title": "Hexa Tradex Reports Q3 FY26 Loss of ₹69.82 Lakhs",
            "Summary": "Hexa Tradex Limited posted a net loss of ₹69.82 lakhs for Q3 FY26 compared to profit of ₹442.41 lakhs in Q3 FY25. Revenue from operations increased to ₹2.01 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1770290252524,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hexa Tradex Board Meet Set for Feb 5 to Review Q3 Results",
            "Summary": "Hexa Tradex Ltd has scheduled a board meeting on February 05, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769594799909,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hexa Tradex CEO & CFO Neeraj Kanagat Steps Down",
            "Summary": "Hexa Tradex Limited announces resignation of CEO and CFO Mr. Neeraj Kanagat effective January 09, 2026, as part of PR Jindal Group restructuring and growth realignment strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1767871911447,
            "Source": "stocks"
        },
        {
            "Title": "HexaTradex Reports Net Loss of ₹163.54 Lakhs for Half-Year Ended September 2025",
            "Summary": "HexaTradex Limited reported a net loss of ₹163.54 lakhs for the half-year ended September 30, 2025, compared to a loss of ₹144.70 lakhs in the same period last year. The company's revenue from operations was minimal at ₹0.38 lakhs for the half-year. Total expenses reached ₹709.63 lakhs, primarily driven by employee benefit expenses of ₹90.70 lakhs and finance costs of ₹65.08 lakhs. The company operates in two business segments: trading and other activities, and investment and finance. The delisting process of the company's equity shares has been substantially completed, with final applications filed with BSE and NSE pending approval. SEBI had issued a Show Cause Notice in March 2024 alleging violations, with the matter still pending disposal. The Board meeting was held on November 12, 2025, to approve these quarterly results.",
            "Sentiment": "negative",
            "PublishDate": 1762971057496,
            "Source": "earnings"
        },
        {
            "Title": "Hexa Tradex Limited Reconstitutes Board Committees with New Leadership Structure",
            "Summary": "Hexa Tradex Limited reconstituted its Board committees effective August 14, 2025. The company restructured four key committees: Audit Committee (chaired by Shri Ravinder Nath Leekha), Stakeholders Relationship Committee (chaired by Shri Naresh Kumar Agarwal), Nomination and Remuneration Committee (chaired by Shri Ajit Kumar Hazarika), and Corporate Social Responsibility Committee (chaired by Shri Ravinder Nath Leekha). All committees comprise three members each, with the same three individuals - Shri Ravinder Nath Leekha, Shri Ajit Kumar Hazarika, and Shri Naresh Kumar Agarwal - serving across all committees in different capacities.",
            "Sentiment": "neutral",
            "PublishDate": 1754995615770,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hexa Tradex Ltd Announces Unaudited Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Hexa Tradex Ltd announced its unaudited financial results for the quarter ended June 30, 2025. The company's board meeting to approve the results was held on August 12, 2025, commencing at 2:20 PM and concluding at 3:20 PM. The results include both standalone and consolidated financial statements along with a limited review report by M/s Lodha & Co., Chartered Accountants, who serve as the company's statutory auditors. Company Secretary Pravesh Srivastava signed the announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1754993595148,
            "Source": "earnings"
        },
        {
            "Title": "SEBI Issues Administrative Warning to Hexa Tradex",
            "Summary": "Hexa Tradex Limited has received an administrative warning from the Securities and Exchange Board of India (SEBI). The details of the warning and the specific reasons for it have not been provided in the given news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1741851393000,
            "Source": "corporate_governance"
        }
    ]
}