{
    "Symbol": "HEXT",
    "ISIN": "INE093A01041",
    "News": [
        {
            "Title": "Hexaware Launches Zero License AI Offering",
            "Summary": "Hexaware Technologies announces Zero License, a new enterprise solution designed to help organizations replace SaaS workflows with agentic AI in months, targeting workflow-heavy industries like healthcare, insurance, and banking.",
            "Sentiment": "positive",
            "PublishDate": 1770724252132,
            "Source": "stocks"
        },
        {
            "Title": "Hexaware Q4CY25 Results Conference Call Set for Feb 5",
            "Summary": "Hexaware Technologies schedules investor presentation and conference call for February 05, 2026 to discuss Q4CY25 and full year 2025 financial results and performance.",
            "Sentiment": "neutral",
            "PublishDate": 1770219174573,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hexaware Tech Q3 Results: Revenue Up, Profit Down",
            "Summary": "Hexaware Technologies reports mixed Q3 results with consolidated revenue rising 10.5% YoY to ₹34.8 billion, while net profit declined 9.4% to ₹2.9 billion compared to previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1770218480021,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hexaware Gets Court Approval for Subsidiary Merger",
            "Summary": "Hexaware Technologies receives Amsterdam court approval for merger of subsidiaries Mobiquity Consulting B.V. into Mobiquity B.V., effective January 31, 2026, consolidating digital services operations.",
            "Sentiment": "positive",
            "PublishDate": 1769865902043,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hexaware Appoints Amit Vij as Chief Private Markets Officer",
            "Summary": "Hexaware Technologies announces appointment of Amit Vij as Chief Private Markets Officer to lead engagement across private equity, infrastructure, and debt funds ecosystem with over 20 years experience.",
            "Sentiment": "positive",
            "PublishDate": 1769605549178,
            "Source": "stocks"
        },
        {
            "Title": "Hexaware Technologies President Chinmoy Banerjee Resigns",
            "Summary": "Chinmoy Banerjee steps down as President & Global Head of Banking and North America Hunting Team at Hexaware Technologies, effective January 26, 2026, to explore other opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1768973917527,
            "Source": "stocks"
        },
        {
            "Title": "Hexaware Confirms Non-Large Corporate Status to SEBI",
            "Summary": "Hexaware Technologies disclosed to stock exchanges that it doesn't qualify as a Large Corporate under SEBI's debt securities framework, with zero outstanding borrowings as of December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767863934829,
            "Source": "stocks"
        },
        {
            "Title": "Hexaware Gets Approval for Subsidiary Merger",
            "Summary": "Hexaware Technologies receives approval for merger of subsidiaries Mobiquity Velocity Solutions Inc and Mobiquity Inc, effective January 1, 2026, streamlining operations.",
            "Sentiment": "positive",
            "PublishDate": 1767195619097,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hexaware Gets US Regulatory Approval for Subsidiary Merger",
            "Summary": "Hexaware Technologies received approval from New Jersey Division of Revenue for merger of Mobiquity Velocity Solutions Inc and Mobiquity Inc into Hexaware Technologies Inc, effective January 01, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1766072982262,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hexaware Appoints Raghu Mocherla as Senior VP",
            "Summary": "Hexaware Technologies announces the appointment of Raghu Mocherla as Senior Vice President-Digital Software to lead Cyber-Physical Software and Systems portfolio within the Digital Software business unit.",
            "Sentiment": "positive",
            "PublishDate": 1765881087935,
            "Source": "stocks"
        },
        {
            "Title": "Hexaware Technologies Launches New Delivery Center in Cairo with 100 Professionals",
            "Summary": "Hexaware Technologies has opened a new delivery center in Cairo with 100 professionals to serve customers in Egypt, the Middle East, and key European markets, offering multilingual customer experience services in Arabic, English, and major European languages. The center marks Hexaware's entry into a new geography and represents a significant expansion of its presence in Egypt, supporting the company's AI-led delivery model and broader strategy to build digital-first hubs across key global locations.",
            "Sentiment": "positive",
            "PublishDate": 1764825579050,
            "Source": "stock"
        },
        {
            "Title": "Hexaware Debuts Strongly in Whitelane Research 2025 German IT Sourcing Study",
            "Summary": "Hexaware Technologies made its first appearance in the Whitelane Research 2025 German IT Sourcing Study, ranking second in Innovation and fourth in both Transformation KPIs and Price Level based on direct client feedback. The study evaluated over 300 major organizations' feedback on 1,000+ IT sourcing relationships, with Hexaware's strong debut reflecting client recognition for its ability to support change and bring new technologies while maintaining competitive pricing.",
            "Sentiment": "positive",
            "PublishDate": 1764063428874,
            "Source": "stock"
        },
        {
            "Title": "HSBC Singapore Creates Security Charge Over 74.55% Stake in Hexaware Technologies",
            "Summary": "The Hongkong and Shanghai Banking Corporation Limited, Singapore Branch has created a Mauritian law fixed and floating charge over 45,39,88,884 equity shares (74.55%) of Hexaware Technologies held by promoter CA Magnum Holdings through CA Silkie Investments. This charge secures obligations under a USD 1.255 billion amended and restated facilities agreement with multiple international lenders, with provisions effective from November 17, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763986077640,
            "Source": "corporate_action"
        },
        {
            "Title": "Hexaware Allots 20 Lakh Shares to Employee Stock Option Trust",
            "Summary": "Hexaware Technologies' Board approved allotment of 20,00,000 equity shares at INR 382.5 per share to its Employee Stock Option Trust 2024, which will transfer these shares to employees upon option exercise. The company also modified the trust deed to reflect changes in trustee composition, with Jacob P joining as trustee and Nita Nambiar resigning from the position.",
            "Sentiment": "positive",
            "PublishDate": 1763741468473,
            "Source": "corporate_action"
        },
        {
            "Title": "SMC Squared Wins Dallas 100 Award for Third Time, Marking Sustained Growth in GCC Services",
            "Summary": "SMC Squared, part of Hexaware Technologies, has been named to the 2025 SMU Cox Dallas 100 list of fastest-growing privately held businesses for the third time, having previously won in 2021 and 2022. The recognition by SMU Cox School of Business honors companies with strong revenue growth over three years, reinforcing SMC Squared's position as a leader in Global Capability Center services and global talent strategies.",
            "Sentiment": "positive",
            "PublishDate": 1763735726156,
            "Source": "stock"
        },
        {
            "Title": "Hexaware Appoints Aditya Jayaraman as Country Head for India Operations",
            "Summary": "Hexaware Technologies appointed Aditya Jayaraman as Country Head for India to lead the company's India strategy and growth agenda for enterprises and global capability centers under the GCC 2.0 framework. Jayaraman brings 25+ years of experience across cloud, consulting, IT, data, and AI/ML, having previously served as technology leader for AWS's Hi-Tech vertical in North America and helped 150+ Fortune 1000 organizations with digital transformation.",
            "Sentiment": "positive",
            "PublishDate": 1763095205880,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hexaware Technologies Unable to Reach Settlement Through Mediation with Client",
            "Summary": "Hexaware Technologies announced that mediation efforts with a client have failed to produce a settlement. The company is now evaluating the initiation of legal proceedings to recover outstanding amounts owed by the client and reserves all legal rights and remedies. This follows a previous disclosure made on October 24, 2025, regarding the filing of a mediation application with a US-based mediation agency to resolve the client dispute.",
            "Sentiment": "negative",
            "PublishDate": 1762910891599,
            "Source": "stock"
        },
        {
            "Title": "Hexaware Technologies Launches Two Insurance Solutions with Google Cloud Partnership",
            "Summary": "Hexaware Technologies has unveiled two new insurance solutions developed in partnership with Google Cloud. The technology company has expanded its insurance sector offerings through this collaboration with the cloud services provider.",
            "Sentiment": "positive",
            "PublishDate": 1762861900263,
            "Source": "stock"
        },
        {
            "Title": "Hexaware Reports Q3 2025 Revenue Growth and Announces CyberSolve Acquisition",
            "Summary": "Hexaware Technologies reported Q3 2025 revenue of USD 394.8 million, up 5.5% year-over-year, with EBITDA margin expanding 154 basis points to 17.5%. The company announced the acquisition of CyberSolve and related entities for USD 66 million to strengthen its cybersecurity capabilities in Identity and Access Management. The board also approved subsidiary mergers in India, US, and Netherlands to simplify group structure. Revenue performance varied by vertical, with Financial Services growing 12.2% and High Tech declining 10.1% year-over-year. The company maintains a strong cash position of INR 20,201 million.",
            "Sentiment": "positive",
            "PublishDate": 1762476669715,
            "Source": "earnings"
        },
        {
            "Title": "Hexaware Tech Subsidiary Softcrylic Technologies Inc to Liquidate Voluntarily",
            "Summary": "Hexaware Technologies' subsidiary, Softcrylic Technologies Inc, has decided to proceed with voluntary liquidation. The decision affects the subsidiary operations under Hexaware's corporate structure.",
            "Sentiment": "negative",
            "PublishDate": 1761834106254,
            "Source": "corporate_action"
        },
        {
            "Title": "Hexaware Technologies Faces Patent Lawsuit from Natsoft, Denies Claims",
            "Summary": "Hexaware Technologies has responded to a patent lawsuit filed by Natsoft, describing the lawsuit as unfounded. The company has denied all claims made in the lawsuit. Hexaware anticipates that the legal action will not have any significant impact on its operations or financial health.",
            "Sentiment": "neutral",
            "PublishDate": 1761578371364,
            "Source": "stock"
        },
        {
            "Title": "Hexaware Technologies Enters Mediation Over $9 Million European Client Receivables",
            "Summary": "Hexaware Technologies has initiated mediation proceedings with a European client regarding $9 million in receivables. The company expects a positive outcome from the mediation process and indicates there is no associated risk.",
            "Sentiment": "positive",
            "PublishDate": 1761290905828,
            "Source": "stock"
        },
        {
            "Title": "Hexaware Technologies Appoints Eravi Gopan as President and Global Head of High Tech, Products, and Platforms",
            "Summary": "Hexaware Technologies announced the appointment of Eravi Gopan as President and Global Head – High Tech, Products, and Platforms. Gopan will lead the company's global strategy, growth, and client success initiatives across this vertical. He brings extensive experience in SaaS, AI, and technology services, having previously served as Chief Revenue Officer at a Google Ventures-backed SaaS platform and Chief Commercial Officer of an Accel Ventures-backed enterprise AI startup. Gopan also spent significant time at Wipro, where he built several businesses across industry verticals and served as Global Business Head for Platforms and Software Products. CEO R Srikrishna stated that Gopan's expertise in SaaS and AI leadership across startups and large enterprises aligns with client needs as platform partnerships and AI-driven delivery become standard. The appointment reflects Hexaware's focus on strengthening domain leadership and scaling vertical-centric growth to address evolving client needs.",
            "Sentiment": "positive",
            "PublishDate": 1761223964536,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hexaware Technologies Completes Voluntary Liquidation of Stepdown Subsidiary Hexaware Nevada",
            "Summary": "Hexaware Technologies Limited announced the voluntary liquidation of its stepdown subsidiary, Hexaware Nevada, Inc, effective October 16, 2025. The company received confirmation of the liquidation on October 17, 2025. The subsidiary had nil revenue from operations and nil net worth as of December 31, 2025. The transaction was undertaken to rationalize the group structure. The liquidation was disclosed to stock exchanges NSE and BSE in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1760704759598,
            "Source": "corporate_action"
        },
        {
            "Title": "Hexaware Technologies Announces Senior Management Changes with New CPO, AI Practice Head, and Hi-Tech Vertical President",
            "Summary": "Hexaware Technologies announced three key senior management appointments. Hariharan Srinivasan, Executive Vice President - HR, will serve as interim Chief People Officer starting November 16, 2025, replacing Nita Nambiar who ceases to be CPO on November 15, 2025. Nambiar resigned to pursue other career interests. Siddharth Dhar, President and head of Digital IT Operations, will additionally head the AI Practice effective October 14, 2025. Eravi Gopan has been appointed as President and head of Hi-Tech Vertical effective October 20, 2025. Srinivasan brings 30 years of HR experience in workforce planning and employee engagement. Dhar has over two decades of experience in technology and digital transformation, focusing on AI operations and automation. Gopan is a global technology executive with over 25 years of experience in building high-growth businesses and holds degrees from CUSAT and NITIE/IIM Mumbai.",
            "Sentiment": "neutral",
            "PublishDate": 1760424880239,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hexaware Technologies, RCF, and Sacheta Metals Set Dividend Record Date",
            "Summary": "Three companies have set October 9 as the last trading day for investors to purchase shares and qualify for announced dividends, with ex-date falling on October 10. Hexaware Technologies declared an interim dividend of 575%, equivalent to Rs 5.75 per share. Rashtriya Chemicals & Fertilizers announced a final dividend of 13.2%, amounting to Rs 1.32 per share. Sacheta Metals declared an interim dividend of 2.5%, translating to Rs 0.05 per share. Investors purchasing shares on or after October 10 will not be entitled to receive these dividend payouts.",
            "Sentiment": "neutral",
            "PublishDate": 1759978633003,
            "Source": "corporate_action"
        },
        {
            "Title": "Hexaware Faces $500M Patent Infringement Lawsuit from Natsoft Corp in US",
            "Summary": "Hexaware is facing a $500 million lawsuit in the United States filed by Natsoft Corp for patent infringement. The legal action represents a significant financial exposure for the company.",
            "Sentiment": "negative",
            "PublishDate": 1759462885703,
            "Source": "stock"
        },
        {
            "Title": "Hexaware Technologies Declares Second Interim Dividend of ₹5.75 Per Share for FY2025",
            "Summary": "Hexaware Technologies Limited announced a second interim dividend of ₹5.75 per equity share for financial year 2025. The Board of Directors made this declaration during their meeting held on October 01, 2025. The record date for dividend eligibility is October 10, 2025, and the dividend payment is scheduled for October 18, 2025. Shareholders whose names appear in the Register of Members or Depositories on the record date will be eligible to receive the dividend.",
            "Sentiment": "positive",
            "PublishDate": 1759329020853,
            "Source": "corporate_action"
        },
        {
            "Title": "Natsoft Sues Hexaware Technologies for $500 Million Over Patent Infringement",
            "Summary": "US-based technology company Natsoft has filed a lawsuit against Hexaware Technologies in US District Court, seeking $500 million in damages. Natsoft alleges patent infringement and breach of contract, claiming its subsidiary Updraft spent $100 million developing app modernisation solutions and holds nine valid patents for the technology. The company accuses Hexaware's products of infringing on these patents in an ongoing, intentional, and willful manner. Natsoft also alleges Hexaware breached a contract with Updraft by using its technology to build competing products, resulting in unjust enrichment. The company has requested a jury trial.",
            "Sentiment": "negative",
            "PublishDate": 1759300675790,
            "Source": "stock"
        },
        {
            "Title": "Hexaware Technologies Incorporates Wholly Owned Subsidiary in Colombia",
            "Summary": "Hexaware Technologies Limited has incorporated a wholly owned subsidiary named Hexaware Technologies Colombia S.A.S. in Colombia on September 26, 2025. The subsidiary was incorporated under Colombian Law 1258 of December 5, 2008, with approval from the Bogota Chamber of Commerce. The new entity has a share capital of COP 1,000,000 (One Million Colombian Peso) divided into one million shares with a nominal value of COP 1 each. The subsidiary will operate in the Information Technology and Information Technology Enabled Services sector. Hexaware Technologies Limited holds 100% ownership of the Colombian entity.",
            "Sentiment": "positive",
            "PublishDate": 1758951761385,
            "Source": "stock"
        },
        {
            "Title": "Hexaware Technologies Schedules Board Meeting to Consider Second Interim Dividend",
            "Summary": "Hexaware Technologies Limited has scheduled a Board of Directors meeting on October 1, 2025, to consider the declaration of a second interim dividend for the financial year 2025. The company notified stock exchanges BSE and NSE about the upcoming board meeting through a regulatory communication dated September 25, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758819058194,
            "Source": "corporate_action"
        },
        {
            "Title": "Hexaware Technologies Achieves 97th Percentile Ranking in S&P Global Corporate Sustainability Assessment",
            "Summary": "Hexaware Technologies scored 83 out of 100 in the S&P Global Corporate Sustainability Assessment as of September 15, 2025, placing the company in the 97th percentile of its industry. The industry average score is 34 out of 100. The assessment evaluates companies across Environmental, Social, Governance, and Economic dimensions. Hexaware demonstrated strong performance in Human Capital Management, Climate Strategy, and Corporate Governance, with the Social dimension contributing most to the result. The company provided 97 percent of required and additional ESG disclosures with no recent controversies affecting its standing. CEO R Srikrishna stated the score reflects how the company operates, while Chief Risk Officer Uma Thomas noted that ESG is integrated into their risk framework and operating processes.",
            "Sentiment": "positive",
            "PublishDate": 1758607497119,
            "Source": "stock"
        },
        {
            "Title": "Hexaware Technologies Reports Immaterial Impact from U.S. H1B Visa Fee Changes",
            "Summary": "Hexaware Technologies announced that recent U.S. H1B visa regulation changes, including increased fees for new visa petitions, are expected to have an immaterial impact on the company. The firm has been reducing its dependency on H1B filings over recent years and did not make any fresh applications under the H-1B cap in April 2025. The company anticipates no material financial or operational impact from these regulatory changes. Hexaware continues to focus on hiring local talent and maintains the ability to adjust global talent deployment strategies in line with changing regulations to ensure continuity of client service and operational resilience.",
            "Sentiment": "neutral",
            "PublishDate": 1758523697803,
            "Source": "stock"
        },
        {
            "Title": "Hexaware Technologies Gains 5% on US Rate Cut Expectations and Weak Rupee",
            "Summary": "Hexaware Technologies stock rose over 5% in seven trading sessions since September 5, outperforming the ET Infotech index's 3% gain. The rally was driven by a weaker rupee and expected US Federal Reserve rate cuts that may boost technology spending by US clients. The company reported modest sequential revenue growth of 1.3% in constant currency during the June quarter, impacted by reduced spending from a large client. The manufacturing and consumer vertical faced challenges due to macroeconomic factors and tariff uncertainties, while the banking vertical showed strong 13.8% sequential growth. Hexaware improved its offshore services share to 46.7% and employee utilization to 83.7%, leading to operating margin expansion of 70 basis points sequentially to 17.3%. The company maintains revenue guidance and analysts retain buy ratings despite reducing growth estimates, with JM Financial cutting 2026 revenue growth forecast to 7% from 9%.",
            "Sentiment": "positive",
            "PublishDate": 1758070380849,
            "Source": "stock"
        },
        {
            "Title": "Hexaware Technologies Receives 83/100 ESG Score from S&P Global",
            "Summary": "Hexaware Technologies Limited received an ESG score of 83 out of 100 from S&P Global. The rating places the highest weighting on the Social Dimension, followed by Governance & Economic Dimension, and Environmental Dimension. The company has informed stock exchanges NSE and BSE about this ESG rating and will host this information on its website.",
            "Sentiment": "positive",
            "PublishDate": 1758013625999,
            "Source": "stock"
        },
        {
            "Title": "Hexaware Technologies Wins 13 Awards at 2025 Brandon Hall Group HCM Excellence Awards",
            "Summary": "Hexaware Technologies secured 13 medals at the 2025 Brandon Hall Group HCM Excellence Awards, comprising eight gold, four silver, and one bronze awards. The recognition spans multiple categories including leadership development, talent acquisition, employee engagement, and learning programs. Gold awards were received for programs including Best Certification Program Learning (SONIC), Best Leadership Development Program (OD), and Best Employee Engagement Program (Mavericks). HexaVarsity, the company's corporate university, integrates three pathways: SONIC for role-based certification, organizational development for leadership, and Mavericks for early-career talent acceleration. The awards recognize best practices in learning and development, talent management, and human resources across various categories.",
            "Sentiment": "positive",
            "PublishDate": 1757420714313,
            "Source": "stock"
        },
        {
            "Title": "Hexaware Technologies Achieves Gold Sustainability Rating from EcoVadis, Ranks in Top 5% Globally",
            "Summary": "Hexaware Technologies received a gold sustainability rating from EcoVadis, with its overall score increasing to 82 from 70 last year. This upgrade from Silver to Gold places the company in the 98th percentile of all companies assessed by EcoVadis in the past 12 months, positioning it among the top 5% of companies worldwide for sustainability performance. The rating improvement reflects stronger evidence of policy, action, and measurable results across EcoVadis's assessment criteria. Hexaware has strengthened its sustainability program through enhanced board oversight, clear ownership, better evidence controls, and independent review. The company is focusing on low-carbon operations, labor and human rights practices, governance and data protection, and responsible sourcing in procurement. EcoVadis evaluates companies against 21 criteria grouped under four themes: Environment, Labor and Human Rights, Ethics, and Sustainable Procurement. Hexaware plans to continue strengthening its approach with deeper value-chain engagement, sharper KPI tracking, and regular third-party benchmarking.",
            "Sentiment": "positive",
            "PublishDate": 1756967988844,
            "Source": "stock"
        },
        {
            "Title": "Hexaware Technologies Achieves AWS Premier Tier Partner Status",
            "Summary": "Hexaware Technologies has achieved AWS Premier Tier Partner Status, which strengthens the company's cloud modernization capabilities. This partnership status enhances Hexaware's position in providing cloud services and solutions to its clients.",
            "Sentiment": "positive",
            "PublishDate": 1756814086685,
            "Source": "stock"
        },
        {
            "Title": "Hexaware Technologies Partners with Replit for Secure Enterprise Coding Solutions",
            "Summary": "Hexaware Technologies announced a strategic partnership with Replit to revolutionize enterprise software development through secure, governed Vibe Coding. The collaboration combines Hexaware's digital innovation capabilities with Replit's natural language-powered development platform, enabling business users and engineers to rapidly build secure, production-grade applications. The partnership allows teams beyond IT—including Product, Design, Sales, and Operations—to create internal tools and prototypes without traditional coding skills. Key features include democratized software development, secure Vibe Coding with SSO and SOC2 compliance, faster innovation through rapid prototyping, custom internal tool development, and agentic AI for enterprise builders. The partnership aims to accelerate development cycles while maintaining enterprise-grade governance and security protocols.",
            "Sentiment": "positive",
            "PublishDate": 1756382226733,
            "Source": "stock"
        },
        {
            "Title": "Hexaware Technologies Launches Agentic AI Academy with upGrad to Transform AI Workforce",
            "Summary": "Hexaware Technologies announced the launch of Agentic AI Academy in partnership with upGrad Enterprise to prepare its global workforce for autonomous AI systems. The initiative builds on two years of generative AI training, during which 95% of employees received GenAI training. The academy focuses on developing expertise in Agentic AI systems - autonomous software agents that plan, act, and adapt in real time. Hexaware plans to onboard a majority of its delivery and engineering teams through the academy over the coming months as it expands Agentic service offerings. The program offers four learning categories: Builder.AI for developers, Collaborator.AI for teams adapting agent solutions, and Manage.AI for delivery leaders managing agent-human interactions. Participants from initial batches are already engaging in live Agentic assignments. The training content is co-designed with upGrad Enterprise and delivered through their platform, combining content, labs, and certifications.",
            "Sentiment": "positive",
            "PublishDate": 1755596556448,
            "Source": "stock"
        },
        {
            "Title": "Hexaware Reports 8.6% Revenue Growth but Lowers Full-Year Expectations Due to Delayed Client Decision-Making",
            "Summary": "Hexaware Technologies reported quarterly revenue growth of 8.6% year-over-year, with reported EBITDA at 17.2%. The company achieved strong performance in Financial Services (16% growth) and Banking (13.5% sequential growth), while Manufacturing & Consumer faced an 11.5% decline due to macro headwinds. CEO R Srikrishna cited delayed decision-making from customers as the primary factor affecting growth, with four mega consolidation deals still in progress but not finalized. The company completed the acquisition of SMC to strengthen its Global Capability Center (GCC) setup services, which will be EPS accretive from day one. Despite lowering near-term growth expectations, Hexaware maintains its long-term target of $3 billion revenue by calendar year 2029. The quarter included several one-time items totaling a 15 basis points headwind, including a $9 million provision for a European client in financial distress and restructuring costs of $3.8 million. Utilization improved to 83.7% from 82.1% in the previous quarter, and the company added 850 net employees during the period.",
            "Sentiment": "neutral",
            "PublishDate": 1753976994125,
            "Source": "earnings"
        },
        {
            "Title": "Hexaware Technologies Appoints Shantanu Baruah as President & Global Head of Healthcare & Insurance Vertical",
            "Summary": "Hexaware Technologies Limited appointed Shantanu Baruah as President & Global Head - Healthcare & Insurance Vertical, effective August 1, 2025. This is a Senior Management Personnel position. Baruah brings over 25 years of experience in healthcare, life sciences, digital transformation, and information management. He previously served as Executive Vice President leading the Americas Healthcare business unit at HCL Tech, where he managed major global accounts and directed digital practice operations. His career spans leadership roles across India, Singapore, France, and the United States. Baruah has authored numerous papers on healthcare technology and published two books on iOS technology through Springer. The IT Services Report recognized him among the Top 25 and Top 50 Healthcare IT Executives for 2020 and 2022 respectively. He is not related to any Board member of the company.",
            "Sentiment": "positive",
            "PublishDate": 1753965634400,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hexaware Technologies Named Emerging Leader in Gartner's 2025 Generative AI Consulting Guide",
            "Summary": "Hexaware Technologies has been positioned as an Emerging Leader in the Emerging Market Quadrant of the 2025 Gartner Innovation Guide for Generative AI Consulting and Implementation Services. The recognition highlights Hexaware's ability to convert generative AI pilots into enterprise-scale solutions that create measurable business value. The company has developed a cloud-agnostic GenAI fabric featuring modular micro-services, zero-trust security, and guardrails for fairness and transparency. This platform enables enterprises to deploy LLM workloads at scale across public cloud, private clusters, or edge environments while maintaining data sovereignty and auditable operations. Hexaware's approach focuses on delivering production-ready generative AI solutions with quantifiable business impact, emphasizing security and compliance. The company's GenAI practice combines industry-specific starter kits, secure accelerators, and a Responsible AI framework covering consulting, build, and managed-service phases.",
            "Sentiment": "positive",
            "PublishDate": 1753457504965,
            "Source": "stock"
        },
        {
            "Title": "Hexaware Technologies Reports 38% Profit Jump But Misses Estimates, Lowers Growth Expectations",
            "Summary": "Hexaware Technologies reported a 38% year-over-year increase in net profit to Rs 380 crore for the June quarter, though this fell short of market expectations. Revenue grew 11.1% annually to Rs 3,260 crore but also missed estimates. The profit shortfall was attributed to over 20% increase in other expenses including acquisition-related costs and customer contract impairment. Revenue growth faced headwinds from declining manufacturing and consumer segments, while financial services remained flat. The company lowered its growth expectations for the year, citing macro environment softness and slower decision-making in small and mid-sized deals. Geographically, Europe showed growth while Asia Pacific declined year-over-year. Hexaware acquired SMC Squared for $120 million to serve global capability center customers in India. Shares fell 10.7% following the earnings announcement, significantly underperforming the broader market.",
            "Sentiment": "negative",
            "PublishDate": 1753454391138,
            "Source": "earnings"
        },
        {
            "Title": "Hexaware Tech Plans Colombia Expansion with $2 Million Investment",
            "Summary": "Hexaware Tech announced plans to establish a new unit in Colombia with an initial investment of up to $2 million. The investment will be distributed across one or more installments as the company expands its operations into the Colombian market.",
            "Sentiment": "positive",
            "PublishDate": 1753411776834,
            "Source": "stock"
        },
        {
            "Title": "Hexaware Technologies Reports Revenue Growth Miss and Margin Decline in Q2 Results",
            "Summary": "Hexaware Technologies reported quarterly earnings with revenue growth in constant currency terms at 1.3%, missing estimates of 2.5%. Other expenses surged to ₹142 crore from ₹8.7 crore in the base quarter, including ₹78.2 crore in customer provisions, ₹12 crore for ERP transformation costs, ₹12.8 crore in acquisition-related costs, and ₹39.4 crore for customer contract impairment. EBITDA declined to ₹404 crore from ₹431 crore last year and ₹527.8 crore in March, with reported EBITDA margins dropping to 12.4% from 16.5% in March and 14.7% last year. The company maintains its full-year EBITDA margin guidance of 17.1% to 17.4%. Management noted that large consolidation deals remain in progress while small and mid-sized deals are advancing, though decision-making has slowed, leading to lower expectations for the remainder of the year. Shares closed 4% lower at ₹826.8.",
            "Sentiment": "negative",
            "PublishDate": 1753408082385,
            "Source": "earnings"
        },
        {
            "Title": "Hexaware Technologies Reports Growth in Q1 Net Profit and Revenue",
            "Summary": "Hexaware Technologies reported consolidated net profit of 3.8 billion rupees in Q1, up from 3.27 billion rupees in the previous quarter. The company's revenue increased to 32.6 billion rupees compared to 32.07 billion rupees quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753375872355,
            "Source": "earnings"
        },
        {
            "Title": "Hexaware Technologies Approves Financial Results and Plans Colombia Subsidiary",
            "Summary": "Hexaware Technologies' Board of Directors approved standalone and consolidated audited financial results for the quarter and half year ended June 30, 2025. The board also approved changing the company's registered office address effective August 1, 2025, from Millennium Business Park in Mahape to Q1, Loma Co-Developers Private Limited in Ghansoli, Navi Mumbai. Additionally, the board approved incorporating a wholly owned subsidiary in Colombia with an initial investment of up to USD 2 million in one or more tranches. The board meeting was held on July 24, 2025, lasting from 6:40 p.m. to 7:44 p.m. IST.",
            "Sentiment": "positive",
            "PublishDate": 1753374766406,
            "Source": "earnings"
        },
        {
            "Title": "Hexaware Technologies to Acquire Tech SMC Square India and Tech SMC Squared (GCC) India",
            "Summary": "Hexaware Technologies has announced plans to acquire two companies: Tech SMC Square India and Tech SMC Squared (GCC) India. The total acquisition cost is reported to be up to USD 120 million, which is equivalent to approximately 10.3 billion Indian Rupees.",
            "Sentiment": "positive",
            "PublishDate": 1752723576000,
            "Source": "default"
        },
        {
            "Title": "Hexaware Technologies: Acquires GCC-Focused Firms for ₹1,029 Crore",
            "Summary": "Hexaware Technologies to acquire Tech SMC Square India and Tech SMCSquared (GCC) India for up to $120 million. The all-cash deal includes $45 million upfront, with potential earnouts. Acquisition aims to expand Hexaware's GCC capabilities and market presence.",
            "Sentiment": "positive",
            "PublishDate": 1752723288000,
            "Source": "corporate_action"
        }
    ]
}