{
    "Symbol": "HGINFRA",
    "ISIN": "INE926X01010",
    "News": [
        {
            "Title": "HG Infra Engineering Q3 FY26 Earnings Call on Feb 13",
            "Summary": "HG Infra Engineering Limited has scheduled its Q3 & 9M FY26 earnings conference call for February 13, 2026, at 4:00 PM IST to discuss financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770659966740,
            "Source": "co_actions_results"
        },
        {
            "Title": "HG Infra gets ICRA rating amid CBI probe concerns",
            "Summary": "ICRA maintains AA- (Positive) rating for HG Infra Engineering's Rs 4,900 crore facilities despite recent CBI search operations and employee arrests on bribery allegations in January 2026.",
            "Sentiment": "negative",
            "PublishDate": 1770030589969,
            "Source": "stocks"
        },
        {
            "Title": "HG Infra faces CBI, ACB search operations at offices",
            "Summary": "HG Infra Engineering reported search operations by CBI and ACB at its corporate office, regional office, and project site on January 21, 2026, with business operations continuing as usual.",
            "Sentiment": "negative",
            "PublishDate": 1769096388325,
            "Source": "stocks"
        },
        {
            "Title": "HG Infra Gets Appointed Date for ₹763cr Highway Project",
            "Summary": "HG Infra Engineering's subsidiary receives appointed date of January 16, 2026 for ₹763.11 crore highway project in Uttar Pradesh under Hybrid Annuity Mode covering 63.84 km stretch. Q2 net profit declined 35.4% YoY to ₹52.10 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1768581400109,
            "Source": "stocks"
        },
        {
            "Title": "HG Infra Gets ₹154.55 Cr IT Demand Notice for AY 2018-19",
            "Summary": "H.G. Infra Engineering receives income tax demand notice of ₹154.55 crores including interest for assessment year 2018-19. Company plans to file appeal against the demand notice.",
            "Sentiment": "negative",
            "PublishDate": 1767706778707,
            "Source": "stocks"
        },
        {
            "Title": "HG Infra Engineering Head Strategy Resigns",
            "Summary": "H.G. Infra Engineering Limited announces resignation of Mr. Abhishek Goenka, Head – Strategy, effective January 05, 2026, citing personal reasons for departure from senior management position.",
            "Sentiment": "neutral",
            "PublishDate": 1767618769344,
            "Source": "stocks"
        },
        {
            "Title": "HG Infra Engineering CHRO Rachna Mohan Resigns",
            "Summary": "Chief Human Resource Officer Rachna Mohan submits resignation from HG Infra Engineering citing personal family commitments, with effective date of December 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767099384560,
            "Source": "stocks"
        },
        {
            "Title": "G.G. Engineering Director-Operations Ravi Prakash Resigns",
            "Summary": "G.G. Engineering Limited announces resignation of Mr. Ravi Prakash, Director-Operations and Senior Management Personnel, effective December 24, 2025, due to personal reasons.",
            "Sentiment": "neutral",
            "PublishDate": 1766574024000,
            "Source": "stocks"
        },
        {
            "Title": "HG Infra Engineering President Railways Metro Resigns",
            "Summary": "H.G. Infra Engineering announces resignation of Mr. Neeraj Kumar Bansal, President-Railways Metro, effective December 16, 2025, due to personal reasons and family issues.",
            "Sentiment": "neutral",
            "PublishDate": 1765890512073,
            "Source": "stocks"
        },
        {
            "Title": "HG Infra Engineering Clears Tax Department Show Cause Notice Without Any Demand",
            "Summary": "HG Infra Engineering announced that the Tax Department has concluded a show cause notice without raising any demand against the company. This resolution eliminates potential tax liability concerns for the infrastructure company and its stakeholders.",
            "Sentiment": "positive",
            "PublishDate": 1765284364534,
            "Source": "stock"
        },
        {
            "Title": "HG Infra Engineering Secures Battery Energy Storage System Contract with Gujarat Urja Vikas Nigam",
            "Summary": "HG Infra Engineering has signed a deal with Gujarat Urja Vikas Nigam for a Battery Energy Storage System project. This contract expands the company's presence in the renewable energy storage sector and strengthens its business relationship with Gujarat's power development corporation.",
            "Sentiment": "positive",
            "PublishDate": 1764336267799,
            "Source": "stock"
        },
        {
            "Title": "H.G. Infra Engineering Receives GST Show Cause Notice Worth Rs. 220 Crores",
            "Summary": "H.G. Infra Engineering Limited received a show cause notice from the GST Department on November 25, 2025, for alleged wrongful input tax credit availment and under-reporting of supply in GST returns for financial year 2022-23, amounting to Rs. 220.04 crores. The company states there is no immediate impact on operations and plans to file a response with proper documentation, expecting a favorable outcome based on legal counsel advice.",
            "Sentiment": "negative",
            "PublishDate": 1764144776678,
            "Source": "stock"
        },
        {
            "Title": "H.G. Infra Engineering Appoints Col Satyajeet Ghoshal as Chief of Staff",
            "Summary": "H.G. Infra Engineering Limited has appointed Col Satyajeet Ghoshal as Chief of Staff, categorized as Senior Management Personnel, effective from December 10, 2025. The appointee brings over 31.5 years of cross-sector experience spanning Indian Army and corporate leadership with the Adani Group, including expertise in directing complex operations and organizational transformation.",
            "Sentiment": "positive",
            "PublishDate": 1763987944358,
            "Source": "corporate_governance"
        },
        {
            "Title": "HG Infra Engineering JV with Kalpataru Projects Wins Rs 14.15 Billion Project Bid",
            "Summary": "HG Infra Engineering's joint venture with Kalpataru Projects International has been declared the L-1 bidder for a project valued at Rs 14.15 billion. This significant contract win affects both companies and represents a substantial business opportunity in their infrastructure development portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1763942749201,
            "Source": "order&deals"
        },
        {
            "Title": "H.G. Infra Engineering Wins Rs 1,415 Crore Metro Project Contract",
            "Summary": "H.G. Infra Engineering Limited has been declared L-1 bidder by Maharashtra Metro Rail Corporation Limited for a Rs 1,415 crore elevated metro viaduct project in joint venture with Kalpataru Projects International Limited. The company holds a 40% stake in the joint venture for the 20.527 km Design and Construction project between UG Ramp and Balkum Naka with a 36-month execution timeline.",
            "Sentiment": "positive",
            "PublishDate": 1763723328346,
            "Source": "order&deals"
        },
        {
            "Title": "H.G. Infra Engineering Incorporates Wholly Owned Subsidiary for Clean Energy Business",
            "Summary": "H.G. Infra Engineering Limited incorporated H.G. Clean Energy Solutions Private Limited on November 20, 2025, as a wholly owned subsidiary with authorized and subscribed capital of Rs. 15 lakh. The subsidiary will focus on business activities related to solar, green hydrogen, and battery energy storage systems.",
            "Sentiment": "positive",
            "PublishDate": 1763633130321,
            "Source": "stock"
        },
        {
            "Title": "H.G. Infra Engineering Secures Rs 274.11 Crore Infrastructure Contract from DLF Cyber City Developers",
            "Summary": "H.G. Infra Engineering Limited received an order worth Rs 274.11 crore from DLF Cyber City Developers Limited for executing infrastructure and access road network works at DLF Downtown Phase-2 project in Gurugram, Haryana. The project has a completion timeline of 548 days and represents a significant contract win for the infrastructure company in the real estate development sector.",
            "Sentiment": "positive",
            "PublishDate": 1763544546591,
            "Source": "order&deals"
        },
        {
            "Title": "HG Infra Engineering Reports 35% Decline in Q2 Net Profit Despite Stable Revenue",
            "Summary": "HG Infra Engineering reported Q2 consolidated net profit of 522 million rupees, down from 807 million rupees in the same period last year. Revenue remained relatively flat at 9.04 billion rupees compared to 9.02 billion rupees year-over-year. EBITDA decreased to 2.06 billion rupees from 2.2 billion rupees, while EBITDA margin compressed to 22.8% from 24.33% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762955230069,
            "Source": "earnings"
        },
        {
            "Title": "H.G. Infra Engineering Executes Sale Agreement for Wholly Owned Subsidiary",
            "Summary": "H.G. Infra Engineering Limited has executed a Securities Purchase Agreement on November 6, 2025, with Neo Infra Income Opportunities Fund to sell its 100% shareholding in H.G. Raipur Visakhapatnam OD-6 Private Limited, a wholly owned subsidiary. The transaction follows an earlier announcement made on August 13, 2025, with required regulatory details previously disclosed at that time.",
            "Sentiment": "neutral",
            "PublishDate": 1762446361110,
            "Source": "order&deals"
        },
        {
            "Title": "H.G. Infra Engineering Receives Income Tax Notice for Rs 1.42 Crore Compounding Charges",
            "Summary": "H.G. Infra Engineering Limited received an intimation from the Deputy Commissioner of Income Tax Department, Circle-TDS, Jodhpur for deposition of compounding charges. The Income Tax Department has approved to compound the offence under section 279(2) of the Income Tax Act, 1961 by depositing a compounding fee of Rs. 1,41,68,730 within 30 days from receipt of the intimation dated October 30, 2025. The violation relates to delay in remittance of TDS for financial years 2012-13 to 2017-18. The company stated that except for the mentioned amount, there is no other impact on the financial or operational activities of the company.",
            "Sentiment": "negative",
            "PublishDate": 1761848549735,
            "Source": "stock"
        },
        {
            "Title": "H.G. Infra Engineering Receives Completion Certificate for ₹1258.11 Crore Rajasthan Project",
            "Summary": "H.G. Infra Engineering has received a completion certificate for a project in Rajasthan valued at ₹1258.11 crore. The project is set to be ready for commercial operation by December 31, 2023.",
            "Sentiment": "positive",
            "PublishDate": 1760620243470,
            "Source": "stock"
        },
        {
            "Title": "H.G. Infra Engineering Subsidiary Completes ₹1,060 Cr Highway Project in Andhra Pradesh",
            "Summary": "H.G. Infra Engineering's subsidiary has received a Provisional Completion Certificate for a six-lane highway project valued at ₹1,060 crores. The project is part of the Raipur–Visakhapatnam Economic Corridor and is located in Andhra Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1759405931160,
            "Source": "stock"
        },
        {
            "Title": "H.G. Infra Engineering Secures ₹925 Crore Highway Project from NHAI",
            "Summary": "H.G. Infra Engineering has received a provisional start date from NHAI for the Varanasi-Ranchi-Kolkata Highway project. The contract is valued at ₹925.11 crores with a project length of 28.70 kilometers. The completion timeline is set at 730 days.",
            "Sentiment": "positive",
            "PublishDate": 1759311438334,
            "Source": "order&deals"
        },
        {
            "Title": "H.G. Infra Engineering Appoints Dr. Puneet Gupta as Head of New Energy Verticals",
            "Summary": "H.G. Infra Engineering Limited has appointed Dr. Puneet Gupta as Head - New Energy Verticals, categorized as Senior Management Personnel, effective October 1, 2025. Dr. Gupta holds a Bachelor's degree in Chemical Engineering from IIT Mumbai and advanced degrees from Washington University. He brings over 20 years of experience in business management across technology, project engineering, finance, and operations. His previous roles include Managing Director at Venabo Pte. Ltd Singapore, Joint-President at Adani Enterprises' Solar Manufacturing division, and senior positions at companies including GCL Solar Materials, SunEdison, and Samsung MEMC Polysilicon. The appointment is a full-time position.",
            "Sentiment": "positive",
            "PublishDate": 1758784061841,
            "Source": "corporate_governance"
        },
        {
            "Title": "H.G. Infra Engineering Invests Rs. 8.80 Crore in Three Solar Power Subsidiaries",
            "Summary": "H.G. Infra Engineering Limited acquired additional equity shares in three solar power subsidiaries through rights issues. The company invested Rs. 3.01 crore each in H.G. Bikaner Solar Project Private Limited and H.G. Muknasar Solar Project Private Limited, and Rs. 2.78 crore in H.G. Paleena Solar Project Private Limited, totaling Rs. 8.80 crore. All three subsidiaries were incorporated in 2024 and are yet to commence business operations. The acquisitions were completed on September 19, 2025, through cash consideration and are part of the company's business expansion into solar power plant setup. The transactions qualify as related party transactions since all three entities are subsidiaries of H.G. Infra Engineering Limited.",
            "Sentiment": "positive",
            "PublishDate": 1758287393814,
            "Source": "corporate_action"
        },
        {
            "Title": "H.G. Infra Engineering Achieves Financial Close for INR 781 Crore Gujarat Highway Project",
            "Summary": "H.G. Infra Engineering Limited announced that its wholly owned subsidiary, H.G. Narol Sarkhej Highway Private Limited, received confirmation of financial close for a highway project from the National Highway, R&B Department, Ahmedabad. The project involves upgrading a 10.63 km stretch of NH 47 from Narol Junction to Sarkhej Junction in Gujarat, including construction of a 6-lane road with elevated corridor on Hybrid Annuity Mode. The project has a total cost of INR 781.11 crore with a construction period of 30 months. The financial close was dated April 18, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1756291852340,
            "Source": "stock"
        },
        {
            "Title": "H.G. Infra Engineering Subsidiary Transfers 26% Stake in Three Solar Projects to Stockwell Solar Services",
            "Summary": "H.G. Green Energy Private Limited, a wholly owned subsidiary of H.G. Infra Engineering Limited, has transferred 26% stake in three solar project subsidiaries to Stockwell Solar Services Private Limited. The affected entities are H.G. Bikaner Solar Project Private Limited, H.G. Muknasar Solar Project Private Limited, and H.G. Paleena Solar Project Private Limited. Following the transfer, these entities will cease to be wholly owned subsidiaries but will continue as subsidiaries of the company. Each transaction involved the sale of 2,600 equity shares of Rs.10 each at Rs.10 per share for a total consideration of Rs.26,000 per entity, received in cash. All three solar project companies were incorporated during FY 2024-25 and contributed nil revenue. The buyer, Stockwell Solar Services Private Limited, is founded by IITians in 2017 and specializes in solar OPEX/RESCO and CAPEX models. The company confirmed that Stockwell does not belong to the promoter or group companies, and the transactions do not fall under related party transactions. The expected completion date for the transfers is September 3, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1756137873114,
            "Source": "corporate_action"
        },
        {
            "Title": "H.G. Infra Engineering Subsidiary Secures ₹781 Crore Highway Project",
            "Summary": "H.G. Infra Engineering's subsidiary received an appointed date for a ₹781 crore NH-47 upgradation project covering the Narol-Sarkhej stretch of 10.6 kilometers. The project has a duration of 30 months and becomes effective from August 19, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755778640697,
            "Source": "stock"
        },
        {
            "Title": "HG Infra Targets Multi-Sector Growth with ₹1.46 Lakh Crore Order Book",
            "Summary": "HG Infra is pursuing multi-sector growth with an order book valued at ₹1.46 lakh crore. The company is expanding into Battery Energy Storage, transmission, and metro projects while continuing execution across roads and railways. The company has achieved a historical CAGR of 22%+ and is implementing strategic diversification to maintain momentum. However, the company faces near-term margin pressure.",
            "Sentiment": "positive",
            "PublishDate": 1755104770696,
            "Source": "stock"
        },
        {
            "Title": "H.G. Infra Engineering Divests Five Subsidiaries to Neo Infra Income Opportunities Fund for ₹3,584 Crore",
            "Summary": "H.G. Infra Engineering Limited's Board approved the divestment of 100% equity stake in five wholly owned subsidiaries to Neo Infra Income Opportunities Fund. The subsidiaries being sold are H.G. Khammam Devarapalle PKG-1 Private Limited, H.G. Khammam Devarapalle PKG-2 Private Limited, H.G. Raipur Visakhapatnam AP-1 Private Limited, H.G. Raipur Visakhapatnam OD-6 Private Limited, and H.G. Raipur Visakhapatnam OD-5 Private Limited. These five subsidiaries collectively contributed ₹1,649.71 crore in revenue (32.7% of consolidated revenue) and had a combined net worth of ₹562.26 crore (11.1% of consolidated net worth) for the financial year ended March 31, 2025. The approximate aggregate enterprise value is ₹3,584 crore, subject to adjustments. A binding offer document was executed, with the Share Purchase Agreement to follow shortly. The transaction is expected to complete within 12 months, pending third-party and regulatory approvals. The buyer, Neo Infra Income Opportunities Fund, is not part of the promoter group, and this is not a related party transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1755097621974,
            "Source": "order&deals"
        },
        {
            "Title": "HG Infra Engineering Reports 39% Drop in Net Profit with Weakening Margins",
            "Summary": "HG Infra Engineering reported a 39.2% decline in net profit to ₹98.8 crore for the first quarter, compared to ₹162.5 crore in the same period last year. Revenue from operations decreased 3% to ₹1,482 crore from ₹1,528 crore year-on-year. EBITDA fell 17.5% to ₹260 crore, with margins compressing to 17.5% from 20.6% in the corresponding period. The Rajasthan-based infrastructure company provides construction services for highways, roads, bridges, runways, and civil construction projects. Shares closed at ₹994, up 0.47% on the day the results were announced.",
            "Sentiment": "negative",
            "PublishDate": 1755089352073,
            "Source": "earnings"
        },
        {
            "Title": "H.G. Infra Engineering Reports Mixed Quarterly Results with Revenue Decline",
            "Summary": "H.G. Infra Engineering Limited reported quarterly results for the period ended June 30, 2025. On a standalone basis, revenue from operations reached Rs. 17,092.43 million, while profit after tax was Rs. 1,254.69 million with earnings per share of Rs. 19.25. On a consolidated basis, revenue from operations was Rs. 14,822.02 million with profit after tax of Rs. 992.64 million and earnings per share of Rs. 15.23. The company operates through two segments: Construction (EPC business for roads, railways, solar plants) and Renewable Energy (power generation and sales). The Board approved a proposal to divest 100% investment in five wholly owned subsidiaries. One new subsidiary was incorporated during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1755086243355,
            "Source": "earnings"
        },
        {
            "Title": "H.G. Infra Engineering and D.E.C. Infrastructure Receive Appointed Date for INR 2,196 Crore New Delhi Railway Station Redevelopment Project",
            "Summary": "H.G. Infra Engineering Limited and D.E.C. Infrastructure and Projects (India) Private Limited received confirmation from Rail Land Development Authority (RLDA) for their joint EPC contract to redevelop New Delhi Railway Station. The project is valued at INR 2,195.68 crore with an appointed date of August 06, 2025, and a construction period of 45 months. The companies received the letter from RLDA on August 08, 2025, declaring the appointed date for the redevelopment project which includes construction of associated infrastructure on Engineering, Procurement and Construction (EPC) mode.",
            "Sentiment": "positive",
            "PublishDate": 1754649891571,
            "Source": "order&deals"
        },
        {
            "Title": "H.G. Infra Engineering Receives Contract Award for Naval Dockyard Material Handling Facility in Mumbai",
            "Summary": "H.G. Infra Engineering Limited has received a Letter of Award from Military Engineer Services (MES) for creating an Integrated Material Handling facility at the Naval Dockyard in Mumbai, Maharashtra. The company announced this development following an earlier announcement made on June 23, 2025. The project involves construction work at the naval facility in Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1754390973572,
            "Source": "order&deals"
        },
        {
            "Title": "HG Infra Engineering Receives Award Letter From Military Engineer Services",
            "Summary": "HG Infra Engineering has received an award letter from the Military Engineer Services. The company announced this development, indicating a new project or contract award from the military engineering division.",
            "Sentiment": "positive",
            "PublishDate": 1754390451864,
            "Source": "stock"
        },
        {
            "Title": "H.G. Infra Engineering Acquires 100% Stake in Angul Sundargarh Transmission Limited",
            "Summary": "H.G. Infra Engineering Limited has completed the acquisition of 100% equity shares of Angul Sundargarh Transmission Limited from PFC Consulting Limited through a Share Purchase Agreement executed on July 28, 2025. The acquisition was completed for Rs. 100,000, purchasing 10,000 equity shares at face value of Rs. 10 each. The target company operates in electric utilities as a transmission service provider and was incorporated on March 1, 2024, with no turnover history. The acquisition was part of a bid requirement under the Request for Proposal Notification, where the successful bidder was required to acquire the transmission company. Angul Sundargarh Transmission Limited will establish Inter-State Transmission System for Eastern Region Generation Scheme-I. The transaction is not a related party transaction and aligns with H.G. Infra Engineering's strategy to enhance shareholder value through organic and inorganic growth opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1753708112591,
            "Source": "order&deals"
        },
        {
            "Title": "HG Infra Engineering to Raise 4 Billion Rupees via Non-Convertible Debentures",
            "Summary": "HG Infra Engineering's board has approved raising 4 billion rupees through the issuance of non-convertible debentures. This decision represents a significant financial move for the company, potentially aimed at funding expansion or other strategic initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1752473136000,
            "Source": "default"
        },
        {
            "Title": "H.G. Infra Engineering Schedules Board Meeting to Discuss NCD Fundraising",
            "Summary": "H.G. Infra Engineering has announced a board meeting scheduled for July 14. The primary agenda for this meeting is to discuss raising funds through Non-Convertible Debentures (NCDs).",
            "Sentiment": "neutral",
            "PublishDate": 1751976030000,
            "Source": "default"
        },
        {
            "Title": "HG Infra Engineering Secures ₹1.18 Billion Contract",
            "Summary": "HG Infra Engineering has been awarded a contract worth ₹1.18 billion. The news indicates a significant business development for the company, potentially impacting its future revenue and project pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1750683852000,
            "Source": "default"
        },
        {
            "Title": "H.G. Infra Engineering Secures Power Transmission Project and Acquires Shares in Subsidiaries",
            "Summary": "H.G. Infra Engineering has received a Letter of Intent (LOI) from PFC Consulting for a power transmission project in Odisha. Additionally, the company has acquired shares in 8 subsidiaries through a rights issue worth 213 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1750636734000,
            "Source": "default"
        },
        {
            "Title": "H.G. Infra Acquires Shares in Eight Subsidiaries Through Rights Issue",
            "Summary": "H.G. Infra has acquired shares in eight of its subsidiaries through a rights issue. The total value of this acquisition is reported to be 213 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1750425287000,
            "Source": "default"
        },
        {
            "Title": "H.G. Infra Engineering Receives Letter of Intent for Power Transmission Project in Odisha",
            "Summary": "H.G. Infra Engineering has received a Letter of Intent from PFC Consulting for a power transmission project in Odisha. No further details about the project's scope, value, or timeline were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750421011000,
            "Source": "default"
        },
        {
            "Title": "HG Infra Engineering Declared Lowest Bidder for ERGS-I Project in Odisha",
            "Summary": "HG Infra Engineering has been declared as the lowest bidder for the ERGS-I project in Odisha. This competitive win positions the company favorably for a significant infrastructure opportunity in the region.",
            "Sentiment": "positive",
            "PublishDate": 1749637646000,
            "Source": "default"
        },
        {
            "Title": "H.G. Infra Engineering Secures Battery Storage Project in Gujarat",
            "Summary": "H.G. Infra Engineering has been awarded a Letter of Intent (LOI) for a 300 MW/600 MWh standalone Battery Energy Storage Systems (BESS) project in Gujarat. This is part of a larger 500 MW/1000 MWh BESS project initiated by Gujarat Urja Vikas Nigam under a tariff-based competitive bidding process (Phase-VI).",
            "Sentiment": "positive",
            "PublishDate": 1748477261000,
            "Source": "default"
        },
        {
            "Title": "H.G. Infra Engineering Secures 300 MW Battery Storage Project in Gujarat",
            "Summary": "H.G. Infra Engineering has received a Letter of Intent (LOI) from Gujarat Urja Vikas Nigam for a battery storage project. The company has been awarded 300 MW/600 MWH capacity out of a total 500 MW/1000 MWH Standalone Battery Energy Storage Systems (BESS) project in Gujarat. This project was awarded under Tariff-Based Competitive Bidding (Phase-VI).",
            "Sentiment": "positive",
            "PublishDate": 1748437611000,
            "Source": "default"
        },
        {
            "Title": "HG Infra Engineering Ltd: Q4 Profit Drops 22.6%, Announces ₹2 Dividend",
            "Summary": "HG Infra Engineering reported a 22.6% YoY decline in Q4 net profit to ₹147 crore. Revenue fell 20.3% to ₹1,360.9 crore. EBITDA decreased 28% to ₹239.5 crore with margin contraction. The company recommended a final dividend of ₹2 per share for FY2025.",
            "Sentiment": "negative",
            "PublishDate": 1747841855000,
            "Source": "earnings"
        },
        {
            "Title": "HG Infra Engineering Reports Q4 Results and Recommends Dividend",
            "Summary": "HG Infra Engineering has announced its quarterly results. The company's Q4 EBITDA was 2.4 billion rupees, down from 3.33 billion rupees year-over-year. The EBITDA margin decreased to 17.60% from 19.47% in the same period last year. Consolidated net profit for Q4 was 1.5 billion rupees, compared to 1.9 billion rupees year-over-year and 1.15 billion rupees quarter-over-quarter. Q4 revenue stood at 13.6 billion rupees, down from 17 billion rupees in the previous year. Additionally, the company has recommended a dividend of 2 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1747839450000,
            "Source": "result"
        },
        {
            "Title": "HG Infra Engineering Subsidiary Transfers Stake in Green Energy Project",
            "Summary": "HG Infra Engineering's subsidiary, H.G. Green Energy, has transferred a 26% stake to Stockwell Solar. This move suggests a strategic partnership or investment in the green energy sector, potentially expanding HG Infra's presence in renewable energy projects.",
            "Sentiment": "positive",
            "PublishDate": 1746450384000,
            "Source": "default"
        },
        {
            "Title": "H.G. Infra Engineering Receives Provisional Certificate for 11.23 Billion Rupee Order",
            "Summary": "H.G. Infra Engineering has been granted a provisional certificate for a project order valued at 11.23 billion rupees. This certificate suggests that the company has substantially completed the project requirements and is nearing final approval.",
            "Sentiment": "positive",
            "PublishDate": 1745885348000,
            "Source": "default"
        },
        {
            "Title": "HG Infra Engineering: Subsidiary Secures Rs 1,123 Crore NHAI Contract",
            "Summary": "HG Infra Engineering's subsidiary, HG Raipur Visakhapatnam OD-6 Pvt., has been awarded a Rs 1,123.1 crore contract by NHAI for developing a six-lane road section in Odisha. The project, part of the Raipur-Visakhapatnam Economic Corridor, is to be completed in 730 days.",
            "Sentiment": "positive",
            "PublishDate": 1745856715000,
            "Source": "order&deals"
        }
    ]
}