{
    "Symbol": "HGM",
    "ISIN": "INE596H01014",
    "News": [
        {
            "Title": "HGM Board Meet Set for Feb 14 to Review Q3FY26 Results",
            "Summary": "HandsOn Global Management schedules board meeting on February 14, 2026 to consider Q3FY26 unaudited financial results. Trading window remains closed until February 16, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770377282137,
            "Source": "co_actions_results"
        },
        {
            "Title": "HGM Executive Director Vikram Negi Resigns",
            "Summary": "Handson Global Management announces immediate resignation of Executive Director Vikram Negi effective December 10, 2025, citing competing professional priorities as reason for stepping down.",
            "Sentiment": "neutral",
            "PublishDate": 1765383310482,
            "Source": "stocks"
        },
        {
            "Title": "Hands On Global Management Executive Director Vikram Negi Resigns Effective Immediately",
            "Summary": "Vikram Negi resigned from his position as Executive Director of Hands On Global Management (HGM) Limited effective December 10, 2025, citing competing professional priorities as the reason for his departure. The resignation affects the company's board composition and executive leadership structure, with Negi confirming no other material reasons beyond those mentioned in his resignation letter.",
            "Sentiment": "neutral",
            "PublishDate": 1765362695575,
            "Source": "corporate_governance"
        },
        {
            "Title": "HandsOn Global Management Seeks Shareholder Approval for Independent Director Appointment via Postal Ballot",
            "Summary": "HandsOn Global Management (HGM) Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mrs. Bhavana Sharma as an Independent Director for a five-year term from October 15, 2025 to October 14, 2030. The e-voting process runs from November 19, 2025 (10:00 AM) to December 18, 2025 (5:00 PM), with results to be announced by December 20, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763454203429,
            "Source": "corporate_action"
        },
        {
            "Title": "HandsOn Global Management Reports Q2 Results, Announces Strategic AI Investment and Director Appointment",
            "Summary": "HandsOn Global Management reported Q2 results with consolidated revenue of Rs 1,895.09 lakhs and profit of Rs 49.54 lakhs, while making a strategic investment of Rs 545.84 lakhs in AI-powered coding solutions provider Aideo Technologies LLC. The company also announced an electronic postal ballot to appoint Mrs. Bhavana Sharma as Independent Director.",
            "Sentiment": "positive",
            "PublishDate": 1763095728410,
            "Source": "earnings"
        },
        {
            "Title": "HGM Limited Appoints Bhavana Sharma as Independent Director for Five-Year Term",
            "Summary": "HandsOn Global Management (HGM) Limited appointed Mrs. Bhavana Sharma as Additional Director (Non-Executive Independent Director) for a five-year term from October 15, 2025 to October 14, 2030. The appointment is subject to shareholder approval through postal ballot process. The Board reconstituted its Audit Committee and Nomination & Remuneration Committee to include the new director, with Mrs. Sharma serving as Chairman of the Nomination & Remuneration Committee and Member of the Audit Committee. Mrs. Sharma brings over 25 years of experience across IT and organizational management, with specialized focus on HR practices. She holds an Executive MBA in HR and certifications in Business Analytics from XLRI. She has no relationships with existing directors or promoters of the company.",
            "Sentiment": "positive",
            "PublishDate": 1760602330317,
            "Source": "corporate_governance"
        },
        {
            "Title": "HGM Limited Acquires AI Medical Coding Company Aidéo Technologies for Rs. 14.08 Crores",
            "Summary": "HandsOn Global Management (HGM) Limited has approved the acquisition of 100% equity stake in Aidéo Technologies LLC for Rs. 14.08 Crores through its wholly owned subsidiary Healthcare Capital Holdings LLC. Aidéo Technologies is a Delaware-incorporated AI-powered autonomous medical coding platform provider in the revenue cycle management space, headquartered in Las Vegas, Nevada. The company reported turnover of Rs. 18.96 crores in FY 2024, showing growth from Rs. 7.44 crores in FY 2022 and Rs. 11.70 crores in FY 2023. The acquisition will be completed through issuance of HCH Class B Preferred Stock rather than cash consideration. Aidéo's Gemini Solution Suite provides AI-powered medical coding productivity solutions with HL7 interoperability for EHR systems, serving surgical specialties, emergency departments, anesthesia, radiology, and RCM companies across the U.S. The transaction is expected to close in August and requires no prior regulatory approvals as it is being conducted through a wholly owned subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1755664060680,
            "Source": "order&deals"
        },
        {
            "Title": "HandsOn Global Management Schedules Board Meeting to Consider AI Medical Coding Platform Acquisition",
            "Summary": "HandsOn Global Management (HGM) Limited has scheduled a Board of Directors meeting for August 20, 2025, to discuss a potential acquisition in the AI-powered Autonomous Medical Coding Platform for revenue cycle management. The acquisition would be conducted through the company's US-based wholly owned subsidiary. The company trades on NSE under symbol HOVS and on BSE with scrip code 532761.",
            "Sentiment": "positive",
            "PublishDate": 1755155819174,
            "Source": "corporate_action"
        },
        {
            "Title": "HandsOn Global Management Reports 137% Revenue Growth in Q1 FY26, Announces Subsidiary Sale",
            "Summary": "HandsOn Global Management (HGM) Limited reported total revenue of ₹1,412.62 lakhs for Q1 FY26, representing 137% quarter-over-quarter growth and 135% year-over-year growth. The company's profit before tax increased 104% quarter-over-quarter to ₹240.49 lakhs, while profit after tax rose 31% to ₹172.86 lakhs. EBITDA grew 97% quarter-over-quarter to ₹289.38 lakhs. The revenue growth was driven by increased AI-enabled services, with headcount expanding from approximately 600 in Q4 FY25 to around 1,300 in Q1 FY26. The board approved the sale of wholly-owned subsidiary HOVS LLC and the incorporation of a new subsidiary in the Cayman Islands. The company changed its name from HOV Services Limited to HGM Limited effective August 7, 2025. HGM operates as a technology-driven enterprise focused on AI-driven healthcare services across North America, APAC, and Middle East markets, specializing in revenue cycle management, medical coding, and healthcare analytics. The company maintains a debt-free status with strong liquidity position.",
            "Sentiment": "positive",
            "PublishDate": 1755146063351,
            "Source": "earnings"
        },
        {
            "Title": "HOV Services Limited Changes Name to HandsOn Global Management (HGM) Limited with 99.96% Shareholder Approval",
            "Summary": "HOV Services Limited announced the results of a postal ballot conducted on August 2, 2025, where shareholders approved two special resolutions with a 99.96% majority. The first resolution approved changing the company name to HandsOn Global Management (HGM) Limited and consequent alterations to the Memorandum and Articles of Association. The second resolution aligned the company's Memorandum and Articles of Association with Schedule I of the Companies Act, 2013. The e-voting process ran from July 3 to August 2, 2025, with 53 members voting in favor (6,370,693 votes) and 6 members voting against (2,405 votes) for both resolutions. The company has 10,257 total shareholders on record date, with promoter and promoter group holding 6,349,829 shares and public holding 6,245,143 shares. CS Prajot Prakash Tungare served as the scrutinizer for the postal ballot process.",
            "Sentiment": "positive",
            "PublishDate": 1754141723260,
            "Source": "corporate_action"
        }
    ]
}