{
    "Symbol": "HGS",
    "ISIN": "INE170I01016",
    "News": [
        {
            "Title": "HGS Reports Mixed Q3FY26 Results with Revenue Decline",
            "Summary": "Hinduja Global Solutions posts ₹1,272.58 crore revenue in Q3FY26, down from ₹1,234.87 crore YoY. Net profit rises to ₹34.35 crore vs loss of ₹8.59 crore in Q3FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1770880591990,
            "Source": "co_actions_results"
        },
        {
            "Title": "HGS Board Meeting Set for Feb 10 to Review Q3FY26 Results",
            "Summary": "Hinduja Global Solutions Limited has scheduled a board meeting on February 10, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769778439285,
            "Source": "co_actions_results"
        },
        {
            "Title": "HGS launches AI-powered AML platform AMLens",
            "Summary": "Hinduja Global Solutions introduces AMLens, an AI-driven anti-money laundering platform that reduces case analysis time by 75% and cuts false positives from 18% to 7%.",
            "Sentiment": "positive",
            "PublishDate": 1768207075564,
            "Source": "stocks"
        },
        {
            "Title": "HGS Launches AMLens AI Tool for AML Investigations",
            "Summary": "Hinduja Global Solutions introduces AMLens, an AI-powered tool that accelerates anti-money laundering investigations by 75% while reducing false positive rates by over 60%.",
            "Sentiment": "positive",
            "PublishDate": 1768190954531,
            "Source": "stocks"
        },
        {
            "Title": "HGS Launches AMLens AI Solution for AML Operations",
            "Summary": "Hinduja Global Solutions introduces AMLens, an AI-powered Anti-Money Laundering solution that reduces case analysis time by 75% and false positives by 60%, boosting investigator productivity by 3x.",
            "Sentiment": "positive",
            "PublishDate": 1768190881130,
            "Source": "stocks"
        },
        {
            "Title": "Hinduja Global Solutions Seeks Shareholder Approval for Re-appointment of Whole-time Director",
            "Summary": "Hinduja Global Solutions is conducting a postal ballot seeking shareholder approval for re-appointment of Mr. Vynsley Fernandes as Whole-time Director and CEO Digital Media Business for 3 years from November 14, 2025 to November 13, 2028, with fixed remuneration of Rs 2.4 crore per annum plus variable pay up to Rs 60 lakh. The e-voting period runs from November 27, 2025 to December 26, 2025, with results to be declared by December 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764072856958,
            "Source": "corporate_action"
        },
        {
            "Title": "Hinduja Global Solutions Reports Q2 FY2026 Results with 12.9% EBITDA Margin",
            "Summary": "Hinduja Global Solutions posted total income of INR 1,222.9 crore for Q2 FY2026 with operating revenue of INR 1,091 crore and EBITDA margin of 12.9%, while focusing on AI-driven intelligent experiences and digital transformation. The company closed 35 new client contracts in H1 FY2026 with 62% of pipeline shifting toward digital services, targeting mid-20% EBITDA margins over next five years through operational efficiency improvements.",
            "Sentiment": "positive",
            "PublishDate": 1763460142831,
            "Source": "earnings"
        },
        {
            "Title": "Hinduja Global Solutions Reports Q2 FY2026 Results and Board Approves Director Re-appointment",
            "Summary": "Hinduja Global Solutions Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported consolidated total income of Rs. 1,222.9 crore for Q2, up 3.0% quarter-on-quarter and 1.3% year-on-year. Revenue from operations was Rs. 1,091.0 crore, increasing 3.3% QoQ and 0.4% YoY. Total EBITDA stood at Rs. 158.0 crore with margins of 12.9%. For the six-month period, total income was Rs. 2,410.2 crore with revenue from operations at Rs. 2,147.3 crore. The Board of Directors approved the re-appointment of Mr. Vynsley Fernandes as Whole-time Director and Chief Executive Officer-Media Business for a three-year term from November 14, 2025, subject to shareholder approval through postal ballot. The company added 19 new digital CX/tech solution clients and 10 HRO/Payroll processing clients during the quarter. HGS operates across nine countries with 30 global delivery centers and employs 18,017 people as of September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762812638936,
            "Source": "earnings"
        },
        {
            "Title": "Hinduja Global Solutions Reports Narrower Q2 Loss Despite Lower EBITDA Margin",
            "Summary": "Hinduja Global Solutions reported a consolidated net loss of 195.3 million rupees in Q2, an improvement from the 453 million rupee loss in the same quarter last year. Revenue increased to 10.91 billion rupees from 10.67 billion rupees year-over-year. However, EBITDA declined to 131.6 million rupees from 245.7 million rupees, with the EBITDA margin compressing to 1.21% from 2.3% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762780636967,
            "Source": "earnings"
        },
        {
            "Title": "Hinduja Global Solutions Schedules Q2 H1 FY2026 Earnings Call for November 11, 2025",
            "Summary": "Hinduja Global Solutions Limited has announced its Q2 H1 FY2026 earnings call scheduled for Tuesday, November 11, 2025 at 16:00 hrs IST. The call will discuss the company's performance for the quarter and half year ended September 30, 2025. Key management participants include Venkatesh Korla (Global CEO), Mahesh Kumar Nutalapati (Global CFO), and Vynssley Fernandes (Whole-time Director and CEO of Media Business). The company has provided multiple dial-in numbers for international access and requested participants to join 5 minutes in advance.",
            "Sentiment": "neutral",
            "PublishDate": 1762174317937,
            "Source": "earnings"
        },
        {
            "Title": "Tax Panel Rules Hinduja Global-NxtDigital Merger as Tax Avoidance Scheme, Demands Rs 1,203 Crore Recovery",
            "Summary": "The Approving Panel has classified the merger between Hinduja Global Solutions Ltd. and NxtDigital Ltd. as an impermissible tax avoidance arrangement under India's General Anti-Avoidance Rules. The panel disallowed Rs 1,203 crore in tax set-offs and ordered recovery of the full tax amount with interest and penalties. HGSL had sold its healthcare division for Rs 8,000 crore, generating Rs 3,059 crore in capital gains, then merged with loss-making NxtDigital which had Rs 1,500 crore in accumulated losses. This allowed HGSL to offset losses against profits, reducing tax liability by Rs 281 crore. The panel found that internal communications revealed tax savings as the primary merger motive, with no genuine commercial substance or business synergy between the companies. The ruling represents a significant setback for the Hinduja Group and reinforces the government's strict approach to tax avoidance through corporate restructuring.",
            "Sentiment": "negative",
            "PublishDate": 1761899841745,
            "Source": "corporate_action"
        },
        {
            "Title": "HGS Launches AI-Powered Interaction Intelligence Solution to Transform Customer Experience",
            "Summary": "Hinduja Global Solutions (HGS) announced the launch of Interaction Intelligence, an enterprise-grade artificial intelligence solution built on the HGS Agent X framework. The solution transforms Quality Assurance from a routine customer service function into a strategic asset that delivers actionable insights. It enables enterprises to analyze nearly 100% of customer interactions across omni-channels, expanding traditional QA coverage by up to 100 times. The platform combines conversational, behavioral, and operational metrics in real time to provide visibility into compliance, agent performance, and customer loyalty drivers. Benefits include enhanced customer experience through better-trained agents, cost competitiveness through reduced costs and revenue generation via cross-selling and up-selling, improved brand reputation, and actionable insights for strategic decision-making. The solution measures tone, empathy, accuracy, and procedural adherence at scale. HGS Global CEO Venkatesh Korla stated the launch positions the company to capitalize on increasing customer experience transformation investments within a rapidly growing market. The company is currently deploying the solution for clients in the Americas. This launch marks HGS's evolution from traditional BPO to an AI-powered Intelligent Experience Company.",
            "Sentiment": "positive",
            "PublishDate": 1761533152133,
            "Source": "stock"
        },
        {
            "Title": "Hinduja Global Solutions Opens New Intelligent Experience Hub in Manila, Philippines",
            "Summary": "Hinduja Global Solutions announced the opening of a new intelligent experience hub in Manila, Philippines. The facility is located in Manila's prime business district and consolidates HGS teams from across the city into a single, purpose-built environment. The company plans to create more than 1,000 new jobs over the next 24 months in business services and digital transformation. The new center has an initial capacity of 1,500 seats and can accommodate up to 3,000 employees in two shifts. With this addition, HGS now operates two facilities in Manila and four across the Philippines. HGS had previously signed a Letter of Intent with the Philippines government to scale its local operations. The hub is designed to support technology-driven business needs and features collaborative spaces for delivering technology-enabled solutions to clients.",
            "Sentiment": "positive",
            "PublishDate": 1760323609012,
            "Source": "stock"
        },
        {
            "Title": "Hinduja Global Solutions Reports Mixed Q1 FY2026 Results with 169 bps EBITDA Margin Improvement",
            "Summary": "Hinduja Global Solutions achieved total income of Rs. 1,187.3 crores and operating revenue of Rs. 1,056.2 crores in Q1 FY2026. EBITDA reached Rs. 159.7 crores with margins of 13.5%, up 169 basis points year-over-year. However, revenue declined sequentially from Rs. 1,161 crores in Q4 FY2025 due to seasonal softness and customer ramp-downs. The company reported negative PAT of Rs. 46.3 crores from continuing operations but positive total PAT of Rs. 11.2 crores including discontinued operations. HGS is prioritizing margin expansion over topline growth and transforming into an AI-enabled intelligent experiences company. The board approved a 5-year business transformation plan focusing on digital services and AI platform Agent X, which is deployed across 20 BPM clients with 5,000 active users. In the media business, NXTDIGITAL faced challenges with Rs. 38.8 crores loss in Q1 versus Rs. 30.5 crores profit in previous quarter, primarily due to Rs. 30 crores in unbilled marketing deals and increased content costs. The company maintains strong balance sheet with net worth of Rs. 7,980 crores and cash surplus of Rs. 5,140 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1755180505550,
            "Source": "earnings"
        },
        {
            "Title": "Hinduja Global Solutions Reports 13.5% EBITDA Margin with Focus on AI-Driven Digital Services",
            "Summary": "Hinduja Global Solutions reported operating revenue of Rs 1,056.2 crore (US$ 123.9 million) and total income of Rs 1,187.3 crore (US$ 139.2 million) for quarterly results. The company achieved total PAT of Rs 11.2 crore (US$ 1.3 million) and EBITDA of Rs 159.7 crore (US$ 18.7 million) with margins at 13.5%, representing a 169 basis points expansion year-over-year. The company is experiencing continued macro-economic volatility and extended client sales cycles, with seasonality in key verticals moderating revenue growth. HGS is emphasizing margin expansion over topline growth, driven by changing revenue mix toward digital services and deployment of its internally developed Agentic AI platform HGS Agent X. The sales pipeline shows strong traction for digital services, with current order pipeline in Americas region being upwards of 55% in this segment. The company's AI platform is deployed across 20 clients covering approximately 5,000 active users, delivering 40% training optimization, 25% productivity gains, and 30% reduced costs. Digital media business NXTDIGITAL maintained stable ARPUs, with organic business segment and CelerityX together contributing 37% of revenues compared to 30% contribution in the previous fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1754648003327,
            "Source": "earnings"
        },
        {
            "Title": "Hinduja Global Solutions Approves Q1 Results and Major Leadership Changes",
            "Summary": "Hinduja Global Solutions Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company announced significant leadership changes including the retirement of Non-Executive Non-Independent Director Paul Abraham due to other commitments, with his tenure ending at the September 25, 2025 AGM. The Board approved the appointment of Amit Saharia as Non-Executive Non-Independent Director effective September 25, 2025, subject to shareholder approval. Saharia brings 25 years of industry and global management consulting experience and currently holds a leadership role at Hinduja Group responsible for shaping future strategy. The company also appointed Virendra G Bhatt as Secretarial Auditor for five years from FY 2025-26 to FY 2029-30. In senior management changes, Pushkar Misra, President - APAC, retired after 25 years of service, with Giridhar G V taking over as Head - APAC. N K Rouse, COO - Media Business, resigned due to family commitments after 11 years with the company. The 30th Annual General Meeting is scheduled for September 25, 2025, via video conferencing.",
            "Sentiment": "neutral",
            "PublishDate": 1754494729715,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hinduja Global Solutions Reports Q1 FY2026 Results with Board Changes and Leadership Transitions",
            "Summary": "Hinduja Global Solutions Limited announced its quarterly results for the quarter ended June 30, 2025. The company reported consolidated total income of Rs. 1,187.3 crore and revenue from operations of Rs. 1,056.2 crore. Total PAT stood at Rs. 11.2 crore with EBITDA margins of 13.5%. The Board approved several key changes: Mr. Paul Abraham will retire as Non-Executive Non-Independent Director at the upcoming AGM on September 25, 2025, while Mr. Amit Saharia will be appointed as Non-Executive Non-Independent Director from the same date. In senior management changes, Mr. Pushkar Misra, President - APAC, retired after 25 years of service, and Mr. N K Rouse, COO - Media Business, resigned due to family commitments. The company also appointed Mr. Virendra G Bhatt as Secretarial Auditor for five years. HGS added 18 new logos for digital CX solutions and expanded engagement with 65 existing clients. The company operates across nine countries with 33 global delivery centers and serves 393 active CX/BPM clients.",
            "Sentiment": "neutral",
            "PublishDate": 1754492321458,
            "Source": "earnings"
        },
        {
            "Title": "Hinduja Global Solutions' MENA FZ-LLC Unit to Undergo Voluntary Liquidation",
            "Summary": "Hinduja Global Solutions announced that its subsidiary MENA FZ-LLC has decided to liquidate voluntarily. The decision involves the dissolution of this particular business unit within the company's organizational structure.",
            "Sentiment": "negative",
            "PublishDate": 1753277348164,
            "Source": "stock"
        },
        {
            "Title": "Hinduja Global Solutions Completes Voluntary Liquidation of Dubai Subsidiary",
            "Summary": "Hinduja Global Solutions Limited completed the voluntary liquidation of its step-down wholly owned subsidiary, Hinduja Global Solutions MENA FZ-LLC, on July 23, 2025. The liquidation received approval from the Dubai Development Authority and was executed to simplify the company's overall corporate structure. The subsidiary ceased to exist effective July 23, 2025. The company stated there are no benefits to promoters or group companies from this restructuring, and no changes to shareholding patterns of any entities.",
            "Sentiment": "neutral",
            "PublishDate": 1753277211957,
            "Source": "corporate_action"
        },
        {
            "Title": "Hinduja Global Solutions Reports Strong Q4 Financial Performance",
            "Summary": "Hinduja Global Solutions has reported significant year-over-year improvements in its quarterly financial results. The company's profit before tax (PBT) increased to 1.03 billion rupees from 414 million rupees in the same quarter last year. EBITDA rose to 1.4 billion rupees from 662.5 million rupees, with the EBITDA margin expanding to 12.23% from 6.03%. The company also reported a deferred tax of 859 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1748448232000,
            "Source": "result"
        },
        {
            "Title": "Hinduja Global Solutions Reports Q4 Financial Results",
            "Summary": "Hinduja Global Solutions announced its Q4 financial results. The company reported a consolidated net profit of 38 million rupees, which is a decrease from 904.8 million rupees in the same quarter last year. Compared to the previous quarter, there was a loss of 26 million rupees. Q4 revenue increased to 11.6 billion rupees from 10.99 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1748448114000,
            "Source": "result"
        },
        {
            "Title": "Hinduja Global Solutions Launches AI-Powered Innovation Hub in Canada",
            "Summary": "Hinduja Global Solutions has established an AI-powered Digital Customer Experience (CX) and Data Innovation Hub in Waterloo, Canada. This strategic move aims to enhance the company's technological capabilities and expand its presence in the North American market.",
            "Sentiment": "positive",
            "PublishDate": 1747031282000,
            "Source": "default"
        },
        {
            "Title": "Hinduja Global Solutions Focuses on AI-Led Growth with Agent X",
            "Summary": "Hinduja Global Solutions (HGS) is emphasizing its future growth through AI-led initiatives, particularly with its Agent X platform. The company is expanding its delivery capabilities in India, South Africa, and Canada to meet increasing client demand. This strategic move highlights HGS's commitment to leveraging artificial intelligence for business expansion and improved client services.",
            "Sentiment": "positive",
            "PublishDate": 1743655704000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hinduja Global Solutions Announces Merger of Subsidiary Units",
            "Summary": "Hinduja Global Solutions has reported that its subsidiary, Diversify Intelligent Staffing Solutions, has merged with another unit, Diversify ISS BGC. This merger represents a consolidation of the company's operations within its subsidiary structure.",
            "Sentiment": "neutral",
            "PublishDate": 1741565363000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hinduja Global Solutions Announces Merger of Subsidiary Units",
            "Summary": "Hinduja Global Solutions (HGS) has reported that its subsidiary, Diversify Intelligent Staffing Solutions, has merged with another unit, Diversify ISS BGC. This merger represents a corporate restructuring within the HGS group, potentially aimed at streamlining operations or consolidating resources.",
            "Sentiment": "neutral",
            "PublishDate": 1741351293000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hinduja Global Solutions Reports Q3 Financial Results",
            "Summary": "Hinduja Global Solutions has reported a net loss of 26 million rupees in the third quarter, compared to a profit of 101 million rupees in the same period last year. The company's revenue for Q3 decreased to 11 billion rupees from 12.04 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739751664000,
            "Source": "earnings"
        },
        {
            "Title": "Hinduja Global Solutions Reports Decline in Q3 EBITDA",
            "Summary": "Hinduja Global Solutions experienced a significant decrease in its third-quarter EBITDA, dropping from 1.15 billion rupees to 623 million rupees year-over-year. The company's EBITDA margin also contracted, falling from 9.60% to 5.85% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739528201000,
            "Source": "earnings"
        },
        {
            "Title": "Hinduja Global Solutions Reports Q3 Net Loss",
            "Summary": "Hinduja Global Solutions experienced a financial downturn in the third quarter, reporting a net loss of 26 million rupees compared to a profit of 101 million rupees in the same period last year. The company's revenue also declined from 12.04 billion rupees to 11 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739528196000,
            "Source": "earnings"
        },
        {
            "Title": "Hinduja Global Solutions to Consider Q3 Results",
            "Summary": "Hinduja Global Solutions has announced that it will consider its third quarter financial results on February 14. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738758319000,
            "Source": "earnings"
        },
        {
            "Title": "Hinduja Global Solutions Subsidiary to Merge Five U.S. Entities",
            "Summary": "Hinduja Global Solutions (HGS) has announced that its subsidiary, HGS CX Technologies, will merge five of its U.S. subsidiaries to streamline operations. This corporate restructuring aims to simplify the organizational structure and potentially improve operational efficiency within the company's U.S. operations.",
            "Sentiment": "neutral",
            "PublishDate": 1733875585000,
            "Source": "corporate_action"
        },
        {
            "Title": "HGS CX Technologies to Merge Five U.S. Subsidiaries",
            "Summary": "Hinduja Global Solutions (HGS) has announced that its unit, HGS CX Technologies, will merge five of its U.S. subsidiaries. This move is aimed at streamlining operations within the company's U.S. business structure.",
            "Sentiment": "neutral",
            "PublishDate": 1733832190000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hinduja Global Solutions Reports Q2 EBITDA Decline",
            "Summary": "Hinduja Global Solutions experienced a significant decrease in Q2 EBITDA, dropping from 975 million rupees to 350 million rupees year-over-year. The company's EBITDA margin also fell from 8.26% to 3.22% in the same period.",
            "Sentiment": "negative",
            "PublishDate": 1731596038000,
            "Source": "result"
        },
        {
            "Title": "Hinduja Global Solutions Reports Q2 Financial Results",
            "Summary": "Hinduja Global Solutions (HGS) has reported its Q2 financial results. The company experienced a consolidated net loss of 453 million rupees, compared to a loss of 177 million rupees in the same quarter last year. However, it showed a significant improvement from the previous quarter, with a profit of 1.65 billion rupees. Q2 revenue stood at 10.9 billion rupees, down from 11.8 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731595969000,
            "Source": "result"
        },
        {
            "Title": "Hinduja Global Solutions: AI Hub Launch in Manila",
            "Summary": "HGS opened an AI Hub in Manila on October 18, 2024, to enhance digital experience solutions. The facility showcases various digital technologies and platforms for real-time client interaction. HGS operates 32 delivery centres across nine countries with 18,036 employees.",
            "Sentiment": "positive",
            "PublishDate": 1729243534000,
            "Source": "normal_news"
        },
        {
            "Title": "Hinduja Global Solutions Launches AI Hub in Manila",
            "Summary": "Hinduja Global Solutions (HGS) has established an Artificial Intelligence (AI) hub in Manila, Philippines. This strategic move aims to enhance the digital experience for HGS clients by leveraging AI technologies.",
            "Sentiment": "positive",
            "PublishDate": 1729237521000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hinduja Global Launches CX Hub in Cape Town",
            "Summary": "<p><span class=\"positive\">Hinduja Global Solutions (HGS)</span> has established a new <b>Global Customer Experience (CX) Hub</b> in <span class=\"neutral\">Cape Town, South Africa</span>. This <span class=\"positive\">strategic move</span> aims to <span class=\"positive\">enhance</span> the company's ability to provide <span class=\"positive\">advanced customer experience solutions</span> to its <span class=\"neutral\">international clientele</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727949990000,
            "Source": "corporate_action"
        }
    ]
}