{
    "Symbol": "HIKAL",
    "ISIN": "INE475B01022",
    "News": [
        {
            "Title": "Hikal Sets Feb 17, 2026 Record Date for Interim Dividend",
            "Summary": "Hikal Limited has fixed February 17, 2026 as the record date for determining shareholder eligibility for interim dividend payment for FY 2025-26, as approved by the board on February 11, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770831514349,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hikal Limited Q3 & 9M FY26 Earnings Call on Feb 11",
            "Summary": "Hikal Limited announces earnings conference call scheduled for February 11, 2026 at 4:30 PM IST to discuss Q3 and nine months FY26 financial and operational performance with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1770225447880,
            "Source": "stocks"
        },
        {
            "Title": "Hikal discloses revenue recognition irregularities",
            "Summary": "Hikal Limited reports misconduct by employees involving revenue recognition irregularities affecting Q4FY25, Q1FY26, and Q2FY26, with ₹80.70 cr revenue reversal in Q2FY26. Company confirms all underlying sales are genuine.",
            "Sentiment": "negative",
            "PublishDate": 1766768285402,
            "Source": "stocks"
        },
        {
            "Title": "Hikal Ltd Shares Transfer to Castilia Life Sciences via Amalgamation Scheme",
            "Summary": "Shares of Hikal Limited previously held by Shri Rameshwara Investment Private Limited and Shri Badrinath Investment Private Limited have been transferred to Castilia Life Sciences Private Limited through an amalgamation scheme. The scheme was sanctioned under Section 233 of the Companies Act, 2013 on 18 November 2025 and became effective on 1 December 2025, affecting the shareholding structure of Hikal Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1764934039121,
            "Source": "corporate_action"
        },
        {
            "Title": "Hikal Limited Announces Completion of Promoter Group Companies Amalgamation",
            "Summary": "Three promoter group companies of Hikal Limited have completed their amalgamation scheme, with Shri Rameshwara Investment Private Limited and Shri Badrinath Investment Private Limited merging into Castilia Life Sciences Private Limited. The scheme was approved by the Regional Director and became effective on December 3, 2025, resulting in the transfer of shares held by the merged entities to Castilia.",
            "Sentiment": "neutral",
            "PublishDate": 1764768837357,
            "Source": "corporate_action"
        },
        {
            "Title": "ICRA Maintains HIKAL's Credit Rating at A- with Stable Outlook Despite Regulatory Challenges",
            "Summary": "ICRA Limited has assigned credit ratings to HIKAL Limited, maintaining the A- rating with stable outlook while citing moderated performance due to USFDA's OAI classification of its Jigani facility and warning letter. The rating factors in deferred pharmaceutical sales from quality checks and customer audits following regulatory action, with the company's ability to recover sales and earnings over H2 FY2026 remaining under monitoring.",
            "Sentiment": "negative",
            "PublishDate": 1764056342981,
            "Source": "stock"
        },
        {
            "Title": "Hikal Limited Reports Q2 FY26 Revenue of Rs. 319 Crores with EBITDA at Rs. 8 Crores",
            "Summary": "Hikal Limited recorded consolidated revenue of Rs. 319 crores for Q2 FY26 with EBITDA of Rs. 8 crores (2.6% margin), impacted by deferred sales worth Rs. 80 crores due to customer risk assessments following FDA warning letter. The pharmaceutical business generated Rs. 190 crores revenue with negative 9.2% EBIT margin, while crop protection segment recorded Rs. 129 crores with negative EBIT, though management expects strong recovery in H2 FY26.",
            "Sentiment": "negative",
            "PublishDate": 1763551029879,
            "Source": "earnings"
        },
        {
            "Title": "Hikal Limited Reports Loss and Revenue Reversal in Q2 FY2025 Results",
            "Summary": "Hikal Limited posted a standalone net loss of Rs 341 million for the quarter ended September 30, 2025, after reversing Rs 807 million in revenue due to incomplete performance obligations. The company faces ongoing challenges from US FDA warning letter impact on pharma sales and pending Supreme Court case regarding environmental compliance with Rs 174.5 million compensation claim.",
            "Sentiment": "negative",
            "PublishDate": 1763063055395,
            "Source": "earnings"
        },
        {
            "Title": "Hikal Targets 18-20% CAGR Growth Through Pharma and Crop Protection Expansion",
            "Summary": "Hikal announced plans for capacity expansion at its Panoli and Mahad units, targeting 18-20% CAGR over 3 years driven by pharma and crop protection segments. The company is focusing on API backward integration, long-term CDMO contracts, and strategic partnerships with global innovators to diversify its product portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1763051781589,
            "Source": "stock"
        },
        {
            "Title": "Hikal Reports Rs 319 Crore Revenue in Q2 with Rs 35 Crore Loss Due to Regulatory Issues",
            "Summary": "Hikal Limited reported quarterly revenue of Rs 319 crore but posted a loss of Rs 35 crore, primarily due to pharmaceutical sales deferrals following USFDA audit observations and warning letter received in February 2025. The company expects strong recovery in Q3 and Q4 with improved demand visibility and higher capacity utilization as supply resumption progresses and new product commercialization advances.",
            "Sentiment": "negative",
            "PublishDate": 1763043497723,
            "Source": "earnings"
        },
        {
            "Title": "Hikal Limited Submits Revised Q1 FY26 Results Presentation Following FDA Regulatory Issues",
            "Summary": "Hikal Limited submitted a revised results presentation for the quarter ended June 30, 2025, updating their previous submission from August 07, 2025. The company reported consolidated revenue of Rs 380 crore, down 6.5% year-on-year and 31.1% quarter-on-quarter. EBITDA declined significantly to Rs 25 crore with a margin of 6.5%, compared to 14.3% in the previous year. The company posted a net loss of Rs 23 crore versus a profit of Rs 5 crore in the same quarter last year. The pharmaceutical segment, contributing 53% of revenue, generated Rs 203 crore with a negative EBIT margin of 12.9%. Performance was impacted by temporary deferment of customer offtake following an Official Action Indicated (OAI) communication received on May 22nd after a US FDA audit conducted in February 2025. The crop protection business reported revenue of Rs 178 crore with an EBIT margin of 9.7%, remaining largely flat year-on-year due to global overcapacity and pricing pressure from Chinese competition. The company successfully completed GMP audits at its Bangalore API facility by ANVISA Brazil and PMDA Japan. Management expects supplies to resume partly in Q2 and maintains guidance for the full financial year, anticipating meaningful recovery in Q3 and Q4 FY26.",
            "Sentiment": "negative",
            "PublishDate": 1758626348405,
            "Source": "earnings"
        },
        {
            "Title": "Proxy Firms Split on Amit Kalyani's Board Reappointment at Hikal Amid Family Dispute",
            "Summary": "Hikal Ltd. faces a boardroom battle over Amit Kalyani's reappointment as non-executive director, with proxy advisory firms offering conflicting recommendations. The Kalyani family holds approximately 34% stake while the Hiremath family, led by Baba Kalyani's sister Sugandha Hiremath, holds around 35%. The remaining 31% held by institutional and retail investors will likely determine the outcome. Stakeholder Empowerment Services recommends voting in favor, noting Amit's 13-year board tenure and that his six listed directorships within the same promoter group don't raise major concerns. Institutional Investor Advisory Services opposes the reappointment, citing potential impact on company functioning from the ongoing ownership dispute stemming from a 1994 family arrangement. KIL, the Kalyani holding company claiming over 31% stake, defended the appointment, stating Amit has no day-to-day role and serves on no committees. Baba Kalyani previously failed to secure reappointment in December 2023, ending his 31-year board tenure.",
            "Sentiment": "negative",
            "PublishDate": 1758556436671,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hikal Receives US FDA Warning Letter for Bengaluru Manufacturing Facility",
            "Summary": "Hikal has received a warning letter from the US FDA regarding its Jigani facility in Bengaluru. The company plans to implement corrective measures to address the regulatory concerns raised by the FDA.",
            "Sentiment": "negative",
            "PublishDate": 1755779670687,
            "Source": "stock"
        },
        {
            "Title": "Hikal Limited Reports 27% Revenue Drop in Q1 FY26 Due to FDA Issues and Customer Deferrals",
            "Summary": "Hikal Limited reported consolidated revenue of Rs. 380 crores for Q1 FY26, down from Rs. 407 crores in the corresponding quarter last year. EBITDA fell to Rs. 25 crores with margins at 6.5% compared to 14.3% in Q1 FY25. The pharmaceutical business recorded revenue of Rs. 203 crores with an EBIT loss of Rs. 27 crores, primarily due to deferred shipments worth approximately Rs. 50 crores following the US FDA's Official Action Indicated (OAI) status issued to the company's Bangalore facility. The crop protection division maintained stable performance at Rs. 178 crores revenue with Rs. 17 crores EBIT, remaining largely flat year-on-year. Management expects the deferred pharmaceutical shipments to be recovered in Q2 and Q3, with 75-80% of corrective actions already completed and remaining measures to be finished by September. The company maintains its annual guidance of flat growth for crop protection and 12-14% growth for pharmaceuticals.",
            "Sentiment": "negative",
            "PublishDate": 1755081210072,
            "Source": "earnings"
        },
        {
            "Title": "Hikal Charts Recovery Path After Regulatory Issues, Targets Growth in H2 FY26",
            "Summary": "Hikal is working on recovery and growth following regulatory hurdles. The company is targeting strong performance in H2 FY26 and planning long-term expansion across its pharma, CDMO, and specialty chemicals business segments.",
            "Sentiment": "positive",
            "PublishDate": 1754571468780,
            "Source": "stock"
        },
        {
            "Title": "HIKAL Reports Q1 Net Loss of ₹224M Against Previous Year's Profit",
            "Summary": "HIKAL reported a net loss of ₹224 million in Q1 compared to a profit of ₹51 million in the same quarter last year. The company's revenue declined to ₹3.8 billion from ₹4 billion year-over-year. EBITDA dropped significantly to ₹251 million from ₹580 million, while EBITDA margin compressed to 6.6% from 14.26% in the corresponding period last year.",
            "Sentiment": "negative",
            "PublishDate": 1754556550678,
            "Source": "earnings"
        },
        {
            "Title": "Hikal's Jigani Unit Receives GMP Certification from Japan's PMDA",
            "Summary": "Hikal Limited announced that its Jigani Unit in Bangalore has received Good Manufacturing Practices (GMP) certification from Japan's Pharmaceutical and Medical Device Agency (PMDA). The PMDA conducted an inspection of the Hikal Bangalore (Unit-1) site from May 19th to 22nd, 2025. The certification confirms that the company's plant located at 82/A, KIADB Industrial Area, Jigani, Anekal Taluk, Bangalore, Karnataka complies with Japan's GMP guidelines for Active Pharmaceutical Ingredients.",
            "Sentiment": "positive",
            "PublishDate": 1753870819428,
            "Source": "stock"
        },
        {
            "Title": "Hikal Passes Brazilian Anvisa GMP Audit for Jigani Unit",
            "Summary": "Hikal has successfully passed a Good Manufacturing Practice (GMP) audit conducted by Brazilian Anvisa for its Jigani unit. Anvisa is Brazil's health regulatory agency, and passing this audit suggests that Hikal's manufacturing practices at the Jigani facility meet Brazilian regulatory standards.",
            "Sentiment": "positive",
            "PublishDate": 1750118875000,
            "Source": "default"
        },
        {
            "Title": "Hikal Passes Brazilian ANVISA GMP Audit for Jigani Facility",
            "Summary": "Hikal has successfully completed a Good Manufacturing Practice (GMP) audit conducted by ANVISA, the Brazilian regulatory authority, for its facility in Jigani. This audit approval is significant for the company's operations and compliance standards.",
            "Sentiment": "positive",
            "PublishDate": 1750075400000,
            "Source": "default"
        },
        {
            "Title": "Hikal's Jigani Facility Receives 'Official Action Indicated' Classification from FDA",
            "Summary": "Hikal has reported that its Jigani facility's FDA inspection has been classified as 'Official Action Indicated'. The company states its commitment to working closely with the US FDA, maintaining high-quality and compliant manufacturing standards across all facilities, and enhancing its compliance on an ongoing basis.",
            "Sentiment": "negative",
            "PublishDate": 1748223234000,
            "Source": "default"
        },
        {
            "Title": "Hikal's Jigani Facility Receives 'Official Action Indicated' Classification from FDA",
            "Summary": "Hikal announced that its Jigani facility has been classified as 'Official Action Indicated' following an FDA inspection. The company stated its commitment to work closely with the US FDA and maintain high-quality, compliant manufacturing standards across all its facilities. Hikal also emphasized its ongoing efforts to enhance compliance.",
            "Sentiment": "negative",
            "PublishDate": 1748003667000,
            "Source": "default"
        },
        {
            "Title": "HIKAL Reports Strong Q4 Financial Performance",
            "Summary": "HIKAL has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 1.23 billion rupees from 945 million rupees in the previous year. The EBITDA margin also improved, rising to 22.34% from 18.38%. Additionally, HIKAL's consolidated net profit for Q4 grew to 502 million rupees, up from 340 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747212261000,
            "Source": "result"
        },
        {
            "Title": "Hikal to Consider Q4 Results on May 14",
            "Summary": "Hikal Limited has announced that it will consider and approve its financial results for the fourth quarter on May 14.",
            "Sentiment": "neutral",
            "PublishDate": 1746537618000,
            "Source": "default"
        },
        {
            "Title": "Hikal Reports Stable Q3 Revenue",
            "Summary": "Hikal Limited announced its third-quarter revenue of 4.48 billion rupees, showing a marginal increase from 4.47 billion rupees in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1738661380000,
            "Source": "earnings"
        },
        {
            "Title": "HIKAL Reports Improved Q3 EBITDA and Margin",
            "Summary": "HIKAL, a pharmaceutical and crop protection company, has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 721 million rupees from 648 million rupees in the same quarter last year. Additionally, HIKAL's EBITDA margin improved to 16.10% from 14.47% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738661372000,
            "Source": "earnings"
        },
        {
            "Title": "Hikal Reports Increase in Q3 Consolidated Net Profit",
            "Summary": "Hikal Limited has announced its financial results for the third quarter. The company's consolidated net profit increased to 172 million rupees, up from 161 million rupees in the same period last year, showing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738661346000,
            "Source": "earnings"
        },
        {
            "Title": "Hikal Ltd: Hiremaths Refute Allegations of Suppressing Vaghul's Letter",
            "Summary": "Hikal promoters Sugandha and Jai Hiremath deny allegations by Kalyani Investment Company Ltd (KICL) of suppressing correspondence from N. Vaghul regarding a family arrangement to transfer Hikal shares. The Hiremaths maintain they have not withheld information and reject claims of market manipulation. The dispute centers on a 1994 family agreement between the Kalyani and Hiremath families, which is currently under legal review in the Bombay High Court.",
            "Sentiment": "neutral",
            "PublishDate": 1737058076000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hikal Ltd: Promoters Disclose Family Deed Documents to SEBI Amid Kalyani Family Dispute",
            "Summary": "Hikal Ltd. promoters have submitted family deed documents from 1993 and 1994 to SEBI, relating to a dispute over share ownership and family wealth distribution within the Kalyani family. The Hiremath family has initiated legal proceedings against Baba Kalyani in the Bombay High Court, while a separate dispute in a Pune court could potentially impact Kalyani group companies' ownership structure.",
            "Sentiment": "neutral",
            "PublishDate": 1736761446000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hikal: Settles Sebi Case with ₹43.9 Lakh Payment",
            "Summary": "Hikal paid ₹43.9 lakh to settle a case with Sebi regarding violations of listing and disclosure norms. The case involved inadequate and misleading disclosures related to an incident of illegal discharge of hazardous chemicals.",
            "Sentiment": "neutral",
            "PublishDate": 1732839299000,
            "Source": "corporate_governance"
        },
        {
            "Title": "HIKAL Reports Strong Q2 Financial Performance",
            "Summary": "HIKAL has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 575 million rupees to 749 million rupees. Additionally, HIKAL's EBITDA margin expanded from 13.23% to 16.54% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731401747000,
            "Source": "result"
        },
        {
            "Title": "HIKAL Reports Q2 Revenue Growth",
            "Summary": "HIKAL, an Indian company, has reported its second quarter revenue for the current fiscal year. The company's revenue for Q2 stood at 4.5 billion rupees, compared to 4.34 billion rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731401713000,
            "Source": "result"
        },
        {
            "Title": "Hikal Reports Increased Q2 Profit",
            "Summary": "Hikal Limited has reported a consolidated net profit of 183 million rupees for the second quarter, compared to 126 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731401692000,
            "Source": "result"
        }
    ]
}