{
    "Symbol": "HILINFRA",
    "ISIN": "INE00RL01028",
    "News": [
        {
            "Title": "Highway Infrastructure Schedules Q3FY26 Earnings Call",
            "Summary": "Highway Infrastructure Limited announces earnings conference call for February 9, 2026 to discuss Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770119904182,
            "Source": "co_actions_results"
        },
        {
            "Title": "Highway Infrastructure Director Resigns Due to Health",
            "Summary": "Highway Infrastructure Limited announces resignation of Independent Director Mr. Om Prakash Shrivastava effective January 28, 2026, citing health reasons as the primary cause for his departure.",
            "Sentiment": "neutral",
            "PublishDate": 1769588219725,
            "Source": "stocks"
        },
        {
            "Title": "Highway Infrastructure Bags Orders Worth ₹494.7 Cr",
            "Summary": "Highway Infrastructure Ltd secured orders worth ₹494.7 crore between December 2025 and January 2026, exceeding its ₹373 crore market cap. The company's order book grew 46% to ₹775 crore in six months.",
            "Sentiment": "positive",
            "PublishDate": 1769092793831,
            "Source": "co_actions_results"
        },
        {
            "Title": "Highway Infrastructure Wins ₹64.69 Cr NHAI Contract",
            "Summary": "Highway Infrastructure Limited secures Letter of Acceptance worth ₹64.69 crores from NHAI for operations at Mundka Fee Plaza under UER-11 project in Delhi and Haryana, with 90-day execution timeline.",
            "Sentiment": "positive",
            "PublishDate": 1768825624303,
            "Source": "co_actions_results"
        },
        {
            "Title": "Highway Infrastructure appoints Vinayak Parkhi as Director",
            "Summary": "Highway Infrastructure Limited successfully concluded postal ballot voting on January 14, 2026, with 99.99% approval for appointing Mr. Vinayak Parkhi as Independent Director through remote e-voting process.",
            "Sentiment": "positive",
            "PublishDate": 1768549997913,
            "Source": "stocks"
        },
        {
            "Title": "Highway Infrastructure receives acceptance letter for ₹69.7cr",
            "Summary": "Highway Infrastructure Limited receives formal acceptance letter for ₹69.69 crore road development contract from Indore Development Authority, confirming project commencement under Town Planning Scheme-08.",
            "Sentiment": "positive",
            "PublishDate": 1768464917467,
            "Source": "co_actions_results"
        },
        {
            "Title": "Highway Infrastructure wins ₹328-cr NHAI contract",
            "Summary": "Highway Infrastructure Limited secured a ₹328-crore contract from NHAI for operating toll collection at Kaza Fee Plaza on NH-16 in Andhra Pradesh. The one-year contract covers 82.5 km stretch operations starting January 23, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767935089909,
            "Source": "co_actions_results"
        },
        {
            "Title": "Highway Infrastructure Secures ₹329 Crore Order",
            "Summary": "Highway Infrastructure has announced securing a significant order worth ₹329 crores, marking a notable business development for the infrastructure company.",
            "Sentiment": "positive",
            "PublishDate": 1767924746593,
            "Source": "co_actions_results"
        },
        {
            "Title": "Highway Infrastructure Secures ₹3.29 Billion Order",
            "Summary": "Highway Infrastructure Ltd has received a significant infrastructure order worth ₹3.29 billion, marking a major business development for the company in the construction sector.",
            "Sentiment": "positive",
            "PublishDate": 1767878847811,
            "Source": "co_actions_results"
        },
        {
            "Title": "Highway Infrastructure wins ₹32 cr NHAI toll contract",
            "Summary": "Highway Infrastructure Limited secured ₹32.00 crores NHAI contract for Jawar Fee Plaza operations in Uttar Pradesh, strengthening toll operations portfolio with consolidated order book exceeding ₹1,000 crores.",
            "Sentiment": "positive",
            "PublishDate": 1767621123431,
            "Source": "co_actions_results"
        },
        {
            "Title": "Highway Infrastructure Gets NHAI Contract Extension",
            "Summary": "Highway Infrastructure Limited receives one-month extension for toll collection operations on Delhi-Vadodara Expressway spur in Rajasthan, with contract value of ₹6.18 crores from NHAI.",
            "Sentiment": "positive",
            "PublishDate": 1765385551570,
            "Source": "co_actions_results"
        },
        {
            "Title": "Highway Infrastructure Seeks Shareholder Approval",
            "Summary": "Highway Infrastructure Limited announces postal ballot for appointment of Mr. Vinayak Parkhi as Non-Executive Independent Director. E-voting period runs from December 13, 2025 to January 11, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1765382958348,
            "Source": "stocks"
        },
        {
            "Title": "Highway Infrastructure Receives ₹329 Crore LOA",
            "Summary": "Highway Infrastructure Limited secures Letter of Award worth ₹329 crores for infrastructure project development, marking significant business milestone for the construction company.",
            "Sentiment": "positive",
            "PublishDate": 1765375043926,
            "Source": "stocks"
        },
        {
            "Title": "Highway Infrastructure Limited Seeks Shareholder Approval for Independent Director Appointment via Postal Ballot",
            "Summary": "Highway Infrastructure Limited has issued a postal ballot notice seeking member approval through special resolution for the appointment of Mr. Vinayak Parkhi as Non-Executive Independent Director for a five-year term from November 6, 2025 to November 5, 2030. The e-voting period runs from December 13, 2025 to January 11, 2026, with results to be announced by January 13, 2026, affecting all shareholders eligible to vote as of the December 5, 2025 cut-off date.",
            "Sentiment": "neutral",
            "PublishDate": 1765360375510,
            "Source": "corporate_action"
        },
        {
            "Title": "Highway Infrastructure Secures ₹328.77 Crore Contract from NHAI, Order Book Crosses ₹1,000 Crores",
            "Summary": "Highway Infrastructure received its largest single contract worth ₹328.77 crores from NHAI, pushing its total order book beyond ₹1,000 crores with a 103% increase since March 2025. The development significantly strengthens the company's project pipeline, with the firm currently holding a market capitalization of ₹471 crores.",
            "Sentiment": "positive",
            "PublishDate": 1765351950244,
            "Source": "order&deals"
        },
        {
            "Title": "Highway Infrastructure Company Secures 3.29 Billion Rupees Letter of Award",
            "Summary": "A highway infrastructure company has received a Letter of Award (LOA) worth 3.29 billion rupees for a project contract. This significant contract award will impact the company's revenue pipeline and business operations in the infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1765322810355,
            "Source": "stock"
        },
        {
            "Title": "Highway Infrastructure Limited Reports 253% EBITDA Growth in Q2 FY26 Earnings Call",
            "Summary": "Highway Infrastructure Limited held its first earnings conference call since listing, discussing results for the quarter and half-year ended September 30, 2025. The company reported total revenue of Rs. 115.3 crores in Q2 FY26 compared to Rs. 119.4 crores in Q2 FY25. EBITDA increased significantly by 253% year-on-year to Rs. 13.7 crores against Rs. 3.9 crores in Q2 FY25. For H1 FY26, total revenue was Rs. 227.8 crores against Rs. 226.8 crores in H1 FY25, with EBITDA growing 102% to Rs. 25.8 crores. Profit after tax surged 515% year-on-year to Rs. 9.7 crores in Q2 FY26. The company achieved its highest ever order book of Rs. 775 crores, up 46% in H1 FY26. Highway Infrastructure operates across three verticals: EPC Infrastructure, Tollway Collection, and Real Estate. The company commenced toll collection at multiple new plazas and secured new EPC contracts. Management expects 60-65% of annual revenue to be booked in Q3 and Q4. The debt-to-equity ratio stands at 0.28x with net cash equivalents of Rs. 52.8 crores. The company targets EBITDA margins of 8-12% for FY27-28 and aims for an order book of Rs. 1,000 crores by year-end.",
            "Sentiment": "positive",
            "PublishDate": 1762846303292,
            "Source": "earnings"
        },
        {
            "Title": "Highway Infrastructure Limited Reports No Deviation in IPO Fund Utilization for September Quarter",
            "Summary": "Highway Infrastructure Limited submitted its monitoring agency report for IPO fund utilization during the quarter ended September 30, 2025. The company raised Rs. 97.52 crores through fresh issue with net proceeds of Rs. 81.85 crores after deducting issue expenses of Rs. 15.67 crores. Out of the net proceeds, Rs. 44.72 crores was utilized during the quarter - Rs. 43.84 crores for working capital requirements and Rs. 0.88 crores for general corporate purposes. The monitoring agency Infomerics Valuation and Rating Limited reported no deviation from disclosed objects and no material deviations from expenditures mentioned in the offer document. Unutilized funds of Rs. 37.13 crores were deployed in fixed deposits with HDFC Bank earning returns between 5% to 5.25%. The company's statutory auditors certified that funds were utilized as per the prospectus with no material deviations observed.",
            "Sentiment": "neutral",
            "PublishDate": 1762844711558,
            "Source": "stock"
        },
        {
            "Title": "Highway Infrastructure Limited Reports Strong Q2 FY26 Results with 46% Order Book Growth",
            "Summary": "Highway Infrastructure Limited submitted its investor presentation for Q2 FY2025-26 results. The company reported total revenue of Rs. 227.8 crores for H1FY26, up 0.4% year-on-year. Profit after tax increased significantly to Rs. 16.9 crores in H1FY26 from Rs. 5.8 crores in H1FY25, representing 191.8% growth. EBITDA doubled to Rs. 25.8 crores in H1FY26 from Rs. 12.7 crores in H1FY25. The company's order book grew 46% to Rs. 775 crores by September 2025 from Rs. 530 crores in March 2025. Highway Infrastructure operates across three business segments: EPC Infrastructure (77% of revenue), Tollway Collection (21%), and Real Estate (2%). The company has presence across 11 states and 1 union territory with 90 completed projects and 25 ongoing projects. Return on equity improved to 19.1% in FY25. The debt-to-equity ratio decreased to 0.61x, and net worth increased to Rs. 210.6 crores by September 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762461851083,
            "Source": "earnings"
        },
        {
            "Title": "Highway Infrastructure Limited Reports Quarterly Results and Appoints New Independent Director",
            "Summary": "Highway Infrastructure Limited's Board approved unaudited financial results for the quarter and half year ended September 30, 2025. The company appointed Mr. Vinayak Parkhi as Additional Director (Non-Executive Independent Director) for a five-year tenure from November 6, 2025 to November 5, 2030, subject to shareholder approval. Mr. Parkhi is a Chartered Accountant with over three decades of experience in banking and housing finance, having served at HDFC Limited as Regional Business Head and Senior Vice President. The company operates in tollway collection, EPC infrastructure, and real estate segments. The financial results were reviewed by the Audit Committee and approved by the Board of Directors.",
            "Sentiment": "neutral",
            "PublishDate": 1762457307618,
            "Source": "corporate_action"
        },
        {
            "Title": "Highway Infrastructure Reports Mixed Q2 Results with Profit Surge Despite Revenue Decline",
            "Summary": "Highway Infrastructure reported quarterly net profit of 96 million rupees compared to 14 million rupees in the same period last year. Revenue decreased to 946 million rupees from 1.17 billion rupees year-over-year. EBITDA increased significantly to 128 million rupees from 13 million rupees, while EBITDA margin improved to 13.51% from 1.09% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762446812495,
            "Source": "earnings"
        },
        {
            "Title": "Highway Infrastructure Company Wins Contract Worth Up To 117.6 Million Rupees",
            "Summary": "A highway infrastructure company has secured a contract with a maximum value of 117.6 million rupees. The contract relates to highway infrastructure development work.",
            "Sentiment": "positive",
            "PublishDate": 1761743725747,
            "Source": "stock"
        },
        {
            "Title": "Highway Infrastructure Limited Secures Two E-Bus Charging Infrastructure Contracts Worth Rs 3.05 Crore",
            "Summary": "Highway Infrastructure Limited has entered into contract agreements for two PM E-Bus Seva projects involving supply, installation, testing and commissioning of external electrification infrastructure for e-bus charging. The first contract for Dewas Naka Depot, Niranjanpur is valued at Rs 1.09 crore, while the second contract for Nayta Mundla is worth Rs 1.96 crore. Both contracts were awarded by Atal Indore City Transport Services Limited and have a four-month execution timeline from the contract signing date of October 15, 2025. The projects require performance security of 3% and additional performance bank guarantees of 14% and 13% respectively in the form of term deposit receipts.",
            "Sentiment": "positive",
            "PublishDate": 1761648238189,
            "Source": "stock"
        },
        {
            "Title": "Highway Infrastructure Secures ₹11.76 Crore Approval for 4-Lane Ujjain-Garoth Project",
            "Summary": "Highway Infrastructure has received approval for a 4-lane highway project on NH-752D connecting Ujjain and Garoth. The project is valued at ₹11.76 crores and is scheduled to be completed within 90 days.",
            "Sentiment": "positive",
            "PublishDate": 1761210018563,
            "Source": "stock"
        },
        {
            "Title": "Highway Infrastructure Limited Secures ₹252.6 Crore Toll Plaza Operations Contract on Delhi-Vadodara Expressway",
            "Summary": "Highway Infrastructure Limited has entered into a contract agreement with the National Highways Authority of India (NHAI) for operating an eight-lane expressway toll plaza between Laban Village and Gopalpura Village in Rajasthan. The contract, valued at ₹25.26 crores, covers toll plaza operations on the Delhi-Vadodara Expressway from Km 337.171 to Km 417.810. The company took over operations on October 18, 2025, with the contract to be executed within 90 days. The scope includes user fee collection for the eight-lane access controlled expressway and upkeep of adjacent toilet blocks. This is a domestic contract with no related party transactions or promoter group interests involved.",
            "Sentiment": "positive",
            "PublishDate": 1760705944000,
            "Source": "stock"
        },
        {
            "Title": "Highway Infrastructure Secures Rs. 25 Crore Toll Operations Contract from NHAI",
            "Summary": "Highway Infrastructure has received approval for a toll operations contract valued at approximately Rs. 25 crores from the National Highways Authority of India (NHAI). The contract relates to toll collection operations on highway infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1760448148175,
            "Source": "stock"
        },
        {
            "Title": "Highway Infrastructure Limited Secures Rs 252.6 Crore Expressway Operation Contract from NHAI",
            "Summary": "Highway Infrastructure Limited received a Letter of Acceptance from the National Highways Authority of India for operating an eight-lane expressway project in Rajasthan. The contract covers the stretch from Laban Village in Bundi district to Gopalpura village in Kota district, spanning from Km 337.171 to Km 417.810. The agreement is valued at Rs 252.6 crore and involves user fee collection for the expressway and maintenance of adjacent toilet blocks. The contract must be executed within 90 days. This is a domestic contract with no related party transactions or promoter group interests involved.",
            "Sentiment": "positive",
            "PublishDate": 1760372878906,
            "Source": "order&deals"
        },
        {
            "Title": "Highway Infrastructure Limited Secures Rs 1.96 Crore EPC Contract for E-Bus Charging Infrastructure",
            "Summary": "Highway Infrastructure Limited received a Letter of Acceptance for an EPC service contract worth Rs 1.96 crore from Atal Indore City Transport Services Limited. The contract involves supply, installation, testing and commissioning of external electrification infrastructure for E-bus charging at Nayta Mundla under the PM E-Bus Seva program. The project must be completed within four months from contract signing. The contract requires performance security of 3% and additional performance bank guarantee of 13% in the form of Term Deposit Receipts.",
            "Sentiment": "positive",
            "PublishDate": 1759493166025,
            "Source": "stock"
        },
        {
            "Title": "Highway Infrastructure Limited Secures Rs 1.09 Crore EPC Contract for E-Bus Charging Infrastructure",
            "Summary": "Highway Infrastructure Limited received a Letter of Acceptance for an EPC service contract worth Rs 1.09 crore from Atal Indore City Transport Services Limited. The contract involves supply, installation, testing and commissioning of external electrification infrastructure for E-bus charging at Dewas Naka Depot under the PM E-Bus Seva program. The project must be completed within four months from contract signing. The contract requires a 3% performance security and an additional 14% performance bank guarantee in the form of Term Deposit Receipts. This is a domestic contract with no related party transactions or promoter group interests involved.",
            "Sentiment": "positive",
            "PublishDate": 1759492433295,
            "Source": "order&deals"
        },
        {
            "Title": "Highway Infrastructure Company Wins Rs. 31 Crore Contract for Chotiya Fee Plaza Operations",
            "Summary": "Highway Infrastructure Company has secured a Rs. 31 crore contract for the operation of Chotiya Fee Plaza located in Chhattisgarh. The contract involves managing the toll plaza operations in the state.",
            "Sentiment": "positive",
            "PublishDate": 1758730758317,
            "Source": "stock"
        },
        {
            "Title": "Highway Infrastructure Co Secures ₹189.7 Crore NHAI Contract for Toll Plaza Operations",
            "Summary": "Highway Infrastructure Co has signed a ₹189.7 crore contract with the National Highways Authority of India (NHAI) for toll plaza operations on the Delhi-Vadodara Greenfield Expressway spur to Jaipur. The agreement involves the company managing toll collection services on this highway segment.",
            "Sentiment": "positive",
            "PublishDate": 1757515147875,
            "Source": "order&deals"
        },
        {
            "Title": "Highway Infrastructure Co Secures Rs. 69.78 Crore NHAI Contract for Toll Plaza Operations",
            "Summary": "Highway Infrastructure Co has signed a contract worth Rs. 69.78 crore with the National Highway Authority of India (NHAI) to operate the Muzaina Hetim Toll Plaza located in Uttar Pradesh. The agreement grants the company operational rights for the toll collection facility.",
            "Sentiment": "positive",
            "PublishDate": 1757506215868,
            "Source": "stock"
        },
        {
            "Title": "Highway Infrastructure Limited Appoints Riddharth Jain as Chief Executive Officer",
            "Summary": "Highway Infrastructure Limited appointed Mr. Riddharth Jain as Chief Executive Officer effective September 6, 2025. Jain is a Non-Independent Director and Promoter of the company, and son of Managing Director Mr. Arun Kumar Jain. He holds a Bachelor of Architecture degree from Narsee Monjee Institute of Management Studies in Mumbai and a Master of Science in Design from the University of Pennsylvania. The company also updated its list of Key Managerial Personnel for determining materiality of events, which now includes Jain alongside Managing Director Arun Kumar Jain, Whole Time Director & CFO Anoop Agrawal, and Company Secretary Palak Rathore.",
            "Sentiment": "positive",
            "PublishDate": 1757140708928,
            "Source": "corporate_governance"
        },
        {
            "Title": "Highway Infrastructure Limited CEO Ankit Tandon Resigns to Pursue Entrepreneurial Journey",
            "Summary": "Ankit Tandon has resigned from his position as Chief Executive Officer of Highway Infrastructure Limited, effective from the close of business hours on September 5, 2025. The resignation was announced to pursue his entrepreneurial journey. Highway Infrastructure Limited is listed on both NSE and BSE with scrip symbol HILINFRA and scrip code 544477.",
            "Sentiment": "neutral",
            "PublishDate": 1757071078315,
            "Source": "corporate_governance"
        },
        {
            "Title": "Highway Infrastructure Company Wins ₹18.97 Crore NHAI Contract for Delhi-Vadodara Expressway",
            "Summary": "A highway infrastructure company has secured a ₹18.97 crore contract from the National Highways Authority of India (NHAI) for operations related to the Delhi-Vadodara Expressway spur. The contract involves operational activities for this expressway segment.",
            "Sentiment": "positive",
            "PublishDate": 1756913744922,
            "Source": "stock"
        },
        {
            "Title": "Highway Infrastructure Limited Launches Neww York City Phase-4 Real Estate Project in Indore",
            "Summary": "Highway Infrastructure Limited launched a new residential real estate project called 'Neww York City Phase-4' in Indore, Madhya Pradesh on August 28, 2025. The project spans approximately 174,582.40 sq.ft. and is located opposite SAGE University on Rau-Bypass. The development has received RERA registration number P-IND-25-5864 and targets the domestic market.",
            "Sentiment": "positive",
            "PublishDate": 1756353735843,
            "Source": "stock"
        },
        {
            "Title": "Highway Infrastructure Limited Commences Toll Collection at Kiratpur Fee Plaza Worth Rs. 84.78 Crores",
            "Summary": "Highway Infrastructure Limited has started toll collection operations at Kiratpur Fee Plaza in Uttar Pradesh. The project has a contract value of Rs. 84,77,77,777. The company had received the Letter of Award from the National Highways Authority of India on July 17, 2025 for this project.",
            "Sentiment": "positive",
            "PublishDate": 1756093793956,
            "Source": "stock"
        }
    ]
}