{
    "Symbol": "HILTON",
    "ISIN": "INE788H01017",
    "News": [
        {
            "Title": "Hilton Metal Forging Schedules Board Meeting to Finalize Rights Issue Details",
            "Summary": "Hilton Metal Forging Limited has scheduled a board meeting for December 10, 2025, to consider and approve the rights issue size, price, entitlement ratio, and Letter of Offer while fixing the record date for eligible shareholders. The company has closed its trading window from December 07, 2025, until 48 hours after the board meeting concludes.",
            "Sentiment": "neutral",
            "PublishDate": 1765120565228,
            "Source": "corporate_action"
        },
        {
            "Title": "Hilton Metal Forging Approves Rights Issue to Raise Up to Rs 32 Crore",
            "Summary": "Hilton Metal Forging's board approved a rights issue of equity shares with face value Rs 10 each to raise funds not exceeding Rs 32 crore for eligible shareholders. The detailed terms including issue price, rights entitlement ratio, and record date will be determined by the board after receiving necessary regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1764772176972,
            "Source": "corporate_action"
        },
        {
            "Title": "Hilton Metal Forging Promoter Increases Stake Through Off-Market Share Acquisition",
            "Summary": "Promoter Yuvraj Hiralal Malhotra acquired 2,42,790 equity shares of Hilton Metal Forging Limited through off-market transactions, increasing his shareholding from 5.47% to 6.51%. The acquisition was completed on November 19, 2025, and disclosed under SEBI takeover regulations to stock exchanges BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1763704885548,
            "Source": "corporate_action"
        },
        {
            "Title": "Hilton Metal Forging Reports Strong Q2 Results, Postpones Rights Issue Plans",
            "Summary": "Hilton Metal Forging Limited reported quarterly profit after tax of Rs 174.13 lacs for the quarter ended September 30, 2025, compared to Rs 62.12 lacs in the same period last year, with revenues from operations rising to Rs 8764.01 lacs. The Board postponed its rights issue fundraising plans for more detailed deliberation at an upcoming meeting, while approving the quarterly financial results in their November 13, 2025 board meeting.",
            "Sentiment": "positive",
            "PublishDate": 1763057287173,
            "Source": "earnings"
        },
        {
            "Title": "Hilton Metal Forging Schedules EGM to Increase Authorized Share Capital and Investment Limits",
            "Summary": "Hilton Metal Forging Limited has scheduled an Extra-Ordinary General Meeting for December 2, 2025, to consider three key resolutions. The company proposes to increase its authorized share capital from Rs. 35 crore to Rs. 55 crore, divided into 5.5 crore equity shares of Rs. 10 each. The meeting will also address increasing investment limits for movable and immovable assets to Rs. 50 crore, and approving remuneration of Rs. 5 lakh per month for Chief Financial Officer Mohak Malhotra. The EGM will be conducted through video conferencing, with remote e-voting available from November 29 to December 1, 2025. The record date for voting eligibility is November 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762822216741,
            "Source": "corporate_action"
        },
        {
            "Title": "Hilton Metal Forging Board Approves Authorized Share Capital Increase and CFO Remuneration Hike",
            "Summary": "Hilton Metal Forging Limited's Board of Directors approved several key resolutions during their meeting. The company plans to increase its authorized share capital from Rs. 35 crores to Rs. 55 crores, subject to shareholder approval. The board also approved increasing investment limits for both movable and immovable properties and assets, and enhanced the remuneration of Chief Financial Officer Mohak Malhotra. An Extra-Ordinary General Meeting has been scheduled for December 2, 2025, via video conferencing to seek shareholder approvals for these proposals. The company's trading window remains closed since October 1, 2025, and will continue until 48 hours after the declaration of financial results for the quarter and half-year ended September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762298663772,
            "Source": "corporate_action"
        },
        {
            "Title": "Hilton Metal Forging Reports 14.81 Lakh Profit for Quarter Ended June 2025",
            "Summary": "Hilton Metal Forging Limited's Board approved quarterly standalone financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 2,205.05 lakh compared to Rs 3,403.27 lakh in the same quarter last year. Net profit for the quarter was Rs 14.81 lakh, down from Rs 57.45 lakh in the corresponding quarter of the previous year. The company's total income decreased to Rs 2,242.58 lakh from Rs 3,435.61 lakh year-on-year. Basic and diluted earnings per share stood at Rs 0.06 for the quarter. The company operates as a single segment manufacturing forging components including flanges and forged fittings, with no subsidiaries, joint ventures or associates.",
            "Sentiment": "negative",
            "PublishDate": 1755181450163,
            "Source": "earnings"
        },
        {
            "Title": "Hilton Metal Forging Receives Feasibility Approval for Vande Bharat and LHB Forged Wheels",
            "Summary": "Hilton Metal Forging has received feasibility and production capability approval for the development of Vande Bharat and LHB forged wheels from RITES Ltd. This approval suggests that the company has been deemed capable of producing these specific types of wheels for railway applications.",
            "Sentiment": "positive",
            "PublishDate": 1750636704000,
            "Source": "default"
        },
        {
            "Title": "Hilton Metal Forging Receives Approval for Vande Bharat and LHB Forged Wheels",
            "Summary": "Hilton Metal Forging has received approval from RITES Ltd for Vande Bharat and LHB forged wheels. This approval is significant for the company's involvement in railway infrastructure projects.",
            "Sentiment": "positive",
            "PublishDate": 1750490672000,
            "Source": "default"
        },
        {
            "Title": "Hilton Metal Forging Plans Expansion in Railway Wagon Wheelset Production",
            "Summary": "Hilton Metal Forging aims to manufacture over 3,000 railway forged wagon wheelsets in FY26, with plans to increase production to over 12,000 in FY27. This expansion is part of the company's efforts to enhance its railway business under the 'Make in India' initiative. The company seeks to address rising demand from railway wagon manufacturers and reduce imports from China. Hilton Metal Forging has already achieved success in manufacturing forged railway wagon wheel sets.",
            "Sentiment": "positive",
            "PublishDate": 1749611220000,
            "Source": "default"
        }
    ]
}