{
    "Symbol": "HIMATSEIDE",
    "ISIN": "INE049A01027",
    "News": [
        {
            "Title": "Himatsingka Seide Q3FY26 Earnings Call on Feb 12",
            "Summary": "Himatsingka Seide Limited announces earnings call scheduled for February 12, 2026 at 15:00 hrs IST to discuss Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770625913548,
            "Source": "co_actions_results"
        },
        {
            "Title": "Himatsingka Seide Auditors Convert to LLP Structure",
            "Summary": "Himatsingka Seide Limited announces conversion of statutory auditors M S K A & Associates from partnership firm to Limited Liability Partnership effective January 13, 2026, with no impact on audit engagement.",
            "Sentiment": "neutral",
            "PublishDate": 1768550996575,
            "Source": "stocks"
        },
        {
            "Title": "Himatsingka Seide Senior Management Change",
            "Summary": "Himatsingka Seide Limited announces retirement of Man Kapur, President-Business Development (Group), Sales, effective December 15, 2025, as disclosed under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765805790228,
            "Source": "stocks"
        },
        {
            "Title": "Himatsingka Seide Allots ₹100 Cr Series B NCDs",
            "Summary": "Himatsingka Seide Limited completed allotment of 1,000 Series B Non-Convertible Debentures worth ₹100 crores on December 19, 2025, with maturity date set for March 19, 2029.",
            "Sentiment": "positive",
            "PublishDate": 1765548986333,
            "Source": "co_actions_results"
        },
        {
            "Title": "Himatsingka Seide Schedules Board Meeting to Discuss NCD Fundraising",
            "Summary": "Himatsingka Seide has scheduled a board meeting for December 12 to discuss fundraising through Non-Convertible Debentures (NCDs). The meeting will focus on the company's debt fundraising strategy through this financial instrument.",
            "Sentiment": "neutral",
            "PublishDate": 1765291510133,
            "Source": "corporate_action"
        },
        {
            "Title": "Himatsingka Seide Reports 9.3% Revenue Decline in Q2FY26 Due to US Tariff Impact",
            "Summary": "Himatsingka Seide's consolidated revenue dropped to INR 629 crores from INR 694 crores in Q2FY26, primarily due to ongoing 50% US tariffs affecting their revenue streams. The company plans to reduce US exposure below 50% over the next couple of years while exploring equity fundraising of up to INR 500 crores for balance sheet deleveraging.",
            "Sentiment": "negative",
            "PublishDate": 1763375470937,
            "Source": "earnings"
        },
        {
            "Title": "Himatsingka Seide Completes Rs 400 Crore QIP Fund Utilization for Debt Repayment",
            "Summary": "Himatsingka Seide Limited has fully utilized its Rs 400 crore Qualified Institutional Placement (QIP) proceeds for debt repayment in the quarter ended September 30, 2025. The company had originally planned to complete debt repayment by the end of fiscal year 2025 but obtained a Board resolution extension in March 2025, revising the timeline to the second quarter of fiscal year 2026. CARE Ratings Limited, serving as the monitoring agency, reported no deviation from the stated objectives. The QIP funds were allocated across three categories: Rs 300 crore for repayment of outstanding borrowings by the company and its subsidiaries, Rs 77.60 crore for general corporate purposes, and Rs 22.40 crore for issue-related expenses. The monitoring agency confirmed that all government and statutory approvals related to the objectives have been obtained and the utilization was as per the disclosure in the offer document.",
            "Sentiment": "positive",
            "PublishDate": 1762992494654,
            "Source": "corporate_action"
        },
        {
            "Title": "Himatsingka Seide Reports Quarterly Results with Revenue of ₹629.57 Crores",
            "Summary": "Himatsingka Seide Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported consolidated revenue from operations of ₹629.57 crores for the quarter, compared to ₹655.93 crores in the previous quarter and ₹632.95 crores in the same quarter last year. The company posted a consolidated profit after tax of ₹5,122.48 crores for the quarter. On a standalone basis, revenue was ₹479.24 crores for the quarter versus ₹368.08 crores in the previous quarter. The Board of Directors approved these results in their meeting held on November 12, 2025. The company operates primarily in the textiles segment and has subsidiaries including Himatsingka Wovens Private Limited and Himatsingka Holdings NA Inc.",
            "Sentiment": "neutral",
            "PublishDate": 1762981543701,
            "Source": "earnings"
        },
        {
            "Title": "Himatsingka Seide Reports Mixed Q2 Results with Profit Doubling Despite Revenue Decline",
            "Summary": "Himatsingka Seide reported Q2 consolidated net profit of 420 million rupees, nearly doubling from 217 million rupees in the same quarter last year. However, revenue declined to 6.3 billion rupees from 6.94 billion rupees year-over-year. EBITDA decreased to 991 million rupees from 1.38 billion rupees, while EBITDA margin compressed to 15.74% from 19.96% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762948312029,
            "Source": "earnings"
        },
        {
            "Title": "Himatsingka Seide Schedules Earnings Call for September 2025 Quarter Results",
            "Summary": "Himatsingka Seide Limited has announced an earnings call for Thursday, November 13, 2025, at 16:00 hrs IST to discuss unaudited financial results for the quarter and half year ended September 30, 2025. The call will be attended by Executive Vice Chairman Managing Director Shrikant Himatsingka, President Finance Group CFO Sankaranarayanan M, and Vice President CFO-Operations Bankesh Dhingra. The teleconference will be moderated by Elara Securities (India) Private Limited. The company's Board of Directors is scheduled to consider the unaudited financial results at their meeting on Wednesday, November 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762568207226,
            "Source": "earnings"
        },
        {
            "Title": "Himatsingka Seide Board Approves Securities Issuance Worth Up to Rs 500 Crores",
            "Summary": "Himatsingka Seide Limited's Board of Directors approved the issuance of equity shares and other eligible securities worth up to Rs 500 crores on October 23, 2025. The company will determine the specific type of issuance method at a later date, with options including public offerings, rights issues, or qualified institutional placements. This decision builds on a September 2, 2025 board proposal to raise funds through securities issuance. The board meeting lasted 25 minutes, from 7:30 p.m. to 7:55 p.m. The company stated it will finalize terms including security type, pricing, and timing in due course, subject to regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1761232644373,
            "Source": "corporate_action"
        },
        {
            "Title": "Himatsingka Seide Board to Meet on September 2, 2025 to Consider Fundraising Proposal",
            "Summary": "Himatsingka Seide has announced that its board will convene on September 2, 2025 to deliberate on a fundraising proposal. The meeting will focus on evaluating potential fundraising options for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1756396966021,
            "Source": "corporate_action"
        },
        {
            "Title": "Himatsingka Seide Limited Announces Retirement of Creative Head Jayshree Poddar",
            "Summary": "Himatsingka Seide Limited has announced a change in senior management personnel. Jayshree Poddar, who served as Creative Head - Design, has retired from the company effective August 25, 2025. The company disclosed this information to stock exchanges NSE and BSE under regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1756131170890,
            "Source": "corporate_governance"
        },
        {
            "Title": "Himatsingka Seide Reports 10.4% Revenue Decline Amid U.S. Tariff Uncertainties",
            "Summary": "Himatsingka Seide Limited, an integrated textile company specializing in home textiles, reported quarterly revenue of INR 661 crores, down 10.4% year-over-year. The company's EBITDA margin stood at 19%, declining 200 basis points quarter-on-quarter. Capacity utilization varied across segments with spinning at 99%, sheeting at 60%, and terry at 68%. The proposed additional 25% U.S. tariff has created uncertainties and impacted market sentiment. To mitigate risks, the company is expanding its global client base across 35 non-U.S. jurisdictions with over 70 clients, aiming to reduce U.S. revenue share from 60% to below 50% within 18-24 months. The company operates three brands in India - Himeya, Atmosphere, and Liv - targeting India revenue of INR 800-1000 crores over the next few years. Net debt decreased to INR 2,405 crores from INR 2,425 crores. Management maintains EBITDA margin guidance of 18-22% and targets revenue of approximately INR 4,000 crores with high 90s capacity utilization within two years.",
            "Sentiment": "negative",
            "PublishDate": 1755605425800,
            "Source": "earnings"
        },
        {
            "Title": "Himatsingka Seide Reports Decline in Q1 Financial Performance",
            "Summary": "Himatsingka Seide reported Q1 consolidated net profit of 109 million rupees, down from 206 million rupees in the same period last year. Revenue decreased to 6.56 billion rupees from 7.35 billion rupees year-over-year. EBITDA fell to 1.2 billion rupees compared to 1.46 billion rupees previously, while EBITDA margin contracted to 18.37% from 19.89% in the prior year period.",
            "Sentiment": "negative",
            "PublishDate": 1754999016838,
            "Source": "earnings"
        },
        {
            "Title": "Himatsingka Seide Reports Q4 Financial Results",
            "Summary": "Himatsingka Seide announced its Q4 financial results. The company's EBITDA decreased to 1.2 billion rupees from 1.45 billion rupees year-over-year. EBITDA margin declined to 17.93% from 20.75% year-over-year. Consolidated net profit fell to 119 million rupees from 237.4 million rupees year-over-year and 218 million rupees quarter-over-quarter. Revenue for Q4 was 6.56 billion rupees, down from 6.97 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1748444275000,
            "Source": "result"
        },
        {
            "Title": "Himatsingka Seide Approves Issuance of Non-Convertible Debentures",
            "Summary": "Himatsingka Seide has approved the issuance of Non-Convertible Debentures (NCDs) worth 650 million rupees. This decision represents a significant financial move for the company, potentially aimed at raising capital for various corporate purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1744893404000,
            "Source": "default"
        },
        {
            "Title": "Himatsingka Seide to Consider Fund Raising via Private Placement of NCDs",
            "Summary": "Himatsingka Seide has scheduled a board meeting on April 17 to consider and approve a proposal for raising funds through the issuance of Non-Convertible Debentures (NCDs) on a private placement basis. The funds raised will be used for refinancing existing debt and general corporate purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1744371587000,
            "Source": "corporate_action"
        },
        {
            "Title": "Himatsingka Seide Reports Decline in Q3 Profit and Revenue",
            "Summary": "Himatsingka Seide, a textile company, has reported its financial results for the third quarter. The consolidated net profit decreased to 218 million rupees from 312 million rupees in the same period last year. Revenue also saw a decline, falling to 6.9 billion rupees from 7.2 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739405862000,
            "Source": "earnings"
        },
        {
            "Title": "Himatsingka Seide Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Himatsingka Seide, a textile company, has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 1.12 billion rupees from 1.6 billion rupees in the same quarter last year. Additionally, the EBITDA margin dropped to 16.13% from 21.65% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739363130000,
            "Source": "earnings"
        },
        {
            "Title": "Himatsingka Seide Reports Q2 Revenue Decline",
            "Summary": "Himatsingka Seide, a textile company, has reported its second quarter revenue for the current fiscal year. The company's revenue stood at 6.9 billion rupees, down from 7.4 billion rupees in the same quarter of the previous year, indicating a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1731575245000,
            "Source": "result"
        },
        {
            "Title": "Himatsingka Seide Reports Q2 EBITDA and Margin",
            "Summary": "Himatsingka Seide announced its Q2 financial results. The company's EBITDA for the quarter was 1.38 billion rupees, compared to 1.47 billion rupees in the same quarter last year. The EBITDA margin slightly improved to 19.96% from 19.93% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731575243000,
            "Source": "result"
        },
        {
            "Title": "Himatsingka Seide Reports Q2 Profit Decline",
            "Summary": "Himatsingka Seide, a textile company, has reported a consolidated net profit of 217 million rupees for the second quarter, down from 288 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731575170000,
            "Source": "result"
        },
        {
            "Title": "Himatsingka Seide Allots Shares to Abakkus Emerging Opportunities Fund",
            "Summary": "Himatsingka Seide has allotted 5.1 million shares to Abakkus Emerging Opportunities Fund, managed by Madhusudan Kela, at a price of 146.6 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1730266608000,
            "Source": "corporate_action"
        }
    ]
}