{
    "Symbol": "HINDUNILVR",
    "ISIN": "INE030A01027",
    "News": [
        {
            "Title": "HUL Updates on Kwality Wall's Scheme & New Appointment",
            "Summary": "Hindustan Unilever provides material update on Scheme of Arrangement with Kwality Wall's (India) Limited and announces appointment of Vivek Sarbhai as Senior Managerial Personnel effective February 7, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770645496468,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Unilever shares drop 0.82% amid trading",
            "Summary": "Hindustan Unilever shares declined 0.82% to Rs 2,389.80 with over 13.2 lakh shares traded. Company reported revenue of Rs 63,121 crore and net profit of Rs 10,679 crore for FY2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769506818338,
            "Source": "stocks"
        },
        {
            "Title": "LIC Increases Stake in Hindustan Unilever to 6.74%",
            "Summary": "Life Insurance Corporation of India has acquired additional shares in Hindustan Unilever through open market purchases, increasing its shareholding from 4.73% to 6.74% by acquiring 4.72 crore shares.",
            "Sentiment": "positive",
            "PublishDate": 1768830784927,
            "Source": "co_actions_results"
        },
        {
            "Title": "HUL Receives ₹1,560 Cr Income Tax Assessment Order",
            "Summary": "Hindustan Unilever Limited has received an income tax assessment order worth ₹1,559.69 crore for FY2021-22, as disclosed in its exchange filing on Thursday.",
            "Sentiment": "negative",
            "PublishDate": 1767945655872,
            "Source": "stocks"
        },
        {
            "Title": "HUL Receives ₹1,560 Cr Tax Demand for FY22",
            "Summary": "Hindustan Unilever receives income tax assessment order of ₹1,559.69 crore for FY22 related to transfer pricing adjustments. Company reports Q2 net profit up 3.8% to ₹2,694 crore despite margin pressure.",
            "Sentiment": "neutral",
            "PublishDate": 1767936132383,
            "Source": "co_actions_results"
        },
        {
            "Title": "HUL receives ₹1,560-cr income tax order for FY22",
            "Summary": "Hindustan Unilever received a ₹1,559.69 crore income tax assessment order for FY22 related to transfer pricing adjustments. The company states it will have no material impact on operations.",
            "Sentiment": "neutral",
            "PublishDate": 1767936044966,
            "Source": "stocks"
        },
        {
            "Title": "HUL Receives ₹15.6bn Tax Assessment Order",
            "Summary": "Hindustan Unilever receives significant tax assessment order from authorities demanding ₹15.60 billion, marking a major regulatory development for the FMCG giant.",
            "Sentiment": "negative",
            "PublishDate": 1767924632477,
            "Source": "stocks"
        },
        {
            "Title": "HUL Faces ₹15.6 Billion Tax Assessment Order",
            "Summary": "Hindustan Unilever receives significant tax assessment order from authorities demanding ₹15.60 billion, marking a major regulatory development for the FMCG giant.",
            "Sentiment": "negative",
            "PublishDate": 1767883420281,
            "Source": "stocks"
        },
        {
            "Title": "HUL Receives ₹1,559.69 Cr Tax Demand from IT Dept",
            "Summary": "Hindustan Unilever receives assessment order with ₹1,559.69 crore tax demand for FY2021-22, primarily related to transfer pricing adjustments. Company plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1767883399768,
            "Source": "stocks"
        },
        {
            "Title": "HUL Announces Key Corporate Changes & Kwality Deal",
            "Summary": "Hindustan Unilever announces arrangement with Kwality Wall's, appoints Anand Upadhyay as Company Secretary and Rohit Jhunjhunwala as Senior Manager in key corporate developments.",
            "Sentiment": "neutral",
            "PublishDate": 1767595323715,
            "Source": "stocks"
        },
        {
            "Title": "HUL Updates on Kwality Wall's Scheme & Internal Auditor",
            "Summary": "Hindustan Unilever provides material update on scheme of arrangement with Kwality Wall's India Limited and announces appointment of new internal auditor effective December 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767111263478,
            "Source": "stocks"
        },
        {
            "Title": "HUL Increases Stake in Energy SPV to 27.66%",
            "Summary": "Hindustan Unilever completes second tranche acquisition of equity shares in Transition Sustainable Energy Services One Private Limited for ₹10.26 crores, raising its stake from 22.33% to 27.66%.",
            "Sentiment": "positive",
            "PublishDate": 1766065153516,
            "Source": "co_actions_results"
        },
        {
            "Title": "HUL Reports Key Personnel Change at Kwality Walls",
            "Summary": "Hindustan Unilever discloses resignation of Company Secretary at subsidiary Kwality Walls (India) Limited as part of ongoing scheme of arrangement compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1765384989640,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Unilever Block Trade Worth ₹230.10 Cr",
            "Summary": "Hindustan Unilever witnessed a significant NSE block trade worth ₹230.10 crores involving approximately 1,000,164 shares at ₹2,300.60 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1765376519466,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Unilever Block Trade Worth ₹75.15 Crores",
            "Summary": "Hindustan Unilever witnessed a significant NSE block trade of ₹75.15 crores involving 325,522 shares at ₹2,308.50 per share, indicating substantial institutional activity in the FMCG major.",
            "Sentiment": "neutral",
            "PublishDate": 1765376289512,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Unilever Sees Rs. 230.10 Crore Block Trade on NSE",
            "Summary": "Hindustan Unilever witnessed a significant block trade worth Rs. 230.10 crores involving approximately 1,000,164 shares at Rs. 2,300.60 per share on the NSE. The large-scale transaction indicates substantial institutional or bulk investor activity in the FMCG major's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1765347145809,
            "Source": "order&deals"
        },
        {
            "Title": "Hindustan Unilever Sees Rs. 75.15 Crore Block Trade on NSE",
            "Summary": "Hindustan Unilever witnessed a block trade worth Rs. 75.15 crores involving 325,522 shares executed at Rs. 2,308.50 per share on the NSE. The transaction represents a significant institutional or bulk investor activity in one of India's leading FMCG companies.",
            "Sentiment": "neutral",
            "PublishDate": 1765343520059,
            "Source": "order&deals"
        },
        {
            "Title": "Hindustan Unilever Share Price Adjusted to 2,422 Rupees After Ice-Cream Business Separation",
            "Summary": "Hindustan Unilever's share price has been adjusted to 2,422 rupees following the separation of its ice-cream business. The adjustment reflects the corporate restructuring that impacts shareholders and the company's valuation structure.",
            "Sentiment": "neutral",
            "PublishDate": 1764908364384,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Unilever Seeks Shareholder Approval for Two Key Director Appointments via Postal Ballot",
            "Summary": "Hindustan Unilever has issued a postal ballot notice seeking shareholder approval to appoint Niranjan Gupta as Whole-time Director (Executive Director, Finance & CFO) for 5 years from November 1, 2025 to October 31, 2030, and Bobby Parikh as Independent Director for 5 years from December 1, 2025 to November 30, 2030. The e-voting period runs from December 8, 2025 to January 6, 2026, with Gupta's total annual remuneration package at ₹12.80 crores and Parikh appointed as Chairperson of Risk Management Committee and member of Audit Committee.",
            "Sentiment": "positive",
            "PublishDate": 1764868667993,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Unilever Reports Board Changes at Kwalily Walls Amid Scheme of Arrangement",
            "Summary": "Three Non-Executive Directors - Navin Jain, Vinita Nair, and Shalini Sinha - resigned from Kwalily Walls (India) Limited's board with effect from November 30, 2025, as part of board reconstitution following the Scheme of Arrangement between Hindustan Unilever Limited and Kwalily Walls. The company also relocated its registered office from Unilever House to Oberoi Commerz II in Goregaon East, Mumbai, effective December 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764610163270,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hindustan Unilever Appoints Vandana Suri as Executive Director, Home Care",
            "Summary": "Hindustan Unilever Limited appointed Ms. Vandana Suri as Executive Director, Home Care and General Manager, India-Home Care Business Unit, effective January 1, 2026. She succeeds Mr. Srinandan Sundaram who will take over as Chief Executive Officer of Unilever International, marking a key leadership transition in HUL's Management Committee.",
            "Sentiment": "positive",
            "PublishDate": 1764588025742,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hindustan Unilever Releases FAQ Guide for Ice Cream Business Demerger Share Allotment",
            "Summary": "Hindustan Unilever published detailed FAQs regarding the allotment of Kwality Walls (India) Limited shares following the approved demerger of its ice cream business, with a 1:1 share entitlement ratio and record date set for December 5, 2025. The comprehensive guide addresses shareholder queries on KYC compliance, demat requirements, dividend rights, and listing timelines, with KWIL shares expected to be listed within 60 days of NCLT order receipt.",
            "Sentiment": "neutral",
            "PublishDate": 1764404394063,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Unilever Seeks Shareholder Approval for Key Executive Appointments via Postal Ballot",
            "Summary": "Hindustan Unilever will conduct a postal ballot process to seek shareholder consent for appointing Niranjan Gupta as Executive Director and CFO for 5 years from November 1, 2025 to October 31, 2030, and Bobby Parikh as Independent Director from December 1, 2025 to November 30, 2030. The voting process will commence on December 8, 2025 and conclude on January 6, 2026, with results to be declared by January 8, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1764251087441,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Unilever Shares Kwality Walls Ice Cream Business Investor Presentation Ahead of Demerger",
            "Summary": "Hindustan Unilever Limited disclosed an investor presentation from Kwality Walls (India) Limited showcasing the ice cream business that will be demerged to KWIL under a scheme of arrangement sanctioned by NCLT Mumbai. The presentation positions KWIL as India's second-largest ice cream player with ₹7.9 billion revenue, targeting growth through strategic pivots including cabinet expansion, premiumization, and digital commerce while planning to list on BSE and NSE.",
            "Sentiment": "positive",
            "PublishDate": 1763914852996,
            "Source": "corporate_action"
        },
        {
            "Title": "Kwality Walls (India) Limited Appoints New Board of Directors Ahead of HUL Demerger",
            "Summary": "Kwality Walls (India) Limited has constituted its Board of Directors with seven appointments including executive directors, independent directors, and key management personnel, effective from December 1, 2025. The appointments come as KWIL prepares to operate as an independent listed entity following its demerger from Hindustan Unilever Limited on December 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763912451774,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hindustan Unilever Sets Record Date for Ice-Cream Business Demerger to Kwality Walls",
            "Summary": "Hindustan Unilever Limited has fixed December 5, 2025 as the record date for determining eligible shareholders to receive equity shares of Kwality Walls (India) Limited following NCLT approval of the ice-cream business demerger scheme. Shareholders will receive one KWIL share for every one HUL share held (1:1 ratio), with KWIL shares to be allotted only in dematerialized form and physical shareholders requiring KYC compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1763716285868,
            "Source": "corporate_action"
        },
        {
            "Title": "HUL Appoints Bobby Parikh as Independent Director",
            "Summary": "Hindustan Unilever Limited has appointed Bobby Parikh as an independent director to its board. Parikh serves as a strategic advisor to large corporations and holds directorships at Infosys, Biocon, and Indostar Capital.",
            "Sentiment": "positive",
            "PublishDate": 1763507246410,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hindustan Unilever Announces Ice Cream Business Spinoff with December Timeline",
            "Summary": "Hindustan Unilever has announced plans to spin off its ice cream business, with the process beginning December 1 and the record date for share issuance set for December 5. The spinoff will affect existing shareholders who will be eligible for shares in the separated ice cream entity based on their holdings as of the record date.",
            "Sentiment": "positive",
            "PublishDate": 1763472718581,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Unilever Receives NCLT Approval for Ice Cream Business Demerger",
            "Summary": "Hindustan Unilever has announced that it received approval from the National Company Law Tribunal (NCLT) for the demerger of its ice cream business. This regulatory approval represents a key milestone in the company's plan to separate its ice cream operations from its main business.",
            "Sentiment": "positive",
            "PublishDate": 1762865971567,
            "Source": "corporate_action"
        },
        {
            "Title": "HUL Offers Shareholders Electronic Copy of New CEO's Contract Agreement",
            "Summary": "Hindustan Unilever Limited announced it would provide shareholders with electronic copies of CEO Priya Nair's employment agreement upon request. The offer was included in a postal ballot notice for shareholders to approve Nair's appointment and remuneration. Nair, a Unilever veteran and member of the Unilever Leadership Executive, became HUL's first woman CEO and managing director. While companies are legally required to make such documents available for inspection at their offices, providing electronic copies via email is unusual practice. Legal experts have differing views on this approach - some calling it unusual given competitive sensitivities, while others note it reinforces transparency principles under the Companies Act, 2013. HUL confirmed it continues to make relevant documents available for shareholder inspection according to regulatory procedures.",
            "Sentiment": "neutral",
            "PublishDate": 1762394305559,
            "Source": "corporate_governance"
        },
        {
            "Title": "HUL Receives ₹1,986 Crore Tax Assessment Order, Reports Mixed Quarterly Results",
            "Summary": "Hindustan Unilever Limited received an income tax assessment order demanding ₹1,986.25 crore for FY21, issued by the Assistant Commissioner of Income Tax in Mumbai. The order involves transfer pricing adjustments and challenges to corporate tax depreciation claims. HUL stated the order will not materially impact its financials and plans to file an appeal. In quarterly results, HUL reported net profit of ₹2,694 crore, exceeding expectations of ₹2,480 crore, aided by a one-time gain of ₹273 crore from resolution of tax matters. Revenue stood at ₹15,585 crore, up 0.5% year-on-year but below the expected ₹15,850 crore. EBITDA declined 2.3% to ₹3,563 crore with margins at 22.9%, down 60 basis points from last year. Management expects margins to remain between 23-24% and anticipates 50-60 basis points benefit post ice cream business demerger. Shares closed at ₹2,466.65, down 0.12%.",
            "Sentiment": "neutral",
            "PublishDate": 1761925506428,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Unilever Receives 19.86 Billion Rupees Order, Plans Appeal",
            "Summary": "Hindustan Unilever has received an order involving 19.86 billion rupees. The company plans to appeal this order.",
            "Sentiment": "negative",
            "PublishDate": 1761920884381,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Unilever Receives NCLT Approval for Ice Cream Business Split",
            "Summary": "Hindustan Unilever has announced that the National Company Law Tribunal has approved the split of its ice cream business. This represents a significant corporate restructuring move for the consumer goods company.",
            "Sentiment": "positive",
            "PublishDate": 1761838059339,
            "Source": "corporate_action"
        },
        {
            "Title": "HUL Announces CEO Transition: Priya Nair to Replace Rohit Jawa as Managing Director",
            "Summary": "Hindustan Unilever Limited announced a leadership change with Rohit Jawa stepping down as Managing Director & CEO effective July 31, 2025, after serving since June 2023. Priya Nair, currently President of Beauty & Wellbeing at Unilever, will succeed him as MD & CEO for a five-year term from August 1, 2025 to July 31, 2030, subject to shareholder approval. Jawa cited pursuing the next chapter in his personal and professional journey as the reason for departure, highlighting the company's volume-led competitive growth and 'Aspire' strategy implementation during his tenure. Nair brings 30 years of Unilever experience, having started her career at HUL in 1995 and currently overseeing a €13 billion Beauty & Wellbeing portfolio across more than 20 markets. The transition was approved by the Board following the Nomination and Remuneration Committee's recommendation.",
            "Sentiment": "neutral",
            "PublishDate": 1761319696828,
            "Source": "corporate_governance"
        },
        {
            "Title": "HUL Shares Drop 4% Following Q2 Results Despite Positive Brokerage Ratings",
            "Summary": "Hindustan Unilever Ltd. shares declined nearly 5% during trading after posting quarterly results. Despite the stock decline, major brokerages maintained positive outlooks with Jefferies, Citi, and Goldman Sachs keeping 'buy' ratings. Jefferies raised its target price to Rs 3,050 while Citi increased to Rs 3,000. The quarterly results were impacted by trade destocking across the supply chain as distributors delayed purchases anticipating GST rate cuts, causing a 200 basis points drag on growth. This impact is expected to continue into the next quarter. HUL stock traded 3.66% lower at Rs 2,506.5 on the NSE. The stock has gained 0.14% over 12 months and 7.82% year-to-date. Among 44 analysts tracking the company, 33 recommend 'buy', nine suggest 'hold', and two advise 'sell', with a consensus target price of Rs 2,789.6.",
            "Sentiment": "negative",
            "PublishDate": 1761281900261,
            "Source": "earnings"
        },
        {
            "Title": "HUL Raises EBITDA Margin Forecast to 23%-24%",
            "Summary": "Hindustan Unilever Limited (HUL) has increased its EBITDA margin forecast to 23%-24%, up from the previous guidance of 22%-23%. This represents an upward revision of approximately 1 percentage point at the midpoint of the guidance range.",
            "Sentiment": "positive",
            "PublishDate": 1761202817100,
            "Source": "stock"
        },
        {
            "Title": "HUL Expects Improved Performance in Second Half of FY26",
            "Summary": "Hindustan Unilever Limited (HUL) anticipates that the second half of FY26 will deliver better performance compared to the first half of the same fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1761198611004,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Unilever Reports 2% Revenue Growth and Declares Rs. 19 Interim Dividend",
            "Summary": "Hindustan Unilever Limited announced its quarterly results with total sales of Rs. 16,061 crores, representing 2% growth. The company reported profit after tax of Rs. 2,694 crores, up 4% from the previous year. EBITDA margin declined by 90 basis points to 23.2%. The Board declared an interim dividend of Rs. 19 per equity share with record date of November 7, 2025, and payment date of November 20, 2025. Exceptional items included a one-off positive impact of Rs. 273 crores from resolution of tax matters between UK and Indian authorities, restructuring expenses of Rs. 51 crores, and acquisition costs of Rs. 38 crores. Shareholders approved the demerger of HUL's ice cream business into Kwality Wall's (India) Limited, subject to regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1761197752202,
            "Source": "corporate_action"
        },
        {
            "Title": "HUL Q2 Results Preview: Profit Expected to Drop 5% as GST Changes and Weak Demand Impact Performance",
            "Summary": "Hindustan Unilever Ltd is expected to report subdued quarterly results with sales rising just 1% year-on-year while profit may decline 5%. The performance reflects challenges from recent GST rate cuts from 18% to 5% affecting nearly 40% of HUL's product portfolio including soaps, shampoos, detergents, toothpaste, and packaged foods. This GST transition led to channel de-stocking and inventory realignment issues. Extended monsoon disrupted sales momentum, particularly impacting skin care and seasonal products, while weak underlying demand and channel destocking weighed on volumes. Margins face pressure as EBITDA margin is expected to fall by 140 basis points to around 22.1%, driven by lower prices passed to consumers and increased promotional spending to clear older inventory. Raw material costs show mixed trends with palm oil and crude-based inputs remaining volatile, while tea prices have softened and coffee stays near 52-week highs. Analysts view the weakness as largely temporary, expecting recovery in coming quarters once GST impact normalizes. Despite weak quarterly performance, brokerages remain positive on medium-term prospects citing structural demand recovery, softer input costs, and GST-driven price rationalization that could boost affordability.",
            "Sentiment": "negative",
            "PublishDate": 1761126225212,
            "Source": "earnings"
        },
        {
            "Title": "HUL Announces Q2 Results Date for October 23, Considers Interim Dividend",
            "Summary": "Hindustan Unilever Ltd. will announce its second quarter results on October 23, 2025, for the period ended September 30. The Board of Directors meeting will consider unaudited standalone and consolidated financial results and evaluate a proposal for interim dividend payment. An earnings call is scheduled for 4 p.m. on the same day. The trading window for designated persons has been closed since September 15 and will reopen on October 27. HUL shares have gained 2.78% in the past five trading sessions and are up 11.45% year-to-date, though down 3.49% over the past year. The stock closed at Rs 2,588 on Tuesday, near its 52-week range of Rs 2,136 to Rs 2,750.",
            "Sentiment": "neutral",
            "PublishDate": 1761101899490,
            "Source": "earnings"
        },
        {
            "Title": "HUL Schedules Quarterly Results Review for October 23",
            "Summary": "Hindustan Unilever Limited (HUL) has announced it will review its second quarter results on October 23.",
            "Sentiment": "neutral",
            "PublishDate": 1760610309007,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Unilever Expects Flat to Low Single-Digit Growth Due to GST Rate Changes",
            "Summary": "Hindustan Unilever, India's largest FMCG company, expects flat to low single-digit consolidated business growth for the September quarter compared to the previous year. The company attributes this to trade and channel disruption caused by GST rate rationalization that took effect on September 22, which reduced prices of essential goods including FMCG items. HUL anticipates the impact will continue through October, with recovery expected from November. Morgan Stanley maintained an 'equalweight' rating with a ₹2,335 price target, noting the commentary was below market expectations due to delayed consumer pantry buying. Jefferies maintained a 'buy' rating with a ₹3,000 price target, expecting similar impacts across other FMCG companies. Among 44 analysts covering HUL, 33 recommend 'buy', nine suggest 'hold', and two advise 'sell'. HUL shares closed 1% lower at ₹2,512 and are down 5.5% over the past month.",
            "Sentiment": "negative",
            "PublishDate": 1759115400383,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Unilever Shareholders Approve Priya Nair as MD & CEO with 99.88% Votes",
            "Summary": "Hindustan Unilever shareholders approved the appointment of Ms. Priya Nair as Managing Director & Chief Executive Officer for a five-year term from August 1, 2025 to July 31, 2030. The postal ballot received 99.88% votes in favor, with 200.79 crore votes supporting the resolution and only 23.96 lakh votes against it. Ms. Nair, who has 30 years of experience at Unilever, previously served as Business Group President – Beauty & Wellbeing overseeing a €13 billion portfolio. Her total annual remuneration package is approximately ₹27.28 crores, including fixed remuneration of ₹9.22 crores, target annual bonus of ₹9.22 crores, and share grants worth ₹9.22 crores. The appointment is subject to Central Government approval as she is a non-resident. The voting process was conducted electronically from August 29 to September 27, 2025, with 5,748 shareholders participating.",
            "Sentiment": "positive",
            "PublishDate": 1758980400594,
            "Source": "corporate_governance"
        },
        {
            "Title": "HUL Reports Sales Impact from GST Reforms, Expects Flat to Low Single-Digit Growth in Q2",
            "Summary": "Hindustan Unilever Limited (HUL) experienced short-term sales impact in September due to GST reforms and anticipates continued effects in October. The company began passing GST savings to consumers starting September 22 and expects recovery from November as prices stabilize. GST rate changes reduced rates to 5% for 40% of HUL's products. The company anticipates minimal business growth of flat to low single digits for the second quarter.",
            "Sentiment": "negative",
            "PublishDate": 1758885057217,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Unilever Schedules Q2 FY26 Results for October 23, Board to Consider Interim Dividend",
            "Summary": "Hindustan Unilever will announce its second quarter FY26 financial results on October 23, 2025. The Board of Directors meeting will consider unaudited standalone and consolidated financial results for the quarter ended September 30, along with a proposal for interim dividend payment. An earnings call is scheduled for the same day to discuss results with investors and analysts. The trading window for designated persons closed on September 15 and will reopen on October 27. HUL shares have declined 1.39% over the past five trading sessions and 3.23% in the past month, though they gained 12.12% over six months and 9.67% year-to-date. The stock hit a 52-week high of Rs 3,030 on September 27, 2024, and traded at Rs 2,546.60 on the NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1758785433903,
            "Source": "earnings"
        },
        {
            "Title": "HUL Announces Price Cuts Across Multiple Product Lines",
            "Summary": "Hindustan Unilever has announced price reductions on several products effective September 22. A 340 ml bottle of Dove shampoo will cost Rs 435, down from Rs 490. A 200 gm jar of Horlicks will be priced at Rs 110 instead of Rs 130. Kissan Jam (200 gm) will retail for Rs 80, decreased from Rs 90. A pack of four 75 gm Lifebuoy soaps will cost Rs 60, down from Rs 68. The company stated that new stock with reduced maximum retail prices is in the process of reaching the market.",
            "Sentiment": "positive",
            "PublishDate": 1757740059589,
            "Source": "stock"
        },
        {
            "Title": "HUL Shares Rise 1.19% Following GST Council's Rate Cuts on FMCG Products",
            "Summary": "Hindustan Unilever Limited shares increased 1.19% to ₹2,696.30 in morning trade after the GST Council approved rate reductions benefiting the FMCG sector. The reforms reduce GST rates on essential FMCG products from 18% to 5%, covering hair oil, shampoo, toothpaste, toilet soaps, and shaving cream. Bread will have GST eliminated entirely, while pasta and noodles rates drop from 12% to 5%. Multiple brokerages including CLSA and Goldman Sachs identified HUL as a key beneficiary, with Goldman Sachs also highlighting Britannia, Colgate, and Dabur. Trading volume reached 11.35 lakh shares worth ₹308.44 crore by mid-morning. The timing coincides with the upcoming festive season when consumer demand typically peaks. Market analysts expect companies to pass GST benefits to consumers, potentially driving higher volumes and improved earnings while easing inflationary pressures on essential goods.",
            "Sentiment": "positive",
            "PublishDate": 1756963976573,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Unilever Appoints Niranjan Gupta as CFO Effective November 1, 2025",
            "Summary": "Hindustan Unilever Ltd. announced the appointment of Niranjan Gupta as its next chief financial officer. Gupta will succeed Ritesh Tiwari in the role, with the appointment taking effect on November 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755781843883,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hindustan Unilever Shareholders Approve Scheme of Arrangement with Kwality Wall's",
            "Summary": "Hindustan Unilever Limited shareholders approved a special resolution for the Scheme of Arrangement between Hindustan Unilever Limited, Kwality Wall's (India) Limited and their respective shareholders. The resolution was passed with 99.9979% votes in favor, representing three-fourths majority in value. The meeting was held on August 12, 2025, through video conferencing with 143 equity shareholders attending. Total votes polled were 2,005,570,729 representing 85.36% of outstanding shares. The voting was conducted through remote e-voting and electronic voting at the meeting, with National Securities Depository Limited facilitating the process. The scrutinizer's report confirmed the resolution met the requisite majority requirements under Section 230(6) of the Companies Act, 2013.",
            "Sentiment": "positive",
            "PublishDate": 1755005664355,
            "Source": "corporate_action"
        },
        {
            "Title": "HUL Elevates Foods Business Focus, Plans Portfolio Transformation and Horlicks Relaunch",
            "Summary": "Hindustan Unilever Ltd is intensifying its focus on the Foods business, giving it the same strategic attention as its Beauty & Personal Care and Home Care segments. CFO Ritesh Tiwari outlined the company's approach centered on six priority demand spaces: tea and coffee, lifestyle nutrition, out-of-home food solutions, condiments, mini-meals, and accompaniments. The strategy involves using Kissan for Indian cuisine, Knorr for international cuisine, and Hellmann's for condiments, while avoiding the staples category. HUL's beverages portfolio showed double-digit growth in coffee and high single-digit growth in tea. The company plans a Horlicks relaunch with product changes to boost category consumption, acknowledging that more work is needed despite gaining market share. Unlike its global parent Unilever which sold tea businesses worldwide, HUL retained its tea and coffee operations due to growth potential and ownership advantages. Tiwari ruled out separating the Foods business, citing synergies across supply chain, distribution, and go-to-market structures in running the ₹62,000 crore business. HUL expects sequential improvement in growth over the next few quarters, with the first half of FY25 expected to outperform the latter half of FY24.",
            "Sentiment": "positive",
            "PublishDate": 1754655447652,
            "Source": "stock"
        }
    ]
}