{
    "Symbol": "HINDWAREAP",
    "ISIN": "INE05AN01011",
    "News": [
        {
            "Title": "Hindware Home Innovation Q3FY26 Results Announced",
            "Summary": "Hindware Home Innovation Limited reported Q3FY26 financial results with consolidated revenue of ₹640.08 crore and net profit of ₹3.69 crore from continuing operations for quarter ended 31st December 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770905142753,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindware Home Innovation Q3FY26 Earnings Call Feb 13",
            "Summary": "Hindware Home Innovation Limited has scheduled its Q3FY26 earnings conference call for February 13, 2026 at 4:00 PM IST to discuss financial results with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1770295805508,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindware Home Innovation Gets NCLT Meeting Date Correction",
            "Summary": "NCLT Kolkata corrects meeting dates for Hindware Home Innovation's scheme of arrangement from January 18, 2026 to March 7, 2026, affecting equity shareholders and unsecured creditors meetings.",
            "Sentiment": "neutral",
            "PublishDate": 1769083005804,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindware Home Innovation Reports Mixed Q2 FY26 Results, Discontinues Loss-Making Product Lines",
            "Summary": "Hindware Home Innovation Limited reported consolidated revenue of ₹676 crore for Q2 FY26 with EBITDA of ₹60 crore, while strategically discontinuing high loss-making product categories including air coolers, fans, air purifiers, water purifiers, and furniture fittings to focus on kitchen appliances. The company's Bathware business achieved 10.1% growth with revenue of ₹397 crore, though the pipes segment faced margin pressure due to raw material price fluctuations and subdued market demand.",
            "Sentiment": "neutral",
            "PublishDate": 1763477896197,
            "Source": "earnings"
        },
        {
            "Title": "Hindware Home Innovation Reports 10% Revenue Growth to ₹832 Crores in Q2FY26",
            "Summary": "Hindware Home Innovation reported revenue of ₹832 crores for Q2FY26, marking a 10% year-over-year increase. The company achieved an EBITDA margin of 11% during the quarter. The company is expanding its consumer appliance division through premium product launches and dealer network growth. Strategic focus areas include brand premiumization, modular furniture, and water heater portfolio development. Management targets double-digit growth with margin expansion expected from improved product mix and cost efficiencies.",
            "Sentiment": "positive",
            "PublishDate": 1762875943071,
            "Source": "earnings"
        },
        {
            "Title": "Hindware Home Innovation Reports Quarterly Results, Discontinues High-Loss Product Categories",
            "Summary": "Hindware Home Innovation Limited announced its unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. The company strategically discontinued certain high-loss product categories including air coolers, ceiling fans, air purifiers, water purifiers, and furniture fittings to focus on core kitchen appliance business. This decision resulted in a recovery of ₹0.61 crore during the quarter, reducing the net provision for exceptional items to ₹48.88 crore for the half-year. The Board also approved amendments to the company's insider trading code. Additionally, a Composite Scheme of Arrangement involving the company, Hindware Limited, and HHIL Limited has been filed with NCLT for approval, which includes demerger of the Consumer Products Business.",
            "Sentiment": "neutral",
            "PublishDate": 1762873321867,
            "Source": "earnings"
        },
        {
            "Title": "Hindware Atlantic Sells Telangana Manufacturing Plant to Ariston for INR 116 Crore",
            "Summary": "Hintastica Private Limited, a 50:50 joint venture between Hindware Home Innovation Limited and Atlantic Societe Francaise De Developpement Thermique, has signed an asset sale agreement with Ariston Water Heating Products India Private Limited. The deal involves selling manufacturing assets including land, buildings, plant, machinery and equipment located at Green Industrial Park in Telangana for INR 116 crore. The transaction is expected to complete by February 28, 2026. HPL has been producing electric storage water heaters since 2023 and will continue in the water heater business while adopting an asset-light strategy to enhance operational flexibility and strengthen its balance sheet. The company will focus on market development, product innovation and expanding consumer reach. Hindware Atlantic plans to source part of its future product range from the Telangana facility post-sale.",
            "Sentiment": "positive",
            "PublishDate": 1760773069516,
            "Source": "order&deals"
        },
        {
            "Title": "Hindware Home Innovation Receives BSE Approval for Composite Scheme of Arrangement",
            "Summary": "Hindware Home Innovation has received BSE approval for its composite scheme of arrangement. The company is awaiting NSE approval before proceeding to file with NCLT.",
            "Sentiment": "positive",
            "PublishDate": 1756460577517,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindware Home Innovation Reports Q1 FY26 Results with Strategic Business Restructuring",
            "Summary": "Hindware Home Innovation Limited reported consolidated revenue of INR 531 crores and EBITDA of INR 58 crores for Q1 FY26. The company announced strategic discontinuation of high loss-making product categories including air coolers (except e-commerce), ceiling fans, air purifiers, water purifiers, and furniture fittings to focus on kitchen appliances. The Bathware business generated INR 341 crores revenue with INR 43 crores EBITDA, showing positive growth and margin improvement initiatives. Consumer Appliances reported INR 71 crores revenue with INR 10 crores EBITDA after portfolio rationalization. The Pipes business recorded INR 119 crores revenue and INR 7 crores EBITDA, impacted by raw material price volatility and early monsoons. The company expects improved performance in the second half of FY26, with the Roorkee plant commencing commercial production in H2. Management targets mid-teens EBITDA margins for Bathware and expects the demerger approval process to complete within 8-12 months after SEBI clearance.",
            "Sentiment": "neutral",
            "PublishDate": 1755610500176,
            "Source": "earnings"
        },
        {
            "Title": "Hindware Home Innovation Reports Q1 FY2026 Results, Announces Demerger Plan",
            "Summary": "Hindware Home Innovation Limited submitted its quarterly results presentation for Q1 FY2026 ended June 30, 2025. The company reported consolidated revenue of ₹531 crore with EBITDA margin of 11% and PBT margin of 0.2%. The Board approved a composite scheme of arrangement involving demerger of Consumer Products Business into wholly owned subsidiary HHIL Limited and amalgamation of remaining company into Hindware Limited. Under the scheme, shareholders will receive 1 share each in HHIL Limited and Hindware Limited for every share held. The scheme is effective from April 1, 2025, subject to regulatory approvals. The company discontinued certain high loss-making product categories including air coolers, ceiling fans, air purifiers, water purifiers, and furniture fittings to focus on core kitchen appliances business. Revenue mix shows 64% from Bathware, 23% from Plastic Pipes & Fittings, and 13% from Consumer Products.",
            "Sentiment": "neutral",
            "PublishDate": 1755012623059,
            "Source": "earnings"
        },
        {
            "Title": "Hindware Home Innovation Reports Q1 Results, Appoints New Business Head and Reschedules AGM",
            "Summary": "Hindware Home Innovation Limited's Board approved standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The company made a strategic shift to focus on kitchen appliances business including chimneys, hobs and cooktops, while discontinuing high loss-making product categories such as air coolers (except e-commerce), ceiling fans, air purifiers, water purifiers, and furniture fittings. This restructuring led to an exceptional provision of ₹49.49 crore. Revenue from discontinued trading goods dropped significantly to ₹0.37 crore compared to ₹30.17 crore in the same quarter last year. The company also terminated a large warehouse lease, recognizing other income of ₹6.00 crore. Additionally, Mr. Nitesh Raj was appointed as Business Head-Commercial Business and designated as Senior Management Personnel. The 8th Annual General Meeting was rescheduled from September 4, 2025 to September 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755008872148,
            "Source": "earnings"
        },
        {
            "Title": "Hindware: Inaugurates Rs 170 Crore Manufacturing Plant in Roorkee",
            "Summary": "Hindware has opened its third manufacturing facility in Roorkee, Uttarakhand, with an investment of Rs 170 crore. The plant will produce CPVC, UPVC, SWR and PVC pipes, fittings, and water storage tanks under the Truflo brand. Initial capacity is 12,500 tonnes per annum, increasing total annual production to 80,500 TPA. The facility aims to serve North and West India, creating about 200 jobs.",
            "Sentiment": "positive",
            "PublishDate": 1751392348000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindware Home Innovation Approves Composite Scheme of Arrangement",
            "Summary": "Hindware Home Innovation's board has approved a composite scheme of arrangement involving demerger and amalgamation. The plan will result in the creation of two separate listed companies: HHIL Ltd and Hindware Ltd. Both of these entities will be listed on stock exchanges, while Hindware Home Innovation Ltd as a company will cease to exist.",
            "Sentiment": "neutral",
            "PublishDate": 1743120819000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindware Home Innovation Approves Composite Scheme of Arrangement",
            "Summary": "The board of Hindware Home Innovation has approved a composite scheme of arrangement involving the company, HHIL, and Hindware. This corporate action suggests a potential restructuring or reorganization among these entities.",
            "Sentiment": "neutral",
            "PublishDate": 1743075918000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindware Home Innovation Reports Increased Q3 Net Loss",
            "Summary": "Hindware Home Innovation has reported a consolidated net loss of 178 million rupees for the third quarter, compared to a loss of 42 million rupees in the same period last year. This represents a significant increase in losses year-over-year. The company's quarterly revenue also declined to 5.94 billion rupees from 6.93 billion rupees in the previous year, indicating a challenging business environment.",
            "Sentiment": "negative",
            "PublishDate": 1739751539000,
            "Source": "earnings"
        },
        {
            "Title": "Hindware Home Innovation Reports Q3 Net Loss and Revenue Decline",
            "Summary": "Hindware Home Innovation has reported a consolidated net loss of 178 million rupees for the third quarter, compared to a loss of 42 million rupees in the same period last year. The loss has also increased from 156 million rupees in the previous quarter. The company's revenue for Q3 decreased to 5.94 billion rupees from 6.93 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739533579000,
            "Source": "earnings"
        },
        {
            "Title": "Hindware Home Innovation Reports Q2 Financial Results",
            "Summary": "Hindware Home Innovation reported a consolidated net loss of 156 million rupees in Q2, an improvement from the 191 million rupee loss in the same quarter last year. However, the loss widened from 40 million rupees in the previous quarter. Revenue for Q2 decreased to 6.3 billion rupees from 7 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731455795000,
            "Source": "result"
        },
        {
            "Title": "Hindware Home: Rs 250 Crore Rights Issue Approved",
            "Summary": "Hindware Home Innovation Ltd. board approves raising Rs 250 crore through a rights issue. The issue will offer 1.1 crore equity shares at Rs 220 each. Record date set for Oct. 25, 2024, with subscription period from Nov. 7 to Nov. 22. Shareholders can purchase 119 shares for every 758 held.",
            "Sentiment": "positive",
            "PublishDate": 1729245018000,
            "Source": "corporate_action"
        }
    ]
}