{
    "Symbol": "HINDZINC",
    "ISIN": "INE267A01025",
    "News": [
        {
            "Title": "Hindustan Zinc Partners JNCASR for Zinc-Ion Battery Tech",
            "Summary": "Hindustan Zinc Limited collaborates with JNCASR to develop stable zinc-ion battery prototypes for large-scale renewable energy storage, marking significant progress in indigenous energy storage technology.",
            "Sentiment": "positive",
            "PublishDate": 1770385498572,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Zinc Allots ₹1400 Cr Debentures",
            "Summary": "Hindustan Zinc's Committee of Directors approved allotment of non-convertible debentures worth ₹1400 crore through two series - ₹420 crore and ₹980 crore respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1770018717940,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vedanta to sell 0.79% stake in Hindustan Zinc via OFS",
            "Summary": "Vedanta Limited announces offer for sale of up to 3.35 crore equity shares in Hindustan Zinc through stock exchange mechanism on January 28-29, 2026, with floor price set at ₹685 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1769519220031,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Zinc Approves ₹1400 Cr NCD Issuance",
            "Summary": "Hindustan Zinc's Committee of Directors approved issuance of unsecured, redeemable non-convertible debentures worth ₹1400 crore through private placement on BSE.",
            "Sentiment": "positive",
            "PublishDate": 1769142894271,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nuvama Cuts Hindustan Zinc Rating to Reduce",
            "Summary": "Nuvama has downgraded Hindustan Zinc to 'Reduce' rating with a target price of ₹591.00, signaling concerns about the zinc producer's near-term prospects and valuation metrics.",
            "Sentiment": "negative",
            "PublishDate": 1768880488113,
            "Source": "stocks"
        },
        {
            "Title": "CITI Issues Sell Rating on Hindustan Zinc at ₹585",
            "Summary": "CITI Research has issued a sell recommendation for Hindustan Zinc shares with a target price of ₹585, indicating potential downside from current levels.",
            "Sentiment": "negative",
            "PublishDate": 1768880458458,
            "Source": "stocks"
        },
        {
            "Title": "Motilal Oswal Raises Hindustan Zinc Target to ₹720",
            "Summary": "Motilal Oswal Securities has maintained its Neutral rating on Hindustan Zinc while revising the target price upward from ₹670 to ₹720, reflecting improved outlook for the zinc producer.",
            "Sentiment": "neutral",
            "PublishDate": 1768880369049,
            "Source": "stocks"
        },
        {
            "Title": "Jefferies Raises Hindustan Zinc Target to ₹750",
            "Summary": "Global brokerage firm Jefferies maintains Buy rating on Hindustan Zinc and raises target price to ₹750 per share, signaling positive outlook for the mining company.",
            "Sentiment": "positive",
            "PublishDate": 1768880325706,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Zinc Outlines Hedging & Green Energy Plans",
            "Summary": "Hindustan Zinc reveals strategic hedging covering 10-20% yearly volume with FY2027 positions secured. Company targets renewable energy expansion from 25% to 70%, potentially saving ₹250-300 crore annually.",
            "Sentiment": "positive",
            "PublishDate": 1768879541328,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Zinc Q3 profit surges 46% to ₹3,916 cr",
            "Summary": "Vedanta subsidiary achieves record quarterly profit driven by silver price rally and lower production costs. Company returns to net-cash position with strong operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1768835223310,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Zinc appoints new government director",
            "Summary": "Hindustan Zinc Limited announces appointment of Mr. Sandeep Vasant Kadam as Part-time Official Director replacing Mr. Dinesh Mahur, effective January 19, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768827726132,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Zinc surges 4.5% as silver hits record high",
            "Summary": "Hindustan Zinc shares jumped 4.5% to ₹632.55 as silver prices reached a record ₹2.65 lakh per kg on MCX, driven by geopolitical tensions and US dollar weakness. Silver contributes 41% to company's EBIT.",
            "Sentiment": "positive",
            "PublishDate": 1768209846485,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Zinc shares surge 3% on silver rally",
            "Summary": "Hindustan Zinc shares jumped 3.2% to ₹627 as silver hit record high of $83.56 per troy ounce. Company contributes 38% EBIT from silver with 800 tonnes annual capacity.",
            "Sentiment": "positive",
            "PublishDate": 1768197410549,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Zinc Q3 Silver Production Jumps 10% QoQ",
            "Summary": "Hindustan Zinc reports 10% sequential growth in silver production to 158 tonnes in Q3, achieving record third quarter mined metal output of 276kt amid rising silver prices.",
            "Sentiment": "positive",
            "PublishDate": 1767358345378,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Zinc Related Parties Enter USD 80M Facility",
            "Summary": "Hindustan Zinc's related parties including Vedanta Resources Limited entered into a USD 80 million facility agreement with Bank of Maharashtra, imposing certain operational restrictions on HZL.",
            "Sentiment": "neutral",
            "PublishDate": 1767355971372,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Zinc in focus as silver drops 6% on profit taking",
            "Summary": "Hindustan Zinc shares under spotlight as silver prices fall 6% to $73/oz amid year-end profit booking, despite silver's massive 157% gain in 2025. Company benefits from strong silver exposure.",
            "Sentiment": "neutral",
            "PublishDate": 1767153054669,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Zinc discloses penalty on promoter Vedanta",
            "Summary": "Hindustan Zinc Limited informed stock exchanges about a penalty levied on its promoter company Vedanta Limited by the Joint Commissioner, CT & GST Circle, Jharsuguda on December 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766902247875,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Zinc Gains as Silver Hits Record $75+ Highs",
            "Summary": "Silver prices surge past $75 per ounce for first time, driving focus on Hindustan Zinc shares as key beneficiary with 38% EBIT linked to silver and strong production capacity.",
            "Sentiment": "positive",
            "PublishDate": 1766716007661,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Zinc surges 4% on silver price rally",
            "Summary": "Hindustan Zinc shares jumped 3.6% to ₹632 as silver prices crossed $72/ounce for the first time, with the metal gaining over 140% year-to-date. The company derives 38% of EBIT from silver production.",
            "Sentiment": "positive",
            "PublishDate": 1766586607491,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Zinc Pays ₹63.90 Lakh Penalty in Final Order",
            "Summary": "Hindustan Zinc Limited has paid ₹63.90 lakh compounding fees following final order from Regional Director for DIN disclosure lapses during FY2014-15 to FY2020-21, completing regulatory compliance process.",
            "Sentiment": "neutral",
            "PublishDate": 1765982981402,
            "Source": "stocks"
        },
        {
            "Title": "Vedanta Discloses ₹45.98 Lakh GST Penalty on Subsidiary",
            "Summary": "Vedanta Limited disclosed that subsidiary Hindustan Zinc received a ₹45.98 lakh GST penalty from CGST authorities for Input Tax Credit issues in FY2018-19 and 2019-20. HZL plans to appeal the order.",
            "Sentiment": "negative",
            "PublishDate": 1765705687864,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Zinc Gets ESG Rating of 67 for FY25",
            "Summary": "Hindustan Zinc Limited receives consolidated ESG rating of 67 for FY2024-25 from NSE Sustainability Ratings and Analytics Limited, based on independent evaluation of publicly available information.",
            "Sentiment": "neutral",
            "PublishDate": 1765522878526,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Zinc Receives Rs. 19.59 Lakh GST Penalty for Ineligible Input Tax Credit",
            "Summary": "Hindustan Zinc Limited, a subsidiary of Vedanta Limited, received a penalty of Rs. 19,59,144 along with tax demand and interest from the Assistant Commissioner of Central GST Udaipur for ineligible Input Tax Credit related to FY 2021-22. The company plans to file an appeal and expects no material financial impact from the order.",
            "Sentiment": "negative",
            "PublishDate": 1765026834673,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Zinc Seeks Shareholder Approval for Two Director Appointments via Postal Ballot",
            "Summary": "Hindustan Zinc has issued a postal ballot notice seeking shareholder approval for appointing Thomas Mathew T as Non-Executive Independent Director and Ashim Kumar Modi as Government Nominee Director. The e-voting process runs from November 21, 2025 to December 20, 2025, with Thomas Mathew T requiring special resolution approval and Modi requiring ordinary resolution approval.",
            "Sentiment": "neutral",
            "PublishDate": 1763631139583,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hindustan Zinc Wins Tungsten and Related Mineral Block Bid in Balepalyam",
            "Summary": "Hindustan Zinc has successfully won the bid for a tungsten and related mineral block located in Balepalyam. This acquisition expands the company's mineral portfolio beyond its traditional zinc operations into tungsten mining.",
            "Sentiment": "positive",
            "PublishDate": 1763127910577,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Zinc Receives Composite License for Tungsten Block in Andhra Pradesh",
            "Summary": "Hindustan Zinc has been granted a composite license by the Andhra Pradesh government for a tungsten and associated mineral block. This license allows the company to explore and develop tungsten resources in the state.",
            "Sentiment": "positive",
            "PublishDate": 1762768142464,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Zinc Retains Global No. 1 Sustainability Ranking for Third Consecutive Year",
            "Summary": "Hindustan Zinc Limited secured the first position in the Metals and Mining sector for the third consecutive year in the S&P Global Corporate Sustainability Assessment (CSA) 2025. The company achieved an industry-leading score of 90 points among 235 participating companies worldwide, marking its highest CSA score in the past five years. This represents an improvement from last year's score of 86. The company excelled in key parameters including Climate Strategy, community relations, and waste pollutants. Hindustan Zinc is the world's largest integrated zinc producer and among the top five global silver producers. The company has integrated circular economy principles, achieving more than 30% of total water usage through recycled sources. With a 530MW Power Delivery Agreement, the company plans to source 70% of its electricity from renewable sources by FY2028. The company's sustainability initiatives have benefited over 2.3 million lives in FY2025 through various social programs.",
            "Sentiment": "positive",
            "PublishDate": 1762415778084,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Zinc Receives Rs 1.08 Crore Penalty Order from Tax Authorities",
            "Summary": "Hindustan Zinc Limited received a penalty order of Rs 1,08,04,533 along with tax demand and applicable interest from the Commissioner, Central Goods Service Tax-Udaipur. The penalty relates to availment of Cenvat credit on invoices issued during March 2011 to April 2011. The company received Order No 16/CE/UDR/2025-26 dated October 30, 2025 on October 31, 2025. Hindustan Zinc plans to file an appeal before the Appellate Authority within the prescribed time limit under Excise Law. The company expects a favorable outcome and does not anticipate any material financial impact from this order.",
            "Sentiment": "neutral",
            "PublishDate": 1761992415244,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Zinc Forecasts Silver Prices to Hit $50-55 Per Ounce, Reports Strong Quarterly Results",
            "Summary": "Hindustan Zinc expects silver prices to reach $50-55 per ounce by early next year, supported by strong demand and increased industrial usage in renewables and electronics. The company reported net sales of ₹8,549 crore for the quarter ended September 2025, up 3.5% year-on-year, with profit rising 13.8% to ₹2,649 crore. Operating margins expanded nearly 200 basis points to 52%, with EBITDA at ₹4,445 crore. The company's saleable silver output is expected to be around 680 tonnes in FY26, lower than earlier projections of 700-710 tonnes. CEO Arun Misra stated they produced 293 tonnes in the first half and expect over 380 tonnes in the second half. The company is currently hedging at $37 per ounce while silver has surged past $41-42 per ounce. Cost of production is expected to decline towards $950 per tonne from $990, aided by operating leverage and increased renewable energy usage rising to 25% by year-end from 19%. The proposed demerger of the silver business remains on track. Zinc prices are expected to move towards $3,000-3,100 per tonne on steady demand.",
            "Sentiment": "positive",
            "PublishDate": 1760941877173,
            "Source": "stock"
        },
        {
            "Title": "Hind Zinc Reduces FY26 Silver Production Forecast by 30-40 MT",
            "Summary": "Hind Zinc has lowered its saleable silver forecast for FY26 to 670-690 metric tons, down from the previous estimate of 700-710 metric tons. This represents a reduction of 30-40 metric tons from the company's earlier production guidance.",
            "Sentiment": "negative",
            "PublishDate": 1760693471721,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Zinc Reports Silver Contributes 40% of Total Profits",
            "Summary": "Hindustan Zinc disclosed that silver contributes approximately 40% of the company's total profits. The company indicated it is well-positioned to benefit from potential silver market growth.",
            "Sentiment": "positive",
            "PublishDate": 1760692209440,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Zinc Appoints New Government Nominee Director, Amends Insider Trading Code",
            "Summary": "Hindustan Zinc Limited appointed Mr. Ashim Kumar Modi as Government Nominee Director (Non-Executive) effective October 17, 2025, replacing Shri Ashish Chatterjee. Modi, an Indian Revenue Service officer from the 2000 batch, serves as Joint Secretary & Financial Advisor in the Ministry of Coal with additional charge of Ministry of Mines and Ministry of Minority Affairs. He holds a B.Tech in Civil Engineering from IIT Delhi and also serves as Part Time Official Director on Coal India Limited and SECL boards. The appointment requires shareholder approval. The company's board also approved amendments to its Insider Trading Prohibition Code in accordance with SEBI regulations. The board meeting lasted from 12:00 noon to 2:10 PM IST.",
            "Sentiment": "neutral",
            "PublishDate": 1760692166853,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hindustan Zinc Reports Strong Q2 Performance with ₹2,649 Crore Net Profit",
            "Summary": "Hindustan Zinc Limited's Board approved unaudited financial results for the second quarter and half year ended September 30, 2025. The company reported consolidated net profit of ₹2,649 crore for Q2 2025, compared to ₹2,327 crore in Q2 2024. Revenue from operations reached ₹8,549 crore in Q2 2025 versus ₹8,252 crore in the previous year quarter. For the half year, net profit stood at ₹4,883 crore with revenue of ₹16,320 crore. The company declared an interim dividend of ₹10 per equity share aggregating to ₹4,225 crore with record date of June 17, 2025. Earnings per share for Q2 was ₹6.27 compared to ₹5.51 in the same quarter last year. The auditors provided an unmodified opinion on the financial results. The company noted that subsequent to June 30, 2025, a short seller published reports with allegations against Vedanta Group entities including Hindustan Zinc, which management believes are baseless.",
            "Sentiment": "positive",
            "PublishDate": 1760691681549,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Zinc Reports Higher Q2 Net Profit and Revenue Growth",
            "Summary": "Hindustan Zinc reported quarterly net profit of 26.3 billion rupees compared to 23 billion rupees in the same period last year. The company's EBITDA increased to 44.26 billion rupees from 41 billion rupees year-over-year, with EBITDA margin improving to 51.92% from 51.3%. Revenue grew to 85.3 billion rupees versus 82.4 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1760691262951,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Zinc Appoints Ashim Kumar Modi as Part-time Official Director, Replaces Ashish Chatterjee",
            "Summary": "The Ministry of Mines appointed Mr. Ashim Kumar Modi as part-time Official Director on Hindustan Zinc Limited's Board, replacing Mr. Ashish Chatterjee with immediate effect. Modi serves as Joint Secretary & Financial Advisor (AS&FA) at the Ministry of Coal with additional charge of Ministry of Mines and Ministry of Minority Affairs. The appointment was communicated through a letter dated October 10, 2025, and will remain effective until further orders. Chatterjee, who held the position as AS&FA and Government Nominee Director, ceased his role on the same date. The company is completing necessary formalities related to this board change.",
            "Sentiment": "neutral",
            "PublishDate": 1760103168234,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hindustan Zinc Reports Record Production and 33% Profit Growth in FY2025",
            "Summary": "Hindustan Zinc Limited achieved record operational and financial performance in FY2024-25. The company reported EBITDA of Rs. 17,465 crores with 28% year-on-year growth and profit after tax of Rs. 10,353 crores with 33% growth. Production reached all-time highs with mined metal production of 1,095 KT and refined metal production of 1,052 KT. Return on capital employed hit 58% and return on equity reached 73%. The company maintained its position as one of the lowest-cost zinc producers globally with production costs of $1,052 per ton. HZL captured 77% of India's primary zinc market and achieved highest-ever value-added products share at 22%. The company announced plans to double production to 2 million tonnes with potential investments of Rs. 30,000-35,000 crores over 3-5 years, including a new 250 KTPA smelter requiring Rs. 12,000 crore investment. HZL is expanding into critical minerals and targets increasing renewable energy use to 70% by FY28.",
            "Sentiment": "positive",
            "PublishDate": 1756292620415,
            "Source": "corporate_action"
        },
        {
            "Title": "Hind Zinc CEO Expresses Readiness to Enter Uranium Mining Pending Government Approval",
            "Summary": "Hind Zinc's CEO announced that the company is prepared to commence uranium mining operations if the government grants permission. The statement indicates the company's interest in expanding into uranium extraction, contingent on regulatory approval.",
            "Sentiment": "neutral",
            "PublishDate": 1755597288729,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Zinc Approves ₹3,823 Crore Investment for India's First 10 MTPA Tailings Reprocessing Plant",
            "Summary": "Hindustan Zinc has approved an investment of ₹3,823 crore to establish India's first 10 MTPA (million tonnes per annum) tailings reprocessing plant. The project is aimed at supporting the company's growth objectives and sustainability goals.",
            "Sentiment": "positive",
            "PublishDate": 1755515816754,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Zinc Publishes Investor Presentation Following Regulatory Disclosure",
            "Summary": "Hindustan Zinc Limited has made available an investor presentation on its website, continuing from a previous communication. The presentation covers the company's position as the world's largest integrated zinc producer with 913,000 TPA zinc smelting capacity and 210,000 TPA lead smelting capacity. The company reported record metal production and maintains approximately 77% market share in India's primary zinc market. Key highlights include total reserves and resources of 453.2 Mt, ore production of 16.33 Mt, and metal capacity of 1.12 Mt. The company has approved a 250 Ktpa integrated metal expansion as the first phase toward doubling capacity to 2 Mtpa. Financial guidance for the period includes refined metal production of 1,100 (±10) Ktpa, silver production of 700-710 metric tonnes, and zinc cost of production at $1,025-$1,050 per tonne. The company ranks first in S&P Global Corporate Sustainability Assessment for metals and mining sector and has been included in the F&O segment on National Stock Exchange. Revenue guidance is projected at ₹32,000-33,000 crores with EBITDA of ₹17,000-17,500 crores.",
            "Sentiment": "positive",
            "PublishDate": 1754997507955,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Zinc Becomes First Indian Company to Join International Council on Mining and Metals",
            "Summary": "Hindustan Zinc has joined the International Council on Mining and Metals (ICMM), becoming the first Indian company to achieve this membership. This represents a significant milestone for the company in the global mining industry.",
            "Sentiment": "positive",
            "PublishDate": 1754985852495,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Zinc Appoints Ashish Chatterjee as Government Nominee Director",
            "Summary": "Hindustan Zinc Limited appointed Mr. Ashish Chatterjee as Government Nominee Director (Non-Executive) effective July 25, 2025, replacing Ms. Nirupama Kotru. The appointment was made following an order from the Ministry of Mines, Government of India, and was approved by the company's Board of Directors. Mr. Chatterjee, who holds the position of Additional Secretary & Financial Advisor in the Ministry of Steel, will also serve on the Audit and Risk Management Committee. He is a 1999 batch IAS officer from Tamil Nadu cadre with over 25 years of administrative experience, including previous roles as Government Nominee Director on boards of GAIL, SAIL, and NMDC. Ms. Nirupama Kotru ceased to be a director from the same date, with the Board acknowledging her valuable contributions during her tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1753873543017,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hindustan Zinc Appoints New Government Director as Board Composition Changes",
            "Summary": "Hindustan Zinc Limited has announced a change in its board composition with the Ministry of Mines appointing Ashish Chatterjee as part-time Official Director, replacing Nirupama Kotru. Chatterjee, who serves as Additional Secretary & Financial Advisor at the Ministry of Steel with additional charge of Ministry of Coal, Mines and Minority Affairs, was appointed as Government Nominee Director effective July 25, 2025. His appointment will continue until further orders from the Ministry. The transition involved the simultaneous cessation of Kotru's role as Government Nominee Director on the same date. The company is completing necessary formalities related to this board change.",
            "Sentiment": "neutral",
            "PublishDate": 1753440723417,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hindustan Zinc Appoints New Independent Director, Re-appoints Another as Third Director's Tenure Ends",
            "Summary": "Hindustan Zinc Limited announced board changes effective August 2025. The company appointed Anoop Kumar Mittal as Additional Director designated as Non-Executive Independent Director for a 2-year term from August 1, 2025 to July 31, 2027. Mittal brings over 40 years of construction sector experience and previously served as Chairman & Managing Director of NBCC (India) Limited from 2013 to 2019. The company also re-appointed Pallavi Joshi Bakhru as Non-Executive Independent Director for a second 2-year term from August 10, 2025 to August 09, 2027. Bakhru is a chartered accountant with over 30 years of experience and leads Private Client Service at Grant Thornton Bharat. Meanwhile, Akhilesh Joshi's tenure as Non-Executive Independent Director will conclude on July 31, 2025, marking the end of his second and final term. Both appointments require shareholder approval at the upcoming Annual General Meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1753438927789,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hindustan Zinc Reports Strong Q1 Performance with Record Mine Production and Lowest Cost Since Underground Transition",
            "Summary": "Hindustan Zinc delivered its highest-ever first quarter mine metal production of 265,000 tons with the lowest quarterly cost of production at $1,010 per ton since underground transition. The company reported revenue of Rs. 7,771 crores, down 4% year-on-year due to lower zinc and lead prices, partially offset by higher silver prices. EBITDA stood at Rs. 3,860 crores with a 50% margin, while profit after tax reached Rs. 2,234 crores. The company paid an interim dividend of Rs. 10 per share totaling Rs. 4,225 crores. Refined metal production was 250,000 tons, impacted by maintenance activities. The board approved a 250,000 tons per annum integrated metal capacity expansion with Rs. 12,000 crores capital expenditure. The company secured LOIs for three critical mineral blocks: potash in Rajasthan, rare earth elements in Uttar Pradesh, and tungsten in Andhra Pradesh. Renewable energy usage increased to 19% from 13% in the previous year, while domestic coal utilization reached 55%. Silver production was 149 metric tons with precious metals contributing 41% to overall profitability.",
            "Sentiment": "positive",
            "PublishDate": 1753101596256,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Zinc: Q1 Profit Beats Estimates Despite Revenue Miss",
            "Summary": "Hindustan Zinc reported Q1 FY26 consolidated net profit of ₹2,234 crore, beating estimates but down 4.7% YoY. Revenue fell 4.4% to ₹7,771 crore, missing expectations. EBITDA margin improved to 49.7%, surpassing both YoY and estimated figures.",
            "Sentiment": "neutral",
            "PublishDate": 1752828767000,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Zinc Reports Q1 Financial Results",
            "Summary": "Hindustan Zinc has released its Q1 financial results. The company reported an EBITDA of 38.5 billion rupees, down from 39.4 billion rupees year-over-year. However, the EBITDA margin improved to 49.9% from 48.4% in the same period last year. Revenue decreased to 77.2 billion rupees from 79 billion rupees year-over-year. The company's net profit for Q1 stood at 22.3 billion rupees, down from 23.6 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1752827003000,
            "Source": "result"
        },
        {
            "Title": "Hindustan Zinc: Secures Major Potash-Halite Block in Rajasthan",
            "Summary": "Hindustan Zinc received a Letter of Intent for a 1,841.25-hectare potash and halite block in Rajasthan's Hanumangarh district. The company also reported its highest-ever Q1 mined metal production at 265 kilo tonnes, up 1% YoY, but down 15% QoQ. Refined metal output decreased to 250 kilo tonnes, while wind power generation increased by 24% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1752724020000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Zinc Receives Letter of Intent for Potash and Halite Block in Rajasthan",
            "Summary": "Hindustan Zinc has received a Letter of Intent from the government, designating it as the preferred bidder for a composite license for the Jhandawali – Satipura Amalgamated Potash and Halite Block in Rajasthan. This indicates that the company has been selected for the mining rights of potash and halite in the specified area.",
            "Sentiment": "positive",
            "PublishDate": 1752711077000,
            "Source": "default"
        },
        {
            "Title": "Hindustan Zinc: Wins Potash-Halite Block in Rajasthan, Reports Q1 Production",
            "Summary": "Hindustan Zinc received a Letter of Intent for a 1,841.25-hectare potash-halite block in Rajasthan. Q1 mined metal output reached 265 kilo tonnes, up 1% YoY. Refined metal production was 250 kilo tonnes, down 5% YoY. Silver production decreased to 149 tonnes, down 11% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1752669433000,
            "Source": "normal_news"
        },
        {
            "Title": "Hindustan Zinc Named Preferred Bidder for Potash and Halite Block in Rajasthan",
            "Summary": "Hindustan Zinc has received an intent letter from the government designating it as the preferred bidder for the Jhanda Wali – Satipura Potash and Halite Block in Rajasthan. This development suggests the company is in a favorable position to acquire mining rights for potash and halite in the specified area.",
            "Sentiment": "positive",
            "PublishDate": 1752668370000,
            "Source": "default"
        }
    ]
}