{
    "Symbol": "HINDCOMPOS",
    "ISIN": "INE310C01029",
    "News": [
        {
            "Title": "Hindustan Composites Q3FY26 Results Announced",
            "Summary": "Hindustan Composites reported Q3FY26 results with revenue of ₹9,451 lakhs and net profit of ₹667 lakhs. Company also re-appointed internal auditors for FY27.",
            "Sentiment": "positive",
            "PublishDate": 1770902043583,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Composites Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Hindustan Composites reported quarterly net profit of 53 million rupees, down from 93 million rupees in the same period last year. Revenue increased to 886 million rupees from 770 million rupees year-over-year. EBITDA declined to 105 million rupees from 129 million rupees, while EBITDA margin compressed to 11.89% from 16.78% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762951708755,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Composites Reports Q1 FY26 Results, Appoints New Auditors and Senior Management",
            "Summary": "Hindustan Composites Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 8,708 lakhs compared to Rs 7,715 lakhs in the same quarter last year. Net profit after tax stood at Rs 746 lakhs versus Rs 867 lakhs in the previous year quarter. Earnings per share was Rs 5.05 compared to Rs 5.87 in the corresponding quarter. The Board approved the appointment of M/s. MR & Associates as Secretarial Auditors for a five-year term from FY 2025-26 to 2029-30, subject to shareholder approval at the 61st Annual General Meeting. Additionally, Mr. Vimal Kiritkumar Desai was appointed as Senior Management Personnel in the role of GM-Purchase. The company also announced that dividend for FY 2024-25, if approved at the AGM, will be paid between October 1-15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754658177651,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Composites Approves 48M Rupee Capacity Expansion Plan",
            "Summary": "Hindustan Composites has approved a capacity expansion plan for the fiscal year 2025-26. The company plans to invest 48 million rupees in this expansion initiative, aiming to increase its production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1746627692000,
            "Source": "default"
        },
        {
            "Title": "Hindustan Composites Announces Dividend",
            "Summary": "Hindustan Composites has recommended a dividend of 5 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1746620714000,
            "Source": "result"
        },
        {
            "Title": "Hindustan Composites Reports Improved Q4 EBITDA and Margin",
            "Summary": "Hindustan Composites has announced its Q4 financial results. The company's EBITDA increased to 162 million rupees from 123 million rupees year-over-year. Additionally, the EBITDA margin improved to 18.21% from 15.6% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1746620494000,
            "Source": "result"
        },
        {
            "Title": "Hindustan Composites Reports Q4 Financial Results",
            "Summary": "Hindustan Composites announced its Q4 financial results. The company reported a net profit of 61 million rupees, down from 79.7 million rupees year-over-year and 110 million rupees quarter-over-quarter. However, revenue increased to 892 million rupees from 786 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1746620129000,
            "Source": "result"
        },
        {
            "Title": "Hindustan Composites Receives Final Insurance Settlement for Fire Damage",
            "Summary": "Hindustan Composites has received a final insurance settlement of 37.5 million rupees for damage caused by a fire. The company reported that the total damage from the fire was approximately 64 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1739801495000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Composites Reports Strong Q3 Results and Expands into Metals and Commodities Trading",
            "Summary": "Hindustan Composites announced its Q3 financial results, showing significant growth. The company's net profit increased to 110 million rupees from 65 million rupees year-over-year. Revenue also rose to 818 million rupees from 717 million rupees in the same period. Additionally, the company's board has approved the commencement of a new metals and commodities trading business.",
            "Sentiment": "positive",
            "PublishDate": 1739233295000,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Composites Expands into Metals and Commodities Trading",
            "Summary": "The board of Hindustan Composites has approved the company's entry into the metals and commodities trading business. This decision represents a significant expansion of the company's operations into a new market sector.",
            "Sentiment": "positive",
            "PublishDate": 1739198504000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Composites Reports Improved Q3 EBITDA and Margin",
            "Summary": "Hindustan Composites has reported significant year-over-year improvements in its financial performance for the third quarter. The company's EBITDA increased to 161 million rupees from 110 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 19.72% from 15.37% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739196230000,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Composites Reports Strong Q3 Financial Results",
            "Summary": "Hindustan Composites has announced its financial results for the third quarter. The company's net profit increased significantly to 110 million rupees, up from 65 million rupees in the same quarter of the previous year. Revenue also saw growth, rising to 818 million rupees from 717 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739196225000,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Composites Terminates Agreement to Acquire Rel Marathwada Stock",
            "Summary": "Hindustan Composites has announced the termination of an agreement to purchase stock in Rel Marathwada. The company has decided not to proceed with the acquisition, but no further details about the reasons for the termination or the potential impact on either company were provided in the brief news statement.",
            "Sentiment": "neutral",
            "PublishDate": 1737505225000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Composites Terminates Agreement to Acquire REL Marathwada Stock",
            "Summary": "Hindustan Composites has announced the termination of an agreement to purchase stock in REL Marathwada. The company has decided not to proceed with the acquisition, though specific reasons for the termination were not provided in the brief news statement.",
            "Sentiment": "neutral",
            "PublishDate": 1737466893000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Composites Q2 EBITDA Declines",
            "Summary": "Hindustan Composites reported a decrease in Q2 EBITDA, falling to 129 million rupees from 135 million rupees year-over-year. The company's EBITDA margin also declined to 16.78% from 18.82% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731502916000,
            "Source": "result"
        },
        {
            "Title": "Hindustan Composites Reports Q2 Financial Results",
            "Summary": "Hindustan Composites has announced its financial results for the second quarter. The company reported a net profit of 93 million rupees, which is slightly lower than the 99 million rupees reported in the same quarter last year (YoY) but higher than the 87 million rupees reported in the previous quarter (QoQ). Revenue for Q2 increased to 770 million rupees, up from 717 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731502845000,
            "Source": "result"
        },
        {
            "Title": "Hindustan Composites Acquires HDFC Bank Shares",
            "Summary": "Hindustan Composites has announced the acquisition of 30,000 shares of HDFC Bank for a total of 50.2 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1729171230000,
            "Source": "corporate_action"
        }
    ]
}