{
    "Symbol": "HINDALCO",
    "ISIN": "INE038A01020",
    "News": [
        {
            "Title": "Hindalco Reports Fire Impact at Novelis Oswego Plant",
            "Summary": "Hindalco Industries disclosed fire incidents at its subsidiary Novelis' Oswego plant, estimating $1.3-1.6 billion free cash flow impact with 70-80% insurance recovery expected.",
            "Sentiment": "negative",
            "PublishDate": 1770815655572,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindalco Schedules Q3FY26 Earnings Call for Feb 11",
            "Summary": "Hindalco Industries announces earnings conference call for subsidiary Novelis Inc. on February 11, 2026 at 17:30 IST to discuss Q3FY26 results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770282730040,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindalco Q3 FY26 Earnings Call Set for Feb 12",
            "Summary": "Hindalco Industries announces Q3 FY26 earnings conference call scheduled for February 12, 2026 at 19:00 IST to discuss financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770278143207,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindalco Industries Block Trade Worth Rs. 19.64 Crores",
            "Summary": "Hindalco Industries witnessed a significant NSE block trade worth Rs. 19.64 crores involving approximately 205,175 shares at Rs. 957.30 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770100944057,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindalco announces ₹21,000-crore smelter expansion",
            "Summary": "Hindalco Industries announces major ₹21,000-crore smelter expansion in Odisha and commissions ₹4,500-crore FRP and battery foil facilities, part of ₹37,000-crore investment plan for the state.",
            "Sentiment": "positive",
            "PublishDate": 1769507508104,
            "Source": "stocks"
        },
        {
            "Title": "Hindalco Industries Block Trade Worth ₹93.18 Crores",
            "Summary": "Hindalco Industries witnessed a significant block trade on BSE worth ₹93.18 crores involving approximately 10 lakh shares at ₹931.25 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768287967944,
            "Source": "co_actions_results"
        },
        {
            "Title": "HSBC Sets Buy Rating on Hindalco with ₹1,060 Target",
            "Summary": "HSBC maintains a buy recommendation on Hindalco Industries with a target price of ₹1,060, indicating positive analyst sentiment for the aluminum and copper major.",
            "Sentiment": "positive",
            "PublishDate": 1768189556830,
            "Source": "stocks"
        },
        {
            "Title": "HSBC Raises Hindalco Target to ₹1,060 on Aluminium Rally",
            "Summary": "HSBC reiterates Buy rating on Hindalco with revised target price of ₹1,060, citing 17% upside potential driven by tightening global aluminium supply and improving earnings outlook for FY27-28.",
            "Sentiment": "positive",
            "PublishDate": 1768187725120,
            "Source": "stocks"
        },
        {
            "Title": "Hindalco's Novelis Raises $750M, Eyes Strong FY27 Growth",
            "Summary": "Novelis secures $750M through AV Minerals share deal while MD Satish Pai projects strong FY27 performance with $500/tonne EBITDA target as operations normalize post-disruptions.",
            "Sentiment": "positive",
            "PublishDate": 1767021083443,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindalco Board Meeting Set for February 12, 2026",
            "Summary": "Hindalco Industries announces board meeting on February 12, 2026 to consider Q3FY26 financial results. Trading window closes from January 1 to February 16, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767009523974,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindalco outlook: Long-term strength intact despite headwinds",
            "Summary": "Axis Securities maintains positive view on Hindalco despite near-term Novelis challenges, citing strong aluminium fundamentals and robust domestic operations as key growth drivers.",
            "Sentiment": "positive",
            "PublishDate": 1766981018351,
            "Source": "stocks"
        },
        {
            "Title": "Hindalco's Novelis Appoints Ernst & Young as Auditor",
            "Summary": "Hindalco Industries' subsidiary Novelis Inc. has selected Ernst & Young LLP as its independent registered public accounting firm for fiscal year ending March 31, 2028, subject to regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1765611019700,
            "Source": "stocks"
        },
        {
            "Title": "Hindalco Gets ESG Rating of 69 from NSE Sustainability",
            "Summary": "Hindalco Industries receives an ESG rating of 69 from NSE Sustainability, reflecting the company's performance on environmental, social and governance parameters based on publicly available information.",
            "Sentiment": "positive",
            "PublishDate": 1765378862293,
            "Source": "stocks"
        },
        {
            "Title": "Hindalco Completes 100% Acquisition of EMMRL Mining Subsidiary",
            "Summary": "Hindalco Industries Limited has completed the acquisition of 100% equity stake in EMMRL (a wholly owned subsidiary of Essel Mining Industries Limited) on December 1, 2025. The transaction makes EMMRL a wholly owned subsidiary of Hindalco effective December 1, 2025, expanding the company's mining operations portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1764600171586,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindalco Industries Receives ESG Rating of 68.4 from SES ESG Research",
            "Summary": "SES ESG Research, a SEBI registered ESG rating provider, independently assigned an ESG rating of 68.4 to Hindalco Industries Limited based on publicly available information. The company clarified it did not engage SES for this assessment, and received email notification about the rating on November 27, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764320366021,
            "Source": "stock"
        },
        {
            "Title": "Hindalco Shares Investor Presentation for Singapore Non-Deal Roadshow",
            "Summary": "Hindalco Industries Limited filed an investor presentation for a non-deal roadshow scheduled in Singapore from November 24-26, 2025, with stock exchanges and made it available on their website. The presentation highlights the company's position as rank 5 in NIFTY 50 peers with H1 ROCE of 19.6%, growth capex of ₹10 billion, and strategic expansion plans across aluminum, copper, and specialty alumina segments.",
            "Sentiment": "positive",
            "PublishDate": 1763739924530,
            "Source": "stock"
        },
        {
            "Title": "Fire Incident at Hindalco's Novelis Plant in Oswego, New York",
            "Summary": "A fire occurred at Novelis Plant in Oswego, New York on November 20, 2025, with all workers safely evacuated and no injuries reported. The incident affects Novelis, a wholly owned subsidiary of Hindalco Industries Limited, with multiple local fire departments responding and the fire now extinguished.",
            "Sentiment": "neutral",
            "PublishDate": 1763706231988,
            "Source": "stock"
        },
        {
            "Title": "Hindalco Reports 21% Jump in Q2 FY26 Net Profit, Announces Major Expansion Plans",
            "Summary": "Hindalco Industries delivered consolidated net profit of INR 4,741 crores in Q2 FY26, up 21% year-on-year, with consolidated EBITDA rising 6% to INR 9,104 crores. The company announced Phase 2 expansion of Aditya Aluminium Smelter by 180 Kt capacity and revised Novelis Bay Minette project cost to $5 billion while maintaining consolidated net leverage target below 2x.",
            "Sentiment": "positive",
            "PublishDate": 1763058284305,
            "Source": "earnings"
        },
        {
            "Title": "Hindalco Targets Rs 4,000 Crore Aluminium Downstream Ebitda By FY30",
            "Summary": "Hindalco Industries aims to achieve Rs 4,000 crore in aluminium downstream Ebitda by FY30, with Managing Director Satish Pai citing progress in major projects like Aditya FRP and Silvassa. The company expects to cross Rs 1,000 crore in aluminium downstream Ebitda in FY26, up from Rs 261 crore in Q2FY26, representing 69% year-on-year growth. Subsidiary Novelis faced a $53 million tariff impact, but management expects to mitigate the quarterly $60 million tariff impact in the second half. Hindalco raised its cost-saving target to $125 million annually by FY26 and committed to a $300 million cost-reduction programme by FY28. The fire-affected Novelis plant in New York is expected to resume full operations in December, with $100-150 million EBITDA impact across Q3 and Q4, largely covered by insurance.",
            "Sentiment": "positive",
            "PublishDate": 1762839226154,
            "Source": "stock"
        },
        {
            "Title": "Hindalco to Inject $750 Million Equity into US Subsidiary Novelis",
            "Summary": "Hindalco Industries will infuse $750 million equity into its US subsidiary Novelis during the January-March period to address cash flow challenges following a fire at Novelis' Oswego plant in mid-September. The equity injection comes as capital expenditure for the Bay Minette plant increased 22% to $5 billion, with the first phase commissioning planned for 2026 and a second phase requiring an additional $1.5 billion investment. CEO Satish Pai stated the equity infusion leverages Hindalco's balance sheet strength while avoiding additional debt for Novelis beyond committed net debt to EBITDA ratios. The Oswego plant's hot mill will restart by month-end, ahead of December guidance. Novelis' net leverage ratio stood at 3.5 times at the September quarter-end. The Bay Minette plant expects EBITDA of $1,000 per tonne compared to Novelis' current $448 per tonne, with 400,000 tonnes of capacity already contracted and remaining 200,000 tonnes to be contracted at higher prices.",
            "Sentiment": "neutral",
            "PublishDate": 1762574834422,
            "Source": "stock"
        },
        {
            "Title": "Hindalco Q2 Profit Jumps 21% to Rs 4,741 Crore on Strong India Business Performance",
            "Summary": "Hindalco Industries reported a 21.2% increase in consolidated profit after tax to Rs 4,741 crore for the quarter ended September 2025, compared to Rs 3,909 crore in the same period last year. Revenue from operations grew 13% to Rs 66,058 crore from Rs 58,203 crore year-on-year. The India aluminium upstream business delivered strong results with EBITDA rising 22% to Rs 4,524 crore, while aluminium downstream EBITDA surged 69% to Rs 261 crore. Subsidiary Novelis reported flat shipments despite market headwinds. Managing Director Satish Pai attributed the performance to disciplined cost management, operational efficiencies, and the company's integrated business model.",
            "Sentiment": "positive",
            "PublishDate": 1762509807637,
            "Source": "earnings"
        },
        {
            "Title": "Hindalco Reports Significant Increase in Consolidated Debt Levels",
            "Summary": "Hindalco's consolidated gross debt increased to Rs 726.70 billion as of September 30, compared to Rs 591.21 billion in the previous year, representing a substantial year-over-year rise. The company's consolidated net debt also grew to Rs 414.15 billion from Rs 360.33 billion during the same period.",
            "Sentiment": "negative",
            "PublishDate": 1762505124366,
            "Source": "stock"
        },
        {
            "Title": "Hindalco Plans ₹10,225 Crore Expansion at Aditya Aluminium Unit in Odisha",
            "Summary": "Hindalco Industries plans to expand capacity at its Aditya Aluminium unit in Odisha. The current capacity stands at 370KT and is fully utilized. The company proposes to increase capacity by 193KT by FY2029, requiring an investment of ₹10,225 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762504203661,
            "Source": "stock"
        },
        {
            "Title": "Novelis Plans to Restart Hot Mill at Oswego Plant by December 2025",
            "Summary": "Novelis, a subsidiary of Hindalco, has announced plans to restart the hot mill operations at its Oswego plant by December 2025. The restart represents a significant operational development for the aluminum rolling company's manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1762503825268,
            "Source": "stock"
        },
        {
            "Title": "Hindalco Reports Strong Q2 Results with Revenue and Profit Growth",
            "Summary": "Hindalco reported quarterly consolidated revenue of 661 billion rupees, up from 582 billion rupees year-over-year, exceeding estimates of 657 billion rupees. The company's consolidated net profit reached 47.4 billion rupees compared to 39.09 billion rupees in the previous year, slightly above the estimated 46.5 billion rupees. EBITDA increased to 89.67 billion rupees from 80.3 billion rupees year-over-year, surpassing estimates of 85.98 billion rupees. However, EBITDA margin declined slightly to 13.6% from 13.8% in the previous year, though it remained above the estimated 13.1%.",
            "Sentiment": "positive",
            "PublishDate": 1762503344797,
            "Source": "earnings"
        },
        {
            "Title": "Hindalco Faces Multiple Downgrades After Novelis Reports Weak Results",
            "Summary": "Hindalco Industries will be in focus after its subsidiary Novelis reported disappointing results. Novelis posted net sales of $4.7 billion, up 10% year-over-year, but EBITDA declined to $422 million from $462 million previously. The company faced a $54 million negative impact from Trump administration tariffs, nearly double the previous quarter's $28 million hit. A fire at Novelis' Oswego plant is expected to impact cash flow by $550-650 million and EBITDA by $100-150 million, though 70-80% may be recoverable through insurance. Net debt reached $5.8 billion, the highest level in 21 quarters. The Bay Minette project costs have escalated from an initial $2.5 billion to $5 billion due to inflation and execution complexities. Multiple brokerages downgraded Hindalco: Investec cut it to 'sell' with a ₹693 target, Axis Capital reduced it to 'reduce' with ₹770 target, Nuvama downgraded to 'hold' with ₹838 target, and Equirus moved to 'reduce' with ₹790 target. Hindalco shares closed 2% lower at ₹830.85, despite gaining 40% year-to-date.",
            "Sentiment": "negative",
            "PublishDate": 1762386428340,
            "Source": "stock"
        },
        {
            "Title": "Hindalco Provides Third Update on Novelis Oswego Plant Fire Incident",
            "Summary": "Hindalco Industries provided an update on the fire incident at its wholly-owned subsidiary Novelis' plant in Oswego, New York that occurred on September 16, 2025. The company estimates 70-80% recovery through insurance in future periods. For Q2 FY26, Hindalco recognized $21 million in related charges and estimates FY2026 negative free cash flow impact of $550-650 million, including an Adjusted EBITDA impact of $100-150 million. The company is undertaking extensive restoration efforts to return to normalcy. The Hot Mill is expected to restart by end-December 2025, followed by a 4-6 week production ramp-up period.",
            "Sentiment": "negative",
            "PublishDate": 1762322385460,
            "Source": "stock"
        },
        {
            "Title": "Novelis Expands Alabama Plant and Plans Oswego Mill Restart with $913 Million Investment",
            "Summary": "Novelis is investing heavily in its Bay Minette, Alabama greenfield plant to expand rolling and recycling capacity. The company is focusing on margin recovery through cost efficiency measures and targeting the restart of its Oswego mill by December 2025. These initiatives are supported by $913 million in capital expenditure planned for the first half of FY26.",
            "Sentiment": "positive",
            "PublishDate": 1762268233387,
            "Source": "stock"
        },
        {
            "Title": "Novelis Reports Mixed Q2 FY2026 Results With 27% Rise in Net Income",
            "Summary": "Novelis announced its second quarter fiscal year 2026 financial results. The company reported net income of $163 million, representing a 27% increase compared to the same period last year. However, when excluding special items, net income was $113 million, showing a 37% decline year-over-year. The results indicate mixed performance with overall profitability growing due to special items while core operations saw reduced earnings.",
            "Sentiment": "neutral",
            "PublishDate": 1762267179630,
            "Source": "earnings"
        },
        {
            "Title": "Hindalco Shares Hit Record High of Rs 836.20 on Metal Price Rally",
            "Summary": "Hindalco Industries shares reached a record high of Rs 836.20 on BSE, gaining 6.5% over three sessions and rising over 40% year-to-date. The surge was driven by a rally in global copper and aluminium prices, with copper hitting a 16-month high amid optimism over potential U.S.-China trade agreement discussions at the ASEAN Summit. Copper prices climbed 1.78% on Shanghai Futures Exchange to 88,420 yuan per ton, while LME three-month copper rose 0.94% to $11,065.50 per ton. Aluminium prices also gained 0.73% on LME. As an integrated producer of both metals, Hindalco benefits directly from higher global prices through increased revenue and operating margins. The stock trades above all key moving averages with RSI at 76.2 indicating overbought conditions. Hindalco will announce quarterly results on November 7, 2025. In the June quarter, the company reported consolidated EBITDA of Rs 8,673 crore (up 9% year-on-year) and net profit of Rs 4,004 crore (up 30%).",
            "Sentiment": "positive",
            "PublishDate": 1761543029943,
            "Source": "stock"
        },
        {
            "Title": "Hindalco Signs Agreement to Acquire EMIL Mines and Mineral Resources",
            "Summary": "Hindalco has signed an agreement to fully acquire EMIL Mines and Mineral Resources. The completion of this acquisition is expected by November 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761320431573,
            "Source": "order&deals"
        },
        {
            "Title": "Hindalco's Novelis Plant Fire Recovery: Hot Mill Restart Expected by End-December 2025",
            "Summary": "Hindalco Industries provided an update on the fire incident at its wholly owned subsidiary Novelis Inc.'s plant in Oswego, New York that occurred on September 16, 2025. The company reported that extensive restoration efforts are underway to return operations to normal. The Hot Mill at the facility is expected to restart by the end of December 2025, followed by a 4-6 week production ramp-up period. Novelis has made detailed information about the incident available on its website.",
            "Sentiment": "neutral",
            "PublishDate": 1761309181713,
            "Source": "stock"
        },
        {
            "Title": "Vedanta, Hindalco & Nalco Shares Rally Up to 5% on Rising Aluminium Prices",
            "Summary": "Shares of Vedanta, Hindalco, and National Aluminium Company (Nalco) surged up to 5% as aluminium prices on the London Metals Exchange crossed $2,850 per tonne. Hindalco gained 4.3% to Rs 826.50, Nalco rose over 5% to Rs 240, and Vedanta climbed 3.5% to Rs 500. The rally was driven by tight global supply and demand dynamics, including Iceland's Century Aluminum announcing a temporary production slowdown at its Grundartangi smelter due to equipment failure, reducing output by two-thirds. US tariffs on aluminium imports increased from 25% to 50%, which could indirectly benefit Hindalco and its subsidiary Novelis by reducing competition from other suppliers in global markets. Separately, Vedanta announced plans to invest an additional Rs 1 lakh crore in Odisha, including a Rs 2,000-crore ferro-alloys plant in Keonjhar and two new aluminium parks.",
            "Sentiment": "positive",
            "PublishDate": 1761284143031,
            "Source": "stock"
        },
        {
            "Title": "Hindalco's AluChem Acquisition Review Delayed Due to U.S. Government Shutdown",
            "Summary": "Hindalco Industries provided an update on its step-down subsidiary Aditya Holdings LLC's acquisition of AluChem Companies, Inc. The company submitted a short-form declaration to CFIUS on August 6, 2025, which was accepted on August 12, 2025, starting a 30-day assessment period that concluded on September 10, 2025. CFIUS subsequently requested a long-form declaration, which was submitted on September 30, 2025. The review process has been delayed due to the U.S. federal government shutdown that began on October 1, 2025, causing statutory deadlines under the CFIUS review framework to be tolled. Once the shutdown ends and CFIUS formally accepts the final filing, the review process may take up to approximately 105 days to complete.",
            "Sentiment": "neutral",
            "PublishDate": 1761205138877,
            "Source": "order&deals"
        },
        {
            "Title": "Hindalco Schedules Quarterly Results Review for November 7",
            "Summary": "Hindalco has announced plans to review its second quarter results on November 7. The company will be presenting its quarterly financial performance during this scheduled review.",
            "Sentiment": "neutral",
            "PublishDate": 1758883244992,
            "Source": "earnings"
        },
        {
            "Title": "Novelis Enters $100 Million Municipal Bond Agreement and Amends Term Loan Facility",
            "Summary": "Novelis Inc., a wholly owned subsidiary of Hindalco Industries Limited, announced entry into a $100 million municipal bond loan agreement and an amendment to its Term Loan credit facility. The company filed a Form 8-K with the U.S. Securities and Exchange Commission regarding these financial updates. Hindalco informed stock exchanges including BSE, NSE, and Luxembourg Stock Exchange about these developments through its subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1758255739531,
            "Source": "stock"
        },
        {
            "Title": "Hindalco's Novelis Plant in New York Halts Production Following Fire Incident",
            "Summary": "Hindalco Industries reported a fire incident at its Novelis plant in Oswego, New York on September 16, 2025, at around 10 p.m. EDT. The fire was extinguished by 2:00 a.m. EDT on September 17, 2025, with no injuries reported. Production at the plant has been temporarily halted while the company investigates the cause and assesses operational impact. The plant carries insurance coverage for property damage and business interruption losses, subject to deductibles and policy limits. Novelis Inc. is a wholly owned subsidiary of Hindalco Industries Limited.",
            "Sentiment": "negative",
            "PublishDate": 1758165575354,
            "Source": "stock"
        },
        {
            "Title": "Hindalco Industries Block Trade Worth Rs. 59.80 Crores Executed on NSE",
            "Summary": "Hindalco Industries executed a block trade on the National Stock Exchange involving approximately 846,956 shares at Rs. 706.00 per share, with a total transaction value of Rs. 59.80 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1756453830598,
            "Source": "order&deals"
        },
        {
            "Title": "Hindalco Q1FY26: India Business EBITDA Up 13% YoY, Novelis Faces Tariff Headwinds",
            "Summary": "Hindalco Industries reported consolidated business segment EBITDA flat at INR8,539 crores for Q1FY26, while net profit increased 30% year-on-year to INR4,004 crores. The India business delivered strong performance with EBITDA up 13% to INR4,982 crores and net profit rising 45% to INR2,847 crores. Indian aluminum upstream EBITDA grew 17% to INR4,080 crores with margins at 44%, driven by lower input costs and increased linkage coal availability. The downstream aluminum business achieved record quarterly EBITDA of INR229 crores, up 108% year-on-year. Novelis faced challenges with EBITDA declining 17% to $416 million due to elevated scrap prices and tariff impacts, though shipments increased 1% to 963 Kt. The company maintains net cash of INR18,657 crores in India operations while Novelis carries net debt of INR46,923 crores. Hindalco announced acquisition of US-based AluChem for $125 million enterprise value to strengthen specialty alumina capabilities. Management expects Q2 aluminum costs to increase 3% due to monsoon impact on coal supplies.",
            "Sentiment": "neutral",
            "PublishDate": 1755524078332,
            "Source": "earnings"
        },
        {
            "Title": "Hindalco Expects Strong Performance Through FY26 Based on Metal Prices and Operational Efficiency",
            "Summary": "Hindalco Industries Managing Director Satish Pai expressed confidence in replicating the company's strong quarterly performance for the remainder of FY26, provided London Metal Exchange aluminium prices stay between $2,400-2,600 per tonne. The company reported a 30% year-on-year increase in net profit to Rs 4,004 crore, with consolidated revenue rising 13% to Rs 64,232 crore and Ebitda growing 9% to Rs 8,673 crore. The aluminium upstream business achieved a 44% Ebitda margin with nearly $1,500 Ebitda per tonne, marking one of the strongest performances in 15 quarters. The copper business contributed Rs 673 crore to Ebitda despite challenging market conditions. Pai highlighted the company's integrated business model and expects US subsidiary Novelis to recover significantly in the second half. Two new projects, Aditya FRP and copper IGT, are scheduled for commissioning in the July-September quarter, expected to add 70,000 tonnes of rolled products and 15,000 tonnes of copper tubes respectively. Hindalco shares closed 5.09% higher at Rs 701.6.",
            "Sentiment": "positive",
            "PublishDate": 1755314526825,
            "Source": "earnings"
        },
        {
            "Title": "Hindalco Co MD Forecasts Rising Domestic Coal Prices Due to Monsoon Impact",
            "Summary": "Hindalco's Co MD predicts domestic coal prices will increase due to monsoon conditions. The executive also noted that scrap prices are decreasing in the U.S., which is expected to benefit Novelis. Additionally, the Co MD observed slow automotive demand in Europe.",
            "Sentiment": "neutral",
            "PublishDate": 1754997688830,
            "Source": "stock"
        },
        {
            "Title": "Hindalco Reports No Impact from US Tariffs on Indian Operations",
            "Summary": "Hindalco management stated that US tariffs had no effect on the company's Indian operations during the first quarter. This information was shared during the company's earnings call.",
            "Sentiment": "neutral",
            "PublishDate": 1754992913534,
            "Source": "earnings"
        },
        {
            "Title": "Hindalco Reports Strong Q1 FY26 Results with 30% PAT Growth, Board Changes Announced",
            "Summary": "Hindalco Industries Limited reported consolidated revenue of ₹64,232 crore (up 13% YoY) and profit after tax of ₹4,004 crore (up 30% YoY) for the quarter ended June 30, 2025. The company's aluminium upstream business delivered EBITDA of ₹4,080 crore with industry-best margins of 44%, while aluminium downstream achieved record EBITDA of ₹229 crore (up 108%). Copper segment maintained healthy EBITDA of ₹673 crore despite lower TC/RCs. Novelis reported 1% growth in shipments to 963 KT with beverage can volumes up 8%. The board approved two key acquisitions: 100% stake in AluChem Companies Inc. for $125 million and EMIL Mines and Mineral Resources Limited. Board composition changes include Mr. Yazdi Piroj Dandiwala ceasing as Independent Director upon completion of his second term and Mr. Praveen Kumar Maheshwari resigning as Whole-time Director due to personal reasons, both effective August 13, 2025. The company faces ongoing CBI investigation regarding alleged coal mine misutilization from 2014-15, with financial impact currently not determinable.",
            "Sentiment": "positive",
            "PublishDate": 1754989699609,
            "Source": "earnings"
        },
        {
            "Title": "Hindalco Reports Strong Q1 Results with Revenue Rising to 243B Rupees",
            "Summary": "Hindalco delivered robust quarterly results with revenue reaching 243 billion rupees, surpassing the previous year's 221.55 billion rupees and exceeding estimates of 236.4 billion rupees. Consolidated EBITDA grew to 79.1 billion rupees from 75.03 billion rupees year-over-year, though EBITDA margin declined to 12.3% from 13.16%. The company's standalone net profit increased significantly to 18.6 billion rupees from 14.71 billion rupees, beating estimates of 15.27 billion rupees. Consolidated net profit rose to 40 billion rupees compared to 30.74 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1754988923622,
            "Source": "earnings"
        },
        {
            "Title": "Hindalco Shares Drop 2.3% as US Arm Novelis Reports 67% Sequential Profit Decline",
            "Summary": "Hindalco Industries shares fell 2.3% to Rs 657.5 following weak quarterly results from its US subsidiary Novelis Inc. Novelis reported net profit of $96 million, down 67% sequentially and 36% year-on-year, missing market expectations. Revenue increased 2.83% to $4.7 billion, while EBITDA dropped 30% to $361 million with margins compressing to 7.65% from 11.33% in the previous quarter. The performance was impacted by elevated scrap costs and tariff effects. Despite the decline, JPMorgan maintained an 'Overweight' rating with a target price of Rs 715, while CLSA retained 'Outperform' with Rs 850 target. Among 29 analysts covering the stock, 21 recommend 'buy', five suggest 'hold', and three advise 'sell', with an average 12-month price target of Rs 749 implying 12% upside potential.",
            "Sentiment": "negative",
            "PublishDate": 1754972476408,
            "Source": "earnings"
        },
        {
            "Title": "Novelis Launches $750 Million Cash Tender Offer for 2026 Senior Notes and Plans New 2033 Note Issuance",
            "Summary": "Novelis Corporation, an indirect subsidiary of Novelis Inc. (which is owned by Hindalco Industries), commenced a cash tender offer to purchase all outstanding 3.250% Senior Notes due November 2026. The company is offering $997.50 per $1,000 principal amount of notes, plus accrued interest. The tender offer expires August 15, 2025, with settlement expected August 18, 2025. Simultaneously, Novelis Corporation plans to offer $750 million in new senior unsecured notes due 2033 through a private offering. The proceeds from the new note issuance will be used to purchase the 2026 notes through the tender offer and cover associated fees. Any remaining proceeds may be used to redeem 2026 notes not tendered. The tender offer is conditional on receiving at least $750 million in gross proceeds from the new note offering. BNP Paribas Securities Corp. serves as dealer manager for the transaction. Novelis reported net sales of $17.1 billion in fiscal year 2025 and describes itself as a global leader in aluminum products and the world's largest aluminum recycler.",
            "Sentiment": "neutral",
            "PublishDate": 1754936423847,
            "Source": "stock"
        },
        {
            "Title": "Novelis Q1 FY26 Results: Net Income Falls 36% Despite 13% Revenue Growth",
            "Summary": "Novelis Inc., Hindalco's wholly owned subsidiary, reported quarterly results with net sales increasing 13% to $4.7 billion, driven by higher aluminum prices and 1% growth in rolled product shipments to 963 kilotonnes. However, net income attributable to common shareholders declined 36% to $96 million, while Adjusted EBITDA dropped 17% to $416 million. The performance was impacted by higher aluminum scrap prices, unfavorable product mix, and net negative tariff effects of $28 million, partially offset by higher product pricing and lower SG&A costs. The company implemented cost reduction measures expected to generate over $100 million in run-rate savings by end of fiscal 2026, exceeding the previous target of $75 million. Novelis continues construction of its Bay Minette, Alabama facility with 600kt capacity, commissioning expected in second half of 2026. The company maintains a net leverage ratio of 3.2x with $3.0 billion in total liquidity.",
            "Sentiment": "negative",
            "PublishDate": 1754912851793,
            "Source": "earnings"
        },
        {
            "Title": "Novelis Plans $600K U.S. Plant Investment and Targets $300M+ Cost Savings",
            "Summary": "Novelis is planning long-term growth through a $600K U.S. plant investment and aims to achieve over $300 million in cost savings. The company reports strong demand for beverage packaging despite facing challenges from scrap costs and tariffs.",
            "Sentiment": "positive",
            "PublishDate": 1754912138363,
            "Source": "stock"
        },
        {
            "Title": "31 Companies Including MCX, Indian Oil, and Hindalco Announce Dividend Payouts with Thursday as Last Purchase Date",
            "Summary": "Thirty-one companies have announced dividend payments with Thursday being the final day for investors to purchase shares to qualify for the dividends. MCX will distribute Rs 30 per share to shareholders. Indian Oil Corp declared a final dividend of Rs 3 per share for financial year 2025, totaling Rs 4,236.4 crore to be paid to nearly 32 lakh shareholders, with the government receiving Rs 2,181.65 crore due to its 51.5% equity stake. Hindalco Industries announced a final dividend of Rs 5 per share, while Ceat will pay Rs 30 per share. Other companies offering dividends include Mankind Pharma, ABB India, Aurobindo Pharma, Paras Defence and Space Technologies, and Quess Corp. Under India's T+1 settlement cycle, shares must be purchased before the record date to qualify for dividend payments.",
            "Sentiment": "positive",
            "PublishDate": 1754538117405,
            "Source": "corporate_action"
        },
        {
            "Title": "DGTR Reinstates Duties on Copper Wire Rod Imports from Southeast Asia",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has reimposed five-year duties on copper wire rod imports from four Southeast Asian nations. This action is aimed at protecting the domestic industry. The specific countries affected and the exact duty rates were not mentioned in the provided information.",
            "Sentiment": "neutral",
            "PublishDate": 1751599024000,
            "Source": "default"
        }
    ]
}