{
    "Symbol": "HINDPETRO",
    "ISIN": "INE094A01015",
    "News": [
        {
            "Title": "HPCL Reschedules Investor Meet to February 5, 2026",
            "Summary": "Hindustan Petroleum Corporation Limited has rescheduled its analysts and investors meeting from February 4 to February 5, 2026, at 3:00 PM at its Mumbai corporate office in coordination with PL Capital Group.",
            "Sentiment": "neutral",
            "PublishDate": 1770145846272,
            "Source": "stocks"
        },
        {
            "Title": "HPCL Announces Senior Management Change",
            "Summary": "Hindustan Petroleum Corporation Limited announces retirement of Shri Udit Nandi, Head - Operations & Commissioning at Rajasthan Refinery Project Site, effective February 01, 2026 due to superannuation.",
            "Sentiment": "neutral",
            "PublishDate": 1769926795875,
            "Source": "stocks"
        },
        {
            "Title": "HPCL Partners with Maraal Aerospace for Clean-Energy UAVs",
            "Summary": "Hindustan Petroleum Corporation Limited invests Rs. 2 crores in IIT Kanpur-incubated startup Maraal Aerospace to develop India's first solar-powered long endurance drone with 12-hour flight capability.",
            "Sentiment": "positive",
            "PublishDate": 1769769758457,
            "Source": "co_actions_results"
        },
        {
            "Title": "HPCL-IGX MoU to boost LNG terminal access in Gujarat",
            "Summary": "Hindustan Petroleum Corporation Limited and Indian Gas Exchange Limited signed an MoU to enhance market-based access to HPCL's Chhara LNG Terminal through a digital platform for transparent regasification services booking.",
            "Sentiment": "positive",
            "PublishDate": 1769769324378,
            "Source": "stocks"
        },
        {
            "Title": "HPCL Partners with Thermax for Clean Energy Solutions",
            "Summary": "Hindustan Petroleum Corporation Limited and Thermax Limited signed an MoU at India Energy Week 2026 in Goa to jointly develop clean energy technologies including HP AEM Electrolyzers and CO2 capture solutions.",
            "Sentiment": "positive",
            "PublishDate": 1769763959038,
            "Source": "stocks"
        },
        {
            "Title": "HPCL, OIL Sign MoU for Compressed Bio-Gas Project",
            "Summary": "Hindustan Petroleum and Oil India Limited signed strategic MoU at India Energy Week 2026 to develop CBG project using HPCL's indigenous HP RAMP technology for waste-to-energy solutions.",
            "Sentiment": "positive",
            "PublishDate": 1769687657048,
            "Source": "co_actions_results"
        },
        {
            "Title": "HPCL Denies Venezuelan Crude Oil Procurement Reports",
            "Summary": "Hindustan Petroleum Corporation Limited clarifies that no negotiations have taken place for Venezuelan crude oil procurement, calling media reports incorrect and out of context.",
            "Sentiment": "neutral",
            "PublishDate": 1769661081505,
            "Source": "stocks"
        },
        {
            "Title": "HPCL Signs Non-Binding MoU with Castrol India",
            "Summary": "Hindustan Petroleum Corporation Limited clarifies its non-binding MoU with Castrol India Limited to explore re-refined base oil ecosystem development in India, stating no immediate operational impact.",
            "Sentiment": "neutral",
            "PublishDate": 1769603104220,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Zinc hits record high on silver rally",
            "Summary": "Hindustan Zinc shares surged 6% to ₹709.95 as silver prices hit all-time highs. Q3FY26 results showed 46.5% profit growth to ₹3,879 crore with record production and improved margins.",
            "Sentiment": "positive",
            "PublishDate": 1769157932840,
            "Source": "stocks"
        },
        {
            "Title": "HPCL Block Trade Worth ₹19.62 Crores on NSE",
            "Summary": "Hindustan Petroleum Corporation executed a significant block trade on NSE involving 458,420 shares valued at ₹19.62 crores at ₹427.95 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1769145316393,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Zinc, Copper shares fall on silver decline",
            "Summary": "Hindustan Zinc dropped 4% and Hindustan Copper fell 5% as silver prices declined over 2% on MCX. Silver ETFs saw steep losses of 10-14% amid leveraged position concerns.",
            "Sentiment": "negative",
            "PublishDate": 1769068001850,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Zinc Appoints New Part-Time Director",
            "Summary": "Hindustan Zinc announces the appointment of Mr. Sandeep Vasant Kadam as new Part-Time Official Director, replacing Mr. Dinesh Mahur effective January 19, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769062048150,
            "Source": "stocks"
        },
        {
            "Title": "HPCL Q3FY26 Net Profit Surges 35% to ₹4,072 Crore",
            "Summary": "Hindustan Petroleum Corporation Limited reported strong Q3FY26 results with net profit rising 35% YoY to ₹4,072 crore. Revenue increased 5% to ₹1,25,169 crore, driven by higher refining margins.",
            "Sentiment": "positive",
            "PublishDate": 1768997659637,
            "Source": "co_actions_results"
        },
        {
            "Title": "HPCL Promotes 9 Employees to Executive Director Roles",
            "Summary": "Hindustan Petroleum Corporation Limited announces internal promotions of 9 employees to Executive Director positions across retail, engineering, marketing, and refinery operations with immediate effect.",
            "Sentiment": "positive",
            "PublishDate": 1768927984771,
            "Source": "stocks"
        },
        {
            "Title": "HPCL Shares Drop 4% on JPMorgan Downgrade to Neutral",
            "Summary": "Hindustan Petroleum Corporation shares declined 4% following JPMorgan's downgrade to 'Neutral' citing valuation concerns and near-term earnings risks from upcoming Rajasthan refinery commissioning.",
            "Sentiment": "negative",
            "PublishDate": 1768908475430,
            "Source": "stocks"
        },
        {
            "Title": "HPCL Conference Call on Jan 22 for Q3FY26 Earnings",
            "Summary": "Hindustan Petroleum Corporation Limited schedules conference call for January 22, 2026 at 11:00 AM IST to discuss Q3FY26 earnings with senior management team following board meeting on January 21.",
            "Sentiment": "neutral",
            "PublishDate": 1768389334499,
            "Source": "co_actions_results"
        },
        {
            "Title": "HPCL Block Trade: ₹60.24 Cr Deal at ₹500/Share",
            "Summary": "Hindustan Petroleum Corporation executed a significant NSE block trade worth ₹60.24 crores involving 1,204,746 shares at ₹500 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767591927222,
            "Source": "co_actions_results"
        },
        {
            "Title": "HPCL Commissions World's First LC-Max Unit at Vizag",
            "Summary": "Hindustan Petroleum successfully commissioned a 3.55 MMTPA Residue Upgradation Facility at Vizag Refinery, featuring world's first LC-Max technology with 93% conversion rate and projected significant GRM improvements.",
            "Sentiment": "positive",
            "PublishDate": 1767447298116,
            "Source": "stocks"
        },
        {
            "Title": "HPCL Gets ESG Rating of 65 from NSE Analytics",
            "Summary": "Hindustan Petroleum Corporation receives ESG rating of 65 in Aspiring Category from NSE Sustainability Ratings and Analytics Limited for fiscal year 2023-2024.",
            "Sentiment": "positive",
            "PublishDate": 1765379570031,
            "Source": "stocks"
        },
        {
            "Title": "HPCL Issues Notice for Unclaimed Dividend Transfer to IEPF",
            "Summary": "Hindustan Petroleum Corporation Limited has notified shareholders about the upcoming transfer of unclaimed dividends from FY 2018-19 (Interim) to FY 2024-25 (Final) to the Investor Education and Protection Fund Authority. Shareholders must claim their unclaimed dividends by February 15, 2026, or the amounts and corresponding shares will be transferred to IEPFA as per statutory requirements under the Companies Act, 2013.",
            "Sentiment": "neutral",
            "PublishDate": 1764341938620,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Zinc Receives Tungsten Mining License in Andhra Pradesh",
            "Summary": "Hindustan Zinc received a composite license from Andhra Pradesh government to explore and mine a tungsten block, marking its expansion beyond zinc, lead, and silver into critical minerals. The Vedanta Group company was declared the successful bidder through a competitive auction process conducted by the Centre, advancing its strategy to diversify into high-value minerals for advanced manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1763201192526,
            "Source": "stock"
        },
        {
            "Title": "HPCL Sets November 4 as Final Date for Rs 5 Interim Dividend Eligibility",
            "Summary": "Hindustan Petroleum Corporation Ltd (HPCL) has declared an interim dividend of Rs 5 per equity share for financial year 2025-26, representing a 50% payout on the face value of Rs 10 per share. Shareholders must purchase shares by November 4 to be eligible, as the record date is set for November 6, 2025, and markets will be closed on November 5 for Guru Nanak Gurpurab. The dividend will be credited to eligible shareholders on or before November 27, 2025. Other companies including Nippon Life India Asset Management Ltd (Rs 9 per share), Share India Securities Ltd (Rs 0.40 per share), TD Power Systems Ltd (Rs 1 per share), and Vaibhav Global Ltd (Rs 1.50 per share) have also announced interim dividends with the same November 6 record date.",
            "Sentiment": "neutral",
            "PublishDate": 1762229010322,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Petroleum Expects ₹7920 Crore Under Recovery Payments, Targets ₹40000 Crore EBITDA",
            "Summary": "Hindustan Petroleum expects to receive ₹7920 crore in under recovery payments over the next 12 months. Of this amount, ₹3300 crore will impact FY26. The company has set a target of achieving ₹40000 crore EBITDA.",
            "Sentiment": "positive",
            "PublishDate": 1761985585178,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Petroleum Corporation Announces Senior Management Change",
            "Summary": "Hindustan Petroleum Corporation Limited announced a change in its senior management team. Shri Ganesh P Gaikwad, Executive Director - CPO, has retired due to superannuation. The change is effective November 01, 2025. The company informed stock exchanges BSE and NSE about this senior management transition as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1761976255532,
            "Source": "corporate_governance"
        },
        {
            "Title": "HPCL Expands Multi-Asset Portfolio with Rajasthan Refinery and Petrochemical Integration",
            "Summary": "HPCL is pursuing a multi-asset expansion strategy that includes developing a Rajasthan refinery, growing its retail network, and integrating petrochemical operations to enhance long-term return on capital employed (ROCE). The company is also focusing on diversification into renewable energy and electric vehicle infrastructure as part of its net-zero roadmap targeting 2040.",
            "Sentiment": "positive",
            "PublishDate": 1761754395842,
            "Source": "stock"
        },
        {
            "Title": "HPCL Reports Strong Refinery Performance and Aviation Growth in Q2",
            "Summary": "HPCL reported solid refinery results with gross refining margin reaching US$ 8.80 per barrel in Q2. The company's aviation division demonstrated strong performance with 6.1% growth during the quarter, contrasting with an industry-wide decline of 2%.",
            "Sentiment": "positive",
            "PublishDate": 1761752397720,
            "Source": "earnings"
        },
        {
            "Title": "HPCL-Mittal Energy Halts Russian Oil Purchases Due to New Sanctions",
            "Summary": "HPCL-Mittal Energy has stopped purchasing Russian oil following new sanctions. The company stated it will continue evaluating its status and comply with government rules and laws.",
            "Sentiment": "neutral",
            "PublishDate": 1761750342369,
            "Source": "stock"
        },
        {
            "Title": "HPCL Plans Major Expansion with 4.6 MMTPA Petrochemical Capacity and 6000 Km Pipeline Network by 2027-28",
            "Summary": "HPCL has announced plans to increase its petrochemical capacity to 4.6 million metric tonnes per annum (MMTPA) by 2027-28. The company also plans to expand its marketing network to 6000 kilometers of pipelines by the same timeframe.",
            "Sentiment": "positive",
            "PublishDate": 1761746750781,
            "Source": "stock"
        },
        {
            "Title": "HPCL Reports $5.95 Per Barrel GRM and Declares Rs 5 Dividend Per Share",
            "Summary": "HPCL reported an average Gross Refining Margin (GRM) of $5.95 per barrel for the April to September period. The company also declared a dividend of Rs 5 per share for shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1761744078771,
            "Source": "stock"
        },
        {
            "Title": "HPCL Reports Decline in Q2 Financial Performance Across Key Metrics",
            "Summary": "HPCL reported quarterly net profit of 38.3 billion rupees, down from 43.7 billion rupees in the previous quarter. Revenue decreased to 1.09 trillion rupees from 1.19 trillion rupees quarter-on-quarter. EBITDA fell to 68.9 billion rupees from 76 billion rupees, while EBITDA margin slightly declined to 6.28% from 6.36% in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1761743731060,
            "Source": "earnings"
        },
        {
            "Title": "HPCL Receives CRISIL AA+/Stable Rating for Proposed Non-Convertible Debentures",
            "Summary": "Hindustan Petroleum Corporation Limited (HPCL) announced that CRISIL Ratings has assigned a credit rating of CRISIL AA+/Stable to the company's proposed Non-Convertible Debentures (NCDs) worth Rs 5,000 crore. The rating disclosure was made in compliance with SEBI listing regulations.",
            "Sentiment": "positive",
            "PublishDate": 1761632665820,
            "Source": "stock"
        },
        {
            "Title": "HPCL Reports Operational Issues at Mumbai Refinery Due to High Salt Content in Crude Oil",
            "Summary": "Hindustan Petroleum Corporation Limited (HPCL) experienced operational problems at its Mumbai Refinery after processing crude oil with very high salt and chloride content that exceeded contractual specifications. The company had sourced 54.6 MT of crude oil from the B-80 Mumbai Offshore oilfield of Hindustan Oil Exploration Company Limited (HOECL) through an auction. The contaminated crude oil caused corrosion in downstream units, suboptimal outputs, and reduced production when processed in October 2025. HPCL has approached the supplier regarding the issue and plans to pursue claims and damages according to contractual terms. The company has implemented necessary steps to restore normal operations.",
            "Sentiment": "negative",
            "PublishDate": 1761567744975,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Zinc's Silver Hedging Strategy Backfires as Prices Surge to Multi-Year Highs",
            "Summary": "Hindustan Zinc hedged 131 tonnes of silver at $37 per ounce, representing 34% of its estimated silver production for the second half of the current financial year. Silver prices have since surged to around $50 per ounce, reaching multi-year highs driven by tightening supply, gold's upward momentum, increased industrial demand, and belief that silver was undervalued. Despite being fundamentally bullish on silver from around $30 per ounce, the company will not fully benefit from the rally due to its hedging positions at lower prices. The stock hit a record high of ₹807.7 on May 22, 2024, but has since declined 40% from those levels despite silver's strong performance.",
            "Sentiment": "negative",
            "PublishDate": 1761211830269,
            "Source": "stock"
        },
        {
            "Title": "HPCL Partners with Kazam to Add 5,350 EV Chargers to Mobile App Platform",
            "Summary": "Hindustan Petroleum Corporation Ltd. (HPCL) integrated 5,350 electric vehicle chargers, including 3,043 DC fast chargers, into the Kazam app through a new partnership. The integration uses Kazam's Open Charge Point Interface platform to provide EV users real-time access to HPCL's charging network across India. Users can locate, navigate, and charge at HPCL stations through the app. HPCL operates over 24,000 fuel retail outlets and is expanding EV charging infrastructure under the Government of India's PM eDrive scheme. The collaboration supports HPCL's goal of enabling cleaner mobility and strengthening India's EV ecosystem. The Kazam platform enables real-time monitoring for charge point operators and e-mobility service providers.",
            "Sentiment": "positive",
            "PublishDate": 1759750842362,
            "Source": "stock"
        },
        {
            "Title": "Fitch Confirms HPCL's BBB- Rating with Stable Outlook",
            "Summary": "Fitch Ratings has confirmed Hindustan Petroleum Corporation Limited's (HPCL) credit rating at 'BBB-' with a stable outlook. The rating confirmation indicates the agency's assessment of the oil refining and marketing company's creditworthiness remains unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1759743162367,
            "Source": "stock"
        },
        {
            "Title": "Nayara Energy Supplies Gasoline and Gasoil to HPCL",
            "Summary": "Nayara Energy is providing gasoline and gasoil to Hindustan Petroleum Corporation Limited (HPCL), according to an Indian government source. The arrangement involves the supply of these petroleum products between the two energy companies.",
            "Sentiment": "neutral",
            "PublishDate": 1758019931740,
            "Source": "stock"
        },
        {
            "Title": "HPCL Reports ₹11,000 Crore LPG Losses, Seeks ₹8,000 Crore Government Support",
            "Summary": "HPCL reported LPG losses of nearly ₹11,000 crore last year and ₹2,000 crore in the first quarter. The company expects ₹8,000 crore support from the government for LPG losses. During the first quarter, 13% of the company's crude oil was sourced from Russia.",
            "Sentiment": "negative",
            "PublishDate": 1756809005686,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Petroleum Corporation Block Trade Worth Rs. 19.22 Crores on NSE",
            "Summary": "Hindustan Petroleum Corporation Ltd. executed a block trade on the National Stock Exchange worth Rs. 19.22 crores. The transaction involved approximately 506,895 shares at a price of Rs. 379.20 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1756702977286,
            "Source": "order&deals"
        },
        {
            "Title": "HPCL Completes 73rd AGM with 13 Resolutions Passed, Declares Rs 10.50 Final Dividend",
            "Summary": "Hindustan Petroleum Corporation Limited held its 73rd Annual General Meeting through video conferencing with 165 shareholders participating (1 promoter and 164 public shareholders) out of 5,11,462 total shareholders. All 13 resolutions were passed, including adoption of financial statements for the year ended March 31, 2025, declaration of final dividend of Rs 10.50 per equity share for Financial Year 2024-25, and appointment of key personnel. Vikas Kaushal was appointed as Chairman & Managing Director, while Bechan Lal, Sharda Singh Kharwar, Vivekananda Biswal, and Abhay Sharma were appointed as Independent Directors. The company also approved material related party transactions with HPCL-Mittal Energy Limited and Hindustan Colas Private Limited for Financial Year 2026-27. Directors Rajneesh Narang and Amit Garg were reappointed by rotation, though these appointments received lower approval rates of 90.48% and 89.48% respectively. Upendra Shukla & Associates was appointed as Secretarial Auditor, and cost auditors' remuneration for Financial Year ending March 31, 2026 was approved.",
            "Sentiment": "positive",
            "PublishDate": 1755876148242,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Petroleum Corporation Shares Q1 FY26 Earnings Call Transcript",
            "Summary": "Hindustan Petroleum Corporation Limited has made available the transcript of its post-earnings conference call for Q1 FY26. The conference call was held on August 8, 2025, at 11:00 AM IST. The company has provided a link to access the transcript document on its official website. The communication was signed by Company Secretary Rakesh Kumar Singh and addressed to both BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1755002624975,
            "Source": "earnings"
        },
        {
            "Title": "HPCL Says Russian Oil Sanctions Would Have Minimal Impact on Earnings",
            "Summary": "Hindustan Petroleum Corp. (HPCL) Chairman Vikas Kaushal stated that potential US secondary sanctions deterring Russian crude purchases would not significantly impact the company's earnings. Russian crude represented only 13% of HPCL's refining portfolio in the April-June quarter, down from the previous year due to economic rather than geopolitical reasons. The US imposed 25% tariffs on India for buying Russian crude, effective August 27, adding to previously announced 25% tariffs. HPCL has received no government guidance to avoid Russian oil and remains free to make economically-driven purchasing decisions. The company used Russian oil primarily at its Visakhapatnam refinery but found other crude sources more attractive. An analyst noted that Indian refiners could lose $1 per barrel in gross refining margins, but HPCL would be least impacted due to its minimal refining portfolio compared to marketing volume.",
            "Sentiment": "neutral",
            "PublishDate": 1754640522683,
            "Source": "stock"
        },
        {
            "Title": "HPCL Management States No Government Orders on Russian Oil Purchases",
            "Summary": "HPCL management confirmed during a conference call that the company has not received any government orders regarding Russian oil purchases. This clarification was provided as an update during the company's earnings call discussion.",
            "Sentiment": "neutral",
            "PublishDate": 1754632194444,
            "Source": "stock"
        },
        {
            "Title": "HPCL Board Approves Borrowing Limit of 100 Billion Rupees as Quarterly Results Show Strong Performance",
            "Summary": "HPCL's board has approved borrowing up to 100 billion rupees. The company reported quarterly results showing EBITDA of 76 billion rupees compared to 58 billion rupees in the previous quarter, with EBITDA margin improving to 6.36% from 4.93%. Net profit increased to 43.7 billion rupees from 33.5 billion rupees quarter-on-quarter, while revenue rose slightly to 1.19 trillion rupees from 1.18 trillion rupees. The company's average Gross Refining Margin (GRM) stood at $3.08 per barrel for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754567863896,
            "Source": "stock"
        },
        {
            "Title": "HPCL Reports Strong Q1 Results with Net Profit of ₹4,371 Crore, Approves ₹10,000 Crore Borrowing Plan",
            "Summary": "Hindustan Petroleum Corporation Limited announced its quarterly results with net profit rising to ₹4,370.87 crore compared to ₹355.80 crore in the same period last year. Total income reached ₹1,20,657.65 crore. The Board approved a proposal to borrow up to ₹10,000 crore through Non-Convertible Debentures or Bonds on private placement basis in domestic or overseas markets. The company's crude throughput increased to 6.66 MMT from 5.76 MMT year-on-year. Domestic sales stood at 12.26 MMT while exports were 0.78 MMT. The company maintains a negative LPG buffer of ₹13,042.56 crore. Basic and diluted earnings per share increased to ₹20.54 from ₹1.67 in the previous year quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754567771454,
            "Source": "earnings"
        },
        {
            "Title": "HPCL Schedules Conference Call to Discuss Q1 FY26 Earnings on August 8",
            "Summary": "Hindustan Petroleum Corporation Limited has scheduled a conference call on August 8, 2025, at 11:00 AM IST to discuss Q1 FY26 earnings with the senior management team. The call will be hosted by Antique Stock Broking Limited and will feature key executives including Chairman & Managing Director Vikas Kaushal, Director – Finance Rajneesh Narang, Director - Refineries S Bharathan, and Executive Director – Corporate Finance K Vinod. The company has confirmed that no unpublished price sensitive information will be shared during the investor conference. Dial-in details and international toll-free numbers have been provided for participants.",
            "Sentiment": "neutral",
            "PublishDate": 1754297619012,
            "Source": "earnings"
        },
        {
            "Title": "HPCL Shares Recover After Signing 10-Year LNG Supply Agreement with Abu Dhabi Firm",
            "Summary": "Hindustan Petroleum Corporation Ltd. (HPCL) shares recovered from opening lows after the company signed a heads of agreement with Abu Dhabi Gas Liquefaction Company (ALNG) to procure liquefied natural gas for a 10-year term. ALNG is a subsidiary of ADNOC Gas. Under the agreement, HPCL will receive LNG at its Chhara LNG terminal in Gujarat to supply its refineries, city gas distribution network, and downstream customers. The company noted that the agreement reflects strengthening India-UAE ties and supports India's energy transition. HPCL shares were trading 0.92% lower at ₹400.1, with the stock declining 10% over the past month.",
            "Sentiment": "neutral",
            "PublishDate": 1754283558255,
            "Source": "stock"
        },
        {
            "Title": "HPCL Signs 10-Year LNG Supply Agreement with Abu Dhabi's ALNG",
            "Summary": "Hindustan Petroleum Corporation Limited (HPCL) and Abu Dhabi Gas Liquefaction Company (ALNG) have signed a Heads of Agreement for the procurement of Liquefied Natural Gas over a 10-year term. ALNG is a subsidiary of ADNOC Gas, a large-scale integrated gas processing and sales company. Under the agreement, HPCL will receive LNG at the recently commissioned Chhara LNG Terminal in Gujarat to meet demand for its refineries, City Gas Distribution Network, and for marketing to downstream customers. The agreement represents deepening economic ties between India and the UAE and supports India's energy transition and energy security objectives.",
            "Sentiment": "positive",
            "PublishDate": 1754146125075,
            "Source": "order&deals"
        },
        {
            "Title": "HPCL Executive Director Smt. Sujatha Londhe to Retire Due to Superannuation",
            "Summary": "Hindustan Petroleum Corporation Limited (HPCL) announced the retirement of Smt. Sujatha Londhe, Executive Director - Joint Ventures, effective August 01, 2025 due to superannuation. The company informed stock exchanges BSE and NSE about this change in senior management as part of regulatory disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1754030086442,
            "Source": "corporate_governance"
        },
        {
            "Title": "HPCL Stops Purchasing Russian Crude Oil From Spot Market",
            "Summary": "Hindustan Petroleum Corporation Limited (HPCL) has ceased purchasing Russian crude oil from the spot market. This represents a shift in the company's crude oil procurement strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1754018292403,
            "Source": "stock"
        },
        {
            "Title": "HPCL Appoints Rakesh Kumar Singh as Company Secretary Following V Murali's Superannuation",
            "Summary": "Hindustan Petroleum Corporation Limited (HPCL) announced the appointment of Shri Rakesh Kumar Singh as Company Secretary & Compliance Officer, effective August 01, 2025, following the superannuation of Shri V Murali on July 31, 2025. Singh, a science graduate from Magadh University and qualified Company Secretary from the Institute of Company Secretaries of India, currently serves as Joint Company Secretary at HPCL with over two decades of experience in the secretarial domain. Prior to HPCL, he worked as Company Secretary at Zuari Industries Limited and has been associated with organizations including GMR Group, Reliance Industries Limited, Bharat Oman Refineries Limited, Hindustan Times Group and RPG Group. The Key Managerial Personnel authorized for determining materiality of events and making stock exchange disclosures include Shri Rajneesh Narang as Director-Finance & CFO and Shri Rakesh Kumar Singh as Company Secretary & Compliance Officer.",
            "Sentiment": "neutral",
            "PublishDate": 1753968963101,
            "Source": "corporate_governance"
        }
    ]
}