{
    "Symbol": "HINDOILEXP",
    "ISIN": "INE345A01011",
    "News": [
        {
            "Title": "Hindustan Zinc Block Trade Worth Rs. 20.91 Crores",
            "Summary": "Hindustan Zinc Ltd. witnessed a significant block trade on NSE worth Rs. 20.91 crores involving approximately 368,582 shares at Rs. 567.25 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769917814229,
            "Source": "co_actions_results"
        },
        {
            "Title": "HOEC Appoints New Chairman, MD Resigns",
            "Summary": "Hindustan Oil Exploration Company Limited appoints Dr. Jagadip Narayan Singh as Chairman while Managing Director Ramasamy Jeevanandam resigns citing health issues after 11 years of service.",
            "Sentiment": "neutral",
            "PublishDate": 1769168607313,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Zinc Q3 boosted by silver rally, faces capacity constraints",
            "Summary": "Strong Q3 performance driven by 74% YoY silver price surge and lower production costs, but near-full capacity utilization limits volume growth potential with meaningful expansion only expected by Q2FY29.",
            "Sentiment": "neutral",
            "PublishDate": 1768906361229,
            "Source": "co_actions_results"
        },
        {
            "Title": "HOEC Issues ₹15.12 Cr Bank Guarantee in Litigation",
            "Summary": "Hindustan Oil Exploration complies with Madras High Court directive to furnish Bank Guarantee of ₹15.12 crores as interim arrangement in ongoing enforcement petition matter.",
            "Sentiment": "neutral",
            "PublishDate": 1768825851506,
            "Source": "stocks"
        },
        {
            "Title": "HOEC Provides $1.16M Bank Guarantee for HEPI Claim",
            "Summary": "Hindustan Oil Exploration Company provides bank guarantee worth $1.16 million to address claim from HEPI, demonstrating financial commitment to resolve outstanding obligations.",
            "Sentiment": "neutral",
            "PublishDate": 1768825220913,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Oil Exploration Reports Q2 FY26 Results with Production Challenges and HPCL Payment Dispute",
            "Summary": "Hindustan Oil Exploration Company reported Q2 FY26 standalone revenue of Rs. 321.51 crores compared to Rs. 83.48 crores in the previous quarter, primarily driven by crude oil sales from B-80 field, while facing production disruptions due to monsoon and reduced gas offtake from Dirok field. The company is engaged in discussions with HPCL over a Rs. 259 crores payment dispute related to crude oil contamination issues, while continuing its drilling program across Northeast and offshore blocks with plans to drill 31 wells using Rs. 250 crores debt funding.",
            "Sentiment": "neutral",
            "PublishDate": 1764325272221,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Oil Exploration Targets 6,000 BOEPD Production by FY27",
            "Summary": "Hindustan Oil Exploration expects to reach production of 6,000 barrels of oil equivalent per day (BOEPD) by FY27. The company's production target is contingent on operations proceeding according to plan.",
            "Sentiment": "positive",
            "PublishDate": 1763942838439,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Oil Exploration Company Makes Q2 FY2025-26 Earnings Call Recording Available",
            "Summary": "Hindustan Oil Exploration Company Limited has made the audio recording of its earnings call held on November 21, 2025, available on its website for the quarter and half year ended September 30, 2025. The company informed stock exchanges NSE and BSE about the availability of the earnings call recording as per regulatory requirements.",
            "Sentiment": "negative",
            "PublishDate": 1763728710240,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Oil Exploration Company Schedules Q2 FY26 Earnings Call",
            "Summary": "Hindustan Oil Exploration Company Limited will host an earnings conference call on November 21, 2025 at 11:00 AM IST to discuss Q2 FY26 financial results. The call will feature key management including Managing Director R. Jeevanandam, CFO N.S. Senthilnathan, and CTO Krishnan Raghavan, providing investors access to quarterly performance insights.",
            "Sentiment": "negative",
            "PublishDate": 1763360790951,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Oil Exploration Reports Strong Q2 Performance with Revenue Jump to Rs 31,505 Lakhs",
            "Summary": "Hindustan Oil Exploration Company Limited announced unaudited financial results for the quarter and half-year ended September 30, 2025, showing revenue from operations of Rs 31,505 lakhs and profit of Rs 1,903 lakhs for the quarter. The company also entered into a Crude Off-take and Sale Agreement with Hindustan Petroleum Corporation Limited during the quarter, with oil transfer completed on September 25, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1763118374837,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Oil Exploration Company's Credit Rating Outlook Revised to Stable by India Ratings",
            "Summary": "India Ratings Research Private Limited revised the outlook on Hindustan Oil Exploration Company Limited's bank loan from Positive to Stable while affirming the INDA rating. The rating agency assigned a Long-Term Issuer Rating of INDA/Stable and maintained the bank loan rating at INDA/Stable/INDA1 for Rs 500 crores. The rating letter was received by the company on November 10, 2025, with the rating action dated November 7, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762796589905,
            "Source": "corporate_action"
        },
        {
            "Title": "HDFC Reduces Stake in Hindustan Oil Exploration Company to 8.75%",
            "Summary": "Housing Development Finance Corporation Limited disclosed a substantial reduction in its shareholding in Hindustan Oil Exploration Company Limited. HDFC sold 32,53,517 shares representing 2.46% of the company through open market transactions. The sales occurred between September 19, 2017 and July 7, 2021, with the 2% threshold being crossed on July 6, 2021. Following these transactions, HDFC's total shareholding decreased from 11.21% to 8.75% of Hindustan Oil Exploration Company's equity share capital of Rs. 132,24,32,890.",
            "Sentiment": "neutral",
            "PublishDate": 1761796167819,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Oil Exploration Addresses Crude Oil Quality Concerns Raised by HPCL",
            "Summary": "Hindustan Oil Exploration Company Limited provided clarification regarding a crude oil sales agreement with Hindustan Petroleum Corporation Limited. The company delivered 54.6 TMT of crude oil from Block B-80 field, with offtake and custody transfer completed on September 25, 2025. HPCL reported high chloride content in their sample analysis of the delivered crude oil. Hindustan Oil Exploration stated that no loss, damage, or claim is attributable to the company under the agreement terms and plans to engage in discussions with HPCL to address the issue. The company noted that previous substantial crude oil supplies from Block B-80 had no quality issues.",
            "Sentiment": "neutral",
            "PublishDate": 1761623099982,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Oil Exploration Makes Q1 FY2025-26 Earnings Call Recording Available Online",
            "Summary": "Hindustan Oil Exploration Company Limited has made the audio recording of their Q1 FY2025-26 earnings call available on their company website. The earnings call, held on August 18, 2025, discussed the unaudited financial results for the quarter ended June 30, 2025. The recording can be accessed at https://hoec.com/earnings-call/. The company trades on BSE with stock code 500186 and on NSE with stock code HINDOILEXP.",
            "Sentiment": "neutral",
            "PublishDate": 1755515433225,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Oil Exploration Reports Mixed Q1FY26 Results with Production Growth and Exceptional Gains",
            "Summary": "Hindustan Oil Exploration Company Limited reported quarterly results showing increased gross production of 6,369 BOEPD compared to 5,458 BOEPD in Q4FY25, while net production reached 2,777 BOEPD versus 2,665 BOEPD in the previous quarter. The company's consolidated revenue from operations was ₹78.65 crores, down from ₹136.15 crores in Q1FY25. Net profit surged to ₹43.87 crores from ₹41.92 crores year-over-year, boosted by exceptional items worth ₹32.52 crores. Key operational highlights include production disruption at B-80 block due to monsoon conditions in mid-June, with operations resuming in August. The company signed a Revenue Sharing Contract for B-15 block with 100% participating interest and completed drilling of four wells at Kharsang field. Dirok field produced an average of 20.22 mmscfd gas and 364 bpd condensate, while gas prices averaged $7.56/mmbtu compared to $8.45/mmbtu in Q4FY25. The company holds a 100% participating interest in B-80 block, increased from 60%, and maintains operations across multiple producing assets in India's key petroleum provinces.",
            "Sentiment": "positive",
            "PublishDate": 1755435701479,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Oil Exploration Resumes Production at Block B-80 After FSO Vessel Re-mooring",
            "Summary": "Hindustan Oil Exploration Company Limited successfully re-moored its Floating Storage and Offloading vessel in Block B-80. Production has resumed from wells D1 and D2, with both wells currently under stabilization. This follows a previous update from June 27, 2025, indicating operational continuity at the offshore block.",
            "Sentiment": "positive",
            "PublishDate": 1755350177587,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Oil Exploration Reports Q1 FY2026 Results with Exceptional Gains from Block B-80 Acquisition",
            "Summary": "Hindustan Oil Exploration Company Limited announced its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹8,348.07 lakhs and consolidated revenue of ₹8,550.37 lakhs. The results included an exceptional item of ₹3,251.87 lakhs representing provisional fair value gain on remeasurement of its previously held 60% participating interest in Block B-80, following the takeover of 40% participating interest from Adbhoot Estates Private Limited. The Board also approved revised policies related to insider trading, related party transactions, material subsidiaries, and event disclosures in compliance with SEBI regulations. The company's standalone basic and diluted earnings per share for the quarter were ₹3.65 each, while consolidated EPS stood at ₹3.32 each.",
            "Sentiment": "positive",
            "PublishDate": 1755169700989,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Oil Exploration: Temporary Production Halt at B-80 Block Due to Weather",
            "Summary": "Hindustan Oil Exploration Company Ltd has temporarily suspended production at its western offshore B-80 block due to adverse weather conditions. The Floating Storage Offshore unit has been safely de-moored and anchored securely. Production will resume once conditions improve.",
            "Sentiment": "neutral",
            "PublishDate": 1751048167000,
            "Source": "normal_news"
        },
        {
            "Title": "Hindustan Oil Exploration Co Halts Production in Block B-80 Due to Weather",
            "Summary": "Hindustan Oil Exploration Co has temporarily suspended production in Block B-80 due to adverse weather conditions. The company's Floating Storage and Offloading (FSO) unit has been safely de-moored as a precautionary measure.",
            "Sentiment": "neutral",
            "PublishDate": 1751039321000,
            "Source": "default"
        },
        {
            "Title": "Hindustan Oil Exploration Co. Reports Q4 Financial Results",
            "Summary": "Hindustan Oil Exploration Co. has reported its latest quarterly financial results. The company's Q4 EBITDA was 48 million rupees, down from 740 million rupees in the previous quarter. The Q4 EBITDA margin decreased to 8.01% from 47.42% quarter-over-quarter. The consolidated net profit for Q4 was 512 million rupees, up from 433 million rupees in the previous quarter. However, Q4 revenue declined to 596 million rupees from 1.56 billion rupees quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1748448024000,
            "Source": "result"
        },
        {
            "Title": "Hindustan Oil Exploration Company: Wins New Offshore Contract, Shares Rise",
            "Summary": "Hindustan Oil Exploration Company was awarded a contract for block MB/OSDSF/B15/2024 in Mumbai offshore region, spanning 332.4 sq km. The block includes two discoveries with potential for further exploration. The company's shares gained up to 4.5% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1744779326000,
            "Source": "order&deals"
        },
        {
            "Title": "Hindustan Oil Exploration to Increase Stake in Block B-80 to 100%",
            "Summary": "Hindustan Oil Exploration Company has announced plans to increase its participating interest in Block B-80 to 100%. This move suggests the company is strengthening its position in the oil exploration sector by taking full control of the block.",
            "Sentiment": "positive",
            "PublishDate": 1743725164000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Oil Exploration to Acquire Full Ownership of Block B-80",
            "Summary": "Hindustan Oil Exploration Company (HOEC) has announced plans to increase its participating interest in Block B-80 to 100%. This move suggests the company is consolidating its position in the block, potentially to enhance its control over operations and future profits from the asset.",
            "Sentiment": "positive",
            "PublishDate": 1743689879000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Oil Exploration Co. Reports Significant Increase in Q3 Net Profit",
            "Summary": "Hindustan Oil Exploration Co. has announced its Q3 financial results. The company's consolidated net profit rose to 433 million rupees, up from 108 million rupees in the previous quarter. Revenue also increased to 1.56 billion rupees from 1 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738714754000,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Oil Exploration Co. Reports Significant Increase in Q3 EBITDA",
            "Summary": "Hindustan Oil Exploration Co. has reported a substantial improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 740 million rupees, up from 317 million rupees in the previous quarter. Additionally, the EBITDA margin expanded to 47.42% from 31.70% quarter-over-quarter, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1738680534000,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Oil Exploration Co. Reports Significant Q3 Profit and Revenue Growth",
            "Summary": "Hindustan Oil Exploration Co. has announced its Q3 financial results, showing a substantial increase in both net profit and revenue compared to the previous quarter. The company's consolidated net profit rose to 433 million rupees from 108 million rupees in the previous quarter. Revenue also saw a significant jump, reaching 1.56 billion rupees, up from 1 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738680427000,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Oil Exploration to Consider Q3 Results on February 4",
            "Summary": "Hindustan Oil Exploration Company has announced that it will consider and approve its financial results for the third quarter on February 4. This indicates the company is preparing to disclose its performance for the most recent fiscal period to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1738070313000,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Oil Exploration Reports Q2 EBITDA Decline",
            "Summary": "Hindustan Oil Exploration Company has reported a significant decrease in its Q2 EBITDA, which fell to 32 million rupees from 86.6 million rupees in the previous quarter. The company's EBITDA margin also declined, dropping to 5.82% from 12.06% quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1731587690000,
            "Source": "result"
        },
        {
            "Title": "Hindustan Oil Exploration Reports Decline in Q2 Profit and Revenue",
            "Summary": "Hindustan Oil Exploration Company has reported a significant decrease in its second quarter financial results. The company's net profit dropped to 11 million rupees from 114 million rupees in the previous quarter. Additionally, revenue declined to 518 million rupees from 718 million rupees quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1731587624000,
            "Source": "result"
        }
    ]
}