{
    "Symbol": "HINDCOPPER",
    "ISIN": "INE531E01026",
    "News": [
        {
            "Title": "Hindustan Copper CMD Receives Prestigious Award",
            "Summary": "Sanjiv Kumar Singh, Chairman and Managing Director of Hindustan Copper Ltd, received the Bhaskar Bhattacharjee Memorial Award from IIT (ISM) Dhanbad on February 8, 2026, during the Basant '26 event.",
            "Sentiment": "positive",
            "PublishDate": 1770621955777,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Copper Resolves Dispute With SEPC",
            "Summary": "Hindustan Copper Limited has successfully resolved its dispute with SEPC, marking a significant development for the copper mining company's operations and business relationships.",
            "Sentiment": "positive",
            "PublishDate": 1770305341238,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Copper Declares ₹1 Per Share Dividend",
            "Summary": "Hindustan Copper has announced a dividend of ₹1 per share for its shareholders, marking a significant distribution to investors in the state-owned mining company.",
            "Sentiment": "positive",
            "PublishDate": 1770284028892,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Copper Q3 Net Profit Surges 148% YoY",
            "Summary": "Hindustan Copper reported standalone net profit of ₹1.56 billion in Q3, marking a significant 148% increase from ₹629 million in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1770283898843,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Copper Block Trade Worth Rs. 32.65 Crores",
            "Summary": "Hindustan Copper Ltd. witnessed a significant NSE block trade worth Rs. 32.65 crores involving 467,562 shares at Rs. 698.35 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769755214636,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Copper Sees ₹20.55 Cr Block Trade",
            "Summary": "Hindustan Copper Ltd witnessed a significant block trade worth ₹20.55 crores on NSE, involving 293,819 shares at ₹699.25 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769745377437,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Copper Block Trade Worth Rs. 20.98 Crores",
            "Summary": "Hindustan Copper Ltd. witnessed a significant NSE block trade worth Rs. 20.98 crores involving approximately 283,015 shares at Rs. 741.25 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769662845037,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Copper Board Meet on Feb 5 for Q3 Results",
            "Summary": "Hindustan Copper Limited has scheduled its board meeting for February 05, 2026, to consider Q3FY26 unaudited financial results and interim dividend declaration for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1769614940868,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Copper Block Trade Worth Rs. 32.52 Crores",
            "Summary": "Hindustan Copper Ltd. witnessed a significant NSE block trade worth Rs. 32.52 crores involving approximately 516,256 shares at Rs. 629.85 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769583528953,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Copper Block Trade Worth Rs. 21.67 Crores",
            "Summary": "Hindustan Copper Ltd. witnessed a significant NSE block trade of Rs. 21.67 crores involving 360,405 shares at Rs. 601.30 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769576665828,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Copper Wins Baghwarikhirkhori Mining Block",
            "Summary": "Hindustan Copper Limited declared preferred bidder for Baghwarikhirkhori Copper Mining Block in Madhya Pradesh after submitting highest final price offer in forward e-auction concluded on January 22, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769257739951,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Copper promotes 4 executives to GM roles",
            "Summary": "Hindustan Copper Limited announced the promotion of four senior executives to General Manager positions across mining, metallurgy, administration, and finance functions on 23.01.2026.",
            "Sentiment": "positive",
            "PublishDate": 1769256502975,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Copper & NALCO Surge 70% & 42% Respectively",
            "Summary": "Hindustan Copper rose over 70% in 2 months while NALCO gained 42% in 3 months, both crossing ₹50,000 crore market cap amid strong metal cycles and record financial performance in FY25.",
            "Sentiment": "positive",
            "PublishDate": 1768898619754,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Copper Shows Bearish Technical Reversal",
            "Summary": "Hindustan Copper breaks below ascending channel pattern at ₹570 support level, with technical indicators confirming near-term bearish momentum despite strong long-term gains of 114.81% year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1768887866335,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Copper starts underground mining in Jharkhand",
            "Summary": "State-owned Hindustan Copper Ltd commenced underground mining operations at Kendadih Copper Mine in Jharkhand's Ghatshila region on January 16. The company also signed MoU with NTPC Mining for copper development.",
            "Sentiment": "positive",
            "PublishDate": 1768559230115,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Copper shares fall 4.6% on copper retreat",
            "Summary": "Hindustan Copper shares declined 4.6% to ₹525.20 as LME copper prices fell 2.56% to $12,899.50 per metric ton. Stock shows overbought signals with RSI at 79.5 despite FII stake increase.",
            "Sentiment": "negative",
            "PublishDate": 1767850340610,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Copper Block Trade Worth ₹18.80 Crores",
            "Summary": "Hindustan Copper Ltd. witnessed a significant NSE block trade worth ₹18.80 crores involving 333,995 shares at ₹563.00 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767759155530,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Copper GM Anil Kumar Singh Resigns",
            "Summary": "Hindustan Copper Limited announces cessation of General Manager (M&C) Shri Anil Kumar Singh effective January 6, 2025, following his selection as Director (Commercial) at National Aluminium Company Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1767704492240,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Copper hits 52-week high on copper rally",
            "Summary": "Hindustan Copper shares surged 4% to ₹574, marking a fresh 52-week high as global copper prices jumped 4.4% to $13,000 per metric ton amid US import tariff concerns and strong demand outlook.",
            "Sentiment": "positive",
            "PublishDate": 1767674354202,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Copper NSE Block Trade Worth ₹18.52 Cr",
            "Summary": "Hindustan Copper Ltd. witnessed a significant NSE block trade worth ₹18.52 crores involving approximately 325,030 shares at ₹569.65 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767672251314,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Copper Hits 16-Year High at ₹568.05",
            "Summary": "Hindustan Copper shares surged 4.83% to ₹568.05, reaching a 16-year high amid copper prices crossing $12,000/tonne for the first time. Strong Q2 results showed 85% profit jump.",
            "Sentiment": "positive",
            "PublishDate": 1767588640801,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Copper Block Trade Worth ₹17.79 Crores",
            "Summary": "Hindustan Copper Ltd. witnessed a significant block trade on NSE involving 320,580 shares at ₹554.85 per share, totaling ₹17.79 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1767585467336,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Copper Targets 40% Margins With AI Data Centres",
            "Summary": "Hindustan Copper CMD projects sustainable 40% EBITDA margins as AI data centres emerge as largest copper consumers, with production expansion plans to triple capacity to 12.20 million tonnes.",
            "Sentiment": "positive",
            "PublishDate": 1767243261947,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Copper shares fall 3% on profit booking",
            "Summary": "Hindustan Copper shares dropped 3.3% to Rs 515 as copper prices declined due to year-end profit booking, despite the stock being set to close 2025 with over 100% gains amid strong copper market fundamentals.",
            "Sentiment": "neutral",
            "PublishDate": 1767106687143,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Copper Records ₹36.13 Cr NSE Block Trade",
            "Summary": "Hindustan Copper Ltd. executed a significant NSE block trade worth ₹36.13 crores involving 682,698 shares at ₹529.25 per share, demonstrating continued institutional interest.",
            "Sentiment": "positive",
            "PublishDate": 1767068798906,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Copper hits 8-day rally; mcap nears ₹50k cr",
            "Summary": "Hindustan Copper extends rally for eighth day, rising 7% as shares hit fresh high of ₹545.95. Market cap approaches ₹50,000 crore with stock up 110% in 2025 amid record copper prices.",
            "Sentiment": "positive",
            "PublishDate": 1767068178538,
            "Source": "stocks"
        },
        {
            "Title": "Copper rally driven by supply crunch, volume growth",
            "Summary": "Hindustan Copper's twofold rally driven by volume growth, mine lease extensions, and supply constraints beyond just copper prices, says Anand Rathi analyst.",
            "Sentiment": "positive",
            "PublishDate": 1767008552665,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Copper hits ₹545.95 high, closes at ₹487.85",
            "Summary": "Hindustan Copper reached new 52-week high of ₹545.95 before profit-booking led to 2.58% close at ₹487.85. Seven-day rally continues with 36% gains as copper hits record levels on global exchanges.",
            "Sentiment": "positive",
            "PublishDate": 1766979347051,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Copper Surges 10%, Reports Best Week Since 2021",
            "Summary": "Hindustan Copper shares extended gains for sixth consecutive session, rising 9% on Friday. Stock gained 22% this week, marking best weekly performance since February 2021 amid global copper rally.",
            "Sentiment": "positive",
            "PublishDate": 1766723909117,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Copper, Zinc hit fresh highs on metal rally",
            "Summary": "Hindustan Copper jumped 6.7% to ₹434 (highest since Nov 2010) while Hindustan Zinc rose 2.6% to ₹625, driven by copper supply crunch and record silver prices hitting ₹2,27,000/kg.",
            "Sentiment": "positive",
            "PublishDate": 1766587472156,
            "Source": "stocks"
        },
        {
            "Title": "LIC books profit in Hindustan Copper, cuts 2% stake",
            "Summary": "LIC reduced its Hindustan Copper stake to 4.07% amid 76% stock rally in 2025. The insurer sold shares between August-December as the multibagger stock hit overbought levels with strong earnings growth.",
            "Sentiment": "positive",
            "PublishDate": 1766572304002,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hindustan Copper and NTPC Mining Sign MoU for Joint Mining Ventures",
            "Summary": "Hindustan Copper and NTPC Mining have executed a memorandum of understanding focused on copper and minerals block auctions. The MoU establishes a framework for joint investments in mining and processing operations between the two companies.",
            "Sentiment": "positive",
            "PublishDate": 1764719984634,
            "Source": "order&deals"
        },
        {
            "Title": "Hindustan Copper General Manager (Chemical) Ramanand Adhikari to Retire in November 2025",
            "Summary": "Hindustan Copper's General Manager (Chemical) Shri Ramanand Adhikari is scheduled to retire on November 30, 2025. This leadership transition affects the company's chemical operations management and will require succession planning for the key position.",
            "Sentiment": "neutral",
            "PublishDate": 1764401827317,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hindustan Copper Fined Rs. 9.77 Lakh Each by BSE and NSE for Board Composition Non-Compliance",
            "Summary": "BSE and NSE imposed fines of Rs. 9,77,040 each on Hindustan Copper Limited for non-compliance with board composition requirements and audit committee constitution during the quarter ended September 2025. The company attributes the violations to pending director appointments by the Ministry of Mines and plans to seek waiver of fines once compliance is achieved, stating no impact on financial or operational activities.",
            "Sentiment": "negative",
            "PublishDate": 1764400606650,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hindustan Copper Extends Additional Charge for Director (Mining) Position",
            "Summary": "Sanjeev Kumar Sinha, Director (Operations) at Hindustan Copper Limited, has been assigned additional charge of Director (Mining) for six months from September 22, 2025 to March 21, 2026. The extension was approved by the Ministry of Mines and affects the company's leadership structure until a regular incumbent joins the position.",
            "Sentiment": "neutral",
            "PublishDate": 1763556975043,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hindustan Copper Reports Strong Q2 Growth with Revenue Up 38% and Profit Nearly Doubling",
            "Summary": "Hindustan Copper delivered robust quarterly results with revenue rising to 7.2 billion rupees from 5.2 billion rupees in the same period last year. Net profit increased significantly to 1.9 billion rupees compared to 1 billion rupees year-over-year. EBITDA grew to 2.8 billion rupees from 1.5 billion rupees, while EBITDA margin expanded to 39.3% from 29.31% in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762850388970,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Copper Evaluates Joint Venture with Codelco for Two Chilean Copper Mines",
            "Summary": "Hindustan Copper is assessing the acquisition of two copper mines in Chile through a joint venture with Codelco, the world's largest copper mining company. Talks are in advanced stages for one mine, with Codelco offering five blocks to Hindustan Copper. A team will visit Chile in December to evaluate untapped copper blocks. The government is assessing a substantial stake in the two mines, while the potential investment and stake details remain under assessment. The companies signed a memorandum of understanding in June for knowledge sharing and technology exchange. Copper prices have risen due to global factors including supply constraints and demand from the green transition, electric vehicles, and AI infrastructure. Hindustan Copper plans to increase ore output from 3.47 million tonnes per annum to 12.2 million tonnes by fiscal 2031.",
            "Sentiment": "positive",
            "PublishDate": 1760673135398,
            "Source": "order&deals"
        },
        {
            "Title": "Hindustan Copper Shares Surge 49.5% in One Month as Copper Hits 16-Month High",
            "Summary": "Hindustan Copper shares have rallied 49.5% in one month amid rising global copper prices and supply disruptions. Copper reached a 16-month high after Canada's Teck Resources cut production guidance for two major copper mines, reducing output forecasts from 230,000 tonnes to 170,000-190,000 tonnes. Freeport-McMoRan suspended operations at Indonesia's Grasberg mine following a fatal mudflow incident. Analysts from Motilal Oswal expect the stock could reach Rs 380-390 in the near term, while Ya Wealth sees potential upside to Rs 400-450 levels. The company secured a 20-year extension for its Rakha Copper Mine lease. China accounts for 60% of global copper demand, with a $300 billion grid modernization plan driving consumption. Motilal Oswal projects copper prices could reach $11,700 on LME and Rs 1,080 on MCX in the medium to long term, supported by decarbonization and electrification trends.",
            "Sentiment": "positive",
            "PublishDate": 1760068854024,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Copper Signs 20-Year Mining Lease for Copper Production",
            "Summary": "Hindustan Copper has signed a 20-year mining lease agreement for copper production operations.",
            "Sentiment": "positive",
            "PublishDate": 1759722301666,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Copper Shares Surge 44% in September on Rising Global Copper Prices",
            "Summary": "Hindustan Copper shares rose 4% on September 30, gaining 18% since September 18 and approaching their 52-week high of ₹353. The stock has advanced in seven of the last nine trading sessions, with September marking its best month since December 2023. Global copper prices reached a two-month high, with the metal posting a 5% gain in September - its strongest performance since the same month last year. Supply disruptions, including Freeport-McMoRan's force majeure declaration at Indonesia's Grasberg mine, have supported prices. Societe Generale analysts noted the market could face its largest annual deficit since 2004. Hindustan Copper CMD Sanjiv Kumar Singh expects copper prices to remain firm due to AI-driven data center demand. The company's EBITDA is closely linked to global copper prices, with sales structured through annual tenders.",
            "Sentiment": "positive",
            "PublishDate": 1759210237206,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Copper Shareholders Approve All 12 Resolutions at 58th AGM",
            "Summary": "Hindustan Copper held its 58th Annual General Meeting on September 25, 2025, through video conferencing. All 12 resolutions were approved by shareholders, including adoption of audited financial statements for the year ended March 31, 2025, declaration of dividend for Financial Year 2024-25, and multiple director appointments. Key appointments approved include Sanjiv Kumar Singh as Chairman and Managing Director, Sanjeev Kumar Sinha as Director (Operations), RVN Vishweshwar as Director (Finance), and Ashish Saxena as Government Nominee Director. Shareholders also approved the appointment of secretarial auditors for five years and ratified cost auditor remuneration. The company received approval to issue secured or unsecured non-convertible debentures on private placement basis. The meeting had 82 shareholders present representing 639.61 crore promoter shares and 14.61 lakh public shares. Voting was conducted through remote e-voting and electronic means during the meeting.",
            "Sentiment": "positive",
            "PublishDate": 1758889939589,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Copper Shares Surge 6% as Global Copper Prices Jump Following Mine Halt",
            "Summary": "Hindustan Copper shares climbed 6.45% to Rs 328.25 following a spike in global copper prices after Freeport-McMoRan suspended production at Indonesia's Grasberg mine, the world's second-largest copper mine. The halt came after a fatal mudflow accident that killed two employees and left five missing, with 800,000 metric tons of wet material entering the mine. The Grasberg Block Cave represents 50% of PT Freeport Indonesia's reserves and 70% of forecast copper and gold production through 2029. Copper futures rose 2.74% on CME to above $10,496 per tonne, while LME three-month copper gained 2% to $10,172 per tonne, reaching 15-month highs. Freeport lowered its production guidance and warned of potential supply contract issues. Freeport shares fell 10.4% while competitor stocks including Glencore, Teck Resources, and Antofagasta gained 3-7.4% on supply shortage expectations.",
            "Sentiment": "positive",
            "PublishDate": 1758780246301,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Copper Shares Surge 43% in September on Rising Global Copper Prices",
            "Summary": "Hindustan Copper shares gained 6% on Thursday, marking the fifth consecutive day of increases and bringing the stock's rise to 17% over the last five trading sessions. The stock has climbed 43% in September, making it the best performing month since December 2023. Global copper prices are near their highest level in over a year following Freeport-McMoRan's declaration of force majeure on contracted supplies from its Indonesian mine. Trading volumes were exceptionally high with over 2 crore shares traded compared to the 20-day average of 30 lakh shares. The government holds a 66% stake in Hindustan Copper, while mutual funds own 2.74%, LIC holds 4.67%, and over 6.4 lakh small retail shareholders control 15.1% of the company.",
            "Sentiment": "positive",
            "PublishDate": 1758779495745,
            "Source": "stock"
        },
        {
            "Title": "AI Data Centers Drive Surge in Copper Demand, Says Hindustan Copper CMD",
            "Summary": "Artificial intelligence has become the single largest consumer of copper, with each AI data center consuming 28-30 tonnes of copper, according to Hindustan Copper CMD Sanjiv Kumar Singh. This emerging demand driver is helping stabilize copper prices alongside traditional uses in electric vehicles and machinery. Hindustan Copper has reopened mines in Jharkhand that were closed since 2001 to boost production and plans to increase ore output threefold from 3.47 million tonnes per annum to 12.2 million tonnes by FY31. Market analyst Ambareesh Baliga suggests Hindustan Copper could deliver multi-bagger returns, noting that copper could become 'the new gold' from an industrial perspective. Global copper deposits and mines have increased over the past five years, which will improve copper grade availability. Copper futures are trading near range highs due to various global factors including supply constraints.",
            "Sentiment": "positive",
            "PublishDate": 1758700844987,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Copper Shares Surge Over 8% on Mining Lease Extension and Strategic Partnership",
            "Summary": "Hindustan Copper shares jumped over 8% to an intraday high of ₹305.40, trading around ₹298.71. The surge followed the company's execution of a mining lease deed for the Rakha Copper Mine in Jamshedpur, extending the lease for 20 years. The extension supports plans to reopen and expand operations at Rakha, a key copper asset. Oil India signed an MoU with Hindustan Copper for collaboration on exploration and development of critical minerals, including copper, aligning with the government's National Critical Minerals Mission. The company reported strong quarterly results with net profit rising 18.4% year-on-year to ₹134 crore and revenue increasing 4.6% to ₹516.4 crore. EBITDA margins expanded to 41% from 38.2% in the previous year. The stock is trading above all key moving averages, indicating bullish momentum.",
            "Sentiment": "positive",
            "PublishDate": 1758531979897,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Copper Limited Executes 20-Year Mining Lease Deed for Rakha Copper Mine",
            "Summary": "Hindustan Copper Limited (HCL) executed a mining lease deed with the District Commissioner of Jamshedpur on September 19, 2025, for an extended period of 20 years. The deed covers the Rakha Copper Mine and represents a crucial step towards reopening and expansion of the mine, which holds strategic importance for copper production growth in the region.",
            "Sentiment": "positive",
            "PublishDate": 1758282584599,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Copper and Oil India Sign MoU for Critical Minerals Exploration Partnership",
            "Summary": "Hindustan Copper Ltd (HCL) and Oil India Limited (OIL) signed a Memorandum of Understanding on September 19, 2025, to collaborate on exploration and development of critical and strategic minerals, including copper and associated minerals in India and overseas. The partnership aims to share investments and risks in mineral exploration, development, mining, and processing activities. The MoU was signed in New Delhi in the presence of Dr Ranjit Rath, Chairman & Managing Director of Oil India, and Mr Sanjiv Kumar Singh, Chairman and Managing Director of HCL. Oil India is a Maharatna PSU under the Ministry of Petroleum & Natural Gas with expertise in oil and gas exploration, while HCL is a Miniratna PSU under the Ministry of Mines engaged in copper mining and processing. The collaboration supports India's National Critical Mineral Mission and aims to strengthen the country's self-reliance in critical mineral sourcing for energy security and technological advancement.",
            "Sentiment": "positive",
            "PublishDate": 1758273826325,
            "Source": "order&deals"
        },
        {
            "Title": "Hindustan Copper Limited Schedules Investor Meeting for September 18, 2025",
            "Summary": "Hindustan Copper Limited announced an investor meeting scheduled for September 18, 2025, with a corporate presentation available on the company's website. The company reported record financial performance in FY 24-25, achieving highest-ever revenue from operations of Rs 2,071 crore, profit after tax of Rs 469 crore, and profit before tax of Rs 634 crore. HCL declared its highest-ever dividend of Rs 141 crore and recorded highest-ever production from Malanjkhand Mine at 27.25 lakh tonnes of ore. The company is India's sole vertically integrated copper producer, owning all operating copper mining leases in the country with 66.14% government ownership. HCL holds copper ore reserves and resources of 755.32 million tonnes and has a market capitalization of Rs 22,222 crore. The company plans to expand mining capacity from 4 MTPA to 12.20 MTPA, with capital expenditure of approximately Rs 2,000 crore planned over the next 5-6 years.",
            "Sentiment": "positive",
            "PublishDate": 1757922182763,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Copper Announces Rs 2,000 Crore Capex Plan, Shares Surge 6.46%",
            "Summary": "Hindustan Copper Ltd. announced a capex plan of Rs 2,000 crore over the next five to six years, leading to a 6.46% spike in share price. The company plans to acquire new copper deposits in India and abroad, seek partnerships with Indian PSUs to expand its mining portfolio, and collaborate with Chile's Codelco for capacity building. In the June quarter, the company's consolidated net profit declined 29% to Rs 134 crore from Rs 190 crore year-on-year. Revenue fell 29.4% to Rs 516 crore from Rs 731 crore, while margins improved to 41% from 36.5%. Ebitda decreased 20.5% to Rs 212 crore from Rs 267 crore. The stock traded 6.82% higher at Rs 265.88, with trading volume at 9.4 times its 30-day average. The stock has declined 15.46% over the last 12 months.",
            "Sentiment": "positive",
            "PublishDate": 1757658784564,
            "Source": "stock"
        },
        {
            "Title": "Copper Prices Approach $10,000 Mark Driven by Strong Demand",
            "Summary": "Copper prices have risen to near $10,000 levels, with demand driving monthly gains. This price movement affects Hindustan Copper Limited and the broader copper market.",
            "Sentiment": "positive",
            "PublishDate": 1756717938237,
            "Source": "stock"
        }
    ]
}