{
    "Symbol": "HIRECT",
    "ISIN": "INE835D01023",
    "News": [
        {
            "Title": "Hind Rectifiers Q3FY26: Strong Growth & Bonus Issue",
            "Summary": "Hind Rectifiers reports robust Q3FY26 results with 44% revenue growth to ₹2,432.71 million and 37% profit increase to ₹137.28 million. Board approves 1:1 bonus issue and ₹90 lakh subsidiary investment.",
            "Sentiment": "positive",
            "PublishDate": 1770802876794,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hind Rectifiers Q3 FY26 Earnings Call on Feb 12",
            "Summary": "Hind Rectifiers Limited announces earnings conference call scheduled for February 12, 2026, at 10:00 AM IST to discuss Q3 and 9-month FY26 financial and operational performance.",
            "Sentiment": "neutral",
            "PublishDate": 1770391660565,
            "Source": "stocks"
        },
        {
            "Title": "Hind Rectifiers Appoints New CEO and Company Secretary",
            "Summary": "Hind Rectifiers Limited announces key management appointments including Douglas J. Bailey as Global CEO and Megha Singh Shekhawat as Interim Company Secretary, effective January 30, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769799843589,
            "Source": "stocks"
        },
        {
            "Title": "Hind Rectifiers Sells Non-Operational Dehradun Plant for Rs 9.50 Crore",
            "Summary": "Hind Rectifiers Limited completed the sale of its manufacturing facility in Dehradun, Uttarakhand for Rs 9.50 crore on December 4, 2025, with completion expected by April 30, 2026. The plant, established in 2008 for manufacturing rectifiers and transformers, has been non-operational since July 2023 due to product obsolescence and lack of skilled manpower.",
            "Sentiment": "neutral",
            "PublishDate": 1764908070002,
            "Source": "stock"
        },
        {
            "Title": "Hind Rectifiers Reports 37% Revenue Growth, Completes Backward Integration Project",
            "Summary": "Hind Rectifiers Limited reported revenue growth of 37% to Rs. 227.1 crores in Q2 FY26 with PAT rising 44.6% to Rs. 14.7 crores, driven by operational efficiency and cost optimization. The company completed its Rs. 56 crore backward integration project for specialized copper conductors at Sinnar Plant and acquired France-based BeLink Solutions to strengthen its global footprint in robotics and power electronics.",
            "Sentiment": "positive",
            "PublishDate": 1763047551388,
            "Source": "earnings"
        },
        {
            "Title": "Hind Rectifiers Reports Strong Q2 Performance, Approves Global Expansion and Strategic Investments",
            "Summary": "Hind Rectifiers Limited reported quarterly results for the period ended September 30, 2025, showing revenue from operations of Rs. 2,272.77 million and net profit of Rs. 147.84 million. The Board approved several strategic initiatives including global expansion plans to explore acquisition and investment opportunities in international markets focusing on electronics, power semiconductors, and power conversion technologies. The company approved an investment of EUR 830,000 to increase the capital of its French subsidiary Belink Hirect SAS from EUR 2 million to EUR 3 million. Additionally, the Board authorized the sale of its non-operational Dehradun plant, which has been closed since July 2023 due to product obsolescence. The company also approved a preferential issue of up to 200,000 convertible warrants at Rs. 1,368.23 per warrant, with 25% consideration of Rs. 6.84 crores already received. Mr. Manoj Nair, CEO, was authorized as Key Managerial Personnel for determining materiality of events and stock exchange disclosures.",
            "Sentiment": "positive",
            "PublishDate": 1762424015532,
            "Source": "earnings"
        },
        {
            "Title": "Hind Rectifiers Board Approves Dehradun Plant Sale, Reports Strong Q2 Results",
            "Summary": "Hind Rectifiers' board has approved the sale of its Dehradun plant. The company reported quarterly net profit of 148 million rupees compared to 102 million rupees in the same period last year. EBITDA increased to 259 million rupees from 183 million rupees year-over-year, with EBITDA margin improving to 11.41% from 11.04%.",
            "Sentiment": "positive",
            "PublishDate": 1762421917180,
            "Source": "corporate_action"
        },
        {
            "Title": "Hind Rectifiers Company Secretary Meenakshi Anchlia Resigns from Multiple Key Positions",
            "Summary": "Meenakshi Anchlia has resigned from her position as Whole-Time Company Secretary, Compliance Officer and Nodal Officer of Hind Rectifiers Limited. Her resignation is effective from the close of business hours on November 3, 2025, to pursue opportunities outside the organization. Anchlia held multiple statutory positions including Company Secretary under the Companies Act 2013, Nodal Officer under the Companies Act 2013, and Compliance Officer under SEBI Listing Regulations 2015 and SEBI Insider Trading Regulations 2015. She expressed gratitude for the opportunity to serve and committed to ensuring a smooth transition of responsibilities before her departure.",
            "Sentiment": "neutral",
            "PublishDate": 1762273540760,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hind Rectifiers Commences Commercial Production at Sinnar Plant",
            "Summary": "Hind Rectifiers Limited has started commercial production at its Sinnar Plant from November 3, 2025. The facility manufactures Continuously Transposed Conductors (CTC), Enamelled Paper Insulated Copper Conductors (EPICC) and Paper Insulated Copper Conductors (PICC). The company expects this expansion to enhance operational efficiency by streamlining the supply chain, reducing dependence on external vendors, ensuring timely product delivery, and improving margins through cost optimization.",
            "Sentiment": "positive",
            "PublishDate": 1762148621964,
            "Source": "stock"
        },
        {
            "Title": "Hind Rectifiers Appoints Manoj Nair as New CEO",
            "Summary": "Hind Rectifiers has appointed Manoj Nair as its new Chief Executive Officer. Nair brings experience from his previous tenure at Cummins India, where he worked in various roles.",
            "Sentiment": "positive",
            "PublishDate": 1760087871589,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hind Rectifiers Allots 200,000 Equity Warrants Worth ₹273.6 Crore to Promoter Group Entity",
            "Summary": "Hind Rectifiers Limited's Board of Directors approved the allotment of 200,000 equity warrants at ₹1,368.23 each through a preferential issue, raising approximately ₹273.6 crore. The entire subscription was received from Elventive Tech Private Limited, a promoter group entity. Each warrant carries a face value of ₹2 and can be converted into one equity share within 18 months from the allotment date. The allotment was conducted under a preferential issue on private placement basis in accordance with SEBI ICDR Regulations and Companies Act provisions.",
            "Sentiment": "neutral",
            "PublishDate": 1759330441385,
            "Source": "corporate_action"
        },
        {
            "Title": "Hind Rectifiers Establishes New Subsidiary in France for Robotics and Electronics R&D",
            "Summary": "Hind Rectifiers has launched a new subsidiary called 'Belink Hirect SAS' in France. The subsidiary is focused on boosting research and development activities in robotics and electronics.",
            "Sentiment": "positive",
            "PublishDate": 1759311070576,
            "Source": "stock"
        },
        {
            "Title": "Hind Rectifiers Completes Manufacturing Expansion at Sinnar Plant",
            "Summary": "Hind Rectifiers Limited has completed expansion and backward integration at its Sinnar plant for manufacturing Continuously Transposed Conductor (CTC), Enameled Paper Insulated Copper Conductor (EPICC), and Paper Insulated Copper Conductor (PICC). The plant became operational on September 29, 2025, with commercial production expected to begin within 30 days. The company states this backward integration will enhance operational efficiency by streamlining the supply chain, reducing dependence on external vendors, ensuring timely delivery, and optimizing costs to improve margins.",
            "Sentiment": "positive",
            "PublishDate": 1759219982331,
            "Source": "stock"
        },
        {
            "Title": "Hind Rectifiers Acquires BeLink Solutions France for Euro 1 Million Through New Subsidiary",
            "Summary": "Hind Rectifiers Limited received French Tribunal approval to acquire BeLink Solutions France's running business, assets, and intellectual property for Euro 1 million. The acquisition will be executed through a new subsidiary in France, where Hind Rectifiers will hold 100% preference shares and 66% equity shares, with the remaining 34% equity shares held by Promoter Group Companies. BeLink Solutions operates in robotics, EMS and electronics R&D. The Tribunal des Activités Économiques of Le Mans approved the proposal on September 17, 2025, with Hind Rectifiers emerging as the successful bidder. Possession of assets and business is expected upon incorporation of the proposed subsidiary, targeted for completion by October 1, 2025. BeLink Solutions is not a related party to Hind Rectifiers Limited.",
            "Sentiment": "positive",
            "PublishDate": 1758209254584,
            "Source": "order&deals"
        },
        {
            "Title": "Hind Rectifiers Issues Corrigendum to Postal Ballot Notice for ₹27.36 Crore Equity Warrant Issue",
            "Summary": "Hind Rectifiers Limited issued a corrigendum to its postal ballot notice dated July 29, 2025, providing clarifications on the preferential issue of 2,00,000 equity warrants worth ₹27,36,46,000 to promoter group entity Elventive Tech Private Limited. The corrigendum clarifies valuation methodology, lock-in periods, and allottee status details. Key changes include confirmation that equity warrants will have a 1-year lock-in period and resultant equity shares will have an 18-month lock-in period. The issue price is set at ₹1,368.23 per warrant, with proceeds intended for capital expenditure including machinery procurement and potential land/building purchases for manufacturing units. E-voting period runs from July 30 to August 28, 2025. Shareholders who already voted can modify their votes by emailing the scrutinizer before the deadline.",
            "Sentiment": "neutral",
            "PublishDate": 1755184632432,
            "Source": "corporate_action"
        },
        {
            "Title": "Hind Rectifiers Communicates Tax Deduction Details on Final Dividend for FY 2024-25",
            "Summary": "Hind Rectifiers Limited has communicated to shareholders about tax deduction at source (TDS) on the final dividend for financial year 2024-25. The company's 67th Annual General Meeting held on July 29, 2025, approved a dividend of Rs. 2.00 per equity share of face value Rs. 2 each. The dividend was payable to shareholders whose names appeared in the register as of July 22, 2025. No tax will be deducted for resident individual shareholders if the dividend paid during FY 2025-26 does not exceed Rs. 10,000. The withholding tax rate varies based on residential status and shareholder category. Higher withholding tax rates apply if PAN is not updated or available. The dividend has been directly credited to shareholders' bank accounts on August 4, 2025, through NACH mode. The company will file TDS returns electronically within the prescribed timeframe, and Form 16A can be downloaded from TRACES as valid TDS certificates.",
            "Sentiment": "neutral",
            "PublishDate": 1754922483412,
            "Source": "corporate_action"
        },
        {
            "Title": "Hind Rectifiers Reports 58.5% Revenue Growth in Q1 FY26, Order Book Reaches All-Time High of INR 1,022 Crores",
            "Summary": "Hind Rectifiers Limited reported strong quarterly results with revenue from operations growing 58.5% year-on-year to INR 214.8 crores. EBITDA increased 66.9% to INR 24.2 crores with margins improving to 11.3% from 10.7%. PAT grew 85.5% to INR 12.8 crores with margins expanding to 5.9%. The company achieved an all-time high order book of over INR 1,022 crores, including two major orders worth INR 127 crores and INR 101 crores from Indian Railways for locomotive products. The company successfully commissioned its indigenously developed propulsion system, which has been assigned to Western Railways for field trials. Hind Rectifiers received orders for next-generation propulsion systems designed for passenger locomotives. The Board approved a preferential issue of warrants worth INR 27.4 crores to the promoter group. The company operates in three verticals: traction transformers (40-45% market share with Indian Railways), power electronics division, and electromechanical systems. Indian Railways contributes around 90% of revenue, with the company supplying directly and through OEMs like Alstom, Siemens, and BHEL. Management expects to target 10% market share in propulsion systems, with each system valued at approximately INR 1.8 crores. The company plans INR 50 crores capex for backward integration, funded two-thirds by debt and one-third by internal accruals.",
            "Sentiment": "positive",
            "PublishDate": 1754395308570,
            "Source": "earnings"
        },
        {
            "Title": "Hind Rectifiers Disburses ₹2.00 Per Share Dividend for FY 2024-25",
            "Summary": "Hind Rectifiers Limited has disbursed a dividend of ₹2.00 per equity share for Financial Year 2024-25. The dividend was approved at the company's 67th Annual General Meeting held on July 29, 2025, and was credited to shareholders on August 4, 2025. The payment was made primarily through electronic modes including NACH/NECS/Direct Remittance to shareholders who had registered their bank account details with the company. Shareholders without registered bank details have been advised to update their information with depositories or the Registrar and Transfer Agent to ensure smooth receipt of future dividends.",
            "Sentiment": "positive",
            "PublishDate": 1754300399146,
            "Source": "corporate_action"
        },
        {
            "Title": "Hind Rectifiers Reports ₹1,025 Crore Order Book and Capacity Expansion Plans",
            "Summary": "Hind Rectifiers has secured a ₹1,025 crore order book and developed in-house propulsion systems while increasing manufacturing capacity. The company is positioning itself to benefit from Indian Railways' ₹11 lakh crore investment plan and aims to export traction converters globally.",
            "Sentiment": "positive",
            "PublishDate": 1753798385374,
            "Source": "stock"
        },
        {
            "Title": "Hind Rectifiers Reports 58.5% Revenue Growth in Q1 FY26, Order Book Reaches All-Time High of Rs 1,025 Crore",
            "Summary": "Hind Rectifiers Limited achieved strong quarterly results with revenue rising 58.5% year-on-year to Rs 214.8 crore. EBITDA increased 66.9% to Rs 24.2 crore with margins improving to 11.3% from 10.7%. PAT surged 85.5% to Rs 12.8 crore. The company secured significant orders worth Rs 327 crore from Indian Railways during the quarter, bringing total order book to an all-time high of Rs 1,025 crore. Key developments include successful commissioning of indigenously developed propulsion system for Indian Railways and securing orders for next-generation propulsion systems for passenger locomotives. The Board approved preferential issue of warrants worth Rs 27.4 crore to existing promoter group, subject to shareholder approval. The company operates manufacturing facilities at Sinnar and Satpur in Maharashtra, producing railway systems, traction motors, transformers, and industrial systems.",
            "Sentiment": "positive",
            "PublishDate": 1753794003436,
            "Source": "earnings"
        },
        {
            "Title": "Hind Rectifiers Shares Surge 20% on Strong Quarterly Results and Warrant Issuance",
            "Summary": "Hind Rectifiers shares hit a 20% upper circuit following strong quarterly performance and fundraising announcement. The company reported revenue growth of 58.5% to ₹214 crore, while EBITDA increased 69% year-on-year to ₹24.3 crore. EBITDA margin expanded to 11.3% from 10.6% previously, and net profit jumped 81.4% to ₹12.7 crore. The company plans to issue up to 2 lakh fully convertible equity warrants at ₹1,368.23 per share to Elventive Tech Pvt. Ltd., with 25% payment due at application and the remainder upon conversion. Each warrant converts to one equity share. Promoters held a 43.98% stake at the end of June quarter. The stock closed at ₹1,712.2 and turned positive on a year-to-date basis.",
            "Sentiment": "positive",
            "PublishDate": 1753780373027,
            "Source": "stock"
        },
        {
            "Title": "Hind Rectifiers Board Approves Rs 27.36 Crore Warrant Issue to Promoter Group",
            "Summary": "Hind Rectifiers Limited's Board approved the issuance of 200,000 warrants on a preferential basis at Rs 1,368.23 per warrant, raising Rs 27.36 crores. The warrants will be issued to Elventive Tech Private Limited, which belongs to the promoter group. Each warrant is convertible into one equity share within 18 months from allotment date. The company will seek shareholder approval through a postal ballot process. Investors need to pay 25% of the consideration at application and the balance at conversion.",
            "Sentiment": "neutral",
            "PublishDate": 1753774531468,
            "Source": "corporate_action"
        },
        {
            "Title": "Hind Rectifiers Reports Strong Q1 Growth with Revenue Up 56% and Net Profit Nearly Doubling",
            "Summary": "Hind Rectifiers delivered robust quarterly performance with revenue rising to 2.1 billion rupees from 1.35 billion rupees year-over-year. The company's EBITDA increased significantly to 243 million rupees compared to 145 million rupees in the same period last year, while EBITDA margin improved to 11.30% from 10.68%. Net profit showed strong growth, reaching 128 million rupees versus 69 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1753773032255,
            "Source": "earnings"
        },
        {
            "Title": "Hind Rectifiers Adds Fund Raising Proposal to Board Meeting Agenda",
            "Summary": "Hind Rectifiers Limited has announced additional agenda items for their board meeting on July 29, 2025. The board will consider a proposal for fund raising through preferential issue of warrants to identified persons, subject to regulatory approvals and shareholder consent. The company may also convene an extraordinary general meeting or conduct a postal ballot process to seek shareholder approval for the fund raising proposal. The meeting was originally scheduled to approve financial results for the quarter ended June 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753374001886,
            "Source": "corporate_action"
        },
        {
            "Title": "Hind Rectifiers Achieves Record Order Book of Rs 1,025 Crores",
            "Summary": "Hind Rectifiers has reported a record-high order book of Rs 1,025 crores as of July 1, 2025. The company secured orders totaling Rs 284 crores in June 2025, contributing to this milestone.",
            "Sentiment": "positive",
            "PublishDate": 1751356144000,
            "Source": "default"
        },
        {
            "Title": "Hind Rectifiers: Shares Surge on Rs 127-Crore Railway Order",
            "Summary": "Hind Rectifiers Ltd. received a Rs 127 crore supply order from Indian Railways, to be executed between FY 2026-2027. The company's shares rose nearly 10% in early trade. Hind Rectifiers is also expanding manufacturing facilities in Nashik and planning a new subsidiary for high-tech solutions.",
            "Sentiment": "positive",
            "PublishDate": 1751259734000,
            "Source": "order&deals"
        },
        {
            "Title": "Hind Rectifiers Secures ₹127 Crore Order from Indian Railways",
            "Summary": "Hind Rectifiers has received an order worth ₹127 crore from Indian Railways. The supply contract is scheduled to be completed by the financial year 2026-27.",
            "Sentiment": "positive",
            "PublishDate": 1751251156000,
            "Source": "default"
        },
        {
            "Title": "Hind Rectifiers Secures 1.01 Billion Rupee Order",
            "Summary": "Hind Rectifiers has received an order worth 1.01 billion rupees (approximately $12.2 million USD). No further details about the nature of the order or the client were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751241476000,
            "Source": "default"
        },
        {
            "Title": "Hind Rectifiers: Secures ₹101 Crore Order from Indian Railways",
            "Summary": "Hind Rectifiers Limited has received a ₹101 crore supply order from Indian Railways for electrical components. The contract will be executed over FY 2025-26 to FY 2026-27. The company also reported a 95% increase in Q4 net profit to ₹9.99 crore and approved a final dividend of ₹2 per share for FY 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1751043404000,
            "Source": "order&deals"
        },
        {
            "Title": "Hind Rectifiers Secures 1.01 Billion Rupee Order",
            "Summary": "Hind Rectifiers has received an order valued at 1.01 billion rupees. No further details about the order or its nature were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751033262000,
            "Source": "default"
        },
        {
            "Title": "REC Proposes Fundraising and Plans to Strike Off Rajgarh III Power Transmission",
            "Summary": "REC has proposed raising funds up to 1.55 trillion rupees. Additionally, the company plans to strike off Rajgarh III Power Transmission. No further details about the fundraising method, purpose, or timeline were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1749082155000,
            "Source": "default"
        },
        {
            "Title": "REC Revises AUM Growth Guidance Downward",
            "Summary": "REC (Rural Electrification Corporation) has reduced its Assets Under Management (AUM) growth guidance for the current period. The company has lowered its projection from the previous 15-17% range to a new range of 11-13%.",
            "Sentiment": "negative",
            "PublishDate": 1747202111000,
            "Source": "default"
        },
        {
            "Title": "Hind Rectifiers Limited: Record Profit Surge and Strong Order Book in FY25",
            "Summary": "Hind Rectifiers reported a 197% YoY increase in PAT to ₹37.1 crore for FY25. Total income grew 27% to ₹656.8 crore. EBITDA rose 60% with margins expanding to 10.9%. Q4 PAT jumped 96% to ₹10 crore. The company secured railway sector orders worth ₹1,014 crore, with a robust order book of ₹893 crore as of March 2025. ₹43 crore was invested in capex for backward integration and new product manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1746508851000,
            "Source": "earnings"
        },
        {
            "Title": "Hind Rectifiers Reports Strong Q4 Results, Announces Dividend and Investment Plans",
            "Summary": "Hind Rectifiers reported a significant increase in Q4 net profit, rising to 101.5 million rupees from 51.2 million rupees year-over-year. Revenue also grew to 1.85 billion rupees from 1.5 billion rupees. The company recommended a final dividend of 2 rupees per equity share. Additionally, Hind Rectifiers reviewed its Sinnar facility with a 520 million rupees investment, deferred the incorporation of subsidiaries in Sweden and France, and approved land acquisition in India up to 500 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1746490254000,
            "Source": "default"
        },
        {
            "Title": "Hind Rectifiers Reports Strong Q4 Results and Announces Corporate Actions",
            "Summary": "Hind Rectifiers has reported significant year-over-year growth in Q4, with revenue increasing to 1.85B rupees, EBITDA rising to 200.6M rupees, and net profit more than doubling to 101.5M rupees. The company has recommended a final dividend of 2 rupees per equity share. Additionally, Hind Rectifiers is reviewing its Sinnar facility with a 520 million rupees investment, has deferred the incorporation of subsidiaries in Sweden and France, and has approved land acquisition in India up to 500M rupees.",
            "Sentiment": "positive",
            "PublishDate": 1746447689000,
            "Source": "default"
        },
        {
            "Title": "Hind Rectifiers: Expansion Plans and New Tech Subsidiary",
            "Summary": "Hind Rectifiers is expanding its Nashik manufacturing facilities and setting up a new subsidiary for AI, Web3, and IT solutions. The company reported a six-fold increase in Q3 FY25 net profit to Rs 10 crore, with total income up 24% to Rs 169.4 crore. Current order book stands at Rs 870 crore, including a Rs 73-crore contract from Indian Railways.",
            "Sentiment": "positive",
            "PublishDate": 1738752869000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hind Rectifiers Reports Improved Q3 EBITDA and Margin",
            "Summary": "Hind Rectifiers has announced its Q3 financial results, showing an improvement in both EBITDA and EBITDA margin. The company's EBITDA increased to 176 million rupees from 135 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 10.43% from 9.87% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738309353000,
            "Source": "earnings"
        },
        {
            "Title": "Hind Rectifiers Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Hind Rectifiers has announced its financial results for the third quarter. The company's net profit increased substantially to 100 million rupees, up from 15 million rupees in the same period last year. Revenue also saw growth, rising to 1.68 billion rupees from 1.37 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738309346000,
            "Source": "earnings"
        },
        {
            "Title": "Hind Rectifiers: Mukul Agrawal Increases Stake in Multibagger Stock",
            "Summary": "Ace investor Mukul Agrawal has increased his stake in Hind Rectifiers by 0.7%, now holding 1.46% of the company. The stock has delivered multibagger returns, surging over 168% in the past year. Hind Rectifiers reported a significant increase in net profit for Q1 FY2025, with revenue rising 39% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1736408579000,
            "Source": "normal_news"
        },
        {
            "Title": "Hind Rectifiers Incorporates New Subsidiary in UAE",
            "Summary": "Hind Rectifiers has established a new subsidiary in the United Arab Emirates. The newly incorporated entity will engage in various trading activities, including power generation equipment, transmission and distribution equipment, heavy machinery, electronic components, industrial plant equipment, and non-ferrous metals.",
            "Sentiment": "positive",
            "PublishDate": 1732256600000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hind Rectifiers Reports Strong Q2 Financial Performance",
            "Summary": "Hind Rectifiers has announced its Q2 financial results, showing significant improvement in key metrics. The company's EBITDA increased to 183 million rupees, up from 106 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 11.04% from 8.05% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1730274807000,
            "Source": "result"
        },
        {
            "Title": "Hind Rectifiers Reports Q2 Revenue Growth",
            "Summary": "Hind Rectifiers has announced its second quarter revenue for the current fiscal year. The company reported revenue of 1.7 billion rupees, compared to 1.32 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730274781000,
            "Source": "result"
        },
        {
            "Title": "Hind Rectifiers Reports Significant Profit Growth in Q2",
            "Summary": "Hind Rectifiers has announced its Q2 financial results, reporting a net profit of 102 million rupees, compared to 40 million rupees in the same quarter last year. This represents a substantial year-over-year increase in profitability for the company.",
            "Sentiment": "positive",
            "PublishDate": 1730274751000,
            "Source": "result"
        },
        {
            "Title": "Hind Rectifiers Secures Major Railway Order",
            "Summary": "Hind Rectifiers has obtained orders valued at 730 million rupees from Indian Railways. This significant contract highlights the company's strong position in the railway equipment sector and suggests potential growth in its order book.",
            "Sentiment": "positive",
            "PublishDate": 1729256155000,
            "Source": "corporate_action"
        }
    ]
}