{
    "Symbol": "HISARMETAL",
    "ISIN": "INE598C01011",
    "News": [
        {
            "Title": "Hisar Metal Industries Approves Q3FY26 Results",
            "Summary": "Hisar Metal Industries Limited's Board approved unaudited financial results for quarter and nine months ended December 31, 2025, during meeting held on February 09, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770662570731,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hisar Metal Industries Reports Mixed Financial Performance in Latest Results",
            "Summary": "Hisar Metal Industries Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of Rs 902 lakhs for the quarter compared to Rs 1,083 lakhs in the previous quarter. For the half year, revenue stood at Rs 1,985 lakhs versus Rs 2,483 lakhs in the corresponding previous period. The company posted a net loss of Rs 148 lakhs for the quarter, while achieving a net profit of Rs 86 lakhs for the half year period. Earnings per share for the quarter was negative at Rs 1.57, while the half year EPS was positive at Rs 0.78. The Board of Directors approved these results at their meeting held on November 12, 2025. The company operates in a single business segment and has paid-up equity share capital of Rs 540 lakhs with face value of Rs 10 per share.",
            "Sentiment": "negative",
            "PublishDate": 1762930274669,
            "Source": "earnings"
        },
        {
            "Title": "Hisar Metal Industries Revises Dividend Record Date Due to Settlement Holiday",
            "Summary": "Hisar Metal Industries Limited has revised the record date for dividend from September 8, 2025 to September 9, 2025 due to a settlement holiday on account of EID. The company's 35th Annual General Meeting is scheduled for September 19, 2025 at 9:00 A.M. at the registered office in Hisar, Haryana. The dividend, once approved by shareholders at the AGM, will be paid within 30 days from the date of approval.",
            "Sentiment": "neutral",
            "PublishDate": 1757047627691,
            "Source": "corporate_action"
        },
        {
            "Title": "Hisar Metal Industries Publishes Quarterly Financial Results",
            "Summary": "Hisar Metal Industries Limited published its unaudited financial results for the quarter ended June 30, 2025. The results were published in The Financial Express and Jansatta newspapers on August 10, 2025, and reported to the Bombay Stock Exchange and National Stock Exchange of India on August 11, 2025. The company is dual-listed on both BSE and NSE and has fulfilled its regulatory disclosure requirements as a publicly listed entity.",
            "Sentiment": "neutral",
            "PublishDate": 1754891380882,
            "Source": "earnings"
        },
        {
            "Title": "Hisar Metal Industries Reports 47.5% Drop in Net Profit for Q1 FY2026",
            "Summary": "Hisar Metal Industries Limited reported net profit of Rs. 0.42 crores for Q1 FY2026, down 47.5% from Rs. 0.80 crores in Q1 FY2025. Revenue from operations declined 2.3% to Rs. 62.10 crores compared to Rs. 63.58 crores in the previous year. Earnings per share decreased to Rs. 0.78 from Rs. 1.59. The company reduced several expense categories including cost of materials consumed (Rs. 48.02 crores vs Rs. 51.92 crores), employee benefits (Rs. 2.07 crores vs Rs. 2.30 crores), and finance costs (Rs. 1.68 crores vs Rs. 2.00 crores). The board approved these unaudited results and scheduled the 35th Annual General Meeting for September 19, 2025. M/s. Naveen Gupta & Co. was appointed as Cost Auditor for FY2026. The company operates in a single segment within the metal industry and reported no exceptional items for the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754727134817,
            "Source": "earnings"
        }
    ]
}