{
    "Symbol": "HITECH",
    "ISIN": "INE106T01025",
    "News": [
        {
            "Title": "Hi-Tech Pipes achieves 1 million tons capacity milestone",
            "Summary": "Hi-Tech Pipes Limited commences commercial production at Sikandrabad Unit-III facility, adding 1,20,000 mtpa capacity and achieving 1 million tons total installed annual capacity.",
            "Sentiment": "positive",
            "PublishDate": 1770611239881,
            "Source": "stocks"
        },
        {
            "Title": "Hi-Tech Pipes Q3FY26 Revenue Jumps 40.6% YoY",
            "Summary": "Hi-Tech Pipes Limited reported consolidated revenue of ₹106,958.82 lacs in Q3FY26, up 40.6% YoY, though net profit declined 9.2% to ₹1,738.70 lacs. Nine-month revenue grew 16.5% to ₹271,971.53 lacs.",
            "Sentiment": "neutral",
            "PublishDate": 1770465252588,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hi-Tech Pipes Starts Production at New Kathua Plant",
            "Summary": "Hi-Tech Pipes commences operations at its new manufacturing facility in Kathua, Jammu with 80,000 MTPA capacity, targeting northern markets with value-added products.",
            "Sentiment": "positive",
            "PublishDate": 1767591512613,
            "Source": "stocks"
        },
        {
            "Title": "Hi-Tech Pipes Reports Record Q3 FY26 Sales Volume",
            "Summary": "Hi-Tech Pipes achieved record sales volume of 1,36,067 MT in Q3 FY26, marking 10% YoY and 9% QoQ growth driven by infrastructure and construction demand with strong management outlook.",
            "Sentiment": "positive",
            "PublishDate": 1767253237817,
            "Source": "stocks"
        },
        {
            "Title": "Hi-Tech Pipes Commences Commercial Production at Sanand Unit II Phase II Expansion",
            "Summary": "Hi-Tech Pipes Limited has started commercial production at its Sanand, Gujarat Unit II Phase II brownfield expansion, adding 1 lakh MTPA capacity for large-diameter ERW pipes and jumbo hollow sections. The expansion strengthens the company's Western India presence and enhances capabilities to serve solar, fabrication, engineering, and infrastructure sectors while improving logistics efficiencies and export potential.",
            "Sentiment": "positive",
            "PublishDate": 1764147721612,
            "Source": "stock"
        },
        {
            "Title": "Hi-Tech Pipes Reports 21.66% Revenue Growth in Q2FY26, Commissions New Capacity",
            "Summary": "Hi-Tech Pipes Limited reported revenue growth of 21.66% to INR 858.77 crores in Q2FY26 with sales volume up 1.78% to 1.25 lakh tons, driven by better product mix and value-added products. The company has commenced trial runs at its 3 lakh ton capacity expansion and laid foundation stone for a greenfield facility in Hindupur, Andhra Pradesh with 1.5 lakh ton capacity targeting completion by Q1FY28.",
            "Sentiment": "positive",
            "PublishDate": 1763645224187,
            "Source": "earnings"
        },
        {
            "Title": "Hi-Tech Pipes Shares Audio Recording Link of Earnings Conference Call",
            "Summary": "Hi-Tech Pipes Limited provided the audio recording link of its investor conference call held on November 13, 2025, discussing the company's un-audited financial results for the quarter and half year ended September 30, 2025. The audio link has been made available on the company's website and shared with stock exchanges NSE and BSE for investor information and records.",
            "Sentiment": "neutral",
            "PublishDate": 1763066306963,
            "Source": "earnings"
        },
        {
            "Title": "Hi-Tech Pipes Lays Foundation for Rs 100 Crore Greenfield Manufacturing Project in Andhra Pradesh",
            "Summary": "Hi-Tech Pipes Limited laid the foundation stone for its Greenfield Manufacturing Project at Hindupur, Andhra Pradesh. The ceremony was conducted by Andhra Pradesh Chief Minister N. Chandrababu Naidu. The new facility will have an installed capacity of 1,50,000 tonnes per annum and represents a total investment of approximately Rs 100 crore, funded entirely through internal accruals. The project will focus on manufacturing value-added coated steel products and is expected to be completed by Q2 FY28. The company currently operates with an installed capacity of 0.75 MTPA at 66% utilization. An additional 0.30 MTPA capacity increase is planned for Q3 FY26 through ongoing brownfield and greenfield expansion. The Hindupur facility is strategically located to serve customers across southern and western India, improving logistics efficiency and delivery timelines. This expansion is part of the company's roadmap to achieve 2 Million Tonnes Per Annum capacity target.",
            "Sentiment": "positive",
            "PublishDate": 1763030303793,
            "Source": "stock"
        },
        {
            "Title": "Hi-Tech Pipes Announces Multi-Year Expansion Plan with Capacity Scale-Up to 7 Lakh TPA by FY27",
            "Summary": "Hi-Tech Pipes has outlined a multi-year expansion strategy with projected revenue and EBITDA improvements in Q2FY26. The company plans to scale its steel tube and coil capacity beyond 7 lakh tonnes per annum by FY27. The expansion includes aggressive capital expenditure in color-coated coil and structural products. Hi-Tech Pipes is focusing on securing high-value infrastructure orders and establishing pan-India distribution networks as part of its growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1762963611172,
            "Source": "stock"
        },
        {
            "Title": "Bandhan Mutual Fund Increases Stake in Hi-Tech Pipes to 7.11%",
            "Summary": "Bandhan Mutual Fund acquired 2,40,000 equity shares of Hi-Tech Pipes Limited on October 23, 2025, through open market purchases. The acquisition increased the fund's holding by 2.0763% of the company's paid-up capital, raising its total stake from 5.0305% to 7.1068%. The shares were acquired through two schemes: Bandhan Large & Mid Cap Fund and Bandhan Small Cap Fund. Hi-Tech Pipes has an equity share capital of Rs. 20,31,07,734 with shares of face value Rs. 1 each. The company is listed on BSE Limited and National Stock Exchange of India.",
            "Sentiment": "neutral",
            "PublishDate": 1761548392214,
            "Source": "mutualfunds"
        },
        {
            "Title": "Hi-Tech Pipes Reports Record Sales Volume Growth in Q2 and H1 FY26",
            "Summary": "Hi-Tech Pipes achieved record sales volume of 1,25,218 MT in Q2 FY26, up from 1,23,027 MT in the previous year. For H1 FY26, the company reported sales volume of 2,49,245 MT compared to 2,45,182 MT in the corresponding period last year. The company described these as record sales volumes.",
            "Sentiment": "positive",
            "PublishDate": 1759291774987,
            "Source": "stock"
        },
        {
            "Title": "Hi-Tech Pipes Appoints Nehal Shah as Chief Strategy Officer",
            "Summary": "Hi-Tech Pipes Limited appointed Mr. Nehal Shah as Chief Strategy Officer, designated as a Senior Management Person, effective September 22, 2025. The appointment was approved by the Board of Directors based on the recommendation of the Nomination and Remuneration Committee. Shah is a Commerce Graduate and qualified Chartered Accountant with over two decades of experience in equity research, corporate strategy, and industry analysis, with expertise in the building materials sector. He has previously held senior roles at Kajaria Ceramics, Century Plyboards, and ICICI Securities, contributing to business growth, market positioning, and long-term value creation.",
            "Sentiment": "positive",
            "PublishDate": 1758515479886,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hi-Tech Pipes Reports Highest Ever Quarterly PAT of INR 21 Crores in Q1 FY26",
            "Summary": "Hi-Tech Pipes Limited reported revenue of INR 791 crores for the quarter ended June 30, 2025, compared to INR 866 crores in the corresponding quarter last year. Sales volume increased to 1.24 lakh tons from 1.22 lakh tons year-over-year. The company achieved its highest ever quarterly profit after tax of INR 21 crores and EBITDA of INR 41.03 crores. EBITDA per ton stood at INR 3,308, reflecting a 10% improvement quarter-on-quarter driven by better product mix and improved realizations. The company is commissioning two new facilities - a greenfield plant at Sikandrabad and brownfield expansion at Sanand Unit-II Phase 2, both expected to begin production in Q2 FY26 with combined capacity of 250,000 tons annually. Management expects 50% utilization from these new facilities in the first year and projects annual volume of 5.5-6 lakh tons. The new capacities will focus on value-added products for renewable energy, defense, and infrastructure sectors, with the company targeting to increase its value-added product share from 37% to 45%. Management indicated optimal EBITDA targets of INR 4,500-5,000 per ton once steel price volatility stabilizes.",
            "Sentiment": "positive",
            "PublishDate": 1755081415330,
            "Source": "earnings"
        },
        {
            "Title": "Hi-Tech Pipes Reports Strong Q1 FY26 Results with 307% Jump in Net Profit",
            "Summary": "Hi-Tech Pipes Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported total income from operations of Rs 79,136.04 lakhs compared to Rs 73,374.40 lakhs in the previous year quarter. Net profit after tax surged to Rs 7,285.95 lakhs from Rs 1,749.42 lakhs in the same quarter last year, representing a significant increase. Net profit before tax also rose substantially to Rs 9,798.62 lakhs from Rs 2,796.78 lakhs year-on-year. Earnings per share improved to Rs 1.04 from Rs 3.98 in the corresponding quarter of the previous year. The results were published in Business Standard newspaper in both English and Hindi editions.",
            "Sentiment": "positive",
            "PublishDate": 1755024713872,
            "Source": "earnings"
        },
        {
            "Title": "Hi-Tech Pipes Reports QIP Proceeds Utilization for Quarter Ended June 30, 2025",
            "Summary": "Hi-Tech Pipes Limited submitted its monitoring agency report for QIP proceeds utilization covering the quarter ended June 30, 2025. The company raised Rs 5,007.89 million through the QIP conducted from October 7-11, 2024, with net proceeds of Rs 4,732.89 million. During the reported quarter, Rs 300 million was utilized for capital expenditure towards manufacturing expansion projects in Gujarat and Andhra Pradesh. The company has fully utilized Rs 2,500 million for debt repayment and Rs 832.89 million for general corporate purposes. Total proceeds utilized stand at Rs 3,883.43 million, leaving Rs 850.46 million unutilized. The monitoring agency CRISIL reported no deviations from stated objectives, with unutilized funds deployed in fixed deposits and mutual funds earning 6.5-6.7% returns.",
            "Sentiment": "neutral",
            "PublishDate": 1755009520836,
            "Source": "corporate_action"
        },
        {
            "Title": "Hi-Tech Pipes Reports Strong Q1 FY26 Results with 307% Jump in Net Profit",
            "Summary": "Hi-Tech Pipes Limited published its unaudited financial results for the quarter ended June 30, 2025. The company reported total income from operations of Rs 79,136.04 lakhs compared to Rs 73,374.40 lakhs in the previous year quarter. Net profit after tax surged to Rs 7,285.95 lakhs from Rs 1,749.42 lakhs in the corresponding quarter of the previous year. Net profit before tax increased to Rs 9,798.62 lakhs from Rs 2,796.78 lakhs year-on-year. Earnings per share improved to Rs 3.98 from Rs 1.04 in the same quarter last year. The results were published in Business Standard newspaper in both English and Hindi editions on August 9, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754846132835,
            "Source": "earnings"
        },
        {
            "Title": "Hi-Tech Pipes Limited Reports Deviation in QIP Fund Utilization for Quarter Ended June 30, 2025",
            "Summary": "Hi-Tech Pipes Limited submitted a statement of deviation in the utilization of funds raised through Qualified Institutional Placement for the quarter ended June 30, 2025. The company filed this statement with the National Stock Exchange of India and BSE Limited, signed by Company Secretary Arun Kumar. The document indicates variations in how the QIP proceeds were utilized compared to the original allocation plan during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754663513575,
            "Source": "corporate_action"
        },
        {
            "Title": "Hi-Tech Pipes Reports Mixed Q1 Results with Higher Profit Despite Revenue Decline",
            "Summary": "Hi-Tech Pipes reported Q1 consolidated net profit of 209 million rupees, up from 181 million rupees in the previous year. However, revenue declined to 8 billion rupees from 8.67 billion rupees year-over-year. EBITDA decreased to 410 million rupees from 427 million rupees, while EBITDA margin improved to 5.2% from 4.92% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1754642946119,
            "Source": "earnings"
        },
        {
            "Title": "Hi-Tech Pipes: Q1 FY26 Sales Volume Up 1.5% YoY",
            "Summary": "Hi-Tech Pipes reported Q1 FY26 sales volume of 1.24 lakh metric tonne, up 1.53% YoY and 6.9% QoQ. Q4 FY25 saw 58.8% rise in net profit to ₹18 crore, 7.8% revenue increase to ₹734 crore, but EBITDA dipped 0.9% to ₹34.8 crore with margin contraction.",
            "Sentiment": "neutral",
            "PublishDate": 1751359530000,
            "Source": "earnings"
        },
        {
            "Title": "Hi Tech Pipes Reports Sales Volume Growth in Q4 FY25 and Q1 FY26",
            "Summary": "Hi Tech Pipes reported a 6.89% increase in sales volume quarter-over-quarter, reaching 116,032 MT in Q4 FY25. In Q1 FY26, the company achieved a sales volume of 124,027 MT, showing a year-over-year growth of 1.53% compared to 122,155 MT in Q1 FY25.",
            "Sentiment": "positive",
            "PublishDate": 1751344084000,
            "Source": "default"
        },
        {
            "Title": "Hi-Tech Pipes Reports Q4 Financial Results",
            "Summary": "Hi-Tech Pipes has released its Q4 financial results. The company reported EBITDA of 349 million rupees, compared to 353 million rupees in the same quarter last year. The EBITDA margin decreased to 4.76% from 5.19% year-over-year. Revenue for Q4 increased to 7.34 billion rupees from 6.8 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1748247337000,
            "Source": "result"
        },
        {
            "Title": "HI-TECH PIPES Reports Q4 Consolidated Net Profit Increase",
            "Summary": "HI-TECH PIPES reported a consolidated net profit of 180 million rupees for the latest quarter, compared to 111 million rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1748247252000,
            "Source": "result"
        },
        {
            "Title": "Hi-Tech Pipes Reports Strong Q3 Financial Results",
            "Summary": "Hi-Tech Pipes has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 191 million rupees from 143 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 7.6 billion rupees compared to 6.3 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739342020000,
            "Source": "earnings"
        },
        {
            "Title": "Hi-Tech Pipes Reports Record Sales Volume in Q3 and 9M FY25",
            "Summary": "Hi-Tech Pipes has achieved its highest-ever sales volume of 1,24,233 MT in Q3 FY25, representing a 26% year-over-year growth. For the first nine months of FY25, the company reported sales volume of 3,69,415 MT, marking a 30% increase compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1735788570000,
            "Source": "result"
        },
        {
            "Title": "Hi-Tech Pipes Reports Record Sales Volume in Q3 and 9M FY25",
            "Summary": "Hi-Tech Pipes has achieved its highest ever sales volume of 1,24,233 MT in Q3 FY25, representing a 26% year-over-year growth. For the first nine months of FY25, the company reported sales volume of 3,69,415 MT, showing a 30% year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1735788482000,
            "Source": "result"
        },
        {
            "Title": "Hi-Tech Pipes Ltd: Credit Rating Upgrade Boosts Stock Performance",
            "Summary": "India Ratings & Research, a Fitch Group company, has upgraded Hi-Tech Pipes Ltd's credit ratings. The company reported 33% year-on-year sales volume growth in H1 FY25 and is expanding operations with new facilities in Gujarat and Uttar Pradesh. The stock has seen a 1,100% rally over five years and is up 68% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1734332723000,
            "Source": "normal_news"
        },
        {
            "Title": "HI-TECH PIPES Expects Lower Steel Prices and Increased Demand",
            "Summary": "HI-TECH PIPES anticipates steel prices to be INR2 to INR3 cheaper than primary steel prices. The company expects this to drive demand for steel products, particularly steel pipes and tubes, as revealed in a recent conference call.",
            "Sentiment": "positive",
            "PublishDate": 1731036720000,
            "Source": "normal_news"
        },
        {
            "Title": "Hi-Tech Pipes Anticipates Growth with Capacity Expansion",
            "Summary": "Hi-Tech Pipes expects significant growth in fiscal year 2026 due to the addition of new production capacities by the end of the current financial year. The company also anticipates steel prices to remain stable within a narrow range in the near future, according to information shared during a conference call.",
            "Sentiment": "positive",
            "PublishDate": 1731036467000,
            "Source": "corporate_action"
        },
        {
            "Title": "HI-TECH PIPES Reports Strong Q2 Financial Performance",
            "Summary": "HI-TECH PIPES has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 422 million rupees from 267 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 5.98% from 3.59% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730876581000,
            "Source": "result"
        },
        {
            "Title": "HI-TECH PIPES Reports Q2 Revenue Decline",
            "Summary": "HI-TECH PIPES has reported a revenue of 7.1 billion rupees for the second quarter, down from 7.5 billion rupees in the same quarter last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1730876491000,
            "Source": "result"
        },
        {
            "Title": "HI-TECH PIPES Reports Significant Increase in Q2 Net Profit",
            "Summary": "HI-TECH PIPES has reported a consolidated net profit of 181 million rupees for the second quarter, compared to 105 million rupees in the same period last year. This represents a substantial year-over-year increase in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1730876463000,
            "Source": "result"
        },
        {
            "Title": "Hi-Tech Pipes: Credit Rating Upgrade Boosts Financial Outlook",
            "Summary": "CRISIL Ratings Limited has upgraded Hi-Tech Pipes Ltd's credit rating to CRISIL A/Positive and CRISIL A1 for bank facilities. The company's financial risk profile improved after raising Rs 500 crore through QIP in October 2024 and Rs 133 crore via warrant conversion. Net worth is expected to exceed Rs 1,200 crore by March 31, 2025. Revenue is projected to reach over Rs 3,300 crore by 2025 with a CAGR of 22% over three fiscal years.",
            "Sentiment": "positive",
            "PublishDate": 1730705251000,
            "Source": "normal_news"
        },
        {
            "Title": "Hi-Tech Pipes: Raises ₹500 Crore via QIP at 8.2% Discount",
            "Summary": "<p>Hi-Tech Pipes Ltd. <span class='positive'>closed</span> its QIP, <span class='positive'>raising ₹500 crore</span> by issuing 2.69 crore equity shares at ₹185.5 per share. <b>Major participants</b> include Bandhan MF, India Inflection Opportunity Trust, and BofA Securities. The company's paid-up equity share capital <span class='positive'>increased</span> from ₹17.61 crore to ₹20.31 crore post-issue.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728643840000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hi-Tech Pipes: QIP Launch with ₹194.98 Floor Price",
            "Summary": "<p><span class='positive'>Hi-Tech Pipes</span> initiated a <span class='neutral'>Qualified Institutional Placement (QIP)</span> on October 7, setting a <span class='neutral'>floor price</span> of ₹194.98 per share. The company may offer up to 5% discount on the floor price. Hi-Tech Pipes reported <span class='positive'>record Q2 sales volumes</span> of 123,027 tonnes, a <span class='positive'>22.5% YoY growth</span>, driven by demand in <b>infrastructure</b>, <b>water transportation</b>, and <b>solar energy</b> sectors.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728301600000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hi-Tech Pipes Approves Floor Price for QIP Issue",
            "Summary": "<p><span class=\"neutral\">Hi-Tech Pipes</span> has <span class=\"positive\">approved</span> a <b>floor price</b> of <span class=\"neutral\">194.98 rupees per share</span> for their <b>Qualified Institutional Placement (QIP)</b> issue. This decision sets the <span class=\"neutral\">minimum price</span> at which the company will offer shares to <span class=\"neutral\">qualified institutional buyers</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728299834000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hi-Tech Pipes: Record Q2 Sales Volume with 22.5% YoY Growth",
            "Summary": "<p>Hi-Tech Pipes achieved its <span class='positive'>highest-ever</span> Q2 sales volume of <b>123,027 MT</b>, up <span class='positive'>22.5% YoY</span>. H1 FY25 sales reached <b>245,182 MT</b>, a <span class='positive'>32.55% YoY increase</span>. <br/> Growth driven by demand in <span class='positive'>infrastructure</span>, <span class='positive'>water transportation</span>, and <span class='positive'>solar energy</span> sectors. Company plans to <span class='positive'>expand capacity</span> to <b>1 million tons</b> in FY25.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727930924000,
            "Source": "result"
        }
    ]
}