{
    "Symbol": "HITECHCORP",
    "ISIN": "INE120D01012",
    "News": [
        {
            "Title": "Hitech Corporation Board Meet Set for Feb 10, 2026",
            "Summary": "Hitech Corporation Limited has scheduled a board meeting on February 10, 2026, to consider and approve audited standalone and consolidated financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770221327776,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hitech Corporation Reports Mixed Q2 Results with Profit Decline and Leadership Extensions",
            "Summary": "Hitech Corporation Limited announced its quarterly results for the second quarter and half year ended September 30, 2025. The company reported a standalone net profit of ₹150.98 lakhs for Q2 2025, down from ₹292.35 lakhs in Q2 2024. For the half year, standalone profit increased to ₹491.20 lakhs from ₹697.05 lakhs in the previous year. Total income for Q2 stood at ₹1,844.72 lakhs compared to ₹1,687.72 lakhs last year. On a consolidated basis, Q2 net profit was ₹418.38 lakhs versus ₹294.31 lakhs in Q2 2024. The Board approved term extensions for three key personnel: Mr. Raghavendra Prasad (General Manager-HR) for two years from March 13, 2025, Mr. V.S.R. Anjaneyulu (Vice President-Technology Center) for one year from September 6, 2025, and Mr. Mehernosh Mehta (Whole-Time Director) beyond his internal retirement age of 58 years until March 16, 2026. The company operates in plastic products as its primary business segment.",
            "Sentiment": "neutral",
            "PublishDate": 1762821371004,
            "Source": "earnings"
        },
        {
            "Title": "Hitech Corporation Reports Strong Q1 Performance with 22% Revenue Growth",
            "Summary": "Hitech Corporation Limited reported consolidated revenue of ₹16,490.48 lakhs for the quarter ended June 30, 2025, compared to ₹14,262.04 lakhs in the same quarter last year. The company's consolidated profit after tax increased to ₹474.79 lakhs from ₹388.57 lakhs year-over-year. On a standalone basis, revenue reached ₹15,282.06 lakhs with profit after tax of ₹340.14 lakhs. The company operates in plastic products as its primary business segment. Basic earnings per share improved to ₹1.98 on standalone basis and ₹2.76 on consolidated basis. The Board of Directors approved both audited standalone and unaudited consolidated financial results during their meeting held on August 8, 2025. The company has subsidiaries including Thriarr Polymers Private Limited and Hitech Global Inc.",
            "Sentiment": "positive",
            "PublishDate": 1754663776312,
            "Source": "earnings"
        },
        {
            "Title": "Hitech Corporation Faces Rs 1.85 Crore Stamp Duty Demand from Gujarat Authority",
            "Summary": "Hitech Corporation Limited received an order from the Collector and Additional Superintendent of Stamps, Gandhinagar, demanding stamp duty of Rs 26.49 lakh and a fine of Rs 1.59 crore related to a slump sale agreement from 2006. The demand pertains to moveable and immoveable properties transferred through a slump sale agreement between Mipak Plastics Private Limited and Mipak Polymers Private Limited dated May 30, 2006. These entities later merged with Hitech Corporation through court-approved amalgamation schemes in 2010 and 2015. The company had previously paid stamp duty of Rs 5.82 lakh to Maharashtra State Stamp Authority for the same transaction. Hitech Corporation stated there is no material impact on its financial, operational, or other activities and plans to file an appeal against the order within prescribed timelines.",
            "Sentiment": "negative",
            "PublishDate": 1754399320102,
            "Source": "stock"
        },
        {
            "Title": "Hitech Corporation to Close PPMF Business Unit in Gujarat",
            "Summary": "Hitech Corporation has announced the closure of its PPMF (Plastic Processing Machinery Facility) business unit located in Gujarat. The company has stated that this closure is not expected to have a significant impact on its overall operations.",
            "Sentiment": "neutral",
            "PublishDate": 1742170336000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hitech Corporation to Close PPMF Business Unit in Gujarat",
            "Summary": "Hitech Corporation has announced the closure of its PPMF (Plastic Processing Machinery and Fabrication) business unit located in Gujarat. The company has stated that this closure is not expected to have a significant impact on its overall operations.",
            "Sentiment": "neutral",
            "PublishDate": 1741872279000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hitech Corporation to Acquire 100% Stake in Thriarr Polymers",
            "Summary": "Hitech Corporation has entered into an agreement to acquire a 100% stake in Thriarr Polymers. The acquisition cost is set to not exceed 300 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1740443063000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hitech Corporation to Acquire 100% Stake in Thriarr Polymers",
            "Summary": "Hitech Corporation has entered into an agreement to acquire a 100% stake in Thriarr Polymers. The acquisition cost is not expected to exceed 300 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1740397711000,
            "Source": "corporate_action"
        }
    ]
}