{
    "Symbol": "HITECHGEAR",
    "ISIN": "INE127B01011",
    "News": [
        {
            "Title": "Hi-Tech Gears Board Meet on Feb 12 for Q3FY26 Results",
            "Summary": "Hi-Tech Gears Limited has scheduled its Board of Directors meeting for February 12, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770134233151,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hi-Tech Gears Appoints New CFO in Leadership Reshuffle",
            "Summary": "Hi-Tech Gears Limited announces key leadership changes with Vinod Raheja appointed as new CFO while Kapil Rajora transitions to Chief Commercial Officer role effective January 14, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768309602346,
            "Source": "stocks"
        },
        {
            "Title": "Hi-Tech Gears Announces CFO Change & Leadership Reshuffle",
            "Summary": "The Hi-Tech Gears Limited appoints Vinod Raheja as new CFO while Kapil Rajora transitions to Chief Commercial Officer role. Board meeting held on January 13, 2026 approved key managerial personnel changes.",
            "Sentiment": "neutral",
            "PublishDate": 1768309327309,
            "Source": "stocks"
        },
        {
            "Title": "Hi-Tech Gears Reports Decline in Q2/H1 FY26 Financial Performance",
            "Summary": "Hi-Tech Gears Limited reported consolidated operational income of INR 2,407 million for Q2 FY26, down 2.3% year-over-year, with EBITDA falling 21.0% to INR 278 million. For H1 FY26, consolidated operational income declined 10.0% to INR 4,563 million, while EBITDA dropped 29.1% to INR 540 million. The company's profit after tax decreased 36.8% in Q2 and 49.6% in H1 compared to previous year. The India business continues in consolidation phase with focus on improving operational efficiency through equipment refurbishment and reliability enhancement. North American operations faced challenges from uncertain geo-political environment and customer wait-and-watch mode. Despite market volatility, the company won new business worth INR 860 million annualized and has 117 precision components under development across various segments.",
            "Sentiment": "negative",
            "PublishDate": 1762754595800,
            "Source": "earnings"
        },
        {
            "Title": "Hi-Tech Gears Reports Mixed Q2 Results with Standalone Profit, Consolidated Loss",
            "Summary": "Hi-Tech Gears Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported standalone revenue from operations of Rs 1,550.60 million and profit after tax of Rs 79.92 million. However, on a consolidated basis, the company recorded a loss after tax of Rs 268.47 million. For the half-year period, standalone revenue reached Rs 3,126.87 million with profit after tax of Rs 240.24 million, while consolidated operations showed revenue of Rs 4,585.98 million but a loss after tax of Rs 848.34 million. The company operates across three segments - India, Canada, and Others, with India contributing the majority of revenue at Rs 1,304.40 million for the quarter. The Board meeting was held on November 7, 2025, where these unaudited financial results were approved.",
            "Sentiment": "neutral",
            "PublishDate": 1762524490337,
            "Source": "earnings"
        },
        {
            "Title": "Hi-Tech Gears Gets NCLAT Hearing Postponed to December 16, Insolvency Stay Extended",
            "Summary": "The Hi-Tech Gears Limited announced that the National Company Law Appellate Tribunal (NCLAT) postponed its hearing from October 14 to December 16 due to time constraints. The tribunal continued the interim stay on the Corporate Insolvency Resolution Process (CIRP) that was originally granted on September 03, 2024. The case involves an appeal by company secretary Naveen Jain against Happy Forgings Ltd. and others. The company informed stock exchanges BSE and NSE about the development through a regulatory filing dated October 18.",
            "Sentiment": "neutral",
            "PublishDate": 1760772700978,
            "Source": "corporate_action"
        },
        {
            "Title": "Hi-Tech Gears Sets September 19, 2025 as Record Date for Rs. 5 Per Share Dividend",
            "Summary": "The Hi-Tech Gears Limited has fixed September 19, 2025 as the Record Date for determining shareholder eligibility for a dividend of Rs. 5 per equity share of Rs. 10 each (50%) for financial year 2024-25. The dividend is subject to approval at the company's 39th Annual General Meeting. The same date has also been set as the Cut-Off Date for determining shareholders eligible to vote at the AGM. The dividend was recommended by the Board of Directors.",
            "Sentiment": "positive",
            "PublishDate": 1755507799788,
            "Source": "corporate_action"
        },
        {
            "Title": "Hi-Tech Gears Seeks Reclassification of Dev Darshan Construction from Promoter Group to Public Category",
            "Summary": "Hi-Tech Gears Limited has submitted an application to BSE and NSE on August 14, 2025, seeking reclassification of Dev Darshan Construction Private Limited from 'Promoter Group' category to 'Public' category shareholder status. The application was made under Regulation 31A of SEBI (LODR) Regulations, 2015. Hi-Tech Gears trades on BSE with scrip code 522073 and on NSE with symbol HITECHGEAR.",
            "Sentiment": "neutral",
            "PublishDate": 1755184747069,
            "Source": "corporate_action"
        },
        {
            "Title": "Hi-Tech Gears Reports 57.9% Drop in Net Profit Despite 48% EBITDA Growth",
            "Summary": "Hi-Tech Gears Limited reported mixed quarterly results with total income from operations declining 16.3% to ₹2,200.94 crores compared to ₹2,630.39 crores in the same quarter last year. Net profit fell sharply by 57.9% to ₹59.98 crores from ₹142.37 crores, while earnings per share dropped to ₹3.19 from ₹7.58. However, EBITDA showed strong growth of 48% reaching ₹560.96 crores compared to ₹378.95 crores in the previous year. The unaudited financial results were reviewed by the Audit Committee and approved by the Board of Directors, with results published in newspapers and made available on stock exchange and company websites.",
            "Sentiment": "negative",
            "PublishDate": 1755069257981,
            "Source": "earnings"
        },
        {
            "Title": "Hi-Tech Gears Reports Decline in Q1 Financial Performance",
            "Summary": "Hi-Tech Gears reported Q1 EBITDA of 261 million rupees compared to 410 million rupees in the same period last year. The company's EBITDA margin decreased to 12.39% from 16.07% year-over-year. Consolidated net profit fell to 60 million rupees from 142 million rupees in the previous year's corresponding quarter. Revenue declined to 2.1 billion rupees from 2.55 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1754923272693,
            "Source": "earnings"
        },
        {
            "Title": "Hi-Tech Gears Gets Extended Stay on Insolvency Process, Next Hearing Set for October",
            "Summary": "The Hi-Tech Gears Limited received an update on its Corporate Insolvency Resolution Process (CIRP) from the National Company Law Appellate Tribunal (NCLAT). The tribunal heard the matter and scheduled the next hearing for October 14, 2025. The NCLAT has continued the interim stay on the CIRP process that was originally granted on September 3, 2024. The case involves Naveen Jain, Company Secretary/Shareholder of Hi-Tech Gears Limited, as appellant against Happy Forgings Ltd. and another respondent. An application for vacation of stay was listed, with the appellant's counsel seeking time to file a reply within three weeks.",
            "Sentiment": "neutral",
            "PublishDate": 1754041152403,
            "Source": "corporate_action"
        },
        {
            "Title": "Hi-Tech Gears Receives Reclassification Request from Promoter Group Entity",
            "Summary": "Hi-Tech Gears Limited received a request from Dev Darshan Construction Private Limited to reclassify from 'Promoter/Promoter Group' category to 'Public' category. Dev Darshan Construction, which currently holds no shares in Hi-Tech Gears, was previously classified as a promoter group entity because promoters Deep Kapuria and Veena Kapuria held 100% equity shares and directorship. In March 2025, they transferred their entire stake to Digvijay Kapuria and Pratibha Kapuria, who are not part of the promoter group, and resigned from directorship. Dev Darshan confirmed it meets regulatory requirements including holding less than 10% voting rights, having no control over company affairs, no special rights, no board representation, and no key managerial roles. Hi-Tech Gears will take necessary steps for the reclassification process.",
            "Sentiment": "neutral",
            "PublishDate": 1753966324468,
            "Source": "corporate_action"
        },
        {
            "Title": "Hi-Tech Gears Receives Reclassification Request from Promoter Group Entity",
            "Summary": "The Hi-Tech Gears Limited received a request from Dev Darshan Construction Private Limited to reclassify from 'Promoter/Promoter Group' category to 'Public' category. Dev Darshan Construction, which holds no shares in Hi-Tech Gears, was previously classified as a promoter group entity because promoters Deep Kapuria and Veena Kapuria held 100% equity shares and directorship. In March 2025, they transferred their entire stake to Digvijay Kapuria and Pratibha Kapuria, who are not part of the promoter group, and resigned from directorship. Dev Darshan confirmed it meets regulatory requirements including holding less than 10% voting rights, having no control over company affairs, no board representation, and no special rights. The company will take necessary steps in accordance with SEBI regulations for the reclassification process.",
            "Sentiment": "neutral",
            "PublishDate": 1753965684699,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hi-Tech Gears Limited Announces Major Leadership Restructuring with Five Key Appointments",
            "Summary": "Hi-Tech Gears Limited's Board of Directors approved multiple leadership changes during their July 23, 2025 meeting. The company re-appointed three existing leaders: Deep Kapuria as Executive Chairman, Pranav Kapuria as Managing Director, and Anuj Kapuria as Executive Director, all for three-year terms starting October 1, 2025. Additionally, two new appointments were made: Ramakrishnan Ramanathan as Additional Independent Director for five years and Vijay Mathur as Executive Director for three years, both effective July 24, 2025. Deep Kapuria is the founder and father of Pranav and Anuj Kapuria. Ramakrishnan brings 38 years of experience from Tata Motors Limited, while Vijay Mathur has nearly 40 years in finance and has been associated with the company for 35 years. All appointments are subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1753263485944,
            "Source": "corporate_governance"
        },
        {
            "Title": "HI-TECH GEARS Recommends Dividend of 5 Rupees per Share",
            "Summary": "HI-TECH GEARS has recommended a dividend of 5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748531913000,
            "Source": "result"
        },
        {
            "Title": "Hi-Tech Gears Reports Q4 Financial Results",
            "Summary": "Hi-Tech Gears announced its Q4 financial results. The company's EBITDA was 332 million rupees, down from 408.4 million rupees year-over-year. However, the EBITDA margin improved to 15.79% from 14.55% in the same period last year. Consolidated net profit for Q4 was 97 million rupees, compared to 178.3 million rupees year-over-year and 69 million rupees quarter-over-quarter. Revenue for Q4 stood at 2.1 billion rupees, down from 2.85 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1748531878000,
            "Source": "result"
        },
        {
            "Title": "The Hi-Tech Gears: Q3 Profit Plummets 53.92% YoY",
            "Summary": "The Hi-Tech Gears reported Q3 FY25 results with profit falling 53.92% YoY to ₹6.87 crore. Revenue decreased 24.86% YoY to ₹205.06 crore. Operating income down 58.9% YoY. EPS at ₹3.66, down 54.08% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1739653048000,
            "Source": "earnings"
        },
        {
            "Title": "Hi-Tech Gears Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Hi-Tech Gears has reported a decrease in its Q3 EBITDA, which fell to 267 million rupees from 408 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 13.32% from 15.22% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739450687000,
            "Source": "earnings"
        },
        {
            "Title": "HI-TECH GEARS Reports Decline in Q3 Consolidated Net Profit and Revenue",
            "Summary": "HI-TECH GEARS has reported a significant decrease in its third-quarter consolidated net profit, which fell to 69 million rupees from 149 million rupees year-over-year. The company also experienced a sequential decline from 95 million rupees in the previous quarter. Revenue for Q3 dropped to 2 billion rupees, down from 2.7 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739450607000,
            "Source": "earnings"
        },
        {
            "Title": "HI-TECH GEARS Reports Q2 FY24 Results with Exceptional Item",
            "Summary": "HI-TECH GEARS has reported its Q2 FY24 financial results. The company recorded an exceptional item of 772 million rupees in this quarter. The Profit Before Tax (PBT) for Q2 stood at 154 million rupees, compared to 75 million rupees in the same quarter last year, showing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731073518000,
            "Source": "result"
        },
        {
            "Title": "Hi-Tech Gears Reports Stable Q2 EBITDA with Improved Margin",
            "Summary": "Hi-Tech Gears announced its Q2 financial results. The company's EBITDA remained relatively stable at 352 million rupees compared to 351 million rupees in the same quarter last year. However, the EBITDA margin improved significantly, rising to 14.61% from 12.66% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731073463000,
            "Source": "result"
        },
        {
            "Title": "Hi-Tech Gears Reports Q2 Financial Results",
            "Summary": "Hi-Tech Gears announced its Q2 consolidated net profit of 95 million rupees, showing a significant decrease from 722 million rupees year-over-year, but an increase from 142 million rupees quarter-over-quarter. The company's Q2 revenue was reported at 2.4 billion rupees, down from 2.77 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1731073370000,
            "Source": "result"
        }
    ]
}