{
    "Symbol": "HLEGLAS",
    "ISIN": "INE461D01028",
    "News": [
        {
            "Title": "HLE Glascoat Q3FY26 Results: Revenue Up 26% YoY",
            "Summary": "HLE Glascoat reports standalone revenue of ₹16,423.71 lakhs in Q3FY26, up 26% YoY. Consolidated revenue reaches ₹32,656.67 lakhs, marking 41% growth despite exceptional expenses.",
            "Sentiment": "positive",
            "PublishDate": 1770726963574,
            "Source": "co_actions_results"
        },
        {
            "Title": "HLE Glascoat Board Meet Set for Feb 10 to Review Q3 Results",
            "Summary": "HLE Glascoat Limited has scheduled its board meeting for February 10, 2026, to consider and approve Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770037226778,
            "Source": "co_actions_results"
        },
        {
            "Title": "HLE Glascoat Receives Exchange Approval for Listing 11.89 Lakh Equity Shares from Amalgamation",
            "Summary": "HLE Glascoat Limited received approval from BSE and NSE for listing and trading of 11,89,259 equity shares of ₹2 each, arising from the amalgamation scheme with Kinam Enterprise Private Limited. The listing and trading of these shares will be effective from December 9, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765205845298,
            "Source": "corporate_action"
        },
        {
            "Title": "HLE Glascoat Reports 48.8% Revenue Growth to INR 351 Crores in Q2 FY26, Completes Omeras Acquisition",
            "Summary": "HLE Glascoat achieved consolidated revenue of INR 351 crores with 48.8% growth in Q2 FY26, though EBITDA margins compressed to 11.4% due to competitive pricing on previous orders and initial losses from newly acquired Omeras business. The company completed the Omeras Global acquisition through internal accruals, expanding into glass fused steel products and panels business, while maintaining a robust order book of INR 722 crores.",
            "Sentiment": "positive",
            "PublishDate": 1763553860875,
            "Source": "earnings"
        },
        {
            "Title": "HLE Glascoat Reports Strong Q2 Performance with 1,168% Profit Growth and Strategic Acquisitions",
            "Summary": "HLE Glascoat Limited announced its quarterly results for the quarter ended September 30, 2025. The company's standalone profit surged to ₹804.33 lakhs compared to ₹5.01 lakhs in the same quarter last year, representing a significant increase. Revenue from operations reached ₹19,307.63 lakhs versus ₹11,447.95 lakhs in the previous year quarter. For the half-year period, standalone profit was ₹2,345.47 lakhs compared to ₹147.96 lakhs last year. On a consolidated basis, the company reported quarterly profit of ₹1,619.73 lakhs against ₹78.77 lakhs in the prior year quarter. The National Company Law Tribunal approved the amalgamation of Kinam Enterprise Private Limited with HLE Glascoat, effective from August 7, 2023. The company also completed strategic acquisitions including HLE Surface Technologies GmbH and Omerastore GmbH through its subsidiary Thaletec GmbH. Basic earnings per share improved to ₹1.16 for the quarter compared to ₹0.01 in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762803655895,
            "Source": "earnings"
        },
        {
            "Title": "HLE Glascoat Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "HLE Glascoat reported quarterly results showing revenue growth to 3.51 billion rupees from 2.36 billion rupees year-over-year. However, net profit declined to 119.9 million rupees from 136.1 million rupees compared to the same period last year. EBITDA increased to 382.2 million rupees from 340.9 million rupees, while EBITDA margin compressed to 10.9% from 14.46% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1762772636895,
            "Source": "earnings"
        },
        {
            "Title": "HLE Glascoat Limited Appoints Vijay Saini as Vice President-Operations for Anand Unit",
            "Summary": "HLE Glascoat Limited appointed Mr. Vijay Saini as Vice President-Operations for their Anand Unit on October 13, 2025. Saini holds a bachelor's degree in mechanical engineering and brings 30 years of experience in manufacturing and operations, having previously worked with organizations including Plasser India, Wabtec, and Tatra trucks. He has demonstrated expertise in driving productivity, quality improvements, and people-centric operational excellence.",
            "Sentiment": "positive",
            "PublishDate": 1760343425445,
            "Source": "corporate_governance"
        },
        {
            "Title": "HLE Glascoat Limited Completes Amalgamation with Kinam Enterprise Private Limited",
            "Summary": "HLE Glascoat Limited has completed its amalgamation with Kinam Enterprise Private Limited after receiving approval from the National Company Law Tribunal, Ahmedabad Bench. The merger became effective on September 1, 2025, with an appointed date of August 7, 2023. Following the amalgamation, HLE Glascoat's authorized share capital increased to Rs. 27,60,00,000, comprising 12,50,00,000 equity shares of Rs. 2 each and 26,00,000 preference shares of Rs. 10 each. The company's Memorandum of Association has been amended accordingly to reflect these changes.",
            "Sentiment": "positive",
            "PublishDate": 1758737198404,
            "Source": "corporate_action"
        },
        {
            "Title": "HLE Glascoat Acquires OMERAS GmbH Assets for €2.75 Million to Expand into Infrastructure and Renewable Energy Markets",
            "Summary": "HLE Glascoat Limited completed the acquisition of specific assets of OMERAS GmbH and its subsidiary OMERAS Store GmbH for €2.75 million on August 18, 2025. The acquisition includes a 21,000 square meter manufacturing facility in Germany, equipment, machinery, the OMERAS brand, technical know-how, inventory, and key management personnel. OMERAS reported FY2024 revenue of €21.9 million with a 54.3% gross margin but posted a net loss of €0.46 million. The company has a €7 million order book and €28 million inquiry pipeline. HLE expects the deal to be EPS accretive within 2-3 quarters and targets FY2027 revenue of €20-25 million for OMERAS. The acquisition diversifies HLE's portfolio into infrastructure, architectural, and renewable energy applications, reducing dependence on chemical and pharmaceutical clients. Management plans to improve capacity utilization from below 50% and introduce OMERAS products to the Indian market. The deal positions HLE to capitalize on the European Green Deal's biogas investments and global water infrastructure spending projected to exceed $100 billion annually by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1756387342559,
            "Source": "order&deals"
        },
        {
            "Title": "HLE Glasscoat Targets Rs 1,500 Crore Revenue by FY27 Following Omeras Acquisition",
            "Summary": "HLE Glasscoat acquired assets of German company Omeras for €2.75 million (Rs 28 crore) through its subsidiary HLE Surface Technologies. The acquisition includes all shares of Omerastore GmbH and assets from Omeras GmbH, which specializes in enamelled metal products. The company expects the acquisition to add Rs 100 crore to topline in FY26 with modest profits, targeting double-digit EBITDA from the following year. Management confirmed targets of Rs 1,300 crore revenue in FY26 and Rs 1,500 crore in FY27 with 15% margins as realistic goals. The company is expanding into defense and aerospace sectors, having made progress on army vehicle projects after previously delivering diving support vessels to the Indian Navy. Cross-selling opportunities exist between Omeras' large glass-lined steel tanks and HLE's existing product range for Indian clients. HLE Glasscoat shares closed 4.9% lower at Rs 509.",
            "Sentiment": "positive",
            "PublishDate": 1755963900843,
            "Source": "order&deals"
        },
        {
            "Title": "HLE Glascoat's Subsidiary Completes Acquisition of Omeras GmbH Assets",
            "Summary": "HLE Surface Technologies GmbH, a wholly owned step-down subsidiary of HLE Glascoat Limited, completed the acquisition of specific assets from Omeras GmbH on August 18, 2025. The acquisition includes all shares of Omerastore GmbH. This transaction represents a material development following HLE Glascoat's previous disclosure dated August 14, 2025 regarding the same matter.",
            "Sentiment": "positive",
            "PublishDate": 1755520806202,
            "Source": "order&deals"
        },
        {
            "Title": "NCLT Approves Amalgamation of Kinam Enterprise with HLE Glascoat Limited",
            "Summary": "The National Company Law Tribunal (NCLT) Ahmedabad has approved the Scheme of Amalgamation between Kinam Enterprise Private Limited (transferor company) and HLE Glascoat Limited (transferee company). The order was issued on August 14, 2025, with an appointed date of August 7, 2023. Under the scheme, Kinam Enterprise will be dissolved without winding up, and all its assets, liabilities, and employees will transfer to HLE Glascoat Limited. HLE Glascoat's equity shares are listed on BSE and NSE with scrip code 522215 and symbol HLEGLAS. The scheme becomes effective upon filing with the Registrar of Companies, Ahmedabad. The Income Tax Department reported outstanding tax demands of Rs. 5.57 crores for HLE Glascoat Limited, while Kinam Enterprise has nil outstanding demands. Both companies' boards approved the amalgamation through resolutions dated February 13, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1755187295851,
            "Source": "corporate_action"
        },
        {
            "Title": "HLE Glascoat Limited Schedules Conference Call to Discuss Omeras GmbH Acquisition",
            "Summary": "HLE Glascoat Limited will hold a conference call on August 21, 2025, at 4:00 PM IST to discuss the acquisition of Omeras GmbH. The call will be led by Managing Director Himanshu Patel and Executive Directors Aalap Patel and Harsh Patel, along with the senior management team. Multiple access numbers are available for participants across different regions including India, Hong Kong, Singapore, USA, and UK. Pre-registration is required through a provided link.",
            "Sentiment": "neutral",
            "PublishDate": 1755181297233,
            "Source": "order&deals"
        },
        {
            "Title": "HLE Glascoat's German Subsidiary Acquires Assets of Omeras GmbH for €2.75 Million",
            "Summary": "HLE Surface Technologies GmbH, a wholly owned step-down subsidiary of HLE Glascoat Limited, has agreed to acquire specific assets of Omeras GmbH and all shares of Omerastore GmbH for €2.75 million through agreements dated August 13, 2025. The acquisition includes assets related to manufacturing and distributing glass lined and enameled panels, tanks, and facade claddings, along with consulting and installation services. Omeras generated consolidated revenue of €21.8 million in 2024, while Omerastore recorded sales revenue of €10.90 million. Omeras is currently under insolvency proceedings ordered by a German court on May 1, 2025, with debtor-in-possession management. The transaction has been approved by the creditors' committee and monitor. HLE Glascoat views this as a strategic move to strengthen its presence in Germany and expand into infrastructure segments including transport, tunnels, and renewable energy storage. The acquisition is expected to be completed within ten banking days from the effective date of August 13, 2025, subject to payment of the purchase consideration.",
            "Sentiment": "positive",
            "PublishDate": 1755139571966,
            "Source": "order&deals"
        },
        {
            "Title": "HLE Glascoat Reports Strong Q2 2025 Results, Announces Dividend and AGM Details",
            "Summary": "HLE Glascoat Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹16,426.02 lakhs compared to ₹11,126.36 lakhs in the same quarter last year. Standalone profit for the period increased to ₹1,541.55 lakhs from ₹143.15 lakhs year-over-year. On a consolidated basis, revenue from operations reached ₹28,394.68 lakhs versus ₹22,707.20 lakhs in the previous year, with consolidated profit rising to ₹1,786.50 lakhs from ₹542.02 lakhs. The Board declared a dividend of ₹1.10 per share for FY 2024-25, subject to shareholder approval. The 34th Annual General Meeting is scheduled for September 26, 2025, via video conferencing. Book closure dates are set from September 19-20, 2025, with the record date on September 20, 2025. Additionally, Thaletec GmbH, the company's wholly-owned German subsidiary, acquired 100% share capital of HLE Surface Technologies GmbH on July 28, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754914110930,
            "Source": "earnings"
        },
        {
            "Title": "HLE Glascoat Acquires German Engineering Equipment Subsidiary",
            "Summary": "HLE Glascoat has completed a strategic acquisition of a German subsidiary that specializes in engineering equipment. The company describes this move as part of efforts to strengthen its global footprint through the acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1753716903427,
            "Source": "order&deals"
        },
        {
            "Title": "HLE Glascoat's Subsidiary Thaletec Acquires German Engineering Equipment Company",
            "Summary": "Thaletec GmbH, a wholly owned subsidiary of HLE Glascoat Limited, has acquired 100% equity share capital of HLE Surface Technologies GmbH for 29,000 Euro. The acquisition involved purchasing 25,000 shares, making HLE Surface Technologies a wholly owned step-down subsidiary of HLE Glascoat. The acquired company, incorporated on April 30, 2025, operates in engineering equipment manufacturing and is based in Thale, Germany. The transaction was completed through cash consideration and does not constitute a related party transaction. The acquired entity will engage in engineering equipment business aligned with HLE Glascoat's existing activities.",
            "Sentiment": "neutral",
            "PublishDate": 1753716874225,
            "Source": "corporate_action"
        },
        {
            "Title": "Hle Glascoat Reports Q4 Financial Results and Dividend Announcement",
            "Summary": "Hle Glascoat has reported its Q4 consolidated net profit at 203 million rupees, compared to 99.3 million rupees year-over-year and 85 million rupees quarter-over-quarter. The company's Q4 revenue stood at 3.3 billion rupees, up from 3.1 billion rupees in the same quarter last year. Additionally, the company has recommended a dividend of 1.10 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747700305000,
            "Source": "default"
        },
        {
            "Title": "HLE Glascoat Reports Q4 Results and Dividend Recommendation",
            "Summary": "HLE Glascoat has announced its Q4 financial results. The company's consolidated net profit increased to 203 million rupees, up from 99.3 million rupees year-over-year and 85 million rupees quarter-over-quarter. Revenue rose to 3.3 billion rupees from 3.1 billion rupees year-over-year. EBITDA improved to 520 million rupees from 364.9 million rupees year-over-year, with the EBITDA margin expanding to 15.58% from 11.89%. Additionally, the company has recommended a dividend of 1.10 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747665332000,
            "Source": "result"
        },
        {
            "Title": "HLE Glascoat Reports Significant Increase in Q3 Net Profit",
            "Summary": "HLE Glascoat has announced its Q3 financial results. The company's consolidated net profit rose to 85 million rupees, up from 30 million rupees year-over-year and 127 million rupees quarter-over-quarter. However, revenue slightly decreased to 2.3 billion rupees from 2.4 billion rupees compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739233338000,
            "Source": "earnings"
        },
        {
            "Title": "HLE Glascoat Reports Improved Q3 EBITDA and Margin",
            "Summary": "HLE Glascoat has reported its Q3 financial results. The company's EBITDA increased to 256 million rupees, up from 247 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 11.10% from 10.31% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739190672000,
            "Source": "earnings"
        },
        {
            "Title": "HLE Glascoat Reports Q3 Financial Results",
            "Summary": "HLE Glascoat announced its Q3 consolidated financial results. The company reported a net profit of 85 million rupees, up from 30 million rupees year-over-year and 127 million rupees quarter-over-quarter. However, Q3 revenue decreased to 2.3 billion rupees from 2.4 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739190610000,
            "Source": "earnings"
        },
        {
            "Title": "HLE Glascoat Reports Q2 Financial Results and Partnership Dissolution",
            "Summary": "HLE Glascoat announced its Q2 financial results, reporting a consolidated net profit of 126.8 million rupees, up from 100 million rupees year-over-year and 34 million rupees quarter-over-quarter. The company's Q2 revenue increased to 2.36 billion rupees from 2.24 billion rupees in the previous year. Additionally, the company reported the dissolution of its partnership firm, Kinam Engineering Industries.",
            "Sentiment": "positive",
            "PublishDate": 1731371541000,
            "Source": "result"
        },
        {
            "Title": "HLE Glascoat Announces Dissolution of Partnership Firm",
            "Summary": "HLE Glascoat has reported the dissolution of Kinam Engineering Industries, a partnership firm associated with the company.",
            "Sentiment": "neutral",
            "PublishDate": 1731333585000,
            "Source": "corporate_action"
        },
        {
            "Title": "HLE Glascoat Reports Improved Q2 Financial Performance",
            "Summary": "HLE Glascoat has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 340.9 million rupees from 265 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 14.46% from 11.79% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1731329923000,
            "Source": "result"
        },
        {
            "Title": "HLE Glascoat Reports Q2 Revenue Increase",
            "Summary": "HLE Glascoat has reported a revenue of 2.36 billion rupees for the second quarter, showing an increase from 2.24 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1731329787000,
            "Source": "result"
        },
        {
            "Title": "HLE Glascoat Reports Q2 Profit Increase",
            "Summary": "HLE Glascoat has announced its Q2 consolidated net profit of 126.8 million rupees, showing a year-over-year increase from 100 million rupees and a quarter-over-quarter increase from 34 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1731329725000,
            "Source": "result"
        }
    ]
}