{
    "Symbol": "HLVLTD",
    "ISIN": "INE102A01024",
    "News": [
        {
            "Title": "HLV Limited Reports Q3FY26 Results & Board Changes",
            "Summary": "HLV Limited announced Q3FY26 financial results with net profit of Rs 687 lakhs and approved re-appointment of Independent Director Mr. Ashok Rajani for five years.",
            "Sentiment": "positive",
            "PublishDate": 1770884525352,
            "Source": "co_actions_results"
        },
        {
            "Title": "HLV Limited Board Meet Set for Feb 12 Q3FY26 Results",
            "Summary": "HLV Limited announces board meeting on February 12, 2026 to consider Q3FY26 unaudited financial results. Trading window closed from January 01, 2026 until 48 hours post announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1770220498346,
            "Source": "co_actions_results"
        },
        {
            "Title": "HLV Limited Wins Supreme Court Case on Land Dispute",
            "Summary": "Supreme Court dismisses ROAR's petition against HLV Limited regarding land lease disputes with AAI, ending long-standing litigation that began in 2013.",
            "Sentiment": "positive",
            "PublishDate": 1766141606926,
            "Source": "stocks"
        },
        {
            "Title": "HLV Limited Company Secretary Savitri Yadav Resigns to Pursue Career Opportunity",
            "Summary": "Ms. Savitri Yadav has resigned from her positions as Company Secretary, Compliance Officer and Nodal Officer at HLV Limited, with her resignation letter dated September 9, 2025, to pursue an alternate career opportunity outside the organization. She will be relieved from her responsibilities on November 30, 2025, affecting the company's key managerial personnel structure.",
            "Sentiment": "neutral",
            "PublishDate": 1764567434895,
            "Source": "corporate_governance"
        },
        {
            "Title": "HLV Limited Reports Q2 Loss, Announces Leadership Changes Amid Legal Disputes",
            "Summary": "HLV Limited posted a net loss of Rs 992 lakhs for Q2 2025 and appointed Ms. Sucheta Chaturvedi as Company Secretary effective December 1, replacing Ms. Savitri Yadav who resigned. The company faces ongoing legal disputes with Airports Authority of India over lease rentals totaling Rs 16,466 lakhs and continues operations on a going concern basis.",
            "Sentiment": "negative",
            "PublishDate": 1763114767701,
            "Source": "earnings"
        },
        {
            "Title": "HLV Limited Wins Supreme Court Case Against PBSAMP Projects in Land Sale Dispute",
            "Summary": "HLV Limited has successfully resolved a litigation dispute with PBSAMP Projects Pvt. Ltd regarding a land sale transaction. The company had entered into a Memorandum of Understanding in April 2014 to sell 3 acres and 28 guntas of land in Hyderabad for Rs. 85 crores. PBSAMP had advanced Rs. 15.5 crores but HLV could not complete the transaction due to inability to settle balance claims and obtain government permission under the Urban Land Ceiling Act. PBSAMP terminated the agreement and demanded refund with 21% annual interest. After arbitration proceedings resulted in an award of Rs. 35 crores against HLV, the company paid Rs. 44.42 crores to satisfy the award. However, PBSAMP challenged the execution court's order through the Telangana High Court. The Supreme Court of India has now set aside the High Court's order and confirmed the execution court's decision, ruling that no further amount is payable by HLV Limited to PBSAMP Projects.",
            "Sentiment": "positive",
            "PublishDate": 1758800516524,
            "Source": "stock"
        },
        {
            "Title": "HLV Limited Reports 18.2% Revenue Decline and Swings to Net Loss in Q1 FY2026",
            "Summary": "HLV Limited, an Indian hospitality company operating luxury hotels and resorts, reported total revenue of ₹52.33 crore in Q1 FY2026, declining 18.2% from ₹63.98 crore in Q1 FY2025. The company swung to a net loss of ₹18.32 crore compared to a net profit of ₹33.09 crore in the previous year. EBITDA margin contracted significantly to -3.5% from 6.7% in Q1 FY2025. The company's net worth stood at ₹626.38 crore as of June 30, 2025, while debt levels remained high, impacting profitability through interest costs. The decline was attributed to lower revenues, higher operating costs as a percentage of revenue, and elevated finance costs.",
            "Sentiment": "negative",
            "PublishDate": 1754889643434,
            "Source": "earnings"
        },
        {
            "Title": "HLV Limited Swings to Loss in Q1 FY2026 Amid Revenue Decline and Legal Disputes",
            "Summary": "HLV Limited reported a net loss of Rs 347 lakhs for Q1 FY2026, compared to a profit of Rs 162 lakhs in the same quarter last year. Total income declined 8.6% to Rs 4,397 lakhs from Rs 4,813 lakhs year-over-year. EBITDA dropped 73% to Rs 151.51 lakhs from Rs 566 lakhs, while earnings per share turned negative at Rs 0.05 versus Rs 0.02 previously. The hospitality company, which operates luxury hotels including The Leela Mumbai, faces ongoing legal disputes with Airports Authority of India regarding lease rentals and eviction proceedings for its Mumbai property. HLV has received an offer from AAI to renew the lease for 18,000 sq. mt. of land and is awaiting AAI's response to its representations. The company faces a contingent liability of Rs 80,705 lakhs claimed by AAI for another land parcel. Despite the challenges, management continues to prepare financial results on a going concern basis.",
            "Sentiment": "negative",
            "PublishDate": 1754732425568,
            "Source": "earnings"
        },
        {
            "Title": "HLV Limited's Supreme Court Petition Disposed, Litigation with Airports Authority of India to Continue",
            "Summary": "HLV Limited disclosed an update on its ongoing litigation with Airports Authority of India regarding lease termination and rent disputes. The Supreme Court disposed of the company's Special Leave Petitions challenging a Bombay High Court judgment, allowing proceedings to continue before the adjudicating authority under the AAI Act. The dispute involves AAI's termination of two leases and eviction proceedings initiated for recovery of arrears worth Rs. 39.80 crores. AAI has also increased lease rent for HLV's Mumbai hotel, with increased rentals amounting to Rs. 470 lakhs for one quarter and Rs. 11,950 lakhs for a specified period. The Supreme Court noted that both parties can present their submissions before the authority, and any adverse order would be appealable. No settlement has been reached.",
            "Sentiment": "neutral",
            "PublishDate": 1753275248980,
            "Source": "stock"
        },
        {
            "Title": "HLV Reports Q4 Financial Results",
            "Summary": "HLV has announced its financial results for the fourth quarter. The company reported a net profit of 107 million rupees, compared to 104 million rupees in the same period last year. Revenue for the quarter stood at 593 million rupees, slightly down from 597 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747904575000,
            "Source": "result"
        },
        {
            "Title": "HLV Reports Improved Q3 EBITDA and Margin",
            "Summary": "HLV has announced its Q3 financial results, showing an increase in EBITDA from 109 million rupees to 118 million rupees year-over-year. The company's EBITDA margin also improved, rising from 19.69% to 20.49% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739263859000,
            "Source": "earnings"
        },
        {
            "Title": "HLV Reports Q3 Revenue Increase",
            "Summary": "HLV has reported a revenue of 577 million rupees for the third quarter, showing an increase from 554 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739263837000,
            "Source": "earnings"
        },
        {
            "Title": "HLV Reports Increase in Q3 Net Profit",
            "Summary": "HLV Limited has reported a net profit of 103 million rupees for the third quarter, showing an increase from 95 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739263773000,
            "Source": "earnings"
        },
        {
            "Title": "HLV Reports Decline in Q2 EBITDA and Margin",
            "Summary": "HLV's Q2 EBITDA decreased to 29 million rupees from 44 million rupees year-over-year. The company's Q2 EBITDA margin also fell to 6.69% from 10.68% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731399652000,
            "Source": "result"
        },
        {
            "Title": "HLV Reports Increased Q2 Profit and Revenue",
            "Summary": "HLV has announced its financial results for the second quarter. The company's net profit increased to 35 million rupees, up from 20.2 million rupees in the same quarter last year. Revenue also saw growth, rising to 434 million rupees from 414 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731399521000,
            "Source": "result"
        }
    ]
}