{
    "Symbol": "HMAAGRO",
    "ISIN": "INE0ECP01024",
    "News": [
        {
            "Title": "HMA Agro Industries Q3FY26 Results Show Strong Growth",
            "Summary": "HMA Agro Industries reported consolidated revenue of ₹20,594.48 million for Q3FY26, up 41.55% YoY, with net profit rising to ₹665.79 million from ₹211.83 million in Q3FY25.",
            "Sentiment": "positive",
            "PublishDate": 1770913739957,
            "Source": "co_actions_results"
        },
        {
            "Title": "HMA Agro Industries Schedules Q3FY26 Earnings Call",
            "Summary": "HMA Agro Industries Limited announces earnings conference call on February 13, 2026 at 03:30 PM to discuss Q3FY26 and 9M FY26 unaudited financial results following announcement on February 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770297571611,
            "Source": "co_actions_results"
        },
        {
            "Title": "HMA Agro Industries Reconstitutes CSR Committee",
            "Summary": "HMA Agro Industries reconstitutes CSR Committee effective December 1, 2025, with Gulzar Ahmad as Chairman, Mohammad Mehmood Qureshi and Abhishek Sharma as members following Board approval on December 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767088970221,
            "Source": "stocks"
        },
        {
            "Title": "HMA Agro Industries Reports Record Q2 FY26 Results with Revenue Nearly Doubling",
            "Summary": "HMA Agro Industries achieved its strongest quarterly performance with standalone revenue reaching INR 21,491.68 million in Q2 FY26, nearly double the previous quarter's INR 13,666 million, while PAT surged to INR 482.34 million from INR 71.73 million. The buffalo meat exporter delivered record performance across all financial metrics including EBITDA of INR 725.22 million and consolidated revenue of INR 21,553.39 million with 48% year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1763466985108,
            "Source": "earnings"
        },
        {
            "Title": "HMA Agro Industries Reports Strong Q2 FY26 Growth with Revenue Surge of 97%",
            "Summary": "HMA Agro Industries Limited, a meat processing and export company, delivered exceptional quarterly results with standalone revenue growing 97.44% to Rs. 21,491.68 million in Q2 FY26 and EBITDA surging 303.90% to Rs. 723.22 million. The company operates across multiple manufacturing units with 1,472 MT daily production capacity, serving over 40 countries with 95% of sales from exports, positioning it strongly in the integrated meat processing sector.",
            "Sentiment": "positive",
            "PublishDate": 1763193071969,
            "Source": "earnings"
        },
        {
            "Title": "HMA Agro Industries Approves ₹70 Crore Export Credit Facilities and ₹1 Crore Commercial Card Programme",
            "Summary": "HMA Agro Industries Limited's Board of Directors approved two key financial proposals during a meeting held on November 1, 2025. The company approved availing Export Credit Limit and Working Capital Facilities from Canara Bank worth approximately ₹70 crores, which may include Export Packing Credit, Foreign Bills Discounting, Credit Exposure Limit, and other related facilities. Additionally, the Board approved a Commercial Card Programme from HDFC Bank with an overall credit facility limit of ₹1 crore in the company's name.",
            "Sentiment": "positive",
            "PublishDate": 1762001464184,
            "Source": "stock"
        },
        {
            "Title": "HMA Agro Industries Reports 57% Revenue Growth in Q1 FY26, Expands to Latin American Market",
            "Summary": "HMA Agro Industries Limited reported standalone revenue of INR 10,884 million for the quarter ended June 30, 2025, representing a 57% year-over-year increase from INR 6,933 million in the same quarter last year. The company's EBITDA grew to INR 179 million from INR 104.8 million, while PAT increased to INR 70.7 million from INR 24.5 million. At the consolidated level, revenue reached INR 11,226 million compared to INR 7,126 million in the previous year, though consolidated PAT declined to INR 5.9 million from INR 7.2 million. The growth was driven by robust export demand from Southeast Asian markets, Middle East, and West Africa, with exports comprising approximately 95% of total revenue. Buffalo-related products account for 85-90% of revenue. The company secured approval to supply products to Cuba, marking its first entry into Latin America. However, margins were impacted by higher raw material costs, particularly live buffalo prices, and increased freight charges due to geopolitical restrictions affecting shipping routes. The company operates at 45-65% capacity utilization for its main business and has planned capital expenditure of INR 7-8 crores for technology upgrades and minor capacity expansion.",
            "Sentiment": "positive",
            "PublishDate": 1755171185157,
            "Source": "earnings"
        },
        {
            "Title": "HMA Agro Industries Uploads Audio Recording of Quarterly Results Conference Call",
            "Summary": "HMA Agro Industries Limited has made available the audio recording of its conference call with analysts and investors discussing unaudited financial results for the quarter ended June 30, 2025. The conference call was conducted on August 13, 2025, and the audio recording is accessible on the company's website. The company communicated this information to both the Bombay Stock Exchange and National Stock Exchange of India as part of its disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1755089013627,
            "Source": "stock"
        },
        {
            "Title": "HMA Agro Industries Approves Q1 FY2026 Financial Results and Policy Amendments",
            "Summary": "HMA Agro Industries Limited's board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025, during a meeting held on August 12, 2025. The statutory auditor issued an unmodified opinion on the results. The board also approved amendments to the company's Prevention of Sexual Harassment policy based on Internal Complaints Committee recommendations to align with legal requirements and strengthen workplace safety. Additionally, the board amended the Insider Trading Code to comply with SEBI regulations notified on March 12, 2025. The company operates through multiple subsidiaries including wholly owned subsidiaries FNS Agro Foods Limited, Swastik Bone And Gelatines Private Limited, and others, with International Agro Foods Export being a 51% holding.",
            "Sentiment": "neutral",
            "PublishDate": 1754993642441,
            "Source": "earnings"
        },
        {
            "Title": "HMA AGRO Reports Mixed Q1 Results with Revenue Growth and Profit Decline",
            "Summary": "HMA AGRO announced its Q1 consolidated results showing net profit of 8 million rupees compared to 13.3 million rupees in the same quarter last year, representing a year-over-year decline. However, the company's revenue increased significantly to 11.2 billion rupees from 7.13 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754992918250,
            "Source": "earnings"
        },
        {
            "Title": "HMA Agro Industries Appoints Bhawna Jain as Independent Director for Five-Year Term",
            "Summary": "HMA Agro Industries Limited appointed Ms. Bhawna Jain as a Non-Executive Independent Director for five consecutive years from May 29, 2025 to May 28, 2030. The appointment requires shareholder approval at the company's 17th Annual General Meeting scheduled for August 29, 2025. Ms. Jain, aged 30, holds a Postgraduate degree and a Postgraduate Diploma in Business Administration with over three years of experience in secretarial work and compliance under the Companies Act, 2013. She specializes in corporate filings, statutory registers maintenance, and ROC compliance requirements. Ms. Jain is not related to any Director, Promoter, or Promoter Group of the company and is not debarred from holding directorship by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1754309936396,
            "Source": "corporate_governance"
        },
        {
            "Title": "HMA Agro Industries Approves Annual Report, Sets AGM Date, and Recommends Final Dividend",
            "Summary": "HMA Agro Industries Limited's Board of Directors approved several key decisions during their meeting on August 4, 2025. The board approved the Annual Report for FY 2024-25, including the Board's Report and Business Responsibility and Sustainability Report. The company scheduled its 17th Annual General Meeting for August 29, 2025, at 3:30 PM via video conferencing. The board recommended a final dividend of Rs. 0.30 per equity share (30%) for FY 2024-25, with August 22, 2025 set as the record date for dividend eligibility. Additionally, the board appointed M/s R.C. Sharma & Associates as Secretarial Auditor for five consecutive years starting from FY 2025-26, and approved the appointment of Ms. Bhawna Jain as Non-Executive Independent Director for a five-year term, subject to shareholder approval. The board also approved material related party transactions for FY 2025-26 and appointed the same firm as scrutinizer for the AGM voting process.",
            "Sentiment": "positive",
            "PublishDate": 1754303580589,
            "Source": "corporate_action"
        },
        {
            "Title": "HMA Agro Industries Schedules Board Meeting to Approve Annual Report and Consider Final Dividend",
            "Summary": "HMA Agro Industries Limited has scheduled a Board of Directors meeting on August 04, 2025, at 3:00 p.m. via video conferencing. The board will consider approving the Annual Report for FY 2024-25, including the Board's Report and Business Responsibility and Sustainability Report. The meeting will also finalize details for the 17th Annual General Meeting for the financial year ended March 31, 2025, including fixing the date, time, and venue. The board will consider recommending a final dividend for FY 2024-25 and fix the record date for eligible shareholders. Additional agenda items include appointing M/s R.C. Sharma & Associates as Secretarial Auditor for five consecutive years starting FY 2025-26, approving material related party transactions, appointing Ms. Bhawna Jain as Non-Executive Independent Director for five years, and appointing a scrutinizer for the AGM.",
            "Sentiment": "neutral",
            "PublishDate": 1753796127685,
            "Source": "corporate_action"
        },
        {
            "Title": "HMA Agro Industries to Secure 1 Billion Rupees Credit Facility from PNB",
            "Summary": "HMA Agro Industries is set to avail Export Packing Credit (EPC) facilities from Punjab National Bank (PNB) with an additional credit exposure of 1 billion rupees. This move suggests an expansion in the company's financial capacity, potentially to support its export operations.",
            "Sentiment": "positive",
            "PublishDate": 1748503897000,
            "Source": "result"
        },
        {
            "Title": "HMA AGRO Reports Q4 Financial Results",
            "Summary": "HMA AGRO has released its Q4 financial results. The company's EBITDA improved to a gain of 47 million rupees, compared to a loss of 31.7 million rupees in the same quarter last year. The EBITDA margin for Q4 was 0.31%. Revenue increased to 15 billion rupees from 13.9 billion rupees year-over-year. The consolidated net profit for Q4 rose to 132 million rupees, up from 9 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1748502835000,
            "Source": "result"
        },
        {
            "Title": "HMA Agro Industries: Subsidiary Converts Debt to Equity",
            "Summary": "HMA Agro Industries' subsidiary, HMA Natural Foods Private Limited, has allotted 30,37,000 equity shares at ₹10 each, converting a loan of ₹3,03,70,000 into equity. The company's stock price rose to ₹33.70, gaining 2.4% despite overall market weakness.",
            "Sentiment": "positive",
            "PublishDate": 1747385051000,
            "Source": "corporate_action"
        },
        {
            "Title": "HMA Agro Industries: New CEO Appointed Amid Corporate Actions",
            "Summary": "HMA Agro Industries announced multiple corporate actions including approval of related party transactions, conversion of loan to equity in subsidiary, CARE A2+ rating, and appointment of Gulzeb Ahmed as new CEO. The company's stock closed at ₹33.15, up 2.28%.",
            "Sentiment": "positive",
            "PublishDate": 1745340894000,
            "Source": "corporate_action"
        },
        {
            "Title": "HMA Agro Industries: Credit Rating Upgrade and Non-Large Corporate Status Confirmed",
            "Summary": "HMA Agro Industries announced it does not qualify as a Large Corporate according to SEBI criteria. The company received a CARE A2+ credit rating from CARE Ratings Ltd for FY2024-25. Total outstanding borrowings as of March 31, 2025, stand at ₹502.88 crore.",
            "Sentiment": "positive",
            "PublishDate": 1744624904000,
            "Source": "corporate_governance"
        },
        {
            "Title": "HMA Agro Industries Recognized as Five Star Export House",
            "Summary": "HMA Agro Industries has been recognized as a Five Star Export House by the Directorate General of Foreign Trade (DGFT). This designation is typically awarded to companies with significant export performance and indicates a high level of achievement in international trade.",
            "Sentiment": "positive",
            "PublishDate": 1743757881000,
            "Source": "corporate_action"
        },
        {
            "Title": "HMA Agro Industries: Small-Cap Stock Surges 7% Amid Market Decline",
            "Summary": "HMA Agro Industries shares jumped 7.31% to ₹30.09 on BSE despite overall market weakness. Care Ratings assigned 'CARE A2+' rating to the company's short-term bank facilities worth ₹850 crore, valid until March 21, 2025. The stock has faced significant declines over the past year, down 44% in 12 months.",
            "Sentiment": "neutral",
            "PublishDate": 1743482489000,
            "Source": "normal_news"
        },
        {
            "Title": "HMA Agro Industries Signs Agreements with Marya Frozen Agro Food Products",
            "Summary": "HMA Agro Industries has entered into agreements with Marya Frozen Agro Food Products. The specific details of these agreements are not provided in the given news snippet, but it suggests a business collaboration or partnership between the two companies in the agro-food sector.",
            "Sentiment": "neutral",
            "PublishDate": 1741158355000,
            "Source": "corporate_action"
        },
        {
            "Title": "HMA AGRO Reports Decline in Q3 EBITDA and Margin",
            "Summary": "HMA AGRO has reported a decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 276 million rupees from 411 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin decreased to 2.02% from 3.38% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738928932000,
            "Source": "earnings"
        },
        {
            "Title": "HMA AGRO Reports Mixed Q3 Financial Results",
            "Summary": "HMA AGRO has released its Q3 financial results. The company reported a net profit of 341 million rupees, down from 461 million rupees in the same quarter last year. However, revenue increased to 13.65 billion rupees from 12.5 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738928926000,
            "Source": "earnings"
        },
        {
            "Title": "HMA Agro Industries: Secures ₹160 Crore Credit Facility from HDFC Bank",
            "Summary": "HMA Agro Industries, a small-cap stock trading under ₹50, has received credit facilities worth ₹160 crore from HDFC Bank. The company's share price increased following this announcement.",
            "Sentiment": "positive",
            "PublishDate": 1735276015000,
            "Source": "corporate_action"
        },
        {
            "Title": "HMA Agro Industries: Board Approves ₹160 Crore Loan from HDFC Bank",
            "Summary": "HMA Agro Industries' board approved a ₹160 crore credit facility from HDFC Bank, subject to conditions. The company also announced a trading window closure from January 1, 2025, until 48 hours after Q3 FY25 results are declared.",
            "Sentiment": "positive",
            "PublishDate": 1735220074000,
            "Source": "corporate_action"
        },
        {
            "Title": "HMA Agro Industries Signs Agreement with Al Raiyan Export for Meat Processing",
            "Summary": "HMA Agro Industries has entered into an agreement with Al Raiyan Export for meat processing. This partnership likely aims to expand HMA Agro Industries' meat processing capabilities or market reach, potentially leading to increased production or export opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1733788615000,
            "Source": "corporate_action"
        },
        {
            "Title": "HMA Agro Industries Signs Agreement with Al Raiyan Export for Meat Processing",
            "Summary": "HMA Agro Industries has entered into an agreement with Al Raiyan Export for meat processing operations. This partnership suggests a potential expansion or enhancement of HMA Agro Industries' meat processing capabilities, possibly aiming to increase their market presence or production capacity.",
            "Sentiment": "positive",
            "PublishDate": 1733752675000,
            "Source": "corporate_action"
        },
        {
            "Title": "HMA Agro Industries: Stock Surges 10% Post Q2 Results",
            "Summary": "HMA Agro Industries Ltd share price hit the 10% upper circuit in morning trading after announcing Q2 financial results for the period ending September 2024.",
            "Sentiment": "positive",
            "PublishDate": 1731384273000,
            "Source": "result"
        },
        {
            "Title": "HMA AGRO Reports Decline in Q2 EBITDA and Margin",
            "Summary": "HMA AGRO has reported a significant decrease in its Q2 EBITDA, which fell to 280 million rupees from 523 million rupees year-over-year. The company's Q2 EBITDA margin also declined, dropping to 2.05% from 4.42% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731323959000,
            "Source": "result"
        },
        {
            "Title": "HMA Agro Reports 16% Revenue Growth in Q2",
            "Summary": "HMA Agro has reported a revenue of 13.7 billion rupees for the second quarter, compared to 11.8 billion rupees in the same period last year, representing a year-over-year growth of approximately 16%.",
            "Sentiment": "positive",
            "PublishDate": 1731323819000,
            "Source": "result"
        },
        {
            "Title": "HMA Agro Reports Q2 Net Profit Decline",
            "Summary": "HMA Agro Industries Limited has reported a net profit of 251 million rupees for the second quarter, down from 382 million rupees in the same period last year. This represents a year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1731323764000,
            "Source": "result"
        },
        {
            "Title": "HMA Agro Industries: Strategic MoU with Malaysian Entity Boosts Meat Exports",
            "Summary": "HMA Agro Industries Ltd signed an MoU with Perbadanan Kemajuan Pertanian Selangor (PKPS) to enhance frozen buffalo meat exports to Malaysia. The partnership aims to improve bilateral trade relations, collaborate on research projects, and develop processing and supply chains. The agreement is set for one year with potential for extension.",
            "Sentiment": "positive",
            "PublishDate": 1729491522000,
            "Source": "normal_news"
        },
        {
            "Title": "HMA Agro Industries Signs MOU with Malaysian Agricultural Development Corporation",
            "Summary": "HMA Agro Industries has entered into a Memorandum of Understanding (MOU) with Perbadanan Kemajuan Pertanian Selangor (PKPS), a Malaysian agricultural development corporation. The collaboration focuses on the supply of meat between HMA and PKPS.",
            "Sentiment": "positive",
            "PublishDate": 1729254761000,
            "Source": "corporate_action"
        },
        {
            "Title": "HMA Agro Industries: Temporary Production Halt at Aligarh Unit",
            "Summary": "<p>HMA Agro Industries Ltd has <span class='neutral'>temporarily suspended</span> operations at its Aligarh unit following a <b>routine inspection</b> by local authorities. The halt is due to <span class='neutral'>regulatory compliance requirements</span>. The company assures this is a <span class='neutral'>temporary measure</span> and does <span class='positive'>not impact overall operational capacity or financial stability</span>. Production will <span class='positive'>resume</span> once regulatory approvals are secured.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728651470000,
            "Source": "normal_news"
        },
        {
            "Title": "HMA Agro Industries Unit in Aligarh Temporarily Halted",
            "Summary": "<p>A unit of <span class='neutral'>HMA Agro Industries</span> located in <span class='neutral'>Talsapur Khurd, Mathura Bypass Road, Tehsil Kol, District Aligarh</span>, has been <span class='negative'><b>temporarily stopped</b></span> following a <span class='neutral'>routine inspection</span> by <span class='neutral'>local authorities</span>.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728645173000,
            "Source": "corporate_action"
        }
    ]
}