{
    "Symbol": "HMT",
    "ISIN": "INE262A01018",
    "News": [
        {
            "Title": "HMT Limited Q3 FY26 Results Show Mixed Performance",
            "Summary": "HMT Limited reported Q3 FY26 standalone profit of ₹670 lakhs vs ₹659 lakhs in Q3 FY25, while consolidated operations posted loss of ₹2724 lakhs. Nine-month standalone profit reached ₹2005 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1770640959848,
            "Source": "co_actions_results"
        },
        {
            "Title": "HMT Files Application to Strike Off Watches Subsidiary",
            "Summary": "HMT Limited has filed an application with the Ministry of Corporate Affairs to strike off its wholly owned subsidiary HMT Watches Limited from the Registrar of Companies records under Section 248 of the Companies Act, 2013.",
            "Sentiment": "neutral",
            "PublishDate": 1767625161640,
            "Source": "co_actions_results"
        },
        {
            "Title": "HMT Limited Fined Rs 6.08 Lakh Each by BSE and NSE for Board Composition Non-Compliance",
            "Summary": "HMT Limited received fines of Rs 6,08,880 each from BSE and NSE for non-compliance with SEBI regulations regarding board composition and committee constitution for the quarter ended September 30, 2025. The company lacked requisite Independent Directors on its Board and committees until July 14, 2025, and is now seeking waiver of fines while requesting the Administrative Ministry to appoint required Independent Directors.",
            "Sentiment": "negative",
            "PublishDate": 1764335259306,
            "Source": "corporate_governance"
        },
        {
            "Title": "HMT Limited Appoints M&A Associates as Secretarial Auditor for Five Years",
            "Summary": "HMT Limited announced the appointment of M&A Associates, Practicing Company Secretaries, as the company's Secretarial Auditor for a five-year term from FY 2025-26 to FY 2029-30. The appointment was approved by shareholders at the company's 72nd Annual General Meeting held on November 7, 2025. M&A Associates is a Corporate Secretarial and Legal Advisory Firm headquartered in Bangalore with a branch in Kolkata, led by founding partners Mr. Vivek Mishra and Mr. Anil Dubey. The firm offers comprehensive solutions for corporate compliance and legal requirements, serving clients across India and internationally.",
            "Sentiment": "neutral",
            "PublishDate": 1762764111783,
            "Source": "corporate_governance"
        },
        {
            "Title": "HMT Limited Reports Mixed Quarterly Results with Standalone Profit but Consolidated Loss",
            "Summary": "HMT Limited submitted its quarterly results for the three months ended June 30, 2025. On a standalone basis, the company reported a profit of Rs 1,214 lakhs compared to Rs 1,110 lakhs in the same quarter last year, with total income of Rs 2,117 lakhs. However, on a consolidated basis, HMT Group recorded a loss of Rs 2,777 lakhs against Rs 2,894 lakhs loss in the previous year quarter, with consolidated total income of Rs 3,728 lakhs. The company's earnings per share from continuing operations stood at Rs 0.34 on standalone basis but negative Rs 0.78 on consolidated basis. The results were approved by the Board of Directors and are subject to limited review by auditors.",
            "Sentiment": "neutral",
            "PublishDate": 1755075320090,
            "Source": "earnings"
        },
        {
            "Title": "HMT Reports Q4 Net Loss of 358 Million Rupees Against Previous Year's Profit",
            "Summary": "HMT posted a consolidated net loss of 358 million rupees in Q4, contrasting sharply with a profit of 26.41 billion rupees in the same quarter of the previous year. The company's Q4 revenue declined to 398 million rupees from 489 million rupees year-over-year, representing a decrease in both profitability and top-line performance.",
            "Sentiment": "negative",
            "PublishDate": 1753275302388,
            "Source": "earnings"
        },
        {
            "Title": "HMT Limited Reports Rs 1,610 Lakhs Profit for FY2025 Despite Auditor Qualifications",
            "Summary": "HMT Limited reported total income of Rs 8,515 lakhs and profit of Rs 1,610 lakhs from continuing operations for FY2025. The company's standalone results showed revenue from operations of Rs 2,617 lakhs for the year. However, statutory auditors issued qualified opinions on both standalone and consolidated financial statements, citing issues including inventory valuation discrepancies, non-compliance with expected credit loss models, lack of external confirmations for party balances, and GST reconciliation problems. The consolidated results showed a loss of Rs 14,306 lakhs from continuing operations. The company's networth stands at Rs 47,493 lakhs on standalone basis, while consolidated networth shows negative Rs 1,89,790 lakhs, indicating complete erosion of the HMT Group's networth.",
            "Sentiment": "negative",
            "PublishDate": 1753275152637,
            "Source": "earnings"
        },
        {
            "Title": "HMT Reports Increased Net Loss in Q3",
            "Summary": "HMT has reported a consolidated net loss of 512.8 million rupees for the third quarter, compared to a loss of 316.7 million rupees in the same period last year. The company's revenue decreased to 291.9 million rupees from 322.6 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739516448000,
            "Source": "earnings"
        },
        {
            "Title": "HMT Reports Reduced Q2 Loss and Increased Revenue",
            "Summary": "HMT announced its Q2 financial results, showing a reduced net loss of 271 million rupees compared to a loss of 288 million rupees in the same quarter last year. The company's revenue increased to 416 million rupees from 362 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731586548000,
            "Source": "result"
        }
    ]
}