{
    "Symbol": "HMVL",
    "ISIN": "INE871K01015",
    "News": [
        {
            "Title": "HMVL Issues Corrigendum to Postal Ballot Notice",
            "Summary": "Hindustan Media Ventures Limited issued a corrigendum to its January 27, 2026 postal ballot notice, appointing new scrutinizers following the demise of the original scrutinizer.",
            "Sentiment": "neutral",
            "PublishDate": 1770742526513,
            "Source": "stocks"
        },
        {
            "Title": "HMVL Seeks Shareholder Approval for MD Appointment",
            "Summary": "Hindustan Media Ventures Limited initiates postal ballot for appointing Shri Sameer Singh as Managing Director with Rs. 243 lakhs annual basic salary, effective March 1, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770124525898,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Media Q3 EBITDA Turns Negative at ₹7.6M Loss",
            "Summary": "Hindustan Media Ventures reported EBITDA loss of ₹7.60 million in Q3 compared to gain of ₹18.00 million in previous year, marking significant operational decline.",
            "Sentiment": "negative",
            "PublishDate": 1769501657934,
            "Source": "co_actions_results"
        },
        {
            "Title": "HMVL Board Meet on Jan 27 for Q3FY26 Results",
            "Summary": "Hindustan Media Ventures Limited has scheduled its board meeting for January 27, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed until January 29, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768896740807,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mathew Cyriac and Elimath Advisors Increase Stake in Hindustan Media Ventures to 6.51%",
            "Summary": "Mathew Cyriac and Elimath Advisors Private Limited (acting as persons in concert) acquired 9,42,570 shares of Hindustan Media Ventures Limited through open market transactions, increasing their combined holding from 5.23% to 6.51%. The disclosure was made following the addition of Elimath Advisors as a person acting in concert with Mathew Cyriac, with the transaction involving both purchases and sales totaling 1.28% change in shareholding.",
            "Sentiment": "neutral",
            "PublishDate": 1763530259082,
            "Source": "corporate_action"
        },
        {
            "Title": "HT Media Reports 4% Revenue Growth and 33% EBITDA Jump in Q2 FY26",
            "Summary": "HT Media posted consolidated revenue of INR 499 crores (up 4% YoY) with EBITDA rising 33% to INR 44 crores, driven by strong Print business performance with 10% ad revenue growth and 500 basis points margin expansion. The company took a INR 37.76 crore impairment charge primarily related to Radio business investments, while Digital segment losses increased to INR 30 crores due to OTT scaling costs.",
            "Sentiment": "positive",
            "PublishDate": 1763477913003,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Media Ventures Reports Quarterly Results and Approves Rs 16.22 Crore Investment in AI Growth",
            "Summary": "Hindustan Media Ventures Limited approved its quarterly financial results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of Rs 19.87 crore for the quarter compared to Rs 18.29 crore in the previous quarter and Rs 17.19 crore in the same quarter last year. The Board also approved an investment of up to Rs 16.22 crore in AI Growth Private Limited through equity shares or convertible preference shares. AI Growth operates platforms for fixed income investments and debt financing solutions, with reported turnover of Rs 21.24 crore in FY2024, Rs 12.80 crore in FY2023, and Rs 0.62 crore in FY2022. The investment is aimed at capital returns and leveraging media assets, with completion targeted by September 2030.",
            "Sentiment": "neutral",
            "PublishDate": 1762761865937,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Media Ventures Reports Mixed Q2 Results with Revenue Growth and Profit Decline",
            "Summary": "Hindustan Media Ventures reported Q2 net profit of 117 million rupees, down from 139 million rupees in the same quarter last year. The company's Q2 revenue increased to 1.99 billion rupees compared to 1.72 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762760696959,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Media Ventures to Invest ₹7.6 Crore in Canada-Based XCM Technologies",
            "Summary": "Hindustan Media Ventures plans to invest up to ₹7.6 crore in XCM Technologies (Toyow), a Canada-based company operating in the blockchain and NFTs space. The investment will be made through equity or Compulsorily Convertible Preference Shares (CCPS).",
            "Sentiment": "positive",
            "PublishDate": 1755782528733,
            "Source": "stock"
        },
        {
            "Title": "HT Media Group Reports 6% Revenue Growth to INR 451 Cr in Q1 FY26, Print Business Drives Performance",
            "Summary": "HT Media Group reported consolidated revenues of INR 451 crores for Q1 FY26, representing 6% year-on-year growth. The company posted a net loss of INR 11 crores, showing 59% improvement compared to the previous year. Print business led performance with 8% revenue growth to INR 324 crores, driven by 17% increase in advertising revenues to INR 255 crores. English segment advertising revenue grew 19% to INR 140 crores, while Hindi segment achieved 14% growth to INR 116 crores. However, circulation revenues declined due to pricing discounts aimed at recruiting new readers. Radio business faced pressure with revenues dropping to INR 31 crores from INR 36 crores previously, posting negative 21% margins. Digital segment showed strong momentum with 21% revenue growth to INR 56 crores, though margins remained negative at 38%. The company maintains healthy net cash position of INR 976 crores. Management highlighted strong performance in education, real estate, and BFSI advertising segments, while noting government advertising normalized after election-related restrictions in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755013343280,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Media Ventures Reports 6% Revenue Growth in Q1 FY2025-26",
            "Summary": "Hindustan Media Ventures Limited reported consolidated revenue of INR 451 crore for the quarter ended June 30, 2025, representing a 6% year-over-year increase from INR 427 crore. The company's EBITDA improved 33% to INR 10 crore, while losses narrowed significantly with PAT improving 59% to a loss of INR 11 crore compared to a loss of INR 28 crore in the previous year. The Print business drove growth with advertising revenue rising 17% to INR 255 crore, though circulation revenue declined 8% to INR 51 crore. Print English advertising revenue grew 19% year-over-year to INR 140 crore, while Print Hindi advertising revenue increased 14% to INR 116 crore. The Radio segment faced challenges with revenue declining 13% to INR 31 crore and operating losses widening. Digital business showed positive momentum with revenue growing 21% to INR 56 crore, though the segment remained loss-making. The company maintained a strong cash position of INR 976 crore. Chairperson Shobhana Bhartia noted strong growth in print advertising revenue and steady progress in digital platforms including Mosaic, Shine and OTTplay.",
            "Sentiment": "positive",
            "PublishDate": 1754384690622,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Media Ventures Reports Strong Q1 Performance with Net Profit Surge",
            "Summary": "Hindustan Media Ventures delivered strong quarterly results with consolidated net profit jumping to 102 million rupees compared to 5 million rupees in the same period last year. The company's revenue also grew to 1.83 billion rupees from 1.62 billion rupees year-over-year, indicating improved operational performance across the business.",
            "Sentiment": "positive",
            "PublishDate": 1754294012394,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Media Ventures Reports Significant Q4 EBITDA and Profit Growth",
            "Summary": "Hindustan Media Ventures announced its Q4 financial results. The company's EBITDA increased to 517 million rupees from 81 million rupees year-over-year. The EBITDA margin improved to 25.69% from 4.31% in the same period. Net profit rose to 452 million rupees from 111 million rupees year-over-year. Revenue for Q4 grew to 2 billion rupees from 1.88 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747641007000,
            "Source": "result"
        },
        {
            "Title": "Hindustan Media Ventures Reports Q3 EBITDA Profit",
            "Summary": "Hindustan Media Ventures has reported a significant turnaround in its Q3 financial performance. The company posted an EBITDA profit of 18 million rupees, compared to a loss of 152 million rupees in the same quarter of the previous year. The Q3 EBITDA margin was reported at 0.92%.",
            "Sentiment": "positive",
            "PublishDate": 1738568359000,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Media Ventures Reports Q3 Profit Turnaround",
            "Summary": "Hindustan Media Ventures has reported a significant improvement in its financial performance for the third quarter. The company posted a net profit of 180 million rupees, compared to a loss of 10 million rupees in the same period last year. Revenue also saw an increase, rising to 1.97 billion rupees from 1.8 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738568253000,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Media Ventures to Invest in Home Interior Startup",
            "Summary": "Hindustan Media Ventures has announced plans to invest 69.9 million rupees in Idecorwala Spacefold Interiortech Labs, a company operating in the home interior industry.",
            "Sentiment": "positive",
            "PublishDate": 1731336029000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Media Ventures Reports Significant Q2 EBITDA Improvement",
            "Summary": "Hindustan Media Ventures has reported a substantial improvement in its Q2 EBITDA, turning a previous loss into a gain. The company's EBITDA for the quarter reached 217 million rupees, compared to a loss of 42 million rupees in the same period last year. Additionally, the Q2 EBITDA margin was reported at 12.61%.",
            "Sentiment": "positive",
            "PublishDate": 1730102095000,
            "Source": "result"
        },
        {
            "Title": "Hindustan Media Ventures Reports Q2 Revenue Growth",
            "Summary": "Hindustan Media Ventures has reported a revenue of 1.72 billion rupees for the second quarter, compared to 1.6 billion rupees in the same period last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730101584000,
            "Source": "result"
        },
        {
            "Title": "Hindustan Media Ventures Reports Profit in Q2",
            "Summary": "Hindustan Media Ventures has reported a net profit of 139 million rupees in the second quarter, compared to a loss of 63 million rupees in the same period last year. This represents a significant turnaround in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1730101557000,
            "Source": "result"
        }
    ]
}