{
    "Symbol": "HNDFDS",
    "ISIN": "INE254N01026",
    "News": [
        {
            "Title": "Hindustan Foods' Auditor Converts to LLP Structure",
            "Summary": "Hindustan Foods Limited announces conversion of statutory auditor M S K A & Associates to LLP format effective January 13, 2026, with no change to existing audit engagement.",
            "Sentiment": "neutral",
            "PublishDate": 1768570039795,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Foods Receives ₹62.72L Tax Demand Order",
            "Summary": "Hindustan Foods Limited received a tax demand order of ₹62.72 lakh from Tamil Nadu Commercial Taxes Department for alleged excess Input Tax Credit claims in FY 2021-22.",
            "Sentiment": "negative",
            "PublishDate": 1766563211773,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Foods Limited Reports Full Utilization of Rs 377.50 Crore Warrant Proceeds",
            "Summary": "Hindustan Foods Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing complete utilization of proceeds from its preferential issue of convertible warrants. The company revised its total cost of objects to Rs 377.50 crore from Rs 399.99 crore due to cancellation of 5,32,009 warrants by one investor who did not exercise conversion option. During the quarter, the company deployed Rs 4.00 crore towards acquiring 24,643 compulsorily convertible preference shares of Asar Green Kabadi Private Limited (25.07% stake), transferred Rs 1.03 crore for evaluation of ice-cream cone manufacturing business, and utilized Rs 45.99 crore for general corporate purposes including vendor payments for raw materials. The funds were allocated across inorganic growth opportunities, greenfield and brownfield projects for the company and its subsidiary, with unused proceeds invested in fixed deposits with HDFC Bank earning 5.5% to 7.5% returns. CARE Ratings Limited, the monitoring agency, reported no deviations from stated objects and confirmed all proceeds were utilized as per the revised cost structure approved by shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1762966740881,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Foods Limited Reports Quarterly Results for Quarter Ended September 30, 2025",
            "Summary": "Hindustan Foods Limited's Board of Directors approved unaudited consolidated and standalone financial results for the quarter and half year ended September 30, 2025. The company operates primarily in contract manufacturing business. On a standalone basis, revenue from operations was Rs. 733.23 crores for the quarter, with profit after tax of Rs. 30.61 crores. Basic earnings per share stood at Rs. 2.59. The company acquired 25.07% stake in Asar Green Kabadi Private Limited for Rs. 5 crores in August 2025. The company also granted 1,47,100 stock options under ESOP Scheme 2025. Total assets increased to Rs. 2,423.24 crores as of September 30, 2025 compared to Rs. 1,857.50 crores in March 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762954583647,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Foods Reports 54% Jump in Q2 Net Profit to 352.3 Million Rupees",
            "Summary": "Hindustan Foods delivered strong quarterly results with consolidated net profit rising to 352.3 million rupees compared to 228.9 million rupees in the same period last year. Revenue increased to 10.39 billion rupees from 8.83 billion rupees year-over-year. EBITDA grew to 858 million rupees from 699 million rupees, while EBITDA margin improved to 8.26% from 7.91% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762951730418,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Foods Subsidiary Acquires Ice-Cream Cone Manufacturing Facilities for ₹26.25 Crore",
            "Summary": "Hindustan Foods' subsidiary HFL Consumer Products is acquiring two ice-cream cone manufacturing facilities located in Nashik through a slump sale transaction valued at ₹26.25 crore. The acquisition is part of the company's strategy to expand into contract manufacturing operations.",
            "Sentiment": "positive",
            "PublishDate": 1762857845778,
            "Source": "order&deals"
        },
        {
            "Title": "Hindustan Foods Limited Receives IND A+ Rating with Stable Outlook from India Ratings",
            "Summary": "Hindustan Foods Limited announced that India Ratings and Research has re-affirmed/assigned an 'IND A+' issuer rating for the company's various bank loan facilities. The rating comes with a stable outlook. The instrument-wise rating for bank loan facilities is IND A+/Stable/IND A1+. The rating letter was received on October 24, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761320198304,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Foods Board Approves ₹30 Crore Investment for Ice-Cream Cone and Sleeve Printing Business Acquisition",
            "Summary": "Hindustan Foods' board has approved a ₹30 crore investment through its wholly owned subsidiary to acquire ice-cream cone and sleeve printing businesses. The company indicated that additional discussions are required before making a final decision on the acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1760521508517,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Foods Limited Conducts Shareholder Meeting to Approve Scheme of Arrangement",
            "Summary": "Hindustan Foods Limited held a meeting of equity shareholders on October 15, 2025, to approve a Scheme of Arrangement between Avalon Cosmetics Private Limited and Vanity Case India Private Limited. The meeting was conducted via video conferencing as per NCLT directions. The company had 71,101 shareholders as of the cut-off date October 8, 2025. A total of 50 shareholders attended the meeting, with 8 corporate representations received for 5,37,05,598 equity shares representing 44.95% of capital. The meeting was chaired by Mr. Shashi Kumar Kalathil, appointed by NCLT. Remote e-voting was available from October 12-14, 2025, with additional voting facility during the meeting. The voting results will be declared within two working days and communicated to stock exchanges where the company is listed.",
            "Sentiment": "neutral",
            "PublishDate": 1760519865080,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Zinc Shares Surge 5% as Silver Prices Hit Record Highs",
            "Summary": "Hindustan Zinc shares gained up to 5% and became one of the top gainers on the Nifty 500 index, breaking a three-day losing streak. The surge coincided with silver prices reaching record levels, gaining over 35% in the past year and over 5% in the last month. Global silver prices are trading around $40, while domestic MCX silver prices also hit record highs. The US Geological Survey has proposed adding silver to the Critical Minerals list. Hindustan Zinc, a subsidiary of Vedanta, is among the top five global silver producers and the only listed silver play in India. The company's silver production declined in FY25 but management has guided for recovery to 700 tonnes in FY26. Management expects silver prices to reach $41-$42 per ounce by 2026 and is considering value unlocking plans for 2026. Trading volumes surged to 40 lakh shares compared to the 20-day average of 6 lakh shares. The stock broke above its 50-day moving average of ₹433 and closed 3.9% higher at ₹435.8. Vedanta holds a 61.84% stake while the government maintains over 25% ownership.",
            "Sentiment": "positive",
            "PublishDate": 1756704678971,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Foods Acquires 25.07% Stake in Asar Green Kabadi for ₹5 Crore",
            "Summary": "Hindustan Foods has acquired a 25.07% stake in Asar Green Kabadi Pvt. Ltd. for ₹5 crore. This acquisition marks the company's entry into the waste management and recycling sector.",
            "Sentiment": "positive",
            "PublishDate": 1755788403880,
            "Source": "order&deals"
        },
        {
            "Title": "Hindustan Foods Reports Record Quarterly Profit with 17% PAT Growth in Q1 FY26",
            "Summary": "Hindustan Foods Limited, a contract manufacturer for FMCG products, delivered strong financial performance with total income growing 15% to INR 998 crores and PAT increasing 17% to INR 32 crores, marking its highest ever quarterly profit. EBITDA rose 10% to INR 84 crores while the net debt-to-equity ratio improved to 0.65. The company achieved record production across Beverage, OTC Pharma, and Home Care units, with its Lucknow Ice Cream facility reaching peak capacity and the new Nashik Ice Cream plant commencing production. The Footwear business posted its highest ever monthly sales in June. Management remains confident about achieving FY26 and FY27 targets despite challenges from global trade tensions affecting the Footwear segment and seasonal variations impacting Ice Cream and Beverage demand. The company is investing INR 200 crores in North Ice Cream facility expansion and INR 50 crores in Shoe business expansion, targeting INR 2,000 crore gross block by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1755515427582,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Foods Limited Makes Q1 FY2026 Earnings Call Recording Available",
            "Summary": "Hindustan Foods Limited conducted an analyst and investor conference call on August 11, 2025, to discuss the company's performance for the quarter ended June 30, 2025. The call included management commentary on quarterly performance followed by an interactive question and answer session. The audio recording of the conference call has been made available on the company's website. Hindustan Foods Limited is part of the Vanity Case Group, operates in the FMCG/Food Processing industry, and is recognized as a Two Star Export House by the Government of India.",
            "Sentiment": "neutral",
            "PublishDate": 1754916934677,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Foods Limited Reports Record Quarterly Profits with 17% PAT Growth in Q1FY26",
            "Summary": "Hindustan Foods Limited announced its quarterly results for the period ended June 30, 2025, showing strong financial performance. On a consolidated basis, total income increased 15% to Rs 998 crores compared to Rs 871 crores in the same quarter last year. EBITDA grew 10% to Rs 84 crores from Rs 76 crores, while profit before tax rose 16% to Rs 42 crores from Rs 36 crores. Profit after tax increased 17% to Rs 32 crores from Rs 27 crores year-over-year. The company's earnings per share improved to Rs 2.69 from Rs 2.38 in the previous year quarter. During the quarter, the company converted warrants into equity shares, allotting 19,79,349 shares to two allottees, while 5,32,009 warrants lapsed resulting in forfeiture of Rs 7.50 crores. The contract manufacturing company operates across various FMCG categories and reported operational progress including the start of operations at its greenfield ice cream plant in Nashik and record production at its Lucknow facility.",
            "Sentiment": "positive",
            "PublishDate": 1754654605686,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Foods Limited Receives BSE Advisory Letter for Inadvertent Promoter Information Submission",
            "Summary": "Hindustan Foods Limited received an advisory letter from BSE regarding an inadvertent submission of promoter information related to a corporate restructuring scheme involving Vanity Case India Private Limited. The company had incorrectly submitted a list of promoters for VCIPL that included V.S.Dempo Holdings Private Limited, Soiru Dempo Management Holding Private Limited, and Nagesh Dempo Company Private Limited, who collectively held 43.24% of VCIPL shares. The correct promoter list for VCIPL includes only Asha Ramanlal Kothari, Sameer Ramanlal Kothari, and Aditi Kothari. The scheme involves demerger of Avalon Cosmetics Private Limited's Contract Manufacturing Business into Hindustan Foods Limited and amalgamation of VCIPL with Hindustan Foods Limited. BSE noted that the incorrectly listed entities are already promoters in Hindustan Foods Limited and will continue as promoters post-scheme. The company stated there is no material impact on its financials, operations, or other activities. BSE advised the company to exercise due diligence in future submissions and warned that repetition of such violations will be viewed seriously.",
            "Sentiment": "negative",
            "PublishDate": 1754400288465,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Foods: Q4 Net Profit Surges 34%, Revenue Up 28%",
            "Summary": "Hindustan Foods reported a 33.9% YoY increase in Q4 FY25 net profit to ₹30.8 crore. Revenue rose 27.7% to ₹933 crore, driven by strong demand in seasonal categories. The shoe business achieved operational profitability for the first time. The company also approved acquisition of a minority stake in The Kabadiwala, a plastic scrap recycling firm.",
            "Sentiment": "positive",
            "PublishDate": 1747659532000,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Foods Reports Q4 Profit and Revenue Growth",
            "Summary": "Hindustan Foods announced its Q4 financial results. The company's consolidated net profit increased to 308 million rupees, up from 229.4 million rupees year-over-year and 287 million rupees quarter-over-quarter. Revenue for Q4 rose to 9.3 billion rupees, compared to 7.31 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747654891000,
            "Source": "result"
        },
        {
            "Title": "Hindustan Foods Launches Phase 1 of New Ice Cream Facility in Nashik",
            "Summary": "Hindustan Foods has announced the commencement of operations for Phase 1 of its new ice cream manufacturing facility located in Nashik. This development marks a significant expansion in the company's production capabilities in the ice cream segment.",
            "Sentiment": "positive",
            "PublishDate": 1746403565000,
            "Source": "default"
        },
        {
            "Title": "Hindustan Foods Begins Operations at New Ice Cream Facility",
            "Summary": "Hindustan Foods has announced the commencement of operations for Phase 1 of its new ice cream manufacturing facility located in Nashik.",
            "Sentiment": "positive",
            "PublishDate": 1746184968000,
            "Source": "default"
        },
        {
            "Title": "Hindustan Foods Receives NSE Approval for Scheme of Arrangement",
            "Summary": "Hindustan Foods Limited has received an observation letter from the National Stock Exchange (NSE) with 'No Adverse Observations' regarding their proposed scheme of arrangement. This approval is a significant step in the company's corporate restructuring process, indicating that the NSE has not found any major issues with the proposed plan.",
            "Sentiment": "positive",
            "PublishDate": 1740987862000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Foods Reports Improved Q3 EBITDA and Margin",
            "Summary": "Hindustan Foods has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 733 million rupees from 567 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 8.32% from 7.80% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738931391000,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Foods Reports Strong Q3 Financial Results",
            "Summary": "Hindustan Foods has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 287 million rupees from 220 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 8.8 billion rupees compared to 7.3 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1738931387000,
            "Source": "earnings"
        },
        {
            "Title": "Hindustan Foods Subsidiary to Acquire Manufacturing Facility for 295 Million Rupees",
            "Summary": "Hindustan Foods Limited has announced that its subsidiary, HMPL, has executed a Business Transfer Agreement (BTA) with MMG. As part of this agreement, the company will acquire MMG's manufacturing facility for a sum of 295 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1736122194000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Foods Subsidiary to Acquire Manufacturing Facility",
            "Summary": "Hindustan Foods Limited's subsidiary, HMPL, has executed a Business Transfer Agreement (BTA) with MMG to acquire their manufacturing facility for 295 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1735908274000,
            "Source": "corporate_action"
        }
    ]
}