{
    "Symbol": "HOMEFIRST",
    "ISIN": "INE481N01025",
    "News": [
        {
            "Title": "Home First Finance Targets 25% AUM Growth by FY27",
            "Summary": "Home First Finance Company outlines strategic roadmap to achieve 25% year-over-year AUM growth by FY27 through enhanced distribution networks, technology adoption, diversified funding sources, and robust risk management practices.",
            "Sentiment": "positive",
            "PublishDate": 1769092909798,
            "Source": "stocks"
        },
        {
            "Title": "Home First Finance Maintains Credit Cost Guidance",
            "Summary": "Home First Finance Company plans to maintain credit cost guidance between 30-40 basis points while implementing disciplined risk management strategies during its growth phase.",
            "Sentiment": "neutral",
            "PublishDate": 1769092680607,
            "Source": "stocks"
        },
        {
            "Title": "Home First Finance Q3FY26 Results Show Strong Growth",
            "Summary": "Home First Finance Company India Limited reported robust Q3FY26 results with net profit rising 44.0% YoY to ₹1,402.00 million. Revenue from operations grew 18.8% to ₹4,822.45 million driven by higher interest income.",
            "Sentiment": "positive",
            "PublishDate": 1769081190553,
            "Source": "co_actions_results"
        },
        {
            "Title": "Home First Finance Allots 1.72 Lakh Shares via ESOP",
            "Summary": "Home First Finance Company India Limited allotted 1,72,424 equity shares through employee stock option exercise, increasing paid-up capital to ₹20.82 crores with shares from two ESOP schemes.",
            "Sentiment": "positive",
            "PublishDate": 1768914471539,
            "Source": "co_actions_results"
        },
        {
            "Title": "Home First Finance Q3FY26 Board Meet on Jan 22",
            "Summary": "Home First Finance Company India Limited has scheduled a board meeting on January 22, 2026, to consider and approve Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768544486356,
            "Source": "co_actions_results"
        },
        {
            "Title": "Home First Finance allots 28,601 ESOP shares",
            "Summary": "Home First Finance Company India Limited allotted 28,601 equity shares under ESOP schemes on December 18, 2025, increasing paid-up share capital to ₹20.78 crores with 10.39 crore equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1766044286143,
            "Source": "co_actions_results"
        },
        {
            "Title": "Government Pension Fund Global Increases Stake in Home First Finance Company",
            "Summary": "Government Pension Fund Global acquired 32,067 shares of Home First Finance Company India Ltd through open market purchase, increasing its holding from 4.9935% to 5.0245%. The acquisition was completed on November 28, 2025, representing a 0.0309% increase in the pension fund's stake in the housing finance company.",
            "Sentiment": "neutral",
            "PublishDate": 1764581588003,
            "Source": "corporate_action"
        },
        {
            "Title": "HomeFirst Finance Allots 2.65 Lakh Equity Shares Under ESOP Schemes",
            "Summary": "HomeFirst Finance Company India Limited allotted 2,65,125 equity shares of Rs. 2 each following employee stock option exercises under three ESOP schemes. The company's paid-up share capital increased from Rs. 20,72,58,972 to Rs. 20,77,89,222, with the new shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764095238121,
            "Source": "corporate_action"
        },
        {
            "Title": "HomeFirst Finance Senior Management Personnel Vilasini Subramanian Vacates Office",
            "Summary": "Ms. Vilasini Subramanian, Head-Strategic Alliances at HomeFirst Finance Company India Limited, has vacated her office on November 14, 2025, following her resignation due to personal reasons. The departure affects the company's senior management structure as she was designated as Senior Management Personnel responsible for strategic alliances.",
            "Sentiment": "neutral",
            "PublishDate": 1763174392704,
            "Source": "corporate_governance"
        },
        {
            "Title": "HomeFirst Finance Reports 26.3% AUM Growth Despite Asset Quality Challenges in Q2 FY26",
            "Summary": "HomeFirst Finance Company India Limited reported AUM growth of 26.3% year-on-year to Rs. 14,178 crores for the quarter ended September 30, 2025. The company expanded its distribution network to 366 touchpoints and 163 branches. Disbursements stood at Rs. 1,289 crores, up 9.6% year-on-year. However, asset quality metrics showed some deterioration with 14-day past due at 5.5%, 30-day past due at 3.7%, and Gross Stage 3 at 1.9%. The company faced challenges in specific markets including Surat, Coimbatore, and Tirupur due to tariff-related impacts on textile and leather industries. Net interest margin improved to 5.4% from 5.2% in the previous quarter. Cost of borrowing reduced by 30 basis points to 8.1%. Profit after tax increased 43% year-on-year to Rs. 132 crores. The company maintained credit costs at 40 basis points and expects to bring asset quality metrics back to earlier levels over the next two quarters through focused collection efforts.",
            "Sentiment": "neutral",
            "PublishDate": 1762595843471,
            "Source": "earnings"
        },
        {
            "Title": "Homefirst Finance Targets 26-30% AUM Growth Through Technology and Branch Expansion",
            "Summary": "Homefirst Finance has set a target of 26-30% growth in Assets Under Management (AUM), driven by strong disbursement momentum and technology-enabled affordable housing finance. The company is enhancing its digital collections capabilities and AI-based risk systems while expanding its branch network across 13 states to achieve scale efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1762267740308,
            "Source": "stock"
        },
        {
            "Title": "Home First Finance Reports Q2 Results, Announces Leadership Changes",
            "Summary": "Home First Finance Company India Limited reported quarterly results for the quarter and half year ended September 30, 2025. The company's profit after tax was Rs. 1,318.47 million for the quarter compared to Rs. 889.91 million in the previous year quarter. For the half year, profit after tax reached Rs. 2,508.44 million versus Rs. 1,643.91 million in the previous year. The company announced leadership changes including assigning additional responsibility of heading the Legal function to Shreyan Bachhawat, who will be designated as Company Secretary, Compliance Officer and Head-Legal effective from October 1, 2025. Ms. Vilasini Subramanian resigned from her position as Head-Strategic Alliances effective November 14, 2025, citing personal reasons.",
            "Sentiment": "positive",
            "PublishDate": 1762255066471,
            "Source": "earnings"
        },
        {
            "Title": "Home First Finance Allots 68,907 Equity Shares Under Employee Stock Option Plans",
            "Summary": "Home First Finance Company India Limited has allotted 68,907 equity shares of Rs. 2 each following the exercise of employee stock options under three ESOP schemes. The allotment was approved by the Committee of Directors and Review Committee on October 31, 2025. The company's paid-up share capital increased from Rs. 20,71,21,158 to Rs. 20,72,58,972, with total equity shares rising to 10,36,29,486. The allotment includes 37,415 shares under ESOP II scheme, 27,802 shares under ESOP 2021 scheme, and 3,690 shares under ESOP 2024 scheme. Exercise prices varied across schemes, ranging from Rs. 117.242 to Rs. 970.300 per share. The newly allotted shares will rank equally with existing equity shares and the company is completing formalities for listing these shares.",
            "Sentiment": "neutral",
            "PublishDate": 1761932517339,
            "Source": "corporate_action"
        },
        {
            "Title": "Home First Finance Company Receives Improved ESG Risk Rating from Morningstar Sustainalytics",
            "Summary": "Home First Finance Company India Limited announced an improvement in its ESG Risk Rating from Morningstar Sustainalytics, moving from 17.4 to 13.6, which places the company in the 'Low Risk' category for ESG risk management. The company discovered this rating revision on September 24, 2025 at 3:54 P.M. IST while checking Morningstar Sustainalytics' website. The disclosure was made by Company Secretary and Compliance Officer Shreyans Bachhawat.",
            "Sentiment": "positive",
            "PublishDate": 1758716661334,
            "Source": "stock"
        },
        {
            "Title": "Home First Finance Appoints Sriram Hariharan as Independent Director for Five-Year Term",
            "Summary": "Home First Finance Company India Limited shareholders approved the appointment of Mr. Sriram Hariharan as a Non-Executive Independent Director through a postal ballot. The appointment is for a five-year term starting June 26, 2025. The resolution received overwhelming support with 99.89% of votes in favor from 8.42 crore shares voted out of 10.33 crore total shares. Hariharan holds engineering and management degrees from NIT and IIM Bangalore respectively, and previously served as President and CEO of ICICI Bank Canada from 2008 to 2019. He also led ICICI Bank's International Banking Group and served as Board Chair of ICICI Bank UK PLC and ICICI Bank Canada. The company confirmed that Hariharan is not debarred by any regulatory authority and is not disqualified under the Companies Act, 2013.",
            "Sentiment": "positive",
            "PublishDate": 1757042892019,
            "Source": "corporate_governance"
        },
        {
            "Title": "FMR LLC and FIL Limited Increase Stake in Home First Finance to 7.17%",
            "Summary": "FMR LLC and FIL Limited, along with their subsidiaries, acquired 2,974,536 shares representing 2.17% of Home First Finance Company India Limited through open market purchases. The acquisition increased their total holding from 4,433,770 shares (5.00%) to 7,408,306 shares (7.17%) of the company's voting rights. The shares were acquired between June 5, 2024 and August 11, 2025. Home First Finance's equity share capital increased from 88,618,392 shares to 103,268,597 shares during this period. The acquirers are not part of the promoter group and the company is listed on both NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1755079365765,
            "Source": "corporate_action"
        },
        {
            "Title": "Kotak Mahindra MF, Citigroup and Others Acquire 10.64% Stake in Home First Finance for Rs 1,307 Crore",
            "Summary": "A consortium of institutional investors including Kotak Mahindra MF, Fidelity, Morgan Stanley, and Citigroup Global Markets Mauritius collectively purchased a 10.64% stake in Home First Finance Company India for Rs 1,307 crore through open market transactions. Kotak Mahindra Mutual Fund acquired the largest individual portion with 50 lakh shares representing a 4.84% stake. Other buyers included HSBC MF, Motilal Oswal MF, Kotak Mahindra Life Insurance, HDFC Life Insurance, Norway's Government Pension Fund Global, and the Master Trust of Bank of Japan, who together purchased over 1.09 crore shares at an average price of Rs 1,190.50 per share. The transaction coincided with private equity firm Warburg Pincus completely exiting its 10.64% stake through its affiliate Orange Clove Investments BV. Home First Finance shares gained 6.44% to close at Rs 1,279.70 on the NSE. This follows previous stake sales by Warburg Pincus and promoter entities, including a 19.6% stake sale in December 2024 for Rs 1,728 crore and a 9.8% stake sale in November 2023 for Rs 753 crore.",
            "Sentiment": "positive",
            "PublishDate": 1754923322687,
            "Source": "order&deals"
        },
        {
            "Title": "Orange Clove Investments to Sell 10.3% Stake in Home First Finance for ₹1,255 Crore",
            "Summary": "Orange Clove Investments BV plans to sell 1 crore shares representing a 10.3% stake in Home First Finance Company India Ltd through a block deal worth ₹1,255 crore. The indicative price range is ₹1,143 to ₹1,202 per share, offering up to 4.9% discount from the previous closing price. Orange Clove held 10.64% stake at the end of June quarter. Home First Finance reported strong quarterly results with net profit rising 35.5% to ₹118.8 crore and net interest income increasing 32.8% to ₹194 crore. The company's assets under management grew 28.6% to ₹13,479 crore in the June quarter. Management has set an AUM target of ₹35,000-40,000 crore by FY25. The company raised ₹1,250 crore through QIP in April, its first equity fundraise since 2021 IPO. Shares closed 1.54% lower at ₹1,200.4 and have declined 13.4% in the past month.",
            "Sentiment": "neutral",
            "PublishDate": 1754880566728,
            "Source": "stock"
        },
        {
            "Title": "Home First Finance Seeks Shareholder Approval for Sriram Hariharan's Independent Director Appointment",
            "Summary": "Home First Finance Company India Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Sriram Hariharan as an Additional Non-Executive Independent Director. The Board had approved his appointment on June 26, 2025, for a first term of five consecutive years, subject to shareholder approval through special resolution. The e-voting period runs from August 6, 2025, to September 4, 2025. Mr. Hariharan holds engineering and management qualifications from NIT and IIM Bangalore, and previously served as President and CEO of ICICI Bank Canada from 2008 to 2019. He brings expertise in banking, risk management, corporate governance, and information technology. The results will be declared by September 8, 2025. Mr. Hariharan will be eligible for sitting fees and commission based on company performance, as previously approved by shareholders in November 2020.",
            "Sentiment": "neutral",
            "PublishDate": 1754393831015,
            "Source": "corporate_action"
        },
        {
            "Title": "Home First Finance Reports 28.6% AUM Growth Despite Seasonal Asset Quality Uptick",
            "Summary": "Home First Finance Company India Limited reported AUM growth of 28.6% year-on-year to Rs. 13,479 crores for the quarter ended June 30, 2025. The company raised Rs. 1,250 crores through its first QIP and received credit rating upgrades to AA (Stable) from ICRA, India Ratings and CARE. Disbursements stood at Rs. 1,243 crores, the second highest in company history. However, asset quality saw seasonal deterioration with 1+ DPD rising to 5.4% (up 90 bps quarter-on-quarter) and 30+ DPD at 3.5% (up 50 bps). The increase was more pronounced in Surat and Coimbatore-Tirupur regions, though management expects normalization over the next two quarters. Net Interest Margin improved to 5.2% from 5.1% in the previous quarter, while Profit After Tax increased 35.5% year-on-year to Rs. 119 crores. The company maintained its annual disbursement guidance of Rs. 5,600-5,800 crores and credit cost guidance of 30-40 basis points.",
            "Sentiment": "neutral",
            "PublishDate": 1754311813894,
            "Source": "earnings"
        },
        {
            "Title": "Home First Finance Sets FY26 Disbursement Target of Rs 5,600-5,800 Crores, Expects Cost of Borrowing to Drop to 8%",
            "Summary": "Home First Finance outlined its financial targets and guidance during a conference call. The company expects its cost of borrowing to decline to around 8% by March, representing a 50-60 basis points reduction, while maintaining spreads in the 5-5.25% range. For FY26, the company has set disbursement guidance of Rs 5,600-5,800 crores with credit cost guidance of 30-40 basis points. The company targets a Return on Equity (ROE) of 15% in the next 5-6 quarters and aims for Return on Assets (ROA) approaching 4%. Operating expenses to assets ratio is expected to remain between 2.6-2.7%. Additionally, Home First Finance plans to increase co-lending contribution to 10% of disbursements.",
            "Sentiment": "positive",
            "PublishDate": 1753759862819,
            "Source": "earnings"
        },
        {
            "Title": "Home First Finance Uploads Q1 FY26 Earnings Call Audio Recording",
            "Summary": "Home First Finance Company India Limited has made the audio recording of its earnings conference call available on its website. The call covered the quarter ended June 30, 2025 and was conducted on July 28, 2025 with analysts and investors. The company has provided access to the recording under the link 'Home First Q1FY26 Concall' for stakeholder reference.",
            "Sentiment": "neutral",
            "PublishDate": 1753710946535,
            "Source": "earnings"
        },
        {
            "Title": "Home First Finance Co Reports 35% Jump in Net Profit to 1.19 Billion Rupees",
            "Summary": "Home First Finance Co reported net profit of 1.19 billion rupees in Q1, representing a year-over-year increase from 877.7 million rupees. The company's revenue also grew to 4.54 billion rupees compared to 3.36 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1753662614161,
            "Source": "earnings"
        },
        {
            "Title": "Home First Finance Targets Expansion Through Tier-3 Markets and Digital Asset Diversification",
            "Summary": "Home First Finance is pursuing growth through penetration into tier-3 markets and digitally enabled asset diversification. The company is working to strengthen its borrower profile while maintaining steady disbursement momentum and controlled credit costs.",
            "Sentiment": "positive",
            "PublishDate": 1753449825460,
            "Source": "stock"
        },
        {
            "Title": "Home First Finance Reports Quarterly Results with 13.6% Rise in Profit After Tax",
            "Summary": "Home First Finance Company India Limited reported quarterly results for the period ended June 30, 2025. The company posted a profit after tax of Rs. 1,188.91 million compared to Rs. 1,046.92 million in the previous quarter. Total revenue from operations increased to Rs. 4,536.14 million from Rs. 4,146.65 million in the prior quarter. Interest income rose to Rs. 3,843.79 million from Rs. 3,629.19 million. The company's basic earnings per share stood at Rs. 11.69 compared to Rs. 11.55 in the previous quarter. Finance costs increased to Rs. 2,002.82 million from Rs. 1,903.06 million. The company completed a Qualified Institutional Placement on April 11, 2025, raising Rs. 12,500 million by allotting 1,28,86,597 equity shares at Rs. 970 per share. During the quarter, the company transferred 2,097 loans worth Rs. 2,043.65 million through direct assignment transactions. The Board had recommended a dividend of Rs. 3.70 per equity share for the year ended March 31, 2025, which was paid during this quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753441769771,
            "Source": "earnings"
        },
        {
            "Title": "Home First Finance: Ambitious AUM Growth Target Set for FY27",
            "Summary": "Home First Finance aims to reach Rs 20,000 crore AUM by FY27, with 25-30% annual growth. The company targets Rs 35,000-40,000 crore AUM by FY30. CEO Manoj Viswanathan expects to maintain a 5% spread and 16-16.5% ROE between capital raises. The company recently raised Rs 1,250 crore in equity, supporting growth until FY29.",
            "Sentiment": "positive",
            "PublishDate": 1747186392000,
            "Source": "normal_news"
        },
        {
            "Title": "Home First Finance Company India: Smallcap World Fund Increases Stake to Over 7%",
            "Summary": "Smallcap World Fund Inc. has raised its stake in Home First Finance Company India by nearly 3%, bringing its total shareholding to 7.8078%. The fund acquired 3,023,818 additional shares on April 30, 2025, through the open market. Home First Finance's stock price gained nearly 2% following this news.",
            "Sentiment": "positive",
            "PublishDate": 1746684999000,
            "Source": "block_deals"
        },
        {
            "Title": "Home First Finance Co Reports Q4 Results and Announces Corporate Actions",
            "Summary": "Home First Finance Co reported a Q4 net profit of 1.05 billion rupees, up from 834.7 million rupees year-over-year. Revenue increased to 4.15 billion rupees from 3.13 billion rupees in the same period last year. The company recommended a dividend of 3.70 rupees per share and plans to issue NCDs up to 7 billion rupees through private placement.",
            "Sentiment": "positive",
            "PublishDate": 1746144664000,
            "Source": "default"
        },
        {
            "Title": "Home First Finance: Q4 Profit Jumps 25.4%, AUM Grows 31%",
            "Summary": "Home First Finance reported Q4 net profit of Rs 105 crore, up 25.4% YoY. AUM increased 31% to Rs 12,713 crore. Gross NPA ratio stable at 1.7%. Total income rose 31% to Rs 416 crore. Company raised Rs 1,250 crore through QIP in April.",
            "Sentiment": "positive",
            "PublishDate": 1746109759000,
            "Source": "earnings"
        },
        {
            "Title": "Home First Finance Reports Q4 Results and Announces Corporate Actions",
            "Summary": "Home First Finance Company has reported its Q4 financial results, with revenue increasing to 4.15 billion rupees from 3.13 billion rupees year-over-year. Net profit for Q4 rose to 1.05 billion rupees, up from 834.7 million rupees in the previous year. The company has recommended a dividend of 3.70 rupees per share and plans to issue non-convertible debentures (NCDs) up to 7 billion rupees through private placement.",
            "Sentiment": "positive",
            "PublishDate": 1746106749000,
            "Source": "default"
        },
        {
            "Title": "Home First Finance Company India Ltd. Sees Large Block Trade",
            "Summary": "A significant block trade of approximately 236,358 shares of Home First Finance Company India Ltd. was executed on the National Stock Exchange (NSE) at a price of Rs. 1251.00 per share. The total value of the transaction amounted to Rs. 29.57 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1745562450000,
            "Source": "block_details"
        },
        {
            "Title": "Home First Finance: Motilal Oswal's Preferred Pick in Affordable Housing Finance",
            "Summary": "Motilal Oswal has selected Home First Finance as its preferred choice in the affordable housing finance segment, citing the company's strong fundamentals, healthy return ratios, and superior execution compared to peers. The brokerage sees potential for scalable growth with strong risk-adjusted returns, despite a possible near-term decline in RoE due to lower leverage.",
            "Sentiment": "positive",
            "PublishDate": 1745466555000,
            "Source": "normal_news"
        },
        {
            "Title": "Home First Finance Company India Limited: Raises ₹1,250 Crore via QIP",
            "Summary": "Home First Finance Company India Limited raised ₹1,250 crore through a qualified institutional placement (QIP), issuing 1.3 crore equity shares to qualified institutional buyers. This marks the company's first equity fundraise since its 2021 IPO. The issue attracted a mix of prominent foreign and domestic institutional investors, including IFC, Capital World, HDFC AMC, and ICICI Prudential AMC.",
            "Sentiment": "positive",
            "PublishDate": 1744803719000,
            "Source": "corporate_action"
        },
        {
            "Title": "Home First Finance Raises ₹1,250 Crores Through Qualified Institutions Placement",
            "Summary": "Home First Finance Company has successfully raised ₹1,250 crores through a Qualified Institutions Placement (QIP). This fundraising effort demonstrates the company's ability to attract significant institutional investment, potentially strengthening its financial position and supporting future growth initiatives in the housing finance sector.",
            "Sentiment": "positive",
            "PublishDate": 1744801935000,
            "Source": "default"
        },
        {
            "Title": "Home First Finance Company: Share Price Surges 8% in Morning Trade",
            "Summary": "Home First Finance Company's stock price jumped nearly 8% in morning trade on BSE, reaching an intraday high of ₹1,142. The stock was trading 7.50% higher at ₹1,138.20 around 11:05 AM. The NBFC stock has gained 27% over the last year and 12% this month.",
            "Sentiment": "positive",
            "PublishDate": 1744695535000,
            "Source": "normal_news"
        },
        {
            "Title": "Home First Finance Raises 12.5 Billion Rupees Through Qualified Institutional Placement",
            "Summary": "Home First Finance Company has successfully raised 12.5 billion rupees (approximately $150 million) through a Qualified Institutional Placement (QIP). This fundraising method allows listed companies to issue equity shares, fully and partly convertible debentures, or other securities to qualified institutional buyers.",
            "Sentiment": "positive",
            "PublishDate": 1744631981000,
            "Source": "corporate_action"
        },
        {
            "Title": "Home First Finance Sets Floor Price for Qualified Institutional Placement",
            "Summary": "Home First Finance Company has set the floor price for its Qualified Institutional Placement (QIP) at 1019.25 rupees per share. This move indicates the company is looking to raise capital through institutional investors.",
            "Sentiment": "neutral",
            "PublishDate": 1744157446000,
            "Source": "corporate_action"
        },
        {
            "Title": "Home First Finance Sets Floor Price for QIP",
            "Summary": "Home First Finance Company has set the floor price for its Qualified Institutional Placement (QIP) at 1019.25 rupees per share. This pricing decision is a crucial step in the company's efforts to raise capital through institutional investors.",
            "Sentiment": "neutral",
            "PublishDate": 1744119251000,
            "Source": "corporate_action"
        },
        {
            "Title": "Home First Finance Company to Launch QIP for Fundraising",
            "Summary": "Home First Finance Company is reportedly planning to launch a Qualified Institutional Placement (QIP) next week. The company aims to raise up to 1,250 crore rupees through this initiative, according to sources cited by the Economic Times.",
            "Sentiment": "positive",
            "PublishDate": 1741837087000,
            "Source": "corporate_action"
        },
        {
            "Title": "Home First Finance Reports Strong Q3 Results and Plans Share Issuance",
            "Summary": "Home First Finance Co. reported a significant increase in Q3 net profit, rising to 974 million rupees from 788 million rupees year-over-year and 922 million rupees quarter-over-quarter. The company's Q3 revenue also saw substantial growth, reaching 4.06 billion rupees compared to 2.96 billion rupees in the previous year. Additionally, the company announced plans to issue shares through Qualified Institutional Placement (QIP) and other modes, worth up to 12.5 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738109807000,
            "Source": "earnings"
        },
        {
            "Title": "Home First Finance Announces Potential Share Issuance Worth Up to 12.5 Billion Rupees",
            "Summary": "Home First Finance Company has announced plans to issue shares through a Qualified Institutional Placement (QIP) or other modes, with a total value of up to 12.5 billion rupees. This move suggests the company is looking to raise significant capital, potentially to fund expansion or strengthen its financial position.",
            "Sentiment": "positive",
            "PublishDate": 1738077258000,
            "Source": "corporate_action"
        },
        {
            "Title": "Home First Finance Reports Strong Q3 Financial Results",
            "Summary": "Home First Finance Company has announced its Q3 financial results, showing significant year-over-year growth. The company's net profit increased to 974 million rupees, up from 788 million rupees in the same quarter last year. This represents a 23.6% year-over-year increase. Sequentially, net profit grew from 922 million rupees in the previous quarter. Revenue for Q3 also saw substantial growth, reaching 4.06 billion rupees compared to 2.96 billion rupees in the same period last year, marking a 37.2% increase.",
            "Sentiment": "positive",
            "PublishDate": 1738075299000,
            "Source": "earnings"
        },
        {
            "Title": "HDFC Mutual Fund: Increased Stake in Home First Finance Company",
            "Summary": "HDFC Mutual Fund has raised its stake in Home First Finance Company India Ltd to 5.09%.",
            "Sentiment": "positive",
            "PublishDate": 1737603584000,
            "Source": "normal_news"
        },
        {
            "Title": "Home First Finance Schedules Board Meeting for Q3 Results and Fund Raising",
            "Summary": "Home First Finance Company has announced a board meeting scheduled for January 28. The meeting agenda includes consideration of the company's Q3 financial results and potential fund raising initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1737469738000,
            "Source": "corporate_action"
        },
        {
            "Title": "Home First Finance to Consider Q3 Results on January 28",
            "Summary": "Home First Finance Company has announced that it will consider its third quarter (Q3) financial results on January 28. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737469389000,
            "Source": "earnings"
        },
        {
            "Title": "Home First Finance Company India Ltd: Norway Fund Reduces Stake to 5.41%",
            "Summary": "The Government Pension Fund Global of Norway sold 7.50 lakh shares (0.84% stake) of Home First Finance for ₹76.77 crore at ₹1,023.28 per share, reducing its holding from 6.25% to 5.41%.",
            "Sentiment": "neutral",
            "PublishDate": 1736872936000,
            "Source": "block_deals"
        },
        {
            "Title": "Home First Finance: Major Block Deals Worth Rs 1,100 Crore",
            "Summary": "Home First Finance saw multiple block deals totaling Rs 1,100 crore. BofA, Goldman Sachs, Citigroup, and HDFC Mutual Fund were among the buyers. Shares were sold by True North Fund V LLP, Aether (Mauritius) Limited, and Orange Clove Investments B.V. at approximately Rs 990 per share.",
            "Sentiment": "positive",
            "PublishDate": 1733196620000,
            "Source": "block_deals"
        },
        {
            "Title": "Home First Finance Company India Ltd: Large Block Deal Triggers 6% Stock Drop",
            "Summary": "A block deal involving 9.83% of Home First Finance Company India Ltd's equity caused shares to fall up to 6%. Promoters initiated a deal to sell up to 14.7% stake valued at ₹1,267 crore. Major sellers include True North Fund V LLP, Orange Clove Investments BV, and Aether (Mauritius) Ltd. The stock is currently trading 5.70% lower at ₹992.20.",
            "Sentiment": "negative",
            "PublishDate": 1733114019000,
            "Source": "block_deals"
        },
        {
            "Title": "Home First Finance Company Block Trade on NSE",
            "Summary": "A block trade of approximately 804,630 shares of Home First Finance Company occurred on the National Stock Exchange (NSE) for Rs 81 crore. The trade was executed at a price of Rs 1006.65 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1733111622000,
            "Source": "block_deals"
        },
        {
            "Title": "Home First Finance Company: Promoters to Launch ₹1,267 Crore Block Deal",
            "Summary": "Home First Finance Company's promoters plan to sell up to 14.7% stake via block deal on Monday. The floor price is set at ₹968 per share, an 8% discount to the last closing price. True North Fund V LLP, Orange Clove Investments BV, and Aether (Mauritius) Ltd are the primary sellers. Kotak and Nomura are acting as brokers for the transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1732891370000,
            "Source": "block_deals"
        }
    ]
}