{
    "Symbol": "HONASA",
    "ISIN": "INE0J5401028",
    "News": [
        {
            "Title": "Honasa Consumer Reports Strong Q3FY26 Growth",
            "Summary": "Honasa Consumer Limited delivered robust Q3FY26 results with consolidated revenue rising 16.24% YoY to ₹6,015.41 million and net profit surging 92.89% YoY to ₹502.00 million, demonstrating strong operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1770913408539,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arohi Asset Management crosses 5% stake in Honasa Consumer",
            "Summary": "Singapore-based Arohi Asset Management acquired 760,000 shares in Honasa Consumer on January 19, 2026, increasing total holding to 16,563,262 shares (5.09% stake) across managed funds.",
            "Sentiment": "neutral",
            "PublishDate": 1769775534805,
            "Source": "co_actions_results"
        },
        {
            "Title": "Honasa Consumer Board Meet Set for Feb 12, 2026",
            "Summary": "Honasa Consumer Limited announces board meeting on February 12, 2026, to consider Q3FY26 financial results. Trading window remains closed for designated persons until 48 hours post-declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1769674611335,
            "Source": "co_actions_results"
        },
        {
            "Title": "Honasa Consumer clarifies volume movement is market driven",
            "Summary": "Honasa Consumer Limited responds to BSE inquiry about increased trading volumes, stating the movement is purely due to market conditions and not influenced by company management.",
            "Sentiment": "neutral",
            "PublishDate": 1767170371882,
            "Source": "stocks"
        },
        {
            "Title": "Honasa Consumer promoter Varun Alagh picks up ₹50 cr shares",
            "Summary": "Varun Alagh acquired 18.52 lakh shares worth ₹50.00 crore through block deal from Fireside Ventures, increasing stake to 32.45%. Stock trades 15% below IPO price despite strong Q2 performance.",
            "Sentiment": "positive",
            "PublishDate": 1767001604988,
            "Source": "co_actions_results"
        },
        {
            "Title": "HSBC Downgrades Honasa to Reduce Rating",
            "Summary": "HSBC has downgraded Honasa Consumer Limited to 'Reduce' rating with a target price of ₹242.00, indicating a bearish outlook on the consumer goods company.",
            "Sentiment": "negative",
            "PublishDate": 1765511076421,
            "Source": "stocks"
        },
        {
            "Title": "CLSA Sets ₹350 Target Price for Honasa Consumer",
            "Summary": "CLSA has issued a research report on Honasa Consumer Limited with a target price of ₹350 per share, providing investment guidance for the consumer goods company.",
            "Sentiment": "neutral",
            "PublishDate": 1765511047998,
            "Source": "stocks"
        },
        {
            "Title": "Honasa Consumer Acquires 95% Stake in BTM Ventures",
            "Summary": "Honasa Consumer's board approves acquisition of BTM Ventures, owner of men's personal care brand Reginald Men, for ₹95.00 crores enterprise value in phased transaction.",
            "Sentiment": "positive",
            "PublishDate": 1765451581823,
            "Source": "co_actions_results"
        },
        {
            "Title": "Honasa Consumer Reports 22.5% Revenue Growth in Q2 FY26 with Strong Margin Performance",
            "Summary": "Honasa Consumer delivered INR 566 crores revenue with 22.5% growth, achieving all-time high gross profits at 71.9% and EBITDA of INR 48 crores at 8.4% margin. The company launched premium skincare brand Lumineve exclusively with Nykaa and made a strategic investment in oral care brand Fang, while Mamaearth returned to positive growth across channels.",
            "Sentiment": "positive",
            "PublishDate": 1763463656676,
            "Source": "earnings"
        },
        {
            "Title": "Honasa Consumer Targets Double-Digit Growth for Mamaearth Brand by Q4",
            "Summary": "Honasa Consumer expects high single-digit growth for its Mamaearth brand in the next quarter, with plans to achieve double-digit growth by Q4. The company aims to maintain stable EBITDA margins in upcoming quarters while targeting annual operating margin improvements of 50-100 basis points through efficient marketing and operational leverage.",
            "Sentiment": "positive",
            "PublishDate": 1763005478704,
            "Source": "stock"
        },
        {
            "Title": "Honasa Consumer Targets 25% CAGR Growth in Beauty Portfolio with ₹5,000Cr Market Opportunity by 2028",
            "Summary": "Honasa Consumer has outlined its growth strategy focusing on sustained double-digit growth driven by premium skincare, haircare, and sun protection categories. The company is expanding into oral beauty and color cosmetics segments. Honasa targets a 25% compound annual growth rate (CAGR) for its 'I-Beauty' portfolio, identifying a ₹5,000 crore market opportunity by 2028. The company plans to strengthen synergy between its direct-to-consumer (D2C) and offline retail channels to drive margins.",
            "Sentiment": "positive",
            "PublishDate": 1762963377450,
            "Source": "stock"
        },
        {
            "Title": "Honasa Consumer Reports Mixed Quarterly Results and Announces Strategic Acquisition",
            "Summary": "Honasa Consumer Limited reported quarterly results with revenue from operations declining to Rs 5,266.94 million compared to Rs 5,836.28 million in the same period last year. The company posted a profit after tax of Rs 383.47 million versus Rs 399.01 million in the previous year. On a six-month basis, revenue increased to Rs 11,103.22 million from Rs 9,944.24 million, with profit after tax rising significantly to Rs 782.48 million from Rs 196.62 million. The Board approved the acquisition of a 25% stake in Couch Commerce Private Limited, which operates the Fang Oral Care brand, for up to Rs 10 crores through compulsory convertible preference shares. Couch Commerce generated revenue of Rs 3.14 crores in FY 2024-25 with an annual revenue run rate of Rs 7 crores in FY 2025-26. The company continues to face legal proceedings with RSM General Trading LLC in UAE courts, with arbitration proceedings ongoing in India.",
            "Sentiment": "neutral",
            "PublishDate": 1762946322559,
            "Source": "earnings"
        },
        {
            "Title": "Honasa Consumer Reports Strong Turnaround with Q2 Net Profit of 392M Rupees",
            "Summary": "Honasa Consumer delivered a significant turnaround in its quarterly results, reporting a net profit of 392 million rupees compared to a loss of 186 million rupees in the same period last year. Revenue grew to 5.38 billion rupees from 4.62 billion rupees year-over-year. The company's EBITDA swung to a positive 476.4 million rupees from a loss of 307 million rupees previously. EBITDA margin improved substantially to 8.85% from negative 6.65% in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1762945341592,
            "Source": "earnings"
        },
        {
            "Title": "Honasa Consumer Grants 289,370 Stock Options to Employees Under ESOP-2018",
            "Summary": "Honasa Consumer Limited's Nomination and Remuneration Committee approved the grant of 289,370 stock options to eligible employees under the company's Employee Stock Options Plan-2018. The options have an exercise price of ₹10 per stock option, with each option convertible into one equity share of face value ₹10. The vested options can be exercised by employees during their tenure or within 90 days from their last working day, subject to terms decided by the Nomination and Remuneration Committee. The stock options are governed under ESOP-2018 and upon exercise, the requisite number of equity shares will be allotted to employees who have exercised their vested options.",
            "Sentiment": "neutral",
            "PublishDate": 1761834556678,
            "Source": "corporate_action"
        },
        {
            "Title": "Honasa Consumer Approves Re-appointment of Independent Director and New Secretarial Auditor",
            "Summary": "Honasa Consumer Limited held its 9th Annual General Meeting on September 25, 2025, where members approved two key appointments. Mr. Vivek Gambhir was re-appointed as an Independent Director for a second five-year term, effective from March 24, 2026 to March 23, 2031. Gambhir holds degrees from Lafayette College and Harvard Business School, with over three decades of experience in operations and strategy, currently associated with Lightspeed India Ventures. Members also approved the appointment of Arora Shekhar and Company as Secretarial Auditor for a five-year term from April 1, 2025 to March 31, 2030. The Delhi-based practicing company secretary firm has been operating since 2013 and specializes in secretarial audit, corporate law, securities law, and corporate governance.",
            "Sentiment": "neutral",
            "PublishDate": 1758825204101,
            "Source": "corporate_governance"
        },
        {
            "Title": "Honasa Consumer Projects Strong Double-Digit Growth and Margin Expansion Plans",
            "Summary": "Honasa Consumer expects strong double-digit growth for FY26. The company aims to maintain EBITDA margins near 7% and projects annual margin improvements of 100-150 basis points over the next 5-6 years.",
            "Sentiment": "positive",
            "PublishDate": 1755057002412,
            "Source": "stock"
        },
        {
            "Title": "Honasa Consumer Plans Aggressive Growth Strategy Through Premium Beauty and Offline Expansion by 2028",
            "Summary": "Honasa Consumer has outlined an aggressive growth strategy targeting 2028. The company's plan focuses on expanding its premium beauty portfolio, increasing offline market reach, and pursuing innovation-driven market share gains across high-potential categories.",
            "Sentiment": "positive",
            "PublishDate": 1755013713330,
            "Source": "stock"
        },
        {
            "Title": "Honasa Consumer Reports 7.4% Revenue Growth and 1.6% Profit Increase in Q1 Results",
            "Summary": "Honasa Consumer Limited reported quarterly results for the quarter ended June 30, 2025. Standalone revenue from operations increased to Rs 5,836.28 million from Rs 5,435.60 million in the same quarter last year, representing a 7.4% growth. Profit after tax rose marginally to Rs 399.01 million compared to Rs 392.68 million in the previous year quarter. On a consolidated basis, revenue grew to Rs 5,952.54 million from Rs 5,540.57 million year-over-year. The company granted 23,42,672 employee stock options during the quarter. Honasa Consumer operates in beauty and personal care products across baby care, skin care, and hair care categories through third-party contract manufacturers. The company continues to face ongoing legal proceedings with RSM General Trading LLC in UAE courts involving a claim of AED 25.07 million, though the company does not expect material financial impact.",
            "Sentiment": "positive",
            "PublishDate": 1754994736127,
            "Source": "earnings"
        },
        {
            "Title": "Honasa Consumer Schedules Board Meeting for August 12 to Approve Quarterly Financial Results",
            "Summary": "Honasa Consumer Limited has scheduled a Board of Directors meeting for August 12, 2025 to consider and approve the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The trading window for company securities will remain closed for designated persons and their immediate relatives until 48 hours after the financial results declaration. The company had previously announced the trading window closure on June 25, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753449171397,
            "Source": "corporate_action"
        },
        {
            "Title": "Honasa Consumer: NCLT Approves Amalgamation of Two Subsidiaries",
            "Summary": "The National Company Law Tribunal (NCLT) has approved Honasa Consumer's scheme to amalgamate two subsidiaries, Fusion Cosmeceutics and Just4Kids Services. The company received the certified NCLT order on June 25, 2025, which will become effective upon filing with the Registrar of Companies. This move aims to streamline operations within the Honasa group.",
            "Sentiment": "positive",
            "PublishDate": 1750997339000,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Approves Merger of Fusion Cosmeceutics and Just4Kids with Honasa Consumer",
            "Summary": "The National Company Law Tribunal (NCLT) has approved the merger of Fusion Cosmeceutics and Just4Kids with Honasa Consumer. This corporate action involves the consolidation of these entities under Honasa Consumer's umbrella.",
            "Sentiment": "positive",
            "PublishDate": 1750948505000,
            "Source": "default"
        },
        {
            "Title": "Honasa Consumer Limited: Appoints New Chief Business Officer",
            "Summary": "Honasa Consumer Limited has appointed Yatish Bhargava as Chief Business Officer to drive growth across multiple brand categories. Bhargava will oversee business operations across brands and channels, focusing on category leadership and scaling growth. He brings 17 years of experience from roles at Flipkart and Hindustan Unilever Limited.",
            "Sentiment": "positive",
            "PublishDate": 1750157024000,
            "Source": "corporate_governance"
        },
        {
            "Title": "NCLT Approves Honasa Consumer's Amalgamation with Two Subsidiaries",
            "Summary": "Honasa Consumer has received approval from the National Company Law Tribunal (NCLT) for its amalgamation with Fusion Cosmeceutics and Just4Kids Services. The company is now awaiting the submission of certified orders to the Registrar of Companies to complete the process.",
            "Sentiment": "positive",
            "PublishDate": 1749095164000,
            "Source": "default"
        },
        {
            "Title": "Honasa Consumer: Q4 Profit Drops 18% Despite Revenue Growth",
            "Summary": "Honasa Consumer reported an 18% YoY decline in Q4FY25 net profit to Rs 25 crore, while revenue grew 13% to Rs 534 crore. EBITDA stood at 5.1%, and gross profit margin improved to 70.7%. The company expanded retail distribution by 26% YoY and saw success in its direct distribution strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1747969680000,
            "Source": "earnings"
        },
        {
            "Title": "Honasa Consumer Reports Q4 Financial Results",
            "Summary": "Honasa Consumer has released its Q4 financial results. The company reported revenue of 5.34 billion rupees, up from 4.71 billion rupees in the same quarter last year. However, EBITDA decreased to 269.9 million rupees from 331 million rupees year-over-year. The EBITDA margin also declined to 5.06% from 7.03% in the previous year. Consolidated net profit for Q4 was 249.8 million rupees, down from 305 million rupees year-over-year, but up from 260.2 million rupees quarter-on-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747915596000,
            "Source": "result"
        },
        {
            "Title": "Honasa Consumer: Q4 Profit Drops 18%, Revenue Rises 13%",
            "Summary": "Honasa Consumer reported Q4FY25 net profit of Rs 25 crore, down 18% YoY. Revenue increased 13% to Rs 534 crore. EBITDA margin at 5.1%. Gross profit margin improved to 70.7%. Retail distribution expanded by 26% YoY to 2.36 lakh outlets. Direct distributor contribution increased from 38% in FY24 to 71% in Q4 FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1747912393000,
            "Source": "earnings"
        },
        {
            "Title": "Honasa Consumer: Q4 and FY25 Results Announcement Scheduled for May 22",
            "Summary": "Honasa Consumer Ltd, owner of Mamaearth, will announce Q4 and FY25 results on May 22. Board meeting and earnings call scheduled. Trading window closed for insiders until 48 hours post-results. Q3 saw 0.4% YoY profit growth to Rs 26 crore, 7.5% revenue increase to Rs 536.7 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1747799250000,
            "Source": "corporate_action"
        },
        {
            "Title": "Delhi High Court Orders HUL to Remove Sunscreen Ads Within 24 Hours",
            "Summary": "The Delhi High Court has directed Hindustan Unilever Limited (HUL) to remove all advertisements related to sunscreen within 24 hours. This order comes in response to a legal dispute involving HONASA Consumer, the parent company of Mamaearth. The court's decision suggests potential issues with HUL's sunscreen advertising claims or content, though specific details are not provided in the brief news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1744881095000,
            "Source": "default"
        },
        {
            "Title": "Honasa Consumer Ordered to Pay AED 25 Million Compensation by Dubai Court",
            "Summary": "A Dubai court has ordered Honasa Consumer to pay AED 25 million (approximately 57 crore Indian Rupees) to RSM as compensation for damages. The ruling represents a significant financial obligation for the company.",
            "Sentiment": "negative",
            "PublishDate": 1743656845000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Honasa Consumer Ltd: Mamaearth Launches Mosquito Repellent Campaign with Shilpa Shetty",
            "Summary": "Mamaearth, owned by Honasa Consumer Ltd, launched a new marketing campaign for its mosquito repellent range featuring Shilpa Shetty Kundra. The campaign, released on April 2, 2025, promotes natural mosquito protection for children. Honasa Consumer Ltd shares were trading at ₹235.80, up 0.53% on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1743588575000,
            "Source": "normal_news"
        },
        {
            "Title": "Mamaearth: Ghazal Alagh's '85% Rule' for Sustainable Business Growth",
            "Summary": "Mamaearth co-founder Ghazal Alagh advocates for an '85% Rule' in business, emphasizing strategic prioritization over constant 100% effort. She suggests that aiming for 80-85% daily effort is more sustainable and effective for long-term business success, allowing for focus on important tasks without burnout.",
            "Sentiment": "positive",
            "PublishDate": 1742545751000,
            "Source": "normal_news"
        },
        {
            "Title": "Honasa Consumer Limited: Staze Beauty Launches 'Can't Staze Calm' Campaign",
            "Summary": "Honasa's color cosmetics brand Staze Beauty has launched a new marketing campaign titled 'Can't Staze Calm,' featuring three short films showcasing the brand's products in humorous scenarios. The campaign, created by Double Barrel Communications, aims to highlight product performance through comedic situations. Staze Beauty, launched last year, is part of Honasa Consumer Limited's portfolio, which includes Mamaearth and The Derma Co.",
            "Sentiment": "positive",
            "PublishDate": 1739785925000,
            "Source": "normal_news"
        },
        {
            "Title": "Honasa Consumer: Q3 Profit Flat, Revenue Up 6% YoY",
            "Summary": "Honasa Consumer reported Q3FY25 consolidated net profit of Rs 26 crore, unchanged from last year. Revenue rose 6% YoY to Rs 518 crore. EBITDA margin was 5%. Mamaearth brand expanded distribution by 22% YoY, reaching 216,814 retail outlets. Face wash and shampoo gained market share.",
            "Sentiment": "neutral",
            "PublishDate": 1739415412000,
            "Source": "earnings"
        },
        {
            "Title": "Honasa Consumer Ltd: Direct Distribution Scale-Up Impact Expected in Coming Quarters",
            "Summary": "Honasa Consumer Ltd's CEO Varun Alagh announced that the company's transition to a direct distribution model in top 50 cities is nearing completion, with 85% of inventory correction done. The full effect of this transition is expected in the next couple of quarters. The company's Q3 FY24 profit remained flat at ₹26 crore, while revenue rose 6% to ₹517.5 crore. Quick commerce sales increased to 7-8% of overall sales.",
            "Sentiment": "neutral",
            "PublishDate": 1739381086000,
            "Source": "earnings"
        },
        {
            "Title": "Honasa Consumer Reports Q3 EBITDA Decline",
            "Summary": "Honasa Consumer has reported a decrease in its Q3 EBITDA, which fell to 261 million rupees from 344 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 5.04% from 7.05% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739360124000,
            "Source": "earnings"
        },
        {
            "Title": "Honasa Consumer Reports Steady Q3 Financial Performance",
            "Summary": "Honasa Consumer, the parent company of Mamaearth, has announced its Q3 financial results. The company reported a consolidated net profit of 260 million rupees, slightly up from 259 million rupees in the same quarter last year. Revenue for Q3 increased to 5.18 billion rupees from 4.88 billion rupees year-over-year, showing modest growth.",
            "Sentiment": "neutral",
            "PublishDate": 1739360119000,
            "Source": "earnings"
        },
        {
            "Title": "Honasa Consumer: ICICI Prudential Increases Stake to 7.61%",
            "Summary": "ICICI Prudential has raised its stake in Honasa Consumer from 5.48% to 7.61%, causing the company's shares to jump up to 3% in morning trades on Saturday.",
            "Sentiment": "positive",
            "PublishDate": 1738387811000,
            "Source": "block_deals"
        },
        {
            "Title": "The Derma Co.: Skincare Brand Launches First Physical Store in Gurugram",
            "Summary": "The Derma Co., owned by Honasa Consumer Limited, opened its first exclusive brand outlet in Gurugram's Airia Mall. The store features an experiential center with beauty advisors and a skin analysis tool. This marks the digital-first brand's expansion into offline retail, responding to strong demand from existing channels.",
            "Sentiment": "positive",
            "PublishDate": 1738225830000,
            "Source": "corporate_action"
        },
        {
            "Title": "Honasa Consumer Limited: New Tech Chief Appointed to Drive Digital Innovation",
            "Summary": "Honasa Consumer Limited has appointed Lokesh Chhaparwal as Senior Vice President of Technology & Engineering on January 6, 2025. Chhaparwal will lead the company's technological strategy, focusing on integrating advanced tech solutions across digital platforms, supply chain processes, and marketing technologies. He brings over 13 years of experience in product engineering and data strategy.",
            "Sentiment": "positive",
            "PublishDate": 1736150036000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mamaearth: Partners with Zepto for Tree Planting Initiative",
            "Summary": "Mamaearth has partnered with Zepto to plant one tree for every Mamaearth product ordered through the Zepto app, starting January 3, 2025. The initiative combines Zepto's quick delivery service with Mamaearth's environmental commitment. A promotional campaign has been launched across digital platforms.",
            "Sentiment": "positive",
            "PublishDate": 1735886895000,
            "Source": "normal_news"
        },
        {
            "Title": "Honasa Consumer: Chief Business Officer Zairus Master Resigns",
            "Summary": "Zairus Master, Chief Business Officer of Honasa Consumer Ltd., parent company of Mamaearth, has resigned citing personal reasons. He will step down on February 28, 2025. This resignation coincides with the company's offline distribution restructuring, which has affected its financials. The company's stock has fallen 42% in the past six months, trading below its IPO price.",
            "Sentiment": "negative",
            "PublishDate": 1735871869000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Honasa Consumer Ltd: Chief Business Officer Resigns",
            "Summary": "Master Zairus, Chief Business Officer of Honasa Consumer Ltd, has resigned effective February 28, 2025, citing personal reasons. Zairus was designated as Senior Management Personnel (SMP) in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1735823247000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Honasa Consumer Ltd: Ships 99.2 Million Beauty Products in 2024, Skincare Leads Growth",
            "Summary": "Honasa Consumer Ltd delivered 99.2 million products across 18,700 pincodes in India during 2024. Skincare products dominated sales, with facewashes leading at 26.2 million units. Serum products emerged as a significant growth category. The company's portfolio includes brands such as Mamaearth, The Derma Co., Aqualogica, Dr. Sheths, BBlunt, and Staze Beauty.",
            "Sentiment": "positive",
            "PublishDate": 1735536430000,
            "Source": "result"
        },
        {
            "Title": "Mamaearth: Founder Ghazal Alagh Named Youngest Self-Made Woman Entrepreneur",
            "Summary": "Ghazal Alagh, 36, co-founder of Mamaearth, has been recognized as the youngest self-made woman entrepreneur in the IDFC FIRST Private & Hurun India's Top 200 self-made entrepreneurs list. Mamaearth's parent company, Honasa Consumer, is valued at Rs 15,500 crore, showing 55% year-on-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1734510930000,
            "Source": "normal_news"
        },
        {
            "Title": "Honasa Consumer Ltd: Meetu Mulchandani Elevated to Head of Brand Factory",
            "Summary": "Honasa Consumer Ltd has appointed Meetu Mulchandani as Vice President & Head of Brand Factory. Mulchandani, with nearly four years at the company, will oversee the entire brand creation process for emerging brands. CEO Varun Alagh praised her role in developing successful brands like Aqualogica and Dr. Sheth's.",
            "Sentiment": "positive",
            "PublishDate": 1733820483000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Honasa Consumer: Co-Founder Raises Stakes, Stock Hits Upper Circuit",
            "Summary": "Honasa Consumer Ltd's share price rose 10% to hit the upper circuit during intraday trading. The increase is attributed to news that a co-founder has raised their stake in the company.",
            "Sentiment": "positive",
            "PublishDate": 1733293754000,
            "Source": "normal_news"
        },
        {
            "Title": "Mamaearth Founder Increases Stake in Parent Company Honasa Consumer",
            "Summary": "Varun Alagh, founder of Mamaearth, has purchased additional shares in the parent company Honasa Consumer, increasing his stake to 31.93%. The investment of Rs 4.5 crore demonstrates confidence in the company's future prospects.",
            "Sentiment": "positive",
            "PublishDate": 1733270603000,
            "Source": "corporate_action"
        },
        {
            "Title": "Honasa Consumer: Co-Founder Increases Stake to 31.93%",
            "Summary": "Varun Alagh, Co-Founder of Honasa Consumer, invested ₹4.5 crore to increase his stake to 31.93%. Co-Founders now hold a combined 35% stake. The company reported a Q2 FY25 loss of ₹19 crore amid business transitions. Younger brands showed over 30% YTD growth, with focus categories contributing nearly 50% of total business.",
            "Sentiment": "neutral",
            "PublishDate": 1733238918000,
            "Source": "corporate_action"
        },
        {
            "Title": "Honasa Consumer Ltd: Appoints New Senior VP of Product and Data Analytics",
            "Summary": "Honasa Consumer Ltd has appointed Vipul Maheshwari as Senior Vice-President of Product and Data Analytics. Maheshwari, an IIT Delhi alumnus with four years at the company, will lead data-driven product development across the company's beauty and personal care brands. The company's shares were up 9.99% on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1732789893000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Honasa Consumer: Mamaearth Parent's Shares Hit 10% Upper Circuit",
            "Summary": "Honasa Consumer's stock hit a 10% upper circuit at Rs 251.5 on NSE with high trading volume. This rally follows a recent decline where the stock had fallen below its IPO price. The company reported a net loss of Rs 19 crore in Q2 FY25, contrasting with a profit in the same period last year. Revenues fell 7% year-on-year to Rs 462 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1732773768000,
            "Source": "normal_news"
        }
    ]
}