{
    "Symbol": "HONAUT",
    "ISIN": "INE671A01010",
    "News": [
        {
            "Title": "Honeywell Automation Q3FY26 Results Announced",
            "Summary": "Honeywell Automation India reported Q3FY26 revenue of ₹11,687 million and net profit of ₹1,212 million. Nine-month revenue reached ₹35,012 million with profit at ₹3,653 million for period ended December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770035936660,
            "Source": "co_actions_results"
        },
        {
            "Title": "Honeywell Automation Shareholders Approve Directors",
            "Summary": "Honeywell Automation India Limited shareholders approved appointment of Jake Morgan Wasserman as Non-Executive Director and re-appointment of Dr. Ganesh Natarajan as Independent Director through postal ballot.",
            "Sentiment": "positive",
            "PublishDate": 1769790362400,
            "Source": "stocks"
        },
        {
            "Title": "Honeywell bets on Forge platform and physical AI",
            "Summary": "Honeywell CEO Vimal Kapur outlines automation growth strategy at Davos 2026, highlighting Forge platform and physical AI as key drivers for mid-single-digit revenue growth amid three-way corporate split.",
            "Sentiment": "positive",
            "PublishDate": 1769004927070,
            "Source": "global"
        },
        {
            "Title": "Honeywell Automation Board Meet on Feb 2 for Q3FY26",
            "Summary": "Honeywell Automation India Limited announces board meeting scheduled for February 2, 2026 to consider Q3FY26 unaudited financial results. Trading window closed from January 1-February 4, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767752359942,
            "Source": "co_actions_results"
        },
        {
            "Title": "Honeywell Automation India Reports Q2 Results; Board Approves Director Changes",
            "Summary": "Honeywell Automation India Limited's Board of Directors approved the unaudited standalone financial results for the second quarter and half year ended September 30, 2025. The company reported a profit of ₹1,195 million for Q2 2025, compared to ₹1,351 million in Q2 2024. Total income for the quarter was ₹14,936 million versus ₹12,240 million in the previous quarter. For the half year, profit stood at ₹2,441 million against ₹2,516 million in the same period last year. The company maintains cash and cash equivalents of ₹30,613 million as of September 30, 2025. In leadership changes, Pedro Thena Garrote resigned as Non-Executive Non-Independent Director, and Jake Morgan Wasserman was appointed as Additional Non-Executive Non-Independent Director, both effective November 5, 2025. The Board meeting was held from 2:00 p.m. to 3:45 p.m. IST on November 5, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762374467844,
            "Source": "earnings"
        },
        {
            "Title": "Honeywell Automation India Appoints Jake Morgan Wasserman as Director, Pedro Thena Garrote Resigns",
            "Summary": "Honeywell Automation India Limited announced board changes effective November 5, 2025. The company appointed Jake Morgan Wasserman (DIN: 11364789) as Additional Non-Executive Non-Independent Director, subject to shareholder approval. Wasserman serves as Vice President and General Counsel for Mergers & Acquisitions at Honeywell, holds a Juris Doctorate from Duke University School of Law, and has expertise in corporate governance and strategic transactions. Simultaneously, Pedro Thena Garrote (DIN: 10741347) resigned from his position as Non-Executive Non-Independent Director due to career opportunities outside Honeywell. The board accepted his resignation and acknowledged his contributions during his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1762371222179,
            "Source": "corporate_governance"
        },
        {
            "Title": "Honeywell Automation Reports Mixed Q2 Results with Revenue Growth but Margin Decline",
            "Summary": "Honeywell Automation reported Q2 net profit of 1.19 billion rupees compared to 1.15 billion rupees in the same period last year. Revenue increased to 11.49 billion rupees from 10.24 billion rupees year-over-year. EBITDA rose to 1.31 billion rupees from 1.29 billion rupees, while EBITDA margin decreased to 11.45% from 12.6% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762340500142,
            "Source": "earnings"
        },
        {
            "Title": "Honeywell Automation India Schedules Board Meeting for Financial Results Approval",
            "Summary": "Honeywell Automation India Limited has scheduled a Board of Directors meeting on November 5, 2025 to consider and approve unaudited financial results for the quarter and half year ended September 30, 2025. The company has closed its trading window for designated persons from October 1, 2025 until November 7, 2025, which is 48 hours after the financial results are made public. The announcement was made through a regulatory communication to BSE and NSE stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1760354681758,
            "Source": "corporate_action"
        },
        {
            "Title": "Honeywell Automation Reports Mixed Q1 Results with Revenue Growth and Profit Decline",
            "Summary": "Honeywell Automation reported quarterly results showing net profit of 1.24 billion rupees compared to 1.36 billion rupees in the same period last year, representing a decline. However, the company's revenue increased to 11.83 billion rupees from 9.6 billion rupees year-over-year, indicating strong top-line growth despite lower profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1754044874495,
            "Source": "earnings"
        },
        {
            "Title": "Honeywell Automation: Q4 Revenue Up 17%, Declares ₹105 Dividend",
            "Summary": "Honeywell Automation's Q4 revenue increased 17.2% YoY to ₹1,114.5 crore. Net profit fell 5.4% to ₹140 crore. EBITDA dropped 6.25% to ₹159.4 crore. Margins contracted to 14.3% from 17.9%. Board recommends final dividend of ₹105 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1747143127000,
            "Source": "earnings"
        },
        {
            "Title": "Honeywell Automation Reports Q4 Results and Dividend",
            "Summary": "Honeywell Automation has announced its Q4 financial results and a dividend recommendation. The company's Q4 net profit decreased to 1.4 billion rupees from 1.48 billion rupees year-over-year. Revenue increased to 11.1 billion rupees from 9.51 billion rupees. EBITDA fell to 1.6 billion rupees from 1.7 billion, with EBITDA margin decreasing to 14.30% from 17.87%. The company has recommended a dividend of 105 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747141952000,
            "Source": "result"
        },
        {
            "Title": "Honeywell Automation Reports Q3 Financial Results",
            "Summary": "Honeywell Automation has announced its financial results for the third quarter. The company reported a net profit of 1.32 billion rupees, compared to 1.28 billion rupees in the same period last year. Revenue for Q3 stood at 10.91 billion rupees, up from 10.7 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739146476000,
            "Source": "earnings"
        },
        {
            "Title": "Honeywell Automation Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Honeywell Automation has reported a decrease in its third quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 1.42 billion rupees from 1.61 billion rupees in the same quarter of the previous year. Additionally, the EBITDA margin decreased to 13.02% from 15.00% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738928989000,
            "Source": "earnings"
        },
        {
            "Title": "Honeywell Automation Reports Increased Q3 Profit and Revenue",
            "Summary": "Honeywell Automation has announced its financial results for the third quarter. The company's net profit rose to 1.32 billion rupees, up from 1.28 billion rupees in the same period last year. Revenue also increased to 10.91 billion rupees from 10.7 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738928982000,
            "Source": "earnings"
        },
        {
            "Title": "Honeywell Automation India Ltd: India Remains Key Growth Market, Focus on Energy Transition",
            "Summary": "Anant Maheshwari, CEO of Honeywell's High Growth Region, affirms India as a crucial growth market for Honeywell Automation India Ltd, particularly in energy transition. The company is focusing on aviation, automation, and energy transition technologies. Honeywell has significant engineering presence in India and is investing in local innovation, especially in energy transition and biofuels. The company appreciates India's clear policy framework and entrepreneurial spirit, and commits to continued investment in the country.",
            "Sentiment": "positive",
            "PublishDate": 1737641536000,
            "Source": "normal_news"
        },
        {
            "Title": "Honeywell Automation India Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for Honeywell Automation India Ltd. The transaction involved approximately 28,216 shares, valued at Rs. 116.09 crores. The trade was executed at a price of Rs. 41,143.95 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1735019717000,
            "Source": "block_deals"
        },
        {
            "Title": "Honeywell: Driving India's Energy Transition with Innovative Solutions",
            "Summary": "Honeywell India is focusing on energy transition, sustainability, industrial automation, and aviation to support India's sustainable future. The company is developing technologies in green hydrogen, sustainable materials, and AI-enabled operations. Honeywell sees significant growth potential in India's aviation sector and is prepared to provide technology for Sustainable Aviation Fuel (SAF) production.",
            "Sentiment": "positive",
            "PublishDate": 1731417053000,
            "Source": "normal_news"
        },
        {
            "Title": "Honeywell Automation Q2 EBITDA Slightly Down, Margin Improves",
            "Summary": "Honeywell Automation reported Q2 EBITDA of 1.3 billion rupees, down from 1.38 billion rupees year-over-year. However, the EBITDA margin improved slightly to 12.60% from 12.52% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730204924000,
            "Source": "result"
        },
        {
            "Title": "Honeywell Automation Reports Q2 Revenue Decline",
            "Summary": "Honeywell Automation India Limited has reported a revenue of 10.24 billion rupees for the second quarter, down from 11 billion rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1730204915000,
            "Source": "result"
        },
        {
            "Title": "Honeywell Automation Reports Q2 Net Profit of 1.15B Rupees",
            "Summary": "Honeywell Automation has reported a net profit of 1.15 billion rupees for the second quarter. This represents a year-over-year decrease from 1.22 billion rupees and a quarter-over-quarter decrease from 1.36 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1730204906000,
            "Source": "result"
        },
        {
            "Title": "Honeywell Wins Airfield Ground Lighting Project for Noida International Airport",
            "Summary": "<p>Honeywell Automation has been <span class='positive'>awarded</span> a contract to implement an <span class='positive'>advanced</span> airfield ground lighting system at the <b>Noida International Airport</b>. This system will <span class='positive'>improve</span> visual guidance for aircraft operations, <span class='positive'>enhancing</span> safety and efficiency at the new airport.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728913271000,
            "Source": "corporate_action"
        },
        {
            "Title": "Honeywell Automation India: Secures Contract for Noida Airport Lighting System",
            "Summary": "<p><span class='positive'>Honeywell Automation India Ltd (HAIL)</span> has been <b>awarded a contract</b> to provide and maintain the <span class='neutral'>airfield ground lighting system</span> for <span class='neutral'>Noida International Airport's</span> runway 10L-28R and associated taxiways. The system uses <span class='positive'>intelligent lighting technology</span> to enhance aircraft maneuvering and pilot situational awareness. The airport's <b>first phase</b> is set to begin <span class='positive'>commercial operations</span> early next year with a capacity of <b>12 million passengers annually</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728905487000,
            "Source": "normal_news"
        }
    ]
}