{
    "Symbol": "HONDAPOWER",
    "ISIN": "INE634A01018",
    "News": [
        {
            "Title": "Honda India Power Products Board Meet on Feb 13",
            "Summary": "Honda India Power Products Limited has scheduled its board meeting for February 13, 2026, to consider Q3FY26 unaudited financial results and interim dividend declaration with record date set for February 19, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770008750570,
            "Source": "co_actions_results"
        },
        {
            "Title": "Honda India Power Products Receives OCEMS Installation Directive from UP Pollution Control Board",
            "Summary": "Honda India Power Products Limited received directions from Uttar Pradesh Pollution Control Board to install and connect Online Continuous Emission Monitoring Systems (OCEMS) for its boilers, melting furnaces and ovens to CPCB and UPPCB servers. The company stated there is no material impact on its financial, operational or other activities due to this regulatory notice.",
            "Sentiment": "neutral",
            "PublishDate": 1763543926533,
            "Source": "stock"
        },
        {
            "Title": "Honda India Power Products Reports Mixed Financial Performance in Q2 Results",
            "Summary": "Honda India Power Products Limited reported unaudited financial results for the quarter and half-year ended September 30, 2025, with total income of ₹18,509 lakhs for the quarter compared to ₹20,058 lakhs in the previous quarter. The company's Board of Directors approved these results in a meeting held on November 13, 2025, showing fluctuating revenue performance in its power products business segment.",
            "Sentiment": "negative",
            "PublishDate": 1763061727820,
            "Source": "earnings"
        },
        {
            "Title": "Honda India Power Products Reports Mixed Q2 Results with Higher Profitability Despite Revenue Decline",
            "Summary": "Honda India Power Products delivered mixed quarterly results with net profit rising to 112 million rupees from 85.4 million rupees year-over-year. EBITDA increased significantly to 113 million rupees compared to 70 million rupees in the same period last year, while EBITDA margin expanded to 6.45% from 3.95%. However, revenue declined to 1.76 billion rupees from 1.8 billion rupees year-over-year, indicating improved operational efficiency despite lower sales.",
            "Sentiment": "neutral",
            "PublishDate": 1763036067667,
            "Source": "earnings"
        },
        {
            "Title": "Honda India Power Products Approves Business Expansion into Electric Motors and Appoints New Secretarial Auditor",
            "Summary": "Honda India Power Products Limited received member approval for alterations to its Memorandum of Association Object Clause, subject to Registrar of Companies approval. The company plans to expand operations to include design, development, and manufacturing of electric motor units branded as 'eGX' for noise and emission-sensitive environments including educational institutions, hospitals, and residential construction zones. Members also approved the appointment of TVA & Co. LLP as Secretarial Auditor for five consecutive years from FY 2025-26 to FY 2029-30. The approvals were granted during a member meeting held on September 25, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758784574786,
            "Source": "corporate_action"
        },
        {
            "Title": "Honda Activa Prices Drop by Up to Rs 7,831 Following GST Rate Cut on Two-Wheelers",
            "Summary": "Honda Activa scooters have become more affordable after the government reduced GST on two-wheelers up to 350cc from 28% to 18%, effective September 22. The price reductions range from Rs 6,332 to Rs 7,831 across different Activa models. The Honda Activa 110 STD now costs Rs 74,713 (down from Rs 81,045), while the top-end Activa 125 H-Smart is priced at Rs 92,411 (reduced from Rs 1,00,242). Other Honda scooters including the Dio series also received price cuts ranging from Rs 5,861 to Rs 7,626. Finance Minister Nirmala Sitharaman announced these GST reforms to simplify the tax framework and provide consumer relief. The price cuts affect nearly 98% of India's two-wheeler market, which consists of scooters and motorcycles below 350cc, and are expected to boost festive-season sales.",
            "Sentiment": "positive",
            "PublishDate": 1758632546128,
            "Source": "stock"
        },
        {
            "Title": "Honda Offers Up to Rs 19,000 Benefits on Two-Wheelers Following GST Rate Cuts",
            "Summary": "Honda announced benefits of up to Rs 19,000 on its motorcycles and scooters, passing the full benefit of revised GST rates to customers. The government implemented a new GST structure from September 22, reducing tax rates for two-wheelers with engines below 350cc from 28% to 18%. Popular Honda models received significant price cuts: Activa 110 (up to Rs 7,874 off), Dio 110 (up to Rs 7,157 off), Activa 125 (around Rs 8,259 reduction), and Dio 125 (around Rs 8,042 cheaper). Commuter bikes also benefited with Shine 100 getting Rs 5,672 off, Shine 100 DX receiving Rs 6,256 reduction, and Livo 110 becoming cheaper by Rs 7,165. However, premium motorcycles with engines above 350cc now face a higher GST rate of 40%, making models in the 450cc and 650cc range more expensive. The move is expected to boost demand in the two-wheeler market, particularly in mid-range segments.",
            "Sentiment": "positive",
            "PublishDate": 1758082215176,
            "Source": "stock"
        },
        {
            "Title": "Honda India Power Products Reports 6.4% Revenue Growth But 41% Profit Decline, Declares ₹100 Interim Dividend",
            "Summary": "Honda India Power Products Limited reported mixed quarterly results with total income rising 6.4% to ₹16,483 lakhs compared to ₹15,490 lakhs in the same period last year. However, profitability declined sharply with net profit before tax falling 41.4% to ₹1,279 lakhs from ₹2,183 lakhs, while net profit after tax dropped 41.3% to ₹948 lakhs from ₹1,615 lakhs. Despite the profit decline, the company declared a substantial interim dividend of ₹100 per share (1000%) for the fiscal year, indicating strong cash flows and commitment to shareholder returns.",
            "Sentiment": "neutral",
            "PublishDate": 1755146055272,
            "Source": "earnings"
        },
        {
            "Title": "Honda India Power Products Reports 49% Drop in Q1 EBITDA Despite Revenue Growth",
            "Summary": "Honda India Power Products reported Q1 EBITDA of 84 million rupees, down from 165 million rupees in the same period last year. The EBITDA margin compressed to 5.45% from 11.43% year-over-year. Net profit declined to 95 million rupees from 162 million rupees in the previous year's quarter. However, revenue increased to 1.55 billion rupees compared to 1.44 billion rupees in the corresponding period last year.",
            "Sentiment": "negative",
            "PublishDate": 1755002988701,
            "Source": "earnings"
        },
        {
            "Title": "Honda India Power Products Declares 1000% Interim Dividend, Reports Quarterly Results",
            "Summary": "Honda India Power Products Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs. 15,491 lakhs and profit for the period of Rs. 948 lakhs. Earnings per share stood at Rs. 9.35. The Board declared an interim dividend of 1000% (Rs. 100 per equity share of Rs. 10 each) for Financial Year 2025-26, with a record date of August 21, 2025, and disbursement by September 11, 2025. The company also approved amendments to its Memorandum of Association to expand business operations to include design, development, and manufacturing of electric motor units branded as 'eGX', targeting noise and emission-sensitive environments. These amendments require shareholder approval at the upcoming Annual General Meeting.",
            "Sentiment": "positive",
            "PublishDate": 1755000555325,
            "Source": "corporate_action"
        },
        {
            "Title": "Honda India Power Products Schedules Board Meeting to Consider Q1 Results and Interim Dividend",
            "Summary": "Honda India Power Products Limited has scheduled its 2nd Board Meeting for FY 2025-26 on August 12, 2025. The board will consider and approve unaudited financial results for the quarter ended June 30, 2025, and evaluate declaring an interim dividend on equity shares. The record date for determining members eligible for interim dividend has been set as August 21, 2025. The company's trading window remains closed from July 1, 2025 to August 14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754107314687,
            "Source": "corporate_action"
        },
        {
            "Title": "Honda India Power Products Reports Q4 Financial Results and Dividend",
            "Summary": "Honda India Power Products has reported its Q4 financial results. The company's net profit for Q4 was 362 million rupees, compared to 158 million rupees year-over-year and 191 million rupees quarter-over-quarter. Q4 revenue was 2.7 billion rupees, up from 2.3 billion rupees in the same quarter last year. The company has recommended a dividend of 21.5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747700327000,
            "Source": "default"
        },
        {
            "Title": "Honda India Power Products Reports Q4 Results and Dividend",
            "Summary": "Honda India Power Products announced its Q4 financial results and dividend. The company recommended a dividend of 21.5 rupees per equity share. For Q4, EBITDA increased to 434 million rupees from 104.5 million rupees year-over-year, with EBITDA margin improving to 16.15% from 4.25%. Net profit rose to 362 million rupees, up from 158 million rupees year-over-year and 191 million rupees quarter-over-quarter. Revenue for Q4 was 2.7 billion rupees, compared to 2.3 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747658121000,
            "Source": "result"
        },
        {
            "Title": "Honda India Power Products: Q3 Profit Plunges 32.59% YoY",
            "Summary": "Honda India Power Products reported Q3 FY25 results with profit falling 32.59% YoY to ₹19.09 crore. Revenue decreased 22.48% YoY to ₹204.18 crore. However, QoQ performance improved with revenue up 15.23% and profit surging 123.54%. EPS stood at ₹18.82, down 32.59% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1739255662000,
            "Source": "earnings"
        },
        {
            "Title": "Honda India Power Products Declares Dividend",
            "Summary": "Honda India Power Products has announced a dividend of 10 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1739191306000,
            "Source": "corporate_action"
        },
        {
            "Title": "Honda India Power Products Reports Decline in Q3 EBITDA",
            "Summary": "Honda India Power Products experienced a decrease in its third-quarter EBITDA, which fell to 208 million rupees from 330 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 10.19% from 12.53% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739191206000,
            "Source": "earnings"
        },
        {
            "Title": "Honda India Power Products Reports Q3 Financial Results",
            "Summary": "Honda India Power Products has announced its financial results for the third quarter. The company reported a net profit of 191 million rupees, which is lower compared to 283 million rupees in the same quarter last year (YoY) and 85 million rupees in the previous quarter (QoQ). The company's revenue for Q3 stood at 2.04 billion rupees, down from 2.6 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739191094000,
            "Source": "earnings"
        },
        {
            "Title": "Honda India Power Products Reports Significant Drop in Q2 EBITDA",
            "Summary": "Honda India Power Products experienced a substantial decline in its Q2 EBITDA, falling from 352 million rupees in the previous year to 70 million rupees. The company's EBITDA margin also decreased significantly, dropping from 12.38% to 3.95% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731586085000,
            "Source": "result"
        },
        {
            "Title": "Honda India Power Products Reports Q2 Revenue Decline",
            "Summary": "Honda India Power Products has reported a significant decrease in revenue for the second quarter. The company's revenue dropped to 1.8 billion rupees, compared to 2.8 billion rupees in the same quarter of the previous year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1731585932000,
            "Source": "result"
        },
        {
            "Title": "Honda India Power Products Reports Q2 Net Profit Decline",
            "Summary": "Honda India Power Products has reported a net profit of 85.4 million rupees for the second quarter, showing a significant decrease from 312 million rupees in the same period last year. The profit also declined from 161.5 million rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1731585888000,
            "Source": "result"
        }
    ]
}