{
    "Symbol": "HPAL",
    "ISIN": "INE0GSL01024",
    "News": [
        {
            "Title": "HP Adhesives Board Meet on Feb 12 for Q3FY26 Results",
            "Summary": "HP Adhesives Limited has scheduled its board meeting for February 12, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770361018686,
            "Source": "co_actions_results"
        },
        {
            "Title": "HP Adhesives Gets CARE BBB Rating Reaffirmation",
            "Summary": "CARE Ratings reaffirmed HP Adhesives' BBB/A3+ rating for ₹37.96 crore bank facilities with Rating Watch Negative outlook, while withdrawing rating for long-term facilities.",
            "Sentiment": "neutral",
            "PublishDate": 1769768878856,
            "Source": "stocks"
        },
        {
            "Title": "HP Adhesives Reports No Deviation in IPO Fund Utilization for Quarter Ended September 2025",
            "Summary": "HP Adhesives Limited submitted its monitoring agency report showing no deviation from stated IPO fund utilization objectives for the quarter ended September 30, 2025, with ICICI Bank serving as the monitoring agency. The company raised ₹1134.3 million through its December 2021 public issue for working capital, capital expenditure expansion, and general corporate purposes, with some delays in capex implementation timeline but no impact on production capacity.",
            "Sentiment": "neutral",
            "PublishDate": 1763063735001,
            "Source": "stock"
        },
        {
            "Title": "HP Adhesives Reports 772.75 Lakh Net Profit for Half Year Ended September 2025",
            "Summary": "HP Adhesives Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported consolidated revenue from operations of 13,116.52 lakh for the half year, compared to 11,945.22 lakh in the previous year. Net profit after tax reached 772.75 lakh for the half year versus 978.18 lakh in the corresponding period last year. For the quarter ended September 30, 2025, the company posted revenue of 6,506.03 lakh and net profit of 353.37 lakh. The company operates primarily in the adhesives sealants segment and has a wholly owned subsidiary, Unitybond Solutions Private Limited. During the period, HP Adhesives faced a GST audit demand of 311.01 lakh, of which 32.34 lakh was paid and reported as exceptional items, while the balance amount is being contested. The company's earnings per share for the half year stood at 0.84 rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1762973345065,
            "Source": "earnings"
        },
        {
            "Title": "HP Adhesives Appoints Swati Talgaonkar as Company Secretary and Compliance Officer",
            "Summary": "HP Adhesives Limited appointed Ms. Swati Talgaonkar as Company Secretary and Compliance Officer, effective September 24, 2025. The appointment was approved by the Board of Directors during their meeting on September 23, 2025. Ms. Talgaonkar is a Member of the Institute of Company Secretaries of India, holds a Bachelor of Law degree, and brings over 9 years of experience in Companies Act matters, listing compliances, and allied laws.",
            "Sentiment": "neutral",
            "PublishDate": 1758626331698,
            "Source": "corporate_governance"
        },
        {
            "Title": "HP Adhesives Limited Publishes Unaudited Financial Results for Quarter Ended June 30, 2025",
            "Summary": "HP Adhesives Limited published its unaudited financial results for the quarter ended June 30, 2025 in newspapers. The Board of Directors approved the results on August 8, 2025, and they were published in Active Times (English) and Mumbai Lakshadeep (Marathi) on August 10, 2025. The company informed the National Stock Exchange of India Limited and BSE Limited about the newspaper publication as per regulatory requirements. The results include both standalone and consolidated financial statements along with a Limited Review Report.",
            "Sentiment": "neutral",
            "PublishDate": 1754907662940,
            "Source": "earnings"
        },
        {
            "Title": "HP Adhesives Approves Quarterly Results and Key Leadership Reappointments",
            "Summary": "HP Adhesives Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The board approved reappointment of three Independent Directors - Surendra Kumar Mehta, Ajeet Anant Walavalkar, and Rajendra Kumar Jain - for second terms of five years each, with terms beginning in 2026. Managing Director Karan Motwani was reappointed for five years from May 2026 to April 2031. The company also approved reappointment of Priya Choudhary & Associates LLP as Statutory Auditors for a second five-year term and appointed Shivam Sharma & Associates as Secretarial Auditors for five years. Company Secretary Jyoti Chawda resigned effective August 9, 2025. All reappointments are subject to shareholder approval at the upcoming Annual General Meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1754658399316,
            "Source": "earnings"
        },
        {
            "Title": "HP Adhesives Ltd Reports Q4 Financial Results",
            "Summary": "HP Adhesives Ltd has released its Q4 financial results. The company's EBITDA decreased to 56 million rupees from 88.6 million rupees year-over-year. The EBITDA margin also declined to 8.48% from 14.92% in the same period. Net profit for Q4 was 41 million rupees, down from 56.1 million rupees year-over-year but slightly up from 40 million rupees quarter-over-quarter. Revenue increased to 662 million rupees from 594 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747148974000,
            "Source": "result"
        },
        {
            "Title": "HP Adhesives Reports Decline in Q3 EBITDA and Margin",
            "Summary": "HP Adhesives has reported its Q3 financial results, showing a decrease in both EBITDA and EBITDA margin compared to the same period last year. The company's EBITDA for Q3 stood at 63 million rupees, down from 78 million rupees in the previous year. The EBITDA margin also declined to 9.42% from 14.21% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739368835000,
            "Source": "earnings"
        },
        {
            "Title": "HP Adhesives Reports Mixed Q3 Financial Results",
            "Summary": "HP Adhesives has announced its financial results for the third quarter. The company reported a net profit of 42 million rupees, down from 52 million rupees in the same period last year. However, revenue increased to 667 million rupees from 547 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739368829000,
            "Source": "earnings"
        },
        {
            "Title": "HP Adhesives Reports Q2 EBITDA Decline",
            "Summary": "HP Adhesives has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 was 65 million rupees, down from 73 million rupees in the same quarter last year. The EBITDA margin also decreased to 11.01% from 11.74% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731505070000,
            "Source": "result"
        },
        {
            "Title": "HP Adhesives Reports Q2 Financial Results",
            "Summary": "HP Adhesives has released its Q2 financial results. The company reported a net profit of 41 million rupees, down from 52 million rupees year-over-year and 56 million rupees quarter-over-quarter. Revenue for Q2 stood at 589 million rupees, compared to 626 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1731505016000,
            "Source": "result"
        },
        {
            "Title": "HP: Launches AI-Powered OmniBook Ultra Flip in India",
            "Summary": "HP introduces OmniBook Ultra Flip, a 2-in-1 AI PC with Intel Lunar Lake processors, targeting freelancers and creators. Features include a 2.8K OLED display, 9MP AI camera, and up to 21 hours battery life. Priced from ₹1,81,999 for Ultra 7 model, available in Eclipse Grey and Atmospheric Blue.",
            "Sentiment": "positive",
            "PublishDate": 1729614459000,
            "Source": "normal_news"
        }
    ]
}