{
    "Symbol": "HPL",
    "ISIN": "INE495S01016",
    "News": [
        {
            "Title": "HPL Electric Board Meet Set for Feb 5 for Q3 Results",
            "Summary": "HPL Electric & Power Limited has scheduled a board meeting on February 05, 2026, to consider and approve Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769758562042,
            "Source": "co_actions_results"
        },
        {
            "Title": "HPL Electric Launches Neeram Pulse Water Meter",
            "Summary": "HPL Electric & Power Limited announces the launch of its new 'Neeram Pulse' water meter for the domestic market on January 29, 2026, as per SEBI regulatory disclosure requirements.",
            "Sentiment": "positive",
            "PublishDate": 1769665410196,
            "Source": "stocks"
        },
        {
            "Title": "PM Modi to inaugurate HPCL's 9 MMT Pachpadra refinery",
            "Summary": "Prime Minister Narendra Modi will flag off HPCL Rajasthan's 9 MMT per annum integrated refinery-cum-petrochemical complex at Pachpadra in January, expected to significantly boost Rajasthan's economy.",
            "Sentiment": "positive",
            "PublishDate": 1767119349753,
            "Source": "stocks"
        },
        {
            "Title": "HPL Electric Promoter Companies Change Names",
            "Summary": "HPL Electric & Power Limited announces name changes for two promoter companies - Havells Private Limited to HPL Holdings Private Limited and Havells Electronics Private Limited to HPL Electronics Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1765444069827,
            "Source": "stocks"
        },
        {
            "Title": "HPL Electric Power Reports Q2 H1 FY26 Results with Consumer Industrial Segment Contributing 47% of Revenue",
            "Summary": "HPL Electric Power's Consumer Industrial segment grew 30% in Q2 and 23% in H1, now contributing 47% of total revenue, while the company maintains an order book of over 3,300 crore with 99% being smart meters. The company expects strong growth in Q3 and Q4 driven by confirmed delivery schedules from AMISPs, with metering segment EBIT margins improving to around 17.5% despite softer revenues.",
            "Sentiment": "positive",
            "PublishDate": 1763789968002,
            "Source": "earnings"
        },
        {
            "Title": "HPL Electric & Power Targets 25% Revenue CAGR With Smart Meter Expansion",
            "Summary": "HPL Electric & Power outlined multi-year growth plans driven by smart meter demand and switchgear exports, with a ₹700 crore order book in Advanced Metering Infrastructure. The company is expanding manufacturing capacity by 40% for smart meters and lighting while targeting 25% revenue CAGR over 3 years with improved working-capital cycle.",
            "Sentiment": "neutral",
            "PublishDate": 1763137101444,
            "Source": "earnings"
        },
        {
            "Title": "HPL Electric Power Limited Settles Long-Pending Trademark Disputes with Havells India Limited",
            "Summary": "HPL Electric Power Limited and its promoters including Havells Electronics Pvt Ltd., Havells Private Limited, HPL India Limited, and promoters Lalit Seth, Rishi Seth, and Gautam Seth have signed a settlement agreement with Havells India Limited and its promoter entity. The settlement resolves all long-pending disputes and litigations related to the use of the word/mark 'HAVELLS', including suits pending in the Delhi High Court and Special Leave Petitions in the Supreme Court of India. The Delhi High Court had referred these disputes to mediation, and the settlement was executed on November 8, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762665346585,
            "Source": "stock"
        },
        {
            "Title": "HPCL Expects 5% Energy Demand Growth as India Targets 7% GDP Growth",
            "Summary": "HPCL Chairman and Managing Director Vikas Kaushal stated that India's energy demand is expected to rise 5% if the economy grows at 7%. Speaking at the 12th SBI Banking & Economics Conclave, Kaushal described HPCL's recent quarterly results as 'blockbuster' and highlighted that the company crossed ₹1 lakh crore in market capitalization on October 30. He noted sufficient global crude oil availability but emphasized the challenge of matching supply with demand efficiently. HPCL can process 180 different types of crude oil and maintains strict compliance with international sanctions, avoiding sanctioned cargoes. The company is focusing on operational efficiency and has diversified its sourcing base, with some US cargoes becoming more economical due to larger shipping capacities and lower production costs.",
            "Sentiment": "positive",
            "PublishDate": 1762441241919,
            "Source": "stock"
        },
        {
            "Title": "HPCL and Nippon Life India Asset Management Announce Interim Dividends with November 6 Record Date",
            "Summary": "HPCL declared an interim dividend of Rs 5 per share, while Nippon Life India Asset Management announced Rs 9 per share as interim dividend. Both companies set November 6 as the record date for dividend eligibility. Due to India's T+1 settlement cycle, investors must own shares by November 4 to qualify for the dividend payments. Share India Securities Ltd., TD Power Systems Ltd., and Vaibhav Global Ltd. will also trade ex-dividend on the same date. Dividend income exceeding Rs 5,000 annually is subject to 10% TDS for resident individuals.",
            "Sentiment": "positive",
            "PublishDate": 1762223510116,
            "Source": "corporate_action"
        },
        {
            "Title": "HPCL Reports Decline in Quarterly Financial Performance",
            "Summary": "HPCL reported quarterly net profit of 38.3 billion rupees, down from 43.7 billion rupees in the previous quarter. Revenue decreased to 1.09 trillion rupees from 1.19 trillion rupees quarter-on-quarter. EBITDA fell to 68.9 billion rupees from 76 billion rupees, while EBITDA margin slightly declined to 6.28% from 6.36% in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1761783106473,
            "Source": "earnings"
        },
        {
            "Title": "HPL Electric & Power Receives Increased Smart Meter Order Worth INR 92 Crores",
            "Summary": "HPL Electric & Power announced an increase in its smart meter supply order value to INR 92 crores from the previous INR 65.72 crores. The order conditions remain unchanged despite the value enhancement of approximately INR 26.28 crores.",
            "Sentiment": "positive",
            "PublishDate": 1760001804409,
            "Source": "order&deals"
        },
        {
            "Title": "HPL Electric & Power Secures ₹65.72 Crore Smart Meter Supply Order",
            "Summary": "HPL Electric & Power has secured an order worth ₹65.72 crores to supply smart meters from regular customers. The order represents business from the company's existing customer base in the smart meter segment.",
            "Sentiment": "positive",
            "PublishDate": 1758794221726,
            "Source": "order&deals"
        },
        {
            "Title": "HPL Electric Reports Mixed Q1FY26 Results with Smart Meter Delays but Consumer Business Growth",
            "Summary": "HPL Electric & Power Limited reported mixed quarterly results with consolidated revenues declining 2.5% due to delays in smart meter dispatches caused by monsoon disruptions and slower execution by AMISPs (Advanced Metering Infrastructure Service Providers). However, the Consumer & Industrial segment showed strong performance with 16% revenue growth and margins crossing 11%, while wires and cables grew 35%. Despite revenue decline, profitability improved with gross margins expanding 230 basis points, EBITDA margin up 85 basis points, and PAT increasing 8.5% to ₹18.5 crore. The company maintains a smart meter order book of over ₹3,000 crore and expects sequential improvement in Q2 with stronger momentum in H2. Management indicated July showed good performance and execution pace is picking up. The company targets Consumer & Industrial business to cross ₹1,000 crore revenue by FY28 and expects to achieve 100,000 retailers by FY26 from current 85,000. Working capital improved with debtor days reduced by 28 days and net working capital down ₹60 crores despite sales growth.",
            "Sentiment": "neutral",
            "PublishDate": 1756123550166,
            "Source": "earnings"
        },
        {
            "Title": "HPL Electric & Power Plans Multi-Year Growth Strategy with Smart Metering and Export Focus",
            "Summary": "HPL Electric & Power is targeting multi-year growth through expansion in smart metering, government electrification projects, and increased export activities. The company is supported by an order book exceeding ₹1,000 crores and is focusing on product innovation in switchgear and lighting segments.",
            "Sentiment": "positive",
            "PublishDate": 1755104776595,
            "Source": "stock"
        },
        {
            "Title": "HPL Electric & Power Reports Q1 FY26 Results, Reappoints Auditors",
            "Summary": "HPL Electric & Power Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 39,696.89 lakhs compared to Rs 39,008.49 lakhs in the same quarter last year. Net profit stood at Rs 1,694.45 lakhs versus Rs 1,678.63 lakhs in the corresponding period. Basic earnings per share was Rs 2.64 compared to Rs 2.61 in the previous year quarter. On a consolidated basis, revenue from operations was Rs 38,302.87 lakhs against Rs 39,290.56 lakhs in the year-ago quarter, while net profit attributable to owners was Rs 1,842.90 lakhs compared to Rs 1,702.31 lakhs. The Board also reappointed M/s. M.K. Singhal & Co. as Cost Auditor, PricewaterhouseCoopers Services LLP as Internal Auditor for FY 2025-26, and M/s. AVA Associates as Secretarial Auditor for the period from April 1, 2025 to March 31, 2030.",
            "Sentiment": "positive",
            "PublishDate": 1755086126563,
            "Source": "earnings"
        },
        {
            "Title": "HPCL Reports 30% Jump in Quarterly Net Profit to ₹43.7 Billion",
            "Summary": "HPCL posted a net profit of ₹43.7 billion in its latest quarterly results, marking a significant increase from ₹33.5 billion in the previous quarter. The company's revenue grew marginally to ₹1.19 trillion from ₹1.18 trillion quarter-on-quarter. EBITDA rose substantially to ₹76 billion compared to ₹58 billion in the preceding quarter, while EBITDA margin improved to 6.36% from 4.93%.",
            "Sentiment": "positive",
            "PublishDate": 1754612980857,
            "Source": "earnings"
        },
        {
            "Title": "HPL Electric & Power Reports Q4 Profit and Revenue Growth, Recommends Dividend",
            "Summary": "HPL Electric & Power has reported its Q4 financial results. The company's net profit increased to 327 million rupees, up from 132 million rupees year-over-year and 178 million rupees quarter-over-quarter. Revenue for Q4 rose to 5.1 billion rupees from 4.1 billion rupees in the same quarter last year. The company has also recommended a dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747955880000,
            "Source": "default"
        },
        {
            "Title": "HPL Electric & Power Reports Q4 Results and Recommends Dividend",
            "Summary": "HPL Electric & Power has announced its Q4 results and recommended a dividend. The company's Q4 EBITDA increased to 739 million rupees from 526 million rupees year-over-year, with EBITDA margin improving to 14.53% from 12.74%. Q4 net profit rose to 327 million rupees from 132 million rupees year-over-year and 178 million rupees quarter-on-quarter. Revenue for Q4 grew to 5.1 billion rupees from 4.1 billion rupees year-over-year. The company has recommended a dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747916347000,
            "Source": "result"
        },
        {
            "Title": "HPL Electric Secures 370 Crore Rupee Order",
            "Summary": "HPL Electric, a company with a market capitalization of 24 billion rupees, has won a significant order worth 370 crore rupees (approximately $44.5 million USD). This order represents a substantial business opportunity for the company and could potentially impact its financial performance positively.",
            "Sentiment": "positive",
            "PublishDate": 1741851663000,
            "Source": "order&deals"
        },
        {
            "Title": "HPL Electric and Wirepas Launch Advanced RF Solutions for AMI in India",
            "Summary": "HPL Electric & Power Limited has partnered with Wirepas, a Finnish wireless technology company, to introduce cutting-edge radio frequency (RF) solutions for Advanced Metering Infrastructure (AMI) in the Indian market. This collaboration aims to bring state-of-the-art smart metering technology to India, potentially improving energy management and distribution efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1740131566000,
            "Source": "corporate_action"
        },
        {
            "Title": "HPL Electric & Power Aims to Expand Retailer Network",
            "Summary": "HPL Electric & Power has announced plans to significantly expand its retailer network in the consumer business segment. The company aims to increase its retailer touch-points by more than three times, growing from the current 45,000 retailers to 100,000 by March 2025. This represents a 66% increase in retailer numbers over the last two years. The expansion strategy is part of the company's focus on driving healthy growth in its consumer business.",
            "Sentiment": "positive",
            "PublishDate": 1739412744000,
            "Source": "corporate_action"
        },
        {
            "Title": "HPL Electric & Power Reports Q3 FY24 Financial Results",
            "Summary": "HPL Electric & Power has announced its financial results for the third quarter. The company's net profit increased to 178 million rupees, up from 115 million rupees year-over-year and 195 million rupees quarter-over-quarter. Revenue for Q3 rose to 3.84 billion rupees, compared to 3.58 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1739405782000,
            "Source": "earnings"
        },
        {
            "Title": "HPL Electric & Power Reports Improved Q3 EBITDA and Margin",
            "Summary": "HPL Electric & Power has announced its Q3 financial results. The company's EBITDA increased to 534 million rupees, up from 472 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 13.88% from 13.21% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739363845000,
            "Source": "earnings"
        },
        {
            "Title": "HPL Electric & Power Reports Increased Q3 Profit and Revenue",
            "Summary": "HPL Electric & Power has announced its financial results for the third quarter. The company's net profit rose to 178 million rupees, up from 115 million rupees year-over-year and 195 million rupees quarter-over-quarter. Revenue also increased to 3.84 billion rupees from 3.58 billion rupees compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739363775000,
            "Source": "earnings"
        },
        {
            "Title": "HPL Electric & Power Plans Significant Expansion of Retailer Network",
            "Summary": "HPL Electric & Power has announced plans to expand its retailer touch-points by more than three times. The company aims to increase its retailer numbers from the current 45,000 to 100,000 by March 2025, representing a 66% increase over the last two years.",
            "Sentiment": "positive",
            "PublishDate": 1731468335000,
            "Source": "corporate_action"
        },
        {
            "Title": "HPL Electric & Power Reports Improved Q2 Financial Performance",
            "Summary": "HPL Electric & Power has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 439 million rupees to 556 million rupees. Additionally, the EBITDA margin improved from 12.98% to 13.87%.",
            "Sentiment": "positive",
            "PublishDate": 1731401912000,
            "Source": "result"
        },
        {
            "Title": "HPL Electric & Power Reports Q2 Revenue Growth",
            "Summary": "HPL Electric & Power has announced its second quarter revenue, which amounts to 4 billion rupees. This represents an increase from the previous year's second quarter revenue of 3.38 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1731401815000,
            "Source": "result"
        },
        {
            "Title": "HPL Electric & Power Reports Significant Profit Increase in Q2",
            "Summary": "HPL Electric & Power has reported a net profit of 195 million rupees for the second quarter, compared to 101 million rupees in the same period last year, representing a substantial year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731401792000,
            "Source": "result"
        }
    ]
}