{
    "Symbol": "HSCL",
    "ISIN": "INE019C01026",
    "News": [
        {
            "Title": "Himadri Speciality Chemical Acquires Himadri Power",
            "Summary": "Himadri Speciality Chemical approves buyout of entire stake in Himadri Power Limited for ₹2.5 lakh, making it a wholly owned subsidiary focused on mineral activities.",
            "Sentiment": "positive",
            "PublishDate": 1770216611818,
            "Source": "co_actions_results"
        },
        {
            "Title": "Himadri Q3 FY26 PAT Surges 37% to ₹195 Crores",
            "Summary": "Himadri Speciality Chemical reports strong Q3 FY26 results with PAT growing 37% YoY to ₹195 crores. Nine-month PAT reaches ₹564 crores, exceeding full FY25 performance. Company starts trial production at expanded speciality carbon black facility.",
            "Sentiment": "positive",
            "PublishDate": 1769604018964,
            "Source": "co_actions_results"
        },
        {
            "Title": "Himadri Speciality Chemical Plans Self-Funded Growth",
            "Summary": "Himadri Speciality Chemical announces strategic shift to fund future expansion through internal accruals, avoiding equity dilution and additional debt burden for sustainable growth.",
            "Sentiment": "positive",
            "PublishDate": 1769050740850,
            "Source": "stocks"
        },
        {
            "Title": "Himadri Speciality Chemical Updates Facility Timeline",
            "Summary": "Himadri Speciality Chemical provides guidance on anthraquinone and carbazole facility launch scheduled for Q2 FY27, along with coal tar pitch distillation capacity expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1769050583789,
            "Source": "stocks"
        },
        {
            "Title": "Himadri Speciality Chemical LFP Plant on Track",
            "Summary": "Himadri Speciality Chemical confirms its 40,000 metric tons per annum LFP cathode active material plant remains on schedule for Q3 FY27 commercial phase, with significant utilization expected in FY29.",
            "Sentiment": "positive",
            "PublishDate": 1769050556510,
            "Source": "stocks"
        },
        {
            "Title": "Himadri Speciality Chemical Doubles PAT Target Timeline",
            "Summary": "Management reiterates guidance to double PAT from FY25 to FY28, having already achieved previous three-year target in just two years, demonstrating strong operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1769050527679,
            "Source": "co_actions_results"
        },
        {
            "Title": "Himadri Starts Trial Production at Mahistikry Facility",
            "Summary": "Himadri Speciality Chemical begins trial production at its Mahistikry speciality carbon black expansion, set to increase total capacity to 130,000 MTPA and become the world's largest single-site facility.",
            "Sentiment": "positive",
            "PublishDate": 1768576130931,
            "Source": "stocks"
        },
        {
            "Title": "Himadri Q3FY26: EBITDA Margin Expands to 21.09%",
            "Summary": "Himadri Speciality Chemical reports Q3FY26 EBITDA of ₹2.40 billion with improved margin of 21.09% vs 19.35% YoY. Company starts trial production at speciality carbon black expansion project.",
            "Sentiment": "positive",
            "PublishDate": 1768563573333,
            "Source": "co_actions_results"
        },
        {
            "Title": "Himadri Speciality Chemical Submits Q3 FY26 Report",
            "Summary": "Himadri Speciality Chemical submitted its Q3 FY26 monitoring agency report under SEBI regulations, showing ₹151.40 crores utilized from ₹341.82 crores raised through preferential issue of warrants.",
            "Sentiment": "neutral",
            "PublishDate": 1768561956821,
            "Source": "stocks"
        },
        {
            "Title": "Himadri Q3FY26 Results: Net Profit Jumps 37% YoY",
            "Summary": "Himadri Speciality Chemical reported strong Q3FY26 results with net profit rising 37.1% YoY to ₹194.58 crores. Revenue remained flat at ₹1,132.97 crores while margins improved significantly.",
            "Sentiment": "positive",
            "PublishDate": 1768560791973,
            "Source": "co_actions_results"
        },
        {
            "Title": "Himadri Speciality Chemical Q3FY26 Results",
            "Summary": "Himadri Speciality Chemical reported strong Q3FY26 results with revenue of ₹1,132.97 cr and net profit of ₹194.58 cr. Nine-month revenue reached ₹3,303.80 cr with net profit of ₹564.00 cr.",
            "Sentiment": "positive",
            "PublishDate": 1768560543213,
            "Source": "co_actions_results"
        },
        {
            "Title": "Himadri Invests in Sicona Battery Technologies",
            "Summary": "Himadri Speciality Chemical increases investment in Sicona Battery Technologies by subscribing to convertible notes, expanding its battery technology portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1768401682420,
            "Source": "stocks"
        },
        {
            "Title": "Himadri Speciality Chemical eyes 832% growth revival",
            "Summary": "Despite recent 18% decline, experts predict rebound for Himadri Speciality Chemical with ₹630 target price amid lithium-ion battery expansion and capacity doubling plans worth ₹220 crore investment.",
            "Sentiment": "positive",
            "PublishDate": 1767948940664,
            "Source": "stocks"
        },
        {
            "Title": "Himadri Speciality Eyes EV Battery Materials Market",
            "Summary": "Himadri Speciality Chemical plans to enter the lithium-ion battery materials market as a non-Chinese supplier while expanding its core business operations to become an EV supplier.",
            "Sentiment": "positive",
            "PublishDate": 1766980323102,
            "Source": "stocks"
        },
        {
            "Title": "Himadri Speciality Chemical Raises ₹200 Cr via CP",
            "Summary": "Himadri Speciality Chemical allots commercial paper worth ₹200 crores with 90-day tenure at 6.20% interest rate to Kotak Mahindra Bank on December 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766756768914,
            "Source": "co_actions_results"
        },
        {
            "Title": "Himadri Specialty Chemical Allots Rs. 100 Crore Commercial Paper",
            "Summary": "Himadri Specialty Chemical's Finance and Management Committee allotted 2,000 units of commercial paper worth Rs. 5,00,000 each, totaling Rs. 100 crore on December 4, 2025. The allotment was made under powers delegated by the Board of Directors as part of the company's funding operations.",
            "Sentiment": "positive",
            "PublishDate": 1764854628899,
            "Source": "corporate_action"
        },
        {
            "Title": "Himadri Specialty Chemical Executes First Liquid Coal Tar Pitch Export to Middle East from New Mangalore Port",
            "Summary": "Himadri Specialty Chemical successfully shipped 3,600 tonnes of liquid coal tar pitch to the Middle East from its New Mangalore Port terminal, marking its first-ever export from the western coast. This milestone opens a second export corridor alongside its established Haldia terminal, strengthening the company's ability to serve global markets in the Middle East and Americas with critical raw materials for aluminum smelting and graphite electrode manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1764565971117,
            "Source": "stock"
        },
        {
            "Title": "Himadri Speciality Chemical Promoters Acquire Additional Equity Shares Through Warrant Conversion",
            "Summary": "Promoters of Himadri Speciality Chemical Limited acquired equity shares through the exercise of warrants allotted on preferential basis. The acquisition was made by Anurag Choudhary and persons acting in concert including family members and associated entities. The transaction took place on November 7, 2025. Following the acquisition, the company's equity share capital increased from 49,44,77,750 shares to 50,44,94,950 shares of Re 1 each. The disclosure was made under SEBI substantial acquisition regulations to stock exchanges BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1762897038363,
            "Source": "corporate_action"
        },
        {
            "Title": "Himadri Speciality Chemical Allots 24,000 Equity Shares Upon Warrant Conversion",
            "Summary": "Himadri Speciality Chemical Limited has allotted 24,000 equity shares of face value Re. 1 each upon conversion of warrants by two warrant holders. The company received Rs. 56.88 lakh at the rate of Rs. 237 per warrant as the warrant exercise price. The warrants were originally allotted on preferential basis at an issue price of Rs. 316 per warrant. Following this allotment, the company's paid-up share capital has increased to Rs. 50.45 crore consisting of 50,45,18,950 equity shares. The allottees are Vikash Bajaj (14,000 shares) and Dr. Soumen Chakraborty (10,000 shares). The newly allotted equity shares rank pari-passu with existing equity shares of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1762796598326,
            "Source": "corporate_action"
        },
        {
            "Title": "Himadri Speciality Chemical Receives Auditor Certificate for Warrant Conversion Compliance",
            "Summary": "Himadri Speciality Chemical Limited submitted a statutory auditor certificate from Singhi & Co. confirming compliance with SEBI regulations regarding warrant conversions. The company converted 1,00,17,200 warrants out of total 1,08,17,000 preferential convertible warrants into equity shares. The warrants were originally issued on May 14, 2024, at an issue price of Rs 316 each to promoters and identified non-promoter persons. The conversion involved receipt of the balance 75% amount on allotment, with the auditors confirming proper receipt of consideration and maintenance of relevant documents as per ICDR regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762794193016,
            "Source": "corporate_action"
        },
        {
            "Title": "Himadri Specialty Chemical Allots 1 Crore Equity Shares Through Warrant Conversion",
            "Summary": "Himadri Specialty Chemical Limited has allotted 1,00,17,200 equity shares of face value Re. 1 each through conversion of warrants. The company received Rs. 237.41 crores from 3 warrant holders at Rs. 237 per warrant, representing 75% of the warrant issue price. The warrants were originally allotted on May 14, 2024, at an issue price of Rs. 316 each to 28 allottees. Following this allotment, the company's paid-up share capital increased to Rs. 50.45 crores, consisting of 50,44,94,950 equity shares. The major allottees include Anurag Choudhary (60 lakh shares), Amit Choudhary (40 lakh shares), and Aditya Paresh Trivedi (17,200 shares). The new equity shares rank equally with existing equity shares of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1762524910083,
            "Source": "corporate_action"
        },
        {
            "Title": "Himadri Specialty Plans Battery Materials Expansion and 150,000 TPA Anode Project for Growth",
            "Summary": "Himadri Specialty is preparing for its next growth phase through global battery materials expansion. The company is developing a 150,000 TPA (tonnes per annum) anode project and integrating specialty chemicals operations. These initiatives are targeting a revenue inflection point by FY30.",
            "Sentiment": "positive",
            "PublishDate": 1760718045889,
            "Source": "stock"
        },
        {
            "Title": "Himadri Speciality Chemical Reports Q2 FY26 Results with Net Profit of ₹186.85 Crores",
            "Summary": "Himadri Speciality Chemical Limited announced its quarterly results for the quarter and six months ended September 30, 2025. The company reported standalone net profit after tax of ₹186.85 crores for the quarter, compared to ₹134.44 crores in the corresponding quarter of the previous year. Revenue from operations stood at ₹1,070.41 crores for the quarter versus ₹1,135.21 crores in the same period last year. For the six-month period, net profit reached ₹369.42 crores on revenue of ₹2,170.83 crores. On a consolidated basis, the company posted net profit of ₹176.14 crores for the quarter and ₹355.50 crores for the half-year period. The company operates in two segments: carbon materials and chemicals, and power generation. During the quarter, 308,000 warrants were converted into equity shares, and 12,451 equity shares were allotted under the employee stock option plan. The company also issued commercial papers worth ₹300 crores during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1760708270594,
            "Source": "earnings"
        },
        {
            "Title": "Himadri Speciality Chemical Raises Rs. 200 Crore Through Commercial Paper Issuance",
            "Summary": "Himadri Speciality Chemical Ltd has issued and allotted commercial paper worth Rs. 200 crore. The company allotted 4,000 units with a face value of Rs. 5,00,000 each on September 26, 2025. The commercial paper has a tenure of 89 days with a maturity date of December 24, 2025, and offers a coupon rate of 6.25% per annum. The instrument is unsecured with upfront interest payment and principal repayment at maturity. The commercial paper is issued in favor of Kotak Mahindra Bank with ICICI Bank Limited serving as the Issue and Paying Agent. The paper will be listed on BSE Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1758888261844,
            "Source": "corporate_action"
        },
        {
            "Title": "Himadri Speciality Chemical Sees Rs. 227.86 Crore Block Trade on NSE",
            "Summary": "Himadri Speciality Chemical Ltd. witnessed a block trade worth Rs. 227.86 crores on the National Stock Exchange. The transaction involved approximately 5,032,314 shares at a price of Rs. 452.80 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1758692255658,
            "Source": "order&deals"
        },
        {
            "Title": "Himadri Speciality Chemical Invests Additional AUD 15 Lakh in Sicona Battery Technologies",
            "Summary": "Himadri Speciality Chemical has made an additional investment of AUD 15,00,000 in Sicona Battery Technologies Pty Ltd through Compulsorily Convertible Cumulative Notes (CCNs). This represents a follow-up investment by the chemical company in the Australian battery technology firm.",
            "Sentiment": "positive",
            "PublishDate": 1757895004105,
            "Source": "stock"
        },
        {
            "Title": "Himadri Speciality Chemical Invests Additional AUD 15 Lakh in Sicona Battery Technologies",
            "Summary": "Himadri Speciality Chemical Ltd has invested an additional AUD 15,00,000 in Sicona Battery Technologies Pty Ltd through subscription of 15,00,000 Compulsorily Convertible Notes. This investment is part of a previously announced AUD 1,50,00,000 investment plan approved by the Board in May 2025, to be deployed in tranches over 18 months. The company has now invested a total of AUD 56,71,000 out of the planned amount, with AUD 1,08,29,000 remaining to be invested. Each Compulsorily Convertible Note has a face value of AUD 1.00.",
            "Sentiment": "positive",
            "PublishDate": 1757684938432,
            "Source": "stock"
        },
        {
            "Title": "Himadri Speciality Chemical Raises Rs 100 Crore Through Commercial Paper Issuance",
            "Summary": "Himadri Speciality Chemical Ltd issued and allotted commercial paper worth Rs 100 crore. The company issued 2,000 units with a face value of Rs 5 lakh each for a 90-day tenure at a discount rate of 6.28% per annum. The commercial paper is unsecured and will be listed on BSE Ltd. The allotment was completed on September 4, 2025, with maturity scheduled for December 3, 2025. The commercial paper was issued in favor of Kotak Mahindra Bank, with ICICI Bank Limited serving as the issuing and paying agent.",
            "Sentiment": "neutral",
            "PublishDate": 1756992028953,
            "Source": "corporate_action"
        },
        {
            "Title": "Himadri Speciality Chemical Obtains ISCC PLUS Certification for Sustainable Supply Chains",
            "Summary": "Himadri Speciality Chemical has secured ISCC PLUS certification, which strengthens the company's position in sustainable and traceable supply chains globally. The certification enhances the company's leadership capabilities in these areas.",
            "Sentiment": "positive",
            "PublishDate": 1756311319651,
            "Source": "stock"
        },
        {
            "Title": "Himadri Speciality Chemical Renames Two Subsidiaries",
            "Summary": "Himadri Speciality Chemical has renamed two of its subsidiaries effective August 21. Combe Projects Ltd has been renamed to Himadri Agro Tech Specialities Ltd, while Elixir Carbo Ltd has been renamed to Himadri Advance New Energy Material Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1755858219493,
            "Source": "corporate_action"
        },
        {
            "Title": "Himadri Speciality Chemical Reports Record EBITDA of Rs 234 Crores in Q1 FY26",
            "Summary": "Himadri Speciality Chemical achieved its highest-ever EBITDA of Rs 234 crores and PAT of Rs 183 crores on standalone basis for Q1 FY26. Sales volume increased to 1,40,090 metric tonnes from 1,39,175 metric tonnes year-on-year, while consolidated revenue declined to Rs 1,118 crores from Rs 1,200 crores due to correction in raw material prices. The company's PAT grew 46% to Rs 179 crores on consolidated basis. Performance was driven by increased sales of high-value added products, better operational efficiencies, improved yield, and waste heat recovery systems. The company commissioned a new terminal at Mangalore and expects to commission 70,000 metric tonnes speciality carbon black capacity by Q3 FY26. Birla Tyres operations commenced with Rs 5 crores revenue in June quarter. The company entered exclusive technology licensing agreement with Sicona for silicon carbon anode material and invested in International Battery Company acquiring 16.24% equity stake. Management expects net profit to double from FY24 to FY27 and announced plans for world's first commercial LFP manufacturing plant outside China with 40,000 metric tonnes capacity expected operational by Q3 FY27.",
            "Sentiment": "positive",
            "PublishDate": 1753277908490,
            "Source": "earnings"
        },
        {
            "Title": "Himadari Specialty Reports Volume Growth and Margin Improvement, Plans Carbon Black Capacity Fix",
            "Summary": "Himadari Specialty has reported good volume growth alongside improved margins. The company expects its Birla Tyres unit to contribute to volume growth in the near term. The company has identified carbon black capacity issues and plans to resolve them by Q3 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1753073497731,
            "Source": "stock"
        },
        {
            "Title": "Himadri Speciality Aims for Growth in EV and Energy Storage Markets",
            "Summary": "Himadri Speciality is planning significant expansion in LFP cathodes, battery anodes, and carbon black production to cater to the global electric vehicle (EV) and energy storage markets. The company aims to achieve this growth by FY27. The expansion focuses on key components for EV batteries and energy storage systems, positioning Himadri Speciality to capitalize on the growing demand in these sectors.",
            "Sentiment": "positive",
            "PublishDate": 1752598990000,
            "Source": "default"
        },
        {
            "Title": "Himadri Speciality Chemical Reports Q1 Financial Results",
            "Summary": "Himadri Speciality Chemical has reported its Q1 financial results. The company's EBITDA increased to 2.4 billion rupees from 1.92 billion rupees year-over-year. EBITDA margin improved to 22.15% from 16% year-over-year. Revenue decreased to 11 billion rupees from 11.99 billion rupees year-over-year. Net profit rose to 1.8 billion rupees from 1.23 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1752569555000,
            "Source": "result"
        },
        {
            "Title": "Himadri Speciality Chemical Acquires 16.24% Stake in International Battery Company",
            "Summary": "Himadri Speciality Chemical has completed the purchase of a 16.24% stake in International Battery Company for $4.43 million. This acquisition represents a significant investment in the battery sector for Himadri Speciality Chemical.",
            "Sentiment": "positive",
            "PublishDate": 1750774568000,
            "Source": "default"
        },
        {
            "Title": "Himadri Speciality Acquires Stake in US Battery Company",
            "Summary": "Himadri Speciality has acquired a 16.24% stake in a US-based International Battery Company. The acquisition was made for USD 4.43 million, which is equivalent to 37.47 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1747896067000,
            "Source": "default"
        },
        {
            "Title": "Himadri Speciality Chemical Reports Q4 FY2023 Financial Results",
            "Summary": "Himadri Speciality Chemical announced its Q4 financial results. The company reported a net profit of 1.58 billion rupees, showing an increase from 1.15 billion rupees year-over-year and 1.42 billion rupees quarter-over-quarter. However, revenue decreased to 11.29 billion rupees from 11.77 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1745281627000,
            "Source": "default"
        },
        {
            "Title": "Himadri Speciality Chemical Reports Q4 FY2023 Financial Results",
            "Summary": "Himadri Speciality Chemical announced its Q4 FY2023 financial results. The company's EBITDA increased to 2.34 billion rupees from 1.77 billion rupees year-over-year, with EBITDA margin improving to 20.77% from 15.07%. Revenue slightly decreased to 11.29 billion rupees from 11.77 billion rupees year-over-year. Net profit rose to 1.58 billion rupees, up from 1.15 billion rupees year-over-year and 1.42 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745238153000,
            "Source": "result"
        },
        {
            "Title": "Himadri Speciality Chemical to Acquire 60% Stake in Trancemarine and Confreight Logistics",
            "Summary": "Himadri Speciality Chemical has announced its plan to acquire a 60% stake in Trancemarine and Confreight Logistics for 4.23 crore rupees. This strategic move is aimed at entering the resource extraction sector, potentially diversifying the company's operations and expanding its business portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1743731748000,
            "Source": "corporate_action"
        },
        {
            "Title": "Himadri Speciality Chemical Establishes US Subsidiary",
            "Summary": "Himadri Speciality Chemical has incorporated a wholly owned subsidiary in the United States of America. This strategic move suggests the company is expanding its international presence and potentially entering the US market.",
            "Sentiment": "positive",
            "PublishDate": 1739369991000,
            "Source": "corporate_action"
        },
        {
            "Title": "Himadri Speciality Chemical Reports Q3 Profit Growth and Approves Capex",
            "Summary": "Himadri Speciality Chemical announced its Q3 financial results, reporting a net profit of 1.42 billion rupees, up from 1.08 billion rupees year-over-year. The company's revenue increased to 11.32 billion rupees from 10.5 billion rupees in the same period. Additionally, the company approved a capital expenditure of 1.20 billion rupees for a new speciality products facility.",
            "Sentiment": "positive",
            "PublishDate": 1736813598000,
            "Source": "earnings"
        },
        {
            "Title": "Himadri Speciality Chemical Approves Capex and New Subsidiaries",
            "Summary": "Himadri Speciality Chemical has approved a capital expenditure of 1.20 billion rupees for a speciality products facility. The company has also given the green light for incorporating a wholly owned subsidiary in the USA and another subsidiary in India.",
            "Sentiment": "positive",
            "PublishDate": 1736773527000,
            "Source": "corporate_action"
        },
        {
            "Title": "Himadri Speciality Chemical Reports Improved Q3 EBITDA and Margin",
            "Summary": "Himadri Speciality Chemical has announced its Q3 financial results. The company's EBITDA increased to 2.19 billion rupees, up from 1.72 billion rupees in the same quarter last year. Additionally, the EBITDA margin improved to 19.35% from 16.33% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1736772509000,
            "Source": "earnings"
        },
        {
            "Title": "Himadri Speciality Chemical Reports Strong Q3 Financial Results",
            "Summary": "Himadri Speciality Chemical has announced its financial results for the third quarter. The company's net profit increased to 1.42 billion rupees, up from 1.08 billion rupees in the same period last year. Revenue also saw growth, rising to 11.32 billion rupees from 10.5 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1736772504000,
            "Source": "earnings"
        },
        {
            "Title": "Himadri Speciality Chemical to Consider Q3 Results on January 13",
            "Summary": "Himadri Speciality Chemical Limited has announced that it will consider and approve its financial results for the third quarter of the fiscal year on January 13.",
            "Sentiment": "neutral",
            "PublishDate": 1736167461000,
            "Source": "result"
        },
        {
            "Title": "Himadri Speciality Chemical: ICICI Securities Initiates Coverage with 'Add' Rating",
            "Summary": "ICICI Securities initiated coverage on Himadri Speciality Chemical with an 'add' rating and a target price of Rs 600, citing the company's strong market position in the coal tar value chain, expansion into export markets, and plans for capacity expansion in coal tar distillation and carbon black production. The company's acquisition of Birla Tyres and foray into tyre production is also highlighted.",
            "Sentiment": "positive",
            "PublishDate": 1734510043000,
            "Source": "normal_news"
        },
        {
            "Title": "Himadri Speciality Chemical Reports Q2 EBITDA Growth",
            "Summary": "Himadri Speciality Chemical announced its Q2 financial results. The company's EBITDA increased to 2.06 billion rupees from 1.57 billion rupees year-over-year. The EBITDA margin also improved to 18.15% from 15.64% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1729067736000,
            "Source": "result"
        },
        {
            "Title": "Himadri Speciality Chemical Reports Q2 Revenue Growth",
            "Summary": "Himadri Speciality Chemical has announced its Q2 revenue, which stands at 11.4 billion rupees, compared to 10.04 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729067674000,
            "Source": "result"
        },
        {
            "Title": "Himadri Speciality Chemical Reports Q2 Profit Increase",
            "Summary": "Himadri Speciality Chemical has announced its Q2 financial results, reporting a net profit of 1.3 billion rupees, up from 1.01 billion rupees in the same quarter last year. This represents a year-over-year increase in profitability for the company.",
            "Sentiment": "positive",
            "PublishDate": 1729067648000,
            "Source": "result"
        }
    ]
}