{
    "Symbol": "HUBTOWN",
    "ISIN": "INE703H01016",
    "News": [
        {
            "Title": "Hubtown Limited faces GST inspection operation",
            "Summary": "Hubtown Limited discloses ongoing GST inspection, search and seizure operation by Mumbai GST Department that commenced on February 09, 2026 at company's registered office.",
            "Sentiment": "negative",
            "PublishDate": 1770718647879,
            "Source": "stocks"
        },
        {
            "Title": "Hubtown Issues ₹300 Cr Corporate Guarantee for Subsidiary",
            "Summary": "Hubtown Limited provides corporate guarantee to Catalyst Trusteeship Limited for subsidiary Joynest's NCD issuance up to ₹300 crores to fund Hubtown Seasons project development in Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1767190558213,
            "Source": "stocks"
        },
        {
            "Title": "Hubtown Gets Trading Approval for 21.32 Lakh Shares",
            "Summary": "Hubtown Limited receives trading approval from NSE and BSE for 21,31,936 equity shares issued to promoters on preferential basis pursuant to conversion of warrants.",
            "Sentiment": "positive",
            "PublishDate": 1765385668719,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hubtown Reports ₹3,547 Cr Pre-Sales, Plans Merger",
            "Summary": "Hubtown achieves pre-sales of ₹3,547 crores as of November 2025, with planned merger to increase total development value from ₹850 billion to ₹1,300 billion. Company announces upcoming launches in ultra-luxury and premium segments.",
            "Sentiment": "positive",
            "PublishDate": 1765376591854,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hubtown Reports Rs. 3,547 Crores Pre-Sales, Plans Strategic Merger to Expand Development Value to Rs. 1,300 Billion",
            "Summary": "Hubtown Limited achieved pre-sales of Rs. 3,547 crores as of November 10, 2025, showing 19% YoY growth, and is merging ultra-luxury projects 25West, 25South, and 25Downtown into the listed entity. The strategic consolidation will increase Total Development Value from Rs. 850 billion to Rs. 1,300 billion while reducing listed entity debt by 69% from Rs. 34.3 billion to Rs. 10.6 billion.",
            "Sentiment": "positive",
            "PublishDate": 1765351644654,
            "Source": "stock"
        },
        {
            "Title": "Hubtown Promoter Rushank V. Shah Increases Stake Through Warrant Conversion",
            "Summary": "Rushank V. Shah acquired 2,131,936 shares (1.50% stake) in Hubtown Limited through warrant conversion on December 1, 2025, increasing his total holding to 5,749,550 shares (4.05%). The acquisition expanded Hubtown's total share capital from 139,968,721 to 142,100,657 shares following the warrant conversion process.",
            "Sentiment": "neutral",
            "PublishDate": 1765198687303,
            "Source": "corporate_action"
        },
        {
            "Title": "Hubtown Limited Receives In-Principle Approval for Rs. 500 Crore Preferential Share Issue",
            "Summary": "Hubtown Limited has received in-principle approval from BSE and NSE to issue 1,46,80,249 equity shares of Rs. 10 each at a minimum price of Rs. 341 per share to non-promoters on preferential basis. The approval allows the company to raise funds through this preferential allotment, subject to compliance with regulatory requirements and obtaining necessary statutory approvals before final listing.",
            "Sentiment": "positive",
            "PublishDate": 1764939063196,
            "Source": "corporate_action"
        },
        {
            "Title": "Hubtown Limited Receives Stock Exchange Approval for Listing 21.32 Lakh Equity Shares",
            "Summary": "Hubtown Limited obtained listing approval from BSE and NSE for 21,31,936 equity shares of Rs. 10 each issued at Rs. 210 premium to promoters through warrant conversion on preferential basis. The approvals enable the company to list these shares bearing distinctive numbers from 139968722 to 142100657, subject to completing depositories confirmation and trading approval requirements.",
            "Sentiment": "positive",
            "PublishDate": 1764051454727,
            "Source": "corporate_action"
        },
        {
            "Title": "Hubtown Limited Receives Stock Exchange Approval for Listing 2.5 Lakh Equity Shares",
            "Summary": "Hubtown Limited obtained listing approval from BSE and NSE for 2,50,000 equity shares of Rs. 10 each issued at Rs. 190 premium to non-promoters through conversion of Compulsorily and Mandatorily Convertible Debentures on preferential basis. The approvals were granted by BSE on November 17, 2025 and NSE on November 24, 2025, with shares bearing distinctive numbers from 139718722 to 139968721.",
            "Sentiment": "positive",
            "PublishDate": 1764049547155,
            "Source": "corporate_action"
        },
        {
            "Title": "Hubtown Reports 89% Revenue Growth in Q2FY26, Pre-Sales Hit INR 3,547 Crores",
            "Summary": "Hubtown Limited delivered consolidated revenue of INR 263.29 crores in Q2FY26, up 89% year-on-year, with profit before tax rising 63.84% to INR 58.49 crores. The Mumbai-based real estate developer achieved pre-sales of INR 3,547 crores year-to-date including proposed amalgamating entities, while reducing listed entity debt by 69% since 2017 to INR 10.6 billion.",
            "Sentiment": "positive",
            "PublishDate": 1763634600841,
            "Source": "earnings"
        },
        {
            "Title": "Hubtown Q2 Profit Jumps 65% to Rs 32 Crore on Higher Income",
            "Summary": "Mumbai-based realty firm Hubtown reported a 65% increase in consolidated net profit to Rs 31.67 crore in the September quarter, driven by total income rising to Rs 263.29 crore from Rs 139.31 crore year-on-year. The company plans amalgamation of three project companies to add over 5 million sq ft developable area and expects pre-sales of approximately Rs 6,000 crore in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1763092184336,
            "Source": "stock"
        },
        {
            "Title": "Hubtown Limited Reports No Deviation in Rs 1,212 Crore Fund Utilization for Quarter Ended September 2025",
            "Summary": "Hubtown Limited submitted its monitoring agency report for the quarter ended September 30, 2025, covering the utilization of Rs 1,212 crore raised through preferential issue of equity shares, compulsory convertible debentures (CCDs), and warrants. Brickwork Ratings India Private Limited, the appointed monitoring agency, reported no deviation from stated objectives. The funds were allocated across working capital requirements (Rs 100 crore for equity shares, Rs 212.50 crore for warrants), repayment of existing loans/debts (Rs 806 crore for equity shares, Rs 30 crore for warrants), issue-related expenses (Rs 3 crore), and general corporate purposes (Rs 20 crore for equity shares, Rs 32.50 crore for warrants). For CCDs worth Rs 5 crore, funds were used for working capital (Rs 4 crore) and loan repayment (Rs 0.80 crore). The company maintained Rs 50.38 crore in unutilized proceeds across various bank accounts and investments. All utilization remained within regulatory compliance with no major deviations observed.",
            "Sentiment": "neutral",
            "PublishDate": 1762975102621,
            "Source": "corporate_action"
        },
        {
            "Title": "Hubtown Plans Expansion With 23 Million Sq Ft Launch-Ready Portfolio in Mumbai MMR",
            "Summary": "Hubtown has outlined plans for revival-focused expansion with a 23 million square feet launch-ready portfolio across Mumbai MMR. The company is leveraging its large land bank and public-private partnership expertise for urban redevelopment and affordable housing projects. Hubtown expects its strong execution pipeline to drive cash flows and strengthen its balance sheet.",
            "Sentiment": "positive",
            "PublishDate": 1762960440854,
            "Source": "stock"
        },
        {
            "Title": "Hubtown Limited Reports Quarterly Results with Auditor Qualification on Interest Provision",
            "Summary": "Hubtown Limited announced its unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. The company reported standalone revenue from operations of Rs 220 lakhs for the quarter and Rs 25,427 lakhs for the half-year. Net profit stood at Rs 6,253 lakhs for the quarter and Rs 6,984 lakhs for the half-year. However, auditors issued a qualified opinion noting that the company has not provided for interest amounting to Rs 1,905 lakhs for the quarter and Rs 3,790 lakhs for the half-year on certain inter-corporate deposits and advances, resulting in understated finance costs. During the quarter, the company issued 62,50,000 equity shares to promoter group at Rs 220 per share and 2,50,000 equity shares to non-promoters at Rs 200 per share through preferential allotment. The company has corporate guarantees of Rs 65,123 lakhs issued on behalf of group companies, associates and joint ventures.",
            "Sentiment": "neutral",
            "PublishDate": 1762956938214,
            "Source": "earnings"
        },
        {
            "Title": "Hubtown Reports 44% Jump in Q2 Net Profit Despite EBITDA Margin Decline",
            "Summary": "Hubtown reported quarterly net profit of 240.6 million rupees compared to 166.5 million rupees in the same period last year. Revenue more than doubled to 2.08 billion rupees from 989.4 million rupees year-over-year. However, EBITDA declined to 313 million rupees from 605 million rupees, while EBITDA margin dropped significantly to 15.02% from 61.18% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762951585751,
            "Source": "earnings"
        },
        {
            "Title": "Hubtown Limited Receives No Adverse Observation Letters for Scheme of Arrangement with Saicharan Consultancy",
            "Summary": "Hubtown Limited received observation letters with no adverse observations from BSE Limited and National Stock Exchange of India Limited regarding its proposed scheme of arrangement with Saicharan Consultancy Private Limited. BSE issued its letter on November 7, 2025, while NSE issued theirs on November 11, 2025. The scheme involves the transfer of assets and liabilities from Saicharan Consultancy (transferor company) to Hubtown Limited (transferee company). Both exchanges provided detailed compliance requirements including disclosure of ongoing legal proceedings, ensuring financial statements are not older than 6 months, mandatory demat form for equity shares, and comprehensive disclosures to shareholders about assets, liabilities, valuation basis, and impact on revenue generating capacity. The observation letters are valid for six months from their respective dates, within which the scheme must be submitted to the National Company Law Tribunal (NCLT). The Board of Directors had previously approved this scheme on February 14, 2025, subject to regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1762872548939,
            "Source": "corporate_action"
        },
        {
            "Title": "Hubtown Limited Promoters Release Share Pledges Worth Over 36% of Company",
            "Summary": "Multiple promoters of Hubtown Limited released pledged shares as collateral security for loans availed by the company. Vyomesh M. Shah's total holding decreased from 42.63% to 36.05% after releasing pledged shares. Other promoters including Hemant M. Shah, Mahipatray V. Shah HUF, and Vyomesh M. Shah HUF also released portions of their pledged holdings. The shares were previously encumbered in favor of Ashika Credit Capital Limited. Kunjal H. Shah filed the disclosure with BSE and NSE pursuant to SEBI takeover regulations.",
            "Sentiment": "positive",
            "PublishDate": 1761795455113,
            "Source": "corporate_action"
        },
        {
            "Title": "Hubtown Limited Presents Strategic Growth Plan with Major Merger and Debt Reduction Initiative",
            "Summary": "Hubtown Limited outlined its expansion strategy through an investor presentation covering merger plans, debt reduction, and project portfolio updates. The company announced mergers of three promoter group entities - 25 West Realty Private Limited, Twenty Five South Realty Limited, and Twenty Five Downtown Realty Limited - which will add 4.5 million square feet of developable area with a combined development value of approximately INR 400+ billion. The mergers are awaiting regulatory approvals and expected to complete within 12 months. Hubtown has reduced its debt by 69% from INR 34.47 billion in 2017 to INR 10.76 billion as of September 2025. The company operates across residential, commercial, and infrastructure segments with 47 completed projects and multiple ongoing developments including 25 South Prabhadevi (90%+ sold), 25 West Bandra, and Hubtown Seasons Chembur. Post-merger, the combined entity will have real estate holdings of 31.7 million square feet across 18 projects under development, with total development value of approximately INR 1,250 billion.",
            "Sentiment": "positive",
            "PublishDate": 1760602801542,
            "Source": "stock"
        },
        {
            "Title": "Hubtown Associate Receives RERA Approval for Fourth Tower of 25 Downtown Project in Mumbai",
            "Summary": "Hubtown's associate has obtained RERA approval for Tower 4 of the 25 Downtown project located in Mahalaxmi, Mumbai. The project now has four towers registered with RERA - T1, T2, T3, and T4.",
            "Sentiment": "positive",
            "PublishDate": 1760588093518,
            "Source": "stock"
        },
        {
            "Title": "Hubtown Limited Receives Trading Approval for 15.8 Lakh Equity Shares from Warrant Conversion",
            "Summary": "Hubtown Limited received trading approval from NSE and BSE for 15,81,747 equity shares of Rs. 10 each at a premium of Rs. 210 per share. The shares were allotted to promoters on a preferential basis through conversion of warrants. NSE and BSE granted approval on October 10, 2025, with trading commencing from October 13, 2025. The shares carry distinctive numbers from 138136975 to 139718721 and are subject to a lock-in period until May 30, 2027.",
            "Sentiment": "neutral",
            "PublishDate": 1760102003816,
            "Source": "corporate_action"
        },
        {
            "Title": "Hubtown's Subsidiary Rare Townships Receives Occupation Certificate for Rising City Project",
            "Summary": "Hubtown's subsidiary Rare Townships has obtained occupation certificates for two parts of its Rising City project. The project has achieved sales of 1.23 lakh square feet, representing approximately 75% of the total available space.",
            "Sentiment": "positive",
            "PublishDate": 1759986082541,
            "Source": "stock"
        },
        {
            "Title": "Hubtown Limited Promoters Increase Shareholding Through Warrant Conversion",
            "Summary": "Hubtown Limited promoters Falguni V. Shah and Kunjal H. Shah have increased their shareholding through warrant conversion on September 19, 2025. Falguni V. Shah acquired 1,581,747 shares (1.15% of total share capital) through warrant conversion, increasing holdings from 1.59% to 2.71%. Kunjal H. Shah acquired 954,570 shares (0.69% of total share capital) through warrant conversion, increasing holdings from 2.36% to 3.03%. The combined promoter group holding increased to 33.34% of total share capital after the acquisitions. The company had originally issued 12.5 million warrants to promoter group members, with 8,786,317 warrants converted into equity shares and 3,713,683 warrants remaining for conversion. The company's equity share capital stands at 135.6 million shares with a face value of Rs. 10 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1758519260845,
            "Source": "corporate_action"
        },
        {
            "Title": "Hubtown Limited Issues Corrigendum for EGM Notice on ₹500 Crore Preferential Share Issue",
            "Summary": "Hubtown Limited issued a corrigendum on September 16, 2025, updating its EGM notice for a meeting scheduled on September 23, 2025. The company plans to raise ₹500.59 crore through preferential allotment of 1.47 crore equity shares at ₹341 per share to 101 private investors. Key updates include revised fund utilization plans: ₹150 crore for debt repayment, ₹310.59 crore for working capital requirements, ₹25 crore for general corporate purposes, and ₹15 crore for issue expenses. The corrigendum provides updated details of proposed allottees and their ultimate beneficial owners, with completion timeline of 9-12 months from fund receipt. The issue price represents the floor price as per SEBI regulations, with the relevant date being August 22, 2025. All proposed investors belong to the non-promoter public category and will maintain this status post-allotment.",
            "Sentiment": "neutral",
            "PublishDate": 1758021618044,
            "Source": "corporate_action"
        },
        {
            "Title": "Hubtown Limited Acquires Stakes in Four Bus Terminal Subsidiaries for Rs. 16 Crores, Settles Five-Year Legal Disputes",
            "Summary": "Hubtown Limited signed Share Purchase Agreements on September 4, 2025, to acquire additional shares in four subsidiary companies from GVFL Trustee Company Private Limited for Rs. 16 crores. The acquisition involves Hubtown Bus Terminal companies in Adajan (Rs. 1.11 crores), Ahmedabad (Rs. 11.88 crores), Mehsana (Rs. 2.26 crores), and Vadodara (Rs. 75.42 lakhs). All four entities operate in real estate construction and development of residential and commercial premises. The transaction will increase Hubtown's voting control from 45% to 55% in three of the companies, making them subsidiaries, while one company's holding will increase from 47.28% to 49.12%. Payment will be completed by February 2, 2026, through installments via cheque. The deal resolves five ongoing litigations with GVFL Trustee Company that have been pending since 2015. The acquired companies reported combined turnover of Rs. 4,830.38 lakhs for the year ended March 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1757076305551,
            "Source": "order&deals"
        },
        {
            "Title": "Hubtown Allocates 3.67 Lakh Shares Each to Two Abakkus Funds",
            "Summary": "Hubtown has allocated 3.67 lakh shares to Abakkus Diversified Alpha Fund and an equal number of shares to Abakkus Diversified Alpha Fund-2. The allocation involves a total of 7.34 lakh shares distributed between these two investment funds.",
            "Sentiment": "neutral",
            "PublishDate": 1756698417270,
            "Source": "corporate_action"
        },
        {
            "Title": "Hubtown Approves Multi-Company Merger Scheme with ₹6,000 Crore FY26 Pre-sales Target",
            "Summary": "Hubtown has approved a revised scheme of arrangement for multi-step amalgamations involving three companies: Distinctive Realty, Amazia Developers, and Nitant Real Estate. The merger is expected to generate pre-sales of ₹6,000 crore for FY26. The transaction will result in significant promoter shareholding consolidation within the combined entity.",
            "Sentiment": "positive",
            "PublishDate": 1756339869284,
            "Source": "order&deals"
        },
        {
            "Title": "Hubtown Limited Provides Rs. 96 Crore Corporate Guarantee for Subsidiary's Debenture Issue",
            "Summary": "Hubtown Limited has provided a corporate guarantee to MITCON CREDENTIA TRUSTEESHIP SERVICES LIMITED for securing Non-Convertible Debentures up to Rs. 96 crores to be issued by its wholly-owned subsidiary, Twenty Five Estates Realty Private Limited. The guarantee will be recorded as a contingent liability in Hubtown's books. The arrangement involves specific terms and conditions outlined in the Deed of Guarantee and Debenture Trust Deed.",
            "Sentiment": "neutral",
            "PublishDate": 1756235865785,
            "Source": "corporate_action"
        },
        {
            "Title": "Hubtown Limited Announces Amalgamation of Project 25 Downtown Under Board-Approved Scheme",
            "Summary": "Hubtown Limited announced a proposed amalgamation of Project 25 Downtown as part of a Scheme of Arrangement approved by the company's Board on August 26, 2025. The project is owned by 25 South Realty Limited with a 75% stake and is located in Mahalakshmi, South Mumbai, abutting the Willingdon Golf Club. The development spans approximately 18 acres under MCGM's Urban Renewal Scheme, with 5.5 acres designated for free sale. The free sale component comprises 3.7 million square feet of ultra luxury residential apartments ranging from 3,400 to 25,000 square feet across 5 towers, plus an office/commercial tower. Three out of five residential towers have received MahaRERA approval and have been launched with bookings commenced. Construction on the free sale portion has started, with over 40% of overall rehabilitation obligations completed. The project features amenities including 3 swimming pools, 10+ event hosting spaces, 2 cinemas, gym facilities, and sports courts, designed by architect Hafeez Contractor and interior designer Bill Bensley.",
            "Sentiment": "positive",
            "PublishDate": 1756205347361,
            "Source": "corporate_action"
        },
        {
            "Title": "Hubtown Limited Approves Multi-Company Merger Scheme with Rs. 6,000 Crore Pre-Sales Target",
            "Summary": "Hubtown Limited's Board approved a Scheme of Arrangement involving the amalgamation of Distinctive Realty Private Limited and Nitant Real Estate Private Limited with Amazia Developers Private Limited, which will then merge with Hubtown Limited. The scheme is effective from July 1, 2025 and requires regulatory approvals from stock exchanges, NCLT, and shareholders. The merged entities hold majority stakes in Twenty Five South Realty Limited and Twenty Five Downtown Realty Limited, which are developing super-luxury residential projects '25 South' at Prabhadevi and '25 Downtown' near Willingdon Golf Club, Mahalaxmi. Post amalgamation, Hubtown Group expects pre-sales of approximately Rs. 6,000 crore during the current financial year. The share exchange ratio involves issuing 16 Hubtown shares for every 1 share of Nitant Real Estate and 5,558 Hubtown shares for every 1 share of Amazia Developers. The promoter shareholding will increase from 35.02% to 63.38% post-scheme implementation.",
            "Sentiment": "positive",
            "PublishDate": 1756203781501,
            "Source": "corporate_action"
        },
        {
            "Title": "Hubtown Plans to Explore Merger Opportunities with Other Companies",
            "Summary": "Hubtown has announced plans to explore a merger scheme with other firms. The company is considering potential consolidation opportunities as part of its strategic initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1755780361918,
            "Source": "order&deals"
        },
        {
            "Title": "Bhansali Engineering Polymers Reports 9.5% Revenue Decline and 12% Drop in Net Profit",
            "Summary": "Bhansali Engineering Polymers Limited reported a decline in financial performance with total revenue from operations decreasing 9.5% to Rs 363.15 crores compared to Rs 401.19 crores in the previous year quarter. Net profit after tax fell 12% to Rs 46.73 crores from Rs 53.10 crores. EBITDA margin contracted to 19.6% from 20.6%. The revenue decline was attributed to lower sales volumes and realizations in the polymer business. Despite challenges, the company declared an interim dividend of Rs 1 per share for FY26. Management expects gradual demand recovery in H2 FY26 led by automotive and consumer durables sectors, while raw material price volatility remains a concern.",
            "Sentiment": "negative",
            "PublishDate": 1755338694701,
            "Source": "earnings"
        },
        {
            "Title": "Hubtown Reports Strong Q1 Performance with Net Profit Surge to 793M Rupees",
            "Summary": "Hubtown delivered robust quarterly results with net profit jumping to 793 million rupees from 55 million rupees year-over-year. Revenue increased to 1.87 billion rupees compared to 1.2 billion rupees in the same period last year. The company's EBITDA rose significantly to 408 million rupees from 144 million rupees, while EBITDA margin expanded to 21.75% from 11.93% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1755013851764,
            "Source": "earnings"
        },
        {
            "Title": "Hubtown Limited Approves Q1 Results, Key Auditor Appointments and AGM Schedule",
            "Summary": "Hubtown Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company appointed M/s. Mihen Halani & Associates as Secretarial Auditor for five years from FY 2025-26 to FY 2029-30, and reappointed M/s. JBTM & Associates LLP as Statutory Auditor for a second five-year term. The 37th Annual General Meeting is scheduled for September 25, 2025, to be held via video conference. The Board considered a preliminary proposal to acquire or increase equity stake in Twenty Five Downtown Realty Limited, empowering management to evaluate the proposal further. The company also plans to raise funds through equity shares or convertible securities via various modes including public issue, preferential allotment, or qualified institutional placement to expand its project base.",
            "Sentiment": "positive",
            "PublishDate": 1755009320940,
            "Source": "corporate_action"
        },
        {
            "Title": "Hubtown Plans Equity Share Offering to Raise Funds",
            "Summary": "Hubtown has announced plans to raise funds through an equity share offering. The company intends to increase its capital by issuing equity shares to investors.",
            "Sentiment": "positive",
            "PublishDate": 1755005792232,
            "Source": "corporate_action"
        },
        {
            "Title": "Hubtown Board Approves Equity Share Issuance Worth ₹26.09 Crores",
            "Summary": "Hubtown's Board of Directors has approved the issuance of equity shares valued at ₹26.09 crores. This decision follows the conversion of warrants into equity shares. The move represents a significant corporate action that will impact the company's share structure and potentially its market value.",
            "Sentiment": "positive",
            "PublishDate": 1751897716000,
            "Source": "default"
        },
        {
            "Title": "Hubtown Allocates 9.54 Lakh Equity Shares to Promoter Group",
            "Summary": "Hubtown has allocated 9.54 lakh equity shares to its promoter group following the conversion of warrants. This action represents a significant corporate move, potentially affecting the company's ownership structure and equity distribution.",
            "Sentiment": "neutral",
            "PublishDate": 1751463944000,
            "Source": "default"
        },
        {
            "Title": "Hubtown Announces '25 West Realty Limited' Project with Expected Revenue of ₹6,000 Crore",
            "Summary": "Hubtown has informed about a new project called '25 West Realty Limited'. The company states that the total expected revenue from this project is ₹6,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1751328372000,
            "Source": "default"
        },
        {
            "Title": "Hubtown Announces RERA Registration and Revenue Expectations for '25 West Realty Limited' Project",
            "Summary": "Hubtown has announced that RERA registration has been completed for the first phase of their project '25 West Realty Limited'. Sales and construction for the initial wing are currently underway. The company expects to generate revenue of ₹6,000 crores from this project.",
            "Sentiment": "positive",
            "PublishDate": 1751285529000,
            "Source": "default"
        },
        {
            "Title": "Hubtown Obtains TDR for Slum Rehabilitation Project in Mumbai",
            "Summary": "Hubtown has acquired Transferable Development Rights (TDR) of 11,000 square meters from MIDC and MCGM. This is part of the consideration for their ongoing slum rehabilitation project located in Andheri (East), Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1748929419000,
            "Source": "default"
        },
        {
            "Title": "Hubtown Receives Occupancy Certificate for 'Hubtown Seasons – Czarnowo' Project in Mumbai",
            "Summary": "Hubtown has obtained an Occupancy Certificate (OC) for its project 'Hubtown Seasons – Czarnowo' located in Chembur (E), Mumbai. The project comprises 54,000 square feet of total carpet area, with over 97% of the space already sold. This development is part of the larger 'Hubtown Seasons' project.",
            "Sentiment": "positive",
            "PublishDate": 1748250039000,
            "Source": "default"
        },
        {
            "Title": "Hubtown Reports Q4 Financial Results",
            "Summary": "Hubtown has released its Q4 financial results. The company reported revenue of 967.5 million rupees, compared to 1.06 billion rupees in the same quarter last year. Hubtown's consolidated net profit for Q4 was 35.3 million rupees, a significant improvement from a loss of 886 million rupees in the year-ago period. Sequentially, the profit increased from 208.9 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747934305000,
            "Source": "result"
        },
        {
            "Title": "Hubtown Considers Merger and Expansion Plans",
            "Summary": "Hubtown Limited is considering a proposal to merge 25 West Realty with the company. Additionally, Hubtown is exploring the acquisition of new projects, indicating potential expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1742202951000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hubtown Reports Significant Increase in Q3 EBITDA and Margin",
            "Summary": "Hubtown, a real estate company, has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) has risen substantially to 328.9 million rupees, compared to 77.3 million rupees in the same quarter of the previous year. This represents a year-over-year increase of over 325%. Additionally, Hubtown's EBITDA margin has improved from 24.9% to 35.6%, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739552064000,
            "Source": "earnings"
        },
        {
            "Title": "Hubtown Reports Significant Revenue Growth in Q3",
            "Summary": "Hubtown Limited has announced its third-quarter financial results, reporting a substantial increase in revenue. The company's Q3 revenue reached 924.6 million rupees, compared to 311 million rupees in the same period last year, representing a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1739552053000,
            "Source": "earnings"
        },
        {
            "Title": "Hubtown Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Hubtown Limited has reported a substantial increase in its consolidated net profit for the third quarter. The company's net profit rose to 208.9 million rupees, compared to 21 million rupees in the same quarter of the previous year, representing a year-over-year growth. Additionally, the profit showed a quarter-over-quarter increase from 166.5 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739552043000,
            "Source": "earnings"
        },
        {
            "Title": "Hubtown's Subsidiary Enters Agreement with Gopani Realty for Mumbai Project",
            "Summary": "Hubtown Limited has announced that its subsidiary, Rare Townships, has entered into an agreement with Gopani Realty LLP. The agreement pertains to the development of Wing A-6 of a project located in Mumbai. This collaboration suggests a strategic move in Hubtown's real estate development initiatives in the Mumbai market.",
            "Sentiment": "neutral",
            "PublishDate": 1734526493000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hubtown Reports Significant Q2 EBITDA Growth",
            "Summary": "Hubtown, a real estate company, has reported a substantial increase in its Q2 EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). The EBITDA rose to 605 million rupees from 212 million rupees in the same quarter last year, representing a year-over-year growth. Additionally, the EBITDA margin improved significantly, increasing from 38.08% to 61.18% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731749692000,
            "Source": "result"
        },
        {
            "Title": "Hubtown Reports Significant Revenue Growth in Q2",
            "Summary": "Hubtown, a real estate company, has reported a substantial increase in its second quarter revenue. The company's revenue rose to 989 million rupees, up from 556 million rupees in the same quarter of the previous year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731749685000,
            "Source": "result"
        },
        {
            "Title": "Hubtown Reports Significant Profit Increase in Q2",
            "Summary": "Hubtown, a real estate company, has reported a substantial increase in its consolidated net profit for the second quarter. The profit rose to 166 million rupees, compared to 26 million rupees in the same period last year, marking a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731749678000,
            "Source": "result"
        }
    ]
}