{
    "Symbol": "HUDCO",
    "ISIN": "INE031A01017",
    "News": [
        {
            "Title": "HUDCO Gets AAA Rating for Rs 4500 Cr Perpetual Bonds",
            "Summary": "Acuite Ratings assigns highest AAA rating with stable outlook to HUDCO's Rs 4500 crore Perpetual Additional Tier 1 Bonds, reflecting strong government backing and improved financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1770398672229,
            "Source": "co_actions_results"
        },
        {
            "Title": "HUDCO Q3FY26 Results: Revenue Jumps 28.41% YoY",
            "Summary": "Housing and Urban Development Corporation Limited reports strong Q3FY26 performance with revenue from operations rising 28.41% YoY to ₹9,587.54 crore for nine months ended December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1769766093765,
            "Source": "co_actions_results"
        },
        {
            "Title": "HUDCO Board Meet on Jan 29 for Q3FY26 Results",
            "Summary": "HUDCO schedules board meeting on January 29, 2026 to approve Q3FY26 financial results, consider 3rd interim dividend declaration, and enhance borrowing plan from ₹65,000 crore to ₹80,000 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1769089833392,
            "Source": "co_actions_results"
        },
        {
            "Title": "HUDCO Signs ₹1 Lakh Crore MoU With Chhattisgarh Govt",
            "Summary": "HUDCO signed a non-binding MoU with Chhattisgarh government on January 7, 2026, for financial assistance up to ₹1 lakh crore over five years for housing and infrastructure projects.",
            "Sentiment": "positive",
            "PublishDate": 1767789786550,
            "Source": "stocks"
        },
        {
            "Title": "HUDCO Q3 loan sanctions at ₹46,167 cr, disbursements ₹41,347 cr",
            "Summary": "HUDCO reports strong Q3 performance with loan sanctions of ₹46,167.32 crore and disbursements of ₹15,508.25 crore, contributing to nine-month totals of ₹1.39 lakh crore sanctions and ₹41,346.70 crore disbursements.",
            "Sentiment": "positive",
            "PublishDate": 1767189921127,
            "Source": "co_actions_results"
        },
        {
            "Title": "HUDCO Reports Q3 FY26 Loan Sanctions of ₹46,167 Cr",
            "Summary": "Housing and Urban Development Corporation Limited achieved loan sanctions of ₹46,167.32 crore in Q3 FY26, with nine-month sanctions reaching ₹1,39,151.92 crore under regulatory disclosure.",
            "Sentiment": "positive",
            "PublishDate": 1767188591319,
            "Source": "stocks"
        },
        {
            "Title": "HUDCO Bond Committee Approves ₹1905 Cr NCD Issue",
            "Summary": "Housing and Urban Development Corporation's Bond Allotment Committee formally approved the ₹1905 crore NCD fundraising on December 12, 2025, with 6.98% coupon rate and 7-year maturity under Series-E2025.",
            "Sentiment": "positive",
            "PublishDate": 1765522428062,
            "Source": "co_actions_results"
        },
        {
            "Title": "HUDCO Plans Rs 2,500 Crore NCD Issue Through Private Placement",
            "Summary": "Housing and Urban Development Corporation Limited proposes to issue unsecured, taxable, non-convertible debentures worth Rs 500 crore with greenshoe option up to Rs 2,000 crore, totaling Rs 2,500 crore through private placement. The 7-year NCDs with 9% coupon rate will be listed on BSE and funds will be used for lending activities, debt refinancing and general business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1765286968508,
            "Source": "corporate_action"
        },
        {
            "Title": "HUDCO Receives Credit Rating Reaffirmation from CARE Ratings",
            "Summary": "CARE Ratings reaffirmed HUDCO's credit ratings across multiple instruments including CARE AAA: Stable for long-term/short-term bank facilities of ₹80,000 crore and various bonds, while assigning ratings to new perpetual debt instruments. The ratings reflect HUDCO's comfortable capital adequacy ratio of 38.03% as of September 2025, healthy profitability with 1.9% return on total assets, and strategic importance as a government-majority owned entity (75% stake) in housing and urban infrastructure financing.",
            "Sentiment": "positive",
            "PublishDate": 1765260889717,
            "Source": "stock"
        },
        {
            "Title": "HUDCO Receives Credit Rating Affirmation from Japan Credit Rating Agency",
            "Summary": "Japan Credit Rating Agency affirmed HUDCO's BBB+ rating for both Foreign Currency and Local Currency Long-term Issuer Ratings with stable outlook, citing strong government ties and strategic importance in housing and urban development. The ratings reflect HUDCO's role as a nodal agency for government housing schemes, robust loan portfolio growth of 35% year-on-year, and record financial performance with consolidated revenue of INR 103.1 billion and net profit of INR 27.1 billion.",
            "Sentiment": "positive",
            "PublishDate": 1764835614060,
            "Source": "corporate_action"
        },
        {
            "Title": "HUDCO Signs Agreement With NIUA",
            "Summary": "HUDCO has entered into an agreement with the National Institute of Urban Affairs (NIUA). The partnership establishes a formal collaboration between the housing and urban development corporation and the urban planning institute.",
            "Sentiment": "positive",
            "PublishDate": 1763986460250,
            "Source": "stock"
        },
        {
            "Title": "HUDCO Partners with IDFC Foundation for Urban Development Skills Initiative",
            "Summary": "HUDCO has entered into an agreement with IDFC Foundation focused on enhancing urban development skills. The partnership aims to strengthen capabilities in the urban development sector through collaborative skill-building initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1763799838847,
            "Source": "stock"
        },
        {
            "Title": "HUDCO Reports Record H1 Sanctions of ₹93,000 Crores, Expands into Private Sector Lending",
            "Summary": "HUDCO achieved its highest-ever half-yearly sanctions of ₹92,985 crores with 22% growth, while loan book expanded 30% to ₹144,000 crores and disbursements grew 19% to ₹26,000 crores. The company launched private sector lending in five infrastructure segments and introduced an urban infrastructure investment window, targeting 25-30% annual loan book growth with improved asset quality as gross NPA reduced to 1.21%.",
            "Sentiment": "positive",
            "PublishDate": 1763379582710,
            "Source": "stock"
        },
        {
            "Title": "HUDCO Raises Loan Book Target to ₹1.6 Lakh Crore by FY26, Launches Urban Investment Platform",
            "Summary": "Housing and Urban Development Corporation (HUDCO) has increased its loan book target to ₹1.6 lakh crore by FY26 from the previous target of ₹1.5 lakh crore, driven by strong demand in urban infrastructure and steady financial performance. The company has launched the Urban Invest Window (UiWIN) platform to facilitate diversified investments in urban infrastructure. HUDCO reported net interest income of ₹1,006 crore and profit after tax of ₹710 crore in Q2FY26. The company aims to disburse ₹50,000 crore in FY26 compared to ₹40,000 crore last year and targets a net interest margin of 3.3% by year-end. HUDCO is focusing on Greenfield projects across road infrastructure, ports, airports, energy, power, and real estate sectors, while also selectively lending to well-structured private sector projects. The stock trades at ₹223.60 with a market capitalization of ₹44,762 crore, gaining 4% over the past year.",
            "Sentiment": "positive",
            "PublishDate": 1762840725935,
            "Source": "stock"
        },
        {
            "Title": "HUDCO Projects 13-15% Loan Growth With ₹82,000Cr Book and Digital Strategy Focus",
            "Summary": "HUDCO projects strong growth with an ₹82,000 crore loan book and ₹11,000 crore sanctions in H1FY26. The company is targeting 13-15% loan growth with higher disbursement efficiency while increasing focus on affordable housing and urban infrastructure projects. HUDCO is leveraging digital underwriting and AI-based monitoring systems. The company is expanding PSU and state partnership funding to sustain profitability.",
            "Sentiment": "positive",
            "PublishDate": 1762784622888,
            "Source": "stock"
        },
        {
            "Title": "HUDCO Reports Q2 Net Profit of ₹709.83 Crore, Declares Second Interim Dividend",
            "Summary": "HUDCO reported a standalone net profit of ₹709.83 crore for Q2 FY2025-26, up 3% YoY, with revenue rising 27.86% to ₹3,219.03 crore. Total income reached ₹3,251.02 crore. The company declared a second interim dividend of ₹1 per share. HUDCO’s debt-equity ratio stood at 6.98x, GNPA at 1.21%, and NNPA at 0.07%. The loan book increased to ₹1,44,209 crore, reflecting strong operational performance.",
            "Sentiment": "negative",
            "PublishDate": 1762779357779,
            "Source": "earnings"
        },
        {
            "Title": "Housing & Urban Development Corp Declares Rs 1 Dividend Per Share, Reports Higher Q2 Profit",
            "Summary": "Housing & Urban Development Corp has declared a dividend of 1 rupee per share. The company reported Q2 net profit of 7.1 billion rupees compared to 6.9 billion rupees in the same period last year. Q2 revenue increased to 32.2 billion rupees from 25.2 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762775864303,
            "Source": "corporate_action"
        },
        {
            "Title": "HUDCO Launches Urban Invest Window (UiWIN) Platform for Urban Local Bodies",
            "Summary": "Housing and Urban Development Corporation Limited (HUDCO) has launched the Urban Invest Window (UiWIN), a one-stop, end-to-end support platform for Urban Local Bodies (ULBs) to develop bankable infrastructure projects. The platform offers four key solutions: capacity building to ULBs, project formulation and asset monetization, access to financial and capital markets, and management of existing assets. HUDCO stated that this initiative aligns with the company's planned business growth.",
            "Sentiment": "positive",
            "PublishDate": 1762608273549,
            "Source": "stock"
        },
        {
            "Title": "HUDCO Executive Director Finance Leaves to Join Sagarmala Finance Corporation as Managing Director",
            "Summary": "Housing and Urban Development Corporation Limited (HUDCO) announced that Shri LVS Sudhakar Babu, Executive Director (Finance), has left the company to take up the position of Managing Director at Sagarmala Finance Corporation Limited. His departure from HUDCO was effective November 6, 2025, resulting in him ceasing to be Key Managerial Personnel of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1762460740754,
            "Source": "corporate_governance"
        },
        {
            "Title": "HUDCO Receives ESG Ratings from Four Rating Agencies",
            "Summary": "Housing and Urban Development Corporation Limited (HUDCO) disclosed that it has been assigned ESG ratings by four agencies. ESG Risk Assessments Insights Limited rated the company as 'Adequate', SES ESG Research Private Limited provided an 'ee' rating, CFC Finlease Private Limited assigned 'Very Good/B+', and CRISIL ESG Ratings Analytics Limited gave a score of 58 with 'Adequate' category. HUDCO clarified that it did not engage these rating agencies directly, and the ratings were assigned based on publicly available information about the company.",
            "Sentiment": "neutral",
            "PublishDate": 1762248655613,
            "Source": "corporate_action"
        },
        {
            "Title": "HUDCO Forms Strategic Partnerships Worth ₹83,000 Crore During India Maritime Week 2025",
            "Summary": "HUDCO announced two major partnerships during India Maritime Week 2025. The company formed a partnership with Sagarmala Finance for projects valued at ₹80,000 crore and secured ₹3,000 crore in funding through a partnership with SMPA. These partnerships represent significant business development initiatives in the maritime infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1761730625026,
            "Source": "order&deals"
        },
        {
            "Title": "HUDCO Signs Maritime Project Agreement in Mumbai, Offers Up to ₹51 Billion for Paradip Port",
            "Summary": "HUDCO has signed an agreement for a maritime project in Mumbai. The company will offer up to ₹51 billion for Paradip Port and up to ₹4.87 billion for Visakhapatnam Port.",
            "Sentiment": "positive",
            "PublishDate": 1761661987922,
            "Source": "stock"
        },
        {
            "Title": "HUDCO Signs MoU with IIM Calcutta for Training and Research Collaboration",
            "Summary": "Housing and Urban Development Corporation Limited (HUDCO) signed a Memorandum of Understanding with Indian Institute of Management, Calcutta (IIMC) on October 28, 2025. The non-binding MoU establishes collaboration for training, education, research, and capacity building in areas including urban management, governance, municipal finance, and infrastructure financing. The agreement covers certificate courses, consultancy, and fee-based projects and services. The MoU was signed by M Nagaraj, Director (Corporate Planning) at HUDCO, and Professor Alok Kumar Rai, Director at IIMC. The partnership will focus on short duration programs, training programs covering government initiatives, applied research activities, and knowledge exchange through conferences and workshops. The MoU is valid for three years with annual review provisions and can be terminated with six months' written notice. Specific activities proposed for 2025-26 include programs on urban management, municipal finance, bankable projects, contract management, and urban infrastructure development.",
            "Sentiment": "positive",
            "PublishDate": 1761658643980,
            "Source": "order&deals"
        },
        {
            "Title": "HUDCO and Jawaharlal Nehru Port Authority Sign MoU for Port Infrastructure Development",
            "Summary": "Housing and Urban Development Corporation Limited (HUDCO) has signed a Memorandum of Understanding with Jawaharlal Nehru Port Authority (JNPA) to explore collaboration opportunities in port infrastructure development. The MoU covers potential projects including five container terminals, general cargo berth, liquid berth, and related port-led infrastructure at JN Port. The agreement establishes a framework for cooperation in project financing for port development and allied infrastructure. The MoU is non-binding and does not create financial or legal obligations between the parties, serving as a foundation for future discussions and definitive agreements.",
            "Sentiment": "positive",
            "PublishDate": 1761547350163,
            "Source": "order&deals"
        },
        {
            "Title": "HUDCO Signs ₹5,000 Crore Infrastructure MoU with Jawaharlal Nehru Port Authority",
            "Summary": "Housing and Urban Development Corporation Limited (HUDCO) signed a non-binding Memorandum of Understanding with the Jawaharlal Nehru Port Authority (JNPA) to explore cooperation in infrastructure development and project financing. The agreement covers collaboration on existing and upcoming infrastructure projects, including financing and refinancing of port-related initiatives, with an estimated value of ₹5,000 crore. The MoU was signed in Mumbai by HUDCO Chairman and Managing Director Sanjay Kulshrestha and JNPA Chairman Unmesh Sharad Wagh. The partnership aims to identify potential areas for enhancing port infrastructure and supporting financing needs of development projects at JN Port.",
            "Sentiment": "positive",
            "PublishDate": 1761366782688,
            "Source": "order&deals"
        },
        {
            "Title": "Infrastructure Financing Stocks Rise Up to 5% on RBI Policy Measures",
            "Summary": "Shares of infrastructure financing companies HUDCO, Ireda, REC, and Power Finance Corporation gained up to 5% following RBI's announcement of measures to improve infrastructure financing efficiency. The central bank reduced risk weights on NBFC lending to operational, high-quality infrastructure projects, which is expected to lower capital requirements for lenders and reduce borrowing costs for infrastructure projects. HUDCO reached Rs 235 (up 5%), Ireda hit Rs 155.37 (up 4%), REC climbed to Rs 390.3 (up 4.6%), and PFC touched Rs 426.4 (up 4%). The RBI kept the repo rate unchanged at 5.5% while maintaining a neutral stance. The central bank raised its FY26 GDP growth forecast to 6.8% from 6.5% and revised its average headline inflation forecast for FY26 downward to 2.6% from 3.1%.",
            "Sentiment": "positive",
            "PublishDate": 1759302804750,
            "Source": "stock"
        },
        {
            "Title": "HUDCO Reports Loan Sanctions of ₹927.1 Billion and Disbursements of ₹258.38 Billion in Half-Year Results",
            "Summary": "HUDCO announced loan sanctions totaling ₹927.1 billion and disbursements of ₹258.38 billion for the half-year period. The loan sanctions represent the total amount approved for lending, while disbursements reflect the actual funds distributed to borrowers during this timeframe.",
            "Sentiment": "positive",
            "PublishDate": 1759244614783,
            "Source": "stock"
        },
        {
            "Title": "Hudco Signs MoU with NBCC for Development Projects in Multiple Cities",
            "Summary": "Hudco has signed a memorandum of understanding with NBCC for development and construction projects. The projects will be undertaken across four locations: Kaushambi, Panchkula, Ahmedabad, and the Asian Games Village Complex.",
            "Sentiment": "positive",
            "PublishDate": 1758500500817,
            "Source": "order&deals"
        },
        {
            "Title": "HUDCO Signs MoU with NBCC for Development Projects Across Multiple Cities",
            "Summary": "HUDCO signed a non-binding Memorandum of Understanding with NBCC (India) Limited on September 19, 2025, in New Delhi. The MoU covers development and construction projects across four locations: a commercial plot in Kaushambi, Ghaziabad; an institutional plot in Panchkula, Haryana; additional blocks at HUDCO Regional Office in Ahmedabad, Gujarat; and reconstruction of residential flats at Asian Games Village Complex in New Delhi on a turnkey basis as deposit work. The agreement was signed by Sanjay Kulshrestha, CMD of HUDCO, and K. P. Mahadevaswamy, CMD of NBCC, in the presence of senior officials from both organizations.",
            "Sentiment": "positive",
            "PublishDate": 1758289026682,
            "Source": "order&deals"
        },
        {
            "Title": "HUDCO Re-appoints Baldeo Purushartha as Government Nominee Director",
            "Summary": "HUDCO has re-appointed Shri Baldeo Purushartha as Government Nominee Director with immediate effect. His previous tenure ended on the date of the company's 55th Annual General Meeting on September 15, 2025. The Board of Directors approved the re-appointment through a resolution passed by circulation on the same date. Purushartha, who holds DIN 07570116, serves as Joint Secretary in the Infrastructure Policy and Planning Division at the Department of Economic Affairs. He is a 2002 batch IAS officer from Punjab cadre and represents the Government of India on boards of several Central Public Sector Enterprises including Indian Railway Station Development Corporation Ltd and Indian Railway Finance Corporation Ltd. He does not hold any shares in HUDCO and is not related to other board directors.",
            "Sentiment": "neutral",
            "PublishDate": 1757941826657,
            "Source": "corporate_governance"
        },
        {
            "Title": "HUDCO Appoints Government Nominee Director and Signs Rs. 11,300 Crore MoU with Nagpur Development Authority",
            "Summary": "HUDCO appointed Shri Baldeo Purushartha as Government Nominee Director with immediate effect following a Ministry of Housing and Urban Affairs order and board approval. Purushartha is a 2002 batch IAS officer serving as Joint Secretary in the Department of Economic Affairs, Ministry of Finance, and represents the Government of India on boards of several Central Public Sector Enterprises. He does not hold any shares in HUDCO and is not related to other board directors. Additionally, HUDCO signed a non-binding Memorandum of Understanding with Nagpur Metropolitan Region Development Authority to provide funding up to Rs. 11,300 Crore over five years for land acquisition, housing, and infrastructure projects in Nagpur Metropolitan Region. HUDCO will also extend consultancy services and capacity building activities. The MoU was signed in the presence of Maharashtra Chief Minister Devendra Fadnavis, Deputy Chief Minister Eknath Shinde, and HUDCO Chairman & Managing Director Sanjay Kulshrestha.",
            "Sentiment": "positive",
            "PublishDate": 1757336645205,
            "Source": "corporate_governance"
        },
        {
            "Title": "HUDCO Signs MoU with NMRDA for Rs 11,300 Crore Nagpur Metro Funding",
            "Summary": "HUDCO has signed a Memorandum of Understanding with NMRDA to provide funding of Rs 11,300 crore for Nagpur Metro development. The funding arrangement is structured over a 5-year period.",
            "Sentiment": "positive",
            "PublishDate": 1757334283807,
            "Source": "order&deals"
        },
        {
            "Title": "HUDCO Changes Record Date for Final Dividend to September 9, 2025 Due to RBI Holiday",
            "Summary": "HUDCO has revised the record date for determining eligibility for final dividend payment from September 8, 2025 to September 9, 2025. The change was made following requests from stock exchanges due to a clearing/settlement holiday declared by the Reserve Bank of India on September 8, 2025. The company's 55th Annual General Meeting is scheduled for September 15, 2025. The final dividend on equity shares, as recommended by the Board of Directors, will be paid to eligible members within 30 days of declaration if approved at the AGM.",
            "Sentiment": "neutral",
            "PublishDate": 1757070222371,
            "Source": "corporate_action"
        },
        {
            "Title": "HUDCO Cancels Rs 3,000 Crore Bond Issue Due to Higher Coupon Rates",
            "Summary": "Housing and Urban Development Corporation Limited (HUDCO) has cancelled its planned bond issue due to higher than expected coupon rates. The Bond Allotment Committee meeting scheduled for August 29, 2025, to approve the issuance of Non-Convertible Debentures worth Rs. 3,000 crore has been withdrawn. The bonds were planned as Unsecured, Taxable, Redeemable, Non-Convertible, Non-Cumulative NCDs with a face value of Rs. 1,00,000 each (Series-E 2025) on a private placement basis. HUDCO clarified that there is no impact on investors as no securities had been allotted.",
            "Sentiment": "negative",
            "PublishDate": 1756382216507,
            "Source": "corporate_action"
        },
        {
            "Title": "HUDCO Plans Rs 3,000 Crore NCD Issue Through Private Placement",
            "Summary": "Housing and Urban Development Corporation Limited (HUDCO) plans to issue unsecured, taxable, redeemable, non-convertible debentures worth up to Rs 3,000 crore on private placement basis. The Bond Allotment Committee meeting is scheduled for August 29, 2025 to approve this issuance. The NCDs will have a face value of Rs 1,00,000 each (Series-E 2025) with a 3-year tenor and redemption date of August 29, 2028. The debentures carry a coupon rate of 1% per annum with annual interest payments. The issue has received AAA ratings from ICRA, CARE, and IRRPL with stable outlook. The base issue size is Rs 500 crore with a green shoe option to retain oversubscription up to Rs 2,500 crore. Funds raised will be used to augment long-term resources for lending activities, debt refinancing, and other business operations. The NCDs will be listed on BSE and issued through NSE's Electronic Book Platform to eligible institutional investors including mutual funds, banks, insurance companies, and other qualified entities.",
            "Sentiment": "neutral",
            "PublishDate": 1756103988322,
            "Source": "corporate_action"
        },
        {
            "Title": "HUDCO Executive Forecasts 25% Asset Under Management Growth",
            "Summary": "HUDCO's executive stated that 25% growth in Assets Under Management is achievable in the coming years. The company is expected to increase its guidance to 1.5 trillion rupees, with completion anticipated by Q3.",
            "Sentiment": "positive",
            "PublishDate": 1755836539841,
            "Source": "stock"
        },
        {
            "Title": "HUDCO Reports Strong Q1 FY26 Results with 30% Loan Book Growth and Improved Asset Quality",
            "Summary": "Housing and Urban Development Corporation Limited (HUDCO) delivered robust quarterly results with loan book growing 30% year-on-year to Rs 1.34 lakh crore. The government-owned financial institution reported 34% revenue growth and 13% increase in net profit. Asset quality improved significantly with gross NPA declining from 1.67% to 1.34% and net NPA reducing to slightly less than 0.1%. Sanctions surged 143% quarter-on-quarter to Rs 34,000 crore while disbursements reached an all-time high of Rs 12,800 crore. Net Interest Margin stood at 2.94% with expectations to cross 3% in the next quarter. The company targets over 30% growth in disbursements for FY26 and aims to reach Rs 1.5 lakh crore loan book by Q3 FY26. HUDCO is expanding its focus beyond housing to infrastructure financing including metros, water projects, roads, and has started private sector funding with guidelines for roads and real estate. Management expressed confidence in overachieving FY26 guidance with a long-term target of Rs 3 lakh crore loan book by FY30.",
            "Sentiment": "positive",
            "PublishDate": 1755514174757,
            "Source": "earnings"
        },
        {
            "Title": "HUDCO Reports Record ₹1.34 Lakh Crore Loan Book and ₹34,224 Crore Q1 Sanctions",
            "Summary": "HUDCO achieved a record loan book of ₹1.34 lakh crore and sanctioned ₹34,224 crore in Q1. The company signed MOUs worth ₹3.5 lakh crore for infrastructure and housing projects. HUDCO is focusing on PMAY 2.0, Smart Cities, and Urban Challenge Fund initiatives to drive lending growth over the coming years.",
            "Sentiment": "positive",
            "PublishDate": 1754481930976,
            "Source": "stock"
        },
        {
            "Title": "HUDCO Reports Rs 630 Crore Quarterly Profit, Declares Rs 1.15 Interim Dividend",
            "Summary": "Housing and Urban Development Corporation Limited (HUDCO) reported a profit after tax of Rs 630.23 crore for the quarter ended June 30, 2025, compared to Rs 557.75 crore in the same period last year. The company's total income increased to Rs 2,945.47 crore from Rs 2,197.19 crore year-on-year. The Board declared a first interim dividend of Rs 1.15 per equity share for FY 2025-26, with August 14, 2025 as the record date. Interest income rose to Rs 2,924.64 crore from Rs 2,174.60 crore in the previous year quarter. The company raised Rs 5,370 crore through non-convertible debt securities during the quarter and appointed M/s VAP & Associates as Secretarial Auditor for five years, subject to shareholder approval. HUDCO maintained 100% security cover for all secured bonds and debentures outstanding as of June 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754478032112,
            "Source": "corporate_action"
        },
        {
            "Title": "Housing & Urban Development Corporation Reports 12.5% Growth in Q1 Net Profit",
            "Summary": "Housing & Urban Development Corporation reported Q1 net profit of 6.3 billion rupees compared to 5.6 billion rupees in the same period last year. The company's revenue increased to 29.4 billion rupees from 21.9 billion rupees year-over-year, representing a 34.2% growth.",
            "Sentiment": "positive",
            "PublishDate": 1754477389935,
            "Source": "earnings"
        },
        {
            "Title": "HUDCO Schedules Board Meeting on August 6 to Review Q1 Results and Consider Interim Dividend",
            "Summary": "HUDCO has scheduled a Board of Directors meeting on August 6, 2025, to consider and approve unaudited financial results for the quarter ended June 30, 2025, and to discuss a potential first interim dividend for financial year 2025-26. The record date for dividend entitlement has been set for August 14, 2025, subject to board approval. The company's trading window, which closed on July 1, 2025, will remain closed until August 8, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753791327788,
            "Source": "corporate_action"
        },
        {
            "Title": "HUDCO Discontinues HUDCO Niwas Portfolio Services",
            "Summary": "HUDCO (Housing and Urban Development Corporation) has announced that it will no longer offer HUDCO Niwas Portfolio Services. This service was likely related to housing or urban development, given HUDCO's primary business focus.",
            "Sentiment": "negative",
            "PublishDate": 1752839006000,
            "Source": "default"
        },
        {
            "Title": "HUDCO: Plans ₹3,000 Crore Fund Raise via NCD Issue",
            "Summary": "Housing & Urban Development Corporation Ltd. (HUDCO) is considering raising up to ₹3,000 crore through unsecured, redeemable Non-Convertible Debentures on a private placement basis. The NCDs will offer a 6.64% coupon rate, with interest payments in 2026, 2027, and 2028. The base issue size is ₹500 crore with a green shoe option of ₹2,500 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1752737399000,
            "Source": "corporate_action"
        },
        {
            "Title": "HUDCO Plans to Raise ₹3,000 Crores Through Private Placement",
            "Summary": "Housing and Urban Development Corporation (HUDCO) has announced plans to raise ₹3,000 crores through private placement. This fundraising initiative suggests the company is looking to increase its capital for potential investments or operational purposes.",
            "Sentiment": "positive",
            "PublishDate": 1752735466000,
            "Source": "default"
        },
        {
            "Title": "HUDCO: ₹1 Lakh Crore MoU with MPUDCL for Madhya Pradesh Development",
            "Summary": "HUDCO signed an MoU with MPUDCL to provide ₹1,00,000 crore financial assistance over 5 years for housing and infrastructure projects in Madhya Pradesh. HUDCO will also offer consultancy and capacity-building support. Q4 results show 4% YoY net profit growth to ₹728 crore, 26% NII increase to ₹962 crore, and improved asset quality with reduced NPAs.",
            "Sentiment": "positive",
            "PublishDate": 1752256000000,
            "Source": "corporate_action"
        },
        {
            "Title": "HUDCO Signs Agreement with MP Urban Development Company for 1 Trillion Rupees Financial Support",
            "Summary": "HUDCO (Housing and Urban Development Corporation) has entered into an agreement with the Madhya Pradesh Urban Development Company to provide financial support of 1 trillion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1752245673000,
            "Source": "default"
        },
        {
            "Title": "HUDCO Reports Loan Sanctions and Disbursement Increase for Q1 FY26",
            "Summary": "Housing and Urban Development Corporation (HUDCO) has reported loan sanctions of ₹33,904 crore for Q1 FY26. The company also announced a 54% increase in disbursements for the same quarter. No specific disbursement amount was provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751296815000,
            "Source": "default"
        },
        {
            "Title": "HUDCO Board Approves Fundraising of Up to ₹750 Crores via Private Placement of NCDs",
            "Summary": "The Board of Housing and Urban Development Corporation (HUDCO) has sanctioned a fundraising initiative of up to ₹750 crores. This will be achieved through the issuance of Non-Convertible Debentures (NCDs) via private placement.",
            "Sentiment": "positive",
            "PublishDate": 1749200737000,
            "Source": "default"
        },
        {
            "Title": "HUDCO: Plans $2 Billion Overseas Borrowing, Targets Yen Market",
            "Summary": "Housing and Urban Development Corp. aims to raise $2 billion through overseas borrowing in FY2024, including $500 million in Q2. The company plans to tap the Japanese market for yen-denominated bonds and loans, potentially including social bonds. Domestically, HUDCO will raise funds through 54EC capital gains bonds and zero coupon bonds. The company expects to grow its loan book by over 25% CAGR, reaching Rs 3 lakh crore by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1746623998000,
            "Source": "corporate_action"
        },
        {
            "Title": "HUDCO Forecasts Strong AUM Growth for FY25",
            "Summary": "Housing and Urban Development Corporation (HUDCO) has projected its Assets Under Management (AUM) growth for the fiscal year 2025 at 35%, surpassing its previous guidance of over 30%. This indicates a more optimistic outlook for the company's financial performance in the coming fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1746604833000,
            "Source": "result"
        }
    ]
}