{
    "Symbol": "HYBRIDFIN",
    "ISIN": "INE965B01022",
    "News": [
        {
            "Title": "Hybrid Financial Services Board Meet on Feb 10",
            "Summary": "Hybrid Financial Services Limited has scheduled a board meeting on February 10, 2026, to consider Q3FY26 unaudited financial results following NCLT-approved merger with Maximus Securities Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1769504494197,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hybrid Financial Services Completes Merger with Wholly-Owned Subsidiary Maximus Securities",
            "Summary": "The National Company Law Tribunal Mumbai approved the merger of Maximus Securities Limited (transferor) with Hybrid Financial Services Limited (transferee) with an appointed date of April 1, 2024. The scheme consolidates the stock broking business of the wholly-owned subsidiary into the listed parent company to streamline operations and reduce compliance costs.",
            "Sentiment": "positive",
            "PublishDate": 1765365276320,
            "Source": "corporate_action"
        },
        {
            "Title": "Hybrid Financial Services Reports Mixed Quarterly Performance",
            "Summary": "Hybrid Financial Services released its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported total income from operations and others of Rs. 746.76 lakhs for the quarter. Net profit after tax stood at Rs. 14.76 lakhs for the quarter, while the half-year figure was Rs. 38.06 lakhs. The company experienced other comprehensive income fluctuations, with remeasurement gains/losses on non-current investments showing Rs. 0.18 lakhs for the quarter compared to a loss of Rs. 484.77 lakhs in the previous period. Basic and diluted earnings per share were Rs. 0.05 for the quarter. The company's paid-up equity share capital remained at Rs. 1,471.81 lakhs with shares of Rs. 5 each. No exceptional or extraordinary items were reported during the period.",
            "Sentiment": "neutral",
            "PublishDate": 1761857176895,
            "Source": "earnings"
        },
        {
            "Title": "Hybrid Financial Services Reports Strong Profit Growth and Plans Subsidiary Merger",
            "Summary": "Hybrid Financial Services Limited reported a profit of Rs. 205.93 lakhs for FY2024-25, up from Rs. 88.01 lakhs in the previous year. The company earned total income of Rs. 352.97 lakhs and reversed contingency provisions of Rs. 465.07 lakhs. The Board approved a 1% dividend on preference shares and recommended redemption of Rs. 70 lakhs worth of preference shares. The company is pursuing a merger with its wholly-owned subsidiary Maximus Securities Limited, with NCLT passing a first motion order in November 2024. Key board changes include the appointment of Dr. Nitin Tike as director and resignation of Mahesh S. Makhijani. The 38th Annual General Meeting is scheduled for September 12, 2025, via video conferencing.",
            "Sentiment": "positive",
            "PublishDate": 1754551698841,
            "Source": "corporate_action"
        }
    ]
}