{
    "Symbol": "HYUNDAI",
    "ISIN": "INE0V6F01027",
    "News": [
        {
            "Title": "Hyundai Motor India Plans 5-Year Growth Strategy",
            "Summary": "Hyundai Motor India outlines ambitious five-year growth plan with over 7% CAGR, targeting 15% market share through INR 45,000 crore investment and 26 new product launches across hybrid, EV, and CNG segments.",
            "Sentiment": "positive",
            "PublishDate": 1770089470021,
            "Source": "stocks"
        },
        {
            "Title": "Hyundai Motor India Updates Authorized Officials List",
            "Summary": "Hyundai Motor India Limited has authorized three key officials, including Managing Director & CEO Tarun Garg, to assess materiality and make regulatory disclosures to stock exchanges under SEBI LODR.",
            "Sentiment": "neutral",
            "PublishDate": 1770045218585,
            "Source": "stocks"
        },
        {
            "Title": "Hyundai Motor India Eyes EU Export Expansion",
            "Summary": "Hyundai Motor India is exploring opportunities to export vehicles to the European Union market, marking a potential strategic expansion of its international operations beyond current markets.",
            "Sentiment": "positive",
            "PublishDate": 1770029349662,
            "Source": "stocks"
        },
        {
            "Title": "Hyundai Motor India Faces Rising Commodity Costs",
            "Summary": "Hyundai Motor India executives report surge in precious metals, copper, and aluminium prices while noting maximum impact of tax cuts in compact SUV segment.",
            "Sentiment": "neutral",
            "PublishDate": 1770028193675,
            "Source": "stocks"
        },
        {
            "Title": "Hyundai Motor India Q3 Net Profit Rises to ₹12.4B",
            "Summary": "Hyundai Motor India reports consolidated net profit of ₹12.4 billion for Q3, marking a year-over-year increase from ₹11.6 billion in the previous year period.",
            "Sentiment": "positive",
            "PublishDate": 1770023769542,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hyundai Motor India Records Highest Monthly Sales",
            "Summary": "Hyundai Motor India achieved highest-ever monthly domestic sales of 59,107 units in January 2026 with 9.5% YOY growth. Total sales reached 73,137 units with 11.5% growth including exports.",
            "Sentiment": "positive",
            "PublishDate": 1769920049081,
            "Source": "stocks"
        },
        {
            "Title": "Hyundai Motor India Q3 FY26 Earnings Call on Feb 2",
            "Summary": "Hyundai Motor India Limited has scheduled an earnings conference call for February 02, 2026, at 4:30 PM IST to discuss Q3 & 9M FY26 financial results with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1769578637208,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hyundai shares drop 4% on Trump tariff threat",
            "Summary": "Hyundai Motor shares plummeted over 4% after Trump threatened to increase tariffs on South Korean auto and pharmaceutical industries from 15% to 25%, citing delayed trade deal approval.",
            "Sentiment": "negative",
            "PublishDate": 1769476634718,
            "Source": "global"
        },
        {
            "Title": "Hyundai Motor India shares fall 20% from peak",
            "Summary": "Hyundai Motor India stock declined 20% from September highs amid limited GST benefits and margin concerns from new Pune plant operations.",
            "Sentiment": "negative",
            "PublishDate": 1768191221009,
            "Source": "stocks"
        },
        {
            "Title": "Hyundai Motor India ESG Rating Upgraded to Leader",
            "Summary": "NSE Sustainability Ratings upgraded Hyundai Motor India's ESG rating to 76 (Leader category) for FY25, marking a significant improvement from 58 in FY24. The independent assessment reflects enhanced sustainability performance.",
            "Sentiment": "positive",
            "PublishDate": 1767959995130,
            "Source": "stocks"
        },
        {
            "Title": "Hyundai Motor Shares Rally 14.9% on Nvidia Partnership",
            "Summary": "Hyundai Motor shares hit record high amid speculation of deeper Nvidia partnership beyond chip supply, following meeting between executives at CES Las Vegas.",
            "Sentiment": "positive",
            "PublishDate": 1767758319476,
            "Source": "global"
        },
        {
            "Title": "Hyundai offers benefits up to ₹1.69 lakh on cars",
            "Summary": "Hyundai Motor India announces significant benefits up to ₹1.69 lakh on passenger vehicles including Exter, i20, and Grand i10 Nios. Offers valid until January 31, 2026, excluding Venue and Creta models.",
            "Sentiment": "positive",
            "PublishDate": 1767605099729,
            "Source": "stocks"
        },
        {
            "Title": "Hyundai Motor India Dec Sales Rise 6.6% to 58,702 Units",
            "Summary": "Hyundai Motor India reported December sales of 58,702 units with 6.6% YoY growth. Domestic sales contributed 42,416 units while exports surged 26.5% to 16,286 units.",
            "Sentiment": "positive",
            "PublishDate": 1767321406382,
            "Source": "stocks"
        },
        {
            "Title": "Hyundai Motor India shares fall after December sales miss",
            "Summary": "Hyundai Motor India shares dropped 2% as December sales of 58,702 units missed estimates of 62,667 units. Tarun Garg appointed as new MD & CEO from January 1.",
            "Sentiment": "negative",
            "PublishDate": 1767266538252,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hyundai Motor India December Sales Miss Estimates",
            "Summary": "Hyundai Motor India reported December sales of 58,702 units, up 6.6% YoY from 55,078 units but below analyst estimates of 63,030 units, with strong export growth of 26.5%.",
            "Sentiment": "neutral",
            "PublishDate": 1767262951588,
            "Source": "stocks"
        },
        {
            "Title": "Hyundai Motor India appoints two senior executives",
            "Summary": "Hyundai Motor India Limited announces appointment of Dong Huwy Park as COO and Hyun Sup Lee as Corporate Planning Head, effective January 2026, bringing combined 54 years of automotive experience.",
            "Sentiment": "positive",
            "PublishDate": 1767244124177,
            "Source": "stocks"
        },
        {
            "Title": "Tarun Garg Takes Charge As First Indian MD & CEO Of Hyundai",
            "Summary": "Tarun Garg officially assumes charge as Hyundai Motor India's first Indian MD & CEO on January 1, 2026, succeeding Unsoo Kim with 32 years automotive experience and ₹45,000 crore investment plan.",
            "Sentiment": "positive",
            "PublishDate": 1767240703465,
            "Source": "stocks"
        },
        {
            "Title": "Hyundai Motor India Raises Prices by 0.6% from Jan 1",
            "Summary": "Hyundai Motor India announces weighted-average price increase of 0.6% across model range from January 1, 2026, citing rising costs of precious metals and commodities affecting vehicles priced ₹5.47-47 lakh.",
            "Sentiment": "neutral",
            "PublishDate": 1767188097968,
            "Source": "stocks"
        },
        {
            "Title": "Hyundai India MD Unsoo Kim resigns Dec 31; Tarun Garg to lead",
            "Summary": "Hyundai Motor India MD Unsoo Kim resigns effective December 31, 2025, returning to South Korea for strategic role. Tarun Garg appointed as new MD & CEO from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767181682586,
            "Source": "stocks"
        },
        {
            "Title": "Hyundai Motor India Plans 0.6% Price Hike From Jan 2026",
            "Summary": "Hyundai Motor India announces 0.6% price increase across all models starting January 1, 2026, citing rising costs of precious metals and commodities as the primary driver for the adjustment.",
            "Sentiment": "neutral",
            "PublishDate": 1767172213805,
            "Source": "stocks"
        },
        {
            "Title": "Hyundai Motor India Launches Commercial Fleet Models",
            "Summary": "Hyundai Motor India enters commercial mobility with Prime HB and Prime SD models priced at ₹5.99 lakh and ₹6.89 lakh respectively, targeting fleet operators with CNG options and enhanced fuel efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1767165529481,
            "Source": "stocks"
        },
        {
            "Title": "Hyundai Creta SUV crosses 2 lakh sales in 2025",
            "Summary": "Hyundai Motor India's Creta SUV achieves highest-ever annual sales exceeding 200,000 units in CY2025, averaging 550 units daily. The model maintains 34% market share in mid-size SUV segment.",
            "Sentiment": "positive",
            "PublishDate": 1767162171632,
            "Source": "stocks"
        },
        {
            "Title": "Hyundai Motor India Launches Prime Taxi Range",
            "Summary": "Hyundai Motor India enters commercial mobility segment with Prime HB and Prime SD variants priced at ₹5.99 lakh and ₹6.89 lakh respectively, featuring 1.2L Kappa engine with CNG option.",
            "Sentiment": "positive",
            "PublishDate": 1767088228892,
            "Source": "stocks"
        },
        {
            "Title": "Hyundai Motor India Reports 9.1% Growth in November 2025 Sales at 66,840 Units",
            "Summary": "Hyundai Motor India Limited achieved total sales of 66,840 units in November 2025, marking a 9.1% year-on-year growth with domestic sales of 50,340 units (4.3% growth) and exports of 16,500 units (26.9% growth). The all-new Hyundai VENUE contributed significantly to the SUV portfolio with over 32,000 bookings within a month of its launch, strengthening the company's position in the compact SUV segment.",
            "Sentiment": "positive",
            "PublishDate": 1764578447034,
            "Source": "global"
        },
        {
            "Title": "Hyundai Motor Invests Additional 214.7M Rupees in Tamil Nadu Wind Farm Project",
            "Summary": "Hyundai Motor has made an additional investment of 214.7 million rupees in FPEL TN Wind Farm. This investment represents the company's continued commitment to renewable energy infrastructure in Tamil Nadu.",
            "Sentiment": "positive",
            "PublishDate": 1763636530380,
            "Source": "stock"
        },
        {
            "Title": "Hyundai Motor India Seeks Shareholder Approval for Tarun Garg's Appointment as Managing Director & CEO",
            "Summary": "Hyundai Motor India Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Tarun Garg as Managing Director and Chief Executive Officer effective January 1, 2026. The appointment is for a term until August 31, 2028, with a maximum monthly remuneration of Rs. 1.62 crores including performance incentives. The remote e-voting period runs from November 12, 2025 to December 11, 2025, with results to be declared by December 15, 2025. Garg, who holds a mechanical engineering degree and MBA from IIM Lucknow, previously served in leadership roles at Maruti Suzuki India Limited before joining Hyundai. The Board of Directors appointed KJ Chandra Mouli as scrutinizer for the postal ballot process. The cut-off date for eligible voting shareholders is November 7, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762852464752,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hyundai Motor India Launches All-New VENUE and VENUE N Line SUVs Starting at INR 7.89 Lakh",
            "Summary": "Hyundai Motor India Limited launched the all-new Hyundai VENUE and VENUE N Line compact SUVs, marking a significant milestone with their global debut. The all-new VENUE starts at INR 7,89,900 (ex-showroom) and features enhanced dimensions - 48mm taller and 30mm wider than the existing model, with a 2520mm wheelbase. The vehicle introduces Hyundai's Connected Car Navigation Cockpit (ccNC) system accelerated by NVIDIA, dual 12.3-inch curved panoramic displays, and over 65 advanced safety features including 33 standard safety features across all variants. The VENUE N Line variant offers 32 exclusive upgrades with sporty design elements and over 70 advanced safety features with ADAS Level 2. Both models are built on the Global K1 enhanced platform and offer multiple powertrain options including Kappa 1.2l MPi petrol, Kappa 1.0l Turbo GDi petrol, and U2 1.5l CRDi Diesel engines. The vehicles will be exclusively manufactured in India for global markets at Hyundai's Pune manufacturing plant, representing the first of 26 products planned for introduction by 2030. Managing Director Unsoo Kim announced the company's investment of over INR 45,000 crores, reaffirming their long-term commitment to the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1762244819065,
            "Source": "stock"
        },
        {
            "Title": "Hyundai Motor India Reports Total Sales of 69,894 Units in October 2025",
            "Summary": "Hyundai Motor India Limited achieved total monthly sales of 69,894 units in October 2025, comprising 53,792 units in domestic sales and 16,102 units in exports. The company reported 11% year-on-year growth in export sales. The popular SUV models CRETA and VENUE recorded their second highest combined monthly sales of 30,119 units. Tarun Garg, Whole-time Director and Chief Operating Officer, attributed the strong performance to festive season demand during Dussehra, Dhanteras and Diwali, along with positive impact from GST 2.0 reforms. The company announced that the all-new Hyundai VENUE is open for bookings.",
            "Sentiment": "positive",
            "PublishDate": 1761987676203,
            "Source": "stock"
        },
        {
            "Title": "Hyundai Motor India Reports Strong Q2 Results, Appoints New MD & CEO",
            "Summary": "Hyundai Motor India's Board approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported standalone revenue of ₹171,558.31 million for Q2 2025, compared to ₹169,607.98 million in Q2 2024. Profit after tax increased to ₹15,702.48 million from ₹13,377.93 million year-over-year. For the half-year period, revenue reached ₹333,354.47 million with profit after tax of ₹29,060.01 million. The Board also approved a postal ballot notice for appointing Tarun Garg as Managing Director and Chief Executive Officer effective January 1, 2026. Additionally, the company commenced production at its new Talegaon manufacturing facility in Maharashtra from October 1, 2025, with an annual capacity of 170,000 units.",
            "Sentiment": "positive",
            "PublishDate": 1761858288887,
            "Source": "earnings"
        },
        {
            "Title": "Hyundai Motor India Expects Commodity Price Increases, Plans Cost-Cutting Measures",
            "Summary": "Hyundai Motor India's executive expects certain commodity prices to rise in Q3. The company plans to implement cost-cutting strategies in response to the anticipated price increases.",
            "Sentiment": "neutral",
            "PublishDate": 1761824462182,
            "Source": "stock"
        },
        {
            "Title": "Hyundai Motor India Executive Sees Growth Opportunities in SUV Segment After Tax Changes",
            "Summary": "Hyundai Motor India executives expressed optimism about expanding SUV sales opportunities and highlighted strong growth in rural sales following recent tax changes. The company officials noted strong demand for SUVs in the post-tax change environment. Additionally, company executives are confident about achieving good margins through improved efficiency and cost management strategies in the domestic market.",
            "Sentiment": "positive",
            "PublishDate": 1761820379847,
            "Source": "stock"
        },
        {
            "Title": "Hyundai Motor MD Forecasts Export Performance to Surpass FY26 Targets",
            "Summary": "Hyundai Motor's Managing Director has predicted that the company's export performance will exceed its FY26 targets. The MD expressed confidence in strong export performance going forward.",
            "Sentiment": "positive",
            "PublishDate": 1761816177705,
            "Source": "stock"
        },
        {
            "Title": "Hyundai Motor Q2 Net Profit Rises to 15.7B Rupees, Beats Estimates",
            "Summary": "Hyundai Motor reported Q2 consolidated net profit of 15.7 billion rupees, up from 13.7 billion rupees year-over-year, exceeding estimates of 15.18 billion rupees. The company's Q2 EBITDA reached 23.82 billion rupees compared to 22.05 billion rupees in the previous year, marginally above the estimated 23.8 billion rupees. EBITDA margin improved to 13.97% from 12.78% year-over-year, surpassing the estimated 13.6%.",
            "Sentiment": "positive",
            "PublishDate": 1761815303463,
            "Source": "earnings"
        },
        {
            "Title": "Hyundai Motor India Expects Muted Revenue Growth Amid Volume Decline in September Quarter",
            "Summary": "Hyundai Motor India shares traded 0.6% lower ahead of quarterly results announcement. According to a CNBC-TV18 poll, the company's revenue growth is expected to be only 2% due to declining volumes year-on-year, with projected revenue of ₹17,532 crore. Volumes declined 1% from last year but increased 6% sequentially. Net profit may increase 10% to ₹1,518 crore, while EBITDA could rise 8% to ₹2,380 crore. EBITDA margins are expected to expand 80 basis points to 13.6%, though higher discounts may limit margin expansion and weigh on realizations. The impact could be partially offset by cost control measures and a SUV-focused product mix. Investors are seeking clarity on EV portfolio sales strategy, demand outlook, and new product timelines.",
            "Sentiment": "neutral",
            "PublishDate": 1761802873186,
            "Source": "earnings"
        },
        {
            "Title": "Hyundai Motor India Retail Sales Decline 2.8% in Third Quarter",
            "Summary": "Hyundai Motor experienced a 2.8% decline in retail sales in India during the third quarter. The drop represents a decrease in the automaker's retail performance in the Indian market.",
            "Sentiment": "negative",
            "PublishDate": 1761801142688,
            "Source": "stock"
        },
        {
            "Title": "Hyundai Motor India Schedules Q2 & H1 FY26 Earnings Conference Call",
            "Summary": "Hyundai Motor India Limited will conduct a conference call with investors and analysts on October 30, 2025, at 4:30 PM IST to discuss Q2 & H1 FY26 results. The company has provided dial-in details and webcast links for participation. The investor presentation will be submitted to stock exchanges before the call and made available on the company's website. The management emphasized that discussions will be based on publicly available information and no unpublished price sensitive information will be shared during the meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1761309013763,
            "Source": "earnings"
        },
        {
            "Title": "Hyundai Motor India Appoints Sunil Moolchandani to Senior Management",
            "Summary": "Hyundai Motor India Limited announced the appointment of Sunil Moolchandani to its senior management team, effective October 23, 2025. Moolchandani brings over 24 years of experience in automotive and commercial sectors, having previously served as Chief Commercial Officer – Central Zone at Maruti Suzuki India Limited. He holds a Bachelor of Engineering (Electrical) from the University of Pune and a Post Graduate Diploma in Management from Symbiosis Centre for Management and Human Resource Development, Pune.",
            "Sentiment": "positive",
            "PublishDate": 1761132705069,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hyundai Motor India Names Tarun Garg as New MD and CEO",
            "Summary": "Hyundai Motor India appointed Tarun Garg as managing director and CEO, effective January 1, 2026. Garg, who serves as whole-time director, will succeed Unsoo Kim, who returns to South Korea for a strategic role at Hyundai Motor Company. The board made this decision on October 14. Garg is a mechanical engineer from Delhi Technological University with an MBA from IIM Lucknow. He worked at Maruti Suzuki for over 25 years in various roles before joining Hyundai Motor India in December 2019 as director of sales, marketing and services, later becoming chief operating officer in January 2023. At Hyundai, he introduced Advanced Driver Assistance Systems in nine models and led initiatives in sales strategies, digital marketing, and business expansion into rural markets and used car segments.",
            "Sentiment": "positive",
            "PublishDate": 1760598650195,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hyundai Plans ₹45,000 Crore Investment in India by 2030 with 26 New Vehicle Launches",
            "Summary": "Hyundai Motor Company announced a ₹45,000 crore investment in India through FY2030 at its first Investor Day in Mumbai. Global CEO Jose Munoz stated that India is central to Hyundai's global strategy. The investment will focus on product expansion, R&D, manufacturing, and hiring engineers. Hyundai plans to launch 26 products by 2030, including seven new nameplates such as an MPV and off-road SUV. The company targets sales of 860,000 units with production capacity of 1.1 million. Exports are expected to contribute up to 30% of total output by 2030, with Hyundai aiming to become the largest vehicle exporter from India. The company will launch India's first locally manufactured dedicated electric SUV by 2027 and introduce its luxury brand Genesis the same year. Eight hybrid models will be introduced by 2030, comprising 16% of the product portfolio as part of a 52% eco-friendly product mix including EVs and CNG vehicles. Hyundai is developing a new 1.2-litre turbo-petrol engine for hybrid applications, expected to debut in the Bayon crossover and later in i20, Venue, and next-generation Creta models.",
            "Sentiment": "positive",
            "PublishDate": 1760529699615,
            "Source": "stock"
        },
        {
            "Title": "Hyundai India Targets 7% Annual Sales Growth and ₹1 Trillion Revenue by FY30",
            "Summary": "Hyundai India anticipates 7% annual sales growth by 2030 and plans to expand its product lineup from 14 to 18 models. The company plans to invest ₹450 billion from FY26 to FY30 and expects EBITDA margins between 11% and 14% during this period. Hyundai India projects revenue to exceed ₹1 trillion by FY30, representing more than 1.5 times its FY25 figures.",
            "Sentiment": "positive",
            "PublishDate": 1760497209546,
            "Source": "stock"
        },
        {
            "Title": "Hyundai Motor India Announces Leadership Transition: Unsoo Kim to Step Down, Tarun Garg Named Successor",
            "Summary": "Hyundai Motor India Limited announced a leadership succession plan with Unsoo Kim resigning as Managing Director effective December 31, 2025, to return to South Korea for a strategic role at Hyundai Motor Company. Tarun Garg, who serves as Whole-time Director, will succeed Kim as Managing Director & CEO from January 1, 2026, subject to shareholder approval. Garg holds a Mechanical Engineering degree from Delhi Technological University and an MBA from IIM Lucknow. He previously worked at Maruti Suzuki India Limited in various roles including Executive Director of Marketing, Logistics, Parts and Accessories. At Hyundai, he has led initiatives in sales strategies, digital marketing, and introduced Advanced Driver Assistance Systems across nine models. The Board approved this succession plan during its meeting on October 14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760467291328,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hyundai Motor India Schedules First Investor Day for October 15, 2025",
            "Summary": "Hyundai Motor India Limited will hold its first Investor Day on October 15, 2025, at 9:00 am in Mumbai. The event will be live-streamed on the company's official website and YouTube channel for public and investor access. This follows an earlier intimation made by the company on July 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760431907398,
            "Source": "stock"
        },
        {
            "Title": "Hyundai Motor Receives Transfer Pricing Relief with 218.3M Rupees Adjustment Elimination",
            "Summary": "Hyundai Motor's total transfer pricing adjustment has been reduced to 218.3 million rupees. The entire transfer pricing adjustment was subsequently eliminated, resulting in refund relief for the company.",
            "Sentiment": "positive",
            "PublishDate": 1759931132014,
            "Source": "stock"
        },
        {
            "Title": "Hyundai Motor India Starts Production at New Talegaon Plant with 170,000 Units Annual Capacity",
            "Summary": "Hyundai Motor India Limited has commenced production of passenger vehicles at its new Talegaon Plant in Maharashtra. The manufacturing facility is located at Plot No. A-16, MIDC, Talegaon Industrial Area, Phase-II Expansion, Tehsil-Maval, Dist. Pune and has an annual installed capacity of 170,000 units. Production began on October 01, 2025. This development follows a previous intimation dated June 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1759315627861,
            "Source": "stock"
        },
        {
            "Title": "Hyundai Motor India Shares Drop 3% After Marginal September Sales Growth",
            "Summary": "Hyundai Motor India shares fell 3% to Rs 2,507 after reporting domestic sales of 51,547 units in September, representing only a 1% increase from the previous year. Despite muted domestic performance, exports surged 43.5% with nearly 19,000 vehicles shipped. SUVs accounted for over 37,000 units, achieving a record 72.4% penetration in domestic sales, while Hyundai Venue recorded its highest monthly sales in 20 months at 11,484 units. InCred Equities noted that recent GST cuts will have limited impact on Hyundai's revenue growth due to high dependence on large SUVs, exports, and parts. The brokerage highlighted that only 30% of Hyundai's net sales are from products affected by the new 18% GST rate, limiting benefits compared to competitors like Maruti Suzuki and Tata Motors. Hyundai reported quarterly consolidated net profit declined 8% to Rs 1,369.23 crore, while revenue dropped 5.5% to Rs 16,179.61 crore.",
            "Sentiment": "negative",
            "PublishDate": 1759309495544,
            "Source": "stock"
        },
        {
            "Title": "Hyundai Motor September Sales Jump 9.6% to 70,340 Units, Beating Estimates",
            "Summary": "Hyundai Motor reported September sales of 70,340 units, representing an increase from 64,201 units in the same period last year. The sales figure exceeded analyst estimates of 53,030 units by approximately 33%.",
            "Sentiment": "positive",
            "PublishDate": 1759299342400,
            "Source": "stock"
        },
        {
            "Title": "Hyundai Motor India Shares Surge Nearly 90% from April Lows on GST Reforms and Festive Demand",
            "Summary": "Hyundai Motor India shares hit a record high of Rs 2,890 on September 22, marking an almost 90% increase from the 52-week low of Rs 1,541 reached on April 7. The rally has been driven by the government's GST 2.0 reforms and festive season demand. The company recorded around 11,000 dealer billings on the first day of Navratri, its highest single-day tally in five years. Nomura projects India will account for 15% of Hyundai's global target of 5.5 million units by 2030, with domestic sales expected to reach 8.3 lakh units, up 40% from 6 lakh units in 2025. Total volumes including exports are projected to rise from 7.8 lakh units in 2025 to 1.2 million units by 2030. The company is expanding capacity with a new Pune facility adding 2.5 lakh units annually. Nomura forecasts a 27% EPS CAGR over FY26-28 and maintains a 'Buy' rating. Motilal Oswal expects 8% annual volume growth over FY25-27 and 10% earnings CAGR. Since the GST announcement, Hyundai shares have gained over 21%.",
            "Sentiment": "positive",
            "PublishDate": 1758687128383,
            "Source": "stock"
        },
        {
            "Title": "Hyundai Motor Achieves Highest Day 1 Billings in 5 Years with 11,000 Units During Navratri",
            "Summary": "Hyundai Motor reported its highest Day 1 billings in five years, recording 11,000 units during the Navratri festival period. This performance represents the company's strongest single-day billing achievement over the past half-decade during the festive season.",
            "Sentiment": "positive",
            "PublishDate": 1758599336278,
            "Source": "stock"
        },
        {
            "Title": "Hyundai Motor India National Sales Head Tapan Kumar Ghosh Resigns",
            "Summary": "Tapan Kumar Ghosh, Senior Manager at Hyundai Motor India, has stepped down from his role as National Sales Head. His resignation will take effect on October 3, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758521479411,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hyundai Motor India Shares Hit Fresh High Following Wage Settlement and Plant Expansion",
            "Summary": "Hyundai Motor India Ltd shares reached a new high of ₹2,745.70 after signing a three-year wage settlement with the United Union of Hyundai Employees. The agreement provides a monthly salary increase of ₹31,000 for technicians and workmen from April 2024 to March 2027, distributed in a 55:25:20 ratio over three years. The company announced investment in its Talegaon plant in Maharashtra, bringing total capacity to nearly 11 lakh units annually. The stock has gained 23.5% since August 14, 2025, rising from ₹2,222. Recent GST rate rationalization on small cars is expected to boost demand. The Nifty Auto index has increased 13% since mid-August, with other auto stocks like Maruti, Ashok Leyland, Eicher Motors, and Hero MotoCorp also showing gains.",
            "Sentiment": "positive",
            "PublishDate": 1758266447219,
            "Source": "stock"
        }
    ]
}