{
    "Symbol": "IBULLSLTD",
    "ISIN": "INE126M01010",
    "News": [
        {
            "Title": "Indiabulls Limited Promoter Group Shareholding Increases to 32.84% Following Merger Completion",
            "Summary": "The National Company Law Tribunal approved a merger scheme involving Dhani Services Limited and Indiabulls Enterprises Limited with Indiabulls Limited. Following the scheme's implementation on October 14, 2025, Indiabulls Limited issued 222,39,39,879 new equity shares on November 4, 2025, to shareholders of the merged entities based on approved share exchange ratios. The promoter group's collective shareholding increased from 2,75,77,640 shares (27.46%) to 76,33,94,153 shares (32.84%). Key promoter entities include Mr. Sameer Gehlaut, Kritikka Infrastructure Private Limited, Inuus Developers Private Limited, Valerian Real Estate Private Limited, and Calleis Infracon Private Limited. The disclosure was made pursuant to SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762836134939,
            "Source": "corporate_action"
        },
        {
            "Title": "Indiabulls Limited Reports Quarterly Loss and Completes Major Corporate Restructuring",
            "Summary": "Indiabulls Limited reported a net loss of ₹1.30 crores for the quarter ended September 30, 2025, compared to a loss of ₹1.67 crores in the previous quarter. The company's total revenue from operations increased to ₹286.27 crores from ₹251.65 crores in the prior quarter. The company completed a significant corporate restructuring through a Composite Scheme of Arrangement approved by the National Company Law Tribunal on August 29, 2025, which became effective October 14, 2025. This scheme involved the merger of multiple entities including Dhani Services Limited and other participating companies. Following the restructuring, several key management changes occurred including the resignation of three independent directors and appointments of new leadership. Gurbans Singh was appointed as Executive Chairman, Divyesh B. Shah as Executive Director & CEO, and three new independent directors were appointed. The company also appointed new key management personnel including a Chief Financial Officer and Company Secretary.",
            "Sentiment": "neutral",
            "PublishDate": 1762815986877,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sameer Gehlaut Group Increases Stake in Indiabulls Limited to 32.84% Through Merger",
            "Summary": "Sameer Gehlaut and associated entities increased their combined shareholding in Indiabulls Limited (formerly Yaari Digital Integrated Services Limited) from 27.46% to 32.84% following a merger scheme. The increase occurred through allotment of equity shares on November 4, 2025, as part of a merger involving Dhani Services Limited and Indiabulls Enterprises Limited with Indiabulls Limited. The scheme was approved by the National Company Law Tribunal on August 29, 2025, and became effective on October 14, 2025. Post-merger, the company's share capital expanded from Rs. 20.09 crore to Rs. 464.88 crore, comprising 232.44 crore fully paid-up equity shares of Rs. 2 face value each. The group includes Sameer Gehlaut and 13 associated private limited companies acting in concert.",
            "Sentiment": "neutral",
            "PublishDate": 1762540814650,
            "Source": "corporate_action"
        },
        {
            "Title": "Indiabulls Limited Allots 222 Crore Equity Shares Under Scheme of Arrangement",
            "Summary": "Indiabulls Limited has issued and allotted 222,39,39,879 fully paid-up equity shares with face value Rs. 2 each to shareholders of Dhani Services Limited, Indiabulls Enterprises Limited, and India Land Hotels Mumbai Private Limited. The allotment was completed under a Scheme of Arrangement approved by NCLT Chandigarh Bench, which became effective on October 14, 2025, with October 28, 2025 as the record date. Following this allotment, the company's paid-up equity share capital increased to Rs. 464,87,64,276, comprising 232,43,82,138 equity shares of Rs. 2 face value each. The newly allotted shares will rank equally with existing equity shares and are proposed to be listed on NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1762267612924,
            "Source": "corporate_action"
        },
        {
            "Title": "Indiabulls Limited Reports Full Utilization of INR 406.35 Crores from Preferential Issue",
            "Summary": "Indiabulls Limited disclosed that it has fully utilized INR 406.35 crores raised through a preferential issue of convertible warrants in March 2025. The monitoring agency Acuite Ratings confirmed no deviation in fund utilization for the quarter ended September 30, 2025. The funds were allocated across four objectives: INR 150 crores for subsidiary growth plans, INR 104.76 crores for working capital requirements, INR 50 crores for debt repayment, and INR 101.59 crores for general corporate purposes. The company operates in the financial services sector and completed a major corporate restructuring involving the merger of Dhani Services Limited with 17 entities under a composite scheme approved by NCLT on August 29, 2025. The scheme became effective on October 14, 2025, and Yaari Digital Integrated Services Limited officially changed its name to Indiabulls Limited on October 17, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761928678005,
            "Source": "corporate_action"
        },
        {
            "Title": "Indiabulls Limited Reports Q2FY26 Results Following Three-Way Merger Completion",
            "Summary": "Indiabulls Limited announced its first consolidated quarterly results following the NCLT-approved merger of Dhani Services Limited, Indiabulls Enterprises Limited, and Yaari Digital Integrated Services Limited. The company reported revenue of ₹256.6 crore, EBITDA of ₹2,127.5 crore, and PAT of ₹75.3 crore. The merged entity is debt-free with no outstanding loans or NCDs. Promoters converted warrants worth ₹406 crore at ₹90.30 per share, increasing their shareholding to 32.8%. The company operates through two business verticals: Real Estate and Financial Services. In Real Estate, sales of over ₹2,000 crore have been achieved till September 30, with total sales expected to reach ₹3,400 crore for the financial year. The company has multiple residential and commercial projects under development across owned and joint venture categories. Financial Services include a 16.4% stake in SpringCash LLC (US AI-powered SMB lending platform), stock broking business with 1.75 lakh active demat accounts holding over ₹65,000 crore in assets, UPI services launching in Q3FY26, Dhani wallet with 3.5 million wallets, and ARC business managing loan recovery portfolios worth approximately ₹3,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1761927084443,
            "Source": "earnings"
        },
        {
            "Title": "Indiabulls Limited Completes Major Merger and Board Restructuring Following NCLT Approval",
            "Summary": "Indiabulls Limited has completed a comprehensive scheme of arrangement involving the merger of multiple companies including Dhani Services Limited and Indiabulls Enterprises Limited. The company reported quarterly results for the period ended September 30, 2025, showing total revenue from operations of ₹87.31 crores and a profit before tax of ₹71.31 crores. Following the merger's effectiveness on October 14, 2025, the company has undergone significant board restructuring with new appointments including Gurbans Singh as Executive Chairman, Divyesh B. Shah as CEO, and three new independent directors. Several existing directors resigned to facilitate the reconstitution. The company also appointed new key management personnel including Rajeev Lochan Agrawal as Chief Financial Officer and Ram Mehar Garg as Company Secretary. The merger was approved by the National Company Law Tribunal and involves share swap arrangements for shareholders of the merged entities.",
            "Sentiment": "neutral",
            "PublishDate": 1761926658696,
            "Source": "corporate_governance"
        },
        {
            "Title": "Yaari Digital Integrated Services Completes Major Merger Scheme, Changes Name to Indiabulls Limited",
            "Summary": "Yaari Digital Integrated Services Limited announced the effectiveness of a complex Scheme of Arrangement involving 20 companies, effective October 14, 2025, with an appointed date of April 1, 2023. The scheme involves mergers of 17 companies including Dhani Services Limited and Indiabulls Enterprises Limited into Yaari, and demerger of India Land Hotels Mumbai Private Limited's real estate undertaking. The company has set October 28, 2025 as the record date for share allotment with specific exchange ratios: 294 Yaari shares for every 100 fully paid DSL shares, 110 Yaari shares for every 100 IEL shares, and 322 Yaari shares for every 1 India Land Hotels share. Following the scheme implementation, Yaari will change its name to Indiabulls Limited and the consolidated networth of the merged entity will be approximately Rs. 2,500 crores based on audited financial statements as of March 31, 2025. New shares will be listed on BSE and NSE.",
            "Sentiment": "positive",
            "PublishDate": 1760447320097,
            "Source": "corporate_action"
        },
        {
            "Title": "Yaari Digital Appoints New Independent Director, Re-appoints Two Others",
            "Summary": "Yaari Digital Integrated Services Limited's Board of Directors approved the appointment of Ms. Surina Rajan as Non-Executive Independent Director for a 3-year term from August 18, 2025 to August 17, 2028. The company also re-appointed Mr. Gurinder Singh and Mr. Aishwarya Katoch as Non-Executive Independent Directors for 2-year terms from September 5, 2025 to September 4, 2027. Ms. Rajan is a retired IAS officer with 37 years of civil service experience who worked across various government departments and international organizations. Mr. Singh is a retired IPS officer with 36 years of experience in senior positions at state, central and international levels. Mr. Katoch has over 32 years of experience in business management and runs a leisure and heritage hotels business. All appointments are subject to shareholder approval at the company's 18th Annual General Meeting.",
            "Sentiment": "positive",
            "PublishDate": 1755522417417,
            "Source": "corporate_governance"
        }
    ]
}