{
    "Symbol": "ICDSLTD",
    "ISIN": "INE613B01010",
    "News": [
        {
            "Title": "ICDS Limited Reports Mixed Quarterly Results with Profit Recovery",
            "Summary": "ICDS Limited announced its unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. The company reported a quarterly loss of Rs. 31.58 lakhs but recovered to post a profit of Rs. 137.68 lakhs in the previous quarter. For the six-month period, the company achieved a profit of Rs. 134.06 lakhs. Revenue from operations was Rs. 52.91 lakhs for the quarter. The company operates in four reportable segments: Financial Services (recovery activities), trading, rent on premises, and others. The board meeting was held on November 12, 2025, and was chaired by Sujir Prabhakar, Chairman & Managing Director. The company has also resolved a tax dispute by adopting the Direct Tax Vivad Se Vishwas Scheme 2024, depositing Rs. 113.53 lakhs for assessment year 1998-99.",
            "Sentiment": "neutral",
            "PublishDate": 1762981646389,
            "Source": "earnings"
        },
        {
            "Title": "ICDS Limited Reports Strong Q1 2025 Results with 122% Profit Growth, Sets AGM Date and Appoints New Auditor",
            "Summary": "ICDS Limited's Board approved unaudited financial results for Q1 2025 during their August 12, 2025 meeting. The company reported standalone net profit of Rs 122.65 lakhs for the quarter ended June 30, 2025, compared to Rs 55.53 lakhs in the same period last year. Revenue from operations increased to Rs 58.77 lakhs from Rs 34.03 lakhs year-on-year. Earnings per share improved to Rs 0.94 from Rs 0.43. The Board scheduled the 54th Annual General Meeting for September 25, 2025. Based on the Audit Committee's recommendation, the Board appointed CS Shrinivas M Devadiga as Secretarial Auditor for five consecutive years from FY 2025-26 to FY 2029-30, subject to shareholder approval. The company operates in four segments: Financial Services, trading, rent on premises, and others including insurance product marketing.",
            "Sentiment": "positive",
            "PublishDate": 1755002555193,
            "Source": "earnings"
        }
    ]
}