{
    "Symbol": "ICEMAKE",
    "ISIN": "INE520Y01019",
    "News": [
        {
            "Title": "Ice Make Refrigeration Appoints M. Srinivas Reddy as New CEO",
            "Summary": "Ice Make Refrigeration has appointed Mr. M. Srinivas Reddy as its new Chief Executive Officer, with his tenure set to begin on November 14, 2025. This leadership change will affect the company's strategic direction and operations as it transitions to new management.",
            "Sentiment": "neutral",
            "PublishDate": 1763550717530,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ice Make Refrigeration Plans ₹150 Crore Investment to Boost Growth",
            "Summary": "Ice Make Refrigeration has announced plans for a potential ₹150 crore investment aimed at boosting the company's growth.",
            "Sentiment": "positive",
            "PublishDate": 1759139229929,
            "Source": "stock"
        },
        {
            "Title": "Ice Make Refrigeration Reports Mixed Q1 Results with Revenue Growth but Net Loss",
            "Summary": "Ice Make Refrigeration reported quarterly results showing revenue growth to 1.11 billion rupees from 852 million rupees year-over-year. The company's EBITDA improved significantly to a gain of 44 million rupees compared to a loss of 34 million rupees in the same period last year, with an EBITDA margin of 3.95%. However, the company posted a consolidated net loss of 14 million rupees, contrasting with a profit of 37 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754552426542,
            "Source": "earnings"
        },
        {
            "Title": "Ice Make Refrigeration Launches Commercial Freezer Product Line",
            "Summary": "Ice Make Refrigeration has announced the introduction of a new product segment, Commercial Freezers, which includes Chest Freezers/Coolers and Visi Coolers. This launch is part of the company's strategic growth plan. Production of Chest Freezers is set to commence on January 1, with a daily capacity of 200 units. The Visi Coolers will have an initial annual production capacity of 8,000 units.",
            "Sentiment": "positive",
            "PublishDate": 1734654930000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ice Make Refrigeration Announces Production Expansion",
            "Summary": "Ice Make Refrigeration has announced the commencement of chest freezer production starting January 1, with a daily capacity of 200 units. Additionally, the company plans to produce visi coolers with an initial annual production capacity of 8,000 units.",
            "Sentiment": "positive",
            "PublishDate": 1734608690000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ice Make Refrigeration Launches New Commercial Freezer Product Line",
            "Summary": "Ice Make Refrigeration has introduced a new product segment of commercial freezers as part of its strategic growth plan. The new line includes chest freezers/coolers and visi coolers, expanding the company's product offerings in the refrigeration market.",
            "Sentiment": "positive",
            "PublishDate": 1734608684000,
            "Source": "corporate_action"
        }
    ]
}