{
    "Symbol": "ICICIGI",
    "ISIN": "INE765G01017",
    "News": [
        {
            "Title": "ICICI Lombard Allots 38,044 Equity Shares Under ESOP",
            "Summary": "ICICI Lombard General Insurance allotted 38,044 equity shares of ₹10 each on February 3, 2026, under employee stock option schemes, with majority allocation from 2005 scheme.",
            "Sentiment": "neutral",
            "PublishDate": 1770137244606,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Lombard Block Trade Worth Rs. 18.55 Crores",
            "Summary": "ICICI Lombard General Insurance witnessed a significant block trade on NSE involving 100,073 shares valued at Rs. 18.55 crores at Rs. 1854.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1770095494321,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Lombard Completes Internal Inquiry on Data Leak",
            "Summary": "ICICI Lombard concludes internal investigation into inadvertent disclosure of Q3 FY26 financial results on WhatsApp, finding no malicious intent and taking appropriate action against designated person.",
            "Sentiment": "neutral",
            "PublishDate": 1769177899047,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Lombard Gets Court Stay on ₹17,289 Cr GST Demand",
            "Summary": "Bombay High Court grants temporary stay on ICICI Lombard General Insurance's GST demand of ₹17,288.61 crores and penalty of ₹1,728.86 crores. Company reports no current financial impact from the ruling.",
            "Sentiment": "positive",
            "PublishDate": 1769145382915,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Lombard Allots 22,656 Equity Shares Under ESOP",
            "Summary": "ICICI Lombard General Insurance allotted 22,656 equity shares of ₹10 each on January 22, 2026 under two employee stock option schemes, approved by Whole-time Director.",
            "Sentiment": "neutral",
            "PublishDate": 1769096775991,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Lombard Sees ₹19.32 Cr NSE Block Trade",
            "Summary": "ICICI Lombard General Insurance witnessed a significant block trade on NSE worth ₹19.32 crores involving 105,632 shares at ₹1,829.40 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768979174536,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Securities Sets ₹2,250 Target for ICICI Lombard",
            "Summary": "ICICI Securities maintains BUY rating on ICICI Lombard General Insurance with ₹2,250 target price, citing 25.4% earnings growth over FY22-25 and strong compounding potential despite sectoral challenges.",
            "Sentiment": "positive",
            "PublishDate": 1768842964582,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Lombard Releases Q3FY26 Earnings Call Transcript",
            "Summary": "ICICI Lombard General Insurance has disclosed the transcript of its earnings conference call for Q3FY26 and nine months ended December 31, 2025, following regulatory requirements under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768827445501,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Lombard Sees ₹18.51 Cr NSE Block Trade",
            "Summary": "ICICI Lombard General Insurance witnessed a significant block trade on NSE worth ₹18.51 crores involving 100,005 shares at ₹1,850.90 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768537228386,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Lombard Q3FY26 Income Rises 14.8% to ₹7,433 Cr",
            "Summary": "ICICI Lombard General Insurance reported Q3FY26 total income of ₹7,432.98 crores, up 14.8% YoY, though net profit declined 9.1% to ₹658.76 crores for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768397146788,
            "Source": "co_actions_results"
        },
        {
            "Title": "Goldman Sachs Cuts ICICI Lombard Target to ₹1,925",
            "Summary": "Goldman Sachs maintains neutral rating on ICICI Lombard General Insurance while reducing target price to ₹1,925, reflecting cautious outlook on the insurance sector.",
            "Sentiment": "neutral",
            "PublishDate": 1768362352900,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Lombard Q3 PAT Falls 9% to ₹659 Crore",
            "Summary": "ICICI Lombard General Insurance reported a 9% decline in Q3 net profit to ₹659 crore despite 13.3% growth in gross direct premium income. Combined ratio worsened to 104.5% due to higher claims.",
            "Sentiment": "negative",
            "PublishDate": 1768359618618,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Lombard Shares Fall 4% on Weak Q3 Underwriting",
            "Summary": "ICICI Lombard shares declined 4% despite 13% premium growth as underwriting losses widened and combined ratio deteriorated to 104.5%, with brokerages cutting earnings estimates.",
            "Sentiment": "negative",
            "PublishDate": 1768352743109,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Lombard Q3 Net Profit Drops 8.8% to ₹660 Cr",
            "Summary": "ICICI Lombard General Insurance reported Q3 net profit of ₹660 crores, down 8.8% YoY, while revenue grew 12.7% to ₹5,685 crores. Combined ratio increased to 104.5%.",
            "Sentiment": "neutral",
            "PublishDate": 1768349947309,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Lombard Allots 24,132 Equity Shares Under ESOP",
            "Summary": "ICICI Lombard General Insurance allotted 24,132 equity shares on January 13, 2026 under two employee stock option schemes, with approval from a Whole-time Director pursuant to Board authority.",
            "Sentiment": "neutral",
            "PublishDate": 1768318444635,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Lombard Q3 FY26 Results: GDPI Up 13.3%",
            "Summary": "ICICI Lombard General Insurance reports Q3 FY26 GDPI of ₹70.41 billion, up 13.3% YoY. Nine-month PAT grows 11.3% to ₹22.25 billion despite combined ratio rising to 104.2%.",
            "Sentiment": "positive",
            "PublishDate": 1768310513333,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Lombard Q3 Net Profit Drops 9% to ₹659 Crore",
            "Summary": "India's largest private general insurer reports declining profitability with combined ratio worsening to 104.50% despite 12.40% revenue growth in Q3.",
            "Sentiment": "negative",
            "PublishDate": 1768309384050,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Lombard Q3 Profit Falls 9% to ₹658 Crore",
            "Summary": "ICICI Lombard General Insurance reported a 9% decline in Q3 net profit to ₹658 crore, missing estimates of ₹800 crore. Net premium earned grew 13% to ₹5,685 crore despite profitability challenges.",
            "Sentiment": "negative",
            "PublishDate": 1768308705340,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Lombard Q3 Net Profit Falls 9% to ₹658 Crore",
            "Summary": "ICICI Lombard General Insurance reports 9% decline in net profit to ₹658 crore for Q3, while premium income grows 12.6% year-on-year according to consolidated financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1768308328278,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Lombard Q3 Combined Ratio Rises to 104.5%",
            "Summary": "ICICI Lombard General Insurance reports combined ratio of 104.5% in Q3, up from 102.7% in the same quarter last year, indicating higher claims relative to premiums collected during the period.",
            "Sentiment": "negative",
            "PublishDate": 1768307650952,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Lombard Q3 Revenue Up 12.7% Despite Profit Drop",
            "Summary": "ICICI Lombard General Insurance reported mixed Q3 results with revenue growing 12.7% to ₹56.85 billion, while net profit declined 8.8% to ₹6.60 billion compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1768307625300,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Lombard Q3FY26 PAT Rises 9.1% to ₹658.76 Cr",
            "Summary": "ICICI Lombard General Insurance reported Q3FY26 PAT of ₹658.76 cr, up 9.1% YoY. Gross premiums grew 14.8% to ₹7,432.98 cr with combined ratio at 104.5%.",
            "Sentiment": "positive",
            "PublishDate": 1768307601354,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Lombard Q3FY26 PAT Rises 9.1% to ₹658.76 Cr",
            "Summary": "ICICI Lombard General Insurance reported 9.1% YoY growth in net profit to ₹658.76 crores for Q3FY26, with gross premiums rising 14.8% to ₹7,432.98 crores despite underwriting losses.",
            "Sentiment": "positive",
            "PublishDate": 1768307430636,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Lombard Gets CESTAT Relief on ₹2,282.6 Cr Tax",
            "Summary": "CESTAT approves ICICI Lombard's appeals regarding ₹2,282.60 crore service tax requests, providing significant relief from major legal pressures facing the insurance company.",
            "Sentiment": "positive",
            "PublishDate": 1768268170106,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Lombard, Tata Elxsi Q3 Results Due Jan 13",
            "Summary": "ICICI Lombard expected to report 10% YoY profit growth to ₹800 cr while Tata Elxsi may see 3.5% sequential revenue rise to ₹950 cr in Q3 results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1768239389800,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Lombard Reports Q3 Draft Results WhatsApp Leak",
            "Summary": "ICICI Lombard General Insurance informed stock exchanges after a senior employee accidentally shared draft Q3 financial results on personal WhatsApp status, highlighting corporate governance concerns.",
            "Sentiment": "negative",
            "PublishDate": 1768104259021,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Lombard Official Accidentally Shares Q3 Draft Results",
            "Summary": "ICICI Lombard General Insurance reported that a designated person inadvertently shared unaudited draft Q3 FY26 financial results on personal WhatsApp status, prompting internal inquiry and stock exchange notification.",
            "Sentiment": "negative",
            "PublishDate": 1768063946742,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Lombard Q3 FY26 Results Leaked on WhatsApp",
            "Summary": "ICICI Lombard General Insurance's Q3 FY26 financial results were inadvertently made available on WhatsApp before the official announcement scheduled for next week.",
            "Sentiment": "neutral",
            "PublishDate": 1768063742565,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Lombard Employee Shares Draft Q3 Results on WhatsApp",
            "Summary": "ICICI Lombard reports employee accidentally posted draft Q3 FY26 financial results on WhatsApp Status, prompting SEBI insider trading inquiry and internal investigation under corporate governance protocols.",
            "Sentiment": "negative",
            "PublishDate": 1768040612754,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Lombard Reports Accidental Q3 Draft Leak on WhatsApp",
            "Summary": "ICICI Lombard General Insurance accidentally shared draft Q3 FY25 financial results on employee's WhatsApp Status. Company initiated internal inquiry under SEBI regulations and reported incident to exchanges.",
            "Sentiment": "negative",
            "PublishDate": 1768033437822,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Lombard Reports Q3 Draft Results Leak on WhatsApp",
            "Summary": "ICICI Lombard General Insurance disclosed that a designated person inadvertently uploaded draft Q3 financial figures to personal WhatsApp status on January 9, marking the second such incident this week after Hatsun Agro.",
            "Sentiment": "negative",
            "PublishDate": 1768022831077,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Lombard Reports Inadvertent Q3FY26 Data Leak",
            "Summary": "ICICI Lombard General Insurance disclosed that a designated person accidentally uploaded unaudited draft Q3FY26 financial results on WhatsApp Status on January 9, 2026, prompting regulatory disclosure and internal inquiry.",
            "Sentiment": "negative",
            "PublishDate": 1767987465661,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Lombard Faces ₹22.50 Cr GST Demand Order",
            "Summary": "ICICI Lombard General Insurance receives GST demand of ₹22.50 crores with ₹2.25 crore penalty from Additional Commissioner, CGST & Central Excise, Palghar for FY2021-22 to FY2023-24 period.",
            "Sentiment": "negative",
            "PublishDate": 1767952209907,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Lombard Reports 16% Premium Growth in December",
            "Summary": "ICICI Lombard General Insurance recorded a 16% year-over-year increase in insurance premiums during December, demonstrating strong growth momentum in the general insurance sector.",
            "Sentiment": "positive",
            "PublishDate": 1767777388315,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Lombard Sees ₹15.80 Cr NSE Block Trade",
            "Summary": "ICICI Lombard General Insurance witnessed a significant block trade on NSE worth ₹15.80 crores involving 79,436 shares at ₹1,988.40 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767766214189,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Lombard Faces ₹2.71 Cr GST Demand from Rajasthan",
            "Summary": "ICICI Lombard General Insurance receives GST demand order of ₹1.45 cr plus interest and penalty from Rajasthan tax authorities for FY2021-22, plans to appeal the order.",
            "Sentiment": "negative",
            "PublishDate": 1766763799627,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Lombard Faces ₹4.24 Cr GST Demand for FY22",
            "Summary": "ICICI Lombard General Insurance receives GST demand order of ₹2.20 cr with interest and penalty totaling ₹4.24 cr from Punjab tax authorities for FY2021-22. Company plans to appeal the order.",
            "Sentiment": "negative",
            "PublishDate": 1766592237869,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Lombard Schedules Q3 FY26 Earnings Call",
            "Summary": "ICICI Lombard announces earnings call on January 13, 2026 at 18:45 hrs IST to discuss Q3 FY26 & 9M-FY26 performance. Board meeting and earnings call scheduled for same day to review audited financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1766489105840,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Lombard General Insurance Sees Rs. 73.57 Crore Block Trade on NSE",
            "Summary": "ICICI Lombard General Insurance Company executed a block trade worth Rs. 73.57 crores involving approximately 380,350 shares at Rs. 1,934.20 per share on the NSE. The transaction represents a significant institutional trading activity for the insurance company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1765344175300,
            "Source": "order&deals"
        },
        {
            "Title": "ICICI Lombard Faces ₹94.8 Crore GST Demand and Penalty from Tax Authorities",
            "Summary": "ICICI Lombard General Insurance received a GST demand order of ₹47.41 crore along with a penalty of ₹47.41 crore from CGST authorities in Bhopal for FY2018-19 to FY2022-23, covering issues like tax reconciliation differences, delayed advance payments, reverse charge shortfalls, and input tax credit computations. The company plans to appeal the order through appellate authorities and evaluate other legal options including filing a writ petition, stating no financial impact at this stage.",
            "Sentiment": "negative",
            "PublishDate": 1764753688890,
            "Source": "stock"
        },
        {
            "Title": "ICICI Lombard Allots 28,269 Equity Shares Under Employee Stock Schemes",
            "Summary": "ICICI Lombard General Insurance Company allotted 28,269 equity shares of ₹10 each on December 2, 2025, under two employee stock schemes - 27,195 shares under the 2005 stock option scheme and 1,074 shares under the 2023 stock unit scheme. The allotment was approved by a Whole-time Director under authority delegated by the Board of Directors, with the new shares ranking equally with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764677830757,
            "Source": "corporate_action"
        },
        {
            "Title": "ICICI Lombard Allots 55,851 Equity Shares Under Employee Stock Schemes",
            "Summary": "ICICI Lombard General Insurance Company allotted 55,851 equity shares of ₹10 each on November 24, 2025, under two employee stock schemes - 53,391 shares under the 2005 stock option scheme and 2,460 shares under the 2023 stock unit scheme. The allotment was approved by a Whole-time Director under authority delegated by the Board of Directors, with the new shares ranking equally with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764007882835,
            "Source": "corporate_action"
        },
        {
            "Title": "ICICI Lombard Allots 41,923 Equity Shares Under Employee Stock Schemes",
            "Summary": "ICICI Lombard General Insurance Company allotted 41,923 equity shares of ₹10 each on November 12, 2025. The allotment included 38,944 shares under the ICICI Lombard Employees Stock Option Scheme-2005 and 2,979 shares under the ICICI Lombard-Employees Stock Unit Scheme-2023. The allotment was approved by a Whole-time Director on November 12, 2025 at 11:29 p.m. under authority delegated by the Board of Directors at their meeting held on July 18, 2023. The newly allotted equity shares will rank pari-passu with existing equity shares of the company in all respects.",
            "Sentiment": "neutral",
            "PublishDate": 1763012589814,
            "Source": "corporate_action"
        },
        {
            "Title": "ICICI Lombard Launches Initiative to Help Policyholders Claim Unclaimed Insurance Amounts",
            "Summary": "ICICI Lombard General Insurance Company has launched a customer outreach initiative to help policyholders and beneficiaries claim unclaimed insurance amounts. The company identified that numerous policy proceeds, claims, premium pay-ins, and refunds have remained unclaimed due to outdated contact details or communication gaps. The initiative offers multiple channels for claiming amounts including a toll-free number (18002666), email support, branch visits, and a dedicated website portal. The company aims to reconnect with policyholders to ensure they receive their rightful dues through this simplified claim process.",
            "Sentiment": "positive",
            "PublishDate": 1762322800954,
            "Source": "stock"
        },
        {
            "Title": "ICICI Lombard Allots 135,694 Equity Shares Under Employee Stock Schemes",
            "Summary": "ICICI Lombard General Insurance Company Limited allotted 135,694 equity shares of ₹10 each on November 3, 2025. The allotment included 133,303 shares under the ICICI Lombard Employees Stock Option Scheme-2005 and 2,391 shares under the ICICI Lombard-Employees Stock Unit Scheme-2023. The allotment was approved by a Whole-time Director at 06:56 p.m. under authority delegated by the Board of Directors at their meeting held on July 18, 2023. The newly allotted equity shares will rank pari-passu with existing equity shares in all respects.",
            "Sentiment": "neutral",
            "PublishDate": 1762203884912,
            "Source": "corporate_action"
        },
        {
            "Title": "ICICI Lombard Clarifies Material Change Clause Will Not Increase Health Insurance Premiums",
            "Summary": "ICICI Lombard General Insurance clarified that its 'Material Change' clause in health insurance policies will not result in higher premiums or coverage changes if policyholders develop new illnesses after purchasing the policy. The clarification addresses concerns raised on social media and by consumer groups regarding the clause's interpretation in plans like Elevate and Health AdvantEdge. The insurer stated the clause is designed to recognize positive health changes that could lead to lower premiums or wellness benefits. The company emphasized it follows IRDAI rules and industry standards, noting that the clause works with renewal terms without requiring fresh medical tests or underwriting at renewal, except when policyholders request to increase sum insured, add members, or include additional covers. ICICI Lombard reported no claims have been rejected due to this clause. The clause requires customers to disclose new illnesses at renewal, but such disclosures will not affect premiums or coverage unless changes are requested by the policyholder.",
            "Sentiment": "neutral",
            "PublishDate": 1761563609304,
            "Source": "stock"
        },
        {
            "Title": "ICICI Lombard Reports 22.9% PAT Growth Despite Premium Decline in H1 FY2026",
            "Summary": "ICICI Lombard General Insurance reported a profit after tax growth of 22.9% to ₹15.67 billion in H1 FY2026, compared to ₹12.74 billion in H1 FY2025. However, the company experienced a 0.5% decline in Gross Direct Premium Income to ₹143.31 billion against the industry growth of 7.3%. Excluding Crop and Mass Health segments, the company achieved 3.5% growth versus industry's 10.5%. The combined ratio deteriorated to 104.0% from 103.2% due to catastrophic events including floods. Key segment performance showed Commercial lines growing 6.5%, Motor segment up 2.2%, and Health segment rising 4.2%. The company's Retail Health business demonstrated strong 25.2% growth, improving market share from 3.2% to 3.7%. Investment income increased to ₹25.38 billion from ₹22.52 billion. The Board declared an interim dividend of ₹6.50 per share compared to ₹5.50 in the previous year. Management expressed optimism about GST reforms benefiting the insurance sector, particularly the exemption on individual health insurance premiums and reduced GST rates in the automobile sector.",
            "Sentiment": "positive",
            "PublishDate": 1760958988001,
            "Source": "earnings"
        },
        {
            "Title": "Orissa High Court Orders CBI Probe Into Rs 5 Crore Fraudulent Motor Accident Claims Against ICICI Lombard",
            "Summary": "The Orissa High Court has directed the Central Bureau of Investigation to reinvestigate fraudulent motor accident claims involving vehicles insured with ICICI Lombard General Insurance Company. The case involves 34 Motor Accident Claim Tribunal cases from 29 alleged road traffic accidents, with compensation claims totaling approximately Rs 5 crore. ICICI Lombard's internal investigation revealed serious irregularities including vehicle implanting, the same driver appearing in multiple accidents, and manipulation of medical records. The company reported these findings to the Crime Branch and sought a stay on tribunal proceedings through the High Court. The Crime Branch confirmed irregularities in their affidavit to the court, prompting the High Court to assign the CBI to handle the reinvestigation due to the scale and complexity of the fraudulent claims.",
            "Sentiment": "negative",
            "PublishDate": 1760626074255,
            "Source": "stock"
        },
        {
            "Title": "ICICI Lombard Issues Correction to Investor Presentation, Revises Combined Ratio Figures for Half-Year Results",
            "Summary": "ICICI Lombard General Insurance Company Limited issued a correction to their investor presentation for the half-year ended September 30, 2025, addressing typographical errors in Slide No. 19. The company revised the Combined Ratio figures, with Q2-2026 corrected from 104.5% to 103.9% and H1-2026 from 103.2% to 103.0% on an 'n' basis. The correct figures were already provided in Slide No. 17 of the original presentation. The company confirmed that no other financial numbers in the investor presentation were affected by these typographical errors. ICICI Lombard expressed regret for the errors and stated they have taken necessary steps to prevent recurrence in the future.",
            "Sentiment": "neutral",
            "PublishDate": 1760625221357,
            "Source": "stock"
        },
        {
            "Title": "ICICI Lombard General Sets ROE Target of 18-20% and Loss Ratio Goals for Key Business Segments",
            "Summary": "ICICI Lombard General management has announced a return on equity target of 18-20%. The company aims to maintain retail health indemnity loss ratios at 65-70% and motor business loss ratios at 65-67%. Management anticipates better growth in H2 FY26, citing recent changes and positive trends discussed during their conference call.",
            "Sentiment": "positive",
            "PublishDate": 1760498914454,
            "Source": "stock"
        }
    ]
}