{
    "Symbol": "ICICIPRULI",
    "ISIN": "INE726G01019",
    "News": [
        {
            "Title": "ICICI Prudential Allots 183,530 Shares Under ESOP",
            "Summary": "ICICI Prudential Life Insurance Company allotted 183,530 equity shares of face value ₹10 each under its Employee Stock Option Scheme on February 10, 2026, approved by MD & CEO.",
            "Sentiment": "neutral",
            "PublishDate": 1770707471080,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Life Reports January 2026 Performance",
            "Summary": "ICICI Prudential Life Insurance Company Limited submits its monthly performance update for January 2026 to stock exchanges under SEBI Regulation 30 compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1770628781932,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Prudential Allots 31,000 Shares Under ESOP",
            "Summary": "ICICI Prudential Life Insurance Company allotted 31,000 equity shares of ₹10 face value each under its Employee Stock Option Scheme on January 28, 2026, approved by MD & CEO.",
            "Sentiment": "neutral",
            "PublishDate": 1769589571646,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Allots 100,201 Equity Shares",
            "Summary": "ICICI Prudential Life Insurance allotted 100,201 equity shares under employee stock option and stock unit schemes on January 20, 2026, comprising 98,700 shares under ESOP 2005 and 1,501 shares under ESUS 2023.",
            "Sentiment": "neutral",
            "PublishDate": 1768895536590,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Life Insurance Gets Buy Rating",
            "Summary": "ICICI Securities maintains buy rating on ICICI Prudential Life Insurance with revised target price of ₹800, citing recovery in APE and VNB growth in Q3FY26 driven by GST tailwinds and stronger execution.",
            "Sentiment": "positive",
            "PublishDate": 1768842998278,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Prudential schedules investor meets in Singapore",
            "Summary": "ICICI Prudential Life Insurance announces investor meetings on February 3-4, 2026 at ICICI Securities Annual Investor Conference in Singapore under regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1768568693519,
            "Source": "stocks"
        },
        {
            "Title": "Goldman Sachs Cuts ICICI Pru Life Target to ₹690",
            "Summary": "Goldman Sachs maintains neutral rating on ICICI Prudential Life Insurance while reducing target price to ₹690 per share in latest research update.",
            "Sentiment": "neutral",
            "PublishDate": 1768386178605,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Prudential Q3: Brokerages Bullish on Margin Resilience",
            "Summary": "ICICI Prudential Life delivered strong Q3 performance with 19.82% profit growth and resilient VNB margins at 24%. Multiple brokerages raised target prices despite persistency concerns.",
            "Sentiment": "positive",
            "PublishDate": 1768370464865,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Life Eyes Annuity Business Recovery",
            "Summary": "ICICI Prudential Life Insurance expects its annuity business to recover as market conditions normalize, while predicting long-term growth in group term business with focus on risk-reward optimization.",
            "Sentiment": "positive",
            "PublishDate": 1768361753969,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Pru Life Q3 profit jumps 20% on GST reforms",
            "Summary": "ICICI Prudential Life Insurance reported 20% YoY growth in Q3 net profit to ₹390 crore, driven by GST reforms and higher investment income. VNB margin improved to 24.4% while AUM grew 6.5% to ₹3.31 lakh crore.",
            "Sentiment": "positive",
            "PublishDate": 1768352769040,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Life Hosts Q3 FY26 Earnings Call",
            "Summary": "ICICI Prudential Life Insurance Company Limited hosted earnings conference call on January 13, 2026, to discuss 9M-FY2026 performance with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1768309086004,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Life Q3 PAT Jumps 19% to ₹390 Cr",
            "Summary": "ICICI Prudential Life Insurance reports strong Q3 FY26 performance with net profit rising 19% to ₹390 crores compared to ₹326 crores in Q3 FY25, demonstrating robust growth momentum.",
            "Sentiment": "positive",
            "PublishDate": 1768298386559,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Life Q3 PAT Jumps 19% to ₹397 cr",
            "Summary": "ICICI Prudential Life Insurance reports 19% YoY growth in Q3 net profit to ₹397 crore despite 4% decline in net premium income. Retail APE grows 9.9% while protection segment surges 40.8%.",
            "Sentiment": "positive",
            "PublishDate": 1768295855357,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Pru Life Q3 profit jumps 19.6% to ₹390 cr",
            "Summary": "ICICI Prudential Life Insurance reports strong Q3 FY26 results with 19.6% profit growth to ₹390 crore. VNB margin improves to 24.4% driven by protection segment growth. Stock gains 2.6% on positive earnings.",
            "Sentiment": "positive",
            "PublishDate": 1768294594595,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Life Q3: VNB surges 19%, margin hits 24.4%",
            "Summary": "ICICI Prudential Life Insurance reports strong Q3 performance with value of new business jumping 19% to ₹615 crore and VNB margins expanding significantly to 24.4% from 21.2% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1768292532811,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Life Q3 Net Profit Jumps 19% YoY",
            "Summary": "ICICI Prudential Life Insurance reports consolidated net profit of ₹387.15 crore in Q3 FY26, up 19.15% YoY from ₹324.91 crore. VNB margin expands to 24.4% while shares gain 3.58%.",
            "Sentiment": "positive",
            "PublishDate": 1768292446468,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Life Reports 9.9% Growth in Retail APE",
            "Summary": "ICICI Prudential Life Insurance achieved retail APE of ₹21.16 billion, marking a 9.9% year-on-year growth from ₹19.26 billion in the previous period.",
            "Sentiment": "positive",
            "PublishDate": 1768291552207,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Life Reports 9.9% APE Growth",
            "Summary": "ICICI Prudential Life Insurance Company achieved 9.9% year-on-year growth in retail Annual Premium Equivalent (APE), demonstrating strong performance in its retail insurance segment.",
            "Sentiment": "positive",
            "PublishDate": 1768291530550,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Life Q3 VNB Jumps 19% YoY to ₹6.15B",
            "Summary": "ICICI Prudential Life Insurance reported strong Q3 performance with Value of New Business rising 19% year-on-year to ₹6.15 billion from ₹5.17 billion in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1768291508385,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Life Q3 APE Grows 3.6% YoY",
            "Summary": "ICICI Prudential Life Insurance reports Q3 Annualised Premium Equivalent of ₹25.25 billion, marking a 3.6% year-on-year growth from ₹24.38 billion in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1768291483603,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Life Q3 Net Profit Rises 19.6%",
            "Summary": "ICICI Prudential Life Insurance reports net profit of ₹3.90 billion for Q3, marking a significant 19.6% increase from ₹3.26 billion in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1768291338342,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Life Q3 Premium Income Drops 3.8%",
            "Summary": "ICICI Prudential Life Insurance reports net premium income of ₹118.00 billion in Q3, down from ₹122.60 billion in the same quarter last year, marking a 3.8% year-on-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1768291316098,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Allots 85,478 ESOP Shares",
            "Summary": "ICICI Prudential Life Insurance allotted 85,478 equity shares under employee stock option and stock unit schemes on January 13, 2026, comprising 83,378 ESOP shares and 2,100 ESUP shares.",
            "Sentiment": "neutral",
            "PublishDate": 1768285690020,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Completes Sale of ICICI PFM to ICICI Bank",
            "Summary": "ICICI Prudential Life Insurance completed the sale of its 100% stake in ICICI Prudential Pension Funds Management Company to ICICI Bank for ₹2.035 billion on January 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768238819323,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Life Posts 25.1% Premium Growth",
            "Summary": "ICICI Prudential Life Insurance reports strong performance with new business premium reaching ₹19.45 billion, marking a 25.1% year-on-year increase, while sum assured grows 10.7% to ₹1,182 crore.",
            "Sentiment": "positive",
            "PublishDate": 1768188000345,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Life Reports Strong December Growth",
            "Summary": "ICICI Prudential Life Insurance posts 11.5% YoY growth in December retail weighted received premium at ₹7.93 billion, with total APE reaching ₹9.29 billion (+7.3% YoY).",
            "Sentiment": "positive",
            "PublishDate": 1768187779166,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Reports December Premium Growth",
            "Summary": "ICICI Prudential Life Insurance reports steady premium growth in December 2025, though Q3 FY26 trends show mixed performance across business segments.",
            "Sentiment": "neutral",
            "PublishDate": 1768176577231,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Life Insurance Reports Premium Growth",
            "Summary": "ICICI Prudential Life Insurance demonstrates consistent premium growth in December 2025 with mixed performance trends observed during Q3 FY26 period.",
            "Sentiment": "neutral",
            "PublishDate": 1768041702481,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Life reports 11.5% YoY growth",
            "Summary": "ICICI Prudential Life Insurance posted 11.5% YoY growth in retail weighted received premium to ₹793.00 crore in December 2025, with mixed performance across quarterly metrics.",
            "Sentiment": "positive",
            "PublishDate": 1768025635187,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Life: ₹206.74cr Block Trade",
            "Summary": "ICICI Prudential Life Insurance executed a block trade worth ₹206.74 crores for approximately 3.04 million shares at ₹680 per share on BSE, indicating significant institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767852126093,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Bank Gets Approval as Pension Fund Sponsor",
            "Summary": "Pension Fund Regulatory and Development Authority approves ICICI Bank as sponsor for ICICI Prudential Life Insurance's pension fund management business, marking a significant regulatory milestone.",
            "Sentiment": "positive",
            "PublishDate": 1767701053424,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Prudential Life Insurance Block Trade Worth ₹66.94 Cr",
            "Summary": "ICICI Prudential Life Insurance witnessed a significant block trade on NSE worth ₹66.94 crores involving 1,025,272 shares at ₹652.90 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767072040619,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Receives GST Order Worth ₹13.53 Cr",
            "Summary": "ICICI Prudential Life Insurance receives GST order from Rajasthan tax authorities for ₹13.53 crores related to FY2019, plans to file appeal against the order.",
            "Sentiment": "negative",
            "PublishDate": 1766754051904,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Prudential Life Gets ₹112.37 Cr GST Order",
            "Summary": "ICICI Prudential Life Insurance receives revised GST order worth ₹112.37 crores from Maharashtra authorities for FY2022, plans to file appeal against the demand.",
            "Sentiment": "negative",
            "PublishDate": 1766554841990,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Prudential Allots 39,162 Shares Under ESOP",
            "Summary": "ICICI Prudential Life Insurance allotted 39,162 equity shares under employee stock option and unit schemes on January 6, 2026, comprising 35,850 shares from 2005 scheme and 3,312 from 2023 scheme.",
            "Sentiment": "neutral",
            "PublishDate": 1766472680787,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Pays Interest on ₹1,400 Cr Debentures",
            "Summary": "ICICI Prudential Life Insurance credited annual interest at 8.03% rate to debenture holders on December 19, 2025, for its ₹1,400 crore non-convertible debentures issue through RTGS.",
            "Sentiment": "neutral",
            "PublishDate": 1766222978320,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Life Insurance Block Trade Worth ₹127.12 Cr",
            "Summary": "ICICI Prudential Life Insurance witnessed a significant block trade on NSE involving 2,010,144 shares valued at ₹127.12 crores, executed at ₹632.40 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1766038224038,
            "Source": "co_actions_results"
        },
        {
            "Title": "Citi Maintains Buy Rating on ICICI Prudential Life",
            "Summary": "Citi maintains Buy rating on ICICI Prudential Life Insurance with target price of ₹870, indicating positive outlook for the insurance company's stock performance.",
            "Sentiment": "positive",
            "PublishDate": 1765943319174,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Prudential Life Insurance Allots 133,198 Equity Shares Under Employee Stock Schemes",
            "Summary": "ICICI Prudential Life Insurance Company allotted 132,250 equity shares under its Employee Stock Option Scheme (2005) and 948 shares under Employee Stock Unit Scheme (2023) on December 9, 2025. The allotment involves shares with face value of ₹10 each under both employee compensation schemes.",
            "Sentiment": "neutral",
            "PublishDate": 1765264780507,
            "Source": "corporate_action"
        },
        {
            "Title": "ICICI Prudential Life Reports Mixed Performance in November 2025 Update",
            "Summary": "ICICI Prudential Life Insurance reported varied premium growth metrics for November 2025, with retail weighted received premium showing 13.2% growth while APE declined 2.6% for the 8-month period. The company's new business sum assured grew 19.1% year-on-year to ₹8,977.81 billion for the 8-month FY2026 period, indicating mixed operational performance across different business segments.",
            "Sentiment": "positive",
            "PublishDate": 1765185416349,
            "Source": "stock"
        },
        {
            "Title": "ICICI Prudential Life Insurance Announces Senior Management Restructuring",
            "Summary": "ICICI Prudential Life Insurance's Board approved key management changes with Chief Risk Governance Officer Deepak Kinger resigning effective December 7, 2025 to take a new role within ICICI Group. Anand Desai will be re-designated as Chief Risk Officer and Manish Bhandari appointed as Chief Compliance Officer for three years, both effective December 8, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764937213820,
            "Source": "corporate_governance"
        },
        {
            "Title": "ICICI Prudential Life Wins GST Appeal, Entire Demand Set Aside",
            "Summary": "ICICI Prudential Life Insurance received a favorable order from Additional Commissioner of State Tax, Appellate Authority, Vijayawada, setting aside the entire GST demand for FY2019. The company had appealed against an order passed under Section 73 of Andhra Pradesh Goods and Service Tax Act, 2017, and the appellate authority ruled in favor of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1764743096073,
            "Source": "stock"
        },
        {
            "Title": "RBI Approves ICICI Bank's Acquisition of ICICI Prudential Pension Fund Management Company",
            "Summary": "Reserve Bank of India has approved ICICI Bank's acquisition of 100% equity shareholding in ICICI Prudential Pension Fund Management Company Limited, subject to certain conditions including clearance from Pension Fund Regulatory and Development Authority. The approval moves forward the previously announced transaction between ICICI Bank and ICICI Prudential Life Insurance Company Limited.",
            "Sentiment": "positive",
            "PublishDate": 1764347880003,
            "Source": "order&deals"
        },
        {
            "Title": "ICICI Prudential Life Insurance Receives Partial GST Appeal Order for FY2019",
            "Summary": "ICICI Prudential Life Insurance Company received a partially favorable order from Joint Commissioner of State Tax regarding GST input tax credit mismatch for FY2019, with total financial implication of ₹72,23,218 including GST, interest and penalty. The company plans to file an appeal against the order before appropriate authority, with no impact expected at current stage.",
            "Sentiment": "neutral",
            "PublishDate": 1764320641842,
            "Source": "stock"
        },
        {
            "Title": "ICICI Prudential Life Allots ₹11.95 Billion Debentures After Over-Subscription",
            "Summary": "ICICI Prudential Life Insurance Company allotted 1,19,500 unsecured debentures worth ₹11.95 billion to identified investors on private placement basis, with the base issue size of ₹11 billion being over-subscribed receiving bids of ₹25.73 billion. The 10-year debentures carry a coupon rate of 7.69% per annum and are listed on the National Stock Exchange, with redemption scheduled for November 28, 2035 subject to call options.",
            "Sentiment": "positive",
            "PublishDate": 1764315089194,
            "Source": "corporate_action"
        },
        {
            "Title": "ICRA Reaffirms ICICI Prudential Life's AAA Rating, Withdraws Rs 1,200 Crore Debt Rating After Full Repayment",
            "Summary": "ICRA reaffirmed ICICI Prudential Life Insurance's AAA (Stable) rating on Rs 2,600 crore subordinated debt programme and withdrew rating on Rs 1,200 crore tranche following full repayment through call option exercise. The rating reflects the company's strong market position as one of India's largest private life insurers, healthy solvency ratio of 2.13 times, and strategic importance to majority shareholder ICICI Bank which holds 51% stake.",
            "Sentiment": "neutral",
            "PublishDate": 1763995527404,
            "Source": "corporate_action"
        },
        {
            "Title": "ICICI Prudential Life Insurance Withdraws Credit Rating After Redeeming ₹1,200 Crore Debentures",
            "Summary": "CRISIL Ratings withdrew its AAA/Stable rating on ICICI Prudential Life Insurance Company's ₹1,200 crore Non-Convertible Debentures following the company's voluntary request after full redemption on November 6, 2025. The rating withdrawal was processed on November 21, 2025, completing the debenture redemption process for the insurance company.",
            "Sentiment": "neutral",
            "PublishDate": 1763822264236,
            "Source": "corporate_action"
        },
        {
            "Title": "CRISIL Assigns AAA Rating to ICICI Prudential Life's Rs 1,200 Crore Subordinated Debt",
            "Summary": "CRISIL Ratings assigned a new CRISIL AAA/Stable rating to ICICI Prudential Life Insurance Company's Rs 1,200 crore subordinated debt issuance, while reaffirming the rating on existing Rs 1,400 crore subordinated debt. The rating reflects the company's strategic importance to parent ICICI Bank, established market position, diversified distribution channels, and adequate capital position with solvency ratio of 2.13 times as of September 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763821980682,
            "Source": "corporate_action"
        },
        {
            "Title": "ICICI Prudential Life Allots Equity Shares Under Employee Stock Schemes",
            "Summary": "ICICI Prudential Life Insurance Company Limited allotted 64,630 equity shares under its Employee Stock Option Scheme (2005) and 252 equity shares under its Employee Stock Unit Scheme (2023) on November 18, 2025. The allotment of shares with face value of ₹10 each was completed at 1:11 p.m. IST as part of the company's employee compensation programs.",
            "Sentiment": "neutral",
            "PublishDate": 1763453276745,
            "Source": "corporate_action"
        },
        {
            "Title": "ICICI Prudential Life Allots 18,028 Equity Shares Under Employee Stock Schemes",
            "Summary": "ICICI Prudential Life Insurance Company Limited allotted 18,028 equity shares with a face value of ₹10 each under two employee stock schemes. The allotment included 16,580 shares under the Employee Stock Option Scheme (2005) and 1,448 shares under the Employee Stock Unit Scheme (2023). The shares were allotted on November 11, 2025 at 12:03 p.m. IST.",
            "Sentiment": "neutral",
            "PublishDate": 1762844677941,
            "Source": "corporate_action"
        }
    ]
}