{
    "Symbol": "ICIL",
    "ISIN": "INE483B01026",
    "News": [
        {
            "Title": "Indo Count Board Meet Set for Feb 13 to Review Q3 Results",
            "Summary": "Indo Count Industries has scheduled a board meeting on February 13, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770731002101,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indo Count clarifies volume surge is market driven",
            "Summary": "Indo Count Industries responds to stock exchange queries about increased trading volumes, confirming no undisclosed price-sensitive information pending and attributing movement to market forces.",
            "Sentiment": "neutral",
            "PublishDate": 1770285105872,
            "Source": "stocks"
        },
        {
            "Title": "Indo Count starts pillow production at North Carolina",
            "Summary": "Indo Count Industries commences commercial production of pillows at its new North Carolina manufacturing facility, expanding its US presence across East Coast, Midwest, and West Coast locations.",
            "Sentiment": "positive",
            "PublishDate": 1768990665678,
            "Source": "stocks"
        },
        {
            "Title": "Indo Count Industries Clarifies Volume Movement",
            "Summary": "Indo Count Industries responds to BSE inquiry about volume movement, stating no pending material announcements and confirming market-driven share activity as of December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767168973179,
            "Source": "stocks"
        },
        {
            "Title": "Avendus sees 34% upside on Indo Count, cuts Welspun",
            "Summary": "Avendus initiates coverage with 'buy' rating on Indo Count Industries at ₹348 target price, while giving 'reduce' rating to Welspun Living at ₹135 target amid US market challenges.",
            "Sentiment": "neutral",
            "PublishDate": 1767074377879,
            "Source": "stocks"
        },
        {
            "Title": "Avendus Initiates Buy on Indo Count at ₹348 Target",
            "Summary": "Avendus Securities has initiated coverage on Indo Count Industries with a Buy recommendation and price target of ₹348, signaling positive outlook for the textile company.",
            "Sentiment": "positive",
            "PublishDate": 1767066251380,
            "Source": "stocks"
        },
        {
            "Title": "Avendus Spark Initiates Buy on Indo Count at ₹348",
            "Summary": "Avendus Spark has initiated coverage on Indo Count Industries with a 'Buy' rating and set a price target of ₹348 per share, indicating positive outlook for the textile company.",
            "Sentiment": "positive",
            "PublishDate": 1766979951692,
            "Source": "stocks"
        },
        {
            "Title": "IndoCount Appoints Arul Sakthivel as VP-IT",
            "Summary": "IndoCount Industries has appointed Mr. Arul Sakthivel as Vice President-Information Technology, effective December 15, 2025. The new VP brings over 30 years of IT experience across diverse industries.",
            "Sentiment": "positive",
            "PublishDate": 1765797370582,
            "Source": "stocks"
        },
        {
            "Title": "IndoCount Industries VP-IT Abhay Karhade Resigns",
            "Summary": "IndoCount Industries announces resignation of Mr. Abhay Karhade, Vice President-Information Technology, effective December 12, 2025, citing better prospects as reason for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1765545762359,
            "Source": "stocks"
        },
        {
            "Title": "IndoCount Industries Reports Q2 FY26 Results Amid US Tariff Challenges, Expands Brand Portfolio with Tommy Hilfiger License",
            "Summary": "IndoCount Industries delivered 7% quarter-on-quarter volume growth to 25.2 million meters and 12% revenue increase to Rs 1,082 crores in Q2 FY26, despite facing margin pressure from 50% US tariffs on Indian imports imposed in late August 2025. The company signed a licensing agreement with Tommy Hilfiger for utility bedding products and saw its utility bedding and US branded segments grow to 17% of revenue, while maintaining market share through strategic customer partnerships during the challenging tariff environment.",
            "Sentiment": "neutral",
            "PublishDate": 1763555974414,
            "Source": "earnings"
        },
        {
            "Title": "IndoCount Industries Reports Q2 FY26 Results with Profit Growth",
            "Summary": "IndoCount Industries Limited announced its quarterly results for the quarter and half year ended September 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 82,796.20 lakhs for the quarter, compared to Rs 73,326.67 lakhs in the previous quarter and Rs 99,102.60 lakhs in the same quarter last year. Net profit for the quarter stood at Rs 4,226.87 lakhs versus Rs 4,028.08 lakhs in the previous quarter and Rs 8,304.73 lakhs in the corresponding quarter of the previous year. On a consolidated basis, revenue from operations was Rs 1,06,213.79 lakhs for the quarter against Rs 95,870.60 lakhs in the previous quarter and Rs 1,03,585.32 lakhs in the same quarter last year. Consolidated net profit for the quarter was Rs 3,902.57 lakhs compared to Rs 3,901.98 lakhs in the previous quarter and Rs 8,037.87 lakhs in the year-ago quarter. The company's earnings per share on a standalone basis was Rs 2.13 for the quarter. The Board of Directors approved these results at their meeting held on November 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762900193343,
            "Source": "earnings"
        },
        {
            "Title": "IndoCount Industries Reports Q2 FY26 Results with 7% Volume Growth Despite Tariff Challenges",
            "Summary": "IndoCount Industries delivered volume growth of 7% and revenue growth of 12% on a quarter-on-quarter basis in Q2 FY26, despite facing challenging tariff conditions. U.S. tariff rates moved from 10% to 25% and subsequently to 50% during the quarter, creating a volatile operating environment. The company chose to share a portion of the additional tariff costs with customers on a case-by-case basis, which impacted margins. Revenue reached Rs. 1,082 crores with volumes of 27.8 million meters. The company reduced net debt by Rs. 175 crores during H1 FY26, maintaining a net debt-to-equity ratio of 0.34x. New business segments including utility bedding and USA brand business recorded revenue of Rs. 181 crores in Q2 FY26, up 40% quarter-on-quarter. The company signed a license agreement with Tommy Hilfiger brand for utility bedding business, adding to its portfolio of six licensed brands. Non-U.S. core business contributed 30% to overall revenue mix, while domestic business contributed 2.25%. EBITDA margin was impacted due to partial tariff absorption, adverse product mix, and incubation costs of new business. The company is commissioning its third manufacturing unit for utility bedding in the USA by end of Q3 or early Q4 FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1762859944061,
            "Source": "earnings"
        },
        {
            "Title": "Indo Count Industries Reports 34% Drop in Q2 Net Profit to 390M Rupees",
            "Summary": "Indo Count Industries reported quarterly net profit of 390 million rupees compared to 815 million rupees in the same period last year. The company's EBITDA declined to 1.03 billion rupees from 1.57 billion rupees year-over-year. EBITDA margin compressed to 9.76% from 15.2% in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762853979806,
            "Source": "earnings"
        },
        {
            "Title": "Indo Count Targets Global Leadership in Bedding Segment Through Expansion Strategy",
            "Summary": "Indo Count has outlined its strategic vision to achieve global leadership in fashion, utility, and institutional bedding segments. The company's growth strategy focuses on three key areas: expanding manufacturing capacity, diversifying its brand portfolio, and increasing penetration in retail markets.",
            "Sentiment": "positive",
            "PublishDate": 1755013701642,
            "Source": "stock"
        },
        {
            "Title": "Indo Count Anticipates Lower Margins and Sales Volumes Due to U.S. Tariffs",
            "Summary": "Indo Count expects reduced margins and sales volumes in the short term as the company continues to face impacts from U.S. tariffs. The ongoing tariff effects are anticipated to pressure the company's financial performance in the near future.",
            "Sentiment": "negative",
            "PublishDate": 1754997681655,
            "Source": "stock"
        },
        {
            "Title": "Indo Count Industries Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "Indo Count Industries reported Q1 revenue of 9.6 billion rupees, up from 9.4 billion rupees in the same period last year. However, consolidated net profit declined significantly to 378 million rupees from 778 million rupees year-over-year. EBITDA dropped to 1.1 billion rupees from 1.45 billion rupees, while EBITDA margin compressed to 11.48% from 15.41% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754992081118,
            "Source": "earnings"
        },
        {
            "Title": "Indo Count Relaunches Wamsutta Brand Using Direct-To-Consumer Strategy",
            "Summary": "Indo Count has relaunched the American brand Wamsutta using a direct-to-consumer strategy. Wamsutta is described as a famous brand, suggesting it has significant recognition in the market. The company is employing a direct-to-consumer approach for this relaunch, which typically involves selling products directly to customers without intermediaries.",
            "Sentiment": "positive",
            "PublishDate": 1752221973000,
            "Source": "default"
        },
        {
            "Title": "Indo Count Industries Establishes New Subsidiary in Shanghai",
            "Summary": "Indo Count Industries has established a new step-down subsidiary named Indo Count (Shanghai) Commercial Co. Ltd. The new entity is located in Shanghai, China.",
            "Sentiment": "positive",
            "PublishDate": 1750686145000,
            "Source": "default"
        },
        {
            "Title": "Indo Count Targets Doubling Revenue by FY28",
            "Summary": "Indo Count has set an ambitious goal to double its revenue by the fiscal year 2028. The company aims to achieve this growth with brands and value-added segments contributing USD 275 million to the total revenue. This information was shared in an investor presentation by the company.",
            "Sentiment": "positive",
            "PublishDate": 1748681341000,
            "Source": "default"
        },
        {
            "Title": "Indo Count Industries Declares Dividend",
            "Summary": "Indo Count Industries has announced a dividend of 2 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1748615780000,
            "Source": "result"
        },
        {
            "Title": "Indo Count Industries Reports Q4 Financial Results",
            "Summary": "Indo Count Industries has released its Q4 financial results. The company's EBITDA for Q4 was 819 million rupees, down from 1.65 billion rupees year-over-year. The EBITDA margin decreased to 8.01% from 15.12% in the same period last year. The consolidated net profit for Q4 was 112 million rupees, compared to 919 million rupees year-over-year and 755 million rupees quarter-on-quarter. Q4 revenue stood at 10.2 billion rupees, down from 10.9 billion rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748615750000,
            "Source": "result"
        },
        {
            "Title": "Indo Count Industries Expands U.S. Operations with New Facility in North Carolina",
            "Summary": "Indo Count Industries has announced plans to establish its third U.S. facility in North Carolina. The new facility will have an annual production capacity of 18 million pillows and requires a $15 million investment. With this expansion, the company expects to generate approximately $175 million in revenue across its three U.S. facilities.",
            "Sentiment": "positive",
            "PublishDate": 1739320324000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo Count Industries Expands U.S. Operations with New North Carolina Facility",
            "Summary": "Indo Count Industries announces plans to establish its third U.S. facility in North Carolina. The new facility will produce 18 million pillows annually with a $15 million investment. This expansion is expected to generate approximately $175 million in revenue across the company's three U.S. facilities.",
            "Sentiment": "positive",
            "PublishDate": 1739278467000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo Count Industries Reports Mixed Q3 Financial Results",
            "Summary": "Indo Count Industries has released its Q3 financial results. The company's EBITDA increased to 1.49 billion rupees from 1.05 billion rupees year-over-year. However, the EBITDA margin decreased to 12.97% from 14.67% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739267842000,
            "Source": "earnings"
        },
        {
            "Title": "Indo Count Industries Reports Strong Q3 Financial Performance",
            "Summary": "Indo Count Industries has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 755 million rupees from 581 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 12 billion rupees compared to 7.13 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739267694000,
            "Source": "earnings"
        },
        {
            "Title": "Indo Count Industries to Consider Q3 Results",
            "Summary": "Indo Count Industries has announced that it will consider its third quarter (Q3) financial results on February 11.",
            "Sentiment": "neutral",
            "PublishDate": 1738850731000,
            "Source": "result"
        },
        {
            "Title": "Indo Count Industries Reports Q2 EBITDA and Margin Decline",
            "Summary": "Indo Count Industries has reported its Q2 financial results. The company's EBITDA decreased from 1.65 billion rupees in the previous year to 1.57 billion rupees this quarter. Additionally, the EBITDA margin declined from 16.35% to 15.20% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730971283000,
            "Source": "result"
        },
        {
            "Title": "Indo Count Industries Reports Q2 Revenue Growth",
            "Summary": "Indo Count Industries has reported a revenue of 10.4 billion rupees for the second quarter, compared to 10.09 billion rupees in the same period last year, showing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730971188000,
            "Source": "result"
        },
        {
            "Title": "Indo Count Industries Reports Q2 Net Profit Decline",
            "Summary": "Indo Count Industries has reported a consolidated net profit of 815 million rupees for the second quarter, down from 1.14 billion rupees in the same period last year. This represents a year-over-year decrease in profit for the company.",
            "Sentiment": "negative",
            "PublishDate": 1730971163000,
            "Source": "result"
        },
        {
            "Title": "Indo Count Global: Strategic Acquisitions Boost US Utility Bedding Presence",
            "Summary": "<p><span class=\"positive\">Indo Count Global, Inc.</span>, a US subsidiary of Indo Count Industries, has <span class=\"positive\">acquired</span> <b>Modern Home Textiles, Inc.</b> in Arizona and a <span class=\"positive\">majority stake</span> in <b>Fluvitex USA, Inc.</b> in Ohio. These acquisitions <span class=\"positive\">expand</span> their utility bedding segment, adding a <span class=\"positive\">combined annual capacity</span> of <span class=\"neutral\">13 million pillows</span> and <span class=\"neutral\">1.5 million quilts</span>, with an <span class=\"positive\">expected revenue</span> of over <span class=\"positive\">$85 million</span> at full capacity.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728877800000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo Count Industries Expands Utility Bedding Business in North America",
            "Summary": "<p><span class=\"positive\">Indo Count Industries'</span> subsidiary has <span class=\"positive\">acquired</span> a <b>100%</b> stake in <span class=\"neutral\">Modern Home Textiles</span> for <b>98 crore rupees</b>. This acquisition is aimed at <span class=\"positive\">expanding</span> the company's <span class=\"neutral\">utility bedding business</span> in the <span class=\"neutral\">North American market</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728724141000,
            "Source": "corporate_action"
        }
    ]
}