{
    "Symbol": "ICRA",
    "ISIN": "INE725G01011",
    "News": [
        {
            "Title": "ICRA Board Approves Policy Modifications for SEBI PIT",
            "Summary": "ICRA Limited's board approved modifications to its Policy for Determination of Legitimate Purposes under SEBI Prohibition of Insider Trading Regulations during January 28, 2026 meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1769610319184,
            "Source": "stocks"
        },
        {
            "Title": "ICRA Q3FY26 Results: Revenue Up 35.3% to ₹16,359 Lakhs",
            "Summary": "ICRA Limited reported strong Q3FY26 performance with revenue rising 35.3% YoY to ₹16,359.11 lakhs. Net profit reached ₹3,906.08 lakhs despite exceptional items of ₹691.83 lakhs from new Labour Codes impact.",
            "Sentiment": "positive",
            "PublishDate": 1769602998836,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICRA Appoints New Senior Management Personnel",
            "Summary": "ICRA Limited designates Shailendra Chikkebagilu Mruthyunjayappa as senior management personnel, while he transitions to CEO role at subsidiary ICRA Analytics from February 2026.",
            "Sentiment": "positive",
            "PublishDate": 1765974266112,
            "Source": "stocks"
        },
        {
            "Title": "ICRA Appoints Deloitte as Auditor for Fintellix Subsidiary",
            "Summary": "ICRA Limited's subsidiary Fintellix India Private Limited appoints Deloitte Haskins & Sells as statutory auditor to fill casual vacancy following previous auditor resignation.",
            "Sentiment": "neutral",
            "PublishDate": 1765543456622,
            "Source": "stocks"
        },
        {
            "Title": "ICRA Reports Strong H1 FY26 Performance with 24.4% PAT Growth and Fintellix Acquisition",
            "Summary": "ICRA Limited delivered robust financial performance in the first half of FY26, with consolidated revenue growing 8.4% to INR 261.1 crores and profit after tax increasing 24.4% to INR 90.8 crores. The ratings segment drove growth with 13.6% revenue increase despite a slowdown in the credit environment. The company successfully acquired Fintellix, a Bangalore-based RegTech and risk solutions company with INR 91 crores turnover and 20% EBIDA margins, expanding ICRA's risk technology portfolio. ICRA ESG published 7 ratings in H1, surpassing the previous year's total. The company upgraded ratings for 214 entities while downgrading 75, achieving a credit ratio of 2.8 with a low default rate of 0.2%. Research and Analytics segment grew 1.8% with new product launches including ECL version 3, InfRE 360, and cloud-based MFI 360 Explorer. Management expects consumption growth to remain strong in Q3-Q4 driven by GST rationalization, income tax benefits, and good monsoon conditions.",
            "Sentiment": "positive",
            "PublishDate": 1762274707834,
            "Source": "earnings"
        },
        {
            "Title": "ICRA Targets Multi-Segment Expansion Through Fintellix Acquisition Synergies",
            "Summary": "ICRA is targeting expansion across multiple business segments, leveraging its ratings strength and synergies from the Fintellix acquisition. The company is focusing on scalable growth opportunities in risk analytics, ESG research, and data-driven solutions, capitalizing on expanding regulatory mandates in these areas.",
            "Sentiment": "positive",
            "PublishDate": 1761666956976,
            "Source": "stock"
        },
        {
            "Title": "ICRA Reports Strong Revenue Growth in Q2 & H1 FY2026, Acquires Fintellix for ₹253.25 Crore",
            "Summary": "ICRA Limited demonstrated strong financial performance in Q2 and H1 FY2026, driven by robust growth in its Ratings segment and Research & Analytics business. The company's solid performance was attributed to consistent quality and credibility of ratings, alongside momentum from marquee client wins and expanded offerings in research services. ICRA completed the acquisition of Fintellix, a Bengaluru-based regulatory technology and risk solutions provider, for ₹253.25 crore in an all-cash deal. The acquisition gives ICRA 98.75% shareholding in Fintellix, with the remaining 1.25% to be acquired upon completion of regulatory formalities. Fintellix, incorporated in March 2006, serves banks, NBFCs, regulators, and global financial entities across India, UK, US, and South Africa, generating revenue of approximately ₹91 crore with 20% EBIDA margins. The deal aims to strengthen ICRA's position in risk analytics and expand its international presence. ICRA's segmental performance showed growth across both ratings and research divisions, with bond issuances declining in Q2 FY2026 due to rising yields, while commercial papers remained elevated and securitization grew through NBFC-originated loans.",
            "Sentiment": "positive",
            "PublishDate": 1761661471176,
            "Source": "earnings"
        },
        {
            "Title": "ICRA Reports 30% Jump in Q2 Net Profit to 478 Million Rupees",
            "Summary": "ICRA reported Q2 consolidated net profit of 478 million rupees compared to 367 million rupees in the same period last year. Revenue increased to 1.37 billion rupees from 1.26 billion rupees year-over-year. EBITDA rose to 485 million rupees from 413 million rupees, while EBITDA margin improved to 35.53% from 32.72% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761659328622,
            "Source": "earnings"
        },
        {
            "Title": "ICRA Limited Completes Acquisition of 98.75% Stake in Fintellix for INR 245.63 Crores",
            "Summary": "ICRA Limited has completed the acquisition of 98.75% shareholding in Fintellix India Private Limited for INR 245.63 crores, making Fintellix a subsidiary of ICRA. The remaining 1.25% stake will be acquired pending regulatory approval. Fintellix is a Bengaluru-based RegTech company specializing in risk, supervisory, and data analytics solutions for financial institutions and regulators. The company serves over 30 institutions across India, UK, US, and other markets through its proprietary data platform. Fintellix reported turnover of INR 81.5 crore for FY25, INR 76.1 crore for FY24, and INR 87.7 crore for FY23. The acquisition strengthens ICRA's position in risk technology portfolio and enables the combined entity to offer integrated solutions to banks, NBFCs, and regulators for regulatory compliance and risk management.",
            "Sentiment": "positive",
            "PublishDate": 1760705412688,
            "Source": "order&deals"
        },
        {
            "Title": "ICRA Maintains GDP Growth Forecast at 6.2% for FY26, Plans Strategic Expansion Through Fintellix Acquisition",
            "Summary": "ICRA has maintained its GDP growth forecast at 6.2% for FY26 despite facing global headwinds. The company is pursuing strategic expansion through the acquisition of Fintellix and is focusing on strengthening its sectoral research leadership capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1753980635732,
            "Source": "stock"
        },
        {
            "Title": "ICRA Forecasts Solid Growth Driven by Bond Issuance and Research Expansion",
            "Summary": "ICRA projects solid growth ahead, citing strong bond issuance, expansion in research and risk solutions, and increasing analytics spending as key drivers. The company expects overall profitable growth as credit transitions from banks to capital markets.",
            "Sentiment": "positive",
            "PublishDate": 1753979082724,
            "Source": "stock"
        },
        {
            "Title": "ICRA Reports 19% Growth in Q1 Net Profit to 424 Million Rupees",
            "Summary": "ICRA reported consolidated net profit of 424 million rupees in Q1, representing a year-over-year increase from 355 million rupees. The company's revenue also grew to 1.2 billion rupees compared to 1.14 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1753949636928,
            "Source": "earnings"
        },
        {
            "Title": "Icra Acquires Fintellix India for $26 Million",
            "Summary": "Icra has acquired a 100% stake in Fintellix India for USD 26 million. This acquisition is aimed at enhancing Icra's risk and analytics solutions offerings.",
            "Sentiment": "positive",
            "PublishDate": 1749774482000,
            "Source": "default"
        },
        {
            "Title": "ICRA Acquires Fintellix India for $26 Million",
            "Summary": "ICRA has completed the acquisition of a 100% stake in Fintellix India for USD 26 million. This acquisition is aimed at enhancing ICRA's risk and analytics offerings.",
            "Sentiment": "positive",
            "PublishDate": 1749732793000,
            "Source": "default"
        },
        {
            "Title": "ICRA Ltd: Q4 Profit Rises 19%, Declares ₹60 Dividend",
            "Summary": "ICRA Ltd reported a 18.5% YoY increase in Q4 net profit to ₹55.7 crore. Revenue from operations grew 9.8% YoY to ₹136.3 crore. The board recommended a dividend of ₹60 per equity share, subject to AGM approval.",
            "Sentiment": "positive",
            "PublishDate": 1748519177000,
            "Source": "earnings"
        },
        {
            "Title": "ICRA Reports Q4 Financial Results and Dividend Recommendation",
            "Summary": "ICRA has announced its Q4 financial results. The company's consolidated net profit increased to 557.4 million rupees, up from 468.7 million rupees year-over-year and 420.3 million rupees quarter-over-quarter. Revenue rose to 1.36 billion rupees from 1.24 billion rupees in the same quarter last year. EBITDA improved to 591.6 million rupees, compared to 498.5 million rupees year-over-year, with the EBITDA margin expanding to 43.43% from 40.21%. Additionally, ICRA has recommended a dividend of 60 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748518657000,
            "Source": "result"
        },
        {
            "Title": "ICRA and Former CEO Naresh Takkar Reach Mutual Settlement",
            "Summary": "ICRA Limited has announced a mutual settlement with its former CEO, Naresh Takkar. As part of the agreement, the company will pay an agreed amount to Takkar as a final settlement. This resolution brings closure to any outstanding issues between ICRA and its former chief executive.",
            "Sentiment": "neutral",
            "PublishDate": 1744369481000,
            "Source": "corporate_governance"
        },
        {
            "Title": "ICRA Reports Significant Growth in Q3 EBITDA and Margin",
            "Summary": "ICRA, a credit rating agency, has announced its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 422 million rupees, up from 302 million rupees in the same quarter of the previous year. Additionally, ICRA's EBITDA margin improved to 34.88% from 26.39% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1739193695000,
            "Source": "earnings"
        },
        {
            "Title": "ICRA Reports Strong Q3 Financial Results",
            "Summary": "ICRA Limited has announced its financial results for the third quarter. The company's consolidated net profit increased to 420 million rupees, up from 321 million rupees year-over-year and 367 million rupees quarter-over-quarter. Revenue for Q3 rose to 1.2 billion rupees, compared to 1.15 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739193599000,
            "Source": "earnings"
        },
        {
            "Title": "ICRA Receives Administrative Warning from SEBI",
            "Summary": "ICRA, a credit rating agency, has received an administrative warning from the Securities and Exchange Board of India (SEBI) for non-compliance with SEBI regulations. SEBI has advised ICRA to improve its compliance standards. The company states that there will be no financial impact from this warning.",
            "Sentiment": "neutral",
            "PublishDate": 1738678831000,
            "Source": "corporate_governance"
        },
        {
            "Title": "ICRA Reports Q2 EBITDA Growth",
            "Summary": "ICRA, an Indian credit rating agency, has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 413 million rupees, up from 341 million rupees in the same quarter last year. Additionally, ICRA's EBITDA margin improved slightly to 32.72% from 32.48% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729856021000,
            "Source": "result"
        },
        {
            "Title": "ICRA Reports Q2 Revenue Growth",
            "Summary": "ICRA, an Indian credit rating agency, has reported its second quarter revenue. The company's revenue for Q2 stands at 1.3 billion rupees, compared to 1.05 billion rupees in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1729856011000,
            "Source": "result"
        },
        {
            "Title": "ICRA Reports Increased Q2 Net Profit",
            "Summary": "ICRA, an Indian credit rating agency, has announced its Q2 consolidated net profit of 367 million rupees. This represents a year-over-year increase from 318 million rupees and a quarter-over-quarter increase from 355 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1729856000000,
            "Source": "result"
        },
        {
            "Title": "ICRA Board Meeting Scheduled for Q2 Results",
            "Summary": "<p>ICRA has announced a <span class='neutral'>board meeting</span> to be held on <b>October 25</b> to <span class='neutral'>consider and approve</span> the company's <span class='neutral'>financial results</span> for the <b>second quarter</b>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728477843000,
            "Source": "result"
        },
        {
            "Title": "ICRA Ltd Block Trade: 29,978 Shares Sold for Rs. 21.28 Crores",
            "Summary": "<p>A <span class='neutral'>significant block trade</span> occurred for <b>ICRA Ltd</b> on the <b>National Stock Exchange (NSE)</b>. Approximately <span class='neutral'>29,978 shares</span> were traded at a price of <span class='neutral'>Rs. 7,100.00</span> per share, resulting in a <span class='neutral'>total transaction value</span> of <span class='neutral'>Rs. 21.28 Crores</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728026007000,
            "Source": "block_deals"
        }
    ]
}