{
    "Symbol": "IDBI",
    "ISIN": "INE008A01015",
    "News": [
        {
            "Title": "IDBI Bank Faces Strike Notice for February 12, 2026",
            "Summary": "IDBI Bank receives strike notice from major banking unions AIBEA, AIBOA, and BEFI for February 12, 2026, potentially disrupting banking operations across the network.",
            "Sentiment": "negative",
            "PublishDate": 1770730144607,
            "Source": "stocks"
        },
        {
            "Title": "Fairfax, Kotak Submit Bids for IDBI Bank Stake",
            "Summary": "Fairfax and Kotak Mahindra Bank are set to submit separate financial bids for majority stake in IDBI Bank today along with supporting documents as privatization process advances.",
            "Sentiment": "neutral",
            "PublishDate": 1770348698467,
            "Source": "co_actions_results"
        },
        {
            "Title": "IDBI Bank Financial Bids Launch This Month",
            "Summary": "Financial Services Secretary announces that IDBI Bank's financial bids will be launched this month, marking a significant development in the bank's privatization process.",
            "Sentiment": "neutral",
            "PublishDate": 1770013575365,
            "Source": "co_actions_results"
        },
        {
            "Title": "IDBI Bank Notifies Strike on January 27, 2026",
            "Summary": "IDBI Bank informs exchanges about planned bank strike on January 27, 2026, called by All India Bank Officers' Association and United Forum of Bank Unions in support of their demands.",
            "Sentiment": "negative",
            "PublishDate": 1769177838784,
            "Source": "stocks"
        },
        {
            "Title": "IDBI Bank Disinvestment: Govt Invites Formal Bids",
            "Summary": "Government initiates formal bidding process for IDBI Bank disinvestment, marking significant step in privatization of state-owned banking institution.",
            "Sentiment": "neutral",
            "PublishDate": 1768984166112,
            "Source": "co_actions_results"
        },
        {
            "Title": "Cabinet Approves ₹50B Aid for SIDBI",
            "Summary": "The Indian Cabinet has approved substantial financial assistance of ₹50 billion for the Small Industries Development Bank of India (SIDBI) to strengthen support for small and medium enterprises.",
            "Sentiment": "positive",
            "PublishDate": 1768979199973,
            "Source": "stocks"
        },
        {
            "Title": "IDBI Bank Q3 Results Meeting Set for January 17, 2026",
            "Summary": "IDBI Bank's board of directors will convene on Saturday, January 17, 2026, to consider and approve the bank's third quarter financial results, according to an official exchange filing.",
            "Sentiment": "neutral",
            "PublishDate": 1768205653150,
            "Source": "co_actions_results"
        },
        {
            "Title": "IDBI Bank Board Meet on Jan 17 for Q3FY26 Results",
            "Summary": "IDBI Bank schedules board meeting on January 17, 2026 to approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025. Trading window closed until January 19.",
            "Sentiment": "neutral",
            "PublishDate": 1768198604036,
            "Source": "co_actions_results"
        },
        {
            "Title": "IDBI Bank Q3 Results on January 17",
            "Summary": "IDBI Bank has announced that its board will convene on January 17 to consider and approve the third quarter financial results for the current fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1768198372208,
            "Source": "co_actions_results"
        },
        {
            "Title": "IDBI Bank Disinvestment Delayed to Next Fiscal",
            "Summary": "IDBI Bank's strategic disinvestment process faces delays as procedural and evaluation processes remain ongoing, pushing the timeline to the next fiscal year according to Financial Express reports.",
            "Sentiment": "neutral",
            "PublishDate": 1767670014903,
            "Source": "stocks"
        },
        {
            "Title": "IDBI Bank Responds to BSE Volume Spurt Clarification",
            "Summary": "IDBI Bank clarified to BSE that no undisclosed price sensitive information exists regarding recent volume surge, while confirming strategic disinvestment process continues under DIPAM.",
            "Sentiment": "neutral",
            "PublishDate": 1767600887930,
            "Source": "stocks"
        },
        {
            "Title": "IDBI Bank shares fall 4% despite 12% YoY business growth",
            "Summary": "IDBI Bank shares declined 3.6% to ₹110.70 despite reporting 12% YoY growth in total business to ₹5.47 lakh crore in Q3 FY26, with net advances rising 15% and deposits up 9%.",
            "Sentiment": "neutral",
            "PublishDate": 1767425498922,
            "Source": "co_actions_results"
        },
        {
            "Title": "IDBI Bank Stake Sale: Govt To Invite Financial Bids Soon",
            "Summary": "Government's inter-ministerial group clears IDBI Bank disinvestment process. Financial bids for 60.7% stake sale expected within a week with successful bidder announcement by March-end.",
            "Sentiment": "positive",
            "PublishDate": 1767338697040,
            "Source": "co_actions_results"
        },
        {
            "Title": "Small business credit hits ₹46 lakh crore with surge",
            "Summary": "India's small business credit market reached ₹46 lakh crore with 16.2% YoY growth, driven by 23.3% first-time borrowers and expanding NBFC participation across segments.",
            "Sentiment": "positive",
            "PublishDate": 1766974071655,
            "Source": "stocks"
        },
        {
            "Title": "IDBI Bank Privatisation Bids Expected Within 15 Days",
            "Summary": "Government may invite financial bids for IDBI Bank privatisation within 15 days, targeting deal completion by March 2026 according to latest reports.",
            "Sentiment": "neutral",
            "PublishDate": 1766462157278,
            "Source": "co_actions_results"
        },
        {
            "Title": "Fairfax Leads Bid for IDBI Bank Stake",
            "Summary": "Fairfax emerges as leading bidder to acquire government and LIC stake in IDBI Bank, marking significant development in the bank's privatization process.",
            "Sentiment": "positive",
            "PublishDate": 1765509512699,
            "Source": "co_actions_results"
        },
        {
            "Title": "Government May Invite Bids for IDBI Bank Stake Worth $7 Billion This Month",
            "Summary": "The government is considering inviting bids for its stake in IDBI Bank valued at $7 billion, with the process potentially beginning this month. This development affects IDBI Bank shareholders and potential investors, representing a significant divestment opportunity in the banking sector.",
            "Sentiment": "neutral",
            "PublishDate": 1764901050939,
            "Source": "order&deals"
        },
        {
            "Title": "IDBI Bank Transaction Receives Fit and Proper Evaluation Approval, Due Diligence Ongoing",
            "Summary": "The Finance Minister confirmed that IDBI Bank has received fit and proper evaluation approval for an ongoing transaction. The transaction is currently in the due diligence phase as part of the process.",
            "Sentiment": "positive",
            "PublishDate": 1764577434432,
            "Source": "corporate_governance"
        },
        {
            "Title": "RBI Approves Fit and Proper Status for IDBI Bank Bidders, Kotak Mahindra Bank Emerges as Likely Leader",
            "Summary": "The Reserve Bank of India has granted fit and proper status approval to bidders seeking to acquire a stake in IDBI Bank. Kotak Mahindra Bank appears to be the frontrunner among the approved bidders for the IDBI Bank stake acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1763716664037,
            "Source": "order&deals"
        },
        {
            "Title": "Emirates NBD Maintains Interest in IDBI Bank Acquisition Despite RBL Bank Deal",
            "Summary": "Emirates NBD continues its pursuit of IDBI Bank even after entering into an agreement with RBL Bank. The Dubai-based bank remains interested in acquiring IDBI Bank as a separate initiative.",
            "Sentiment": "neutral",
            "PublishDate": 1763025637257,
            "Source": "order&deals"
        },
        {
            "Title": "Government Plans IDBI Bank Divestment Bidding Process with IMG Meeting Set for October 31",
            "Summary": "The government plans to initiate the bidding process for IDBI Bank divestment. An Inter-Ministerial Group (IMG) meeting has been scheduled for October 31 to discuss the divestment proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1761630772299,
            "Source": "corporate_action"
        },
        {
            "Title": "Emirates NBD's $3 Billion RBL Bank Deal May Delay Government's IDBI Bank Stake Sale",
            "Summary": "Emirates NBD announced a $3 billion investment to acquire a majority stake in RBL Bank, which may impact the government's plans to sell its 61% stake in IDBI Bank. The Department of Investment and Public Asset Management (DIPAM) is managing the IDBI Bank sale, with a target to complete it by the end of this fiscal year. Emirates NBD and Fairfax were previously the primary suitors for IDBI Bank and had conducted due diligence. With Emirates NBD now focused on the RBL Bank acquisition, Fairfax remains as the main competitive suitor. Other potential bidders including Oaktree Capital and Kotak Mahindra Bank have shown limited interest. The sale process requires at least two serious competing bids to move forward effectively, and the lack of a strong second bidder may delay the privatization beyond the government's targeted timeline.",
            "Sentiment": "negative",
            "PublishDate": 1761206622647,
            "Source": "order&deals"
        },
        {
            "Title": "IDBI Bank Sale May Face Delays Due to Emirates NBD Bidding Uncertainty",
            "Summary": "IDBI Bank's privatization process might be postponed as there are low chances of Emirates NBD participating in the bidding process. The potential absence of the UAE-based bank as a bidder could impact the timeline of the bank's sale.",
            "Sentiment": "negative",
            "PublishDate": 1761203205130,
            "Source": "stock"
        },
        {
            "Title": "IDBI Bank Q2 Net Profit Doubles to 36.3 Billion Rupees, Revenue Declines",
            "Summary": "IDBI Bank reported Q2 net profit of 36.3 billion rupees, nearly doubling from 18.4 billion rupees in the same period last year. However, quarterly revenue declined to 71 billion rupees from 74.4 billion rupees year-over-year. The bank's asset quality showed improvement with gross non-performing assets (GNPA) decreasing to 2.65% from 2.93% in the previous quarter, while net non-performing assets (NNPA) remained stable at 0.21%.",
            "Sentiment": "positive",
            "PublishDate": 1760918893771,
            "Source": "earnings"
        },
        {
            "Title": "IDBI Bank Reports 97% Jump in Q2 Net Profit to ₹3,627 Crore, Driven by Strategic Investment Sale",
            "Summary": "IDBI Bank reported a net profit of ₹3,627 crore for the quarter ended September 30, 2025, compared to ₹1,836 crore in the same period last year. For the half-year, net profit increased to ₹5,635 crore from ₹3,556 crore. The bank's total income rose to ₹9,594 crore in Q2 from ₹8,755 crore year-on-year. Operating profit increased to ₹3,523 crore from ₹3,006 crore. The bank sold 2.22 crore equity shares (11.11% stake) in National Securities Depository Ltd through its IPO at ₹799.87 per share, generating a net gain of ₹1,699 crore. Post-sale, the bank's holding in NSDL reduced to 14.99%. Gross NPAs decreased to 2.65% from 3.68% year-on-year, while net NPAs remained stable at 0.21%. The bank's capital adequacy ratio improved to 25.39% from 21.98%. Interest earned declined to ₹7,104 crore from ₹7,442 crore, while other income surged to ₹2,489 crore from ₹1,313 crore.",
            "Sentiment": "positive",
            "PublishDate": 1760778861137,
            "Source": "earnings"
        },
        {
            "Title": "Government Plans to Complete IDBI Bank Stake Sale by End of FY26",
            "Summary": "The government has announced plans to finalize the sale of its stake in IDBI Bank by the end of FY26. This represents the government's timeline for completing the divestment process in the public sector bank.",
            "Sentiment": "neutral",
            "PublishDate": 1759894325568,
            "Source": "stock"
        },
        {
            "Title": "IDBI Bank Reports 12% Growth in Total Business to ₹5.33 Lakh Crore",
            "Summary": "IDBI Bank's total business increased 12% year-on-year to ₹5,33,839 crore as of September 2025. Total deposits grew 9% to ₹3,03,531 crore, while net advances rose 15% to ₹2,30,308 crore. CASA deposits increased 4% to ₹1,39,056 crore. Net profit jumped 16.8% to ₹2,007.4 crore, though Net Interest Income declined 2% to ₹3,165.8 crore. The bank benefited from a provision write-back of ₹385.3 crore. Asset quality showed mixed results with Gross NPA improving to 2.93% from 2.98%, but Net NPA rising to 0.21% from 0.15%. Return on Assets improved to 2.01%, while Net Interest Margin contracted to 3.68% from 4.18%. Shares closed at ₹92.58, up 0.22%.",
            "Sentiment": "positive",
            "PublishDate": 1759561897440,
            "Source": "earnings"
        },
        {
            "Title": "IDBI Bank Executive Director Baljinder Kaur Mandal Retires Due to Superannuation",
            "Summary": "Baljinder Kaur Mandal, Executive Director of IDBI Bank, ceased to be Senior Management Personnel of the bank effective September 30, 2025, upon reaching superannuation age. The bank notified stock exchanges BSE and National Stock Exchange of India about this senior management change.",
            "Sentiment": "neutral",
            "PublishDate": 1759237650104,
            "Source": "corporate_governance"
        },
        {
            "Title": "DIPAM Secretary Expects IDBI Bank Disinvestment to Complete This Year",
            "Summary": "The DIPAM Secretary has stated that the disinvestment process for IDBI Bank is expected to conclude within this year. This indicates the government's timeline for completing the stake sale in the bank.",
            "Sentiment": "neutral",
            "PublishDate": 1758522448516,
            "Source": "corporate_action"
        },
        {
            "Title": "Multiple Financial Entities Eye Stake in IDBI Bank",
            "Summary": "Emirates NBD, Fairfax, Kotak Bank, and Oaktree are potential competitors for acquiring a stake in IDBI Bank. The competition involves these four major financial entities seeking ownership participation in the bank.",
            "Sentiment": "neutral",
            "PublishDate": 1757311406967,
            "Source": "order&deals"
        },
        {
            "Title": "IDBI Bank Disinvestment Expected to Complete by FY26, Says Finance Minister",
            "Summary": "Finance Minister Nirmala Sitharaman announced that the strategic sale of the government's majority stake in IDBI Bank will be concluded by the end of FY26. The government and LIC together hold over 94% stake in IDBI Bank, with the Centre holding 45.48% and LIC holding 49.24%. The disinvestment will involve selling 60.72% of equity share capital - the government will sell 30.48% and LIC will sell 30.24%, transferring management control to the buyer. DIPAM Secretary Arunish Chawla indicated that qualified interested parties have nearly completed due diligence, with the process expected to finish by September. The IDBI Bank privatisation is viewed as a test case for the government's privatisation programme. Additionally, the government has begun preparatory work for stake dilution in select public sector banks and government-owned insurers including LIC.",
            "Sentiment": "positive",
            "PublishDate": 1757075090527,
            "Source": "corporate_action"
        },
        {
            "Title": "Kotak Mahindra Bank Joins Race to Acquire IDBI Bank as Bidding Process Nears Final Stage",
            "Summary": "Kotak Mahindra Bank has entered advanced discussions with the government to submit a bid for IDBI Bank as due diligence enters its final stages. The acquisition race, previously dominated by Emirates NBD and Fairfax Financial, now includes the Uday Kotak-owned lender which has increased interactions with government advisers. The government expects to invite final bids by next quarter and finalize the top bidder by the end of the financial year. Bidders are expected to pay $5-6 billion for a 60.72% equity stake, valuing IDBI Bank at $8-10 billion. The deal includes controlling stake and 26% voting rights, with the government promising to reduce Life Insurance Corporation of India's voting rights. Currently, the government owns 45.48% of IDBI Bank while LIC owns 49.24%. Kotak Mahindra Bank's domestic franchise and Fairfax Financial's control of CSB Bank make them competitive bidders, while Emirates NBD recently received regulatory clearance for a wholly-owned subsidiary in India.",
            "Sentiment": "neutral",
            "PublishDate": 1756872184415,
            "Source": "order&deals"
        },
        {
            "Title": "Bank Officers' Union Opposes IDBI Bank Privatisation, Cites Parliamentary Assurance Breach",
            "Summary": "All-India Bank Officers' Confederation (AIBOC) criticized the government's plan to privatise IDBI Bank, calling it a betrayal of parliamentary assurances made in December 2003. The then Finance Minister had assured Parliament that the government would maintain at least 51% shareholding in IDBI Bank at all times. DIPAM Secretary Arunish Chawla indicated the IDBI Bank stake sale is expected to complete this fiscal year as qualified bidders have nearly completed due diligence. The Government of India and LIC jointly own 95% of IDBI Bank, with 60.72% stake earmarked for sale under the disinvestment programme. AIBOC argued that privatising IDBI Bank amounts to privatising people's savings and urged the government to withdraw the proposal. The union recommended strengthening governance, infusing capital through public financial institutions, and accelerating digital modernisation instead. IDBI Bank became a subsidiary of LIC in January 2019 and was reclassified as an associate company in December 2020 when LIC's shareholding reduced to 49.24%.",
            "Sentiment": "negative",
            "PublishDate": 1756309368823,
            "Source": "corporate_action"
        },
        {
            "Title": "IDBI Bank Shares Rise 2.4% After SEBI Approves LIC Reclassification for Divestment Process",
            "Summary": "IDBI Bank shares jumped 2.4% to Rs 97.30 after SEBI approved reclassifying Life Insurance Corporation of India (LIC) as a public shareholder following the government-led divestment process. The approval comes with conditions including limiting LIC's voting rights to maximum 10% of total net effective voting rights, no management participation, no special rights, and no board representation. The government and LIC currently hold over 95% combined stake in IDBI Bank and plan to divest 60.72% total - with government selling 30.48% of its 45.48% holding and LIC offloading 30.24% of its 49.24% stake. The divestment is part of the government's asset monetisation programme, with qualified bidders nearly completing due diligence and expectations to complete the stake sale within the ongoing fiscal year. The government has mobilized Rs 20,000 crore against its Rs 47,000 crore asset monetisation target. The reclassification will take effect only after the strategic sale concludes.",
            "Sentiment": "positive",
            "PublishDate": 1756094971744,
            "Source": "corporate_action"
        },
        {
            "Title": "SEBI Approves LIC Reclassification as Public Shareholder of IDBI Bank with Conditions",
            "Summary": "SEBI has approved the reclassification of Life Insurance Corporation of India (LIC) as a public shareholder of IDBI Bank, subject to nine specific conditions as part of the ongoing strategic disinvestment process. Key conditions include limiting LIC's voting rights to maximum 10% of total net effective voting rights, prohibiting LIC from exercising control over IDBI Bank affairs, and preventing LIC representation on the bank's Board of Directors. LIC must reduce its residual shareholding to 15% or below within two years of the transaction closing date as directed by the Reserve Bank of India. The reclassification requires fulfillment of all specified conditions and obtaining necessary statutory, regulatory, and corporate approvals. Non-compliance with any condition will result in automatic withdrawal of the reclassification approval.",
            "Sentiment": "neutral",
            "PublishDate": 1755964211333,
            "Source": "corporate_action"
        },
        {
            "Title": "IDBI Bank Shares Fall 2.85% on Profit Booking After Four-Day Rally",
            "Summary": "IDBI Bank shares declined 2.85% to Rs 94.8 during early trading as investors booked profits following a four-day rally of over 9%. The stock had surged 8.2% the previous day after DIPAM Secretary Arunish Chawla announced that the expression of interest exercise for the government's stake sale in the bank has been completed and due diligence is underway. The government aims to invite bids for IDBI Bank stake sale by the third quarter of this fiscal year. Transaction documents are being finalized, though deal-specific details were not disclosed. IDBI Bank is majority owned by Life Insurance Corporation of India (49.2%) and the Government of India (45.5%). The stock has gained 25% over the past 12 months but fallen 4% recently.",
            "Sentiment": "neutral",
            "PublishDate": 1755838797886,
            "Source": "stock"
        },
        {
            "Title": "IDBI Bank Officials Confirm Information Sharing with Potential Buyers as Due Diligence Nears Completion",
            "Summary": "IDBI Bank officials have confirmed that all necessary information has been shared with interested buyers for the bank's sale. The due diligence process by potential buyers is reportedly nearing completion.",
            "Sentiment": "positive",
            "PublishDate": 1755764314700,
            "Source": "order&deals"
        },
        {
            "Title": "IDBI Bank Approves Call Option Exercise on Rs 1,000 Crore Tier 2 Bonds",
            "Summary": "IDBI Bank's Board of Directors approved the exercise of call option on IDBI Omni Tier 2 Bond, 2015-16 Series I worth Rs 1,000 crore. The bonds carry an 8.620% coupon rate and will be redeemed at par on December 31, 2025. The bonds were originally allotted on December 31, 2015, with a maturity date of December 31, 2030. The redemption will include accrued interest till the day preceding the call date. The actual exercise of the call option and payment of redemption amount remains subject to regulatory approval and compliance with stipulated conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1755344058694,
            "Source": "corporate_action"
        },
        {
            "Title": "IDBI Bank Schedules Board Meeting to Consider Call Option on Rs 1,000 Crore Tier 2 Bonds",
            "Summary": "IDBI Bank Limited has scheduled a board meeting on August 16, 2025, to consider exercising the call option on its 'IDBI Omni Tier 2 Bond 2015-16 Series I'. The bond carries ISIN INE008A08V00 with a face value of Rs 1,000 crore and coupon rate of 8.620%. The bond was allotted on December 31, 2015, with maturity date of December 31, 2030, and call option date of December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755000362064,
            "Source": "corporate_action"
        },
        {
            "Title": "IDBI Bank Receives Notice of Planned Strike on August 11, 2025",
            "Summary": "IDBI Bank has received notice about a strike scheduled for August 11, 2025. The bank has been informed of the planned work stoppage by employees or unions.",
            "Sentiment": "negative",
            "PublishDate": 1754655143823,
            "Source": "stock"
        },
        {
            "Title": "IDBI Bank Sells 11.11% Stake in NSDL Through IPO for Rs 1,777 Crore",
            "Summary": "IDBI Bank sold 22.22 crore equity shares representing 11.11% shareholding in National Securities Depository Ltd. (NSDL) through an Initial Public Offer at Rs 799.87 per share. The transaction generated gross proceeds of Rs 1,777.31 crore, with net consideration of Rs 1,703.14 crore after expenses. The bank received Rs 1,621.32 crore on August 7, 2025. Following this sale, NSDL is no longer an associate company of IDBI Bank, though the bank retains a 14.99% stake with 2.99 crore shares. The OFS closed on August 1, 2025, and NSDL shares were listed on Bombay Stock Exchange on August 6, 2025. NSDL reported total revenue of Rs 731.41 crore during FY 2024-25 and net worth of Rs 1,808.48 crore as of March 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754642886079,
            "Source": "corporate_action"
        },
        {
            "Title": "IDBI Bank Sells NSDL Shares Worth ₹1,700 Crore, Retains 15% Stake",
            "Summary": "IDBI Bank has sold shares in NSDL (National Securities Depository Limited) valued at ₹1,700 crore. Following this divestment, the bank continues to hold a 15% stake in NSDL.",
            "Sentiment": "neutral",
            "PublishDate": 1754642053094,
            "Source": "stock"
        },
        {
            "Title": "IDBI Bank Strategic Sale Process Advances with Bids Expected by November-December",
            "Summary": "The strategic sale of IDBI Bank has progressed with the completion of due diligence process. Arunish Chawla, Secretary at the Department of Investment and Public Asset Management (DIPAM), announced that the government plans to invite financial bids between October and December, with the bidding process likely beginning around November or December. The winning bidder could be finalized by March 2026, subject to regulatory approvals. The government has appointed merchant bankers and legal advisors to assist with stake sales in LIC and other public sector financial institutions, including state-run banks, with appointments valid for up to three years. An Offer for Sale (OFS) of shares may proceed during this period depending on market conditions. The government is conducting weekly reviews on capital management by Central Public Sector Enterprises to ensure performance targets are met and prepare for potential global economic risks.",
            "Sentiment": "positive",
            "PublishDate": 1754063428504,
            "Source": "corporate_action"
        },
        {
            "Title": "IDBI Bank Completes Due Diligence for Stake Sale, Financial Bids Expected October-December",
            "Summary": "IDBI Bank has completed the due diligence process for its stake sale and plans to invite financial bids between October and December. The government has finished discussions with interested parties, and a bidder announcement is expected by March-end.",
            "Sentiment": "positive",
            "PublishDate": 1754055852145,
            "Source": "order&deals"
        },
        {
            "Title": "IDBI Bank Part-time Chairman T. N. Manoharan Passes Away",
            "Summary": "IDBI Bank announced the passing of Shri T. N. Manoharan, Independent Director and Part-time Chairman, on July 30, 2025. Manoharan had been associated with the bank since February 24, 2022. The bank acknowledged his vision and varied experience during his tenure. The Board of Directors and all employees expressed their condolences to his family.",
            "Sentiment": "negative",
            "PublishDate": 1753877554024,
            "Source": "corporate_governance"
        },
        {
            "Title": "IDBI Bank Receives ESG Rating of 73.1 for Financial Year Ended March 2025",
            "Summary": "IDBI Bank received an ESG rating of 73.1 for the financial year ended March 31, 2025, from SES ESG Research Pvt Ltd., a SEBI-registered Category II ESG Rating Provider. The rating was assigned through the provider's subscriber pay model and was based on independent research using publicly available information. IDBI Bank did not engage the rating provider directly nor provide any inputs for the assessment process.",
            "Sentiment": "neutral",
            "PublishDate": 1753795164300,
            "Source": "stock"
        },
        {
            "Title": "IDBI Bank Sale Expected by December Pending Inter-Ministerial Group Approval",
            "Summary": "IDBI Bank could be sold by December following approval from an inter-ministerial group on the sale agreement. The timeline is contingent on receiving the necessary governmental approvals for the transaction to proceed.",
            "Sentiment": "neutral",
            "PublishDate": 1753327697925,
            "Source": "order&deals"
        },
        {
            "Title": "IDBI Bank Appoints Parikh & Associates as Secretarial Auditor for Five-Year Term",
            "Summary": "IDBI Bank has appointed M/s Parikh & Associates as its Secretarial Auditor for a five-year period from FY 2025-26 to FY 2029-30. The fees will be mutually agreed upon between the Bank's Board of Directors and the firm. Parikh & Associates is a practicing company secretaries firm founded in 1987, providing services in Corporate Laws, SEBI Regulations, and FEMA Regulations. The firm has 35 members including 10 partners, 11 qualified professionals, and 14 associates and trainees. The firm is peer reviewed and quality reviewed by the Institute of Company Secretaries of India.",
            "Sentiment": "neutral",
            "PublishDate": 1753189022748,
            "Source": "corporate_governance"
        },
        {
            "Title": "IDBI Bank Reports Higher Q1 Interest Income and Net Profit with Improved Asset Quality",
            "Summary": "IDBI Bank reported Q1 interest income of 70.2 billion rupees, up from 66.66 billion rupees year-over-year. The bank's Q1 net profit increased to 20.1 billion rupees compared to 17.2 billion rupees in the same period last year. Asset quality showed mixed results with Gross Non-Performing Assets (GNPA) improving to 2.93% from 2.98% quarter-over-quarter, while Net Non-Performing Assets (NNPA) rose to 0.21% from 0.15% quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753088190539,
            "Source": "earnings"
        },
        {
            "Title": "IDBI Bank Scheduled to Announce Q1FY26 Results on July 21",
            "Summary": "IDBI Bank will announce its Q1FY26 financial results on July 21, with the board meeting scheduled to consider unaudited results for the quarter ended June 30, 2025. The bank operates through over 2,100 branches and 3,000+ ATMs across India. In Q4FY25, IDBI Bank reported a 25.2% year-on-year increase in consolidated net profit to Rs 2,072.01 crore, while total income rose 14.2% to Rs 9,089.81 crore. The bank's shares have declined 0.93% in the past five trading sessions but gained 10.30% over the last month and 28.16% year-to-date. Trading window for designated persons remains closed from July 1 until 48 hours after results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1752931618594,
            "Source": "earnings"
        }
    ]
}