{
    "Symbol": "IDEAFORGE",
    "ISIN": "INE349Y01013",
    "News": [
        {
            "Title": "Ideaforge Technology Plans Major Q4 FY26 Execution",
            "Summary": "Ideaforge Technology announces strategic plan to execute 40-45% of its open order book in the fourth quarter of FY26, indicating significant operational scaling.",
            "Sentiment": "positive",
            "PublishDate": 1769102162641,
            "Source": "co_actions_results"
        },
        {
            "Title": "ideaForge Technology Reports Q3 FY26 Results",
            "Summary": "ideaForge Technology Limited announced Q3 FY26 financial results with revenue of ₹315.45 crores and net loss of ₹313.55 crores. Board meeting held on January 22, 2026 approved unaudited results.",
            "Sentiment": "negative",
            "PublishDate": 1769096484662,
            "Source": "co_actions_results"
        },
        {
            "Title": "ideaForge Allots 14,451 Shares Under ESOP Scheme",
            "Summary": "ideaForge Technology Limited's Executive Committee approved allotment of 14,451 equity shares under ESOP scheme on January 13, 2026, increasing paid-up capital to ₹43.27 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1768302981176,
            "Source": "co_actions_results"
        },
        {
            "Title": "ideaForge Technology Q3FY26 Earnings Call on Jan 23",
            "Summary": "ideaForge Technology Limited has scheduled its Q3FY26 earnings conference call for January 23, 2026 at 11:00 AM IST to discuss unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767943557093,
            "Source": "co_actions_results"
        },
        {
            "Title": "IdeaForge Technology Q3 Results on Jan 22",
            "Summary": "IdeaForge Technology Limited has announced that its board will consider and approve the company's third quarter financial results on January 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767767110528,
            "Source": "co_actions_results"
        },
        {
            "Title": "ideaForge Technology Allots 3,140 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "ideaForge Technology's Executive Committee approved allotment of 3,140 equity shares with face value of Rs. 10 each under the ideaForge Employees Stock Option Scheme, 2018. The company's paid-up capital increased from Rs. 43,25,05,550 comprising 4,32,50,555 equity shares to Rs. 43,25,36,950 comprising 4,32,53,695 equity shares, with new shares ranking pari-passu with existing shares.",
            "Sentiment": "neutral",
            "PublishDate": 1765284328824,
            "Source": "corporate_action"
        },
        {
            "Title": "ideaForge Technology Surges 10% on ₹107 Crore Defence Orders Despite Recent Losses",
            "Summary": "ideaForge Technology's shares jumped 10% to ₹512 following the announcement of two Ministry of Defence orders worth ₹107 crore for UAV supply, including a ₹75 crore order for tactical UAVs and a ₹32 crore order for hybrid UAVs. Despite the order wins, the drone manufacturer has reported losses for five consecutive quarters and its stock remains 62% below its post-listing peak, trading below its IPO price of ₹672.",
            "Sentiment": "positive",
            "PublishDate": 1763353044904,
            "Source": "stock"
        },
        {
            "Title": "ideaForge Secures Over ₹100 Crore Defence Orders for Next-Gen UAVs",
            "Summary": "ideaForge Technology secured defence contracts worth over ₹100 crore from the Indian Army and Ministry of Defence for its ZOLT tactical UAV (₹75 crore) and SWITCH V2 hybrid UAV (₹30 crore). The orders strengthen ideaForge's position as India's leading UAV manufacturer and support the country's defence modernisation efforts with deliveries scheduled within 6-12 months.",
            "Sentiment": "positive",
            "PublishDate": 1763133034079,
            "Source": "order&deals"
        },
        {
            "Title": "Ideaforge Technology Secures ₹320 Million Order",
            "Summary": "Ideaforge Technology has received a new order worth approximately ₹320 million. The order represents a significant business win for the drone technology company.",
            "Sentiment": "positive",
            "PublishDate": 1763127786938,
            "Source": "order&deals"
        },
        {
            "Title": "IdeaForge Technology Secures ₹750 Million Defence Ministry Order",
            "Summary": "IdeaForge Technology has secured a ₹750 million order from the Defence Ministry. This significant contract affects the company's revenue prospects and strengthens its position in the defence technology sector.",
            "Sentiment": "positive",
            "PublishDate": 1763126463631,
            "Source": "order&deals"
        },
        {
            "Title": "ideaForge Technology Allots 952 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "ideaForge Technology Limited's Executive Committee approved the allotment of 952 equity shares with a face value of Rs. 10 each under the ideaForge Employees Stock Option Scheme, 2018. The allotment was made towards the exercise of vested stock options by employees. Following this allotment, the company's paid-up capital increased from Rs. 43,24,96,030 comprising 4,32,49,603 equity shares to Rs. 43,25,05,550 comprising 4,32,50,555 equity shares. The newly issued shares will rank pari-passu with existing equity shares in all respects. The company's shares are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1762898463134,
            "Source": "corporate_action"
        },
        {
            "Title": "IdeaForge Technology's Credit Rating Outlook Revised to Negative by CRISIL",
            "Summary": "CRISIL Limited revised IdeaForge Technology Limited's corporate credit rating outlook from Stable to Negative while maintaining the CRISIL BBB rating. The rating agency communicated this change on November 6, 2025. CRISIL BBB rating indicates that issuers are considered to have moderate degree of safety regarding timely servicing of debt obligations, with debt exposures carrying moderate credit risk. The company informed BSE and NSE about this rating action through regulatory disclosure.",
            "Sentiment": "negative",
            "PublishDate": 1762434014051,
            "Source": "stock"
        },
        {
            "Title": "ideaForge Technology Reports Q2 FY26 Results with Revenue Growth and Strong Order Book",
            "Summary": "ideaForge Technology Limited reported consolidated revenue of INR 40.8 crores for Q2 FY26 versus INR 37.1 crores in Q2 FY25. Half-year revenue stood at INR 53.5 crores compared to INR 123.3 crores in H1 FY25. The company achieved gross profit margin of 50% for the quarter and 52.8% for the half-year. EBITDA was negative INR 8 crores for Q2 and negative INR 23.1 crores for H1. PAT recorded losses of INR 19.6 crores for the quarter and INR 43.2 crores for the half-year. Order book as of October 28 stood at approximately INR 238 crores. The company announced a joint venture between its US subsidiary and FirstBreach Inc. to expand in the US defense market. Both SWITCH UAV and Q6 UAV received NATO Stock Numbers, validating compliance with global military standards. Management indicated majority of current orders are from defense emergency procurement and are expected to be executed within 12 months.",
            "Sentiment": "neutral",
            "PublishDate": 1762252043489,
            "Source": "earnings"
        },
        {
            "Title": "IdeaForge Tech Advances Zolt Project Development and Partners with GalaxEye on Radar Technology",
            "Summary": "IdeaForge Tech is developing Zolt, a project that has been in development for 1.5 years and is experiencing growing customer interest and trials. The company is also working on synthetic aperture radar technology in partnership with GalaxEye to improve observation capabilities in foggy weather conditions.",
            "Sentiment": "positive",
            "PublishDate": 1761795612558,
            "Source": "stock"
        },
        {
            "Title": "ideaForge Technology Reports 41% Jump in Q2 Net Profit to ₹19.5 Crore",
            "Summary": "ideaForge Technology reported a 41.3% increase in net profit to ₹19.5 crore for Q2 FY26, compared to ₹13.8 crore in the same period last year. Revenue from operations grew 10% to ₹40.8 crore from ₹37.1 crore. However, EBITDA declined 28.9% to ₹11.3 crore from ₹15.9 crore. Gross margin stood at 50.0% versus 61.7% in the previous quarter, attributed to product mix variations. The company formed a joint venture with First Breach Inc. through its US subsidiary for UAV manufacturing in the United States. Its Q6 UAV received NATO Stock Number certification for inclusion in NATO procurement systems. The company launched new products including Q6 V2 Geo, SHODHAM M61, and FLYGHT CLOUD 2.0 at its customer event PRAGYA. Shares closed at ₹490.05, down 1.40%.",
            "Sentiment": "positive",
            "PublishDate": 1761667487059,
            "Source": "earnings"
        },
        {
            "Title": "IdeaForge Reports 218% QoQ Revenue Growth and 50% Gross Margin",
            "Summary": "IdeaForge achieved a 218% quarter-over-quarter revenue increase and maintained a 50% gross margin. The company plans to diversify its product portfolio with AI-integrated drones, scale up exports, and expand into defense automation. IdeaForge targets sustained annual growth of over 20%.",
            "Sentiment": "positive",
            "PublishDate": 1761667322559,
            "Source": "earnings"
        },
        {
            "Title": "IdeaForge Tech Reports Higher Q2 Loss Despite Revenue Growth",
            "Summary": "IdeaForge Tech reported a net loss of 151 million rupees in Q2, compared to a loss of 122 million rupees in the same period last year. The company's revenue increased to 417 million rupees from 372 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1761663194485,
            "Source": "earnings"
        },
        {
            "Title": "ideaForge Technology Subsidiary Forms Joint Venture with First Breach Inc. for US UAV Operations",
            "Summary": "ideaForge Technology Inc., a wholly owned subsidiary of ideaForge Technology Limited, has entered into a joint venture agreement with First Breach Inc. to establish First Forge Technology Inc. The joint venture will focus on licensing, sourcing, designing, engineering, manufacturing, and distributing specific UAVs in the United States. Both parties will hold equal 50% stakes in the joint venture, with ideaForge Technology Inc. contributing intellectual property, technology and know-how, while First Breach Inc. will provide cash consideration. Each party will have the right to appoint two directors to the joint venture's board. The agreement is subject to due diligence completion and obtaining necessary regulatory approvals. The joint venture aims to leverage ideaForge's technology with First Breach's infrastructure and market access to tap into the US drone market. Completion is targeted by the end of financial year 2025-26.",
            "Sentiment": "positive",
            "PublishDate": 1758697985405,
            "Source": "order&deals"
        },
        {
            "Title": "ideaForge Technology Shareholders Approve Vipul Joshi's Appointment as Whole-Time Director and Promoter Status",
            "Summary": "ideaForge Technology Limited announced results of a postal ballot conducted through remote e-voting that concluded on September 6, 2025. Shareholders approved three special resolutions: the appointment of Mr. Vipul Joshi (DIN: 10071782) as Whole-Time Director, his identification as a Promoter with special rights granted to promoters, and alterations to the company's Articles of Association. The voting was conducted between August 8, 2025, and September 6, 2025. All three resolutions passed with requisite majority, with overall voting participation at 46.65% of outstanding shares. The Promoter and Promoter Group category showed 99.99% participation with 100% votes in favor of all resolutions, while Public-Institutions had 69.27% participation voting entirely against, and Public-Non Institutions had 23.63% participation with over 99% voting in favor of all three resolutions.",
            "Sentiment": "positive",
            "PublishDate": 1757180783518,
            "Source": "corporate_governance"
        },
        {
            "Title": "GST on Drones May Be Reduced from 18% to 5%",
            "Summary": "There are indications that the Goods and Services Tax (GST) rate on drones may be reduced from the current 18% to 5%. This potential tax reduction would impact drone manufacturers and the broader drone industry.",
            "Sentiment": "positive",
            "PublishDate": 1756717568741,
            "Source": "stock"
        },
        {
            "Title": "ideaForge Technology Seeks Shareholder Approval for Vipul Joshi's Appointment as Whole-Time Director and Promoter Status",
            "Summary": "ideaForge Technology Limited has issued a postal ballot notice seeking shareholder approval for three key resolutions. The company proposes to appoint Chief Financial Officer Vipul Joshi as Whole-Time Director for five years with remuneration of Rs 1.53 crore annually, with maximum compensation capped at Rs 5 crore per year. The company also seeks to identify Joshi as a Promoter alongside existing promoters Ankit Mehta, Rahul Singh, and Ashish Bhat, granting collective nomination rights for up to five board directors subject to maintaining at least 5% shareholding. Additionally, the company proposes alterations to its Articles of Association to formalize these arrangements. The e-voting period runs from August 8 to September 6, 2025. Joshi, who has been with the company since 2008 and holds 18.53 lakh shares, will continue his financial oversight responsibilities while gaining enhanced governance authority in the drone technology company.",
            "Sentiment": "neutral",
            "PublishDate": 1754483620750,
            "Source": "corporate_action"
        },
        {
            "Title": "ideaForge Technology Makes Earnings Call Audio Recording Available on Company Website",
            "Summary": "ideaForge Technology Limited has made the audio recording of their earnings conference call available on their company website. The call was held on June 23, 2025, at 11:00 a.m. IST following the announcement of unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company notified BSE Limited and National Stock Exchange of India Limited about the availability of the recording through a letter dated July 23, 2025. The audio recording can be accessed via a link provided on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1753257385645,
            "Source": "earnings"
        },
        {
            "Title": "Next Stage of PLI Scheme Set to Launch for Drone Manufacturing Industry",
            "Summary": "The next phase of the Production Linked Incentive (PLI) scheme is set to launch for drone manufacturers. This development is expected to provide a boost to the drone industry and benefit companies operating in this sector, including Ideaforge.",
            "Sentiment": "positive",
            "PublishDate": 1753198038951,
            "Source": "stock"
        },
        {
            "Title": "IdeaForge Tech Reports Significant Q1 Losses with Revenue Declining 85% Year-over-Year",
            "Summary": "IdeaForge Tech reported a net loss of 218 million rupees in Q1 compared to a loss of 19 million rupees in the same period last year. The company's revenue dropped substantially to 128 million rupees from 865 million rupees year-over-year. The company also posted an EBITDA loss of 165 million rupees, contrasting with a gain of 34 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1753197057209,
            "Source": "earnings"
        },
        {
            "Title": "ideaForge Technology Reports Q1 2025 Loss, Appoints New Whole-time Director",
            "Summary": "ideaForge Technology Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing a standalone net loss of INR 211.82 million compared to a profit of INR 19.02 million in the same quarter last year. Revenue from operations declined to INR 91.80 million from INR 864.63 million year-over-year. The Board recommended appointing Mr. Vipul Joshi as Whole-time Director for five years and identifying him as a Promoter, subject to shareholder approval through postal ballot. Board committees were reconstituted following a Non-Executive Director's resignation, with Risk Management and Corporate Social Responsibility committees getting new compositions. The company also proposed amendments to its Articles of Association to align with listing regulations and appointed Ms. Shirin Bhatt as scrutinizer for the postal ballot process.",
            "Sentiment": "negative",
            "PublishDate": 1753195915456,
            "Source": "corporate_action"
        },
        {
            "Title": "IdeaForge Technology: Expects 20%+ EBITDA Margin in FY26 as Revenue Grows",
            "Summary": "IdeaForge Technology anticipates over 20% EBITDA margin in FY26 due to expected revenue growth. The company has a strong order pipeline and potential quick conversion of L1 projects. The Indian Army's Rs 9,000-crore budget for technology induction post Operation Sindoor may lead to order conversions this year. IdeaForge aims to execute existing orders quickly to meet immediate national needs.",
            "Sentiment": "positive",
            "PublishDate": 1751770102000,
            "Source": "earnings"
        },
        {
            "Title": "Ideaforge Technology: Shares Surge on Rs 137 Crore Defence Ministry Order",
            "Summary": "Ideaforge Technology's shares hit upper circuit after winning a Rs 137 crore order from the defence ministry for mini UAVs with accessories, to be delivered within 12 months. The stock rose 4.19% to Rs 598.70 amid broader gains in the defence sector.",
            "Sentiment": "positive",
            "PublishDate": 1750661495000,
            "Source": "order&deals"
        },
        {
            "Title": "Ideaforge Tech Secures ₹137 Crore Order",
            "Summary": "Ideaforge Tech has received a new order valued at ₹137 crore. This order is expected to boost the company's annual revenue by approximately 80%.",
            "Sentiment": "positive",
            "PublishDate": 1750659361000,
            "Source": "default"
        },
        {
            "Title": "Ideaforge Technology: Electronic Warfare Resilience Crucial for Future Defense",
            "Summary": "Ankit Mehta, CEO of Ideaforge Technology, emphasizes the growing importance of electronic warfare resilience in defense technology. The company launched products with EW resilience in February. Mehta highlights challenges in India's procurement process and export barriers for defense items.",
            "Sentiment": "positive",
            "PublishDate": 1749626649000,
            "Source": "normal_news"
        },
        {
            "Title": "Ideaforge Technology: Shares Dip 3% After Recent Rally Amid India-Pakistan Tensions",
            "Summary": "Ideaforge Technology shares fell 3% to Rs 476.60 on BSE, following a 37% rally over three sessions due to India-Pakistan military escalation. The stock is in overbought territory with RSI at 74.1. Despite the pullback, brokerage Ashika Institutional Equity remains bullish on Indian defence stocks.",
            "Sentiment": "neutral",
            "PublishDate": 1747111565000,
            "Source": "normal_news"
        },
        {
            "Title": "Ideaforge Technology Ltd.: Defence Stock Hits Three-Month High Amid Sector Rally",
            "Summary": "Ideaforge Technology Ltd. shares rose nearly 8% to a three-month high, extending gains for the third consecutive session. The stock's surge is part of a broader rally in defence stocks following recent India-Pakistan tensions and subsequent ceasefire agreement. The company's shares have risen over 35% in the last three sessions, driven by expectations of increased defence spending.",
            "Sentiment": "positive",
            "PublishDate": 1747028865000,
            "Source": "normal_news"
        },
        {
            "Title": "Ideaforge Tech Reports Q4 Loss and Revenue Decline",
            "Summary": "Ideaforge Tech has reported a net loss of 204 million rupees in Q4, compared to a profit of 117.9 million rupees in the same quarter last year. The company's revenue also declined significantly to 237.7 million rupees from 1.05 billion rupees year-over-year. Sequentially, the loss widened from 206.7 million rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1746749063000,
            "Source": "default"
        },
        {
            "Title": "IdeaForge Tech Reports Q4 Net Loss and Revenue Decline",
            "Summary": "IdeaForge Technology has reported a net loss of 204 million rupees in Q4, compared to a profit of 117.9 million rupees in the same quarter last year. The loss has increased from 206.7 million rupees in the previous quarter. The company's revenue for Q4 stood at 237.7 million rupees, significantly lower than the 1.05 billion rupees reported in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1746723795000,
            "Source": "result"
        },
        {
            "Title": "IdeaForge Technology: Court Recalls Non-Bailable Warrant Against CFO",
            "Summary": "Chennai's Metropolitan Magistrates Court recalled the non-bailable warrant against IdeaForge Technology's CFO and accepted sureties from other executives. The court set the next hearing for April 24. The case involves charges related to criminal breach of trust, cheating, and computer-related offenses.",
            "Sentiment": "neutral",
            "PublishDate": 1743844282000,
            "Source": "corporate_governance"
        },
        {
            "Title": "IdeaForge to Invest 16 Crore Rupees in Vantage Robotics",
            "Summary": "IdeaForge Technology Limited has announced an investment of 16 crore rupees (approximately $1.9 million) in Vantage Robotics, a company specializing in robotics technology. This strategic investment likely aims to enhance IdeaForge's capabilities in the drone and robotics sector.",
            "Sentiment": "positive",
            "PublishDate": 1740032571000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ideaforge Technology: Q3 FY25 Reports ₹24.02Cr Loss, Revenue Plunges 80.63% YoY",
            "Summary": "Ideaforge Technology's Q3 FY25 results show a net loss of ₹24.02 crore, with revenue declining 80.63% year-on-year and 52.53% quarter-on-quarter. EPS dropped to ₹-5.56, down 261.16% YoY. Operating income fell 279.3% YoY. Despite challenges, one analyst maintains a strong buy rating.",
            "Sentiment": "negative",
            "PublishDate": 1738130503000,
            "Source": "earnings"
        },
        {
            "Title": "IdeaForge Technology Reports Increased Q3 Net Loss",
            "Summary": "IdeaForge Technology has reported a net loss of 207 million rupees for the third quarter, compared to a loss of 159 million rupees in the same period last year. This represents an increase in losses both year-over-year and quarter-over-quarter, with the previous quarter's loss at 122 million rupees. The company's revenue for Q3 significantly decreased to 185 million rupees from 916 million rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1738074986000,
            "Source": "earnings"
        },
        {
            "Title": "IdeaForge Technology Reports Strong Q2 Revenue Growth",
            "Summary": "IdeaForge Technology has reported a significant year-over-year increase in its second-quarter revenue. The company's revenue for Q2 reached 372 million rupees, compared to 237 million rupees in the same period last year, representing a substantial growth.",
            "Sentiment": "positive",
            "PublishDate": 1730128610000,
            "Source": "result"
        },
        {
            "Title": "IdeaForge Technology Reports Q2 Net Loss",
            "Summary": "IdeaForge Technology has reported a net loss of 122 million rupees in the second quarter, compared to a profit of 8.9 million rupees in the same period last year. However, the company showed a quarter-on-quarter improvement with a profit of 19 million rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1730128572000,
            "Source": "result"
        },
        {
            "Title": "Ideaforge Technology: Goldman Sachs Sells, Citigroup Buys in Major Share Transactions",
            "Summary": "<p><span class='positive'>Ideaforge Technology's stock rose 2.5%</span> as <b>Goldman Sachs</b> funds <span class='negative'>sold 6.49 lakh shares</span> and <b>Citigroup</b> <span class='positive'>bought 6.65 lakh shares</span> in bulk deals. The transactions occurred at average prices of ₹657.67 and ₹656 respectively, each valued at approximately ₹4.3-4.4 crore.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728622168000,
            "Source": "block_deals"
        }
    ]
}