{
    "Symbol": "IDEA",
    "ISIN": "INE669E01016",
    "News": [
        {
            "Title": "TRAI Imposes Rs 8 Lakh Penalty on Vodafone Idea",
            "Summary": "Vodafone Idea faces Rs 8,00,000 financial disincentive from TRAI for failing to meet Quality of Service parameters in July 2025. Company reviewing order and evaluating next steps.",
            "Sentiment": "negative",
            "PublishDate": 1770286439722,
            "Source": "stocks"
        },
        {
            "Title": "Govt Forms Team for Vi AGR Assessment by March 2026",
            "Summary": "Government establishes two-member committee to resolve Vodafone Idea's AGR dispute with March 31, 2026 deadline for completion of assessment process.",
            "Sentiment": "neutral",
            "PublishDate": 1770273840211,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea Faces Rs 6 Lakh TRAI Penalty",
            "Summary": "TRAI imposes Rs 6,00,000 financial disincentive on Vodafone Idea for failing to meet Quality of Service parameters in June 2025. Company reviewing order and evaluating next steps.",
            "Sentiment": "negative",
            "PublishDate": 1770217850784,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea Sees Rs. 45.98 Crore Block Trade",
            "Summary": "Vodafone Idea Ltd. recorded a significant block trade worth Rs. 45.98 crores on NSE involving 42,031,333 shares at Rs. 10.94 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770094951309,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vodafone Idea Gets Credit Rating Outlook Upgrade",
            "Summary": "CARE Ratings revises Vodafone Idea's long-term bank facilities outlook from Stable to Positive while maintaining CARE BBB- rating, signaling improved credit profile.",
            "Sentiment": "positive",
            "PublishDate": 1769753531086,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea Block Trade Worth Rs. 19.70 Crores",
            "Summary": "Vodafone Idea executed a significant NSE block trade involving 17,891,636 shares at Rs. 11.01 per share, totaling Rs. 19.70 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1769749072457,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vodafone Idea Q3FY26 Loss Narrows to ₹5,286 Cr",
            "Summary": "Vodafone Idea reported Q3FY26 loss of ₹5,286 Cr vs ₹6,609 Cr YoY. Revenue grew 1.9% to ₹11,323 Cr. ARPU increased 7.3% to ₹186. AGR dues frozen at ₹87,695 Cr with reassessment underway.",
            "Sentiment": "positive",
            "PublishDate": 1769532451712,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vodafone Idea AGR Dues Frozen at ₹876.95 Billion",
            "Summary": "Department of Telecom confirms Vodafone Idea's AGR dues frozen at ₹876.95 billion as of December 31, with amount subject to reassessment per January 7, 2026 letter.",
            "Sentiment": "neutral",
            "PublishDate": 1769529892932,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea Files Q3FY26 Monitoring Agency Report",
            "Summary": "Vodafone Idea submitted its quarterly monitoring agency report for Q3FY26, showing Rs. 1,227.43 crore utilization from FPO proceeds for network expansion with Rs. 1,488.33 crore remaining unutilized.",
            "Sentiment": "neutral",
            "PublishDate": 1769526362570,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea Q3 Preview: Losses to Widen Further",
            "Summary": "Brokerages expect Vodafone Idea's Q3 losses to widen to Rs 6,700-7,000 crore despite marginal revenue growth of 1% YoY, as subscriber churn continues to offset ARPU improvements.",
            "Sentiment": "negative",
            "PublishDate": 1769491801922,
            "Source": "co_actions_results"
        },
        {
            "Title": "TRAI Imposes Rs 6 Lakh Fine on Vodafone Idea",
            "Summary": "Telecom Regulatory Authority of India levies financial disincentive of Rs 6,00,000 on Vodafone Idea for failing to meet quality of service benchmarks in April 2025 across different service areas.",
            "Sentiment": "negative",
            "PublishDate": 1769176677428,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea shares decline 2.06% to ₹9.97",
            "Summary": "Vodafone Idea stock fell 2.06% to ₹9.97 in Friday's session. The telecom company reported Q2 FY26 revenue of ₹11,194.70 crores with net loss narrowing to ₹5,524.20 crores from previous quarters.",
            "Sentiment": "negative",
            "PublishDate": 1769158494813,
            "Source": "stocks"
        },
        {
            "Title": "Govt Denies AGR Relief for Telcos Without Court Order",
            "Summary": "Government clarifies that telecom operators cannot receive Adjusted Gross Revenue (AGR) relief similar to Vodafone Idea without explicit court orders, setting clear regulatory boundaries.",
            "Sentiment": "neutral",
            "PublishDate": 1769152626524,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea Board Meet Set for Jan 27 Q3 Results",
            "Summary": "Vodafone Idea Limited has scheduled its Board of Directors meeting for January 27, 2026, to consider and approve Q3FY26 standalone and consolidated unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769007585061,
            "Source": "co_actions_results"
        },
        {
            "Title": "DoT to Reassess Vodafone Idea's 11-Year AGR Records",
            "Summary": "Department of Telecommunications announces comprehensive reassessment of Vodafone Idea's Adjusted Gross Revenue calculations spanning the last 11 years, with the review process expected to take up to six months.",
            "Sentiment": "neutral",
            "PublishDate": 1768209868282,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea Gets AGR Relief But Challenges Persist",
            "Summary": "DoT grants Vodafone Idea 4-year AGR dues deferment worth ₹4,390 crore, providing breathing room but not eliminating underlying debt burden of ₹2.2 trillion and need for ₹250 billion capital raise.",
            "Sentiment": "neutral",
            "PublishDate": 1768209400654,
            "Source": "stocks"
        },
        {
            "Title": "Motilal Oswal Maintains Neutral on Vodafone Idea",
            "Summary": "Motilal Oswal reiterates neutral rating on Vodafone Idea with ₹11 target price despite government relief measures reducing AGR dues NPV by ~73% to ₹240 billion, citing ongoing challenges with spectrum liabilities.",
            "Sentiment": "neutral",
            "PublishDate": 1768205173409,
            "Source": "stocks"
        },
        {
            "Title": "CITI Sets ₹15 Target for Vodafone Idea with Buy Rating",
            "Summary": "Citigroup maintains a buy recommendation on Vodafone Idea Limited with a target price of ₹15 per share, indicating positive analyst sentiment for the telecom operator.",
            "Sentiment": "positive",
            "PublishDate": 1768189901857,
            "Source": "stocks"
        },
        {
            "Title": "Citi Maintains Buy Rating on Vodafone Idea Post AGR Relief",
            "Summary": "Citi maintains buy rating with ₹15.00 target price for Vodafone Idea after company confirms AGR relief from DoT, potentially improving cash flow and enabling ₹25,000 crore debt raise plans.",
            "Sentiment": "positive",
            "PublishDate": 1768188905913,
            "Source": "stocks"
        },
        {
            "Title": "Banks to reassess Vi funding after AGR relief package",
            "Summary": "Banks led by SBI will review fresh funding for Vodafone Idea following government's AGR relief package that freezes ₹87,695 crore dues and allows 16-year repayment schedule until 2041.",
            "Sentiment": "positive",
            "PublishDate": 1768180266051,
            "Source": "stocks"
        },
        {
            "Title": "Banks weigh ₹25,000 cr loan for Vodafone Idea",
            "Summary": "SBI leads with ₹6,279.80 cr exposure as banks await DoT committee decision on fresh lending to telecom operator. Recent AGR relief provides comfort to lenders.",
            "Sentiment": "neutral",
            "PublishDate": 1767958362251,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea Eyes Debt Raise After AGR Relief",
            "Summary": "Vodafone Idea considers raising debt from local and global lenders following government relief on AGR dues, while spectrum-linked obligations remain. Analysts estimate ₹30,000-40,000 crore fundraising need.",
            "Sentiment": "neutral",
            "PublishDate": 1767949374085,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea Considers Debt Financing for Growth",
            "Summary": "Vodafone Idea is reportedly exploring debt financing options through local and global banks to support its growth initiatives, according to Bloomberg reports.",
            "Sentiment": "neutral",
            "PublishDate": 1767947668723,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea Gets Relief But Cash Flow Issues Remain",
            "Summary": "Government relief provides 10-year AGR moratorium saving ₹100 cr annually, but Vodafone Idea still faces ₹15,000 cr spectrum dues against ₹10,000 cr EBITDA. Analyst maintains ₹10 target price.",
            "Sentiment": "neutral",
            "PublishDate": 1767946255130,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea May Begin Fresh Loan Process Soon",
            "Summary": "Vodafone Idea is reportedly set to initiate the process of considering fresh loans immediately, according to CNBC TV 18 reports, as the telecom operator explores funding options.",
            "Sentiment": "neutral",
            "PublishDate": 1767944543099,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea Gets Banking Relief on AGR Comfort",
            "Summary": "Banking sources indicate that recent AGR relief measures are providing comfort to banks, potentially opening doors for fresh credit lines to Vodafone Idea amid ongoing financial restructuring efforts.",
            "Sentiment": "positive",
            "PublishDate": 1767944521439,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea faces ₹25,000 cr spectrum debt burden",
            "Summary": "IIFL analyst highlights Vodafone Idea's spectrum liabilities of ₹25,000-26,000 crore annually from FY29, overshadowing AGR relief. Fresh equity investment may be needed for debt conversion.",
            "Sentiment": "negative",
            "PublishDate": 1767942896621,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea Shares Jump 9% on AGR Relief Package",
            "Summary": "Vodafone Idea shares surged 9% to ₹12.51 following AGR relief that freezes ₹87,695 crore dues and caps annual payments at ₹124 crore through FY31, providing significant financial breathing room.",
            "Sentiment": "positive",
            "PublishDate": 1767940467833,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea: Experts Split on Investment Outlook",
            "Summary": "Technical and fundamental analysts offer mixed views on Vodafone Idea following AGR relief confirmation. Stock consolidating around ₹12 after doubling from ₹6 base since September.",
            "Sentiment": "neutral",
            "PublishDate": 1767939708111,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea Shares Surge 8% on AGR Relief News",
            "Summary": "Vodafone Idea shares jumped over 8% to hit ₹12.52 after the Department of Telecommunications granted significant relief in the long-pending AGR case, providing much-needed respite to the telecom operator.",
            "Sentiment": "positive",
            "PublishDate": 1767939249347,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea Shares Jump 4% on AGR Relief News",
            "Summary": "Vodafone Idea stock surged after confirming receipt of government communication on AGR dues relief, featuring a staggered payment structure extending to 2041 with frozen total liability.",
            "Sentiment": "positive",
            "PublishDate": 1767939144324,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea Gets AGR Relief, Faces Rs 40K Cr Challenge",
            "Summary": "Vodafone Idea receives AGR dues relief with capped payments of Rs 124 cr annually for six years, but analyst warns company still needs Rs 30,000-40,000 cr fundraising for spectrum dues.",
            "Sentiment": "neutral",
            "PublishDate": 1767938810472,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea shares surge 8% on AGR relief news",
            "Summary": "Vodafone Idea shares jumped up to 8% after DoT eased AGR payment schedule, capping annual payments at ₹124 crore for six years starting March 2026, providing significant cash flow relief to the telecom operator.",
            "Sentiment": "positive",
            "PublishDate": 1767938651984,
            "Source": "stocks"
        },
        {
            "Title": "Vi Gets AGR Relief: Max ₹124 Cr Annual Payment",
            "Summary": "Vodafone Idea confirms DoT relief on AGR dues with frozen liabilities for FY2007-19, staggered payments from March 2026, and maximum annual payment of ₹124 crores for 6 years.",
            "Sentiment": "positive",
            "PublishDate": 1767938628480,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea shares surge 9% on AGR dues relief",
            "Summary": "Vodafone Idea shares jumped 8.70% to ₹12.51 after DoT provided relief timeline for AGR dues repayment. The telecom company received communication offering respite in the adjusted gross revenue matter.",
            "Sentiment": "positive",
            "PublishDate": 1767938599887,
            "Source": "stocks"
        },
        {
            "Title": "DoT freezes Vodafone Idea's ₹87,695 cr AGR dues",
            "Summary": "Department of Telecommunications freezes Vodafone Idea's AGR dues till FY19, allowing structured payments of ₹744 cr annually from March 2026-2031. Shares surge 7.8% following the relief announcement.",
            "Sentiment": "positive",
            "PublishDate": 1767938517649,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vodafone Idea shares surge 8% on AGR relief plan",
            "Summary": "Vodafone Idea shares jumped 7.8% to ₹12.40 after the company unveiled a structured 15-year repayment plan for AGR dues totaling ₹124 crore annually for initial six years, providing significant cash flow relief.",
            "Sentiment": "positive",
            "PublishDate": 1767938348361,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea shares jump 8% on AGR dues clarity",
            "Summary": "Vodafone Idea shares surged over 8% after the company disclosed its ₹87,695 crore AGR dues repayment timeline spanning 16 years from March 2026 to March 2041.",
            "Sentiment": "positive",
            "PublishDate": 1767938295002,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea Gets Relief: AGR Dues Frozen, Promoter Support",
            "Summary": "Vodafone Idea receives government relief on ₹87,695 crore AGR dues with 5-year moratorium and ₹5,836 crore promoter funding. Stock gains 76% in one year despite ongoing losses and debt challenges.",
            "Sentiment": "neutral",
            "PublishDate": 1767935947907,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea Gets AGR Relief With Payment Till 2041",
            "Summary": "Vodafone Idea receives DoT relief on AGR dues with frozen liability and staggered payment structure extending to 2041. Company to pay maximum ₹124 crore annually from 2026-2031.",
            "Sentiment": "positive",
            "PublishDate": 1767933971522,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea Sets AGR Payment Schedule Till 2041",
            "Summary": "Vodafone Idea announces structured AGR payment plan with equal yearly installments spanning 15 years from March 2026 to March 2041, providing clarity on debt resolution timeline.",
            "Sentiment": "neutral",
            "PublishDate": 1767928724873,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea Announces Structured Payment Plan",
            "Summary": "Vodafone Idea outlines payment schedule of ₹124 crore annually until March 2031, followed by ₹100 crore yearly from March 2032 to March 2035.",
            "Sentiment": "neutral",
            "PublishDate": 1767928703173,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea Gets AGR Payment Relief Until 2025",
            "Summary": "Vodafone Idea receives significant relief from DOT with AGR dues frozen until December 31, 2025, and payment restructured over 16 years, providing crucial breathing room for the telecom operator.",
            "Sentiment": "positive",
            "PublishDate": 1767928439487,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea Gets AGR Relief from DoT",
            "Summary": "Vodafone Idea receives significant relief from Department of Telecommunication on AGR dues with structured payment plan spanning 2026-2041 and reassessment committee formation.",
            "Sentiment": "positive",
            "PublishDate": 1767928233161,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea Loses 1.01M Subscribers in November",
            "Summary": "Vodafone Idea reported a significant decline of 1.01 million mobile subscribers in November, highlighting ongoing challenges in subscriber retention for the telecom operator.",
            "Sentiment": "negative",
            "PublishDate": 1767597498971,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea Sees ₹16.60 Cr NSE Block Trade",
            "Summary": "Vodafone Idea Limited witnessed a significant block trade on NSE involving 13,819,145 shares worth ₹16.60 crores at ₹12.01 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767589409474,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vi promoters set aside ₹3,529 cr shares for legacy dues",
            "Summary": "Vodafone Idea promoters earmark 3.28 billion equity shares worth ₹3,529 crore to settle legacy liabilities from 2017 merger, part of revised ₹5,836 crore recovery structure.",
            "Sentiment": "positive",
            "PublishDate": 1767408098618,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vodafone Idea Shares Rise 1.64% Despite Analyst Caution",
            "Summary": "Vodafone Idea shares gained 1.64% to ₹11.79 amid recovery from recent selloffs. Government approved relief package freezing ₹87,695 crore AGR dues with five-year moratorium, though analysts maintain cautious outlook citing high leverage.",
            "Sentiment": "neutral",
            "PublishDate": 1767349881215,
            "Source": "stocks"
        },
        {
            "Title": "Vodafone Idea Sees ₹21.67 Cr NSE Block Trade",
            "Summary": "Vodafone Idea Limited witnessed a significant block trade on NSE worth ₹21.67 crores involving 18,350,192 shares at ₹11.81 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767326025263,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vodafone Idea faces ₹638 crore GST penalty order",
            "Summary": "Vi receives ₹637.91 crore GST penalty for alleged tax short payment and excess input tax credit claims. Company disagrees with order and plans legal action against the penalty.",
            "Sentiment": "negative",
            "PublishDate": 1767267860351,
            "Source": "stocks"
        }
    ]
}