{
    "Symbol": "IDFCFIRSTB",
    "ISIN": "INE092T01019",
    "News": [
        {
            "Title": "IDFC FIRST Bank Gets RBI Nod for ICICI Prudential Stake",
            "Summary": "RBI approves ICICI Prudential Asset Management Company Limited to acquire up to 9.95% shareholding in IDFC FIRST Bank Limited, subject to regulatory conditions and compliance requirements.",
            "Sentiment": "positive",
            "PublishDate": 1770818757551,
            "Source": "co_actions_results"
        },
        {
            "Title": "IDFC First Bank Raises Q4 FY26 Margin Forecast to 5.85%",
            "Summary": "IDFC First Bank increases Q4 FY26 margin forecast to 5.85% due to lower savings account rates and anticipates Q4 FY26 credit costs near full-year estimate of 2.10% with expected improvement next year.",
            "Sentiment": "positive",
            "PublishDate": 1770003369025,
            "Source": "stocks"
        },
        {
            "Title": "IDFC FIRST Bank Re-appoints Independent Director",
            "Summary": "IDFC FIRST Bank's Board approves re-appointment of Mr. S Ganesh Kumar as Independent Director for second three-year term from April 30, 2026 to April 29, 2029, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1769876418346,
            "Source": "stocks"
        },
        {
            "Title": "IDFC First Bank Q3 Net Profit Surges 48% YoY",
            "Summary": "IDFC First Bank reported strong Q3 performance with net profit rising to ₹5.02 billion from ₹3.39 billion in the previous year, marking significant growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1769868068805,
            "Source": "co_actions_results"
        },
        {
            "Title": "IDFC FIRST Bank schedules multiple investor meets",
            "Summary": "IDFC FIRST Bank announces participation in seven major investor conferences from February 3-24, 2026, including Goldman Sachs Asia Financials Corporate Day and IIFL's Enterprising India Conference.",
            "Sentiment": "neutral",
            "PublishDate": 1769605719331,
            "Source": "stocks"
        },
        {
            "Title": "IDFC First Bank Q3FY26 Earnings Call on Jan 31",
            "Summary": "IDFC First Bank announces earnings call scheduled for January 31, 2026 at 5:30 PM IST to discuss Q3FY26 financial results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1769166128596,
            "Source": "co_actions_results"
        },
        {
            "Title": "IDFC First Bank Gets Buy Rating with 22% Upside Target",
            "Summary": "Nomura recommends Buy rating on IDFC First Bank with ₹105 target price, citing strong growth visibility and improving profitability. Bank reported 64.10% net profit growth in Q2 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1767949252071,
            "Source": "stocks"
        },
        {
            "Title": "IDFC First Bank cuts savings rates by up to 200 bps",
            "Summary": "IDFC First Bank reduces interest rates on savings accounts by up to 200 basis points across select slabs, with the ₹1-10 lakh bracket now earning 5% instead of 7%, effective January 9.",
            "Sentiment": "negative",
            "PublishDate": 1767936186731,
            "Source": "stocks"
        },
        {
            "Title": "JPMorgan Sets ₹104 Target for IDFC First Bank",
            "Summary": "JPMorgan maintains Overweight rating on IDFC First Bank with target price of ₹104, indicating positive outlook on the banking stock's performance prospects.",
            "Sentiment": "positive",
            "PublishDate": 1767931092765,
            "Source": "stocks"
        },
        {
            "Title": "Investec Sets Buy Rating on IDFC First Bank",
            "Summary": "Investec Securities has issued a Buy rating for IDFC First Bank with a target price of ₹98.00, indicating positive outlook on the banking stock's performance potential.",
            "Sentiment": "positive",
            "PublishDate": 1767931069719,
            "Source": "stocks"
        },
        {
            "Title": "IDFC First Bank cuts savings rates by 50 bps to 6.5%",
            "Summary": "IDFC First Bank reduces headline savings rate from 7% to 6.5% effective January 9, 2025, while restructuring balance slabs to impact depositors with mid-sized balances most significantly.",
            "Sentiment": "neutral",
            "PublishDate": 1767849045274,
            "Source": "stocks"
        },
        {
            "Title": "Nomura Initiates Buy Rating on IDFC First Bank",
            "Summary": "Nomura initiates coverage on IDFC First Bank with Buy rating and ₹105 target price, citing operating leverage inflection and strong earnings momentum as bank transitions to sustained profitability.",
            "Sentiment": "positive",
            "PublishDate": 1767755885639,
            "Source": "stocks"
        },
        {
            "Title": "IDFC FIRST Bank Launches Zero-Forex Diamond Reserve Card",
            "Summary": "IDFC FIRST Bank introduces Zero-Forex Diamond Reserve Credit Card with zero foreign exchange markup, travel rewards, airport lounge access, and comprehensive travel insurance at ₹3,000 annual fee.",
            "Sentiment": "positive",
            "PublishDate": 1767689969381,
            "Source": "stocks"
        },
        {
            "Title": "IDFC FIRST Bank Launches Premium 'Gaj' Metal Card",
            "Summary": "IDFC FIRST Bank introduces invitation-only 'Gaj' metal credit card for select private banking customers with ₹12,500 annual fee, zero forex markup, and premium travel benefits.",
            "Sentiment": "positive",
            "PublishDate": 1766993632092,
            "Source": "stocks"
        },
        {
            "Title": "IDFC First Bank Board Meet Set for Jan 31, 2026",
            "Summary": "IDFC First Bank announces board meeting on January 31, 2026, to approve Q3 FY26 financial results for quarter and nine months ended December 31, 2025. Trading window closed from January 1-February 2, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766748131730,
            "Source": "co_actions_results"
        },
        {
            "Title": "IDFC First Bank cuts credit card rewards significantly",
            "Summary": "IDFC First Bank reduces reward rates on premium cards like Mayura and Ashva from 10x to 5x on international spends, cuts lifetime-free card rewards by 25%, and introduces new fees on FASTag and railway transactions.",
            "Sentiment": "negative",
            "PublishDate": 1766589700634,
            "Source": "stocks"
        },
        {
            "Title": "IDFC First Bank Allots 7.96 Lakh Shares Under ESOS",
            "Summary": "IDFC First Bank allotted 7,96,222 equity shares to employees under its Employee Stock Option Scheme on December 22, 2025. Post-allotment, the bank's paid-up share capital increased to ₹8,59,56,88,833.",
            "Sentiment": "neutral",
            "PublishDate": 1766396321160,
            "Source": "co_actions_results"
        },
        {
            "Title": "India Ratings Affirms IDFC FIRST Bank's Debt Instruments at IND AA/Stable Rating",
            "Summary": "India Ratings reaffirmed IDFC FIRST Bank's debt instruments worth ₹17,928 crores at IND AA/Stable rating, covering Basel III Tier 2 Bonds, Infrastructure Bonds and Non-Convertible Debt Instruments. The affirmation reflects the bank's continued franchise expansion, experienced management, stable liability franchise, diversified product portfolio and improved capital buffers, though constrained by higher operating expenditure and credit costs impacting internal accruals.",
            "Sentiment": "neutral",
            "PublishDate": 1765349179348,
            "Source": "stock"
        },
        {
            "Title": "IDFC FIRST Bank Allots 12.29 Lakh Equity Shares Under Employee Stock Option Scheme",
            "Summary": "IDFC FIRST Bank's Board Committee approved allotment of 12,29,793 equity shares of ₹10 face value each to eligible employees upon exercise of stock options under the bank's ESOS. The bank's issued and paid-up equity share capital increased from ₹85,93,09,13,750 to ₹85,94,32,11,680, comprising 8,59,43,21,168 equity shares of ₹10 each fully paid-up.",
            "Sentiment": "neutral",
            "PublishDate": 1764833943163,
            "Source": "corporate_action"
        },
        {
            "Title": "IDFC FIRST Bank Grants 8.2 Lakh Stock Options to New Employees",
            "Summary": "IDFC FIRST Bank's Nomination Remuneration Committee approved the grant of 8,20,000 stock options to eligible new employees under the Employee Stock Option Scheme as part of their job offers to incentivize and attract talent. The options will vest equally over four years at 25% each year with a 3-year exercise period from respective vesting dates.",
            "Sentiment": "positive",
            "PublishDate": 1763705590090,
            "Source": "corporate_action"
        },
        {
            "Title": "IDFC First Bank Seeks Shareholder Approval for Currant Sea Nominee Director Appointment",
            "Summary": "IDFC First Bank has issued a postal ballot notice seeking member approval for appointing Narendra Ostawal as Non-Executive Non-Independent Director, representing investor Currant Sea Investments B.V. The e-voting period runs from November 21 to December 20, 2025, with results to be announced by December 23, 2025, following the bank's investment agreement and RBI approval.",
            "Sentiment": "neutral",
            "PublishDate": 1763644182267,
            "Source": "corporate_action"
        },
        {
            "Title": "IDFC FIRST Bank Converts ₹2,623 Crore CCPS to Equity Shares for Platinum Invictus",
            "Summary": "IDFC FIRST Bank's Board approved the conversion of 43,71,85,666 compulsorily convertible cumulative preference shares (CCPS) held by Platinum Invictus B 2025 RSC Limited into an equivalent number of equity shares with face value of ₹10 each. The conversion was triggered after the bank's 45-day average share price reached ₹60 on NSE. The CCPS were originally allotted at ₹60 per share, totaling ₹2,623 crore. The bank also approved dividend payment of ₹39.67 crore at 8% rate on the CCPS for the period from allotment to conversion. Post-conversion, Platinum Invictus holds 5.09% equity stake in the bank. The bank's paid-up equity capital increased to ₹8,589.14 crore, divided into 8,58,91,42,349 equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1761575417815,
            "Source": "corporate_action"
        },
        {
            "Title": "IDFC FIRST Bank Reports 76% YoY Profit Growth in Q2 FY26, Microfinance Issues Behind",
            "Summary": "IDFC FIRST Bank reported a profit after tax of INR 352 crores for Q2 FY26, marking a 76% year-on-year growth driven by core income growth and reduced provisioning. Total customer deposits grew 23.4% YoY to INR 2.69 lakh crores, while loans and advances increased 19.7% to INR 2.67 lakh crores. The bank's gross NPA improved to 1.86% from 1.97% in the previous quarter, with net NPA at 0.52%. Net interest margin declined 12 basis points sequentially to 5.59% due to repo rate changes and asset mix shifts, including a decline in microfinance business from INR 8,300 crores to INR 7,300 crores. Credit cards crossed 4 million issuances with the book reaching INR 8,600 crores. Management indicated that microfinance issues are largely resolved and expects margins to improve in Q3 and Q4, targeting above 5.8% by Q4. The bank opened 25 new branches, bringing the total to 1,041 branches, and maintained a capital adequacy ratio of 14.34%.",
            "Sentiment": "positive",
            "PublishDate": 1761220614835,
            "Source": "earnings"
        },
        {
            "Title": "IDFC First Bank Shares Rise 3% on 75% Profit Surge in Q2",
            "Summary": "IDFC First Bank shares rallied 3.3% to Rs 74.27 after reporting a 75.5% year-on-year increase in standalone net profit to Rs 352.31 crore for Q2 FY26, compared to Rs 200.69 crore in the previous year. Net interest income grew 6.8% to Rs 5,112.57 crore, though net interest margin declined 59 basis points to 5.59%. The bank's total customer business expanded 21.6% to Rs 5,35,673 crore, with loans growing 19.7% and deposits rising 23.4%. Asset quality remained stable with gross NPA at 1.86% and net NPA at 0.52%. CASA deposits increased 26.8% with the ratio improving to 50.07%. MD and CEO V Vaidyanathan noted that MFI business stress appears resolved and operating leverage is improving. Motilal Oswal maintained a 'Neutral' rating with a target price of Rs 280, projecting 20% loan growth CAGR over FY25-28.",
            "Sentiment": "positive",
            "PublishDate": 1760938448614,
            "Source": "earnings"
        },
        {
            "Title": "IDFC First Bank Reports 75% Jump in Quarterly Net Profit to 3.5 Billion Rupees",
            "Summary": "IDFC First Bank reported a net profit of 3.5 billion rupees for the quarter, representing a 75% increase from 2 billion rupees in the same period last year. The bank's revenue grew to 99.4 billion rupees compared to 89 billion rupees year-over-year, marking an 11.7% increase.",
            "Sentiment": "positive",
            "PublishDate": 1760794966527,
            "Source": "earnings"
        },
        {
            "Title": "IDFC FIRST Bank Reports ₹352 Crore Net Profit for Q2 FY26, Issues ₹7,499 Crore in Preference Shares",
            "Summary": "IDFC FIRST Bank Limited announced quarterly results for the period ended September 30, 2025. The bank reported a net profit of ₹352.31 crore for the quarter, compared to ₹462.57 crore in the previous quarter. Interest earned increased to ₹9,937 crore from ₹9,642 crore in the prior quarter. The bank's total income stood at ₹11,828 crore for the quarter. Net NPAs decreased to 0.52% from 0.55% in the previous quarter, while gross NPAs improved to 1.86% from 1.97%. The bank completed a significant capital raise through the allotment of Compulsorily Convertible Cumulative Preference Shares worth ₹4,876.17 crore to Currant Sea Investments and ₹2,623.11 crore to Platinum Invictus. Additionally, 81.27 crore CCPS held by Currant Sea were converted to equity shares. The bank's capital adequacy ratio stood at 14.11%. Total advances grew to ₹2,57,101 crore while deposits increased to ₹2,76,771 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1760787098548,
            "Source": "earnings"
        },
        {
            "Title": "Currant Sea Investments Acquires 9.97% Stake in IDFC FIRST Bank Through Share Conversion",
            "Summary": "Currant Sea Investments B.V. acquired 81,26,94,722 equity shares in IDFC FIRST Bank Limited, representing 9.97% of total share capital and 9.46% of diluted share capital. The acquisition occurred through preferential allotment via conversion of compulsorily convertible cumulative preference shares on October 8, 2025. This conversion was executed under an investment agreement dated April 17, 2025. Following the acquisition, IDFC FIRST Bank's equity share capital increased from INR 73,39,26,19,610 to INR 81,51,95,66,830, with the total number of equity shares rising from 7,33,92,61,961 to 8,15,19,56,683. The acquirer does not belong to the promoter group and had zero shareholding before this transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1760096748412,
            "Source": "corporate_action"
        },
        {
            "Title": "IDFC First Bank Allots 81.27 Crore Shares to Currant Sea Investments, Raises ₹4,876 Crore",
            "Summary": "IDFC First Bank has approved the allotment of 81.27 crore equity shares to Currant Sea Investments B.V. following the conversion of Compulsorily Convertible Preference Shares (CCPS). The transaction raised approximately ₹4,876 crore for the bank. Following this allotment, Currant Sea Investments B.V. now holds a 9.97% equity stake in IDFC First Bank.",
            "Sentiment": "positive",
            "PublishDate": 1759901550786,
            "Source": "corporate_action"
        },
        {
            "Title": "IDFC First Bank Schedules Second Quarter Earnings Review for October 18th",
            "Summary": "IDFC First Bank has announced plans to review its second quarter earnings on October 18th. The bank will be presenting its quarterly financial results on the scheduled date.",
            "Sentiment": "neutral",
            "PublishDate": 1758884002134,
            "Source": "earnings"
        },
        {
            "Title": "IDFC Bank Switches Airport Lounge Access Provider from DreamFolks to Elite Assist",
            "Summary": "IDFC Bank has transferred its domestic airport lounge access program for debit cardholders from DreamFolks to Elite Assist, a subsidiary of Travel Food Services Limited (TFSL). The change became effective September 15 following TFSL's termination of its arrangement with DreamFolks. Complimentary visit allowances remain unchanged across all card tiers: FIRST Private offers 4+4 visits per quarter, FIRST Wealth provides 3+3 visits, FIRST Select gives 2+2 visits, Visa Signature allows 2 visits, and both Visa Platinum and Mastercard World provide 1 visit each. Cardholders continue accessing lounges by swiping their IDFC Bank debit cards at participating domestic airport lounges. DreamFolks confirmed that while domestic airport lounge access has been discontinued, its global lounge business and other domestic services remain operational.",
            "Sentiment": "neutral",
            "PublishDate": 1758274773863,
            "Source": "stock"
        },
        {
            "Title": "IDFC FIRST Bank Gets RBI Approval for Currant Sea Investments Director Appointment Right",
            "Summary": "IDFC FIRST Bank received acknowledgment from the Reserve Bank of India regarding Currant Sea Investments B.V.'s right to appoint one non-executive director on the bank's Board of Directors. The RBI took on record the Amendment Agreement dated July 3, 2025 to the Investment Agreement dated April 17, 2025, entered into by the bank with Currant Sea Investments B.V., an affiliate of Warburg Pincus. The appointed director will be liable to retire by rotation on the Board of Directors of the bank.",
            "Sentiment": "positive",
            "PublishDate": 1758270779165,
            "Source": "corporate_governance"
        },
        {
            "Title": "IDFC FIRST Bank Raises ₹2,623 Crore Through Preferential Share Allotment",
            "Summary": "IDFC FIRST Bank's Board Committee approved the preferential allotment of 43.72 crore compulsorily convertible cumulative preference shares (CCPS) to Platinum Invictus B 2025 RSC Limited. The shares have a face value of ₹10 each and were issued at ₹60 per share, raising a total of ₹2,623 crore. The bank received in-principle approvals from BSE and NSE in May 2025 for this preferential issue through private placement.",
            "Sentiment": "positive",
            "PublishDate": 1755599341980,
            "Source": "corporate_action"
        },
        {
            "Title": "IDFC First Bank Receives RBI Approval for Rs 2,624 Crore Investment from Platinum Invictus",
            "Summary": "IDFC First Bank announced that Platinum Invictus B 2025 RSC Limited has received RBI approval to invest up to 9.99% of the bank's paid-up share capital. The Rs 2,624 crore investment will represent approximately 5.09% of the bank's post-issue paid-up share capital through a preferential issue approved by shareholders on May 17, 2025. The bank also launched 'RemitFIRST2India,' a digital remittance platform for NRIs developed with Singapore-based SingX, currently supporting transfers from Singapore and Hong Kong. Analysts maintain a 'Buy' rating with an average target price of Rs 75, representing 9% upside potential. The stock has declined 11% over the past month and 21% over two years, with current market capitalization at Rs 50,643 crore.",
            "Sentiment": "positive",
            "PublishDate": 1754880896395,
            "Source": "stock"
        },
        {
            "Title": "IDFC First Bank Receives RBI Approval for ₹2,624 Crore Investment from Platinum Invictus",
            "Summary": "IDFC First Bank announced that Platinum Invictus B 2025 RSC Limited has received Reserve Bank of India approval to invest up to 9.99% of the bank's paid-up share capital. The proposed investment amounts to ₹2,624 crore, representing approximately 5.09% of the bank's post-issue paid-up share capital through a preferential issue approved by shareholders on May 17, 2025. Additionally, IDFC First Bank launched 'RemitFIRST2India', a digital platform for Non-Resident Indians to send money to India from Singapore and Hong Kong. The platform, developed with Singapore-based SingX, offers real-time transaction tracking, competitive forex rates, and paperless transfers through the bank's mobile app or web portal.",
            "Sentiment": "positive",
            "PublishDate": 1754717084762,
            "Source": "stock"
        },
        {
            "Title": "IDFC FIRST Bank Receives RBI Approval for ₹2,624 Crore Investment from Platinum Invictus",
            "Summary": "IDFC FIRST Bank announced that Platinum Invictus B 2025 RSC Limited has received Reserve Bank of India approval to invest up to 9.99% in the bank's paid-up share capital. Platinum Invictus plans to invest approximately ₹2,624 crores, representing about 5.09% of the bank's post-issue paid-up share capital. This investment is part of a preferential issue that was approved by the bank's shareholders on May 17, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754674382083,
            "Source": "corporate_action"
        },
        {
            "Title": "IDFC FIRST Bank Launches Digital Remittance Platform for NRIs",
            "Summary": "IDFC FIRST Bank launched 'RemitFIRST2India', a digital platform enabling Non-Resident Indians to send money to India from Singapore and Hong Kong, with expansion to other countries planned. Developed with Singapore-based SingX, the platform offers real-time transaction tracking, competitive forex rates, and paperless transfers without processing or platform fees. Existing bank customers can use the service through the mobile app, while non-customers can onboard digitally via the website. The platform allows transfers to any Indian bank account with guaranteed forex rates and no hidden markups. Ashish Singh, Head of Retail Liabilities, emphasized the platform's intuitive and secure design for both existing and new customers. SingX CEO Atul Garg highlighted increasing remittance demand from NRIs for family support and Indian market investments.",
            "Sentiment": "positive",
            "PublishDate": 1754392683402,
            "Source": "stock"
        },
        {
            "Title": "IDFC First Bank Raises Rs 4,876 Crore from Warburg Pincus Affiliate Through Preference Share Allotment",
            "Summary": "IDFC First Bank's board approved the preferential allotment of over 81.26 crore convertible cumulative preference shares valued at Rs 4,876 crore to Currant Sea Investments B.V., an affiliate of Warburg Pincus. The allotment represents a 10% stake in the private lender and will fund the bank's next phase of growth. The bank had received in-principle approvals from BSE and NSE in May. IDFC First Bank's shares traded 1.6% lower at Rs 67.64 on BSE amid broader market weakness. The bank reported a 32% year-on-year decline in profit after tax to Rs 463 crore in Q1 FY26, while net interest income grew 5.1% to Rs 4,933 crore. Net Interest Margin on AUM dropped 24 basis points quarter-on-quarter to 5.71% due to repo rate changes, asset mix shifts including a decline in microfinance, and lower investment yields. Operating profit fell 6.2% year-on-year to Rs 1,744 crore but increased 7.8% sequentially.",
            "Sentiment": "neutral",
            "PublishDate": 1754038405047,
            "Source": "stock"
        },
        {
            "Title": "IDFC FIRST Bank Raises ₹4,876 Crore Through Preferential Share Allotment",
            "Summary": "IDFC FIRST Bank's Board Committee approved the preferential allotment of 81.27 crore compulsorily convertible cumulative preference shares (CCPS) to Currant Sea Investments B.V. The shares are priced at ₹60 each with a face value of ₹10, raising ₹4,876 crore for the bank. The bank had received in-principle approvals from BSE and National Stock Exchange on May 15, 2025 for this preferential issue through private placement.",
            "Sentiment": "positive",
            "PublishDate": 1754034784807,
            "Source": "corporate_action"
        },
        {
            "Title": "IDFC FIRST Bank Reports Mixed Q1 FY26 Results with Strong Deposit Growth Amid Microfinance Challenges",
            "Summary": "IDFC FIRST Bank reported quarterly results with balance sheet size of INR 3.6 lakh crores, growing 18% year-on-year. Customer deposits crossed INR 2.57 lakh crores milestone with strong 26% growth, while CASA ratio improved to 48%. The bank added 14 branches, bringing total count to 1,016. However, gross NPA increased marginally from 1.87% to 1.97%, with net NPA rising to 0.55%. The microfinance book declined 37% year-on-year to INR 8,354 crores due to sector challenges. Net interest margin moderated by 24 basis points to 5.71% due to repo rate pass-through and microfinance book decline. The bank reported profit after tax of INR 463 crores, growing 52% sequentially but declining 32% year-on-year. Management expects INR 7,500 crores capital raise to conclude in Q2 and guided for credit cost of around 2-2.05% for the full year. CEO emphasized long-term bank building strategy while acknowledging short-term margin pressures from rate cuts and deposit repricing.",
            "Sentiment": "neutral",
            "PublishDate": 1753968949570,
            "Source": "earnings"
        },
        {
            "Title": "IDFC FIRST Bank CEO Expects Lower Slippages and Credit Costs Despite Margin Pressures",
            "Summary": "IDFC FIRST Bank experienced margin contraction in the first quarter due to reduced micro-finance share in its loan book composition. CEO V. Vaidyanathan expects margin relief from the third quarter onwards as repo rate cuts impact fixed deposit repricing. The bank reported a 32% year-on-year decline in standalone net profit to Rs 463 crore, primarily due to a 67% increase in provisions and contingencies from micro-finance book slippages. Non-micro-finance slippages remain seasonal and system-wide. Credit costs are projected to decrease in the latter half of the fiscal year. The bank is seeing strong customer response and improved branch productivity. Rural wage growth trends remain positive. Morgan Stanley maintained an 'Equal-weight' rating while trimming target price, while Jefferies retained a 'Buy' rating and increased target price, citing potential for lower future slippages and credit costs.",
            "Sentiment": "neutral",
            "PublishDate": 1753685025193,
            "Source": "earnings"
        },
        {
            "Title": "IDFC First Bank Reports 32% Decline in Quarterly Net Profit Despite Revenue Growth",
            "Summary": "IDFC First Bank reported a net profit of 4.6 billion rupees for the quarter, down from 6.8 billion rupees in the same period last year, representing a 32% year-on-year decline. However, the bank's revenue increased to 96 billion rupees from 87.8 billion rupees year-on-year, showing 9.3% growth. Asset quality metrics showed some deterioration with Gross Non-Performing Assets (GNPA) rising to 1.97% from 1.87% quarter-on-quarter, while Net Non-Performing Assets (NNPA) increased marginally to 0.55% from 0.53% quarter-on-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1753662249215,
            "Source": "earnings"
        },
        {
            "Title": "IDFC FIRST Bank Net Profit Falls 32% Due to Higher Provisions on Microfinance Book",
            "Summary": "IDFC FIRST Bank reported a standalone net profit of Rs 463 crore, declining 32% year-on-year due to increased provisions against bad loans. Provisions and contingencies surged 67% to Rs 1,659 crore, primarily driven by slippages in the microfinance portfolio. The gross NPA ratio increased to 1.97% from 1.87% in the previous quarter, while net NPA rose to 0.55% from 0.53%. Net interest income grew 5.1% to Rs 4,933 crore, though net interest margin compressed to 5.71%. Total advances expanded 21% year-on-year, led by mortgage, vehicle, business banking, MSME and wholesale loans contributing 82% of growth. The microfinance portfolio contracted 37% year-on-year, reducing its share of the loan book to 3.3% from 6.3% previously. Wholesale lending grew 39% to Rs 49,279 crore, while deposits increased 26% to Rs 2.56 lakh crore.",
            "Sentiment": "negative",
            "PublishDate": 1753526179590,
            "Source": "earnings"
        },
        {
            "Title": "IDFC First Bank Reports Slight Increase in Asset Quality Metrics",
            "Summary": "IDFC First Bank's gross non-performing assets (GNPA) ratio increased to 1.97% from 1.87% quarter-on-quarter. The bank's net non-performing assets (NNPA) ratio also rose to 0.55% from 0.53% on a quarterly basis. Both key asset quality indicators showed marginal deterioration compared to the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1753524377629,
            "Source": "earnings"
        },
        {
            "Title": "IDFC First Bank Reports 32% Decline in Net Profit Despite Revenue Growth",
            "Summary": "IDFC First Bank reported a net profit of 4.6 billion rupees for Q1, down from 6.8 billion rupees in the same period last year, representing a 32% year-over-year decline. However, the bank's revenue increased to 96 billion rupees from 87.8 billion rupees year-over-year, showing a growth of approximately 9%.",
            "Sentiment": "negative",
            "PublishDate": 1753524018736,
            "Source": "earnings"
        },
        {
            "Title": "IDFC First Bank and Kotak Mahindra Bank Set to Report Quarterly Results",
            "Summary": "IDFC First Bank is expected to report a net profit of Rs 2,997 crore and net interest income of Rs 22,493 crore for the quarter ended June, with analysts estimating a net interest margin of 6.25%. Kotak Mahindra Bank is projected to post a net profit of Rs 3,497 crore and net interest income of Rs 7,391 crore, with an expected net interest margin of 4.7%. Both banks previously faced challenges in their previous quarterly results, with IDFC First Bank's net profit falling to Rs 304 crore due to increased provisions for microfinance institutions, while Kotak Mahindra Bank's net profit declined 14% to Rs 3,552 crore due to higher provisions for distressed microfinance loan books. Whirlpool of India is also expected to report quarterly results with an estimated net profit of Rs 137 crore and total revenue of Rs 2,529 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1753495336015,
            "Source": "earnings"
        },
        {
            "Title": "IDFC First Bank to Announce Q1 FY26 Results on July 26",
            "Summary": "IDFC First Bank will release its first quarter FY 2025-26 financial results on Saturday, July 26. The Board of Directors will meet to consider and approve unaudited standalone and consolidated financial results for the quarter ended June 2025. The bank will conduct an earnings call with analysts and investors at 6 p.m. IST on the same day. Trading window for designated persons remains closed from July 1 to July 28, reopening on July 29. In the previous quarter Q4FY25, the bank reported standalone net profit of Rs 304 crore, down 58% year-on-year from Rs 724 crore. Net Interest Income grew 9.8% to Rs 4,907 crore with Net Interest Margin at 5.95%. IDFC First Bank shares closed 0.32% higher at Rs 72.93, with the stock gaining 1.26% in the past month and 17.12% over six months.",
            "Sentiment": "neutral",
            "PublishDate": 1753359023716,
            "Source": "earnings"
        },
        {
            "Title": "RBI Approves Warburg Pincus Unit's 9.99% Stake Acquisition in IDFC First Bank",
            "Summary": "The Reserve Bank of India approved Currant Sea Investments B.V., a Warburg Pincus unit, to acquire up to 9.99% stake in IDFC First Bank. The Competition Commission of India had previously approved this acquisition on June 3rd. However, IDFC First Bank shareholders recently rejected a proposal to appoint a non-retiring board member from Currant Sea Investments, with only 64.1% voting in favor, below the required 75% threshold. Warburg Pincus affiliates and Abu Dhabi Investment Authority have agreed to jointly invest Rs 7,500 crore in the bank through compulsorily convertible preference shares. The bank plans to allot 81.26 crore shares to Currant Sea and 43.71 crore shares to Platinum Invictus at Rs 60 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1752911034747,
            "Source": "order&deals"
        },
        {
            "Title": "Currant Sea Investments B.V. Receives RBI Approval for 9.99% Stake in IDFC First Bank",
            "Summary": "Currant Sea Investments B.V. has received approval from the Reserve Bank of India to acquire a 9.99% stake in IDFC First Bank. This regulatory approval allows the investment entity to proceed with its planned equity investment in the private sector bank.",
            "Sentiment": "positive",
            "PublishDate": 1752910661604,
            "Source": "stock"
        },
        {
            "Title": "IDFC First Bank: Dividend Record Date Set, Investment Agreement Amended",
            "Summary": "IDFC First Bank's board set July 11 as the record date for dividend eligibility. The bank also approved an amendment to its investment agreement with Currant Sea, revising terms for board nomination rights. The stock fell 0.64% in early trade to Rs 77.16 on the NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1751602184000,
            "Source": "corporate_action"
        },
        {
            "Title": "IDFC First Bank: Dividend Record Date Set for July 11",
            "Summary": "IDFC First Bank has announced July 11 as the record date for determining eligibility for a dividend of Rs 0.25 per share for the financial year 2024-25.",
            "Sentiment": "neutral",
            "PublishDate": 1751543998000,
            "Source": "corporate_action"
        }
    ]
}