{
    "Symbol": "IEX",
    "ISIN": "INE022Q01020",
    "News": [
        {
            "Title": "IEX Reports Record 13,050 MU Trading Volume in Jan",
            "Summary": "Indian Energy Exchange achieved record monthly electricity trading volume of 13,050 MU in January, marking a significant 19.6% year-over-year growth in trading activity.",
            "Sentiment": "positive",
            "PublishDate": 1770120390529,
            "Source": "stocks"
        },
        {
            "Title": "SBI MF cuts IEX stake from 6.76% to 4.73%",
            "Summary": "SBI Mutual Fund reduces shareholding in Indian Energy Exchange by 2.03 percentage points through sale of 17.16 lakh shares worth ₹1,715,758 on January 29, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769836810609,
            "Source": "co_actions_results"
        },
        {
            "Title": "IEX Q3 Net Profit Rises 11.2% to ₹1.19 Billion",
            "Summary": "Indian Energy Exchange reports consolidated net profit of ₹1.19 billion for Q3, up from ₹1.07 billion year-on-year, marginally beating analyst estimates of ₹1.18 billion.",
            "Sentiment": "positive",
            "PublishDate": 1769674053233,
            "Source": "co_actions_results"
        },
        {
            "Title": "IEX schedules Q3FY26 results conference call",
            "Summary": "Indian Energy Exchange has scheduled a conference call for analysts and investors on January 30, 2026, at 2:30 PM IST to discuss Q3FY26 financial results for the quarter ended December 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769000261494,
            "Source": "co_actions_results"
        },
        {
            "Title": "IEX Board Meet on Jan 29 for Q3FY26 Results & Dividend",
            "Summary": "Indian Energy Exchange schedules board meeting on January 29, 2026 to consider Q3FY26 unaudited financial results and interim dividend proposal. Record date set for February 4, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768993001292,
            "Source": "co_actions_results"
        },
        {
            "Title": "IEX Challenges Market Coupling Parameters at APTEL",
            "Summary": "IEX tells APTEL that parameters used for passing market coupling order are wrong, as regulatory dispute intensifies with integrity concerns over CERC officials.",
            "Sentiment": "negative",
            "PublishDate": 1768804707344,
            "Source": "stocks"
        },
        {
            "Title": "IEX shares fall 35% from peak on market coupling fears",
            "Summary": "Indian Energy Exchange shares declined 9% over two sessions as market coupling regulatory uncertainty persists. APTEL deferred hearing to January 19, with experts advising caution amid technical weakness.",
            "Sentiment": "negative",
            "PublishDate": 1768195160974,
            "Source": "stocks"
        },
        {
            "Title": "IEX shares rebound 3% amid market coupling uncertainty",
            "Summary": "Indian Energy Exchange shares rose 3% to ₹142.00, snapping a two-day decline. Q3 FY26 volumes grew 11.9% YoY to 34.08 billion units despite regulatory challenges over market coupling implementation.",
            "Sentiment": "neutral",
            "PublishDate": 1768195132140,
            "Source": "stocks"
        },
        {
            "Title": "IEX shares drop 7% on gas futures clarification",
            "Summary": "Indian Energy Exchange shares fell 7% to ₹139.80 after clarifying it's not involved in gas futures talks and amid APTEL hearing deferment on market coupling norms to January 19.",
            "Sentiment": "negative",
            "PublishDate": 1767951953339,
            "Source": "stocks"
        },
        {
            "Title": "IEX Shares Fall 13% After APTEL Postpones Hearing",
            "Summary": "Indian Energy Exchange shares surged 7% on market coupling hearing news but crashed 13% from day's high after APTEL postponed the hearing to January 19. Company posted strong volume growth despite price declines.",
            "Sentiment": "negative",
            "PublishDate": 1767949609114,
            "Source": "stocks"
        },
        {
            "Title": "IEX Clarifies No Role in NSE-IGX Gas Futures Talks",
            "Summary": "Indian Energy Exchange clarifies it has no knowledge or involvement in reported discussions between NSE and IGX regarding natural gas futures contracts, emphasizing IGX operates independently.",
            "Sentiment": "neutral",
            "PublishDate": 1767945675063,
            "Source": "stocks"
        },
        {
            "Title": "IEX Shares Drop 4.66% on CERC Market Coupling Stay",
            "Summary": "Indian Energy Exchange shares fell 4.66% to ₹143.10 following CERC's decision to stay market coupling order. APTEL scheduled next hearing for January 19, 2026, with implementation delayed pending regulations.",
            "Sentiment": "negative",
            "PublishDate": 1767945545332,
            "Source": "stocks"
        },
        {
            "Title": "APTEL Clarifies No Conclusion on IEX Case",
            "Summary": "The Appellate Tribunal for Electricity (APTEL) has clarified that no conclusion has been reached regarding the ongoing case involving Indian Energy Exchange (IEX).",
            "Sentiment": "neutral",
            "PublishDate": 1767944409291,
            "Source": "stocks"
        },
        {
            "Title": "IEX Case Hearing Postponed to January 19 by APTEL",
            "Summary": "The Appellate Tribunal for Electricity has rescheduled the case hearing involving Indian Energy Exchange to January 19, marking a procedural development in the ongoing legal matter.",
            "Sentiment": "neutral",
            "PublishDate": 1767944387928,
            "Source": "stocks"
        },
        {
            "Title": "APTEL Clarifies CERC Independence on Market Coupling Rules",
            "Summary": "APTEL Registrar advises CERC that regulatory decisions on market coupling should proceed independently of ongoing legal proceedings, providing clarity on regulatory autonomy.",
            "Sentiment": "neutral",
            "PublishDate": 1767942872303,
            "Source": "stocks"
        },
        {
            "Title": "APTEL Clarifies CERC System Implementation Timeline",
            "Summary": "APTEL confirms CERC will delay system implementation until proper regulations are established, providing clarity on regulatory timeline for Indian Energy Exchange operations.",
            "Sentiment": "neutral",
            "PublishDate": 1767942751943,
            "Source": "stocks"
        },
        {
            "Title": "CERC Seeks Regulatory Route for Market Coupling",
            "Summary": "Central Electricity Regulatory Commission's legal counsel tells tribunal that market coupling implementation should proceed only through proper regulatory framework, affecting Indian Energy Exchange operations.",
            "Sentiment": "neutral",
            "PublishDate": 1767942677172,
            "Source": "stocks"
        },
        {
            "Title": "IEX shares drop 13% after tribunal hearing on CERC norms",
            "Summary": "Indian Energy Exchange shares declined over 13% from day's high following January 9 tribunal hearing on market coupling norms dispute with Central Electricity Regulatory Commission.",
            "Sentiment": "negative",
            "PublishDate": 1767942652440,
            "Source": "stocks"
        },
        {
            "Title": "IEX Shares Swing As CERC Clarifies Market Coupling Order",
            "Summary": "Indian Energy Exchange shares surged 6.78% to ₹160.27 before retreating as CERC converted market coupling 'order' to 'direction' amid ongoing APTEL hearings on the contentious regulatory framework.",
            "Sentiment": "neutral",
            "PublishDate": 1767942069141,
            "Source": "stocks"
        },
        {
            "Title": "IEX Updates on CERC Market Coupling Corrigendum",
            "Summary": "Indian Energy Exchange informs exchanges about CERC's corrigendum dated January 8, 2026, clarifying terminology in market coupling directions from July 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767941349543,
            "Source": "stocks"
        },
        {
            "Title": "IEX Market Coupling Case Sees Legal Delay Request",
            "Summary": "CERC's legal counsel requests additional time to respond regarding the withdrawal of the market coupling order in the ongoing Indian Energy Exchange case proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1767940559680,
            "Source": "stocks"
        },
        {
            "Title": "IEX Market Coupling Case Lacks CERC Clarity at APTEL",
            "Summary": "Indian Energy Exchange faces uncertainty as CERC provides no clarity on withdrawal of market coupling order at APTEL, leaving regulatory framework in limbo.",
            "Sentiment": "neutral",
            "PublishDate": 1767940535493,
            "Source": "stocks"
        },
        {
            "Title": "IEX shares drop 10% on CERC market coupling circular",
            "Summary": "Indian Energy Exchange shares fell 10% from day's high to ₹150.00 after CERC issued circular ahead of APTEL hearing on market coupling norms, clarifying July 2025 order as directions.",
            "Sentiment": "negative",
            "PublishDate": 1767940511830,
            "Source": "stocks"
        },
        {
            "Title": "IEX shares drop 4% ahead of APTEL market coupling hearing",
            "Summary": "Indian Energy Exchange shares declined 4% on Friday as APTEL prepares to hear the market coupling case, following CERC's circular clarifying its July 2025 order as a 'direction' rather than an 'order'.",
            "Sentiment": "negative",
            "PublishDate": 1767940324763,
            "Source": "stocks"
        },
        {
            "Title": "CERC to Consider July 2025 Order for IEX Operations",
            "Summary": "Central Electricity Regulatory Commission announces that a July 2025 order will be considered for Indian Energy Exchange with no changes expected in current operations.",
            "Sentiment": "neutral",
            "PublishDate": 1767940023951,
            "Source": "stocks"
        },
        {
            "Title": "IEX shares rise ahead of tribunal hearing on market coupling",
            "Summary": "Indian Energy Exchange shares gained 1.5% before APTEL hearing on market coupling case. Tribunal may conclude case if CERC confirms order withdrawal possibility.",
            "Sentiment": "positive",
            "PublishDate": 1767938243386,
            "Source": "stocks"
        },
        {
            "Title": "IEX shares in focus ahead of APTEL market coupling hearing",
            "Summary": "Indian Energy Exchange shares under investor spotlight as APTEL prepares to hear arguments on market coupling case. CERC's willingness to reconsider July 2025 order boosts sentiment amid concerns over IEX's 85% market dominance.",
            "Sentiment": "neutral",
            "PublishDate": 1767933863098,
            "Source": "stocks"
        },
        {
            "Title": "Bernstein warns of regulatory storm for IEX",
            "Summary": "Bernstein maintains 'Underperform' rating on IEX citing regulatory risks despite recent court developments. Stock rallied 15% over two sessions as APTEL questions market-coupling framework.",
            "Sentiment": "negative",
            "PublishDate": 1767788550349,
            "Source": "stocks"
        },
        {
            "Title": "IEX fundamentals strong despite regulatory overhang",
            "Summary": "Elara Capital's Rupesh Sankhe notes IEX's PE multiple fell from 45-50x to 27-28x due to market coupling concerns, despite 19% volume growth in FY24. Any favorable regulatory outcome could trigger sharp rerating.",
            "Sentiment": "neutral",
            "PublishDate": 1767756000826,
            "Source": "stocks"
        },
        {
            "Title": "IEX calls 14% share surge 'market driven' amid court case",
            "Summary": "Indian Energy Exchange clarifies sharp price movement was market-driven as APTEL resumed hearing on market coupling mandate, with IEX raising procedural objections over unavailable Power Grid report.",
            "Sentiment": "positive",
            "PublishDate": 1767695989672,
            "Source": "stocks"
        },
        {
            "Title": "IEX Sees ₹18.88 Cr Block Trade on NSE at ₹147.81",
            "Summary": "Indian Energy Exchange executed a significant block trade worth ₹18.88 crores on NSE, involving approximately 1.28 million shares at ₹147.81 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767692534242,
            "Source": "co_actions_results"
        },
        {
            "Title": "IEX Shares Jump 10% As APTEL Resumes Market Coupling Hearing",
            "Summary": "IEX shares surge 10% to Rs 147 as APTEL resumes hearing on market coupling case, with IEX counsel raising procedural objections over unavailable Power Grid report and questioning CERC's decision rationale.",
            "Sentiment": "positive",
            "PublishDate": 1767669483050,
            "Source": "stocks"
        },
        {
            "Title": "IEX power trade volumes rise 2.8% to 11.44 BU in Dec",
            "Summary": "Indian Energy Exchange reports 2.8% YoY growth in electricity trading volumes to 11.44 billion units in December 2025, driven by strong RTM performance despite DAM decline.",
            "Sentiment": "positive",
            "PublishDate": 1767614842876,
            "Source": "stocks"
        },
        {
            "Title": "IEX Reports 34.08 BU Q3FY26 Volume with 11.9% Growth",
            "Summary": "Indian Energy Exchange achieved 34.08 BU electricity traded volume in Q3FY26 with 11.9% YoY growth. RTM segment showed exceptional performance with 35.7% growth, while average prices declined due to increased supply.",
            "Sentiment": "positive",
            "PublishDate": 1767610995373,
            "Source": "co_actions_results"
        },
        {
            "Title": "IEX shares slide 4% on CERC's new VPPA framework",
            "Summary": "Indian Energy Exchange shares dropped 4.20% to ₹133.29 after CERC introduced Virtual Power Purchase Agreement framework, raising concerns about potential impact on exchange trading volumes.",
            "Sentiment": "negative",
            "PublishDate": 1766717241821,
            "Source": "stocks"
        },
        {
            "Title": "IEX Reports 17.7% Growth in Electricity Trading Volume for November",
            "Summary": "IEX reported electricity traded volume of 11,409 MU in November, marking a 17.7% year-on-year increase. The company achieved 4,233 MU in Real Time Market (RTM) volume during the month, representing a 40.2% year-on-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1764806738959,
            "Source": "stock"
        },
        {
            "Title": "IEX Reports 16% Volume Growth in Q2FY26 Despite Flat Power Demand, RTM Segment Surpasses DAM for First Time",
            "Summary": "Indian Energy Exchange recorded electricity trading volume of 35.2 billion units in Q2FY26, marking 16.1% year-on-year growth despite flat power demand in the country. Revenue increased 9.2% to Rs. 183.3 crores from Rs. 167.8 crores, while profit after tax rose 13.9% to Rs. 123.4 crores. The Real-Time Market segment achieved 36% share of volumes, surpassing Day-Ahead Market for the first time, with RTM volumes reaching nearly 15 billion units (39% growth). Green market volumes grew 17.7% to 3 billion units. Average DAM prices dropped 12.5% to Rs. 3.93 per unit, while RTM prices fell 16% to Rs. 3.51 per unit due to improved supply liquidity. The company faces market coupling implementation by January 2026 and has filed an appeal with APTEL. IGX subsidiary recorded gas trading volume of 16.1 million MMBtu (37% growth) with profit after tax of Rs. 9.6 crores. Management expects to maintain 15-20% volume growth and projects long-term growth driven by India's expanding economy and energy transition initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1762496324343,
            "Source": "earnings"
        },
        {
            "Title": "Indian Energy Exchange Reports 16.5% Growth in Monthly Electricity Trading Volume",
            "Summary": "Indian Energy Exchange achieved monthly electricity traded volume of 11,233 MU in October 2025, marking a 16.5% year-on-year increase. The Real-Time Market segment showed strong performance with 4,583 MU volume, up 46.8% year-on-year, accounting for 37.8% of total traded volumes. The Day-Ahead Market recorded 4,684 MU volume, a 6.7% increase from the previous year. Average electricity prices declined significantly, with Day-Ahead Market prices at Rs 2.67/unit (down 32% year-on-year) and Real-Time Market prices at Rs 2.73/unit (down 27.8% year-on-year). The price decline was attributed to enhanced hydro, wind, and solar generation combined with steady coal-based supply, resulting in higher supply liquidity. The Green Market segment achieved 1,055 MU volume, up 21% year-on-year. Renewable Energy Certificates trading reached 6.19 lakh certificates, showing a 39.4% year-on-year increase at a clearing price of Rs 370/REC.",
            "Sentiment": "positive",
            "PublishDate": 1762224547656,
            "Source": "stock"
        },
        {
            "Title": "IEX Management Projects 15-20% Volume Growth for FY26",
            "Summary": "IEX management has projected volume growth of 15-20% for FY26. This guidance was shared during a conference call with stakeholders.",
            "Sentiment": "positive",
            "PublishDate": 1761990263463,
            "Source": "stock"
        },
        {
            "Title": "IEX Reports 15.5% Growth in Electricity Volumes, Targets 25-30% Volume CAGR",
            "Summary": "IEX reported electricity volumes increased 15.5% year-over-year in H1 FY26, with renewable energy volumes surging 136% during the same period. The company has set a target of achieving 25-30% volume compound annual growth rate, driven by renewable energy integration and new market instruments including carbon trading, derivatives, and battery energy storage systems (BESS). The growth strategy also relies on anticipated regulatory reforms expected during FY26-FY30.",
            "Sentiment": "positive",
            "PublishDate": 1761835304993,
            "Source": "stock"
        },
        {
            "Title": "IEX Expects Strong IGX Volumes Due to Stable Gas Prices and Supportive Policies",
            "Summary": "IEX commented that stable gas prices and positive policies will help maintain strong volumes on IGX (Indian Gas Exchange).",
            "Sentiment": "positive",
            "PublishDate": 1761834100453,
            "Source": "stock"
        },
        {
            "Title": "IEX Reports 13.9% Rise in Net Profit to ₹123.3 Crore; Shares Fall 3.57% Amid Regulatory Challenges",
            "Summary": "Indian Energy Exchange Ltd (IEX) reported net profit of ₹123.3 crore for the second quarter of FY26, representing a 13.9% year-on-year increase from ₹108.3 crore. Revenue from operations grew 10.5% to ₹153.9 crore, while EBITDA rose 11.4% to ₹133.4 crore. Operating margins improved to 86.7% from 86% in the previous year. Electricity market volumes reached 35.2 billion units, marking 16.1% growth. The company traded 97 lakh Renewable Energy Certificates in H1 FY26, up 15.2%. The Appellate Tribunal for Electricity deferred hearing IEX's challenge against CERC's market coupling directive, with the next hearing scheduled for November 28. APTEL noted IEX's concern that its market share could be adversely affected by the CERC order. IEX shares closed 3.57% lower at ₹143.35 on the NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1761828816339,
            "Source": "earnings"
        },
        {
            "Title": "IGX Gas Market Share Expected to Double by 2030",
            "Summary": "Indian Gas Exchange (IGX), operated by IEX, is projected to increase its share of total gas usage from the current 2% to 4-5% by 2030. This represents a potential doubling of the exchange's market penetration in India's gas trading sector over the next several years.",
            "Sentiment": "positive",
            "PublishDate": 1761825356051,
            "Source": "stock"
        },
        {
            "Title": "IEX Reports Strong Q2 Performance with 13.9% Growth in Net Profit",
            "Summary": "IEX delivered robust quarterly results with consolidated net profit rising to 1.23 billion rupees from 1.08 billion rupees year-over-year. Revenue increased to 1.54 billion rupees compared to 1.39 billion rupees in the same period last year. EBITDA grew to 1.34 billion rupees from 1.2 billion rupees year-over-year. The company maintained strong profitability with EBITDA margin improving to 86.70% from 86.01% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761822623654,
            "Source": "earnings"
        },
        {
            "Title": "IEX Shares in Focus as Electricity Appellate Tribunal Hears Market Coupling Case",
            "Summary": "Indian Energy Exchange Ltd. (IEX) shares are under attention as the Electricity Appellate Tribunal conducts a hearing on the company's plea regarding market coupling norms. The tribunal previously asked IEX to file a revised plea adding new respondents including Grid Corporation of India, Power Exchange of India, and Hindustan Power Exchange. IEX shares had declined 30% in July after the Central Electricity Regulatory Commission approved market coupling implementation for the Day Ahead Market, scheduled for January 2026. Under the new system, different power exchanges will operate as market coupling operators on a round-robin basis, with a Market Coupler collecting and matching buy-sell orders to discover uniform pricing across all exchanges. IEX shares have recovered from July lows around ₹130, despite Jefferies maintaining an 'underperform' rating with a ₹105 target price.",
            "Sentiment": "neutral",
            "PublishDate": 1761795750882,
            "Source": "stock"
        },
        {
            "Title": "IEX Schedules Q2 Results Review for October 30",
            "Summary": "IEX has announced that it will review its Q2 results on October 30. The company has set this date for the quarterly results review.",
            "Sentiment": "neutral",
            "PublishDate": 1761284039496,
            "Source": "earnings"
        },
        {
            "Title": "SEBI Uncovers Rs 173 Crore Insider Trading Scheme in Indian Energy Exchange Shares",
            "Summary": "SEBI investigated a major insider trading case involving Indian Energy Exchange (IEX) shares where eight individuals illegally profited Rs 173 crore. The traders purchased put options on IEX just before the stock crashed nearly 30%, with none having prior trading history in the company. Bhoovan Singh led the group with over Rs 72 crore in gains. The scheme involved leaked confidential information from Central Electricity Regulatory Commission meetings regarding market coupling policy decisions in July. SEBI traced the leak to two CERC officials, with evidence showing Bhoovan Singh had access to internal CERC documents and searched online for ways to profit from insider information. Sanjeev Kumar visited CERC headquarters eight days before the policy announcement and photographed himself watching a confidential board meeting, sharing it in a WhatsApp group. When NSE flagged the suspicious trades, message histories were deleted but backup evidence remained, leading to SEBI barring all eight individuals.",
            "Sentiment": "negative",
            "PublishDate": 1760698995245,
            "Source": "corporate_governance"
        },
        {
            "Title": "SEBI Bars 8 Individuals from Markets for Alleged Insider Trading in IEX Shares Worth Rs 173 Crore",
            "Summary": "SEBI has barred eight individuals from capital markets with immediate effect for alleged insider trading in Indian Energy Exchange (IEX) shares, resulting in illegal gains exceeding Rs 173 crore. The individuals named are Bhoovan Singh, Amar Jit Singh Soran, Amita Soran, Anita, Narender Kumar, Virender Singh, Bindu Sharma and Sanjeev Kumar. The action follows SEBI's examination of suspicious trading activity around CERC's market coupling directive announced on July 23, 2025. IEX shares fell over 29% on July 24 following the announcement. PUT European options expiring July 31 surged to 65,212 on July 22, before the CERC order became public. SEBI found the trading was executed in a coordinated manner using unpublished price sensitive information, creating market imbalance and disadvantaging other investors. The interim order remains effective until further notice.",
            "Sentiment": "negative",
            "PublishDate": 1760547938446,
            "Source": "corporate_governance"
        },
        {
            "Title": "SEBI Issues Temporary Order Against IEX for Insider Trading Involving Company Entities",
            "Summary": "The Securities and Exchange Board of India (SEBI) has issued a temporary order against Indian Energy Exchange (IEX) related to insider trading activities involving certain entities of the company.",
            "Sentiment": "negative",
            "PublishDate": 1760546285761,
            "Source": "corporate_governance"
        },
        {
            "Title": "IEX Faces Electricity Tribunal Proceedings with October 2025 Hearing Date",
            "Summary": "The Electricity Tribunal has set October 30, 2025, as the next hearing date for proceedings involving IEX. Respondents are required to reply to IEX's request before this hearing date. Additionally, the tribunal has requested IEX to submit a new plea that includes additional respondents in the case.",
            "Sentiment": "neutral",
            "PublishDate": 1760426575217,
            "Source": "stock"
        }
    ]
}