{
    "Symbol": "IFBAGRO",
    "ISIN": "INE076C01018",
    "News": [
        {
            "Title": "IFB Agro Industries Q3 FY26 Results Show Mixed Performance",
            "Summary": "IFB Agro Industries reported Q3 FY26 revenue of ₹47,086 lakhs with net profit of ₹837 lakhs. Marine segment faced challenges while spirits segment remained strong.",
            "Sentiment": "neutral",
            "PublishDate": 1769773504582,
            "Source": "co_actions_results"
        },
        {
            "Title": "IFB Agro Industries Reports Strong Q2 Performance with Revenue Up 39% and Net Profit Surging Over 10x",
            "Summary": "IFB Agro Industries delivered robust quarterly results with revenue rising to 5.3 billion rupees from 3.8 billion rupees year-over-year. The company's consolidated net profit jumped significantly to 227 million rupees compared to 20.9 million rupees in the same period last year. EBITDA increased substantially to 373 million rupees from 49.9 million rupees, while EBITDA margin expanded to 7% from 1.3% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1761917192965,
            "Source": "earnings"
        },
        {
            "Title": "IFB Agro Industries to Liquidate UAE Subsidiary by September 2025",
            "Summary": "IFB Agro Industries has announced the voluntary liquidation of its UAE subsidiary, with the process scheduled to be completed by September 30, 2025. The company is proceeding with the closure of its United Arab Emirates operations through this voluntary liquidation process.",
            "Sentiment": "neutral",
            "PublishDate": 1759321035497,
            "Source": "stock"
        },
        {
            "Title": "IFB Agro Industries Redesignates Siddhartha Basu to Head Commercial & Integration Role",
            "Summary": "IFB Agro Industries Limited announced the redesignation of Mr. Siddhartha Basu from Chief Financial Officer - Marine Division to Head - Commercial & Integration, Marine Division, effective August 27, 2025. The change represents a shift in senior management responsibilities within the company's marine division operations.",
            "Sentiment": "neutral",
            "PublishDate": 1756301791687,
            "Source": "corporate_governance"
        },
        {
            "Title": "IFB Agro Industries Completes Rs 110 Crore Acquisition of Cargill's Aqua Feed Business in India",
            "Summary": "IFB Agro Industries Limited has completed the acquisition of Cargill India Private Limited's entire commercial compound shrimp feed and freshwater fish feed business in India for Rs 110 crores. The deal, executed through a Business Transfer Agreement dated May 30, 2025, includes feed formulations, assets, contracts, liabilities, licenses, employees, and two manufacturing facilities in Vijayawada and Rajahmundry, Andhra Pradesh. The acquisition was completed on July 31, 2025, with operations at the acquired facilities set to commence from August 1, 2025. The transaction was structured as a slump sale on a going concern basis, with the consideration subject to working capital and other agreed adjustments.",
            "Sentiment": "positive",
            "PublishDate": 1753967604922,
            "Source": "order&deals"
        },
        {
            "Title": "IFB Agro Industries Re-appoints Arup Kumar Banerjee as Executive Vice Chairman for Two Years",
            "Summary": "IFB Agro Industries Limited shareholders approved the re-appointment of Mr. Arup Kumar Banerjee as Executive Vice Chairman for a two-year term starting July 30, 2025, at the company's 43rd Annual General Meeting. Banerjee, who holds DIN 00336225, is 73 years old with a B.COM (Hons.) degree and a Diploma in Business Management from IIM Calcutta. His expertise includes Business Management, Administration, Planning, Strategic Decision Making, and Marketing. The company confirmed that the director meets all regulatory requirements and is not debarred from holding the position.",
            "Sentiment": "neutral",
            "PublishDate": 1753966355092,
            "Source": "corporate_governance"
        },
        {
            "Title": "IFB Agro Industries Appoints Rajat Purkayastha as New Internal Auditor",
            "Summary": "IFB Agro Industries Limited appointed Mr. Rajat Purkayastha, a Chartered Accountant, as the company's new Internal Auditor with immediate effect. The appointment was approved by the Board of Directors based on the Audit Committee's recommendation. Purkayastha replaces Mr. Rajit Chatterjee, who resigned to pursue other opportunities. The new Internal Auditor has been with IFB Agro Industries since 2006, serving in various key positions including Head of Finance & Accounts at NoorPur Distillery, roles in the IMFL Division, Marine Division, and CFO of the IFB Steel Division. The appointment is permanent and effective from July 28, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753709220601,
            "Source": "corporate_governance"
        },
        {
            "Title": "IFB Agro Industries Reports Quarterly Financial Results for June 2025",
            "Summary": "IFB Agro Industries Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company operates in two main segments: Spirit, spirituous beverages and allied products, and Marine business. For the quarter, the company reported revenue from operations of ₹41,573 lakhs compared to ₹37,996 lakhs in the corresponding quarter of the previous year. The company posted a profit after tax of ₹2,547 lakhs for the current quarter versus ₹1,879 lakhs in the same period last year. Earnings per share stood at ₹27.19 for the quarter. The Board of Directors approved the acquisition of commercial compound shrimp and freshwater fish feed business undertaking from Cargill India Private Limited, with the transaction proposed to be completed within July 31, 2025. The company's Marine business shows seasonal variations, making quarterly comparisons less meaningful. The results were reviewed by statutory auditors who provided an unmodified opinion.",
            "Sentiment": "positive",
            "PublishDate": 1753704465407,
            "Source": "earnings"
        },
        {
            "Title": "IFB Agro Industries Reports Q4 Financial Results",
            "Summary": "IFB Agro Industries has reported its Q4 financial results. The company's EBITDA improved to a gain of 88 million rupees, compared to a loss of 63 million rupees in the same quarter last year. The Q4 EBITDA margin was 2.48%. The consolidated net profit for Q4 was 6.3 million rupees, up from a loss of 28 million rupees year-over-year and 113 million rupees quarter-on-quarter. Q4 revenue increased to 3.54 billion rupees from 3.3 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748521121000,
            "Source": "result"
        },
        {
            "Title": "IFB Agro Industries Reports Profit in Q3 FY2024",
            "Summary": "IFB Agro Industries has reported a consolidated net profit of 112.8 million rupees in the third quarter, compared to a loss of 50 million rupees in the same period last year. The company's revenue increased to 4.2 billion rupees from 3.6 billion rupees year-over-year. Sequentially, the profit improved from 20.9 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738197243000,
            "Source": "earnings"
        },
        {
            "Title": "IFB Agro Industries Reports Q3 Revenue Growth",
            "Summary": "IFB Agro Industries has announced its third-quarter financial results, reporting revenue of 4.2 billion rupees. This represents a year-over-year increase from 3.6 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738154507000,
            "Source": "earnings"
        },
        {
            "Title": "IFB Agro Industries Reports Profit in Q3 FY2024",
            "Summary": "IFB Agro Industries has reported a consolidated net profit of 112.8 million rupees in the third quarter, compared to a loss of 50 million rupees in the same period last year. The company also showed improvement from the previous quarter, with profit increasing from 20.9 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738154471000,
            "Source": "earnings"
        },
        {
            "Title": "IFB Agro Industries Reports Improved Q2 EBITDA",
            "Summary": "IFB Agro Industries has reported a significant improvement in its Q2 EBITDA, turning a loss of 5.8 million rupees in the previous year into a gain of 49.9 million rupees. The company's Q2 EBITDA margin stands at 1.30%.",
            "Sentiment": "positive",
            "PublishDate": 1731331912000,
            "Source": "result"
        },
        {
            "Title": "IFB Agro Industries Reports Q2 Revenue Growth",
            "Summary": "IFB Agro Industries has reported a revenue of 3.8 billion rupees for the second quarter, compared to 3.52 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731331737000,
            "Source": "result"
        },
        {
            "Title": "IFB Agro Industries Reports Profit in Q2",
            "Summary": "IFB Agro Industries has reported a consolidated net profit of 20.9 million rupees in the second quarter, compared to a loss of 21 million rupees in the same period last year. The company also saw a significant improvement from the previous quarter, with profits increasing from 83.4 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1731331711000,
            "Source": "result"
        }
    ]
}