{
    "Symbol": "IFBIND",
    "ISIN": "INE559A01017",
    "News": [
        {
            "Title": "IFB Industries Appoints New Independent Director",
            "Summary": "IFB Industries announces completion of Biswadip Gupta's term as independent director on February 9, 2026, and appoints Tarun Kumar Daga as new independent director for two years starting February 10, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770711236710,
            "Source": "stocks"
        },
        {
            "Title": "IFB Agro Industries Q3 Net Profit Drops 35.4% YoY",
            "Summary": "IFB Agro Industries reported Q3 consolidated net profit of ₹73 million, down from ₹113 million year-on-year, while revenue grew to ₹4.70 billion from ₹4.20 billion in the same period.",
            "Sentiment": "negative",
            "PublishDate": 1769779923292,
            "Source": "co_actions_results"
        },
        {
            "Title": "IFB Industries Q3 profit drops 23% to ₹24 crore",
            "Summary": "IFB Industries reported a 23% decline in net profit to ₹23.94 crore for Q3 FY26, despite revenue growth of 11.26% to ₹1,412.54 crore. Home Appliances segment led growth with 9.81% increase.",
            "Sentiment": "negative",
            "PublishDate": 1769325919329,
            "Source": "co_actions_results"
        },
        {
            "Title": "IFB Industries Cost Auditor Resigns Due to Circumstances",
            "Summary": "IFB Industries Limited announced the resignation of M/s. Shome & Banerjee as Cost Auditors for FY2026, citing unavoidable circumstances. The resignation was tendered on January 23, 2025, with cessation effective January 23, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769270322692,
            "Source": "stocks"
        },
        {
            "Title": "IFB Industries Appoints New Directors & Cost Auditor",
            "Summary": "IFB Industries board approves appointment of three new directors including re-appointment of Ms. Sreedevi Pillai as Independent Director and appoints Mani & Co. as Cost Auditor for FY26 at ₹9 lakhs remuneration.",
            "Sentiment": "positive",
            "PublishDate": 1769270112450,
            "Source": "stocks"
        },
        {
            "Title": "Dolly Khanna Invests in IFB Agro Industries Q3 FY26",
            "Summary": "Ace investor Dolly Khanna acquired 1.1% stake in IFB Agro Industries during Q3 FY26. Company showed strong recovery with revenue rising from ₹267 cr to ₹402 cr and margins expanding from 2% to 9%.",
            "Sentiment": "positive",
            "PublishDate": 1768888473100,
            "Source": "stocks"
        },
        {
            "Title": "IFB Industries Subsidiary Launches Swiss Unit",
            "Summary": "IFB Industries' subsidiary GAAL establishes new fully owned unit 'Schmid Automotive & Appliances GmbH' in Switzerland, expanding international operations.",
            "Sentiment": "positive",
            "PublishDate": 1765550495668,
            "Source": "stocks"
        },
        {
            "Title": "IFB Industries Forms Swiss Subsidiary for Engineering",
            "Summary": "IFB Industries' subsidiary Global Automotive Appliances forms Schmid Automotive Appliances GmbH in Switzerland to enhance engineering capabilities in machine tools and fine blanking.",
            "Sentiment": "positive",
            "PublishDate": 1765546370738,
            "Source": "co_actions_results"
        },
        {
            "Title": "IFB Industries Reports 11.5% Revenue Growth in Q2 with Margin Improvement Initiatives",
            "Summary": "IFB Industries reported quarterly revenue of Rs. 1,327 crores compared to Rs. 1,189 crores in the previous year, marking 11.5% growth. PBDIT increased 30% year-on-year to Rs. 102.5 crores (7.7% of revenue) from Rs. 79.04 crores (6.6% of revenue). PAT grew to Rs. 50 crores (3.8% of revenue) from Rs. 33 crores (2.77% of revenue). For the half-year period, revenue reached Rs. 2,637 crores versus Rs. 2,434 crores, showing 8.4% growth. The company is implementing material cost reduction initiatives targeting annualized savings of Rs. 200 crores, with Rs. 14 crores already realized in the first half and Rs. 60-70 crores expected in the second half. IFB is working with Alvarez Marsal on cost optimization projects and has engaged McKinsey for e-commerce and marketing cost optimization. The home appliances division is expanding into refrigerators and air conditioners, with production of BLDC motors for washing machines and ACs underway. Management expressed confidence in gaining market share and achieving double-digit margins through various cost reduction and efficiency improvement measures.",
            "Sentiment": "positive",
            "PublishDate": 1762974835610,
            "Source": "earnings"
        },
        {
            "Title": "IFB Industries Plans Multi-Segment Expansion with New Product Lines and Manufacturing Capacity Growth",
            "Summary": "IFB Industries has outlined growth plans across multiple segments including premium home appliances, kitchen solutions, and commercial laundry. The company is expanding manufacturing capacity in Bengaluru and Kolkata while launching new product lines in built-in and cooling categories. The company reported margin recovery in Q2FY26 driven by cost control measures and improved product mix. IFB Industries aims to strengthen its brand position and expand distribution networks across tier-2 and tier-3 cities as part of its long-term strategy.",
            "Sentiment": "positive",
            "PublishDate": 1762960859311,
            "Source": "stock"
        },
        {
            "Title": "IFB Agro Industries Reports Strong Q2 Performance with 986% Jump in Net Profit",
            "Summary": "IFB Agro Industries delivered robust quarterly results with consolidated net profit surging to 227 million rupees from 20.9 million rupees year-over-year. Revenue grew significantly to 5.3 billion rupees compared to 3.8 billion rupees in the same period last year. EBITDA jumped to 373 million rupees from 49.9 million rupees, while EBITDA margin expanded to 7% from 1.3% year-over-year, indicating improved operational efficiency and profitability across the business.",
            "Sentiment": "positive",
            "PublishDate": 1762128818115,
            "Source": "earnings"
        },
        {
            "Title": "IFB Industries Reports 12% Revenue Growth in Q2 FY26 with Strong Performance in Washer Category",
            "Summary": "IFB Industries Limited reported quarterly revenue growth of 12% with revenue reaching ₹866 crores compared to ₹904 crores in the previous year. The Home Appliance Division recorded 14% growth while the Engineering Division grew by 6%. PBDIT increased by 49% to ₹79.02 crores, with margins improving at both PBT and PAT levels. The company's performance was primarily driven by strong sales in the washer category, while AC segment revenues remained subdued due to early monsoon and extended rainfall. For the year-to-date period, the company reported 8% revenue growth. The washer-dryer segment achieved substantial 95% growth, outpacing the market's 32% growth. Top Load business achieved exceptional 39% growth, significantly outperforming the market's 10% growth rate. The company maintained a net cash position of ₹290.83 crores after adjusting for overall debt of ₹217.31 crores. IFB has appointed consultants for cost optimization targeting annual savings of over ₹200 crores in material costs.",
            "Sentiment": "positive",
            "PublishDate": 1762010747179,
            "Source": "earnings"
        },
        {
            "Title": "IFB Industries Reports 62% Jump in Q2 Net Profit to 507.9 Million Rupees",
            "Summary": "IFB Industries reported consolidated net profit of 507.9 million rupees in Q2, representing a 62% increase from 314.1 million rupees in the same period last year. Revenue grew 12% to 13.7 billion rupees compared to 12.19 billion rupees year-over-year. EBITDA rose 42% to 997.8 million rupees from 704.5 million rupees, while EBITDA margin improved to 7.28% from 5.78% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761836673161,
            "Source": "earnings"
        },
        {
            "Title": "IFB Industries' Singapore Subsidiary to Establish European Facility for Engineering Business Expansion",
            "Summary": "IFB Industries Limited's Board of Directors approved a proposal for its wholly-owned subsidiary, Global Automotive and Appliances Pte Limited, Singapore, to invest in and establish a facility in Europe. The initiative aims to enhance the design and tooling capabilities of the company's Engineering Business. The board meeting took place on September 24, 2025, and the company will provide updates on developments as they progress.",
            "Sentiment": "positive",
            "PublishDate": 1758722585536,
            "Source": "stock"
        },
        {
            "Title": "IFB Industries Reports 5.3% Revenue Growth But Profitability Declines in Q1 FY26",
            "Summary": "IFB Industries Limited reported revenue of INR 1,310.82 crores in Q1 FY26, marking a 5.33% year-on-year growth from INR 1,244.44 crores in Q1 FY25. However, profitability metrics declined significantly with PBDIT dropping to INR 69.95 crores (5.34% of revenue) from INR 86.55 crores (6.95% of revenue) in the previous year. PAT fell to INR 25.36 crores (1.93% of revenue) from INR 38.84 crores (3.12% of revenue). The company's margins were impacted by commodity price increases and currency depreciation. Management acknowledged weak performance, with Chairman Bikramjit Nag stating the company has slipped. IFB is implementing cost optimization initiatives targeting INR 200 crores in material cost savings and INR 75 crores in fixed cost reduction over two years. The company operates in home appliances and engineering segments, with strong market positions in washing machines and plans to achieve double-digit EBITDA margins by end of FY26.",
            "Sentiment": "negative",
            "PublishDate": 1754911836605,
            "Source": "earnings"
        },
        {
            "Title": "IFB Industries Schedules Investor Call for Q1 FY26 Results Discussion",
            "Summary": "IFB Industries has scheduled an investor conference call on August 6, 2025, at 4:00 PM IST to discuss its unaudited financial results for the quarter ended June 30, 2025. The call will cover both standalone and consolidated results. The company's management team will be represented by Chairman Bikramjit Nag, MD P.H. Narayanan, CFO Soumitra Goswami, and other senior executives. IFB Industries has also released an investor presentation for the same period, which is available on the company's website along with the conference call link.",
            "Sentiment": "neutral",
            "PublishDate": 1754311821391,
            "Source": "earnings"
        },
        {
            "Title": "IFB Industries Shareholders Approve Re-appointment of Amar Singh Negi as Executive Director",
            "Summary": "IFB Industries Limited shareholders approved the re-appointment of Mr. Amar Singh Negi as Executive Director for a five-year term from October 30, 2025 to October 29, 2030. The decision was made at the company's 49th Annual General Meeting held on July 30, 2025. Mr. Negi holds a four-year post diploma in Electrical Engineering from YMCA Institute of Engineering Faridabad and has over 38 years of experience in various fields including Service Management. The company confirmed that the director fulfills all required conditions and is not debarred from holding the office.",
            "Sentiment": "neutral",
            "PublishDate": 1753968321256,
            "Source": "corporate_governance"
        },
        {
            "Title": "IFB Industries Appoints Raj Agarwal as New Internal Auditor",
            "Summary": "IFB Industries Limited appointed Mr. Raj Agarwal, a Chartered Accountant with membership number 311051, as the company's new Internal Auditor with immediate effect. The appointment was made on July 29, 2025, following approval by the Board of Directors based on the Audit Committee's recommendation. Mr. Agarwal replaces Mr. Rajeev Mundhra in this role.",
            "Sentiment": "neutral",
            "PublishDate": 1753796658516,
            "Source": "corporate_governance"
        },
        {
            "Title": "IFB Industries Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "IFB Industries reported Q1 revenue of 13.38 billion rupees, up from 12.69 billion rupees in the same period last year. However, profitability declined with consolidated net profit falling to 262 million rupees from 375 million rupees year-over-year. EBITDA dropped to 632 million rupees from 815 million rupees, while EBITDA margin compressed to 4.72% from 6.42% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1753794753085,
            "Source": "earnings"
        },
        {
            "Title": "IFB Agro Industries Reports Strong Q1 Performance with Net Profit Doubling Year-on-Year",
            "Summary": "IFB Agro Industries delivered robust quarterly results with consolidated net profit rising to 172 million rupees from 84 million rupees in the same period last year. Revenue increased to 4.16 billion rupees compared to 3.8 billion rupees year-on-year. The company's EBITDA more than doubled to 218 million rupees from 93 million rupees, while EBITDA margin expanded significantly to 5.25% from 2.46% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753746240273,
            "Source": "earnings"
        },
        {
            "Title": "IFB Industries Independent Director Rahul Choudhuri Resigns Upon Completion of Tenure",
            "Summary": "Rahul Choudhuri has resigned from his position as Independent Director of IFB Industries Limited, effective from the close of business hours on July 27, 2025. The resignation follows the completion of his tenure as per Section 149(11) of the Companies Act, 2013. Choudhuri served as a Non-Executive Independent Director and submitted his resignation letter to the Board of Directors citing completion of tenure as the reason for his departure.",
            "Sentiment": "neutral",
            "PublishDate": 1753705366195,
            "Source": "corporate_governance"
        },
        {
            "Title": "IFB Industries: Strong Q4 Performance and Strategic Investments Drive Stock Surge",
            "Summary": "IFB Industries reported a 27% stock gain over three months, outperforming the ET Consumer Durable index. Q4 FY25 saw revenue growth of 22.3% and net profit increase of 57.3%. The company plans to invest ₹200-₹220 crore across its businesses and implement cost-cutting measures. Top-load washer segment grew 22.3%, while front-load washers declined 1.3%. Ambitious targets set for refrigerator sales in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1750380113000,
            "Source": "earnings"
        },
        {
            "Title": "IFB Industries Reports Q4 Financial Results",
            "Summary": "IFB Industries has announced its Q4 financial results. The company's EBITDA increased to 620 million rupees from 470 million rupees year-over-year. The EBITDA margin improved to 4.65% from 4.31% in the same period. Consolidated net profit rose to 189 million rupees from 120 million rupees year-over-year and 311 million rupees quarter-over-quarter. Revenue for Q4 grew to 13.3 billion rupees from 10.9 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748449334000,
            "Source": "result"
        },
        {
            "Title": "India Imposes Anti-Dumping Duty on Chinese Roller Chain Imports",
            "Summary": "The Indian government has imposed an anti-dumping duty on roller chain imports from China, which is likely to benefit domestic manufacturers like IFB Industries. This measure aims to protect local industries from unfair competition by foreign producers selling goods at artificially low prices.",
            "Sentiment": "positive",
            "PublishDate": 1742874235000,
            "Source": "corporate_action"
        },
        {
            "Title": "IFB Industries: Q3 Profit Soars 78% Year-on-Year",
            "Summary": "IFB Industries reported Q3 FY25 results with profit rising 78.17% YoY to ₹31.09 crore. Revenue increased 9.36% YoY to ₹1269.52 crore. Operating income up 53.25% YoY. EPS at ₹7.67, up 77.96% YoY. Analyst consensus recommends 'Buy'.",
            "Sentiment": "positive",
            "PublishDate": 1738217157000,
            "Source": "earnings"
        },
        {
            "Title": "IFB Industries Reports Strong Q3 Financial Performance",
            "Summary": "IFB Industries has announced its Q3 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit increased to 311 million rupees, up from 174 million rupees in the same quarter last year and 314 million rupees in the previous quarter. Revenue also saw growth, reaching 12.7 billion rupees compared to 11.6 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738109883000,
            "Source": "earnings"
        },
        {
            "Title": "IFB Industries Reports Improved Q3 EBITDA and Margin",
            "Summary": "IFB Industries has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 900 million rupees, up from 658 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 7.09% from 5.67% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738064294000,
            "Source": "earnings"
        },
        {
            "Title": "IFB Industries Reports Strong Q3 Financial Performance",
            "Summary": "IFB Industries has announced its Q3 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit increased to 311 million rupees, up from 174 million rupees in the same quarter last year and 314 million rupees in the previous quarter. Revenue also saw growth, reaching 12.7 billion rupees compared to 11.6 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738064221000,
            "Source": "earnings"
        },
        {
            "Title": "IFB Industries: Q2 Results Highlight Margin Expansion Focus",
            "Summary": "IFB Industries' Q2 results are under review, with margin expansion identified as a key area to monitor according to Nirmal Bang.",
            "Sentiment": "neutral",
            "PublishDate": 1731053791000,
            "Source": "result"
        },
        {
            "Title": "IFB Industries: Stock Hits Record High on Stable Demand Outlook",
            "Summary": "IFB Industries' stock price reached a record high of Rs 2,242.30, surging 20% on the BSE. The company reported a 17% YoY increase in Q1 FY25 operating income, driven by strong AC sales. Management expects stable medium-term demand and projects low double-digit revenue growth for FY25. The consumer durables sector in India is forecasted to grow 8-10% this fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1729057696000,
            "Source": "normal_news"
        }
    ]
}