{
    "Symbol": "IFCI",
    "ISIN": "INE039A01010",
    "News": [
        {
            "Title": "IFCI Reports Q3FY26 Results with Mixed Performance",
            "Summary": "IFCI Limited announced Q3FY26 financial results showing standalone profit of ₹6.85 crore versus loss of ₹58.96 crore in Q3FY25, while consolidated profit reached ₹20.82 crore against loss of ₹8.74 crore year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1769688175004,
            "Source": "co_actions_results"
        },
        {
            "Title": "IFCI Shares Surge 30% on NSE IPO Optimism",
            "Summary": "IFCI shares jumped 30% in five sessions on renewed NSE IPO buzz. The NBFC holds indirect exposure to NSE through its 52% stake in SHCIL, which owns 4.4% of the exchange valued at ₹23,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1768802621834,
            "Source": "stocks"
        },
        {
            "Title": "IFCI Clarifies No Material Events Behind Volume Surge",
            "Summary": "IFCI Limited responds to BSE inquiry about recent trading volume increase, stating no undisclosed information or events affecting stock movement. Company maintains transparency in regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1768297621227,
            "Source": "stocks"
        },
        {
            "Title": "IFCI shares surge 21% in two days amid heavy volumes",
            "Summary": "IFCI shares rallied 21% over two consecutive days with trading volumes doubling to 12 crore shares. NSE issued notice on increased activity while Q2 FY26 showed 73% profit growth despite 4.3% revenue decline.",
            "Sentiment": "positive",
            "PublishDate": 1768284844640,
            "Source": "stocks"
        },
        {
            "Title": "IFCI Stock Surges Over 20% in Two Trading Sessions",
            "Summary": "IFCI Ltd. shares gained 5.60% intraday on Tuesday, following a 15% jump on Monday, marking a cumulative rise of over 20% across two consecutive trading sessions according to NSE data.",
            "Sentiment": "positive",
            "PublishDate": 1768283831461,
            "Source": "stocks"
        },
        {
            "Title": "IFCI Shares Hit Two-Month High on NSE IPO Hopes",
            "Summary": "IFCI shares surged to a two-month high, rising 5.62% to ₹59.60 on expectations of NSE's IPO listing. The company holds stake in NSE through Stock Holding Corporation merger approval received in 2024.",
            "Sentiment": "positive",
            "PublishDate": 1768281922761,
            "Source": "stocks"
        },
        {
            "Title": "IFCI Gets ₹13.64 Cr Tax Demand Under Section 154",
            "Summary": "IFCI Limited receives additional income tax demand of ₹13.64 crores from Assistant Commissioner following rectification order under Section 154 for Assessment Year 2019-20.",
            "Sentiment": "negative",
            "PublishDate": 1767706144193,
            "Source": "stocks"
        },
        {
            "Title": "IFCI shares surge 7% after NEDFi stake sale",
            "Summary": "IFCI shares jumped 7.30% to ₹54.12 after selling 10% NEDFi stake for ₹121.77 crore. Stock shows technical strength trading above 5 of 8 moving averages with rising institutional interest.",
            "Sentiment": "positive",
            "PublishDate": 1767095309885,
            "Source": "co_actions_results"
        },
        {
            "Title": "IFCI Limited Reports Quarterly Loss Despite Revenue Growth",
            "Summary": "IFCI Limited announced its quarterly results for the period ended September 30, 2025, showing a net loss of Rs. 23.51 crores compared to a profit of Rs. 31.44 crores in the previous quarter. Total revenue from operations increased to Rs. 359.21 crores from Rs. 355.51 crores. The company's Capital Risk Adequacy Ratio (CRAR) stands at negative 21.32%, below RBI guidelines. IFCI has received in-principle approval from the Department of Financial Services for group consolidation involving merger/amalgamation with certain group companies. The company recognized interest income of Rs. 23.03 crores on stage 3 assets but wrote it off as bad debts in the same period. On a consolidated basis, the group reported a net profit of Rs. 379.83 crores for the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762891194888,
            "Source": "earnings"
        },
        {
            "Title": "IFCI Reports 73% Jump in Quarterly Net Profit to 3.2 Billion Rupees",
            "Summary": "IFCI reported consolidated net profit of 3.2 billion rupees for the quarter, compared to 1.85 billion rupees in the same period last year, representing a 73% increase. The company's revenue grew to 7.3 billion rupees from 6.2 billion rupees year-over-year, marking an 18% rise.",
            "Sentiment": "positive",
            "PublishDate": 1762864139392,
            "Source": "earnings"
        },
        {
            "Title": "IFCI Limited's Credit Ratings Reaffirmed by Brickwork Ratings with Negative Outlook",
            "Summary": "Brickwork Ratings has reaffirmed the credit ratings for IFCI Limited's debt instruments. The Non-Convertible Debentures/Bonds and Proposed NCDs received BWR B+ ratings with a negative outlook, while Proposed Commercial Papers were rated BWR A4. The ratings are valid for twelve months until November 04, 2026.",
            "Sentiment": "negative",
            "PublishDate": 1762481832016,
            "Source": "stock"
        },
        {
            "Title": "IFCI Opens Special Window for Re-lodgement of Physical Share Transfer Requests",
            "Summary": "IFCI Limited has opened a special window for six months, from July 07, 2025 to January 06, 2026, allowing shareholders to re-lodge transfer requests for physical shares that were previously rejected or returned due to deficiencies. This initiative follows SEBI Circular SEBI/HO/MIRSD/MIRSD-PoD/P/CIR/2025/97 dated July 02, 2025. The window covers transfer requests originally lodged before the April 1, 2019 deadline. Eligible shareholders can submit requests to the company's compliance officer or registrar. The company notes that shares will only be issued in demat mode, and proper processes will be followed for transfer-cum-demat requests. IFCI has also transferred unclaimed shares and dividends to IEPF and encourages shareholders to update their KYC details.",
            "Sentiment": "neutral",
            "PublishDate": 1761904493273,
            "Source": "corporate_action"
        },
        {
            "Title": "IFCI Shares Jump 7% to Two-Month High Ahead of Annual General Meeting",
            "Summary": "IFCI shares surged 7.19% to Rs 60.69, reaching their highest level since July 25, breaking a two-day losing streak without any fundamental trigger. The stock later pared gains to trade 6.06% higher at Rs 60.05. The company announced its 32nd annual general meeting scheduled for October 29 at 11:30 a.m. through audiovisual means, with October 22 set as the cutoff date for voting rights. Remote e-voting will run from October 26-28, with book closure from October 23-29. Trading volume reached 7.3 times the 30-day average. IFCI is a public sector non-banking financial company established in 1948, operating six subsidiaries and one associate, providing financial support to industrial projects including Adani Mundra Ports and GMR Goa International. The stock has declined 4.59% over 12 months but risen 65.64% from its 52-week low of Rs 36.20.",
            "Sentiment": "positive",
            "PublishDate": 1759900002545,
            "Source": "stock"
        },
        {
            "Title": "IFCI Limited Appoints Rajeev Sachdev as Additional Non-Executive Director",
            "Summary": "IFCI Limited appointed Shri Rajeev Sachdev as Additional Director (Non-Executive-Non-Independent) on the company's Board effective August 25, 2025. Sachdev brings over 37 years of experience in the insurance and financial services sector, having joined Life Insurance Corporation of India in 1998 as a Direct Recruit Officer. He holds a B.Sc. in Physics and has worked across various departments at LIC, including roles at LIC Housing Finance Limited and Insurance Ombudsman. He currently serves as Director and Chief Executive of LIC Cards Services Limited, a wholly owned subsidiary of LIC of India. The company confirmed that Sachdev is not debarred by any regulatory authority and is not related to any existing Board member.",
            "Sentiment": "neutral",
            "PublishDate": 1756128350950,
            "Source": "corporate_governance"
        },
        {
            "Title": "IFCI Reports Q1 Net Profit of 624 Million Rupees After Previous Year Loss",
            "Summary": "IFCI posted a consolidated net profit of 624 million rupees in Q1, compared to a loss of 880 million rupees in the same period last year. The company's revenue increased to 4.07 billion rupees from 4 billion rupees year-over-year. EBITDA rose to 1.93 billion rupees from 1.78 billion rupees, while EBITDA margin improved to 47.30% from 45.81% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754872007625,
            "Source": "earnings"
        },
        {
            "Title": "IFCI Limited Reports Quarterly Results with 96.05% Gross NPA Ratio and Negative CRAR",
            "Summary": "IFCI Limited's board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone total income of Rs 180.86 crore and net profit of Rs 7.38 crore, with earnings per share of Rs 0.03. On consolidated basis, total income was Rs 444.86 crore with net profit of Rs 62.43 crore. The company faces significant asset quality challenges with gross NPA ratio at 96.05% and Capital Risk Adequacy Ratio at negative 21.85%, below RBI guidelines. IFCI received Rs 500 crore from Government of India in January 2025 for share capital subscription, with 8.07 crore equity shares allotted in February 2025. The Department of Financial Services has given in-principle approval for consolidation of IFCI Group involving merger/amalgamation of certain group companies.",
            "Sentiment": "negative",
            "PublishDate": 1754651952680,
            "Source": "earnings"
        },
        {
            "Title": "IFCI Limited Appoints Shri Shailesh Kumar as Government Director",
            "Summary": "IFCI Limited appointed Shri Shailesh Kumar as Government Director on its Board effective August 05, 2025. Kumar, a Central Secretariat Services Officer with DIN 11226831, holds a Master's degree in Physics and an MBA in Finance. He currently serves in the Ministry of Finance's Department of Financial Services, overseeing the Debt Recovery Division and Legal Cell. His previous roles include positions in the Ministry of Power as Deputy Secretary (Distribution), Union Public Service Commission, 14th Finance Commission as Deputy Director, and various ministries including Education, Civil Aviation, and Overseas Indian Affairs. The company confirmed he is not debarred by any regulatory authority and has no relationship with existing Board directors.",
            "Sentiment": "neutral",
            "PublishDate": 1754401816351,
            "Source": "corporate_governance"
        },
        {
            "Title": "IFCI Ltd Appoints Shailesh Kumar as New Director, Replacing Surjith Karthikeyan",
            "Summary": "The Government of India has nominated Shailesh Kumar, Deputy Secretary at the Department of Financial Services, Ministry of Finance, as Director on the Board of IFCI Ltd. The appointment is effective July 29, 2025, replacing Surjith Karthikeyan who ceased to be a Director on the same date. The nomination was made under Article 124(i) of the company's Articles of Association and is effective immediately until further orders from the government.",
            "Sentiment": "neutral",
            "PublishDate": 1753795644472,
            "Source": "corporate_governance"
        },
        {
            "Title": "NSE Reports Q1 Net Profit of 29 Billion Rupees, Up from 26 Billion Year-Over-Year",
            "Summary": "NSE achieved a net profit of 29 billion rupees in Q1, representing an increase from 26 billion rupees in the same period last year. IFCI and its unit collectively hold a 5% stake in NSE.",
            "Sentiment": "positive",
            "PublishDate": 1753780764476,
            "Source": "earnings"
        },
        {
            "Title": "IFCI Ltd: Board Approves Group-Level Consolidation Plan",
            "Summary": "IFCI Ltd's board approved a restructuring plan involving merger of key subsidiaries and consolidation of broking-related entities. The company will continue as an NBFC post-merger, exploring opportunities in custodial services, e-Stamping, and advisory segments. IFCI also plans to divest its stake in MPCON Ltd to the government.",
            "Sentiment": "positive",
            "PublishDate": 1752481715000,
            "Source": "corporate_action"
        },
        {
            "Title": "IFCI Board Proposes Merger of Group Firms with TFCT as Listed Entity",
            "Summary": "The Board of IFCI has suggested merging its group companies. The proposal includes making TFCT (Tourism Finance Corporation of India) the listed consolidated entity after the merger.",
            "Sentiment": "neutral",
            "PublishDate": 1752479472000,
            "Source": "default"
        },
        {
            "Title": "IFCI Reports Mixed Q4 Results",
            "Summary": "IFCI reported a consolidated net profit of 2.6 billion rupees in Q4, up from 1.6 billion rupees year-over-year. However, it showed a loss of 87 million rupees compared to the previous quarter. Q4 revenue decreased to 1.5 billion rupees from 2.7 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747321367000,
            "Source": "result"
        },
        {
            "Title": "IFCI to Consider Q4 Results on May 15",
            "Summary": "IFCI (Industrial Finance Corporation of India) has announced that it will consider its fourth quarter (Q4) financial results on May 15. This announcement indicates the company's compliance with regulatory requirements for timely financial reporting.",
            "Sentiment": "neutral",
            "PublishDate": 1745409648000,
            "Source": "default"
        },
        {
            "Title": "IFCI Reports Increased Net Loss in Q3 Financial Results",
            "Summary": "IFCI, a financial institution, has reported its Q3 financial results. The company's consolidated net loss has widened to 306 million rupees, compared to 179 million rupees in the same quarter last year and 826 million rupees in the previous quarter. Revenue for Q3 slightly increased to 4.57 billion rupees from 4.54 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739367812000,
            "Source": "earnings"
        },
        {
            "Title": "IFCI to Receive 5 Billion Rupees from Government of India",
            "Summary": "IFCI has announced that the Government of India has sanctioned 5 billion rupees to the company. In response, IFCI will consider a preferential issue of shares to the Government of India on January 29.",
            "Sentiment": "positive",
            "PublishDate": 1737726312000,
            "Source": "corporate_action"
        },
        {
            "Title": "India Plans to Halt IFCI's Lending Operations Permanently",
            "Summary": "According to Reuters, the Indian government intends to permanently cease the lending operations of IFCI (Industrial Finance Corporation of India). This decision suggests a significant change in the operational structure of this financial institution, potentially impacting its future role in the Indian financial sector.",
            "Sentiment": "negative",
            "PublishDate": 1732597731000,
            "Source": "corporate_action"
        },
        {
            "Title": "IFCI Ltd: Board Approves Group Companies Merger",
            "Summary": "IFCI Ltd's board has approved the merger and consolidation of several group entities, including StockHolding Corp. of India and IFCI Factors Ltd. The move aims to streamline operations and enhance efficiency. The stock price surged over 15% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1732521269000,
            "Source": "corporate_action"
        },
        {
            "Title": "IFCI Receives Approval to Merge Stockholding Corporation of India",
            "Summary": "IFCI has announced that it has received approval from the Department of Financial Services to merge Stockholding Corporation of India and its group companies with IFCI.",
            "Sentiment": "positive",
            "PublishDate": 1732280457000,
            "Source": "corporate_action"
        },
        {
            "Title": "IFCI: Q2 Profit Dips 12.73% YoY Despite Revenue Growth",
            "Summary": "IFCI reported Q2 2024 results with revenue up 7.47% YoY to ₹586.91 crore, but profit down 12.73% to ₹82.62 crore. QoQ performance improved significantly with revenue up 57.08% and profit up 176.36%. EPS rose to ₹0.64, a 261.32% YoY increase.",
            "Sentiment": "neutral",
            "PublishDate": 1731654153000,
            "Source": "result"
        },
        {
            "Title": "IFCI Reports Mixed Q2 Financial Results",
            "Summary": "IFCI Limited has reported its Q2 financial results. The consolidated net profit increased year-over-year to 1.85 billion rupees from 1.7 billion rupees. However, compared to the previous quarter, the company reported a loss of 880 million rupees. Q2 revenue showed a slight increase to 6.2 billion rupees from 6.06 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731511675000,
            "Source": "result"
        }
    ]
}