{
    "Symbol": "IFGLEXPOR",
    "ISIN": "INE133Y01011",
    "News": [
        {
            "Title": "IFGL Refractories Board Meet Set for Feb 14, 2026",
            "Summary": "IFGL Refractories Ltd has scheduled a board meeting on February 14, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770129831371,
            "Source": "co_actions_results"
        },
        {
            "Title": "IFGL Refractories CHRO Abhay Kapoor Resigns",
            "Summary": "IFGL Refractories Ltd announces resignation of Chief Human Resource Officer Abhay Kapoor effective January 27, 2026, citing personal reasons for departure from leadership position.",
            "Sentiment": "neutral",
            "PublishDate": 1769520052432,
            "Source": "stocks"
        },
        {
            "Title": "IFGL Refractories' UK subsidiary faces auditor change",
            "Summary": "IFGL Refractories disclosed that its UK material subsidiary Sheffield Refractories' auditor C J Woodhead & Co went into insolvency in October 2025, prompting appointment of new audit firm.",
            "Sentiment": "negative",
            "PublishDate": 1768917043335,
            "Source": "stocks"
        },
        {
            "Title": "IFGL Refractories Wins Supreme Court Case for ₹11.15 Lacs",
            "Summary": "Supreme Court allows IFGL Refractories' claim for subsidies worth ₹11.15 lacs with 9% annual interest since 2003, marking a significant legal victory for the company.",
            "Sentiment": "positive",
            "PublishDate": 1767707171365,
            "Source": "stocks"
        },
        {
            "Title": "IFGL Refractories seeks postal ballot approval for key appointments",
            "Summary": "IFGL Refractories Limited has issued a postal ballot notice dated January 2, 2026, seeking shareholder approval for re-appointment of Executive Chairman Shishir Kumar Bajoria and Director-General Counsel Rajesh Agarwal for three-year terms.",
            "Sentiment": "neutral",
            "PublishDate": 1767671932251,
            "Source": "stocks"
        },
        {
            "Title": "IFGL Refractories Appoints New Chief HR Officer",
            "Summary": "IFGL Refractories Ltd has appointed Mr. Abhay Kapoor as Chief Human Resource Officer effective December 17, 2025, bringing over 25 years of strategic HR experience to the leadership team.",
            "Sentiment": "positive",
            "PublishDate": 1765979236708,
            "Source": "stocks"
        },
        {
            "Title": "IFGL Refractories Promoter Group Member Sells 4.37 Lakh Equity Shares",
            "Summary": "Mihir Prakash Bajoria, part of the Indian Promoter Group of IFGL Refractories Ltd, sold 4,37,490 equity shares of Rs. 10 each fully paid-up. The company disclosed this transaction under SEBI insider trading regulations through Form C filing dated December 5, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764933747380,
            "Source": "corporate_action"
        },
        {
            "Title": "Bajoria Financial Services to Acquire Additional 4.37 Lakh Shares in IFGL Refractories",
            "Summary": "Bajoria Financial Services Private Limited will acquire 4,37,490 equity shares (0.61% stake) in IFGL Refractories Limited from Mr Mihir Prakash Bajoria at Rs. 212 per share, scheduled for December 3, 2025 or after. This inter-se transfer among promoter group members will increase Bajoria Financial's shareholding from 66.72% to 67.33%, while maintaining the overall promoter group holding at 72.43%.",
            "Sentiment": "neutral",
            "PublishDate": 1764310027433,
            "Source": "corporate_action"
        },
        {
            "Title": "IFGL Refractories: Promoter Group Entity Acquires 4.37 Lakh Shares in Internal Transfer",
            "Summary": "Bajoria Financial Services Pvt Ltd will acquire 4,37,490 equity shares (0.61% stake) of IFGL Refractories Limited from Mr Mihir Prakash Bajoria at Rs 212 per share, scheduled for on or after December 3, 2025. This inter-promoter group transfer will keep the overall promoter and promoter group shareholding unchanged, with the transaction exempt from open offer requirements under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764168080063,
            "Source": "corporate_action"
        },
        {
            "Title": "IFGL Refractories Appoints Dr Sushil Kumar Ojha as CHRO",
            "Summary": "IFGL Refractories Limited has appointed Dr Sushil Kumar Ojha as Chief Human Resources Officer effective November 24, 2025, who will report to Director and CEO India Mr Arasu Shanmugam. Dr Ojha brings over 20 years of experience in Human Resources and Industrial Relations with expertise in talent management, capability development, and strategic workforce planning.",
            "Sentiment": "positive",
            "PublishDate": 1763996444754,
            "Source": "corporate_governance"
        },
        {
            "Title": "IFGL Refractories Reports 18% Consolidated Revenue Growth in Q2FY26 Earnings Call",
            "Summary": "IFGL Refractories delivered consolidated total income growth of 18% year-on-year to INR 490 crores in Q2FY26, with domestic business growing 27% while exports declined 20%. The company announced two greenfield projects worth INR 300-350 crores each in Odisha and Gujarat, targeting completion by FY2028-29, while European operations showed improvement and US operations grew 26%.",
            "Sentiment": "positive",
            "PublishDate": 1763395543114,
            "Source": "earnings"
        },
        {
            "Title": "IFGL Refractories Reports Quarterly Financial Results with Total Income of ₹49,064 Lakhs",
            "Summary": "IFGL Refractories Limited disclosed its unaudited consolidated financial results for the quarter and six months ended September 30, 2025. The company reported total income of ₹49,064 lakhs for the quarter, compared to ₹45,701 lakhs in the previous quarter and ₹41,503 lakhs in the same quarter last year. Net profit after tax stood at ₹1,269 lakhs for the quarter, up from ₹1,081 lakhs in the previous quarter. For the six-month period, total income reached ₹94,765 lakhs with net profit after tax of ₹2,350 lakhs. The company's earnings per share for the quarter was ₹1.76. The results were reviewed by the Audit Committee and approved by the Board of Directors on November 8, 2025. The company had issued bonus shares in July 2025 at a 1:1 ratio, and earnings per share figures have been adjusted accordingly for all periods presented. Additionally, the company's UK-based subsidiary incorporated a wholly-owned subsidiary in Australia named Monocon Australia Pty Limited in July 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762762378474,
            "Source": "earnings"
        },
        {
            "Title": "IFGL Refractories Reports Q2 Net Profit Growth to 126.9M Rupees",
            "Summary": "IFGL Refractories reported consolidated net profit of 126.9 million rupees for Q2, up from 120.8 million rupees in the same period last year. Revenue increased to 4.89 billion rupees from 4.11 billion rupees year-over-year. EBITDA rose to 380 million rupees compared to 326 million rupees previously. However, EBITDA margin declined slightly to 7.77% from 7.93% in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1762627656324,
            "Source": "earnings"
        },
        {
            "Title": "IFGL Refractories Reports Quarterly Results and Board Approvals",
            "Summary": "IFGL Refractories Limited's Board approved unaudited financial results for the quarter and six months ended September 30, 2025, on both standalone and consolidated basis. The company re-appointed Shishir Kumar Bajoria as Executive Chairman for three years from April 1, 2026 to March 31, 2029, and Rajesh Agarwal as Director-General Counsel for three years from November 12, 2025 to November 11, 2028. The financial results were subject to limited review by statutory auditors S.R. Batliboi Co. LLP and reviewed by the Audit Committee. The company operates in manufacturing specialized refractories and has seventeen subsidiaries in its consolidated results.",
            "Sentiment": "neutral",
            "PublishDate": 1762610067348,
            "Source": "earnings"
        },
        {
            "Title": "IFGL Refractories Appoints Manoranjan Beura as Chief Sales Officer",
            "Summary": "IFGL Refractories Ltd appointed Manoranjan Beura as Chief Sales Officer effective October 14, 2025. Beura holds a Bachelor's degree in Mechanical Engineering and an Executive MBA from IIM Vizag, bringing over two decades of experience in Sales, Marketing, and Supply Chain Management within the refractory industry.",
            "Sentiment": "positive",
            "PublishDate": 1760446322083,
            "Source": "corporate_governance"
        },
        {
            "Title": "IFGL Refractories Announces Leadership Change at Material Subsidiary EI Ceramics LLC",
            "Summary": "Ian Proudfoot retired as President of EI Ceramics LLC, a material subsidiary of IFGL Refractories Ltd, effective August 31, 2025. Graham Carson, who previously served as Vice President (Sales), has been promoted to President of EIC starting September 1, 2025. Proudfoot will continue as a Consultant for six months beginning September 1, 2025. Carson holds HNC in Mechanical and Production Engineering from Clydebank Technical College, Scotland and has over three decades of experience in the refractory industry worldwide.",
            "Sentiment": "neutral",
            "PublishDate": 1757590903683,
            "Source": "corporate_governance"
        },
        {
            "Title": "IFGL Refractories Approves Final Dividend of Rs 1 Per Share and Appoints Mihir Bajoria as Director",
            "Summary": "IFGL Refractories Ltd approved a final dividend of 10% (Rs 1 per equity share) for financial year 2024-25 at its 18th Annual General Meeting. This is in addition to the interim dividend of 60% (Rs 6 per equity share) already paid. The final dividend will be paid on or after September 1, 2025 to shareholders whose names appear on the register as of June 6, 2025. The company also appointed Mihir Prakash Bajoria as Non-Executive Non-Independent Director effective August 27, 2025. Bajoria is the son of Executive Chairman Shishir Kumar Bajoria and holds a diploma in Politics and International Relations from Oxford Brookes University. He serves as Executive Chairman of the company's UK subsidiary Monocon International Refractories Limited and has over a decade of experience in the refractory industry.",
            "Sentiment": "positive",
            "PublishDate": 1756301700846,
            "Source": "corporate_action"
        },
        {
            "Title": "IFGL Refractories Receives Show Cause Notice for Operating Consent Revocation",
            "Summary": "IFGL Refractories has received a show cause notice from the pollution authority regarding the potential revocation of its consent to operate. The notice indicates regulatory scrutiny over the company's environmental compliance.",
            "Sentiment": "negative",
            "PublishDate": 1755708698919,
            "Source": "stock"
        },
        {
            "Title": "IFGL Refractories Targets Global Expansion and Profit Growth",
            "Summary": "IFGL Refractories is pursuing global expansion and profit growth through cost control measures and new product development. The company has a positive outlook for FY26, driven by expected steel demand and export orders.",
            "Sentiment": "positive",
            "PublishDate": 1755013695479,
            "Source": "stock"
        },
        {
            "Title": "Ifgl Refractories Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "Ifgl Refractories reported consolidated net profit of 108 million rupees in Q1, down from 247 million rupees in the same period last year. Revenue increased to 4.54 billion rupees from 4.1 billion rupees year-over-year. EBITDA declined to 360 million rupees from 461 million rupees, while EBITDA margin compressed to 7.93% from 11.12% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754872146052,
            "Source": "earnings"
        },
        {
            "Title": "IFGL Refractories Reports 56% Drop in Q1 Net Profit Despite Revenue Growth",
            "Summary": "IFGL Refractories reported Q1 consolidated net profit of 108 million rupees, down from 247 million rupees in the same period last year. Revenue increased to 4.54 billion rupees from 4.1 billion rupees year-over-year. EBITDA declined to 360 million rupees from 461 million rupees, while EBITDA margin compressed to 7.93% from 11.12% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754735718119,
            "Source": "earnings"
        },
        {
            "Title": "IFGL Refractories Extends Managing Director James Leacock McIntosh's Term by Six Months",
            "Summary": "IFGL Refractories Ltd announced that James Leacock McIntosh will continue as Managing Director for an additional six months from September 1, 2025. This extension follows Mihir Prakash Bajoria's decision to not assume the Managing Director role due to personal difficulties, despite earlier plans announced in February 2025 for him to take over the position. Bajoria, who is the son of the company's Executive Chairman Shishir Kumar Bajoria, will remain as Non-Executive Director but will not continue as Chairman of the UK subsidiary Monocon International Refractories Limited. The company's Nomination and Remuneration Committee and Board approved McIntosh's extension on the same terms and conditions. McIntosh has served as Managing Director since September 1, 2021, and previously held the position of President at the company's US subsidiary EI Ceramics LLC.",
            "Sentiment": "neutral",
            "PublishDate": 1754733395029,
            "Source": "corporate_governance"
        },
        {
            "Title": "IFGL Refractories Reports 14% Revenue Growth But 33% Profit Decline in Q1 FY2026",
            "Summary": "IFGL Refractories Limited reported mixed quarterly results with standalone revenue growing 14% to ₹27,547 lakhs and consolidated revenue up 9.5% to ₹45,401 lakhs. However, profitability declined significantly with standalone net profit falling 33% to ₹1,474 lakhs and consolidated net profit dropping 56.1% to ₹1,081 lakhs. EBITDA margins compressed substantially from 17.9% to 13.5% on standalone basis and from 12.6% to 8.5% on consolidated basis. Geographically, India operations grew 13.8% while Europe declined 1.7% and America surged 25.3%. The company completed a 1:1 bonus share issue and established a new subsidiary in Australia through its UK arm. The results were approved by the Board and reviewed by auditors with an unmodified conclusion, though emphasis was placed on goodwill amortization treatment.",
            "Sentiment": "negative",
            "PublishDate": 1754728458082,
            "Source": "earnings"
        },
        {
            "Title": "IFGL Refractories Reports Q4 Results and Approves Bonus Share Issue",
            "Summary": "IFGL Refractories announced its Q4 consolidated net profit of 84 million rupees, down from 125 million rupees in the same quarter last year. The company's Q4 revenue increased to 4.49 billion rupees from 3.94 billion rupees year-over-year. Additionally, IFGL Refractories approved the issue of bonus shares in a 1:1 ratio.",
            "Sentiment": "neutral",
            "PublishDate": 1748229945000,
            "Source": "result"
        },
        {
            "Title": "IFGL Refractories Declares Interim Dividend",
            "Summary": "IFGL Refractories has announced an interim dividend of 6 rupees per equity share for the financial year 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1746632173000,
            "Source": "result"
        },
        {
            "Title": "IFGL Refractories Acquires Land in Kutch",
            "Summary": "IFGL Refractories has purchased 16.35 acres of land in Kutch for 30.6 million rupees. This acquisition suggests potential expansion plans or new facility development for the company in the region.",
            "Sentiment": "positive",
            "PublishDate": 1745417535000,
            "Source": "default"
        },
        {
            "Title": "IFGL Refractories to Establish DBM Bricks and Mass Facility in Odisha",
            "Summary": "IFGL Refractories has announced plans to set up a new manufacturing facility for DBM (Dead Burned Magnesia) bricks and mass in Odisha. This expansion indicates the company's efforts to increase its production capacity and potentially strengthen its market position in the refractory materials sector.",
            "Sentiment": "positive",
            "PublishDate": 1745223713000,
            "Source": "default"
        },
        {
            "Title": "Court Allows IFGL Refractories' Appeal, Resumes Activities",
            "Summary": "IFGL Refractories announced that a court has allowed their appeal and set aside a previous status quo order. As a result, the company has resumed its activities effective March 20, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1742516390000,
            "Source": "corporate_governance"
        },
        {
            "Title": "IFGL Refractories Wins Court Appeal, Resumes Activities",
            "Summary": "IFGL Refractories announced that a court has allowed their appeal and set aside a previous status quo order. As a result, the company has resumed its activities effective March 20, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1742478233000,
            "Source": "corporate_governance"
        },
        {
            "Title": "IFGL Refractories Receives Administrative Warning from SEBI",
            "Summary": "IFGL Refractories has been issued an administrative warning by the Securities and Exchange Board of India (SEBI) for non-disclosure of certain information. The company has stated that this warning will not have any impact on its financial performance or operational activities.",
            "Sentiment": "neutral",
            "PublishDate": 1741651484000,
            "Source": "corporate_governance"
        },
        {
            "Title": "IFGL Refractories Receives Administrative Warning from SEBI",
            "Summary": "IFGL Refractories has been issued an administrative warning by the Securities and Exchange Board of India (SEBI) for non-disclosure. The company states that this warning will have no impact on its financial performance or operations.",
            "Sentiment": "neutral",
            "PublishDate": 1741609037000,
            "Source": "corporate_governance"
        },
        {
            "Title": "IFGL Refractories Reports Significant EBITDA Improvement in Q3",
            "Summary": "IFGL Refractories has reported a substantial improvement in its Q3 EBITDA, moving from a loss of 42 million rupees in the previous year to a gain of 169 million rupees. The company's Q3 EBITDA margin stands at 4.40%.",
            "Sentiment": "positive",
            "PublishDate": 1739015479000,
            "Source": "earnings"
        },
        {
            "Title": "IFGL Refractories Reports Q3 Financial Results",
            "Summary": "IFGL Refractories has reported its Q3 consolidated financial results. The company experienced a net loss of 22 million rupees, compared to a profit of 15 million rupees in the same quarter last year. However, the company's revenue increased to 3.79 billion rupees from 3.66 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739015461000,
            "Source": "earnings"
        },
        {
            "Title": "IFGL Refractories to Consider Q3 Results on February 8",
            "Summary": "IFGL Refractories has announced that it will consider its third quarter (Q3) financial results on February 8. This indicates that the company is preparing to review and potentially approve its quarterly financial performance for public disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1737385193000,
            "Source": "earnings"
        },
        {
            "Title": "IFGL Refractories Reports Q2 Financial Results",
            "Summary": "IFGL Refractories Ltd. has released its Q2 consolidated financial results. The company reported a net profit of 120 million rupees, which is lower compared to 380 million rupees in the same quarter last year (YoY) and 246 million rupees in the previous quarter (QoQ). Revenue for Q2 stood at 4.11 billion rupees, down from 4.55 billion rupees YoY and 4.14 billion rupees QoQ.",
            "Sentiment": "negative",
            "PublishDate": 1731284259000,
            "Source": "result"
        },
        {
            "Title": "IFGL Refractories: Board Approves Rs 300 Crore Joint Venture for New Facility",
            "Summary": "<p>IFGL Refractories' board has <span class='positive'>approved</span> entering a <b>joint venture agreement</b> with Marvels International Group and Marvel Refractories to establish a <span class='positive'>greenfield facility</span> in India. The project, with a <span class='neutral'>capital outlay of about Rs 300 crore</span>, will <span class='positive'>manufacture products</span> for the <b>Cement, Glass, Non-Ferrous, and Gasification industries</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728544500000,
            "Source": "corporate_action"
        }
    ]
}