{
    "Symbol": "IGARASHI",
    "ISIN": "INE188B01013",
    "News": [
        {
            "Title": "Igarashi Motors Q3FY26 Results: Profit Drops 32% YoY",
            "Summary": "Igarashi Motors India reported Q3FY26 net profit of Rs 350.39 lakhs, down 32% from Rs 515.57 lakhs in Q3FY25. Revenue remained stable at Rs 21,609.35 lakhs with automotive segment contributing 90%.",
            "Sentiment": "negative",
            "PublishDate": 1770796595766,
            "Source": "co_actions_results"
        },
        {
            "Title": "Igarashi Motors India Reports Quarterly Financial Results for September 2025",
            "Summary": "Igarashi Motors India Limited submitted its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported revenue from operations of Rs 21,505.04 lakhs for the quarter, compared to Rs 17,732.30 lakhs in the previous year quarter. Profit for the quarter stood at Rs 597.71 lakhs versus Rs 250.97 lakhs in the corresponding period last year. For the half-year period, revenue reached Rs 41,673.65 lakhs with profit of Rs 1,273.09 lakhs. The company operates in two segments - Automotive and Non-Automotive manufacturing. Basic earnings per share for the quarter was Rs 1.90 compared to Rs 0.80 in the previous year quarter. The Board of Directors approved these results at their meeting held on November 6, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762415757294,
            "Source": "earnings"
        },
        {
            "Title": "Igarashi Motors Reports Mixed Q2 Results with Revenue Growth but Lower Profitability",
            "Summary": "Igarashi Motors reported Q2 revenue of 2.2 billion rupees, up from 2.16 billion rupees in the previous year. However, the company's profitability declined with EBITDA falling to 235 million rupees from 263 million rupees year-over-year. EBITDA margin compressed to 10.7% from 12.17% in the same period last year. Net profit dropped significantly to 45 million rupees compared to 78 million rupees in the prior year quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762414555163,
            "Source": "earnings"
        },
        {
            "Title": "Igarashi Motors Reports Decline in Q1 Revenue and Net Profit",
            "Summary": "Igarashi Motors reported Q1 revenue of 2 billion rupees, down from 2.2 billion rupees in the same period last year. The company's net profit fell significantly to 25 million rupees compared to 82 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754553221983,
            "Source": "earnings"
        },
        {
            "Title": "Igarashi Motors Reports Q4 Financial Results",
            "Summary": "Igarashi Motors has released its Q4 financial results. The company's EBITDA decreased to 197 million rupees from 224 million rupees year-over-year. The EBITDA margin declined to 10.4% from 10.97% in the same period last year. Revenue dropped to 1.9 billion rupees from 2.04 billion rupees year-over-year. Net profit also decreased to 31 million rupees from 51 million rupees compared to the previous year's quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747905095000,
            "Source": "result"
        },
        {
            "Title": "Igarashi Motors India: Q3 Profit Soars 230.77% YoY, Revenue Up 21.32%",
            "Summary": "Igarashi Motors India reported Q3 FY25 results with profit rising to ₹5.16 crore, up 230.77% YoY. Revenue increased by 21.32% to ₹210.8 crore. EPS grew to ₹1.64, a 234.69% YoY increase. However, quarter-on-quarter performance showed declines in revenue and profit.",
            "Sentiment": "positive",
            "PublishDate": 1739345719000,
            "Source": "earnings"
        },
        {
            "Title": "Igarashi Motors Reports Q3 Revenue Growth",
            "Summary": "Igarashi Motors has announced its financial results for the third quarter. The company reported revenue of 2.1 billion rupees, compared to 1.74 billion rupees in the same period last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739259292000,
            "Source": "earnings"
        },
        {
            "Title": "Igarashi Motors Reports Improved Q3 EBITDA and Margin",
            "Summary": "Igarashi Motors has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 237 million rupees, up from 174 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin improved to 11.26% from 10.00% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739259286000,
            "Source": "earnings"
        },
        {
            "Title": "Igarashi Motors Reports Significant Increase in Q3 Net Profit",
            "Summary": "Igarashi Motors has reported a substantial year-over-year increase in its third-quarter net profit. The company's net profit for Q3 rose to 52 million rupees, compared to 15 million rupees in the same period last year, marking a significant improvement in financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1739259228000,
            "Source": "earnings"
        },
        {
            "Title": "Igarashi Motors Reports Q2 Revenue Increase",
            "Summary": "Igarashi Motors has announced its Q2 revenue of 2.1 billion rupees, showing an increase from 1.8 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731573927000,
            "Source": "result"
        },
        {
            "Title": "Igarashi Motors Reports Significant Profit Increase in Q2",
            "Summary": "Igarashi Motors has reported a substantial year-over-year increase in net profit for the second quarter. The company's net profit rose to 78 million rupees, up from 15 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731573868000,
            "Source": "result"
        }
    ]
}