{
    "Symbol": "IGCL",
    "ISIN": "INE05J901018",
    "News": [
        {
            "Title": "IGCL Reports Q3 FY26 Results, Key Board Decisions",
            "Summary": "Indogulf Cropsciences Limited announced Q3 FY26 financial results with revenue of ₹1,085.81 million and profit of ₹41.06 million. Board approved key appointments including internal auditor and re-appointments of executive directors.",
            "Sentiment": "positive",
            "PublishDate": 1770819965423,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indogulf Cropsciences Wins Innovation Excellence Award",
            "Summary": "Indogulf Cropsciences Limited receives Innovation Excellence Award at National Prestige Awards, presented by actor Tushar Kapoor for research-driven solutions in agri-inputs sector.",
            "Sentiment": "positive",
            "PublishDate": 1770819417636,
            "Source": "stocks"
        },
        {
            "Title": "Indogulf Cropsciences Q3FY26 Earnings Call on Feb 12",
            "Summary": "Indogulf Cropsciences Limited announces Q3 FY26 earnings conference call scheduled for February 12, 2026 at 12:00 PM IST, with management discussing financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1770459019683,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indogulf Cropsciences Re-appoints Two Independent Directors",
            "Summary": "Indogulf Cropsciences has re-appointed Mr. Rahul Gupta and Mr. Sandeep Bhutani as Non-Executive Independent Directors for their second consecutive terms of 5 years each, effective December 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766994631207,
            "Source": "stocks"
        },
        {
            "Title": "Indogulf Cropsciences Announces Senior Management Changes",
            "Summary": "Indogulf Cropsciences appoints Deepak Tuli as VP-Accounts and announces resignation of Surinder Kumar as VP-Sales Marketing, both effective December 13, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765619952465,
            "Source": "stocks"
        },
        {
            "Title": "Indogulf Cropsciences Reports 7% Revenue Growth in Q2 FY26 Despite Weather Challenges",
            "Summary": "Indogulf Cropsciences achieved INR 2,483 million revenue in Q2 FY26 with 7% YoY growth, while H1 FY26 revenue reached INR 4,377 million showing 20% YoY growth, driven by strong branded B2C business performance despite extended monsoons and geopolitical export challenges. The company reported 17% YoY increase in EBITDA to INR 320 million and 24% YoY rise in PAT to INR 207 million for Q2, with management expecting better H2 performance due to improved water reservoir levels supporting the upcoming Rabi season.",
            "Sentiment": "positive",
            "PublishDate": 1763533003327,
            "Source": "earnings"
        },
        {
            "Title": "Indogulf Cropsciences Reports Strong Q2 Performance with 245% Revenue Growth",
            "Summary": "Indogulf Cropsciences Limited announced its quarterly results for the quarter and half year ending September 30, 2025. The company reported revenue from operations of Rs 249.34 crores for the quarter compared to Rs 94.38 crores in the same period last year, representing significant growth. Net profit for the quarter stood at Rs 206.85 crores versus Rs 166.71 crores in the previous year. For the half year period, revenue reached Rs 437.15 crores against Rs 197.53 crores last year, while net profit was Rs 245.52 crores compared to Rs 180.18 crores. The company operates in agro-chemicals manufacturing and distribution with one business segment comprising technical and formulation products. During the quarter, the company allotted 1,64,36,541 fresh equity shares through public issue at face value of Rs 10 with a premium of Rs 101. The shares were subsequently listed on BSE Limited and National Stock Exchange of India Limited. Basic earnings per share for the quarter was Rs 1.73 compared to Rs 4.07 in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1763002433739,
            "Source": "earnings"
        },
        {
            "Title": "Indogulf Cropsciences Announces Q2 FY26 Earnings Conference Call",
            "Summary": "Indogulf Cropsciences Limited has scheduled its Q2 FY26 earnings conference call for November 13, 2025 at 4:00 PM IST. The call will be hosted by Managing Director Mr. Sanjay Aggarwal and Chief Financial Officer Mr. Manoj Gupta to discuss the company's financial performance. The company has provided dial-in numbers for various countries and a pre-registration link for participants.",
            "Sentiment": "neutral",
            "PublishDate": 1762784577790,
            "Source": "earnings"
        },
        {
            "Title": "Abakkus Diversified Alpha Fund Holds 4.02% Stake in Indogulf Cropscience",
            "Summary": "Abakkus Diversified Alpha Fund, managed by Sunil Singhania, has emerged as a stakeholder in Indogulf Cropscience with a 4.02% equity position in the second quarter. This represents a new shareholding disclosure for the fund in the agricultural chemicals company.",
            "Sentiment": "neutral",
            "PublishDate": 1760060527092,
            "Source": "stock"
        },
        {
            "Title": "Indogulf Cropsciences Reports 43% Revenue Growth in Q1 FY26 Earnings Call",
            "Summary": "Indogulf Cropsciences Limited held its Q1 FY26 earnings conference call on August 14, 2025, reporting revenue of INR 1,894 million, reflecting 43.3% year-on-year growth. The company's domestic B2B segment grew 73.4% while B2C segment increased 17.0%. EBITDA grew 66.7% to INR 99 million, and profit before tax reached INR 46 million, representing a 509% increase. The crop protection business contributed over 90% of total revenue. Management highlighted strong performance in biologicals (24.1% growth) and plant nutrition (9.5% growth). The subsidiary AGPL contributed 6% of Q1 revenue. Regional markets showed significant growth with Maharashtra up 83%, Odisha 50%, and Haryana 27%. Gross margins declined to 22% from 24.6% in the previous year due to higher B2B sales mix. The company expects continued growth trajectory with Q2 traditionally being stronger for B2C business. Management projects 30-35% annual revenue growth and expects improved margins in upcoming quarters. The company is expanding capacity with a new dry flowable plant and fifth manufacturing unit, targeting completion by fiscal year end.",
            "Sentiment": "positive",
            "PublishDate": 1755603049894,
            "Source": "earnings"
        },
        {
            "Title": "Indogulf Cropsciences Reports Strong Q1 Growth with Revenue Up 43% and Net Profit Nearly Tripling",
            "Summary": "Indogulf Cropsciences delivered robust quarterly performance with revenue rising to 1.89 billion rupees from 1.32 billion rupees year-over-year. The company's consolidated net profit surged to 39 million rupees compared to 13 million rupees in the same period last year. EBITDA increased to 99 million rupees from 60 million rupees, while EBITDA margin improved to 5.24% from 4.5% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1755073938573,
            "Source": "earnings"
        },
        {
            "Title": "Indogulf Cropsciences Approves Audited Financial Results for Year Ended March 31, 2025",
            "Summary": "Indogulf Cropsciences Limited's Board of Directors approved the audited standalone and consolidated financial results for the financial year ended March 31, 2025, during a board meeting held on July 24, 2025. The company received unmodified audit opinions on both standalone and consolidated results from auditors Devesh Parekh & Co. The consolidated results include subsidiaries Abhiprakash Globus Private Limited and Indogulf Cropsciences Australia Pty Ltd. The board meeting was conducted through video conferencing from 4:00 PM to 6:00 PM IST, and the results will be hosted on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1753369511951,
            "Source": "earnings"
        }
    ]
}