{
    "Symbol": "IGIL",
    "ISIN": "INE0Q9301021",
    "News": [
        {
            "Title": "IGI India Declares Rs 2.50 Interim Dividend, Name Change",
            "Summary": "International Gemmological Institute (India) Limited announces second interim dividend of Rs 2.50 per share for FY26 and approves company name change to International Gemological Institute Limited.",
            "Sentiment": "positive",
            "PublishDate": 1770785505859,
            "Source": "co_actions_results"
        },
        {
            "Title": "IGI India Board Approves USD 18 Million Investment Plan",
            "Summary": "International Gemmological Institute (India) Limited's board approved USD 9 million investment in IGI Belgium, which will further invest USD 9 million in IGI USA for strategic expansion.",
            "Sentiment": "positive",
            "PublishDate": 1769883502869,
            "Source": "co_actions_results"
        },
        {
            "Title": "IGI Acquires AGL for USD 13.2 Million via Step-Down Unit",
            "Summary": "International Gemmological Institute (India) Limited announces acquisition of American Gemological Laboratories through step-down subsidiary IGI USA for USD 13.2 million to expand colored gemstone certification globally.",
            "Sentiment": "positive",
            "PublishDate": 1769867182452,
            "Source": "co_actions_results"
        },
        {
            "Title": "IGI India Reports Strong Q3 Growth with 18% Revenue Jump",
            "Summary": "International Gemmological Institute posts Q3 consolidated net profit of ₹1.35 billion, up from ₹1.14 billion YoY, while revenue climbs to ₹3.2 billion from ₹2.65 billion.",
            "Sentiment": "positive",
            "PublishDate": 1769518052856,
            "Source": "co_actions_results"
        },
        {
            "Title": "IGI India Files Q3FY26 Monitoring Agency Report",
            "Summary": "International Gemmological Institute (India) Limited submitted its Q3FY26 monitoring agency report showing no deviation from IPO fund utilization objectives with INR 27.213 crore remaining unutilized.",
            "Sentiment": "neutral",
            "PublishDate": 1769517304225,
            "Source": "co_actions_results"
        },
        {
            "Title": "IGI India Authorizes KMPs for Material Disclosures",
            "Summary": "International Gemmological Institute (India) Limited has authorized Managing Director Tehmasp Printer and CFO Eashwar Iyer as Key Managerial Personnel to determine materiality and make stock exchange disclosures under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769517235703,
            "Source": "stocks"
        },
        {
            "Title": "IGI India Reports 26% Growth in Q3 CY25 Certifications",
            "Summary": "International Gemmological Institute India issued 3.5 million reports in Q3 CY25, up 26% YoY, with lab-grown diamonds contributing 52.3% of certification revenue at Rs. 153.8 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769433546402,
            "Source": "stocks"
        },
        {
            "Title": "International Gemmological Institute (India) Appoints Siddharth Sule as Head-Global Marketing",
            "Summary": "International Gemmological Institute (India) Limited appointed Mr. Siddharth Sule as Head-Global Marketing and Senior Management Personnel effective December 1, 2025. Sule brings nearly two decades of global marketing strategy experience and is expected to elevate the IGI brand, expand global market penetration and drive sustained business growth.",
            "Sentiment": "positive",
            "PublishDate": 1764587504629,
            "Source": "corporate_governance"
        },
        {
            "Title": "International Gemmological Institute Reports 21% Revenue Growth in Q3 2025",
            "Summary": "International Gemmological Institute (India) Limited reported strong quarterly results with consolidated revenue growth of 21% to INR 304 crores and volume growth of 26% with 3.45 million reports issued. The company delivered PAT of INR 130 crores (18% growth) and EBITDA of INR 176 crores (20% growth) with margins at 43% and 58% respectively. Natural diamonds segment grew 29%, lab-grown diamonds increased 24%, and LGD jewelry expanded 26%. For nine months, the company achieved revenue growth of 15% to INR 909 crores and EBITDA growth of 22% to INR 545 crores, processing 9.6 million reports compared to 7.7 million in the previous year. India contributes approximately 75% of group revenue. The company maintained its full-year guidance of over 15% revenue growth and 20% EBITDA growth despite macroeconomic challenges and tariff impacts. Management noted strong domestic market performance and expansion into tier-2 and tier-3 cities, while international operations showed mixed results with strength in Middle East and China offsetting weakness in US and European markets.",
            "Sentiment": "positive",
            "PublishDate": 1762958235153,
            "Source": "earnings"
        },
        {
            "Title": "International Gemmological Institute (India) Maintains Revenue Growth Target Above 15% and EBITDA Growth at 20%",
            "Summary": "International Gemmological Institute (India) has maintained its revenue growth outlook above 15% and EBITDA growth target at 20% for the year. The management expressed optimism about achieving or surpassing these financial goals.",
            "Sentiment": "positive",
            "PublishDate": 1762401031275,
            "Source": "stock"
        },
        {
            "Title": "International Gemmological Institute India Reports No Deviation in IPO Fund Utilization for Q3 2025",
            "Summary": "International Gemmological Institute (India) Limited submitted its monitoring agency report for the quarter ended September 30, 2025, prepared by ICRA Limited. The company raised INR 4,225 crore through its IPO in December 2024, with net proceeds of INR 1,409.74 crore. The report shows no deviation from the stated objects of the issue, with funds being utilized as disclosed in the offer document. The company has deployed INR 84.74 crore for general corporate purposes including vendor payments (INR 4.67 crore), statutory dues (INR 72.73 crore), and salary payments (INR 7.34 crore). Unutilized proceeds of INR 39.86 crore are parked in fixed deposits with HDFC Bank earning 7.55% returns and escrow account balance. The primary object of acquiring IGI Belgium Group and IGI Netherlands Group for INR 1,300 crore was completed by December 31, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1762382926445,
            "Source": "corporate_action"
        },
        {
            "Title": "International Gemmological Institute Reports 21% Revenue Growth in Q3 2025",
            "Summary": "International Gemmological Institute (India) Limited reported strong quarterly results with revenue from operations growing 21% to INR 3,037 million and EBITDA increasing 20% to INR 1,763 million. The company processed 3.45 million certification reports, marking 26% volume growth driven by natural diamonds, lab-grown diamonds, jewelry and gemstones segments. PAT grew 18% to INR 1,298 million. For nine months ended September 2025, revenue grew 15% with EBITDA margins improving from 57% to 60%, while PAT increased 27% to INR 3,971 million. The company cited festive demand and strong performance across all business categories, with natural diamond loose stones growing 29% and lab-grown diamond jewelry segment up 26%. Average realized price per report declined 5% to INR 854 due to increased certification of lower carat stones.",
            "Sentiment": "positive",
            "PublishDate": 1762343271906,
            "Source": "earnings"
        },
        {
            "Title": "IGI India Schedules Earnings Call for Q3 and Nine-Month Results",
            "Summary": "International Gemmological Institute (India) Limited has announced an earnings conference call to discuss its financial performance for the quarter and nine months ended September 30, 2025. The call is scheduled for November 5, 2025, at 5:30 p.m. IST and will be hosted for analysts and investors. Mr. Eashwar Iyer, Chief Financial Officer, will participate in the discussion. The company has informed stock exchanges BSE and NSE about this earnings call arrangement.",
            "Sentiment": "neutral",
            "PublishDate": 1761852185542,
            "Source": "earnings"
        },
        {
            "Title": "International Gemmological Institute (India) Declares First Interim Dividend of ₹2.50 Per Share",
            "Summary": "International Gemmological Institute (India) Limited's Board of Directors approved a first interim dividend of ₹2.50 per equity share for financial year 2025. The dividend represents 125% of the face value of ₹2 per equity share. The company set August 15, 2025 as the record date for determining shareholder eligibility. The board meeting was held on August 11, 2025, commencing at 12:06 p.m. and concluding at 12:43 p.m.",
            "Sentiment": "positive",
            "PublishDate": 1754898424716,
            "Source": "corporate_action"
        },
        {
            "Title": "IGI India Reports Strong Q2 Growth with 16% Revenue Rise and 37% EBITDA Jump",
            "Summary": "International Gemmological Institute (India) Limited delivered robust quarterly results with consolidated revenue from operations growing 16% year-on-year and EBITDA surging 37%. The company processed 3.03 million reports in Q2, marking 21% volume growth. Lab-grown diamond certification grew 24% while natural diamonds increased 14%. For the first half, revenue grew 13% with EBITDA up 23% and volumes rising 24% to 6.16 million reports. The company maintains its position as India's largest independent certification provider with over 50% market share and holds 65% global market share in lab-grown diamond certification. Management expects continued growth momentum driven by increasing demand for jewelry certification and lab-grown diamond adoption in India. The company is investing in AI capabilities and digital transformation to enhance service delivery and reduce turnaround times.",
            "Sentiment": "positive",
            "PublishDate": 1754314552273,
            "Source": "earnings"
        },
        {
            "Title": "International Gemmological Institute India Plans Expansion to Meet Growing Diamond Certification Demand",
            "Summary": "International Gemmological Institute India is planning to address increasing demand for both lab-grown and natural diamond certification services. The company's growth strategy focuses on scalable expansion through global retail partnerships, implementation of digital laboratories, and geographic expansion beyond India's borders.",
            "Sentiment": "positive",
            "PublishDate": 1753798879619,
            "Source": "stock"
        },
        {
            "Title": "IGI India Makes Earnings Call Audio Recording Available for Quarter Ended June 30, 2025",
            "Summary": "International Gemmological Institute (India) Limited has made the audio recording of its earnings call available on the company's website. The call, held on July 29, 2025, discussed the company's financial performance for the quarter and half year ended June 30, 2025. The recording can be accessed at https://investor.igi.org/quarterly-financials/. The company trades on BSE with scrip code 544311 and on NSE with symbol IGIL.",
            "Sentiment": "neutral",
            "PublishDate": 1753797234875,
            "Source": "earnings"
        },
        {
            "Title": "International Gemmological Institute India Reports Strong Q1 Growth with 63% Jump in Net Profit",
            "Summary": "International Gemmological Institute India delivered strong quarterly results with consolidated net profit rising to 1.27 billion rupees from 778 million rupees year-over-year. Revenue increased to 3 billion rupees compared to 2.6 billion rupees in the same period last year. The company's EBITDA grew to 1.73 billion rupees from 1.27 billion rupees year-over-year, while EBITDA margin expanded to 57.66% from 48.77% in the previous year period.",
            "Sentiment": "positive",
            "PublishDate": 1753788025218,
            "Source": "earnings"
        },
        {
            "Title": "International Gemmological Institute: Maintains Detailed Grading for Lab-Grown Diamonds",
            "Summary": "IGI CFO Eashwar Iyer confirms the institute will continue using the 4Cs grading system for lab-grown diamonds, unlike GIA's recent change. IGI sees no pricing pressure on certification fees, targets 15-20% revenue growth, and maintains strong position in lab-grown diamond market with 55-60% of revenue from this segment.",
            "Sentiment": "positive",
            "PublishDate": 1749452884000,
            "Source": "normal_news"
        },
        {
            "Title": "International Gemmological Institute: Reaffirms 15-20% Revenue Growth Target for 2025",
            "Summary": "IGI reiterates 15-20% revenue growth guidance for 2025 at Morgan Stanley's India Investment Forum. Expects volume growth to match revenue in H2 2025. Aims for 20% volume growth over 3-5 years. Profit margin projected to improve 57-64% YoY in 2025. Company exploring niche acquisitions for global expansion.",
            "Sentiment": "positive",
            "PublishDate": 1749098132000,
            "Source": "normal_news"
        },
        {
            "Title": "International Gemmological Institute Reports Strong Demand for Diamond Certification",
            "Summary": "The Managing Director of International Gemmological Institute has reported a robust demand for certification services for both natural and lab-grown diamond jewelry. This increased demand is expected to drive significant business growth in the upcoming quarters.",
            "Sentiment": "positive",
            "PublishDate": 1745221295000,
            "Source": "default"
        },
        {
            "Title": "International Gemmological Institute: Q4 Profit and Revenue Surge, Stock Hits Upper Circuit",
            "Summary": "IGI reported a 12% increase in Q4 net profit to ₹141 crore and a 10% rise in revenue to ₹305 crore. EBITDA grew by 12.6% with margins expanding to 64%. The stock hit a 5% upper circuit at ₹370.95 following the results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1745218353000,
            "Source": "earnings"
        },
        {
            "Title": "International Gemmological Institute Reports Q4 2023 Financial Results",
            "Summary": "International Gemmological Institute has announced its Q4 financial results. The company reported an EBITDA of 1.9 billion rupees, up from 1.7 billion rupees year-over-year. The EBITDA margin improved to 64% from 62.3%. Revenue increased to 3 billion rupees from 2.8 billion rupees in the same quarter last year. The consolidated net profit rose to 1.4 billion rupees from 1.26 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1745216218000,
            "Source": "result"
        },
        {
            "Title": "International Gemmological Institute (India): Q1 2025 Results Announcement Scheduled",
            "Summary": "International Gemmological Institute (India) Ltd. will announce Q1 2025 financial results on April 21, 2025. An earnings call is scheduled for 5:30 p.m. the same day. The company's trading window is closed from April 1 to April 23, 2025, to prevent insider trading.",
            "Sentiment": "neutral",
            "PublishDate": 1745035200000,
            "Source": "corporate_action"
        },
        {
            "Title": "International Gemmological Institute: Share Price Hits 5% Lower Circuit as Lock-in Period Ends",
            "Summary": "International Gemmological Institute Ltd (IGI) share price dropped 5% to ₹288, hitting the lower circuit. This coincides with the end of a three-month lock-in period, releasing 2.28 crore shares (5% of total equity) for trading. The stock has fallen nearly 55% from its post-listing high and is trading 30% below its IPO price.",
            "Sentiment": "negative",
            "PublishDate": 1742282803000,
            "Source": "corporate_action"
        },
        {
            "Title": "International Gemmological Institute: Shareholder Lock-in Period Ends Amid Stock Decline",
            "Summary": "International Gemmological Institute's three-month shareholder lock-in period ends on March 18, making 2.28 crore shares (5% of equity) eligible for trading. The stock is down 55% from its post-listing high and 30% from its IPO price. Management projects 20%+ volume growth in 2025 and 15-20% revenue CAGR over five years.",
            "Sentiment": "neutral",
            "PublishDate": 1742198097000,
            "Source": "corporate_action"
        },
        {
            "Title": "International Gemological Institute Of India: Lab-Grown Diamond Certification Drives Growth Strategy",
            "Summary": "IGI India focuses on lab-grown diamond certification for future growth. CEO Tehmasp Printer highlights the affordability and disruptive nature of lab-grown diamonds as key factors expanding the consumer base.",
            "Sentiment": "positive",
            "PublishDate": 1741515448000,
            "Source": "normal_news"
        },
        {
            "Title": "International Gemological Institute (India) Ltd: Shares Plummet 10% on Disappointing Q3 Results",
            "Summary": "International Gemological Institute (India) Ltd's shares hit a 10% lower circuit after reporting a modest 6% revenue growth in Q3 FY2024. The muted growth was attributed to higher volumes in lower-margin lab-grown diamonds. The company faced challenges due to natural diamond facility shutdowns and slowdowns in US and Belgium markets.",
            "Sentiment": "negative",
            "PublishDate": 1740980682000,
            "Source": "earnings"
        },
        {
            "Title": "International Gemmological Institute: Q4 Profit Soars 45% to Rs 113.78 Crore",
            "Summary": "IGI reported a 45% increase in Q4 2024 net profit to Rs 113.78 crore, with total revenue rising 6% to Rs 256 crore. Full-year 2024 net profit grew 29% to Rs 427.29 crore, while revenue increased 17% to Rs 1,053.16 crore. The company declared an interim dividend of Rs 2.44 per share.",
            "Sentiment": "positive",
            "PublishDate": 1740752113000,
            "Source": "earnings"
        },
        {
            "Title": "International Gemmological Institute (India) Declares Dividend",
            "Summary": "International Gemmological Institute (India) has announced a dividend of 2.44 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1740216320000,
            "Source": "corporate_action"
        },
        {
            "Title": "International Gemmological Institute Acquires Dutch Subsidiaries",
            "Summary": "The International Gemmological Institute has completed the acquisition of two Dutch entities: IGI Netherlands B.V. for $88.44 million and International Gemmological Institute BV for $69.76 million. These acquisitions result in both companies becoming wholly owned subsidiaries of the International Gemmological Institute.",
            "Sentiment": "positive",
            "PublishDate": 1735172343000,
            "Source": "corporate_action"
        },
        {
            "Title": "International Gemmological Institute Acquires Dutch Subsidiaries",
            "Summary": "International Gemmological Institute has acquired 100% stakes in two Dutch companies: IGI Netherlands B.V. for $88.44 million and International Gemmological Institute BV for $69.76 million. These acquisitions make both companies wholly owned subsidiaries of International Gemmological Institute.",
            "Sentiment": "positive",
            "PublishDate": 1735049741000,
            "Source": "corporate_action"
        },
        {
            "Title": "International Gemmological Institute: Successful IPO Listing with 22% Premium",
            "Summary": "International Gemmological Institute (IGI) listed on NSE at ₹510, a 22.3% premium to its issue price. Despite market sell-off, it closed at ₹468.45, up 13% from issue price. IGI, owned by Blackstone, specializes in certifying lab-grown diamonds with a 65% market share. The ₹2,750 crore offer-for-sale will be used to consolidate IGI's global operations under IGI India.",
            "Sentiment": "positive",
            "PublishDate": 1734703362000,
            "Source": "corporate_action"
        },
        {
            "Title": "International Gemmological Institute: Shares Debut with 22% Premium on Stock Exchanges",
            "Summary": "International Gemmological Institute Ltd. shares listed at Rs 504.85 on BSE and Rs 510 on NSE, marking a premium of 21.07% and 22.30% respectively over the issue price of Rs 417. The IPO was subscribed 33.78 times and raised Rs 4,225 crore, including Rs 1,475 crore fresh issue and Rs 2,750 crore offer for sale.",
            "Sentiment": "positive",
            "PublishDate": 1734668571000,
            "Source": "normal_news"
        }
    ]
}