{
    "Symbol": "IGL",
    "ISIN": "INE203G01027",
    "News": [
        {
            "Title": "Indraprastha Gas Q3 Results on Feb 12",
            "Summary": "Indraprastha Gas has announced that its board will convene on February 12 to consider and approve the company's third quarter financial results for the current fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1770271165431,
            "Source": "co_actions_results"
        },
        {
            "Title": "IGL Postal Ballot for Independent Director Re-appointment",
            "Summary": "Indraprastha Gas Limited announces postal ballot for re-appointment of Dr. Shyam Agrawal as Independent Director with e-voting from January 20 to February 18, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768030056840,
            "Source": "stocks"
        },
        {
            "Title": "IGL Clears Saudi Gas Distribution Pre-Qualification",
            "Summary": "Indraprastha Gas Limited successfully cleared the pre-qualification stage for Saudi Arabia's natural gas distribution tender, advancing to the competition phase through its partnership with MASAH Construction Company.",
            "Sentiment": "positive",
            "PublishDate": 1767961976894,
            "Source": "stocks"
        },
        {
            "Title": "IGL Advances in Saudi Arabia Gas Distribution Tender",
            "Summary": "Indraprastha Gas Ltd successfully clears pre-qualification stage for Saudi Arabia's natural gas distribution network tender, moving to competition phase through partnership with MASAH Construction Company.",
            "Sentiment": "positive",
            "PublishDate": 1767945273128,
            "Source": "stocks"
        },
        {
            "Title": "IGL Clears Initial Stage in Saudi Gas Tender",
            "Summary": "Indraprastha Gas Limited successfully passes the preliminary evaluation phase of a natural gas tender process in Saudi Arabia, marking a potential expansion opportunity.",
            "Sentiment": "positive",
            "PublishDate": 1767944055617,
            "Source": "stocks"
        },
        {
            "Title": "IGL Clears Pre-Qualification for KSA Gas License",
            "Summary": "Indraprastha Gas Limited successfully passes pre-qualification stage for natural gas distribution license tender in Kingdom of Saudi Arabia's industrial cities, progressing to competition phase.",
            "Sentiment": "positive",
            "PublishDate": 1767943340587,
            "Source": "stocks"
        },
        {
            "Title": "IGL Cuts CNG & PNG Prices Across Multiple Regions",
            "Summary": "Indraprastha Gas reduces CNG prices by ₹0.50-1/kg in non-NCR regions while cutting domestic PNG prices by ₹0.70/scm in NCR and ₹2/scm in non-NCR areas, effective January 1.",
            "Sentiment": "positive",
            "PublishDate": 1767189364256,
            "Source": "stocks"
        },
        {
            "Title": "IGL Formalizes Joint Venture With Hindustan Waste",
            "Summary": "Indraprastha Gas Limited officially signs joint venture agreement with Hindustan Waste Treatment for compressed biogas plant development with 50:50 equity participation structure.",
            "Sentiment": "positive",
            "PublishDate": 1766148896170,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nomura Upgrades IGL to Buy, Sets ₹230 Target",
            "Summary": "Nomura Securities has upgraded Indraprastha Gas Limited to a 'buy' rating with a target price of ₹230 per share, signaling positive outlook for the gas distribution company.",
            "Sentiment": "positive",
            "PublishDate": 1765943416172,
            "Source": "stocks"
        },
        {
            "Title": "Citi Maintains Buy Rating on Indraprastha Gas",
            "Summary": "Citi maintains its 'Buy' recommendation on Indraprastha Gas with a price target of ₹260.00, reflecting confidence in the gas distribution company's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1765510671754,
            "Source": "stocks"
        },
        {
            "Title": "Indraprastha Gas Extends Independent Director Dr. Shyam Agrawal's Tenure by One Year",
            "Summary": "Indraprastha Gas Limited's Board approved the extension of Dr. Shyam Agrawal's tenure as Independent Director for one year from December 06, 2025 to December 05, 2026, based on the Nomination and Remuneration Committee's recommendation. The re-appointment is subject to shareholder approval and affects the company's board composition and governance structure.",
            "Sentiment": "neutral",
            "PublishDate": 1764930573350,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indraprastha Gas Forms Equal Joint Venture with CEID for Biofuel Projects",
            "Summary": "Indraprastha Gas has entered into a joint venture with CEID to develop biofuel projects, with both companies holding equal 50% stakes in the partnership. This strategic alliance positions IGL to expand into the renewable energy sector through biofuel development initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1764115868179,
            "Source": "order&deals"
        },
        {
            "Title": "IGL Raises CNG Prices by Rs 1/Kg Across Delhi-NCR Cities",
            "Summary": "Indraprastha Gas Limited increased CNG prices by Rs 1 per kg in Noida, Greater Noida, Ghaziabad, and Kanpur effective November 16, 2025, citing fluctuations in natural gas procurement costs. The price hike directly impacts daily travel expenses for millions of commuters in Delhi-NCR region served by IGL's network of over 950 CNG stations.",
            "Sentiment": "negative",
            "PublishDate": 1763279574305,
            "Source": "stock"
        },
        {
            "Title": "Indraprastha Gas Sets FY26 Capex Guidance at ₹1,200-1,400 Crores with Volume Growth Targets",
            "Summary": "Indraprastha Gas provided FY26 guidance with core business capex of ₹1,200-1,400 crores and potential additional ₹700-800 crores for diversification, targeting 10 mmscmd volume exit rate. The company expects 8-10% volume growth excluding DTC volumes and maintains EBITDA margin guidance of ₹7-8 per SCM, with plans to add over 1 mmscmd in FY27.",
            "Sentiment": "positive",
            "PublishDate": 1763217960884,
            "Source": "stock"
        },
        {
            "Title": "IGL Expects Rs 1 Per SCM Cost Reduction from VAT Cut, Maintains Margin Guidance",
            "Summary": "IGL management announced a cost reduction of Rs 1 per standard cubic meter (SCM) due to VAT reduction measures. The company remains confident in maintaining its margin guidance of Rs 7-8 per SCM going forward.",
            "Sentiment": "positive",
            "PublishDate": 1763111498001,
            "Source": "stock"
        },
        {
            "Title": "IGL Projects 8-10% Volume Growth with Healthy CNG Demand Expected",
            "Summary": "IGL management projects volume growth of 8-10% for the year with CNG growth expected to remain healthy for the remainder of the period. The company anticipates EBITDA margin improvements driven by increased volumes.",
            "Sentiment": "negative",
            "PublishDate": 1763110243892,
            "Source": "earnings"
        },
        {
            "Title": "IGL Partners with Saudi Arabia's MASAH for Natural Gas Distribution Networks",
            "Summary": "Indraprastha Gas Ltd signed a strategic alliance with Saudi Arabia's MASAH Construction Company to jointly develop and operate natural gas distribution networks in industrial cities across the Kingdom, marking IGL's first overseas expansion. The partnership combines IGL's technical expertise in gas system operations with MASAH's regulatory management and local engagement capabilities, supporting Saudi Arabia's Vision 2030 clean energy goals.",
            "Sentiment": "positive",
            "PublishDate": 1763044364667,
            "Source": "order&deals"
        },
        {
            "Title": "Indraprastha Gas Reports Mixed Q2 Results with Revenue Growth but Lower EBITDA",
            "Summary": "Indraprastha Gas announced Q2 results showing revenue of 44.5 billion rupees, up from 43.26 billion rupees in the previous quarter and above estimates of 42.9 billion rupees. However, EBITDA declined to 4.4 billion rupees from 5.12 billion rupees quarter-on-quarter, falling short of the 5.06 billion rupee estimate. EBITDA margin compressed to 9.94% from 11.83% in the previous quarter, below the estimated 11.8%. Net profit increased to 3.7 billion rupees from 3.56 billion rupees quarter-on-quarter, though it remained below the 4 billion rupee estimate.",
            "Sentiment": "neutral",
            "PublishDate": 1762949892226,
            "Source": "earnings"
        },
        {
            "Title": "Indraprastha Gas Shares Surge 6% on Tax Reduction for Gujarat Gas Sourcing",
            "Summary": "Indraprastha Gas Ltd. shares rose as much as 6% on Tuesday following changes in tax implications for gas sourced from Gujarat. The Value Added Tax on gas sourcing was reduced from 15% to a 2% Central Sales Tax levy, effective from October 1. This tax reduction is expected to lower gas sourcing costs for IGL and positively impact the company's margins. According to Equirus, the change will improve IGL's EBITDA by 20% and generate cost savings worth ₹360 crore. The tax change does not affect MGL, as most of its APM allocation comes from Uran, Maharashtra, where the tax treatment remains unchanged. IGL shares traded 5.7% higher at ₹220 and have gained 4% over the past month.",
            "Sentiment": "positive",
            "PublishDate": 1759830567683,
            "Source": "stock"
        },
        {
            "Title": "Indraprastha Gas Plans Annual Import of 500,000 Tons LNG via Long-Term Deal",
            "Summary": "Indraprastha Gas announced plans to import 500,000 tons of LNG annually through a long-term agreement. An executive from the company revealed this import strategy.",
            "Sentiment": "positive",
            "PublishDate": 1758699975978,
            "Source": "stock"
        },
        {
            "Title": "Indraprastha Gas Sees Rs. 26.53 Crore Block Trade on NSE",
            "Summary": "Indraprastha Gas Ltd. witnessed a block trade worth Rs. 26.53 crores on the National Stock Exchange. The transaction involved approximately 1,241,955 shares at a price of Rs. 213.60 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1757566003116,
            "Source": "order&deals"
        },
        {
            "Title": "Indraprastha Gas Forms Joint Venture with RVUNL for Solar Project",
            "Summary": "Indraprastha Gas (IGL) has established a joint venture with RVUNL for a solar project. The partnership structure allocates a 74% participation ratio to IGL and 26% to RVUNL.",
            "Sentiment": "positive",
            "PublishDate": 1756731704816,
            "Source": "stock"
        },
        {
            "Title": "Indraprastha Gas Appoints Ms. Niharika Rai as Additional Director, Replaces Shri Prashant Goyal",
            "Summary": "Indraprastha Gas Limited appointed Ms. Niharika Rai, IAS, as an Additional Director effective August 19, 2025, replacing Shri Prashant Goyal. Ms. Rai serves as Secretary-cum-Commissioner (Transport) in the Government of NCT of Delhi. She has no relationship with other Directors, is not debarred from holding directorship, and does not hold any shares in the company. Shri Prashant Goyal ceased to be a Director on the same date. The Board meeting was held on August 19, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755605438714,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indraprastha Gas Limited Shares Q1 Earnings Call Transcript",
            "Summary": "Indraprastha Gas Limited has provided a link to the transcript of their Q1 earnings conference call held on July 31, 2025. The company shared the transcript link with stock exchanges BSE and NSE through a letter dated August 4, 2025. The document was signed by Vivek Sahay, Company Secretary & Compliance Officer.",
            "Sentiment": "neutral",
            "PublishDate": 1754308773364,
            "Source": "earnings"
        },
        {
            "Title": "Indraprastha Gas Reports 11% Decline in Net Profit to ₹356 Crores for June Quarter",
            "Summary": "Indraprastha Gas Limited reported a net profit of ₹355.94 crores for the quarter ended June 30, 2025, down 11% from ₹401.45 crores in the same period last year. Revenue from operations increased 11% to ₹4,326.60 crores compared to ₹3,887.52 crores year-over-year. Total gas sales volumes grew 6% to 830.87 million standard cubic meters, with CNG volumes up 5% and PNG volumes up 7%. However, EBITDA declined 12% to ₹511.75 crores from ₹581.85 crores, with EBITDA margin compressing to 13% from 17%. On a consolidated basis, the company reported a net profit of ₹427.81 crores. The company's subsidiary IGL Genesis Technologies Limited recorded a net loss, with IGL's share being ₹1.30 crores. Trade margins were paid at new rates following renewed commercial contracts with Oil Marketing Companies effective from December 2021.",
            "Sentiment": "neutral",
            "PublishDate": 1753874517322,
            "Source": "earnings"
        },
        {
            "Title": "Indraprastha Gas Schedules Conference Call to Discuss Q1FY26 Financial Results",
            "Summary": "Indraprastha Gas Limited has scheduled a conference call on July 31, 2025, at 4:00 PM IST to discuss the unaudited financial results for the quarter ended June 30, 2025. The call will be led by key executives including Managing Director K. K. Chatiwal, Director-Commercial Mohit Bhatia, CFO Sanjay Kumar, and VP Finance Manjeet Gulati. PhillipCapital India is organizing the earnings call, which will be accessible through multiple dial-in numbers and online registration. The company has informed stock exchanges BSE and NSE about this scheduled discussion of their quarterly results.",
            "Sentiment": "neutral",
            "PublishDate": 1753719553800,
            "Source": "earnings"
        },
        {
            "Title": "IGL Schedules First Quarter Results Review for July 30",
            "Summary": "IGL has announced that it will review its first quarter results on July 30. The company has set this date for examining its quarterly financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1753337317184,
            "Source": "earnings"
        },
        {
            "Title": "Indraprastha Gas Limited Schedules Board Meeting for July 30, 2025 to Approve Quarterly Results",
            "Summary": "Indraprastha Gas Limited has scheduled a Board of Directors meeting for July 30, 2025 to consider and approve the Unaudited Financial Results for the quarter ended June 30, 2025. The company's trading window is closed from July 1, 2025 until 48 hours after the results are made public. Indraprastha Gas Limited is a joint venture of GAIL (India) Ltd, BPCL, and the Government of NCT of Delhi.",
            "Sentiment": "neutral",
            "PublishDate": 1753337274757,
            "Source": "corporate_action"
        },
        {
            "Title": "IGL to Benefit from New PNGRB Draft Regulations",
            "Summary": "Analysts predict that Indraprastha Gas Limited (IGL) will gain ₹0.7 per Standard Cubic Meter (SCM) from new draft regulations proposed by the Petroleum and Natural Gas Regulatory Board (PNGRB). This information suggests potential positive financial implications for IGL based on regulatory changes in the natural gas sector.",
            "Sentiment": "positive",
            "PublishDate": 1751609017000,
            "Source": "default"
        },
        {
            "Title": "Indraprastha Gas Ltd: Delhi EV Policy Review May Ease Transition Deadlines",
            "Summary": "Delhi government likely to revise its Electric Vehicles policy, potentially easing deadlines for transitioning from petrol and gas-powered vehicles. This could benefit Indraprastha Gas Ltd (IGL), as the cab segment contributes 12-15% to IGL's CNG volumes. Citi maintains 'buy' recommendation with ₹250 price target.",
            "Sentiment": "positive",
            "PublishDate": 1750053014000,
            "Source": "normal_news"
        },
        {
            "Title": "Indraprastha Gas Limited: CNG Price Hike and Strong Q4 Results",
            "Summary": "IGL increased CNG prices by ₹1 per kg in Delhi and surrounding regions, effective May 3, 2025. This is the second price hike in a month. Q4 standalone net profit rose 22% to ₹349 crore, beating estimates. EBITDA surged 36.6% QoQ to ₹497.2 crore. Management signals potential for further price hikes, targeting higher EBITDA margins in coming quarters.",
            "Sentiment": "positive",
            "PublishDate": 1746435540000,
            "Source": "earnings"
        },
        {
            "Title": "Indraprastha Gas Appoints New Chairman",
            "Summary": "Indraprastha Gas Limited has approved the appointment of Rajkumar Dubey as the new Chairman of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1746187733000,
            "Source": "default"
        },
        {
            "Title": "Indraprastha Gas Explores Entry into LNG Retail Sales",
            "Summary": "An executive from Indraprastha Gas Limited (IGL) has announced that the company is considering entering the Liquefied Natural Gas (LNG) retail sales business. This move suggests IGL is looking to expand its operations and diversify its revenue streams in the energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1745842016000,
            "Source": "default"
        },
        {
            "Title": "Indraprastha Gas Reports Improved Q4 Financial Performance",
            "Summary": "Indraprastha Gas Limited has reported its Q4 financial results, showing improvement in key metrics. The company's EBITDA increased to 4.98 billion rupees from 3.64 billion rupees in the previous quarter. The EBITDA margin also improved, rising to 11.47% from 8.78% quarter-over-quarter. Revenue for Q4 stood at 43.4 billion rupees, up from 41.5 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745810022000,
            "Source": "result"
        },
        {
            "Title": "Indraprastha Gas Reports Q4 Net Profit Increase",
            "Summary": "Indraprastha Gas Limited has reported a net profit of 3.49 billion rupees for the fourth quarter, up from 2.86 billion rupees in the previous quarter (QoQ).",
            "Sentiment": "positive",
            "PublishDate": 1745809960000,
            "Source": "result"
        },
        {
            "Title": "Indraprastha Gas: Q4 Profit Surges 22%, Beats Estimates",
            "Summary": "Indraprastha Gas Ltd. reported a 22.2% increase in standalone net profit to Rs 349.2 crore for Q4 FY2025, surpassing analyst estimates. Revenue rose 5.1% to Rs 3,950 crore, while EBITDA jumped 37.6% to Rs 497.2 crore. The EBITDA margin improved to 12.6% from 9.6% in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745767725000,
            "Source": "earnings"
        },
        {
            "Title": "Indraprastha Gas Ltd: Q4 Results Date and Dividend Announcement Scheduled",
            "Summary": "Indraprastha Gas Ltd will announce Q4 and FY25 results on April 27, 2025. The board will consider dividend recommendation. An earnings call is scheduled for April 28. Trading window for designated persons is closed until 48 hours after results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1745572736000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indraprastha Gas Limited: Board Meeting Set for Q4 Results and Dividend Declaration",
            "Summary": "Indraprastha Gas Limited (IGL) shares rose over 3% as the company announced a board meeting date to declare Q4 2025 results and final dividend.",
            "Sentiment": "positive",
            "PublishDate": 1745308897000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indraprastha Gas Faces Domestic Gas Allocation Reduction",
            "Summary": "Indraprastha Gas Limited has announced a 20% reduction in domestic gas allocation effective April 16, 2025. This revision is expected to impact the company's profitability. To mitigate the reduction, the company has been allocated an additional volume of about 125% of the reduced domestic gas as Non-Wellhead Gas (NWG).",
            "Sentiment": "negative",
            "PublishDate": 1744762122000,
            "Source": "default"
        },
        {
            "Title": "Indraprastha Gas Faces Reduced Domestic Gas Allocation",
            "Summary": "Indraprastha Gas Limited (IGL) has announced a 20% reduction in domestic gas allocation effective April 16, 2025. This reduction is expected to impact the company's profitability. To compensate, IGL has been allocated an additional volume of about 125% of the reduction in domestic gas as Natural Gas Withdrawal (NGW).",
            "Sentiment": "negative",
            "PublishDate": 1744724708000,
            "Source": "default"
        },
        {
            "Title": "Indraprastha Gas Ltd: CNG Price Hike in Delhi and Other Markets",
            "Summary": "Indraprastha Gas Ltd (IGL) has increased CNG prices by ₹1/kg in Delhi and ₹3/kg in other markets. This is Delhi's first price hike in 9 months. The new price in Delhi is ₹76.09/kg, and ₹84.70/kg in Noida and Ghaziabad. The hike follows a 4% increase in APM gas prices by the government.",
            "Sentiment": "neutral",
            "PublishDate": 1743996340000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indraprastha Gas Ltd: Approves Joint Venture for 500 MWp Solar Power Plant in Rajasthan",
            "Summary": "IGL's board approved a joint venture with Rajasthan Vidyut Utpadan Nigam Ltd to develop a 500 MWp solar power project in Bikaner, Rajasthan. IGL will hold 74% stake in the JV. The project has an estimated capital outlay of ₹2,066 crore and is expected to be completed within 18 months of JV formalization. IGL aims to develop a 1 GW green energy portfolio in 2-4 years.",
            "Sentiment": "positive",
            "PublishDate": 1743437532000,
            "Source": "corporate_action"
        },
        {
            "Title": "IGL Shares Down 2.19% as Delhi Government Plans 5000 New Electric Buses",
            "Summary": "Indraprastha Gas Limited (IGL) shares are trading 2.19% lower following news that the Delhi government plans to introduce 5000 new electric buses. This move towards electric public transportation could potentially impact IGL's natural gas business for vehicles in the Delhi region.",
            "Sentiment": "negative",
            "PublishDate": 1742888316000,
            "Source": "normal_news"
        },
        {
            "Title": "Indraprastha Gas Ltd. Sees Block Trade of 1,021,098 Shares on NSE",
            "Summary": "A block trade of approximately 1,021,098 shares of Indraprastha Gas Ltd. was executed on the National Stock Exchange (NSE) at a price of Rs. 187.83 per share. The total value of the transaction amounted to Rs. 19.18 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1741250342000,
            "Source": "block_deals"
        },
        {
            "Title": "Indraprastha Gas Limited: Shares Begin Ex-Bonus Trading",
            "Summary": "IGL shares start trading ex-bonus on January 31, 2025, with a 1:1 bonus share issuance. The record date is set for January 31, and bonus shares will be allocated to eligible shareholders on February 3.",
            "Sentiment": "positive",
            "PublishDate": 1738300875000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indraprastha Gas Limited: 1:1 Bonus Share Record Date Set for January 31",
            "Summary": "IGL has set January 31, 2025, as the record date for its first-ever 1:1 bonus share issuance. Shareholders must own shares by January 30 to be eligible. Bonus shares will be allotted on February 3.",
            "Sentiment": "positive",
            "PublishDate": 1738201260000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indraprastha Gas Reports Q3 Financial Results",
            "Summary": "Indraprastha Gas Limited has announced its financial results for the third quarter. The company reported a net profit of 2.86 billion rupees, which is lower compared to the previous quarter's 4.3 billion rupees but higher than the estimated 1.83 billion rupees. Revenue for Q3 stood at 41.5 billion rupees, slightly up from 40.9 billion rupees in the previous quarter and surpassing the estimated 37.6 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1738023436000,
            "Source": "earnings"
        },
        {
            "Title": "Indraprastha Gas Reports Q3 EBITDA of 3.64B Rupees",
            "Summary": "Indraprastha Gas Limited has reported its Q3 EBITDA at 3.64 billion rupees, compared to 5.35 billion rupees in the previous quarter. This figure exceeded market estimates of 2.94 billion rupees. The company's Q3 EBITDA margin stood at 8.78%, down from 13.11% in the previous quarter, but still above the estimated 7.8%.",
            "Sentiment": "neutral",
            "PublishDate": 1737981295000,
            "Source": "earnings"
        },
        {
            "Title": "Indraprastha Gas Reports Q3 Financial Results",
            "Summary": "Indraprastha Gas Limited has announced its financial results for the third quarter. The company reported a net profit of 2.86 billion rupees, which is lower compared to the previous quarter's 4.3 billion rupees. However, this figure exceeded market expectations of 1.83 billion rupees. Revenue for the quarter stood at 41.5 billion rupees, slightly higher than the previous quarter's 40.9 billion rupees and surpassing the estimated 37.6 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1737981236000,
            "Source": "earnings"
        },
        {
            "Title": "Indraprastha Gas Limited: Q3 Profit Expected to Plunge 57%, Revenue to See Slight Uptick",
            "Summary": "IGL's Q3 FY2024-25 results expected on January 27. Analysts predict 57% drop in profit to ₹183 crore, 2% revenue increase to ₹3,760 crore. EBITDA forecasted to fall 45% to ₹294 crore. Margins expected to decline to 7.8%. Volume growth projected at 7% YoY, reaching 9.10 mmscmd. Rising gas costs and flat retail prices in key markets like Delhi pose challenges.",
            "Sentiment": "negative",
            "PublishDate": 1737884124000,
            "Source": "earnings"
        }
    ]
}