{
    "Symbol": "IGPL",
    "ISIN": "INE204A01010",
    "News": [
        {
            "Title": "IG Petrochemicals schedules Q3 FY26 earnings call",
            "Summary": "IG Petrochemicals Limited has scheduled an earnings call for February 13, 2026, to discuss Q3 and 9MFY26 operational and financial performance with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1770637817110,
            "Source": "co_actions_results"
        },
        {
            "Title": "DGTR Reviews Phthalic Anhydride Import Duties",
            "Summary": "India's trade regulator initiates review investigation on phthalic anhydride imports from China, Korea, and Thailand, potentially affecting IG Petrochemicals and domestic industry protection measures.",
            "Sentiment": "neutral",
            "PublishDate": 1769744498488,
            "Source": "stocks"
        },
        {
            "Title": "Rama Petrochemicals Reports Q3FY26 Loss of ₹192.81 Lacs",
            "Summary": "Rama Petrochemicals Limited posted a standalone net loss of ₹192.81 lacs for Q3FY26 ended December 31, 2025, compared to ₹176.38 lacs loss in Q3FY25, with revenue declining to ₹2.81 lacs.",
            "Sentiment": "negative",
            "PublishDate": 1769589519337,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rama Petrochemicals Converts Warrants Worth ₹119.73 Cr",
            "Summary": "Rama Petrochemicals Limited converts 15.96 lakh warrants into equity shares, raising ₹119.73 crores and increasing paid-up capital to ₹133.21 crores through preferential allotment to promoter group entities.",
            "Sentiment": "positive",
            "PublishDate": 1769161513149,
            "Source": "co_actions_results"
        },
        {
            "Title": "MRPL shares surge 7% on Venezuelan oil plans",
            "Summary": "Mangalore Refinery shares jumped 7% to ₹149.40 after company announced plans to explore Venezuelan crude purchases while halting Russian oil imports due to Western sanctions.",
            "Sentiment": "positive",
            "PublishDate": 1768974162422,
            "Source": "stocks"
        },
        {
            "Title": "MRPL Q3FY26 EBITDA Surges to ₹27.8bn on Strong Cracks",
            "Summary": "Mangalore Refinery reports exceptional Q3FY26 results with EBITDA jumping to ₹27.8bn from ₹14.9bn in Q2FY26, driven by stronger fuel cracks and higher utilization. PAT improved significantly to ₹14.5bn.",
            "Sentiment": "positive",
            "PublishDate": 1768893833167,
            "Source": "co_actions_results"
        },
        {
            "Title": "IG Petrochemicals Completes Acquisition of IG Biofuels, Making it Wholly Owned Subsidiary",
            "Summary": "IG Petrochemicals Limited has completed the acquisition of shares in IG Biofuels Ltd., making it a wholly owned subsidiary effective December 9, 2025. The completion follows previous disclosures made in May 2023 and November 2025, representing a strategic consolidation move for the petrochemicals company.",
            "Sentiment": "positive",
            "PublishDate": 1765362711181,
            "Source": "corporate_action"
        },
        {
            "Title": "IG Petrochemicals Seeks Shareholder Approval for Independent Director Appointment via Postal Ballot",
            "Summary": "IG Petrochemicals Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Sanjoy Datta (DIN 00499015) as an Independent Director. Datta was initially appointed as an Additional Director by the Board on November 3, 2025, based on the Nomination and Remuneration Committee's recommendation. The proposed appointment is for a five-year term from November 3, 2025, to November 2, 2030. Datta brings over 36 years of experience in financial services, consulting, and corporate leadership across India and Asia Pacific. He previously served as Chief Transformation Officer and Executive Committee Member at Deloitte Asia Pacific, and held senior positions at multinational banks. The remote e-voting period runs from November 16, 2025, at 9:00 a.m. to December 15, 2025, at 5:00 p.m., with results to be declared by December 17, 2025. The company has engaged NSDL for e-voting services and appointed Martinho Ferrao as scrutinizer for the postal ballot process.",
            "Sentiment": "neutral",
            "PublishDate": 1762993219266,
            "Source": "corporate_action"
        },
        {
            "Title": "IG Petrochemicals Reports Mixed Q2 Results, Plans Plasticizer Plant and Biofuel Expansion",
            "Summary": "IG Petrochemicals Limited reported quarterly results with total revenue of Rs 471.6 crores for Q2FY26 compared to Rs 587.5 crores in Q2FY25. EBITDA margin improved to 11.7% from 2.7% year-over-year, while PAT stood at Rs 1.4 crores versus Rs 28.3 crores in the previous year. The company faced soft demand for Phthalic Anhydride in domestic markets due to low capacity utilization of downstream industries. Revenue contribution from non-Phthalic business reached Rs 74 crores for H1FY26, representing 8% of total revenue. Export markets contributed 7% for H1FY26. The Board approved acquiring IG Biofuels Ltd as a wholly-owned subsidiary and approved investment up to Rs 100 crores in biofuels and compressed biogas projects. The plasticizer plant is expected to commence operations by March 2026. Current quarter profit was impacted by mark-to-market loss of Rs 3 crores due to rupee depreciation and fixed asset write-off of Rs 5 crores. The company prepaid term loans of Rs 40 crores and maintained its India Rating of IND AA-/Stable/IND A1.",
            "Sentiment": "neutral",
            "PublishDate": 1762486370616,
            "Source": "stock"
        },
        {
            "Title": "IG Petrochemicals Appoints New Independent Director and Approves Rs 100 Crore Investment in Subsidiary",
            "Summary": "IG Petrochemicals Limited appointed Sanjoy Datta as Non-Executive Independent Director for a five-year term from November 3, 2025 to November 2, 2030. Datta brings 36 years of experience in financial services, consulting, and corporate leadership across India and Asia Pacific, having served as Chief Transformation Officer at Deloitte Asia Pacific. The Board also approved investing up to Rs 100 crores in wholly-owned subsidiary IG Biofuels Limited to develop compressed bio-gas production plants. Additionally, the company extended the timeline for completion of its plasticizer plant to March 2026. IG Biofuels was incorporated to manufacture and trade bio-fuels including compressed bio-gas and ethanol derivatives but has not yet commenced operations.",
            "Sentiment": "positive",
            "PublishDate": 1762191579525,
            "Source": "corporate_action"
        },
        {
            "Title": "IG Petrochemicals Reports Mixed Quarterly Performance with Revenue Growth but Profit Decline",
            "Summary": "IG Petrochemicals Limited announced its quarterly results ended September 30, 2025. The company reported standalone revenue from operations of Rs. 47,006.63 lakhs compared to Rs. 58,295.86 lakhs in the previous quarter. Net profit after tax stood at Rs. 142.00 lakhs versus a loss of Rs. 824.09 lakhs in the prior quarter. For the half-year period, revenue reached Rs. 1,05,302.49 lakhs with net profit of Rs. 6,374.40 lakhs. The company operates in manufacturing and sale of organic chemicals as a single reportable segment. During the quarter, the company initiated liquidation proceedings for IGPL Energy Limited. The results were reviewed by the Audit Committee and approved by the Board of Directors.",
            "Sentiment": "neutral",
            "PublishDate": 1762177331590,
            "Source": "earnings"
        },
        {
            "Title": "I G Petrochemicals Reports Sharp Decline in Q2 Profitability and Revenue",
            "Summary": "I G Petrochemicals reported a significant drop in quarterly performance with net profit falling to 14 million rupees from 283 million rupees year-over-year. Revenue declined to 4.65 billion rupees compared to 5.8 billion rupees in the same period last year. EBITDA decreased substantially to 211 million rupees from 643 million rupees year-over-year, while EBITDA margin compressed to 4.53% from 11.03% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762176971294,
            "Source": "earnings"
        },
        {
            "Title": "I G Petrochemicals Approves 1 Billion Rupees Investment in I G Biofuels, Delays Plasticizer Plant",
            "Summary": "I G Petrochemicals has approved an investment of up to 1 billion rupees in I G Biofuels. The company has also extended the completion timeline for its plasticizer plant to March 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1762176559776,
            "Source": "stock"
        },
        {
            "Title": "Mangalore Refinery Swings to Rs 627 Crore Profit in Q2, Revenue Jumps 31%",
            "Summary": "Mangalore Refinery and Petrochemicals Ltd. reported a consolidated profit of Rs 627 crore for the quarter ended September, reversing from a loss of Rs 271 crore in the previous quarter. Revenue increased 30.5% quarter-on-quarter to Rs 22,649 crore. Operating income surged to Rs 1,489 crore with an EBITDA margin of 6.6%. For the first half of the fiscal year, revenue from operations decreased to Rs 46,941 crore compared to Rs 56,075 crore in the same period last year, while the company posted a profit of Rs 367 crore versus a loss in the previous year's first half. The company's Devangonthi terminal achieved its highest monthly dispatch of 65.40 TKL in September. The stock closed 0.77% higher at Rs 142.10, though shares have declined 16.35% over the past 12 months. Analyst ratings are split with two 'buy' and two 'sell' recommendations, with a consensus price target of Rs 139.25.",
            "Sentiment": "positive",
            "PublishDate": 1760549852106,
            "Source": "earnings"
        },
        {
            "Title": "IG Petrochemicals Plans Growth Through PTA Expansion and Specialty Chemicals Diversification",
            "Summary": "IG Petrochemicals is targeting sustainable growth through multiple strategic initiatives including PTA capacity expansion, backward integration, and diversification into specialty chemicals. The company expects support from global demand recovery and import substitution opportunities to improve margins.",
            "Sentiment": "positive",
            "PublishDate": 1755102983259,
            "Source": "stock"
        },
        {
            "Title": "I G Petrochemicals Reports Q1 FY26 Revenue Drop to Rs 481 Crores, Posts Net Loss of Rs 8.2 Crores",
            "Summary": "I G Petrochemicals Limited reported quarterly results showing total revenue of Rs 480.9 crores, down 19% compared to the same quarter last year due to lower production and sales. The company posted a net loss of Rs 8.2 crores versus a profit of Rs 35.4 crores in the previous year quarter. EBITDA declined to Rs 13 crores with margins falling to 2.7% from 12% in the prior year. Export contribution stood at 7% while non-PAN business revenue remained steady at Rs 35 crores. Profitability was impacted by mark-to-market losses of Rs 15.3 crores due to rupee depreciation and compressed margins. The company expects its plasticizer plant to be completed by December 2025 and its compressed biogas plant by April 2026. IGPL is India's largest manufacturer of Phthalic Anhydride with over 50% market share and serves 120+ clients across 20+ industries.",
            "Sentiment": "negative",
            "PublishDate": 1755097468336,
            "Source": "earnings"
        },
        {
            "Title": "I G Petrochemicals Reports Sharp Decline in Q1 Profitability",
            "Summary": "I G Petrochemicals reported Q1 EBITDA of 22 million rupees compared to 618 million rupees in the previous year, representing a significant year-over-year decline. The company's EBITDA margin dropped to 0.47% from 10.56% in the same period last year. Revenue decreased to 4.7 billion rupees from 5.8 billion rupees year-over-year. The company posted a net loss of 82 million rupees versus a net loss of 354 million rupees in the prior year period.",
            "Sentiment": "negative",
            "PublishDate": 1754914193246,
            "Source": "earnings"
        },
        {
            "Title": "IG Petrochemicals to Wind Up Dubai Subsidiary and Delays Plasticizer Plant to December 2025",
            "Summary": "IG Petrochemicals has decided to wind up its Dubai subsidiary due to its non-operational status. The company has also pushed back the completion timeline for its plasticizer plant to December 2025 as part of a strategic project realignment initiative.",
            "Sentiment": "negative",
            "PublishDate": 1754912146003,
            "Source": "stock"
        },
        {
            "Title": "Mangalore Refinery Shares Drop Over 8% Following Q1 Loss of Rs 272 Crore",
            "Summary": "Mangalore Refinery and Petrochemicals Ltd. shares fell over 8% to Rs 136.77 after the company reported a standalone loss of Rs 271.97 crore in the quarter ended June, compared to a profit of Rs 363.4 crore in the previous quarter and Rs 65.57 crore in the year-ago period. Revenue from operations declined 29% to Rs 17,356 crore, while operating income dropped 84% to Rs 180 crore. Margins contracted to 1% from 4.6% in the March quarter. The poor performance was attributed to a longer-than-planned shutdown at the phase-II refinery in May and June, and declining exports which contribute 23% of revenue due to lower plant utilization and feedstock unavailability. The stock has gained 35% over the last 12 months and 6% year-to-date, with trading volume reaching 6.1 times its 30-day average.",
            "Sentiment": "negative",
            "PublishDate": 1753073146561,
            "Source": "earnings"
        },
        {
            "Title": "Mangalore Refinery Reports Rs 272 Crore Loss in Q1",
            "Summary": "Mangalore Refinery and Petrochemicals Ltd. reported a standalone loss of Rs 271.97 crore for the quarter ended June, compared to a profit of Rs 363.4 crore in the same quarter last year. Revenue grew 24% year-on-year to Rs 17,356.2 crore, while operating income fell 84% to Rs 179.6 crore. The Ebitda margin remained flat at 1%. The stock closed 1.16% higher at Rs 149.21 on NSE despite the loss. Shares have declined 34.88% over the past 12 months. Analyst coverage shows mixed ratings with one buy, one hold, and two sell recommendations, with an average price target of Rs 135.75 indicating potential 9% downside.",
            "Sentiment": "negative",
            "PublishDate": 1752852711332,
            "Source": "earnings"
        },
        {
            "Title": "I G Petrochemicals Reports Q4 Results and Announces Dividend",
            "Summary": "I G Petrochemicals reported a net profit of 210 million rupees for the latest quarter, up from 92.1 million rupees year-over-year and 277 million rupees quarter-over-quarter. Revenue for the quarter was 4.8 billion rupees, down from 5.54 billion rupees in the same quarter last year. The company recommended a dividend of 10 rupees per equity share. Additionally, I G Petrochemicals approved setting up a project for the production of pyrolysis oil.",
            "Sentiment": "positive",
            "PublishDate": 1747700285000,
            "Source": "default"
        },
        {
            "Title": "I G Petrochemicals Approves New Project and Dividend, Reports Q4 EBITDA Growth",
            "Summary": "I G Petrochemicals has approved setting up a project for the production of pyrolysis oil. The company has recommended a dividend of 10 rupees per equity share. For the fourth quarter, I G Petrochemicals reported an EBITDA of 489 million rupees, up from 261.1 million rupees in the same quarter last year. The EBITDA margin improved to 10.18% from 4.71% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747667399000,
            "Source": "default"
        },
        {
            "Title": "I G Petrochemicals Reports Q4 Financial Results",
            "Summary": "I G Petrochemicals has announced its financial results for the fourth quarter. The company reported a net profit of 210 million rupees, compared to 92.1 million rupees in the same quarter last year and 277 million rupees in the previous quarter. Revenue for Q4 stood at 4.8 billion rupees, down from 5.54 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1747667298000,
            "Source": "result"
        },
        {
            "Title": "I G Petrochemicals Schedules Analyst/Investor Meeting",
            "Summary": "I G Petrochemicals has announced a meeting with analysts and investors scheduled for March 19 at 4 PM. This meeting suggests the company's intention to communicate with stakeholders, potentially discussing financial results, business strategies, or future plans.",
            "Sentiment": "neutral",
            "PublishDate": 1741848883000,
            "Source": "corporate_governance"
        },
        {
            "Title": "I G Petrochemicals Reports Profit in Q3 FY2024",
            "Summary": "I G Petrochemicals has announced its financial results for the third quarter. The company reported a net profit of 277 million rupees, compared to a loss of 152 million rupees in the same quarter of the previous year. Revenue for the quarter increased to 5.58 billion rupees from 4.88 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739492259000,
            "Source": "earnings"
        },
        {
            "Title": "I G Petrochemicals Reports Significant EBITDA Improvement in Q3",
            "Summary": "I G Petrochemicals has reported a substantial improvement in its Q3 EBITDA, posting a gain of 457 million rupees compared to a loss of 59 million rupees in the same quarter last year. The company's Q3 EBITDA margin stands at 8.19%.",
            "Sentiment": "positive",
            "PublishDate": 1739451228000,
            "Source": "earnings"
        },
        {
            "Title": "I G Petrochemicals Reports Profit in Q3 FY2024",
            "Summary": "I G Petrochemicals has reported a net profit of 277 million rupees in the third quarter, compared to a loss of 152 million rupees in the same period last year. The company's revenue increased to 5.58 billion rupees from 4.88 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739451221000,
            "Source": "earnings"
        },
        {
            "Title": "I G Petrochemicals Reports Strong Q2 Financial Results",
            "Summary": "I G Petrochemicals has announced its Q2 financial results, showing significant year-over-year improvements. The company's net profit increased to 283 million rupees from 101 million rupees in the same quarter last year. Revenue grew to 5.8 billion rupees from 5 billion rupees. EBITDA rose to 643 million rupees from 259 million rupees, with the EBITDA margin expanding to 11.03% from 5.17% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731455789000,
            "Source": "result"
        }
    ]
}