{
    "Symbol": "IIFL",
    "ISIN": "INE530B01024",
    "News": [
        {
            "Title": "IIFL Finance Announces ₹2,000 Cr NCD Public Issue",
            "Summary": "IIFL Finance Limited announces public issue of secured NCDs worth up to ₹2,000 crores with base size of ₹500 crores. Finance Committee approved the issue on February 12, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770927599124,
            "Source": "co_actions_results"
        },
        {
            "Title": "IIFL Finance Gets Credit Rating Updates from ICRA, CRISIL",
            "Summary": "ICRA reaffirmed [ICRA]AA (Negative) ratings for IIFL Finance's NCDs and debt programmes, while CRISIL assigned AA/Stable rating to Rs.2,000 crore NCDs and reaffirmed existing ratings.",
            "Sentiment": "neutral",
            "PublishDate": 1770895024350,
            "Source": "stocks"
        },
        {
            "Title": "IIFL Finance Allots 57,291 Equity Shares via ESOPs",
            "Summary": "IIFL Finance's Nomination and Remuneration Committee approved allotment of 57,291 equity shares to employees through exercise of stock options under Employee Stock Option Schemes on February 06, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770383366593,
            "Source": "co_actions_results"
        },
        {
            "Title": "IIFL Finance announces senior management changes",
            "Summary": "IIFL Finance Limited announces resignation of Pranav Dholakia as Head - Construction and Real Estate effective January 31, 2026, and appointment of Sudhanshu Pareek as his replacement from February 01, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769785418206,
            "Source": "stocks"
        },
        {
            "Title": "IIFL Finance Subsidiary Gets CRISIL Rating Reaffirmation",
            "Summary": "CRISIL Ratings reaffirmed credit ratings for IIFL Home Finance Limited, a material subsidiary of IIFL Finance Limited, maintaining CRISIL AA/Stable ratings across multiple instruments.",
            "Sentiment": "positive",
            "PublishDate": 1769682852663,
            "Source": "stocks"
        },
        {
            "Title": "IIFL Finance Sets Leverage & Capital Targets",
            "Summary": "IIFL Finance aims to maintain leverage at 4-4.5% and capital adequacy near 20%, while actively monitoring for potential capital raising opportunities during recent conference call.",
            "Sentiment": "neutral",
            "PublishDate": 1769137324471,
            "Source": "co_actions_results"
        },
        {
            "Title": "IIFL Finance Sets 15-16% AUM Growth Target for Housing",
            "Summary": "IIFL Finance announces ambitious housing loan expansion plans with 15-16% AUM growth and 24-25% disbursement increase for next year, following completion of cleanup operations this quarter.",
            "Sentiment": "positive",
            "PublishDate": 1769137256434,
            "Source": "stocks"
        },
        {
            "Title": "IIFL Finance Q3: Stock Falls 10% Despite Gold Loan Surge",
            "Summary": "IIFL Finance shares dropped 10% after announcing Income Tax audit directive alongside Q3 results showing 189% YoY gold loan growth and strong financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1769074354214,
            "Source": "co_actions_results"
        },
        {
            "Title": "IIFL Finance Board Meet on Jan 22 for Q3 Results",
            "Summary": "IIFL Finance Limited has scheduled its board meeting for January 22, 2026, to consider Q3FY26 financial results and potential interim dividend declaration for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1768579832753,
            "Source": "co_actions_results"
        },
        {
            "Title": "IIFL Finance Receives ₹15.05 Lakh GST Penalty Order",
            "Summary": "IIFL Finance Limited received a GST penalty order of ₹15.05 lakhs from Assistant Commissioner GST Delhi for alleged non-payment of tax over exempt supplies for FY 2021-22. Company plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1767364535906,
            "Source": "stocks"
        },
        {
            "Title": "IIFL Finance Allots ₹800 Crore NCDs on December 30",
            "Summary": "IIFL Finance Limited completed allotment of ₹800 crore non-convertible debentures across three series with tenures ranging from 7-10 years and perpetual options, carrying interest rates of 9.25%-9.90%.",
            "Sentiment": "positive",
            "PublishDate": 1767081338140,
            "Source": "co_actions_results"
        },
        {
            "Title": "IIFL Finance Gets IND AA/Stable Rating on ₹50,000 Cr",
            "Summary": "India Ratings assigns IND AA/Stable rating to IIFL Finance's ₹20,000 crore bank loans and ₹30,000 crore NCDs, while affirming existing ratings on ₹55,500 crore facilities.",
            "Sentiment": "positive",
            "PublishDate": 1767019745561,
            "Source": "stocks"
        },
        {
            "Title": "IIFL Finance Approves ₹800 Crore NCD Issuance",
            "Summary": "IIFL Finance's board committee approved issuance of Non-Convertible Debentures worth up to ₹800 crores on private placement basis, comprising two series with different structures and tenures.",
            "Sentiment": "neutral",
            "PublishDate": 1766418883633,
            "Source": "co_actions_results"
        },
        {
            "Title": "IIFL Finance Appoints B. P. Kanungo as Chairman",
            "Summary": "IIFL Finance has appointed B. P. Kanungo, former RBI Deputy Governor, as the new Chairperson of the Board, bringing significant regulatory and banking expertise to the leadership team.",
            "Sentiment": "positive",
            "PublishDate": 1766214620164,
            "Source": "stocks"
        },
        {
            "Title": "IIFL Finance Plans ₹1,000 Cr NCD Issue Discussion",
            "Summary": "IIFL Finance scheduled board meeting on December 22nd to discuss issuing non-convertible debentures worth up to ₹100 billion, marking significant fundraising initiative.",
            "Sentiment": "neutral",
            "PublishDate": 1765983919407,
            "Source": "stocks"
        },
        {
            "Title": "IIFL Home Finance Gets IVR A1+ Rating for ₹3,000 Cr CP",
            "Summary": "Infomerics assigns IVR A1+ rating to IIFL Home Finance's proposed ₹3,000 crore commercial paper issue. The subsidiary received the rating assignment on December 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765882406559,
            "Source": "stocks"
        },
        {
            "Title": "IIFL Finance Allots ₹650 Cr Non-Convertible Debentures",
            "Summary": "IIFL Finance Limited successfully allotted 6,500 non-convertible debentures worth ₹650 crores under Series D34 on December 16, 2025, with a 3-year tenure maturing in December 2028.",
            "Sentiment": "positive",
            "PublishDate": 1765877751596,
            "Source": "co_actions_results"
        },
        {
            "Title": "S&P Upgrades IIFL Finance Outlook to Positive",
            "Summary": "S&P Global Ratings upgrades IIFL Finance outlook to Positive from Stable, citing gold loan market share recovery and expected improvements in return on assets with lower credit costs.",
            "Sentiment": "positive",
            "PublishDate": 1765803911041,
            "Source": "stocks"
        },
        {
            "Title": "IIFL Finance Gets Updated Credit Ratings from Infomerics",
            "Summary": "IIFL Finance receives new IVRAA/Stable rating for ₹150 crore perpetual debt instrument while Infomerics reaffirms existing ratings for ₹5,500 crore worth of debt instruments on December 22, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765451237425,
            "Source": "stocks"
        },
        {
            "Title": "IIFL Finance Finalizes ₹100 Cr NCD Issue Terms",
            "Summary": "IIFL Finance's Finance Committee approved final terms for Series D34 NCDs worth up to ₹100 crores on private placement basis, with base size of ₹25 crores and greenshoe option of ₹75 crores.",
            "Sentiment": "positive",
            "PublishDate": 1765434977755,
            "Source": "co_actions_results"
        },
        {
            "Title": "IIFL Finance Allots 1,25,816 Equity Shares to Employees Under ESOP Scheme",
            "Summary": "IIFL Finance Limited's Nomination and Remuneration Committee approved the allotment of 1,25,816 equity shares to employees upon exercise of stock options under the company's Employee Stock Option Schemes. The allotment was approved through a circular resolution and affects employees participating in the ESOP program, representing employee compensation and potential equity dilution for existing shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1764931977127,
            "Source": "corporate_action"
        },
        {
            "Title": "IIFL Finance Board Approves Rs 2,000 Crore Non-Convertible Debentures Issue",
            "Summary": "IIFL Finance Limited's Board of Directors approved the public issue of secured, rated, listed, redeemable non-convertible debentures with a shelf limit of up to Rs 2,000 crore, including greenshoe option, to be issued in one or more tranches. The approval is subject to regulatory and statutory approvals and will be executed in compliance with SEBI regulations for non-convertible securities.",
            "Sentiment": "positive",
            "PublishDate": 1764139502163,
            "Source": "corporate_action"
        },
        {
            "Title": "IIFL Finance Receives Credit Rating Reaffirmation and New Assignment from Brickwork Ratings",
            "Summary": "Brickwork Ratings India reaffirmed BWR AA+/Stable ratings for IIFL Finance's existing Non-Convertible Debentures worth Rs. 1,022.04 crores and Perpetual Debt Instruments, while assigning BWR AA+/Stable rating to new public NCDs worth Rs. 2,000 crores. The rating actions demonstrate the credit rating agency's continued confidence in IIFL Finance's creditworthiness across its debt instruments portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1763735705950,
            "Source": "corporate_action"
        },
        {
            "Title": "IIFL Finance Schedules Board Meeting to Consider Debenture Issuance",
            "Summary": "IIFL Finance has announced a board meeting scheduled for November 26 to discuss the issuance of debentures. The meeting will focus on potential debt fundraising through debenture instruments, which could impact the company's capital structure and funding strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1763726136181,
            "Source": "corporate_action"
        },
        {
            "Title": "IIFL Finance Exercises Call Option on Non-Convertible Debentures Series D27",
            "Summary": "IIFL Finance Limited has exercised its call option on Secured Rated Listed Redeemable Non-Convertible Debentures Series D27 with face value of Rs. 1,00,000 per NCD, setting November 17, 2025 as record date and December 3, 2025 as redemption date. The company will pay call option price along with accrued interest to eligible debenture holders, with all NCDs to be fully extinguished after redemption payment.",
            "Sentiment": "neutral",
            "PublishDate": 1763467402361,
            "Source": "corporate_action"
        },
        {
            "Title": "IIFL Finance Reports Strong Q2 Results with 61% Jump in Net Profit to Rs 418 Crore",
            "Summary": "IIFL Finance Limited announced consolidated quarterly results for the quarter ended September 30, 2025, showing net profit after tax of Rs 417.94 crore compared to Rs 258.11 crore in the previous quarter. Total income increased to Rs 6,268.46 crore for the half year from Rs 5,193.74 crore in the corresponding period. The company's loan book grew to Rs 60,150.58 crore from Rs 55,364.26 crore. The board approved amendments to insider trading code and made key management appointments - Mr. Pranav Dholakia was re-designated as Head of Construction and Real Estate, while Mr. Rahul Sanklecha was appointed as Chief Risk Officer, both effective November 1, 2025. The company maintains a debt-equity ratio of 4.18 and reported GNPA of 2.14% with NNPA at 1.02%.",
            "Sentiment": "positive",
            "PublishDate": 1761852230775,
            "Source": "earnings"
        },
        {
            "Title": "IIFL Finance Grants 44,000 Stock Options to Employees Under ESOP Scheme",
            "Summary": "IIFL Finance Limited's Nomination and Remuneration Committee approved the grant of 44,000 stock options to identified employees under the Employee Stock Option Scheme 2008. Each option is convertible into one fully paid-up equity share. The options will have a minimum vesting period of one year from the grant date, with vesting schedule and pricing specified in individual grant letters. The NRC meeting was held on October 30, 2025, lasting from 10:45 a.m. to 11:00 a.m.",
            "Sentiment": "positive",
            "PublishDate": 1761836110237,
            "Source": "corporate_action"
        },
        {
            "Title": "IIFL Finance Sets Ambitious Growth Targets with ₹1 Lakh Cr AUM Goal by FY26",
            "Summary": "IIFL Finance has announced strategic targets to achieve ₹1 lakh crore in assets under management by FY26. The company plans to maintain a 70% secured asset mix, target 15% return on equity, keep gross non-performing assets at 2%, and expand to over 4,800 branches. The growth strategy is supported by significant gold loan expansion showing 220% year-on-year growth, home loan segment development, and an upgraded Fitch rating to positive outlook. The company is implementing an AI-driven risk and governance framework to support sustainable double-digit profit growth.",
            "Sentiment": "positive",
            "PublishDate": 1761834684405,
            "Source": "stock"
        },
        {
            "Title": "IIFL Finance Reports Strong Turnaround with Q2 Net Profit of 3.76 Billion Rupees",
            "Summary": "IIFL Finance reported a consolidated net profit of 3.76 billion rupees for Q2, marking a significant turnaround from a loss of 1.58 billion rupees in the same quarter last year. The company's revenue grew to 33 billion rupees compared to 25.56 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761825906452,
            "Source": "earnings"
        },
        {
            "Title": "IIFL Home Finance Appoints Girish Kousgi as Managing Director and CEO",
            "Summary": "IIFL Home Finance has appointed Girish Kousgi as its new Managing Director and CEO. The leadership change represents a key executive appointment at the housing finance company.",
            "Sentiment": "neutral",
            "PublishDate": 1761819996153,
            "Source": "corporate_governance"
        },
        {
            "Title": "IIFL Finance Exercises Call Option on Non-Convertible Debentures Series D27",
            "Summary": "IIFL Finance Limited has announced its decision to exercise the call option on its Secured Rated Listed Redeemable Non-Convertible Debentures Series D27. The debentures carry a face value of Rs. 1,00,000 per NCD with a call option price of Rs. 1,00,000. The company has set November 17, 2025 as the record date and December 03, 2025 as the redemption date. Debenture holders are required to offer their debentures pursuant to this call option exercise. The redemption amount, including accrued interest, will be paid to eligible debenture holders by crediting their bank accounts linked to their demat accounts. All NCDs will be fully extinguished after the redemption payment is completed.",
            "Sentiment": "neutral",
            "PublishDate": 1761650269122,
            "Source": "corporate_action"
        },
        {
            "Title": "Fitch Upgrades IIFL Finance Outlook to Positive, Affirms B+ Rating",
            "Summary": "Fitch Ratings revised IIFL Finance's long-term rating outlook to positive from stable and affirmed its senior secured debt rating at 'B+'. The rating agency expects the company's credit profile to improve over the next two years, particularly in business and risk profiles, asset quality and funding diversity. Fitch anticipates a gradual decline in legacy problem assets and stabilization of asset quality risks as management shifts the portfolio towards secured lending categories. However, the agency noted that near-term credit costs will remain elevated as management addresses existing problem loans, and rapid loan expansion could strain risk and control frameworks. RBI had prohibited IIFL Finance from sanctioning, disbursing, or selling gold loans citing supervisory concerns including deviations in gold assaying and purity certification, and loan-to-value ratio breaches. The restrictions were lifted in September 2024.",
            "Sentiment": "positive",
            "PublishDate": 1760661393426,
            "Source": "stock"
        },
        {
            "Title": "IIFL Home Finance Appoints Girish Kousgi As New MD & CEO",
            "Summary": "IIFL Home Finance has appointed Girish Kousgi as its new Managing Director and Chief Executive Officer.",
            "Sentiment": "positive",
            "PublishDate": 1759909791490,
            "Source": "corporate_governance"
        },
        {
            "Title": "IIFL Finance Allots ₹500 Crore Perpetual Debentures at 9.90% Coupon Rate",
            "Summary": "IIFL Finance Limited has allotted 500 perpetual, unsecured, non-convertible debentures with a face value of ₹1 crore each, totaling ₹500 crores on a private placement basis. The debentures carry a coupon rate of 9.90% and will be listed on the National Stock Exchange of India Limited. The allotment was approved by the Finance Committee of the Board of Directors on September 30, 2025. Being perpetual in nature, these debentures have no maturity date, though the company can exercise a call option after 10 years with RBI approval. Interest payments are scheduled annually starting September 30, 2026. In case of payment default, the company will pay additional interest at 2% per annum over the coupon rate for the defaulting period.",
            "Sentiment": "neutral",
            "PublishDate": 1759214719776,
            "Source": "corporate_action"
        },
        {
            "Title": "IIFL Finance Announces Early Closure of ₹500 Crore NCD Issue on April 11",
            "Summary": "IIFL Finance Limited decided to close its public issue of Non-Convertible Debentures early on April 11, 2025, instead of the originally scheduled April 23, 2025. The issue opened on April 7, 2025, and aims to raise up to ₹500 crore within a shelf limit of ₹2,500 crore. The NCDs are secured, rated, listed, and redeemable with a face value of ₹1,000 each. The issue consists of ₹100 crore base size with a green shoe option of up to ₹400 crore. The Finance Committee of the Board of Directors made the decision for early closure, with the subscription list remaining open until 3:00 p.m. on April 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757133353033,
            "Source": "corporate_action"
        },
        {
            "Title": "IIFL Finance Board Approves ₹300 Crore Perpetual Debt Issue",
            "Summary": "IIFL Finance's board has approved a ₹300 crore perpetual debt issue through private placement. This capital raising initiative will provide the company with additional funding through debt instruments that have no fixed maturity date.",
            "Sentiment": "neutral",
            "PublishDate": 1756913733692,
            "Source": "corporate_action"
        },
        {
            "Title": "IIFL Home Finance CEO Monu Ratra Resigns to Pursue Other Career Opportunities",
            "Summary": "Monu Ratra, Executive Director and Chief Executive Officer of IIFL Home Finance Limited, has resigned from his position effective October 6, 2025. IIFL Home Finance Limited is a material subsidiary of IIFL Finance Limited. Ratra submitted his resignation letter on August 14, 2025, citing his decision to pursue other career opportunities. The resignation affects the leadership of IIFL's home financing subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1755184446612,
            "Source": "corporate_governance"
        },
        {
            "Title": "IIFL Finance Reports Mixed Q1 FY26 Results with Strong Gold Loan Recovery but Rising Credit Costs",
            "Summary": "IIFL Finance reported profit after tax of Rs.274 crores for Q1 FY26, up 9% quarter-on-quarter but down 19% year-on-year. Pre-provision operating profit increased 28% quarter-on-quarter to Rs.836 crores. Consolidated loan AUM grew 21% year-on-year to Rs.83,889 crores, driven by gold loans which surged 85% year-on-year to Rs.27,274 crores, surpassing pre-embargo levels. However, asset quality deteriorated with gross NPA at 2.3% and net NPA at 1.1%. The company faced challenges in MSME and microfinance segments, leading to higher provisioning of over Rs.500 crores. Management expects full-year credit costs around 3% compared to earlier guidance of 2.5%-2.7%. The company discontinued unsecured MSME and micro-LAP businesses due to asset quality concerns. Gold loan portfolio LTV stands at 66% with yields improving to 18.2%. Management targets overall AUM growth of around 20% for the full year while maintaining ROA guidance of 3%. The company strengthened its board with former RBI Deputy Governor B.P. Kanungo joining as a board member.",
            "Sentiment": "neutral",
            "PublishDate": 1754554717511,
            "Source": "earnings"
        },
        {
            "Title": "IIFL Finance Targets Rating Upgrade Through Housing Focus and AUM Growth Following RBI Gold Loan Ban",
            "Summary": "IIFL Finance is working toward improved credit ratings by focusing on strong assets under management (AUM) growth and emphasizing its housing finance business. The company is also updating its cost structure following an RBI ban on its gold loan operations. IIFL Finance expects to achieve profit recovery by the second half of FY26.",
            "Sentiment": "positive",
            "PublishDate": 1753886668401,
            "Source": "stock"
        },
        {
            "Title": "IIFL Finance Reports Q1 FY26 Results with Leadership Restructuring",
            "Summary": "IIFL Finance Limited announced its quarterly results for the period ended June 30, 2025, reporting consolidated net profit of ₹274.17 crore and standalone net profit of ₹132.77 crore. The company's consolidated total income reached ₹2,959.30 crore while standalone total income was ₹1,485.56 crore. The board approved several leadership changes including the re-designation of Mayank Sharma as Chief AI & Innovation Officer, appointment of K S Praveen as Head of Internal Audit, and Binay Kumar Mishra as Head of Legal. The company allotted 4,13,897 equity shares under employee stock option schemes during the quarter. Key financial ratios include consolidated earnings per share of ₹5.49, debt-equity ratio of 3.86, and GNPA of 2.34%.",
            "Sentiment": "neutral",
            "PublishDate": 1753875037562,
            "Source": "earnings"
        },
        {
            "Title": "IIFL Finance Schedules Q1 FY 2025-26 Earnings Conference Call for July 31, 2025",
            "Summary": "IIFL Finance Limited will host an earnings conference call on July 31, 2025, at 2:30 p.m. IST to discuss the company's financial performance for Q1 FY 2025-26 with investors and analysts. The management will participate in the call to review quarterly results. The presentation and transcript will be submitted to stock exchanges and made available on the company's website at www.iifl.com following regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1753362187758,
            "Source": "earnings"
        },
        {
            "Title": "Arun Kumar Purwar Retires as Non-Executive Director of IIFL Finance",
            "Summary": "Arun Kumar Purwar has retired as Non-Executive Director of IIFL Finance Limited effective July 18, 2025. The retirement was approved by shareholders at the company's Annual General Meeting held on July 18, 2025, with the requisite majority. The retirement occurred by rotation at the AGM. IIFL Finance informed the stock exchanges including NSE and BSE about this board change.",
            "Sentiment": "neutral",
            "PublishDate": 1753156537144,
            "Source": "corporate_governance"
        },
        {
            "Title": "IIFL Finance Board Approves ₹600 Crore NCD Issuance",
            "Summary": "The Board of Directors of IIFL Finance has approved the issuance of Non-Convertible Debentures (NCDs) worth ₹600 crore through private placement. This decision indicates a significant financial move by the company to raise capital.",
            "Sentiment": "positive",
            "PublishDate": 1750341925000,
            "Source": "default"
        },
        {
            "Title": "Former RBI Deputy Governor B.P. Kanungo Joins IIFL Finance Board",
            "Summary": "Shri B.P. Kanungo, who previously served as the Deputy Governor of the Reserve Bank of India (RBI), has been appointed to the board of IIFL Finance. This addition brings significant financial expertise to the company's leadership.",
            "Sentiment": "positive",
            "PublishDate": 1750118869000,
            "Source": "default"
        },
        {
            "Title": "IIFL Finance Appoints Former RBI Deputy Governor to Board",
            "Summary": "IIFL Finance has welcomed B.P. Kanungo, a former Deputy Governor of the Reserve Bank of India (RBI), to its board of directors. This appointment is seen as a positive development for the company.",
            "Sentiment": "positive",
            "PublishDate": 1750077154000,
            "Source": "default"
        },
        {
            "Title": "IIFL Finance: Former RBI Deputy Governor BP Kanungo to Join Board",
            "Summary": "BP Kanungo, ex-RBI deputy governor, is set to become an independent director at IIFL Finance. This comes a year after RBI's gold loan ban on IIFL, which was lifted in September 2024. Kanungo will replace AK Purwar for a five-year term, bringing expertise in risk management and governance.",
            "Sentiment": "positive",
            "PublishDate": 1750034799000,
            "Source": "corporate_governance"
        },
        {
            "Title": "IIFL Finance: Plans ₹600 Crore NCD Issuance via Private Placement",
            "Summary": "IIFL Finance Ltd approved issuance of secured redeemable NCDs up to ₹600 crore in one or more tranches. The fundraise aims to augment long-term resources and support the company's growing lending book, particularly in retail lending segments like gold loans, home finance, and business loans.",
            "Sentiment": "positive",
            "PublishDate": 1749566329000,
            "Source": "corporate_action"
        },
        {
            "Title": "IIFL Finance to Consider Raising ₹100 Billion Through NCDs",
            "Summary": "IIFL Finance's Board of Directors is scheduled to meet on June 10 to discuss the possibility of raising up to ₹100 billion through the issuance of Non-Convertible Debentures (NCDs). This meeting suggests the company is exploring options for significant fundraising.",
            "Sentiment": "neutral",
            "PublishDate": 1749122202000,
            "Source": "default"
        },
        {
            "Title": "DFS Suggests Exclusion of Small Ticket Gold Loan Borrowers from Proposed Norms",
            "Summary": "The Department of Financial Services (DFS) has proposed that borrowers of gold loans below Rs 2 lakh may be excluded from the requirements of proposed directions for gold loan norms. This suggestion pertains to small ticket borrowers in the gold loan sector.",
            "Sentiment": "neutral",
            "PublishDate": 1748577436000,
            "Source": "default"
        },
        {
            "Title": "IIFL Finance Approves Issuance of Secured Non-Convertible Debentures",
            "Summary": "IIFL Finance has approved the issuance of secured non-convertible debentures up to 2 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1747829908000,
            "Source": "default"
        }
    ]
}