{
    "Symbol": "IIFLCAPS",
    "ISIN": "INE489L01022",
    "News": [
        {
            "Title": "IIFL Capital Schedules Q3FY26 Earnings Call",
            "Summary": "IIFL Capital Services Limited announces earnings conference call on February 11, 2026, to discuss Q3FY26 and nine months performance ending December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770458865854,
            "Source": "stocks"
        },
        {
            "Title": "IIFL Capital Gets ESG Score of 77.8 from SES ESG",
            "Summary": "IIFL Capital Services Limited receives voluntary ESG score of 77.8 from SES ESG Research Private Limited based on FY25 disclosures and publicly available information.",
            "Sentiment": "positive",
            "PublishDate": 1770211509378,
            "Source": "stocks"
        },
        {
            "Title": "IIFL Capital allots 51,350 shares, grants 967,627 options",
            "Summary": "IIFL Capital's NRC approves allotment of 51,350 equity shares under ESOS-2018 and grants 967,627 stock options to employees at Rs. 315.25 per option with 4-year vesting period.",
            "Sentiment": "neutral",
            "PublishDate": 1770200786371,
            "Source": "co_actions_results"
        },
        {
            "Title": "India GDP Growth Needs Caution; Earnings to Accelerate in FY27",
            "Summary": "IIFL Capital's GV Giri says India's 8.20% GDP growth is inflated by compressed deflator, with actual growth closer to 6.50-7%. Expects Nifty earnings growth of 16-17% in FY27, led by banks benefiting from rate cuts.",
            "Sentiment": "neutral",
            "PublishDate": 1768389594430,
            "Source": "stocks"
        },
        {
            "Title": "IIFL Capital Clarifies on TPG Stake Reports",
            "Summary": "IIFL Capital addresses media reports about TPG Capital potentially acquiring 30-40% minority stake, stating it explores strategic opportunities but has no disclosures required under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1767793680007,
            "Source": "co_actions_results"
        },
        {
            "Title": "IIFL Capital denies TPG deal, clarifies no disclosure needed",
            "Summary": "IIFL Capital Services clarifies to BSE that while it explores strategic opportunities, no current developments require disclosure under SEBI regulations, addressing recent TPG Capital acquisition reports.",
            "Sentiment": "neutral",
            "PublishDate": 1767747845889,
            "Source": "co_actions_results"
        },
        {
            "Title": "IIFL Capital Completes Slump Sale of PMS Business",
            "Summary": "IIFL Capital Services has executed a slump sale of its Portfolio Management Services business to its wholly owned subsidiary IIFL Capital Asset Management as part of corporate restructuring.",
            "Sentiment": "neutral",
            "PublishDate": 1767100175877,
            "Source": "co_actions_results"
        },
        {
            "Title": "IIFL Capital Gets IRDAI Corporate Agent License",
            "Summary": "IIFL Capital Services receives Certificate of Registration from IRDAI to operate as Corporate Agent (Composite), enabling distribution of life and non-life insurance products until December 2028.",
            "Sentiment": "positive",
            "PublishDate": 1766495244896,
            "Source": "stocks"
        },
        {
            "Title": "IIFL Capital Gets IVRA1+ Rating on ₹3,050 Cr CP",
            "Summary": "Infomerics assigns IVRA1+ rating to IIFL Capital Services' ₹3,050 crore commercial paper program, reflecting strong creditworthiness and financial stability of the financial services company.",
            "Sentiment": "positive",
            "PublishDate": 1765966128682,
            "Source": "stocks"
        },
        {
            "Title": "IIFL Capital Faces ₹3.78L NCDEX Penalty",
            "Summary": "IIFL Capital Services receives penalty from NCDEX for client's open interest limit violation. Company initiates corrective measures to prevent recurrence of compliance issues.",
            "Sentiment": "negative",
            "PublishDate": 1765548058229,
            "Source": "stocks"
        },
        {
            "Title": "SAT Reduces Penalty on IIFL Commodities",
            "Summary": "The Securities Appellate Tribunal (SAT) has reduced the penalty imposed on IIFL Commodities, a subsidiary of IIFL Capital Services. This development provides regulatory relief for the company and may positively impact its financial position.",
            "Sentiment": "positive",
            "PublishDate": 1764893232870,
            "Source": "stock"
        },
        {
            "Title": "IIFL Capital Services Allots 2.47 Lakh Equity Shares Under Employee Stock Option Scheme",
            "Summary": "IIFL Capital Services Limited allotted 2,47,405 equity shares to employees under the IIFL ESOS-2018 scheme through a circular resolution by the Nomination and Remuneration Committee. The allotment increased the company's equity base from 310,620,379 to 310,867,784 equity shares of Rs. 2 each, with the new shares ranking pari passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764246166804,
            "Source": "corporate_action"
        },
        {
            "Title": "IIFL Capital Services Gets Commercial Paper Rating Reaffirmed by CRISIL at Rs 3,050 Crore",
            "Summary": "CRISIL Ratings Limited reaffirmed the CRISIL A1+ rating on IIFL Capital Services Limited's commercial paper program, with the amount enhanced from Rs 1,050 crore to Rs 3,050 crore. The rating reaffirmation indicates maintained creditworthiness and provides the company with continued access to short-term funding at the enhanced limit.",
            "Sentiment": "positive",
            "PublishDate": 1763461261828,
            "Source": "corporate_action"
        },
        {
            "Title": "IIFL Capital Q2FY26 Results: Revenue Drops 8% YoY to Rs 592 Crores Amid Regulatory Headwinds",
            "Summary": "IIFL Capital Services reported consolidated revenue of Rs 592 crores for Q2FY26, declining 8% year-on-year, with retail equities income falling 24% to Rs 271 crores due to new FRO trading regulations. The company's operational PBT before MTM stood at Rs 164 crores, down 20% YoY, while cross-sell assets grew to Rs 44,000 crores with the wealth management business continuing expansion despite competitive hiring challenges.",
            "Sentiment": "negative",
            "PublishDate": 1763144957322,
            "Source": "earnings"
        },
        {
            "Title": "IIFL Capital Services Reports Decline in Q2 Financial Performance",
            "Summary": "IIFL Capital Services reported Q2 EBITDA of 2.12 billion rupees compared to 2.7 billion rupees in the same quarter last year. The company's EBITDA margin decreased to 37.23% from 41.27% year-over-year. Consolidated net profit fell to 844 million rupees from 2.1 billion rupees in the previous year's corresponding quarter. Revenue declined to 5.7 billion rupees from 6.45 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762528244344,
            "Source": "earnings"
        },
        {
            "Title": "IIFL Capital Services Allots 252,550 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "IIFL Capital Services Limited allotted 252,550 equity shares to employees under the IIFL Securities Limited Employee Stock Option Scheme-2018. The allotment was approved by the Nomination and Remuneration Committee through a circular resolution. Following this allotment, the company's equity base increased from 310,367,829 to 310,620,379 equity shares of Rs. 2 each. The newly allotted shares will rank equally with existing equity shares from the date of allotment.",
            "Sentiment": "neutral",
            "PublishDate": 1762205844278,
            "Source": "corporate_action"
        },
        {
            "Title": "TPG Capital Leads Bid to Acquire Up to 19.99% Stake in IIFL Capital",
            "Summary": "IIFL Capital is potentially securing a major private equity investor, with TPG Capital leading the bid to purchase up to 19.99% stake in the company. This represents a significant private equity investment opportunity for the financial services firm.",
            "Sentiment": "positive",
            "PublishDate": 1761644511254,
            "Source": "order&deals"
        },
        {
            "Title": "IIFL Capital Services Receives ESG Rating of 79 from CFC Finlease",
            "Summary": "CFC Finlease Private Limited, a SEBI-registered ESG Rating Provider, has assigned an ESG rating of 79 to IIFL Capital Services Limited. The rating was assigned voluntarily based on publicly available information and was published on NSE and BSE websites on October 21, 2025. IIFL Capital Services informed the stock exchanges about this development under regulatory disclosure requirements.",
            "Sentiment": "positive",
            "PublishDate": 1761228812181,
            "Source": "stock"
        },
        {
            "Title": "IIFL Capital Corrects Q1FY26 Wealth Management Revenue from ₹8 Crores to ₹28 Crores",
            "Summary": "IIFL Capital Services Limited submitted a revised earnings conference call transcript correcting a significant error in their wealth management revenue reporting. The company's new wealth management team generated ₹28 crores in revenue for Q1FY26, not the previously stated ₹8 crores which represented only one month's performance. The company reported consolidated revenue of ₹680 crores for the quarter, up 19% quarter-on-quarter and 6% year-on-year. Institutional and investment banking revenue nearly doubled from the previous quarter, while retail brokerage increased 15%. The company is transforming its retail broking segment into a wealth management practice and has added approximately 50 relationship managers targeting high net worth clients. Employee costs increased to ₹176 crores due to headcount expansion for the wealth business buildup. Profit after tax rose 37% quarter-on-quarter to ₹176 crores. The company expects elevated cost-to-income ratios during this transformation phase, with the non-institutional business segment operating at around 75% cost-to-income ratio.",
            "Sentiment": "positive",
            "PublishDate": 1755013539961,
            "Source": "earnings"
        },
        {
            "Title": "IIFL Capital Services Reports 19% Quarter-on-Quarter Revenue Growth, Expands Wealth Management Team",
            "Summary": "IIFL Capital Services Limited reported consolidated revenue of Rs. 680 crores for Q1 FY26, marking a 19% increase quarter-on-quarter and 6% year-on-year growth. The company's institutional and investment banking revenue nearly doubled from the previous quarter, while retail brokerage increased 15% quarter-on-quarter but declined 28% year-on-year due to regulatory changes in December 2024 that reduced expiry dates. Distribution income rose 37% year-on-year to Rs. 145 crores. Other income surged to Rs. 63 crores from Rs. 4 crores in the previous year, primarily due to mark-to-market gains on BSE shares. The company added approximately 50 relationship managers as part of its transformation from retail broking to wealth management services, targeting clients with Rs. 5-25 crores and above Rs. 25 crores net worth. Employee costs increased 36% year-on-year to Rs. 176 crores due to headcount expansion and wealth team recruitment. Profit after tax reached Rs. 176 crores, up 37% quarter-on-quarter but down 4% year-on-year. The company maintains F&O market share of 0.62% and cash market share of 2.57%.",
            "Sentiment": "positive",
            "PublishDate": 1754320178859,
            "Source": "earnings"
        },
        {
            "Title": "IIFL Capital Shifts Strategy from Retail Broking to Wealth Management",
            "Summary": "IIFL Capital is advancing a strategic shift from retail broking to wealth management. The company is experiencing strong block deal activity and has secured investment banking wins during this transition.",
            "Sentiment": "positive",
            "PublishDate": 1753720743418,
            "Source": "stock"
        },
        {
            "Title": "IIFL Capital Sets FY26 Growth Targets with Strong Investment Banking Pipeline",
            "Summary": "IIFL Capital has announced growth targets for FY26, including a 25% return on equity and ₹2,440 billion in assets under management. The company reported a 36% increase in SIP inflows and maintains a strong investment banking pipeline. IIFL plans to leverage its synergy-focused platform across wealth management, equities, and distribution segments to achieve these targets.",
            "Sentiment": "positive",
            "PublishDate": 1753719602960,
            "Source": "stock"
        },
        {
            "Title": "IIFL Capital Services Reports 19% Revenue Growth in Q1FY26 Results",
            "Summary": "IIFL Capital Services Limited announced its consolidated financial results for the quarter ended June 30, 2025. The company reported consolidated revenue of ₹680 crores, up 19% quarter-on-quarter, with profit after tax rising 37% to ₹176 crores. Distribution Assets Under Management stood at ₹35,719 crores, up 14% quarter-on-quarter, while DP assets reached ₹2,08,352 crores, up 10% quarter-on-quarter. The investment banking division completed 13 deals across capital markets and private placements, including IPOs for HDB Financial Services, Ellenbarie Industrial Gases, Aegis Vopak, Schloss Bangalore, and Oswal Pumps. However, average daily market turnover for the broking business declined 31% year-on-year to ₹2,23,232 crores due to regulatory changes affecting derivative turnover. Managing Director R. Venkataraman highlighted good progress in transforming the retail broking business to wealth management practice, with institutional broking witnessing strong block deal transactions.",
            "Sentiment": "positive",
            "PublishDate": 1753716098419,
            "Source": "earnings"
        },
        {
            "Title": "IIFL Capital Services Reappoints Two Independent Directors and Transfers PMS Business to Subsidiary",
            "Summary": "IIFL Capital Services Limited's Board of Directors approved the re-appointment of Mr. Anand Shailesh Bathiya and Mr. Viswanathan Krishnan as Non-Executive Independent Directors for second terms of five consecutive years, effective September 22, 2025 and January 21, 2026 respectively, subject to shareholder and regulatory approvals. The company also approved transferring its Portfolio Management Services (PMS) business to wholly owned subsidiary IIFL Capital Asset Management Limited on a slump sale basis. The PMS business contributed Rs. 0.27 crores (0.01% of total turnover) to the company's consolidated turnover of Rs. 2,567.43 crores for the financial year ended March 31, 2025. The transfer is part of a strategy to align business verticals for operational efficiency and simplify regulatory structures. The consideration will equal the carrying value of net assets transferred, and the transaction requires regulatory approval.",
            "Sentiment": "neutral",
            "PublishDate": 1753713342334,
            "Source": "corporate_governance"
        },
        {
            "Title": "IIFL Capital Services Schedules Earnings Conference Call for July 29, 2025",
            "Summary": "IIFL Capital Services Limited will host an earnings conference call on July 29, 2025, at 12:00 noon to discuss the company's performance for the quarter ended June 30, 2025. Management will engage with participants during the call, and both the transcript and recording will be made available on the company's website at www.iiflcapital.com. The company has notified BSE and NSE about this scheduled earnings call.",
            "Sentiment": "neutral",
            "PublishDate": 1753368669672,
            "Source": "earnings"
        },
        {
            "Title": "IIFL Capital Services Dissolves UK Subsidiary Worth Rs 1.65 Crores",
            "Summary": "IIFL Wealth (UK) Limited, a wholly owned subsidiary of IIFL Capital Services Limited, has been dissolved through voluntary strike off effective July 22, 2025. The subsidiary had no turnover and maintained a net worth of Rs 1.65 crores as of March 31, 2025, representing 0.07% of the parent company's net worth. IIFL Capital Services received consideration of GBP 155,096.55 (approximately Rs 1.80 crores) from the dissolution process.",
            "Sentiment": "neutral",
            "PublishDate": 1753156760226,
            "Source": "corporate_action"
        },
        {
            "Title": "IIFL Capital Services Reports Q4 Results and NCD Issuance",
            "Summary": "IIFL Capital Services announced its Q4 consolidated net profit of 1.28 billion rupees, down from 1.8 billion rupees year-over-year and 1.97 billion rupees quarter-over-quarter. Q4 revenue was reported at 5.37 billion rupees, a decrease from 6.86 billion rupees in the previous year. The company also plans to issue Non-Convertible Debentures (NCDs) up to 10 billion rupees on a private placement basis.",
            "Sentiment": "neutral",
            "PublishDate": 1745885399000,
            "Source": "default"
        },
        {
            "Title": "IIFL Capital Services Reports Q4 Financial Results",
            "Summary": "IIFL Capital Services announced its Q4 financial results, showing a decrease in revenue and net profit compared to the previous year. The company reported revenue of 5.37 billion rupees, down from 6.86 billion rupees year-over-year. Net profit for Q4 was 1.28 billion rupees, lower than both the previous year (1.8 billion) and the previous quarter (1.97 billion). Additionally, the company plans to issue non-convertible debentures (NCDs) up to 10 billion rupees on a private placement basis.",
            "Sentiment": "neutral",
            "PublishDate": 1745856797000,
            "Source": "default"
        },
        {
            "Title": "IIFL Capital Services to Consider NCD Issuance",
            "Summary": "IIFL Capital Services has scheduled a board meeting on April 28 to consider the issuance of non-convertible debentures (NCDs) through private placement. The NCDs may be issued in one or more tranches on an annual basis.",
            "Sentiment": "neutral",
            "PublishDate": 1745414893000,
            "Source": "default"
        },
        {
            "Title": "IIFL Capital to Consider Q4 Results on April 28",
            "Summary": "IIFL Capital has announced that it will consider its fourth quarter (Q4) financial results on April 28. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745414058000,
            "Source": "default"
        },
        {
            "Title": "IIFL Capital Services: SEBI Issues Warning Letter for Due Diligence Lapses",
            "Summary": "SEBI issued an administrative warning letter to IIFL Capital Services regarding due diligence in debt securities. The warning pertains to disclosure of issue-related expenses and payment timelines in offer documents. IIFL states there is no material impact from this warning.",
            "Sentiment": "neutral",
            "PublishDate": 1741674265000,
            "Source": "corporate_governance"
        },
        {
            "Title": "IIFL Capital Services Subsidiary Obtains SEBI Registration as Investment Adviser",
            "Summary": "A subsidiary of IIFL Capital Services has received registration from the Securities and Exchange Board of India (SEBI) to operate as an investment adviser. This regulatory approval allows the subsidiary to provide investment advisory services in compliance with SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1739924267000,
            "Source": "corporate_action"
        },
        {
            "Title": "IIFL Capital Services Subsidiary Receives SEBI Registration as Investment Adviser",
            "Summary": "A subsidiary of IIFL Capital Services has been granted registration by the Securities and Exchange Board of India (SEBI) to operate as an investment adviser. This regulatory approval allows the subsidiary to provide investment advisory services in compliance with SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1739886765000,
            "Source": "corporate_action"
        },
        {
            "Title": "IIFL Capital Services Reports Q3 Financial Results and Declares Interim Dividend",
            "Summary": "IIFL Capital Services announced its Q3 consolidated financial results, reporting a net profit of 1.97 billion rupees, up from 1.49 billion rupees in the same quarter last year. The company's revenue increased to 5.8 billion rupees from 5.59 billion rupees year-over-year. Additionally, IIFL Capital Services declared an interim dividend of 3 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1739320418000,
            "Source": "earnings"
        },
        {
            "Title": "IIFL Capital Services Subsidiary Obtains Corporate Agent License from IRDAI",
            "Summary": "Livlong Protection & Wellness Solutions, a subsidiary of IIFL Capital Services, has been granted a Corporate Agent License by the Insurance Regulatory and Development Authority of India (IRDAI). This license allows the company to act as an intermediary in selling insurance products.",
            "Sentiment": "positive",
            "PublishDate": 1734998889000,
            "Source": "corporate_action"
        },
        {
            "Title": "IIFL Securities Reports Strong Q2 Financial Performance",
            "Summary": "IIFL Securities has announced its Q2 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit reached 2.05 billion rupees, up from 1.08 billion rupees in the same quarter last year and 1.8 billion rupees in the previous quarter. Revenue also increased to 6.45 billion rupees from 5.07 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729608733000,
            "Source": "result"
        }
    ]
}