{
    "Symbol": "IITL",
    "ISIN": "INE886A01014",
    "News": [
        {
            "Title": "Nimbus India Acquires 2.01 Lakh IITL Shares",
            "Summary": "Nimbus India Limited acquired 2,01,000 equity shares of Industrial Investment Trust Limited on February 09, 2026, increasing its shareholding to 18.52% from 17.49%.",
            "Sentiment": "neutral",
            "PublishDate": 1770786989199,
            "Source": "co_actions_results"
        },
        {
            "Title": "Industrial Investment Trust Q3FY26 Results Show Strong Recovery",
            "Summary": "Industrial Investment Trust Limited reported robust Q3FY26 performance with standalone profit after tax of ₹564.29 lakhs compared to loss of ₹531.21 lakhs in Q3FY24, driven by positive fair value changes of ₹621.32 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770213455141,
            "Source": "co_actions_results"
        },
        {
            "Title": "IITL Shareholders Approve Related Party Transaction",
            "Summary": "Industrial Investment Trust Limited shareholders approved related party transaction for subsidiary IITL Projects Limited's preference share variation through postal ballot with 99.99% votes in favour.",
            "Sentiment": "positive",
            "PublishDate": 1767948550529,
            "Source": "co_actions_results"
        },
        {
            "Title": "IITL Shareholders Approve Related Party Transaction",
            "Summary": "Industrial Investment Trust Limited shareholders approved related party transaction for subsidiary IITL Projects Limited's preference share variation through postal ballot with 99.99% votes in favor.",
            "Sentiment": "positive",
            "PublishDate": 1767948517558,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nimbus India Limited Acquires Additional 1,000 Shares in Industrial Investment Trust Limited",
            "Summary": "Nimbus India Limited purchased 1,000 equity shares of Industrial Investment Trust Limited through open market transactions on December 05, 2025. The acquisition maintains Nimbus India's holding at 34,30,732 shares (17.49% of total share capital), while the promoter group's collective stake remains at 53.90% of the company's equity.",
            "Sentiment": "neutral",
            "PublishDate": 1765191433110,
            "Source": "corporate_action"
        },
        {
            "Title": "Nimbus India Limited Acquires Additional 1.03 Lakh Shares in Industrial Investment Trust",
            "Summary": "Nimbus India Limited purchased 1,03,000 equity shares of Industrial Investment Trust Limited through open market transactions on December 4, 2025. The acquisition increased Nimbus India's shareholding from 16.97% to 17.49%, while the promoter group's total holding rose from 53.38% to 53.90% in the target company.",
            "Sentiment": "neutral",
            "PublishDate": 1765000144254,
            "Source": "corporate_action"
        },
        {
            "Title": "Nimbus India Limited Acquires Additional 1 Lakh Shares in Industrial Investment Trust Limited",
            "Summary": "Nimbus India Limited purchased 1,00,000 equity shares of Industrial Investment Trust Limited on November 26, 2025, through open market transactions. The acquisition increased the promoter group's total shareholding from 52.87% to 53.38% in the target company, with Nimbus India's individual stake rising from 16.46% to 16.97%.",
            "Sentiment": "neutral",
            "PublishDate": 1764319026298,
            "Source": "corporate_action"
        },
        {
            "Title": "Industrial Investment Trust Limited Reports Mixed Quarterly Performance with Standalone Loss",
            "Summary": "Industrial Investment Trust Limited posted a standalone net loss of ₹346.44 lakhs for the quarter ended September 30, 2025, while consolidated operations showed a profit of ₹1,032.85 lakhs for the same period. The company's standalone total income declined to ₹25.94 lakhs compared to ₹1,382.61 lakhs in the previous year quarter, though consolidated income remained relatively stable at ₹1,471.11 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1763061746435,
            "Source": "corporate_action"
        },
        {
            "Title": "Nimbus India Limited Acquires Additional 5,144 Shares in Industrial Investment Trust Limited",
            "Summary": "Nimbus India Limited purchased 5,144 equity shares of Industrial Investment Trust Limited on September 30, 2025, through open market transactions. The acquisition increased Nimbus India's shareholding from 32,21,588 shares (14.28%) to 32,26,732 shares (14.30%). The transaction was made in compliance with SEBI regulations on substantial acquisition of shares. Nimbus India Limited belongs to the promoter group of Industrial Investment Trust Limited, which is listed on both BSE and NSE. The target company has an equity share capital of 1,96,08,780 shares of Rs. 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1759488907453,
            "Source": "corporate_action"
        },
        {
            "Title": "Nimbus India Limited Acquires 20,000 Shares in Industrial Investment Trust Limited",
            "Summary": "Nimbus India Limited purchased 20,000 equity shares of Industrial Investment Trust Limited on September 19, 2025. The acquisition was made through open market transactions and disclosed under SEBI regulations. Following the purchase, Nimbus India Limited's shareholding in Industrial Investment Trust Limited increased from 31,76,588 shares (16.19%) to 31,96,588 shares (16.30%). The acquisition was made alongside persons acting in concert including N.N. Financial Services Private Limited, Mr. Bipin Agarwal, and Mr. Swarn Mohinder Singh. Industrial Investment Trust Limited's shares are listed on both BSE and NSE. The company's total equity share capital remains at 1,96,08,780 shares of Rs. 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1758518817923,
            "Source": "corporate_action"
        },
        {
            "Title": "Nimbus India Limited Acquires 25,000 Shares in Industrial Investment Trust Limited",
            "Summary": "Nimbus India Limited purchased 25,000 equity shares of Industrial Investment Trust Limited on September 17, 2025, through open market transactions. The acquisition increased Nimbus India's shareholding from 31,51,588 shares (13.98%) to 37,76,588 shares (14.08%) in the target company. Nimbus India belongs to the promoter group of Industrial Investment Trust Limited, along with persons acting in concert including N.N. Financial Services Private Limited, Bipin Agarwal, and Swarn Mohinder Singh. The combined holding of the promoter group increased from 52.48% to 52.60% following this transaction. Industrial Investment Trust Limited has an equity share capital of 1,96,08,780 shares valued at Rs. 19,60,87,800 and is listed on both BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1758268825430,
            "Source": "corporate_action"
        },
        {
            "Title": "Industrial Investment Trust Limited CFO Sagar Jaiswal Resigns to Start Chartered Accountancy Practice",
            "Summary": "Sagar Jaiswal, Group CFO and Key Managerial Personnel of Industrial Investment Trust Limited, has resigned from his position effective August 31, 2025. Jaiswal submitted his resignation letter on August 6, 2025, citing his intention to start his own Chartered Accountancy practice as the reason for leaving. The company's management has accepted his resignation. In his resignation letter, Jaiswal expressed gratitude for the learning opportunities during his tenure, particularly gaining experience in corporate accounting under Ind AS, financial statement preparation, and coordinating with auditors during statutory audits. He confirmed there are no other material reasons for his departure beyond his stated intention to pursue his long-standing aspiration of establishing his own CA practice.",
            "Sentiment": "neutral",
            "PublishDate": 1754485714359,
            "Source": "corporate_governance"
        },
        {
            "Title": "Industrial Investment Trust Limited Reports Strong Q1 Performance with Key Leadership Changes",
            "Summary": "Industrial Investment Trust Limited announced its unaudited financial results for the quarter ended June 30, 2025, showing significant improvement in performance. The company reported standalone profit after tax of ₹1,014.87 lakhs compared to ₹635.83 lakhs in the same quarter last year, with earnings per share increasing to ₹4.50 from ₹2.82. On a consolidated basis, profit after tax reached ₹1,032.89 lakhs versus ₹704.38 lakhs in the previous year. The company's total income on standalone basis was ₹1,505.78 lakhs, driven primarily by net gain on fair value changes of ₹1,081.57 lakhs and interest income of ₹423.39 lakhs. Alongside the financial results, the company announced the resignation of Group CFO Sagar Jaiswal effective August 31, 2025, who is leaving to start his own chartered accountancy practice. The board also approved the appointment of CS Payal Vyas as Secretarial Auditor for a five-year term from 2025-2026 to 2029-2030, subject to shareholder approval. The company noted concerns regarding its subsidiary IITL Projects Limited, which has accumulated losses of ₹630.80 lakhs and is no longer considered a going concern.",
            "Sentiment": "positive",
            "PublishDate": 1754483633016,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Approves Amalgamation of IITL Subsidiaries",
            "Summary": "The National Company Law Tribunal (NCLT) has approved the amalgamation of subsidiaries of Industrial Investment Trust Limited (IITL). This corporate action involves the consolidation of IITL's subsidiary companies, which is likely aimed at streamlining operations and improving efficiency within the corporate structure.",
            "Sentiment": "positive",
            "PublishDate": 1742481262000,
            "Source": "corporate_action"
        },
        {
            "Title": "IITL Projects Expands into Housing Finance Industry",
            "Summary": "Industrial Investment Trust Limited (IITL) has announced that its subsidiary, IITL Projects, is venturing into a new line of business within the housing finance industry. This strategic move is expected to generate revenue income from business operations, potentially leading to long-term growth and development for the subsidiary company.",
            "Sentiment": "positive",
            "PublishDate": 1733702898000,
            "Source": "corporate_action"
        },
        {
            "Title": "IITL Projects Expands into Housing Finance Industry",
            "Summary": "Industrial Investment Trust Limited (IITL) has announced that its subsidiary, IITL Projects, will venture into a new line of business within the housing finance industry. This strategic move is expected to generate revenue income from business operations, contributing to the long-term growth and development of the subsidiary company.",
            "Sentiment": "positive",
            "PublishDate": 1733494969000,
            "Source": "corporate_action"
        },
        {
            "Title": "Industrial Investment Trust Ltd Reports Q2 Profit Surge",
            "Summary": "Industrial Investment Trust Ltd has reported a significant increase in consolidated net profit for the second quarter. The company's net profit rose to 89 million rupees, up from 15 million rupees year-over-year and 70 million rupees quarter-over-quarter. Revenue also saw a modest increase, reaching 56 million rupees compared to 53 million rupees year-over-year and 51 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731284234000,
            "Source": "result"
        }
    ]
}