{
    "Symbol": "IKIO",
    "ISIN": "INE0LOJ01019",
    "News": [
        {
            "Title": "IKIO Technologies Files Q3 FY26 Monitoring Report",
            "Summary": "IKIO Technologies submitted its quarterly monitoring agency report for Q3 FY26, showing utilization of Rs 163.69 million during the quarter from IPO proceeds, with Rs 539.64 million remaining unutilized.",
            "Sentiment": "neutral",
            "PublishDate": 1770186666221,
            "Source": "stocks"
        },
        {
            "Title": "IKIO Technologies Reports Q3 FY26 Financial Results",
            "Summary": "IKIO Technologies announced Q3 FY26 results with consolidated revenue of ₹1,455.88 million and net profit of ₹107.64 million. Board approved leadership changes in subsidiaries.",
            "Sentiment": "positive",
            "PublishDate": 1769870721813,
            "Source": "co_actions_results"
        },
        {
            "Title": "IKIO Technologies Schedules Q3 FY26 Earnings Call",
            "Summary": "IKIO Technologies Limited announces earnings call for February 02, 2026 at 3:00 PM IST to discuss Q3 and 9MFY26 financial results under SEBI Regulation 30 compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1769242686087,
            "Source": "co_actions_results"
        },
        {
            "Title": "IKIO Technologies Acquires 88% Stake in Gravus Tech",
            "Summary": "IKIO Technologies' subsidiary IKIO Solutions acquires 88% equity stake in Gravus Tech Private Limited for ₹88,000 to strengthen marketing and distribution capabilities for LED products.",
            "Sentiment": "positive",
            "PublishDate": 1767358689784,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ikio Tech's Royalux LLC Metco Falls Short of Sales Target Due to U.S. Market Challenges",
            "Summary": "Ikio Tech's subsidiary Royalux LLC Metco achieved $1.05 million in sales, significantly below its $8 million target. The underperformance was attributed to U.S. market slowdown and tariff effects impacting business operations.",
            "Sentiment": "negative",
            "PublishDate": 1763728366607,
            "Source": "stock"
        },
        {
            "Title": "IKIO Technologies Reports Strong Q2 FY26 Growth with 31% YoY Revenue Rise to Rs. 164 Crores",
            "Summary": "IKIO Technologies achieved 31% year-on-year and 37% quarter-on-quarter revenue growth to Rs. 164 crores in Q2 FY26, driven by diversification into hearables, wearables and expansion in Middle East markets. The company's other business segment grew 71% YoY to Rs. 115 crores with strong traction in new product categories like TWS earphones and smartwatches, while EBITDA improved to Rs. 18 crores with 11.2% margin.",
            "Sentiment": "positive",
            "PublishDate": 1763122482248,
            "Source": "earnings"
        },
        {
            "Title": "IKIO Technologies Submits Monitoring Agency Report for IPO Proceeds Utilization",
            "Summary": "IKIO Technologies Limited submitted its monitoring agency report for the quarter ended September 30, 2025, prepared by CRISIL Ratings Limited. The company raised Rs 6,065 million through its IPO in June 2023, comprising fresh issuance of Rs 3,500 million (revised net proceeds of Rs 3,261.41 million) and offer for sale of Rs 2,565 million. The proceeds are allocated across three objectives: Rs 500 million for repayment of borrowings (fully utilized), Rs 2,123.12 million for investment in wholly-owned subsidiary IKIO Solutions for setting up a new facility at Noida (Rs 1,420.30 million utilized, Rs 702.82 million remaining), and Rs 638.29 million for general corporate purposes (fully utilized). The company has Rs 736.38 million in unutilized proceeds deployed in fixed deposits and bank accounts. The monitoring agency reported no deviations from disclosed objects and confirmed all required government approvals have been obtained.",
            "Sentiment": "neutral",
            "PublishDate": 1762858911842,
            "Source": "corporate_action"
        },
        {
            "Title": "IKIO Technologies Reports 31% Revenue Growth to Rs 1,642 Mn in Q2FY26",
            "Summary": "IKIO Technologies Limited reported revenue growth of 31% year-over-year to Rs 1,642 million in Q2FY26, compared to Rs 1,250 million in Q2FY25. The company's Other Business segment grew 71% year-over-year to Rs 1,152 million, driven by hearables, wearables, and strong Middle East demand led by Dubai. EBITDA increased 63% quarter-over-quarter to Rs 184 million with an 11.2% margin. Profit After Tax surged 358% quarter-over-quarter to Rs 109 million. The company has expanded globally with 23% of H1FY26 revenue coming from outside India, totaling Rs 365 million. IKIO has diversified beyond home lighting into new product categories including hearables and wearables, while expanding manufacturing capacity with a new 2 lakh sq ft facility in Noida that became operational in May 2024. The company operates across multiple segments including high-end home decorative LED lights, commercial refrigeration lighting, recreational vehicle products, and solar panels.",
            "Sentiment": "positive",
            "PublishDate": 1762756095104,
            "Source": "corporate_action"
        },
        {
            "Title": "IKIO Technologies Reports Mixed Q2 Results with Revenue Growth but Lower Margins",
            "Summary": "IKIO Technologies reported Q2 revenue of 1.6 billion rupees, up from 1.25 billion rupees year-over-year. EBITDA increased significantly to 1.85 billion rupees from 222 million rupees in the previous year. However, EBITDA margin declined to 11.27% from 17.76% year-over-year. Consolidated net profit decreased to 100 million rupees compared to 129 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1762527798128,
            "Source": "earnings"
        },
        {
            "Title": "IKIO Technologies Reports IPO Proceeds Utilization for Quarter Ended June 30, 2025",
            "Summary": "IKIO Technologies Limited submitted its monitoring agency report for the quarter ended June 30, 2025, detailing the utilization of proceeds from its Initial Public Offering. The company's IPO, conducted from June 6-8, 2023, raised Rs 6,065 million, comprising fresh issuance of Rs 3,500 million and offer for sale of Rs 2,565 million. CRISIL Ratings Limited, the monitoring agency, reported no deviations from stated objectives. Out of revised net proceeds of Rs 3,261.41 million, the company has utilized Rs 2,452.50 million across three main objectives: Rs 500 million for debt repayment (fully utilized), Rs 1,314.72 million for investment in subsidiary IKIO Solutions for setting up manufacturing facility at Noida, and Rs 637.78 million for general corporate purposes. Unutilized proceeds of Rs 808.91 million are deployed in fixed deposits with HDFC Bank earning returns between 6.15% to 7.55%, with some funds held in monitoring accounts. The company obtained all required government approvals including factory licenses and commenced commercial production at leased premises from March 20, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1754996219934,
            "Source": "stock"
        },
        {
            "Title": "IKIO Technologies Reports 7% Revenue Growth, Reduces Single Customer Dependency to 32%",
            "Summary": "IKIO Technologies Limited reported revenue of INR 120 crores in Q1 FY26, marking a 7% quarter-on-quarter growth. The company successfully reduced its dependence on single customer ODM home lighting business from 52% in Q1 FY25 to 32% in Q1 FY26. Revenue from other business segments grew 35% year-over-year to INR 81 crores, now contributing 68% of total revenue. International revenue reached INR 30 crores, contributing 25% of total revenue with 84% quarter-on-quarter growth. EBITDA stood at INR 11 crores with 83% quarter-on-quarter growth, while profit after tax improved to INR 2 crores from a loss of INR 1 crore in the previous quarter. The company has deployed around 75% of IPO proceeds, with Block 1 operational and Block 2 civil construction nearing completion. Management highlighted expansion into new markets including Gulf region exports, hearable and wearable products, and upcoming automotive segment initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1754651942359,
            "Source": "earnings"
        },
        {
            "Title": "IKIO Technologies Appoints Sanjeet Singh as CFO and Reports Quarterly Financial Results",
            "Summary": "IKIO Technologies Limited's Board approved the appointment of Mr. Sanjeet Singh as Chief Financial Officer and Key Managerial Personnel, effective August 2, 2025. Singh, who holds a Bachelor's degree in Commerce from University of Delhi with over 6 years of experience, currently serves as Whole Time Director and Chief Executive Officer. The Board also approved unaudited financial results for the quarter ended June 30, 2025. On standalone basis, the company reported revenue from operations of Rs. 386.92 million compared to Rs. 665.68 million in the corresponding quarter last year, and net profit after tax of Rs. 32.04 million versus Rs. 86.74 million in the same period previous year. On consolidated basis, revenue from operations was Rs. 386.97 million against Rs. 1,102.11 million in the corresponding quarter, with net profit of Rs. 23.77 million compared to Rs. 123.71 million last year. The company operates in LED lighting manufacturing and has subsidiaries including IKIO Solutions Private Limited and Royalux Lighting Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1754400348137,
            "Source": "corporate_action"
        },
        {
            "Title": "IKIO Technologies Reports 7% Revenue Growth in Q1FY26 Despite Decline in Single-Customer ODM Business",
            "Summary": "IKIO Technologies reported revenue of Rs 1,201 million in Q1FY26, representing a 7% quarter-on-quarter growth and 5% year-on-year decline. The company's 'Other Business' segment showed strong performance with 35% year-on-year and 10% quarter-on-quarter growth, offsetting weakness in the single-customer ODM Home Lighting business. EBITDA increased 83% quarter-on-quarter to Rs 113 million with a margin of 9.4%, while profit after tax grew 455% quarter-on-quarter to Rs 24 million. The company is strategically diversifying from its single-customer ODM model to a more diversified customer base across emerging verticals including Product Display and Energy Solutions. Revenue from outside India increased to Rs 298 million, reflecting 3% year-on-year and 84% quarter-on-quarter growth, with expansion in Gulf markets and the USA RV business. The company operates manufacturing facilities totaling approximately 5 lakh square feet across Noida and Haridwar, with Block I of its new Noida facility commencing commercial production in May 2024.",
            "Sentiment": "positive",
            "PublishDate": 1754297609674,
            "Source": "earnings"
        },
        {
            "Title": "IKIO Technologies Submits Quarterly Financial Results for Quarter Ended June 30, 2025",
            "Summary": "IKIO Technologies Limited has submitted its un-audited financial results for the quarter ended June 30, 2025, to stock exchanges. The company published extracts of both standalone and consolidated financial results in The Financial Express (English) and Jansatta (Hindi) newspapers dated August 4, 2025. The submission was made by Company Secretary & Compliance Officer Sandeep Kumar Agarwal and includes newspaper clippings as evidence of regulatory compliance with listing requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1754291022366,
            "Source": "earnings"
        },
        {
            "Title": "IKIO Technologies Grants 17,500 Stock Options and Recommends Sanjeet Singh as CFO",
            "Summary": "IKIO Technologies Limited's Nomination and Remuneration Committee approved the grant of 17,500 stock options to eligible employees under the ILL Employee Stock Option Scheme 2022. Each option is convertible into one equity share with a face value of Rs. 10 and an exercise price of Rs. 150 per option. The options can be exercised within 3 months from the date of vesting in maximum 2 tranches. The committee also recommended the appointment of Mr. Sanjeet Singh as Chief Financial Officer and Key Managerial Personnel, subject to Board approval. Singh, who holds a Bachelor's degree in Commerce from the University of Delhi and has over 6 years of experience, is currently serving as Whole-Time Director and Chief Executive Officer of the company. His CEO appointment was previously approved by NRC and Audit Committee members in May 2025, subject to shareholder approval at the upcoming AGM.",
            "Sentiment": "positive",
            "PublishDate": 1754143402154,
            "Source": "corporate_action"
        },
        {
            "Title": "IKIO Lighting Changes Name to IKIO Technologies",
            "Summary": "IKIO Lighting has officially changed its name to IKIO Technologies, effective from April 25. This corporate action represents a significant branding shift for the company, potentially indicating a broader focus or strategic realignment.",
            "Sentiment": "neutral",
            "PublishDate": 1745292614000,
            "Source": "default"
        },
        {
            "Title": "Ikio Lighting Reports Q3 FY2024 Financial Results",
            "Summary": "Ikio Lighting announced its Q3 consolidated financial results. The company reported a net profit of 78.8 million rupees, which is lower compared to 190 million rupees in the same quarter last year and 129.9 million rupees in the previous quarter. Revenue for Q3 stood at 1.22 billion rupees, showing a slight increase from 1.2 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1739146334000,
            "Source": "earnings"
        },
        {
            "Title": "IKIO Lighting Reports Decline in Q3 EBITDA and Margin",
            "Summary": "IKIO Lighting experienced a significant decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 148.6 million rupees from 263 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin contracted to 12.23% from 22.5% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738946638000,
            "Source": "earnings"
        },
        {
            "Title": "IKIO Lighting Reports Q3 Revenue of 1.22 Billion Rupees",
            "Summary": "IKIO Lighting has announced its third-quarter revenue for the current fiscal year. The company reported revenue of 1.22 billion rupees, compared to 1.2 billion rupees in the same quarter of the previous year, indicating a slight year-over-year increase.",
            "Sentiment": "neutral",
            "PublishDate": 1738946631000,
            "Source": "earnings"
        },
        {
            "Title": "IKIO Lighting Reports Q3 FY24 Financial Results",
            "Summary": "IKIO Lighting has announced its consolidated net profit for the third quarter. The company reported a net profit of 78.8 million rupees, which represents a decrease compared to both the previous year (190 million rupees) and the previous quarter (129.9 million rupees).",
            "Sentiment": "negative",
            "PublishDate": 1738946624000,
            "Source": "earnings"
        },
        {
            "Title": "Ikio Lighting Subsidiary Selected for PLI Scheme in White Goods",
            "Summary": "Ikio Lighting has announced that its subsidiary has been chosen to participate in the Production Linked Incentive (PLI) Scheme for White Goods. This selection indicates potential growth opportunities and government support for the company in the white goods sector.",
            "Sentiment": "positive",
            "PublishDate": 1738542303000,
            "Source": "corporate_action"
        },
        {
            "Title": "IKIO Lighting Subsidiary Selected for PLI Scheme in White Goods",
            "Summary": "A subsidiary of IKIO Lighting has been chosen to participate in the Production Linked Incentive (PLI) Scheme for White Goods. This selection indicates potential growth opportunities and government support for the company in the white goods sector.",
            "Sentiment": "positive",
            "PublishDate": 1738518583000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ikio Lighting Subsidiary Forms Joint Venture to Expand Business",
            "Summary": "Ikio Lighting has announced that its subsidiary has entered into a joint venture agreement. The partnership aims to accelerate business growth by leveraging AG Investments' established network and industry expertise. This strategic move is expected to provide the company with access to a broader customer base for its products in the specified territory.",
            "Sentiment": "positive",
            "PublishDate": 1736295379000,
            "Source": "corporate_action"
        },
        {
            "Title": "IKIO Lighting Subsidiary Forms Joint Venture to Expand Business",
            "Summary": "IKIO Lighting has announced that its subsidiary has entered into a joint venture agreement. The partnership aims to accelerate business growth by leveraging AG Investments' established network and industry expertise. This strategic move is expected to provide access to a broader customer base for the company's products in the specified territory.",
            "Sentiment": "positive",
            "PublishDate": 1736251511000,
            "Source": "corporate_action"
        },
        {
            "Title": "IKIO Lighting Reports Q2 EBITDA Decline",
            "Summary": "IKIO Lighting's Q2 EBITDA decreased to 222 million rupees from 267 million rupees year-over-year. The company's EBITDA margin also fell to 17.76% from 22.65% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731077869000,
            "Source": "result"
        },
        {
            "Title": "IKIO Lighting Reports Q2 Financial Results",
            "Summary": "IKIO Lighting announced its Q2 consolidated net profit of 129 million rupees, down from 182 million rupees year-over-year and 124 million rupees quarter-over-quarter. The company's Q2 revenue increased to 1.25 billion rupees from 1.18 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731077823000,
            "Source": "result"
        }
    ]
}