{
    "Symbol": "IKS",
    "ISIN": "INE115Q01022",
    "News": [
        {
            "Title": "Archies Board Meet Set for Feb 11 to Review Q3FY26 Results",
            "Summary": "Archies Limited announces board meeting on February 11, 2026 to consider Q3FY26 unaudited financial results. Multiple companies including Inventurus Knowledge Solutions and Astral Limited also published their quarterly results.",
            "Sentiment": "neutral",
            "PublishDate": 1770365005207,
            "Source": "co_actions_results"
        },
        {
            "Title": "Inventurus Q3FY26 Revenue Jumps 24% to ₹8,149.50 Million",
            "Summary": "Inventurus Knowledge Solutions reports strong Q3FY26 results with consolidated revenue of ₹8,149.50 million, up 24% YoY, and net profit of ₹1,833.28 million, marking 41% growth from previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770218234084,
            "Source": "co_actions_results"
        },
        {
            "Title": "Inventurus Grants 122,000 ESOPs to Employees",
            "Summary": "Inventurus Knowledge Solutions Limited has granted 122,000 employee stock options under its ESOP Plan 2022 at an exercise price of Rs. 1,537.10 per option to eligible employees on January 30, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769759131851,
            "Source": "co_actions_results"
        },
        {
            "Title": "Inventurus Knowledge Solutions Q3FY26 Call Feb 5",
            "Summary": "Inventurus Knowledge Solutions Limited has scheduled its Q3 FY 2025-26 earnings conference call for February 5, 2026, at 8:30 AM IST to discuss quarterly results.",
            "Sentiment": "neutral",
            "PublishDate": 1769526224298,
            "Source": "co_actions_results"
        },
        {
            "Title": "Inventurus Grants 525,000 ESOPs to Employees",
            "Summary": "Inventurus Knowledge Solutions Limited's board committee approved grant of 525,000 employee stock options under ESOP Plan 2022 on January 22, 2026, with different exercise prices and terms.",
            "Sentiment": "positive",
            "PublishDate": 1769062380845,
            "Source": "co_actions_results"
        },
        {
            "Title": "IKS Health Schedules Investor Meet for Jan 20, 2026",
            "Summary": "Inventurus Knowledge Solutions announces analyst and institutional investor meet on January 20, 2026, from 2:00 PM to 6:30 PM IST in hybrid format at Mumbai venue with online registration available.",
            "Sentiment": "neutral",
            "PublishDate": 1767783926269,
            "Source": "stocks"
        },
        {
            "Title": "Avendus Initiates Buy on Inventurus Knowledge Solutions",
            "Summary": "Avendus Securities has initiated coverage on Inventurus Knowledge Solutions with a Buy rating and target price of ₹2,020.00, indicating significant upside potential for the IT software company.",
            "Sentiment": "positive",
            "PublishDate": 1766374792171,
            "Source": "stocks"
        },
        {
            "Title": "Inventurus Knowledge Solutions Grants 470,000 Employee Stock Options Under ESOP Plan",
            "Summary": "Inventurus Knowledge Solutions' Nomination and Remuneration Committee approved the grant of 470,000 employee stock options to eligible employees under the IKS ESOP Plan 2022, with an exercise price of Rs. 1,667.50 per option. Each option converts to one equity share with face value of Re. 1, and the options can be exercised during the entire period of continuous employment from the vesting date.",
            "Sentiment": "positive",
            "PublishDate": 1764838698383,
            "Source": "corporate_action"
        },
        {
            "Title": "IKS Health Opens New 1,000-Seat Office in Coimbatore to Support US Healthcare Operations",
            "Summary": "IKS Health inaugurated a state-of-the-art 1,000-seat facility in Coimbatore designed to accommodate rapid expansion of operations for the US healthcare market and serve as a talent hub for graduates and experienced professionals. The company reported 22% year-over-year revenue growth and 60% rise in Profit After Tax for the second quarter of Fiscal Year 2026, with the expansion aimed at enhancing execution capacity for long-term objectives in the US market.",
            "Sentiment": "positive",
            "PublishDate": 1764053090065,
            "Source": "stock"
        },
        {
            "Title": "IKS Health Reports Strong Q2 Performance with 22% Revenue Growth and 35% EBITDA Margins",
            "Summary": "Inventurus Knowledge Solutions Limited (IKS Health) reported revenue of INR 781 crores for Q2 FY26, representing 22% year-on-year growth and 5.5% quarter-on-quarter growth. EBITDA reached INR 272 crores with margins of 35%, showing 43% year-on-year growth. PAT stood at INR 181 crores, reflecting 60% year-on-year growth. The company achieved these results ahead of its margin expansion timeline, driven by AI implementation across its platform and transformation of the AQuity delivery model. IKS Health secured significant new clients including AdventHealth, Revere Health, Jackson Clinic, and a leading cardiology group. The company continues to focus on its AI-native platform transformation and cross-selling initiatives within its existing customer base. Top 10 customers now comprise 45% of revenue with an average tenure of six years. Operating cash flow was INR 291 crores with free cash flow of INR 225 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762433512186,
            "Source": "earnings"
        },
        {
            "Title": "Inventurus Knowledge Solutions Reports Senior Management Personnel Change",
            "Summary": "Inventurus Knowledge Solutions Limited announced a change in Senior Management Personnel effective from close of business hours on October 30, 2025. Mr. Sameer Arora will assume a new role within the company due to changes in internal role, designation and responsibilities. Following this change, he will no longer be classified as Senior Management Personnel under the provisions of the Companies Act, 2013 and SEBI LODR Regulations. The company trades on BSE with scrip code 544309 and on NSE with symbol IKS.",
            "Sentiment": "neutral",
            "PublishDate": 1761857169929,
            "Source": "corporate_governance"
        },
        {
            "Title": "Inventurus Knowledge Solutions Projects 18-20% Revenue Growth for FY26 with AI Platform Expansion",
            "Summary": "Inventurus Knowledge Solutions has projected 18-20% revenue growth for FY26, targeting an EBITDA margin above 35% and PAT margin of 23%. The growth strategy centers on expanding its AI-native agentic workflow platform, leveraging AQuity integration synergies, and securing long-term outcome-linked contracts across its 450+ enterprise client base. The company plans to achieve net-debt-free status by FY27 while maintaining R&D spending above 5% of revenue. Management expects to deliver double-digit PAT compound annual growth rate through scalable AI-led care enablement solutions focused on US healthcare systems.",
            "Sentiment": "positive",
            "PublishDate": 1761841925813,
            "Source": "stock"
        },
        {
            "Title": "Inventurus Knowledge Solutions Reports Strong Q2 Growth with 60% Jump in Net Profit",
            "Summary": "Inventurus Knowledge Solutions delivered robust quarterly performance with consolidated net profit rising to 1.81 billion rupees from 1.13 billion rupees year-over-year. Revenue increased to 7.81 billion rupees compared to 6.43 billion rupees in the same period last year. EBITDA grew significantly to 2.71 billion rupees from 1.89 billion rupees, while EBITDA margin expanded to 34.79% from 29.42% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1761837266386,
            "Source": "earnings"
        },
        {
            "Title": "Inventurus Knowledge Solutions Reports Quarterly Financial Results for September 2025",
            "Summary": "Inventurus Knowledge Solutions Limited announced its unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. The Board of Directors approved the results at a meeting held on October 30, 2025. The company operates as a care enablement platform providing technology-enabled solutions to healthcare providers. During the quarter, the company allotted 183,140 shares to eligible employees under its Employee Stock Options Plan, and 207,082 shares for the half-year period. The company's subsidiary, Inventurus Knowledge Solutions Inc, acquired a 48.02% equity interest in IKS WWMGMSO LLC for $17 million, with the purchase closing on July 2, 2025. The financial results have been reviewed by PriceWaterhouseCharteredAccountants LLP, the company's statutory auditors.",
            "Sentiment": "neutral",
            "PublishDate": 1761837152297,
            "Source": "earnings"
        },
        {
            "Title": "Inventurus Knowledge Solutions Issues USD 77 Million Corporate Guarantee for Subsidiary's Loan Refinancing",
            "Summary": "Inventurus Knowledge Solutions Limited has issued a corporate guarantee of up to USD 77 million on behalf of its wholly-owned subsidiary, Inventurus Knowledge Solutions Inc., to JPMorgan Chase Bank N.A. The subsidiary is refinancing its existing USD 146 million term loan facility availed in FY 2023-24 with a new USD 70 million facility. This new guarantee replaces the previous corporate guarantee of USD 160.60 million that was issued in FY 2023-24 against the original term loan facility. The company states there is no immediate impact, though the guarantee constitutes a contingent liability. Promoter and group companies have no interest in this transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1760782817970,
            "Source": "corporate_action"
        },
        {
            "Title": "Inventurus Knowledge Solutions Invests $10 Million in US Subsidiary",
            "Summary": "Inventurus Knowledge Solutions Limited invested USD 10,001,605 in its wholly owned subsidiary Inventurus Knowledge Solutions Inc. The investment involves acquiring 15,550 equity shares at USD 643.19 per share for working capital purposes. The subsidiary, incorporated in Delaware in 2006, provides technology-enabled healthcare solutions to US healthcare providers. The transaction is expected to complete by October 31, 2025. The subsidiary reported revenue of INR 6,941.11 million in FY 2024-25, compared to INR 7,027.85 million in FY 2023-24 and INR 6,054.66 million in FY 2022-23.",
            "Sentiment": "neutral",
            "PublishDate": 1760619132500,
            "Source": "stock"
        },
        {
            "Title": "IKS Health Launches AI Platform on Google Cloud to Automate Healthcare Administrative Tasks",
            "Summary": "IKS Health announced the launch of a generative AI platform built on Google Cloud technologies, including the Gemini family of models. The multi-agent system is designed to handle prior authorizations, ambient documentation, charting, coding, order capture, and claim submissions. The platform can autonomously handle up to 80% of routine tasks previously done by humans, such as insurance approvals and document processing. The system incorporates human-in-the-loop technology to ensure accuracy and clinical safety. According to a Google Cloud study, clinicians spend nearly 28 hours weekly on administrative work, while staff average 34-36 hours. The platform aims to reduce administrative burdens and allow healthcare providers to focus more on patient care. IKS Health was founded in 2006 and has been recognized by Black Book as the top provider of AI-driven RCM services.",
            "Sentiment": "positive",
            "PublishDate": 1760617053562,
            "Source": "stock"
        },
        {
            "Title": "Inventurus Knowledge Solutions Passes All 11 Resolutions at Annual General Meeting",
            "Summary": "Inventurus Knowledge Solutions Limited held its 19th Annual General Meeting on September 23, 2025, through video conference. All 11 resolutions presented to shareholders were approved with requisite majority. The approved resolutions included adoption of audited financial statements for the year ended March 31, 2025, reappointment of directors Utpal Sheth and Joseph Benardello who retired by rotation, appointment of Dr. Garheng Albert Kong as Independent Director, appointment of Sachin Gupta as Non-Executive Non-Independent Director, appointment of Nithya Balasubramanian as Whole-Time Director, appointment of secretarial auditors, commission to non-executive directors, and amendments to the Employee Stock Option Plan 2022. The scrutinizer's report confirmed that 275 members participated in voting across the resolutions, with voting conducted through electronic means. The company has 171,573,159 total outstanding shares with promoter and promoter group holding 109,331,042 shares.",
            "Sentiment": "positive",
            "PublishDate": 1758734981919,
            "Source": "corporate_action"
        },
        {
            "Title": "Inventurus Knowledge Solutions Confirms No Impact from New H-1B Visa Fee Changes",
            "Summary": "Inventurus Knowledge Solutions Limited announced that the introduction of a $100,000 fee for new H-1B visa applications will not affect its business operations or financial projections. The company stated it does not depend on H-1B visa holders for its workforce. IKS operates as a care enablement platform with a business model centered on delivering solutions through proprietary technology, a skilled workforce in India, and local hiring in the United States. The company emphasized that H-1B visas are not integral to its core business operations or client service delivery, and the changes will not impact its ability to serve clients or pursue growth objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1758518809279,
            "Source": "stock"
        },
        {
            "Title": "Inventurus Knowledge Solutions Appoints New Chief Human Resources Officer",
            "Summary": "Inventurus Knowledge Solutions Limited announced changes in its senior management personnel effective September 5, 2025. Manisha Kadagathur has been appointed as Chief Human Resources Officer and will be part of the company's Senior Management Personnel. Simultaneously, Abhay Srivastava will transition to a new role as Head of Leadership Effectiveness and will no longer be classified as Senior Management Personnel. Kadagathur brings over 25 years of industry experience across consumer, financial services, technology, and chemicals sectors. She has previously served as CHRO, Consulting Leader, and Independent Board Member, and founded an HR Tech startup in the U.S. She currently serves as an Independent Director at Safex Group and holds degrees in Mathematics and Computer Science from St. Francis, Hyderabad, and an MBA from XLRI, Jamshedpur.",
            "Sentiment": "neutral",
            "PublishDate": 1757042996844,
            "Source": "corporate_governance"
        },
        {
            "Title": "IKS Health Reports Strong Q1 FY26 Results with 16% Revenue Growth and 32% EBITDA Margin",
            "Summary": "Inventurus Knowledge Solutions Limited (IKS Health) delivered solid quarterly results for Q1 FY25-26 with revenue of ₹740 crores, representing 16% year-on-year growth (13% on constant currency basis). The company achieved significant margin expansion with EBITDA at 32% (₹238 crores), marking 36% year-on-year growth in EBITDA. PAT grew 59% to ₹151 crores. The company reduced its global workforce by 7% year-on-year to 12,368 employees while maintaining growth, demonstrating operational efficiency through technology adoption. Key developments include the launch of Scribble Now (autonomous clinical documentation solution), progress on AI-driven medical coding across two specialties, and successful cross-selling to AQuity customers. The company continues strategic customer tail pruning from the AQuity acquisition, expected to complete over the next 2-3 quarters. Notable customer wins include Mission Community for acute RCM services and expansion with Bicycle Health and OrthoNY. The Western Washington Medical Group partnership progresses with IKS holding a 48% stake in the MSO. Management expects to reach early-to-mid 30s EBITDA margins as a steady state.",
            "Sentiment": "positive",
            "PublishDate": 1754492364152,
            "Source": "earnings"
        },
        {
            "Title": "Inventurus Subsidiary Aquity Solutions Fined INR 1.5 Crore for Service Export Scheme Misclassification",
            "Summary": "Aquity Solutions India Private Limited, a subsidiary of Inventurus Knowledge Solutions Limited, has been penalized INR 1.5 crore by the Interim Settlement Board-III under the Ministry of Finance. The penalty relates to misclassification of services under different CPC codes during financial years 2015-16 to 2018-19 for availing Service Exports from India Scheme benefits before the Directorate General of Foreign Trade, Mumbai. Aquity India became a step-down subsidiary of Inventurus after the parent company's subsidiary acquired Aquity Holdings Inc in October 2023. The company states there is no impact on its financial, operational or other activities due to this order, and the matter now stands closed.",
            "Sentiment": "negative",
            "PublishDate": 1754142389337,
            "Source": "stock"
        },
        {
            "Title": "Inventurus Knowledge Solutions Maintains EBITDA Margin Target in Early to Mid-30% Range",
            "Summary": "Inventurus Knowledge Solutions announced during a conference call that the company is maintaining its EBITDA margin target between the early to mid-30% range.",
            "Sentiment": "neutral",
            "PublishDate": 1754121944544,
            "Source": "stock"
        },
        {
            "Title": "Inventurus Knowledge Solutions Reports Strong Q1 Results, Announces Major Board Restructuring",
            "Summary": "Inventurus Knowledge Solutions reported consolidated revenue of INR 7,400.95 million for the quarter ended June 30, 2025, up from INR 6,400.93 million in the same period last year. Consolidated profit after tax increased to INR 1,515.39 million from INR 954.87 million year-over-year. The company announced significant board changes effective August 1, 2025: Sachin Gupta resigned as Whole-time Director due to personal reasons and will be appointed as Additional Director (Non-Executive, Non-Independent), while being designated as Global CEO of the US subsidiary. CFO Nithya Balasubramanian has been appointed as Additional Director (Whole-time Director) for a five-year term. Garheng Albert Kong was appointed as Additional Director (Non-Executive, Independent) for five years. The company also reappointed KKC & Associates LLP as Internal Auditor for financial year 2025-26. All director appointments are subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1753979842393,
            "Source": "corporate_governance"
        },
        {
            "Title": "Inventurus Knowledge Solutions Reports 59% Jump in Quarterly Net Profit",
            "Summary": "Inventurus Knowledge Solutions reported consolidated net profit of 1.52 billion rupees in Q1, compared to 955 million rupees in the same period last year, marking a 59% year-on-year increase. The company's revenue grew to 7.4 billion rupees from 6.4 billion rupees year-on-year, representing a 16% growth.",
            "Sentiment": "positive",
            "PublishDate": 1753979433711,
            "Source": "earnings"
        },
        {
            "Title": "Inventurus Knowledge Solutions Schedules Q1 FY 25-26 Earnings Conference Call",
            "Summary": "Inventurus Knowledge Solutions Limited has announced an earnings conference call to discuss Q1 FY 25-26 results scheduled for Friday, August 1, 2025, at 8:30 AM IST. The company provided dial-in numbers for universal access and international toll-free numbers for USA, UK, Singapore, and Hong Kong participants. The announcement was made through a disclosure to BSE Limited and National Stock Exchange of India Limited, with the company trading under NSE symbol IKS and BSE scrip code 544309.",
            "Sentiment": "neutral",
            "PublishDate": 1753709276420,
            "Source": "earnings"
        },
        {
            "Title": "Inventurus Knowledge Solutions Invests $17 Million in U.S. Healthcare MSO",
            "Summary": "Inventurus Knowledge Solutions is investing $17 million (145 Crore Rupees) to acquire a 48.02% stake in a new U.S. healthcare Managed Service Organization (MSO). This investment represents a significant move by the company into the U.S. healthcare market.",
            "Sentiment": "positive",
            "PublishDate": 1751336865000,
            "Source": "default"
        },
        {
            "Title": "IKS Health: Block Deal Worth ₹400+ Crore Expected",
            "Summary": "Inventurus Knowledge Solutions Ltd. (IKS Health) is likely to see a block deal of 1.5% of its outstanding equity on June 19. The floor price is set at ₹1,650 per share, a 2.6% discount to the previous close. Multiple individual investors are expected to be sellers. This comes a day after the end of a six-month lock-in period for shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1750295455000,
            "Source": "block_deals"
        },
        {
            "Title": "Inventurus Knowledge Solutions Ltd: Q4 Revenue Soars 17%, EBITDA Up 68%",
            "Summary": "IKS Health reported strong Q4 FY25 results with revenue up 17% YoY in INR, EBITDA at ₹226.2 crore (+68% YoY), and PAT at ₹147.8 crore (+133% YoY). FY25 revenue reached ₹2,664 crore (+47% YoY). The company secured five major client wins in Q4, including three platform deals.",
            "Sentiment": "positive",
            "PublishDate": 1747393011000,
            "Source": "earnings"
        },
        {
            "Title": "Inventurus Knowledge Solutions Reports Q4 Financial Results",
            "Summary": "Inventurus Knowledge Solutions has reported its Q4 consolidated net profit at 1.48 billion rupees, compared to 635.7 million rupees year-over-year and 1.3 billion rupees quarter-over-quarter. The company's Q4 revenue stands at 7.24 billion rupees, up from 6.2 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747354092000,
            "Source": "default"
        },
        {
            "Title": "Inventurus Knowledge Solutions Reports Strong Q4 Financial Results",
            "Summary": "Inventurus Knowledge Solutions has announced its Q4 financial results. The company's EBITDA increased to 2.26 billion rupees from 1.26 billion rupees year-over-year. The EBITDA margin improved to 31.24% from 20.29% in the same period. Revenue grew to 7.24 billion rupees from 6.2 billion rupees year-over-year. The consolidated net profit for Q4 rose to 1.48 billion rupees, up from 635.7 million rupees year-over-year and 1.3 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747325764000,
            "Source": "result"
        },
        {
            "Title": "IKS Health Partners with GI Alliance for AI Deployment",
            "Summary": "Inventurus Knowledge Solutions (IKS Health) has announced a partnership with GI Alliance to implement AI technology specifically for gastroenterology specialties. This collaboration aims to enhance the use of artificial intelligence in gastrointestinal healthcare services.",
            "Sentiment": "positive",
            "PublishDate": 1746629097000,
            "Source": "default"
        },
        {
            "Title": "Inventurus Knowledge Solutions Invests $14.5M in Subsidiary",
            "Summary": "Inventurus Knowledge Solutions has made a significant investment of $14.5 million in its wholly owned subsidiary, IKS Inc.",
            "Sentiment": "positive",
            "PublishDate": 1745333931000,
            "Source": "default"
        },
        {
            "Title": "Inventurus Knowledge Solutions Ltd: Analysts Cautious Despite Sharp Stock Decline",
            "Summary": "Jefferies and JPMorgan initiated coverage on IKS Health with 'neutral' ratings. Jefferies sees 8% upside with a target of ₹1,575, while JPMorgan's ₹1,300 target suggests further downside. Concerns include high valuations and complications from the AQuity acquisition. The stock fell 12% as the shareholder lock-in period ended, freeing up 2% of outstanding equity.",
            "Sentiment": "negative",
            "PublishDate": 1742265637000,
            "Source": "normal_news"
        },
        {
            "Title": "Inventurus Knowledge Solutions: Stock Plummets Post Lock-in Expiry",
            "Summary": "Inventurus Knowledge Solutions Ltd., backed by the Jhunjhunwala family, saw its stock fall 10% to ₹1,497 on March 17, hitting a post-listing low of ₹1,440. This decline followed the end of a three-month shareholder lock-in period, making 42 lakh shares (2% of equity) eligible for trading. Despite the drop, the stock remains 24% above its IPO price of ₹1,331.",
            "Sentiment": "negative",
            "PublishDate": 1742189049000,
            "Source": "corporate_action"
        },
        {
            "Title": "Inventurus Knowledge Solutions: Stock Dips 5% Despite Strong Q3 Results",
            "Summary": "Inventurus Knowledge Solutions shares fell 4.6% to Rs 1,673 on BSE amid broader market weakness, despite reporting a 16% YoY revenue increase to Rs 657.2 crore and 28% YoY PAT growth to Rs 129.7 crore in Q3 FY2025. EBITDA rose 24% YoY with margins exceeding 30% for the first time.",
            "Sentiment": "neutral",
            "PublishDate": 1738827132000,
            "Source": "earnings"
        },
        {
            "Title": "Inventurus Knowledge Solutions: Norges Bank Acquires 34 Lakh Shares in Block Deal",
            "Summary": "Norges Bank purchased over 34 lakh shares of Inventurus Knowledge Solutions (IKS) worth Rs 652 crore in two tranches on the company's stock market debut. IKS shares listed at Rs 1,900, a 43% premium over the issue price, and closed at Rs 2,030, up 6.84% from the listing price.",
            "Sentiment": "positive",
            "PublishDate": 1734618841000,
            "Source": "block_deals"
        },
        {
            "Title": "Inventurus Knowledge Solutions: Shares List at 43% Premium on NSE",
            "Summary": "Inventurus Knowledge Solutions shares debuted on NSE at ₹1,900, a 43% premium over the IPO price of ₹1,329. The IPO, which closed with 52.68 times oversubscription, raised ₹2,497.92 crore. The company specializes in administrative and technological support services for healthcare enterprises.",
            "Sentiment": "positive",
            "PublishDate": 1734582560000,
            "Source": "normal_news"
        },
        {
            "Title": "Inventurus Knowledge Solutions: Strong Market Debut with 43% Premium",
            "Summary": "Inventurus Knowledge Solutions Ltd. shares listed on NSE at Rs 1,900, a 42.96% premium over the issue price of Rs 1,329. On BSE, it listed at Rs 1,856, a 39.65% premium. The IPO, which closed on Dec. 16, was oversubscribed 52.68 times, with strong demand from qualified institutional buyers. The company raised Rs 1,120 crore from anchor investors before the IPO opened.",
            "Sentiment": "positive",
            "PublishDate": 1734582102000,
            "Source": "result"
        }
    ]
}