{
    "Symbol": "IL&FSENGG",
    "ISIN": "INE369I01014",
    "News": [
        {
            "Title": "IL&FS Engineering Reports ₹2,727.72 Cr Default",
            "Summary": "IL&FS Engineering and Construction Company disclosed defaults of ₹2,727.72 crores on bank loans as of December 31, 2025, with total financial indebtedness at ₹3,097.28 crores.",
            "Sentiment": "negative",
            "PublishDate": 1767606699708,
            "Source": "stocks"
        },
        {
            "Title": "IL&FS Engineering Reports Rs 1,119 Crore Loss for Six Months Ended September 2025",
            "Summary": "IL&FS Engineering and Construction Company Limited reported a net loss of Rs 1,119 crore for the six months ended September 30, 2025, compared to Rs 1,377 crore loss in the same period last year. The company continues to face severe financial distress with fully eroded net worth, ongoing resolution proceedings under NCLAT framework, and material uncertainty about its ability to continue as a going concern.",
            "Sentiment": "negative",
            "PublishDate": 1765178986883,
            "Source": "earnings"
        },
        {
            "Title": "IL&FS Engineering Seeks Shareholder Approval for Re-appointment of Two Independent Directors",
            "Summary": "IL&FS Engineering and Construction Company Limited is conducting a postal ballot through remote e-voting from December 6, 2025 to January 5, 2026 for re-appointing Mr. Subrata Kumar Atindra Mitra and Dr. Jagadip Narayan Singh as Independent Directors for a second five-year term from January 15, 2026 to January 14, 2031. The re-appointments require special resolution approval from shareholders as both directors' current terms expire on January 14, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1764673678128,
            "Source": "corporate_governance"
        },
        {
            "Title": "IL&FS Engineering Opens New Branch Office in Dubai",
            "Summary": "IL&FS Engineering and Construction Company Limited has opened a new branch office in Dubai MainLand, UAE to explore business opportunities in Middle East countries. The company informed stock exchanges BSE and NSE about this expansion as part of its regulatory disclosure requirements.",
            "Sentiment": "positive",
            "PublishDate": 1763481940490,
            "Source": "stock"
        },
        {
            "Title": "IL&FS Engineering Reports Quarterly Loss Amid Ongoing Resolution Process",
            "Summary": "IL&FS Engineering and Construction Company Limited reported unaudited financial results for the quarter and half year ended September 30, 2025, with accumulated losses of Rs. 3,61,156 Lakhs and fully eroded net worth. The company continues operating under NCLAT's resolution framework with a successful bid approved by the Committee of Creditors awaiting final approvals from Justice D.K. Jain and NCLT.",
            "Sentiment": "negative",
            "PublishDate": 1763227588360,
            "Source": "earnings"
        },
        {
            "Title": "IL&FS Engineering Re-appoints Two Independent Directors for Second Term",
            "Summary": "IL&FS Engineering and Construction Company's Board approved the re-appointment of Dr. Jagadip Narayan Singh and Mr. Subrata Kumar Atindra Mitra as Independent Directors for a second five-year term from January 15, 2026 to January 14, 2031. The re-appointments are based on Nomination and Remuneration Committee recommendations and are subject to shareholder approval at the General Meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1763121466770,
            "Source": "corporate_governance"
        },
        {
            "Title": "IL&FS Engineering Reports 51.8% Revenue Decline and Widened Losses in Q1 Results",
            "Summary": "IL&FS Engineering and Construction Company Limited reported quarterly results showing revenue declined 51.8% to Rs 41.22 crore from Rs 85.52 crore in the same period last year. The company posted an EBITDA loss of Rs 7.71 crore compared to EBITDA of Rs 0.21 crore previously, while net loss widened to Rs 9.42 crore from Rs 3.06 crore loss last year. The company faces continued operational challenges with existing projects nearing completion and contract cancellations due to adverse developments in the promoter group. Net worth remains fully eroded and current liabilities exceed current assets by Rs 3,829.36 crore. The company is categorized under 'Red' entities by IL&FS board, indicating inability to meet obligations. A bid from an unincorporated consortium has been received and approved by the Committee of Creditors as part of the ongoing resolution process. Material uncertainty exists regarding the company's going concern status, with its future dependent on successful implementation of the resolution plan.",
            "Sentiment": "negative",
            "PublishDate": 1754911851579,
            "Source": "earnings"
        },
        {
            "Title": "IL&FS Engineering Loses Bhubaneswar Metro Sub-Contract After DMRC Terminates Main Project",
            "Summary": "IL&FS Engineering and Construction Company's sub-contract work for the Bhubaneswar Metro Project has been terminated following the cancellation of the main contract by Delhi Metro Rail Corporation Limited (DMRC). The company had a back-to-back sub-contracting arrangement with Ceigall India Limited for part design and construction of elevated viaduct and six elevated stations including Nandan Vihar, Raghunathpur, Nandankanan Zoological Park, Barang Station, Phulapokhari, and Trisulia Square. Since the arrangement was on a back-to-back basis, the termination of the main contract by DMRC automatically ended IL&FS Engineering's sub-contract with Ceigall India. The company is taking steps to claim damages and compensation including costs related to demobilization of plant, machinery, and manpower resources through available legal courses of action as per the sub-contract terms.",
            "Sentiment": "negative",
            "PublishDate": 1753551933203,
            "Source": "stock"
        },
        {
            "Title": "IL&FS Engineering: Howen International Fund's ₹350 Crore Bid Approved",
            "Summary": "Howen International Fund SPC's ₹350 crore offer to acquire a 42.25% stake in IL&FS Engineering & Construction has been approved by 82% of the committee of creditors. The deal could lead to up to 80% recovery of the company's ₹2,000 crore external debt.",
            "Sentiment": "positive",
            "PublishDate": 1745455533000,
            "Source": "corporate_action"
        },
        {
            "Title": "IL&FS Engineering: Committee of Creditors Approves Revised Financial Bid for Stake Acquisition",
            "Summary": "The Committee of Creditors (CoC) has approved a revised financial bid by Howen International Fund for the acquisition of a 42.25% stake in IL&FS Engineering. This decision marks a significant development in the company's financial restructuring process.",
            "Sentiment": "positive",
            "PublishDate": 1745291969000,
            "Source": "default"
        },
        {
            "Title": "IL&FS Engineering Defaults on 26.28 Billion Rupee Loan",
            "Summary": "IL&FS Engineering has defaulted on a loan payment of 26.28 billion rupees. This significant default indicates serious financial difficulties for the company and may have implications for its creditors and shareholders.",
            "Sentiment": "negative",
            "PublishDate": 1744037502000,
            "Source": "corporate_governance"
        },
        {
            "Title": "IL&FS Engineering Receives Show Cause Notice from Indian Overseas Bank",
            "Summary": "IL&FS Engineering has received a show cause notice from Indian Overseas Bank to review the classification of the company's loan account as a suspicious fraud account. The facilities involved amount to 1.23 billion rupees, although the lender has not quantified the specific irregularities.",
            "Sentiment": "negative",
            "PublishDate": 1742901825000,
            "Source": "corporate_governance"
        },
        {
            "Title": "IL&FS Engineering Secures 302 Crore Rupee Order",
            "Summary": "IL&FS Engineering has won a new order worth 302 crore rupees. This significant contract represents a positive development for the company's business operations and financial outlook.",
            "Sentiment": "positive",
            "PublishDate": 1735524079000,
            "Source": "order&deals"
        }
    ]
}