{
    "Symbol": "IL&FSTRANS",
    "ISIN": "INE975G01012",
    "News": [
        {
            "Title": "IL&FS Transportation Gets ₹1.77 Cr GST Demand Notice",
            "Summary": "IL&FS Transportation Networks received GST demand notice of ₹1.77 crores from Deputy Commissioner of State Tax for outstanding liability related to FY 2021-22. Company reviewing notice.",
            "Sentiment": "negative",
            "PublishDate": 1767160580270,
            "Source": "stocks"
        },
        {
            "Title": "IL&FS Transportation Gets ₹25.06 Cr GST Demand Notice",
            "Summary": "IL&FS Transportation Networks received a GST demand notice of ₹25.06 crores from Haryana tax authorities for alleged non-compliance related to FY2018-19. Company reviewing the notice.",
            "Sentiment": "negative",
            "PublishDate": 1766570862642,
            "Source": "stocks"
        },
        {
            "Title": "ILFS Completes Rs 6,145 Crore Sale of Chenani Nashri Tunnel to Cube Highways",
            "Summary": "ILFS Group completed the transfer of shares of its subsidiary Chenani Nashri Tunnel Limited (CNTL) to Cube Highways Infrastructure for Rs 6,145 crore, including settlement of Rs 5,454 crore debt to a consortium of banks. The transaction brings ILFS Group's total debt discharge to over Rs 48,000 crore as part of its resolution framework, with lenders receiving 98-124% recovery depending on their seniority and exposure.",
            "Sentiment": "neutral",
            "PublishDate": 1763637218476,
            "Source": "corporate_action"
        },
        {
            "Title": "IL&FS Transportation Networks Seeks Buyers for Roadstar Infra",
            "Summary": "IL&FS Transportation Networks is seeking interest for the sale of Roadstar Infra.",
            "Sentiment": "neutral",
            "PublishDate": 1762953637351,
            "Source": "order&deals"
        },
        {
            "Title": "IL&FS Transportation Networks Appoints Vini Mahajan as Nominee Director",
            "Summary": "IL&FS Transportation Networks Limited appointed Ms. Vini Mahajan as a Nominee Director on its Board of Directors, effective September 10, 2025. The appointment follows a nomination from the holding company, Infrastructure Leasing and Financial Services Limited (IL&FS). Ms. Mahajan is a retired Indian Administrative Service officer from the 1987 batch, Punjab cadre, who served until October 2024. Her last position was Secretary in the Ministry of Jal Shakti, Department of Drinking Water and Sanitation, where she oversaw the Jal Jeevan Mission and Swachh Bharat Mission programs. She previously served as Chief Secretary of Punjab, becoming the first woman to hold this position in the state's history. Ms. Mahajan also worked as Director and Joint Secretary to the Prime Minister of India from 2005 to 2012, handling financial and infrastructure sector matters. She holds an MBA from IIM Calcutta and a B.A. in Economics from Lady Shri Ram College, Delhi University.",
            "Sentiment": "neutral",
            "PublishDate": 1757488392572,
            "Source": "corporate_governance"
        },
        {
            "Title": "IL&FS Transportation Networks: Creditors Approve ₹1,269 Crore Debt Restructuring for Subsidiary",
            "Summary": "Creditors of Barwa Adda Expressway (BAEL), a subsidiary of IL&FS Transportation Networks Ltd (ITNL), have agreed to restructure ₹1,269 crore debt. The plan includes classifying ₹369 crore as unsustainable debt, to be repaid by 2032. BAEL has already paid ₹193 crore from toll collections. The restructuring aims to complete repayment by fiscal year 2032.",
            "Sentiment": "positive",
            "PublishDate": 1733425174000,
            "Source": "corporate_action"
        },
        {
            "Title": "IL&FS Transportation Networks to Sell Barwa Adda Expressway Unit",
            "Summary": "<p><span class=\"neutral\">IL&FS Transportation Networks</span> has announced the <span class=\"positive\">sale</span> of its subsidiary, <b>Barwa Adda Expressway</b>. The company will <span class=\"positive\">receive</span> a consideration of <span class=\"positive\">5.46 billion rupees</span> for this transaction.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728653048000,
            "Source": "corporate_action"
        }
    ]
}