{
    "Symbol": "IMAGICAA",
    "ISIN": "INE172N01012",
    "News": [
        {
            "Title": "Imagicaaworld Q3FY26 Monitoring Report Filed",
            "Summary": "Imagicaaworld Entertainment submits monitoring agency report for Q3FY26, showing INR 215.74 crores utilized from preferential issue proceeds with no deviations from stated objects.",
            "Sentiment": "neutral",
            "PublishDate": 1770303789104,
            "Source": "stocks"
        },
        {
            "Title": "Imagicaaworld Entertainment Reports Q3 Loss",
            "Summary": "Imagicaaworld Entertainment swings to consolidated net loss of ₹52 million in Q3 from ₹32 million profit in same quarter previous year, marking significant year-on-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1770282788362,
            "Source": "co_actions_results"
        },
        {
            "Title": "Imagicaaworld Eyes Gujarat JV with Shanku's Water Park",
            "Summary": "Imagicaaworld Entertainment enters non-binding discussions for potential joint venture with Keshav Holiday Resort Private Limited in Gujarat, with 180-day exclusivity period for negotiations.",
            "Sentiment": "positive",
            "PublishDate": 1768920998209,
            "Source": "co_actions_results"
        },
        {
            "Title": "Imagicaaworld Entertainment Plans Expansion With New Parks in Indore and Ahmedabad",
            "Summary": "Imagicaaworld Entertainment operates 8 parks with 2 more under development. The company is expanding into Indore and Ahmedabad with over 20 rides each. Consolidation across Shirdi, Khopoli, and Lonavala locations is expected to double EBITDA. The company's growth strategy focuses on regional penetration, ancillary revenue generation, and partnerships with Malpani Group to enhance profitability.",
            "Sentiment": "positive",
            "PublishDate": 1762527777525,
            "Source": "stock"
        },
        {
            "Title": "Imagicaaworld Partners with HelloPark to Launch India's First Digital-Physical Playground Experience",
            "Summary": "Imagicaaworld Entertainment Limited announced a partnership with HelloPark, the world's largest chain of immersive digital-physical playground parks for children, to bring HelloPark to India through its wholly owned subsidiary Imagicaa Next Private Limited. The collaboration grants exclusive rights to launch HelloPark in India, marking the company's entry into the Family Entertainment Centre category. The asset-light, in-city format will be rolled out in malls and high footfall locations across the country. HelloPark operates across 50 locations globally and combines interactive projections, gaming, creativity, movement, and learning in intelligent, digital-enabled activity zones. The partnership includes HelloPark providing global-standard software, hardware specifications, training, and operational support including regular upgrades, while Imagicaa Next will roll out multiple HelloPark locations across feasible, high-footfall locations in India.",
            "Sentiment": "positive",
            "PublishDate": 1762421894304,
            "Source": "stock"
        },
        {
            "Title": "Imagicaaworld Entertainment Reports No Deviation in Preferential Issue Fund Utilization",
            "Summary": "Imagicaaworld Entertainment Limited submitted its monitoring agency report for the quarter ended September 30, 2025, regarding the utilization of proceeds from its preferential issue. The company raised INR 215.75 crores through the issuance of 2,34,82,500 equity shares and an equal number of convertible warrants at INR 73.50 each. India Ratings Research Private Limited, the monitoring agency, reported no deviation from the stated objects of the issue. The funds were allocated for three main purposes: repayment of loans by Malpani Parks Indore Private Limited (INR 140 crores), part payment for operational parks acquired from Giriraj Enterprises (INR 100 crores), and repayment of intercorporate loans for equity share purchases (INR 55 crores). As of September 30, 2025, INR 215.74 crores had been utilized, with INR 0.02 crores remaining unutilized and held in bank accounts. Two objects were completed within the stipulated one-month timeline, while the part payment for operational parks remains ongoing within the 18-month completion period.",
            "Sentiment": "neutral",
            "PublishDate": 1762419733824,
            "Source": "stock"
        },
        {
            "Title": "Imagicaaworld Entertainment Reports Widened Q2 Net Loss Despite Revenue Growth",
            "Summary": "Imagicaaworld Entertainment reported a net loss of 300 million rupees in Q2, significantly higher than the 66 million rupees loss in the same period last year. The company's EBITDA loss also increased to 62 million rupees from 38 million rupees year-over-year. However, revenue showed growth, rising to 410 million rupees compared to 399.7 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762415825655,
            "Source": "earnings"
        },
        {
            "Title": "Imagicaaworld Entertainment Acquires Company for ₹75 Crore to Build India's Largest Waterpark Near Ahmedabad",
            "Summary": "Imagicaaworld Entertainment Limited's Board of Directors approved the acquisition of 100% equity in Malpani Parks Ahmedabad Private Limited for ₹75 crore, subject to shareholder approval. The acquisition will be executed through share purchase and fund infusion towards liabilities, making MPAPL a wholly owned subsidiary. The deal provides access to 34 acres of prime non-agricultural land with clear title and highway connectivity near Ahmedabad for developing India's largest waterpark. This marks IEL's third project in Gujarat, following Aqua Imagicaa Water Park in Surat and the Sabarmati Riverfront project near Atal Bridge in Ahmedabad. The new waterpark will feature world-class rides, slides, and attractions built to international standards. Director Jai Malpani stated the project reinforces their geographical growth strategy and strengthens their position as India's most trusted entertainment brand, aiming to increase dominance in Western India.",
            "Sentiment": "positive",
            "PublishDate": 1756116752381,
            "Source": "order&deals"
        },
        {
            "Title": "Imagicaaworld Entertainment to Acquire Water Park Developer for Rs 50 Crore",
            "Summary": "Imagicaaworld Entertainment Limited's board approved the acquisition of 100% equity shares in Malpani Parks Ahmedabad Private Limited for Rs 50 crore cash consideration. The target company, incorporated in July 2021, has not commenced commercial operations and recorded minimal turnover of Rs 19,786 in other income for the financial year ended March 31, 2025. MPAPL intends to develop a water park/entertainment park. The acquisition is a related party transaction as the seller, Malpani Parks Private Limited, is a promoter of Imagicaaworld. The company will also infuse up to Rs 30 crore as loans to MPAPL, bringing total transaction value to Rs 75 crore. The deal aims to accelerate geographical expansion in Gujarat through strategic land parcels for water park development. The transaction requires shareholder approval and is expected to complete by March 31, 2026. Post-acquisition, MPAPL will become a wholly owned subsidiary of Imagicaaworld Entertainment.",
            "Sentiment": "positive",
            "PublishDate": 1755878724869,
            "Source": "order&deals"
        },
        {
            "Title": "Imagicaaworld Entertainment Reports Q1FY26 Results with 19.5% Revenue Decline",
            "Summary": "Imagicaaworld Entertainment Limited submitted its quarterly investor presentation showing mixed operational performance. Revenue declined 19.5% to Rs 148.1 crores compared to Rs 184.0 crores in the same quarter last year. EBITDA fell 34.1% to Rs 72.6 crores with margins compressing to 49.0% from 59.9%. Footfalls decreased marginally by 0.3% to 9.5 lakhs while ARPU remained stable at Rs 1,360. The company launched Aqua Imagicaa Water Park in Indore in March 2025, spread across 18 acres with 20+ water rides. The company operates 8 parks across 5 locations in western India with 150+ rides and attractions, serving a combined footfall of 28 lakhs annually. Management outlined expansion plans including a new entertainment hub at Sabarmati Riverfront in Ahmedabad under PPP mode, with ground-breaking expected in the second half of 2025.",
            "Sentiment": "negative",
            "PublishDate": 1754926003826,
            "Source": "earnings"
        },
        {
            "Title": "ImagicaaWorld Entertainment Reports 22% Drop in Visitor Numbers Due to Heavy Rain",
            "Summary": "ImagicaaWorld Entertainment experienced a 22% decrease in visitor numbers during the first quarter, which the company attributes to heavy rainfall conditions affecting attendance at its entertainment facilities.",
            "Sentiment": "negative",
            "PublishDate": 1754665756668,
            "Source": "stock"
        },
        {
            "Title": "Imagicaaworld Entertainment Reports Strong Q1 FY26 Results with Net Profit Rising to Rs 43.21 Crore",
            "Summary": "Imagicaaworld Entertainment Limited reported quarterly results for the period ended June 30, 2025. On a consolidated basis, the company achieved revenue from operations of Rs 148.10 crore compared to Rs 183.98 crore in the same quarter last year. Net profit increased significantly to Rs 44.31 crore from Rs 65.84 crore in the previous year quarter. On standalone basis, revenue from operations was Rs 137.30 crore versus Rs 180.63 crore last year, with net profit at Rs 43.22 crore compared to Rs 66.13 crore previously. The company's Parks Division generated revenue of Rs 131.04 crore while Hotel Division contributed Rs 17.06 crore. Basic earnings per share stood at Rs 0.78 on consolidated basis and Rs 0.76 on standalone basis. The company incorporated a new wholly owned subsidiary, Imagicaa Next Private Limited, during the quarter. Exceptional items of Rs 99.31 lakhs included costs related to a proposed QIP that the company does not plan to pursue in the immediate future.",
            "Sentiment": "positive",
            "PublishDate": 1754662459491,
            "Source": "earnings"
        },
        {
            "Title": "Imagicaaworld Entertainment Reports Decline in Q1 Financial Performance",
            "Summary": "Imagicaaworld Entertainment reported quarterly results showing a decline across key financial metrics. Net profit dropped to 432 million rupees from 661 million rupees in the same period last year. Revenue fell to 1.37 billion rupees compared to 1.8 billion rupees year-over-year. EBITDA decreased to 661 million rupees from 1.08 billion rupees, while EBITDA margin contracted to 48.12% from 60.28% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754660607832,
            "Source": "earnings"
        },
        {
            "Title": "Imagicaaworld Entertainment: Secures ₹275 Crore Loan for Theme Park Acquisition",
            "Summary": "Imagicaaworld Entertainment Ltd has signed a ₹275 crore loan agreement with HDFC Bank to finance the acquisition of Wet'n Joy theme parks in Lonavala and Shirdi. The loan includes significant lender rights and is secured by various charges on the company's assets and personal guarantees from directors.",
            "Sentiment": "positive",
            "PublishDate": 1749129627000,
            "Source": "corporate_action"
        },
        {
            "Title": "IMAGICAAWORLD Entertainment Secures ₹2.75 Billion Facility Agreement with HDFC Bank",
            "Summary": "IMAGICAAWORLD Entertainment has finalized a deal with HDFC Bank, executing a facility agreement worth ₹2.75 billion. The agreement is intended for the purchase of the company's park business.",
            "Sentiment": "positive",
            "PublishDate": 1749125661000,
            "Source": "default"
        },
        {
            "Title": "Imagicaaworld Entertainment: Record FY25 Results with 52% Revenue Growth",
            "Summary": "Imagicaaworld Entertainment reported strong FY25 results with revenue up 52% to ₹410 crore, EBITDA up 67% to ₹176 crore, and PBT up 152% to ₹86 crore. Footfall doubled to 2.7 million visitors. Q4 saw 66% revenue growth and 131% EBITDA increase. The company expanded operations, launched new attractions, and raised ₹345 crore for future initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1748588180000,
            "Source": "earnings"
        },
        {
            "Title": "Imagicaaworld Entertainment Reports Q4 Profit and Revenue Growth",
            "Summary": "Imagicaaworld Entertainment has reported its Q4 financial results. The company's net profit increased to 150 million rupees, compared to 48 million rupees year-over-year and 32 million rupees quarter-over-quarter. Revenue for Q4 rose to 942 million rupees from 566 million rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748477272000,
            "Source": "default"
        },
        {
            "Title": "Imagicaaworld Entertainment Reports Strong Q4 Financial Results",
            "Summary": "Imagicaaworld Entertainment has reported significant year-over-year improvements in its Q4 financial results. The company's EBITDA increased to 398 million rupees from 172 million rupees in the same quarter last year. The EBITDA margin improved to 42.28% from 30.44% year-over-year. Net profit rose to 150 million rupees, up from 48 million rupees in the previous year and 32 million rupees in the previous quarter. Revenue for Q4 reached 942 million rupees, compared to 566 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1748448341000,
            "Source": "result"
        },
        {
            "Title": "Imagicaaworld Entertainment Expects 15% Revenue Increase from Expansion",
            "Summary": "Imagicaaworld Entertainment anticipates a 15% increase in revenue in Q1 due to a recent expansion. This growth projection suggests positive developments for the company's operations and financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1744095387000,
            "Source": "corporate_action"
        },
        {
            "Title": "Wet'n Joy Lonavala Expands with 10 New Water Rides",
            "Summary": "Imagicaaworld Entertainment's Wet'n Joy water park in Lonavala has introduced 10 new thrilling and family-friendly water rides as part of its summer campaign 'Feel the Chill, Live the Thrill.' This expansion brings the total number of attractions at the park to 31, significantly enhancing the guest experience.",
            "Sentiment": "positive",
            "PublishDate": 1744095097000,
            "Source": "corporate_action"
        },
        {
            "Title": "Imagicaaworld Entertainment Expands Aqua Imagicaa Brand to Indore",
            "Summary": "Imagicaaworld Entertainment has announced a strategic expansion of its Aqua Imagicaa brand with plans to open a new water park in Indore, Madhya Pradesh. This move represents a significant step in the company's growth strategy and marks its entry into a new geographical market.",
            "Sentiment": "positive",
            "PublishDate": 1742786375000,
            "Source": "corporate_action"
        },
        {
            "Title": "Imagicaaworld Entertainment to Acquire Malpani Parks Indore",
            "Summary": "Imagicaaworld Entertainment has entered into an agreement to acquire 100% ownership of Malpani Parks Indore. The acquisition is expected to be completed on or before March 31.",
            "Sentiment": "positive",
            "PublishDate": 1739892062000,
            "Source": "corporate_action"
        },
        {
            "Title": "Imagicaaworld Entertainment Ltd: Board Approves ₹345 Crore Fundraise for Expansion",
            "Summary": "Imagicaaworld Entertainment's board has approved raising ₹345 crore through a preferential issue of equity and warrants at ₹73.50 per share. Funds will be used to acquire a water park in Indore, an operational solar power plant, and for maintenance of Wet'n Joy parks. The company reported a profit before tax of ₹4.15 crore in Q3 FY25, with revenue growth of 31% sequentially.",
            "Sentiment": "positive",
            "PublishDate": 1739441606000,
            "Source": "corporate_action"
        },
        {
            "Title": "Imagicaaworld Entertainment: Fundraising Approval and Q3FY25 Results",
            "Summary": "Imagicaaworld Entertainment approved a ₹345.19 crore fundraise through preferential issue, including equity shares and convertible warrants at ₹73.50 per unit. DMart promoter Gopi Kishan Damani allotted 17 lakh shares. Q3FY25 results show net profit decline to ₹3.2 crore, but total income increased 27% YoY to ₹93.2 crore. Stock closed 8.43% higher at ₹74.07.",
            "Sentiment": "positive",
            "PublishDate": 1739357800000,
            "Source": "corporate_action"
        },
        {
            "Title": "Imagicaaworld Entertainment Allots 17 Lakh Shares to Gopi Kishan Damani",
            "Summary": "Imagicaaworld Entertainment has allocated 17 lakh shares to investor Gopi Kishan Damani. This share allotment represents a significant corporate action that could potentially impact the company's ownership structure and stock performance.",
            "Sentiment": "neutral",
            "PublishDate": 1739353456000,
            "Source": "corporate_action"
        },
        {
            "Title": "Imagicaaworld Entertainment Reports Q3 EBITDA Growth",
            "Summary": "Imagicaaworld Entertainment has reported its Q3 financial results. The company's EBITDA increased to 296 million rupees, up from 277 million rupees in the same quarter last year. However, the EBITDA margin decreased to 32.24% from 39.51% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739353326000,
            "Source": "earnings"
        },
        {
            "Title": "Imagicaaworld Entertainment Reports Q3 Financial Results",
            "Summary": "Imagicaaworld Entertainment has announced its financial results for the third quarter. The company reported a net profit of 32 million rupees, down from 44 million rupees in the same quarter last year. However, revenue increased to 919 million rupees from 676 million rupees year-over-year, showing significant top-line growth despite the decline in profits.",
            "Sentiment": "neutral",
            "PublishDate": 1739353144000,
            "Source": "earnings"
        },
        {
            "Title": "Imagicaworld Entertainment to Consider Q3 Results",
            "Summary": "Imagicaworld Entertainment has announced that it will consider its third quarter (Q3) financial results on February 12. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter, which is a standard practice for publicly traded companies.",
            "Sentiment": "neutral",
            "PublishDate": 1738763273000,
            "Source": "earnings"
        },
        {
            "Title": "Imagicaaworld: Indoor Trampoline Park Launch Expands Theme Park Offerings",
            "Summary": "Imagicaaworld Entertainment Limited unveils a 10,000-square-foot indoor neon trampoline park, Imagicaa Arena, at its Khopoli theme park complex. Set to open on November 10, 2024, the facility features over 15 activities. The expansion aims to strengthen Imagicaa's position as a year-round entertainment destination.",
            "Sentiment": "positive",
            "PublishDate": 1731058884000,
            "Source": "normal_news"
        },
        {
            "Title": "Imagicaaworld Entertainment Launches Trampoline Park",
            "Summary": "Imagicaaworld Entertainment has introduced a new attraction called 'Imagicaa Arena Trampoline Park', aiming to enhance its entertainment offerings. This launch represents the company's efforts to expand and diversify its entertainment portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1731052419000,
            "Source": "corporate_action"
        },
        {
            "Title": "Imagicaaworld Entertainment Reports Reduced Q2 Loss",
            "Summary": "Imagicaaworld Entertainment has reported a significant reduction in its Q2 net loss, which decreased to 66 million rupees from 574 million rupees in the same quarter last year. The company's revenue also saw an improvement, increasing to 399.7 million rupees from 355 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730986400000,
            "Source": "result"
        }
    ]
}