{
    "Symbol": "IMFA",
    "ISIN": "INE919H01018",
    "News": [
        {
            "Title": "IMFA Seeks Shareholder Approval for New Independent Director",
            "Summary": "Indian Metals & Ferro Alloys Limited issues postal ballot notice for appointment of Ms Kiran Dhingra as Independent Director. E-voting period runs from February 11 to March 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770705507996,
            "Source": "stocks"
        },
        {
            "Title": "IMFA Q3 Net Profit Surges 40.4% to ₹1.31 Billion",
            "Summary": "Indian Metals & Ferro Alloys reports consolidated net profit of ₹1.31 billion in Q3, marking significant growth from ₹933 million in the previous year period.",
            "Sentiment": "positive",
            "PublishDate": 1770280407817,
            "Source": "co_actions_results"
        },
        {
            "Title": "IMFA shares plunge 12% on South Africa supply concerns",
            "Summary": "Indian Metals & Ferro Alloys shares fell 12% on Tuesday amid concerns over potential restart of South African ferrochrome smelters and domestic price decline from ₹1.20 lakh to ₹1.05 lakh per tonne.",
            "Sentiment": "negative",
            "PublishDate": 1767687827714,
            "Source": "stocks"
        },
        {
            "Title": "IMFA Pays ₹23 Lakh Compounding Fee to MCA",
            "Summary": "Indian Metals & Ferro Alloys Limited settles regulatory compliance matter with Ministry of Corporate Affairs by paying compounding fee for disclosure violations in FY 2018-19 and FY 2019-20.",
            "Sentiment": "neutral",
            "PublishDate": 1766822103255,
            "Source": "stocks"
        },
        {
            "Title": "Indian Metals & Ferro Alloys Gets Credit Rating Upgrade from ICRA",
            "Summary": "ICRA Limited upgraded Indian Metals & Ferro Alloys' long-term credit rating from ICRA [AA-] (Stable) to ICRA [AA] (Stable) and reaffirmed the short-term rating at ICRA [A1+]. The outlook on the long-term rating remains stable, indicating improved creditworthiness for the ferro alloys company.",
            "Sentiment": "positive",
            "PublishDate": 1764763916061,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Metals & Ferro Alloys Acquires 26% Stake in JSW Renew Energy Twelve Limited",
            "Summary": "JSW Renew Energy Twelve Limited allotted 1,28,07,000 equity shares worth Rs 12,80,70,000 to Indian Metals & Ferro Alloys Limited as the first tranche of their share subscription agreement. Following this allotment, Indian Metals & Ferro Alloys now holds a 26% shareholding in JSW Renew Energy Twelve Limited.",
            "Sentiment": "positive",
            "PublishDate": 1763732317650,
            "Source": "order&deals"
        },
        {
            "Title": "IMFA Acquires Tata Steel's Ferrochrome Plant for Rs 610 Crores, Eyes 500K Ton Capacity",
            "Summary": "Indian Metals & Ferro Alloys Limited signed a definitive agreement to acquire Tata Steel's 99 MVA ferrochrome plant at Kalinganagar for Rs 610 crores, comprising four furnaces with 150,000 ton capacity. The acquisition will make IMFA India's largest ferrochrome producer with over 500,000 ton capacity by FY28, funded entirely through internal accruals with completion expected within three months.",
            "Sentiment": "positive",
            "PublishDate": 1763114754513,
            "Source": "earnings"
        },
        {
            "Title": "Indian Metals & Ferro Alloys Acquires Tata Steel's Ferro Alloys Plant for Rs 610 Crores, Declares 50% Interim Dividend",
            "Summary": "Indian Metals & Ferro Alloys Limited (IMFA) approved an Asset Transfer Agreement with Tata Steel Limited to acquire their Ferro Alloys plant located at Kalinganagar, Odisha for a base purchase consideration of Rs 610 crores plus applicable GST and net working capital value. The acquisition is subject to regulatory approvals and expected to complete within 3-6 months. The Board also approved quarterly results for the quarter and half year ended September 30, 2025, and declared an interim dividend of Rs 5.09 per equity share (50% on face value of Rs 10) with record date of November 11, 2025. The company reported the acquisition aligns with its strategy to drive growth in ferro alloys business by expanding capacity, leveraging locational advantages and cost synergies due to proximity to captive mines and upcoming greenfield project in Kalinganagar.",
            "Sentiment": "positive",
            "PublishDate": 1762248169571,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Metals & Ferro Alloys Reports Q2 Revenue Growth, Acquires Tata Steel Plant for ₹610 Crores",
            "Summary": "Indian Metals & Ferro Alloys reported Q2 revenue of ₹7.2 billion compared to ₹6.9 billion in the previous year. The company's board approved an asset transfer agreement with Tata Steel to acquire a ferro alloys plant in Kalinganagar for ₹610 crores. However, Q2 EBITDA declined to ₹1.4 billion from ₹1.7 billion year-over-year, with EBITDA margin dropping to 19.19% from 24.63%.",
            "Sentiment": "neutral",
            "PublishDate": 1762244402667,
            "Source": "earnings"
        },
        {
            "Title": "Indian Metals & Ferro Alloys Reports 22% Decline in Q2 Consolidated Net Profit",
            "Summary": "Indian Metals & Ferro Alloys reported a consolidated net profit of 975 million rupees for Q2, compared to 1.25 billion rupees in the same quarter of the previous year, representing a year-on-year decline of approximately 22%.",
            "Sentiment": "negative",
            "PublishDate": 1762244018544,
            "Source": "earnings"
        },
        {
            "Title": "Indian Metals & Ferro Alloys Limited Schedules Board Meeting for Financial Results and Interim Dividend",
            "Summary": "Indian Metals & Ferro Alloys Limited will hold a board meeting on November 4, 2025, to consider unaudited financial results for the quarter and half-year ended September 30, 2025, and potential interim dividend declaration. If interim dividend is declared, the record date will be November 11, 2025. The company has closed its trading window from October 1, 2025, until November 6, 2025, for directors, key managerial persons, designated persons, and connected persons as per insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1761858777292,
            "Source": "corporate_action"
        },
        {
            "Title": "IMFA Plans Debt-Free Expansion With Rs 850-900 Crore Investment",
            "Summary": "Indian Metals & Ferro Alloys (IMFA) will fund its expansion plans without raising debt, according to Managing Director Shubhrakant Panda. The company aims to maintain a debt-equity ratio below 0.5, leveraging its zero long-term debt position and strong cash generation. IMFA is constructing a 100,000-tonne-per-annum ferrochrome unit in Kalinganagar, Odisha, requiring Rs 850-900 crore investment. The first furnace is expected to be commissioned by June 2026, increasing total capacity from 260,000 tonnes to 360,000 tonnes annually. The company is also expanding chrome ore mining capacity from 6 lakh tonnes to 9 lakh tonnes initially, with plans to reach 12 lakh tonnes in a second phase. IMFA has received in-principle approval from Odisha government for an additional 200,000-tonne capacity expansion in the second phase. Shares closed 1.02% higher at Rs 1,174 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1758720304750,
            "Source": "stock"
        },
        {
            "Title": "Indian Metals & Ferro Alloys Signs 70 MW Renewable Energy Deal with JSW Renew Energy",
            "Summary": "Indian Metals & Ferro Alloys has terminated its previous power agreements and entered into a new 70 MW renewable energy Power Purchase Agreement (PPA) with JSW Renew Energy Twelve Ltd. The company has also signed a shareholders agreement with JSW Renew Energy Twelve Ltd as part of this arrangement.",
            "Sentiment": "positive",
            "PublishDate": 1757512228552,
            "Source": "order&deals"
        },
        {
            "Title": "IMFA Reports Sequential Revenue and Margin Improvement in Q1 FY26 Earnings Call",
            "Summary": "Indian Metals & Ferro Alloys Limited (IMFA) held its quarterly earnings call discussing results for the quarter ended June 30, 2025. The company reported sequential improvement in revenue and margins, primarily driven by ferrochrome price recovery and cost optimization initiatives. Key operational highlights include ferrochrome production of 65,929 metric tons and chrome ore production of 1,03,780 metric tons. The EBITDA cost remained stable at approximately Rs. 77,500 per ton. Power costs increased to Rs. 5.27 per unit from Rs. 4.97 in the previous year. Chrome ore raising was significantly lower at 1,04,000 tons compared to 2,20,000 tons in Q4 FY25, attributed to early monsoon arrival and existing inventory levels. The company's greenfield ferrochrome expansion project at Kalinganagar remains on track with the first furnace expected in June 2026 and second furnace in September 2026. IMFA maintains a debt-free balance sheet and continues underground mining expansion at Sukinda. The company has started producing niche products like low-silicon, low-phosphorus ferrochrome, representing 5-6% of total capacity. Management indicated focus on domestic market expansion, potentially shifting the current 90% export ratio as new capacity comes online.",
            "Sentiment": "positive",
            "PublishDate": 1754460303905,
            "Source": "earnings"
        },
        {
            "Title": "IMFA Reports Strong Q1 Results; Chairman Nalini Ranjan Mohanty Retires, Dr Barada Kanta Mishra Appointed as New Chairman",
            "Summary": "Indian Metals and Ferro Alloys Limited (IMFA) reported robust quarterly results for the quarter ended June 30, 2025. Revenue from operations increased to ₹641.54 crore compared to ₹567.15 crore in the previous quarter and ₹662.28 crore in the same quarter last year. Net profit surged to ₹91.48 crore from ₹47.07 crore in the previous quarter and ₹112.16 crore in the corresponding quarter of the previous year. Earnings per share stood at ₹16.96. The company's ferro alloys segment generated revenue of ₹640.82 crore with segment results of ₹118.31 crore. In leadership changes, Nalini Ranjan Mohanty retired from his position as Non-Executive Chairman and Director upon completion of his term at the Annual General Meeting held on July 30, 2025. The board appointed Dr Barada Kanta Mishra, an Independent Director, as the new Non-Executive Chairman effective July 31, 2025. The company also reconstituted its Stakeholders Relationship Committee with Bijoy Kumar Das as Chairperson, along with Bijayananda Mahapatra and Stefan Georg Amrein as members.",
            "Sentiment": "positive",
            "PublishDate": 1753864415976,
            "Source": "earnings"
        },
        {
            "Title": "IMFA Ltd Reports Strong Q1 Performance with Leadership Changes",
            "Summary": "IMFA Ltd announced the retirement of Nalini Ranjan Mohanty from his position as Non-Executive Chairman and Director, effective from the conclusion of the Annual General Meeting on July 30, 2025. Dr Barada Kanta Mishra, Independent Director, was appointed as the new Non-Executive Chairman effective July 31, 2025. The company reported quarterly results showing revenue from operations of ₹641.54 crore compared to ₹662.28 crore in the same quarter last year. Net profit for the quarter was ₹91.48 crore versus ₹112.16 crore in the previous year quarter. The company's ferro alloys segment generated revenue of ₹640.82 crore with segment results of ₹118.31 crore. Basic earnings per share stood at ₹16.96 for the quarter. The Board also reconstituted the Stakeholders Relationship Committee with new members effective July 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753863917213,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Metals & Ferro Alloys Reports Decline in Q1 Revenue and Net Profit",
            "Summary": "Indian Metals & Ferro Alloys reported Q1 revenue of 6.4 billion rupees, down from 6.6 billion rupees in the same period last year. The company's consolidated net profit fell to 924 million rupees compared to 1.1 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1753862995477,
            "Source": "earnings"
        },
        {
            "Title": "Indian Metals & Ferro Alloys Creates Aviation Subsidiary Metallix Aviation",
            "Summary": "Indian Metals & Ferro Alloys has formed a new subsidiary called Metallix Aviation Pvt. Ltd. as part of its expansion strategy into the aviation sector.",
            "Sentiment": "positive",
            "PublishDate": 1753281494721,
            "Source": "stock"
        },
        {
            "Title": "Indian Metals & Ferro Alloys Incorporates Aviation Subsidiary Metallix Aviation",
            "Summary": "Indian Metals & Ferro Alloys Limited has incorporated a wholly owned subsidiary named Metallix Aviation Private Limited for aviation business ventures. The subsidiary was incorporated on July 23, 2025, in Odisha with Corporate Identification Number U511000D2025PTC049963. The company has an authorized share capital of Rs. 10 crores divided into 1 crore equity shares of Rs. 10 each. Indian Metals & Ferro Alloys will initially subscribe to 50 lakh equity shares at face value of Rs. 10 each, totaling Rs. 5 crores in cash consideration, giving it 100% ownership of the aviation subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1753280628529,
            "Source": "corporate_action"
        },
        {
            "Title": "IMFA Schedules Earnings Conference Call for Q1 FY2025-26 Results on July 31, 2025",
            "Summary": "Indian Metals & Ferro Alloys Limited (IMFA) has scheduled an earnings conference call to discuss Q1 FY2025-26 financial results on Thursday, July 31, 2025 at 4:00 PM IST. The call will feature key management participants including Whole-time Director & COO Bijayananda Mohapatra, CFO Saunak Gupta, and heads of various business units including Power, Mines, Ferro Alloys, and Sales & Marketing. The company has provided dial-in numbers for domestic and international participants. IMFA is India's leading fully integrated producer of value added ferro chrome with installed furnace capacity of 190 MVA capable of producing 284,000 tonnes per annum, captive power generation of 204.5 MW, and chrome ore mines in Sukinda & Mahagiri.",
            "Sentiment": "neutral",
            "PublishDate": 1753179655401,
            "Source": "earnings"
        },
        {
            "Title": "IMFA Secures 70 Million Rupees for Utkal 'C' Coal Mines",
            "Summary": "Indian Metals & Ferro Alloys Limited (IMFA) has secured funding of 70 million rupees for its Utkal 'C' coal mines project. The news indicates a significant financial development for the company's mining operations.",
            "Sentiment": "positive",
            "PublishDate": 1752842704000,
            "Source": "default"
        },
        {
            "Title": "Indian Metals & Ferro Alloys Completes Merger with Utkal Coal Ltd",
            "Summary": "Indian Metals & Ferro Alloys has completed the amalgamation with Utkal Coal Ltd. As a result of the merger, the authorized share capital of the merged entity has increased from 63.5 crore rupees to 88.5 crore rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1748362288000,
            "Source": "default"
        },
        {
            "Title": "Indian Metals & Ferro Alloys Ltd: Q4 Profit Rises 34% Despite Revenue Dip",
            "Summary": "IMFA reported a 34% YoY increase in Q4 FY25 net profit to ₹47.3 crore, despite a 19% revenue decline to ₹567.2 crore. EBITDA fell 32.3% to ₹71 crore. The company's Kalinganagar expansion project is on track, with operations expected to begin in Q2 FY27. An ethanol project is set for commissioning in Q4 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1747816974000,
            "Source": "earnings"
        },
        {
            "Title": "Indian Metals & Ferro Alloys Reports Q4 Financial Results",
            "Summary": "Indian Metals & Ferro Alloys has released its Q4 financial results. The company's EBITDA for Q4 was 699 million rupees, down from 1.04 billion rupees year-over-year. The EBITDA margin decreased to 12.32% from 14.94% in the same period last year. Revenue for Q4 was 5.7 billion rupees, compared to 7.01 billion rupees in the previous year. Despite the decrease in revenue and EBITDA, the company's consolidated net profit increased to 473 million rupees from 353 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747813337000,
            "Source": "result"
        },
        {
            "Title": "Indian Metals and Ferro Alloys Receives Approval for Merger with Utkal Coal",
            "Summary": "Indian Metals and Ferro Alloys has announced that the Ministry of Corporate Affairs has approved the amalgamation scheme for the merger of Utkal Coal into the company. This corporate action represents a significant development in the company's structure and operations.",
            "Sentiment": "positive",
            "PublishDate": 1741174631000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Metals and Ferro Alloys Signs Agreement for Renewable Power Supply",
            "Summary": "Indian Metals and Ferro Alloys has entered into a binding term sheet with Ampin Energy Utility for the supply of approximately 40 MW of renewable power. The acquisition cost for this agreement is reported to be 616 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1740489278000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Metals & Ferro Alloys: Ferrochrome Price Improvement Expected Q1 2024",
            "Summary": "Indian Metals & Ferro Alloys (IMFA) anticipates an improvement in ferrochrome prices by the first quarter of next year.",
            "Sentiment": "positive",
            "PublishDate": 1738235704000,
            "Source": "normal_news"
        },
        {
            "Title": "Indian Metals & Ferro Alloys Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Indian Metals & Ferro Alloys has reported its Q3 financial results. The company's EBITDA decreased to 1.27 billion rupees from 1.58 billion rupees in the same quarter last year. Additionally, the EBITDA margin declined to 19.75% from 23.13% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738140048000,
            "Source": "earnings"
        },
        {
            "Title": "Indian Metals & Ferro Alloys Reports Q3 Revenue Decline",
            "Summary": "Indian Metals & Ferro Alloys has reported a decrease in its third-quarter revenue. The company's revenue for Q3 stood at 6.4 billion rupees, down from 6.9 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1738139984000,
            "Source": "earnings"
        },
        {
            "Title": "Indian Metals & Ferro Alloys Reports Decline in Q3 Net Profit",
            "Summary": "Indian Metals & Ferro Alloys has reported a consolidated net profit of 933 million rupees for the third quarter, down from 1.09 billion rupees in the same period last year. This represents a year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1738139948000,
            "Source": "earnings"
        },
        {
            "Title": "Indian Metals & Ferro Alloys to Consider Q3 Results on January 29",
            "Summary": "Indian Metals & Ferro Alloys Limited has announced that it will consider its financial results for the third quarter on January 29. This indicates that the company is preparing to disclose its performance for the most recent fiscal quarter to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1737547883000,
            "Source": "earnings"
        },
        {
            "Title": "Indian Metals and Ferro Alloys Signs Power Purchase Agreement for Renewable Energy",
            "Summary": "Indian Metals and Ferro Alloys has entered into a power purchase agreement with JSW Green Energy One and JSW Green Energy Seven. The agreement is for the supply of 70 MW of hybrid renewable power, which includes a combination of wind and solar energy sources. This move signifies the company's commitment to sustainable energy practices and potentially reducing its carbon footprint.",
            "Sentiment": "positive",
            "PublishDate": 1737537099000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Metals & Ferro Alloys: Dolly Khanna Acquires Stake, Shares Rally",
            "Summary": "Investor Dolly Khanna acquired a 1.16% stake (623,464 shares) in Indian Metals & Ferro Alloys during Q3. The company's stock surged nearly 5% following this news. FIIs increased their stake to 4.03%, while DIIs slightly reduced theirs to 0.82%.",
            "Sentiment": "positive",
            "PublishDate": 1736136957000,
            "Source": "normal_news"
        },
        {
            "Title": "Dolly Khanna Acquires 1.16% Stake in Indian Metals & Ferro Alloys",
            "Summary": "Renowned investor Dolly Khanna has emerged as a shareholder in Indian Metals & Ferro Alloys, holding a 1.16% stake as per the company's Q3 shareholding pattern. This development indicates a new investment by Khanna in the metals and ferro alloys sector.",
            "Sentiment": "positive",
            "PublishDate": 1736122110000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indian Metals & Ferro Alloys: Dolly Khanna Acquires 1.16% Stake",
            "Summary": "Ace investor Dolly Khanna has purchased a 1.16% stake (6,23,464 shares) in Indian Metals & Ferro Alloys (IMFA) during Q4 2024. IMFA's stock has surged nearly 80% in the past year, outperforming the Nifty's 12% return.",
            "Sentiment": "positive",
            "PublishDate": 1735915026000,
            "Source": "block_deals"
        },
        {
            "Title": "Dolly Khanna Acquires 1.16% Stake in Indian Metals & Ferro Alloys",
            "Summary": "According to the Q3 shareholding pattern, renowned investor Dolly Khanna has acquired a 1.16% stake in Indian Metals & Ferro Alloys Limited (IMFA). This new investment by a prominent market player has been revealed in the company's latest quarterly shareholding disclosure.",
            "Sentiment": "positive",
            "PublishDate": 1735904699000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indian Metals & Ferro Alloys Unit Receives Compensation for Mine Infrastructure",
            "Summary": "A unit of Indian Metals & Ferro Alloys has received compensation of 8.63 crore rupees for mine infrastructure. This compensation appears to be related to the company's mining operations, though specific details about the reason for the compensation or the infrastructure involved are not provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1735182941000,
            "Source": "corporate_action"
        },
        {
            "Title": "IMFA to Acquire 26% Stake in JSW Green Energy Subsidiaries",
            "Summary": "Indian Metals & Ferro Alloys (IMFA) has signed a binding term sheet to acquire a 26% stake in JSW Green Energy One and Seven for Rs 83.26 crore. This strategic investment aims to secure a 70 MW hybrid renewable power supply by June 2026, demonstrating IMFA's commitment to sustainable energy sources.",
            "Sentiment": "positive",
            "PublishDate": 1734427294000,
            "Source": "corporate_action"
        },
        {
            "Title": "IMFA Declares Interim Dividend of ₹10 Per Share",
            "Summary": "Indian Metals & Ferro Alloys (IMFA) has announced an interim dividend of ₹10 per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1730979943000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Metals & Ferro Alloys Reports Improved Q2 Financial Performance",
            "Summary": "Indian Metals & Ferro Alloys has announced its Q2 financial results, showing an increase in EBITDA to 1.7 billion rupees, up from 1.5 billion rupees in the same quarter last year. The company's EBITDA margin also improved, rising to 24.63% from 21.69% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730979933000,
            "Source": "result"
        },
        {
            "Title": "Indian Metals & Ferro Alloys Reports Stable Q2 Revenue",
            "Summary": "Indian Metals & Ferro Alloys has reported its second quarter revenue for the current fiscal year. The company's revenue remained steady at 6.9 billion rupees, matching the figure from the same quarter in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1730979924000,
            "Source": "result"
        },
        {
            "Title": "Indian Metals & Ferro Alloys Reports Q2 Profit Increase",
            "Summary": "Indian Metals & Ferro Alloys has announced its Q2 consolidated net profit of 1.25 billion rupees, showing an increase from 892 million rupees year-over-year and 1.13 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730979913000,
            "Source": "result"
        },
        {
            "Title": "Indian Metals and Ferro Receives Compensation for Utkal 'C' Coal Mines",
            "Summary": "<p>The <span class='neutral'>government</span> has determined the <span class='positive'>compensation</span> for <b>mine infrastructure</b> related to <span class='neutral'>Utkal 'C' Coal Mines</span> for <span class='neutral'>Indian Metals and Ferro</span>. The <span class='neutral'>valuation</span> of the compensation has been set at <span class='positive'>86.3 million rupees</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728991412000,
            "Source": "corporate_action"
        }
    ]
}