{
    "Symbol": "IMPAL",
    "ISIN": "INE547E01014",
    "News": [
        {
            "Title": "IMPAL Board Meet on Jan 22 for Q3FY26 Results",
            "Summary": "India Motor Parts & Accessories Limited has scheduled a board meeting on January 22, 2026, to consider Q3FY26 unaudited financial results and potential interim dividend for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1768807914524,
            "Source": "co_actions_results"
        },
        {
            "Title": "India Motor Parts & Accessories Reports Quarterly Financial Results",
            "Summary": "India Motor Parts & Accessories Limited disclosed its unaudited standalone financial results for the quarter and half year ended September 30, 2025. The company reported net revenue from operations of Rs 198.71 crores for the quarter, compared to Rs 196.69 crores in the previous quarter and Rs 190.40 crores in the same quarter last year. For the half year period, revenue reached Rs 395.40 crores versus Rs 388.29 crores in the corresponding period last year. The company operates solely in the sale and distribution of automotive spares segment. The Board of Directors approved these results at a meeting held on October 28, 2025, with the financial statements prepared in accordance with Indian Accounting Standards. The results were reviewed by the company's Audit Committee and statutory auditors Brahmayya & Co., Chartered Accountants.",
            "Sentiment": "neutral",
            "PublishDate": 1761654386025,
            "Source": "earnings"
        },
        {
            "Title": "India Motor Parts & Accessories Limited Appoints Ms. Swetha R as Company Secretary & Compliance Officer",
            "Summary": "India Motor Parts & Accessories Limited announced that Ms. Swetha R has joined the company as Company Secretary & Compliance Officer effective September 11, 2025. The appointment was communicated to stock exchanges including NSE and BSE by Managing Director Mukund S Raghavan.",
            "Sentiment": "neutral",
            "PublishDate": 1757591108460,
            "Source": "corporate_governance"
        },
        {
            "Title": "India Motor Parts & Accessories Reports Q1 Results; Company Secretary Resigns",
            "Summary": "India Motor Parts & Accessories Limited reported unaudited financial results for the quarter ended June 30, 2025. The company posted revenue from operations of Rs 196.69 crores compared to Rs 197.89 crores in the same quarter last year. Total income stood at Rs 208.66 crores versus Rs 208.33 crores in the previous year quarter. Profit after tax was Rs 20.41 crores compared to Rs 20.84 crores in the corresponding quarter. Earnings per share was Rs 16.35 versus Rs 16.70 in the same quarter last year. The company operates in the sale and distribution of automotive spares segment. The Board accepted the resignation of Aditya Sharma as Company Secretary and Compliance Officer, effective August 5, 2025, citing career opportunities outside the organization with no material reasons for resignation. Ms. R Swetha has been appointed as the new Company Secretary and Compliance Officer, with her appointment effective from her joining date, which will be no later than September 15, 2025. Ms. Swetha is 34 years old with B.Com and ACS qualifications and 10 years of experience.",
            "Sentiment": "neutral",
            "PublishDate": 1753955820746,
            "Source": "corporate_action"
        },
        {
            "Title": "India Motor Parts & Accessories Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "India Motor Parts & Accessories reported quarterly net profit of 204 million rupees, down from 205 million rupees in the same period last year. Revenue increased to 1.97 billion rupees from 1.9 billion rupees year-over-year. EBITDA declined to 140 million rupees from 147 million rupees, while EBITDA margin compressed to 7.15% from 7.44% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753864434038,
            "Source": "earnings"
        },
        {
            "Title": "India Motor Parts Reports Q3 EBITDA Growth",
            "Summary": "India Motor Parts has announced its Q3 financial results, showing improvement in both EBITDA and EBITDA margin. The company's EBITDA increased to 170 million rupees from 130 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 7.95% from 7.15% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738050957000,
            "Source": "earnings"
        },
        {
            "Title": "India Motor Parts Reports Q3 Revenue Increase",
            "Summary": "India Motor Parts has reported a revenue of 2.12 billion rupees for the third quarter, compared to 1.86 billion rupees in the same period last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738050869000,
            "Source": "earnings"
        },
        {
            "Title": "India Motor Parts Reports Q3 Net Profit Increase",
            "Summary": "India Motor Parts has reported a net profit of 163 million rupees for the third quarter, compared to 152 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738050821000,
            "Source": "earnings"
        }
    ]
}