{
    "Symbol": "IMPEXFERRO",
    "ISIN": "INE691G01015",
    "News": [
        {
            "Title": "Impex Ferro Tech Q2FY26 Loss Widens to ₹181.41 Cr",
            "Summary": "Impex Ferro Tech reported a net loss of ₹181.41 lakhs for Q2FY26, with operations suspended since October 2022. The company remains under CIRP with total admitted claims of ₹1,30,663.17 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1765451517475,
            "Source": "co_actions_results"
        },
        {
            "Title": "Impex Ferro Tech Limited Reschedules 22nd Committee of Creditors Meeting During Insolvency Process",
            "Summary": "Impex Ferro Tech Limited has rescheduled its Twenty Second Meeting of the Committee of Creditors (CoC) to December 9, 2025 at 15:00 Hrs IST in hybrid mode at A.K. Sarawagi Co., Poddar Court, Kolkata. The company is currently undergoing Corporate Insolvency Resolution Process (CIRP) with Ashok Kumar Sarawagi serving as the Resolution Professional.",
            "Sentiment": "neutral",
            "PublishDate": 1765175898423,
            "Source": "corporate_action"
        },
        {
            "Title": "Impex Ferro Tech Limited Schedules 22nd Committee of Creditors Meeting Under Insolvency Process",
            "Summary": "Impex Ferro Tech Limited, currently undergoing Corporate Insolvency Resolution Process (CIRP), has scheduled its 22nd Committee of Creditors (CoC) meeting for December 5, 2025 at 12:00 hrs IST in hybrid mode. The meeting will be held at A.K. Sarawagi Co., Poddar Court, Kolkata, as part of the ongoing insolvency proceedings managed by Resolution Professional Ashok Kumar Sarawagi.",
            "Sentiment": "neutral",
            "PublishDate": 1764758525296,
            "Source": "corporate_action"
        },
        {
            "Title": "Impex Ferro Tech Limited Holds 21st Committee of Creditors Meeting During Insolvency Process",
            "Summary": "Impex Ferro Tech Limited conducted its 21st Committee of Creditors meeting on October 16, 2025, as part of its ongoing Corporate Insolvency Resolution Process. The meeting, held from 12:30 to 13:30 hours, discussed the Resolution Professional's actions and steps taken during the corporate insolvency resolution process. The committee approved CIRP costs up to September 2025. The meeting minutes were circulated via email on October 17, 2025. Ashok Kumar Sarawagi serves as the Resolution Professional for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1761120926203,
            "Source": "corporate_action"
        },
        {
            "Title": "Impex Ferro Tech Limited Holds 20th Committee of Creditors Meeting During Corporate Insolvency Resolution Process",
            "Summary": "Impex Ferro Tech Limited conducted its 20th Committee of Creditors meeting on September 18, 2025, as part of its ongoing Corporate Insolvency Resolution Process. The meeting, held from 14:30 to 15:30 hours, discussed the Resolution Professional's actions and steps taken during the corporate insolvency resolution process. The Committee approved CIRP costs up to August 2025. The meeting minutes were circulated via email on September 20, 2025. Ashok Kumar Sarawagi serves as the Resolution Professional for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1758364626413,
            "Source": "corporate_action"
        }
    ]
}