{
    "Symbol": "INCREDIBLE",
    "ISIN": "INE452L01012",
    "News": [
        {
            "Title": "Incredible Industries Postal Ballot Results Declared",
            "Summary": "Incredible Industries Limited announces postal ballot results with 99.9999% approval for appointing Raj Prakash Verma as Non-Executive Director. Remote e-voting concluded February 10, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770831362702,
            "Source": "stocks"
        },
        {
            "Title": "Incredible Industries Q3FY26 Results Show Strong Growth",
            "Summary": "Incredible Industries reported Q3FY26 revenue of ₹18,897.50 lacs with net profit declining to ₹179.35 lacs from ₹302.54 lacs YoY. Nine-month revenue grew 18.05% to ₹62,086.29 lacs.",
            "Sentiment": "neutral",
            "PublishDate": 1770296418795,
            "Source": "co_actions_results"
        },
        {
            "Title": "Incredible Industries Board Meet Set for Feb 5, 2026",
            "Summary": "Incredible Industries Limited has scheduled a board meeting for February 5, 2026, to discuss and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769689338119,
            "Source": "co_actions_results"
        },
        {
            "Title": "Incredible Industries Board Approves Postal Ballot",
            "Summary": "Incredible Industries Limited board meeting on January 8, 2026 approved postal ballot for appointing Raj Prakash Verma as Non-Executive Director, with CDSL providing e-voting facilities.",
            "Sentiment": "neutral",
            "PublishDate": 1767870928502,
            "Source": "stocks"
        },
        {
            "Title": "Mahananda Suppliers Releases Pledge on Incredible Shares",
            "Summary": "Mahananda Suppliers Limited released pledge on 86.26 lakh shares of Incredible Industries Limited representing 18.45% stake following full repayment of term loan to SREL Infrastructure Finance Limited.",
            "Sentiment": "positive",
            "PublishDate": 1765616505293,
            "Source": "co_actions_results"
        },
        {
            "Title": "Incredible Industries Sees Major Pledge Release",
            "Summary": "Sungrowth Share Stocks Limited releases pledge on 1.49 crore shares of Incredible Industries Limited, reducing encumbered holdings from 31.83% to zero following full loan repayment to SREI Infrastructure Finance Limited.",
            "Sentiment": "positive",
            "PublishDate": 1765541698420,
            "Source": "co_actions_results"
        },
        {
            "Title": "RND Steels Releases Pledge on Incredible Industries Shares",
            "Summary": "RND Steels Limited has released its pledge on 3.40 lakh shares of Incredible Industries Limited, representing 0.73% of the total share capital, as disclosed under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765447074900,
            "Source": "stocks"
        },
        {
            "Title": "Incredible Industries Reports Mixed Q2 Performance with Revenue Growth but Profit Decline",
            "Summary": "Incredible Industries Limited reported quarterly revenue of Rs 15,888.49 lakhs but posted a net loss of Rs 49.67 lakhs for the quarter ended September 30, 2025, compared to a profit in the previous year. The company's cash position strengthened to Rs 1,435.24 lakhs while it continues expansion of its Steel Melting Shop capacity to 256,000 MTPA.",
            "Sentiment": "neutral",
            "PublishDate": 1763138274764,
            "Source": "corporate_action"
        },
        {
            "Title": "Incredible Industries Director Niket Agarwal Resigns",
            "Summary": "Niket Agarwal has resigned from his position as Non-Executive (Non Independent) Director of Incredible Industries Limited. His resignation is effective from the close of business hours on November 12, 2025, citing personal reasons. The company has informed stock exchanges BSE, NSE, and Calcutta Stock Exchange about this board change.",
            "Sentiment": "neutral",
            "PublishDate": 1762372025568,
            "Source": "corporate_governance"
        },
        {
            "Title": "Incredible Industries Completes Sale of Wind Mill Unit K-342 for Rs. 1.50 Crore",
            "Summary": "Incredible Industries Limited has executed an agreement to sell its Wind Mill unit K-342 to Technosteel Infraprojects Private Limited for Rs. 1.50 crore. The wind mill, located in Maharashtra, generated revenue of Rs. 0.49 crore (0.06% of total revenue) and had a net worth of Rs. 1.29 crore (0.89% of total net worth) in the financial year ended March 31, 2025. The Board of Directors had previously approved the sale in February 2024. Technosteel Infraprojects is engaged in manufacturing pre-stressed wire for railway sleepers and RCC cement poles, and is not related to Incredible Industries' promoter group. The transaction is not classified as a related party transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1761574648138,
            "Source": "order&deals"
        },
        {
            "Title": "Incredible Industries Reports 20.1% Revenue Growth in Q1 FY26",
            "Summary": "Incredible Industries Limited reported revenue from operations of Rs 21,975.69 lacs for the quarter ended June 30, 2025, compared to Rs 18,288.63 lacs in the same quarter previous year, marking a 20.1% increase. The company's profit for the period rose to Rs 371.51 lacs from Rs 162.03 lacs year-over-year. Basic earnings per share increased to Rs 0.80 from Rs 0.35 in the corresponding quarter. Total expenses stood at Rs 21,488.27 lacs, with cost of materials consumed being the largest component at Rs 19,285.94 lacs. The company operates in the iron and steel products segment and has no subsidiaries, associates, or joint ventures. The board meeting was held on August 13, 2025, where directors approved the unaudited financial results.",
            "Sentiment": "positive",
            "PublishDate": 1755088290177,
            "Source": "earnings"
        }
    ]
}