{
    "Symbol": "INDGN",
    "ISIN": "INE065X01017",
    "News": [
        {
            "Title": "Indegene Q3FY26 IPO Monitoring Report Submitted",
            "Summary": "Indegene Limited submitted its Q3FY26 monitoring agency report for IPO proceeds utilization. Care Edge Ratings reported Rs. 703.32 crore utilized from Rs. 760.00 crore IPO.",
            "Sentiment": "neutral",
            "PublishDate": 1769697005350,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indegene Q3FY26 Revenue Jumps 30.8% to ₹9,421 Million",
            "Summary": "Indegene Limited reported strong Q3FY26 results with revenue rising 30.8% YoY to ₹9,421 million and net profit declining 6.2% to ₹1,029 million for quarter ended December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1769695138327,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indegene Appoints Neeraj Bharadwaj as Independent Director",
            "Summary": "Indegene Limited successfully concluded postal ballot voting on January 23, 2026, with shareholders approving the appointment of Mr. Neeraj Bharadwaj as Independent Director with 99.61% votes in favour.",
            "Sentiment": "positive",
            "PublishDate": 1769190248994,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indegene Appoints Jill Mary De Simone as Independent Director",
            "Summary": "Indegene Limited has appointed Ms. Jill Mary De Simone as Additional Director (Non-Executive Independent Director) for a three-year term from January 22, 2026 to January 21, 2029, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1769092567142,
            "Source": "stocks"
        },
        {
            "Title": "Indegene Board Meet Set for Jan 29 for Q3FY26 Results",
            "Summary": "Indegene Limited has scheduled a board meeting on January 29, 2026, to consider Q3FY26 unaudited financial results and RSU allotments. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769065977319,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indegene Completes Canadian Subsidiaries Amalgamation",
            "Summary": "Indegene Limited announced the amalgamation of two step-down subsidiaries, Indegene Aptilon Services Inc. and Trilogy Writing & Consulting Inc., to form Indegene Healthcare Canada Inc. effective January 01, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767277704813,
            "Source": "stocks"
        },
        {
            "Title": "Indegene Grants 5.08 Lakh RSUs Under 2020 Plan",
            "Summary": "Indegene's Nomination and Remuneration Committee approved grants of 5,08,368 RSUs to eligible employees under the RSU 2020 Plan on December 31, 2025, with a four-year vesting schedule.",
            "Sentiment": "neutral",
            "PublishDate": 1767175346201,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indegene Completes Internal Restructuring Acquisition",
            "Summary": "Indegene Limited's subsidiaries acquired 100% equity in Trilogy Writing & Consulting Inc. (Canada) for EUR 329,014 as part of internal restructuring completed on December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767173447186,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indegene Acquires European Healthcare Marketing Agency Cake Group for EUR 8.5 Million",
            "Summary": "Indegene Limited's wholly owned subsidiary, Indegene Ireland Limited, signed a Share Purchase Agreement to acquire 100% equity shares in Cake Group for an amount not exceeding EUR 8.5 million, subject to working capital and net debt adjustments. Cake Group is a healthcare marketing and communications agency operating across Austria, Germany and Switzerland, headquartered in Vienna with approximately 25 employees across the DACH region. The company reported EUR 3.78 million revenue in FY2024, with previous years showing EUR 3.10 million in FY2023 and EUR 3.18 million in FY2022. The acquisition aims to strengthen Indegene's European presence and expand its capabilities in healthcare communications. The transaction is structured as an all-cash deal with deferred performance and milestone-based consideration, subject to Austrian Investment Control Act clearance, and is expected to complete in January 2026.",
            "Sentiment": "positive",
            "PublishDate": 1762826568723,
            "Source": "order&deals"
        },
        {
            "Title": "Indegene Reports 17.1% Revenue Growth in Q2 FY26, Announces Two Strategic Acquisitions",
            "Summary": "Indegene Limited reported quarterly revenue of INR 8,042 million, marking 17.1% year-on-year growth and 5.7% sequential growth. The company's EBITDA margin adjusted for M&A costs stood at 18.2%, down 2% sequentially due to annual wage hikes effective July 2025. The company secured significant deal wins including two large deals exceeding $3 million ACV in the Enterprise Commercial Solutions segment and four deals in the $1-3 million ACV range. Indegene completed two acquisitions in October - BioPharm, a U.S.-based omnichannel marketing company for approximately $65 million, and WARNCO, a U.K.-based consulting firm for GBP 2 million. The company's Tectonic offering generated approximately $2 million in revenue from four customers, up from two customers in Q1. Management indicated margin compression of about 1.5% in the near term due to strategic investments, expecting recovery over 6-8 quarters. The company highlighted improving industry conditions with reduced regulatory uncertainty following recent U.S. policy developments including most favored nation pricing agreements and pharmaceutical tariff announcements.",
            "Sentiment": "positive",
            "PublishDate": 1762200216419,
            "Source": "earnings"
        },
        {
            "Title": "Indegene Limited Reports No Deviation in IPO Proceeds Utilization for Quarter Ended September 30, 2025",
            "Summary": "Indegene Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing no deviation from IPO proceeds utilization objectives. The company raised Rs. 760 crores through its IPO conducted from May 6-8, 2024. CARE Ratings Limited, serving as the monitoring agency, reported that Rs. 674.17 crores have been utilized as of the quarter end, with Rs. 85.83 crores remaining unutilized and deployed in fixed deposits and bank accounts. The company had previously obtained shareholder approval through a special resolution dated August 12, 2025, for variation in IPO proceeds utilization, reallocating Rs. 38.65 crores from capital expenditure funding to debt repayment and technology infrastructure costs. Key utilization areas include Rs. 395 crores for debt repayment of material subsidiary ILSL Holdings Inc., Rs. 64.26 crores for capital expenditure requirements, Rs. 230.12 crores for general corporate purposes, Rs. 34.99 crores for technology and cybersecurity costs, and Rs. 35.63 crores for issue expenses. The monitoring agency confirmed no major deviations from earlier reports and verified that utilization aligns with disclosed objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1761892113408,
            "Source": "corporate_action"
        },
        {
            "Title": "Indegene Reports Strong Q2 Growth with 11% Revenue Increase, Approves €8.5M Investment in Irish Subsidiary",
            "Summary": "Indegene's board approved an investment of up to €8.5 million in equity shares of Indegene Ireland Limited, its wholly owned subsidiary. The company reported Q2 consolidated net profit of ₹1.02 billion, up from ₹917 million year-over-year. Revenue increased to ₹8.04 billion from ₹6.87 billion in the same period last year. EBITDA rose to ₹1.41 billion from ₹1.26 billion year-over-year, though EBITDA margin declined to 17.48% from 18.36% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761834088145,
            "Source": "corporate_action"
        },
        {
            "Title": "Indegene Ltd Sees Block Trade Worth Rs. 73.86 Crores on NSE",
            "Summary": "Indegene Ltd executed a block trade on the National Stock Exchange involving 1,342,944 shares at Rs. 550.00 per share, totaling Rs. 73.86 crores. The transaction represents a significant volume of shares traded at the specified price point.",
            "Sentiment": "neutral",
            "PublishDate": 1760944861667,
            "Source": "order&deals"
        },
        {
            "Title": "Indegene Expands Consulting Practice and Appoints New Head to Drive Life Sciences Transformation",
            "Summary": "Indegene Limited announced the expansion of its Consulting Practice to help life sciences organizations navigate large-scale transformations. The company appointed Gobin Chandra as Head of the Integrated Consulting Practice, who brings transformation advisory experience from Bain & Company and leads Indegene's Europe region. CEO Manish Gupta stated that clients seek consulting support from partners who provide strategic frameworks and execution capabilities. Indegene has been building consulting capabilities over the past decade, including the 2020 acquisition of DT Consulting for strategy consulting expertise and the recent acquisition of UK-based transformation consulting firm WARN & Co. to enhance large-scale business transformation capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1760678889715,
            "Source": "stock"
        },
        {
            "Title": "Indegene's Subsidiary Acquires UK Consulting Firm Warn And Co for Up to GBP 3 Million",
            "Summary": "Indegene Limited's wholly owned subsidiary, Indegene Ireland Limited, signed a Share Purchase Agreement to acquire 100% equity shares in Warn And Co Limited. The UK-based target company provides business transformation consulting solutions for Life Sciences companies and reported revenue of GBP 2.5 million in its last financial year. The all-cash transaction involves a total purchase consideration not exceeding GBP 3 million, subject to net working capital adjustments, with deferred performance and milestone-based consideration. The acquisition aims to augment Indegene's capabilities in life sciences consulting business. Warn And Co was incorporated on May 10, 2013, and reported turnover of GBP 2.5 million in FY23, GBP 2.0 million in FY24, and GBP 2.5 million in FY25. The transaction is expected to complete on or before October 17, 2025, and does not fall within related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1760677626076,
            "Source": "order&deals"
        },
        {
            "Title": "Indegene Acquires BioPharm for $104 Million to Expand Precision Pharma Marketing",
            "Summary": "Indegene has acquired BioPharm for $104 million as part of its strategy to strengthen precision pharma marketing capabilities. BioPharm operates with an EBITDA margin of 27% on net revenue. Indegene management expects the acquisition to become earnings per share accretive after five to six quarters.",
            "Sentiment": "positive",
            "PublishDate": 1759830461004,
            "Source": "order&deals"
        },
        {
            "Title": "Indegene Acquires Biopharm Parent Holding for $106 Million to Enhance Marketing Capabilities",
            "Summary": "Indegene announced its acquisition of all shares of Biopharm Parent Holding, Inc. for up to $106 million. The deal is designed to strengthen Indegene's omnichannel marketing capabilities. The transaction is expected to be completed by October 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1759309431053,
            "Source": "order&deals"
        },
        {
            "Title": "Indegene Hosts Digital Summit 2025 Focusing on AI-Powered Life Sciences Commercialization",
            "Summary": "Indegene Limited hosted its 7th annual Digital Summit 2025 in Philadelphia, bringing together senior life sciences executives to explore AI transformation in commercialization. The invite-only event featured the theme 'From Chaos to Clarity - and Better Decisions' with focus on Generative AI applications. The summit included discussions on data unification, agent-augmented workforce, GenAI in commercial operations, and evolving pharma regulations. The event also presented the Vital Awards recognizing industry leaders across four categories: Patient Impact, Community Impact, Organizational Impact, and Market Impact. Award recipients included executives from AstraZeneca, Merck, and Sanofi. The jury comprised senior leaders from companies including Gilead Sciences, Merck, and academic institutions. Manish Gupta, Chairman and CEO of Indegene, congratulated the honorees for their innovation and impact in helping the industry become future-ready.",
            "Sentiment": "positive",
            "PublishDate": 1758715644246,
            "Source": "stock"
        },
        {
            "Title": "Indegene Partners with Datavant to Enhance Clinical Trial Recruitment Efficiency",
            "Summary": "Indegene Limited announced a strategic partnership with Datavant to improve patient recruitment for clinical trials, particularly focusing on rare disease and complex studies. The collaboration integrates Datavant's data enrichment capabilities into Indegene's NEXT Patient Recruitment platform. Datavant operates a health data retrieval network spanning over 80,000 hospitals and clinics, processing more than 100 million patient records annually. The partnership aims to enable faster trial enrollment, reduce screen failures, and streamline identification of suitable participants based on specific health data criteria. This allows more eligible participants to connect with trials for their specific health conditions and helps biopharmaceutical companies accelerate enrollment timelines and improve screen-to-randomization ratios.",
            "Sentiment": "positive",
            "PublishDate": 1758283771140,
            "Source": "order&deals"
        },
        {
            "Title": "Indegene Opens New Center in Pune to Expand India Operations",
            "Summary": "Indegene Limited, a digital-first life sciences commercialization company, has opened a new center in Pune to expand its presence in India. The company aims to leverage Pune's skilled technology, management, and medical talent to enhance its ability to help clients accelerate innovation and scale global operations. Indegene serves the world's top 20 biopharma companies, emerging biotech firms, and medical device companies. The company has approximately 5,000 employees worldwide across 9 operations hubs and 20 offices in North America, Europe, and Asia.",
            "Sentiment": "positive",
            "PublishDate": 1757054213094,
            "Source": "stock"
        },
        {
            "Title": "Indegene Limited Shareholders Approve IPO Proceeds Reallocation Through Postal Ballot",
            "Summary": "Indegene Limited shareholders approved a special resolution for variation in utilization of IPO proceeds through remote e-voting postal ballot concluded on August 12, 2025. The voting results showed 92,487,493 total votes polled representing 38.53% of outstanding shares. The resolution received overwhelming support with 99.99% votes in favor (92,480,676 votes) and only 0.0074% against (6,817 votes). Among the 1,54,043 equity shareholders as of the July 4, 2025 cut-off date, 718 members voted in favor while 82 voted against. The e-voting period ran from July 14 to August 12, 2025. Promoter and promoter group voted 100% in favor with 28,568,264 votes, while public institutions and non-institutions also showed strong support at 99.99% approval rate.",
            "Sentiment": "positive",
            "PublishDate": 1755091580001,
            "Source": "corporate_action"
        },
        {
            "Title": "Indegene Reports 1.8% USD Revenue Growth in Q1 FY26, Launches Tectonic Initiative",
            "Summary": "Indegene Limited reported quarterly revenue of INR 7,068 million, representing 1.8% growth in USD terms and 0.7% in INR terms. The company achieved EBITDA of INR 1,536 million with 0.7% quarter-on-quarter growth and PAT of INR 1,164 million. The company introduced Tectonic, a new commercial content creation initiative that generated over USD 1 million in revenue from two top-20 customers during the quarter. Enterprise segments (ECS and EMS) contributed 86.6% of revenue and grew 3.5% quarter-on-quarter. Brand Activation segment experienced 21.6% degrowth due to project deferrals from regulatory hurdles and project conclusion. The largest customer grew 4.3% quarter-on-quarter, while top 5 accounts grew 0.6%. The company secured two large deal wins exceeding USD 3 million ACV and four deals in the USD 1-3 million range. Cash and cash equivalents reached INR 17,280 million, crossing $200 million. Management indicated improved deal pipeline and customer engagement, with focus on AI integration through their Cortex platform across medical affairs, regulatory, safety, and commercial operations.",
            "Sentiment": "positive",
            "PublishDate": 1754463141040,
            "Source": "earnings"
        },
        {
            "Title": "Indegene Outlines Growth Strategy Focusing on Client Engagement and Technology",
            "Summary": "Indegene has announced its growth strategy targeting improved client engagement, potential mergers, and technology-supported marketing initiatives. The pharmaceutical services company is preparing expansion plans as part of its strategic roadmap.",
            "Sentiment": "positive",
            "PublishDate": 1753971705444,
            "Source": "stock"
        },
        {
            "Title": "Indegene Limited Reports Strong Q1 Performance with 32.7% Profit Growth",
            "Summary": "Indegene Limited reported consolidated quarterly results with revenue from operations of ₹7,608 million compared to ₹6,765 million in the same quarter last year. The company's profit after tax increased to ₹1,164 million from ₹877 million year-over-year, representing a 32.7% growth. Basic earnings per share improved to ₹4.86 from ₹3.79 in the corresponding quarter. The company operates through three main segments: Enterprise Medical Solutions (₹2,132 million revenue), Enterprise Commercial Solutions (₹4,453 million revenue), and Brand Activation (₹758 million revenue). Total comprehensive income reached ₹1,331 million compared to ₹869 million in the previous year quarter. The board also approved share allotment under the ESOP 2020 Plan and paid a final dividend of ₹2 per share for the financial year 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1753965030821,
            "Source": "earnings"
        },
        {
            "Title": "Indegene Named Leader in Life Sciences AI and Analytics by Everest Group",
            "Summary": "Everest Group recognized Indegene as a Leader in Life Sciences AI and Analytics Services for Commercial PEAK Matrix Assessment 2025. The recognition acknowledges Indegene's AI and Analytics solutions across life sciences commercial functions and its efforts to embed Generative AI and Agentic AI capabilities across its solutions portfolio. Everest Group highlighted Indegene's ability to combine AI and Analytics capabilities with domain knowledge to deliver commercial solutions across therapy areas including specialty care, oncology and rare diseases. The assessment evaluated 30 service providers on AI and Analytics vision, capabilities, and market impact. Indegene serves the world's top 20 biopharma companies and has around 5,000 employees worldwide with 9 operations hubs and 19 offices across North America, Europe, and Asia.",
            "Sentiment": "positive",
            "PublishDate": 1753873581107,
            "Source": "stock"
        },
        {
            "Title": "Indegene Limited Schedules Q1FY26 Earnings Conference Call for August 1, 2025",
            "Summary": "Indegene Limited has announced its Q1FY26 earnings conference call scheduled for Friday, August 1, 2025, at 9:00 AM IST. The call will feature senior management including Chairman and CEO Manish Gupta and CFO Suhas Prabhu discussing quarterly earnings. The company has provided dial-in details for investor participation, with universal access numbers and Diamond Pass registration available for early registration.",
            "Sentiment": "neutral",
            "PublishDate": 1753358944439,
            "Source": "earnings"
        },
        {
            "Title": "Indegene Limited Schedules Board Meeting for July 31, 2025 to Review Q2 Results and ESOP Allotments",
            "Summary": "Indegene Limited has scheduled a Board of Directors meeting for July 31, 2025, to consider unaudited standalone and consolidated financial results for the quarter ended June 30, 2025, along with the limited review report of auditors. The board will also approve allotment under ESOP Scheme 2020. The company's trading window for securities has been closed from July 1, 2025, and will remain closed until 48 hours after the declaration of the quarterly financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1753358339152,
            "Source": "corporate_action"
        },
        {
            "Title": "Indegene Limited Discloses Inadvertent Omission in Spanish Subsidiary Acquisition",
            "Summary": "Indegene Limited clarified an inadvertent omission in disclosing the acquisition of Climacreative Spain S.L.U by its wholly-owned subsidiary, Indegene Ireland Limited. The acquisition, completed on November 19, 2024, was made to establish a presence in Spain through a ready-made entity. The company paid Euro 5,500 (equivalent to INR 4,85,136.30) for 100% shareholding of the shelf company, which had no turnover or business operations. Indegene stated the omission was unintentional and emphasized its commitment to corporate governance standards. The company noted that the transaction does not qualify as a material transaction and was not a related party transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1753265452036,
            "Source": "corporate_action"
        },
        {
            "Title": "Indegene Limited Director Neeraj Bharadwaj Resigns Following Investor Exit",
            "Summary": "Mr. Neeraj Bharadwaj has resigned from his position as Non-Executive, Non-Independent Director of Indegene Limited with immediate effect. The resignation follows the exit of CA Dawn Investments, whom Bharadwaj represented on the company's board. Bharadwaj expressed appreciation to the board and management for their support during his tenure and wished the company continued success. The company has disclosed this information to stock exchanges BSE and NSE as required under listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1753183964659,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indegene Launches GenAI-Powered Medical Writing Automation Tool",
            "Summary": "Indegene has introduced a new medical writing automation tool that utilizes Generative AI technology. The tool is designed to simplify complex medical writing processes, potentially improving efficiency in the medical documentation field.",
            "Sentiment": "positive",
            "PublishDate": 1752241451000,
            "Source": "default"
        },
        {
            "Title": "Indegene Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 1,804,900 shares of Indegene Ltd. occurred on the National Stock Exchange (NSE) at a price of Rs. 590.80 per share. The total value of the trade was Rs. 106.63 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1749786705000,
            "Source": "block_details"
        },
        {
            "Title": "Indegene Ltd: Major Funds Acquire Shares in Block Deal as Carlyle Exits",
            "Summary": "Multiple investment funds, including Sunil Singhania's Abakkus Emerging Opportunities Fund, East Bridge Capital Master Fund, Societe Generale, Smallcap World Fund, and PI Opportunities AIF, purchased shares of Indegene Ltd in a block deal. Carlyle, through CA Dawn Investments, sold its entire 10.56% stake at an average price of ₹591 per share, marking a complete exit from the company.",
            "Sentiment": "neutral",
            "PublishDate": 1749086250000,
            "Source": "block_deals"
        },
        {
            "Title": "Indegene Shares Acquired by Abakkus Fund and Societe Generale",
            "Summary": "Abakkus Emerging Opportunities Fund-1, managed by Sunil Singhania, purchased 12.1 lakh shares of Indegene via open market at a price of 591.48. Additionally, Societe Generale bought 18.8 lakh shares of Indegene through the open market at a price of 591.",
            "Sentiment": "neutral",
            "PublishDate": 1749082122000,
            "Source": "default"
        },
        {
            "Title": "Indegene: Carlyle Group Exits with Rs 1,447 Crore Stake Sale",
            "Summary": "Carlyle Group has sold its entire 10.2% stake in Indegene for Rs 1,447 crore through open market transactions. The sale involved over 2.44 crore shares at Rs 591.02-591.84 per share. New investors include Premji Invest, Capital Group, Societe Generale, Eastbridge Group, and Abakkus Asset Manager, who collectively acquired 4.42% stake for Rs 627 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1749050548000,
            "Source": "block_deals"
        },
        {
            "Title": "Societe Generale and Abakkus Emerging Opportunities Fund-1 Acquire Indegene Shares",
            "Summary": "Societe Generale acquired 18.8 lakh shares of Indegene at ₹591 per share through the open market. Additionally, Abakkus Emerging Opportunities Fund-1, managed by Sunil Singhania, purchased 1.21 million Indegene shares at ₹591.48 each, also through open market transactions.",
            "Sentiment": "positive",
            "PublishDate": 1749050442000,
            "Source": "default"
        },
        {
            "Title": "Indegene Ltd: Major Block Deal as 10.5% Equity Changes Hands",
            "Summary": "A 10.5% equity stake in Indegene Ltd was traded in block deals on June 4. CA Dawn Investments, a Carlyle affiliate, was expected to sell 10.2% (2.44 crore shares) at a floor price of ₹580 per share, totaling approximately ₹1,420 crore. This follows a previous block deal in December 2024 where 4.7% equity was sold.",
            "Sentiment": "neutral",
            "PublishDate": 1749008982000,
            "Source": "block_deals"
        },
        {
            "Title": "Indegene: Block Trade of 24.67 Million Shares on NSE",
            "Summary": "A block trade of approximately 24,671,393 shares of Indegene occurred on the National Stock Exchange (NSE) at a price of Rs 592.25 per share. The total value of the transaction was Rs 1461.16 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1749008815000,
            "Source": "block_details"
        },
        {
            "Title": "Indegene Ltd: Carlyle Affiliate to Sell 10.2% Stake in Block Deal",
            "Summary": "CA Dawn Investments, a Carlyle affiliate, plans to sell 10.2% stake in Indegene Ltd through block deals worth ₹1,420 crore. The sale involves 2.44 crore shares at a floor price of ₹580 per share, a 6.4% discount to current market price. Kotak and IIFL are brokering the deal.",
            "Sentiment": "neutral",
            "PublishDate": 1748960482000,
            "Source": "block_deals"
        },
        {
            "Title": "CA Dawn to Sell 10.2% Stake in Indegene",
            "Summary": "CA Dawn is planning to sell a 10.2% stake in Indegene through a block deal. The floor price for the sale is set at ₹580 per share, with the total deal value estimated at ₹1,420 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1748958060000,
            "Source": "default"
        },
        {
            "Title": "Indegene Reports Strong Q4 Results with Increased Profit and Revenue",
            "Summary": "Indegene announced its Q4 financial results, showing significant year-over-year growth. The consolidated net profit rose to 1.18 billion rupees, up from 948 million rupees in the same quarter last year. Quarterly revenue increased to 7.56 billion rupees from 6.7 billion rupees year-over-year. The company also declared a final dividend of 2 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1745885407000,
            "Source": "default"
        },
        {
            "Title": "Indegene Announces Q4 Results and Final Dividend",
            "Summary": "Indegene has reported its Q4 financial results and dividend declaration. The company's EBITDA for Q4 increased to 1.5 billion rupees from 1.39 billion rupees year-over-year. However, the EBITDA margin decreased to 19.52% from 20.61% in the same period. Additionally, Indegene has recommended a final dividend of 2 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1745850250000,
            "Source": "result"
        },
        {
            "Title": "Indegene Reports Strong Q4 Financial Results",
            "Summary": "Indegene has announced its Q4 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit reached 1.18 billion rupees, up from 948 million rupees in the same quarter last year and 1.1 billion rupees in the previous quarter. Revenue also increased to 7.56 billion rupees, compared to 6.7 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1745850135000,
            "Source": "result"
        },
        {
            "Title": "Indegene's Irish Subsidiary to Acquire MJL Communications Group",
            "Summary": "Indegene Ireland, a subsidiary of Indegene, has agreed to acquire MJL Communications Group Ltd. and its subsidiary MJL Advertising Ltd. in a phased manner. The acquisition is aimed at expanding Indegene's business and will be conducted on a debt-free, cash-free basis for a maximum amount of £3.4 million.",
            "Sentiment": "positive",
            "PublishDate": 1742947791000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indegene's Irish Subsidiary to Acquire MJL Communications Group",
            "Summary": "Indegene Ireland, a subsidiary of Indegene, has agreed to acquire MJL Communications Group Ltd. and its subsidiary MJL Advertising Ltd. in a phased manner. The acquisition is aimed at expanding Indegene's business and will be conducted on a debt-free, cash-free basis for an amount not exceeding £3.4 million.",
            "Sentiment": "positive",
            "PublishDate": 1742913689000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indegene Approves €5.2M Investment in Irish Subsidiary and Reappoints Secretarial Auditor",
            "Summary": "Indegene's board has approved a €5.2 million investment in its Ireland subsidiary. Additionally, the company has reappointed its secretarial auditor. This decision indicates the company's commitment to expanding its operations in Ireland and maintaining its corporate governance practices.",
            "Sentiment": "positive",
            "PublishDate": 1742439038000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indegene Expands European Presence with New London Center",
            "Summary": "Indegene, a healthcare technology company, has announced the opening of a new center in London, signaling its expansion in the European market. This strategic move aims to strengthen the company's presence and capabilities in the region.",
            "Sentiment": "positive",
            "PublishDate": 1742429127000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indegene Expands European Presence with New London Center",
            "Summary": "Indegene, a healthcare solutions provider, has announced the expansion of its presence in Europe by opening a new center in London. This strategic move aims to strengthen the company's foothold in the European market and enhance its ability to serve clients in the region.",
            "Sentiment": "positive",
            "PublishDate": 1742384252000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indegene Launches Cortex: A Generative AI Platform for Life Sciences",
            "Summary": "Indegene has introduced Cortex, a specialized generative AI platform designed specifically for the life sciences industry. This platform aims to provide tailored AI solutions to meet the unique needs and challenges of companies operating in the life sciences sector.",
            "Sentiment": "positive",
            "PublishDate": 1740374438000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indegene Expands European Presence with New Entity in Spain",
            "Summary": "Indegene, a healthcare solutions provider, has announced the launch of a new entity in Spain, marking a significant expansion of its footprint in Europe. This strategic move aims to strengthen the company's presence in the European market and enhance its ability to serve clients in the region.",
            "Sentiment": "positive",
            "PublishDate": 1738823515000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indegene Reports Strong Q3 Financial Results",
            "Summary": "Indegene has announced its Q3 financial results, showing significant growth. The company's consolidated net profit increased to 1.1 billion rupees, up from 988 million rupees year-over-year and 917 million rupees quarter-over-quarter. Revenue also saw growth, reaching 7.2 billion rupees compared to 6.7 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738284286000,
            "Source": "earnings"
        }
    ]
}