{
    "Symbol": "INDHOTEL",
    "ISIN": "INE053A01029",
    "News": [
        {
            "Title": "IHCL Reports Record Q3 FY26 Results",
            "Summary": "The Indian Hotels Company Limited delivered its fifteenth consecutive record quarter with revenue of ₹2,900 crores (up 12% YoY), EBITDA of ₹1,134 crores, and PAT of ₹903 crores for Q3 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1770898658873,
            "Source": "co_actions_results"
        },
        {
            "Title": "IHCL Schedules Q3FY26 Results Call on Feb 12, 2026",
            "Summary": "Indian Hotels Company Limited announces global conference call on February 12, 2026 at 7:00 PM IST to discuss Q3 FY2025-26 financial results with analysts and institutional investors.",
            "Sentiment": "neutral",
            "PublishDate": 1770612704625,
            "Source": "co_actions_results"
        },
        {
            "Title": "IHCL Reaches 615-Hotel Portfolio Milestone",
            "Summary": "The Indian Hotels Company Limited achieves significant growth milestone with 615 hotels in portfolio, including 360 operational hotels and 255 in pipeline under Accelerate 2030 strategy.",
            "Sentiment": "positive",
            "PublishDate": 1770295601158,
            "Source": "stocks"
        },
        {
            "Title": "IHCL Strengthens Market Position Through Capital-Light Strategy",
            "Summary": "Indian Hotels Company Limited transitions to capital-light model with 67% management-led inventory, targets 20% ROCE by 2030, and reports strong H1 FY26 performance with 21% growth in management fees.",
            "Sentiment": "positive",
            "PublishDate": 1769427474331,
            "Source": "stocks"
        },
        {
            "Title": "Rekha Jhunjhunwala cuts Indian Hotels stake by 1%",
            "Summary": "Ace investor Rekha Jhunjhunwala reduced her stake in Indian Hotels by 1.02% during Q3, selling 1,45,23,200 shares amid the stock's underperformance against BSE Sensex.",
            "Sentiment": "neutral",
            "PublishDate": 1769412914380,
            "Source": "stocks"
        },
        {
            "Title": "Indian Hotels Company Shares Drop 2.01% to ₹643.35",
            "Summary": "Indian Hotels Company shares declined 2.01% to ₹643.35 on Friday. Despite strong annual revenue growth of 23.13% to ₹8,334.54 crores in 2025, quarterly performance shows mixed results with revenue flat and net profit declining significantly.",
            "Sentiment": "negative",
            "PublishDate": 1769158423142,
            "Source": "stocks"
        },
        {
            "Title": "IHCL targets 700+ hotels by 2030 with asset-light model",
            "Summary": "Indian Hotels Company CEO Puneet Chhatwal outlines expansion strategy to cross 700 hotels by 2030, leveraging asset-light model that has shifted portfolio from 75% asset-heavy to 65% asset-light, delivering 40%+ standalone margins.",
            "Sentiment": "positive",
            "PublishDate": 1768839364622,
            "Source": "stocks"
        },
        {
            "Title": "IHCL Completes ₹232 Cr Acquisition of Atmantan Resort",
            "Summary": "The Indian Hotels Company Limited successfully acquired 51% stake in Sparsh Infratech Private Limited, owner of Atmantan wellness resort, for ₹232 crores, marking its entry into integrated wellness segment.",
            "Sentiment": "positive",
            "PublishDate": 1768568424373,
            "Source": "co_actions_results"
        },
        {
            "Title": "IHCL Acquires 51% Stake in Brij Hospitality for ₹225 Cr",
            "Summary": "The Indian Hotels Company Limited announces acquisition of 51% stake in Brij Hospitality Private Limited for ₹225 crores, adding 22 hotels to its portfolio under capital-light growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1768478877642,
            "Source": "co_actions_results"
        },
        {
            "Title": "JPMorgan Cuts Indian Hotels Target to ₹805, Retains Buy",
            "Summary": "JPMorgan reduced Indian Hotels' price target from ₹890 to ₹805 for September 2026 while maintaining Overweight rating, citing weaker H1 FY26 performance but highlighting strong fundamentals and growth prospects.",
            "Sentiment": "neutral",
            "PublishDate": 1767933764290,
            "Source": "stocks"
        },
        {
            "Title": "JPMorgan Maintains Overweight on Indian Hotels at ₹805",
            "Summary": "JPMorgan continues its positive outlook on Indian Hotels Company, maintaining an 'Overweight' rating with a price target of ₹805, reflecting confidence in the hospitality sector leader.",
            "Sentiment": "positive",
            "PublishDate": 1767930964564,
            "Source": "stocks"
        },
        {
            "Title": "Indian Hotels drops 3% on Morgan Stanley downgrade",
            "Summary": "Indian Hotels Company shares fell nearly 3% after Morgan Stanley downgraded the stock to 'equal weight' from 'overweight' and cut price target to ₹780 from ₹811, citing limited upside surprises despite strong fundamentals.",
            "Sentiment": "negative",
            "PublishDate": 1767786386064,
            "Source": "stocks"
        },
        {
            "Title": "Indian Hotels Subsidiary Acquires Majority Stakes in Two Hotel Companies for ₹190.5 Crore",
            "Summary": "Indian Hotels' subsidiary RCL acquired 51% stakes in ANK Hotels and Pride Hospitality for ₹190.5 crore. The acquisition expands RCL's portfolio by over 140 midscale hotels, significantly strengthening its presence in the hospitality sector.",
            "Sentiment": "positive",
            "PublishDate": 1764597902135,
            "Source": "order&deals"
        },
        {
            "Title": "Indian Hotels Acquires 51% Stake in Atmantan for ₹240 Cr to Enter Wellness Segment",
            "Summary": "Indian Hotels has acquired a 51% stake in Atmantan for ₹240 crores, marking its strategic entry into the integrated wellness segment with plans to expand room capacity and national wellness footprint. The company aims to replicate this model across India under J Wellness Circle, targeting capital-light growth with 25% revenue CAGR and 40% EBITDA margin in the wellness vertical.",
            "Sentiment": "positive",
            "PublishDate": 1763136951052,
            "Source": "order&deals"
        },
        {
            "Title": "Indian Hotels Co. Ltd. Block Trade Worth Rs. 64.92 Crores on NSE",
            "Summary": "Indian Hotels Co. Ltd. executed a block trade on NSE involving 907,405 shares at Rs. 715.45 per share, totaling Rs. 64.92 crores. The large-volume transaction indicates significant institutional or bulk investor activity in the hospitality company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1763094648366,
            "Source": "order&deals"
        },
        {
            "Title": "IHCL Releases Earnings Call Transcript for Quarter Ended September 30, 2025",
            "Summary": "The Indian Hotels Company Limited (IHCL) has submitted the transcript of its earnings call for the quarter and half year ended September 30, 2025 to stock exchanges BSE and NSE. The earnings call was held on November 4, 2025, and the transcript is available on the company's investor website. The document was filed by Executive Vice President Corporate Affairs and Company Secretary Beejaldesai.",
            "Sentiment": "neutral",
            "PublishDate": 1762751184659,
            "Source": "earnings"
        },
        {
            "Title": "IHCL Reports 14 Consecutive Quarters of Strong Performance as Brand Portfolio Gains Independence",
            "Summary": "Indian Hotels Company Ltd. (IHCL) Managing Director and CEO Puneet Chhatwal announced the company has delivered 14 straight quarters of strong performance. The hospitality group's brands, including Taj and Ginger, now operate independently rather than relying solely on the Taj brand. IHCL's growth is driven by demand outpacing supply in the hospitality market, margin expansion through an asset-light model, and fee-based growth strategy using management contracts. Ginger's budget brand revenue has grown to nearly Rs 1,000 crore from under Rs 300 crore seven to eight years ago. Qmin food delivery platform crossed Rs 100 crore in GMV, while Taj SATS non-aviation catering business expanded to 12% of overall catering revenues. The company maintains guidance for double-digit topline growth and expects to open around 36-40 hotels by year-end, currently opening three hotels monthly. IHCL achieved nearly 35% margins and expects to match or exceed that performance.",
            "Sentiment": "positive",
            "PublishDate": 1762424064187,
            "Source": "stock"
        },
        {
            "Title": "Indian Hotels Progresses Toward 2030 Expansion Goals with 435 Hotels and 50,000+ Keys",
            "Summary": "Indian Hotels is advancing toward its Accelerate 2030 targets, currently operating 435 hotels with over 50,000 keys. The company is expanding through the acquisition of the Clarks portfolio comprising 135 hotels, growth of its Ginger brand, and partnership-driven midscale expansion. The hotel chain has reaffirmed its double-digit revenue growth guidance for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1762268767620,
            "Source": "stock"
        },
        {
            "Title": "Indian Hotels Reports Strong Q2 Performance with 72% Jump in Standalone Net Profit",
            "Summary": "The Indian Hotels Company Limited reported standalone net profit of ₹23,135 lakhs for the quarter ended September 30, 2025, representing a 72% increase from ₹13,465 lakhs in the same quarter last year. Revenue from operations grew to ₹105,051 lakhs compared to ₹103,533 lakhs in the previous quarter. For the half-year period, standalone net profit reached ₹47,593 lakhs versus ₹32,607 lakhs in the corresponding period last year. On a consolidated basis, the company posted net profit of ₹23,935 lakhs for the quarter, up from ₹16,475 lakhs year-on-year. Consolidated revenue from operations was ₹202,089 lakhs for the quarter. The company's earnings per share stood at ₹1.72 for the quarter on a standalone basis. The Board of Directors approved these unaudited financial results at their meeting held on November 4, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762259441359,
            "Source": "earnings"
        },
        {
            "Title": "Indian Hotels Reports 49% Drop in Q2 Net Profit Despite Revenue Growth",
            "Summary": "Indian Hotels reported quarterly net profit of 2.85 billion rupees, down from 5.55 billion rupees in the same period last year, falling short of the 2.9 billion rupee estimate. Revenue increased to 20.4 billion rupees from 18.26 billion rupees year-over-year, slightly below the estimated 20.7 billion rupees. EBITDA rose to 5.7 billion rupees from 5.01 billion rupees, with EBITDA margin improving to 27.93% from 27.45%, though both metrics came in below estimates of 5.8 billion rupees and 28% respectively.",
            "Sentiment": "negative",
            "PublishDate": 1762256773974,
            "Source": "earnings"
        },
        {
            "Title": "Indian Hotels Infuses $25 Million in Netherlands Subsidiary IHOCO BV",
            "Summary": "The Indian Hotels Company Limited has invested $25 million as equity in its wholly owned subsidiary IHOCO BV, incorporated in Netherlands. The investment amount totals ₹219.69 crores and will be used by IHOCO BV to make further investments in its subsidiaries for debt repayment and operational requirements. IHOCO BV serves as IHCL's apex holding company for overseas hospitality investments and was incorporated on June 29, 1984. The company's shareholding in IHOCO BV remains unchanged at 100%. IHOCO BV reported a turnover of ₹3.84 crores and a net loss of ₹28.06 crores, with a net worth of ₹3057.14 crores. The transaction is completed immediately through cash consideration.",
            "Sentiment": "neutral",
            "PublishDate": 1761241051911,
            "Source": "corporate_action"
        },
        {
            "Title": "IHCL Signs 46 Hotels and Opens 26 Properties in First Half of FY2026",
            "Summary": "Indian Hotels Company Limited (IHCL) reported significant expansion in the first half of FY2026, signing 46 new hotels and opening 26 properties, including 14 additions through partnerships with Brij Hospitality and Clarks Group of Hotels. The signings were primarily across IHCL's Gateway, Tree of Life and Ginger brands, enabled by multi-hotel framework agreements with Ambuja Neotia group and Madison. New Taj brand hotels were signed in locations including Darjeeling, ECR Chennai, Pondicherry, Mohali and Kruger National Park, South Africa. The company opened 12 hotels and onboarded 14 more, entering new locations with properties in Alibaug, Raichak, Lakshadweep, and Thane, while strengthening presence in existing markets like Udaipur, Coorg, Ahmedabad, Haridwar and Dehradun. IHCL reached a milestone of 250+ operating hotels in India with 25,500 rooms and maintains its goal of achieving a 700-hotel portfolio under its Accelerate 2030 strategy.",
            "Sentiment": "positive",
            "PublishDate": 1760519008529,
            "Source": "stock"
        },
        {
            "Title": "Veteran Investor Sabharwal Sees Strong H2 for Hospitality, Bullish on Auto Sector",
            "Summary": "Veteran investor Sandip Sabharwal shared market insights across key sectors in a conversation with ET Now. On defense, he highlighted Bharat Electronics as the best play for Indian defense, noting that while shipyard companies have earnings visibility, valuations remain expensive. For hospitality, Sabharwal expects a strong second half driven by wedding demand and events, favoring Indian Hotels and budget chains like Lemon Tree, along with booking platforms like MakeMyTrip. He expressed caution on Swiggy due to unpredictable cash flows and volatility around results. Sabharwal was bullish on the auto sector, citing GST cuts, lower interest rates, and higher disposable income creating a secular growth trajectory lasting 2-3 years. On precious metals, he warned against buying gold and silver at current elevated prices, calling them bubble territory after gold crossed 3500, and advised waiting for consolidation before adding exposure.",
            "Sentiment": "neutral",
            "PublishDate": 1760343813606,
            "Source": "stock"
        },
        {
            "Title": "Indian Hotels in Talks to Operate Adani Group's Two Ahmedabad Hotels",
            "Summary": "Indian Hotels is in discussions to operate two hotels for Adani Group in Ahmedabad. Adani Group plans to invest ₹15 billion to construct these two hotels at Ahmedabad Airport.",
            "Sentiment": "positive",
            "PublishDate": 1760087554169,
            "Source": "order&deals"
        },
        {
            "Title": "Indian Hotel Reaffirms Double-Digit Revenue Growth Guidance",
            "Summary": "Indian Hotel has maintained its topline guidance of double-digit growth. The company reaffirmed this revenue growth target through management commentary.",
            "Sentiment": "positive",
            "PublishDate": 1760074952635,
            "Source": "stock"
        },
        {
            "Title": "Indian Hotels Subsidiary Receives Construction Approval for Taj Bandstand Hotel in Mumbai",
            "Summary": "ELEL Hotels and Investment Limited, a wholly-owned subsidiary of The Indian Hotels Company Limited, received the first Commencement Certificate from the Brihanmumbai Municipal Corporation on September 24, 2025, for its proposed hotel 'Taj Bandstand' at Bandra, Mumbai. This approval completes all necessary regulatory clearances required to begin construction of the hotel project.",
            "Sentiment": "positive",
            "PublishDate": 1758793346191,
            "Source": "stock"
        },
        {
            "Title": "Indian Hotels Acquires Shares Worth ₹100.83 Crore from EleL Hotels Through Rights Issue",
            "Summary": "Indian Hotels has purchased shares from EleL Hotels And Investment Ltd for ₹100.83 crore through a rights issue transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1758619643160,
            "Source": "corporate_action"
        },
        {
            "Title": "IHCL Clarifies Taj Does Not Own The Pierre Hotel in New York City",
            "Summary": "Indian Hotels Company Limited (IHCL) has issued a clarification regarding media reports about The Pierre hotel in New York City. The company stated that Taj does not own The Pierre property and confirmed that operations at the hotel continue normally.",
            "Sentiment": "neutral",
            "PublishDate": 1758201215145,
            "Source": "stock"
        },
        {
            "Title": "IHCL's ama Stays & Trails Opens 150th Property in Uttar Pradesh",
            "Summary": "Indian Hotels Company's premium homestay brand ama Stays & Trails opened its 150th bungalow, Anand Bhawan Palace, in Kannauj, Uttar Pradesh. This marks the brand's entry into Uttar Pradesh, driven by rising demand for private stays and immersive travel experiences. The property, originally built in 1929, has been restored to offer six spacious suites named after Kannauj's traditional perfumes. IHCL Executive Vice President Deepika Rao highlighted the brand's accelerated growth pace and focus on heritage-infused stays for discerning travelers.",
            "Sentiment": "positive",
            "PublishDate": 1757990964861,
            "Source": "stock"
        },
        {
            "Title": "IHCL Signs 64-Key Hotel in Pahalgam Under Gateway Brand",
            "Summary": "Indian Hotels Company Ltd. announced the signing of a 64-key brownfield hotel in Pahalgam, Jammu and Kashmir under the Gateway brand. The company partnered with Riaz Ahmad Panjra for this project. IHCL Executive Vice President Suma Venkatesh stated this signing aligns with the company's strategy to target high-potential destinations with scenic beauty and strong tourism ecosystems. With this addition, IHCL will operate seven hotels in Jammu and Kashmir, including one under development.",
            "Sentiment": "positive",
            "PublishDate": 1757406186888,
            "Source": "stock"
        },
        {
            "Title": "Indian Hotels Company Reports Malware Incident, Operations Continue Normally",
            "Summary": "Indian Hotels Company disclosed a malware incident affecting its systems. The company confirmed that despite the cybersecurity breach, its business operations remain unaffected and continue to function normally.",
            "Sentiment": "neutral",
            "PublishDate": 1756982425087,
            "Source": "stock"
        },
        {
            "Title": "IHCL Signs 125-Key Ginger Hotel in Maharashtra's Satara",
            "Summary": "Indian Hotels Company Ltd (IHCL) announced the signing of a 125-key green-field Ginger hotel in Satara, Maharashtra. The company cited Satara's convergence of education, healthcare and business as creating steady demand, making it suitable for Ginger's expansion into high-potential markets. IHCL will partner with Vedantika Raje Bhonsle for this project. Following this addition, IHCL will operate 43 hotels in Maharashtra, with 16 currently under development.",
            "Sentiment": "positive",
            "PublishDate": 1756378944151,
            "Source": "stock"
        },
        {
            "Title": "Indian Hotels Sees Rs. 121.05 Crore Block Trade on NSE",
            "Summary": "Indian Hotels Co. Ltd. witnessed a block trade worth Rs. 121.05 crores on the NSE. The transaction involved approximately 1,561,254 shares at a price of Rs. 775.35 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1755597283414,
            "Source": "order&deals"
        },
        {
            "Title": "IHCL Partners with Madison for 10 New Ginger Hotels in South India Worth Rs 500 Crore",
            "Summary": "The Indian Hotels Company has signed an agreement with Madison, the hospitality platform of Terminus Group and JV Ventures, to operate ten new hotels under the Ginger brand across southern Indian states. Madison will invest approximately Rs 500 crore to construct ten hotels with over 1,000 keys within three years through greenfield and brownfield projects. The partnership begins with a 75-key Ginger hotel in Genome Valley, Telangana, under a capital-light operating lease arrangement. The Ginger brand targets the mid-scale segment for aspirational travelers across metros, state capitals, commercial centers, industrial townships, pilgrimage sites, and leisure destinations. Madison, established in 2023 as a joint venture between Terminus Group and JV Ventures, will focus on industrial and spiritual towns in southern India.",
            "Sentiment": "positive",
            "PublishDate": 1755514719601,
            "Source": "order&deals"
        },
        {
            "Title": "IHCL Acquires 51% Stake in Clarks Hotels Portfolio for INR 204 Crores to Expand Ginger Brand",
            "Summary": "IHCL announced the acquisition of a 51% stake in two companies (ANK and Pride) that own the Clarks Hotels & Resorts portfolio for INR 204 crores. The deal adds 135 hotels with approximately 7,000 keys across 100+ locations to IHCL's portfolio, primarily under the Ginger brand. This expansion will make Ginger the market leader in the mid-scale segment, growing to 250+ hotels with a target of 300+ hotels in 18 months. The company projects INR 60 crores revenue with 30% EBITDA margin by FY27, and INR 100 crores revenue with INR 60 crores consolidated EBITDA by FY30. Integration plans include rebranding 85-90% of the Clarks portfolio as Ginger and implementing the 'Lean Luxe' model to drive higher average room rates and occupancies. Current Clarks management will continue operations, and the primary investment will fund property upgrades. Management views this as the beginning of IHCL's inorganic growth strategy while maintaining focus on the luxury Taj brand.",
            "Sentiment": "positive",
            "PublishDate": 1755514625597,
            "Source": "order&deals"
        },
        {
            "Title": "IHCL Targets 15% Revenue Contribution from Ginger Brand, Acquires Stakes in Clarks Hotels",
            "Summary": "Indian Hotels Company Ltd (IHCL) expects its Ginger brand to contribute 15% to revenue with increasing profitability. The company's board approved acquiring 51% stakes in ANK Hotels and Pride Hospitality, which operate 135 hotels under The Clarks Hotels & Resorts brand. CEO Puneet Chhatwal stated that majority growth comes from the mid-market segment, with plans to make Ginger the strongest mid-market brand within 12-18 months through 250-plus hotels. The company targets over Rs 1,000 crore revenue from Ginger on a 12-month trailing basis. The acquisitions align with IHCL's 'accelerate 2030' growth strategy and asset-light approach, targeting Tier-2, Tier-3 cities, spiritual destinations, and metro cities to serve middle-class accommodation needs.",
            "Sentiment": "positive",
            "PublishDate": 1754992183466,
            "Source": "stock"
        },
        {
            "Title": "Indian Hotels Acquires Majority Stakes in Two Hotel Companies for ₹2.04 Billion",
            "Summary": "Indian Hotels is acquiring 51% stakes in two hospitality companies. The company will purchase a 51% stake in Ank Hotels for ₹1.10 billion and a 51% stake in Pride Hospitality for ₹940 million. The combined value of both acquisitions totals ₹2.04 billion.",
            "Sentiment": "positive",
            "PublishDate": 1754923221523,
            "Source": "order&deals"
        },
        {
            "Title": "IHCL Expands North East Presence with 21 Hotels Planned Across Region",
            "Summary": "Indian Hotels Company Ltd (IHCL) is focusing on North East India for new property development as part of a strategic initiative. The Tata Group hospitality firm currently operates 15 hotels with 1,348 rooms in the region and has six hotels with 634 rooms in the pipeline. Key projects include a hotel in Jagiroad, Assam near the upcoming Tata Electronics factory, upgrading the existing Vivanta in Guwahati to Taj brand with extensions, and building another hotel in Kaziranga. IHCL signed its first 'Taj Palace' property in the North East - the 'Taj Pushpabanta Palace' in Agartala, Tripura through a public-private partnership. The 1917-built palace will be developed into a 100-room hotel with completion expected in three years. IHCL and Ambuja Neotia Group announced an agreement for 15 new hotels primarily in East and North East India.",
            "Sentiment": "positive",
            "PublishDate": 1754200844290,
            "Source": "stock"
        },
        {
            "Title": "IHCL Reports 32% Revenue Growth Despite Geopolitical Headwinds in Q1 FY26",
            "Summary": "Indian Hotels Company Limited (IHCL) achieved consolidated revenue growth of 32% year-on-year to INR 2,102 crores in Q1 FY26, marking its 13th consecutive quarter of record performance. EBITDA grew 29% to INR 637 crores with a margin of 30.3%, while net profit increased 19% to INR 296 crores. The company faced temporary headwinds from geopolitical tensions including Operation Sindoor and Israel-Iran conflict, which led to airport closures and hotel cancellations. Despite challenges, IHCL maintained hotel segment margins at 31.4% and achieved 11% RevPAR growth for domestic hotels. The company signed 12 new hotels and opened 6 properties during the quarter, including three luxury wildlife lodges in South Africa. Management fees grew 17% to INR 133 crores, supported by capital-light strategy. IHCL holds cash reserves of over INR 3,050 crores and plans INR 1,200 crores capex for FY26. The Taj brand was rated world's strongest hotel brand for the fourth time by Brand Finance. Management remains confident of achieving double-digit revenue growth for the full year.",
            "Sentiment": "positive",
            "PublishDate": 1753259691572,
            "Source": "earnings"
        },
        {
            "Title": "IHCL Maintains 35% Growth Guidance Despite Operational Disruptions",
            "Summary": "Indian Hotels Company Ltd (IHCL) reported 11% year-on-year RevPAR growth despite flight disruptions and geopolitical tensions. CEO Puneet Chhatwal attributed performance to the Taj brand's strength, which commands a RevPAR premium exceeding 50% across markets. The company maintains its 35% growth guidance for the year, driven by new business growth at 27% with high margins. IHCL plans to open 20-25 hotels from September to March, totaling 30-36 for the full year. International markets in San Francisco and London are showing recovery, with London performing strongly during Wimbledon season. The company is investing 22 million pounds in London renovations. IHCL targets 700 hotels by 2030, with at least 500 operational, focusing on asset-light growth through brands like Ginger, Gateway, and Tree of Life. TajSATS airline catering business grew 21% annually with 20% growth guidance, holding over 50% market share of in-flight meals served in India.",
            "Sentiment": "positive",
            "PublishDate": 1753067515384,
            "Source": "earnings"
        },
        {
            "Title": "Indian Hotels Co Sets ₹5,000 Crore Capital Expenditure Plan, Targets 700 Hotels by 2030",
            "Summary": "Indian Hotels Co has announced a long-term capital expenditure plan of ₹5,000 crore over 4-5 years, with ₹1,200 crore expected in FY26. The company aims to have 700 hotels by 2030 under its Accelerate 2030 initiative. Indian Hotels Co anticipates over 10% growth in hotel revenue and a 20% increase in airline catering revenue this year. The company plans to open more than 30 new hotels, with growth expected to accelerate from September.",
            "Sentiment": "positive",
            "PublishDate": 1752809726000,
            "Source": "default"
        },
        {
            "Title": "Indian Hotels Reports Q1 Financial Results",
            "Summary": "Indian Hotels has announced its financial results for the first quarter. The company's consolidated net profit increased to 2.96 billion rupees, up from 2.48 billion rupees in the same period last year. Revenue also saw growth, rising to 20.4 billion rupees from 15.5 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1752801179000,
            "Source": "default"
        },
        {
            "Title": "IHCL Plans Major Expansion with New Hotels and Investments",
            "Summary": "Indian Hotels Company Limited (IHCL) is planning a significant expansion with over 30 new hotels and an investment of ₹1,200 crore. The company is pursuing an asset-light growth strategy, driven by strong revenue per available room, limited supply in key areas, and a growing digital loyalty program. IHCL aims for double-digit revenue growth in FY26 and beyond.",
            "Sentiment": "positive",
            "PublishDate": 1752768126000,
            "Source": "default"
        },
        {
            "Title": "Indian Hotels Reports Q1 Financial Results",
            "Summary": "Indian Hotels has announced its Q1 financial results. The company's EBITDA increased to 5.76 billion rupees from 4.5 billion rupees year-over-year. The EBITDA margin slightly decreased to 28.22% from 29% year-over-year. Consolidated net profit rose to 2.96 billion rupees from 2.48 billion rupees year-over-year. Revenue grew to 20.4 billion rupees from 15.5 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1752753592000,
            "Source": "result"
        },
        {
            "Title": "Indian Hotels Acquires Shares in ELEL Hotels Subsidiary",
            "Summary": "Indian Hotels Company has acquired 330,000 shares in its subsidiary ELEL Hotels and Investments Limited for ₹165 crore through a rights issue. This acquisition is aimed at advancing the Taj Bandstand project.",
            "Sentiment": "positive",
            "PublishDate": 1752658586000,
            "Source": "default"
        },
        {
            "Title": "Indian Hotels: Last Day to Buy Shares for Dividend Eligibility",
            "Summary": "June 27 is the last day to buy Indian Hotels shares to qualify for the Rs 2.25 per share final dividend. The record date is set for June 30, with a total dividend payout of around Rs 320 crore. This dividend is higher than the previous two years.",
            "Sentiment": "positive",
            "PublishDate": 1750994811000,
            "Source": "corporate_action"
        },
        {
            "Title": "Block Trade of Indian Hotels Co. Ltd. Shares on NSE",
            "Summary": "A block trade of approximately 1,006,148 shares of Indian Hotels Co. Ltd. occurred on the National Stock Exchange (NSE) for Rs. 78.44 crores. The shares were traded at a price of Rs. 779.60 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1748927243000,
            "Source": "block_details"
        },
        {
            "Title": "IHCL Signs Taj Pushpabanta Palace in Agartala, Expands North East Footprint",
            "Summary": "Indian Hotels Company Limited (IHCL) has signed Taj Pushpabanta Palace in Agartala. This new addition increases IHCL's presence in the North East region to fourteen hotels.",
            "Sentiment": "positive",
            "PublishDate": 1747828732000,
            "Source": "default"
        },
        {
            "Title": "Block Trade of Indian Hotels Co. Ltd. Shares on NSE",
            "Summary": "A block trade of Indian Hotels Co. Ltd. shares occurred on the National Stock Exchange (NSE). The trade involved approximately 810,033 shares at a price of Rs. 775.00 per share, totaling Rs. 62.78 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1747716095000,
            "Source": "block_details"
        },
        {
            "Title": "Indian Hotels: Q4 Results Miss Estimates, Stock Slips",
            "Summary": "Indian Hotels Co. Ltd. shares fell over 3% after Q4 results missed Bloomberg estimates. Revenue rose 27.3% to Rs 2,425 crore, net profit up 25% to Rs 522 crore. Macquarie retained 'neutral' call, cut target price due to weaker Ebitda performance. Board proposed Rs 2.25 per share dividend.",
            "Sentiment": "negative",
            "PublishDate": 1746509506000,
            "Source": "earnings"
        }
    ]
}