{
    "Symbol": "INDIAGLYCO",
    "ISIN": "INE560A01023",
    "News": [
        {
            "Title": "India Glycols Q3FY26 Results Show Strong Growth",
            "Summary": "India Glycols Limited reported robust Q3FY26 performance with revenue rising 5.25% YoY to ₹2,551.06 crores and net profit surging 48.87% to ₹65.26 crores, driven by strong performance across all business segments.",
            "Sentiment": "positive",
            "PublishDate": 1770726053214,
            "Source": "co_actions_results"
        },
        {
            "Title": "India Glycols Gets NCLT Approval for Demerger Scheme",
            "Summary": "India Glycols Limited receives NCLT approval for first motion of demerger scheme involving separation of Bio Pharma and Spirits & Biofuel businesses into two new entities with shareholder meetings scheduled for March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768560037532,
            "Source": "co_actions_results"
        },
        {
            "Title": "India Glycols faces ₹32.95 lakh customs penalty",
            "Summary": "India Glycols' Ennature Bio-Pharma division receives customs duty demand of ₹32.95 lakh with equal penalty from Additional Commissioner for alleged classification issues during 2020-2024.",
            "Sentiment": "negative",
            "PublishDate": 1767099830162,
            "Source": "stocks"
        },
        {
            "Title": "India Glycols Wins GST Appeal, Rs 1.92 Crore Tax Demand Dropped",
            "Summary": "India Glycols Limited successfully appealed against a Joint Commissioner CGST order that had disallowed Transitional Input Tax Credit and demanded Rs 1,92,12,510 along with penalty and interest. The Commissioner CGST (Appeals) Noida set aside the original order, dropping the entire tax demand with no impact on the company's financial operations.",
            "Sentiment": "positive",
            "PublishDate": 1764926686768,
            "Source": "stock"
        },
        {
            "Title": "India Glycols Raises Rs 466.99 Crore Through Preferential Share Allotment",
            "Summary": "India Glycols Limited successfully allotted 51,03,765 equity shares at Rs 915 per share on preferential basis, raising Rs 466.99 crore with promoter group entity Kashipur Holdings Limited receiving 21,85,790 shares and non-promoter investors getting 29,17,975 shares. The funds will be utilized to reduce the company's overall debt including term loans and working capital by March 2026, aimed at strengthening financial position and creating stakeholder value.",
            "Sentiment": "positive",
            "PublishDate": 1764159509711,
            "Source": "corporate_action"
        },
        {
            "Title": "India Glycols Completes Rs 467 Crore Preferential Allotment, Kashipur Holdings Ceases to be Holding Company",
            "Summary": "India Glycols Limited allotted 51,03,765 equity shares at Rs 915 per share to promoter and non-promoter entities, raising Rs 466.99 crore and increasing paid-up capital to Rs 33.51 crore. Kashipur Holdings Limited's stake reduced from 50.35% to 49.77%, causing it to cease being the holding company of India Glycols with effect from November 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763992926500,
            "Source": "corporate_action"
        },
        {
            "Title": "India Glycols Reports Strong Q2 FY26 Results with 33% EBITDA Growth and Plans INR 467 Crore Preferential Issue",
            "Summary": "India Glycols delivered robust quarterly performance with net revenue up 14% to INR 1,092 crores and EBITDA surging 33% to INR 160 crores, driven by strong growth in Biofuels (63% revenue increase) and Potable Spirits (24.5% growth). The company's Board approved a preferential allotment of INR 467 crores at INR 915 per share to promoters and related parties, with proceeds earmarked for debt reduction from current levels of INR 1,400 crores.",
            "Sentiment": "positive",
            "PublishDate": 1763728319421,
            "Source": "earnings"
        },
        {
            "Title": "India Glycols Receives Stock Exchange Approvals for Demerger Scheme",
            "Summary": "India Glycols Limited received no-objection from NSE and no adverse observations from BSE for its scheme of arrangement to demerge into Ennature Biopharma Limited and IGL Spirits Limited. The company will now proceed to seek approval from the National Company Law Tribunal, with both exchanges providing detailed conditions for the demerger and potential listing of the resulting entities.",
            "Sentiment": "positive",
            "PublishDate": 1763630806448,
            "Source": "corporate_action"
        },
        {
            "Title": "India Glycols Reports Mixed Q2 Performance with 58% Profit Drop Despite Revenue Growth",
            "Summary": "India Glycols Limited reported quarterly revenue of ₹2,410.71 crores but net profit declined 58% to ₹58.58 crores for the quarter ended September 30, 2025, compared to ₹139.65 crores in the previous year. The company's board approved a preferential share issue of up to ₹466.99 crores and is proceeding with demerger plans to separate its BioPharma and Spirits Biofuel undertakings into standalone entities.",
            "Sentiment": "positive",
            "PublishDate": 1763132649490,
            "Source": "earnings"
        },
        {
            "Title": "India Glycols Limited Passes Special Resolution for Preferential Issue of Equity Shares",
            "Summary": "India Glycols Limited held an Extraordinary General Meeting on November 12, 2025, through video conferencing. The company passed a special resolution approving the issuance of equity shares on a preferential basis with 99.79% votes in favor. The meeting was chaired by U.S. Bhartia, Chairman, with 41 members attending. The remote e-voting facility was available from November 8-11, 2025, and e-voting during the meeting was also provided. The resolution received requisite majority approval from shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1762982410495,
            "Source": "corporate_action"
        },
        {
            "Title": "India Glycols Approves Rs 467 Crore Preferential Share Issue to Promoter and Non-Promoter Groups",
            "Summary": "India Glycols Limited's Board of Directors approved raising funds through a preferential issue of up to 51,03,765 equity shares at Rs 915 per share, totaling Rs 4,66,99,44,975. The issue includes shares to both promoter and non-promoter categories, with Kashipur Holdings Limited (promoter) receiving the largest allocation of 21,85,790 shares. Other major allottees include 360 One Pipe Fund (7,10,380 shares), 360 One Special Opportunities Fund-Series 12 (4,80,870 shares), and 13 other non-promoter investors. The equity shares have a face value of Rs 5 each with a premium of Rs 910 per share. The proposal requires shareholder approval at an Extra-Ordinary General Meeting scheduled for November 12, 2025, to be conducted through video conferencing. The relevant date for the preferential issue is October 13, 2025, and pricing was determined according to SEBI ICDR Regulations.",
            "Sentiment": "positive",
            "PublishDate": 1760616081663,
            "Source": "corporate_action"
        },
        {
            "Title": "India Glycols Schedules Board Meeting to Consider Equity Share Issuance",
            "Summary": "India Glycols Limited has scheduled a Board of Directors meeting for October 16, 2025, to consider and evaluate proposals for issuing equity shares or convertible securities. The issuance may be conducted through preferential issue, private placement, or other permissible modes, subject to regulatory approvals and member approval. The company's trading window for securities has been closed since October 1, 2025, and remains closed.",
            "Sentiment": "neutral",
            "PublishDate": 1760353256414,
            "Source": "corporate_action"
        },
        {
            "Title": "Government Permits Exporting Second-Generation Ethanol",
            "Summary": "The government has permitted the export of second-generation ethanol. This development is relevant to companies including Globus Spirits and India Glycols.",
            "Sentiment": "positive",
            "PublishDate": 1758696710770,
            "Source": "sectoral"
        },
        {
            "Title": "DGTR Launches Anti-Dumping Investigation Into Mono Ethylene Glycol Imports",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has imposed an anti-dumping investigation into mono ethylene glycol imports from Kuwait, Saudi Arabia, and Singapore. This investigation affects India Glycols and the broader chemical industry dealing with mono ethylene glycol trade.",
            "Sentiment": "neutral",
            "PublishDate": 1758684070547,
            "Source": "stock"
        },
        {
            "Title": "India Glycols Announces 100% Dividend at Rs. 5 Per Share Following 2:1 Stock Split",
            "Summary": "India Glycols Limited has announced a revised dividend payment of 100% (Rs. 5 per share) for FY 2024-25, following a 2:1 stock split that changed the face value from Rs. 10 to Rs. 5 per share. The Board initially recommended a 100% dividend when shares had a Rs. 10 face value. The stock split was approved by the Board on May 30, 2025, and by shareholders through postal ballot on July 22, 2025, with August 12, 2025 as the record date. The dividend is subject to shareholder approval at the 41st Annual General Meeting scheduled for September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758545880593,
            "Source": "corporate_action"
        },
        {
            "Title": "India Glycols Reports Strong Q1FY26 Results with 21% PAT Growth Driven by Bio-Fuels and Spirits Segments",
            "Summary": "India Glycols Limited reported gross revenue of Rs. 2,503 crores, up 10% year-on-year, with net revenue at Rs. 1,040 crores, up 7%. The company achieved EBITDA of Rs. 151 crores, representing 18% growth, while PAT increased 21% to Rs. 73 crores. EBITDA margin improved by 128 basis points to 17.7%. Bio-Fuels segment led growth with 45% revenue increase to Rs. 348 crores, while Potable Spirits grew 22% to Rs. 342 crores with EBIT margin improving to 21.1%. The Chemicals segment faced pressure with revenue declining to Rs. 300 crores, though EBIT margin expanded to 10.9%. The company is undergoing restructuring to create separate entities for different business segments and expanding into new geographies including Kerala for its liquor business.",
            "Sentiment": "positive",
            "PublishDate": 1755272842937,
            "Source": "earnings"
        },
        {
            "Title": "India Glycols Limited Completes Share Sub-Division, Face Value Reduced from Rs. 10 to Rs. 5",
            "Summary": "India Glycols Limited has completed a share sub-division where each equity share with face value of Rs. 10 was split into two shares with face value of Rs. 5 each. The authorized share capital remains unchanged at Rs. 45 crores, with the number of authorized shares increasing from 4.5 crore to 9 crore shares. The issued, subscribed and paid-up share capital also remains at Rs. 30.96 crores, with the number of shares increasing from 3.09 crore to 6.19 crore shares. The sub-divided shares have been credited under new ISIN INE560A01023, with confirmation received from both NSDL and CDSL depositories. The corporate action was executed through MCS Share Transfer Agent Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1755168400773,
            "Source": "corporate_action"
        }
    ]
}