{
    "Symbol": "INDIANCARD",
    "ISIN": "INE061A01014",
    "News": [
        {
            "Title": "Indian Card Clothing Company Reports Q2 FY26 Financial Results with Mixed Performance Across Segments",
            "Summary": "The Indian Card Clothing Company Limited announced its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025, with the Board of Directors approving the results based on Audit Committee recommendations. The company's carding business continues to face challenges due to headwinds in the Indian textile industry caused by global geopolitical disturbances and economic slowdown, though management expects recovery in the next 9-12 months.",
            "Sentiment": "neutral",
            "PublishDate": 1763113471740,
            "Source": "earnings"
        },
        {
            "Title": "Indian Card Clothing Company Approves Rs. 10 Crore Investment in CFM Asset Reconstruction",
            "Summary": "The Indian Card Clothing Company Limited's Investment Committee approved an investment of Rs. 10 crores in CFM Asset Reconstruction Private Limited through subscription of equity shares of Re. 1 each. The decision was made during a committee meeting held on October 31, 2025. The company disclosed that none of the promoters, directors, key managerial personnel, or their relatives have any direct or indirect interest in this transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1761910505970,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Card Clothing Company Approves Q1 2025 Financial Results and Appoints New Auditors",
            "Summary": "The Indian Card Clothing Company Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The board also appointed M/s. S M L and Co LLP as Internal Auditor for financial years 2025-26 and 2026-27. Additionally, Mr. Devendra V. Deshpande of DVD & Associates was appointed as secretarial auditor for five consecutive financial years from April 1, 2025 to March 31, 2030, subject to member approval at the Annual General Meeting. The board meeting was held on August 14, 2025, from 4:30 p.m. to 6:00 p.m. IST.",
            "Sentiment": "neutral",
            "PublishDate": 1755184806771,
            "Source": "corporate_action"
        }
    ]
}