{
    "Symbol": "INDIGO",
    "ISIN": "INE646L01027",
    "News": [
        {
            "Title": "InterGlobe Aviation Block Trade Worth Rs. 48.69 Crores",
            "Summary": "InterGlobe Aviation executed a significant NSE block trade involving 100,129 shares at Rs. 4863.00 per share, totaling Rs. 48.69 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1770265201596,
            "Source": "co_actions_results"
        },
        {
            "Title": "CCI Orders Investigation Into IndiGo Flight Cancellations",
            "Summary": "Competition Commission of India initiates investigation into IndiGo airline following flight cancellations that occurred in December, examining potential competition law violations.",
            "Sentiment": "negative",
            "PublishDate": 1770213583688,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo Cuts Delhi-Manchester Flight Frequency",
            "Summary": "IndiGo announces reduction in Delhi-Manchester route operations from daily to 4 times weekly starting February 7, with further cuts to 3 times weekly from February 19.",
            "Sentiment": "negative",
            "PublishDate": 1770196507547,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo Plans Flexible Network Adjustments",
            "Summary": "IndiGo announces strategy to monitor external changes and adapt its flight network operations flexibly based on evolving market conditions and operational requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1770196483401,
            "Source": "stocks"
        },
        {
            "Title": "Fuel Price Drop Benefits Airlines Including IndiGo",
            "Summary": "Aviation fuel prices decline for second consecutive month, offering cost relief to airlines like IndiGo after extended period of elevated fuel expenses impacting operations.",
            "Sentiment": "positive",
            "PublishDate": 1769918738826,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo Cancels Flights to 4 Cities Till Feb 11",
            "Summary": "IndiGo suspended flights to Tbilisi, Almaty, Baku and Tashkent till February 11 due to escalating tensions around Iran, prioritizing passenger and crew safety amid regional security concerns.",
            "Sentiment": "neutral",
            "PublishDate": 1769516479813,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo launches Mumbai-Athens direct flights",
            "Summary": "IndiGo becomes first Indian carrier to operate direct flights between India and Greece, launching Mumbai-Athens route with Airbus A321XLR aircraft. Delhi-Athens service to begin January 24, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769188994000,
            "Source": "stocks"
        },
        {
            "Title": "InterGlobe Aviation Defers FY27 Growth Guidance",
            "Summary": "InterGlobe Aviation management states it's premature to provide FY2027 projections as summer schedule planning and CASK refinements remain incomplete during recent conference call.",
            "Sentiment": "neutral",
            "PublishDate": 1769137162350,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndiGo Q3 profit plunges 78% to ₹549 crore amid disruptions",
            "Summary": "India's largest airline reports weakest performance in four years due to exceptional costs of ₹1,546.5 crore from new labour codes and December flight cancellations. Company scales back growth outlook.",
            "Sentiment": "negative",
            "PublishDate": 1769098962518,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndiGo to surrender unused airport slots amid reset",
            "Summary": "IndiGo will return unutilised airport slots following DGCA's 10% flight schedule cut order after December operational disruptions that affected 300,000 passengers with 4,500 cancellations.",
            "Sentiment": "negative",
            "PublishDate": 1769093869920,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo CFO Reveals $10 Billion USD Exposure",
            "Summary": "IndiGo's Chief Financial Officer disclosed the airline's significant foreign exchange exposure of nearly $10 billion to the US Dollar, highlighting the company's substantial international financial commitments.",
            "Sentiment": "neutral",
            "PublishDate": 1769089064671,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo Co-CEO Expects No More Aviation Fines",
            "Summary": "IndiGo's Co-CEO expresses confidence that the airline will not face additional penalties from India's aviation regulator, signaling potential resolution of regulatory concerns.",
            "Sentiment": "positive",
            "PublishDate": 1769088808116,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo CFO: More Leased Aircraft Needed for Operations",
            "Summary": "IndiGo's CFO highlights the need for additional leased aircraft as ongoing Pratt & Whitney engine groundings continue to impact the airline's fleet availability and operational capacity.",
            "Sentiment": "negative",
            "PublishDate": 1769088776327,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo CFO Forecasts Cost Rise, Revenue Dip Ahead",
            "Summary": "IndiGo's CFO projects mid-single digit unit cost increase for FY26 excluding forex and fuel, while anticipating early to mid-single digit unit revenue decline in Q4.",
            "Sentiment": "neutral",
            "PublishDate": 1769088746132,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndiGo Plans Business Cabin Expansion to 65 Aircraft",
            "Summary": "IndiGo's Co-CEO announces strategic expansion of business cabin services across 65 aircraft, marking significant growth in premium segment offerings for India's largest airline.",
            "Sentiment": "positive",
            "PublishDate": 1769088601041,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo Plans 10% Capacity Growth in Q4 FY25",
            "Summary": "InterGlobe Aviation's IndiGo announces expected capacity expansion of approximately 10% for Q4 FY25 compared to the same quarter in the previous fiscal year, indicating continued growth trajectory.",
            "Sentiment": "positive",
            "PublishDate": 1769084709255,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo Reports Q3 Load Factor of 84.6%",
            "Summary": "IndiGo achieves 84.6% load factor in Q3 with available seat kilometers reaching 45.4 billion and yield of ₹5.33 per kilometer, demonstrating strong operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1769084682595,
            "Source": "co_actions_results"
        },
        {
            "Title": "Delhi HC seeks IndiGo affidavit on Dec flight chaos",
            "Summary": "Delhi High Court directs IndiGo to file affidavit on refunds and compensation for passengers affected by December flight disruptions. DGCA imposed ₹22.2 crore penalty on airline for operational lapses.",
            "Sentiment": "negative",
            "PublishDate": 1769079822904,
            "Source": "stocks"
        },
        {
            "Title": "Government to Seek IndiGo VP Dismissal Over Flight Chaos",
            "Summary": "Indian government announces it will ask Delhi court to direct IndiGo to dismiss a vice-president following flight disruption incidents that caused significant passenger inconvenience.",
            "Sentiment": "negative",
            "PublishDate": 1769078088361,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo faces regulatory scrutiny amid market dominance",
            "Summary": "IndiGo pledges compliance with pilot fatigue norms by February 10 after DGCA fine of ₹22.3 crore. Aviation sector's duopoly raises antitrust concerns with limited new entrants.",
            "Sentiment": "negative",
            "PublishDate": 1769047807121,
            "Source": "stocks"
        },
        {
            "Title": "Govt Plans to Remove Airfare Cap: IndiGo Impact",
            "Summary": "Government reportedly considering removal of airfare caps, potentially impacting airline pricing strategies and market dynamics for carriers like IndiGo.",
            "Sentiment": "neutral",
            "PublishDate": 1768980118529,
            "Source": "stocks"
        },
        {
            "Title": "Government May Remove Cap on IndiGo Operations",
            "Summary": "Reports suggest the government is considering removing operational caps imposed on IndiGo, India's largest airline by market share, potentially allowing expanded operations.",
            "Sentiment": "positive",
            "PublishDate": 1768980092813,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo Q3 earnings preview: Flight chaos impact",
            "Summary": "IndiGo faces investor scrutiny as Q3 earnings approach following December flight cancellations. Analysts expect one of the airline's worst quarters with 25% Ebitdar decline and ₹830 crore disruption costs.",
            "Sentiment": "negative",
            "PublishDate": 1768973666477,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndiGo Faces ₹22 Cr Penalty Over Pilot Shortage Issues",
            "Summary": "DGCA imposes ₹22 crore penalty on IndiGo for December operational chaos, while industry experts question airline's ability to meet pilot hiring commitments amid staffing challenges.",
            "Sentiment": "negative",
            "PublishDate": 1768836392982,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo shares surge 5% as Jefferies raises target",
            "Summary": "InterGlobe Aviation shares jumped 5% after Jefferies raised price target to ₹6,140 with 'Buy' rating, following DGCA's ₹22.20 crore fine for December disruptions. Focus shifts to schedule normalisation.",
            "Sentiment": "positive",
            "PublishDate": 1768816128269,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo Board Commits to Fix December 2025 Issues",
            "Summary": "InterGlobe Aviation acknowledges DGCA orders on December 2025 disruptions, with board promising systemic reforms and improved internal procedures following ₹22.20 crore penalty.",
            "Sentiment": "negative",
            "PublishDate": 1768793912710,
            "Source": "stocks"
        },
        {
            "Title": "DGCA Confirms IndiGo Refunds Fully Processed",
            "Summary": "Aviation regulator announces complete processing of refunds for IndiGo flight cancellations during December 3-5 disruptions. Airline offers additional ₹10,000 travel vouchers as gesture of care for affected passengers.",
            "Sentiment": "positive",
            "PublishDate": 1768556308795,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo Cancels 3 International Flights Due to Iran Airspace Closure",
            "Summary": "IndiGo cancelled three international flights on January 16 due to Iranian airspace closure amid US-Iran tensions. Air India's A350 also faced ground incident at Delhi airport with engine damage.",
            "Sentiment": "negative",
            "PublishDate": 1768493194547,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo Launches 'Sail into 2026' Sale Starting ₹1,499",
            "Summary": "IndiGo announces special fare sale with domestic flights from ₹1,499 and international from ₹4,499. Booking open January 13-16, 2026 for travel until April 30, 2026 across multiple routes.",
            "Sentiment": "positive",
            "PublishDate": 1768306418106,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo launches New Year sale with fares from ₹1,499",
            "Summary": "IndiGo announces 'Sail Into 2026' New Year sale offering domestic fares starting at ₹1,499 and international fares from ₹4,499. Sale valid for bookings from January 13-16 for travel between January 20 and April 30, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768288538386,
            "Source": "stocks"
        },
        {
            "Title": "InterGlobe Aviation Block Trade Worth ₹36.16 Crores",
            "Summary": "InterGlobe Aviation witnessed a significant NSE block trade of ₹36.16 crores involving approximately 75,650 shares at ₹4,780 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768283304195,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndiGo leads Airbus deliveries globally for 2nd year",
            "Summary": "IndiGo received 55 Airbus aircraft in 2025, representing 6.93% of total deliveries and maintaining its position as the largest single recipient of Airbus planes globally for the second consecutive year.",
            "Sentiment": "positive",
            "PublishDate": 1768239684155,
            "Source": "stocks"
        },
        {
            "Title": "Kotak Cuts IndiGo Target Price to ₹5,300 on Crude Concerns",
            "Summary": "Kotak Institutional Equities reduces IndiGo's target price from ₹5,350 to ₹5,300 citing crude oil and currency assumption changes, while maintaining 'add' rating despite regulatory scrutiny concerns.",
            "Sentiment": "neutral",
            "PublishDate": 1768185223105,
            "Source": "stocks"
        },
        {
            "Title": "DGCA Upholds ₹40L Penalty on IndiGo Executives",
            "Summary": "DGCA appellate authority rejects IndiGo's appeal, confirming ₹20 lakh penalty each on two senior executives for unqualified pilot training simulators at Category C airports.",
            "Sentiment": "negative",
            "PublishDate": 1767970533098,
            "Source": "stocks"
        },
        {
            "Title": "DGCA Reinstates ₹2 Million Fine on IndiGo Directors",
            "Summary": "DGCA Appellate Authority rejects IndiGo's appeal and reinstates ₹2 million penalty on directors for improper simulator use in pilot training programs.",
            "Sentiment": "negative",
            "PublishDate": 1767962452010,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo receives first Airbus A321 XLR aircraft",
            "Summary": "IndiGo becomes first Indian carrier to induct A321 XLR, deploying it for Athens flights. Aircraft features 8,700 km range with 195 seats in dual-class configuration.",
            "Sentiment": "positive",
            "PublishDate": 1767811290949,
            "Source": "stocks"
        },
        {
            "Title": "AAIB Recommends DGCA Inspect Airlines' Safety Systems",
            "Summary": "Aircraft Accident Investigation Bureau recommends DGCA inspection of airlines' safety management systems following airprox incident involving two IndiGo flights in Delhi airspace on November 17, 2023.",
            "Sentiment": "negative",
            "PublishDate": 1767807500553,
            "Source": "stocks"
        },
        {
            "Title": "CCI Probes IndiGo for Unfair Business Practices",
            "Summary": "Competition Commission seeks information from IndiGo and DGCA to assess potential anti-competitive practices following December flight cancellations that disrupted operations.",
            "Sentiment": "negative",
            "PublishDate": 1767806726442,
            "Source": "stocks"
        },
        {
            "Title": "DGCA Seeks Airline Fare Data After December Flight Chaos",
            "Summary": "DGCA mandates IndiGo, Air India, SpiceJet, and Akasa to provide average fare data following December disruptions when IndiGo cancelled 4,500 flights, causing fare surges and prompting government intervention.",
            "Sentiment": "negative",
            "PublishDate": 1767778411671,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo Set To Induct India's First Airbus A321 XLR",
            "Summary": "IndiGo becomes first Indian airline to induct Airbus A321 XLR, with aircraft landing Wednesday after 3 PM. Plans second A321 XLR by FY end for Delhi-Mumbai-Athens routes.",
            "Sentiment": "positive",
            "PublishDate": 1767765048104,
            "Source": "stocks"
        },
        {
            "Title": "InterGlobe Aviation Block Trade Worth ₹16.24 Crores",
            "Summary": "InterGlobe Aviation witnessed a significant NSE block trade of ₹16.24 crores involving 32,680 shares at ₹4,968.00 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767760530684,
            "Source": "co_actions_results"
        },
        {
            "Title": "InterGlobe Aviation Block Trade Worth ₹15.42 Crores",
            "Summary": "InterGlobe Aviation witnessed a significant block trade on NSE involving 30,620 shares at ₹5,035.00 per share, totaling ₹15.42 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1767684923305,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndiGo Confirms All Securities in Demat Form for Q3",
            "Summary": "InterGlobe Aviation reports 100% dematerialization of securities with no rematerialization requests received during quarter ended December 31, 2025, meeting SEBI compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1767620890135,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo completes one year in Puducherry operations",
            "Summary": "IndiGo marks one year of operations in Puducherry with 14 weekly flights connecting Bengaluru and Hyderabad, enhancing regional connectivity for healthcare, education and tourism.",
            "Sentiment": "positive",
            "PublishDate": 1767435327166,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo Launches ₹10,000 Compensation for Flight Delays",
            "Summary": "IndiGo introduces 'Gesture of Care' offering ₹10,000 vouchers to passengers affected by December 3-5 flight disruptions. Compensation available via vouchers or bank transfer.",
            "Sentiment": "neutral",
            "PublishDate": 1767365567743,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo Plans Athens Flights with A321XLR from Jan 2026",
            "Summary": "IndiGo announces non-stop flights to Athens starting January 23, 2026, using India's first Airbus A321XLR aircraft to expand medium-to-long-haul connectivity options.",
            "Sentiment": "positive",
            "PublishDate": 1767184750689,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo Reflects on 2025 Progress and Global Expansion",
            "Summary": "InterGlobe Aviation's IndiGo welcomed over 123 million customers in 2025, launched long-haul services to Europe, expanded to 139 destinations, and doubled A350 aircraft orders to 60 units.",
            "Sentiment": "positive",
            "PublishDate": 1767180235462,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo CEO Outlines Global Expansion Strategy for 2025",
            "Summary": "IndiGo advances its global airline strategy with 10 new international destinations, 30 new routes, and expects over 12.3 crore customers by year-end. CEO Pieter Elbers highlights network expansion despite operational challenges.",
            "Sentiment": "positive",
            "PublishDate": 1767178098039,
            "Source": "stocks"
        },
        {
            "Title": "IndiGo Opens Applications for A320 Captains & Officers",
            "Summary": "IndiGo launches recruitment drive for experienced Airbus A320 pilots, seeking Captains and Senior First Officers with valid ATPL licenses to comply with new FDTL norms and maintain operations.",
            "Sentiment": "positive",
            "PublishDate": 1767169863716,
            "Source": "stocks"
        },
        {
            "Title": "Aviation Ministry Reviews IndiGo Disruption Report",
            "Summary": "Civil Aviation Ministry analyzes probe panel report on IndiGo's massive flight disruptions from December, which led to over 1,600 flight cancellations and regulatory action including 10% schedule reduction.",
            "Sentiment": "neutral",
            "PublishDate": 1767100788236,
            "Source": "stocks"
        }
    ]
}