{
    "Symbol": "INDIQUBE",
    "ISIN": "INE06ST01018",
    "News": [
        {
            "Title": "Indiquube Board Meet on Feb 10 for Q3FY26 Results",
            "Summary": "Indiquube Spaces Limited has scheduled a board meeting on February 10, 2026, to consider and approve Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769701742259,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indiqube Expands to Bhubaneswar, Reaches 17 Cities",
            "Summary": "Indiqube Spaces strengthens its pan-India presence by expanding operations into Bhubaneswar, marking its entry into the 17th city across the country as part of its growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1768262804233,
            "Source": "stocks"
        },
        {
            "Title": "Indiqube Expands to Bhubaneswar, Reaches 17 Cities",
            "Summary": "Indiqube announces entry into Bhubaneswar market, expanding its presence to 17 cities across India in continued growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1768228367055,
            "Source": "stocks"
        },
        {
            "Title": "IndiQube Expands to Bhubaneswar, Reaches 17 Cities",
            "Summary": "IndiQube Spaces Limited announces expansion into Bhubaneswar with a 45,000 sq. ft. center in Patia, Infocity, marking its 17th city of operations and second location in East India after Kolkata.",
            "Sentiment": "positive",
            "PublishDate": 1768223527722,
            "Source": "stocks"
        },
        {
            "Title": "Indiqube Allots 19.54 Lakh Shares Under ESOP 2022",
            "Summary": "Indiqube Spaces Limited allotted 19,53,646 equity shares of ₹1 each under its Employee Stock Option Plan 2022 on December 22, 2025, following approval from the Nomination Remuneration Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1766418593526,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndiQube Spaces Reports 38% Revenue Growth and 74% EBITDA Jump in Q2 FY2026",
            "Summary": "IndiQube Spaces Limited reported strong quarterly results with revenue reaching INR 354 crores, representing 38% year-on-year growth. EBITDA increased 74% year-on-year to INR 75 crores, while PAT margins improved to 8% from 3% in the same period last year. The company operates 9.14 million square feet across 125 centers in 16 cities, with 5.8 million square feet as rent-yielding area. Occupancy levels rose to 87% from 81% in the previous quarter. Cash flow from operations more than doubled to INR 151 crores compared to INR 64 crores last year. Value-added services contribution increased from 11% to 13% of total revenue. The company signed a 1.4 lakh square feet workspace lease in Bangalore and secured a 68,000 square feet design and build project in Hyderabad. Monthly churn remains at 0.01% with 800-plus clients comprising 40% GCCs and 60% Indian enterprises. The company expects the remaining 3.34 million square feet of signed area to become operational within 18-24 months, projecting 30% revenue growth over the next two years.",
            "Sentiment": "positive",
            "PublishDate": 1763030566249,
            "Source": "earnings"
        },
        {
            "Title": "Indiqube Spaces Seeks Shareholder Approval to Expand into Solar Energy Business",
            "Summary": "Indiqube Spaces Limited has issued a postal ballot notice seeking shareholder approval through remote e-voting to amend its Memorandum of Association. The company proposes to add solar energy business activities as a new object clause, including generating, developing, manufacturing, distributing, installing, and servicing solar energy systems and photovoltaic solutions. The amendment would enable the company to provide turnkey solar solutions, EPC services, consultancy, and after-sales support for residential, commercial, and industrial applications. The Board approved this proposal on November 8, 2025, citing business diversification strategy and future expansion plans. The e-voting period runs from November 12, 2025, at 9:00 AM to December 11, 2025, at 5:00 PM, with results to be declared by December 13, 2025. The resolution requires approval by special resolution from shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1762782784038,
            "Source": "corporate_action"
        },
        {
            "Title": "Indiqube Spaces Reports IPO Fund Utilization of Rs 1,630.53 Million in Q2 2025",
            "Summary": "Indiqube Spaces Limited submitted its monitoring agency report for the quarter ended September 30, 2025, detailing the utilization of IPO proceeds. The company raised Rs 6,500 million through its IPO conducted from July 23-25, 2025. During the quarter, the company utilized Rs 1,630.53 million from the total proceeds. The funds were deployed across three main areas: Rs 53.41 million for capital expenditure towards establishing new centers (purchase of plant and machinery, furniture and fixtures), Rs 913.40 million for repayment of term loans, Rs 389.51 million for general corporate purposes (including rent, manpower supply, repair maintenance, and consumables), and Rs 274.21 million for issue expenses. The remaining unutilized gross proceeds of Rs 4,869.47 million are parked in fixed deposits and monitoring accounts. CRISIL Ratings Limited, serving as the monitoring agency, reported no deviations from the disclosed objects and confirmed that proceeds were utilized as per the offer document.",
            "Sentiment": "neutral",
            "PublishDate": 1762609568221,
            "Source": "corporate_action"
        },
        {
            "Title": "Indiqube Spaces Reports Record Half-Year Revenue of ₹668 Crores with Strong Profitability Growth",
            "Summary": "Indiqube Spaces Limited achieved its highest half-yearly revenue of ₹668 crores in H1 FY26, marking a 33% increase from ₹503 crores in H1 FY25. The company's profit after tax surged 283% to ₹47 crores compared to ₹12 crores in the previous year. EBITDA margin improved to 21% from 15% in H1 FY25. For Q2 FY26, revenue reached ₹354 crores (38% growth) with PAT of ₹28 crores (260% growth). The company expanded its footprint to 16 cities with 125 centers covering 9.14 million square feet of area under management. Key client wins included a 1.4 lakh sq.ft. workspace lease to the world's largest asset manager in Bangalore and a 68,000 sq.ft. Design Build project in Hyderabad. Operating cash flows improved to ₹151 crores with 96% of revenue being recurring. The company maintains an overall occupancy rate of 87% across its portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1762606774115,
            "Source": "earnings"
        },
        {
            "Title": "Indiqube Spaces Reports Quarterly Loss, Approves Solar Business Expansion",
            "Summary": "Indiqube Spaces Limited reported a net loss of Rs 589.58 million for the quarter ended September 30, 2025, compared to a loss of Rs 313.0 million in the same quarter last year. Revenue from operations increased to Rs 3,501.36 million from Rs 2,521.86 million year-over-year. The Board approved amendments to the company's Memorandum of Association to include solar energy business activities, covering generation, installation, and servicing of solar systems for residential, commercial, and industrial applications. The company will seek shareholder approval through a postal ballot for this business diversification. The company completed an IPO of 29,542,340 equity shares at Rs 675 per share, with shares listed on NSE and BSE in July 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762604171596,
            "Source": "earnings"
        },
        {
            "Title": "Indiqube Spaces Shareholders Approve Share Capital Reclassification and Employee Stock Option Plan Through Postal Ballot",
            "Summary": "Indiqube Spaces Limited successfully completed a postal ballot conducted through e-voting, with shareholders approving three key resolutions. The first resolution for reclassification of authorized share capital and alteration to the capital clause passed with 99.99% approval from 169 members representing 183.7 million votes. The second resolution ratifying the 'Indiqube-Employee Stock Option Plan 2022' received 93.35% support from 143 members with 171.5 million votes in favor. The third resolution for adoption of new articles of association was approved by 96.92% of votes from 159 members totaling 178.1 million votes. The e-voting period ran from August 16 to September 14, 2025, with scrutinizer Varsha V Shenoy of VVS & Associates overseeing the process. All three resolutions achieved the requisite majority for passage.",
            "Sentiment": "positive",
            "PublishDate": 1758038725731,
            "Source": "corporate_action"
        },
        {
            "Title": "IndiQube Spaces Reports 27% Revenue Growth and 98% EBITDA Jump in Q1 Results",
            "Summary": "IndiQube Spaces Limited reported revenue of Rs. 313 crores, marking 27% year-on-year growth for the quarter ended June 30, 2025. EBITDA surged 98% to Rs. 65 crores with margins improving to 21%. The integrated workspace solutions company achieved PAT of Rs. 18.5 crores, nearly tripling from the previous year, while ROE increased to 27%. The company operates 8.7 million sq ft across 120 centers in 15 cities with an occupancy rate of 85%. IndiQube serves 789 clients with a mix of 40% Global Capability Centers and 60% Indian companies. Management expects to maintain 30% year-on-year revenue growth and EBITDA margins around 21%. The company holds 21% market share in Bengaluru and has reduced geographic concentration from 90% to 65% in that city through expansion into new markets including Kolkata and Mohali.",
            "Sentiment": "positive",
            "PublishDate": 1755599290504,
            "Source": "earnings"
        },
        {
            "Title": "Indiqube Spaces Seeks Shareholder Approval for Share Capital Reclassification and ESOP Ratification",
            "Summary": "Indiqube Spaces Limited has issued a postal ballot notice seeking shareholder approval for three key resolutions through remote e-voting from August 16 to September 14, 2025. The company proposes to reclassify its authorized share capital from INR 32.5 crore comprising equity shares and preference shares to INR 32.5 crore consisting entirely of 32.5 crore equity shares of INR 1 each, following the conversion of all preference shares during its IPO. The company also seeks ratification of its Employee Stock Option Plan 2022, which allows granting up to 40.61 lakh stock options equivalent to 2.18% of paid-up equity capital to eligible employees. Additionally, shareholders will vote on adopting new Articles of Association by deleting redundant clauses from the existing framework. The company's shares are listed on BSE and NSE, with results to be declared by September 16, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755180161966,
            "Source": "corporate_action"
        },
        {
            "Title": "Indiqube Spaces Reports Record Quarterly Revenue of ₹313 Crores with Strong Profitability Growth",
            "Summary": "Indiqube Spaces Limited reported its highest-ever quarterly revenue of ₹313 crores for the quarter ended June 30, 2025, with 98% being recurring revenue. The company's PAT increased to ₹18.5 crores, while EBITDA reached ₹65 crores with a margin of 21%. The company's ROE improved to 27% compared to 13% in the same quarter last year. Operationally, Indiqube expanded its footprint to 8.70 million sq.ft. across 120 centers in 15 cities, maintaining an occupancy rate of 85%. The company serves 789 clients with over 193,000 seats available. The Board approved unaudited financial statements, appointed Singhvi Dev and Unni LLP as internal auditors for FY 2025-26, and approved designation changes for three senior management personnel. The company also announced plans for a postal ballot to seek shareholder approval on matters including reclassification of authorized share capital and ratification of employee stock option plans.",
            "Sentiment": "positive",
            "PublishDate": 1755015485603,
            "Source": "earnings"
        },
        {
            "Title": "Indiqube Spaces Reports Narrowed Q1 Loss Despite Revenue Growth",
            "Summary": "Indiqube Spaces reported a net loss of 368 million rupees in Q1, an improvement from the 420 million rupee loss in the same period last year. The company's revenue increased to 3.1 billion rupees from 2.4 billion rupees year-over-year. EBITDA rose to 1.9 billion rupees compared to 1.4 billion rupees previously, with EBITDA margin improving to 60.81% from 59.47%.",
            "Sentiment": "positive",
            "PublishDate": 1755009785087,
            "Source": "earnings"
        }
    ]
}