{
    "Symbol": "INDIGOPNTS",
    "ISIN": "INE09VQ01012",
    "News": [
        {
            "Title": "Indigo Paints Q3FY26 Earnings Call Set for Feb 16",
            "Summary": "Indigo Paints Limited has scheduled its Q3FY26 results conference call for February 16, 2026, at 11:00 AM IST to discuss quarterly and nine-month performance with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1769768285448,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indigo Paints Gets ESG Score of 62.8 from SES ESG Research",
            "Summary": "Indigo Paints Limited receives an independent ESG score of 62.8 from SEBI-registered ESG Rating Provider SES ESG Research Pvt Ltd, disclosed under regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1769671345835,
            "Source": "stocks"
        },
        {
            "Title": "Indigo Paints Board Meet Set for Feb 13 for Q3FY26 Results",
            "Summary": "Indigo Paints Limited has scheduled its board meeting for February 13, 2026, to consider and approve Q3FY26 unaudited standalone and consolidated financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768299769681,
            "Source": "co_actions_results"
        },
        {
            "Title": "Motilal Oswal Maintains Buy on Indigo Paints at ₹1,450",
            "Summary": "Motilal Oswal maintains BUY recommendation on Indigo Paints with ₹1,450 target despite expecting slower 14% CAGR for FY26-FY28E due to rising competition and industry demand recovery challenges.",
            "Sentiment": "neutral",
            "PublishDate": 1767066686704,
            "Source": "stocks"
        },
        {
            "Title": "Indigo Paints Receives ESG Score of 65 from CFC Finlease Private Limited",
            "Summary": "CFC Finlease Private Limited, a SEBI licensed ESG Rating Provider, independently assigned an ESG score of 65 to Indigo Paints Limited based on publicly available data. The company clarified it did not engage CFC Finlease for this rating, which was conducted independently and disclosed through BSE on December 9, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765282905221,
            "Source": "stock"
        },
        {
            "Title": "Indigo Paints Faces INR 19.26 Crore GST Demand on IPO-Related Expenses",
            "Summary": "Indigo Paints received a GST demand order of INR 19.26 crores including interest and penalty from the Assistant Commissioner of State Tax, Pune, related to input tax credit availed on IPO expenses. The company plans to file an appeal with the Goods and Service Tax Appellate Tribunal and states there is no immediate impact on its financial or operational activities.",
            "Sentiment": "negative",
            "PublishDate": 1763794896545,
            "Source": "stock"
        },
        {
            "Title": "Indigo Paints Clarifies 20% Stock Rally as Market-Driven with No Undisclosed Information",
            "Summary": "Indigo Paints stated that its stock's 20% gain over two days is market-driven with no undisclosed price-sensitive information to share. The stock extended its rally for a third day, closing 4% higher at Rs 1,202.55 with trading volume of Rs 161 crore. The company's market capitalization reached Rs 5,745 crore. September-quarter results showed revenue up 4.2% to Rs 312 crore, net profit increased 11% to Rs 25 crore, and EBITDA rose 12% to Rs 46.5 crore with margins improving to 14.9%. Nuvama Institutional Equities noted this was the company's highest revenue growth in four quarters and best EBITDA growth in six quarters, with brokerages citing improving margins, steady demand recovery and operational gains.",
            "Sentiment": "positive",
            "PublishDate": 1762866071405,
            "Source": "stock"
        },
        {
            "Title": "Indigo Paints Reports 3.5% Revenue Growth in Q2 FY26 Amid Extended Monsoon Challenges",
            "Summary": "Indigo Paints Limited reported standalone revenue of INR 298.5 crores for Q2 FY26, marking a 3.5% year-on-year growth despite extended monsoon conditions. The company's gross margins expanded to 45.1% from 44.1% in the same quarter last year, while EBITDA margin improved to 15.3% from 14.8%. Profit after tax stood at INR 25.5 crores with an 8.5% PAT margin. The quarter began strongly in July but sales slowed in August before recovering in September. Management highlighted unprecedented levels of dealer money inflows and token scanning by painters, indicating strong secondary sales. The company added 8 more Indigo Color Canvas experiential retail stores during the quarter and continues to expand its dealer network to over 18,900 active dealers with more than 11,650 tinting machines. Subsidiary Apple Chemie delivered strong performance with 22.6% revenue growth to INR 13.6 crores. Management expressed optimism about demand recovery, citing favorable factors including good monsoon leading to bumper harvest, RBI rate cuts, government income tax reductions, and lower GST rates on household items.",
            "Sentiment": "positive",
            "PublishDate": 1762858317183,
            "Source": "earnings"
        },
        {
            "Title": "Indigo Paints Expands to 2,000+ Tier-3 and Tier-4 Towns, Targets 15% Annual Volume Growth",
            "Summary": "Indigo Paints has expanded its distribution network to over 2,000 tier-3 and tier-4 towns. The company plans to achieve 15% annual volume growth supported by a premium product mix and new manufacturing plants in South India. The growth strategy includes focus on automation, enhanced brand visibility, and innovation in waterproofing and industrial coatings segments.",
            "Sentiment": "positive",
            "PublishDate": 1762440744404,
            "Source": "stock"
        },
        {
            "Title": "Indigo Paints Reports 3.5% Revenue Growth in Q2 with Margin Expansion",
            "Summary": "Indigo Paints Limited announced quarterly results for the quarter ended September 30, 2025. On a standalone basis, net revenue from operations increased 3.5% to Rs 298.5 crores compared to Rs 288.5 crores in the same quarter last year. EBITDA grew 7.5% to Rs 45.8 crores from Rs 42.6 crores, while net profit rose 5.8% to Rs 25.5 crores from Rs 24.1 crores. On a consolidated basis, revenue increased 4.2% to Rs 312.1 crores, EBITDA jumped 12.1% to Rs 46.5 crores, and net profit grew 13.5% to Rs 25.2 crores. The company maintained industry-leading gross margins, which expanded from 44.1% to 45.1% year-on-year despite extended monsoon activity. EBITDA margin improved from 14.8% to 15.3%, with PAT margin at 8.5%. The subsidiary Apple Chemie recorded 22.6% growth. For the half-year period, standalone revenue grew 1.9% to Rs 582.5 crores with net profit increasing 2.6% to Rs 51.9 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762430663491,
            "Source": "earnings"
        },
        {
            "Title": "Indigo Paints Schedules Q2FY26 Results Conference Call for November 7, 2025",
            "Summary": "Indigo Paints Limited has announced an earnings conference call scheduled for November 7, 2025 at 11:00 AM IST to discuss quarterly results ended September 30, 2025. The call will be hosted by ICICI Securities and feature key management including Chairman Managing Director Hemant Jalan, Chief Operating Officer T.S. Suresh Babu, Chief Financial Officer Chetan Humane, and GM-Finance Investor Relations Srihari Santhakumar. The session will begin with management discussion on quarterly and half-year results followed by a Q&A session with investors and analysts. Audio recording and transcript will be made available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1762170063330,
            "Source": "earnings"
        },
        {
            "Title": "InterGlobe Aviation Sees Rs. 78.85 Crore Block Trade on NSE",
            "Summary": "InterGlobe Aviation executed a block trade worth Rs. 78.85 crores on the National Stock Exchange. The transaction involved approximately 135,878 shares at a price of Rs. 5,803.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1761634683145,
            "Source": "order&deals"
        },
        {
            "Title": "Indigo Paints Reports Flat Growth in Q1 FY26 Amid Early Monsoon Challenges",
            "Summary": "Indigo Paints achieved minimal standalone revenue growth of 0.3% in Q1 FY26, reaching INR295 crores compared to the previous year. The company maintained its gross margin at 46.1% but saw EBITDA decline 4.7% to INR43.6 crores, with margins dropping to 14.8% from 15.6% in the prior year. PAT remained largely flat at INR26.4 crores with an 8.8% margin. Early monsoon onset from mid-May through June significantly impacted sales, particularly in Kerala and Northeast regions. The enamel and primer categories showed positive growth in both volume and value terms, while emulsions and putty experienced declines. Apple Chemie subsidiary registered a 17.6% revenue decline due to monsoon-affected infrastructure projects. The company expanded its dealer network to 18,600 active dealers and 11,300 tinting machines. Management noted improved demand recovery in July and expects better performance in Q2, citing positive trends in other FMCG sectors as encouraging indicators for paint demand recovery.",
            "Sentiment": "neutral",
            "PublishDate": 1755013377506,
            "Source": "earnings"
        },
        {
            "Title": "Indigo Paints Reports Flat Growth in Q1 FY26 as Early Monsoon Disrupts Operations",
            "Summary": "Indigo Paints recorded revenue of Rs. 294.9 crore with minimal 0.3% year-over-year growth in Q1 FY26, impacted by early monsoon disruption. The company maintained its industry-leading gross margin at 46.1% despite challenges. EBITDA margin declined to 14.8% from 15.6% in the previous year, while PAT margin remained stable at 8.8%. The waterproofing and construction chemicals segment was the main growth contributor. The company reduced advertising and promotional expenses to 6.8% of revenue from 7.2% previously, while maintaining IPL sponsorship for brand visibility. Raw material prices remained largely stable with a downward bias, except for Titanium Dioxide affected by import duties. The company continues network expansion with 18,556 active dealers and 11,301 tinting machines deployed. Management expects gradual improvement in Q2 following a positive July, with EBITDA margins anticipated to improve for FY26 due to better demand, lower raw material prices, and improved product mix.",
            "Sentiment": "neutral",
            "PublishDate": 1754580471365,
            "Source": "earnings"
        },
        {
            "Title": "Indigo Paints Launches '2.0 Strategy' for Long-Term Growth and EBITDA Margin Improvement",
            "Summary": "Indigo Paints has launched its '2.0 Strategy' targeting long-term growth through multiple initiatives. The strategy includes capacity expansion, focusing on tier-2 and tier-3 cities, establishing new manufacturing plants, entering construction chemicals segment, and implementing digital marketing. The company aims to improve its EBITDA margin by FY26-FY27 through these strategic measures.",
            "Sentiment": "positive",
            "PublishDate": 1754579931381,
            "Source": "stock"
        },
        {
            "Title": "Indigo Paints Reports Decline in Q1 EBITDA and Margin",
            "Summary": "Indigo Paints reported Q1 EBITDA of 443 million rupees, down from 474 million rupees in the same period last year. The company's EBITDA margin also decreased to 14.35% from 15.23% year-over-year, indicating reduced profitability compared to the previous year's first quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754573559108,
            "Source": "earnings"
        },
        {
            "Title": "Indigo Paints Reports Marginal Decline in Quarterly Profit and Revenue",
            "Summary": "Indigo Paints reported a consolidated net profit of 259 million rupees compared to 262 million rupees in the same quarter last year, representing a slight year-over-year decrease. The company's quarterly revenue was 3.1 billion rupees versus 3.11 billion rupees in the corresponding period last year, showing minimal decline in top-line performance.",
            "Sentiment": "neutral",
            "PublishDate": 1754571389418,
            "Source": "earnings"
        },
        {
            "Title": "Indigo Paints Appoints Narayanankutty Kottiedath Venugopal as Additional Executive Director",
            "Summary": "Indigo Paints Limited appointed Mr. Narayanankutty Kottiedath Venugopal as Additional Executive Director for a five-year term beginning June 1, 2025. The appointment was approved by the Board of Directors following recommendation from the Nomination & Remuneration Committee and is subject to shareholder approval at the upcoming Annual General Meeting. Mr. Venugopal, aged 76, brings over 42 years of experience in the paint industry. He holds a B.Sc. in Mechanical Engineering from the University of Kerala and PGDM from Indian Institute of Management, Calcutta. His professional background includes previous associations with Asian Paints Limited, Hi-Build Coatings Private Limited, and serving as Deputy General Manager at Sadolin Paints (Oman) Ltd in Muscat from 1990 to 2003.",
            "Sentiment": "positive",
            "PublishDate": 1753364876074,
            "Source": "corporate_governance"
        },
        {
            "Title": "IndiGo Ventures: Raises Rs 450 Crore, Invests in Jeh Aerospace",
            "Summary": "IndiGo Ventures announces first close of its maiden fund at Rs 450 crore. The fund makes its first investment in Hyderabad-based aerospace startup Jeh Aerospace. Jeh Aerospace will use the investment to scale manufacturing, enhance AI-driven production, and attract talent.",
            "Sentiment": "positive",
            "PublishDate": 1752071726000,
            "Source": "normal_news"
        },
        {
            "Title": "Indigo Paints: Peak XV Partners Exits with Rs 158 Crore Stake Sale",
            "Summary": "Peak XV Partners (formerly Sequoia Capital India & SEA) has fully exited Indigo Paints by selling its entire 3.18% stake for Rs 158 crore through open market transactions. The shares were sold at an average price of Rs 1,046.45 per share. Kotak Mahindra Mutual Fund acquired the shares on the NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1748620239000,
            "Source": "block_deals"
        },
        {
            "Title": "Indigo Paints: Q4 FY25 Shows Marginal Growth Amid Sluggish Demand",
            "Summary": "Indigo Paints reported a 0.3% YoY increase in Q4 FY25 net sales to Rs 3.7 billion. Gross margin contracted by 180 bps YoY to 47.4%. Increases in raw material and employee expenses were offset by a decline in other expenses.",
            "Sentiment": "neutral",
            "PublishDate": 1748346531000,
            "Source": "earnings"
        },
        {
            "Title": "Indigo Paints to Consider Q4 Results on May 24",
            "Summary": "Indigo Paints has announced that it will consider its fourth quarter (Q4) financial results on May 24. This is a standard corporate procedure where the company's board will review and potentially approve the financial statements for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745415371000,
            "Source": "default"
        },
        {
            "Title": "Indigo Paints: Dolat Capital Upgrades Rating, Lowers Target Price",
            "Summary": "Dolat Capital has upgraded Indigo Paints to 'Accumulate' rating while lowering the target price. The brokerage expects Indigo Paints to continue outperforming peers due to low base and penetration opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1739266090000,
            "Source": "normal_news"
        },
        {
            "Title": "Indigo Paints Reports Decrease in Q3 Revenue",
            "Summary": "Indigo Paints has reported a decrease in its third-quarter revenue. The company's revenue for Q3 stood at 3.4 billion rupees, compared to 3.54 billion rupees in the same period last year, indicating a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1739177926000,
            "Source": "earnings"
        },
        {
            "Title": "Indigo Paints Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Indigo Paints has reported its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 572 million rupees from 622 million rupees in the same quarter last year. Additionally, the EBITDA margin declined to 16.69% from 17.59% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739177781000,
            "Source": "earnings"
        },
        {
            "Title": "Indigo Paints Reports Slight Decline in Q3 Net Profit",
            "Summary": "Indigo Paints has reported a consolidated net profit of 360 million rupees for the third quarter, compared to 373 million rupees in the same period last year. This represents a slight year-over-year decrease in profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1739177717000,
            "Source": "earnings"
        },
        {
            "Title": "Indigo Paints: Share Price Dips 1.04% Amid Market Gains",
            "Summary": "Indigo Paints shares are trading at ₹1415.9, down 1.04% on November 29, 2024. The stock has underperformed the broader market, with Nifty up 0.78% and Sensex up 0.93%. Trading volume is 27.67% lower than the previous session. Technical analysis suggests a bearish trend.",
            "Sentiment": "negative",
            "PublishDate": 1732858894000,
            "Source": "normal_news"
        },
        {
            "Title": "Indigo Paints: Share Price Dips Amid Market Downturn",
            "Summary": "Indigo Paints shares are trading at ₹1449.55, down 0.64% on November 28, 2024. The stock has hit a high of ₹1462.25 and a low of ₹1440.2. Trading volume is 66.62% lower than the previous session. Mutual fund holding increased to 14.89% and FII holding to 12.31% in the September quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1732773548000,
            "Source": "normal_news"
        },
        {
            "Title": "Indigo Paints: Stock Down 1.46% Amid Mixed Market",
            "Summary": "Indigo Paints shares are trading at ₹1463.45, down 1.46% on November 27, 2024. The stock has hit a high of ₹1502.95 and a low of ₹1454.95. Trading volume is 19.38% lower than the previous session. Mutual fund holding increased to 14.89% and FII holding to 12.31% in the September quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1732686740000,
            "Source": "normal_news"
        },
        {
            "Title": "Indigo Paints: Share Price Rises 0.58% Amid Market Downturn",
            "Summary": "Indigo Paints shares are trading at ₹1479.8, up 0.58% on November 26, 2024, while Nifty and Sensex are down. The stock has seen increased institutional holdings, with MF holding rising to 14.89% and FII holding to 12.31% in the September quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1732600748000,
            "Source": "normal_news"
        },
        {
            "Title": "Indigo Paints: Share Price Dips Amid Market Rally",
            "Summary": "Indigo Paints shares down 1.06% to ₹1487.15 on November 25, 2024, despite Nifty and Sensex gains. Stock shows potential reversal signs after uptrend. Significant increase in MF and FII holdings reported in September quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1732514339000,
            "Source": "normal_news"
        },
        {
            "Title": "Indigo Paints: Share Price Up 1.03% Amid Mixed Market",
            "Summary": "Indigo Paints shares trading at ₹1510.55, up 1.03%. Stock above 5,100,300 days SMA but below 10,20,50 day SMA. Volume traded 69.74% lower than previous session. MF holding increased to 14.89% and FII holding to 12.31% in September quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1732256574000,
            "Source": "normal_news"
        },
        {
            "Title": "Indigo Paints: Q2 Profitability Misses Estimates",
            "Summary": "Indigo Paints' Q2 results fell short of profitability expectations. Dolat Capital maintains a 'Reduce' rating on the stock.",
            "Sentiment": "negative",
            "PublishDate": 1731311950000,
            "Source": "result"
        },
        {
            "Title": "IndiGo Paints Reports Q2 Revenue Growth",
            "Summary": "IndiGo Paints has announced its second quarter revenue for the current fiscal year. The company reported revenue of 2.99 billion rupees, compared to 2.79 billion rupees in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730965451000,
            "Source": "result"
        },
        {
            "Title": "Indigo Paints Reports Q2 Net Profit Decline",
            "Summary": "Indigo Paints announced its Q2 consolidated net profit of 226 million rupees, down from 253 million rupees in the same quarter last year, indicating a year-over-year decrease in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1730965405000,
            "Source": "result"
        },
        {
            "Title": "Indigo Paints: Share Price Dips Amid Market Downturn",
            "Summary": "Indigo Paints shares are trading at ₹1626, down 0.74% from the previous close. The stock has hit a high of ₹1647.75 and a low of ₹1603.25 today. Trading volume is 14.72% lower than the previous session. FII holding increased from 8.28% in June to 12.31% in September.",
            "Sentiment": "neutral",
            "PublishDate": 1730958181000,
            "Source": "normal_news"
        }
    ]
}