{
    "Symbol": "INDIASHLTR",
    "ISIN": "INE922K01024",
    "News": [
        {
            "Title": "India Shelter Finance Grants 562,386 Stock Options",
            "Summary": "India Shelter Finance Corporation Limited has granted 562,386 stock options to eligible employees under its ESOP 2025 scheme, with options exercisable within 5 years and 3 months from first vesting date.",
            "Sentiment": "positive",
            "PublishDate": 1770479125702,
            "Source": "co_actions_results"
        },
        {
            "Title": "India Shelter Finance Allots 7,568 ESOP Shares",
            "Summary": "India Shelter Finance Corporation allotted 7,568 equity shares under ESOP schemes, increasing paid-up capital to Rs. 54,32,59,895 with 10,86,51,979 total equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1770475475705,
            "Source": "co_actions_results"
        },
        {
            "Title": "India Shelter Finance Reports Strong Q3FY26 Results",
            "Summary": "India Shelter Finance Corporation posted robust Q3FY26 results with profit rising 29.19% YoY to ₹12,393.91 lakhs. Board approved ₹1,000 crore NCD issuance and promoter reclassification.",
            "Sentiment": "positive",
            "PublishDate": 1770457274521,
            "Source": "co_actions_results"
        },
        {
            "Title": "India Shelter Finance Board Meet on Feb 7 for Q3 Results",
            "Summary": "India Shelter Finance Corporation has scheduled a board meeting on February 07, 2025, to consider Q3FY26 unaudited financial results and approve NCD issuance. Trading window remains closed until 48 hours post-results.",
            "Sentiment": "neutral",
            "PublishDate": 1769752251438,
            "Source": "co_actions_results"
        },
        {
            "Title": "India Shelter Finance Receives Promoter Reclassification Requests",
            "Summary": "India Shelter Finance Corporation Limited received requests from 15 promoter and promoter group entities seeking reclassification to public category under SEBI regulations on December 16, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765884151686,
            "Source": "stocks"
        },
        {
            "Title": "IndiaShelter Finance Allots 76,836 Equity Shares Under ESOP Schemes",
            "Summary": "IndiaShelter Finance Corporation allotted 76,836 equity shares of Rs. 5 each following employee stock option exercises under its ESOP 2021 and ESOP 2023 schemes. The company's paid-up share capital increased from Rs. 542,600,900 to Rs. 542,985,080, with total equity shares rising to 108,597,016.",
            "Sentiment": "neutral",
            "PublishDate": 1764671220422,
            "Source": "corporate_action"
        },
        {
            "Title": "IndiaShelter Finance Allots ₹1,500 Crore Non-Convertible Debentures at 7.85% Interest",
            "Summary": "IndiaShelter Finance Corporation has allotted 15,000 non-convertible debentures worth ₹1,500 crores with a 7.85% annual interest rate and 60-month tenure through private placement. The secured debentures will be listed on BSE, with quarterly interest and principal payments, and are backed by first charge on standard receivables with minimum asset cover of 1.10 times.",
            "Sentiment": "positive",
            "PublishDate": 1764222568839,
            "Source": "corporate_action"
        },
        {
            "Title": "IndiaShelter Finance Gets Credit Rating Re-affirmation and New NCD Programme Rating from ICRA",
            "Summary": "ICRA Limited re-affirmed IndiaShelter Finance Corporation's Long Term Fund Based-Term Loan rating at ICRA AA-(Stable) for Rs. 3000.00 crore and assigned the same rating to a new NCD programme worth Rs. 180 crore. The ratings indicate strong creditworthiness and provide the housing finance company with enhanced borrowing capabilities for business expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1763729103363,
            "Source": "corporate_action"
        },
        {
            "Title": "IndiaShelter Finance Allots 112,768 Equity Shares Under Employee Stock Option Plans",
            "Summary": "IndiaShelter Finance Corporation Limited allotted 112,768 equity shares of Rs. 5 each following the exercise of employee stock options under its ESOP schemes. The allotment included 99,645 shares under the ESOP 2021 scheme and 13,123 shares under the ESOP 2023 scheme. The company's paid-up share capital increased from Rs. 542,037,060 (108,407,412 equity shares) to Rs. 542,600,900 (108,520,180 equity shares). The exercise prices ranged from Rs. 154.80 to Rs. 207.71 for the 2021 scheme and Rs. 199 for the 2023 scheme. The newly allotted shares will rank equally with existing equity shares and the company is completing formalities for listing these shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763022721694,
            "Source": "corporate_action"
        },
        {
            "Title": "India Shelter Finance Reports 31% AUM Growth, Maintains Asset Quality Despite Industry Challenges",
            "Summary": "India Shelter Finance Corporation delivered strong quarterly results with AUM reaching Rs. 9,252 crores, representing 31% year-on-year growth. The company disbursed Rs. 931 crores in Q2 FY26, marking 12% growth, and expanded its network by adding 9 new branches to reach 299 total branches. Net profit increased 35% year-on-year to Rs. 122 crores with return on equity at 17%. Asset quality metrics remained stable with gross Stage-3 at 1.2% and net Stage-3 at 0.9%, unchanged from the previous year. The company maintained its guidance of 30-35% loan growth, spreads above 6%, and credit costs of 40-50 basis points. Management noted some seasonal challenges in Q2 due to rains and GST implementation delays but expects improved momentum in the second half. The company operates primarily in Tier-2 and Tier-3 cities, focusing on self-employed customers in the affordable housing segment. Cost of funds decreased by 10 basis points to 8.5% with expectations of further 20 basis points reduction by year-end. The Board approved ESOP schemes for branch managers covering approximately 500 employees.",
            "Sentiment": "positive",
            "PublishDate": 1762891816031,
            "Source": "earnings"
        },
        {
            "Title": "IndiaShelter Finance Grants 13.73 Lakh Stock Options to Employees Under ESOP 2025",
            "Summary": "IndiaShelter Finance Corporation Limited granted 13,73,500 stock options with a face value of Rs. 5 each to eligible employees under its Employee Stock Option Scheme 2025. The grant was approved by the Nomination and Remuneration Committee on November 4, 2025. The options can be exercised within 5 years and 3 months from the date of first vesting as per the ESOP 2025 scheme. The scheme complies with SEBI regulations for share-based employee benefits. The options are yet to be exercised, so no diluted earnings per share impact has been calculated.",
            "Sentiment": "positive",
            "PublishDate": 1762302100471,
            "Source": "corporate_action"
        },
        {
            "Title": "IndiaShelter Finance Reports 31% AUM Growth to Rs. 9,252 Crores in Q2FY26",
            "Summary": "IndiaShelter Finance Corporation delivered strong quarterly results with Assets Under Management growing 31% year-on-year to Rs. 9,252 crores. The company reported disbursements of Rs. 1,817 crores, up 12% year-on-year. Profit after tax increased 35% to Rs. 122 crores compared to Rs. 90 crores in the same quarter last year. Net income grew 30% year-on-year to Rs. 260 crores. The company maintained asset quality with gross Stage 3 assets at 1.2% and net Stage 3 at 0.9%. Return on Assets stood at 5.8% while Return on Equity reached 17.0%. The company expanded its network by adding 9 new branches during the quarter, bringing total locations to 299 across 15 states. Cost of funds improved by 10 basis points quarter-on-quarter to 8.5%, while spreads expanded to 6.4%. The company maintains a liquidity buffer of Rs. 2,082 crores and continues to focus on affordable home loans for underserved segments in Tier 2 and 3 cities.",
            "Sentiment": "positive",
            "PublishDate": 1762270925700,
            "Source": "earnings"
        },
        {
            "Title": "India Shelter Finance Targets 30%+ AUM Growth Through Branch Expansion and Technology",
            "Summary": "India Shelter Finance aims to achieve sustained AUM growth of over 30% through branch expansion, technology-driven underwriting, and deeper penetration in Tier-II and Tier-III markets. The company maintains strong asset quality with gross NPA below 1.2% and holds an AA- rating to support its affordable housing growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1762267789968,
            "Source": "stock"
        },
        {
            "Title": "IndiaShelter Finance Reports Strong Q2 Results and Initiates Voluntary Liquidation of Subsidiary",
            "Summary": "IndiaShelter Finance Corporation Limited announced its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company reported a net profit after tax of ₹24,106.40 lakhs for the half year. Key financial metrics include a net profit margin of 33.02%, gross NPA ratio of 1.25%, and net NPA ratio of 0.94%. The company maintains 110% security cover on its secured listed non-convertible debentures. Additionally, the Board approved the voluntary liquidation of its wholly owned subsidiary, IndiaShelter Capital Finance Limited, as a solvent company under the Insolvency and Bankruptcy Code, 2016. The subsidiary has no business operations and its liquidation will not have any material impact on the company's consolidated financials. During the half year, 4,61,535 equity shares were allotted to employees under the stock option plan.",
            "Sentiment": "positive",
            "PublishDate": 1762256750512,
            "Source": "earnings"
        },
        {
            "Title": "IndiaShelter Finance Revises Earnings Call Time for Q2FY26 Results Discussion",
            "Summary": "IndiaShelter Finance Corporation Limited has revised the timing of its earnings conference call scheduled for November 4, 2025. The call time has been changed from 6:00 PM to 6:30 PM IST to discuss the company's financial and operational performance for the quarter ended September 30, 2025. The conference call will be represented by MD & CEO Rupinder Singh, CFO Ashish Gupta, and Head of Investor Relations Rahul Rajagopalan. ICICI Securities is coordinating the call, which will include universal access numbers and international toll-free numbers for participants from Hong Kong, Singapore, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1761919556109,
            "Source": "earnings"
        },
        {
            "Title": "India Shelter Finance Reports 43% PAT Growth in Q1FY26, AUM Reaches Rs 8,712 Crores",
            "Summary": "India Shelter Finance Corporation delivered strong quarterly results with profit after tax rising 43% year-on-year to Rs 119 crores and 10% quarter-on-quarter. Assets under management grew 34% year-on-year to Rs 8,712 crores, while disbursements increased 24% to Rs 887 crores. Return on equity improved to 17.2%, crossing 17% for the first time post listing. The company added 24 new branches, bringing total presence to 290 branches. However, asset quality showed some stress with 30-plus days past due rising to 4.5% due to seasonal factors and macro conditions. Stage 3 assets increased to 1.2%, up 10 basis points year-on-year. Management maintained guidance of 30-35% loan growth, 40-50 basis points credit cost, and spreads above 6%. Cost of funds decreased by 10 basis points to 8.6% with expectations of further 20 basis points reduction by year-end. The company expects to maintain 60-40 split between home loans and loan against property products.",
            "Sentiment": "positive",
            "PublishDate": 1755082669174,
            "Source": "earnings"
        },
        {
            "Title": "India Shelter Finance Corp Board Approves NCD Issuance Worth Up to ₹10 Billion",
            "Summary": "India Shelter Finance Corp's board has approved the issuance of Non-Convertible Debentures (NCDs) worth up to ₹10 billion. This approval enables the company to raise funds through debt instruments in the capital markets.",
            "Sentiment": "positive",
            "PublishDate": 1754571545165,
            "Source": "corporate_action"
        },
        {
            "Title": "India Shelter Finance Reports 43% Jump in Quarterly Profit, Approves Rs 1,000 Crore NCD Issuance",
            "Summary": "India Shelter Finance Corporation reported a standalone profit of Rs 1,192.35 crores for the quarter ended June 30, 2025, marking a 43% increase from Rs 833.30 crores in the same quarter last year. Total income rose to Rs 3,610.26 crores from Rs 2,604.45 crores year-on-year. The company's Board approved raising up to Rs 1,000 crores through Non-Convertible Debentures via private or public placement. Key financial metrics showed a net worth of Rs 28,343.89 crores, debt-equity ratio of 1.84 times, and gross NPA ratio of 1.24%. The company transferred 3,282 loan accounts worth Rs 2,588.73 crores through assignment and 689 accounts worth Rs 726.38 crores through co-lending during the quarter. Earnings per share stood at Rs 11.05 on a basic basis.",
            "Sentiment": "positive",
            "PublishDate": 1754567469289,
            "Source": "earnings"
        },
        {
            "Title": "India Shelter Finance Corporation Schedules Board Meeting for Q2 Results and Fundraising Plans",
            "Summary": "India Shelter Finance Corporation Limited has scheduled a Board of Directors meeting for August 07, 2025. The board will consider and approve unaudited financial results for the quarter ended June 30, 2025, including both standalone and consolidated results with a limited review report. The meeting will also address raising funds through the issuance of Non-Convertible Debentures in one or more tranches based on business requirements. The trading window for company securities remains closed for all designated persons from July 01, 2025, until 48 hours after the financial results are disseminated.",
            "Sentiment": "neutral",
            "PublishDate": 1753945352622,
            "Source": "corporate_action"
        },
        {
            "Title": "India Shelter Finance Corporation Approves Employee Stock Option Scheme and Key Leadership Appointments",
            "Summary": "India Shelter Finance Corporation Limited's 27th Annual General Meeting approved several key resolutions. The company approved an Employee Stock Option Scheme 2025 covering up to 26,60,000 equity shares for eligible employees, to be granted in tranches as determined by the Board and Nomination and Remuneration Committee. The shareholders re-appointed Mr. Rupinder Singh as Managing Director & CEO for five consecutive years effective November 23, 2025. Additionally, Mr. Jitender Singh, a practicing Company Secretary with 13 years of experience, was appointed as Secretarial Auditor for five years starting from Financial Year 2025-26. The ESOP scheme complies with SEBI regulations and will be implemented to benefit eligible employees of the company.",
            "Sentiment": "positive",
            "PublishDate": 1753727525248,
            "Source": "corporate_action"
        },
        {
            "Title": "Nexus Venture Partners: Divests 4.63% Stake in India Shelter Finance",
            "Summary": "Nexus Venture Partners sold a 4.63% stake in India Shelter Finance Corporation for Rs 425 crore, reducing its holding to 10.62%. Kotak Mahindra Mutual Fund acquired a 4.2% stake for Rs 385 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1752028336000,
            "Source": "block_deals"
        },
        {
            "Title": "India Shelter Finance: Nexus Venture Partners Units Sell 4.63% Stake for Rs 425 Crore",
            "Summary": "Nexus Venture Partners' units sold a 4.63% stake in India Shelter Finance Corp. for Rs 424.9 crore. Nexus Opportunity Fund II sold 1.23% and Nexus Ventures III sold 3.4% at Rs 850.88 per share. Kotak Mahindra Mutual Fund acquired 4.19% for Rs 385 crore at Rs 850.87 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1751996543000,
            "Source": "block_deals"
        },
        {
            "Title": "India Shelter Finance Corp Reports Strong Q4 Results and Dividend",
            "Summary": "India Shelter Finance Corp has announced its Q4 financial results, showing significant year-over-year growth. The company's revenue increased to 3.27 billion rupees from 2.35 billion rupees in the previous year. Consolidated net profit rose to 1.08 billion rupees, up from 779.3 million rupees year-over-year and 961.4 million rupees quarter-over-quarter. Additionally, the company has recommended a final dividend of 5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746810093000,
            "Source": "result"
        },
        {
            "Title": "India Shelter Finance Corp Reports Strong Q3 Financial Results",
            "Summary": "India Shelter Finance Corporation has announced its Q3 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit reached 961 million rupees, up from 623 million rupees in the same quarter last year and 901 million rupees in the previous quarter. Additionally, the company's interest income for Q3 increased to 2.4 billion rupees, compared to 1.8 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738851056000,
            "Source": "earnings"
        },
        {
            "Title": "India Shelter Finance Corp Reports Q2 Revenue Growth",
            "Summary": "India Shelter Finance Corporation has reported its second quarter revenue for the current fiscal year. The company's revenue stood at 2.83 billion rupees, compared to 2.04 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729844839000,
            "Source": "result"
        },
        {
            "Title": "India Shelter Finance Corp Reports Strong Q2 Profit Growth",
            "Summary": "India Shelter Finance Corporation has announced its Q2 consolidated net profit, which stands at 900 million rupees. This represents a significant increase from the 602 million rupees reported in the same quarter of the previous year, indicating a year-over-year growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1729844816000,
            "Source": "result"
        }
    ]
}