{
    "Symbol": "INDIANB",
    "ISIN": "INE562A01011",
    "News": [
        {
            "Title": "Indian Bank Q3FY26: Net Profit Rises 7.33% to ₹3,061 Cr",
            "Summary": "Indian Bank reports strong Q3FY26 results with net profit growing 7.33% YoY to ₹3,061 crore. Operating profit crosses ₹5,000 crore milestone for first time at ₹5,024 crore. NIM improves to 3.40%.",
            "Sentiment": "positive",
            "PublishDate": 1769773175892,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indian Bank alerts on bank union strike on Jan 27",
            "Summary": "Indian Bank informs stock exchanges about United Forum of Bank Unions strike scheduled for 27.01.2026, warning of potential branch operations impact while preparing contingency measures.",
            "Sentiment": "neutral",
            "PublishDate": 1769179045727,
            "Source": "stocks"
        },
        {
            "Title": "Indian Bank Q3FY26 Results Call on Jan 22",
            "Summary": "Indian Bank announces post-earnings analyst call on January 22, 2026 at 6:15 PM IST to discuss Q3FY26 unaudited financial results. Senior management including MD & CEO will participate.",
            "Sentiment": "neutral",
            "PublishDate": 1768399170497,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indian Bank Redeems ₹2000 Cr Basel III Bonds Early",
            "Summary": "Indian Bank exercised call option to fully redeem its Basel III Tier 2 bonds worth ₹2000 crores on January 13, 2026, five years ahead of maturity, while paying annual interest of ₹123.60 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1768304874447,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indian Bank Q3FY26 Business Update Shows Strong Growth",
            "Summary": "Indian Bank reports total business of ₹14.30 lakh crore in Q3FY26, marking 13.4% year-on-year growth. Deposits grew 12.5% to ₹7.90 lakh crore while advances increased 14.5% to ₹6.40 lakh crore.",
            "Sentiment": "positive",
            "PublishDate": 1767266571380,
            "Source": "stocks"
        },
        {
            "Title": "Indian Bank Promotes Navin Kumar Shrivastava to CRO",
            "Summary": "Indian Bank announces promotion of Shri Navin Kumar Shrivastava from General Manager to Chief General Manager-Chief Risk Officer, effective January 1, 2026, bringing over 31 years of banking experience to the role.",
            "Sentiment": "positive",
            "PublishDate": 1767194385387,
            "Source": "stocks"
        },
        {
            "Title": "Indian Bank CRO Sujit Kumar Dey Retires on Dec 31",
            "Summary": "Indian Bank announced that Chief General Manager-CRO & FRMD Shri Sujit Kumar Dey demitted office on December 31, 2025 upon superannuation, ceasing his role as Chief Risk Officer from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767192410568,
            "Source": "stocks"
        },
        {
            "Title": "Indian Bank Cuts MCLR, TBLR Rates by 5-10 bps",
            "Summary": "Indian Bank reduces MCLR rates by 5 bps across all tenors and TBLR rates by 5-10 bps effective January 3, 2026. Base Rate and BPLR also cut by 5 bps each following ALCO review.",
            "Sentiment": "positive",
            "PublishDate": 1767189240805,
            "Source": "stocks"
        },
        {
            "Title": "Indian Bank Director Election Update - EGM Agenda Change",
            "Summary": "Indian Bank cancels shareholder director election agenda as Shri Bhupinder Singh Bhalla deemed elected unopposed. EGM on January 09, 2026 continues with remaining agenda items.",
            "Sentiment": "neutral",
            "PublishDate": 1767105054703,
            "Source": "stocks"
        },
        {
            "Title": "Indian Bank Redeems ₹392 Cr AT1 Bonds via Call Option",
            "Summary": "Indian Bank successfully redeemed its Basel III Compliant AT1 Bonds Series IV worth ₹392 crores on December 30, 2025, exercising call option while paying annual interest of ₹33.08 crores.",
            "Sentiment": "positive",
            "PublishDate": 1767098650397,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indian Bank Sets Record Date for Tier2 Bonds Interest",
            "Summary": "Indian Bank announces record date of January 12, 2026 for annual interest payment on Tier2 Bonds Series III worth ₹1,000 crores at 8.15% rate, with payment due January 27, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766412557279,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indian Bank Gets RBI Nod for ₹2000 Cr Bond Call Option",
            "Summary": "Indian Bank receives RBI approval to exercise call option on Tier 2 Bonds Series V worth ₹2000 crores, scheduled for January 13, 2026, completing regulatory requirements.",
            "Sentiment": "positive",
            "PublishDate": 1766061720363,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indian Bank Completes Payment and Redemption of Basel III AT1 Bonds Worth Rs 1,048 Crore",
            "Summary": "Indian Bank has successfully paid interest of Rs 88.45 crore and redeemed its entire Basel III Compliant AT1 Bonds Series II worth Rs 1,048 crore through call option exercise. The bank completed both the quarterly interest payment and full redemption of 10,480 bonds on the due date of December 8, 2025, affecting bondholders and the bank's capital structure.",
            "Sentiment": "positive",
            "PublishDate": 1765201086291,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Bank Revises MCLR and TBLR Rates Across Various Tenors",
            "Summary": "Indian Bank's Asset Liability Management Committee has revised its Marginal Cost of funds based Lending Rate (MCLR) and Treasury Bills Linked Lending Rates (TBLR) across different tenors, with changes effective from December 3, 2025. The revision affects lending rates for various time periods, with MCLR rates ranging from 7.95% to 8.80% and TBLR rates from 5.45% to 5.55%, while Base Rate, BPLR, Policy Repo Rate and RBLR remain unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1764600722621,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Bank Shareholder Director Pradeep Kumar Malhotra Resigns Due to RBI Disqualification",
            "Summary": "Pradeep Kumar Malhotra resigned as Shareholder Director of Indian Bank effective November 28, 2025, following RBI communication dated July 30, 2025 that disqualified LIC employees from serving on PSB boards due to parabanking activity connections. The resignation was submitted in compliance with RBI's Master Direction on Fit and Proper Criteria for Elected Directors on PSB boards, impacting Indian Bank's board composition.",
            "Sentiment": "neutral",
            "PublishDate": 1764339057633,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bank of Baroda Senior Management Personnel Mrs M MINIT Ceases Role as CGM-Zonal Head",
            "Summary": "Bank of Baroda announced the cessation of Mrs M MINIT from her position as CGM-Zonal Head (Cluster Head) due to her identification as Executive Director in Indian Bank. The change in senior management personnel was disclosed to stock exchanges on November 25, 2025, following regulatory requirements.",
            "Sentiment": "positive",
            "PublishDate": 1764051149266,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indian Bank Receives RBI Approval for AT1 Bonds Call Option Exercise Worth Rs 2,000 Crore",
            "Summary": "Indian Bank has received RBI approval to exercise call options on three series of AT1 bonds totaling Rs 2,000 crore. The bonds include Series II worth Rs 1,048 crore, Series III worth Rs 560 crore, and Series IV worth Rs 392 crore. The call option dates are December 8, 2025, December 14, 2025, and December 30, 2025 respectively for the three series.",
            "Sentiment": "positive",
            "PublishDate": 1762816413889,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Bank Shares Surge 10x in Five Years, Gains 70% Year-to-Date on Index Inclusion Prospects",
            "Summary": "Indian Bank shares rose over 3% on Monday, marking the sixth consecutive day of gains and extending year-to-date returns to 70%. The stock has delivered a 10x return over five years with positive annual returns since 2020. For the September quarter, core income increased 6% year-on-year while net profit grew 11.5%, with improved asset quality as both gross and net NPAs declined. The recent rally among PSU banks follows SEBI draft proposals indicating changes to non-benchmark index weightage, improving prospects for Nifty Bank index inclusion. Nuvama Alternative identifies Indian Bank as one of four potential candidates for banking index inclusion, which could bring $72 million in inflows. The bank is also considered a strong contender for MSCI inclusion in February 2026, potentially attracting $200 million in inflows. Among 14 analysts covering the stock, 12 have buy ratings, one hold, and one sell recommendation. The stock traded at ₹885, up 15% over the past month.",
            "Sentiment": "positive",
            "PublishDate": 1762149585433,
            "Source": "stock"
        },
        {
            "Title": "Indian Bank Sets Record Date for Rs 1000 Crore Tier 2 Bonds Redemption",
            "Summary": "Indian Bank has fixed December 5, 2025 as the record date for payment of principal and interest on maturity of its outstanding Tier 2 Bonds Series II worth Rs 1000 crore. The bonds, carrying 8.64% interest rate with ISIN INE428A08044, were originally issued on December 1, 2015 and are set to mature on December 21, 2025. Since the maturity date falls on a Sunday and the preceding day is Saturday, the principal along with due interest will be paid on December 19, 2025, which is the preceding business day. The bank has informed stock exchanges NSE and BSE about this redemption schedule.",
            "Sentiment": "neutral",
            "PublishDate": 1762004176115,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Bank to Exercise Call Option on AT1 Perpetual Bonds Worth Rs 2,000 Crore",
            "Summary": "Indian Bank announced its decision to exercise call options on three series of AT1 Perpetual Bonds totaling Rs 2,000 crore. The bonds include Series II worth Rs 1,048 crore (call date December 8, 2025), Series III worth Rs 560 crore (call date December 14, 2025), and Series IV worth Rs 392 crore (call date December 30, 2025). All three bond series carry an 8.44% coupon rate and were issued in December 2020. The exercise of call options is subject to receiving requisite prior approval from RBI. Record dates have been set for each series, with principal and interest payments scheduled according to the offer document terms.",
            "Sentiment": "neutral",
            "PublishDate": 1762003177766,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Bank Reduces Treasury Bills Linked Lending Rates Across All Tenors",
            "Summary": "Indian Bank's Asset Liability Management Committee has revised Treasury Bills Linked Lending Rates (TBLR) downward across various tenors, effective from November 3, 2025. The overnight rate decreased from 5.50% to 5.45%, while rates for 3-6 months, 6 months-1 year, and 1-3 years all reduced from 5.60% to 5.55%. The bank's Marginal Cost of funds based Lending Rate (MCLR) remains unchanged, ranging from 7.95% for overnight to 8.85% for 3-year tenor. Base Rate stays at 9.60%, Benchmark Prime Lending Rate at 13.85%, Policy Repo Rate at 5.50%, and Repo Linked Benchmark Lending Rates at 8.20%.",
            "Sentiment": "positive",
            "PublishDate": 1761910498824,
            "Source": "stock"
        },
        {
            "Title": "Indian Bank Maintains Credit Growth Guidance While Improving Gross NPA Target",
            "Summary": "Indian Bank has maintained its credit growth guidance at 10-12%, though the bank expects actual results to exceed this range. The bank has set its return on equity guidance at 18-20%. The bank improved its gross NPA target, lowering it from below 3% to below 2%. The recovery goal remains unchanged at INR 5,500-6,500 crore, with INR 3,700 crore already recovered.",
            "Sentiment": "positive",
            "PublishDate": 1760672639447,
            "Source": "stock"
        },
        {
            "Title": "Indian Bank Reports Decline in Fresh Slippages to ₹11.32 Billion",
            "Summary": "Indian Bank's fresh slippages decreased to ₹11.32 billion compared to ₹13.3 billion in the previous quarter, representing a quarter-on-quarter reduction of approximately ₹2 billion in new non-performing assets.",
            "Sentiment": "positive",
            "PublishDate": 1760603674087,
            "Source": "earnings"
        },
        {
            "Title": "Indian Bank Reports Higher Q2 Net Profit and Improved Asset Quality",
            "Summary": "Indian Bank reported net profit of 30.2 billion rupees in Q2, up from 27 billion rupees year-over-year. The bank's interest earned increased to 166 billion rupees from 153 billion rupees compared to the same period last year. Asset quality showed improvement with gross non-performing assets (GNPA) declining to 2.60% from 3.01% quarter-over-quarter, while net non-performing assets (NNPA) decreased to 0.16% from 0.18%. Provisions for non-performing assets were slightly lower at 3.8 billion rupees compared to 3.87 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1760600226086,
            "Source": "earnings"
        },
        {
            "Title": "Indian Bank Reports Double-Digit Growth in Deposits and Advances",
            "Summary": "Indian Bank reported total deposits increased by 12% year-over-year, while gross advances grew by 12.9% year-over-year. The bank demonstrated growth across both key banking metrics.",
            "Sentiment": "positive",
            "PublishDate": 1759330060005,
            "Source": "stock"
        },
        {
            "Title": "Indian Bank Revises Benchmark Lending Rates Effective October 3, 2025",
            "Summary": "Indian Bank's Asset Liability Management Committee has revised multiple benchmark lending rates. The bank reduced its Marginal Cost of funds based Lending Rate (MCLR) for overnight tenor from 8.05% to 7.95% and for 1-month tenor from 8.30% to 8.25%, while keeping 3-month, 6-month, and 1-year MCLR rates unchanged. Treasury Bills Linked Lending Rates (TBLR) were increased by 5 basis points across all tenors. The Base Rate was reduced from 9.70% to 9.60%, and the Benchmark Prime Lending Rate (BPLR) was cut from 13.95% to 13.85%. Policy Repo Rate remains at 5.50% and Repo Linked Benchmark Lending Rates (RBLR) stays at 8.20%. The revised rates take effect from October 3, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1759241283565,
            "Source": "stock"
        },
        {
            "Title": "Indian Bank Sees Rs. 37 Crore Block Trade on NSE",
            "Summary": "Indian Bank shares were traded in a block deal worth Rs. 37 crores on the National Stock Exchange. The transaction involved approximately 500,702 shares at a price of Rs. 739 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1759206825052,
            "Source": "order&deals"
        },
        {
            "Title": "Indian Bank Pays Rs 362 Crore Interest on Long Term Infrastructure Bonds",
            "Summary": "Indian Bank paid Rs 362 crore as interest on its Long Term Infrastructure Bonds Series I on September 15, 2025. The payment was made on the scheduled due date for bonds with ISIN INE562A08099, which have a total issue size of Rs 5,000 crore. The interest is paid annually, with the record date set as August 29, 2025. The original due date was September 13, 2025, but since it fell on a Saturday followed by Sunday, the payment was made on the next business day without additional interest charges.",
            "Sentiment": "positive",
            "PublishDate": 1757945177049,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Bank Sets Record Dates for Annual Interest Payments on Long Term Infrastructure Bonds",
            "Summary": "Indian Bank announced record dates for yearly interest payments on its Long Term Infrastructure Bonds. For Series I bonds worth Rs 5,000 crore with 7.24% annual interest rate, the record date is August 29, 2025, with payment on September 15, 2025. For Series II bonds worth Rs 5,000 crore with 7.12% annual interest rate, the record date is October 10, 2025, with payment on October 27, 2025. Both payment dates are adjusted from their original due dates to account for weekends and holidays, with no additional interest charged for the delay.",
            "Sentiment": "neutral",
            "PublishDate": 1754052096802,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Bank Reports 23.69% YoY Net Profit Growth in Q1 FY26, Maintains Strong Asset Quality",
            "Summary": "Indian Bank reported net profit of Rs. 2,973 crores for Q1 FY26, marking a 23.69% year-over-year increase and 0.57% quarter-over-quarter growth. Total business grew 10.25% YoY to Rs. 13.45 trillion, while advances increased 11.50% YoY to Rs. 6.01 trillion. The bank's asset quality improved significantly with gross NPA declining to 3.01% from 3.77% YoY and net NPA falling to 0.18% from 0.39% YoY. CASA ratio stood at 38.97% compared to 40.17% in March. Net interest income grew 2.93% YoY to Rs. 6,359 crores, though domestic NIM compressed 13 basis points to 3.35%. The bank maintained strong capital adequacy at 17.80% and achieved credit cost of 0.28% against guidance of 1%. Recovery from written-off accounts reached Rs. 2,059 crores in the quarter. Management confirmed guidance for advance growth of 10-12%, deposit growth of 8-10%, and NIM range of 3.15-3.30% for the full year. The bank opened 51 new branches and plans to open 119 branches during FY26.",
            "Sentiment": "positive",
            "PublishDate": 1753972158185,
            "Source": "earnings"
        },
        {
            "Title": "Top Indian Banks' Earnings Disappoint Markets, Banking Stocks Under Pressure",
            "Summary": "Recent earnings results from India's leading banks have confirmed market concerns about the sector's performance. Axis Bank and Kotak Mahindra Bank experienced the most significant stock declines following their earnings announcements. The negative impact has spread across India's four largest private banks by market capitalization, indicating broader pressure on the banking sector.",
            "Sentiment": "negative",
            "PublishDate": 1753784990229,
            "Source": "earnings"
        },
        {
            "Title": "Indian Bank Reports Strong Q1 Performance with 24% Jump in Net Profit",
            "Summary": "Indian Bank delivered robust Q1 results with net profit rising to 29.7 billion rupees from 24 billion rupees year-over-year, marking a significant 24% increase. Interest income grew to 163 billion rupees compared to 150.4 billion rupees in the same period last year. The bank's asset quality showed improvement with gross non-performing assets (GNPA) declining to 3.01% from 3.09% in the previous quarter, while net non-performing assets (NNPA) decreased to 0.18% from 0.19% quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753343550218,
            "Source": "earnings"
        },
        {
            "Title": "Indian Bank Reports Growth in Advances and Deposits",
            "Summary": "Indian Bank has reported provisional financial figures as of June 30. The bank's gross advances increased by 11.3% year-over-year, while total deposits grew by 9.3% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1751506325000,
            "Source": "default"
        },
        {
            "Title": "Indian Bank: Q1 Business Grows 10.2%, Advances and Deposits Show Steady Rise",
            "Summary": "Indian Bank reported a 10.2% YoY increase in total business to ₹13.44 lakh crore for Q1 FY26. Deposits grew 9.3% to ₹7.44 lakh crore, while gross advances rose 11.3% to ₹6.00 lakh crore. The RAM portfolio expanded by 16.0% YoY to ₹3.63 lakh crore.",
            "Sentiment": "positive",
            "PublishDate": 1751468655000,
            "Source": "result"
        },
        {
            "Title": "Indian Bank Reports Growth in Gross Advances and Total Deposits",
            "Summary": "Indian Bank has reported an 11.3% year-on-year increase in gross advances and a 9.3% year-on-year growth in total deposits. The bank's performance indicates positive growth in both lending and deposit-taking activities.",
            "Sentiment": "positive",
            "PublishDate": 1751465704000,
            "Source": "default"
        },
        {
            "Title": "Indian Bank: Waives Minimum Balance Charges, Cuts MCLR",
            "Summary": "Indian Bank to waive charges for non-maintenance of minimum balance across all savings accounts from July 7, 2025. The bank also reduced its one-year MCLR by 5 basis points to 9.00%, effective July 3, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1751462082000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Bank: PSU Lender's Stock Soars 1240% in Five Years",
            "Summary": "Indian Bank's stock has risen 1,240% since June 2020, reaching Rs 625 per share. The bank's revenue increased to Rs 35,220 crore in FY2025, with improved net interest margin of 3.23%. Management projects 8-10% deposit growth and 10-12% advance growth for FY26. However, the bank faces potential reversal of recoveries due to a Supreme Court judgment in the JSW Group-Bhushan Steel case.",
            "Sentiment": "positive",
            "PublishDate": 1750838561000,
            "Source": "normal_news"
        },
        {
            "Title": "Indian Bank Block Trade: 1,053,728 Shares Sold for Rs. 65.87 Crores",
            "Summary": "A block trade of approximately 1,053,728 shares of Indian Bank occurred on the National Stock Exchange (NSE). The total value of the transaction was Rs. 65.87 crores, with shares priced at Rs. 625.10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1750047727000,
            "Source": "block_details"
        },
        {
            "Title": "Indian Bank Block Trade: 981,814 Shares Sold for Rs. 61.81 Crores",
            "Summary": "A block trade of Indian Bank shares occurred on the National Stock Exchange (NSE). Approximately 981,814 shares were traded at a price of Rs. 629.50 per share, totaling Rs. 61.81 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1749616157000,
            "Source": "block_details"
        },
        {
            "Title": "Indian Bank Block Trade: 636,568 Shares Sold for Rs. 39.72 Crores",
            "Summary": "A block trade of approximately 636,568 shares of Indian Bank occurred on the National Stock Exchange (NSE). The total value of the transaction was Rs. 39.72 Crores, with shares priced at Rs. 624.00 each.",
            "Sentiment": "neutral",
            "PublishDate": 1749532953000,
            "Source": "block_details"
        },
        {
            "Title": "Indian Bank: Last Day to Buy Shares for Rs 16.25 Dividend",
            "Summary": "June 10 is the record date for Indian Bank's Rs 16.25 per share final dividend for FY2025. Investors must buy shares by June 9 to qualify. The bank's net profit increased 32% annually to Rs 2,956 crore in March 2025.",
            "Sentiment": "positive",
            "PublishDate": 1749450383000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Bank Block Trade: 701,274 Shares Sold for Rs. 45.47 Crores",
            "Summary": "A block trade of approximately 701,274 shares of Indian Bank occurred on the National Stock Exchange (NSE). The total value of the trade was Rs. 45.47 Crores, with shares priced at Rs. 648.35 each.",
            "Sentiment": "neutral",
            "PublishDate": 1749446328000,
            "Source": "block_details"
        },
        {
            "Title": "Indian Bank: Credit Growth May Slow Amid Cautious Lending Approach",
            "Summary": "Indian Bank MD Binod Kumar expects banking sector growth to moderate due to cautious approach towards unsecured lending and deposit mobilization challenges. Indian Bank targets 12% credit growth for FY26, focusing on corporate and MSME loans. The bank projects 8-12% deposit growth and 10-12% advances growth for FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1748199958000,
            "Source": "normal_news"
        },
        {
            "Title": "Indian Bank: Launches New FD Schemes, Revises Interest Rates",
            "Summary": "Indian Bank introduces two new fixed deposit schemes: IND SECURE (444 days) and IND GREEN (555 days), offering up to 7.90% and 7.55% interest respectively. The bank discontinues IND Super 400 Days and IND Supreme 300 Days schemes. Interest rates for various tenures have been revised, with 1-year deposits now at 6.10% and 2-3 years at 6.70%.",
            "Sentiment": "neutral",
            "PublishDate": 1747302237000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Bank Reports Strong Q4 Profit Growth",
            "Summary": "Indian Bank has announced its Q4 financial results, showing significant year-over-year growth. The bank's net profit increased to 29.56 billion rupees, up from 22.47 billion rupees in the same quarter last year. Interest earned also rose to 158 billion rupees from 146 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1746403499000,
            "Source": "default"
        },
        {
            "Title": "Indian Bank: Q4 Profit Soars 32%, Asset Quality Improves",
            "Summary": "Indian Bank reported a 32% YoY increase in Q4FY25 net profit to ₹2,956 crore. NII rose 6.2% to ₹6,389 crore. Gross NPA ratio improved to 3.09%, and net NPA to 0.19%. Full-year FY25 net profit up 35% to ₹10,918 crore. Board recommends ₹12.60 per share dividend.",
            "Sentiment": "positive",
            "PublishDate": 1746271381000,
            "Source": "earnings"
        },
        {
            "Title": "Indian Bank Reports Q4 Profit Growth and Declares Dividend",
            "Summary": "Indian Bank has announced its Q4 results, reporting a net profit of 29.56 billion rupees, up from 22.47 billion rupees year-over-year. The bank's interest earned for Q4 increased to 158 billion rupees from 146 billion rupees in the previous year. Additionally, the bank has declared a dividend of 16.25 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1746267967000,
            "Source": "result"
        },
        {
            "Title": "Indian Bank to Hold Board Meeting for Q4 Results and Capital Raising",
            "Summary": "Indian Bank has announced a board meeting scheduled for May 3 to consider the financial results for the fourth quarter. Additionally, the board will discuss a proposal for capital raising.",
            "Sentiment": "neutral",
            "PublishDate": 1745513225000,
            "Source": "default"
        },
        {
            "Title": "Indian Bank: Home and Vehicle Loan Rates Reduced Following RBI Policy",
            "Summary": "Indian Bank has cut interest rates on home loans from 8.15% to 7.90% and vehicle loans from 8.50% to 8.25%. The bank is also offering limited-time benefits including discounted processing fees and zero documentation charges.",
            "Sentiment": "positive",
            "PublishDate": 1745510051000,
            "Source": "normal_news"
        },
        {
            "Title": "Indian Bank: Cuts Repo-Based Lending Rate Following RBI Decision",
            "Summary": "Indian Bank reduced its repo-based lending rate by 25 basis points to 6% after the Reserve Bank of India lowered the benchmark repo rate. The bank also cut its repo-linked benchmark lending rate to 8.7% from 9.05%.",
            "Sentiment": "neutral",
            "PublishDate": 1744209064000,
            "Source": "corporate_action"
        }
    ]
}