{
    "Symbol": "INDIACEM",
    "ISIN": "INE383A01012",
    "News": [
        {
            "Title": "UltraTech Q3 FY26 Results Beat Expectations",
            "Summary": "UltraTech Cement delivered strong Q3 FY26 performance with robust volume growth and margin expansion, driven by infrastructure demand surge across India. Company maintains optimistic outlook with capacity expansion on track.",
            "Sentiment": "positive",
            "PublishDate": 1769757525933,
            "Source": "co_actions_results"
        },
        {
            "Title": "India Cements Q3FY26 Earnings Call Recording Available",
            "Summary": "India Cements Limited has made the audio recording of its Q3FY26 earnings call available on the company website following regulatory disclosure requirements under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769274896805,
            "Source": "co_actions_results"
        },
        {
            "Title": "India Cements Gets GST Orders Worth ₹57.88 Cr from 3 Authorities",
            "Summary": "India Cements received three GST orders dated December 30, 2025, with total demands of ₹57.88 crores for FY 2021-22. Company reviewing orders and plans to contest all demands.",
            "Sentiment": "negative",
            "PublishDate": 1767101358676,
            "Source": "stocks"
        },
        {
            "Title": "India Cements clarifies on recent volume surge",
            "Summary": "India Cements responds to BSE inquiry about significant trading volume increase, confirming full compliance with disclosure norms and stating no material information pending announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1766048939424,
            "Source": "stocks"
        },
        {
            "Title": "India Cements Subsidiaries to Sell PT Adcoal Energindo Shares for 10 Billion Indonesian Rupiah",
            "Summary": "India Cements' subsidiaries have announced plans to sell their shareholding in PT Adcoal Energindo, an Indonesian entity, for a total consideration of 10 billion Indonesian Rupiah. The divestment affects India Cements and its subsidiaries as they exit their investment in the Indonesian company.",
            "Sentiment": "neutral",
            "PublishDate": 1764677854277,
            "Source": "corporate_action"
        },
        {
            "Title": "UltraTech Cement Reports Q2 FY26 Results with 31 Million Tons Sales Despite Monsoon Impact",
            "Summary": "UltraTech Cement sold over 31 million tons of cement in Q2 FY26 despite heavy monsoons. The company reported varied growth rates: 22.3% excluding ICL and Kesoram from base, 9.6% excluding India Cements, and 6.8% with all acquisitions included. UltraTech brand specifically grew 13.2% year-on-year, with rural markets delivering 13% growth. The company's existing assets (166.76 million tons capacity) achieved EBITDA of INR966 per metric ton, while India Cements delivered INR386 per ton and Kesoram assets INR755 per ton. Brand conversion progress shows India Cements at 31% and Kesoram at 55% completion. UltraTech announced expansion plans of 22.8 million tons additional capacity focused on North (18 million tons) and West (4.8 million tons) markets, targeting completion by fiscal 2029. The company operates 65 kilns and experienced higher maintenance costs with 617 kiln shutdown days versus 207 days in the previous quarter. Fuel costs increased to INR1.8 per Kcal from INR1.78, with coal comprising 48% and pet coke 44% of the fuel mix. UltraTech expects to reach 200 million tons capacity by end of current financial year and aims for 65% green power mix.",
            "Sentiment": "positive",
            "PublishDate": 1761564020683,
            "Source": "earnings"
        },
        {
            "Title": "India Cements Plans Operational Turnaround Strategy to Restore Profitability by FY27",
            "Summary": "India Cements has outlined a comprehensive operational turnaround strategy aimed at restoring profitability and strengthening market share by FY27. The company's plan focuses on three key areas: capacity expansion, efficiency upgrades, and debottlenecking operations. These initiatives are designed to improve the company's operational performance and competitive position in the cement market.",
            "Sentiment": "positive",
            "PublishDate": 1760718887759,
            "Source": "stock"
        },
        {
            "Title": "The India Cements Reports Q2 FY26 Results with 11.9% Volume Growth and Breakeven PAT",
            "Summary": "The India Cements achieved domestic sales volume of 2.44 million tonnes in Q2 FY26, representing 11.9% quarter-on-quarter growth. The company operated at 65% average capacity utilization with net cement realizations declining marginally by 0.6% quarter-on-quarter. Operating EBITDA per tonne stood at ₹386 compared to ₹400 per tonne in Q1 FY26. The company reported PAT before exceptions of ₹15 crores for the quarter, achieving breakeven post acquisition. Revenue from operations increased to ₹1,117 crores in Q2 FY26 from ₹1,007 crores in Q2 FY25. EBITDA improved significantly to ₹95 crores from negative ₹154 crores in the previous year quarter. Key cost components showed quarter-on-quarter declines with fuel costs down 7%, power costs down 13%, raw materials down 9%, and logistics costs down 11%. The company has planned a capex of ₹2,000 crores over the next two years focusing on productivity improvements, energy efficiency, and safety standards. The India Cements operates with a total cement capacity of 14.75 MTPA across nine plants in Tamil Nadu, Telangana, Andhra Pradesh, and Rajasthan.",
            "Sentiment": "positive",
            "PublishDate": 1760707724897,
            "Source": "earnings"
        },
        {
            "Title": "India Cements Approves 4.4 Billion Rupee Investment for Expansion and Modernization",
            "Summary": "India Cements has approved an investment of 4.4 billion rupees for expansion and modernization activities. The company's board has sanctioned this capital expenditure to enhance its operations.",
            "Sentiment": "positive",
            "PublishDate": 1760707085520,
            "Source": "stock"
        },
        {
            "Title": "The India Cements Reports Loss of Rs 20.61 Crores for Half-Year Ended September 2025",
            "Summary": "The India Cements Limited reported a net loss of Rs 20.61 crores for the half-year ended September 30, 2025, compared to a loss of Rs 182.52 crores in the same period last year. Revenue from operations for the half-year was Rs 2,141.79 crores versus Rs 1,989.48 crores in the previous year. The company's quarterly results showed a loss of Rs 6.86 crores for the quarter ended September 30, 2025. The company issued 2,000 units of commercial paper worth Rs 100 crores at a discount rate of 5.89% due for redemption on November 11, 2025, rated CARE A1+ by CARE Ratings. The board approved the sale of the company's entire equity stake in subsidiary Industrial Chemicals & Monomers Ltd for Rs 97.68 crores. The company also approved amalgamation of four wholly-owned Indian subsidiaries, which received shareholder and creditor approval but is subject to further regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1760705855918,
            "Source": "earnings"
        },
        {
            "Title": "India Cements Shareholders and Creditors Approve Amalgamation Scheme with Four Subsidiaries",
            "Summary": "The India Cements Limited held separate meetings for equity shareholders and unsecured creditors on September 27, 2025, via video conferencing as directed by the National Company Law Tribunal, Chennai Bench. Both meetings approved a Scheme of Amalgamation involving four transferor companies - ICL Financial Services Limited, ICL International Limited, ICL Securities Limited, and India Cements Infrastructures Limited - merging with The India Cements Limited as the transferee company. The shareholders' meeting ran from 10:00 a.m. to 10:35 a.m., while the creditors' meeting was held from 12:00 noon to 12:30 p.m. The company indicated that detailed voting results would be communicated separately.",
            "Sentiment": "positive",
            "PublishDate": 1758980036984,
            "Source": "corporate_action"
        },
        {
            "Title": "UltraTech Cement Sells 1.82 Crore Shares in India Cements, Reduces Stake to 75.60%",
            "Summary": "UltraTech Cement Limited sold 1,82,47,148 equity shares of The India Cements Limited on August 21-22, 2025, through an offer for sale via stock exchange mechanism. The transaction reduced UltraTech's shareholding from 81.49% to 75.60% in India Cements. UltraTech, acting as promoter of India Cements, had initially announced plans to sell up to 2,01,12,330 shares representing 6.49% stake, but ultimately sold 1,82,47,148 shares based on valid bids received from retail and non-retail investors. The sale was conducted over two days - August 21 for non-retail investors and August 22 for retail investors and non-retail investors carrying forward unallotted bids. India Cements has a total equity share capital of 30,98,97,201 shares with face value of ₹10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1756122881271,
            "Source": "corporate_action"
        },
        {
            "Title": "India Cements Sets Floor Price at ₹368 Per Share for UltraTech's Stake Acquisition",
            "Summary": "India Cements has established a floor price of ₹368 per share for UltraTech's stake in the company. This pricing decision relates to UltraTech's investment or acquisition interest in India Cements shares.",
            "Sentiment": "neutral",
            "PublishDate": 1755690897717,
            "Source": "corporate_action"
        },
        {
            "Title": "UltraTech Cement and India Cements Release Q1 FY26 Earnings Call Transcripts",
            "Summary": "UltraTech Cement and India Cements released transcripts of their Q1 FY26 earnings conference calls held on July 21, 2025, discussing unaudited financial results for the quarter ended June 30, 2025. UltraTech reported consolidated volume growth of 9.7% year-over-year, including Kesoram in both periods. The company achieved sequential price realization improvement of 2.2% for the UltraTech brand. India Cements, acquired by UltraTech in December 2024, recorded operating EBITDA of INR400 per ton after accounting for limestone royalty of INR160 per metric ton in Tamil Nadu. UltraTech is implementing a capex program for India Cements focused on efficiency improvements including WHRS, speed modifications, and alternate fuel technologies, targeting EBITDA of over INR1,000 per ton by FY28. The company expects to reach 212 million tons capacity and targets double-digit volume growth for FY26. Management highlighted steady cement demand driven by government infrastructure spending, with 2,108 kilometers of highways built in Q1 marking 8.9% year-over-year increase. Fuel costs remained controlled despite some pet coke price volatility during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753364810794,
            "Source": "earnings"
        },
        {
            "Title": "India Cements Reports Mixed Q1 Results with Operational Improvements Under UltraTech Ownership",
            "Summary": "India Cements reported flat revenue of ₹1,025 crore and a net loss for the June quarter, compared to net profit last year. The loss was primarily due to exceptional items, including ₹123.77 crore exceptional loss from asset impairment related to subsidiaries. However, operational metrics showed improvement with domestic sales volumes growing 11.6% to 2.18 million tonnes and cement realizations increasing 5.7% from the March quarter. The company achieved positive EBITDA of ₹83 crore after four quarters of losses, with EBITDA per tonne improving significantly to ₹424 from ₹88 in the previous quarter. Debt increased marginally to ₹1,241 crore, but average interest rates declined by 110 basis points. India Cements plans to scale up Green Power to 86% by financial year 2027 from current 5% levels. Shares closed 0.9% lower at ₹347.5, below UltraTech's open offer price of ₹390.",
            "Sentiment": "neutral",
            "PublishDate": 1753056372347,
            "Source": "earnings"
        },
        {
            "Title": "India Cements Reports 11.6% Growth in Domestic Sales Volume",
            "Summary": "India Cements achieved domestic sales volume of 2.18 million tonnes, representing a year-over-year growth of 11.6%. The company demonstrated strong performance in its domestic cement sales operations.",
            "Sentiment": "positive",
            "PublishDate": 1753015188233,
            "Source": "stock"
        },
        {
            "Title": "India Cement Reports Q1 Loss Before Tax of 162M Rupees with 2.4B Rupees Exceptional Item",
            "Summary": "India Cement recorded a loss before tax of 162 million rupees in Q1, showing improvement from the previous year's loss of 1.6 billion rupees. The company also reported an exceptional item of 2.4 billion rupees during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1752922956924,
            "Source": "earnings"
        },
        {
            "Title": "India Cement Reports Q1 Net Loss of 138M Rupees Despite Revenue Growth",
            "Summary": "India Cement posted a net loss of 138 million rupees in Q1, compared to a profit of 575 million rupees in the same period last year. Revenue increased to 10.2 billion rupees from 9.7 billion rupees year-over-year. The company's EBITDA turned positive at 820 million rupees versus a loss of 310 million rupees in the previous year, with an EBITDA margin of 8%.",
            "Sentiment": "neutral",
            "PublishDate": 1752922660090,
            "Source": "earnings"
        },
        {
            "Title": "CCI Imposes 10% Penalty on India Cements in ONGC Tendering Case",
            "Summary": "The Competition Commission of India (CCI) has completed its investigation into a case involving India Cements and ONGC's tendering process. As a result, the CCI has imposed a penalty of 10% on India Cements' annual revenue. The specifics of the case and the exact amount of the penalty are not provided in the given information.",
            "Sentiment": "negative",
            "PublishDate": 1751616232000,
            "Source": "default"
        },
        {
            "Title": "India Cements to Sell Stake in Indonesian Partner",
            "Summary": "India Cements has announced plans to sell its stake in its Indonesian partner, PT Mitra Setia Tanah Bumbu. The article does not provide further details about the size of the stake, the reasons for the sale, or the potential financial impact on India Cements.",
            "Sentiment": "neutral",
            "PublishDate": 1751560858000,
            "Source": "default"
        },
        {
            "Title": "India Cements: Sells Stake in Industrial Chemicals and Monomers Ltd for ₹98 Crore",
            "Summary": "India Cements is selling its entire equity investment in Industrial Chemicals and Monomers Ltd (ICML) to Mirai Sensing Private Ltd for ₹98 crore. Upon completion, ICML will no longer be a subsidiary of India Cements.",
            "Sentiment": "neutral",
            "PublishDate": 1750504284000,
            "Source": "corporate_action"
        },
        {
            "Title": "India Cements to Sell Entire Stake in Subsidiary ICML",
            "Summary": "India Cements has announced plans to divest its entire stake in its subsidiary ICML for ₹97.68 crores. The company intends to sell its ownership in the subsidiary, though no further details about ICML or the reasons for the divestment were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1750499699000,
            "Source": "default"
        },
        {
            "Title": "India Cements Completes De-bottlenecking at Banswara Plant",
            "Summary": "India Cements Ltd has announced the completion of a de-bottlenecking initiative at their Banswara Cement Works. This project has increased the company's total cement production capacity to 14.75 Million Tonnes Per Annum (MTPA).",
            "Sentiment": "positive",
            "PublishDate": 1747905148000,
            "Source": "default"
        },
        {
            "Title": "India Cements Reports Increased Q4 Net Loss",
            "Summary": "India Cements has reported a net loss of 756 million rupees for the fourth quarter, compared to a loss of 293.3 million rupees in the same period last year. The company's revenue decreased to 11.97 billion rupees from 12.45 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1745799353000,
            "Source": "default"
        },
        {
            "Title": "India Cements: Returns to Profit in Q4, Plans Subsidiary Merger",
            "Summary": "India Cements reported a Q4 FY25 net profit of ₹14.68 crore, reversing last year's loss. Revenue slightly decreased to ₹1,197.30 crore. The company narrowed its full-year loss. UltraTech Cement acquired a controlling stake in December 2024. The board approved a merger of four subsidiaries with the parent company.",
            "Sentiment": "positive",
            "PublishDate": 1745673317000,
            "Source": "earnings"
        },
        {
            "Title": "India Cements: Q4 Net Loss Narrows, Revenue Declines",
            "Summary": "India Cements reported a narrowed net loss of ₹14.6 crore in Q4, with revenue dropping 4% year-over-year. Cement prices declined 7% YoY in April-January FY25 due to weak demand and increased competition.",
            "Sentiment": "neutral",
            "PublishDate": 1745663608000,
            "Source": "earnings"
        },
        {
            "Title": "India Cements Reports Q4 Financial Results",
            "Summary": "India Cements has released its Q4 financial results, showing a significant decline in performance. The company's EBITDA dropped to 6 million rupees from 470 million rupees year-over-year, with EBITDA margin falling to 0.1% from 3.76%. The company reported a net loss of 756 million rupees, compared to a loss of 293.3 million rupees in the same quarter last year. Revenue also decreased to 11.97 billion rupees from 12.45 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1745661599000,
            "Source": "result"
        },
        {
            "Title": "India Cements to Sell Coromandel Electric Company Ltd for ₹36.27 Crore",
            "Summary": "India Cements has announced the sale of Coromandel Electric Company Ltd for ₹36.27 crore. The transaction is expected to be completed within six months.",
            "Sentiment": "neutral",
            "PublishDate": 1742290466000,
            "Source": "corporate_action"
        },
        {
            "Title": "India Cements to Consider Q4 Results on April 26",
            "Summary": "India Cements has announced that it will consider its fourth quarter (Q4) financial results on April 26. This indicates that the company is preparing to release its earnings report for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1741012333000,
            "Source": "result"
        },
        {
            "Title": "India Cements: Mauritius-based FII Reduces Stake",
            "Summary": "Elm Park Fund, a Mauritius-based FII, has reduced its shareholding in India Cements by selling 1.5 crore shares (4.93%). The FII's stake has decreased from 5.44% to 0.51%.",
            "Sentiment": "neutral",
            "PublishDate": 1738824275000,
            "Source": "block_deals"
        },
        {
            "Title": "UltraTech Cement Acquires Majority Stake in India Cements",
            "Summary": "India Cements has announced that UltraTech Cement now holds an 81.49% stake in the company following an open offer. This significant acquisition represents a major shift in ownership and control of India Cements.",
            "Sentiment": "neutral",
            "PublishDate": 1738760166000,
            "Source": "corporate_action"
        },
        {
            "Title": "India Cements Reports Significant Increase in Q3 Net Loss",
            "Summary": "India Cements has reported a substantial increase in its net loss for the third quarter. The company's net loss widened to 4.3 billion rupees, compared to a loss of 165 million rupees in the same period last year. Additionally, the company's revenue decreased from 11 billion rupees to 9.03 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1737505333000,
            "Source": "earnings"
        },
        {
            "Title": "India Cements: Q3 Net Loss Widens to ₹428.8 Crore, Revenue Drops 17%",
            "Summary": "India Cements reported a net loss of ₹428.8 crore in Q3 FY25, up from ₹16.5 crore loss last year. Revenue declined 17% to ₹903.2 crore. An exceptional loss of ₹190 crore contributed to the wider loss. The company faces challenges amid sluggish demand.",
            "Sentiment": "negative",
            "PublishDate": 1737464156000,
            "Source": "earnings"
        },
        {
            "Title": "India Cements Responds to CCI Notice on UltraTech Cement Deal",
            "Summary": "India Cements has received a notice from the Competition Commission of India (CCI) regarding a deal with UltraTech Cement. The company is currently preparing a response to address the CCI's concerns. India Cements expresses confidence in its ability to satisfy the CCI, emphasizing that the cement market is highly competitive.",
            "Sentiment": "neutral",
            "PublishDate": 1733500487000,
            "Source": "corporate_governance"
        },
        {
            "Title": "India Cements: Q2 Volume Up, Weak Realization Impacts Earnings",
            "Summary": "India Cements reported improved volume in Q2, but weak realization negatively affected earnings, according to a Motilal Oswal review.",
            "Sentiment": "neutral",
            "PublishDate": 1731327502000,
            "Source": "result"
        },
        {
            "Title": "India Cements Reports Increased Q2 Net Loss",
            "Summary": "India Cements has reported a net loss of 2.1 billion rupees for the second quarter, compared to a loss of 810 million rupees in the same period last year. This represents a significant increase in the company's losses year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731046105000,
            "Source": "result"
        }
    ]
}