{
    "Symbol": "INDIANHUME",
    "ISIN": "INE323C01030",
    "News": [
        {
            "Title": "Indian Hume Pipe Q3FY26 Net Profit Surges 328%",
            "Summary": "Indian Hume Pipe Company reported exceptional Q3FY26 performance with net profit jumping 328% to ₹6151.43 lakhs, driven by land sale gains of ₹6433.35 lakhs despite revenue decline.",
            "Sentiment": "positive",
            "PublishDate": 1770898857649,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indian Hume Pipe Sells Hyderabad Land for ₹173.96 Cr",
            "Summary": "Indian Hume Pipe Company completed the sale of land in Azamabad Industrial Area, Hyderabad for ₹173.96 crores to ASBL Private Limited on December 30, 2025, with full payment received.",
            "Sentiment": "positive",
            "PublishDate": 1767082240447,
            "Source": "stocks"
        },
        {
            "Title": "Indian Hume Pipe Company Sells Azamabad Land for ₹173.96 Crores to Ashoka Builders",
            "Summary": "Indian Hume Pipe Company has entered into a land sale agreement with Ashoka Builders India Private Limited for property in Azamabad valued at ₹173.96 crores. The company has already received an advance payment of ₹100 crores from the buyer as part of the transaction.",
            "Sentiment": "positive",
            "PublishDate": 1764223146099,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Hume Pipe Reports Net Loss in Latest Quarterly Results",
            "Summary": "The Indian Hume Pipe Company Limited reported a net loss of ₹4,601.69 lakhs for the quarter ended September 30, 2025, compared to a profit of ₹1,762.10 lakhs in the same quarter of the previous year. For the half-year period, the company recorded a net loss of ₹7,509.12 lakhs. Total income from operations for the quarter was ₹37,632.79 lakhs, while half-year operations generated ₹69,562.96 lakhs. The company's earnings per share declined to -₹6.59 for the quarter from ₹2.52 in the corresponding quarter last year. The equity share capital remained unchanged at ₹1,053.64 lakhs with a face value of ₹2 per share. The results were approved by the Board of Directors on November 10, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762844213490,
            "Source": "earnings"
        },
        {
            "Title": "Indian Hume Pipe Co Reports Strong Q2 Performance with 48% Jump in Net Profit",
            "Summary": "Indian Hume Pipe Co delivered robust quarterly results with net profit surging to 347 million rupees from 133 million rupees year-over-year. Revenue grew to 3.65 billion rupees compared to 3.54 billion rupees in the same period last year. The company's EBITDA increased significantly to 516 million rupees from 348 million rupees, while EBITDA margin expanded to 14.13% from 9.82% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1762777574554,
            "Source": "earnings"
        },
        {
            "Title": "Indian Hume Pipe Reports ₹499.27 Crore Net Profit in Q1 FY26, Revenue Rises 27.5%",
            "Summary": "The Indian Hume Pipe Company Limited reported a net profit of ₹499.27 crore for the quarter ended June 30, 2025, compared to ₹219.20 crore in the same quarter last year. Revenue from operations increased 27.5% to ₹392.10 crore from ₹307.43 crore year-on-year. The company recorded exceptional items worth ₹545.22 crore during the quarter. Earnings per share stood at ₹94.77 compared to ₹4.16 in the previous year quarter. Total expenses rose to ₹356.60 crore from ₹290.23 crore. The company operates in two segments - Construction (primary) and Real Estate. Construction segment revenue grew to ₹392.10 crore from ₹307.43 crore. The Board approved these unaudited financial results in a meeting held on August 12, 2025. The company paid a total dividend of ₹5.80 per equity share for the financial year ended March 31, 2025, comprising normal dividend of ₹1.80 and special dividend of ₹4.00.",
            "Sentiment": "positive",
            "PublishDate": 1755004897465,
            "Source": "earnings"
        },
        {
            "Title": "Indian Hume Pipe Co Reports Decline in Q1 Financial Performance",
            "Summary": "Indian Hume Pipe Co reported Q1 EBITDA of 337 million rupees compared to 581 million rupees in the same period last year. The company's EBITDA margin decreased to 10.97% from 15.95% year-over-year. Net profit for the quarter stood at 219 million rupees versus 311 million rupees in the previous year. Revenue declined to 3.07 billion rupees from 3.64 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1754998997463,
            "Source": "earnings"
        },
        {
            "Title": "Indian Hume Pipe Co. Reports Q4 Results and Dividend Announcement",
            "Summary": "Indian Hume Pipe Co. has announced its Q4 financial results and a dividend recommendation. The company reported a net profit of 4.99 billion rupees, significantly higher than the previous year. However, Q4 revenue decreased to 3.9 billion rupees from 4.04 billion rupees year-over-year. The company's EBITDA and EBITDA margin also declined. An exceptional item of 5.5 billion rupees was reported. The board has recommended a dividend of 5.8 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747231198000,
            "Source": "result"
        },
        {
            "Title": "Indian Hume Pipe Sells Land for 5.59 Billion Rupees to Godrej SSPD",
            "Summary": "Indian Hume Pipe Company has sold a parcel of land to Godrej SSPD for 5.59 billion rupees (approximately $67.5 million USD). This transaction represents a significant corporate action for Indian Hume Pipe, potentially impacting its financial position and asset portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1742548534000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Hume Pipe Authorizes Management to Proceed with Land Sale in Bengaluru",
            "Summary": "The Indian Hume Pipe Company has authorized its management to take all necessary actions regarding the proposed sale of the company's freehold land located in Venkatala Village, Yelahanka, Bengaluru, Karnataka. The land in question measures approximately 40,875.668 square meters (439,982 square feet).",
            "Sentiment": "neutral",
            "PublishDate": 1742385406000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Hume Pipe Co Reports Q3 EBITDA and Margin",
            "Summary": "Indian Hume Pipe Co has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 373 million rupees, compared to 376 million rupees in the same quarter last year. The EBITDA margin decreased to 9.8% from 11.80% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739368349000,
            "Source": "earnings"
        },
        {
            "Title": "Indian Hume Pipe Co Reports Q3 Financial Results",
            "Summary": "Indian Hume Pipe Co has announced its financial results for the third quarter. The company reported a net profit of 144 million rupees, slightly down from 151 million rupees in the same period last year. However, revenue increased to 3.8 billion rupees from 3.2 billion rupees year-over-year, indicating growth in sales.",
            "Sentiment": "neutral",
            "PublishDate": 1739368339000,
            "Source": "earnings"
        },
        {
            "Title": "Indian Hume Pipe Co. Reports Q2 EBITDA Growth",
            "Summary": "Indian Hume Pipe Co. has announced its Q2 financial results. The company's EBITDA increased to 348 million rupees, up from 319 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 9.82% from 9.99% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731500181000,
            "Source": "result"
        },
        {
            "Title": "Indian Hume Pipe Co Reports Q2 Financial Results",
            "Summary": "Indian Hume Pipe Co announced its Q2 financial results. The company's net profit increased to 133 million rupees, up from 103 million rupees year-over-year, but down from 312 million rupees quarter-over-quarter. Revenue for Q2 rose to 3.54 billion rupees, compared to 3.19 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731500107000,
            "Source": "result"
        },
        {
            "Title": "Indian Hume Pipe Updates on Development Agreement with Kalpataru Limited",
            "Summary": "Indian Hume Pipe Company has provided an update regarding its development agreement with Kalpataru Limited for the company's land in Pune. The agreement pertains to the development of Indian Hume Pipe's property in Pune.",
            "Sentiment": "neutral",
            "PublishDate": 1729244362000,
            "Source": "corporate_action"
        }
    ]
}