{
    "Symbol": "INDIAMART",
    "ISIN": "INE933S01016",
    "News": [
        {
            "Title": "IndiaMART Q3 PAT Expected to Rise 27.5% YoY",
            "Summary": "ICICI Securities forecasts IndiaMART's Q3 FY27 net profit at ₹154.30 crore, up 27.5% YoY. Revenue projected to grow 12.6% to ₹399.00 crore with EBITDA rising 1.3% to ₹140.10 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769150014736,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jefferies Upgrades IndiaMart to Hold, Sets ₹2,100 Target",
            "Summary": "Jefferies has upgraded IndiaMart InterMesh to 'Hold' rating with a target price of ₹2,100, signaling improved confidence in the B2B marketplace platform's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1768967866850,
            "Source": "stocks"
        },
        {
            "Title": "Nomura Cuts IndiaMart Target Price to ₹1,975",
            "Summary": "Global brokerage firm Nomura has reduced its target price for IndiaMart InterMesh to ₹1,975, maintaining a reduce rating on the B2B marketplace stock.",
            "Sentiment": "negative",
            "PublishDate": 1768967822330,
            "Source": "stocks"
        },
        {
            "Title": "IndiaMART Expects Paid Supplier Growth Recovery by Q1",
            "Summary": "IndiaMART Intermesh anticipates no change in paid supplier growth for another quarter, with recovery expected by April-June. Company projects 6-8% overall ARPU growth.",
            "Sentiment": "neutral",
            "PublishDate": 1768965719957,
            "Source": "stocks"
        },
        {
            "Title": "IndiaMART Q3FY26 Net Profit Surges 55.6% to ₹1,883 Cr",
            "Summary": "IndiaMART InterMESH reports strong Q3FY26 consolidated results with net profit rising 55.6% YoY to ₹1,883 crores. Revenue from operations grew 13.3% to ₹4,016 crores, driven by robust performance in web services segment.",
            "Sentiment": "positive",
            "PublishDate": 1768905016550,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndiaMART shares surge 8% on Nalanda fund purchase",
            "Summary": "IndiaMART InterMESH shares jumped over 8% on Friday after Nalanda India Equity Fund purchased 11 lakh shares worth ₹232 crore in block deals, marking the biggest single-day gain since July 2023.",
            "Sentiment": "positive",
            "PublishDate": 1768542842653,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndiaMART InterMESH Block Trade Worth ₹52.78 Crores",
            "Summary": "IndiaMART InterMESH witnessed a significant NSE block trade of ₹52.78 crores involving 250,122 shares at ₹2,110 per share, indicating substantial institutional activity in the e-commerce platform stock.",
            "Sentiment": "neutral",
            "PublishDate": 1768374422130,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndiaMART schedules Q3FY26 earnings call for Jan 20",
            "Summary": "IndiaMART InterMESH Ltd announces earnings conference call on January 20, 2026 at 17:00 IST to discuss Q3FY26 results ended December 31, 2025, with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1768310472538,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndiaMART Board Meet on Jan 20 for Q3FY26 Results",
            "Summary": "IndiaMART InterMESH Limited has scheduled its board meeting for January 20, 2026, to consider Q3FY26 financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768307068437,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndiaMART Sues OpenAI Over ChatGPT Exclusion",
            "Summary": "IndiaMART files lawsuit against OpenAI at Calcutta High Court, alleging discriminatory exclusion from ChatGPT responses causing commercial damage. Court finds prima facie case but denies interim relief.",
            "Sentiment": "negative",
            "PublishDate": 1766743068885,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Prudential Mutual Fund Crosses 5% Stake in IndiaMART InterMESH",
            "Summary": "ICICI Prudential Mutual Fund acquired 1,96,463 shares of IndiaMART InterMESH on December 02, 2025, increasing its total holding to 31,94,022 shares (5.32% of paid-up capital). The acquisition pushed the fund's shareholding above the 5% threshold, triggering mandatory disclosure requirements under SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764824211785,
            "Source": "corporate_action"
        },
        {
            "Title": "IndiaMart Allots 55,000 Equity Shares Under Employee Stock Benefit Scheme",
            "Summary": "IndiaMart InterMESH Limited's Share Allotment Committee allotted 55,000 equity shares of Rs. 10 face value each to the Indiamart Employee Benefit Trust at Rs. 10 per share for facilitating exercise of Stock Appreciation Rights and Employee Stock Options under the 2018 scheme. The allotment increased the company's paid-up equity share capital from Rs. 60,03,21,480 to Rs. 60,08,71,480, with the new shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764157938309,
            "Source": "corporate_action"
        },
        {
            "Title": "IndiaMart Targets Double-Digit Growth in H2FY26 Despite Rising AI Investment Costs",
            "Summary": "IndiaMart InterMesh is targeting double-digit growth in standalone collections for the second half of FY26, up from current growth of 8-10%. The company's standalone collections grew 8% year-on-year to Rs 365 crore in Q2FY26. CEO Dinesh Agarwal stated that slower net customer addition is keeping collections in the 8-10% range currently. The company maintains ARPU growth guidance of 6-8%, supported by improved platform experience leading to increased unique business inquiries and repeat customers. IndiaMart is heavily investing in AI to automate three crore monthly calls between buyers, sellers, and the platform, and to analyze call transcripts and PDFs for better product specifications. While AI investments are currently increasing costs due to experimentation with multiple models, the CEO expects cost reduction benefits in 2-3 years. Regarding Chinese B2B competition, Agarwal welcomed potential partnerships and denied speculation about joint ventures with Chinese players. IndiaMart shares closed 3.76% higher at Rs 2,460.",
            "Sentiment": "positive",
            "PublishDate": 1761615458384,
            "Source": "stock"
        },
        {
            "Title": "IndiaMART Reports 12% Revenue Growth to Rs 391 Crores in Q2 FY26, Adds 2,800 Net Paying Suppliers",
            "Summary": "IndiaMART InterMESH delivered consolidated revenue of Rs 391 crores in Q2 FY26, marking 12% year-on-year growth. Collections from customers grew 14% to Rs 406 crores, while deferred revenue increased 18% to Rs 1,750 crores. The company added 2,800 net paying suppliers (normalized figure excluding one-time benefit), bringing total paying suppliers to 2.22 lakh. Unique business inquiries reached 31 million, up 12% year-on-year. Consolidated EBITDA stood at Rs 130 crores with 33% margin, while net profit was Rs 83 crores. Other income declined from Rs 92 crores to Rs 10 crores due to mark-to-market losses on treasury portfolio from rising bond yields. Silver customer churn remains elevated at 7% monthly and 4% annually, while gold and platinum customers maintain healthy 1% churn rates. Subsidiary Busy Infotech reported Rs 38 crores billing with 57% normalized growth and sold 12,000 new licenses. Cash and treasury balance stood at Rs 2,874 crores.",
            "Sentiment": "positive",
            "PublishDate": 1761065201779,
            "Source": "earnings"
        },
        {
            "Title": "IndiaMART Targets 25% Revenue Growth Through SaaS and Fintech Services",
            "Summary": "IndiaMART has set a target of achieving 25% revenue compound annual growth rate through monetization of SaaS and fintech services via its subsidiaries Busy and Livekeeping. The company aims to strengthen the SME digitization ecosystem and enhance platform stickiness through these initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1760718519299,
            "Source": "stock"
        },
        {
            "Title": "IndiaMART InterMESH Reports 827 Million Net Profit for September Quarter",
            "Summary": "IndiaMART InterMESH Limited's Board approved audited financial results for the quarter and half year ended September 30, 2025. The company reported consolidated net profit of Rs 827 million for the quarter, down from Rs 1,535 million in the previous quarter and Rs 1,351 million in the same quarter last year. Revenue from operations increased to Rs 3,910 million from Rs 3,721 million in the previous quarter and Rs 3,477 million year-over-year. For the six-month period, net profit reached Rs 2,362 million on revenue of Rs 7,631 million. The company operates two main segments: Web and related services (Rs 3,603 million quarterly revenue) and Accounting Software services (Rs 307 million quarterly revenue). Basic earnings per share for the quarter stood at Rs 13.77. The company granted 406,730 Stock Appreciation Rights to employees during the six-month period at a weighted average share price of Rs 2,245 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1760696819406,
            "Source": "earnings"
        },
        {
            "Title": "IndiaMART InterMESH Seeks Shareholder Approval for Director Appointment and Related Party Transaction via Postal Ballot",
            "Summary": "IndiaMART InterMESH Limited has issued a postal ballot notice seeking shareholder approval for two resolutions through remote e-voting from July 31 to August 29, 2025. The first resolution proposes appointing Ms. Vasuta Agarwal as an Independent Director for a three-year term from July 18, 2025 to July 17, 2028. Ms. Agarwal holds engineering and MBA degrees and has over 18 years of experience in the digital industry, having served as Chief Business Officer at InMobi. The second resolution seeks approval for a related party transaction involving the appointment of Mr. Amit Agarwal, son of Managing Director Dinesh Chandra Agarwal, as Vice President for Product & Technology with annual remuneration up to Rs. 84 lakhs. The company has engaged NSDL for the remote e-voting facility, with the cut-off date set as July 25, 2025 for eligible shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1753709882772,
            "Source": "corporate_action"
        },
        {
            "Title": "IndiaMART Reports 12% Revenue Growth to Rs 372 Crores in Q1 FY26, Increases Digital Marketing Spend",
            "Summary": "IndiaMART InterMESH delivered consolidated revenue of Rs 372 crores in Q1 FY26, representing 12% year-on-year growth. Collections from customers grew 17% to Rs 430 crores, while deferred revenue increased 17-18% to Rs 1,735 crores. The company reported 29 million unique business enquiries, up 17% year-on-year, with total paying suppliers at 218,000. Net paying subscriber additions were 1,500 in the quarter. The company increased digital marketing spend to Rs 5-6 crores from Rs 1 crore in the previous quarter as part of performance marketing experiments on YouTube and Meta platforms. EBITDA margin for the standalone business stood at 39% with Rs 135 crores EBITDA. Consolidated net profit was Rs 154 crores with cash and treasury balance of Rs 2,762 crores. Management indicated churn remains elevated for silver customers but stable for gold and platinum customers. The company plans to continue digital marketing investments at Rs 6-10 crores per quarter while focusing on product improvements and AI implementation.",
            "Sentiment": "positive",
            "PublishDate": 1753269835622,
            "Source": "earnings"
        },
        {
            "Title": "IndiaMART Targets 33% Long-Term EBITDA Margin, Focuses on Silver Customer Retention",
            "Summary": "IndiaMART InterMESH aims for double-digit growth in the current financial year and a long-term EBITDA margin of 33%, down from current levels of 38-39%. CEO Dinesh Agarwal explained that current margins are elevated due to reduced sales investments caused by high churn rates in the Silver customer category. The company is prioritizing retention improvements for Silver customers through product enhancements and better training rather than increasing sales expenditure. Gold and platinum customers represent nearly 50% of subscribers but contribute 75% of revenue, while the top 10% of customers account for 50% of revenue. Advertising spending will remain at Rs 6-10 crore per quarter for the next two quarters. The company reported consolidated net profit of Rs 153.5 crore in Q1, up 34.65% year-on-year, with total income growing 20.8% to Rs 464.5 crore. Shares closed 1.87% lower at Rs 2,603.",
            "Sentiment": "neutral",
            "PublishDate": 1753148710288,
            "Source": "stock"
        },
        {
            "Title": "IndiaMART Reports 35% Jump in Net Profit, Revenue Grows 12% in Q1",
            "Summary": "IndiaMART InterMESH reported a 35% year-on-year increase in standalone net profit to Rs 154 crore for Q1 FY26, compared to Rs 114 crore in the previous year. Consolidated revenue from operations grew 12% to Rs 372 crore, driven by IndiaMART's standalone revenue of Rs 346 crore and Busy Infotech's contribution of Rs 25 crore. The company maintained a profit margin of 33%. Customer collections increased 17% to Rs 430 crore, while deferred revenue rose 18% to Rs 1,735 crore. Operationally, the company recorded 29 million unique business enquiries, up 17% year-on-year, and added 1,500 net paying suppliers to reach 2,18,000 total paying suppliers. Cash and investments stood at Rs 2,762 crore. HDFC Securities maintained an 'add' rating with a target price of Rs 2,600, citing strong quarterly performance supported by ARPU improvement and higher cash collections. The brokerage noted that increased digital marketing spend impacted margins, though gross margins improved due to GenAI integration and automation.",
            "Sentiment": "positive",
            "PublishDate": 1753072011610,
            "Source": "earnings"
        },
        {
            "Title": "IndiaMART InterMESH Ltd: Q1 Net Profit Soars 35% YoY",
            "Summary": "IndiaMART InterMESH Ltd reported a 35% YoY increase in Q1 net profit to ₹154 crore. Revenue rose 12.4% to ₹372 crore, while EBITDA grew 55% to ₹133.4 crore. Customer collections increased 17% to ₹430 crore. The company saw growth in business enquiries and supplier base.",
            "Sentiment": "positive",
            "PublishDate": 1752841210000,
            "Source": "earnings"
        },
        {
            "Title": "IndiaMART InterMESH Reports Q1 Financial Results",
            "Summary": "IndiaMART InterMESH has reported its Q1 financial results. The company's EBITDA increased to 1.3 billion rupees from 1.20 billion rupees year-over-year. The EBITDA margin slightly decreased to 35.88% from 36.07% year-over-year. Consolidated net profit rose to 1.5 billion rupees from 1.14 billion rupees year-over-year. Revenue increased to 3.7 billion rupees from 3.3 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1752839182000,
            "Source": "result"
        },
        {
            "Title": "IndiaMart InterMESH Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 262,433 shares of IndiaMart InterMESH Ltd. occurred on the National Stock Exchange (NSE) at a price of Rs. 2676.40 per share. The total value of the transaction was Rs. 70.24 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1752470526000,
            "Source": "block_details"
        },
        {
            "Title": "IndiaMart InterMESH: Stock Soars on Nuvama Upgrade and Improved Outlook",
            "Summary": "IndiaMart InterMESH shares hit an eight-month high, rising over 6% after Nuvama upgraded it to 'buy' with a target price of Rs 3,800. The company's improved subscriber metrics, platform investments, and recovering demand environment are driving expectations of re-accelerated growth and potential re-rating.",
            "Sentiment": "positive",
            "PublishDate": 1750824897000,
            "Source": "normal_news"
        },
        {
            "Title": "IndiaMART InterMESH: Rs 50 Total Dividend Declared for FY 2024-25",
            "Summary": "IndiaMART InterMESH has proposed a total dividend of Rs 50 per equity share for FY 2024-25, comprising a final dividend of Rs 30 and a special dividend of Rs 20. The dividend yield based on the current market price is 2.01%.",
            "Sentiment": "positive",
            "PublishDate": 1750131586000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indiamart Intermesh Approves Final and Special Dividend",
            "Summary": "The Board of Indiamart Intermesh has approved a final dividend of 30 rupees per share and a special dividend of 20 rupees per share. No additional details about the timing or context of these dividends were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750118862000,
            "Source": "default"
        },
        {
            "Title": "Indiamart Intermesh Approves Final and Special Dividends",
            "Summary": "Indiamart Intermesh's board has approved a final dividend of ₹30 per share and a special dividend of ₹20 per share. The total dividend amounts to ₹50 per share.",
            "Sentiment": "positive",
            "PublishDate": 1750082885000,
            "Source": "default"
        },
        {
            "Title": "IndiaMART InterMESH Acquires Remaining Stake in Livekeeping",
            "Summary": "IndiaMART InterMESH has acquired the remaining stake in Livekeeping for Rs 26.78 crore, making it a wholly owned subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1746762119000,
            "Source": "default"
        },
        {
            "Title": "IndiaMART InterMESH to Invest 410M Rupees in Fleetx",
            "Summary": "IndiaMART InterMESH has announced plans to subscribe to 2,921 preference shares of Fleetx for a total investment of 410 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1746192102000,
            "Source": "default"
        },
        {
            "Title": "IndiaMART InterMESH: Q4 Profit Surges 81% YoY, Revenue Up 12.8%",
            "Summary": "IndiaMART InterMESH reported Q4FY25 consolidated net profit of Rs 180.6 crore, up 81.3% YoY. Revenue increased 12.8% to Rs 355 crore. EBITDA rose 47.5% to Rs 130.4 crore, with margin expanding to 36.7%. The company announced a final dividend of Re 1 per share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1745985261000,
            "Source": "earnings"
        },
        {
            "Title": "Indiamart Intermesh Reports Strong Q4 Results and Announces Dividends",
            "Summary": "Indiamart Intermesh reported a significant increase in Q4 consolidated net profit, rising to 1.81 billion rupees from 996 million rupees year-over-year. Revenue also grew to 3.55 billion rupees from 3.15 billion rupees in the same period. The company has recommended a final dividend of 30 rupees per equity share for FY 2024-25, along with a special dividend of 20 rupees per share, totaling 50 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1745972744000,
            "Source": "default"
        },
        {
            "Title": "IndiaMART InterMESH Reports Strong Q4 Results and Announces Dividends",
            "Summary": "IndiaMART InterMESH has reported impressive Q4 financial results, with EBITDA increasing to 1.3 billion rupees from 884 million rupees year-over-year. The company's EBITDA margin improved to 36.72% from 28.09%, while revenue grew to 3.55 billion rupees from 3.15 billion rupees. Additionally, the company has recommended a final dividend of 30 rupees per equity share for FY 2024-25 and a special dividend of 20 rupees per share, totaling 50 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1745927190000,
            "Source": "result"
        },
        {
            "Title": "IndiaMART InterMESH Reports Strong Q4 Profit Growth",
            "Summary": "IndiaMART InterMESH, an Indian e-commerce company, has reported a significant increase in its consolidated net profit for the fourth quarter. The profit rose to 1.81 billion rupees, up from 996 million rupees in the same quarter last year, representing a year-over-year growth. The company also saw a quarter-over-quarter improvement, with profits increasing from 1.21 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745927160000,
            "Source": "result"
        },
        {
            "Title": "IndiaMART InterMESH: Q4 Profit Surges, Declares Highest-Ever Dividend",
            "Summary": "IndiaMART InterMESH reported a 49.3% QoQ increase in Q4 net profit to ₹180.6 crore. Revenue remained flat at ₹355 crore. EBITDA declined 5.7% QoQ to ₹130.4 crore. The company declared a total dividend of ₹50 per share, its highest payout ever.",
            "Sentiment": "positive",
            "PublishDate": 1745927057000,
            "Source": "earnings"
        },
        {
            "Title": "Indiamart Intermesh Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade of approximately 82,021 shares of Indiamart Intermesh Ltd. took place on the National Stock Exchange (NSE) at a price of Rs. 1970.00 per share. The total value of the transaction amounted to Rs. 16.16 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1740645008000,
            "Source": "block_deals"
        },
        {
            "Title": "IndiaMart InterMesh: Share Price Plummets Amid Bearish Broker Outlook",
            "Summary": "IndiaMart InterMesh shares fell 10% to a two-year low following bearish reports from brokerages Nuvama and Nomura. Both firms cut target prices and maintained 'reduce' ratings, citing concerns over declining paid subscribers, weak customer additions, and high churn rates. Despite reporting a 47% rise in Q3 net profit and 16% revenue growth, the company's outlook remains challenged.",
            "Sentiment": "negative",
            "PublishDate": 1737523641000,
            "Source": "result"
        },
        {
            "Title": "IndiaMart InterMesh Ltd: Analysts Turn Bearish on Declining Subscriber Base",
            "Summary": "Nuvama and Nomura have lowered target prices for IndiaMart InterMesh Ltd due to a decline in paid subscribers, weak customer additions, and high churn rates. Nuvama reduced its target price to Rs 1,970 from Rs 2,500, while Nomura cut its target to Rs 1,900 from Rs 3,150 and downgraded to 'reduce'. Both brokerages cite concerns over the company's near-term growth prospects and long-term trajectory.",
            "Sentiment": "negative",
            "PublishDate": 1737521403000,
            "Source": "normal_news"
        },
        {
            "Title": "IndiaMART InterMESH Ltd. Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for IndiaMART InterMESH Ltd. The transaction involved approximately 269,085 shares, traded at a price of Rs. 2073.15 per share, totaling Rs. 55.79 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1737517594000,
            "Source": "block_deals"
        },
        {
            "Title": "IndiaMART InterMESH: Nomura Downgrades Stock After Subscriber Drop",
            "Summary": "Nomura downgraded IndiaMART InterMESH to 'reduce' from 'neutral' and cut its price target to ₹1,900 from ₹3,150 after the company reported a decline in paying subscribers for Q3 FY24. The company saw a drop of 3,715 paying subscribers compared to the previous quarter, marking the first sequential decline since Q1 FY22. Unique visitors also fell to 27 million from 28 million.",
            "Sentiment": "negative",
            "PublishDate": 1737512262000,
            "Source": "earnings"
        },
        {
            "Title": "Indiamart Intermesh Reports Q3 Financial Results",
            "Summary": "Indiamart Intermesh has announced its Q3 consolidated financial results. The company reported a net profit of 1.21 billion rupees, up from 819 million rupees in the same quarter last year. This falls slightly short of the estimated 1.22 billion rupees. Revenue for Q3 stood at 3.54 billion rupees, matching estimates and showing growth from 3.05 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1737505383000,
            "Source": "earnings"
        },
        {
            "Title": "IndiaMart Intermesh: Q3 Profit Surges 36% YoY, Revenue Up 16%",
            "Summary": "IndiaMart Intermesh reported Q3FY25 consolidated net profit of Rs 125 crore, up 36% YoY. Revenue rose 16% to Rs 337 crore. Sequentially, revenue increased 1.6% but PAT decreased 1.6%. Expenses reduced both YoY and QoQ to Rs 199 crore.",
            "Sentiment": "positive",
            "PublishDate": 1737458772000,
            "Source": "earnings"
        },
        {
            "Title": "IndiaMART InterMESH Reports Strong Q3 EBITDA Growth",
            "Summary": "IndiaMART InterMESH has reported significant year-over-year growth in its Q3 EBITDA, which rose to 1.38 billion rupees from 857 million rupees in the previous year. This figure exceeded analyst estimates of 1.14 billion rupees. The company's EBITDA margin also improved substantially, reaching 39.03% compared to 28% in the same quarter last year, surpassing the estimated 34%.",
            "Sentiment": "positive",
            "PublishDate": 1737454713000,
            "Source": "earnings"
        },
        {
            "Title": "IndiaMART InterMESH Reports Q3 Financial Results",
            "Summary": "IndiaMART InterMESH announced its Q3 consolidated financial results. The company reported a net profit of 1.21 billion rupees, up from 819 million rupees year-over-year, slightly below the estimated 1.22 billion rupees. Revenue for the quarter stood at 3.54 billion rupees, an increase from 3.05 billion rupees in the same period last year, meeting the estimated figure.",
            "Sentiment": "positive",
            "PublishDate": 1737454696000,
            "Source": "earnings"
        },
        {
            "Title": "IndiaMART InterMESH Ltd: Q3 Earnings Expected to Show Significant Growth",
            "Summary": "IndiaMART InterMESH Ltd is set to report Q3 FY25 results. Analysts project adjusted PAT of Rs 133.4-140.5 crore, up 63-72% YoY. Revenue expected to grow 15.4-15.5% YoY to Rs 352.4-352.7 crore. Muted subscriber growth anticipated. EBITDA margins likely to expand significantly.",
            "Sentiment": "positive",
            "PublishDate": 1737339276000,
            "Source": "earnings"
        },
        {
            "Title": "IndiaMART InterMESH to Consider Q3 Results on January 21",
            "Summary": "IndiaMART InterMESH has announced that it will consider its third quarter financial results on January 21. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1736779359000,
            "Source": "earnings"
        },
        {
            "Title": "IndiaMART InterMESH: Brokerage Upgrades Stock After 28% Correction",
            "Summary": "JM Financial has double upgraded IndiaMART InterMESH to 'Buy' from 'Sell', raising the price target to ₹2,450. The upgrade follows a 28% stock correction over three months. The brokerage expects low-teen collections growth by FY26 and maintains confidence in the company's medium-term prospects.",
            "Sentiment": "positive",
            "PublishDate": 1736231472000,
            "Source": "normal_news"
        },
        {
            "Title": "IndiaMART InterMESH Ltd Sees Large Block Trade on NSE",
            "Summary": "A significant block trade occurred for IndiaMART InterMESH Ltd on the National Stock Exchange (NSE). The transaction involved approximately 126,158 shares, traded at a price of Rs. 2,239.50 per share. The total value of the block trade amounted to Rs. 28.25 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1735280588000,
            "Source": "block_deals"
        },
        {
            "Title": "Indiamart Intermesh to Invest in Mobisy Technologies",
            "Summary": "Indiamart Intermesh has announced plans to purchase shares and subscribe to preference shares of Mobisy Technologies, an internet-based software solutions company. The investment is set to be up to 142.8 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1733101031000,
            "Source": "corporate_action"
        },
        {
            "Title": "IndiaMART InterMESH to Invest in Mobisy Technologies",
            "Summary": "IndiaMART InterMESH has announced plans to purchase shares and subscribe to preference shares of Mobisy Technologies, an internet-based software solutions company. The investment is set to be up to 142.8 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1732880533000,
            "Source": "corporate_action"
        },
        {
            "Title": "IndiaMART InterMESH Subsidiary to Divest Stake in Shipway Technology",
            "Summary": "A subsidiary of IndiaMART InterMESH is set to sell its entire 26% stake in Shipway Technology for 416 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1731332161000,
            "Source": "corporate_action"
        }
    ]
}