{
    "Symbol": "INDNIPPON",
    "ISIN": "INE092B01025",
    "News": [
        {
            "Title": "India Nippon Electricals Board Meet on Feb 13",
            "Summary": "India Nippon Electricals Ltd schedules board meeting for February 13, 2026 to approve Q3FY26 unaudited financial results and consider interim dividend declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1770462193573,
            "Source": "co_actions_results"
        },
        {
            "Title": "India Nippon Electricals Reports 30% Revenue Growth in Q2 FY26, Outperforming Two-Wheeler Industry",
            "Summary": "India Nippon Electricals achieved 30% year-on-year revenue growth in Q2 FY26 to INR 2,726 million, significantly outperforming the 11% growth in the two-wheeler industry, with EBITDA at INR 307 million and 11.26% margin. The company secured high-volume business from a West-based customer and delivered 3x export growth in H1, while expanding its electric vehicle product portfolio and entering technical partnerships with BorgWarner for fuel injection systems.",
            "Sentiment": "positive",
            "PublishDate": 1764073224125,
            "Source": "earnings"
        },
        {
            "Title": "India Nippon Electricals Reports Q2 FY26 Financial Results",
            "Summary": "India Nippon Electricals Limited's Board approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The results were reviewed by statutory auditors Deloitte Haskins Sells LLP and include consolidated figures from subsidiary PT Automotive Systems Indonesia.",
            "Sentiment": "positive",
            "PublishDate": 1763109959512,
            "Source": "earnings"
        },
        {
            "Title": "India Nippon Electricals Shares Investor Presentation Highlighting 39-Year Journey and Growth Strategy",
            "Summary": "India Nippon Electricals Limited submitted an investor presentation to stock exchanges covering the company's business overview and financial performance. The company, incorporated in 1984, manufactures electronic ignition systems for two-wheelers, three-wheelers and portable engines, holding a market leadership position in electronic ignition system products. INEL operates 3 manufacturing facilities in Tamil Nadu, Puducherry, and Haryana with 1,605+ employees. The company reported revenue of INR 8,448 million in FY25 with EBITDA margins of 11.27% and PAT margins of 9.74%. Revenue breakdown shows 91% from two-wheelers, 5% from three-wheelers, and 4% from general purpose parts. The company achieved a 3-year revenue CAGR of 14.26% and maintains a debt-free status with consistent dividend payouts above 30%. Export sales contribute 4% of total revenue across markets including USA, Italy, China, Slovenia, Turkey, Vietnam, Thailand, Japan, and other countries. The company has expanded into electric vehicle products and sensors while maintaining its traditional ignition systems business. Aftermarket sales contribute around 12% of overall sales with a target to reach 15%. The presentation highlighted the company's outperformance against industry growth and its focus on new product development and geographical expansion.",
            "Sentiment": "positive",
            "PublishDate": 1758548495542,
            "Source": "stock"
        },
        {
            "Title": "India Nippon Electricals Reports Q1 FY2026 Results, Appoints New CTO and Secretarial Auditors",
            "Summary": "India Nippon Electricals Limited reported its Q1 FY2025-26 financial results with standalone revenue from operations of Rs. 22,470 lakhs and profit after tax of Rs. 2,330 lakhs. The company's basic earnings per share stood at Rs. 10.30 for the quarter. The Board approved the appointment of Mr. K Kanakaraju as Chief Technology Officer and Senior Management Personnel, effective August 13, 2025. Mr. Kanakaraju brings over 35 years of experience in Research & Development and Product Design across leading engineering organizations. The company also appointed M/s S.A.E. & Associates LLP as Secretarial Auditors for a five-year term from FY 2025-26 to 2029-30, subject to shareholder approval. The 40th Annual General Meeting has been scheduled for September 19, 2025, via video conference. Additionally, the company's Indonesian subsidiary PT Automotive Systems Indonesia was successfully wound up during the quarter, generating a gain of Rs. 20 lakhs on liquidation.",
            "Sentiment": "positive",
            "PublishDate": 1755103866669,
            "Source": "earnings"
        },
        {
            "Title": "India Nippon Electricals Reports Growth in Ignition Systems and EV Market",
            "Summary": "India Nippon Electricals has maintained its leadership in ignition systems and is expanding its presence in the electric vehicle (EV) market. The company has initiated new R&D efforts for technology advancement and launched ECU products. It has also broadened its customer base in both internal combustion engine (ICE) and EV segments, and secured export orders.",
            "Sentiment": "positive",
            "PublishDate": 1749461425000,
            "Source": "default"
        },
        {
            "Title": "India Nippon Electricals Reports Q4 Financial Results",
            "Summary": "India Nippon Electricals has released its Q4 financial results. The company's EBITDA increased to 277 million rupees from 216 million rupees year-over-year. The EBITDA margin improved to 11.86% from 11.05% in the same period last year. Net profit rose to 270 million rupees from 205 million rupees year-over-year. Revenue grew to 2.3 billion rupees from 1.96 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748593789000,
            "Source": "result"
        },
        {
            "Title": "India Nippon Electricals Reports Strong Q3 Results and Declares Dividend",
            "Summary": "India Nippon Electricals has announced its Q3 financial results, showing significant year-over-year growth. The company's net profit increased to 160 million rupees, up from 121 million rupees in the same quarter last year. Revenue also saw a substantial rise to 2.15 billion rupees, compared to 1.8 billion rupees in the previous year. Additionally, the company has declared a dividend of 12.5 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1739492247000,
            "Source": "earnings"
        },
        {
            "Title": "India Nippon Electricals Declares Dividend of 12.5 Rupees per Share",
            "Summary": "India Nippon Electricals has announced a dividend of 12.5 rupees per share for its shareholders. This corporate action represents a distribution of the company's profits to its investors.",
            "Sentiment": "positive",
            "PublishDate": 1739453336000,
            "Source": "corporate_action"
        },
        {
            "Title": "India Nippon Electricals Reports Significant Q3 EBITDA Growth",
            "Summary": "India Nippon Electricals has announced its Q3 financial results, showing substantial year-over-year improvement. The company's EBITDA increased to 258 million rupees, up from 153 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 12%, compared to 8.53% in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739453267000,
            "Source": "earnings"
        },
        {
            "Title": "India Nippon Electricals Reports Q3 Financial Results",
            "Summary": "India Nippon Electricals has announced its financial results for the third quarter. The company's net profit increased to 160 million rupees, up from 121 million rupees year-over-year, but down from 212 million rupees quarter-over-quarter. Revenue for Q3 rose to 2.15 billion rupees, compared to 1.8 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739453178000,
            "Source": "earnings"
        },
        {
            "Title": "India Nippon Electricals Reports Q2 EBITDA Growth",
            "Summary": "India Nippon Electricals has announced its Q2 financial results. The company's EBITDA increased to 236 million rupees, up from 197 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 11.26% from 10.36% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731483704000,
            "Source": "result"
        },
        {
            "Title": "India Nippon Electricals Reports Q2 Revenue Growth",
            "Summary": "India Nippon Electricals has announced its second-quarter revenue for the current fiscal year. The company reported revenue of 2.1 billion rupees, compared to 1.9 billion rupees in the same quarter of the previous year, indicating year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731483657000,
            "Source": "result"
        },
        {
            "Title": "India Nippon Electricals Reports Q2 Net Profit Increase",
            "Summary": "India Nippon Electricals has announced its Q2 financial results, reporting a net profit of 212 million rupees. This represents an increase from the 174 million rupees reported in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1731483609000,
            "Source": "result"
        }
    ]
}