{
    "Symbol": "INDORAMA",
    "ISIN": "INE156A01020",
    "News": [
        {
            "Title": "Indo Rama Synthetics Q3FY26 Results & Board Changes",
            "Summary": "Indo Rama Synthetics reported Q3FY26 consolidated revenue of ₹1,191.17 crore with net profit of ₹8.78 crore. Board approved director resignations and new appointments with committee restructuring.",
            "Sentiment": "neutral",
            "PublishDate": 1769874631003,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indo Rama Synthetics Gets Stable Credit Outlook",
            "Summary": "India Ratings revises Indo Rama Synthetics' credit outlook to stable from negative while affirming IND A-/IND A2+ rating on INR 17,200 million bank facilities.",
            "Sentiment": "positive",
            "PublishDate": 1769528355649,
            "Source": "stocks"
        },
        {
            "Title": "Indo Rama Synthetics Receives ₹1.01 Cr GST Demand",
            "Summary": "Indo Rama Synthetics (India) Limited received a GST demand order of ₹1.01 crores from Maharashtra State Tax Department for FY 2021-22, relating to discrepancies in RCM liability on freight expenses.",
            "Sentiment": "negative",
            "PublishDate": 1767081282358,
            "Source": "stocks"
        },
        {
            "Title": "IndoRama Synthetics Seeks Shareholder Approval for ₹800 Crore Related Party Transaction with TPT Petrochemicals",
            "Summary": "IndoRama Synthetics has issued a postal ballot notice seeking shareholder approval for material related party transactions worth ₹800 crore with TPT Petrochemicals Public Co. Limited, Thailand, for purchasing Purified Terephthalic Acid (PTA) during financial year 2025-26. The enhanced approval from ₹400 crore to ₹800 crore follows a business novation agreement effective July 1, 2025, with remote e-voting scheduled from November 18 to December 17, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763376582977,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo Rama Synthetics Seeks Shareholder Approval for Material Related Party Transactions via Postal Ballot",
            "Summary": "Indo Rama Synthetics (India) Limited has set November 14, 2025 as the cut-off date for shareholders to vote on material related party transactions with TPT Petrochemicals Public Co. Limited, Thailand, for financial year 2025-26. The company is seeking shareholder approval through postal ballot and electronic voting for these transactions under SEBI listing regulations. The voting process follows the company's earlier communication dated November 10, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762946442238,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo Rama Synthetics Reports Strong Q2 Turnaround with 246M Rupees Profit",
            "Summary": "Indo Rama Synthetics delivered significant improvement in its Q2 performance. The company reported EBITDA of 783 million rupees compared to 53 million rupees in the same period last year, with EBITDA margin expanding to 6.41% from 0.56%. The company achieved a consolidated net profit of 246 million rupees, marking a turnaround from a loss of 441 million rupees in the previous year. Revenue grew to 12.2 billion rupees from 9.5 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762778480139,
            "Source": "earnings"
        },
        {
            "Title": "Indo Rama Synthetics Reports Strong Q1 Turnaround with 528 Million Rupees Net Profit",
            "Summary": "Indo Rama Synthetics delivered a significant turnaround in Q1 results, posting a consolidated net profit of 528 million rupees compared to a loss of 191.8 million rupees in the same period last year. Revenue grew substantially to 13.1 billion rupees from 9.44 billion rupees year-over-year. The company's EBITDA increased to 970 million rupees from 293 million rupees, while EBITDA margin improved to 7.43% from 3.07% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755469633022,
            "Source": "earnings"
        },
        {
            "Title": "Indo Rama Synthetics Reports Strong Q1 Turnaround with 528M Rupees Net Profit",
            "Summary": "Indo Rama Synthetics delivered strong quarterly results with consolidated net profit of 528 million rupees, compared to a loss of 191.8 million rupees in the same period last year. The company's revenue grew to 13.1 billion rupees from 9.44 billion rupees year-over-year. EBITDA increased significantly to 970 million rupees from 293 million rupees, while EBITDA margin improved to 7.43% from 3.07% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755181682641,
            "Source": "earnings"
        },
        {
            "Title": "Indo Rama Synthetics Seeks Shareholder Approval for Director Appointments via Postal Ballot",
            "Summary": "Indo Rama Synthetics (India) Limited has dispatched postal ballot notices to shareholders for remote e-voting on two special resolutions. The company is seeking approval for the appointment of Ms. Neeru Abrol as an Independent Director and continuation of Mr. Dharmpal Agarwal as Non-Executive Independent Director after he attains 75 years of age. The remote e-voting period runs from July 22, 2025 at 9:00 AM to August 20, 2025 at 5:00 PM. CS Jaya Yadav has been appointed as scrutinizer for the postal ballot process. Results will be declared on or before August 22, 2025 at the company's corporate office in Gurugram. The cut-off date for eligible voting members is July 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753445691384,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo Rama Synthetics Seeks Shareholder Approval for Director Appointments via Postal Ballot",
            "Summary": "Indo Rama Synthetics (India) Limited has issued a postal ballot notice seeking shareholder approval for two special resolutions through remote e-voting. The first resolution proposes the appointment of Ms. Neeru Abrol (DIN 01279485) as an Independent Director for a three-year term from June 24, 2025 to June 23, 2028. Ms. Abrol is a Chartered Accountant with over four decades of experience, having served as Chairperson and Managing Director of National Fertilizers Limited and held various board positions. The second resolution seeks approval for Mr. Dharmpal Agarwal (DIN 00084105) to continue as Non-Executive Independent Director after turning 75 years old on August 24, 2025, for the remaining period of his tenure until November 24, 2026. Mr. Agarwal is Chairman and Managing Director of Transport Corporation of India Limited with over 55 years in the transport industry. The remote e-voting period runs from July 22, 2025 at 9:00 AM to August 20, 2025 at 5:00 PM. CS Jaya Yadav has been appointed as the scrutinizer for the postal ballot process.",
            "Sentiment": "neutral",
            "PublishDate": 1753445192417,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indo Rama Synthetics Receives Tax Demand Notice of 368.7 Million Rupees",
            "Summary": "Indo Rama Synthetics has been issued a tax demand notice for 368.7 million rupees. No further details about the nature of the tax demand or the company's response were provided in the given news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1750774664000,
            "Source": "default"
        },
        {
            "Title": "Indo Rama Synthetics Reports Q4 Profit Turnaround",
            "Summary": "Indo Rama Synthetics has reported a significant turnaround in its financial performance for Q4. The company posted a consolidated net profit of 511 million rupees, compared to a loss of 404.8 million rupees in the same quarter last year and a profit of 136 million rupees in the previous quarter. Revenue for Q4 increased to 11.98 billion rupees from 9.04 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747181902000,
            "Source": "default"
        },
        {
            "Title": "Indo Rama Synthetics Reports Strong Q4 Financial Results",
            "Summary": "Indo Rama Synthetics has reported significant improvements in its Q4 financial performance. The company's EBITDA increased to 770 million rupees from 96 million rupees year-over-year, with EBITDA margin expanding to 6.42% from 1.06%. The consolidated net profit for Q4 stood at 511 million rupees, compared to a loss of 404.8 million rupees in the same period last year. Revenue also saw growth, reaching 11.98 billion rupees, up from 9.04 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747139284000,
            "Source": "result"
        },
        {
            "Title": "Indo Rama Synthetics Reports Profit in Q3 FY2024",
            "Summary": "Indo Rama Synthetics has reported a consolidated net profit of 136 million rupees in the third quarter, compared to a loss of 990 million rupees in the same period last year. The company's revenue increased to 11.7 billion rupees from 9.4 billion rupees year-over-year, indicating improved financial performance and operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739146462000,
            "Source": "earnings"
        },
        {
            "Title": "Indo Rama Synthetics Reports Significant EBITDA Improvement in Q3",
            "Summary": "Indo Rama Synthetics has reported a substantial turnaround in its Q3 financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) showed a gain of 677 million rupees, compared to a loss in the same quarter of the previous year. Additionally, the company achieved an EBITDA margin of 5.80% for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738931372000,
            "Source": "earnings"
        },
        {
            "Title": "Indo Rama Synthetics Reports Profit in Q3 FY2024",
            "Summary": "Indo Rama Synthetics has reported a significant turnaround in its financial performance for the third quarter. The company posted a consolidated net profit of 136 million rupees, compared to a loss of 990 million rupees in the same period last year. Revenue also saw an increase, rising to 11.7 billion rupees from 9.4 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738931366000,
            "Source": "earnings"
        },
        {
            "Title": "Indo Rama Synthetics to Consider Q3 Results on February 7",
            "Summary": "Indo Rama Synthetics has announced that it will consider its third quarter (Q3) financial results on February 7. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738152385000,
            "Source": "earnings"
        }
    ]
}