{
    "Symbol": "INDOUS",
    "ISIN": "INE250Z01010",
    "News": [
        {
            "Title": "Indo-US Agriseeds sells 1 lakh shares in open market",
            "Summary": "Indo-US Agriseeds Limited sold 1,00,000 shares of Indo US Bio-Tech Limited through open market transaction, reducing its stake from 10.7062% to 10.2075%.",
            "Sentiment": "neutral",
            "PublishDate": 1770661701827,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indo US Bio-Tech Q3 FY26 Results Show Mixed Performance",
            "Summary": "Indo US Bio-Tech reported Q3 FY26 net profit of ₹299.66 lakhs, down from ₹505.45 lakhs YoY, despite revenue growth to ₹2,279.83 lakhs from ₹2,356.35 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1768988238796,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indo US Bio-Tech receives ED summons under PMLA",
            "Summary": "Indo US Bio-Tech Limited disclosed receipt of summons from Directorate of Enforcement under Prevention of Money Laundering Act for inquiry purposes, with no immediate material impact expected.",
            "Sentiment": "neutral",
            "PublishDate": 1767006409606,
            "Source": "stocks"
        },
        {
            "Title": "Indo US Bio-Tech Reports 345.21 Lakhs Net Profit in Q2 FY2026",
            "Summary": "Indo US Bio-Tech Limited announced quarterly results with net profit of Rs 345.21 lakhs and total income of Rs 3,087.27 lakhs for the quarter ended September 30, 2025. The seed cultivation and processing company's half-year net profit reached Rs 815.45 lakhs with basic EPS of Rs 1.72 for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1763135246565,
            "Source": "earnings"
        },
        {
            "Title": "Indo-US Bio-Tech Limited Shareholders Approve Re-appointment of Statutory Auditors via Postal Ballot",
            "Summary": "Indo-US Bio-Tech Limited shareholders approved the re-appointment of M/s. Gautam N Associates as statutory auditors for a second term of 5 years through remote e-voting postal ballot process. The resolution received 99.9999% votes in favor from 19 members representing 12,140,249 votes, with the voting period conducted from October 15 to November 13, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763126368887,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indo US Bio Tech Board Approves Re-appointment of Statutory Auditors for Second 5-Year Term",
            "Summary": "Indo US Bio Tech Ltd's Board of Directors approved the re-appointment of M/s. Gautam N Associates as Statutory Auditors for a second term of 5 years, extending until the conclusion of the 26th Annual General Meeting. The decision was made based on the Audit Committee's recommendation and requires shareholder approval through postal ballot. The Board also approved the draft Postal Ballot Notice and appointed M/s. Amrish Gandhi & Associates as Scrutinizer to conduct the postal ballot and e-voting process. The Board meeting was held on October 14, 2025, lasting 30 minutes from 10:30 a.m. to 11:00 a.m.",
            "Sentiment": "neutral",
            "PublishDate": 1760420554380,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indo US Bio Tech Limited Approves Unaudited Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Indo US Bio Tech Limited's Board of Directors approved the unaudited financial results for the quarter ended June 30, 2025, along with limited review reports from the company's auditor. The board meeting was held on August 12, 2025, at the company's registered office in Ahmedabad, Gujarat, commencing at 2:00 PM and concluding at 2:30 PM. The financial results were prepared in accordance with Ind-AS 34 'Interim Financial Reporting' and reviewed by Gautam N Associates, Chartered Accountants, who found no material misstatements in the standalone financial statements.",
            "Sentiment": "neutral",
            "PublishDate": 1754990609256,
            "Source": "earnings"
        }
    ]
}