{
    "Symbol": "INDOWIND",
    "ISIN": "INE227G01018",
    "News": [
        {
            "Title": "Indowind Energy Q3 FY26 Results Show Recovery",
            "Summary": "Indowind Energy reported consolidated revenue of ₹6.19 crores in Q3 FY26, up 5% YoY, returning to profitability with PAT of ₹0.35 crores. Nine-month revenue grew 21.61% to ₹35.49 crores.",
            "Sentiment": "positive",
            "PublishDate": 1770291522472,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indowind Energy Board Meet Set for Jan 29, 2026",
            "Summary": "Indowind Energy Ltd has scheduled a board meeting on January 29, 2026, to consider Q3FY26 unaudited financial results and discuss authorized share capital increase, fund raising, and project composition changes.",
            "Sentiment": "neutral",
            "PublishDate": 1769172587096,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indowind Energy Deploys Capital, Advances Solar Project",
            "Summary": "Indowind Energy repays ₹20.88 crores in legacy liabilities from rights issue proceeds and commences execution of 4 MW solar power project, strengthening balance sheet for future growth.",
            "Sentiment": "positive",
            "PublishDate": 1766462694187,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indowind Energy Reports 11.46% Revenue Growth in Q2 FY26, Plans 4MW Solar Project Through Rights Issue",
            "Summary": "Indowind Energy Limited reported consolidated revenue of INR 17.74 crore in Q2 FY26 compared to INR 15.92 crore in Q2 FY25, with EBITDA growing 15.58% to INR 10.53 crore and margins improving to 59.32%. The company operates 54MW wind capacity and plans to add 4MW solar capacity through a INR 49.5 crore rights issue, targeting completion within 3-4 months after fund receipt.",
            "Sentiment": "positive",
            "PublishDate": 1764228364482,
            "Source": "earnings"
        },
        {
            "Title": "Indowind Energy Schedules H1 FY26 Earnings Conference Call",
            "Summary": "Indowind Energy Limited has scheduled an earnings conference call on November 24, 2025, at 11:30 a.m. to discuss its performance for the half year ended September 30, 2025. The call will be hosted by Kirin Advisors Private Limited and includes dial-in details and Diamond Pass login options for participants.",
            "Sentiment": "neutral",
            "PublishDate": 1763556967103,
            "Source": "earnings"
        },
        {
            "Title": "Indowind Energy Reports 30.88% EBITDA Growth in H1 FY26",
            "Summary": "Indowind Energy Limited delivered strong financial performance with EBITDA growing 30.88% to ₹15.73 crores in H1 FY26, while total revenue increased 25.81% to ₹29.29 crores. The wind power company attributed the growth to better machine availability, disciplined cost management, and favorable wind conditions across its renewable energy portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1763357015204,
            "Source": "earnings"
        },
        {
            "Title": "Indowind Energy Reports Quarterly Results with Auditor Qualifications on Credit Loss and Arbitration Claims",
            "Summary": "Indowind Energy Limited announced its unaudited financial results for the quarter ended September 30, 2025, with the board meeting held on November 14, 2025. The company's auditors issued qualified opinions citing non-recognition of expected credit loss allowance of ₹248.13 lakhs from TNEB Tirunelveli and BESCOM, and accounting treatment issues related to a ₹9,083.39 lakhs arbitration claim against Suzlon Group.",
            "Sentiment": "negative",
            "PublishDate": 1763105646144,
            "Source": "earnings"
        },
        {
            "Title": "Indowind Energy Approves Rights Issue of Rs 49.43 Crore at 1:4 Ratio",
            "Summary": "Indowind Energy Ltd's Rights Issue Committee approved a rights issue to raise Rs 49.43 crore through 3.22 crore equity shares priced at Rs 15.35 per share. The rights entitlement ratio is set at 1:4, meaning eligible shareholders will receive 1 rights share for every 4 existing shares held. The record date is November 19, 2025, with the issue opening on December 1, 2025 and closing on December 9, 2025. Post-issue, the company's outstanding equity shares will increase from 12.88 crore to 16.10 crore shares, assuming full subscription. The rights entitlements will be credited to shareholders' demat accounts before the issue opening date under ISIN INE227G20034.",
            "Sentiment": "neutral",
            "PublishDate": 1763022754697,
            "Source": "corporate_action"
        },
        {
            "Title": "Indowind Energy Schedules Rights Issue Committee Meeting for November 13, 2025",
            "Summary": "Indowind Energy Limited has announced a Rights Issue Committee meeting scheduled for November 13, 2025. The meeting will consider and decide on terms and conditions related to a rights issue of equity shares worth up to Rs. 4,950 lakhs, which was authorized by the Board of Directors on December 18, 2024. The committee will determine key aspects including the rights issue price, issue size, rights entitlement ratio, record date, and approve the Letter of Offer and related documents. The Draft Letter of Offer was previously approved in a committee meeting on July 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762819369866,
            "Source": "corporate_action"
        },
        {
            "Title": "Indowind Energy Independent Director Niranjan Jagtap to Retire After Completing Second Term",
            "Summary": "Mr. Niranjan Raosaheb Jagtap, Independent Director of Indowind Energy Limited, will retire upon completion of his second term at the conclusion of the 30th Annual General Meeting on September 26, 2025, in accordance with Section 149(11) of the Companies Act, 2013. The company has expressed appreciation for his extensive service, valuable contributions, guidance and support during his tenure and long-term association with the company.",
            "Sentiment": "neutral",
            "PublishDate": 1758892972906,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indowind Energy Receives Stock Exchange Approval for Rs. 49.50 Crore Rights Issue",
            "Summary": "Indowind Energy Limited has received in-principle approval from BSE Limited and National Stock Exchange of India for its proposed rights issue of equity shares worth Rs. 49.50 crores. The rights issue involves equity shares with a face value of Rs. 10 each, to be offered to eligible equity shareholders on a rights basis. The approval is subject to several conditions including filing listing applications, obtaining statutory approvals, and compliance with SEBI regulations and Companies Act requirements. The exchanges reserve the right to withdraw approval if submitted information is found incomplete or misleading. The proposed issue can open for subscription within 12 months from the approval date of August 25, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1756192887999,
            "Source": "corporate_action"
        },
        {
            "Title": "Indowind Energy Reports 79% YoY EBITDA Growth in Q1 FY26",
            "Summary": "Indowind Energy Limited reported strong financial performance for Q1 FY26 with consolidated EBITDA growing 78.69% year-over-year to ₹5.21 crores from ₹2.91 crores. Total revenue increased 56.81% to ₹11.55 crores, while net profit rose 42.68% to ₹2.29 crores. On standalone basis, revenue grew 71.99% to ₹8.79 crores with EBITDA up 56.20% to ₹4.16 crores. The company attributed the growth to increased windmill capacity and favorable wind conditions in June 2025, which boosted generation income from ₹7.35 crores in June 2024 to ₹11.54 crores in June 2025. Indowind Energy is engaged in power generation and distribution through windmills and has been operating as an Independent Power Producer in renewable energy since 1995.",
            "Sentiment": "positive",
            "PublishDate": 1755160584307,
            "Source": "earnings"
        },
        {
            "Title": "Indowind Energy Reports Strong Q2 2025 Results, Schedules 30th AGM for September 26",
            "Summary": "Indowind Energy Limited reported consolidated revenue of ₹1,155.15 lakhs for Q2 2025, up from ₹736.66 lakhs in the same quarter last year. The company posted consolidated profit after minority interest of ₹229.45 lakhs compared to ₹160.80 lakhs in Q2 2024. On standalone basis, revenue reached ₹879.06 lakhs versus ₹511.10 lakhs in the previous year quarter, with profit after tax of ₹156.28 lakhs against ₹146.00 lakhs. The board approved holding the 30th Annual General Meeting on September 26, 2025 via video conferencing, with September 19, 2025 as the record date. Two new independent directors are proposed for appointment: Mr. Baskaran B R, a finance and legal professional with 38 years of experience, and Mr. Sridhar, a media professional currently serving as Non-Executive Director. The auditors issued qualified opinions citing concerns over credit loss provisions on receivables from TNEB and BESCOM worth ₹248.13 lakhs, and accounting treatment of claims against Suzlon Group totaling ₹9,083.39 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1755009173158,
            "Source": "earnings"
        },
        {
            "Title": "Indowind Energy Board to Discuss Fundraising Options",
            "Summary": "Indowind Energy has announced a board meeting scheduled for January 3 to explore various fundraising opportunities through the issuance of securities. The company will consider different options for raising capital to support its operations and potential growth initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1735050282000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indowind Energy Approves Rights Issue and Overseas Securities Issuance",
            "Summary": "Indowind Energy has approved a fresh rights issue of up to 500 million rupees. Additionally, the company has approved the issuance of overseas securities up to USD 30 million.",
            "Sentiment": "positive",
            "PublishDate": 1734522173000,
            "Source": "corporate_action"
        }
    ]
}