{
    "Symbol": "INDOBORAX",
    "ISIN": "INE803D01021",
    "News": [
        {
            "Title": "Indo Borax Shares Pledged by Catalyst Trusteeship",
            "Summary": "Catalyst Trusteeship Limited creates pledge on 98,82,230 equity shares (30.80%) of Indo Borax & Chemicals Limited under SEBI regulations dated February 03, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770374371278,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indo Borax completes major ownership transfer",
            "Summary": "Indo Borax & Chemicals Ltd completed transfer of 1,63,00,230 equity shares (50.80% stake) to new investors on January 23, 2026, triggering comprehensive board restructuring with new appointments and resignations.",
            "Sentiment": "neutral",
            "PublishDate": 1769181924117,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indo Borax Completes Major Shareholding Transfer",
            "Summary": "Indo Borax & Chemicals Ltd announces completion of share purchase agreement on January 23, 2026, involving transfer of 50.80% equity stake from promoter group to new investors including Zenrock Chemicals.",
            "Sentiment": "neutral",
            "PublishDate": 1769149275897,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indo Borax Amends Framework Agreement with Promoters",
            "Summary": "Indo Borax & Chemicals Limited executed an amendment to its framework agreement dated January 20, 2026, adding Mr. Saumya Sajal Jain as an additional purchaser alongside existing promoter group members.",
            "Sentiment": "neutral",
            "PublishDate": 1768916496185,
            "Source": "stocks"
        },
        {
            "Title": "Indo Borax Q3FY26: Revenue Up 9.33%, Net Profit Rises 2.15%",
            "Summary": "Indo Borax & Chemicals reported Q3FY26 revenue of ₹41.02 crores (+9.33% YoY) and net profit of ₹9.11 crores (+2.15% YoY), though EBITDA declined 11.55% to ₹8.61 crores with margin compression.",
            "Sentiment": "neutral",
            "PublishDate": 1768556242807,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indo Borax Receives Open Offer from Zenrock Chemicals",
            "Summary": "Indo Borax & Chemicals Limited disclosed receipt of a detailed public statement for an open offer by Zenrock Chemicals Private Limited and associates to acquire up to 83.43 lakh equity shares at ₹256.30 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1766400660284,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indo Borax & Chemicals to Restart Pithampur Plant Operations",
            "Summary": "Indo Borax & Chemicals announced that its Pithampur plant will resume operations on November 22, 2025. The restart affects the company's manufacturing capacity and operations at the facility.",
            "Sentiment": "positive",
            "PublishDate": 1763800117635,
            "Source": "stock"
        },
        {
            "Title": "Indo Borax Chemicals Reports Strong Q2 Performance with Rs 1,609 Lakh Net Profit",
            "Summary": "Indo Borax Chemicals Limited announced its unaudited financial results for the quarter ended September 30, 2025. The company reported a net profit of Rs 1,609.06 lakhs for the quarter, compared to Rs 902.87 lakhs in the same quarter last year. Total income increased to Rs 6,119.11 lakhs from Rs 4,201.33 lakhs year-over-year. The company recorded exceptional items of Rs 934.72 lakhs, representing profit from the sale of office premises. For the half-year period, net profit reached Rs 2,612.59 lakhs versus Rs 2,288.83 lakhs in the previous year. The company operates in a single segment of manufacturing and selling chemicals. The Board of Directors approved these results at their meeting held on November 11, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762849890591,
            "Source": "earnings"
        },
        {
            "Title": "Indo Borax & Chemicals Reports 61% Jump in Q2 Net Profit to 161M Rupees",
            "Summary": "Indo Borax & Chemicals reported quarterly net profit of 161 million rupees compared to 100 million rupees in the same period last year. The company's revenue increased to 578 million rupees from 379 million rupees year-over-year. EBITDA rose to 105 million rupees from 92 million rupees, though EBITDA margin declined to 18.2% from 24.2% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762848846167,
            "Source": "earnings"
        },
        {
            "Title": "Indo Borax & Chemical Limited Approves Voluntary Delisting from Calcutta Stock Exchange",
            "Summary": "Indo Borax & Chemical Limited's Board of Directors approved a proposal for voluntary delisting of the company's equity shares from the Calcutta Stock Exchange. The company will maintain its listings on BSE Limited and National Stock Exchange of India Limited. The Board authorized the company to make necessary applications to obtain required approvals and issue public notice in compliance with regulations. The board meeting was held on September 20, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758354917288,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo Borax & Chemicals Shareholders Approve Material Related Party Transactions Through Postal Ballot",
            "Summary": "Indo Borax & Chemicals Limited announced the results of a postal ballot conducted through remote e-voting to seek shareholder approval on four resolutions. Three ordinary resolutions related to material related party transactions under Section 188 of the Companies Act, 2013 and SEBI regulations were approved with 99.40% votes in favor and 0.60% against. A special resolution under Section 180 of the Companies Act, 2013 and SEBI Regulation 37A was approved with 99.93% votes in favor and 0.07% against. The voting period ran from July 28, 2025 to August 26, 2025, with results announced on August 28, 2025. CS Mannish L Ghia served as the scrutinizer for the postal ballot process. The company has 25,793 total shareholders, and the voting results will be displayed on the company's website and noticeboard.",
            "Sentiment": "positive",
            "PublishDate": 1756384375969,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo Borax & Chemicals Reports Quarterly Results, Sets Dividend Record Date and AGM Schedule",
            "Summary": "Indo Borax & Chemicals Ltd announced its unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 5,356.84 lakhs compared to Rs 4,976.26 lakhs in the same quarter last year. Net profit for the quarter stood at Rs 1,003.53 lakhs versus Rs 1,385.96 lakhs in the previous year quarter. Earnings per share was Rs 3.13 compared to Rs 4.32 in the corresponding quarter. The Board set September 18, 2025 as the record date for final dividend payment for Financial Year 2024-25, with payment scheduled on or before October 24, 2025, subject to shareholder approval. The company's 44th Annual General Meeting is scheduled for September 25, 2025 via video conferencing. Remote e-voting will be available from September 22-24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754991782436,
            "Source": "earnings"
        },
        {
            "Title": "Indo Borax & Chemicals Schedules Board Meeting for Q1 FY2026 Results and Dividend Record Date",
            "Summary": "Indo Borax & Chemicals Ltd has scheduled a Board of Directors meeting on August 12, 2025, to approve unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The board will also determine the record date for shareholders eligible for final dividend payments. The company has implemented a trading window closure from July 1, 2025, which will remain in effect until 48 hours after the results are announced on August 12, 2025, as part of their insider trading prohibition policy.",
            "Sentiment": "neutral",
            "PublishDate": 1754385822038,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo Borax & Chemicals Begins Commercial Dispatches of Boron Oxide from Pithampur Facility",
            "Summary": "Indo Borax & Chemicals Limited has started initial commercial dispatches of Boron Oxide, a value-added product, from its manufacturing facilities in Pithampur, Madhya Pradesh. The company notified stock exchanges BSE and NSE about this operational milestone on July 31st, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753943806555,
            "Source": "stock"
        },
        {
            "Title": "Indo Borax & Chemicals Seeks Shareholder Approval for ₹62 Crore Asset Sale to Promoter Group",
            "Summary": "Indo Borax & Chemicals Limited has issued a postal ballot notice seeking shareholder approval for four resolutions involving material related party transactions worth ₹62.02 crores. The company proposes to sell non-core assets including a residential property (₹42.5 crores), office property (₹14 crores), and luxury vehicles (₹5.52 crores) to promoter group members including Managing Director Sajal Sushilkumar Jain and family members. The sale prices are above independent valuations obtained from registered valuers. The company will lease back the office property for ₹55 lakh annually. E-voting is scheduled from July 28 to August 26, 2025, with results by August 28, 2025. The transactions require ordinary resolutions for related party approvals and a special resolution under Section 180 of Companies Act.",
            "Sentiment": "neutral",
            "PublishDate": 1753156599486,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo Borax & Chemicals Approves Sale of Properties and Luxury Vehicles Worth INR 62 Crore",
            "Summary": "Indo Borax & Chemicals Limited's board has approved the sale of residential property, office premises, and three luxury vehicles for a total consideration of INR 62.03 crore. The assets include a residential property in Bandra West (INR 42.5 crore), office premises in Santacruz West (INR 14 crore), and three vehicles - Mercedes Maybach S680, Aston Martin DBX 707, and Audi Q7 (INR 5.52 crore). The buyers are promoter group members including Managing Director Sajal Sushilkumar Jain and family members. The transaction requires shareholder approval through postal ballot and is expected to complete by March 31, 2026. The sale consideration exceeds 20% of the company's total income for the financial year ending March 31, 2025, making it subject to regulatory compliance requirements. The residential property generated rental income of INR 57.6 lakh and office property generated INR 37.2 lakh during the last financial year.",
            "Sentiment": "neutral",
            "PublishDate": 1753155536302,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo Borax & Chemicals Plans New High-Value Product Launch",
            "Summary": "Indo Borax & Chemicals announces plans to introduce a high-value Boron Oxide product in July 2025. The company will invest ₹20 crores in a new 4,000 MTPA facility in Indore, funded through internal accruals.",
            "Sentiment": "positive",
            "PublishDate": 1749454016000,
            "Source": "default"
        },
        {
            "Title": "Indo Borax & Chemicals Q4 Financial Results",
            "Summary": "Indo Borax & Chemicals reported its Q4 financial results. The company's EBITDA decreased to 102 million rupees from 116 million rupees year-over-year, with EBITDA margin falling to 20.35% from 24.45%. Net profit declined to 101 million rupees from 113 million rupees. However, revenue increased to 501 million rupees from 455 million rupees compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747121349000,
            "Source": "result"
        },
        {
            "Title": "Indo Borax & Chemicals Reports Improved Q3 EBITDA and Margin",
            "Summary": "Indo Borax & Chemicals has announced its Q3 financial results, showing an improvement in both EBITDA and EBITDA margin. The company's EBITDA increased to 101 million rupees from 92 million rupees in the same quarter last year. The EBITDA margin also saw a significant rise, reaching 26.86% compared to 20.84% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739262617000,
            "Source": "earnings"
        },
        {
            "Title": "Indo Borax & Chemicals Reports Q3 Financial Results",
            "Summary": "Indo Borax & Chemicals has announced its financial results for the third quarter. The company reported a net profit of 89 million rupees, up from 81 million rupees in the same quarter last year. However, revenue decreased to 375 million rupees from 440 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1739262457000,
            "Source": "earnings"
        },
        {
            "Title": "Indo Borax & Chemicals Reports Q2 Financial Results",
            "Summary": "Indo Borax & Chemicals has released its Q2 financial results. The company's net profit slightly increased to 90 million rupees from 88 million rupees year-over-year. However, revenue decreased to 379 million rupees from 468 million rupees compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731490734000,
            "Source": "result"
        }
    ]
}