{
    "Symbol": "INDOTECH",
    "ISIN": "INE332H01014",
    "News": [
        {
            "Title": "Indo Tech Transformers Q3 Profit Jumps 29% YoY",
            "Summary": "Indo Tech Transformers reported strong Q3 performance with net profit rising 29% to ₹249 million and revenue growing 11% to ₹1.96 billion compared to previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770218264005,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indo Tech Transformers Secures ₹64.99 Cr Order",
            "Summary": "Indo Tech Transformers Ltd receives intent letter for 6 transformers worth ₹64.99 crores with delivery scheduled between February 2027 and May 2027, marking significant business development.",
            "Sentiment": "positive",
            "PublishDate": 1767942801910,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shirdi Sai Electricals Extends Pledge on Indo-Tech Transformers Shares for Additional INR 75 Crore Debt",
            "Summary": "Shirdi Sai Electricals Limited extended its existing pledge on 27,61,200 equity shares (26% stake) of Indo-Tech Transformers Limited to secure additional non-convertible debentures worth INR 75 crores, bringing total debt to INR 675 crores. The pledge extension was executed through a supplemental securities pledge agreement dated December 2, 2025, with Catalyst Trusteeship Limited acting as the common security trustee for debenture holders.",
            "Sentiment": "neutral",
            "PublishDate": 1764912980340,
            "Source": "corporate_action"
        },
        {
            "Title": "Shirdi Sai Electricals Creates Pledge on Indo-Tech Transformers Shares for Debenture Security",
            "Summary": "Shirdi Sai Electricals Limited has pledged 27,61,200 equity shares (26% of total share capital) of Indo-Tech Transformers Limited to Catalyst Trusteeship Limited as security for INR 600 crores Non-Convertible Debentures and INR 150 crores Optionally Convertible Debentures. The pledge was created on November 21, 2025, with the company also providing an undertaking to maintain control over Indo-Tech Transformers at all times as part of the security arrangement.",
            "Sentiment": "neutral",
            "PublishDate": 1764306964110,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo Tech Transformers Secures ₹91.3 Crore Order",
            "Summary": "Indo Tech Transformers has won a new order valued at ₹91.3 crores. The order win represents a significant business development for the company's revenue pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1764202276880,
            "Source": "order&deals"
        },
        {
            "Title": "Shirdi Sai Electricals Creates Pledge on 27.61 Lakh Shares of IndoTech Transformers",
            "Summary": "Shirdi Sai Electricals Limited pledged 27,61,200 equity shares of IndoTech Transformers Limited in favor of Catalyst Trusteeship Limited as debenture trustee on November 21, 2025. The pledge creation increased Shirdi Sai's total encumbered shareholding in IndoTech to 61,52,236 shares (57.93%) while maintaining its 75% voting rights through 19,65,000 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764044454945,
            "Source": "corporate_action"
        },
        {
            "Title": "NM Finance Releases 7.5 Lakh Pledged Shares of Indo Tech Transformers",
            "Summary": "NM Finance and Investment Consultancy Limited released 7,50,000 pledged shares of Indo Tech Transformers Limited, representing 7.06% of the company's equity share capital. The release reduces NM Finance's encumbered shareholding in Indo Tech Transformers from 7.06% to nil, as disclosed under SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763969354112,
            "Source": "corporate_action"
        },
        {
            "Title": "Shirdi Sai Electricals Releases Pledge on 11.75 Lakh Indo-Tech Transformers Shares",
            "Summary": "Shirdi Sai Electricals Limited released pledges on 11,75,000 equity shares (11.06% stake) of Indo-Tech Transformers Limited after fully paying outstanding dues to two lenders - SKS Fincap Private Limited and NM Finance Investment Consultancy Ltd. The pledge releases reduced Shirdi Sai's encumbered shareholding in Indo-Tech from 42.99% to 31.93%, while maintaining its 75% total voting rights in the target company.",
            "Sentiment": "positive",
            "PublishDate": 1763795202311,
            "Source": "corporate_action"
        },
        {
            "Title": "SBI CAP Trustee Releases 15 Lakh Pledged Shares of Indo Tech Transformers",
            "Summary": "SBI CAP Trustee Company Limited released 15,00,000 pledged shares of Indo Tech Transformers Limited, reducing its encumbered shareholding from 44.12% to 30% of the company's total equity. The release was executed in the trustee's capacity as Security Trustee for State Bank of India, with the transaction completed on November 14, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763438604111,
            "Source": "corporate_action"
        },
        {
            "Title": "Shirdi Sai Electricals Revises Share Pledge Disclosure for Indo-Tech Transformers Debenture Issuance",
            "Summary": "Shirdi Sai Electricals Limited submitted a revised disclosure to stock exchanges regarding its covenant to pledge 27,61,200 equity shares (26% of total share capital) of Indo-Tech Transformers Limited in connection with debenture issuances worth INR 750 crores. The revision included names of lender entities and corrected missing signatures from the earlier November 11, 2025 submission, with the pledge serving as security for Non-Convertible Debentures of INR 600 crores and Optionally Convertible Debentures of INR 150 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1763096678182,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo-Tech Transformers Approves Additional ₹25 Crore Capex to Boost Plant Capacity to 20,000 MVA",
            "Summary": "Indo-Tech Transformers' Board approved an additional ₹25 crore capital expenditure proposal to enhance plant capacity to 20,000 MVA, executable over financial years 2024-2027, supplementing the earlier ₹75 crore capex approval for 16,000 MVA capacity expansion. The company also reported quarterly results with revenue of ₹70.81 crores and profit after tax of ₹5.67 crores for the quarter ended September 30, 2025, while maintaining current capacity utilization at 80-90% from existing 9,500 MVA capacity.",
            "Sentiment": "positive",
            "PublishDate": 1763046633957,
            "Source": "earnings"
        },
        {
            "Title": "Shirdi Sai Electricals Plans Pledge of 26% Stake in Indo-Tech Transformers for Debenture Security",
            "Summary": "Shirdi Sai Electricals Limited has executed agreements for issuing secured debentures worth INR 750 crores, comprising INR 600 crores in non-convertible debentures and INR 150 crores in optionally convertible debentures. The company plans to pledge 27,61,200 equity shares (26% stake) of Indo-Tech Transformers Limited as common security for both debenture issues. These shares are currently pledged to existing lenders who will be repaid from the non-convertible debenture proceeds. The new pledge will be created in favor of Catalyst Trusteeship Limited, acting as debenture trustee, once the existing encumbrance is released. The disclosure was made under SEBI takeover regulations as shares taken by way of encumbrance are treated as acquisition.",
            "Sentiment": "neutral",
            "PublishDate": 1762923152163,
            "Source": "corporate_action"
        },
        {
            "Title": "Catalyst Trusteeship Clarifies Pledge Creation Status on Indo-Tech Transformers Shares",
            "Summary": "Catalyst Trusteeship Limited issued a clarification regarding a proposed pledge on 26% equity shares of Indo-Tech Transformers Limited. The company executed a Debenture Trust Deed with Shirdi Sai Electricals Limited on October 30, 2025, for issuing Non-Convertible Debentures worth up to INR 600 crores. The arrangement involves creating a pledge on 27,61,200 equity shares (26% of Indo-Tech's share capital) as security for both NCDs and proposed Optionally Convertible Debentures. However, Catalyst clarified that the pledge has not been created yet, as the shares are currently encumbered with existing lenders of Shirdi Sai Electricals. The new pledge will be created in tranches only after repayment to existing lenders. Indo-Tech Transformers has a total equity share capital of 1,06,20,000 shares of INR 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1762403460462,
            "Source": "corporate_action"
        },
        {
            "Title": "Shirdi Sai Electricals Pledges 26% Stake in Indo-Tech Transformers to Catalyst Trusteeship",
            "Summary": "Shirdi Sai Electricals Limited has pledged 27,61,200 equity shares (26% stake) of Indo-Tech Transformers Limited to Catalyst Trusteeship Limited. The pledge was executed on October 30, 2025, as part of a Debenture Trust Deed arrangement where Catalyst Trusteeship acts as Debenture Trustee for the benefit of debenture holders. The pledged shares represent 26% of Indo-Tech Transformers' total equity share capital of 1,06,20,000 shares of INR 10 each. Prior to this transaction, there were no existing encumbrances on the shares.",
            "Sentiment": "neutral",
            "PublishDate": 1762233998197,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo Tech Transformers' Ad-Interim Injunction Order Vacated, Operations Continue Normally",
            "Summary": "Indo Tech Transformers Limited announced that the ad-interim injunction order granted by the court on July 02, 2025 has been vacated effective October 13, 2025. The original suit for permanent injunction will continue to be heard. The company stated that factory operations remain normal throughout this period.",
            "Sentiment": "positive",
            "PublishDate": 1760540300808,
            "Source": "stock"
        },
        {
            "Title": "Indo-Tech Transformers Secures INR 78.39 Crore Order from Avaada Clean Project",
            "Summary": "Indo-Tech Transformers Limited received a purchase order worth INR 78.39 crores plus taxes from Avaada Clean Project Private Limited for manufacturing and supplying 9 transformers with 125 MVA capacity each. The delivery schedule spans from March to May 2026, with 2 transformers to be delivered in March 2026 and 3 transformers each in April and May 2026. The company confirmed this is not a related party transaction and considers the order material due to its significant value compared to ordinary business transactions.",
            "Sentiment": "positive",
            "PublishDate": 1756984006700,
            "Source": "stock"
        },
        {
            "Title": "Indo Tech Transformers Reports Strong Q1 Growth with Revenue Nearly Doubling",
            "Summary": "Indo Tech Transformers delivered robust quarterly performance with revenue reaching 1.64 billion rupees compared to 822 million rupees in the same period last year. Net profit surged to 192 million rupees from 59 million rupees year-over-year. EBITDA increased significantly to 240 million rupees versus 82 million rupees, while EBITDA margin improved to 14.64% from 9.97% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755101363029,
            "Source": "earnings"
        },
        {
            "Title": "Indo-Tech Transformers Reports Quarterly Results and Notes Director Tenure Completion",
            "Summary": "Indo-Tech Transformers Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 16,393 lakhs and profit after tax of Rs 1,917 lakhs. Earnings per share stood at Rs 18.05. The Board also noted the completion of Dr. Sutanu Behuria's tenure, which expires on August 18, 2025. The company operates solely in the transformer manufacturing and sales segment. The results were reviewed by the Audit Committee and received an unqualified limited review report from statutory auditors.",
            "Sentiment": "neutral",
            "PublishDate": 1755101181707,
            "Source": "earnings"
        },
        {
            "Title": "Indo Tech Transformers Appoints CEO as Whole-Time Director, Re-appoints Two Independent Directors",
            "Summary": "Indo Tech Transformers Limited made three key board appointments following shareholder approval on August 11, 2025. M. Purushothaman, who serves as CEO, was appointed as Whole-Time Director for a 3-year term effective May 20, 2025. Purushothaman holds a bachelor's degree in Electrical & Electronics Engineering with 35 years of sales and marketing experience, having worked at Indo Tech for over 6 years as President – Sales & Marketing before becoming CEO on April 7, 2025. The company also re-appointed Ajay Kumar Dhagat as Independent Director for a second 5-year term starting August 13, 2025. Dhagat is an Electrical Engineering graduate with over four decades of industry experience, having held senior positions at GEC and served on the management board of Alstom SA and T&D France. Additionally, Leena Mukundh Sathyanarayanan was re-appointed as Independent Director for a second 5-year term effective November 5, 2025. She is a Chartered Accountant with credentials including ACS, Grad. CWA, and CISA, bringing close to 15 years of manufacturing sector experience as Business Controller and CFO, and practices as a Partner with CSR & Co., Chartered Accountants.",
            "Sentiment": "positive",
            "PublishDate": 1755004875077,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indo Tech Transformers Court Hearing Adjourned to August 11",
            "Summary": "Indo Tech Transformers Limited announced that a hearing for an ongoing injunction suit scheduled for August 4, 2025, has been adjourned to August 11, 2025. The case involves an ad-interim injunction order and is being heard in the court of Principal Subordinate Judge, Kanchipuram. The company stated it continues to operate normally despite the legal proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1754404632432,
            "Source": "stock"
        },
        {
            "Title": "Indo-Tech Transformers Secures INR 62.93 Crore Order for 6 Transformers",
            "Summary": "Indo-Tech Transformers Limited received a Letter of Award dated August 4, 2025, for supplying 6 transformers (175, 220/33-33kV MVA) valued at INR 62.93 crores plus applicable taxes. The order comes from a domestic entity with delivery scheduled for 4 transformers in July 2026 and 2 transformers in October 2026. The company confirmed that promoters have no interest in the awarding entity and the transaction does not qualify as a related party transaction. The company considers this a material event due to the significant order value compared to ordinary business transactions.",
            "Sentiment": "positive",
            "PublishDate": 1754398189773,
            "Source": "order&deals"
        },
        {
            "Title": "Indo Tech Transformers Secures Temporary Order Against Trade Unions",
            "Summary": "Indo Tech Transformers has obtained a temporary injunction order from the Madras High Court against three trade unions. The order restrains these unions from interfering with the company's operations or instigating employees to participate in illegal strikes or protests. This legal action aims to maintain the company's normal business activities.",
            "Sentiment": "positive",
            "PublishDate": 1751634424000,
            "Source": "default"
        },
        {
            "Title": "Indo Tech Transformers Prepares for Potential Trade Union Issues",
            "Summary": "Indo Tech Transformers is taking precautionary measures against potential issues with trade unions at their Kancheepuram facility. The company has initiated legal action to safeguard its interests and assets. No specific details about the nature of the issues or the legal action have been provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1751461710000,
            "Source": "default"
        },
        {
            "Title": "Indo Tech Transformers Reports Q4 Financial Results",
            "Summary": "Indo Tech Transformers has released its Q4 financial results. The company's EBITDA decreased to 207 million rupees from 266 million rupees year-over-year. The EBITDA margin fell to 10.03% from 15.25% in the same period last year. Revenue increased to 2.1 billion rupees from 1.75 billion rupees year-over-year. Net profit declined to 210 million rupees from 255.7 million rupees compared to the previous year's quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747732928000,
            "Source": "result"
        },
        {
            "Title": "Indo Tech Transformers Reports Strong Q3 Financial Results",
            "Summary": "Indo Tech Transformers has announced its financial results for the third quarter. The company's net profit increased to 193 million rupees, up from 107 million rupees in the same period last year. Revenue also saw growth, reaching 1.77 billion rupees compared to 1.39 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739266478000,
            "Source": "earnings"
        },
        {
            "Title": "Indo Tech Transformers: Small-Cap Stock Surges 1,200% in Two Years",
            "Summary": "Indo Tech Transformers, a transformer manufacturing company, has seen a 1,220% stock price increase since February 2023, reaching ₹2,435. The company recently received a ₹117.17 crore order for 150 MVA transformers. India's growing electricity demand and expanding power capacity are driving growth in the Power & Distribution Transformer Market, projected to reach $8.41 billion by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1738647422000,
            "Source": "normal_news"
        },
        {
            "Title": "Indo Tech Transformers Secures 1.17 Billion Rupee Order",
            "Summary": "Indo Tech Transformers has received a significant order valued at 1.17 billion rupees. This order represents a substantial business opportunity for the company and could potentially impact its financial performance positively.",
            "Sentiment": "positive",
            "PublishDate": 1735689862000,
            "Source": "order&deals"
        },
        {
            "Title": "Indo Tech Transformers Approves Rs 75 Crore Capital Expenditure for Capacity Enhancement",
            "Summary": "Indo Tech Transformers has approved a capital expenditure plan of Rs 75 crores to increase its plant capacity to 16,000 MVA. This expansion project will be implemented over the financial years 2024-2027.",
            "Sentiment": "positive",
            "PublishDate": 1735689810000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo-Tech Approves INR 75 Crore Capital Expenditure for Plant Capacity Enhancement",
            "Summary": "Indo-Tech has approved a capital expenditure proposal of INR 75 crores to increase its plant capacity to 16,000 MVA. This expansion plan is set to be implemented over the financial years 2024-2027.",
            "Sentiment": "positive",
            "PublishDate": 1735654433000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo Tech Transformers Secures 32 Crore Rupee Order",
            "Summary": "Indo Tech Transformers has won a new order worth 32 crore rupees. The company's current market capitalization stands at 2000 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1735620706000,
            "Source": "order&deals"
        },
        {
            "Title": "Indo Tech Transformers Reports Strong Q2 Financial Results",
            "Summary": "Indo Tech Transformers has announced its Q2 financial results, showing significant growth. The company's net profit increased to 177 million rupees, up from 71 million rupees year-over-year and 59 million rupees quarter-over-quarter. Revenue for Q2 reached 1.46 billion rupees, a 52.40% increase from the previous year's 958 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1731455601000,
            "Source": "result"
        }
    ]
}