{
    "Symbol": "INDOFARM",
    "ISIN": "INE622H01018",
    "News": [
        {
            "Title": "Indo Farm Equipment Releases Q3FY26 Earnings Call",
            "Summary": "Indo Farm Equipment Limited has made available the audio recording of its Q3FY26 earnings call conducted on February 12, 2026, covering unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770904860362,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indo Farm Equipment Q3 Net Profit Rises 24% YoY",
            "Summary": "Indo Farm Equipment reports Q3 net profit of ₹46 million, up from ₹37 million YoY. Revenue increased to ₹1 billion from ₹908 million in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1770128998797,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indo Farm Equipment Promoter Group Increases Shareholding Through Market Purchase",
            "Summary": "Ms. Diksha Khadwalia, part of Indo Farm Equipment Limited's promoter group, acquired 5,000 equity shares through open market purchase on December 4, 2025. The acquisition increased the aggregate promoter and promoter group shareholding from 69.79% to 69.81% on a fully diluted basis.",
            "Sentiment": "positive",
            "PublishDate": 1764844486780,
            "Source": "corporate_governance"
        },
        {
            "Title": "IndoFarm Equipment Reports 22% Revenue Growth in H1 FY26, Expects 25% Full-Year Growth",
            "Summary": "IndoFarm Equipment achieved revenue of Rs. 190.31 crore in H1 FY26 versus Rs. 150.78 crore in H1 FY25, with tractor segment growing 42% and crane segment up 15%. The company expects 25% overall revenue growth for FY26 with tractor revenue projected to grow 35-40% and crane revenue 15-20%, while maintaining EBITDA margins of 12.5-13%.",
            "Sentiment": "positive",
            "PublishDate": 1764172577222,
            "Source": "earnings"
        },
        {
            "Title": "IndoFarm Equipment Promoter Group Increases Stake Through Market Purchase",
            "Summary": "Mr. Shubham Khadwalia, part of IndoFarm Equipment Limited's promoter group, acquired 20,000 equity shares through open market purchase on November 21, 2025. The acquisition increased the aggregate promoter and promoter group shareholding from 69.70% to 69.74% on a fully diluted basis.",
            "Sentiment": "positive",
            "PublishDate": 1763809021152,
            "Source": "stock"
        },
        {
            "Title": "IndoFarm Equipment Promoter Group Increases Stake Through Open Market Purchase",
            "Summary": "Mr. Shubham Khadwalia, part of IndoFarm Equipment Limited's promoter group, acquired 40,000 equity shares through open market purchases on November 19-20, 2025. The aggregate promoter and promoter group shareholding increased from 69.62% to 69.70% on a fully diluted basis following this acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1763728286104,
            "Source": "corporate_action"
        },
        {
            "Title": "IndoFarm Equipment Seeks Shareholder Approval for Amit Kumar's Director and Whole-Time Director Appointments",
            "Summary": "IndoFarm Equipment Limited has issued a postal ballot notice seeking shareholder consent for appointing Amit Kumar (DIN: 11371053) as Director and Whole-Time Director for three years with effect from November 12, 2025. The remote e-voting will commence on November 20, 2025, and conclude on December 19, 2025, with Kumar's proposed monthly salary of Rs. 2,00,000 plus perquisites for overseeing the Tractor and Construction Equipment Division.",
            "Sentiment": "neutral",
            "PublishDate": 1763556651022,
            "Source": "corporate_action"
        },
        {
            "Title": "IndoFarm Equipment Reports No Deviations in IPO Fund Utilization for September Quarter",
            "Summary": "IndoFarm Equipment Limited submitted its monitoring agency report for IPO fund utilization for the quarter ended September 30, 2025. The company raised Rs. 184.90 crores through fresh equity shares at Rs. 215 per share, with net proceeds of Rs. 168.06 crores. Out of the total proceeds, Rs. 99.28 crores was spent by June 30, 2025, and Rs. 2.05 crores during the September quarter. The monitoring agency Infomerics Valuation and Rating Limited reported no deviations from the disclosed objects of the IPO. The funds are being utilized for four main purposes: setting up a new dedicated unit for pick carry cranes manufacturing capacity expansion (Rs. 70.07 crores), repayment of borrowings (Rs. 50.00 crores - fully utilized in March 2025), investment in NBFC subsidiary Barota Finance Ltd (Rs. 45.00 crores - fully utilized in March 2025), and general corporate purposes (Rs. 2.99 crores). Unutilized proceeds of Rs. 69.21 crores are deployed in fixed deposits with ICICI Bank earning returns between 4.75% to 5.85%.",
            "Sentiment": "neutral",
            "PublishDate": 1763000345321,
            "Source": "stock"
        },
        {
            "Title": "IndoFarm Equipment Reports Strong Q2 Results and Appoints New Executive Director",
            "Summary": "IndoFarm Equipment Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The company appointed Mr. Amit Kumar as Additional Director effective November 12, 2025, and subject to shareholder approval, as Whole Time Director for a 3-year term. Kumar brings over 14 years of experience in manufacturing, operations, and strategic procurement, holding an MBA and engineering degree from Maharshi Dayanand University. The Board approved unaudited standalone and consolidated financial results, with statutory auditors providing an unmodified review conclusion. A postal ballot notice will be sent to shareholders for regularization of Kumar's appointment. The company's financial results and disclosures are available on their website and have been filed with BSE and NSE exchanges.",
            "Sentiment": "positive",
            "PublishDate": 1762979063602,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo Farm Equipment Reports Mixed Q2 Results with Revenue Growth but Margin Decline",
            "Summary": "Indo Farm Equipment reported Q2 consolidated net profit of 50 million rupees, up from 36 million rupees in the same period last year. Revenue increased to 1.04 billion rupees from 861 million rupees year-over-year. However, EBITDA remained relatively flat at 128 million rupees compared to 129 million rupees previously. EBITDA margin compressed to 12.28% from 15.03% in the prior year period.",
            "Sentiment": "neutral",
            "PublishDate": 1762957106514,
            "Source": "earnings"
        },
        {
            "Title": "Indo Farm Equipment's Whole-Time Director Charan Singh Saini Resigns",
            "Summary": "Mr. Charan Singh Saini (DIN: 06864826) has resigned from his position as Whole-Time Director of Indo Farm Equipment Limited with immediate effect from October 28, 2025. The company has disclosed this resignation to BSE and NSE exchanges in compliance with SEBI listing regulations. The resignation letter cited specific reasons, though the detailed reasons were not disclosed in the main announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1761656019212,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indo Farm Equipment Promoter Group Increases Shareholding to 69.53%",
            "Summary": "Mr. Shubham Khadwalia, a member of the Promoter Group of Indo Farm Equipment Limited, acquired 44,797 equity shares through open market purchases on September 25 and 26, 2025. He purchased 30,000 shares on September 25 and 14,797 shares on September 26. Following these acquisitions, the aggregate shareholding of the Promoter and Promoter Group increased from 69.44% to 69.53% on a fully diluted basis.",
            "Sentiment": "positive",
            "PublishDate": 1758895766219,
            "Source": "stock"
        },
        {
            "Title": "Indo Farm Equipment Reports 31% Revenue Growth in Q1, Expands Crane Capacity to 5,000 Units",
            "Summary": "Indo Farm Equipment Limited reported revenue from operations of Rs. 91.25 crore, up 31.23% year-on-year from Rs. 69.55 crore. EBITDA increased 22.59% to Rs. 11.8 crore, though margins declined to 12.76% from 13.73%. Profit before tax surged 89% to Rs. 6.39 crore. The crane segment drove growth with revenue rising 36% to Rs. 53.04 crore, while tractor revenue grew 24.6% to Rs. 38.20 crore. The company sold 600 tractors and 273 cranes during the quarter. Management is expanding crane capacity from 1,280 to 5,000 units annually and targeting 30-40% growth in tractors for FY26. The company expects 30-35% revenue growth in FY26 and aims for crane sales of 1,400-1,500 units. Challenges include margin pressure from geographical expansion, heavy rains affecting Q2 sales, and a stretched working capital cycle. The company is adding 80 new tractor dealers and 65 crane dealers to expand market coverage.",
            "Sentiment": "positive",
            "PublishDate": 1756215796934,
            "Source": "earnings"
        },
        {
            "Title": "GST Reduction Announced for Agricultural Equipment Sector",
            "Summary": "A major GST cut has been announced for agricultural equipment. This development affects Indo Farm and the broader agricultural equipment industry.",
            "Sentiment": "positive",
            "PublishDate": 1756114198992,
            "Source": "stock"
        },
        {
            "Title": "Indo Farm Equipment Reports Zero Deviation in IPO Proceeds Utilization for Quarter Ended June 30, 2025",
            "Summary": "Indo Farm Equipment Limited submitted its monitoring agency report for IPO proceeds utilization for the quarter ended June 30, 2025. The company raised Rs. 184.90 crores through its IPO held from December 31, 2024 to January 2, 2025, with net proceeds of Rs. 168.06 crores available after deducting Rs. 16.84 crores in issue expenses. The monitoring agency Infomerics Valuation and Rating Limited reported zero deviation from stated objects and no funds were utilized for general corporate purposes during the quarter. The company utilized Rs. 99.28 crores cumulatively, leaving Rs. 68.78 crores unutilized. The unutilized funds are deployed in fixed deposits with ICICI Bank earning returns between 5.00% to 7.25%. Indo Farm Equipment manufactures tractors and pick & carry cranes, with current installed capacity of 1,280 units per annum. The company confirmed no delays in implementation of stated objects from the IPO prospectus.",
            "Sentiment": "neutral",
            "PublishDate": 1755015440708,
            "Source": "stock"
        },
        {
            "Title": "IndoFarm Approves Q1 FY26 Results, Appoints Internal Auditor and Reconstitutes Board Committees",
            "Summary": "IndoFarm Equipment Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs. 9,125.81 lakhs compared to Rs. 6,954.27 lakhs in the same quarter last year. Profit after tax increased to Rs. 458.36 lakhs from Rs. 220.27 lakhs year-on-year. On consolidated basis, revenue reached Rs. 9,626.11 lakhs versus Rs. 7,495.94 lakhs in the previous year, with profit after tax at Rs. 543.37 lakhs compared to Rs. 245.43 lakhs. The Board appointed Mr. Saravjit Singh as Internal Auditor for FY 2025-26 and reconstituted three board committees - Stakeholders Relationship Committee, Risk Management Committee, and Corporate Social Responsibility Committee - by including Mr. Anshul Khadwalia as a member and withdrawing Ms. Arshdeep Kaur and Ms. Babita Dosajh. The company also approved the notice for its 25th Annual General Meeting. Basic earnings per share stood at Rs. 0.95 on standalone basis and Rs. 1.13 on consolidated basis.",
            "Sentiment": "positive",
            "PublishDate": 1755012679275,
            "Source": "earnings"
        },
        {
            "Title": "Indo Farm Equipment Signs Agreement for Tower Crane Technology Purchase",
            "Summary": "Indo Farm Equipment has entered into an agreement with Beida Commercial and Trade Company to purchase technology for manufacturing tower cranes. This move suggests the company is expanding its product line or enhancing its existing manufacturing capabilities in the construction equipment sector.",
            "Sentiment": "positive",
            "PublishDate": 1745281578000,
            "Source": "default"
        },
        {
            "Title": "Indo Farm Equipment Signs Technology Purchase Agreement for Tower Crane Manufacturing",
            "Summary": "Indo Farm Equipment has entered into an agreement with Beida Commercial and Trade Company to purchase technology for manufacturing tower cranes. This move suggests Indo Farm Equipment is expanding its product line or capabilities in the construction equipment sector.",
            "Sentiment": "positive",
            "PublishDate": 1745236765000,
            "Source": "default"
        },
        {
            "Title": "Indo Farm Equipment to Acquire 18 Million Shares of BFL for 450 Million Rupees",
            "Summary": "Indo Farm Equipment has approved the acquisition of 18 million equity shares of BFL at a price of 25 rupees per share. The total investment for this acquisition amounts to 450 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1741788784000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo Farm Equipment: Shares Surge 36% Above IPO Price on Second Trading Day",
            "Summary": "Indo Farm Equipment's shares reached ₹293.20 on January 8, 2025, a 36% increase from its IPO price of ₹215. The stock is currently trading at ₹279, up 1.94% from the previous close. The company's recent IPO was oversubscribed 227.67 times and raised ₹260.15 crore.",
            "Sentiment": "positive",
            "PublishDate": 1736320668000,
            "Source": "normal_news"
        },
        {
            "Title": "Negen Capital Services Acquires Significant Stake in Indo Farm Equipment",
            "Summary": "Negen Capital Services has purchased 3,80,392 shares of Indo Farm Equipment at a price of Rs. 276.87 per share. This transaction represents a significant block deal in the company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1736307502000,
            "Source": "block_deals"
        },
        {
            "Title": "Indo Farm Equipment: Shares List at 19% Premium on NSE",
            "Summary": "Indo Farm Equipment shares debuted on NSE at ₹256, a 19% premium to the IPO price of ₹215. The IPO, which closed with 227.67 times subscription, raised ₹260.15 crore. The company plans to use the funds for expanding manufacturing capacity, debt repayment, and strengthening its NBFC subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1736224215000,
            "Source": "normal_news"
        },
        {
            "Title": "Indo Farm Equipment: Shares List at 20% Premium on Market Debut",
            "Summary": "Indo Farm Equipment Ltd. shares listed at Rs 258.40 on BSE and Rs 256 on NSE, marking a premium of 20.19% and 19.07% respectively over the issue price of Rs 215. The IPO was subscribed 229.68 times, raising Rs 260.15 crore. Proceeds will be used for manufacturing expansion, debt repayment, and investment in NBFC subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1736223309000,
            "Source": "result"
        }
    ]
}