{
    "Symbol": "INDOTHAI",
    "ISIN": "INE337M01021",
    "News": [
        {
            "Title": "Indo Thai Securities Q3FY26 Monitoring Report",
            "Summary": "Indo Thai Securities' monitoring agency report for Q3FY26 shows Rs. 10.33 crore utilization during the quarter with no deviations from preferential issue objects worth Rs. 118.20 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1770904900704,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indo Thai Securities enters ₹10 crore loan pact",
            "Summary": "Indo Thai Securities Limited has entered into an unsecured loan agreement worth ₹10 crore with Yash Technologies Private Limited at 10% per annum for 4 months tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1769588423498,
            "Source": "stocks"
        },
        {
            "Title": "Indo Thai Securities Q3FY26 profit jumps 1203%",
            "Summary": "Indo Thai Securities reported exceptional Q3FY26 results with standalone net profit surging 1203% to ₹1,739.24 lakhs. Revenue grew 399% to ₹2,762.99 lakhs driven by strong fair value gains.",
            "Sentiment": "positive",
            "PublishDate": 1768323591990,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indo Thai Securities Q3FY26 Profit Surges 1203%",
            "Summary": "Indo Thai Securities reported exceptional Q3FY26 results with standalone net profit jumping 1203% YoY to ₹1,739.24 lakhs. Revenue soared 399% to ₹2,762.99 lakhs driven by strong fair value gains.",
            "Sentiment": "positive",
            "PublishDate": 1768323554721,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indo Thai Securities Q3 FY26 Results Show Strong Growth",
            "Summary": "Indo Thai Securities reported exceptional Q3 FY26 performance with standalone revenue of ₹2,762.99 lakhs and net profit of ₹1,739.24 lakhs. The company also appointed Nishit Doshi as CFO.",
            "Sentiment": "positive",
            "PublishDate": 1768288328181,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indo Thai Securities Q3 Revenue Surges 404% YoY",
            "Summary": "Indo Thai Securities reported remarkable Q3 revenue growth of 404% year-on-year, with revenue jumping from ₹55 million to ₹277 million, demonstrating strong operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1768287639368,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indo Thai Securities Q3 Net Profit Jumps 1,689%",
            "Summary": "Indo Thai Securities reported consolidated net profit of ₹17.00 crores in Q3 compared to ₹0.95 crores in the previous year, marking exceptional growth of 1,689.47%.",
            "Sentiment": "positive",
            "PublishDate": 1768287589532,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indo Thai Securities Allots 2 Lakh Equity Shares",
            "Summary": "Indo Thai Securities Limited allotted 2,00,000 equity shares to Ashu Bishnoi following conversion of 20,000 warrants for ₹75.00 lakh on January 10, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768038344006,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indo Thai Securities CFO Deepak Sharma Resigns",
            "Summary": "Indo Thai Securities announces resignation of Chief Financial Officer Deepak Sharma effective January 13, 2026, citing pursuit of external professional opportunities. Company initiating search for replacement.",
            "Sentiment": "neutral",
            "PublishDate": 1767791633795,
            "Source": "stocks"
        },
        {
            "Title": "Indo Thai Securities Allots 30.95 Lakh Shares via Warrant Conversion",
            "Summary": "Indo Thai Securities Limited completed conversion of 3.10 lakh warrants into 30.95 lakh equity shares on December 31, 2025, raising ₹8.73 crores from four allottees including promoter group members.",
            "Sentiment": "positive",
            "PublishDate": 1767161379837,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndoThai Securities Board Reviews Preferential Issue Fund Utilization Report",
            "Summary": "IndoThai Securities Limited's Board considered the monitoring agency report on utilization of Rs. 118.20 crore preferential issue proceeds for the quarter ended September 30, 2025. CARE Ratings reported no deviations from stated objectives, with funds being used for augmenting margin deposits with stock exchanges and general corporate purposes as planned.",
            "Sentiment": "neutral",
            "PublishDate": 1763148148704,
            "Source": "corporate_action"
        },
        {
            "Title": "IndoThai Securities Converts 1.75 Lakh Warrants Into 17.5 Lakh Equity Shares",
            "Summary": "IndoThai Securities Limited's Preferential Allotment Committee approved the conversion of 1,75,000 equity convertible warrants into 17,50,000 equity shares with a face value of Rs. 1 each. The conversion was executed at a ratio of 1 warrant to 10 equity shares, adjusted after a stock split. Two non-promoter entities participated: Shrutina Nexgen LLP received 10,00,000 shares (0.80% shareholding) for Rs. 3.75 crore, and Frenzy Commercial Private Limited received 7,50,000 shares (0.60% shareholding) for Rs. 2.81 crore. The total consideration for the conversion was Rs. 6.56 crore, representing 75% of the issue price of Rs. 375 per warrant (adjusted to Rs. 37.5 due to stock split). The allotment was made pursuant to shareholder approval from an Extra-Ordinary General Meeting held in October 2024 and in-principle approvals from BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1761910098938,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo Thai Securities Approves Demerger of Broking Business and Q2 Financial Results",
            "Summary": "Indo Thai Securities Limited's Board approved the demerger of its Broking & Distribution undertaking into wholly-owned subsidiary Indo Thai Financial Services Limited in a 1:1 share exchange ratio. The Broking & Distribution division generated INR 26.72 crores turnover, representing 99.60% of the company's total standalone turnover for the year ended March 31, 2025. The demerger aims to enable focused business operations and unlock value for each vertical. Post-demerger, the resulting company's shareholding will change from 100% promoter ownership to 54.46% promoter and 45.54% public shareholding. The scheme requires approvals from shareholders, National Company Law Tribunal, SEBI, BSE, and NSE. The resulting entity will seek listing on BSE and NSE. The Board also approved unaudited standalone and consolidated financial results for the second quarter and half year ended September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760347189431,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo Thai Securities Reports Strong Q2 Performance with Net Profit Rising to 146M Rupees",
            "Summary": "Indo Thai Securities reported net profit of 146 million rupees for Q2, compared to 49 million rupees in the same period last year. The company's revenue increased to 236 million rupees from 97 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1760346825472,
            "Source": "earnings"
        },
        {
            "Title": "Indo Thai Securities Appoints New Secretarial Auditor and Amends Corporate Charter",
            "Summary": "Indo Thai Securities Limited shareholders approved two key resolutions at their Annual General Meeting on September 27, 2025. The company appointed M/s Kaushal Ameta & Co. as Secretarial Auditor for a five-year term from financial year 2025-26 to 2029-30. Kaushal Ameta, the practicing company secretary, has over 20 years of experience and holds commerce and law degrees. Shareholders also approved amendments to the company's Memorandum of Association, specifically replacing clauses 20 and 21 under the objects section. The new clauses expand the company's powers to sell, dispose or transfer business assets, and to engage in amalgamation, merger, absorption or demerger activities with other companies.",
            "Sentiment": "neutral",
            "PublishDate": 1758965777394,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo Thai Securities Incorporates Wholly Owned Subsidiary for Stock Broking Activities",
            "Summary": "Indo Thai Securities Limited has incorporated a wholly owned subsidiary named Indo Thai Financial Services Limited. The Certificate of Incorporation was issued by the Ministry of Corporate Affairs on September 14, 2025. The subsidiary has an authorized share capital of ₹30 lakh divided into 30 lakh equity shares of ₹1 each. Indo Thai Financial Services Limited will operate in stock broking and related activities. The entire paid-up share capital will be held by Indo Thai Securities Limited, making it a 100% subsidiary. This incorporation is classified as a related party transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1758189640063,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo Thai Securities Board Reviews Monitoring Agency Report on Issue Proceeds Utilization",
            "Summary": "Indo Thai Securities Limited's Board of Directors reviewed the monitoring agency report on utilization of issue proceeds during their 374th Board Meeting held on August 14, 2025. The report covered the quarter ended June 30, 2025, and was prepared by CARE Ratings Limited as the monitoring agency. The company had raised Rs. 118.20 crore through a preferential issue conducted from January 1-14, 2025, comprising equity shares worth Rs. 45.20 crore and convertible warrants worth Rs. 73 crore. The monitoring agency reported no deviations from the stated objects of the issue. Out of the total proceeds, Rs. 62.20 crore has been utilized, with Rs. 54.43 crore used for augmenting margin deposits with stock exchanges, providing permissible funding to clients and proprietary trading, and Rs. 7.77 crore for general corporate purposes. The remaining Rs. 20.91 crore is invested in liquid mutual funds (Rs. 20.73 crore) with the balance in the monitoring account. The funds were utilized in accordance with the offer document objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1755184723493,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo Thai Securities Schedules Board Meeting to Review Q1 Results and Consider Interim Dividend",
            "Summary": "Indo Thai Securities Limited has scheduled its 373rd Board Meeting for August 2, 2025, to review standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The board will also consider declaring an interim dividend for Financial Year 2025-26. The trading window for company insiders has been closed since July 1, 2025, and will remain closed until 48 hours after the financial results announcement. The meeting will be held at the company's registered office in Indore, Madhya Pradesh.",
            "Sentiment": "neutral",
            "PublishDate": 1753450854195,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo Thai Securities Notifies Shareholders of Pending IEPF Transfer for Unclaimed 2017-18 Dividends",
            "Summary": "Indo Thai Securities Limited has issued a notice to shareholders regarding the transfer of unclaimed dividends and corresponding shares to the Investor Education and Protection Fund (IEPF). The company's dividend declared for Financial Year 2017-18, which has remained unclaimed for seven consecutive years, will be credited to the IEPF Account on or after October 5, 2025. Shares on which dividends have not been paid or claimed for seven consecutive years will also be transferred to IEPF as per regulatory procedures. The company has notified affected shareholders that they must claim their unclaimed dividend amounts by October 5, 2025, or the shares will be transferred to IEPF Authority without further communication. Details of affected shareholders, including folio numbers and dividend amounts, are available on the company's website. Once transferred to IEPF, shareholders can only reclaim their shares by making a separate application to the IEPF Authority.",
            "Sentiment": "neutral",
            "PublishDate": 1753256114813,
            "Source": "corporate_action"
        }
    ]
}