{
    "Symbol": "INDOCO",
    "ISIN": "INE873D01024",
    "News": [
        {
            "Title": "Indoco Remedies Q3 FY26 Results Show Mixed Performance",
            "Summary": "Indoco Remedies reported 6.8% revenue growth in Q3 FY26 with improved international business performance, though domestic formulations remained flat amid acute therapy challenges.",
            "Sentiment": "neutral",
            "PublishDate": 1770748853971,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indoco Remedies Q3 Net Loss Widens to ₹298M",
            "Summary": "Indoco Remedies reported a consolidated net loss of ₹298 million in Q3, compared to a loss of ₹264 million in the same quarter of the previous year, representing a year-on-year deterioration.",
            "Sentiment": "negative",
            "PublishDate": 1770100646205,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indoco Remedies Office Inspected by GST Officials",
            "Summary": "GST officials conducted inspection at Indoco Remedies' office premises. The pharmaceutical company is cooperating with the ongoing investigations by providing necessary assistance to authorities.",
            "Sentiment": "neutral",
            "PublishDate": 1770097909301,
            "Source": "stocks"
        },
        {
            "Title": "Indoco Remedies Allots 55,700 Equity Shares Under ESOP",
            "Summary": "Indoco Remedies Limited allotted 55,700 equity shares worth Rs. 1,30,12,900 to its Employee Stock Option Plan trust, increasing paid-up capital to Rs. 18,46,07,210 comprising 9,23,03,605 equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1770092426197,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indoco Remedies Gets USFDA Approval for Generic Drug",
            "Summary": "Indoco Remedies receives final USFDA approval for Lacosamide Oral Solution 10 mg/ml, enabling launch of generic version of Vimpat Oral Solution in the US market.",
            "Sentiment": "positive",
            "PublishDate": 1769759897218,
            "Source": "stocks"
        },
        {
            "Title": "Indoco Remedies Q3FY26 Earnings Call on Feb 3",
            "Summary": "Indoco Remedies Limited has scheduled an earnings conference call on February 3, 2026, at 3:30 PM IST to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768889364480,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indoco Remedies Gets USFDA EIR for API Plant",
            "Summary": "Indoco Remedies receives Establishment Inspection Report from USFDA for its API manufacturing facility in Patalganga following successful inspection.",
            "Sentiment": "positive",
            "PublishDate": 1765455805637,
            "Source": "stocks"
        },
        {
            "Title": "Indoco Remedies Senior Management Personnel Ajay Karajagi to Retire",
            "Summary": "Ajay Karajagi, President-Sales Marketing at Indoco Remedies Limited, will retire from the company effective close of business hours on November 30, 2025. The pharmaceutical company has notified stock exchanges NSE and BSE about this senior management personnel change as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1764328867647,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indoco Remedies Promoters Transfer 51.27% Stake to Kare Family Private Trust",
            "Summary": "The Kare family promoters of Indoco Remedies transferred 4.72 crore shares (51.27% stake) to their newly formed Kare Family Private Trust through off-market transactions. The transfers occurred between family members including Suresh Govind Kare, Aruna Suresh Kare, Aditi Milind Panandikar, and Madhura Suresh Kare for succession planning and asset streamlining purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1764318123450,
            "Source": "corporate_action"
        },
        {
            "Title": "Indoco Remedies Reports 8.8% Revenue Growth in Q2 FY26 Earnings Call",
            "Summary": "Indoco Remedies Limited reported standalone net revenues of INR 4,293 million for Q2 FY26, representing 8.8% growth compared to INR 3,946 million in the same quarter last year. Consolidated revenues reached INR 4,718 million, up 9.6% from INR 4,307 million year-over-year. Standalone EBITDA margin was 12.4% at INR 534 million versus 13.4% in the previous year. The company launched 6 new products in the India market during the quarter, including Vepazil anti-infective and TuspelAA for COPD conditions. The US FDA completed an inspection of the API manufacturing facility at Patalganga with zero observations. The company received final ANDA approval from US FDA for Rivaroxaban tablets. Domestic formulation revenues were INR 2,261 million compared to INR 2,346 million previously, while international formulation revenues increased to INR 1,533 million from INR 1,262 million. US business revenues grew to INR 336 million from INR 247 million, and emerging markets revenues rose significantly to INR 618 million from INR 396 million. API business revenues increased to INR 431 million from INR 301 million. Management expressed confidence about returning to consistent financial performance, noting this was the first quarter showing an uptick after difficult periods due to planned and unplanned plant shutdowns.",
            "Sentiment": "positive",
            "PublishDate": 1762810050142,
            "Source": "earnings"
        },
        {
            "Title": "Indoco Remedies Reports Reduced Net Loss and Higher Revenue in Q2 Results",
            "Summary": "Indoco Remedies reported a net loss of 79 million rupees in Q2, an improvement from the previous year's loss of 96 million rupees. The company's revenue increased to 4.8 billion rupees compared to 4.3 billion rupees in the same period last year. EBITDA rose to 431 million rupees from 403 million rupees year-over-year, though the EBITDA margin declined slightly to 8.9% from 9.3% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762409154503,
            "Source": "earnings"
        },
        {
            "Title": "Indoco Remedies Receives Zero Observations from USFDA Inspection at Patalganga API Facility",
            "Summary": "The USFDA completed an inspection of Indoco Remedies' API manufacturing facility at Patalganga with zero observations. The company views this outcome as a reflection of its commitment to quality and regulatory compliance.",
            "Sentiment": "positive",
            "PublishDate": 1758273014843,
            "Source": "stock"
        },
        {
            "Title": "Indoco Remedies Signs ₹24.65 Crore Sale-Leaseback Deal for Waluj Facility",
            "Summary": "Indoco Remedies has entered into a sale and leaseback agreement valued at ₹24.65 crore with OPC Asset Solution. The agreement covers the company's Waluj facility and Anacipher CRO, with the lease arrangement extending until 2035.",
            "Sentiment": "neutral",
            "PublishDate": 1756542070945,
            "Source": "stock"
        },
        {
            "Title": "Indoco Remedies Sets September 4 Record Date for Rs. 0.20 Final Dividend",
            "Summary": "Indoco Remedies Limited has set September 4, 2025, as the record date for determining shareholder eligibility for a final dividend of Rs. 0.20 per equity share for the financial year ended March 31, 2025. The company's share transfer books will be closed from September 5-11, 2025, for the AGM and dividend payment purposes. The dividend was recommended by the Board of Directors on May 22, 2025, and is subject to shareholder approval at the 78th Annual General Meeting scheduled for September 11, 2025. If approved, the dividend will be paid within 30 days after tax deduction. The company has also fixed September 4, 2025, as the cut-off date for remote e-voting and e-voting during the AGM.",
            "Sentiment": "positive",
            "PublishDate": 1755168460623,
            "Source": "corporate_action"
        },
        {
            "Title": "Indoco Remedies Receives USFDA Approval for Rivaroxaban Tablets",
            "Summary": "Indoco Remedies has received final ANDA approval from the USFDA for Rivaroxaban tablets. This regulatory approval allows the company to manufacture and market the generic version of this medication in the US market.",
            "Sentiment": "positive",
            "PublishDate": 1755059221354,
            "Source": "stock"
        },
        {
            "Title": "Indoco Remedies Promoters Complete Inter-Group Share Transfer of 28,100 Equity Shares",
            "Summary": "Aditi M. Panandikar and Madhura S. Kare acquired 28,100 equity shares of Indoco Remedies Ltd through open market purchases on August 7-8, 2025. Simultaneously, Megh M. Panandikar, Mahika M. Panandikar, and Rohan A. Ramani sold an equivalent 28,100 shares. The transactions involved promoter group members, with Aditi M. Panandikar purchasing 20,800 shares and Madhura S. Kare acquiring 7,300 shares. Post-transaction, the combined promoter group holding remained unchanged at 1,09,31,545 shares, representing 11.85% of Indoco Remedies' total equity capital. The company's share capital consists of 9,22,47,905 equity shares of Rs. 2 each, totaling Rs. 18,44,95,810.",
            "Sentiment": "neutral",
            "PublishDate": 1754656225843,
            "Source": "corporate_action"
        },
        {
            "Title": "Indoco Remedies Reports Sale of 272.1 Million Rupees with Decade-Long Lease Costs of 379.8 Million Rupees",
            "Summary": "Indoco Remedies has completed a sale transaction worth 272.1 million rupees. The pharmaceutical company will incur lease costs totaling 379.8 million rupees over a ten-year period in connection with this transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1754044457489,
            "Source": "stock"
        },
        {
            "Title": "Indoco Remedies Completes Rs 27.21 Crore Sale-Leaseback Deal for Waluj Facility Equipment",
            "Summary": "Indoco Remedies Limited executed a sale and leaseback transaction for movable properties at its Waluj facility in Aurangabad, Maharashtra. The company sold equipment to OPC Asset Solution Pvt. Ltd for Rs 27.21 crores and simultaneously entered a 10-year lease agreement to continue using the same assets. The lease runs from August 2025 to July 2035, with total lease payments of Rs 37.98 crores and a security deposit of Rs 2.72 crores. The transaction involves no related parties and creates no conflict of interest. Manufacturing and business operations will remain unaffected as the company retains usage rights through the lease arrangement.",
            "Sentiment": "neutral",
            "PublishDate": 1754043134827,
            "Source": "corporate_action"
        },
        {
            "Title": "Indoco Remedies Plans 4-5 New Product Filings, Debt Reduction of Rs 68 Crore",
            "Summary": "Indoco Remedies announced plans to file 4-5 new products in FY26. The company's management expects to repay Rs 68 crore of debt in the remaining nine months of FY26. For its domestic business, the company expects to add at least 25,000 per man in incremental PHY by year end. The company plans to limit capital expenditure going forward, with only Rs 50 crore incremental capex expected this year, focused on ongoing projects at Goa Plant 2 and the API site for Warren Remedies.",
            "Sentiment": "positive",
            "PublishDate": 1753415107278,
            "Source": "stock"
        },
        {
            "Title": "Indoco Remedies Reports Q1 Net Loss of 358M Rupees Against Previous Year's Profit",
            "Summary": "Indoco Remedies reported a consolidated net loss of 358 million rupees in Q1 compared to a profit of 26.2 million rupees in the same quarter last year. Revenue increased marginally to 4.4 billion rupees from 4.3 billion rupees year-over-year. EBITDA declined significantly to 103.5 million rupees from 364.5 million rupees, with EBITDA margin dropping to 2.41% from 8.59% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1753339122689,
            "Source": "earnings"
        },
        {
            "Title": "Indoco Remedies Reports Loss of Rs 2,840 Lakhs in Q1 Despite 12.5% Revenue Growth",
            "Summary": "Indoco Remedies Limited reported quarterly results showing revenue from operations of Rs 38,383 lakhs, representing a 12.5% growth compared to the previous quarter's Rs 34,107 lakhs. However, the company recorded a loss before tax of Rs 2,840 lakhs, contrasting with a profit of Rs 1,951 lakhs in the same quarter of the previous year. The net loss for the period was Rs 2,806 lakhs compared to a profit of Rs 1,495 lakhs in the prior year quarter. EBITDA improved to Rs 148 million from Rs 35 million in the previous quarter. The company operates in the pharmaceuticals segment with revenue split between India (Rs 22,256 lakhs) and outside India (Rs 16,127 lakhs). Two subsidiaries, FPP Holding LLC and Warren Remedies Private Limited, reported significant losses and negative net worth, raising going concern uncertainties, though management believes no impairment provision is necessary based on their assessment.",
            "Sentiment": "negative",
            "PublishDate": 1753339094142,
            "Source": "earnings"
        },
        {
            "Title": "Indoco Remedies Receives EU GMP Compliance Certificate for Goa Plant II Sterile Manufacturing Facility",
            "Summary": "Indoco Remedies has received an EU GMP (Good Manufacturing Practice) compliance certificate for its sterile drug manufacturing facility at Goa Plant II. This certification validates the company's manufacturing standards meet European Union regulatory requirements for pharmaceutical production.",
            "Sentiment": "positive",
            "PublishDate": 1753329340352,
            "Source": "stock"
        },
        {
            "Title": "GST Authority Drops Legal Proceedings Against Indoco Remedies",
            "Summary": "The GST Authority has discontinued legal proceedings against Indoco Remedies, effectively dropping a potential demand of ₹85 million. This decision removes a significant financial liability that the company was facing.",
            "Sentiment": "positive",
            "PublishDate": 1749639731000,
            "Source": "default"
        },
        {
            "Title": "Indoco Remedies: UK Subsidiary Launches Generic Heart Medication",
            "Summary": "Indoco Remedies' UK subsidiary has launched Ticagrelor film-coated tablets 90mg, a generic medication to reduce heart attack risk. The drug will be distributed by Clarity Pharma across the UK.",
            "Sentiment": "positive",
            "PublishDate": 1748944187000,
            "Source": "normal_news"
        },
        {
            "Title": "Indoco Remedies Launches Ticagrelor Tablets in UK",
            "Summary": "Indoco Remedies has announced the launch of Ticagrelor film-coated tablets in the United Kingdom through its subsidiary. This move expands the company's product offering in the UK pharmaceutical market.",
            "Sentiment": "positive",
            "PublishDate": 1748936030000,
            "Source": "default"
        },
        {
            "Title": "Indoco Remedies Receives FDA Approval for Allopurinol Tablets",
            "Summary": "Indoco Remedies has received final approval from the U.S. Food and Drug Administration (USFDA) for Allopurinol Tablets USP 200 mg.",
            "Sentiment": "positive",
            "PublishDate": 1747979048000,
            "Source": "default"
        },
        {
            "Title": "Indoco Remedies: Q4 Loss and Revenue Drop Trigger Share Slump",
            "Summary": "Indoco Remedies reported a Q4 consolidated net loss of ₹40.4 crore, compared to a profit last year. Revenue fell 12.5% to ₹384 crore. The company announced a final dividend of ₹0.20 per share. Following the results, the stock fell 7% to ₹242.40.",
            "Sentiment": "negative",
            "PublishDate": 1747907652000,
            "Source": "earnings"
        },
        {
            "Title": "Indoco Remedies Reports Q4 Financial Results",
            "Summary": "Indoco Remedies has reported its Q4 financial results. The company experienced an EBITDA loss of 7.8 million rupees, compared to a gain of 488 million rupees in the same quarter last year. Revenue decreased to 3.8 billion rupees from 4.4 billion rupees year-over-year. The company also reported a consolidated net loss of 400 million rupees, in contrast to a profit of 227 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747904669000,
            "Source": "result"
        },
        {
            "Title": "Indoco Remedies' Anacipher Facility Completes FDA Inspection with One Form 483",
            "Summary": "Indoco Remedies announced that its Anacipher facility has completed a U.S. Food and Drug Administration (FDA) inspection. At the conclusion of the inspection, the facility received one Form 483, which indicates that the FDA inspector observed conditions that may constitute violations of the Food Drug and Cosmetic (FD&C) Act and related Acts.",
            "Sentiment": "neutral",
            "PublishDate": 1741651558000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indoco Remedies: USFDA Completes Inspection of AnaCipher Facility",
            "Summary": "USFDA conducted a 5-day inspection of Indoco Remedies' clinical research wing AnaCipher in Hyderabad, covering clinical and bioanalytical phases of three BA/BE studies. The facility received one Form 483, which the company will respond to within the deadline.",
            "Sentiment": "neutral",
            "PublishDate": 1741607825000,
            "Source": "normal_news"
        },
        {
            "Title": "Indoco Remedies' Anacipher Facility Completes FDA Inspection with One Form 483",
            "Summary": "Indoco Remedies announced that its Anacipher facility has completed a U.S. Food and Drug Administration (FDA) inspection. The inspection concluded with the facility receiving one Form 483, which typically indicates observations of potential violations of FDA regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1741602886000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indoco Remedies: Q3 FY25 Reports Loss of ₹26.39 Crore, Revenue Down 10.64%",
            "Summary": "Indoco Remedies reported a Q3 FY25 loss of ₹26.39 crore, compared to a profit of ₹16.3 crore in Q3 FY24. Revenue decreased by 10.64% YoY and 5.11% QoQ. Operating income declined 151.73% YoY. EPS stands at ₹-3.16. SG&A expenses increased 8.43% YoY. Market cap is ₹3144.73 crore. Analyst consensus recommendation is Hold.",
            "Sentiment": "negative",
            "PublishDate": 1737523071000,
            "Source": "earnings"
        },
        {
            "Title": "Indoco Remedies: Q3 Revenue Declines Due to Regulated Market Challenges",
            "Summary": "Indoco Remedies reported lower Q3 revenues, down 10.6% YoY and 5.1% QoQ, primarily due to underperformance in regulated markets. This decline is attributed to ongoing remediation efforts following an FDA warning letter for its Goa Plant II and refurbishment of existing plants, affecting sales in the US, Europe, and Emerging Markets.",
            "Sentiment": "negative",
            "PublishDate": 1737519373000,
            "Source": "earnings"
        },
        {
            "Title": "Indoco Remedies Reports Significant Decline in Q3 EBITDA",
            "Summary": "Indoco Remedies experienced a substantial decrease in its third-quarter EBITDA, dropping from 629 million rupees to 120 million rupees year-over-year. The company's EBITDA margin also declined sharply, falling from 13.69% to 2.93% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1737442677000,
            "Source": "earnings"
        },
        {
            "Title": "Indoco Remedies Reports Q3 Revenue Decline",
            "Summary": "Indoco Remedies, a pharmaceutical company, has reported its third-quarter revenue. The company's revenue for Q3 stood at 4.1 billion rupees, compared to 4.6 billion rupees in the same period last year, indicating a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1737442610000,
            "Source": "earnings"
        },
        {
            "Title": "Indoco Remedies Reports Q3 Net Loss of 264 Million Rupees",
            "Summary": "Indoco Remedies, a pharmaceutical company, has reported a consolidated net loss of 264 million rupees for the third quarter. This represents a significant decline from the profit of 163 million rupees reported in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1737442581000,
            "Source": "earnings"
        },
        {
            "Title": "Indoco Remedies: FDA Warning Letter Triggers Share Price Plunge",
            "Summary": "Indoco Remedies shares fell over 8% after receiving a USFDA warning letter for two plants in its Goa facility. The company commits to resolving issues promptly while continuing to supply products to US customers. Separately, Indoco announced a partnership with Clarity Pharma UK to launch 20 products in the UK market over 18 months.",
            "Sentiment": "negative",
            "PublishDate": 1734418140000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indoco Remedies' Goa Facility Contributes Significantly to Revenue",
            "Summary": "Indoco Remedies has reported that its Goa facility accounts for 65-70% of the company's total revenue, highlighting the importance of this manufacturing unit to the company's overall financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1734415550000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indoco Remedies' Goa Facility Receives FDA Warning Letter",
            "Summary": "Indoco Remedies has announced that its manufacturing facility in Goa has received a warning letter from the United States Food and Drug Administration (USFDA). This development indicates potential regulatory compliance issues at the facility, which could impact the company's ability to manufacture and export certain products to the US market.",
            "Sentiment": "negative",
            "PublishDate": 1734415415000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indoco Remedies: Share Price Surges on UK Distribution Partnership",
            "Summary": "Indoco Remedies' stock rose 10% after announcing a strategic distribution partnership with Clarity Pharma UK. The company plans to launch 20 products in the UK market over 18 months. Separately, Indoco received a GST show-cause notice for Rs 15.51 crore, which it considers non-tenable.",
            "Sentiment": "positive",
            "PublishDate": 1733203798000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indoco Remedies Partners with Clarity Pharma for UK Distribution",
            "Summary": "Indoco Remedies has formed a strategic distribution partnership with Clarity Pharma in the UK. The company plans to launch approximately 20 products through Clarity Pharma over the next 18 months. Indoco Remedies will continue to supply all products to existing B2B clients under current partnerships.",
            "Sentiment": "positive",
            "PublishDate": 1733184431000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indoco Remedies to Continue B2B Partnership Supply",
            "Summary": "Indoco Remedies has announced that it will maintain its existing business-to-business (B2B) partnerships, continuing to supply all products to its clients under current agreements.",
            "Sentiment": "neutral",
            "PublishDate": 1733138595000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indoco Remedies Partners with Clarity Pharma for UK Distribution",
            "Summary": "Indoco Remedies has entered into a strategic distribution partnership with Clarity Pharma in the UK. The company plans to launch approximately 20 products through Clarity Pharma in the UK market over the next 18 months.",
            "Sentiment": "positive",
            "PublishDate": 1733138581000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indoco Remedies: FDA Approves Smoking Cessation Drug, Stock Rises",
            "Summary": "Indoco Remedies received USFDA approval for Varenicline Tablets, a generic version of Chantix, for smoking cessation. The drug will be manufactured at their Verna, Goa facility. The company's stock rose 2.73% to ₹310 on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1730271206000,
            "Source": "normal_news"
        },
        {
            "Title": "Indoco Remedies Receives FDA Approval for Varenicline Tablets",
            "Summary": "Indoco Remedies has obtained final ANDA (Abbreviated New Drug Application) approval from the U.S. Food and Drug Administration (USFDA) for Varenicline Tablets. This approval allows the company to manufacture and market this generic medication in the United States.",
            "Sentiment": "positive",
            "PublishDate": 1730268464000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indoco Remedies Reports Q2 EBITDA Decline",
            "Summary": "Indoco Remedies has reported a significant decrease in its Q2 EBITDA, falling to 402.5 million rupees from 714 million rupees year-over-year. The company's EBITDA margin also contracted, dropping to 9.35% from 14.82% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1729753055000,
            "Source": "result"
        },
        {
            "Title": "Indoco Remedies Reports Q2 Revenue Decline",
            "Summary": "Indoco Remedies, an Indian pharmaceutical company, has reported its second quarter revenue for the current fiscal year. The company's revenue stood at 4.3 billion rupees, compared to 4.8 billion rupees in the same quarter of the previous year, indicating a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1729753039000,
            "Source": "result"
        },
        {
            "Title": "Indoco Remedies Reports Q2 Net Loss",
            "Summary": "Indoco Remedies, a pharmaceutical company, has reported a consolidated net loss of 96 million rupees for the second quarter, compared to a loss of 351 million rupees in the same period last year. This indicates a significant reduction in losses year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1729752993000,
            "Source": "result"
        },
        {
            "Title": "Indoco Remedies: FDA Maintains 'Official Action Indicated' Status for Goa Plants",
            "Summary": "<p>Indoco Remedies' Goa plant-II and III facilities received <span class='negative'>'Official Action Indicated' (OAI)</span> status from the <b>US FDA</b> following a July 2024 inspection. The company is working on a <span class='positive'>remedial action plan</span> to be completed by Q3 2024. Despite this, Indoco recently received <span class='positive'>FDA approval</span> for generic <b>Cetirizine Hydrochloride Tablets</b>.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728653866000,
            "Source": "normal_news"
        },
        {
            "Title": "INDOCO REMEDIES Receives USFDA Regulatory Status for Goa Plant",
            "Summary": "<p><span class='neutral'>INDOCO REMEDIES</span> has received an <b>update</b> from the <span class='neutral'>U.S. Food and Drug Administration (USFDA)</span> regarding the regulatory status of its facilities in <span class='neutral'>Goa</span>. The <span class='neutral'>USFDA</span> has <b>maintained</b> the inspection classification of the <span class='neutral'>Goa plant</span> as <span class='negative'>'Official Action Indicated' (OAI)</span>.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728649187000,
            "Source": "corporate_action"
        }
    ]
}