{
    "Symbol": "INDOAMIN",
    "ISIN": "INE760F01028",
    "News": [
        {
            "Title": "Indo Amines Q3FY26 Results: Revenue Up 4.8% YoY",
            "Summary": "Indo Amines Limited reported Q3FY26 standalone revenue of ₹26,872.68 lakhs, up 4.8% YoY. Net profit declined to ₹1,286.16 lakhs from ₹1,631.63 lakhs in Q3FY25, while nine-month profit grew 16.97% to ₹5,897.33 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1770454160792,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indo Amines Reports 31% Jump in Q2 Net Profit to 181 Million Rupees",
            "Summary": "Indo Amines delivered strong Q2 performance with consolidated net profit rising to 181 million rupees from 138 million rupees year-over-year, marking a 31% increase. Revenue grew to 2.8 billion rupees compared to 2.69 billion rupees in the same period last year. EBITDA surged to 320 million rupees from 240 million rupees, while EBITDA margin expanded significantly to 11.54% from 8.93% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1762957069880,
            "Source": "earnings"
        },
        {
            "Title": "Indo Amines Limited Shareholders Approve Appointment of Ms. Tejaswini Dalvi as Non-Executive Director",
            "Summary": "Indo Amines Limited announced that shareholders approved the appointment of Ms. Tejaswini Dalvi (DIN: 11127538) as Non-Executive Director through a postal ballot conducted via remote e-voting. The voting period ran from July 16, 2025 to August 14, 2025, with results declared on August 18, 2025. Out of 4,52,03,322 votes polled, 4,42,97,777 votes (97.99%) were cast in favor while 9,05,545 votes (2.00%) were against the resolution. The promoter and promoter group, holding 4,24,08,406 shares, voted unanimously in favor with 83.33% participation. Public non-institutional shareholders showed 32.69% participation with 90.82% voting in favor. The resolution required a special majority and was scrutinized by Mr. Vijay Yadav of AVS & Associates. The company has 36,160 total shareholders and trades on NSE (INDOAMIN) and BSE (524648).",
            "Sentiment": "positive",
            "PublishDate": 1755520789908,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo Amines Limited Reports Strong Q1 2025 Results, Schedules AGM for September 24",
            "Summary": "Indo Amines Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs. 27,094.39 lakhs and net profit of Rs. 2,548.63 lakhs, with earnings per share of Rs. 3.48. Consolidated revenue reached Rs. 28,758.53 lakhs with net profit of Rs. 2,884.11 lakhs. The company transferred leasehold land rights for Rs. 600 lakhs, generating a gain of Rs. 594.82 lakhs. The Board reappointed M/s. Gangan & Company as cost auditors for 2025-26, revised insider trading policies, and scheduled the 32nd Annual General Meeting for September 24, 2025, via video conferencing. Directors recommended a final dividend of Rs. 0.50 per equity share subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1755008735871,
            "Source": "earnings"
        },
        {
            "Title": "Indo Amines Reports Strong Q1 Performance with 49% Jump in Net Profit",
            "Summary": "Indo Amines delivered robust quarterly results with consolidated net profit rising to 288 million rupees from 193 million rupees year-over-year, marking a 49% increase. Revenue grew to 2.87 billion rupees compared to 2.65 billion rupees in the same period last year. EBITDA improved to 313 million rupees from 275 million rupees, while EBITDA margin expanded to 10.89% from 10.39% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1755005899638,
            "Source": "earnings"
        },
        {
            "Title": "Indo Amines Reports Q4 Financial Results",
            "Summary": "Indo Amines has released its Q4 financial results. The company's EBITDA increased to 248 million rupees from 174 million rupees year-over-year. The EBITDA margin improved to 8.70% from 6.88% in the same period. Consolidated net profit rose to 119 million rupees from 91.2 million rupees year-over-year and 113 million rupees quarter-over-quarter. Revenue for Q4 reached 2.85 billion rupees, up from 2.53 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747919325000,
            "Source": "result"
        },
        {
            "Title": "Indo Amines Reports Q2 Financial Results and Subsidiary Closure",
            "Summary": "Indo Amines has announced its Q2 financial results, showing a year-over-year increase in net profit from 129 million rupees to 161 million rupees. The company's revenue also grew from 2.26 billion rupees to 2.68 billion rupees compared to the same quarter last year. Additionally, Indo Amines reported that it is winding up its Malaysia unit.",
            "Sentiment": "positive",
            "PublishDate": 1731455905000,
            "Source": "result"
        }
    ]
}