{
    "Symbol": "INDOSTAR",
    "ISIN": "INE896L01010",
    "News": [
        {
            "Title": "IndoStar Capital Reports Q3 FY26 Results",
            "Summary": "IndoStar Capital Finance announced Q3 FY26 quarterly results for quarter ended December 31, 2025, with board approval of unaudited standalone and consolidated financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1770626916647,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndoStar Capital reschedules Q3FY26 results meet",
            "Summary": "IndoStar Capital Finance postponed its board meeting from January 29, 2026 to February 09, 2026 to consider Q3FY26 unaudited financial results due to unavoidable reasons.",
            "Sentiment": "neutral",
            "PublishDate": 1769524454552,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndoStar Capital Allots ₹500 Cr NCDs on Private Basis",
            "Summary": "IndoStar Capital Finance Limited successfully allotted 50,000 non-convertible debentures worth ₹500 crore through private placement, comprising three series with interest rates ranging from 8.85% to 9.10%.",
            "Sentiment": "positive",
            "PublishDate": 1769073000838,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndoStar Capital Finance announces key leadership changes",
            "Summary": "IndoStar Capital Finance re-designates CTO Amit Kothari as Chief AI Officer and appoints Shivam Choudhary as new CTO, effective January 20, 2026, strengthening its technology leadership team.",
            "Sentiment": "positive",
            "PublishDate": 1768920828058,
            "Source": "stocks"
        },
        {
            "Title": "IndoStar Capital Finance Auditor Firm Converts to LLP",
            "Summary": "IndoStar Capital Finance announces its statutory auditor M S K A & Associates has converted to LLP structure effective January 13, 2026, continuing audit services for remaining tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1768569655799,
            "Source": "stocks"
        },
        {
            "Title": "IndoStar Capital Allots 4,344 Equity Shares Under ESOP",
            "Summary": "IndoStar Capital Finance allotted 4,344 equity shares through exercise of stock options under ESOP Plans 2016 and 2018, increasing paid-up capital to ₹161.54 crores with 16.15 crore outstanding shares.",
            "Sentiment": "neutral",
            "PublishDate": 1768204695791,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndoStar Capital Finance Reports ₹136 Cr Sale",
            "Summary": "IndoStar Capital Finance announces asset sale worth ₹136 crores, covering outstanding dues of ₹109 crores, strengthening its financial position through strategic divestment.",
            "Sentiment": "positive",
            "PublishDate": 1767011585938,
            "Source": "stocks"
        },
        {
            "Title": "IndoStar Capital Finance Sells CV Loans to Phoenix ARC",
            "Summary": "IndoStar Capital Finance completed sale of commercial vehicle loan portfolio worth ₹136 crores to Phoenix ARC for ₹109 crores as part of asset restructuring strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1767011375603,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndoStar Appoints Amandeep Singh Sandhu as COO",
            "Summary": "IndoStar Capital Finance Limited has appointed Mr. Amandeep Singh Sandhu as Chief Operating Officer - Vehicle Finance, effective December 15, 2025. Sandhu brings 25 years of BFSI experience.",
            "Sentiment": "positive",
            "PublishDate": 1765770944950,
            "Source": "stocks"
        },
        {
            "Title": "Florintree Tecserv LLP Acquires 7.37% Stake in IndoStar Capital Finance Through Warrant Conversion",
            "Summary": "Florintree Tecserv LLP acquired 1,08,69,565 equity shares of IndoStar Capital Finance Limited on November 25, 2025, through conversion of warrants via preferential allotment. The acquisition increased Florintree's shareholding from nil to 7.37% of total voting capital, making it a significant stakeholder in the finance company.",
            "Sentiment": "neutral",
            "PublishDate": 1764307636687,
            "Source": "corporate_action"
        },
        {
            "Title": "IndoStar Capital Finance Allots 1.08 Crore Equity Shares Following Warrant Conversion",
            "Summary": "IndoStar Capital Finance Limited allotted 1,08,69,565 equity shares at Rs. 184 per share to Florintree Tecserv LLP following conversion of warrants, raising Rs. 149.99 crores in balance consideration. The allotment increases the company's paid-up equity share capital to Rs. 147.58 crores consisting of 14,75,82,801 fully paid-up equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764051138430,
            "Source": "corporate_action"
        },
        {
            "Title": "IndoStar Capital Finance Allots 3,501 Equity Shares Under ESOP Plan",
            "Summary": "IndoStar Capital Finance Limited has allotted 3,501 equity shares with a face value of INR 10 each following the exercise of stock options under the IndoStar ESOP Plan 2018. The allotment was approved by Mr. Randhir Singh, Managing Director designated as Executive Vice Chairman, based on authority granted by the Board of Directors in May 2025. Following this allotment, the company's paid-up equity share capital increased from INR 1,36,70,97,350 consisting of 13,67,09,735 equity shares to INR 1,36,71,32,360 consisting of 13,67,13,236 equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1762938052067,
            "Source": "corporate_action"
        },
        {
            "Title": "IndoStar Capital Reports 8% Sequential Disbursement Growth in Q2 FY26 Amid Strategic Transformation",
            "Summary": "IndoStar Capital Finance Limited reported quarterly disbursements of Rs. 927 crores compared to Rs. 858 crores in the previous quarter, marking 8% sequential growth. Net interest income increased 15.7% year-on-year to Rs. 190 crores, with net interest margin improving from 5.6% to 7.6%. The company completed sale of stressed assets worth Rs. 309.6 crores to an ARC for Rs. 220.3 crores as part of portfolio quality improvement. Net profit stood at Rs. 10.4 crores versus Rs. 18 crores in the same quarter last year. The company has transformed from corporate lending to retail NBFC focus, selling its housing finance subsidiary. Assets under management totaled Rs. 7,564 crores with gross Stage-III assets at 3.04% and net Stage-III at 1.13%. Weighted average cost of borrowing declined to 10.2% from 10.8% year-on-year. The company expanded its Micro LAP business to Andhra Pradesh after launching in Tamil Nadu, targeting 3-4 states this financial year. Capital adequacy remains strong at 37.3% with debt-to-equity ratio of 1.4x. Management expects disbursements to pick up in the second half, historically 1.4-1.5x of first half levels.",
            "Sentiment": "neutral",
            "PublishDate": 1762539516202,
            "Source": "earnings"
        },
        {
            "Title": "IndoStar Capital Finance Announces Leadership Change in Chief Business Officer Role",
            "Summary": "IndoStar Capital Finance Limited announced that Devaraj C resigned from his position as Chief Business Officer effective November 3, 2025, to pursue other career opportunities. The company appointed Arvind Uppal as the new Chief Business Officer effective November 4, 2025. Uppal was previously serving as Head-Collections and brings over 22 years of experience in strategy planning, sales marketing, business development, credit risk, and people management. He has expertise in both secured and unsecured loans with a track record in establishing profit centers and implementing growth strategies. The company plans to appoint a new Head-Collections in due course.",
            "Sentiment": "neutral",
            "PublishDate": 1762304615187,
            "Source": "corporate_governance"
        },
        {
            "Title": "IndoStar Capital Finance Reports No Deviation in Warrant Proceeds Utilization",
            "Summary": "IndoStar Capital Finance Limited confirmed that proceeds from its preferential issue of warrants were utilized as per the stated purposes in the Information Memorandum during the quarter ended September 30, 2025. The company reported nil deviation in fund utilization across two warrant allotments. The first allotment on May 26, 2024 consisted of 10,869,565 convertible warrants at INR 184 per warrant for total consideration of INR 1,999,999,960. The second allotment on November 26, 2024 comprised 113,949,323 convertible warrants at INR 184 per warrant for aggregate consideration of INR 2,566,675,432. Funds were allocated for growth objectives including capital augmentation and onward lending for commercial vehicle financing, housing finance, SME financing and retail lending businesses, with up to 25% designated for general corporate purposes. The company utilized 80% of total consideration for growth objectives, which aligns with the disclosed minimum requirement of 75%.",
            "Sentiment": "positive",
            "PublishDate": 1761851724403,
            "Source": "corporate_action"
        },
        {
            "Title": "IndoStar Capital Finance Reports AUM of ₹7,564 Crore and Disbursements of ₹927 Crore in Q2FY26",
            "Summary": "IndoStar Capital Finance Limited announced its financial results for the quarter ended September 30, 2025. The NBFC reported Assets Under Management (AUM) of ₹7,564 crore and disbursements of ₹927 crore for the quarter. The company operates in two focus segments: Vehicle Finance and Micro Loans Against Property. Key operational improvements include a reduction in weighted cost of funds to 10.17% in Q2FY26, down 67 basis points from 10.84% in Q2FY25, and operating costs decreased 13% quarter-on-quarter and 6% year-on-year. Gross Stage 3 assets stood at 3.04% and Net Stage 3 at 1.13%. The company made several senior management appointments including Vishal Goenka as Non-Executive Director, Amit Kumar Khan as COO M-LAP, Jasmine Bawa as CHRO, and Binoy Parikh as Chief Compliance Officer.",
            "Sentiment": "positive",
            "PublishDate": 1761850455826,
            "Source": "earnings"
        },
        {
            "Title": "IndoStar Capital Finance Reports 67% Decline in Quarterly Net Profit",
            "Summary": "IndoStar Capital Finance reported a consolidated net profit of 105 million rupees for the quarter, down from 317 million rupees in the same period last year. The company's revenue increased to 3.56 billion rupees compared to 3.5 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1761825932096,
            "Source": "earnings"
        },
        {
            "Title": "IndoStar Capital Finance Appoints Jasmine Bawa as Chief Human Resources Officer",
            "Summary": "IndoStar Capital Finance Limited appointed Ms. Jasmine Bawa as Chief Human Resources Officer, effective October 01, 2025. The appointment is classified as a Senior Management Personnel position and is a full-time employment role. Ms. Bawa brings over 15 years of experience across leading financial institutions and fintech companies, with expertise in talent engagement, performance management, HR business partnering, compensation management, and succession planning.",
            "Sentiment": "positive",
            "PublishDate": 1759318860513,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indostar Capital Finance Sells Stressed Vehicle Loans Worth ₹309.6 Crores to Phoenix ARC",
            "Summary": "Indostar Capital Finance has sold stressed vehicle loans valued at ₹309.6 crores to Phoenix ARC for ₹220.3 crores. The transaction represents a recovery of approximately 71% of the loan book value, indicating the company is divesting non-performing vehicle finance assets to Phoenix Asset Reconstruction Company.",
            "Sentiment": "neutral",
            "PublishDate": 1759201257301,
            "Source": "stock"
        },
        {
            "Title": "IndoStar Capital Finance Reports Mixed Q1 Results with One-Time Gain Boosting Net Profit to INR 535 Crores",
            "Summary": "IndoStar Capital Finance released its quarterly results showing net profit of INR 535 crores, significantly boosted by a one-time gain of INR 1,176 crores from divesting its housing finance subsidiary Niwas Housing Finance. The NBFC reported disbursements of INR 858 crores, down from INR 1,081 crores quarter-on-quarter and INR 1,416 crores year-on-year. Assets Under Management grew 9% year-on-year to INR 7,783 crores, while Net Interest Income increased 10% to INR 158 crores. The company revised its technical write-off policy to 200 days past due, resulting in INR 161 crores write-off, and made incremental provisions of INR 255 crores on select security receipts. Gross Stage 3 assets stood at 4.04% with Net Stage 3 assets at 1.68%. Collection efficiency showed EMI to EMI collection at 89% and EMI plus overdue collection at 94%, down from 97% quarter-on-quarter. The company has tightened credit policies and underwriting standards, targeting higher credit quality customers in the prime segment. IndoStar operates 450 branches across 23 states, focusing on vehicle finance (93% of AUM) and micro loans against property. The company targets AUM growth of 12-15% for the fiscal year and expects 15% increase in disbursements in the next quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1755597093200,
            "Source": "earnings"
        },
        {
            "Title": "IndoStar Capital Finance Appoints Amit Kumar Khan as Chief Operating Officer",
            "Summary": "IndoStar Capital Finance Limited appointed Mr. Amit Kumar Khan as Chief Operating Officer effective August 14, 2025, on a full-time employment basis. Khan brings over 25 years of experience in Banking & Financial Services, having managed business, underwriting, risk, and collections functions in secured and unsecured retail lending. He has held senior leadership positions at Grihum Housing Finance, HDFC Bank, and ICICI Bank. In his role as COO, Khan will be responsible for driving operational excellence, strengthening customer-centric retail lending solutions, and supporting the company's strategic growth vision.",
            "Sentiment": "positive",
            "PublishDate": 1755411414904,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indostar Capital Finance Targets Loan Book Growth Through Vehicle Finance and Housing Segments",
            "Summary": "Indostar Capital Finance is targeting expansion of its loan book with a focus on high-yield vehicle finance and affordable housing segments. The company aims to drive sustainable growth through its strengthened capital base, improved asset quality, and digitization initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1755102898004,
            "Source": "stock"
        },
        {
            "Title": "IndoStar Capital Finance Reports No Deviations in Warrant Proceeds Utilization for Quarter Ended June 30, 2025",
            "Summary": "IndoStar Capital Finance Limited confirmed that proceeds from their preferential issue of warrants were utilized as stated in the offer documents for the quarter ending June 30, 2025, with no deviations reported. The company had two warrant allotments: 10,869,565 convertible warrants allotted on May 26, 2024, at INR 184 per warrant for an aggregate consideration of INR 1,999,999,960, and 13,949,323 convertible warrants allotted on November 26, 2024, at INR 184 per warrant for an aggregate consideration of INR 2,566,675,432. Both warrants are convertible into equity shares with a face value of INR 10 each. The funds are allocated for growth objectives including augmenting capital base and onward lending for commercial vehicle financing, housing finance, SME financing and retail lending businesses (at least 75% of proceeds), and general corporate purposes (up to 25% of proceeds). CRISIL Ratings Limited serves as the monitoring agency for both issues.",
            "Sentiment": "neutral",
            "PublishDate": 1755092732381,
            "Source": "corporate_action"
        },
        {
            "Title": "IndoStar Capital Finance Reports Rs 53,544 Lakhs Profit After Exceptional Gain from Subsidiary Sale",
            "Summary": "IndoStar Capital Finance Limited reported a profit after tax of Rs 53,544 lakhs for the quarter ended June 30, 2025, driven by exceptional items worth Rs 1,17,595 lakhs from the divestment of subsidiary Niwas Housing Finance Private Limited. The company recorded a loss of Rs 47,151 lakhs before exceptional items due to higher impairment provisions of Rs 49,039 lakhs on financial instruments, including Rs 16,109 lakhs in loan write-offs and Rs 25,507 lakhs additional provisions on Security Receipts. Interest income stood at Rs 31,453 lakhs. The Board approved the quarterly results and appointed Binoy Parikh as Chief Compliance Officer effective October 1, 2025. The company's Annual General Meeting is scheduled for September 25, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755088374872,
            "Source": "earnings"
        },
        {
            "Title": "Indostar Capital Finance to Discuss ₹60 Billion Debenture Issuance",
            "Summary": "Indostar Capital Finance plans to discuss issuing non-convertible debentures worth up to ₹60 billion rupees on August 13. The discussion will focus on this debt fundraising initiative through the issuance of these fixed-income securities.",
            "Sentiment": "neutral",
            "PublishDate": 1754575225766,
            "Source": "corporate_action"
        },
        {
            "Title": "IndoStar Capital Finance Shareholders Approve Randhir Singh's Re-designation as Managing Director and Executive Vice Chairman",
            "Summary": "IndoStar Capital Finance Limited announced that shareholders approved the re-designation and appointment of Mr. Randhir Singh as Managing Director designated as Executive Vice Chairman through a postal ballot. The special resolution passed with 99.76% votes in favor and 0.24% against, with a total voter turnout of 73.87% of outstanding shares. The e-voting period ran from July 5 to August 3, 2025, and the resolution was deemed passed on August 3, 2025. The promoter and promoter group, holding 99,745,221 shares, voted unanimously in favor with 100% support. Among public institutions and non-institutions, the approval rate was 30.30% and 99.96% respectively.",
            "Sentiment": "positive",
            "PublishDate": 1754309348847,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indostar Capital Finance Sells Niwas Housing Finance to EQT Affiliate",
            "Summary": "Indostar Capital Finance has sold Niwas Housing Finance to an affiliate of EQT for ₹1,706 crores. The transaction involves the sale of a housing finance subsidiary, indicating a significant corporate action in the financial sector.",
            "Sentiment": "positive",
            "PublishDate": 1752805600000,
            "Source": "default"
        },
        {
            "Title": "Indostar Capital Finance Finalizes Sale of Niwas Housing Finance to EQT",
            "Summary": "Indostar Capital Finance has completed the sale of Niwas Housing Finance to EQT. The news indicates a significant corporate transaction involving the divestment of a housing finance subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1752764138000,
            "Source": "default"
        },
        {
            "Title": "Indostar Capital: Asset Quality Improvement and Branch Expansion Drive Growth",
            "Summary": "Indostar Capital's stock gained 21% post Q4 results. The company reported strong NII growth, improved asset quality, and sold stressed loans to an ARC. It aims to reduce cost-income ratio to 50%, expand branch network, and replace high-cost debt. Retail share in AUM reached 99% in FY25. Q4 net profit grew 2.6% to Rs36.2 crore, while gross NPA fell to 4.5%.",
            "Sentiment": "positive",
            "PublishDate": 1750951379000,
            "Source": "earnings"
        },
        {
            "Title": "Indostar Capital Finance Approves 4 Billion Rupee Non-Convertible Debenture Allocation",
            "Summary": "Indostar Capital Finance's Board has approved the allocation of Non-Convertible Debentures (NCDs) worth 4 billion rupees. This decision represents a significant financial move for the company, potentially aimed at raising capital or restructuring debt.",
            "Sentiment": "positive",
            "PublishDate": 1750330344000,
            "Source": "default"
        },
        {
            "Title": "Indostar Capital Finance Reports Q4 FY23 Financial Results",
            "Summary": "Indostar Capital Finance announced its Q4 FY23 consolidated net profit of 362 million rupees, showing a slight increase from 352.7 million rupees year-over-year. However, the company's revenue decreased to 3.7 billion rupees from 3.9 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1745972691000,
            "Source": "default"
        },
        {
            "Title": "IndoStar Capital Finance Reports Q4 Financial Results",
            "Summary": "IndoStar Capital Finance has announced its Q4 financial results. The company reported revenue of 3.7 billion rupees, down from 3.9 billion rupees year-over-year. However, consolidated net profit increased to 362 million rupees, up from 352.7 million rupees year-over-year and 277.2 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745941179000,
            "Source": "result"
        },
        {
            "Title": "Indostar Capital Finance: Asset Quality Improves, Business Grows",
            "Summary": "Indostar Capital Finance's stock has gained 15% in the past month, outperforming the BSE Financial Services index. The company reports stable asset quality, with GNPA ratio improving to 4.9% from 7.9%. It has increased focus on the vehicle segment, now 69% of the loan book. The company expects better profitability due to lower stress on asset quality, reduced financing costs, and growing AUM.",
            "Sentiment": "positive",
            "PublishDate": 1742476632000,
            "Source": "normal_news"
        },
        {
            "Title": "IndoStar Capital Finance Reports Q3 Revenue Growth",
            "Summary": "IndoStar Capital Finance has reported a revenue of 3.7 billion rupees for the third quarter, compared to 3 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737365294000,
            "Source": "earnings"
        },
        {
            "Title": "IndoStar Capital Finance Reports 64% Increase in Q3 Net Profit",
            "Summary": "IndoStar Capital Finance has announced its financial results for the third quarter, reporting a consolidated net profit of 277 million rupees. This represents a significant increase of approximately 64% compared to the same period last year when the company reported a net profit of 169 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1737365254000,
            "Source": "earnings"
        },
        {
            "Title": "Indostar Capital Finance: Madhu Kela Acquires 2.48% Stake",
            "Summary": "Ace investor Madhu Kela has acquired a 2.48% stake in Indostar Capital Finance, worth ₹83.8 crore. The company's stock rose 2.2% following the news. Indostar reported a 27.9% year-over-year increase in profit for Q2, with an 8.05% growth in topline.",
            "Sentiment": "positive",
            "PublishDate": 1736854312000,
            "Source": "block_deals"
        },
        {
            "Title": "Indostar Capital Finance Approves Sale of Legacy Corporate Loan Book",
            "Summary": "Indostar Capital Finance has approved the sale of its legacy corporate loan book, which includes stage 3 accounts with outstanding dues of 1.74 billion rupees. This move is likely aimed at cleaning up the company's balance sheet and potentially improving its financial position.",
            "Sentiment": "neutral",
            "PublishDate": 1735689823000,
            "Source": "corporate_action"
        },
        {
            "Title": "IndoStar Capital Finance Approves Sale of Legacy Corporate Loan Book",
            "Summary": "IndoStar Capital Finance has approved the sale of its legacy corporate loan book, which includes Stage 3 accounts with dues amounting to 1.74 billion rupees. This move is likely part of the company's strategy to manage its loan portfolio and potentially improve its financial position.",
            "Sentiment": "neutral",
            "PublishDate": 1735652439000,
            "Source": "corporate_action"
        },
        {
            "Title": "IndoStar Capital Finance: Steady Progress in Vehicle Finance Segment",
            "Summary": "IndoStar Capital Finance shows improvement in its core vehicle finance segment according to Q2 review by Motilal Oswal.",
            "Sentiment": "positive",
            "PublishDate": 1729574124000,
            "Source": "result"
        },
        {
            "Title": "IndoStar Capital Finance Q2 Asset Quality Update",
            "Summary": "IndoStar Capital Finance reported its Q2 asset quality metrics. The Gross Non-Performing Assets (GNPA) ratio remained stable at 4.97% quarter-on-quarter. However, the Net Non-Performing Assets (NNPA) ratio increased slightly from 2.36% to 2.50% compared to the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1729259791000,
            "Source": "result"
        },
        {
            "Title": "IndoStar Capital Finance Reports Q2 Revenue Growth",
            "Summary": "IndoStar Capital Finance has reported a revenue of 3.4 billion rupees for the second quarter, compared to 3.1 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729259781000,
            "Source": "result"
        },
        {
            "Title": "IndoStar Capital Finance Reports Q2 Profit Increase",
            "Summary": "IndoStar Capital Finance has announced its Q2 consolidated net profit of 317 million rupees, showing an increase from 248 million rupees year-over-year and 249 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729259771000,
            "Source": "result"
        },
        {
            "Title": "IndoStar Capital Finance Schedules Q2 Results Review",
            "Summary": "<p>IndoStar Capital Finance has announced a <span class='neutral'>board meeting</span> on <span class='neutral'>October 18</span> to <span class='neutral'>consider and review</span> the company's <span class='neutral'>financial results</span> for the <b>second quarter</b> of the current <span class='neutral'>fiscal year</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728567934000,
            "Source": "corporate_action"
        }
    ]
}