{
    "Symbol": "INDRAMEDCO",
    "ISIN": "INE681B01017",
    "News": [
        {
            "Title": "Indraprastha Medical Corporation Q3FY26 Results",
            "Summary": "Indraprastha Medical Corporation reported Q3FY26 revenue of ₹378.76 crore and net profit of ₹41.00 crore. Nine-month revenue reached ₹1159.12 crore with net profit of ₹141.92 crore.",
            "Sentiment": "positive",
            "PublishDate": 1770191843615,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indraprastha Medical Corp Reports Revenue Growth to Rs 3.8B in Q2",
            "Summary": "Indraprastha Medical Corp reported Q2 revenue of Rs 3.8 billion, up from Rs 3.5 billion in the same quarter last year. The company's EBITDA increased to Rs 713 million from Rs 636 million year-over-year. EBITDA margin improved to 18.72% compared to 18.19% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761996456074,
            "Source": "earnings"
        },
        {
            "Title": "Indraprastha Medical Corp Reports 16.6% Growth in Net Profit",
            "Summary": "Indraprastha Medical Corp reported a net profit of Rs 494.6 million for Q2, compared to Rs 424 million in the same period last year, representing a year-on-year increase of 16.6%.",
            "Sentiment": "positive",
            "PublishDate": 1761996070207,
            "Source": "earnings"
        },
        {
            "Title": "Indraprastha Medical Hits All-Time High on CGHS Tariff Revision",
            "Summary": "Indraprastha Medical Corporation shares reached an all-time high of Rs 624, gaining over 30% in two days and nearly 40% over five trading sessions. The rally follows the Central Government Health Services announcing its biggest tariff revision in 15 years, increasing package rates for nearly 2,000 medical procedures by 5-30%, particularly benefiting specialties like orthopaedics, cardiology, and oncology. The company, a joint venture between Apollo Hospitals and Delhi government, expects higher CGHS-linked revenues and improved average revenue per occupied bed from the tariff hike. The stock has gained 15% year-to-date and 44% over 12 months, though it's trading with an RSI of 82, indicating potential overbought conditions.",
            "Sentiment": "positive",
            "PublishDate": 1759900032948,
            "Source": "stock"
        },
        {
            "Title": "Indraprastha Medical Corporation Reports Q1 Results and Key Board Appointments",
            "Summary": "Indraprastha Medical Corporation Limited approved its unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 365.06 crore compared to Rs 347.86 crore in the same quarter last year, with profit after tax increasing to Rs 51.46 crore from Rs 44.77 crore year-on-year. Earnings per share stood at Rs 5.61 versus Rs 4.88 in the previous year quarter. The Board appointed Mr. Sudhir Jalan as an Independent Director for a five-year term from August 6, 2025 to August 5, 2030, subject to shareholder approval. The company scheduled its 37th Annual General Meeting for September 24, 2025, and fixed the record date as September 18, 2025 for dividend entitlement for 2024-25. Additionally, the Board re-appointed M/s Devarajan Swaminathan and Co. as Cost Auditors for 2025-26 and appointed M/s RSM & Co. as Secretarial Auditors for five years from 2025-26 to 2029-30, both subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1754485665875,
            "Source": "corporate_action"
        },
        {
            "Title": "Indraprastha Medical Corp Reports Growth in Q1 Financial Performance",
            "Summary": "Indraprastha Medical Corp reported Q1 EBITDA of 726 million rupees compared to 680 million rupees in the same period last year. The company's EBITDA margin improved to 19.89% from 19.54% year-over-year. Net profit increased to 515 million rupees from 448 million rupees in the previous year's corresponding quarter. Revenue grew to 3.7 billion rupees compared to 3.5 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754481952359,
            "Source": "earnings"
        },
        {
            "Title": "Indraprastha Medical Corp Reports Q4 Results and Declares Dividend",
            "Summary": "Indraprastha Medical Corp has announced its quarterly results and a dividend declaration. The company's Q4 EBITDA increased to 615 million rupees from 484 million rupees year-over-year, with EBITDA margin improving to 18.41% from 15.39%. Net profit for Q4 rose to 410 million rupees, up from 312 million rupees year-over-year and 328 million rupees quarter-on-quarter. Revenue for Q4 reached 3.3 billion rupees, compared to 3.14 billion rupees in the same quarter last year. Additionally, the company declared a dividend of 4.5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747399504000,
            "Source": "result"
        },
        {
            "Title": "Indraprastha Medical Corp Reports Improved Q3 EBITDA and Margin",
            "Summary": "Indraprastha Medical Corp has reported its Q3 financial results. The company's EBITDA increased to 527 million rupees, up from 475 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 16.22% from 15.54% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738586810000,
            "Source": "earnings"
        },
        {
            "Title": "Indraprastha Medical Corp Reports Q3 Profit and Revenue Growth",
            "Summary": "Indraprastha Medical Corp has announced its financial results for the third quarter. The company reported a net profit of 328 million rupees, up from 294 million rupees in the same period last year. Revenue also increased to 3.25 billion rupees from 3.06 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738586803000,
            "Source": "earnings"
        },
        {
            "Title": "Indraprastha Medical Corp Addresses Media Allegations on Kidney Transplant Practices",
            "Summary": "Indraprastha Medical Corporation has issued a disclosure in response to media allegations concerning an associate doctor. The company clarifies that the alleged irregularities in kidney transplant practices did not occur at their hospital.",
            "Sentiment": "neutral",
            "PublishDate": 1730685638000,
            "Source": "normal_news"
        },
        {
            "Title": "Indraprastha Medical Corp Reports Improved Q2 EBITDA and Margin",
            "Summary": "Indraprastha Medical Corp has announced its Q2 financial results. The company's EBITDA increased to 636 million rupees from 504 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 18.19% from 15.89% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730288930000,
            "Source": "result"
        },
        {
            "Title": "Indraprastha Medical Corp Reports Q2 Revenue Growth",
            "Summary": "Indraprastha Medical Corporation has reported a revenue of 3.5 billion rupees for the second quarter, compared to 3.17 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730288918000,
            "Source": "result"
        },
        {
            "Title": "Indraprastha Medical Corp Reports Q2 Profit Increase",
            "Summary": "Indraprastha Medical Corporation has reported a net profit of 424 million rupees for the second quarter, showing an increase from 328 million rupees in the same quarter last year (year-over-year) and 448 million rupees in the previous quarter (quarter-over-quarter).",
            "Sentiment": "positive",
            "PublishDate": 1730288908000,
            "Source": "result"
        }
    ]
}