{
    "Symbol": "INDSWFTLAB",
    "ISIN": "INE915B01019",
    "News": [
        {
            "Title": "Ind-Swift Labs Q3FY26 Monitoring Report Filed",
            "Summary": "Ind-Swift Laboratories submits Q3FY26 monitoring agency report for Rs. 314.60 crore preferential issue with no fund utilization during quarter and temporary fund transfer noted.",
            "Sentiment": "neutral",
            "PublishDate": 1770134305876,
            "Source": "stocks"
        },
        {
            "Title": "Ind-Swift Labs Q3FY26 Net Profit Jumps to ₹1074 Lakhs",
            "Summary": "Ind-Swift Laboratories reported strong Q3FY26 results with net profit of ₹1074.18 lakhs vs loss of ₹86.19 lakhs in Q3FY25. Revenue grew 23% to ₹14948.10 lakhs. Board approved leadership restructuring effective Feb 1, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769866587716,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ind-Swift Labs Submits Investor Presentation",
            "Summary": "Ind-Swift Laboratories Limited submitted its latest investor presentation to stock exchanges on January 14, 2026, highlighting the company's transformation into a pure-play formulations platform following the ₹1,650 crore API business divestment.",
            "Sentiment": "positive",
            "PublishDate": 1768397056391,
            "Source": "stocks"
        },
        {
            "Title": "Ind-Swift Labs completes share transmission process",
            "Summary": "Ind-Swift Laboratories Limited completes transmission of 2,32,057 equity shares to legal heirs of Late Mrs. Neera Mehta following regulatory approvals for amalgamation.",
            "Sentiment": "neutral",
            "PublishDate": 1766032226904,
            "Source": "stocks"
        },
        {
            "Title": "Ind-Swift Lab Gets EU-GMP Compliance Certificate",
            "Summary": "Ind-Swift Laboratories' Derabassi formulations facility receives EU-GMP compliance certificate from Hungary's regulatory authority, enhancing its pharmaceutical manufacturing credentials.",
            "Sentiment": "positive",
            "PublishDate": 1765804136734,
            "Source": "stocks"
        },
        {
            "Title": "Ind-Swift Laboratories Appoints Two Senior Management Personnel for Quality Operations",
            "Summary": "Ind-Swift Laboratories Limited appointed Mr. Dinesh Kashikar as Vice President-Site Quality Head and Mr. Vinayak N. Malik as Sr. General Manager (Quality Control) at their Global Business Unit, Jawaharpur, Derabasi Plant, effective December 08, 2025. Both appointments strengthen the company's quality management functions, with both professionals bringing extensive pharmaceutical industry experience in quality control and assurance operations.",
            "Sentiment": "positive",
            "PublishDate": 1765199332196,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ind-Swift Laboratories Receives Trading Approval for 81.24 Lakh Equity Shares from Amalgamation Scheme",
            "Summary": "Ind-Swift Laboratories Limited obtained trading approval from BSE and NSE for 81,24,698 equity shares of ₹10 each, issued pursuant to the amalgamation scheme with Ind-Swift Limited. The shares are listed and admitted for trading on both exchanges from December 5, 2025, affecting eligible shareholders of the transferor company who received these shares under the approved scheme of arrangement.",
            "Sentiment": "positive",
            "PublishDate": 1764917582746,
            "Source": "corporate_action"
        },
        {
            "Title": "Ind-Swift Lab Reports Mixed Q2 Results with 78% Profit Growth Despite EBITDA Decline",
            "Summary": "Ind-Swift Lab delivered strong quarterly performance with consolidated net profit surging to 80 million rupees from 45 million rupees year-over-year, while revenue grew to 1.53 billion rupees from 1.48 billion rupees. However, EBITDA declined significantly to 15 million rupees from 29 million rupees, causing the EBITDA margin to compress to 0.97% from 1.98% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1763134015564,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ind-Swift Laboratories Receives NSE Approval for Share Listing, Awaits BSE Clearance",
            "Summary": "Ind-Swift Laboratories Limited has received listing approval from the National Stock Exchange of India (NSE) on October 10, 2025, for equity shares allotted to eligible shareholders of Ind-Swift Limited under an approved scheme of amalgamation. The company filed listing applications with both NSE and BSE on September 12, 2025. While NSE approval has been granted, BSE approval is currently pending and expected shortly. Once BSE approval is received, the company will proceed with crediting shares to shareholders' Demat accounts and apply for trading approval. Shareholders will be able to trade the newly allotted equity shares only after trading approval is granted.",
            "Sentiment": "positive",
            "PublishDate": 1762286539999,
            "Source": "corporate_action"
        },
        {
            "Title": "IND-SWIFT LABORATORIES Forms 50:50 Joint Venture for Chandigarh Premier League Cricket Team",
            "Summary": "IND-SWIFT LABORATORIES LTD's investment committee approved the incorporation of a 50:50 joint venture with Mr. Nikhil Goel to participate in the first edition of the Chandigarh Premier League organized by the Union Territory Cricket Association. The joint venture will be structured as a Limited Liability Partnership (LLP) with the company contributing up to Rs. 2 crores. The venture's activities will include sponsorship/ownership of a cricket team in the CPL and participation in cricket tournaments and other sports-related initiatives. The company cited cricket's significant fan following and commercial potential in India, along with the strategic opportunity of associating with the CPL at its inception stage to build presence in the sports and entertainment ecosystem. The incorporation is subject to completion of statutory and regulatory formalities, and the investment does not constitute a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1757679840800,
            "Source": "order&deals"
        },
        {
            "Title": "Ind-Swift Laboratories Promoters Acquire 39.46 Lakh Shares Through Amalgamation Scheme",
            "Summary": "Ind-Swift Laboratories Limited's promoter and promoter group members acquired 39,46,094 equity shares valued over INR 10 lacs on August 25, 2025. The acquisition occurred through a scheme of arrangement for amalgamation between Ind-Swift Limited and Ind-Swift Laboratories Limited, approved by the National Company Law Tribunal, Chandigarh Bench on July 17, 2025. Six entities participated in the acquisition: S.R. Mehta (3,05,380 shares), Sunita Jain (2,71,860 shares), V.R. Mehta (2,88,204 shares), Neera Mehta (2,32,057 shares), Gopal Munjal (2,93,579 shares), and Essix Biosciences Limited (25,55,014 shares). The company submitted the required disclosure under SEBI insider trading regulations on August 27, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1756373856067,
            "Source": "corporate_action"
        },
        {
            "Title": "Ind-Swift Lab Reports Mixed Q1 Results with EBITDA Turnaround but Lower Net Profit",
            "Summary": "Ind-Swift Lab reported quarterly results showing EBITDA of 36 million rupees compared to a loss of 65 million rupees in the same period last year, with an EBITDA margin of 2.36%. Revenue increased to 1.53 billion rupees from 1.47 billion rupees year-over-year. However, consolidated net profit declined to 88 million rupees from 292 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1755093115359,
            "Source": "earnings"
        },
        {
            "Title": "Ind Swift Laboratories Reports Strong Financial Performance Following Merger Completion",
            "Summary": "Ind Swift Laboratories Limited announced audited financial results for the quarter and year ended March 31, 2025. The company reported standalone net profit of Rs. 256.09 crores for the year, with revenue from operations at Rs. 549.65 crores. The merger with Ind Swift Limited became effective on August 8, 2025, following NCLT approval on July 17, 2025. The company allotted 14.20 lakh preference shares to former Ind Swift Limited shareholders and approved their redemption. During the year, the company converted 15.32 lakh equity share warrants into equity shares and completed several asset sales including plant machinery to ANG Lifesciences for Rs. 38.40 crores. Exceptional items contributed Rs. 223.20 crores to profits, primarily from balances written back. The company's standalone basic earnings per share stood at Rs. 38.08 for the year.",
            "Sentiment": "positive",
            "PublishDate": 1754927319738,
            "Source": "earnings"
        },
        {
            "Title": "Ind Swift Limited and Ind Swift Laboratories Limited Complete Amalgamation with August 8, 2025 Effective Date",
            "Summary": "Ind Swift Limited (transferor company) and Ind Swift Laboratories Limited (transferee company) have completed their amalgamation scheme. Both companies filed Form INC-28 with the Registrar of Companies on August 8, 2025, establishing this date as the effective date for the merger. The amalgamation scheme involves the respective shareholders and creditors of both companies. Ind Swift Laboratories Limited trades on BSE under scrip code 532305 and on NSE under symbol INDSWFTLAB.",
            "Sentiment": "neutral",
            "PublishDate": 1754660550053,
            "Source": "corporate_action"
        },
        {
            "Title": "Ind-Swift Laboratories Merger with Ind-Swift Limited Gets NCLT Approval, Effective August 8, 2025",
            "Summary": "The National Company Law Tribunal has approved the merger of Ind-Swift Limited with Ind-Swift Laboratories Limited. The amalgamation will become effective on August 8, 2025, with March 31, 2024 as the appointed date. Shareholders of Ind-Swift Limited will receive shares of Ind-Swift Laboratories Limited, with August 14, 2025 set as the record date for determining eligible shareholders. Following the merger, Ind-Swift Limited will be dissolved without winding up. The authorized share capital of Ind-Swift Laboratories Limited will increase to Rs. 140 crores, comprising 11.5 crore equity shares of Rs. 10 each and 25 lakh cumulative redeemable preference shares of Rs. 100 each.",
            "Sentiment": "positive",
            "PublishDate": 1753968439280,
            "Source": "corporate_action"
        },
        {
            "Title": "Ind-Swift Laboratories Receives NCLT Approval for Merger with Ind-Swift Limited",
            "Summary": "Ind-Swift Laboratories Limited has received final approval from the National Company Law Tribunal for its merger with Ind-Swift Limited. The company received the certified copy of the order on July 28, 2025. The approved scheme involves the amalgamation of Ind-Swift Limited as the transferor company with Ind-Swift Laboratories Limited as the transferee company, affecting their respective shareholders and creditors. The order was passed by the NCLT Chandigarh Bench and a copy is available on the company's website.",
            "Sentiment": "positive",
            "PublishDate": 1753709180983,
            "Source": "corporate_action"
        },
        {
            "Title": "Ind-Swift Laboratories Approves 950 Million Rupee Investment in Khandelwal Finance",
            "Summary": "Ind-Swift Laboratories' board has approved an investment of 950 million rupees in Khandelwal Finance's Optionally Convertible Redeemable Preference Shares (OCRPS). This corporate action represents a significant financial decision by Ind-Swift Laboratories, potentially impacting its investment portfolio and relationship with Khandelwal Finance.",
            "Sentiment": "positive",
            "PublishDate": 1750245327000,
            "Source": "default"
        },
        {
            "Title": "Ind-Swift Laboratories Approves Short-Term Advance of 200 Million Rupees",
            "Summary": "Ind-Swift Laboratories has approved a short-term advance of up to 200 million rupees (approximately $2.4 million USD). This decision indicates that the company is seeking additional working capital, potentially for operational expenses or short-term investments.",
            "Sentiment": "neutral",
            "PublishDate": 1743166253000,
            "Source": "corporate_action"
        },
        {
            "Title": "IND-SWIFT LAB Reports Significant Decline in Q3 Financial Performance",
            "Summary": "IND-SWIFT LAB has reported a substantial decrease in its financial performance for the third quarter. The company's consolidated net profit dropped to 0.06 million rupees from 194 million rupees in the same period last year. Similarly, revenue fell sharply to 87 million rupees from 2.9 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739458338000,
            "Source": "earnings"
        },
        {
            "Title": "Ind Swift Laboratories Completes Land Purchase",
            "Summary": "Ind Swift Laboratories has finalized a land acquisition for a sum of 177.2 million rupees. This corporate action represents a significant investment in the company's physical assets.",
            "Sentiment": "positive",
            "PublishDate": 1735776497000,
            "Source": "corporate_action"
        },
        {
            "Title": "IND SWIFT LAB Completes Land Purchase for 177.2 Million Rupees",
            "Summary": "IND SWIFT LAB has finalized a land acquisition for a total cost of 177.2 million rupees. This purchase represents a significant corporate action, potentially indicating plans for expansion or new facilities.",
            "Sentiment": "positive",
            "PublishDate": 1735736328000,
            "Source": "corporate_action"
        },
        {
            "Title": "IND-SWIFT LAB Reports Q2 EBITDA Loss",
            "Summary": "IND-SWIFT LAB has reported a Q2 EBITDA loss of 118 million rupees, compared to a gain of 657 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1731337423000,
            "Source": "result"
        },
        {
            "Title": "IND-SWIFT LAB Reports Significant Drop in Q2 Profit and Revenue",
            "Summary": "IND-SWIFT LAB's Q2 consolidated net profit decreased to 4 million rupees from 317 million rupees year-over-year. The company's Q2 revenue also saw a substantial decline, falling to 120 million rupees from 2.9 billion rupees in the same period last year. Compared to the previous quarter, net profit decreased by 9 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1731337368000,
            "Source": "result"
        }
    ]
}