{
    "Symbol": "INDTERRAIN",
    "ISIN": "INE611L01021",
    "News": [
        {
            "Title": "Magadh Sugar Reports Strong Q3 Performance",
            "Summary": "Magadh Sugar & Energy Ltd announced Q3FY26 results with total income of ₹29,641.99 lakhs and net profit after tax of ₹2,508.55 lakhs, showing robust operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1770805582039,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indian Terrain Posts Q3 FY26 Profit of ₹2.56 Crores",
            "Summary": "Indian Terrain Fashions reported net profit of ₹2.56 crores in Q3 FY26 vs loss of ₹3.44 crores in Q3 FY25. Revenue grew 4.66% YoY to ₹101.40 crores despite nine-month losses.",
            "Sentiment": "positive",
            "PublishDate": 1770268686796,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indian Terrain Reconstitutes Audit Committee",
            "Summary": "Indian Terrain Fashions Limited reconstituted its Audit Committee on January 29, 2026, appointing Mrs. Nidhi Reddy as new member following the demise of Mr. P S Raghavan in November 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769687365904,
            "Source": "stocks"
        },
        {
            "Title": "Indian Terrain Fashions Independent Director P S Raghavan Passes Away",
            "Summary": "Indian Terrain Fashions Limited announced the demise of Mr. P S Raghavan, Independent Director and former Indian Foreign Service member, on 24 November 2025. His passing resulted in cessation of his directorship and positions as Chairman of Nomination and Remuneration Committee and Member of Audit Committee, requiring the company to reconstitute its board committees.",
            "Sentiment": "negative",
            "PublishDate": 1764082084575,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indian Terrain Plans Retail Expansion to 300+ Stores by FY27 with Omni-Channel Growth Strategy",
            "Summary": "Indian Terrain has outlined its growth strategy targeting double-digit revenue growth through omni-channel operations and expansion into tier-2 cities. The company plans to expand its retail network to over 300 stores by FY27 while strengthening digital and franchise operations. The strategy focuses on casualwear and athleisure segments, with emphasis on enhancing supply chain efficiency and inventory turnover to support margin expansion.",
            "Sentiment": "positive",
            "PublishDate": 1762784663139,
            "Source": "stock"
        },
        {
            "Title": "Indian Terrain Fashion Reports Strong Q2 Recovery with 17.6% Revenue Growth",
            "Summary": "Indian Terrain Fashion Limited reported a significant turnaround in its quarterly results with net revenue growing 17.6% year-on-year to ₹100.96 crores. The company achieved gross margin expansion to 40.3% from 37.4% in the previous year, driven by enhanced product mix and disciplined discounting. Operating EBITDA turned positive at ₹8.5 crores (8.4%) compared to negative ₹3.8 crores (-4.4%) in the same quarter last year. The company reported positive profit before tax of ₹1.14 crores (1.14%) versus a loss of ₹12.42 crores (-14.5%) in the previous year. MD & CEO Charath Narsimhan attributed the recovery to focused execution, improved primary sales, stronger festive momentum, and better sell-through across channels. The company maintained stable working capital with inventory days reduced to 79 from 97 year-on-year. Multi-brand outlets and online channels showed strong growth of ₹13 crores and ₹8 crores respectively year-on-year, aligning with the brand's asset-light distribution strategy.",
            "Sentiment": "positive",
            "PublishDate": 1762779371190,
            "Source": "earnings"
        },
        {
            "Title": "Indian Terrain Fashions Reports Net Loss of ₹6.19 Crore for Q1 FY26, Schedules 16th AGM",
            "Summary": "Indian Terrain Fashions Limited reported a net loss of ₹6.19 crore for the quarter ended June 30, 2025, compared to a loss of ₹15.27 crore in the same quarter last year. Revenue from operations remained flat at ₹68.78 crore versus ₹68.36 crore in Q1 FY25. The company's total expenses decreased to ₹76.08 crore from ₹90.30 crore year-over-year. The Board approved the unaudited quarterly results and set September 29, 2025, as the date for the 16th Annual General Meeting to be held virtually. Key agenda items include re-appointment of Mrs. Rama Rajagopal as Non-Executive Non-Independent Director and Mrs. Nidhi Reddy as Independent Director for a second five-year term. The company also appointed M/s. BP & Associates as Secretarial Auditors for five years and M/s. RVKS & Associates as Internal Auditors for FY 2025-26. The record date for AGM voting eligibility is set for September 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754987306326,
            "Source": "earnings"
        },
        {
            "Title": "Indian Terrain Fashions Receives Trading Approval for 49.48 Lakh Equity Shares from NSE and BSE",
            "Summary": "Indian Terrain Fashions Limited has received trading approval from NSE and BSE for 49,48,537 equity shares of Rs. 2/- each, issued at Rs. 50.52/- per share through preferential allotment to non-promoter entities and individuals. The shares were issued following the conversion of warrants into equity shares and are listed for trading from August 12, 2025. The shares carry distinctive numbers from 45718831 to 50667367 and are subject to lock-in until May 31, 2026. Both exchanges granted their approval on August 11, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754922838396,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Terrain Fashions Receives NSE Listing Approval for 49.48 Lakh Equity Shares",
            "Summary": "Indian Terrain Fashions Limited has received listing approval from the National Stock Exchange (NSE) for 49,48,537 equity shares of Rs. 2 each, priced at Rs. 50.52 per share. These shares were issued through preferential allotment to non-promoter entities and individuals, pursuant to conversion of warrants issued on preferential basis. The shares carry distinctive numbers from 45718831 to 50667367. NSE granted in-principle approval and confirmed the shares will be listed and admitted to trading upon receipt of confirmation from depositories NSDL/CDSL for credit to beneficiaries' accounts. The company had previously received in-principal approval from both NSE and BSE, and listing approval from BSE.",
            "Sentiment": "positive",
            "PublishDate": 1753795143689,
            "Source": "corporate_action"
        },
        {
            "Title": "BSE Approves Indian Terrain Fashions' Preferential Allotment of 49,48,537 Equity Shares",
            "Summary": "Indian Terrain Fashions has received approval from the Bombay Stock Exchange (BSE) for a preferential allotment of 49,48,537 equity shares to non-promoters. This corporate action suggests the company is raising capital through the issuance of new shares to selected investors outside the promoter group.",
            "Sentiment": "positive",
            "PublishDate": 1750421748000,
            "Source": "default"
        }
    ]
}