{
    "Symbol": "INDUSINDBK",
    "ISIN": "INE095A01012",
    "News": [
        {
            "Title": "IndusInd Bank Appoints Arijit Basu as Part-Time Chairman",
            "Summary": "IndusInd Bank announced leadership transition with Arijit Basu replacing Sunil Mehta as Part-Time Chairman effective January 31, 2026, following completion of Mehta's tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1769860842037,
            "Source": "stocks"
        },
        {
            "Title": "IndusInd Bank Updates Senior Management Team",
            "Summary": "IndusInd Bank announces changes to its Senior Management Personnel list, adding Manikantan Iyer and Shruti Kumar while removing Niraj Piyush Shah due to reporting hierarchy changes.",
            "Sentiment": "neutral",
            "PublishDate": 1769614906567,
            "Source": "stocks"
        },
        {
            "Title": "IndusInd Bank Appoints Ravi Pangal as CIO",
            "Summary": "IndusInd Bank designates Mr. Ravi Pangal as Chief Information Officer under Senior Management Personnel effective January 28, 2026. Pangal brings extensive experience from HSBC, Standard Chartered, and ANZ Bank.",
            "Sentiment": "positive",
            "PublishDate": 1769597655041,
            "Source": "stocks"
        },
        {
            "Title": "IndusInd Bank Faces Rs. 2.03 Lakh RBI Penalty",
            "Summary": "IndusInd Bank disclosed a Rs. 2.03 lakh penalty imposed by RBI on its Chennai Currency Chest for discrepancies in Soiled Note Remittance operations detected during examination.",
            "Sentiment": "negative",
            "PublishDate": 1769596949655,
            "Source": "stocks"
        },
        {
            "Title": "IndusInd Bank Q3 Net Profit Drops 91% to ₹1.30b",
            "Summary": "IndusInd Bank reports significant decline in Q3 net profit to ₹1.30 billion from ₹14.00 billion year-over-year, while revenue falls to ₹114.00 billion. Asset quality shows marginal improvement.",
            "Sentiment": "negative",
            "PublishDate": 1769473234118,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndusInd Bank focuses on CV loans, microfinance recovery",
            "Summary": "IndusInd Bank CEO Rajiv Anand outlines strategy to leverage commercial vehicle and microfinance portfolios for growth recovery, with loan book at ₹3.17 trillion in Q3.",
            "Sentiment": "neutral",
            "PublishDate": 1769191037091,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndusInd Bank Shows Stable Asset Quality Trends",
            "Summary": "IndusInd Bank reports stable asset quality across core businesses with microfinance segment showing early recovery signs, indicating improved operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1769181223099,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndusInd Bank Expects Microfinance Growth from Q4",
            "Summary": "IndusInd Bank executive anticipates growth momentum in the microfinance sector beginning from the fourth quarter, signaling potential recovery in this key business segment.",
            "Sentiment": "positive",
            "PublishDate": 1769173867327,
            "Source": "stocks"
        },
        {
            "Title": "IndusInd Bank Plans Strategic Leadership Changes",
            "Summary": "IndusInd Bank announces focus on retail deposits, no fundraising plans, and expects new CTO, CRO, and Head of Retail Banking appointments before fiscal year-end.",
            "Sentiment": "positive",
            "PublishDate": 1769170665692,
            "Source": "stocks"
        },
        {
            "Title": "IndusInd Bank Appoints Arijit Basu as New Chairman",
            "Summary": "IndusInd Bank announces leadership transition with Sunil Mehta completing his tenure on January 30, 2026, and Arijit Basu taking over as Part-time Chairman for three years starting January 31, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769150515029,
            "Source": "stocks"
        },
        {
            "Title": "IndusInd Bank Q3 Preview: PAT May Drop Up to 99%",
            "Summary": "IndusInd Bank expected to report sharp 78-99% YoY decline in Q3FY26 PAT, with NII potentially falling up to 18% amid muted loan growth and elevated credit costs according to brokerage estimates.",
            "Sentiment": "negative",
            "PublishDate": 1769091911573,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndusInd Bank Block Trade Worth ₹18.94 Crores on NSE",
            "Summary": "IndusInd Bank witnessed a significant block trade on NSE involving 200,673 shares valued at ₹18.94 crores, executed at ₹944.05 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768798392652,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndusInd Bank Q3FY26 Earnings Call on Jan 23, 2026",
            "Summary": "IndusInd Bank announces earnings call scheduled for January 23, 2026 at 5:00 PM IST to discuss Q3FY26 financial results with analysts and investors under SEBI Regulation 30.",
            "Sentiment": "neutral",
            "PublishDate": 1768313828575,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndusInd Bank Plans Board Expansion for Governance",
            "Summary": "IndusInd Bank is expanding its board from nine to around twelve members, including elevating two senior executives, as part of a governance overhaul amid regulatory scrutiny.",
            "Sentiment": "neutral",
            "PublishDate": 1767932302391,
            "Source": "stocks"
        },
        {
            "Title": "IndusInd Bank Plans Board Expansion for Better Governance",
            "Summary": "IndusInd Bank announces strategic initiative to expand its board structure as part of efforts to enhance corporate governance and strengthen organizational oversight mechanisms.",
            "Sentiment": "positive",
            "PublishDate": 1767927543437,
            "Source": "stocks"
        },
        {
            "Title": "IndusInd Bank Q3FY26 Results Board Meet on Jan 23",
            "Summary": "IndusInd Bank announces board meeting scheduled for January 23, 2026, to approve Q3FY26 unaudited financial results. Trading window remains closed until January 25, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767705966744,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndusInd Bank Q3: Advances drop 13% YoY, deposits fall 4%",
            "Summary": "IndusInd Bank reports net advances of ₹3.18 lakh crore, down 13% YoY, while deposits decline 4% to ₹3.94 lakh crore. CASA ratio remains under pressure at 30.30% amid challenging operating environment.",
            "Sentiment": "negative",
            "PublishDate": 1767622474708,
            "Source": "co_actions_results"
        },
        {
            "Title": "IndusInd Bank sees senior exits, new appointments",
            "Summary": "Two senior executives resign from IndusInd Bank while the lender strengthens leadership with fresh appointments including new heads for wholesale banking and data operations.",
            "Sentiment": "neutral",
            "PublishDate": 1767408362159,
            "Source": "stocks"
        },
        {
            "Title": "IndusInd Bank Gets ESG Rating of 72 for FY 2025",
            "Summary": "SES ESG Research Private Limited independently assigned an ESG rating of 72 to IndusInd Bank for FY 2025. The rating was disclosed under SEBI regulations on January 2, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767371270135,
            "Source": "stocks"
        },
        {
            "Title": "IndusInd Bank Senior Executives Resign",
            "Summary": "IndusInd Bank announces resignation of two senior management personnel - Rana Vikram Anand (Head Customer Management) and Anish Behl (Head Wealth and Para Banking) effective January 30 and April 1, 2026 respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1767349239389,
            "Source": "stocks"
        },
        {
            "Title": "IndusInd Bank Grants 95,000 Stock Options to Employees",
            "Summary": "IndusInd Bank's Compensation Committee approved grant of 95,000 stock options to 5 eligible employees at ₹839.60 per share with 3-year vesting period and 5-year exercise window under ESOP scheme.",
            "Sentiment": "positive",
            "PublishDate": 1767104136782,
            "Source": "stocks"
        },
        {
            "Title": "SFIO probes IndusInd Bank over ₹2,600 cr fraud",
            "Summary": "The Serious Fraud Investigation Office has launched a formal investigation into IndusInd Bank under Section 212 of the Companies Act following accounting discrepancies worth ₹2,600 crores involving derivatives trades and senior executives.",
            "Sentiment": "negative",
            "PublishDate": 1766589870200,
            "Source": "stocks"
        },
        {
            "Title": "IndusInd Bank Receives Formal SFIO Investigation Letter",
            "Summary": "IndusInd Bank receives formal investigation letter from SFIO dated December 23, 2025, under Section 212 of Companies Act 2013, following earlier reporting of accounting irregularities in June 2025.",
            "Sentiment": "negative",
            "PublishDate": 1766577335528,
            "Source": "stocks"
        },
        {
            "Title": "IndusInd Bank Clarifies SFIO Probe Under RBI Mandate",
            "Summary": "IndusInd Bank clarifies SFIO probe was reported under RBI mandate for fraud cases above ₹1 crore, involving derivative trades and unsubstantiated balances, with SFIO seeking additional details.",
            "Sentiment": "neutral",
            "PublishDate": 1766029091053,
            "Source": "stocks"
        },
        {
            "Title": "IndusInd Bank CTO Shiv Bhasin Resigns",
            "Summary": "IndusInd Bank announces Chief Transformation Officer Shiv Bhasin's resignation effective January 16, 2026, to pursue opportunities outside the bank.",
            "Sentiment": "neutral",
            "PublishDate": 1765977839641,
            "Source": "stocks"
        },
        {
            "Title": "IndusInd Bank Receives ESG Rating of 83 from CFC Finlease",
            "Summary": "IndusInd Bank has been assigned an ESG rating of 83 by CFC Finlease Private Limited based on publicly available information for FY2025. The rating was independently assigned without bank engagement.",
            "Sentiment": "positive",
            "PublishDate": 1765385118098,
            "Source": "stocks"
        },
        {
            "Title": "IndusInd Bank Launches Jio-BP Mobility+ Credit Card",
            "Summary": "IndusInd Bank partners with Jio-BP to launch RuPay-powered Mobility+ Credit Card offering enhanced fuel rewards, lifestyle benefits, and UPI-enabled convenience across 2,050 stations.",
            "Sentiment": "positive",
            "PublishDate": 1765377001277,
            "Source": "stocks"
        },
        {
            "Title": "IndusInd Bank Chairman Sunil Mehta to Resign in January",
            "Summary": "IndusInd Bank announces that Chairman Sunil Mehta will step down from his position in January, marking a significant leadership transition for the private sector lender.",
            "Sentiment": "neutral",
            "PublishDate": 1765376408028,
            "Source": "stocks"
        },
        {
            "Title": "IndusInd Bank and Jio-bp Launch Co-branded Mobility Credit Card",
            "Summary": "IndusInd Bank and Jio-bp announced the launch of IndusInd Bank Jio-bp Mobility Credit Card, powered by RuPay network, offering fuel rewards across 2050 Jio-bp Mobility Stations with UPI-enabled convenience. The card targets digitally savvy consumers with features including 12 reward points per ₹100 spent at Jio-bp stations, up to 60 litres of free fuel annually, and up to 4.25% back on fuel purchases.",
            "Sentiment": "positive",
            "PublishDate": 1765363868884,
            "Source": "stock"
        },
        {
            "Title": "IndusInd Bank Chairman Sunil Mehta to Resign in January",
            "Summary": "IndusInd Bank Chairman Sunil Mehta will resign from his position in January. The leadership change will affect the bank's governance structure and stakeholders including investors and employees.",
            "Sentiment": "neutral",
            "PublishDate": 1765345035514,
            "Source": "corporate_governance"
        },
        {
            "Title": "IndusInd Bank Makes Timely Interest Payment of Rs. 114 Crores on Infrastructure Bonds",
            "Summary": "IndusInd Bank paid Rs. 114 crores as scheduled interest on December 9, 2025, for its Rs. 1,500 crore infrastructure bonds issued in December 2016. The payment was made on the due date in compliance with SEBI listing regulations, affecting bondholders of the NSE-listed securities.",
            "Sentiment": "positive",
            "PublishDate": 1765271291435,
            "Source": "corporate_action"
        },
        {
            "Title": "IndusInd Bank Appoints Ganesh Sankaran as Wholesale Banking Head",
            "Summary": "IndusInd Bank has appointed Ganesh Sankaran to the position of Wholesale Banking Head. This leadership appointment affects the bank's wholesale banking operations and organizational structure.",
            "Sentiment": "positive",
            "PublishDate": 1765237714148,
            "Source": "corporate_governance"
        },
        {
            "Title": "IndusInd Bank Denies Strategic Partner Discussions Amid Media Reports",
            "Summary": "IndusInd Bank clarified that no discussions for on-boarding a strategic partner are underway with anyone, responding to media reports about potential talks. The bank stated it remains well-capitalised, growth focused, and fully aligned with its strategic roadmap.",
            "Sentiment": "neutral",
            "PublishDate": 1764864147405,
            "Source": "stock"
        },
        {
            "Title": "IndusInd Bank Appoints Balaji Narayanamurthy as Chief Data Officer",
            "Summary": "IndusInd Bank has appointed Balaji Narayanamurthy as Chief Data Officer effective December 1, 2025. Narayanamurthy previously served as President & Head of Business Intelligence Unit and Head of Enterprise AI at Axis Bank.",
            "Sentiment": "positive",
            "PublishDate": 1764633606111,
            "Source": "corporate_governance"
        },
        {
            "Title": "IndusInd Bank Denies Media Reports on $1 Billion Capital Raising Plans",
            "Summary": "IndusInd Bank categorically denied recent media reports suggesting the bank was planning to raise capital through QIP route or had kickstarted $1 billion equity raising plans. The bank clarified that such news reports are speculative and factually inaccurate, stating they have not had any discussions regarding capital raising as reported in the media.",
            "Sentiment": "neutral",
            "PublishDate": 1763704917657,
            "Source": "stock"
        },
        {
            "Title": "IndusInd Bank Explores Potential Share Sale to Qualified Institutional Investors",
            "Summary": "IndusInd Bank is in the initial stages of assessing investor interest for a possible share sale to Qualified Institutional Investors (QIIs). The bank is evaluating market appetite before proceeding with any potential equity offering to institutional investors.",
            "Sentiment": "neutral",
            "PublishDate": 1763696802364,
            "Source": "corporate_action"
        },
        {
            "Title": "IndusInd Bank Plans Major Restructuring to Boost Profits and Address Performance Issues",
            "Summary": "IndusInd Bank is planning a major organizational restructuring aimed at boosting profits and addressing poor performance within the company. The restructuring will focus on removing low performers while maintaining overall employee count as part of a broader cleanup initiative.",
            "Sentiment": "neutral",
            "PublishDate": 1763609494487,
            "Source": "stock"
        },
        {
            "Title": "Mumbai Police EOW Finds No Criminal Conduct in IndusInd Bank Accounting Discrepancies, Probe Nearing Closure",
            "Summary": "Mumbai Police Economic Offences Wing has found no evidence of criminal conduct by IndusInd Bank executives regarding ₹1,950 crore and ₹258 crore accounting discrepancies. The investigation revealed the ₹1,950 crore figure was a genuine accounting error, not fund diversion or manipulation. The ₹258 crore entry, initially flagged by Grant Thornton's audit report as potentially used to boost net interest income, also showed no evidence of fund siphoning or criminality. EOW questioned executives including Sumant Kathpalia, Arun Khurana, and Gobind Jain but ruled out wrongdoing. Mumbai Police has written to RBI for clarification on technical points before formally closing the probe. With no evidence of criminality established, EOW expects to close the preliminary enquiry soon without filing an FIR.",
            "Sentiment": "positive",
            "PublishDate": 1763007764186,
            "Source": "stock"
        },
        {
            "Title": "IndusInd Bank Initiates Salary Clawback From Ex-CEO And Deputy CEO Over Misconduct",
            "Summary": "IndusInd Bank has begun clawing back salaries from its ex-CEO and deputy CEO following findings of misconduct. The bank is recovering compensation previously paid to these executives based on the misconduct determination.",
            "Sentiment": "negative",
            "PublishDate": 1762841543779,
            "Source": "corporate_governance"
        },
        {
            "Title": "IndusInd Bank Appoints Amitabh Kumar Singh as Chief Human Resources Officer",
            "Summary": "IndusInd Bank appointed Amitabh Kumar Singh as Chief Human Resources Officer and Senior Management Personnel effective November 10, 2025. Singh brings 28 years of overall experience, having worked with ICICI group for 21 years in his most recent stint. His last assignment was as CHRO for ICICI Home Finance. He previously spent 8 years with ICICI Prudential Life Insurance and 11 years with ICICI Bank. Singh holds a postgraduate degree in Human Resources from XISS, Ranchi and has prior experience with L&T Ltd, Atos Origin India, Tata Interactive Systems and Mphasis Limited.",
            "Sentiment": "positive",
            "PublishDate": 1762754576008,
            "Source": "corporate_governance"
        },
        {
            "Title": "IndusInd Bank Sets Record Date for Infrastructure Bond Interest Payment",
            "Summary": "IndusInd Bank announced a record date of November 24, 2025, for interest payment on its Infrastructure Bonds. The bank will pay Rs. 114 crores as interest due on December 9, 2025, for bonds issued on December 9, 2016. The bonds with ISIN number INE095A08058 are listed on the National Stock Exchange of India Limited. The actual payment date is scheduled for December 9, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762436983902,
            "Source": "corporate_action"
        },
        {
            "Title": "IndusInd Bank CEO Targets System-Level Growth After Governance Crisis Recovery",
            "Summary": "IndusInd Bank expects to grow in line with India's banking sector next year after completing an organizational overhaul following governance and accounting lapses. The bank experienced leadership changes with the exit of CEO Sumant Kathpalia and deputy Arun Khurana, took a $230 million hit to accounts, and posted its largest-ever loss in the March quarter. Under new CEO Rajiv Anand, the bank reported a net loss in the September quarter as loan and deposit portfolios shrank. Anand outlined a three-year turnaround plan: achieving system-level growth in financial year 2026-27, gaining market share the following year, and dominating chosen segments in the third year. The bank aims for 1% return on assets within 12-18 months, down from previous levels before the governance issues. IndusInd's stock has dropped 18% in 2025 versus an 8% rise in the Nifty 50. The bank will focus on growing its commercial vehicle financing business worth 358.80 billion rupees while reducing its microloan portfolio market share from over 10% to 6-8%. Anand stated the bank has adequate capital for the next couple of years and will explore new opportunities like wealth management and acquisition financing.",
            "Sentiment": "neutral",
            "PublishDate": 1762192363429,
            "Source": "stock"
        },
        {
            "Title": "IndusInd Bank Deputy Pays 50% of Alleged Insider Trading Gains to SEBI",
            "Summary": "Arun Khurana, deputy chief at IndusInd Bank, has deposited 50% of alleged insider trading gains with India's markets regulator SEBI, leading to the lifting of restrictions on his bank accounts. IndusInd Bank experienced a crisis involving governance and accounting irregularities, resulting in the departures of CEO Sumant Kathpalia and deputy Khurana. Six bank officials, including Khurana, were investigated by SEBI for insider trading and were barred from securities markets while ordered to deposit alleged illegal gains totaling 197.8 million rupees. The Securities Appellate Tribunal granted partial relief to Khurana in a September 25 order, requiring him to deposit half of the alleged gains to SEBI.",
            "Sentiment": "negative",
            "PublishDate": 1761320642381,
            "Source": "corporate_governance"
        },
        {
            "Title": "IndusInd Bank Reports Q2 Net Loss of 4.4 Billion Rupees, Revenue Declines to 116 Billion Rupees",
            "Summary": "IndusInd Bank reported a net loss of 4.4 billion rupees in Q2, an improvement from the 13.25 billion rupees loss in the same period last year. Revenue declined to 116 billion rupees compared to 127 billion rupees year-over-year. The bank's asset quality showed marginal improvement with Gross Non-Performing Assets (GNPA) at 3.6% versus 3.64% in the previous quarter, while Net Non-Performing Assets (NNPA) decreased to 1.04% from 1.12% quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1760918837874,
            "Source": "earnings"
        },
        {
            "Title": "IndusInd Bank Reports Net Loss of ₹437 Crores in Q2 FY26, Down from ₹1,331 Crores Profit Last Year",
            "Summary": "IndusInd Bank announced quarterly results showing a net loss of ₹437 crores in Q2 FY26 compared to a net profit of ₹1,331 crores in Q2 FY25. Net Interest Income declined to ₹4,409 crores from ₹5,347 crores year-over-year. Net Interest Margin compressed to 3.32% from 4.08% in the same quarter last year. Deposits decreased to ₹3,89,600 crores from ₹4,12,397 crores. The bank consolidated its balance sheet by reducing wholesale deposits and being cautious on microfinance disbursements. Asset quality showed mixed trends with Gross NPA improving to 3.60% from 3.64% in June 2025, while Net NPA decreased to 1.04% from 1.12%. The bank accelerated write-offs and increased provisions on microfinance as a prudent measure due to industry cyclical pressures. Capital Adequacy Ratio improved to 17.10% from 16.51% last year. MD & CEO Rajiv Anand stated the bank's core pre-provision operating profit remained stable quarter-on-quarter at Rs. 1,940 crores.",
            "Sentiment": "negative",
            "PublishDate": 1760781323844,
            "Source": "earnings"
        },
        {
            "Title": "IndusInd Bank Expected to Report Sharp Profit Decline in Q2 Results",
            "Summary": "IndusInd Bank is expected to report a significant drop in quarterly profit, with brokerage estimates ranging from Rs 240 crore to Rs 796 crore, representing potential year-on-year declines of up to 82%. The bank faces pressure from weak treasury income, elevated provisions from microfinance and commercial vehicle segments, and margin compression. Net Interest Income is projected to fall sharply by up to 21%, with estimates between Rs 4,200 crore and Rs 4,469 crore. Net Interest Margins are expected to contract sequentially due to sluggish loan growth and rising deposit costs. Operating profitability is anticipated to weaken due to lower treasury income and higher expenses. Loan and deposit growth are expected to remain tepid, with some brokerages projecting declines. Credit costs are likely to stay elevated around 1.9% due to continued stress in microfinance and retail portfolios. Market focus will be on commentary from the new CEO regarding the bank's growth strategy and asset quality trends.",
            "Sentiment": "negative",
            "PublishDate": 1760698013393,
            "Source": "earnings"
        },
        {
            "Title": "IndusInd Bank Clarifies Recent News Reports Not Related to New Investigation",
            "Summary": "IndusInd Bank has clarified that recent news reports are not connected to any new investigation and stated it complies with all required disclosures. The bank mentioned that FY25 results show all discrepancies and confirmed that a Rs 2.55 billion irregularity is not part of any new investigation, claiming that discrepancies have been properly addressed.",
            "Sentiment": "neutral",
            "PublishDate": 1760682008552,
            "Source": "stock"
        },
        {
            "Title": "EOW Investigates New ₹258 Crore Entry in IndusInd Bank Case",
            "Summary": "Mumbai Police Economic Offences Wing is investigating a newly discovered ₹258 crore entry in the IndusInd Bank case, separate from the previously reported ₹1,950 crore accounting mismatch in the bank's derivatives portfolio. The ₹258 crore figure was identified in a GT audit report covering 2015-2024, which indicates this amount was selectively used to boost the bank's net interest income during quarters when results fell short of market expectations. EOW officials stated the original ₹1,950 crore appears to be an accounting error with no evidence of criminality found so far. The mismatch reportedly arose from different accounting methods used by the bank's Asset-Liability Management desk and treasury desk for hedging. The agency plans to re-summon former executives Sumant Kathpalia, Arun Khurana, and Gobind Jain for questioning regarding the ₹258 crore entry. The audit report shows senior management was aware of accounting discrepancies by 2023 but only informed the board in March 2025. EOW has ruled out fund siphoning and insider trading angles, with the focus now on determining any potential criminality linked to the ₹258 crore entry.",
            "Sentiment": "negative",
            "PublishDate": 1760623219399,
            "Source": "corporate_governance"
        },
        {
            "Title": "IndusInd Bank Ex-CFO Allegedly Aware of Fraudulent Accounting Practices",
            "Summary": "IndusInd Bank's ex-CFO had knowledge of fraudulent accounting practices. Email evidence suggests the bank's treasury fraud may have originated in 2017 or potentially earlier.",
            "Sentiment": "negative",
            "PublishDate": 1760344599769,
            "Source": "corporate_governance"
        },
        {
            "Title": "IndusInd Bank Appoints Viral Damania as CFO in Leadership Restructuring",
            "Summary": "IndusInd Bank has made several senior executive appointments as part of a leadership overhaul under Managing Director and CEO Rajiv Anand. Viral Damania has been named Chief Financial Officer, bringing over 27 years of experience from Bank of America India where he served as CFO and board member of BofA Securities India Ltd. Other key appointments include Anand Vardhan as General Counsel with 26 years of legal experience from roles at Piramal Group and ICICI Bank, Pragati Gondhalekar as Head of Internal Audit with nearly three decades of experience from Deutsche Bank, Pankaj Sharma as Head of Business Transformation from Yes Bank, and Sheran Mehra as Chief Marketing Officer with experience from Tata Digital and DBS Bank. The appointments are aimed at accelerating growth, strengthening core banking operations, and driving sustainable value creation.",
            "Sentiment": "positive",
            "PublishDate": 1760014475303,
            "Source": "corporate_governance"
        }
    ]
}