{
    "Symbol": "INFOBEAN",
    "ISIN": "INE344S01016",
    "News": [
        {
            "Title": "InfoBeans Board Meeting Set for Feb 9 on EGM Notice",
            "Summary": "InfoBeans Technologies schedules board meeting on February 09, 2026 to approve EGM notice for scheme of amalgamation with InfoBeans CloudTech Ltd following NCLT orders.",
            "Sentiment": "neutral",
            "PublishDate": 1770392363311,
            "Source": "co_actions_results"
        },
        {
            "Title": "InfoBeans Makes Q3 FY26 Earnings Call Audio Available",
            "Summary": "InfoBeans Technologies has published the audio recording of its Q3 FY26 earnings call held on January 23, 2026, discussing unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769794809417,
            "Source": "co_actions_results"
        },
        {
            "Title": "InfoBeans Launches Expona 2.0 AI Agent Beta",
            "Summary": "InfoBeans Technologies unveils Expona 2.0 AI agent beta with 95% response accuracy, hybrid RAG architecture, and three-step deployment for enterprise knowledge management across websites and applications.",
            "Sentiment": "positive",
            "PublishDate": 1769596786423,
            "Source": "stocks"
        },
        {
            "Title": "InfoBeans Launches AI-Powered SDD Accelerator Tool",
            "Summary": "InfoBeans Technologies unveils Insane SDD Accelerator, an AI-powered development tool promising 50% faster delivery cycles, 50% fewer defects, and 70% savings on Dev Days for enterprise software engineering.",
            "Sentiment": "positive",
            "PublishDate": 1769533897404,
            "Source": "stocks"
        },
        {
            "Title": "InfoBeans Tech Q3 Net Profit Surges 175% to ₹19.30 Cr",
            "Summary": "InfoBeans Technologies reports consolidated net profit of ₹19.30 crores in Q3, marking a significant 175% year-on-year growth from ₹7.00 crores in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1769131191308,
            "Source": "co_actions_results"
        },
        {
            "Title": "InfoBeans Tech Board Meet Set for Jan 22, 2026",
            "Summary": "InfoBeans Technologies board to meet January 22, 2026 to consider bonus share issue, decide ratio, approve Q3 earnings and increase authorized share capital.",
            "Sentiment": "positive",
            "PublishDate": 1768809266363,
            "Source": "co_actions_results"
        },
        {
            "Title": "InfoBeans Technologies Responds to BSE Query on Share Price Movement",
            "Summary": "InfoBeans Technologies clarified to BSE that it has made all necessary disclosures and has not withheld any material information that could affect share price behavior. The company stated that recent significant price movements appear to be purely market-driven and beyond the company's control.",
            "Sentiment": "neutral",
            "PublishDate": 1765180347937,
            "Source": "stock"
        },
        {
            "Title": "Infobeans Tech Reports Strong Q2 Growth with 78% Jump in Net Profit",
            "Summary": "Infobeans Tech delivered robust Q2 financial performance with consolidated net profit rising to 226 million rupees from 127 million rupees year-over-year. Revenue grew to 1.25 billion rupees compared to 983 million rupees in the same period last year. The company's EBITDA increased to 314 million rupees from 191 million rupees year-over-year, while EBITDA margin improved to 24.99% from 19.43% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761664917537,
            "Source": "earnings"
        },
        {
            "Title": "Infobeans Technologies' Subsidiary Secures 50-Year Land Lease for IT Park Development",
            "Summary": "Infobeans Technologies announced that its subsidiary Ecolex Infra has secured a 50-year land lease agreement with MPSEDC for 3 acres of land. The land will be used to develop an IT park that will serve IT and ITES companies, including Infobeans Technologies itself.",
            "Sentiment": "positive",
            "PublishDate": 1760687477670,
            "Source": "stock"
        },
        {
            "Title": "InfoBeans Technologies Submits Scheme of Amalgamation with Wholly Owned Subsidiary InfoBeans CloudTech",
            "Summary": "InfoBeans Technologies Limited has submitted a Scheme of Amalgamation with its wholly owned subsidiary InfoBeans CloudTech Limited to stock exchanges. The scheme involves the merger of InfoBeans CloudTech (transferor company) with InfoBeans Technologies (transferee company) with an appointed date of April 1, 2025. The board of directors approved the scheme on May 2, 2025. Under the amalgamation, all assets, liabilities, and undertakings of InfoBeans CloudTech will transfer to InfoBeans Technologies. Since InfoBeans Technologies holds the entire share capital of InfoBeans CloudTech, no new shares will be issued and no cash consideration will be paid. The existing shares of InfoBeans CloudTech will be cancelled upon the scheme becoming effective. The scheme requires approval from the National Company Law Tribunal and other statutory authorities. InfoBeans CloudTech provides software consultancy services in CRM, ERP, cloud computing, AI/ML, and digital transformation. All employees of InfoBeans CloudTech will become employees of InfoBeans Technologies with continuous service and no less favorable terms.",
            "Sentiment": "neutral",
            "PublishDate": 1758113577236,
            "Source": "corporate_action"
        },
        {
            "Title": "InfoBeans Technologies Reports Strong Q1 FY26 Results with 58% EBITDA Growth",
            "Summary": "InfoBeans Technologies reported quarterly revenue of 124 crores, including 6 crores from US government employee retention credit received during the quarter. Excluding this extraordinary income, operational revenue stood at 118 crores. EBITDA grew 58% year-over-year to 30 crores, with EBITDA margin improving from 19% to 25%. PAT increased significantly from 8 crores to 23 crores year-over-year. The company is transitioning from a digital transformation company to an AI-led data engineering company, focusing on three technology areas: AI-led engineering, Salesforce, and ServiceNow. Geographic revenue mix shows US contributing 57%, Europe 28%, UAE 9%, and rest of world 6%. The company added new team members, reaching 1450+ employees, and onboarded six new clients during the quarter. InfoBeans completed a 10 crore buyback where promoters did not participate, and announced a dividend with record date of July 25th. The company closed its Vadodara office and now operates from four Indian offices and international locations in Frankfurt, Dubai, Silicon Valley and New York.",
            "Sentiment": "positive",
            "PublishDate": 1753801516859,
            "Source": "earnings"
        },
        {
            "Title": "InfoBeans Technologies Makes Earnings Call Audio Recording Available on Company Website",
            "Summary": "InfoBeans Technologies Ltd has published the audio recording of their earnings call on their company website. The earnings call was held on July 23, 2025, discussing the unaudited financial results for the quarter ended June 30, 2025. The company has provided a direct link to access the audio recording and notified stock exchanges including NSE and BSE about the availability of this recording.",
            "Sentiment": "neutral",
            "PublishDate": 1753344542341,
            "Source": "earnings"
        },
        {
            "Title": "Infobeans Tech Reports Strong Q1 Growth with Net Profit Surging to 233M Rupees",
            "Summary": "Infobeans Tech delivered robust quarterly performance with consolidated net profit jumping to 233 million rupees compared to 78 million rupees in the same period last year. Revenue grew to 1.1 billion rupees from 969 million rupees year-over-year. The company's EBITDA increased to 232 million rupees versus 156 million rupees, while EBITDA margin expanded to 20.75% from 16.12% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753199544221,
            "Source": "earnings"
        },
        {
            "Title": "Infobeans Technologies Completes Share Buyback",
            "Summary": "Infobeans Technologies has successfully completed a buyback of 215,520 equity shares. No additional details about the buyback price or timeline were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750683829000,
            "Source": "default"
        },
        {
            "Title": "InfoBeans Technologies to Consider Share Buyback",
            "Summary": "InfoBeans Technologies has announced a board meeting scheduled for May 15 to consider and approve a share buyback proposal. This corporate action, if approved, would involve the company repurchasing its own shares from the market.",
            "Sentiment": "positive",
            "PublishDate": 1747062743000,
            "Source": "default"
        },
        {
            "Title": "Infobeans Tech Reports Q4 FY2023 Financial Results",
            "Summary": "Infobeans Tech announced its Q4 financial results. Consolidated net profit increased to 105 million rupees, up from 92.4 million rupees year-over-year. Revenue rose to 1.03 billion rupees from 969 million rupees in the same period last year. The company recommended a final dividend of 1 rupee per share. An exceptional item of 12.6 million rupees was reported. Profit before tax (PBT) for Q4 stood at 163.4 million rupees, compared to 124.9 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1746403580000,
            "Source": "default"
        },
        {
            "Title": "InfoBeans Technologies Reports Q4 Profit Growth",
            "Summary": "InfoBeans Technologies has reported a consolidated net profit of 105 million rupees for the fourth quarter, showing an increase from 92.4 million rupees year-over-year and 70.6 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1746197373000,
            "Source": "result"
        },
        {
            "Title": "InfoBeans to Deploy GenAI Solution Quilo for Leading SDO",
            "Summary": "InfoBeans Technologies has announced that its generative AI solution, Quilo, will be deployed for a leading Software Development Organization (SDO). This implementation signifies InfoBeans' advancement in AI technology and its potential impact on software development processes.",
            "Sentiment": "positive",
            "PublishDate": 1744105357000,
            "Source": "order&deals"
        },
        {
            "Title": "InfoBeans to Drive AI Transformation for Canadian Standards Organization",
            "Summary": "InfoBeans has been selected to lead an AI-powered transformation project for one of Canada's largest standards developing organizations. This partnership aims to leverage artificial intelligence to enhance the organization's operations and capabilities in developing standards.",
            "Sentiment": "positive",
            "PublishDate": 1741854039000,
            "Source": "order&deals"
        },
        {
            "Title": "InfoBeans Technologies Reports Improved Q3 EBITDA and Margin",
            "Summary": "InfoBeans Technologies has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 108 million rupees to 144 million rupees. Additionally, the EBITDA margin expanded from 12.09% to 14.90%, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738041341000,
            "Source": "earnings"
        },
        {
            "Title": "InfoBeans Technologies Reports Q3 Revenue Growth",
            "Summary": "InfoBeans Technologies has reported a revenue of 963 million rupees for the third quarter, compared to 891 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738041298000,
            "Source": "earnings"
        },
        {
            "Title": "InfoBeans Technologies Reports Q3 Consolidated Net Profit Increase",
            "Summary": "InfoBeans Technologies has reported a consolidated net profit of 70 million rupees for the third quarter, compared to 56 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738041235000,
            "Source": "earnings"
        },
        {
            "Title": "InfoBeans Technologies Reports Strong Q2 EBITDA Growth",
            "Summary": "InfoBeans Technologies has reported significant year-over-year improvements in its Q2 financial results. The company's EBITDA increased to 191 million rupees from 111 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 19.43% from 12.19% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730095489000,
            "Source": "result"
        },
        {
            "Title": "InfoBeans Technologies Reports Strong Q2 Financial Results",
            "Summary": "InfoBeans Technologies has announced its Q2 consolidated financial results. The company's net profit increased significantly to 127 million rupees, up from 42 million rupees in the same quarter last year. Revenue also saw growth, reaching 983 million rupees compared to 909 million rupees in the previous year's Q2.",
            "Sentiment": "positive",
            "PublishDate": 1730095426000,
            "Source": "result"
        }
    ]
}