{
    "Symbol": "INFOMEDIA",
    "ISIN": "INE669A01022",
    "News": [
        {
            "Title": "Infomedia Press Reports Q3FY26 Loss of ₹91.46 Lakh",
            "Summary": "Infomedia Press Limited posted a net loss of ₹91.46 lakh for Q3FY26, widening from ₹88.55 lakh in Q3FY25. Nine-month losses reached ₹218.91 lakh with accumulated losses of ₹11,205.99 lakh.",
            "Sentiment": "negative",
            "PublishDate": 1768310411025,
            "Source": "co_actions_results"
        },
        {
            "Title": "Infomedia Press Limited Company Secretary Tasneem Cementwala Resigns",
            "Summary": "Tasneem Cementwala, Company Secretary and Compliance Officer at Infomedia Press Limited, resigned effective November 14, 2025 to pursue career opportunities outside the organization. The resignation affects a key managerial personnel position at the company, requiring the board to find a replacement for this regulatory compliance role.",
            "Sentiment": "neutral",
            "PublishDate": 1763144342371,
            "Source": "corporate_governance"
        },
        {
            "Title": "Infomedia Press Limited Reports Net Loss of ₹24.64 Lakh for Quarter Ended September 2025",
            "Summary": "Infomedia Press Limited's Board approved unaudited financial results for the quarter and half year ended September 30, 2025. The company reported a net loss of ₹24.64 lakh for the quarter and ₹127.45 lakh for the half year. The company has discontinued its operations and accumulated losses amount to ₹11,114.53 lakh, resulting in negative net worth. Finance costs were ₹65.36 lakh for the quarter. The company generated total income of ₹58.93 lakh for the quarter. Management is evaluating various options including starting a new line of business. Network18 Media & Investments Limited, the holding company, has provided a support letter to extend financial support. The auditors noted material uncertainty regarding the company's ability to continue as a going concern due to discontinued operations and accumulated losses.",
            "Sentiment": "negative",
            "PublishDate": 1760448129499,
            "Source": "earnings"
        },
        {
            "Title": "Infomedia Press Reappoints Independent Director, Names New Secretarial Auditor",
            "Summary": "Infomedia Press Limited shareholders approved the re-appointment of Vivek Jain as Independent Director for a second term of 3 years from September 24, 2025 to September 23, 2028. Jain previously served as Independent Director for 5 years starting September 24, 2020. Shareholders also approved the appointment of Akanksha Mota & Co. as Secretarial Auditor for a 5-year term from FY 2025-26 to FY 2029-30. The decisions were made at the company's 70th Annual General Meeting held on September 23, 2025. Akanksha Mota & Co. is led by Ms. Akanksha Mota, who has over 15 years of professional experience in corporate compliance and secretarial services.",
            "Sentiment": "neutral",
            "PublishDate": 1758634683181,
            "Source": "corporate_governance"
        },
        {
            "Title": "Infomedia Press Limited Reports Net Loss of ₹102.81 Lakh in Quarter Ended June 2025",
            "Summary": "Infomedia Press Limited reported a net loss of ₹102.81 lakh for the quarter ended June 30, 2025, compared to a loss of ₹106.09 lakh in the same quarter last year. The company has discontinued its operations and accumulated losses of ₹11,089.89 lakh, resulting in negative net worth. Total expenses for the quarter were ₹73.78 lakh, primarily consisting of finance costs of ₹73.71 lakh. The company recorded no income during the period. Earnings per share stood at ₹(0.21) for the quarter. Management is evaluating various options including starting a new line of business. Network18 Media & Investments Limited, the holding company, has provided a support letter to extend financial assistance as required. The board approved these results at a meeting held on July 14, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1753161120685,
            "Source": "earnings"
        }
    ]
}