{
    "Symbol": "INFY",
    "ISIN": "INE009A01021",
    "News": [
        {
            "Title": "Infosys Partners ExxonMobil for AI Cooling Solutions",
            "Summary": "Infosys expands collaboration with ExxonMobil to develop immersion cooling systems for AI infrastructure using Topaz and Cobalt platforms, targeting energy efficiency improvements.",
            "Sentiment": "positive",
            "PublishDate": 1770892563211,
            "Source": "stocks"
        },
        {
            "Title": "Infosys Partners with Citizens for AI Innovation Hub",
            "Summary": "Infosys announces strategic partnership with Citizens to establish AI-driven innovation hub focused on advancing banking technology solutions and digital transformation initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1770122900196,
            "Source": "stocks"
        },
        {
            "Title": "Infosys Expands Digital Partnership with MSG",
            "Summary": "Infosys strengthens and expands its digital collaboration with MSG, enhancing their strategic partnership to deliver advanced digital solutions and services.",
            "Sentiment": "positive",
            "PublishDate": 1770038620261,
            "Source": "stocks"
        },
        {
            "Title": "Infosys Receives USD 11,041.03 Penalty from California",
            "Summary": "Infosys Limited disclosed a penalty of USD 11,041.03 from California's Employment Development Department for late payment of State Unemployment Insurance for Q4FY25, with no material impact on operations.",
            "Sentiment": "negative",
            "PublishDate": 1769880587597,
            "Source": "stocks"
        },
        {
            "Title": "Infosys Unveils AI Innovations for Australian Open 2026",
            "Summary": "Infosys launches MatchFeel tactile experience for visually impaired fans, Rally AI mascot, and Keys to the Match insights powered by Infosys Topaz for Australian Open 2026, enhancing accessibility and fan engagement.",
            "Sentiment": "positive",
            "PublishDate": 1769661121131,
            "Source": "stocks"
        },
        {
            "Title": "Infosys Sees ₹66.90 Cr NSE Block Trade at ₹1659.10",
            "Summary": "Infosys witnessed a significant block trade on NSE worth ₹66.90 crores involving 403,201 shares at ₹1659.10 per share, indicating substantial institutional activity in the IT major's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1769575700981,
            "Source": "co_actions_results"
        },
        {
            "Title": "Infosys Partners with Cursor for AI Software Engineering",
            "Summary": "Infosys announces strategic collaboration with Cursor to establish Center of Excellence for AI-powered software development, aiming to accelerate enterprise system engineering with enhanced velocity and quality.",
            "Sentiment": "positive",
            "PublishDate": 1769517406305,
            "Source": "stocks"
        },
        {
            "Title": "Infosys shares rise 0.52% with strong trading volume",
            "Summary": "Infosys shares gained 0.52% to Rs 1,679.50 in Tuesday's session with over 65.4 lakh shares traded on NSE. The IT major showed consistent revenue growth from Rs 100,472 crore in 2021 to Rs 162,990 crore in 2025.",
            "Sentiment": "positive",
            "PublishDate": 1769506494439,
            "Source": "stocks"
        },
        {
            "Title": "TCS-Infosys Merger: A Hypothetical IT Giant Analysis",
            "Summary": "Analysis explores hypothetical merger creating Rs. 4,18,314 crore revenue giant with Rs. 75,547 crore profits, examining synergies and barriers that make such consolidation virtually impossible.",
            "Sentiment": "neutral",
            "PublishDate": 1769344892770,
            "Source": "stocks"
        },
        {
            "Title": "Infosys surveys employees on remote work energy use",
            "Summary": "Infosys collects household electricity consumption data from employees working remotely to measure environmental impact and enhance sustainability reporting under its hybrid work policy.",
            "Sentiment": "neutral",
            "PublishDate": 1769276270701,
            "Source": "stocks"
        },
        {
            "Title": "Infosys Announces Investor AI Day on February 17, 2026",
            "Summary": "Infosys Limited will host an Investor AI Day in Bengaluru on February 17, 2026, with live webcast available on company website. Event agenda to be finalized later.",
            "Sentiment": "neutral",
            "PublishDate": 1769188877387,
            "Source": "stocks"
        },
        {
            "Title": "Infosys Opens New Zurich Office to Boost AI Services",
            "Summary": "Infosys inaugurated its new Zurich office on January 23, 2026, relocating Swiss headquarters to The Circle at Zurich Airport. The strategic move strengthens the company's 25-year presence in Switzerland.",
            "Sentiment": "positive",
            "PublishDate": 1769171569236,
            "Source": "stocks"
        },
        {
            "Title": "Infosys Plans 20,000 Graduate Hires in FY27 Amid AI Growth",
            "Summary": "Infosys CEO announces ambitious hiring plan of 20,000 college graduates for FY27 as company capitalizes on AI-driven service demand across software development and customer service segments.",
            "Sentiment": "positive",
            "PublishDate": 1769141201405,
            "Source": "stocks"
        },
        {
            "Title": "Infosys CEO bullish on AI growth at Davos 2026",
            "Summary": "Salil Parekh highlights AI-driven opportunities with 90% of top clients engaged in AI projects, expects better outlook for next financial year despite sector pressures.",
            "Sentiment": "positive",
            "PublishDate": 1768989094457,
            "Source": "stocks"
        },
        {
            "Title": "Infosys Tops Global IT Brand Rankings at $16.4B",
            "Summary": "Infosys emerges as fastest growing IT services brand globally with 15% CAGR, securing top 3 position among most valuable IT brands valued at $16.4 billion with enhanced brand strength score.",
            "Sentiment": "positive",
            "PublishDate": 1768896229987,
            "Source": "stocks"
        },
        {
            "Title": "Infosys faces ₹8,600 cr MF selloff despite Q3 beat",
            "Summary": "Mutual funds sold ₹8,624 crore worth of Infosys shares in December, making it the most sold stock. However, the IT major's better-than-expected Q3 results and raised FY26 guidance have improved investor sentiment.",
            "Sentiment": "neutral",
            "PublishDate": 1768882221574,
            "Source": "mutualfunds"
        },
        {
            "Title": "ICICI Securities Maintains Hold on Infosys at ₹1,630",
            "Summary": "ICICI Securities maintains Hold rating on Infosys with target price of ₹1,630 following Q3FY26 results that showed marginal revenue beat but margin miss, citing strong order book momentum and AI-led demand uptick.",
            "Sentiment": "neutral",
            "PublishDate": 1768843033256,
            "Source": "co_actions_results"
        },
        {
            "Title": "Infosys Sees ₹171.51 Cr Block Trade on NSE",
            "Summary": "Infosys witnessed a significant block trade worth ₹171.51 crores on NSE involving 1,017,018 shares at ₹1,686.40 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768544766377,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sensex up 387 pts, Nifty gains 93 pts in afternoon trade",
            "Summary": "Sensex rises 0.46% to 83,770 and Nifty gains 0.36% to 25,759 in afternoon session, sustained by IT stocks rally after Infosys guidance boost.",
            "Sentiment": "positive",
            "PublishDate": 1768537121416,
            "Source": "stocks"
        },
        {
            "Title": "Infosys Shares Jump 5% on Guidance Raise & Strong Deals",
            "Summary": "Infosys shares surged 5.07% following FY26 guidance upgrade to 3-3.5% and $4.8 billion deal wins. Brokerages raise targets with JM Financial at ₹1,930, citing AI momentum and demand recovery signals.",
            "Sentiment": "positive",
            "PublishDate": 1768522890034,
            "Source": "co_actions_results"
        },
        {
            "Title": "Infosys shares may surge 10% as brokerages raise targets",
            "Summary": "Infosys upgraded FY26 revenue guidance to 3-3.5%, prompting multiple brokerages to raise target prices up to ₹2,076. ADRs surged 10% overnight despite mixed Q3 results.",
            "Sentiment": "positive",
            "PublishDate": 1768475959762,
            "Source": "stocks"
        },
        {
            "Title": "Infosys Completes Merger of Romanian Subsidiaries",
            "Summary": "Infosys announces completion of merger between two wholly owned step-down subsidiaries In-tech Engineering services S.R.L Romania and ProIT S.R.L.RO Romania on January 8, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768462859866,
            "Source": "co_actions_results"
        },
        {
            "Title": "Infosys Q3: Strong deal wins offset margin pressure",
            "Summary": "Infosys reported $4.8 billion in large deal wins for Q3, a nine-quarter high, while raising FY26 revenue guidance to 3-3.5%. However, Indian labour code changes impacted margins by 270 basis points.",
            "Sentiment": "positive",
            "PublishDate": 1768437542029,
            "Source": "co_actions_results"
        },
        {
            "Title": "Infosys CEO Denies Employee Detention Claims by US ICE",
            "Summary": "Infosys CEO Salil Parekh refuted viral social media claims about employee detention by US authorities, clarifying that the individual was denied entry and returned to India without detention or deportation.",
            "Sentiment": "neutral",
            "PublishDate": 1768411164113,
            "Source": "stocks"
        },
        {
            "Title": "Infosys Submits Q3 FY26 Auditor Reports with UDIN",
            "Summary": "Infosys Limited filed auditor reports for Q3 FY26 quarterly and nine-month financial results with stock exchanges, including comprehensive audit opinions from Deloitte on consolidated and standalone statements.",
            "Sentiment": "neutral",
            "PublishDate": 1768405155423,
            "Source": "co_actions_results"
        },
        {
            "Title": "Infosys Executive: Macro Environment Remains Stable",
            "Summary": "Infosys executive expresses confidence in stable macroeconomic conditions while company continues to show mixed sector performance with retail challenges and manufacturing AI benefits.",
            "Sentiment": "positive",
            "PublishDate": 1768392581780,
            "Source": "stocks"
        },
        {
            "Title": "Infosys ADRs fall 2% as Q3 profit dip offsets guidance upgrade",
            "Summary": "Infosys ADRs dropped 2% despite raising FY26 growth guidance to 3-3.5% as Q3 profit fell 2% YoY to ₹6,654 cr with operating margins contracting to 18.4% due to labour code provisions.",
            "Sentiment": "negative",
            "PublishDate": 1768387439509,
            "Source": "co_actions_results"
        },
        {
            "Title": "Infosys Employee Alleges Workplace Harassment",
            "Summary": "Long-term Infosys employee claims two years of systematic harassment and isolation, seeks external intervention after internal complaints yield no resolution.",
            "Sentiment": "negative",
            "PublishDate": 1768385442547,
            "Source": "stocks"
        },
        {
            "Title": "Infosys Among 25 Companies Announcing Q3 Results Today",
            "Summary": "Infosys leads 25 companies reporting Q3 earnings today. Brokerages expect high single-digit profit growth of up to 9% YoY and revenue growth of 8-9% for the IT major.",
            "Sentiment": "neutral",
            "PublishDate": 1768356830030,
            "Source": "co_actions_results"
        },
        {
            "Title": "Infosys Q3 Preview: AI Strategy Under Spotlight",
            "Summary": "Infosys prepares for Q3 earnings amid AI transformation challenges, mega deal impacts, and shifting demand conditions. Company recalibrates Topaz platform strategy beyond productivity gains.",
            "Sentiment": "neutral",
            "PublishDate": 1768285788071,
            "Source": "co_actions_results"
        },
        {
            "Title": "Infosys Q3 Results Preview: Up to 9% YoY Growth Expected",
            "Summary": "Brokerages forecast Infosys Q3 results to show 8-9% YoY revenue growth and up to 9% PAT growth. Street focuses on FY26 guidance, deal pipeline updates, and margin outlook amid seasonal weakness.",
            "Sentiment": "neutral",
            "PublishDate": 1768280390740,
            "Source": "co_actions_results"
        },
        {
            "Title": "Infosys Launches AI Chatbot 'Ally' for Tennis Fans",
            "Summary": "Infosys unveils 'Ally', an AI-powered chatbot in partnership with ATP to enhance fan experience through real-time insights and interactive conversations. Partnership extended through 2028.",
            "Sentiment": "positive",
            "PublishDate": 1768263117580,
            "Source": "stocks"
        },
        {
            "Title": "Infosys Launches AI Chatbot 'Ally' for Tennis Fans",
            "Summary": "Infosys introduces 'Ally', an AI-powered chatbot designed to enhance fan experience through real-time insights and interactive chats, as part of extended ATP partnership running until 2028.",
            "Sentiment": "positive",
            "PublishDate": 1768212419981,
            "Source": "stocks"
        },
        {
            "Title": "Motilal Oswal Sets ₹2,150 Target for Infosys",
            "Summary": "Motilal Oswal maintains BUY rating on Infosys with ₹2,150 target price, citing 33% upside potential driven by AI services deployment and strategic partnership with Cognition.",
            "Sentiment": "positive",
            "PublishDate": 1768204440959,
            "Source": "stocks"
        },
        {
            "Title": "Infosys shares drop 0.91% ahead of Q3 FY26 results",
            "Summary": "Infosys stock declined to ₹1,599.40 in Monday's trading session, down 0.91% from previous close. The IT major is scheduled to announce Q3 FY26 financial results on January 14.",
            "Sentiment": "neutral",
            "PublishDate": 1768196009944,
            "Source": "stocks"
        },
        {
            "Title": "Infosys Faces Revenue Risk as Daimler Seeks New Supplier",
            "Summary": "Infosys potentially faces loss of over 33% of its $400 million yearly revenue as major client Daimler, one of its top three clients, explores alternative suppliers for software and equipment services.",
            "Sentiment": "negative",
            "PublishDate": 1768188302924,
            "Source": "stocks"
        },
        {
            "Title": "Infosys Q3 Results: Margins Firm Despite Soft Growth",
            "Summary": "Infosys is expected to report muted 2% sequential growth in Q3 with EBIT margins improving to 21.14%. Revenue projected at ₹45,204 crore while profit remains stable at ₹7,397 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1768186368814,
            "Source": "co_actions_results"
        },
        {
            "Title": "Infosys Risks $150M Loss from Major Client Contract",
            "Summary": "Infosys faces potential loss of $150 million annually from Daimler contract as workplace solutions segment awaits renewal amid execution disputes and billing delays.",
            "Sentiment": "negative",
            "PublishDate": 1768177136945,
            "Source": "co_actions_results"
        },
        {
            "Title": "Infosys partners with AWS to boost Gen AI adoption",
            "Summary": "Software major Infosys announces strategic collaboration with Amazon Web Services to accelerate enterprise adoption of generative artificial intelligence through combined expertise and solutions.",
            "Sentiment": "positive",
            "PublishDate": 1767935325769,
            "Source": "stocks"
        },
        {
            "Title": "Infosys shares in focus after Cognition AI partnership",
            "Summary": "Infosys shares gained attention following strategic collaboration with Cognition to integrate Devin AI software engineer into global operations through Topaz Fabric platform.",
            "Sentiment": "positive",
            "PublishDate": 1767833991757,
            "Source": "stocks"
        },
        {
            "Title": "Infosys Q3FY26 Results Announcement on January 14",
            "Summary": "Infosys Limited has scheduled its third quarter FY26 earnings announcement for January 14, 2026, at 3:45 PM IST, followed by press conference and investor call.",
            "Sentiment": "neutral",
            "PublishDate": 1767783438015,
            "Source": "co_actions_results"
        },
        {
            "Title": "Infosys, Cognition partner to deploy AI agent Devin globally",
            "Summary": "Infosys and Cognition announce strategic collaboration to scale deployment of AI software agent Devin across global enterprises. Partnership integrates autonomous engineering capabilities with Infosys Topaz Fabric for accelerated development.",
            "Sentiment": "positive",
            "PublishDate": 1767782589101,
            "Source": "stocks"
        },
        {
            "Title": "Infosys Partners with AWS for Generative AI Solutions",
            "Summary": "Infosys collaborates with Amazon Web Services to accelerate generative AI adoption in businesses by combining Infosys Topaz with Amazon Q Developer for enhanced software delivery and client value across industries.",
            "Sentiment": "positive",
            "PublishDate": 1767764411311,
            "Source": "stocks"
        },
        {
            "Title": "Infosys receives ₹40.73L penalty from tax authority",
            "Summary": "Infosys Limited has been penalized ₹40,72,525 by Deputy Commissioner of Commercial Taxes for alleged GST return mismatches in FY 2018-19, relating to credit notes declared in GSTR-1 vs GSTR-9.",
            "Sentiment": "negative",
            "PublishDate": 1767325141678,
            "Source": "stocks"
        },
        {
            "Title": "Infosys faces ₹7.49 cr penalty from commercial tax dept",
            "Summary": "Infosys Limited received penalty orders totaling ₹7.49 crores from Deputy Commissioner of Commercial Taxes for alleged export proceeds delays and ITC issues for FY 2021-22.",
            "Sentiment": "negative",
            "PublishDate": 1767088673838,
            "Source": "stocks"
        },
        {
            "Title": "Infosys Hikes Entry-Level Salaries Up to ₹21 Lakh",
            "Summary": "Infosys revises compensation structure for freshers, offering salaries ranging from ₹7-21 lakh annually across specialized roles as part of AI-first strategy expansion.",
            "Sentiment": "positive",
            "PublishDate": 1767020174926,
            "Source": "stocks"
        },
        {
            "Title": "Infosys offers up to ₹21L for specialist freshers",
            "Summary": "Infosys announces off-campus hiring for 2025 graduates with packages ranging ₹7-21 lakh for specialist roles as part of AI-first strategy, making it highest entry-level payer among Indian IT firms.",
            "Sentiment": "positive",
            "PublishDate": 1766743148968,
            "Source": "stocks"
        },
        {
            "Title": "Infosys Block Trade Worth ₹493.92 Crores on NSE",
            "Summary": "Infosys witnessed a significant block trade on NSE involving 2,934,049 shares valued at ₹493.92 crores, executed at ₹1,683.40 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1766394432927,
            "Source": "co_actions_results"
        },
        {
            "Title": "Infosys McCamish Pays $30K Penalty in Cyber Incident",
            "Summary": "Infosys McCamish Systems enters consent order with South Dakota Division of Insurance, paying $30,000 penalty to resolve 2023 data breach notification concerns without admitting violations.",
            "Sentiment": "negative",
            "PublishDate": 1766202631482,
            "Source": "stocks"
        },
        {
            "Title": "Infosys Clarifies ADR Price Volatility on NYSE",
            "Summary": "Infosys issued clarification after its ADR experienced volatility on NYSE on December 19, 2025, triggering two trading pauses. Company confirms no material events requiring disclosure under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1766202400869,
            "Source": "stocks"
        }
    ]
}