{
    "Symbol": "INGERRAND",
    "ISIN": "INE177A01018",
    "News": [
        {
            "Title": "Ingersoll-Rand India Q3 FY26 Revenue Jumps 19% to ₹455.48 Cr",
            "Summary": "Ingersoll-Rand India reported strong Q3 FY26 performance with revenue of ₹455.48 crores, up 19% YoY, driven by robust demand across industrial sectors and record production of large centrifugal compressors.",
            "Sentiment": "positive",
            "PublishDate": 1770898815165,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ingersoll Rand Board Meet Set for Feb 12, 2026",
            "Summary": "Ingersoll-Rand (India) Limited has scheduled a board meeting on February 12, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770097756519,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ingersoll-Rand India Declares Rs. 55 Interim Dividend Per Share",
            "Summary": "Ingersoll-Rand (India) Limited's Board declared an interim dividend of Rs. 55 per equity share of Rs. 10 each for the financial year ending March 31, 2026, with record date set for November 25, 2025. The dividend will be paid on December 11, 2025, to shareholders whose names appear in the register of members or beneficial owners list as of the record date.",
            "Sentiment": "positive",
            "PublishDate": 1763357361520,
            "Source": "corporate_action"
        },
        {
            "Title": "Ingersoll-Rand India Appoints New Secretarial Auditors Following Practice Merger",
            "Summary": "Ingersoll-Rand (India) Limited's Board approved the appointment of M/s. Govindraj Akshay Associates as Secretarial Auditors for financial year 2025-26, replacing Mr. Natesh K who resigned due to merger of his practice with the new firm. The appointment fills a casual vacancy and will be effective for one year until the Annual General Meeting for the financial year ending March 31, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1763133698833,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ingersoll-Rand India Reports Flat Q2 Profit, Declares Rs 55 Interim Dividend",
            "Summary": "Ingersoll-Rand (India) Limited reported quarterly profit of Rs 6,035 lakhs for September 2025, matching the same period last year, with revenue rising marginally to Rs 32,194 lakhs. The company declared an interim dividend of Rs 55 per share with record date November 25, 2025 and payment on December 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763109807005,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ingersoll-Rand (India) Inaugurates New Manufacturing Facility in Gujarat",
            "Summary": "Ingersoll-Rand (India) Limited has inaugurated its new manufacturing facility in Sanand, Gujarat. The state-of-the-art facility has commenced trial production, with commercial production expected to begin before the end of the calendar year. The construction was completed early in October, and the inauguration took place in the presence of senior leadership team members from Ingersoll Rand Inc. This follows an earlier disclosure made on August 12, 2025 regarding the facility development.",
            "Sentiment": "positive",
            "PublishDate": 1760424389899,
            "Source": "stock"
        },
        {
            "Title": "Ingersoll-Rand India Holds 103rd AGM, Reports 20.3% PAT Growth for FY2025",
            "Summary": "Ingersoll-Rand (India) Limited conducted its 103rd Annual General Meeting via video conferencing. The company reported total income of INR 1,375 crores for FY 2024-25, representing a 10.7% increase over the previous year. Profit after tax reached INR 268 crores, showing significant growth of 20.3% year-over-year. For the first quarter of FY 2025-26, the company posted total income of INR 324.87 crores, marginally higher than the same quarter last year, while profit after tax was INR 58.98 crores, declining 4.5% compared to the corresponding quarter. The company achieved service revenue of INR 58 crores during the year, with CARE package contributing over 80%. The new Sanand facility in Gujarat, requiring an investment of INR 170 crores, is nearing completion with trial production expected to begin in September 2025. The company launched 9 new products across multiple industries and secured nine Ecoplant orders. Managing Director Sunil Khanduja chaired the meeting as Board Chairman Sekhar Natarajan was absent due to family bereavement. Voting results will be declared within two working days.",
            "Sentiment": "positive",
            "PublishDate": 1755088506806,
            "Source": "corporate_action"
        },
        {
            "Title": "Ingersoll-Rand (India) Reports Quarterly Profit of Rs 5,898 Lakhs with Revenue at Rs 31,532 Lakhs",
            "Summary": "Ingersoll-Rand (India) Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 31,532 lakhs, compared to Rs 32,234 lakhs in the preceding quarter and Rs 31,408 lakhs in the corresponding quarter of the previous year. Net profit for the quarter stood at Rs 5,898 lakhs, down from Rs 6,766 lakhs in the previous quarter but lower than Rs 6,186 lakhs in the same quarter last year. Basic earnings per share was Rs 18.68 compared to Rs 21.43 in the preceding quarter and Rs 19.60 in the corresponding quarter. The company operates in the Air Solutions segment. Deloitte Haskins & Sells issued a Limited Review Report on the results.",
            "Sentiment": "neutral",
            "PublishDate": 1754987325010,
            "Source": "earnings"
        },
        {
            "Title": "Ingersoll-Rand Reports Decline in Quarterly Profit and Revenue",
            "Summary": "Ingersoll-Rand reported a net profit of 590 million rupees compared to 619 million rupees in the same quarter last year, representing a year-over-year decline. The company's revenue also decreased to 3.1 billion rupees from 3.2 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754986716241,
            "Source": "earnings"
        },
        {
            "Title": "Ingersoll-Rand (India) Delays Sanand Facility Operations to October 2025",
            "Summary": "Ingersoll-Rand (India) Limited announced further delays in the commencement of operations at its new manufacturing facility in Sanand, Gujarat. The facility, originally expected to become operational by April 2025, faced delays due to extended monsoon rains from August to October 2024, along with administrative, operational, and logistical factors. The company now expects trial production to commence in September 2025, with full operations beginning in October 2025, pending favorable circumstances. The facility is designed to enhance manufacturing capacity for existing and new products. The Board of Directors had initially approved the Gujarat plant setup in December 2022.",
            "Sentiment": "neutral",
            "PublishDate": 1754986575384,
            "Source": "stock"
        },
        {
            "Title": "Ingersoll-Rand Reports Q4 Financial Results and Declares Dividend",
            "Summary": "Ingersoll-Rand has announced its Q4 financial results. The company's EBITDA increased to 834 million rupees from 735 million rupees year-over-year, with EBITDA margin improving to 25.89% from 24.62%. Revenue rose to 3.2 billion rupees from 3.03 billion rupees in the same period last year. Net profit for Q4 grew to 677 million rupees from 639 million rupees year-over-year. Additionally, the company has declared a dividend of 25 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1748593518000,
            "Source": "result"
        },
        {
            "Title": "Ingersoll-Rand India: Q3 Profit Soars 41% YoY to ₹77.66 Crore",
            "Summary": "Ingersoll-Rand India reported Q3 FY25 results with revenue up 17.04% YoY to ₹385.32 crore. Profit increased 40.99% YoY to ₹77.66 crore. EPS rose to ₹24.6, up 40.97% YoY. Operating income grew 45.44% YoY, while SG&A expenses decreased by 5.17% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1739598911000,
            "Source": "earnings"
        },
        {
            "Title": "Ingersoll-Rand Reports Q3 Revenue Increase",
            "Summary": "Ingersoll-Rand has reported a year-over-year increase in its third-quarter revenue. The company's revenue for Q3 reached 3.8 billion rupees, up from 3.3 billion rupees in the same period last year. This represents a significant growth in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1739526287000,
            "Source": "earnings"
        },
        {
            "Title": "Ingersoll-Rand Reports Strong Q3 EBITDA Growth",
            "Summary": "Ingersoll-Rand has reported significant year-over-year improvements in its third quarter financial results. The company's EBITDA increased to 1.06 billion rupees, up from 748 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 27.56% from 22.72% in the previous year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739526265000,
            "Source": "earnings"
        },
        {
            "Title": "Ingersoll-Rand Reports 41% Increase in Q3 Net Profit",
            "Summary": "Ingersoll-Rand has announced its financial results for the third quarter, reporting a net profit of 777 million rupees. This represents a significant increase from the 551 million rupees reported in the same period last year, marking a year-over-year growth of approximately 41%.",
            "Sentiment": "positive",
            "PublishDate": 1739526245000,
            "Source": "earnings"
        },
        {
            "Title": "Ingersoll Rand India Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade of Ingersoll Rand India Ltd shares occurred on the National Stock Exchange (NSE). Approximately 40,250 shares were traded at a price of Rs. 4,085.00 per share, totaling Rs. 16.44 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1735282896000,
            "Source": "block_deals"
        },
        {
            "Title": "Ingersoll-Rand Declares Dividend of 55 Rupees per Share",
            "Summary": "Ingersoll-Rand has announced a dividend payment of 55 rupees per share to its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1731399788000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ingersoll-Rand Reports Improved Q2 EBITDA and Margin",
            "Summary": "Ingersoll-Rand has announced its Q2 financial results, showing an increase in EBITDA from 657 million rupees to 792 million rupees year-over-year. The company's EBITDA margin also improved, rising from 23.76% to 24.60% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731399783000,
            "Source": "result"
        },
        {
            "Title": "Ingersoll-Rand Reports Q2 Revenue Growth",
            "Summary": "Ingersoll-Rand has announced its Q2 revenue, which increased to 3.2 billion rupees from 2.76 billion rupees in the same quarter last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731399664000,
            "Source": "result"
        },
        {
            "Title": "Ingersoll-Rand Reports Increased Q2 Net Profit",
            "Summary": "Ingersoll-Rand has announced its financial results for the second quarter, reporting a net profit of 604 million rupees. This represents a significant increase from the 497 million rupees reported in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1731399642000,
            "Source": "result"
        }
    ]
}