{
    "Symbol": "INNOVACAP",
    "ISIN": "INE0DUT01020",
    "News": [
        {
            "Title": "Innova Captab Declares ₹2 Interim Dividend for FY26",
            "Summary": "Innova Captab Limited announces interim dividend of ₹2 per share (20% of face value) for FY 2025-26 with record date January 30, 2026. Company issues TDS guidelines for shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1769520655384,
            "Source": "co_actions_results"
        },
        {
            "Title": "Innova Captab Q3 FY26 Results Show Strong Growth",
            "Summary": "Innova Captab Limited reported consolidated revenue of ₹4,519.47 million for Q3 FY26, up from ₹3,207.87 million in Q3 FY25, with net profit after tax reaching ₹421.49 million.",
            "Sentiment": "positive",
            "PublishDate": 1769239771749,
            "Source": "co_actions_results"
        },
        {
            "Title": "Innova Captab Board Meet on Jan 23 for Q3 Results",
            "Summary": "Innova Captab Limited has scheduled a board meeting for January 23, 2026, to consider Q3FY26 unaudited financial results and potential interim dividend declaration with record date set for January 30, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768574984307,
            "Source": "co_actions_results"
        },
        {
            "Title": "Innova Captab Reports 19.5% Revenue Growth Despite API Price Decline Challenges",
            "Summary": "Innova Captab Limited achieved consolidated revenue of INR 380.4 crores in Q2 FY26 and INR 731.9 crores in H1 FY26, marking 19.5% year-on-year growth despite declining API prices impacting their CDMO business. The company's Jammu facility received regulatory approvals from UK-MHRA and Ukraine's SMDC, with management revising annual guidance from INR 400 crores to INR 270-280 crores due to GST rate reduction from 12% to 5%.",
            "Sentiment": "positive",
            "PublishDate": 1763064228956,
            "Source": "earnings"
        },
        {
            "Title": "Innova Captab Targets 25% Revenue Growth Through CDMO Expansion and ₹300Cr Capex Investment",
            "Summary": "Innova Captab has outlined its growth strategy targeting 25% revenue growth through CDMO expansion and entry into regulated markets. The company plans to invest ₹300 crores in capital expenditure for capacity addition and research & development. Key focus areas include strengthening backward integration for APIs, scaling formulation exports, and expanding its oncology portfolio. The company aims to enhance margins through vertical integration and global partnerships.",
            "Sentiment": "positive",
            "PublishDate": 1762528865131,
            "Source": "stock"
        },
        {
            "Title": "Innova Captab Reports Mixed Q2 Results with Revenue Growth but Lower Profit Margins",
            "Summary": "Innova Captab reported quarterly results showing revenue growth to 3.8 billion rupees from 3.2 billion rupees year-over-year. EBITDA increased to 518 million rupees from 498 million rupees, though EBITDA margin declined to 13.62% from 15.63%. Consolidated net profit decreased to 297 million rupees compared to 350 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1762517966781,
            "Source": "earnings"
        },
        {
            "Title": "Innova Captab Receives GMP Compliance Certificate Recommendation from Ukraine Drug Authority",
            "Summary": "Innova Captab Limited announced that The State Service of Ukraine on Medicines and Drugs Control has successfully completed a GMP inspection at their Jammu manufacturing facility. The working group has proposed issuing a GMP compliance certificate to the facility. The State Service of Ukraine is a participating authority under Pharmaceutical Inspection Co-operation Scheme (PIC/S). The PIC/S certification will position the Jammu facility as an international compliant manufacturing site, enhancing its global credibility and facilitating access to regulated markets.",
            "Sentiment": "positive",
            "PublishDate": 1760944830530,
            "Source": "stock"
        },
        {
            "Title": "Innova Captab Faces ₹15.81 Crore GST Demand Over Excess Input Tax Credit Refund Claims",
            "Summary": "Innova Captab Limited received a Show Cause cum Demand Notice from the Central Goods & Services Tax Commissionerate, Shimla regarding excess refund claims of accumulated Input Tax Credit during May 2020 to March 2024. The tax authority alleges the company applied for refund under Rule 89(4) of CGST Rules instead of Rule 89(4B), violating Section 54 of the CGST Act. The notice demands recovery of ₹15,81,37,255.40 along with interest and penalty of equal amount. The company has 30 days to respond and believes the notice has no merits, planning to submit its defense within the prescribed timeline.",
            "Sentiment": "negative",
            "PublishDate": 1760625228407,
            "Source": "stock"
        },
        {
            "Title": "Innova Captab Reports 19% Revenue Growth to ₹352 Crores in Q1 FY26, Jammu Plant Contributes ₹60 Crores",
            "Summary": "Innova Captab Limited reported consolidated revenue of ₹351.5 crores for Q1 FY26, marking 19% year-on-year growth despite API price declines. EBITDA increased 28% to ₹56.6 crores with margins improving to 16.1%. The company reorganized operations into two verticals: CDMO business (71% of revenue at ₹249.5 crores, 8% growth) and branded generics (59% growth to ₹101.2 crores). The new Jammu facility, commercialized in January 2025 with ₹480 crore investment, generated ₹60 crores revenue in the quarter and is approaching operational breakeven. Management expects the facility to reach ₹100 crore quarterly revenue for PAT breakeven. API prices declined up to 20% in certain categories, particularly affecting anti-infective segments. The company maintains partnerships with over 300 global pharmaceutical companies across 3,700 products.",
            "Sentiment": "positive",
            "PublishDate": 1755096198358,
            "Source": "earnings"
        },
        {
            "Title": "Innova Captab Makes Earnings Call Recording Available for Quarter Ended June 30, 2025",
            "Summary": "Innova Captab Limited has made the audio recording of its earnings call available on the company's website. The call discussed the unaudited financial results for the quarter ended June 30, 2025, and was conducted on August 8, 2025, at 4:00 PM IST through digital means with analysts and investors. The recording can be accessed at https://www.innovacaptab.com/audio/Recording. The company notified both BSE and NSE about the availability of this recording.",
            "Sentiment": "neutral",
            "PublishDate": 1754658198789,
            "Source": "earnings"
        },
        {
            "Title": "Innova Captab Reports Strong Q1 FY26 Results with Revenue Growth and Land Purchase Approval",
            "Summary": "Innova Captab Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. On a consolidated basis, the company reported revenue from operations of ₹3,515.42 million compared to ₹2,942.70 million in the same quarter last year, representing significant growth. Profit for the period increased to ₹310.15 million from ₹294.77 million year-over-year. Basic and diluted earnings per share stood at ₹5.42 versus ₹5.15 in the corresponding quarter. On a standalone basis, revenue from operations reached ₹2,869.79 million against ₹2,268.32 million in the prior year quarter, with profit rising to ₹202.95 million from ₹223.36 million. The Board also approved the purchase of land property, with detailed terms to be disclosed upon execution of the final sale agreement. The company operates in the drugs and pharmaceutical products segment and includes subsidiaries Univentis Medicare Limited, Sharon Bio-Medicine Limited, and Univentis Foundation.",
            "Sentiment": "positive",
            "PublishDate": 1754570809884,
            "Source": "earnings"
        },
        {
            "Title": "Innova Captab Reports Q4 Financial Results",
            "Summary": "Innova Captab has released its Q4 financial results. The company's EBITDA increased to 477 million rupees from 381 million rupees year-over-year. The EBITDA margin improved to 15.16% from 14.51% in the same period. Consolidated net profit for Q4 was 296 million rupees, up from 287 million rupees year-over-year, but down from 342 million rupees quarter-over-quarter. Revenue for Q4 rose to 3.15 billion rupees from 2.63 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747666966000,
            "Source": "result"
        },
        {
            "Title": "Innova Captab Reports Strong Q3 Financial Results",
            "Summary": "Innova Captab has announced its Q3 consolidated financial results. The company's net profit increased to 342 million rupees, up from 251 million rupees year-over-year and 350 million rupees quarter-over-quarter. Revenue for Q3 reached 3.2 billion rupees, compared to 3.02 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738757086000,
            "Source": "earnings"
        },
        {
            "Title": "Innova Captab's Subsidiary Approves Property Sale",
            "Summary": "Sharon Bio-medicine, a unit of Innova Captab, has approved the sale of a 2,280 square meter property. This decision represents a significant corporate action that may impact the company's assets and financial position.",
            "Sentiment": "neutral",
            "PublishDate": 1737418799000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sharon Bio-Medicine Approves Sale of Property",
            "Summary": "Innova Captab's subsidiary, Sharon Bio-Medicine, has approved the sale of a 2,280 square meter property. This decision represents a significant corporate action that may impact the company's assets and financial position.",
            "Sentiment": "neutral",
            "PublishDate": 1737384787000,
            "Source": "corporate_action"
        },
        {
            "Title": "Innova Captab: Share Price Drops 18% Despite New Facility Launch",
            "Summary": "Innova Captab's share price has fallen 18% over six consecutive sessions, despite announcing the start of commercial production at a new advanced manufacturing facility in Kathua, Jammu. The ₹450 crore facility includes four specialized blocks and is expected to benefit from government incentives. The stock is down 4% today, trading at ₹996.65 to ₹1,061 per share on BSE.",
            "Sentiment": "negative",
            "PublishDate": 1736920828000,
            "Source": "corporate_action"
        },
        {
            "Title": "Innova Captab Announces Commercialization of Kathua Facility",
            "Summary": "Innova Captab has announced the commercialization of its facility located in Kathua, Jammu. This development signifies that the company has begun commercial operations at this new site, potentially expanding its production capabilities and market reach.",
            "Sentiment": "positive",
            "PublishDate": 1736859739000,
            "Source": "corporate_action"
        },
        {
            "Title": "Innova Captab Receives Drug Manufacturing License for Jammu Facility",
            "Summary": "Innova Captab has announced that its upcoming facility in Jammu has been granted a 'Drug Manufacturing License' by the Government of Jammu and Kashmir's Department of Health and Medical Education, Drug Control Organisation, Jammu.",
            "Sentiment": "positive",
            "PublishDate": 1730902891000,
            "Source": "corporate_action"
        }
    ]
}