{
    "Symbol": "INNOVANA",
    "ISIN": "INE403Y01018",
    "News": [
        {
            "Title": "Innovana Thinklabs holds 17.79% stake in AdCounty",
            "Summary": "Innovana Thinklabs Limited disclosed its 17.79% equity stake in AdCounty Media India Limited as of December 31, 2025, classifying it as an associate company under Ind AS despite holding less than 20% equity.",
            "Sentiment": "neutral",
            "PublishDate": 1768820009175,
            "Source": "stocks"
        },
        {
            "Title": "Innovana Thinklabs' Subsidiary Acquires 43% Stake in Newly Incorporated Real Estate Entity",
            "Summary": "Innovana Infrastructure Limited, a wholly owned subsidiary of Innovana Thinklabs Limited, acquired a 43% stake in newly incorporated Innovana Real Estate Private Limited for Rs. 2.15 lakh through cash subscription to share capital. The newly incorporated entity was established on November 25, 2025, with Rs. 10 lakh authorized share capital and Rs. 5 lakh paid-up capital, though it has yet to commence commercial operations.",
            "Sentiment": "neutral",
            "PublishDate": 1764079485240,
            "Source": "corporate_action"
        },
        {
            "Title": "Innovana Thinklabs Reports Strong Q2 Performance with Consolidated Revenue of Rs 3,887.28 Lacs",
            "Summary": "Innovana Thinklabs Limited announced consolidated revenue of Rs 3,887.28 lacs for the quarter ended September 30, 2025, with net profit of Rs 1,294.96 lacs, demonstrating robust growth across its diversified business segments. The company operates through multiple subsidiaries spanning software development, fitness, infrastructure, astro services, gaming, and green energy sectors, positioning it as a multi-vertical technology conglomerate.",
            "Sentiment": "positive",
            "PublishDate": 1763173526002,
            "Source": "earnings"
        },
        {
            "Title": "Innovana Thinklabs Promoters Allotted 860,000 Warrants Through Preferential Issue",
            "Summary": "Chandan Garg and other promoters of Innovana Thinklabs Limited have been allotted 860,000 warrants through a preferential issue on September 5, 2025. The allotment was made by the company's Board of Directors. Following this transaction, the promoter group's total holding remains at 68.95% in terms of equity shares, while they now additionally hold 0.56% in warrants. The warrants are convertible securities that entitle holders to receive shares with voting rights. The company's equity share capital stands at 2.05 crore shares of Rs. 10 each, while the total diluted share capital after considering the warrants is 2.136 crore shares. Innovana Thinklabs is listed on both NSE (symbol: INNOVANA) and BSE (scrip code: 544302).",
            "Sentiment": "neutral",
            "PublishDate": 1757410976275,
            "Source": "corporate_action"
        },
        {
            "Title": "Innovana Thinklabs Allots 8.6 Lakh Warrants Worth ₹37.07 Crores on Preferential Basis",
            "Summary": "Innovana Thinklabs Limited has completed the allotment of 8,60,000 warrants convertible into equity shares to 17 allottees across promoter and non-promoter categories. The warrants are priced at ₹431 each with a face value of ₹10, raising up to ₹37.07 crores upon full conversion. Promoter Chandan Garg received 1.2 lakh warrants, while the remaining 7.4 lakh warrants were distributed among 16 non-promoter entities including RNR Wealth Management Private Limited, Manish Kumar HUF, and Aryansh Advisors Private Limited, each receiving 1 lakh warrants. The company has received the minimum 25% warrant subscription price from all allottees. These warrants must be converted into equity shares within 18 months by March 4, 2027, failing which the amounts paid will be forfeited. Post-conversion, Chandan Garg's shareholding will decrease from 71.26% to 68.95%. The allotment follows approvals from an Extra-Ordinary General Meeting held on July 23, 2025, and in-principle approval from BSE and NSE on August 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1757087488585,
            "Source": "corporate_action"
        },
        {
            "Title": "Innovana Thinklabs Appoints New Independent Director and Statutory Auditors, Sets AGM Date",
            "Summary": "Innovana Thinklabs Limited's board approved several key appointments and changes during its September 5, 2025 meeting. The company appointed Mr. Varun Kaul as Additional Director (Independent) with DIN 11282034, subject to shareholder approval for a five-year term. Mr. Kaul holds a postgraduate degree in Law, is a Fellow Member of ICSI, and brings over 13 years of professional experience as founder of Varun Kaul & Associates law firm. Simultaneously, Mr. Hemant Koushik resigned as Independent Director due to personal reasons. The board also appointed M/s Goyal Dadra & Company as statutory auditors for a five-year term from the 10th to 15th Annual General Meeting, covering financial years 2025-26 to 2029-30. The audit firm, established in 2013 with headquarters in Jaipur, holds registration number 014176C with ICAI. The company scheduled its 10th Annual General Meeting for September 30, 2025, and appointed Mr. Abhishek Goswami as scrutinizer for the e-voting process.",
            "Sentiment": "neutral",
            "PublishDate": 1757086747621,
            "Source": "corporate_governance"
        },
        {
            "Title": "Innovana Thinklabs' Stake in Subsidiary Dilutes to 86.03% Following Share Issuance",
            "Summary": "Innovana Thinklabs Limited's ownership in its subsidiary Innovana Astro Services Limited decreased from 92.01% to 86.03% after the subsidiary issued shares to external parties. The share issuance was completed on August 14, 2025, with shares priced at ₹40,000 per equity share (face value ₹10), generating total consideration of ₹15.09 crore. The subsidiary reported turnover of ₹16.38 crore, income of ₹16.71 crore, and net worth of ₹1.75 crore for the financial year ended March 31, 2025. The company stated this strategic decision was implemented to address specific business objectives and ensure continued growth of the subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1755167308983,
            "Source": "corporate_action"
        },
        {
            "Title": "Innovana Thinklabs Reports Strong Q1 FY26 Results with 27% Revenue Growth",
            "Summary": "Innovana Thinklabs Limited announced its unaudited financial results for the quarter ended June 30, 2025. On a consolidated basis, the company reported revenue from operations of Rs. 3,209.37 lacs compared to Rs. 2,511.96 lacs in the same quarter last year, representing growth of approximately 27.8%. Net profit for the period increased to Rs. 1,312.25 lacs from Rs. 1,032.42 lacs in the previous year quarter. Consolidated earnings per share stood at Rs. 6.40 compared to Rs. 5.04 in the corresponding quarter. On a standalone basis, revenue from operations was Rs. 1,078.17 lacs with net profit of Rs. 797.75 lacs and earnings per share of Rs. 3.89. The company operates across multiple segments including software development, gym and fitness, construction and infrastructure, astro services and gaming, and green energy through its subsidiaries. The Board approved these results in a meeting held on August 13, 2025, and the trading window for insiders will reopen 48 hours after declaration of results.",
            "Sentiment": "positive",
            "PublishDate": 1755097287184,
            "Source": "earnings"
        },
        {
            "Title": "Innovana Thinklabs Clarifies Management Control and Compliance Terms for 8.6 Lakh Warrant Allotment",
            "Summary": "Innovana Thinklabs Limited provided updates on its preferential allotment of 8,60,000 warrants approved by shareholders in an extraordinary general meeting held on July 23, 2025. The company clarified that there will be no change in management or control following the warrant issue and subsequent equity share conversion, though shareholding percentages and voting rights will change according to the new shareholding pattern. The company addressed regulatory compliance aspects, stating that since its shares have been listed for more than 90 trading days, price re-computation provisions under Regulation 164(3) of SEBI ICDR Regulations will not apply. However, the company committed to re-compute warrant and equity share prices if required under SEBI ICDR Regulations, including Regulation 166. Any warrants or equity shares will remain locked-in until required re-computation amounts are paid within stipulated timeframes.",
            "Sentiment": "neutral",
            "PublishDate": 1755081371735,
            "Source": "corporate_action"
        },
        {
            "Title": "Innovana Thinklabs' Ownership in Subsidiary Dilutes to 92.01% Following Share Issuance",
            "Summary": "Innovana Thinklabs Limited's ownership in its subsidiary Innovana Astro Services Limited decreased from 100% to 92.01% after the subsidiary issued 5,000 equity shares to external parties. The shares were sold at face value of ₹10 each for a total consideration of ₹21.72 crores. One of the buyers, Mr. Kapil Garg, acquired 543 shares and is a promoter of Innovana Thinklabs Limited, making this a related party transaction conducted at arm's length pricing. The subsidiary reported a turnover of ₹16.38 crores, income of ₹16.71 crores, and net worth of ₹1.75 crores for the financial year ended March 31, 2025. The company stated this strategic decision was implemented to address specific business objectives and ensure continued growth of the subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1753723960285,
            "Source": "corporate_action"
        },
        {
            "Title": "Innovana Thinklabs Approves Warrant Issuance and Share Capital Increase at Extraordinary General Meeting",
            "Summary": "Innovana Thinklabs Limited held an Extraordinary General Meeting on July 23, 2025, where members approved two key resolutions. The company increased its authorized share capital with consequent alteration to the capital clause of its memorandum of association. Members also approved the issuance of warrants on preferential basis to persons/entities belonging to both promoter and non-promoter categories. The meeting was chaired by Mr. Chandan Garg, Chairman and Managing Director, with 28 members in attendance. Remote e-voting was available from July 18-22, 2025, and ballot voting was conducted at the venue for those who hadn't voted electronically. The Chairman explained the rationale behind the warrant issuance, citing business requirements and future growth strategy. M/s. Abhishek Goswami & Co. served as scrutinizer for the voting process. Voting results will be announced within 2 working days and displayed on the company's website.",
            "Sentiment": "positive",
            "PublishDate": 1753263454458,
            "Source": "corporate_action"
        },
        {
            "Title": "Innovana Thinklabs Reports Q4 Financial Results",
            "Summary": "Innovana Thinklabs has released its Q4 financial results. The company's EBITDA increased to 149.3 million rupees from 74.6 million rupees year-over-year. EBITDA margin improved to 56.17% from 34.33% year-over-year. Revenue grew to 265.9 million rupees from 217.4 million rupees year-over-year. Consolidated net profit rose to 114 million rupees, up from 85.4 million rupees year-over-year and 116.9 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748538294000,
            "Source": "result"
        },
        {
            "Title": "Innovana Thinklabs Reports Increased Q3 Profit and Revenue",
            "Summary": "Innovana Thinklabs has announced its Q3 financial results. The company's consolidated net profit rose to 117 million rupees, up from 113 million rupees in the same quarter last year. Revenue also increased to 289 million rupees, compared to 258 million rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739372287000,
            "Source": "earnings"
        }
    ]
}