{
    "Symbol": "INOXGREEN",
    "ISIN": "INE510W01014",
    "News": [
        {
            "Title": "Inox Green Energy Services Q3FY26 Call on Feb 13",
            "Summary": "Inox Green Energy Services Limited has scheduled a conference call for February 13, 2026 at 5:00 PM IST to discuss Q3FY26 results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1770388906871,
            "Source": "co_actions_results"
        },
        {
            "Title": "Inox Green Energy Allots 1.99 Cr Equity Shares",
            "Summary": "Inox Green Energy Services allotted 1,98,90,000 equity shares at Rs. 145 per share upon conversion of convertible warrants, increasing paid-up capital to Rs. 401,49,20,450.",
            "Sentiment": "positive",
            "PublishDate": 1769604545059,
            "Source": "co_actions_results"
        },
        {
            "Title": "Inox Green Wins 625 MWp Solar O&M Contract from KEC",
            "Summary": "Inox Green Energy Services secures operations and maintenance contract for 625 MWp solar project at Bhadla, Rajasthan from KEC International, expanding its solar O&M portfolio beyond 3 GW and total renewable portfolio to over 13 GW.",
            "Sentiment": "positive",
            "PublishDate": 1768874507613,
            "Source": "co_actions_results"
        },
        {
            "Title": "INOX Green Clarifies Media Report on Macquarie Deal",
            "Summary": "INOX Green Energy Services clarifies that recent media reports about acquiring Macquarie's renewable platform Vibrant are factually incorrect and pertain to another INOX GFL Group company.",
            "Sentiment": "neutral",
            "PublishDate": 1766470743243,
            "Source": "stocks"
        },
        {
            "Title": "Inox Green Energy Services Allots 12.30 Lakh Equity Shares Upon Warrant Conversion",
            "Summary": "Inox Green Energy Services Limited allotted 12,30,505 equity shares at Rs. 145 per share to non-promoter warrant holders following conversion of convertible warrants. The company's paid-up equity share capital increased from Rs. 373.47 crore to Rs. 374.71 crore, with fully diluted capital standing at Rs. 411.66 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1764082682039,
            "Source": "corporate_action"
        },
        {
            "Title": "Inox Wind Reports Best-Ever Q2 Performance with 56% Revenue Growth, Inox Green Achieves 12.5 GW O&M Portfolio",
            "Summary": "Inox Wind delivered record quarterly results with consolidated revenue of Rs. 1,162 crores (up 56% YoY) and executed 202 MW in Q2, taking H1 execution to 350 MW against full-year guidance of 1,200 MW. Subsidiary Inox Green reported total income of Rs. 129.5 crores (up 101% YoY) and expanded its renewable O&M portfolio to 12.5 GW through strategic investments, positioning to become India's largest renewable O&M services company.",
            "Sentiment": "positive",
            "PublishDate": 1763651847478,
            "Source": "earnings"
        },
        {
            "Title": "Inox Green Secures O&M Services for 5GW Renewable Projects Through Strategic Partnerships",
            "Summary": "Inox Green Energy Services will provide operations and maintenance services for 5GW of renewable projects through MoUs between parent companies Inox Wind and Inox Solar with KP Group entities. The partnerships involve joint development of 2.5GW wind projects with KP Energy and 2.5GW solar projects with KPI Green Energy across multiple states in India.",
            "Sentiment": "positive",
            "PublishDate": 1763521934416,
            "Source": "stock"
        },
        {
            "Title": "Inox Green Energy Services Clarifies CERC Order Impact on 300 MW Wind Project",
            "Summary": "Inox Green Energy Services addressed reports regarding losing grid access for its 300 MW wind project following a CERC order. The company stated the order is not a material event and is exploring all options including approaching the Appellate Tribunal for Electricity.",
            "Sentiment": "negative",
            "PublishDate": 1763507332183,
            "Source": "stock"
        },
        {
            "Title": "Inox Green Energy Services Reports No Deviation in Rs 1,050 Crore Preferential Issue Fund Utilization",
            "Summary": "Inox Green Energy Services Limited confirmed no deviation in utilization of proceeds from its Rs 1,050 crore preferential issue for the quarter ended September 30, 2025, with Rs 592.50 crore received so far. The company has utilized Rs 109.64 crore for debt repayment, Rs 242.49 crore for subsidiary investments, and Rs 55.55 crore for general corporate purposes, with remaining funds invested in money market instruments.",
            "Sentiment": "neutral",
            "PublishDate": 1763173888374,
            "Source": "corporate_action"
        },
        {
            "Title": "Inox Green Targets 6.5 GW Portfolio by FY28 with 25% Wind O&M Capacity Expansion",
            "Summary": "Inox Green plans steady growth through 25% capacity addition in wind operations and maintenance services, targeting a 6.5 GW managed portfolio by FY28. The company is expanding into solar hybrid maintenance and digital monitoring solutions while aiming to enhance EBITDA margins to 45% through scale economies and long-term AMC contracts.",
            "Sentiment": "positive",
            "PublishDate": 1763137049567,
            "Source": "earnings"
        },
        {
            "Title": "Inox Green Energy Services Reports Quarterly Results and Allots 1.02 Lakh Equity Shares Under ESOP",
            "Summary": "Inox Green Energy Services approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025, while allotting 1,02,500 equity shares at Rs. 87 per share under its Employee Stock Option Scheme 2024. The allotment increased the company's paid-up equity share capital from Rs. 373.37 crore to Rs. 373.47 crore, with the shares ranking pari passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763126322190,
            "Source": "earnings"
        },
        {
            "Title": "INOX Green Energy Reports Mixed Q2 Results with 336% Profit Jump Despite EBITDA Decline",
            "Summary": "INOX Green Energy posted consolidated net profit of 279 million rupees in Q2, up 336% from 64 million rupees year-over-year, while revenue grew 56% to 859 million rupees from 552 million rupees. However, EBITDA fell significantly to 85.8 million rupees from 185.5 million rupees, causing EBITDA margin to compress to 9.99% from 33.62% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1763123900475,
            "Source": "earnings"
        },
        {
            "Title": "Inox Green Energy Services Shareholders Approve Scheme of Arrangement with Inox Renewable Solutions",
            "Summary": "Inox Green Energy Services Limited successfully obtained approval from equity shareholders, warrant holders, secured creditors, and unsecured creditors for a scheme of arrangement with Inox Renewable Solutions Limited. The meetings were held on November 1, 2025, following an order from the National Company Law Tribunal, Ahmedabad Bench dated September 8, 2025. The equity shareholders approved the resolution with 99.777% votes in favor through remote e-voting and e-voting during the meeting, representing 69.710% of total outstanding shares. Public shareholders also supported the resolution with 98.871% voting in favor. Warrant holders, secured creditors, and unsecured creditors unanimously approved the scheme. The resolution required majority approval representing three-fourths in value from each category of stakeholders, which was achieved across all groups.",
            "Sentiment": "positive",
            "PublishDate": 1762201889129,
            "Source": "corporate_action"
        },
        {
            "Title": "Inox Green Energy Services Conducts Stakeholder Meetings for Scheme of Arrangement with Inox Renewable Solutions",
            "Summary": "Inox Green Energy Services Limited held meetings with equity shareholders, warrant holders, secured creditors, and unsecured creditors on November 1, 2025, via video conference. The meetings were conducted pursuant to an order dated September 8, 2025, by the National Company Law Tribunal, Ahmedabad Bench. All stakeholder groups considered and voted on a Scheme of Arrangement between Inox Green Energy Services Limited (demerged company) and Inox Renewable Solutions Limited (resulting company) and their respective shareholders. The meetings were held at different times throughout the day, with remote e-voting available from October 28-31, 2025. Each meeting achieved the requisite quorum and concluded with voting processes. Detailed voting results will be submitted to stock exchanges separately.",
            "Sentiment": "neutral",
            "PublishDate": 1762002492662,
            "Source": "corporate_action"
        },
        {
            "Title": "Inox Green Energy Services Gets NCLT Approval for Stakeholder Meetings on Demerger Scheme",
            "Summary": "Inox Green Energy Services Limited received NCLT approval to convene meetings of equity shareholders, warrant holders, secured creditors and unsecured creditors on November 1, 2025, regarding a proposed Scheme of Arrangement with Inox Renewable Solutions Limited. The scheme involves demerging the Power Evacuation Business from Inox Green Energy Services to Inox Renewable Solutions as a going concern. Under the arrangement, shareholders will receive 122 equity shares of the resulting company for every 1,000 shares held in the demerged company. The NCLT Ahmedabad Bench issued the order on September 8, 2025, directing meetings to be held either at the company's registered office or through video conferencing. BSE and NSE had previously issued 'No adverse observation/No objection' letters for the proposed scheme on July 18, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1757424071936,
            "Source": "corporate_action"
        },
        {
            "Title": "Inox Green Energy Expands O&M Portfolio with New Solar Project Deals",
            "Summary": "Inox Green Energy has signed operation and maintenance (O&M) agreements for 189.1 MWP solar projects. These new contracts increase the company's solar O&M portfolio to approximately 1.8 GW and expand its total renewable energy O&M portfolio to roughly 5.3 GW.",
            "Sentiment": "positive",
            "PublishDate": 1756866697913,
            "Source": "stock"
        },
        {
            "Title": "Inox Green Energy Services Reports Rs 592.50 Crore Fund Raising Progress",
            "Summary": "Inox Green Energy Services Limited has received Rs 592.50 crore from its preferential issue totaling Rs 1,050 crore, comprising equity shares and convertible warrants. The fund raising includes Rs 162.50 crore from warrants and Rs 30.00 crore from equity shares as of August 2nd. The funds are allocated for debt repayment (Rs 410 crore) and investments in subsidiaries (Rs 640 crore). The company has utilized Rs 109.64 crore for debt repayment and Rs 282.53 crore for subsidiary investments. CARE Ratings Limited serves as the monitoring agency, and the company reports no deviation in fund utilization from the original objects.",
            "Sentiment": "neutral",
            "PublishDate": 1755181180776,
            "Source": "corporate_action"
        },
        {
            "Title": "Inox Green Energy Services Reports 79% Revenue Growth in Q1 FY26",
            "Summary": "Inox Green Energy Services Limited reported strong quarterly results with total income rising 79% year-over-year to Rs 98 crores compared to Rs 55 crores in the same quarter last year. EBITDA increased 61% to Rs 48 crores, while profit after tax surged 440% to Rs 22 crores from Rs 4 crores previously. The company's renewable O&M portfolio expanded to approximately 5.1 GW after adding 1.6 GWp of solar O&M contracts. Machine availability averaged 95.6% during the quarter. The company signed an agreement for comprehensive O&M of 182 MW wind projects with a major Indian conglomerate. A scheme for demerging the substation business received no objection from stock exchanges. The company targets a portfolio exceeding 10 GW within the next two years through organic and inorganic growth opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1755174386338,
            "Source": "earnings"
        },
        {
            "Title": "Inox Green Energy Services Reports Q1 FY26 Results and Appoints New Secretarial Auditors",
            "Summary": "Inox Green Energy Services Limited announced its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue of Rs. 6,993 Lakh and profit after tax of Rs. 904 Lakh for the quarter. On a consolidated basis, revenue stood at Rs. 5,620 Lakh with profit after tax of Rs. 904 Lakh. The Board also approved the appointment of M/s VAPN & Associates as Secretarial Auditors for a five-year term from FY 2025-26 to FY 2029-30, subject to shareholder approval. The company operates primarily in operations and maintenance services for wind turbine generators and common infrastructure facilities. Key operational notes include pending O&M services billing of Rs. 11,878 Lakh and ongoing litigation matters with regulatory authorities.",
            "Sentiment": "neutral",
            "PublishDate": 1755168500999,
            "Source": "earnings"
        },
        {
            "Title": "Inox Green Energy Services Signs 182 MW Wind Project O&M Agreement",
            "Summary": "Inox Green Energy Services Limited entered into an agreement with the renewable energy arm of one of India's largest conglomerates for comprehensive operations and maintenance of 182 MW of operational wind projects. The agreement includes converting limited-scope to comprehensive O&M for 82 MW of wind projects and renewing comprehensive O&M for another 100 MW of wind projects ahead of schedule. The projects are located across multiple sites in Western India and are connected to common infrastructure owned by Inox Green. The contract spans the entire remaining life of the wind projects. CEO SK Mathu Sudhana stated this brings their entire fleet with this customer back under their management, demonstrating customer trust in their renewed capabilities. Inox Green manages over 5 GW of renewable assets and is India's only listed pure-play renewable O&M services company.",
            "Sentiment": "positive",
            "PublishDate": 1754964070093,
            "Source": "stock"
        },
        {
            "Title": "Inox Green Energy Services Gets BSE and NSE Approval for Arrangement Plan",
            "Summary": "Inox Green Energy Services has received approval from both BSE and NSE for an arrangement plan. The nature and details of the specific arrangement plan were not disclosed in the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1752846328781,
            "Source": "corporate_action"
        },
        {
            "Title": "Inox Green Energy: Q4 Profit Plunges Over 70%, Share Price Drops",
            "Summary": "Inox Green Energy Services Ltd. reported a 73.9% decrease in Q4 net profit to Rs 5.6 crore. EBITDA fell 92.9% to Rs 81 lakh despite revenue growth of 30.4%. The company's share price declined 3.25% following the results announcement.",
            "Sentiment": "negative",
            "PublishDate": 1748838012000,
            "Source": "earnings"
        },
        {
            "Title": "INOX Green Energy Reports Q4 Financial Results",
            "Summary": "INOX Green Energy has reported its Q4 financial results. The company's revenue increased to 683.8 million rupees from 524 million rupees year-over-year. However, the consolidated net profit decreased to 55.6 million rupees from 213 million rupees year-over-year. Compared to the previous quarter, the net profit increased from 41.1 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1748621229000,
            "Source": "result"
        },
        {
            "Title": "Inox Green Energy Services: Secures 639 MWp Solar O&M Contracts",
            "Summary": "Inox Green Energy Services has signed agreements to provide operations and maintenance services for 639 MWp of solar projects. This addition brings their solar O&M portfolio to 1.6 GW and total renewable O&M portfolio to over 5 GW. The projects are spread across multiple sites owned by a leading renewable player.",
            "Sentiment": "positive",
            "PublishDate": 1747816886000,
            "Source": "order&deals"
        },
        {
            "Title": "INOX Green Signs Agreements for Solar Project O&M",
            "Summary": "INOX Green has signed agreements for the operation and maintenance (O&M) of 639 MWp of solar projects. No further details about the projects or the agreements were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747793126000,
            "Source": "default"
        },
        {
            "Title": "Inox Green Energy Services: Secures 285 MWp Solar O&M Projects",
            "Summary": "Inox Green Energy Services signed agreements to provide operation and maintenance (O&M) for 285 MWp of solar projects with two leading Indian renewable energy companies. This addition brings their solar O&M portfolio to 1 GW. The company's shares gained 6.5% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1747632246000,
            "Source": "order&deals"
        },
        {
            "Title": "INOX Green Expands Solar O&M Portfolio to 1 GW",
            "Summary": "INOX Green has signed agreements for operations and maintenance (O&M) of 285 MWp of solar projects. This addition brings the company's solar O&M portfolio to 1 GW within a month of entering the segment.",
            "Sentiment": "positive",
            "PublishDate": 1747621173000,
            "Source": "default"
        },
        {
            "Title": "Inox Green Energy Services Ltd: Expands into Solar O&M Sector with 675 MWp Agreement",
            "Summary": "Inox Green Energy Services Ltd has entered the solar operations and maintenance (O&M) sector, signing an agreement to provide O&M services for 675 MWp of solar projects across multiple states for a leading Indian renewable energy company.",
            "Sentiment": "positive",
            "PublishDate": 1745989240000,
            "Source": "corporate_action"
        },
        {
            "Title": "INOX Green Signs O&M Agreement for 675 MWp Solar Projects",
            "Summary": "INOX Green Energy Services has entered into an agreement to provide operations and maintenance (O&M) services for solar projects with a total capacity of 675 MWp. This deal represents a significant expansion of INOX Green's renewable energy service portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1745978767000,
            "Source": "default"
        },
        {
            "Title": "Inox Green Energy: Shares Surge on Potential IPO of Sister Company",
            "Summary": "Inox Green Energy shares rose 20% following reports that Inox Clean Energy may file for a ₹5,000-crore IPO. Inox Clean Energy has appointed five investment banks to manage the potential offering, which would make it the fifth entity of the $12 billion group to be listed.",
            "Sentiment": "positive",
            "PublishDate": 1744705151000,
            "Source": "normal_news"
        },
        {
            "Title": "INOX Green Energy Reports Decline in Q3 EBITDA and Margin",
            "Summary": "INOX Green Energy experienced a significant decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 117 million rupees from 198 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin contracted to 19.06% from 33.06% year-over-year, indicating a substantial reduction in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1738321851000,
            "Source": "earnings"
        },
        {
            "Title": "INOX Green Energy Reports Profit in Q3 FY2024",
            "Summary": "INOX Green Energy has reported a consolidated net profit of 41 million rupees in Q3, compared to a loss of 15 million rupees in the same quarter last year. The company's revenue slightly increased to 611 million rupees from 600 million rupees year-over-year. Sequentially, the net profit improved from 64 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738321769000,
            "Source": "earnings"
        },
        {
            "Title": "INOX Green Energy to Consider Q3 Results on January 31",
            "Summary": "INOX Green Energy has announced that it will consider and approve its financial results for the third quarter on January 31. This indicates the company is preparing to disclose its performance for the most recent fiscal period to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1737723306000,
            "Source": "earnings"
        },
        {
            "Title": "Inox Green Energy Services Announces Sale of Two Wholly Owned Subsidiaries",
            "Summary": "Inox Green Energy Services has announced the sale of two of its wholly owned subsidiaries to Aliento Wind Energy. This move represents a significant corporate action that could potentially impact the company's structure and operations.",
            "Sentiment": "neutral",
            "PublishDate": 1733702911000,
            "Source": "corporate_action"
        },
        {
            "Title": "INOX Green Energy Services to Sell Two Wholly Owned Subsidiaries",
            "Summary": "INOX Green Energy Services has announced the sale of two of its wholly owned subsidiaries to Aliento Wind Energy. This move represents a significant corporate action that could potentially impact the company's structure and operations.",
            "Sentiment": "neutral",
            "PublishDate": 1733494147000,
            "Source": "corporate_action"
        },
        {
            "Title": "INOX Green Energy Services Divests Stake in Nani Virani Wind",
            "Summary": "INOX Green Energy Services has announced the divestment of its entire equity stake in Nani Virani Wind. This move represents a significant corporate action, potentially impacting the company's portfolio and strategic direction in the renewable energy sector.",
            "Sentiment": "neutral",
            "PublishDate": 1732890624000,
            "Source": "corporate_action"
        },
        {
            "Title": "INOX Green Energy Services Approves Demerger of Power Evacuation Business",
            "Summary": "INOX Green Energy Services has approved a scheme of arrangement that involves the demerger of its power evacuation business. This corporate restructuring will be carried out between the company and Resco Global Wind.",
            "Sentiment": "neutral",
            "PublishDate": 1731503078000,
            "Source": "corporate_action"
        },
        {
            "Title": "INOX Green Energy Reports Q2 EBITDA Growth",
            "Summary": "INOX Green Energy has reported a significant increase in its Q2 EBITDA, rising from 130 million rupees in the previous year to 185.5 million rupees this year. The company's EBITDA margin also improved, increasing from 27.37% to 33.62% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729857522000,
            "Source": "result"
        },
        {
            "Title": "INOX Green Energy Reports Q2 Revenue Growth",
            "Summary": "INOX Green Energy has reported a revenue of 552 million rupees for the second quarter, compared to 474 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729857513000,
            "Source": "result"
        },
        {
            "Title": "INOX Green Energy Reports Q2 Profit Growth",
            "Summary": "INOX Green Energy has reported a consolidated net profit of 64 million rupees for the second quarter, showing a year-over-year increase from 58 million rupees. The profit also improved quarter-over-quarter from 37.5 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1729857489000,
            "Source": "result"
        },
        {
            "Title": "Inox Green: Equity Expansion Through Warrant Conversion",
            "Summary": "<p>Inox Green Energy Services <span class='neutral'>allotted</span> <b>2.76 million</b> equity shares at <b>₹145</b> each to <span class='neutral'>non-promoter warrant holders</span>, <span class='positive'>increasing</span> its paid-up equity share capital to <b>₹3.67 billion</b>. This follows a series of <span class='neutral'>corporate actions</span> including a <span class='neutral'>preferential issue</span> of <b>44.83 million</b> unlisted convertible warrants <span class='positive'>approved</span> earlier in 2024.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728373611668,
            "Source": "corporate_action"
        }
    ]
}