{
    "Symbol": "INOXWIND",
    "ISIN": "INE066P01011",
    "News": [
        {
            "Title": "Inox Wind Board Meet Set for Feb 13 to Review Q3 Results",
            "Summary": "Inox Wind Limited has scheduled a board meeting on February 13, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770385935065,
            "Source": "co_actions_results"
        },
        {
            "Title": "Inox Wind Sees ₹20.01 Cr NSE Block Trade at ₹122.03",
            "Summary": "Inox Wind Limited witnessed a significant block trade on NSE worth ₹20.01 crores involving approximately 1,640,121 shares at ₹122.03 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767763971535,
            "Source": "co_actions_results"
        },
        {
            "Title": "Inox Wind Shareholders Approve Director Re-appointment",
            "Summary": "Inox Wind Limited shareholders have approved the re-appointment of Shri Manoj Dixit as Whole-Time Director through postal ballot with 94.03% votes in favor.",
            "Sentiment": "positive",
            "PublishDate": 1767096164485,
            "Source": "stocks"
        },
        {
            "Title": "INOX Wind Inaugurates Advanced Manufacturing Facilities",
            "Summary": "Gujarat Deputy CM inaugurates INOX Wind's 1.2GW nacelle and hub manufacturing facility at Kalyangarh, alongside Inox Solar's 3GW solar module facility at Bavla, strengthening India's renewable energy ecosystem.",
            "Sentiment": "positive",
            "PublishDate": 1766078124388,
            "Source": "stocks"
        },
        {
            "Title": "Inox Wind Secures Repeat 100MW Order from Jakson Green",
            "Summary": "Inox Wind Limited announces a second 100MW order from Jakson Green for 3.3MW turbines in Gujarat, bringing total FY26 order inflow to 600MW with additional 2.5GW framework agreement over three years.",
            "Sentiment": "positive",
            "PublishDate": 1765851089316,
            "Source": "co_actions_results"
        },
        {
            "Title": "Inox Wind Gets ₹102.3 Cr Order from Aditya Birla Renewables",
            "Summary": "Inox Wind Limited secures first order worth ₹102.3 crores from Aditya Birla Renewables for supply of 3.3MW turbines for Karnataka projects, marking entry into new customer relationship.",
            "Sentiment": "positive",
            "PublishDate": 1765764852549,
            "Source": "co_actions_results"
        },
        {
            "Title": "Inox Wind Seeks Shareholder Approval for Re-appointment of Whole-Time Director Manoj Dixit",
            "Summary": "Inox Wind Limited has issued a postal ballot notice seeking shareholder approval for the re-appointment of Shri Manoj Dixit as Whole-Time Director for two years starting December 3, 2025, without remuneration. The e-voting period runs from November 28, 2025 to December 27, 2025, with results to be declared by December 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764166971977,
            "Source": "corporate_action"
        },
        {
            "Title": "Inox Wind Reports Best-Ever Q2 Performance with 56% Revenue Growth, Maintains FY26 Guidance",
            "Summary": "Inox Wind delivered record quarterly results with revenue of Rs 1,162 crores (up 56% YOY) and executed 202 MW in Q2, taking H1 execution to 350 MW against full-year target of 1,200 MW. The company maintains its execution guidance with 3+ GW tender pipeline and framework agreements expected to secure 1 GW annual recurring orders, while subsidiary Inox Green expanded its O&M portfolio to 12.5 GW.",
            "Sentiment": "positive",
            "PublishDate": 1763651818858,
            "Source": "order&deals"
        },
        {
            "Title": "INOX Wind Receives SEBI Administrative Warning for Trading Window Non-Closure",
            "Summary": "INOX Wind Limited received an administrative warning from SEBI for failing to close the trading window related to a corporate announcement dated March 07, 2025, regarding a 153 MW order from a renewable energy developer. The company stated there is no financial impact and committed to ensure compliance with regulations to avoid recurrence of such events.",
            "Sentiment": "negative",
            "PublishDate": 1763395533155,
            "Source": "corporate_governance"
        },
        {
            "Title": "Inox Wind Forecasts Stronger H2 Performance with 70% Execution and Higher Margins",
            "Summary": "Inox Wind expects stronger performance in the second half with 70% of execution planned during this period. The company anticipates achieving higher margins than previously guided.",
            "Sentiment": "positive",
            "PublishDate": 1763354126818,
            "Source": "stock"
        },
        {
            "Title": "Inox Wind Reports Monitoring Agency Assessment for Rights Issue Proceeds Utilization",
            "Summary": "Inox Wind submitted CARE Ratings' monitoring report for the quarter ended September 30, 2025, showing Rs. 1,063.61 crore utilized from its Rs. 1,249.33 crore rights issue with Rs. 185.72 crore remaining unutilized. The funds were deployed for debt repayment, subsidiary investment, and general corporate purposes, with unutilized proceeds invested in term deposits earning 4.50%-6.35% returns.",
            "Sentiment": "positive",
            "PublishDate": 1763175568713,
            "Source": "earnings"
        },
        {
            "Title": "Inox Wind Secures 100 MW Wind Turbine Order with Multi-Year Maintenance Contract",
            "Summary": "Inox Wind Limited announced it secured a 100 MW equipment supply order from a green energy transition platform. The order involves supplying 3.3 MW turbines for projects in Gujarat, along with limited scope EPC services and multi-year operations maintenance services post-commissioning. CEO Sanjiv Agarwal stated this follows recent 229 MW wins from other customers, bringing total order inflow to 400 MW. The company expects its year-end net order book to meet execution guidance for the subsequent 18-24 months and is in advanced stages of securing multiple other orders.",
            "Sentiment": "positive",
            "PublishDate": 1763000312352,
            "Source": "stock"
        },
        {
            "Title": "INOX Wind Limited Shareholders Approve Resolution Through Postal Ballot with 97% Support",
            "Summary": "INOX Wind Limited announced that shareholders have approved a resolution through postal ballot conducted via remote e-voting. The voting process ran from October 9, 2025, to November 7, 2025. Out of the total votes cast, 1,188 members voted in favor representing 1,06,79,39,497 shares (97.05% of votes cast), while 73 members voted against representing 3,25,02,723 shares (1.88% of votes cast). The resolution was deemed passed on November 7, 2025, with the requisite majority. The company had 4,63,543 total shareholders on the record date. NSDL provided the e-voting facilities, and J.K. Gupta Associates served as the scrutinizer for the voting process.",
            "Sentiment": "positive",
            "PublishDate": 1762822647449,
            "Source": "corporate_action"
        },
        {
            "Title": "Inox Wind Secures 229 MW in New Orders from Leading Renewable Energy Players",
            "Summary": "Inox Wind Limited announced securing new orders totaling 229 MW, strengthening its project pipeline. The company received a 160 MW order (112 MW firm with 48 MW optional extension) from a leading Indian IPP for 3.3 MW wind turbine generators across multiple sites, including limited-scope EPC services and multi-year operations maintenance. Additionally, Inox Wind secured a 69 MW repeat order from another renewable energy player that is part of a large global clean energy company for a Maharashtra project. This follows a 153 MW order from the same customer in March 2025. Both orders include limited-scope EPC and multi-year OM services. The company aims to close FY26 with a net order book covering execution plans for 18-24 months and is in advanced discussions with multiple other customers for additional orders.",
            "Sentiment": "positive",
            "PublishDate": 1762395858846,
            "Source": "stock"
        },
        {
            "Title": "Inox Wind Shares Rise 8% Following Margin Guidance Upgrade and Credit Rating Improvement",
            "Summary": "Inox Wind shares have increased nearly 8% since announcing results on August 14, with the company raising its margin guidance to 18-19% from 17-18% for the current financial year. The wind turbine manufacturer's credit rating on long-term banking facilities was upgraded to 'AA-' from 'A+'. The company maintains its FY26 execution guidance of 1.2 GW and FY27 guidance of 2GW, with an order book of 3.1 GW providing revenue visibility for two-three years. Inox completed 146 MW of execution in the first quarter and has commissioned a new 1,200 MW manufacturing unit in Gujarat. The company completed a rights issue of ₹1,249 crore and is setting up a facility in southern India to improve access to wind sites. JM Financial maintained a 'buy' rating with a revised target price of ₹158, while the stock traded at ₹147.5.",
            "Sentiment": "positive",
            "PublishDate": 1757380092775,
            "Source": "stock"
        },
        {
            "Title": "Inox Wind Appoints Madhurima Sayan Das as Independent Woman Director",
            "Summary": "Inox Wind Limited's Board of Directors approved the appointment of Ms. Madhurima Sayan Das as an Independent Director for a one-year term starting September 5, 2025. The appointment is subject to shareholder approval. Das brings over 30 years of experience in financial advisory services, specializing in mergers and acquisitions across multiple sectors including IT, consumer, industrial, financial services, and media. She previously worked with PwC Mumbai for over 15 years in Corporate Finance & Investment Banking and founded Roebuck Consultancy Services Private Limited in 2013. Das holds a PGDM from IIM Bangalore and is not related to any existing company directors.",
            "Sentiment": "positive",
            "PublishDate": 1757042957297,
            "Source": "corporate_governance"
        },
        {
            "Title": "Inox Wind Raises EBITDA Forecast to 19% From Previous 17%",
            "Summary": "Inox Wind has revised its EBITDA forecast upward to 19% from the previously projected 17%. This represents a 2 percentage point increase in the company's earnings guidance.",
            "Sentiment": "positive",
            "PublishDate": 1756785580946,
            "Source": "stock"
        },
        {
            "Title": "Inox Wind Redeems Rs 560 Crore Preference Shares Using Rights Issue Proceeds",
            "Summary": "Inox Wind Limited has fully redeemed 56 crore unlisted, non-convertible, non-cumulative, participating, redeemable preference shares worth Rs 560 crores held by its promoter company, Inox Leasing and Finance Limited. The redemption was completed on August 25, 2025, using proceeds from a rights issue of equity shares. Each preference share had a face value of Rs 10 and was redeemed at par. Following this redemption, the company has no outstanding preference shares remaining.",
            "Sentiment": "positive",
            "PublishDate": 1756131575481,
            "Source": "corporate_action"
        },
        {
            "Title": "Inox Wind Shares Rise 6% After Rs 175 Crore Stake Sale in EPC Subsidiary",
            "Summary": "Inox Wind shares gained nearly 6% to trade at Rs 148.2 after the company sold a stake worth Rs 175 crore in its EPC subsidiary, Inox Renewable Solutions Ltd., at a valuation of Rs 7,400 crore. The buyers were not disclosed. Trading volume reached 8.4 times the 30-day average. Despite the gain, the stock has declined 30% over the last 12 months and 18% year-to-date, trading 42% below its all-time high of Rs 259 from September 2024. However, the stock has risen 1,300% over five years. Six analysts recommend buying the stock, with price targets ranging up to Rs 227 from Systematix Group and Rs 207 from Motilal Oswal. Inox Wind operates as a fully integrated wind energy player with a 3.2 GW order book and targets executing over 1,200 MW in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1755597830252,
            "Source": "stock"
        },
        {
            "Title": "Inox Wind Divests 49.57 Lakh Shares in Material Subsidiary IRSL for Rs 175 Crore",
            "Summary": "Inox Wind Limited has agreed to sell 49,57,142 equity shares of its material subsidiary Inox Renewable Solutions Limited for approximately Rs 175 crore. The divestment will reduce Inox Wind's shareholding in IRSL from 91.90% to 88.84%. The shares are being sold to third parties who are not part of the promoter group. IRSL contributed Rs 217.98 crore in revenue (6% of consolidated revenue) and Rs 935 crore in net worth (14% of consolidated net worth) in FY 2024-25. The transaction is expected to complete within 7 days and does not qualify as a related party transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1755569846873,
            "Source": "corporate_action"
        },
        {
            "Title": "Inox Wind Reports Record Q1 PAT of Rs 97 Crore, Up 134% Year-on-Year",
            "Summary": "Inox Wind delivered its highest-ever first-quarter profit after tax of Rs 97 crore, marking a 134% year-on-year increase. Revenue grew 32% to Rs 863 crore, while EBITDA rose 39% to Rs 220 crore. Profit before tax surged 167% to Rs 138 crore, and cash PAT jumped 168% to Rs 186 crore. The company executed 146 MW of projects and maintains a diversified order book of around 3.1 GW, providing visibility for the next two years. Inox Wind commissioned new manufacturing facilities including a nacelle plant, transformer unit, and crane services. The company completed the merger of Inox Wind Energy Limited during the quarter and received stock exchange approval for its substation business demerger. The Ministry of New and Renewable Energy notified the ALMM for wind and turbine components, which is expected to benefit domestic manufacturers. CEO Sanjeev Agarwal expressed confidence in achieving targets and noted strong demand growth prospects for domestic wind OEMs.",
            "Sentiment": "positive",
            "PublishDate": 1755486324425,
            "Source": "earnings"
        },
        {
            "Title": "Inox Wind Reports Strong Q1 Results with Net Profit Surge to 1.06 Billion Rupees",
            "Summary": "Inox Wind delivered robust quarterly performance with net profit jumping to 1.06 billion rupees from 103 million rupees year-over-year. Revenue increased to 8.3 billion rupees compared to 6.39 billion rupees in the same period last year. EBITDA rose to 1.84 billion rupees from 1.35 billion rupees, while EBITDA margin improved to 22.23% from 21.04% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1755469981141,
            "Source": "earnings"
        },
        {
            "Title": "Inox Wind Reports Record Quarterly Net Profit of ₹97 Crore, Revenue Rises 29%",
            "Summary": "Inox Wind Ltd reported its highest quarterly net profit of ₹97.3 crore, marking a 134% year-on-year increase despite a ₹40 crore deferred tax charge. Revenue from operations grew 29.2% to ₹826.3 crore. EBITDA increased 36.5% to ₹183.8 crore with margins expanding to 22.2%. The company executed 146 MW of orders during the quarter and maintains an order book of approximately 3.1 GW. Inox Wind operationalized new manufacturing facilities in Gujarat and Rajasthan, and deployed cranes across multiple sites. The company's O&M subsidiary Inox Green secured a 182 MW wind project maintenance agreement. A major corporate restructuring was completed with the merger of Inox Wind Energy Ltd, reducing liabilities by approximately ₹2,050 crore. The demerger scheme for Inox Green's substation business received stock exchange approval.",
            "Sentiment": "positive",
            "PublishDate": 1755175358541,
            "Source": "earnings"
        },
        {
            "Title": "Inox Wind Reports Strong Q1 Performance with 17.8% Revenue Growth, Appoints New Auditors and Grants Employee Stock Options",
            "Summary": "Inox Wind Limited reported quarterly results for the period ended June 30, 2025, showing revenue from operations of Rs 71,559 lakhs compared to Rs 60,729 lakhs in the same quarter last year. Net profit increased to Rs 8,671 lakhs from Rs 7,392 lakhs year-over-year. EBITDA stood at Rs 15,548 lakhs versus Rs 12,191 lakhs in the corresponding quarter. On a consolidated basis, revenue reached Rs 82,625 lakhs with net profit of Rs 9,734 lakhs. The Board appointed M/s J.K. Gupta & Associates as Secretarial Auditors for a five-year term from FY 2025-26 to FY 2029-30, subject to shareholder approval. The company granted 11,50,000 stock options to eligible employees under its ESOP scheme at Rs 137.96 per share. The options will vest over 1-4 years with an exercise period of maximum 4 years from vesting date. Basic earnings per share improved to Rs 0.53 from Rs 0.46 in the previous year quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755171020375,
            "Source": "earnings"
        },
        {
            "Title": "Inox Wind Opens ₹1,250 Crore Rights Issue at 27% Discount",
            "Summary": "Inox Wind opened its ₹1,250 crore rights issue for subscription, running from August 6 to August 20. The company is offering shares at ₹120 per share, representing a 27% discount to Tuesday's closing price of ₹151.4. Eligible shareholders can purchase five rights equity shares for every 78 shares held as of the July 29 record date. The rights issue allows existing shareholders to buy additional shares at below-market prices. On-market renunciation is available until August 14, while off-market renunciation extends until August 19. Inox Wind shares closed 1.2% lower on Tuesday and have declined 15% over the past month.",
            "Sentiment": "neutral",
            "PublishDate": 1754447704324,
            "Source": "corporate_action"
        },
        {
            "Title": "Inox Wind Announces Rights Issue Worth Rs 1,249 Crores",
            "Summary": "Inox Wind Limited has announced a rights issue of equity shares to eligible shareholders for an aggregate amount not exceeding Rs 1,24,932.85 lakhs (approximately Rs 1,249 crores). The company published newspaper advertisements on August 1, 2025, regarding this rights issue in Financial Express (English), Jansatta (Hindi), and Himachal Dastak (Hindi) across multiple cities including Delhi, Mumbai, Kolkata, Bangalore, and others. The rights issue is being conducted in accordance with SEBI regulations, specifically the Securities and Exchange Board of India (Issue of Capital and Disclosure Requirements) Regulations, 2018. The company informed stock exchanges NSE and BSE about the newspaper publication through a letter signed by Company Secretary Deepak Banga.",
            "Sentiment": "neutral",
            "PublishDate": 1754054403047,
            "Source": "corporate_action"
        },
        {
            "Title": "Inox Wind Approves Rs 1,249 Crore Rights Issue at Rs 120 Per Share",
            "Summary": "Inox Wind Limited has approved a rights issue to raise up to Rs 1,249.33 crores through the issuance of 10,41,10,712 fully paid-up equity shares priced at Rs 120 per share. Eligible shareholders will receive 5 new shares for every 78 shares held as of the record date of July 29, 2025. The rights issue will open on August 6, 2025 and close on August 20, 2025. The company received in-principle approvals from NSE and BSE for the issue. Post-issue, the company's outstanding equity shares will increase from 162.41 crore to 172.82 crore shares, assuming full subscription. Rights entitlements will be credited in dematerialized form to eligible shareholders' demat accounts.",
            "Sentiment": "positive",
            "PublishDate": 1753274222909,
            "Source": "corporate_action"
        },
        {
            "Title": "Inox Wind Secures 51 MW Order from First Energy for Tamil Nadu Project",
            "Summary": "Inox Wind secured a 51 MW order from First Energy, a Thermax Group company, for a wind project in Tamil Nadu. This represents the first order from First Energy to Inox Wind and involves supplying 3 MW wind turbines with 140-meter hub height and 145-meter rotor diameter. The turbines will be installed through First Energy's SPV, First Energy 10 Private Ltd. The order includes project supervision and multi-year operations and maintenance services to be executed by Inox Wind's subsidiaries. CEO Sanjeev Agarwal highlighted the partnership's potential to help First Energy scale up in India's commercial and industrial renewable energy market. Inox Wind shares closed 0.69% lower at ₹165.70, with the stock declining 12% year-to-date and trading 37% below its 52-week high of ₹261.90.",
            "Sentiment": "positive",
            "PublishDate": 1753241353182,
            "Source": "stock"
        },
        {
            "Title": "INOX Wind to Confirm Details of ₹1,250 Crore Rights Issue",
            "Summary": "INOX Wind's board is scheduled to meet on July 23 to confirm important details of a ₹1,250 crore rights issue. The meeting will likely finalize specifics of the proposed capital raising initiative.",
            "Sentiment": "neutral",
            "PublishDate": 1752844742000,
            "Source": "default"
        },
        {
            "Title": "Inox Wind: Board Approves Rs 1,250 Crore Rights Issue",
            "Summary": "Inox Wind's board has approved raising up to Rs 1,250 crore through a rights issue of equity shares. The detailed terms, including issue price, rights entitlement ratio, and timing, will be determined later. The fundraising is subject to further approvals as per Companies Act and SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1752757042000,
            "Source": "corporate_action"
        },
        {
            "Title": "Inox Wind Approves Fundraising of Up to 12.5 Billion Rupees",
            "Summary": "Inox Wind has approved a plan to raise funds up to 12.5 billion rupees. No further details about the fundraising method or purpose were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752752687000,
            "Source": "default"
        },
        {
            "Title": "Inox Wind to Review Funding Proposal",
            "Summary": "Inox Wind has announced that it will review a funding proposal on July 17. No further details about the nature or amount of the funding were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1752502817000,
            "Source": "default"
        },
        {
            "Title": "INOX Wind Receives NCLT Approval for Arrangement Scheme",
            "Summary": "INOX Wind has announced that it has received approval from the National Company Law Tribunal (NCLT) for an arrangement scheme between INOX Wind Energy and itself. The news indicates a significant corporate development for the company, though specific details about the arrangement scheme are not provided in the given information.",
            "Sentiment": "positive",
            "PublishDate": 1749886395000,
            "Source": "default"
        },
        {
            "Title": "Inox Wind: Q4 Revenue Doubles, Profit Surges Despite Share Price Dip",
            "Summary": "Inox Wind reported Q4 consolidated revenue doubling to Rs 1,248 crore, with profit increasing to Rs 187 crore from Rs 46.5 crore. Ebitda rose to Rs 227 crore, though margin slightly contracted. Share price fell 1.28% after initial 2.50% rise.",
            "Sentiment": "positive",
            "PublishDate": 1748927426000,
            "Source": "earnings"
        },
        {
            "Title": "Inox Wind: Q4 Revenue Doubles, Profit Surges",
            "Summary": "Inox Wind reported Q4 consolidated revenue of Rs 1,248 crore, up from Rs 528 crore year-over-year. Net profit increased to Rs 187 crore from Rs 46.5 crore. EBITDA rose to Rs 227 crore, though margin slightly contracted to 18.2%.",
            "Sentiment": "positive",
            "PublishDate": 1748838442000,
            "Source": "earnings"
        },
        {
            "Title": "Inox Wind Reports Significant Profit Increase in Q4",
            "Summary": "Inox Wind has reported a substantial increase in its consolidated net profit for the fourth quarter. The company's net profit rose to 1.87 billion rupees, up from 465.4 million rupees in the same quarter last year and 1.17 billion rupees in the previous quarter. Additionally, Inox Wind's revenue for Q4 increased to 12.75 billion rupees, compared to 5.28 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748823182000,
            "Source": "default"
        },
        {
            "Title": "Inox Wind: Q4 Results Show Strong Growth and Robust Order Book",
            "Summary": "Inox Wind reported FY25 revenue of Rs 35.57 billion (+103% YoY) and Ebitda of Rs 7.57 billion (+189% YoY). The company executed 705MW of wind turbine orders (+87.5% YoY). Current order book stands at 3,203MW, with FY25 order inflows of 1,553MW.",
            "Sentiment": "positive",
            "PublishDate": 1748762920000,
            "Source": "earnings"
        },
        {
            "Title": "Inox Wind: Q4 Profit Soars 302%, Revenue Doubles",
            "Summary": "Inox Wind reported a 302% increase in Q4 net profit to Rs 187 crore, with revenue more than doubling to Rs 1,248 crore. The company has an order book of 3.2 GW and targets execution of over 1,200 MW in FY2026.",
            "Sentiment": "positive",
            "PublishDate": 1748608968000,
            "Source": "earnings"
        },
        {
            "Title": "INOX WIND Reports Strong Q4 Financial Results",
            "Summary": "INOX WIND announced its Q4 financial results, showing significant year-over-year growth. The company's revenue increased to 12.75 billion rupees from 5.28 billion rupees in the same quarter last year. Consolidated net profit rose to 1.87 billion rupees, up from 465.4 million rupees year-over-year and 1.17 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748606523000,
            "Source": "result"
        },
        {
            "Title": "Inox Wind: Begins Execution of 990 MW Wind Project Order",
            "Summary": "Inox Wind has started executing a 990 MW turnkey order from Purvah Green, a CESC subsidiary. The projects are located across Gujarat, Rajasthan, and Madhya Pradesh. All advances have been received, with commissioning expected to begin in phases from fiscal 2026. This is the largest wind order awarded by an independent power producer in India to a wind OEM.",
            "Sentiment": "positive",
            "PublishDate": 1745218681000,
            "Source": "order&deals"
        },
        {
            "Title": "Inox Wind: Share Price Surges on Major Wind Order Update",
            "Summary": "Inox Wind's share price increased by over 6% following an update on India's largest single wind order.",
            "Sentiment": "positive",
            "PublishDate": 1745211509000,
            "Source": "order&deals"
        },
        {
            "Title": "INOX Wind Signs 1,500 MW Agreement with CESC Unit",
            "Summary": "INOX Wind has signed a 1,500 MW framework agreement with Purvah Green Private Ltd., a unit of CESC Ltd. The execution of the turnkey part (990 MW) is currently in progress, with commissioning expected to begin from FY26 onwards.",
            "Sentiment": "positive",
            "PublishDate": 1745201164000,
            "Source": "default"
        },
        {
            "Title": "SEBI Issues Letter to Inox Wind Limited",
            "Summary": "The Securities and Exchange Board of India (SEBI) has issued a letter to Inox Wind Limited. The company has disclosed this information, but no further details about the content or purpose of the letter have been provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1743772505000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Inox Wind Secures 153 MW Order",
            "Summary": "Inox Wind has announced that it has received a large order for 153 MW. This order represents a significant business opportunity for the company in the wind energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1741316729000,
            "Source": "order&deals"
        },
        {
            "Title": "INOX Wind: Smallcap Fund Acquires 2.55 Million Shares in Open Market",
            "Summary": "A smallcap fund has purchased 2,550,038 shares of INOX Wind through open market transactions. This significant acquisition suggests increased investor interest in the company.",
            "Sentiment": "positive",
            "PublishDate": 1740382184000,
            "Source": "block_deals"
        },
        {
            "Title": "Inox Wind: Profit Soars Ahead of Union Budget 2025",
            "Summary": "Inox Wind reported a significant increase in Q3 profit to ₹239 crore, up from ₹33 crore last year. Revenues surged 96% to ₹994 crore. The company's order book stands at 3,286 MW, 28% higher than last year. Share price jumped nearly 12% ahead of the Union Budget 2025-2026 announcement.",
            "Sentiment": "positive",
            "PublishDate": 1738382572000,
            "Source": "earnings"
        },
        {
            "Title": "INOX Wind Reports Q3 Profit Before Tax of 2.06 Billion Rupees",
            "Summary": "INOX Wind has reported a significant increase in its Profit Before Tax (PBT) for the third quarter, reaching 2.06 billion rupees compared to 54.3 million rupees in the same period last year. However, the company also reported an exceptional item of loss amounting to 134.6 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738323972000,
            "Source": "earnings"
        },
        {
            "Title": "Inox Wind: Q3 Profit Soars to Rs 116 Crore, Beating Estimates",
            "Summary": "Inox Wind's Q3FY25 net profit surged to Rs 116.65 crore from Rs 1.07 crore year-on-year, exceeding analyst expectations. Revenue increased 81% to Rs 911.27 crore, with EBITDA up 123.24%. The company's order book grew to 3,286 GW, providing revenue visibility for 2-3 years.",
            "Sentiment": "positive",
            "PublishDate": 1738322283000,
            "Source": "earnings"
        },
        {
            "Title": "Inox Wind Ltd.: Stock Surges 20% on High Trading Volume",
            "Summary": "Inox Wind's stock hit the 20% upper circuit at Rs 161.91 with trading volume 11 times its 30-day average. The company is set to report Q3 earnings on Jan. 31, with analysts expecting 9% profit growth and 110% revenue increase year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738143713000,
            "Source": "normal_news"
        },
        {
            "Title": "INOX Wind to Consider Q3 Results on January 31",
            "Summary": "INOX Wind, a wind energy solutions provider, has announced that it will consider and approve its financial results for the third quarter of the current fiscal year on January 31.",
            "Sentiment": "neutral",
            "PublishDate": 1737729784000,
            "Source": "result"
        }
    ]
}