{
    "Symbol": "INOXINDIA",
    "ISIN": "INE616N01034",
    "News": [
        {
            "Title": "Inox India Grants 2267 Stock Options Under ESOP Scheme",
            "Summary": "Inox India Limited's Nomination & Remuneration Committee approved the grant of 2267 stock options under the Employee Stock Option Plan 2022 to eligible employees at an exercise price of Rs 2 per share.",
            "Sentiment": "positive",
            "PublishDate": 1770881350007,
            "Source": "co_actions_results"
        },
        {
            "Title": "INOX India Reports Record Performance in Q2 FY26 with 16% Revenue Growth",
            "Summary": "INOX India Limited achieved its best performance in company history during Q2 FY26, with consolidated revenue increasing 16% year-on-year. Total income reached INR 371 crores for the quarter, while EBITDA grew 18% to INR 92 crores and PAT increased 22.9% to INR 62 crores. For H1 FY26, the company recorded highest-ever half-year revenue of INR 723 crores, EBITDA of INR 180 crores, and PAT of INR 122 crores with 20.9% growth. Order backlog stands at record INR 1,485 crores as of September 30, 2025, with 63% from exports and 37% from domestic market. Key highlights include securing two large 1,500 metric cube cryogenic vessel orders from a U.S.-based aerospace company, a 90KL liquid hydrogen storage tank order from European customer, and 30,000 beverage kegs order from German company. The company is bidding for over 0.5 million kegs with major global breweries including Heineken and AB InBev. Management expects to achieve yearly targets with several large orders anticipated in H2, particularly in cryoscientific and LNG segments.",
            "Sentiment": "positive",
            "PublishDate": 1762906224094,
            "Source": "earnings"
        },
        {
            "Title": "Inox India Sets Annual Production Target of 100,000-150,000 Beverage Kegs with Revenue Distribution Goals",
            "Summary": "Inox India has announced yearly goals with a revenue distribution target of 43-45% in the first half and 55% in the second half. The company aims to produce 100,000-150,000 beverage kegs this year. Inox India expects EBITDA margins to remain between 20-24% and anticipates monthly orders ranging from INR 150-160 crores. The company maintains a backlog of approximately INR 1,500-1,600 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762485605280,
            "Source": "stock"
        },
        {
            "Title": "INOX India Reports 16% Revenue Growth to ₹371 Cr in Q2FY26, Achieves Highest-Ever H1 Performance",
            "Summary": "INOX India Limited reported quarterly revenue of ₹371 crores for Q2FY26, marking 16% year-on-year growth. EBITDA increased 18% to ₹92 crores while profit after tax grew 22.9% to ₹62 crores. Export revenue contributed 57% of total revenue at ₹211 crores. The company secured order inflows of ₹374 crores, bringing total order backlog to ₹1,485 crores. For H1FY26, the company achieved record performance with revenue rising 16.3% to ₹723 crores, EBITDA growing 18.7% to ₹180 crores, and PAT increasing 20.9% to ₹122 crores. Key order wins included a 1,500 cubic meter cryogenic vessel order from a US-based customer, additional orders from ITER for refurbishment, and a 90KL liquid hydrogen tank order for a European semiconductor facility. The Industrial Gases Division contributed 57% to overall revenue, LNG Division 25%, and CryoScientific Division 13%.",
            "Sentiment": "positive",
            "PublishDate": 1762350201846,
            "Source": "earnings"
        },
        {
            "Title": "INOX India Reports 16.7% Revenue Growth in Q1 FY26, Secures Major ITER Order Worth INR145 Crores",
            "Summary": "INOX India Limited reported quarterly results with revenue of INR352 crores, EBITDA of INR89 crores, and profit after tax of INR61 crores, representing growth of 16.7%, 19.4%, and 18.9% respectively. The company achieved significant milestones including dispatch of India's first ultra-high purity ammonia ISO containers for semiconductor and solar panel sectors, and launched India's first CO2 battery storage application. The company secured a major order for Cryostat Thermal Shield from ITER valued at approximately INR145 crores, with 90% fabrication to be carried out at their facility over nearly 2 years. In the LNG segment, INOX supplied approximately 145 tanks to major OEM manufacturers and is expanding production capacity. The beverage keg division received global approval from Heineken and secured orders worth INR6.4 crores in the quarter. Order backlog as of June 30, 2025 stood at INR1,457 crores with 63% comprising exports. Total order inflow during the quarter was INR415 crores. The company targets 18-20% revenue growth for the year and has planned capex of around INR80 crores.",
            "Sentiment": "positive",
            "PublishDate": 1754914851580,
            "Source": "earnings"
        },
        {
            "Title": "INOX India Reports 18.9% Growth in Q1 FY26 PAT, Revenue Rises 16.7% to ₹352 Crore",
            "Summary": "INOX India Limited reported quarterly results with revenue growing 16.7% year-on-year to ₹352 crore and profit after tax increasing 18.9% to ₹61 crore. EBITDA rose 19.4% to ₹89 crore. Export revenue contributed 56% of total revenue at ₹198 crore. The company secured order inflows of ₹415 crore, bringing total order book to ₹1,457 crore. Key developments include launching India's first ultra-high-purity ammonia ISO tank container, receiving audit approvals from Heineken for its stainless-steel keg manufacturing facility, and securing a ₹145 crore order from ITER for Cryostat Thermal Shield refurbishment. The Industrial Gases division contributed 48% to revenue while LNG segment contributed 29%. The company's board also noted a ₹52,000 fine from BSE for non-compliance related to Annual Secretarial Compliance Report submission format, which has been resolved and paid.",
            "Sentiment": "positive",
            "PublishDate": 1754312958476,
            "Source": "earnings"
        },
        {
            "Title": "Inox India: ₹2,000 Crore Worth Shares Unlock as Lock-in Period Ends",
            "Summary": "1.8 crore shares (20% of outstanding equity) of Inox India will be eligible for trading as the six-month lock-in period ends on June 19. The company recently secured orders worth ₹373 crore in FY2026. Promoters hold 75% stake, with mutual funds and retail investors holding significant portions of the remaining shares.",
            "Sentiment": "neutral",
            "PublishDate": 1750290160000,
            "Source": "corporate_action"
        },
        {
            "Title": "Inox India: Secures Orders Worth ₹373 Crore in FY26",
            "Summary": "Inox India has won orders worth ₹373 crore across various business segments in the current financial year. The orders include ₹151 crore in cryo-scientific solutions, ₹141 crore in industrial gas, and ₹71 crore in LNG segments. The company's shares rose by 1% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1750143036000,
            "Source": "order&deals"
        },
        {
            "Title": "INOX India Secures Contracts Worth ₹373 Crore",
            "Summary": "INOX India has obtained multiple contracts with a total value of ₹373 crore. The news brief does not provide details on the nature of these contracts or the timeframe for their execution.",
            "Sentiment": "positive",
            "PublishDate": 1750137784000,
            "Source": "default"
        },
        {
            "Title": "INOX INDIA's Beverage Kegs Approved by Heineken and AB InBev",
            "Summary": "INOX INDIA has received approvals from global brewery majors Heineken and AB InBev for its beverage kegs manufacturing at the Savli plant.",
            "Sentiment": "positive",
            "PublishDate": 1748333444000,
            "Source": "default"
        },
        {
            "Title": "Inox India Ltd: Five-Year Growth Strategy and Global Expansion Plans",
            "Summary": "Inox India Ltd aims for 18-20% revenue growth this fiscal year, focusing on five-year cycles rather than quarterly results. The company is expanding its beverage containers business with potential orders from global brewing giants. Inox maintains margins in the early 20% range across its segments, with the cryo-scientific division being the highest. The company is pursuing global market share expansion, leveraging strong export orders, particularly in mini LNG terminals.",
            "Sentiment": "positive",
            "PublishDate": 1747703484000,
            "Source": "normal_news"
        },
        {
            "Title": "INOX INDIA Reports Q4 Results and Dividend Announcement",
            "Summary": "INOX INDIA has announced its Q4 financial results and a dividend recommendation. The company's Q4 consolidated net profit increased to 655 million rupees from 440 million rupees year-over-year. Revenue rose to 3.7 billion rupees from 2.76 billion rupees in the same period last year. EBITDA for Q4 improved to 817 million rupees from 532 million rupees, with the EBITDA margin expanding to 22.10% from 19.28%. The company has recommended a dividend of 2 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747319273000,
            "Source": "result"
        },
        {
            "Title": "INOX India to Consider Q4 Results on May 15",
            "Summary": "INOX India has announced that it will consider its fourth quarter (Q4) financial results on May 15. This meeting is likely to review and approve the company's performance for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1746798862000,
            "Source": "default"
        },
        {
            "Title": "INOX India to Meet with UTI Asset Management Company",
            "Summary": "INOX India has scheduled a meeting with UTI Asset Management Company (UTI AMC) on March 24. This meeting suggests potential discussions between the company and the asset management firm, which could involve investment strategies, company performance, or other business-related matters.",
            "Sentiment": "neutral",
            "PublishDate": 1741879621000,
            "Source": "corporate_governance"
        },
        {
            "Title": "INOX India Schedules Meeting with OHM Portfolio",
            "Summary": "INOX India has announced a scheduled meeting with OHM Portfolio on March 24. This meeting suggests potential discussions or negotiations between the two entities, which could be related to investment, partnerships, or other business matters.",
            "Sentiment": "neutral",
            "PublishDate": 1741879589000,
            "Source": "corporate_governance"
        },
        {
            "Title": "INOX India Schedules Analyst/Investor Meeting",
            "Summary": "INOX India has announced a meeting with analysts and investors scheduled for March 20. This is a correction to a previous announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1741879560000,
            "Source": "corporate_governance"
        },
        {
            "Title": "INOX India Schedules Meeting with Aditya Birla Capital",
            "Summary": "INOX India has announced a scheduled meeting with Aditya Birla Capital on March 20. This meeting suggests potential discussions or negotiations between the two companies, though the specific purpose or agenda of the meeting has not been disclosed in the provided news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1741879487000,
            "Source": "corporate_governance"
        },
        {
            "Title": "INOX India Secures 190 Crore Rupee Order",
            "Summary": "INOX India has won a significant order worth 190 crore rupees. This order represents a substantial business opportunity for the company and may positively impact its financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1741247535000,
            "Source": "order&deals"
        },
        {
            "Title": "INOX India: Shares Surge 13% Following International Certification",
            "Summary": "INOX India's stock jumped 13% after receiving IATF 16949 certification for cryogenic fuel tanks. The company expects 18-20% YoY revenue growth in Q4FY25, with a current order backlog of ₹1,341 crore.",
            "Sentiment": "positive",
            "PublishDate": 1740648968000,
            "Source": "normal_news"
        },
        {
            "Title": "INOX India Receives Certification for LNG Vehicle Fuel Tanks",
            "Summary": "INOX India has obtained a certification that strengthens its position as a qualified supplier of fuel tanks for LNG-powered vehicles. This certification is expected to enhance the company's competitiveness in the growing market for alternative fuel vehicle components.",
            "Sentiment": "positive",
            "PublishDate": 1740375837000,
            "Source": "corporate_action"
        },
        {
            "Title": "INOX India Achieves IATF 16949 Certification for Cryogenic Fuel Tanks",
            "Summary": "INOX India has become the first Indian company to receive IATF 16949 certification for cryogenic fuel tanks. This certification is a significant achievement in the automotive industry, indicating that INOX India's cryogenic fuel tanks meet high-quality standards for automotive production and relevant service parts.",
            "Sentiment": "positive",
            "PublishDate": 1740375791000,
            "Source": "corporate_action"
        },
        {
            "Title": "INOX India: Share Price Rebounds from 52-Week Low",
            "Summary": "INOX India's stock rebounded from its 52-week low during a volatile trading session. The stock opened at ₹893.15, touched a low of ₹892.60 and a high of ₹911.25 on NSE. Immediate support is at ₹875, with potential upside to ₹900-₹925 if this level holds.",
            "Sentiment": "neutral",
            "PublishDate": 1739852412000,
            "Source": "normal_news"
        },
        {
            "Title": "Inox India Reports Strong Q3 Financial Results",
            "Summary": "Inox India has announced its Q3 consolidated financial results. The company's net profit increased to 584 million rupees, up from 486 million rupees year-over-year and 495 million rupees quarter-over-quarter. Revenue for Q3 rose to 3.3 billion rupees, compared to 2.9 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739146389000,
            "Source": "earnings"
        },
        {
            "Title": "INOX INDIA Reports Q3 EBITDA Growth",
            "Summary": "INOX INDIA has reported its Q3 financial results. The company's EBITDA increased to 692 million rupees, up from 667 million rupees in the same quarter last year. However, the EBITDA margin decreased to 20.74% from 22.97% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738935792000,
            "Source": "earnings"
        },
        {
            "Title": "INOX INDIA Reports Strong Q3 Financial Results",
            "Summary": "INOX INDIA has announced its Q3 consolidated financial results. The company's net profit increased to 584 million rupees, up from 486 million rupees year-over-year and 495 million rupees quarter-over-quarter. Revenue for Q3 rose to 3.3 billion rupees, compared to 2.9 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738935730000,
            "Source": "earnings"
        },
        {
            "Title": "Inox India: Secures Largest Order for Mini LNG Terminal in The Bahamas",
            "Summary": "Inox India has won its largest order to design, engineer, and supply a Mini LNG terminal for a power plant project in The Bahamas. The project includes supplying ten 1,500 cubic meter cryogenic storage tanks and a regasification system, supporting a 60 MW power plant and providing shore power for cruise ships. The facility will have a total LNG storage capacity of 15,000 cubic meters.",
            "Sentiment": "positive",
            "PublishDate": 1731298680000,
            "Source": "normal_news"
        },
        {
            "Title": "INOX India to Install World's Largest LNG Storage Facility",
            "Summary": "INOX India has announced plans to install the world's largest collection of shop-built double-walled vacuum insulated cryogenic tanks for LNG storage. The facility will have a collective storage capacity of 15,000 cubic meters of LNG, marking a significant milestone in cryogenic storage technology.",
            "Sentiment": "positive",
            "PublishDate": 1731295768000,
            "Source": "corporate_action"
        },
        {
            "Title": "INOX India Secures Contract for Mini LNG Terminal in The Bahamas",
            "Summary": "INOX India has been awarded a contract to establish a mini LNG terminal for island power producers in The Bahamas. The project involves supplying 10 LNG storage tanks, each with a capacity of 1500m^3, along with a re-gasification system. This infrastructure is intended to support a power plant project in the island nation.",
            "Sentiment": "positive",
            "PublishDate": 1731294600000,
            "Source": "corporate_action"
        },
        {
            "Title": "INOX INDIA Reports Q2 Financial Results",
            "Summary": "INOX INDIA has released its Q2 financial results. The company's EBITDA for the quarter was 639 million rupees, compared to 667 million rupees in the same quarter last year. The EBITDA margin decreased to 20.85% from 22.97% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731053800000,
            "Source": "result"
        },
        {
            "Title": "INOX INDIA Reports Q2 Revenue Growth",
            "Summary": "INOX INDIA has announced its second-quarter revenue results. The company reported revenue of 3.1 billion rupees, compared to 2.9 billion rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731053792000,
            "Source": "result"
        },
        {
            "Title": "INOX INDIA Reports Q2 Profit Increase",
            "Summary": "INOX INDIA has reported a consolidated net profit of 495 million rupees for the second quarter, compared to 462 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731053767000,
            "Source": "result"
        },
        {
            "Title": "INOX India Secures Major Contract for Energy Storage Project",
            "Summary": "INOX India has been awarded a significant contract by Highview Power, UK, for the world's largest liquid air energy storage project in Manchester. The company will supply five vertical tanks, each with a capacity of 690KL, for this groundbreaking project.",
            "Sentiment": "positive",
            "PublishDate": 1730986455000,
            "Source": "corporate_action"
        }
    ]
}