{
    "Symbol": "INSECTICID",
    "ISIN": "INE070I01018",
    "News": [
        {
            "Title": "Insecticides India Q3FY26 Results & Interim Dividend",
            "Summary": "Insecticides India reports Q3FY26 standalone profit of ₹884.30 lacs, declares ₹2 per share interim dividend with record date February 6, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769765636236,
            "Source": "co_actions_results"
        },
        {
            "Title": "Insecticides India Reports Zero Physical Share Transfers",
            "Summary": "Insecticides India Limited reported no physical share transfer requests received or processed during January 1-6, 2026 period under SEBI's special re-lodgement window.",
            "Sentiment": "neutral",
            "PublishDate": 1769595517504,
            "Source": "stocks"
        },
        {
            "Title": "Insecticides India Completes Major Share Transfer",
            "Summary": "Insecticides (India) Limited announces substantial acquisition of 1,96,83,052 equity shares (67.65%) through off-market gift transfer among promoter family members for succession planning.",
            "Sentiment": "neutral",
            "PublishDate": 1769250039409,
            "Source": "co_actions_results"
        },
        {
            "Title": "Insecticides India Board Meet on Jan 30 for Q3 Results",
            "Summary": "Insecticides (India) Limited has scheduled its board meeting for January 30, 2026, to consider Q3FY26 financial results and potential interim dividend declaration with February 6 as record date.",
            "Sentiment": "neutral",
            "PublishDate": 1768385597280,
            "Source": "co_actions_results"
        },
        {
            "Title": "Insecticides India Gets SEBI Nod for Family Trust Share Transfer",
            "Summary": "SEBI grants exemption to Insecticides (India) Limited promoter group for transferring 67.65% stake to four family trusts without open offer requirement, facilitating succession planning within the promoter family.",
            "Sentiment": "neutral",
            "PublishDate": 1767014132192,
            "Source": "co_actions_results"
        },
        {
            "Title": "Insecticides India Reports 2% Revenue Growth Despite Weather Challenges in Q2 FY26",
            "Summary": "Insecticides India Limited achieved revenue growth of 2% to Rs. 638 crores and gross profit increase of 11% to Rs. 220 crores in Q2 FY26, despite facing Rs. 150 crores in product returns due to heavy rainfall disrupting agricultural activities. The company launched five new products including collaborations with Corteva Agroscience and Nissan Chemical, while maintaining EBITDA margins at 13% in H1 and expressing optimism for H2 recovery driven by improved soil moisture conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1763191610869,
            "Source": "earnings"
        },
        {
            "Title": "Insecticides (India) Limited Reports Quarterly Results and Appoints New COO",
            "Summary": "Insecticides (India) Limited announced its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company reported standalone revenue from operations of Rs 64,124.89 lacs for the quarter, compared to Rs 69,137.24 lacs in the previous quarter and Rs 62,720.83 lacs in the same quarter last year. Standalone profit for the quarter was Rs 5,531.02 lacs versus Rs 5,730.05 lacs in the previous quarter and Rs 6,160.34 lacs in the corresponding quarter of the previous year. The Board also approved the appointment of Mr. Devendra Kumar Ray as Chief Operating Officer (COO) effective November 12, 2025. Ray brings over 35 years of experience in chemical manufacturing operations management and holds a B.Tech in Chemical Technology from HBTI, Kanpur. The company operates in the agro-chemicals business segment comprising technical and formulation products.",
            "Sentiment": "neutral",
            "PublishDate": 1762935245367,
            "Source": "earnings"
        },
        {
            "Title": "Insecticides Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Insecticides reported Q2 net profit of 553 million rupees, down from 616 million rupees in the same quarter last year. Revenue increased to 6.4 billion rupees compared to 6.27 billion rupees year-over-year. EBITDA declined to 849 million rupees from 899 million rupees, while EBITDA margin compressed to 13.23% from 14.33% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762934595893,
            "Source": "earnings"
        },
        {
            "Title": "Insecticides (India) Limited Schedules Earnings Conference Call for Q2 & H1 FY26 Results",
            "Summary": "Insecticides (India) Limited has announced an earnings conference call scheduled for November 12, 2025, at 5:00 PM IST to discuss the company's Q2 & H1 FY26 financial results. The company will announce its standalone and consolidated unaudited financial results for the quarter and half year ended September 30, 2025, on the same day. The conference call will be represented by Managing Director Rajesh Kumar Aggarwal, CFO Sandeep Aggarwal, and Chief Marketing Officer Dushyant Sood. The call will be accessible through multiple international dial-in numbers including India, Singapore, USA, and UK, with pre-registration available through a provided link.",
            "Sentiment": "neutral",
            "PublishDate": 1761308835024,
            "Source": "earnings"
        },
        {
            "Title": "Insecticides (India) Reports 18% EBITDA Growth in Q1 FY2026, Targets 10% Revenue Growth",
            "Summary": "Insecticides (India) Limited reported revenue growth of 5% to INR 691 crores in Q1 FY2026. EBITDA grew 18% to INR 85 crores with margin expansion of 122 basis points to 12.3%. PAT increased 18% to INR 58 crores. Premium products grew 20% and now represent 58% of B2C sales. The company launched 12 new products in FY2025, generating INR 42 crores in Q1 FY2026 sales. B2C segment contributes 75% of revenue while B2B accounts for 23% and exports 2%. All manufacturing facilities are operating at 100% capacity utilization. The company added over 100 new reactors at Dahej plant and increased crop advisors from 900 to over 1,300. Management targets overall revenue growth of 10% for FY2026 and expects to maintain current EBITDA margin levels. The company is expanding capacity with a new facility at Sotanala, Rajasthan, with formulation unit expected to start next kharif season.",
            "Sentiment": "positive",
            "PublishDate": 1755596472715,
            "Source": "earnings"
        },
        {
            "Title": "Insecticides (India) Limited Reports First Quarter Financial Results for June 2025",
            "Summary": "Insecticides (India) Limited's Board of Directors approved unaudited standalone and consolidated financial results for the first quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 35,914.51 lacs and profit after tax of Rs. 1,918.49 lacs, with earnings per share of Rs. 4.82. On a consolidated basis, revenue from operations was Rs. 38,533.31 lacs with profit after tax of Rs. 2,071.11 lacs and earnings per share of Rs. 4.97. The company operates in agro-chemicals manufacturing and distribution, comprising technical and formulation segments. The results were reviewed by the Audit Committee and joint statutory auditors S S Kothari Mehta & Co. LLP and Devesh Parekh & Co. provided limited review reports.",
            "Sentiment": "neutral",
            "PublishDate": 1755077575756,
            "Source": "earnings"
        },
        {
            "Title": "Insecticides (India) Reports Strong Q1 Performance with Revenue Growth to 6.9B Rupees",
            "Summary": "Insecticides (India) delivered improved quarterly results with revenue rising to 6.9 billion rupees from 6.6 billion rupees year-over-year. The company's EBITDA increased to 840 million rupees compared to 718 million rupees in the same period last year, while EBITDA margin expanded to 12.15% from 10.9%. Net profit also grew to 573 million rupees versus 490 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1755076420600,
            "Source": "earnings"
        },
        {
            "Title": "Insecticides India Limited Launches SPARCLE Insecticide in Partnership with Corteva Agriscience",
            "Summary": "Insecticides (India) Limited launched SPARCLE, a new broad-spectrum insecticide for the domestic paddy market on August 11, 2025, in collaboration with Corteva Agriscience. The product targets brown plant hopper (BPH) and aims to improve rice yields for farmers. SPARCLE combines advanced chemistry from Corteva with IIL's distribution network and farmer connections. Managing Director Rajesh Aggarwal described the collaboration as a milestone in bringing global agricultural technologies to Indian farmers, while Chief Marketing Officer Dushyant Sood emphasized the product's role in strengthening IIL's rice crop solution portfolio. The partnership represents both companies' commitment to delivering science-backed crop protection solutions to transform Indian agriculture.",
            "Sentiment": "positive",
            "PublishDate": 1754913965482,
            "Source": "stock"
        },
        {
            "Title": "Insecticides India: Agrochemical Sector Outlook Improving, Says MD",
            "Summary": "Insecticides India's MD Rajesh Aggarwal reports improving outlook for agrochemicals sector due to good rainfall and strong reservoir levels. The domestic market is estimated at ₹40,000 crore, with exports slightly ahead. Overall market valued at $9 billion, expected to reach $10 billion. Company investing in R&D, backward integration, and new-generation products. Positive growth momentum observed in the current year.",
            "Sentiment": "positive",
            "PublishDate": 1752489696000,
            "Source": "normal_news"
        },
        {
            "Title": "Insecticides India Maintains Double-Digit Growth Guidance and Expects High CAGR from Plant Expansion",
            "Summary": "Insecticides India has reaffirmed its guidance for double-digit growth. The company anticipates a Compound Annual Growth Rate (CAGR) exceeding 50% in the next three to four years, attributed to their new plant expansion. This information was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1748488496000,
            "Source": "default"
        },
        {
            "Title": "Insecticides India Reports Q4 Financial Results",
            "Summary": "Insecticides India Limited has reported its Q4 financial results. The company's EBITDA increased to 284.7 million rupees from 92.6 million rupees year-over-year. The EBITDA margin improved to 7.93% from 3.4% in the same period last year. Revenue rose to 3.6 billion rupees from 2.73 billion rupees year-over-year. Net profit for Q4 stood at 140.2 million rupees, up from 81 million rupees year-over-year and 150 million rupees quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748431288000,
            "Source": "result"
        },
        {
            "Title": "Insecticides India Launches Altair in Collaboration with Nissan Chemical",
            "Summary": "Insecticides (India) has launched a new product called Altair in collaboration with Nissan Chemical Corporation from Japan. No further details about the product or the nature of the collaboration were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1748241061000,
            "Source": "default"
        },
        {
            "Title": "Insecticides India: Targets 15% Revenue Growth in FY26 Through Premium Products",
            "Summary": "Insecticides India aims for 15% topline growth in FY26, focusing on high-margin premium products. The company expects record profitability in FY25, plans to expand its premium portfolio, especially herbicides. Export revenue is projected to double to Rs 200 crore in FY26. A new automated plant in Rajasthan is expected to start operations by April 2026.",
            "Sentiment": "positive",
            "PublishDate": 1744966788000,
            "Source": "normal_news"
        },
        {
            "Title": "Insecticides India Reports Improved Q3 EBITDA and Margin",
            "Summary": "Insecticides India Limited has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 287 million rupees from 260 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 7.98% from 7.27% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739182364000,
            "Source": "earnings"
        },
        {
            "Title": "Insecticides India Reports Q3 Financial Results",
            "Summary": "Insecticides India Limited has announced its financial results for the third quarter. The company reported a net profit of 150 million rupees, up from 123 million rupees in the same quarter last year. Revenue for Q3 stood at 3.6 billion rupees, slightly higher than the 3.58 billion rupees reported in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739182359000,
            "Source": "earnings"
        },
        {
            "Title": "Insecticides India: New Product 'Centran' Targets Rs 100 Crore Revenue by FY27",
            "Summary": "Insecticides India Ltd. launched 'Centran', a new insecticide for paddy stem borers. The company expects Rs 100 crore revenue from Centran by FY27, with Rs 50 crore in FY26. Initial two-month revenue target is Rs 10 crore. Plans include developing a liquid formulation and expanding to other crops. The company aims for 25% growth from premium products in the next fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1736562600000,
            "Source": "normal_news"
        },
        {
            "Title": "Insecticides India Launches New Dual-Action Insecticide for Paddy Stem Borers",
            "Summary": "Insecticides (India) has introduced a new insecticide called Centran, specifically designed to combat paddy stem borers. This product is unique as it combines pest control properties with crop nourishment benefits, featuring a blend of two active ingredients.",
            "Sentiment": "positive",
            "PublishDate": 1736259817000,
            "Source": "corporate_action"
        },
        {
            "Title": "Insecticides (India) Granted Patent for Fungicidal Composition",
            "Summary": "Insecticides (India) Limited has been granted a patent by the Patent Office, Government of India, for their invention titled 'Fungicidal Compositions and Methods Related Thereto'. The patent has been awarded for a term of 20 years, effective from June 28, 2019.",
            "Sentiment": "positive",
            "PublishDate": 1732277581000,
            "Source": "corporate_action"
        },
        {
            "Title": "Insecticides India to Invest in Kaeros Research",
            "Summary": "Insecticides (India) Limited has announced plans to make an investment of up to 62.4 million rupees in Kaeros Research. This investment decision represents a significant financial commitment by the company, potentially aimed at enhancing its research capabilities or expanding its business operations.",
            "Sentiment": "positive",
            "PublishDate": 1731323114000,
            "Source": "corporate_action"
        },
        {
            "Title": "Insecticides India Ltd Reports Improved Q2 Financial Performance",
            "Summary": "Insecticides India Ltd has announced its Q2 financial results. The company's EBITDA increased to 899 million rupees from 823 million rupees year-over-year. The EBITDA margin also improved, rising to 14.33% from 11.82% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731320946000,
            "Source": "result"
        },
        {
            "Title": "INSECTICIDES Reports Q2 Revenue Decline",
            "Summary": "INSECTICIDES has reported a revenue of 6.27 billion rupees for the second quarter, down from 6.9 billion rupees in the same quarter last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731320919000,
            "Source": "result"
        },
        {
            "Title": "Insecticides India Reports Q2 Profit Increase",
            "Summary": "Insecticides India Limited has reported a net profit of 616 million rupees for the second quarter, showing an increase from 532 million rupees year-over-year and 491 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731320886000,
            "Source": "result"
        },
        {
            "Title": "Insecticides India: Launches New Maize Herbicide 'Torry Super'",
            "Summary": "<p><span class='neutral'>Insecticides India</span> has introduced <span class='positive'>Torry Super</span>, a new <b>post-emergence herbicide</b> for <span class='neutral'>maize</span>, aimed at improving <span class='positive'>weed control</span> and <span class='positive'>crop safety</span>. The company's Managing Director, Rajesh Aggarwal, emphasized the product's role in enhancing <span class='positive'>productivity</span> and <span class='positive'>sustainable farming</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728049860000,
            "Source": "normal_news"
        },
        {
            "Title": "Insecticides India Launches New Herbicide for Maize",
            "Summary": "<p><span class=\"neutral\">Insecticides (India) Limited</span> has introduced a <span class=\"positive\">new herbicide product</span> called <b>Torry Super</b>, specifically designed for <span class=\"neutral\">maize crops</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728046927000,
            "Source": "corporate_action"
        }
    ]
}