{
    "Symbol": "INSPIRISYS",
    "ISIN": "INE020G01017",
    "News": [
        {
            "Title": "Inspirisys Solutions Q3FY26 Results & Key Appointment",
            "Summary": "Inspirisys Solutions reported Q3FY26 results with consolidated revenue of ₹12,980 lakhs and appointed Mr. Noriyuki Okayasu as Senior Advisor – Strategic Initiatives for one year from April 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770369670859,
            "Source": "co_actions_results"
        },
        {
            "Title": "Inspirisys Solutions Board Meet Set for Feb 6, 2026",
            "Summary": "Inspirisys Solutions Limited has scheduled a Board of Directors meeting on February 6, 2026, to consider and approve unaudited financial results for Q3 FY26 ending December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768807151918,
            "Source": "co_actions_results"
        },
        {
            "Title": "Inspirisys Solutions Auditor Firm Converts to LLP",
            "Summary": "Inspirisys Solutions announces that its statutory auditor MSKA & Associates has converted from a partnership firm to a Limited Liability Partnership, now operating as MSKA & Associates LLP effective January 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768793880460,
            "Source": "stocks"
        },
        {
            "Title": "Inspirisys Solutions Reports 43% Revenue Growth in Q2 FY26 with Strong Profitability",
            "Summary": "Inspirisys Solutions Limited reported consolidated revenue of ₹12,185 lakhs for the quarter ended September 30, 2025, compared to ₹8,531 lakhs in the same quarter last year, marking a 43% increase. The company's consolidated profit after tax rose to ₹740 lakhs from ₹377 lakhs year-over-year. For the six-month period, consolidated revenue reached ₹20,840 lakhs versus ₹17,162 lakhs in the previous year. The company operates through three business segments: Systems Integration (₹3,799 lakhs revenue), Services (₹8,009 lakhs revenue), and Warranty Management Services (₹163 lakhs revenue) for the quarter. The Board approved the unaudited financial results and completed the liquidation of two wholly-owned subsidiaries - Inspirisys Solutions DMCC in UAE and Inspirisys Solutions Japan Kabushiki Kaisha. The company also closed its Singapore branch operations in June 2025. Earnings per share for continuing operations stood at ₹1.85 for the quarter compared to ₹0.95 in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762509297637,
            "Source": "earnings"
        },
        {
            "Title": "Inspirisys Solutions Receives Show Cause Notice Over Rs 502.51 Lakh Input Tax Credit Claim",
            "Summary": "Inspirisys Solutions Limited received a Show Cause Notice from the Joint Commissioner, Office of the Principal Commissioner of CGST and Central Excise, Chennai - North Commissionerate. The notice seeks clarification on alleged excess Input Tax Credit (ITC) availed by the company for FY 2021-22 amounting to Rs 502.51 lakhs. The company states there are no expected financial implications due to compensation or penalty at this stage. No litigation has been filed in any court or tribunal yet.",
            "Sentiment": "negative",
            "PublishDate": 1759238183079,
            "Source": "stock"
        },
        {
            "Title": "Inspirisys Solutions Completes Voluntary Liquidation of Japanese Subsidiary",
            "Summary": "Inspirisys Solutions Limited has completed the voluntary liquidation of its wholly owned subsidiary, Inspirisys Solutions Japan KK. The liquidation process was finalized on July 14, 2025, and officially registered on July 15, 2025, with the liquidation certificate received on August 19, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755597025671,
            "Source": "corporate_action"
        },
        {
            "Title": "Inspirisys Solutions Reports 42% Jump in Net Profit Despite Revenue Decline in Q1 FY2026",
            "Summary": "Inspirisys Solutions Limited reported net profit of ₹20.39 crore for Q1 FY2026, up from ₹14.39 crore in Q1 FY2025. However, total income from operations declined 5.9% to ₹63.84 crore from ₹67.84 crore year-on-year. EBITDA margin improved significantly to 26.8% from 17.9% in the previous year. Earnings per share increased to ₹3.26 from ₹2.30. The company's net worth stood at ₹313.89 crore and debt-equity ratio at 0.23. The company is focusing on high-margin services, expanding in North America and Europe, and investing in emerging technologies like cloud, AI/ML, and cybersecurity. Executive Director & CEO Murali Gopalakrishnan highlighted the focus on operational efficiency initiatives and commitment to sustainable growth.",
            "Sentiment": "positive",
            "PublishDate": 1754736659722,
            "Source": "earnings"
        },
        {
            "Title": "Inspirisys Solutions Reports Q1 FY26 Results with Revenue of ₹846 Crores",
            "Summary": "Inspirisys Solutions Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. On a consolidated basis, the company reported revenue from operations of ₹8,460 lakhs and total profit after tax of ₹614 lakhs. The standalone results showed revenue of ₹8,217 lakhs with profit after tax of ₹542 lakhs. The company completed liquidation of its wholly owned subsidiary Inspirisys Solutions DMCC in May 2025 and closed its Singapore branch operations on June 10, 2025. The Board also initiated voluntary liquidation process for its Japan subsidiary. Earnings per share for continuing and discontinued operations stood at ₹1.54 on consolidated basis and ₹1.37 on standalone basis.",
            "Sentiment": "neutral",
            "PublishDate": 1754645061384,
            "Source": "earnings"
        }
    ]
}