{
    "Symbol": "INTELLECT",
    "ISIN": "INE306R01017",
    "News": [
        {
            "Title": "Intellect Design Arena Announces Postal Ballot for Directors",
            "Summary": "Intellect Design Arena Limited has announced a postal ballot process for the appointment of D. Shivakumar as Independent Director and re-appointment of Anil Kumar Verma as Whole-time Director, with e-voting scheduled from February 11 to March 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770635329072,
            "Source": "stocks"
        },
        {
            "Title": "Intellect Design Arena Partners with DUCA Credit Union",
            "Summary": "Intellect Design Arena announces partnership with DUCA Credit Union to transform digital banking using eMACH.ai platform. DUCA has over 92,000 members and 7.5 billion CAD in assets across 19 Ontario branches.",
            "Sentiment": "positive",
            "PublishDate": 1770621190640,
            "Source": "stocks"
        },
        {
            "Title": "Intellect Design Arena Gets ISO/IEC 42001:2023 Cert",
            "Summary": "Intellect Design Arena Limited receives ISO/IEC 42001:2023 certification for AI management systems, reinforcing its AI-first business model and commitment to governance and transparency.",
            "Sentiment": "positive",
            "PublishDate": 1770287082157,
            "Source": "stocks"
        },
        {
            "Title": "Intellect Design Arena Partners with Sampath Bank",
            "Summary": "Intellect Design Arena Limited forms strategic alliance with Sampath Bank PLC to enhance corporate and SME banking services in Sri Lanka using Emach.AI platform for cash management, trade finance, and supply chain finance.",
            "Sentiment": "positive",
            "PublishDate": 1770104378528,
            "Source": "stocks"
        },
        {
            "Title": "Intellect Design Arena Q3FY26 Results & Board Changes",
            "Summary": "Intellect Design Arena reported Q3FY26 financial results with consolidated revenue of ₹7,313.84 million. Board approved key management appointments including re-appointment of Anil Kumar Verma as Whole-time Director.",
            "Sentiment": "neutral",
            "PublishDate": 1769770462179,
            "Source": "co_actions_results"
        },
        {
            "Title": "Intellect Design Arena Allots 87,561 ESOP Shares",
            "Summary": "Intellect Design Arena Limited allotted 87,561 equity shares under ESOP schemes on January 28, 2026, increasing issued share capital to ₹69,70,15,115 with 13,94,03,023 equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1769614158349,
            "Source": "co_actions_results"
        },
        {
            "Title": "Intellect Design Arena Expands AI-First Payments Platform to US",
            "Summary": "Intellect Design Arena accelerates US market expansion with world's only AI-first payments platform as real-time payments revenue opportunity projected to reach $2 billion by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1769498783561,
            "Source": "stocks"
        },
        {
            "Title": "Intellect Design Arena Onboards 14 AI Partners Globally",
            "Summary": "Intellect Design Arena announces 14 Value Discovery Partners across six regions to accelerate enterprise AI adoption through its Purple Fabric platform, moving beyond pilot programs to production-grade business impact.",
            "Sentiment": "positive",
            "PublishDate": 1769079266471,
            "Source": "stocks"
        },
        {
            "Title": "Intellect Design Arena Q3FY26 Earnings Call on Jan 30",
            "Summary": "Intellect Design Arena Limited has scheduled its Q3FY26 earnings conference call for January 30, 2026, at 5:00 PM IST via Zoom webinar to discuss quarterly performance.",
            "Sentiment": "neutral",
            "PublishDate": 1768986187097,
            "Source": "co_actions_results"
        },
        {
            "Title": "Intellect Design Wins AI GRC Project in Canada",
            "Summary": "Intellect Design Arena secures multi-year AI governance, risk and compliance project with Carte Wealth in Canada, marking significant expansion in AI regulatory operations through Purple Fabric platform.",
            "Sentiment": "positive",
            "PublishDate": 1768891125855,
            "Source": "co_actions_results"
        },
        {
            "Title": "Intellect Design Arena Wins ₹36.77 Cr Tax Relief",
            "Summary": "CESTAT Chennai sets aside ₹36.77 crore service tax demand against Intellect Design Arena, significantly reducing contingent liabilities and validating the company's tax positions on overseas transactions.",
            "Sentiment": "positive",
            "PublishDate": 1765882348750,
            "Source": "stocks"
        },
        {
            "Title": "Intellect Design Arena Unit Partners 35 Credit Unions",
            "Summary": "Intellect Design Arena's subsidiary has formed strategic partnerships with 35 credit unions across Canada, expanding the company's presence in the Canadian financial services market.",
            "Sentiment": "positive",
            "PublishDate": 1765796932542,
            "Source": "stocks"
        },
        {
            "Title": "Intellect Design Arena Wins 35 Canadian Credit Unions",
            "Summary": "Intellect Design Arena secures partnerships with 35 Canadian credit unions across 8 provinces, collectively managing over $13 billion in assets and serving 373,000+ members through its eMACH.ai platform.",
            "Sentiment": "positive",
            "PublishDate": 1765796606997,
            "Source": "co_actions_results"
        },
        {
            "Title": "Intellect Design Arena Elevates Manish Maakan to Executive President Group Chief Revenue Officer",
            "Summary": "Intellect Design Arena announced the elevation of Manish Maakan to Executive President Group Chief Revenue Officer while continuing as CEO of Intellect Wholesale Banking, with an expanded mandate to drive global growth across major financial hubs. The appointment strengthens the company's ability to capture growing demand across the US, Canada, Europe, MEA, India, APAC and ANZ markets with disciplined execution and aligned global market strategy.",
            "Sentiment": "positive",
            "PublishDate": 1764759904800,
            "Source": "corporate_governance"
        },
        {
            "Title": "Intellect Design Arena Elevates Manish Maakan to Executive President and Group Chief Revenue Officer",
            "Summary": "Intellect Design Arena's Board approved the elevation of Manish Maakan from CEO of Wholesale Banking to Executive President, expanding his role to include Group Chief Revenue Officer globally. Maakan, who has 34 years of experience and has been with Intellect for 19 years, will continue as CEO of Wholesale Banking while taking on the additional revenue leadership responsibilities.",
            "Sentiment": "positive",
            "PublishDate": 1764243838929,
            "Source": "corporate_governance"
        },
        {
            "Title": "Intellict Design Arena Launches PF Credit Service in Philippines Banking Market",
            "Summary": "Intellict Design Arena has introduced PF Credit in the Philippines, a new service designed to help banks enhance their lending capabilities. The launch expands the company's presence in the Philippine banking sector by offering solutions to improve financial institutions' lending operations.",
            "Sentiment": "positive",
            "PublishDate": 1764240281357,
            "Source": "stock"
        },
        {
            "Title": "Intellect Design Arena Allots 72,331 Equity Shares Under Employee Stock Option Plans",
            "Summary": "Intellect Design Arena's Stakeholders Relationship Committee approved the allotment of 72,331 equity shares of ₹5 each to eligible employees who exercised options under three ESOP schemes on November 26, 2025. The allotment increases the company's total issued share capital to ₹69,64,60,425 comprising 13,92,92,085 equity shares, with the new shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764150440939,
            "Source": "corporate_action"
        },
        {
            "Title": "Intellect Design Arena Wins AI Award for Financial Services at UK's National AI Awards 2025",
            "Summary": "Intellect Design Arena won the AI Award for Financial Services at the National AI Awards held on October 16, 2025, in the UK for deploying enterprise-grade digital experts through its PurpleFabric platform. The recognition highlights the company's work in transforming complaints handling for a UK wealth management firm, enabling case handlers to process complaints up to 10x faster with over 80% SLA compliance.",
            "Sentiment": "positive",
            "PublishDate": 1763454452080,
            "Source": "stock"
        },
        {
            "Title": "Intellect Design Arena Reports Strong Q2 Performance with 34% Revenue Growth and Strategic AI Investments",
            "Summary": "Intellect Design Arena delivered revenue of 789 crore in Q2, marking 34% year-on-year growth and 7% sequential growth. EBITDA reached 184 crore, growing 68% year-on-year, while net profit almost doubled to 102 crore, representing 94% year-on-year increase. The company's Annual Recurring Revenue crossed 1,080 crore. For the first half, revenue stood at 1,523 crore (26% growth), EBITDA at 360 crore (46% growth), and PAT at 197 crore (55% growth). The company recorded 18 new deal wins in Q2, including 11 multi-million-dollar deals, and enabled 22 digital transformations. Global deal funnel has crossed 12,000 crore. Intellect announced key leadership appointments including Vivek Gupta as President and Global Head of Consulting, and Rakesh Srivastava as President and Chief Revenue Officer for the Americas. The company is investing 130 crore in its PurpleFabric AI platform, with 25 crore invested in Q2. Collections stood at 753 crore, up 37% year-on-year, with cash and cash equivalents rising to 927 crore. The company is also investing in a 7.25 lakh sq. ft. facility at its Siruseri campus for AI labs and training initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1762366340565,
            "Source": "earnings"
        },
        {
            "Title": "Intellect Design Arena Appoints Rakesh Srivastava as President and Chief Revenue Officer for Americas",
            "Summary": "Intellect Design Arena Ltd, a financial technology company operating across 61 countries, appointed Rakesh Srivastava as President and Chief Revenue Officer for the USA, Mexico, and South America. Based in New York, Srivastava will focus on accelerating growth strategy, driving client success, and strengthening the company's leadership position across the Americas. Srivastava brings over two decades of experience in Financial Services, FinTech, Banking, Payments, Capital Markets, and Insurance. He previously held senior leadership roles at Amazon Web Services, where he oversaw a $1.6 billion revenue portfolio across North and South America, and served as Senior Vice President at TechMahindra. He also held executive roles at Dell Technologies and MphasiS. Srivastava holds an MBA in Finance and Marketing and completed leadership programs at The Wharton School and ABA Stonier Graduate School of Banking at the University of Pennsylvania.",
            "Sentiment": "positive",
            "PublishDate": 1762321172295,
            "Source": "corporate_governance"
        },
        {
            "Title": "Intellect Design Arena Shares Surge 21% in Four Days After Profit Nearly Doubles to Rs 102 Crore",
            "Summary": "Intellect Design Arena shares gained 10% to Rs 1,245 on November 3, extending a four-day rally of 21% following strong quarterly results. The financial technology company reported profit after tax of Rs 102 crore, up 94% year-on-year from Rs 53 crore. Revenue increased 34% to Rs 789 crore from Rs 587 crore in the same quarter last year. Platform revenue surged 200% to Rs 137 crore, license revenue rose 69% to Rs 144 crore, and AMC revenue grew 19% to Rs 143 crore. EBITDA increased 68% to Rs 184 crore. The company's eMACH.ai platform secured 18 new customers during the quarter, with 22 global financial institutions going live on its digital platforms. Collections stood at Rs 753 crore, up from Rs 550 crore last year. Mukul Mahavir Agrawal holds a 1.44% stake in the company. The stock has gained 47% over the last six months.",
            "Sentiment": "positive",
            "PublishDate": 1762163275682,
            "Source": "earnings"
        },
        {
            "Title": "Intellect Design Arena Grants 5.21 Lakh RSUs to 30 Associates Under ESOP Scheme",
            "Summary": "Intellect Design Arena granted 5,21,000 Restricted Stock Units (RSUs) to 30 associates under its ISOP/RSU 2016 Scheme following approval from the Nomination, Remuneration and Compensation Committee. The RSUs have a grant price of nil and feature varying vesting schedules across different employee groups. The largest allocation of 3,05,500 RSUs goes to 22 associates with three equal annual vests at the end of 3rd, 4th and 5th years. Other groups include 80,000 RSUs for 5 associates vesting 50% each in 4th and 5th years, and 1,25,000 RSUs for one associate with 20% vesting in 3rd year and 40% each in 4th and 5th years. These are fresh grants and not against surrender of prior grants. Associates can convert RSUs into shares in full or tranches during the exercise period after vesting.",
            "Sentiment": "positive",
            "PublishDate": 1761904460139,
            "Source": "corporate_action"
        },
        {
            "Title": "Intellect Design Arena Reports Q2 Revenue Growth to 7.6 Billion Rupees",
            "Summary": "Intellect Design Arena reported Q2 revenue of 7.6 billion rupees, up from 7 billion rupees in the previous quarter. The company's Q2 EBIT increased to 1.04 billion rupees from 952 million rupees quarter-on-quarter. EBIT margin improved to 13.8% compared to 13.57% in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761896181972,
            "Source": "earnings"
        },
        {
            "Title": "Intellect Design Arena Reports 34% Revenue Growth to INR 789 Cr in Q2FY26, Appoints Two Senior Management Personnel",
            "Summary": "Intellect Design Arena Limited reported strong quarterly results with total income reaching INR 789 Cr compared to INR 587 Cr in the previous year, representing 34% year-over-year growth. EBITDA increased 68% to INR 184 Cr while profit after tax surged 94% to INR 102 Cr. For the half-year period, total income grew 26% to INR 1,523 Cr with EBITDA rising 46% to INR 360 Cr. The company's License-Linked Revenue grew 69% to INR 423 Cr in the quarter, with Annual Recurring Revenue standing at INR 1,080 Cr. Cash and cash equivalents increased to INR 927 Cr from INR 755 Cr in the previous year. The Board approved the nomination of John Owen as President, Western Hemisphere and Vivek Gupta as President Head of Consulting as Senior Management Personnel. The company secured 18 new customer wins and completed 22 digital transformations in the quarter, with 35 deal wins and 37 digital transformations for the half-year period.",
            "Sentiment": "positive",
            "PublishDate": 1761896148696,
            "Source": "earnings"
        },
        {
            "Title": "Intellect Design Arena Reports Higher Quarterly Net Profit",
            "Summary": "Intellect Design Arena reported consolidated net profit of 1.02 billion rupees in Q2, compared to 940 million rupees in the previous quarter, representing a quarter-on-quarter increase.",
            "Sentiment": "positive",
            "PublishDate": 1761895737094,
            "Source": "earnings"
        },
        {
            "Title": "Intellect Design Arena Wins Gold Medal for Banking Innovation at Datos Impact Awards",
            "Summary": "Intellect Design Arena Ltd received the Gold medal for Best Innovation in Operational Efficiency in the Datos Insights Impact Awards in Commercial Banking & Payments. The award recognized the company's eMACH.ai Transaction Limits Management (TLM) solution, which automates payment processing across complex corporate structures. The cloud-native platform processes 1.5 million payments daily at 200 transactions per second and operates across 22 countries in North America, UK, and Europe. The solution achieves up to 99.9% straight-through processing while reducing manual referrals. Intellect is expanding TLM capabilities into Trade Finance, Supply Chain Finance, and Capital Markets while enhancing AI/ML features. The company serves over 500 customers worldwide across 61 countries with its financial technology solutions.",
            "Sentiment": "positive",
            "PublishDate": 1761636705974,
            "Source": "stock"
        },
        {
            "Title": "Intellect Design Arena Allots 54,104 Equity Shares Under Employee Stock Option Plans",
            "Summary": "Intellect Design Arena Limited has allotted 54,104 equity shares of ₹5 each to eligible employees who exercised their stock options under three ESOP schemes. The allotment includes 14,946 shares under ISOP 2015, 5,250 shares under ISOP 2016, and 33,908 shares under IIPS 2018. Following this allotment, the company's issued and subscribed share capital increased to ₹69,60,98,770, divided into 13,92,19,754 equity shares. The new shares will rank equally with existing equity shares. The Stakeholders Relationship Committee approved the allotment through a circular resolution dated October 23, 2025, with shares issued on October 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761319833575,
            "Source": "corporate_action"
        },
        {
            "Title": "NCBA Becomes First East African Bank to Deploy Intellect's Cloud-Based Banking Solution with Connect Plus Launch",
            "Summary": "NCBA launched Connect Plus, an enhanced transaction banking platform powered by Intellect's eMACH.ai Digital Transaction Banking technology. The platform offers faster transaction processing, expanded payment options, enhanced reporting tools, cash liquidity management, and integrations with other financial services platforms. The upgrade aims to enhance NCBA's corporate banking services with a more streamlined, secure, and user-friendly digital banking experience. NCBA Managing Director James Gossip stated the platform supports the bank's goal to become a dominant corporate and SME bank in Kenya while supporting the Government's Kenya Digital Economy initiative. Intellect Wholesale Banking CEO Manish Maakan noted that over 70% of the world's top banks use eMACH.ai technology, and this marks Intellect's third major digital transformation in Kenya, bringing their Sub Saharan client count to 23. The platform includes account services, payments, collections, liquidity, trade finance, and host-to-host services for corporate clients. NCBA operates 100 branches across Kenya and is described as one of Kenya's leading banks by asset size.",
            "Sentiment": "positive",
            "PublishDate": 1761209549186,
            "Source": "stock"
        },
        {
            "Title": "Intellect Design Arena Elevates Vikas Misra to Chief Strategy Officer",
            "Summary": "Intellect Design Arena Limited appointed Vikas Misra as Chief Strategy Officer, designated as Senior Management Personnel, effective October 17, 2025. The Board of Directors approved the proposal based on recommendations from the Nomination, Remuneration & Compensation Committee. Misra was previously Executive Vice President and has been with the organization since joining Polaris Software Group in April 1996. He has held multiple roles including SBU Head for Emerging Verticals business, CEO of Digital & Government Business managing Government e Marketplace, and has been part of the Office of Strategy since January 2020, working closely with the Chairman on mid to long term organizational initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1760711203473,
            "Source": "corporate_governance"
        },
        {
            "Title": "Intellect Design Arena Launches AI-Driven PF Credit Suite for Bank Loan Management",
            "Summary": "Intellect Design Arena has introduced PF Credit, an AI-driven suite designed to enhance banks' loan management capabilities. The suite includes five digital experts specifically developed to streamline various loan processes for banking institutions.",
            "Sentiment": "positive",
            "PublishDate": 1759820060390,
            "Source": "stock"
        },
        {
            "Title": "Intellect Design Arena's UK Subsidiary Partners with ITIXA to Form AI-Enabled Services Joint Venture in GIFT City",
            "Summary": "Intellect Design Arena's UK subsidiary has signed a memorandum of understanding with ITIXA Ltd. to establish a joint venture in GIFT City, Gujarat. The joint venture will focus on providing AI-enabled accounting and business support services.",
            "Sentiment": "positive",
            "PublishDate": 1755774690431,
            "Source": "order&deals"
        },
        {
            "Title": "Intellect Design Launches Purple Fabric Magic Loss Runs on AWS Marketplace",
            "Summary": "Intellect Design has launched Purple Fabric Magic Loss Runs in the AI Agents and Tools section of AWS Marketplace. The product is now available through Amazon's cloud marketplace platform.",
            "Sentiment": "positive",
            "PublishDate": 1755067974581,
            "Source": "stock"
        },
        {
            "Title": "Intellect Design Arena Launches Purple Fabric AI Platform in U.S. Market",
            "Summary": "Intellect Design Arena Ltd announced the launch of IntellectAI's Purple Fabric, an open business impact AI platform, in the U.S. market at the Ai4 2025 event. The platform, already successful with Tier 1 financial institutions globally, is now available for American banks and insurers seeking scalable AI solutions. Purple Fabric has over 45 clients globally and previously launched in the UK and Indian Subcontinent. The platform offers four key components: Enterprise Knowledge Garden for unified data fabric, Enterprise Digital Experts for multi-agent AI automation, Enterprise Governance for regulatory compliance, and LLM Optimisation Hub for cost-effective AI deployment. CEO Banesh Prabhu stated the platform aims to transform AI from isolated experiments to enterprise-wide operational engines, delivering measurable business impact across credit, risk, operations, and customer engagement functions.",
            "Sentiment": "positive",
            "PublishDate": 1754917072872,
            "Source": "stock"
        },
        {
            "Title": "Bank Albilad Partners with Intellect Design Arena for Cash Management Solutions",
            "Summary": "Bank Albilad has selected Intellect Design Arena to enhance its cash management capabilities in Saudi Arabia. The partnership aims to improve the bank's cash management operations through Intellect Design Arena's technology solutions.",
            "Sentiment": "positive",
            "PublishDate": 1754549470633,
            "Source": "order&deals"
        },
        {
            "Title": "Intellect Design Arena Reports 18% Revenue Growth, Launches Purple Fabric AI Platform",
            "Summary": "Intellect Design Arena delivered strong quarterly results with total income of ₹734 Cr (18% year-on-year growth), EBITDA of ₹176 Cr (28% growth), and profit after tax of ₹94 Cr (27% growth). License-linked revenues reached ₹389 Cr, representing over 50% of total revenue, with Annual Recurring Revenue at ₹1,041 Cr. The company won 17 new deals and went live with 15 digital transformations, including three strategic wins in the US market with eMACH.ai products. Purple Fabric, the company's new AI platform launched 60 days ago, has generated over 400 leads and built a pipeline of nearly ₹800 Cr. The company plans to invest ₹130 Cr in Purple Fabric this year and expects AI to generate approximately ₹200 Cr in revenue by year-end. The deal funnel stands at ₹11,300 Cr with over ₹9,200 Cr in active opportunities. Management targets reaching ₹4,000 Cr revenue and ₹1,000 Cr profit before tax within three years.",
            "Sentiment": "positive",
            "PublishDate": 1754045671271,
            "Source": "earnings"
        },
        {
            "Title": "Intellect Design Arena Launches eMACH.ai Platform Pilots for South African Banks",
            "Summary": "Intellect Design Arena announced the launch of pilot implementations of its eMACH.ai platform for leading South African banks. The initiative aims to transform South Africa's wholesale banking infrastructure and aligns with the National Development Plan 2030 and digital economic ambitions. The eMACH.ai platform was built by over 1,200 research engineers and powers more than 500 banks globally. The platform offers composable microservices, advanced AI capabilities, and promises 20%+ operational cost reduction across transaction banking, cash, trade, and payments. Chairman Arun Jain described South Africa as a mission rather than just another market, emphasizing the company's commitment to modernizing banking infrastructure at scale. CEO Manish Maakan confirmed that pilots are live at a leading South African bank, with the platform delivering double-digit efficiency gains and extending digital services across customer segments.",
            "Sentiment": "positive",
            "PublishDate": 1753790622630,
            "Source": "stock"
        },
        {
            "Title": "Intellect Design Arena Reports Consistent Margins, Targets 20% Annual Revenue Growth",
            "Summary": "Intellect Design Arena reported consistent margins across major markets, with UK and Europe showing slightly higher margins. The company expects EBITDA margins to remain between 22-25% and anticipates AI-driven revenue to reach ₹200 crore by year-end. The company aims for 20% annual revenue growth with profit growth forecasted at 1.5 times the revenue rate. Management has set targets of Rs. 4,000 crore revenue and Rs. 1,000 crore profit before tax within three years, though this is not official guidance.",
            "Sentiment": "positive",
            "PublishDate": 1753673356035,
            "Source": "stock"
        },
        {
            "Title": "Intellect Design Arena Announces Leadership Transition in Company Secretary Role",
            "Summary": "Intellect Design Arena Limited's Board of Directors approved key managerial personnel changes effective July 31, 2025. V.V. Naresh will retire as Company Secretary & Compliance Officer due to reaching superannuation age. Prakash Bharadwaj will succeed him starting August 1, 2025. Bharadwaj brings over 12 years of experience in corporate and securities laws, having previously worked with Infosys group for 6 years, along with experience at Mindtree, HSBC and TCS. He holds ICSI membership and a Master's degree in Business Laws from National Law School. Bharadwaj will be authorized to determine materiality of events and make stock exchange disclosures, with other key managerial personnel responsibilities remaining unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1753431274383,
            "Source": "corporate_governance"
        },
        {
            "Title": "Intellect Design Arena Reports Quarterly Results for June 30, 2025",
            "Summary": "Intellect Design Arena Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. On standalone basis, the company reported revenue from operations of Rs. 3,773.86 million and profit after tax of Rs. 554.92 million. On consolidated basis, revenue from operations stood at Rs. 7,016.89 million with profit after tax of Rs. 944.87 million. The consolidated results include 26 subsidiaries and 2 associates. Employee benefit expenses included stock-based compensation costs of Rs. 59.99 million for standalone and Rs. 120.65 million for consolidated results. Basic earnings per share was Rs. 4.02 for standalone and Rs. 6.85 for consolidated results. The board meeting was held on July 25, 2025, and the results were subject to limited review by statutory auditors.",
            "Sentiment": "neutral",
            "PublishDate": 1753429877744,
            "Source": "earnings"
        },
        {
            "Title": "Intellect Design Arena Reports Decline in Q1 Financial Performance",
            "Summary": "Intellect Design Arena reported quarterly results showing a decline across key financial metrics. The company's EBIT dropped to 952 million rupees from 1.63 billion rupees in the previous quarter, while EBIT margin fell to 13.57% from 22.43%. Revenue decreased to 7 billion rupees from 7.3 billion rupees quarter-on-quarter. Consolidated net profit also declined to 940 million rupees compared to 1.35 billion rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1753429081844,
            "Source": "earnings"
        },
        {
            "Title": "Intellect Design Arena Wins Major Deal as Tier 1 Canadian Bank Expands Partnership for US Operations",
            "Summary": "Intellect Design Arena Ltd announced that a Tier 1 Canadian multinational bank has extended its partnership by selecting Intellect's eMACH.ai Payments and Cash Management solution for real-time platform modernization across its Corporate & Investment Banking operations in the United States. The solution, built on a composable 9-layer architecture, is designed to process high volumes at speed, simplify bulk transactions, reduce operational costs, and ensure fail-safe real-time payments. This expansion follows the bank's recent adoption of eMACH.ai Core Banking and represents a strategic step in building a scalable, digital-first enterprise architecture. The eMACH.ai Payments system will enable fail-safe payments at scale with real-time monitoring, roll out payment products including ACH and FedWire, simplify bulk file processing, speed up client onboarding, and lower operational costs. According to CEO Manish Maakan of Intellect Wholesale Banking, this partnership enables the bank to reimagine real-time cash management and remittances while providing sophisticated cash management offerings to US clients. The deal marks Intellect's growing role as a strategic platform partner and accelerates its entry into high-value payments modernization programs in North America.",
            "Sentiment": "positive",
            "PublishDate": 1753355448673,
            "Source": "stock"
        },
        {
            "Title": "Intellect Design Secures Major Canadian Bank Agreement and Launches Emach.AI Core Banking in U.S.",
            "Summary": "Intellect Design has secured a major agreement with a leading Canadian bank and launched its Emach.AI Core Banking solution in the U.S. market. The company is expanding its banking technology solutions across North American markets.",
            "Sentiment": "positive",
            "PublishDate": 1753248796608,
            "Source": "order&deals"
        },
        {
            "Title": "Intellect Design Arena Onboards Faisal Islamic Bank of Egypt as Client",
            "Summary": "Intellect Design Arena has announced that it has onboarded Faisal Islamic Bank of Egypt as a new client. This partnership suggests a business expansion for Intellect Design Arena into the Egyptian banking sector, specifically in the Islamic banking segment.",
            "Sentiment": "positive",
            "PublishDate": 1752043881000,
            "Source": "default"
        },
        {
            "Title": "Intellect Design Launches PF Cloud AI Platform",
            "Summary": "Intellect Design has introduced PF Cloud, described as the first open AI platform for business impact. The company has made Purple Fabric, presumably a component or feature of PF Cloud, available on cloud at GIFT City.",
            "Sentiment": "positive",
            "PublishDate": 1750923541000,
            "Source": "default"
        },
        {
            "Title": "Intellect Design Arena: Major Contract with South African Bank for Digital Platform",
            "Summary": "Intellect Design Arena has secured a contract to implement its eMACH.ai Digital Engagement Platform for a leading South African bank across nine countries. The platform will be deployed via cloud and on-premise installations, serving both corporate and retail banking customers with over 750 front-end journeys and 520 open APIs.",
            "Sentiment": "positive",
            "PublishDate": 1749116584000,
            "Source": "order&deals"
        },
        {
            "Title": "Intellect Design Arena Secures Major Agreement with South African Bank",
            "Summary": "Intellect Design Arena has signed a significant agreement with a major South African bank to deploy its Emach.AI Digital Engagement Platform across nine countries. The platform will be used to enhance digital engagement capabilities for the bank's operations in multiple African nations.",
            "Sentiment": "positive",
            "PublishDate": 1749108347000,
            "Source": "default"
        },
        {
            "Title": "Intellect Design Arena Projects Margin Growth",
            "Summary": "Intellect Design Arena expects its profit margin to increase by 2-3% annually, with a long-term target of 30%, according to a recent conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1747020819000,
            "Source": "default"
        },
        {
            "Title": "Intellect Design Arena Raises Revenue Target to Rs 800 Crore",
            "Summary": "Intellect Design Arena has announced an increased revenue target of Rs 800 crore for the next four quarters. This new goal comes after successfully achieving their previous target of Rs 700 crore. The company clarified that they do not consider these targets as fixed benchmarks.",
            "Sentiment": "positive",
            "PublishDate": 1747020471000,
            "Source": "default"
        },
        {
            "Title": "Intellect Design Arena: Q4 Profit Soars 93%, Announces Record Dividend",
            "Summary": "Intellect Design Arena reported a 93% QoQ increase in Q4 net profit to ₹136 crore. Revenue rose 19% to ₹726 crore. The company announced its highest-ever dividend of ₹7 per share, including a special dividend. The record date is set for July 18, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1746776574000,
            "Source": "earnings"
        },
        {
            "Title": "Intellect Design Arena Announces Dividend of ₹7 Per Share",
            "Summary": "Intellect Design Arena has declared a dividend of ₹7 per share, which includes a special dividend of ₹3 per share. This announcement represents a significant return to shareholders and may indicate strong financial performance or a strategic decision to reward investors.",
            "Sentiment": "positive",
            "PublishDate": 1746774705000,
            "Source": "result"
        }
    ]
}