{
    "Symbol": "INTENTECH",
    "ISIN": "INE781A01025",
    "News": [
        {
            "Title": "Intense Technologies Director Sells 4 Lakh Shares",
            "Summary": "Whole-time director Mr. Jayant Dwarkanath sold 4,00,000 shares through open market transactions on January 29, 2025, reducing his stake from 2.06% to 0.36% in Intense Technologies Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1769836088623,
            "Source": "co_actions_results"
        },
        {
            "Title": "Intense Technologies Q3FY26 Results: Profit Drops 25%",
            "Summary": "Intense Technologies reported Q3FY26 consolidated net profit of ₹231.69 lakhs, down 25% YoY from ₹308.64 lakhs. Revenue remained flat at ₹3,330.31 lakhs vs ₹3,326.31 lakhs in Q3FY25.",
            "Sentiment": "negative",
            "PublishDate": 1768301551920,
            "Source": "co_actions_results"
        },
        {
            "Title": "Intense Technologies Q3FY26 Results Announced",
            "Summary": "Intense Technologies Limited reported Q3FY26 consolidated revenue of ₹3,330.31 lakhs with net profit of ₹231.69 lakhs. Nine-month revenue reached ₹9,730.38 lakhs with profit of ₹674.01 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1768300687715,
            "Source": "co_actions_results"
        },
        {
            "Title": "Intense Technologies Board Meet Set for Jan 13, 2026",
            "Summary": "Intense Technologies Limited has scheduled a board meeting on January 13, 2026, to approve Q3 FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767860087295,
            "Source": "co_actions_results"
        },
        {
            "Title": "Intense Technologies Director Jayant Dwarkanath Sells 4.92 Lakh Shares",
            "Summary": "Jayant Dwarkanath, whole-time director of Intense Technologies Limited, sold 4,92,827 shares through open market transactions on November 25-26, 2025. His shareholding decreased from 9,78,028 shares to 4,85,201 shares, reducing his stake in the company from 4.14% to 2.05% of total share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1764311322248,
            "Source": "corporate_action"
        },
        {
            "Title": "Intense Technologies Promoter Tikam Sujan Sells 5.5 Lakh Shares in Open Market",
            "Summary": "Tikam Sujan, Promoter and Director of Intense Technologies Limited, sold 5,50,000 shares through open market transactions on November 25-26, 2025. His shareholding decreased from 18,79,684 shares to 13,29,684 shares, reducing his stake in the technology company.",
            "Sentiment": "neutral",
            "PublishDate": 1764309681050,
            "Source": "corporate_action"
        },
        {
            "Title": "Intense Technologies Promoter C.K. Shastri Sells 5.17 Lakh Shares Through Open Market",
            "Summary": "Mr. Krishna Shastri Chidella, Promoter and Managing Director of Intense Technologies Limited, sold 5,16,995 equity shares through open market transactions on November 25-26, 2025. His shareholding decreased from 21,78,595 shares to 16,61,600 shares, reducing his stake in the technology company.",
            "Sentiment": "neutral",
            "PublishDate": 1764308645104,
            "Source": "corporate_action"
        },
        {
            "Title": "Intense Technologies Promoter Tikam Sujan Sells 1 Lakh Shares in Open Market",
            "Summary": "Tikam Sujan, Promoter and Director of Intense Technologies Limited, sold 1,00,000 equity shares through open market transactions on November 7, 2025. Following the sale, his shareholding decreased from 19,79,684 shares to 18,79,684 shares. The company has an equity share capital of 2,36,11,949 shares of Rs. 2 each, totaling Rs. 4.72 crores. Intense Technologies is listed on BSE and NSE with stock codes 532326 and INTENTECH respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1762767222905,
            "Source": "corporate_action"
        },
        {
            "Title": "Intense Technologies Allots 12,500 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Intense Technologies Limited has allotted 12,500 equity shares of face value Rs. 2 each following the exercise of stock options under its Employee Stock Option Plan Scheme A 2009. The Board of Directors approved the allotment through a circular resolution. The exercise price was Rs. 50 per share, generating Rs. 6.25 lakh for the company. Following this allotment, the total number of equity shares increased from 2,36,11,949 to 2,36,24,449. The newly issued shares will rank equally with existing shares in all respects. The diluted earnings per share is Rs. 4.53 based on standalone earnings for the financial year ended March 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762623055990,
            "Source": "corporate_action"
        },
        {
            "Title": "Intense Technologies Promoter Tikam Sujan Sells 2.58 Lakh Shares Through Open Market",
            "Summary": "Tikam Sujan, Promoter and Director of Intense Technologies Limited, sold 2,57,958 equity shares through open market transactions. The sale occurred over two days - 1,44,139 shares on October 29, 2025, and 1,13,819 shares on October 30, 2025. Following this transaction, Sujan's shareholding decreased from 22,37,642 shares to 19,79,684 shares. The company has an equity share capital of 2,36,11,949 shares of Rs. 2 each, totaling Rs. 4.72 crores. Intense Technologies is listed on BSE and NSE with stock codes 532326 and INTENTECH respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1761889871848,
            "Source": "corporate_action"
        },
        {
            "Title": "Intense Technologies Promoter Krishna Shastri Chidella Sells 3.5 Lakh Shares",
            "Summary": "Krishna Shastri Chidella, Promoter and Managing Director of Intense Technologies Limited, sold 3,50,000 shares through open market transactions on October 28, 2025. His shareholding decreased from 25,28,592 shares (10.42% of total share capital) to 21,78,592 shares (8.94% of total share capital). The company has a total equity share capital of 2,36,11,949 shares of Rs. 2 each. Intense Technologies is listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1761858269442,
            "Source": "corporate_action"
        },
        {
            "Title": "Intense Technologies Reports 153% QoQ Profit Growth and 600 bps Margin Expansion in Q2 FY26",
            "Summary": "Intense Technologies Limited announced its Q2 FY26 results showing strong sequential growth. Total income reached ₹3,147.93 lakhs with 12.51% growth, while EBITDA grew 75.34% to ₹314.48 lakhs. EBITDA margin expanded 600 basis points to 10%. Net profit surged 153.02% to ₹125.27 lakhs with net profit margin improving 500 basis points to 4%. EPS increased 146.15% to ₹0.52. The company added four new BFSI clients and secured two new copyrights for UniServe™ Reach and Testbook.ai platforms. The Software Development and IT Support Services unit achieved Level 3 CMMI certification. Chairman C.K. Shastri emphasized sustainable innovation-driven growth, while Director Anisha Shastri highlighted expansion into new markets and the integrated UniServe™ NXT Communications Hub platform.",
            "Sentiment": "positive",
            "PublishDate": 1760183060539,
            "Source": "earnings"
        },
        {
            "Title": "Intense Technologies Limited Approves Quarterly Financial Results for September 2025",
            "Summary": "Intense Technologies Limited's Board of Directors approved the un-audited financial results for the quarter and half-year ended September 30, 2025. The board meeting, held on October 10, 2025, also approved the Limited Review Report from statutory auditors on both consolidated and standalone financial results. The results were reviewed and recommended by the Audit Committee. The board meeting ran from 3:00 PM to 5:45 PM IST.",
            "Sentiment": "neutral",
            "PublishDate": 1760100001722,
            "Source": "earnings"
        },
        {
            "Title": "Intense Technologies Discloses Shareholding Change by Whole-Time Director Jayant Dwarkanath",
            "Summary": "Intense Technologies Limited submitted a disclosure under SEBI Takeover Regulations regarding a change in shareholding by Mr. Jayant Dwarkanath, who serves as a whole-time director of the company. The disclosure was made on September 25, 2025, and was submitted to both BSE Limited and National Stock Exchange of India Limited as required under Regulation 29(2) of SEBI Takeover Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1758862464656,
            "Source": "corporate_action"
        },
        {
            "Title": "Intense Technologies Reports 19% Revenue Decline in Q1 FY2026, Expects Recovery in H2",
            "Summary": "Intense Technologies Limited reported Q1 FY2026 revenue of Rs. 31.47 crores, down from Rs. 39 crores in Q1 FY2025. EBITDA stood at Rs. 3.14 crores with margins compressed to 10%. The decline was attributed to the conclusion of a large 5-year managed services contract. The company added 4 new BFSI customers and secured 2 state government contracts. International revenue contribution increased from 18% to 30%. The company reduced headcount from 482 to 452 through AI-driven efficiencies. Management expects 10-15% topline growth in FY2026 with margins recovering to 15-20% by H2. The company maintains a cash balance of Rs. 58 crores and remains debt-free. Strategic initiatives include AI integration across platforms, SaaS model transition, and expanding product offerings from 1 to 5 modules.",
            "Sentiment": "neutral",
            "PublishDate": 1755596548329,
            "Source": "earnings"
        },
        {
            "Title": "Intense Technologies Submits Audio Recording of Quarterly Earnings Call",
            "Summary": "Intense Technologies Limited has submitted the audio recording of their quarterly earnings conference call held on August 14, 2025. The recording relates to their quarterly financial results and is available on the company's website at https://inlOstech.com/investors. The submission was made by Company Secretary & Compliance Officer Pratyusha Podugu to BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1755177874020,
            "Source": "earnings"
        },
        {
            "Title": "Intense Technologies Reports Q1 FY26 Results with Revenue Decline and Lower Profitability",
            "Summary": "Intense Technologies Limited reported quarterly results showing revenue of Rs 3,147.93 lakhs compared to Rs 3,595.36 lakhs in the previous quarter. EBITDA decreased to Rs 314.48 lakhs from Rs 437.47 lakhs, while net profit fell to Rs 125.27 lakhs from Rs 272.07 lakhs. EPS declined to Rs 0.52 from Rs 1.14. The company added four new BFSI clients during the quarter, including two insurance clients, one banking client, and one NBFC. Intense Technologies secured copyright protection for its AI-driven Digital Communication Hub and was recognized in Omdia Universe for CPaaS Providers and No-Low-Pro AppDev Platforms. The company continues to focus on AI integration across its platforms and strengthening its communications and data automation services.",
            "Sentiment": "negative",
            "PublishDate": 1755152592752,
            "Source": "earnings"
        },
        {
            "Title": "Intense Technologies Reports Q1 Results, Schedules AGM for September 30, Allots 2,000 ESOP Shares",
            "Summary": "Intense Technologies Limited's Board approved quarterly results for the quarter ended June 30, 2025, showing consolidated revenue from operations of Rs 3,051.79 lakhs compared to Rs 3,935.52 lakhs in the same quarter last year. The company reported consolidated profit after tax of Rs 126.27 lakhs versus Rs 550.31 lakhs in the previous year quarter. On standalone basis, the company posted a loss after tax of Rs 52.91 lakhs compared to profit of Rs 383.40 lakhs in the corresponding quarter. The Board scheduled the 35th Annual General Meeting for September 30, 2025, through video conferencing and approved closure of share transfer books from September 24-30, 2025. The company allotted 2,000 equity shares of face value Rs 2 each under the Intense Employee Stock Option Plan Scheme A 2009 at an exercise price of Rs 10 per share. Following this allotment, the paid-up share capital increased from Rs 4,70,32,398 to Rs 4,70,36,398, consisting of 2,35,18,199 equity shares. The diluted earnings per share stands at Rs 4.53 based on standalone earnings for the financial year ended March 31, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1755092786805,
            "Source": "corporate_action"
        },
        {
            "Title": "Intense Technologies Schedules Earnings Conference Call for August 14, 2025",
            "Summary": "Intense Technologies Limited has scheduled an earnings conference call for investors and analysts on August 14, 2025, at 1:00 PM IST to discuss financial results for the quarter ended June 30, 2025. The call will be conducted by Kirin Advisors with participation from key management including Managing Director & Chairman C. Krishna Shastri, Executive Director Anisha Shastri, Whole-time Director Jayant Dwarakanath, and Chief Financial Officer Nitin Sarda. The company noted that the date and time are subject to change due to company exigencies.",
            "Sentiment": "neutral",
            "PublishDate": 1754924295063,
            "Source": "earnings"
        }
    ]
}