{
    "Symbol": "INTERARCH",
    "ISIN": "INE00M901018",
    "News": [
        {
            "Title": "Interarch Building Solutions Q3 FY26 IPO Monitoring Report",
            "Summary": "Interarch Building Solutions submitted its Q3 FY26 monitoring agency report showing Rs 46.21 million utilized during the quarter. CRISIL reported no deviations from IPO objects with Rs 300.47 million remaining unutilized.",
            "Sentiment": "neutral",
            "PublishDate": 1770460075551,
            "Source": "co_actions_results"
        },
        {
            "Title": "Interarch Building Solutions Q3FY26 Results",
            "Summary": "Interarch Building Solutions reports strong Q3FY26 performance with revenue of ₹52,252.25 lakhs and net profit of ₹3,726.42 lakhs, marking significant growth over previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770039497821,
            "Source": "co_actions_results"
        },
        {
            "Title": "InterArch Building Solutions Gets QIP Approval",
            "Summary": "InterArch Building Solutions receives board approval to raise up to ₹100 crore through Qualified Institutional Placement of equity shares or convertible securities.",
            "Sentiment": "positive",
            "PublishDate": 1770039019474,
            "Source": "co_actions_results"
        },
        {
            "Title": "Interarch Building Solutions Approves Phase 2 Expansion",
            "Summary": "Interarch Building Solutions has approved an investment proposal to commence Phase 2 operations at its Andhra Pradesh manufacturing facility, marking a significant expansion milestone.",
            "Sentiment": "positive",
            "PublishDate": 1770038994810,
            "Source": "stocks"
        },
        {
            "Title": "Interarch Building Solutions Receives IT Notice",
            "Summary": "Interarch Building Solutions receives Income Tax notice under Section 158BC for filing return of undisclosed income for block period 01/04/2019 to 17/10/2025. Notice is procedural in nature with no current tax demand.",
            "Sentiment": "neutral",
            "PublishDate": 1769792543984,
            "Source": "stocks"
        },
        {
            "Title": "Interarch Building Solutions Q3FY26 Earnings Call Feb 3",
            "Summary": "Interarch Building Solutions Limited has scheduled its Q3FY26 earnings call for February 3, 2026, at 4:30 PM IST to discuss unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768994599580,
            "Source": "co_actions_results"
        },
        {
            "Title": "Interarch Building Solutions Wins ₹130 Cr Order",
            "Summary": "Interarch Building Solutions has secured a significant new order valued at approximately ₹130 crores, marking a major business development for the steel sector company.",
            "Sentiment": "positive",
            "PublishDate": 1768349774007,
            "Source": "co_actions_results"
        },
        {
            "Title": "Interarch Building Solutions Secures ₹130 Cr Order",
            "Summary": "Interarch Building Solutions Limited has secured a significant domestic order worth approximately ₹130 crores for design, engineering, manufacturing, supply and erection of pre-engineered steel building systems with 17-month completion period.",
            "Sentiment": "positive",
            "PublishDate": 1768317323594,
            "Source": "co_actions_results"
        },
        {
            "Title": "Interarch Building Solutions Secures ₹130 Cr Order",
            "Summary": "Interarch Building Solutions has announced winning a significant order worth approximately ₹130 crores, marking a major business development for the building solutions company.",
            "Sentiment": "positive",
            "PublishDate": 1768317093274,
            "Source": "co_actions_results"
        },
        {
            "Title": "Interarch Building Solutions Receives Multiple GST Notices",
            "Summary": "Interarch Building Solutions receives three GST notices totaling ₹1.17 crore for FY 2018-19, 2019-20, and 2021-22. Company plans to file appeals against all demands citing no actual violations.",
            "Sentiment": "negative",
            "PublishDate": 1767348800616,
            "Source": "stocks"
        },
        {
            "Title": "Interarch Wins ₹84 Cr Contract from Shyam Sel & Power",
            "Summary": "Interarch Building Solutions secures major ₹84 crore contract for pre-engineered steel building system project with 12-month completion timeline from Shyam Sel And Power Limited.",
            "Sentiment": "positive",
            "PublishDate": 1765519932577,
            "Source": "co_actions_results"
        },
        {
            "Title": "Interarch Building Solutions Wins ₹70 Cr Contract",
            "Summary": "Interarch Building Solutions secures major Letter of Intent worth approximately ₹70 crores for design, engineering, manufacturing and supply of pre-engineered steel building system from domestic client.",
            "Sentiment": "positive",
            "PublishDate": 1765455949576,
            "Source": "co_actions_results"
        },
        {
            "Title": "Interarch Building Solutions Secures ₹700 Cr Contract",
            "Summary": "Interarch Building Solutions receives Letter of Intent for a significant ₹700 crore contract, marking a major business milestone for the steel sector company.",
            "Sentiment": "positive",
            "PublishDate": 1765455778635,
            "Source": "co_actions_results"
        },
        {
            "Title": "Interarch Building Solutions Reports Record Quarterly Revenue of INR 491 Crores with 52% Growth",
            "Summary": "Interarch Building Solutions Limited achieved its highest-ever quarterly revenue of INR 491 crores in Q2 FY26, marking a 52% year-on-year growth. EBITDA grew 65.1% to INR 42 crores while profit after tax increased 56.2% to INR 32 crores. For the first half, revenue reached INR 872 crores (39% growth) with EBITDA at INR 73 crores (40% growth). The company commissioned Phase 2 of its Andhra Pradesh unit, bringing total installed capacity to 200,000 metric tons across four fully integrated plants. Order book stands at INR 1,634 crores as of October 31, 2025, with 80-85% being repeat orders from existing customers. The company broke ground on new facilities in Gujarat for pre-engineered buildings and Andhra Pradesh for heavy steel structures. Key customer wins included Rungta Mines, Havells India, Techno Electric, and Jindal Stainless. Management expects to cross their 17.5% revenue growth guidance for FY26 and targets INR 2,000+ crores revenue capability with expanded capacity.",
            "Sentiment": "positive",
            "PublishDate": 1762983326027,
            "Source": "earnings"
        },
        {
            "Title": "Interarch Building Solutions Reports No Deviation in IPO Fund Utilization",
            "Summary": "Interarch Building Solutions Limited reported no deviations or variations in the utilization of proceeds from its Initial Public Offer for the quarter ended September 30, 2025. The company raised ₹200 crore through its IPO on August 22, 2024, with CRISIL Ratings Limited serving as the monitoring agency. The funds are being utilized across six key areas: setting up a new project (₹17.93 crore utilized out of ₹58.53 crore allocated), upgrading manufacturing facilities at Kichha, Tamil Nadu facilities, and Pant Nagar (₹20.16 crore utilized out of ₹19.25 crore allocated), IT infrastructure upgrades (₹2.24 crore utilized out of ₹11.39 crore allocated), working capital requirements (₹55 crore fully utilized), general corporate purposes (₹48.70 crore fully utilized), and final payment for land acquisition for Manufacturing Facility-II in Andhra Pradesh (₹9.46 crore utilized out of ₹9.50 crore allocated). The company confirmed that fund utilization is proceeding as mentioned in the IPO offer letter's object clause.",
            "Sentiment": "neutral",
            "PublishDate": 1762926769220,
            "Source": "corporate_action"
        },
        {
            "Title": "Interarch Building Products Reports 65% Jump in Q2 EBITDA to 417M Rupees",
            "Summary": "Interarch Building Products reported Q2 EBITDA of 417 million rupees, representing a significant increase from 252 million rupees in the same period last year. The company's EBITDA margin improved to 8.48% compared to 7.8% year-over-year, indicating enhanced operational efficiency and profitability during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762430231286,
            "Source": "earnings"
        },
        {
            "Title": "Interarch Building Products Reports Strong Q2 Growth with 56% Jump in Net Profit",
            "Summary": "Interarch Building Products reported net profit of 323 million rupees for Q2, representing a significant increase from 207 million rupees in the same quarter last year. The company's revenue also grew substantially to 4.9 billion rupees compared to 3.2 billion rupees year-over-year, marking strong financial performance across key metrics.",
            "Sentiment": "positive",
            "PublishDate": 1762429837548,
            "Source": "earnings"
        },
        {
            "Title": "Interarch Building Solutions Schedules Q2 H1 FY26 Earnings Call",
            "Summary": "Interarch Building Solutions Limited has scheduled an earnings call with analysts and investors for November 7, 2025, at 3:30 PM IST to discuss Q2 H1 FY26 unaudited financial results. The teleconference will be moderated by Jaiveer Shekhawat from Ambit Capital's Institutional Equities division. Company representatives include Managing Director Arvind Nanda, CEO Manish Kumar Garg, CFO Pushpendra Kumar Bansal, and President of Corporate Finance Strategy Anil Kumar Chandani. The company was formerly known as Interarch Building Products Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1761843167343,
            "Source": "earnings"
        },
        {
            "Title": "Interarch Building Solutions Starts Construction of ₹70 Crore Gujarat Manufacturing Plant",
            "Summary": "Interarch Building Solutions has begun construction of a new manufacturing plant in Kheda, Gujarat, with an investment of ₹70 crore. The facility will have a production capacity of 40,000 MT and is expected to create over 400 jobs. This expansion is part of the company's strategy to achieve a growth target of ₹2,400 crore by FY28.",
            "Sentiment": "positive",
            "PublishDate": 1759904633084,
            "Source": "stock"
        },
        {
            "Title": "Interarch Building Solutions Breaks Ground on New ₹100 Crore Plant in Andhra Pradesh",
            "Summary": "Interarch Building Solutions Limited announced the groundbreaking of a new manufacturing plant in Attivaram, Andhra Pradesh. The facility will have a production capacity of 25,000 MT in its first phase and requires an investment of ₹100 crore. Built on 20 acres with approximately 17,000 square meters of built-up area, the plant will focus on multi-storey steel buildings, data centres, semiconductor, electronic and battery plants. The facility is expected to create over 200 direct and indirect jobs and begin production by the end of Q2 FY27. The plant will be equipped with machinery sourced from Europe and India, designed to produce structures that can withstand extreme climatic conditions. CEO Manish Garg stated the facility will strengthen their regional manufacturing footprint and enhance service delivery to customers across southern India. The company recently commissioned Phase 2 of its existing PEB plant at the same location with 25,000 MT annual capacity and ₹32 crore investment.",
            "Sentiment": "positive",
            "PublishDate": 1758963739130,
            "Source": "stock"
        },
        {
            "Title": "Interarch Building Solutions Expands Manufacturing Capacity with ₹53 Crore Investment",
            "Summary": "Interarch Building Solutions has commissioned a new box column line in Uttarakhand and completed Phase 2 of its Andhra Pradesh unit for pre-engineered steel buildings. The company's total investment amounts to ₹53 crores, resulting in manufacturing capacity exceeding 200,000 MT annually.",
            "Sentiment": "positive",
            "PublishDate": 1758000602704,
            "Source": "stock"
        },
        {
            "Title": "Interarch Building Solutions Secures ₹90 Crore Order from Rungta Mines",
            "Summary": "Interarch Building Solutions Limited has received a Letter of Intent from Rungta Mines Limited for a contract worth approximately ₹90 crores. The order involves design, engineering, manufacturing, supply and erection of pre-engineered steel building systems. The project is expected to be completed within 6 to 8 months. Payment terms include 10% advance and 10% upon drawing and design approval. The contract is with a domestic entity and does not involve any promoter group interest or related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1755944336724,
            "Source": "order&deals"
        },
        {
            "Title": "Income Tax Department Conducts Search at Interarch Building Solutions' Facilities",
            "Summary": "The Income Tax Department has initiated a search at Interarch Building Solutions Limited's manufacturing facility in Pantnagar and corporate office in Noida. The company is cooperating with the tax authorities and has not yet received formal written communication from the department. Interarch is gathering further details and assessing potential implications, with plans to make necessary disclosures as material developments occur. The disclosure was made voluntarily for transparency and regulatory compliance.",
            "Sentiment": "negative",
            "PublishDate": 1755496266938,
            "Source": "stock"
        },
        {
            "Title": "Interarch Building Solutions Reports Strong Q1 FY26 Results with 25.5% Revenue Growth",
            "Summary": "Interarch Building Solutions Limited reported quarterly results with revenue growing 25.5% year-on-year to ₹381 crores. EBITDA increased 16.9% to ₹32 crores with an 8.3% margin, while profit after tax surged 40% to ₹28 crores. The pre-engineered building company achieved volume growth of 28.7% from 25,500 MT to 32,800 MT. The company maintains a strong order book of ₹1,695 crores as of July 31, 2025, and secured new orders worth ₹452 crores between May-July 2025. Management expects to surpass earlier revenue growth guidance of 17.5% for FY26 and targets EBITDA margins above 10%. The company is expanding production capacity to 200,000 MTPA with two new production lines commissioning shortly. Interarch has entered strategic partnerships with JSPL for multi-story buildings and Moldtek Technologies for US market expansion. The company has a pipeline of ₹2,500 crores in orders expected to be finalized within 6 months and an additional ₹4,000 crores pipeline over 18 months.",
            "Sentiment": "positive",
            "PublishDate": 1755280111439,
            "Source": "earnings"
        },
        {
            "Title": "Interarch Building Solutions Reports IPO Fund Utilization with Shareholder-Approved Reallocations",
            "Summary": "Interarch Building Solutions Limited submitted its monitoring agency report for IPO fund utilization for the quarter ended June 30, 2025. The company raised Rs 2,000 million through its IPO in August 2024, with net proceeds of Rs 1,880.98 million after issue expenses. During the quarter, shareholders approved reallocation of Rs 95 million from original objects to a new manufacturing facility in Andhra Pradesh for land acquisition. The company has utilized Rs 1,464.26 million of total proceeds, leaving Rs 416.72 million unutilized. Major utilizations included Rs 550 million for working capital requirements, Rs 484.97 million for general corporate purposes, and amounts for capital expenditure on manufacturing facilities and IT infrastructure upgrades. CRISIL Ratings Limited served as the monitoring agency and noted that while fund utilization deviated from original prospectus objects, it aligned with shareholder approvals obtained through special resolutions.",
            "Sentiment": "neutral",
            "PublishDate": 1755092236362,
            "Source": "corporate_action"
        },
        {
            "Title": "Interarch Building Solutions Appoints Two Industry Veterans as Independent Directors",
            "Summary": "Interarch Building Solutions Limited announced the appointment of Dr. Anoop Kumar Mittal and Mr. Aditya Vij as Independent Directors to strengthen its board leadership. Dr. Mittal brings nearly four decades of experience in civil engineering, real estate development, and project management, having served as Chairman-cum-Managing Director of NBCC (India) Ltd. Mr. Vij is a seasoned global business leader with over 40 years of cross-sector experience, previously serving as CEO of Fortis Healthcare and Operating Partner at Kedaara Capital Advisors. Managing Director Arvind Nanda stated these appointments reflect the company's ambition to grow responsibly and innovate in the infrastructure and construction space. The appointments are part of Interarch's strategic board expansion to drive transformation and enhance governance as the pre-engineered building solutions provider focuses on sustainable infrastructure opportunities in India and internationally.",
            "Sentiment": "positive",
            "PublishDate": 1754976824381,
            "Source": "corporate_governance"
        },
        {
            "Title": "Interarch Building Solutions Announces Two New Manufacturing Units with Combined Investment of Rs 140 Crore",
            "Summary": "Interarch Building Solutions Limited announced the establishment of two new manufacturing units for pre-engineered steel buildings. The first unit will be located in Village Matar, District Kheda, Gujarat, with an installed production capacity of 27,000 MT for Phase-1, requiring an investment of Rs 60 crore and expected to be ready for commercial operation by Q1 of FY 26-27. The second unit will be set up in Athivaram industrial area, APIIC, AP-II, for heavy fabrication and multistorey pre-engineered steel buildings, with a capacity of 24,000 MT for Phase-1, requiring an investment of Rs 80 crore. This second facility is planned to start commercial production by the beginning of Q2 of FY 2026-27, tentatively in July 2026. Both projects will be financed through internal cash accruals, with the second unit also considering term loans. The company cited increased demand as the rationale for both capacity expansions.",
            "Sentiment": "positive",
            "PublishDate": 1754649832735,
            "Source": "stock"
        },
        {
            "Title": "Interarch Building Solutions Appoints Two Independent Directors, Re-appoints Managing Director",
            "Summary": "Interarch Building Solutions Limited's Board of Directors approved the appointment of two new Additional Directors and the re-appointment of its Managing Director, all subject to shareholder approval at the upcoming Annual General Meeting. The company appointed Mr. Anoop Kumar Mittal and Mr. Aditya Vij as Additional Directors (Non-Executive, Independent) for a period of 5 years effective August 7, 2025. Mr. Mittal brings nearly 40 years of construction industry experience and previously served as Chairman-cum-Managing Director of NBCC (India) Ltd. from 2013 to March 2019. Mr. Vij was an Operating Partner at Kedaara Capital Advisors until May 31, 2025, and previously served as CEO of Fortis Healthcare Ltd. The Board also approved the re-appointment of Mr. Arvind Nanda as Managing Director effective August 9, 2026. Nanda has been with the company since incorporation and has over 30 years of experience in the pre-engineered steel buildings industry.",
            "Sentiment": "positive",
            "PublishDate": 1754634482005,
            "Source": "corporate_governance"
        },
        {
            "Title": "Interarch Building Products Reports 40% Jump in Q1 Net Profit to 284 Million Rupees",
            "Summary": "Interarch Building Products reported Q1 net profit of 284 million rupees, up from 203 million rupees in the same period last year. Revenue increased to 3.8 billion rupees from 3.03 billion rupees year-over-year. EBITDA rose to 316 million rupees from 271 million rupees, though EBITDA margin declined to 8.31% from 8.92% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754573498975,
            "Source": "earnings"
        },
        {
            "Title": "Interarch Building Solutions' VP Tax & Logistics Shekhar Bhatnagar to Retire on July 31, 2025",
            "Summary": "Shekhar Bhatnagar, Vice President - Tax & Logistics (Excise & Dispatch) at Interarch Building Solutions Limited, will retire on July 31, 2025, following the company's superannuation policy. He will cease to be a Senior Management Personnel from the same date. The retirement is part of the normal superannuation process, and no resignation letter is required. The company has notified stock exchanges NSE and BSE about this senior management change in compliance with SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1753957013380,
            "Source": "corporate_governance"
        },
        {
            "Title": "Interarch Building Solutions Appoints Anil Kumar as General Manager",
            "Summary": "Interarch Building Solutions has appointed Mr. Anil Kumar as General Manager. Kumar brings over 22 years of experience in global sourcing, supply chain management, and procurement. His previous work experience includes positions at Escorts Ltd, Auto Pins, Sanden Vikas, and Marelli Talbros Chassis Systems.",
            "Sentiment": "positive",
            "PublishDate": 1751415204000,
            "Source": "default"
        },
        {
            "Title": "Interarch Building Solutions Secures 770 Million Rupee Order from Amara Raja Infra",
            "Summary": "Interarch Building Solutions has received an order from Amara Raja Infra valued at approximately 770 million rupees. The news brief does not provide any additional details about the nature of the order, timeline, or specific project involved.",
            "Sentiment": "positive",
            "PublishDate": 1751241519000,
            "Source": "default"
        },
        {
            "Title": "Interarch Building Solutions Secures 770 Million Rupee Order",
            "Summary": "Interarch Building Solutions has received an order worth approximately 770 million rupees from Amara Raja Infra. The news briefly mentions the order value and the client, but provides no additional details about the nature of the work, project timeline, or impact on the company's financials.",
            "Sentiment": "positive",
            "PublishDate": 1751025961000,
            "Source": "default"
        },
        {
            "Title": "Interarch Building Solutions Secures ₹80 Crore Order",
            "Summary": "Interarch Building Solutions has obtained an order worth ₹80 crore. The news briefly mentions the company securing this significant contract, but provides no further details about the nature of the order, the client, or the timeline for completion.",
            "Sentiment": "positive",
            "PublishDate": 1750493847000,
            "Source": "default"
        },
        {
            "Title": "Interarch Building Solutions: Targets 18% Growth in FY26, Plans Capacity Expansion",
            "Summary": "Interarch Building Solutions expects 17.5% growth in FY26, followed by 20% annual growth for the next two years. The company anticipates higher growth rates post-FY28 with capacity enhancements. Current expansion includes new plants in Andhra Pradesh and Uttarakhand, land acquisition in Gujarat, and new engineering offices in southern states.",
            "Sentiment": "positive",
            "PublishDate": 1749603670000,
            "Source": "normal_news"
        },
        {
            "Title": "Interarch Building Solution Secures ₹45 Crore Order",
            "Summary": "Interarch Building Solution has obtained a new order worth ₹45 crore. The news briefly mentions the company securing this significant contract, but no further details about the nature of the order, the client, or the timeline are provided.",
            "Sentiment": "positive",
            "PublishDate": 1749557518000,
            "Source": "default"
        },
        {
            "Title": "Interarch Building Products Reports Q4 Results and Dividend",
            "Summary": "Interarch Building Products has announced its quarterly results and dividend. The company's Q4 EBITDA increased to 488 million rupees from 378 million rupees year-over-year. The EBITDA margin improved to 10.54% from 9.80% in the same period. Additionally, the company has recommended a final dividend of 12.5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747827892000,
            "Source": "result"
        },
        {
            "Title": "InterArch Building Products Reports Q4 Financial Results",
            "Summary": "InterArch Building Products announced its Q4 financial results. The company's net profit for the quarter was 387 million rupees, compared to 297 million rupees year-over-year and 282 million rupees quarter-over-quarter. Revenue for Q4 was 4.6 billion rupees, up from 3.85 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747827751000,
            "Source": "result"
        },
        {
            "Title": "Interarch Building Solutions: Land Acquisition for Manufacturing Expansion",
            "Summary": "Interarch Building Solutions is acquiring 20 acres in Andhra Pradesh to double its manufacturing capacity. The new facility will produce pre-engineered heavy steel structures to meet demand from infrastructure, semiconductor, data center, and renewable energy sectors. This expansion follows the company's AP Phase-1 facility commissioning in September 2024.",
            "Sentiment": "positive",
            "PublishDate": 1747642914000,
            "Source": "corporate_action"
        },
        {
            "Title": "Interarch Acquires 20-Acre Land in Andhra Pradesh for New Manufacturing Facility",
            "Summary": "Interarch has expanded its operations by acquiring 20 acres of land in Andhra Pradesh. The company plans to establish a new facility, referred to as Unit 2, for manufacturing pre-engineered heavy steel structures.",
            "Sentiment": "positive",
            "PublishDate": 1747633998000,
            "Source": "default"
        },
        {
            "Title": "Interarch Building Products: Secures Largest PEB Order Worth Over Rs 300 Crore",
            "Summary": "Interarch Building Products Ltd has won an order exceeding Rs 300 crore from a major tyre manufacturer in Gujarat. The company will handle the complete execution of pre-engineered buildings, including design, manufacturing, and on-site installation. The project is set to be completed within the current financial year.",
            "Sentiment": "positive",
            "PublishDate": 1745228321000,
            "Source": "order&deals"
        },
        {
            "Title": "InterArch Building Projects Secures Orders Worth Rs. 300 Crore",
            "Summary": "InterArch Building Projects has announced that it has secured new orders valued at Rs. 300 crore. This development indicates a significant business acquisition for the company, potentially boosting its project pipeline and future revenue prospects.",
            "Sentiment": "positive",
            "PublishDate": 1745210107000,
            "Source": "default"
        },
        {
            "Title": "Interarch Building Products to Expand Capacity with 500 Million Rupee Investment",
            "Summary": "Interarch Building Products has announced plans to increase its installed capacity by 40,000 metric tons by the second quarter of fiscal year 2026. The expansion project will require an investment of approximately 500 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1742428980000,
            "Source": "corporate_action"
        },
        {
            "Title": "Interarch Building Products to Expand Production Capacity",
            "Summary": "Interarch Building Products has announced plans to increase its installed capacity by 40,000 MT by the second quarter of FY 2026. The expansion project is estimated to require an investment of approximately 500 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1742395725000,
            "Source": "corporate_action"
        },
        {
            "Title": "Interarch Building Products Expands Presence and Capacity in South India",
            "Summary": "Interarch Building Products is strengthening its presence in South India and expanding its production capacities. The company projects a 10% growth for the fiscal year 2025. This expansion strategy aims to capitalize on the growing market opportunities in the region and enhance the company's overall production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1738823897000,
            "Source": "corporate_action"
        },
        {
            "Title": "InterArch Building Announces Capacity Expansion to 200,000 MT",
            "Summary": "InterArch Building has disclosed plans to increase its total production capacity to 200,000 metric tons (MT) upon completion of an ongoing expansion project. This information was shared during a company conference call, indicating a significant boost in the company's manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1738727042000,
            "Source": "corporate_action"
        },
        {
            "Title": "InterArch Building Projects 10-15% Revenue Growth for FY25-26",
            "Summary": "InterArch Building has announced its revenue growth projections for the upcoming fiscal years. The company anticipates a 10% revenue growth for FY25 and expects this growth to increase to 10-15% for FY26. This guidance suggests a positive outlook for the company's financial performance in the near future.",
            "Sentiment": "positive",
            "PublishDate": 1738726916000,
            "Source": "earnings"
        },
        {
            "Title": "InterArch Building Reports Improved Q3 EBITDA and Margin",
            "Summary": "InterArch Building has reported a significant increase in its Q3 EBITDA, rising from 275 million rupees to 351 million rupees year-over-year. The company's EBITDA margin also improved, increasing from 8.70% to 9.66% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738675629000,
            "Source": "earnings"
        },
        {
            "Title": "InterArch Building Reports Q3 Profit and Revenue Growth",
            "Summary": "InterArch Building has announced its Q3 financial results, showing significant year-over-year growth. The company's net profit increased to 282 million rupees from 220 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 3.64 billion rupees compared to 3.16 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1738675623000,
            "Source": "earnings"
        },
        {
            "Title": "InterArch Building Secures Major Orders in Semiconductor and Battery Sectors",
            "Summary": "InterArch Building has obtained orders worth ₹221 crore from Tata Projects Limited. These orders are in the advanced semiconductor and lithium-ion battery sectors, which are considered revolutionary for India's technological landscape. This development signifies a significant step in enhancing India's capabilities in cutting-edge technology manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1736732834000,
            "Source": "order&deals"
        }
    ]
}