{
    "Symbol": "INTLCONV",
    "ISIN": "INE575C01027",
    "News": [
        {
            "Title": "International Conveyors Acquires Ganesha Ecosphere for Rs 11.28 Crore",
            "Summary": "International Conveyors Limited has acquired 121,540 equity shares of Ganesha Ecosphere Ltd, a leading rPET fiber manufacturer with turnover of Rs 1,465.54 crore, for Rs 11.28 crore in cash consideration. The acquisition is for investment purposes and involves a company that has been manufacturing rPET fiber and yarn from PET bottle scrap since 1987.",
            "Sentiment": "positive",
            "PublishDate": 1764170083037,
            "Source": "order&deals"
        },
        {
            "Title": "International Conveyors Receives NSE Approval for ESOP Listing of 33.75 Lakh Equity Shares",
            "Summary": "International Conveyors Limited received in-principle approval from NSE to list up to 33,75,000 equity shares of Re. 1/- each under its ICL Employee Stock Option Plan 2020. The approval is subject to fulfilling various listing conditions including statutory approvals, compliance with SEBI regulations, and submission of required documentation after allotment.",
            "Sentiment": "positive",
            "PublishDate": 1763810227337,
            "Source": "corporate_action"
        },
        {
            "Title": "International Conveyors Limited Reports Quarterly Financial Results for September 2025",
            "Summary": "International Conveyors Limited announced unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025, following board approval on November 13, 2025. The company's consolidated results show revenue from operations of Rs. 3,536 lakhs for the quarter with a profit after tax of Rs. 520 lakhs, while standalone operations reported revenue of Rs. 3,966 lakhs with a loss after tax of Rs. 876 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1763062004970,
            "Source": "earnings"
        },
        {
            "Title": "Elpro International Acquires 2,144 Additional Shares in International Conveyors Through Open Market",
            "Summary": "Elpro International Limited purchased 2,144 equity shares of International Conveyors Limited through open market transactions on September 22, 2025. The acquisition increased Elpro's holding from 9,30,315 shares to 9,32,459 shares, though its percentage ownership remained at 1.47%. The promoter group's total holding stayed unchanged at 70.07% of International Conveyors' total equity capital of 6,33,79,000 shares. The transaction was disclosed under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1758866674442,
            "Source": "corporate_action"
        },
        {
            "Title": "Elpro International Acquires 2,144 Shares of International Conveyors Through Open Market",
            "Summary": "Elpro International Limited acquired 2,144 equity shares of International Conveyors Limited through open market transactions on September 22, 2025. The acquisition was made under SEBI Substantial Acquisition of Shares and Takeovers Regulations. Following this transaction, Elpro International's shareholding in International Conveyors increased from 9,30,315 shares to 9,32,459 shares, though its percentage holding remained at 1.47%. The promoter group's total holding increased from 4,44,09,009 shares to 4,44,11,153 shares, maintaining 70.07% ownership. International Conveyors has an equity share capital of 6,33,79,000 shares of Re. 1 each and is listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1758690428527,
            "Source": "order&deals"
        },
        {
            "Title": "Elpro International Limited Acquires Additional Shares in International Conveyors Limited",
            "Summary": "Elpro International Limited purchased equity shares of International Conveyors Limited through open market transactions on September 16, 2025. The company made two separate acquisitions - 3,582 equity shares and 5,170 equity shares - which triggered disclosure requirements under SEBI regulations for substantial acquisition of shares and takeovers. International Conveyors Limited, trading under symbol INTLCONV with scrip code 509709, submitted the required disclosures to both BSE and NSE through Company Secretary Dipti Sharma.",
            "Sentiment": "neutral",
            "PublishDate": 1758084821254,
            "Source": "corporate_action"
        },
        {
            "Title": "Elpro International Acquires Additional 5,170 Shares in International Conveyors Through Open Market",
            "Summary": "Elpro International Limited acquired 5,170 equity shares of International Conveyors Limited through open market transactions on September 12, 2025. The acquisition increased Elpro's shareholding from 9,25,145 shares (1.46%) to 9,30,315 shares (1.47%) in International Conveyors. The promoter group's total holding marginally increased from 70.06% to 70.07%. International Conveyors has a total equity share capital of 6,33,79,000 shares of Re. 1 each and is listed on BSE and NSE. The transaction represents a 0.01% increase in Elpro's stake in the target company.",
            "Sentiment": "neutral",
            "PublishDate": 1757944359311,
            "Source": "order&deals"
        },
        {
            "Title": "Elpro International Acquires Additional 3,582 Shares in International Conveyors Through Open Market",
            "Summary": "Elpro International Limited acquired 3,582 equity shares of International Conveyors Limited through open market transactions on September 11, 2025. The acquisition increased Elpro's shareholding from 9,21,563 shares (1.45%) to 9,25,145 shares (1.46%). The promoter group's total holding in International Conveyors increased marginally from 70.05% to 70.06%. International Conveyors has a total equity share capital of 6,33,79,000 shares of Re. 1/- each and is listed on BSE Limited and National Stock Exchange of India Limited. The promoter group includes entities such as I.G.E. (India) Private Limited (50.02% holding), Surbhit Dabriwala (12.75% holding), and other associated companies and individuals.",
            "Sentiment": "neutral",
            "PublishDate": 1757943924800,
            "Source": "order&deals"
        },
        {
            "Title": "Elpro International Acquires Additional 9,683 Shares in International Conveyors Limited",
            "Summary": "Elpro International Limited purchased 9,683 equity shares of International Conveyors Limited through open market transactions on September 10, 2025. The acquisition increased Elpro's shareholding from 9,11,880 shares (1.43%) to 9,21,563 shares (1.45%). Post-acquisition, the total promoter group holding in International Conveyors Limited increased from 4,43,90,574 shares (70.03%) to 4,44,00,257 shares (70.05%). International Conveyors Limited has a total equity share capital of 6,33,79,000 shares of Re. 1/- each. The shares are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1757940593690,
            "Source": "corporate_action"
        },
        {
            "Title": "Elpro International Acquires Additional 9,123 Shares in International Conveyors Through Open Market",
            "Summary": "Elpro International Limited acquired 9,123 equity shares of International Conveyors Limited through open market transactions on September 9, 2025. The acquisition increased Elpro's shareholding from 9,02,757 shares (1.42%) to 9,11,880 shares (1.43%). Following this transaction, the total promoter group holding in International Conveyors increased from 4,43,81,451 shares (70.02%) to 4,43,90,574 shares (70.03%). Elpro International belongs to the promoter group of International Conveyors. The target company has an equity share capital of 6,33,79,000 equity shares of Re. 1/- each. International Conveyors Limited is listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1757939820036,
            "Source": "corporate_action"
        },
        {
            "Title": "Elpro International Increases Stake in International Conveyors Through Open Market Purchases",
            "Summary": "Elpro International Limited acquired equity shares of International Conveyors Limited through two separate open market transactions. The company purchased 14,724 shares on September 5, 2025, increasing its holding from 69.98% to 70.00%. Subsequently, it acquired an additional 11,263 shares on September 8, 2025, further raising its stake to 70.02%. The acquisitions increased Elpro's total shareholding from 4,43,55,464 shares to 4,43,81,451 shares. Elpro International belongs to the promoter group of International Conveyors Limited, which has an equity share capital of 6,33,79,000 shares of Re. 1 each. The shares are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1757755594783,
            "Source": "corporate_action"
        },
        {
            "Title": "Elpro International Acquires Additional 11,263 Shares in International Conveyors Limited",
            "Summary": "Elpro International Limited acquired 11,263 equity shares of International Conveyors Limited through open market transactions on September 8, 2025. The acquisition increased Elpro's shareholding from 8,91,494 shares (1.40%) to 9,02,757 shares (1.42%). The promoter group's total holding increased marginally from 70.00% to 70.02%. International Conveyors Limited has a total equity share capital of 6,33,79,000 shares of Re. 1 each and is listed on BSE Limited and National Stock Exchange of India Limited. The acquisition was part of the promoter group's holdings, which includes entities such as I.G.E. (India) Private Limited (50.02%), Surbhit Dabriwala (12.75%), and other associated entities.",
            "Sentiment": "neutral",
            "PublishDate": 1757420274395,
            "Source": "order&deals"
        },
        {
            "Title": "International Conveyors Limited Reports Strong Q1 Results, Schedules 52nd AGM for September",
            "Summary": "International Conveyors Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs. 3,353 lakhs and profit after tax of Rs. 5,221 lakhs, with earnings per share of Rs. 8.24. On a consolidated basis, revenue was Rs. 3,546 lakhs with profit after tax of Rs. 5,207 lakhs. The Board appointed M/s Rajesh Kumar Shaw & Co. as secretarial auditor for five consecutive years starting April 1, 2025, subject to shareholder approval. The 52nd Annual General Meeting is scheduled for September 24, 2025, at the company's registered office. The Board also approved exploring inorganic expansion through acquisition of assets, lands or targets in Maharashtra region for cash consideration. Register of members will remain closed from September 18-24, 2025, with cut-off date for voting rights set as September 17, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755187043488,
            "Source": "earnings"
        },
        {
            "Title": "International Conveyors Reports Strong Q4 Financial Results",
            "Summary": "International Conveyors Limited has announced its Q4 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit increased to 130 million rupees, up from 61 million rupees in the same quarter last year and 200 million rupees in the previous quarter. Revenue also saw a substantial rise, reaching 546 million rupees compared to 260 million rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1747235517000,
            "Source": "result"
        },
        {
            "Title": "International Conveyors Acquires Shares in Sterling and Wilson Renewable Energy",
            "Summary": "International Conveyors has purchased shares of Sterling and Wilson Renewable Energy for a total of 35 million rupees. This acquisition represents a significant investment in the renewable energy sector by International Conveyors.",
            "Sentiment": "neutral",
            "PublishDate": 1740702238000,
            "Source": "corporate_action"
        },
        {
            "Title": "International Conveyors Acquires Shares in Sterling and Wilson Renewable Energy",
            "Summary": "International Conveyors has acquired shares of Sterling and Wilson Renewable Energy for a total of 35 million rupees. This acquisition represents a significant investment in the renewable energy sector by International Conveyors.",
            "Sentiment": "neutral",
            "PublishDate": 1740657117000,
            "Source": "corporate_action"
        },
        {
            "Title": "International Conveyors Acquires Shares in Sterling and Wilson Renewable Energy",
            "Summary": "International Conveyors has acquired shares of Sterling and Wilson Renewable Energy. The acquisition cost is reported to be 58.4 million rupees. This move suggests International Conveyors is expanding its investment portfolio or strategic interests in the renewable energy sector.",
            "Sentiment": "neutral",
            "PublishDate": 1736900106000,
            "Source": "corporate_action"
        },
        {
            "Title": "International Conveyors Acquires Shares in Sterling and Wilson Renewable Energy",
            "Summary": "International Conveyors Limited has acquired shares of Sterling and Wilson Renewable Energy. The acquisition cost is reported to be 58.4 million Indian Rupees. This move suggests International Conveyors is expanding its investment portfolio or strategic interests in the renewable energy sector.",
            "Sentiment": "neutral",
            "PublishDate": 1736861167000,
            "Source": "corporate_action"
        },
        {
            "Title": "International Conveyors Acquires Shares in Globus Spirits",
            "Summary": "International Conveyors has acquired 110,715 equity shares of Globus Spirits for a total value of 91.3 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1731937106000,
            "Source": "corporate_action"
        },
        {
            "Title": "International Conveyors Reports Decline in Q2 EBITDA and Margin",
            "Summary": "International Conveyors has reported a decrease in its Q2 EBITDA, which fell to 61 million rupees from 91 million rupees year-over-year. The company's EBITDA margin also declined to 18.95% from 21.55% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731581196000,
            "Source": "result"
        },
        {
            "Title": "International Conveyors Reports Q2 Revenue Decline",
            "Summary": "International Conveyors Limited has reported a revenue of 323 million rupees for the second quarter, down from 422 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731581040000,
            "Source": "result"
        }
    ]
}