{
    "Symbol": "INVENTURE",
    "ISIN": "INE878H01024",
    "News": [
        {
            "Title": "Inventure Growth Securities Reports Mixed Q2 Results, Files Scheme of Arrangement with NCLT",
            "Summary": "Inventure Growth Securities Limited reported quarterly results for the period ended September 30, 2025. The company posted a net loss of Rs 209.40 lakhs for the quarter compared to a profit of Rs 230.89 lakhs in the previous quarter. Revenue from operations decreased to Rs 997.78 lakhs from Rs 1,460.04 lakhs in the prior quarter. The company has filed a composite Scheme of Arrangement with the National Company Law Tribunal involving amalgamation of four wholly-owned subsidiaries and subsequent demerger of its lending business undertaking. During the period, shareholders approved variation in utilization of rights issue proceeds, reallocating funds towards margin trading facility, computer hardware acquisition, and additional working capital. The company maintains Rs 180.59 lakhs in escrow account pending utilization for specified objects. One subsidiary faces temporary restrictions from SEBI regarding new mandates pending completion of an ongoing inquiry.",
            "Sentiment": "negative",
            "PublishDate": 1762437023018,
            "Source": "earnings"
        },
        {
            "Title": "Inventure Growth & Securities Corrects Typographical Error in Board Meeting Outcome",
            "Summary": "Inventure Growth & Securities Limited submitted a revised outcome of their board meeting held on August 5, 2025, to correct a typographical error in standalone equity share capital figures. The error showed the paid-up share capital for June 2024 quarter as Rs. 8,400 lacs instead of the correct amount of Rs. 10,500 lacs. The company confirmed that this correction does not impact their integrated financial (XBRL) filing with the stock exchange. The board meeting, which ran from 3:00 PM to 6:00 PM, addressed unaudited consolidated and standalone financial results for the quarter ended June 30, 2025, along with the limited review report from statutory auditors CGCA & Associates LLP. The company requested stakeholders to disregard the earlier submission and consider the revised outcome.",
            "Sentiment": "neutral",
            "PublishDate": 1754492286668,
            "Source": "corporate_action"
        },
        {
            "Title": "Inventure Growth & Securities Reappoints Two Whole Time Directors for Three-Year Terms",
            "Summary": "Inventure Growth & Securities Limited's Board of Directors approved the reappointment of Mr. Kamlesh Limbachiya and Mrs. Lasha Rita as Whole Time Directors for three-year terms. Mr. Limbachiya's reappointment will be effective from April 1, 2026 to March 31, 2029, as his current term expires on March 31, 2026. Mrs. Lasha Rita's reappointment will run from September 12, 2026 to September 11, 2029, with her current term expiring on September 11, 2026. Both reappointments are subject to shareholder approval at the upcoming annual general meeting. Mr. Limbachiya has 23 years of experience in readymade garments business and 19 years in construction, while Mrs. Rita has 7 years of experience including 4 years in securities markets and handles the company's operations, accounts and technology. Mrs. Rita is the daughter-in-law of the company's Chairman & Managing Director, Mr. Kanji Bachubhai Rita.",
            "Sentiment": "neutral",
            "PublishDate": 1754403313438,
            "Source": "corporate_governance"
        },
        {
            "Title": "Inventure Growth & Securities Approves Quarterly Financial Results for June 30, 2025",
            "Summary": "Inventure Growth & Securities Limited's Board of Directors approved the unaudited consolidated and standalone financial results for the quarter ended June 30, 2025. The board meeting was held on August 5, 2025, commencing at 3:00 PM and concluding at 6:00 PM. The company submitted the financial results along with a limited review report from statutory auditors M/s CGCA & Associates LLP to the stock exchanges. The results will be made available on the company's website at www.inventuregrowth.com. The announcement was signed by Mr. Kamlesh S. Limbachiya, Whole-Time Director.",
            "Sentiment": "neutral",
            "PublishDate": 1754400475934,
            "Source": "earnings"
        }
    ]
}