{
    "Symbol": "IOB",
    "ISIN": "INE565A01014",
    "News": [
        {
            "Title": "Govt to sell 4% IOB stake via QIP for FY26 goals",
            "Summary": "Government plans to divest 4% stake in Indian Overseas Bank through Qualified Institutional Placement to meet FY26 divestment targets, marking significant step in public sector banking reforms.",
            "Sentiment": "neutral",
            "PublishDate": 1770281328965,
            "Source": "co_actions_results"
        },
        {
            "Title": "IOB Issues Strike Notice for January 27, 2026",
            "Summary": "Indian Overseas Bank informs stock exchanges about potential strike by United Forum of Bank Unions on January 27, 2026, which may affect branch operations across the network.",
            "Sentiment": "negative",
            "PublishDate": 1769410906032,
            "Source": "stocks"
        },
        {
            "Title": "IOB Basel III Bonds Oversubscribed by 6.52 Times",
            "Summary": "Indian Overseas Bank's ₹1,000 crore Basel III Tier II bonds issue received overwhelming response with bids worth ₹3,264 crores, getting oversubscribed by 6.52 times at 7.80% coupon rate.",
            "Sentiment": "positive",
            "PublishDate": 1769169881559,
            "Source": "co_actions_results"
        },
        {
            "Title": "IOB Reports First Double-Digit Deposit Growth in Two Years",
            "Summary": "Indian Overseas Bank achieves 11.36% YoY savings growth and 16% retail term deposit growth, marking a turnaround after industry-wide deposit struggles. Bank maintains focus on RAM segment.",
            "Sentiment": "positive",
            "PublishDate": 1768896451690,
            "Source": "co_actions_results"
        },
        {
            "Title": "IOB Targets ₹1,400-1,500 Cr Recovery in Q4",
            "Summary": "Indian Overseas Bank projects bad loan recoveries of ₹1,400-1,500 crores in Q4, aiming for over ₹4,000 crores annually with 5-7 basis points gross NPA reduction expected in the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1768534890872,
            "Source": "stocks"
        },
        {
            "Title": "IOB CFO Projects 18.40% Capital Adequacy by Dec 2025",
            "Summary": "Indian Overseas Bank's CFO forecasts capital adequacy ratio of 18.40% by December 2025, with net profit of Rs. 3,700 crore from three quarters and plans for dividend distribution.",
            "Sentiment": "positive",
            "PublishDate": 1768534842855,
            "Source": "stocks"
        },
        {
            "Title": "IOB Q3 FY26 Net Profit Surges 56.2% to ₹1,365 Cr",
            "Summary": "Indian Overseas Bank reported strong Q3 FY26 results with net profit jumping 56.2% YoY to ₹1,365.12 crores. Total income rose 15.0% to ₹9,671.58 crores, while networth increased significantly to ₹26,771.30 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768475723932,
            "Source": "co_actions_results"
        },
        {
            "Title": "IOB, Punjab & Sind Bank plan ₹7,000 cr share sale",
            "Summary": "Indian Overseas Bank and Punjab & Sind Bank announce plans to raise ₹4,000 crore and ₹3,000 crore respectively through qualified institutional placements this quarter.",
            "Sentiment": "positive",
            "PublishDate": 1768439454706,
            "Source": "co_actions_results"
        },
        {
            "Title": "IOB Plans ₹4,000 Cr Capital Raise in Q4 via QIP",
            "Summary": "Indian Overseas Bank to raise ₹4,000 crore through QIP in current quarter, with government stake to dilute by 4%. Bank exceeded growth guidance with 24% growth vs projected 13-14%.",
            "Sentiment": "positive",
            "PublishDate": 1768411912781,
            "Source": "stocks"
        },
        {
            "Title": "IOB Shares Q3FY26 Earnings Call Recording",
            "Summary": "Indian Overseas Bank makes earnings call recording available for Q3FY26 and nine months ended December 31, 2025, following investor conference call held on January 14, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768398052353,
            "Source": "co_actions_results"
        },
        {
            "Title": "IOB, Punjab & Sind Bank Plan QIPs Worth ₹7,000 Cr",
            "Summary": "Indian Overseas Bank to raise ₹4,000 cr and Punjab & Sind Bank ₹3,000 cr through QIPs this quarter. IOB's government stake to drop 4% from current 92.4% level.",
            "Sentiment": "positive",
            "PublishDate": 1768383001508,
            "Source": "co_actions_results"
        },
        {
            "Title": "IOB Files Q3FY26 Security Cover Certificate",
            "Summary": "Indian Overseas Bank submitted its quarterly security cover certificate for Q3FY26 to stock exchanges, covering ₹2,165.00 crores of outstanding unsecured debt securities with independent auditor verification.",
            "Sentiment": "neutral",
            "PublishDate": 1768377410531,
            "Source": "stocks"
        },
        {
            "Title": "IOB Q3 Asset Quality Improves with Lower NPAs",
            "Summary": "Indian Overseas Bank reports improved asset quality in Q3 with GNPA declining to 1.54% from 1.83% quarter-on-quarter and NNPA reducing to 0.24% from 0.28% QoQ.",
            "Sentiment": "positive",
            "PublishDate": 1768375136542,
            "Source": "co_actions_results"
        },
        {
            "Title": "IOB Q3 Net Profit Surges 56% to ₹1,365 Crore; NII Up 18%",
            "Summary": "Indian Overseas Bank reports strong Q3 results with net profit jumping 56% to ₹1,365 crore and net interest income growing 18% to ₹3,299 crore, while advances expand 24% and asset quality improves significantly.",
            "Sentiment": "positive",
            "PublishDate": 1768375115012,
            "Source": "co_actions_results"
        },
        {
            "Title": "IOB cuts overnight MCLR by 5 bps to 7.95%",
            "Summary": "Indian Overseas Bank reduces overnight lending rate from 8% to 7.95% effective January 15, while government launches stake sale of up to 3% equity through OFS.",
            "Sentiment": "positive",
            "PublishDate": 1768362034486,
            "Source": "stocks"
        },
        {
            "Title": "IOB Cuts Overnight MCLR by 5 bps to 7.95%",
            "Summary": "Indian Overseas Bank reduced its overnight MCLR by 5 basis points to 7.95% effective January 15, 2026, while keeping all other tenor rates unchanged. The decision follows ALCO review on January 13.",
            "Sentiment": "neutral",
            "PublishDate": 1768314560341,
            "Source": "stocks"
        },
        {
            "Title": "IOB Cuts Overnight MCLR by 5 bps to 7.95%",
            "Summary": "Indian Overseas Bank reduces overnight MCLR by 5 basis points to 7.95% effective January 15, 2026, while keeping other tenor rates unchanged following ALCO meeting decision.",
            "Sentiment": "positive",
            "PublishDate": 1768301843298,
            "Source": "stocks"
        },
        {
            "Title": "IOB Keeps One-Year MCLR Unchanged at 8.80%",
            "Summary": "Indian Overseas Bank maintains its one-year Marginal Cost of Funds based Lending Rate at 8.80%, indicating stable lending rate policy amid current market conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1768301575190,
            "Source": "stocks"
        },
        {
            "Title": "IOB schedules Q3FY26 analyst meet for January 14",
            "Summary": "Indian Overseas Bank announces analyst conference call on January 14, 2026, at 5:00 PM to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767963028210,
            "Source": "co_actions_results"
        },
        {
            "Title": "IOB Fined ₹2.90 Lakhs by Sri Lankan Central Bank",
            "Summary": "Indian Overseas Bank's Colombo branch penalized for non-compliance with Financial Transactions Reporting Act during March-June 2025 inspection period.",
            "Sentiment": "negative",
            "PublishDate": 1767714051000,
            "Source": "stocks"
        },
        {
            "Title": "IOB Appoints S. Alagarsamy as General Manager",
            "Summary": "Indian Overseas Bank announces senior management change with Shri S. Alagarsamy assuming charge as General Manager for Accounts and EDMD departments effective December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767182835702,
            "Source": "stocks"
        },
        {
            "Title": "IOB Gets RBI Approval for IFSC Banking Unit at GIFT City",
            "Summary": "Indian Overseas Bank receives regulatory approval from Reserve Bank of India to establish International Financial Services Centre Banking Unit at Gujarat International Finance Tec-City, expanding overseas operations.",
            "Sentiment": "positive",
            "PublishDate": 1767058184158,
            "Source": "stocks"
        },
        {
            "Title": "IOB Gets RBI Nod for GIFT City IFSC Banking Unit",
            "Summary": "Indian Overseas Bank receives regulatory approval from RBI to establish International Financial Services Centre banking unit in Gujarat International Finance Tec-City, expanding overseas operations.",
            "Sentiment": "positive",
            "PublishDate": 1767020311635,
            "Source": "stocks"
        },
        {
            "Title": "IOB Receives $25.7M from Malaysia Unit Liquidation",
            "Summary": "Indian Overseas Bank received USD 25.72 million as interim distribution from liquidation of India International Bank (Malaysia) Bhd, representing its 35% stake in the joint venture.",
            "Sentiment": "positive",
            "PublishDate": 1766159510796,
            "Source": "co_actions_results"
        },
        {
            "Title": "IOB: Govt files Regulation 29 report for OFS completion",
            "Summary": "Government of India files mandatory Regulation 29 disclosure with stock exchanges confirming completion of Indian Overseas Bank OFS transaction involving 417.84 million shares sold on December 17-18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765892598920,
            "Source": "co_actions_results"
        },
        {
            "Title": "IOB Cuts MCLR by 5 bps, EBLR by 25 bps from Dec 15",
            "Summary": "Indian Overseas Bank reduces MCLR by 5 basis points across multiple tenors and cuts External Benchmark Lending Rate by 25 basis points following RBI's repo rate reduction, effective December 15, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765463654716,
            "Source": "stocks"
        },
        {
            "Title": "Indian Overseas Bank Appoints G. Venkataramanan as New Shareholder Director",
            "Summary": "Indian Overseas Bank announced that Sanjaya Rastogi ceased to be Shareholder Director upon completion of his three-year tenure on December 2, 2025, and G. Venkataramanan has been appointed as the new Shareholder Director for three years until December 2, 2028. Venkataramanan brings over 35 years of experience in the life insurance sector, having recently retired as Zonal Manager In-Charge of South Zone at Life Insurance Corporation of India.",
            "Sentiment": "neutral",
            "PublishDate": 1764741685769,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indian Overseas Bank Reports Strong H1 FY26 Performance with Improved Asset Quality and Digital Growth",
            "Summary": "Indian Overseas Bank achieved net profit of ₹2,337 crores in H1 FY26 compared to ₹1,410 crores in H1 FY25, with GNPA reducing to 1.83% and NNPA to 0.28%, while maintaining strong capital adequacy at 17.45% CRAR. The bank demonstrated robust operational performance with NIM at 3.21%, return on equity at 19.95%, and significant digital infrastructure expansion including 37.1 lakh internet banking users and 140 lakh mobile banking users.",
            "Sentiment": "positive",
            "PublishDate": 1764327442256,
            "Source": "stock"
        },
        {
            "Title": "Indian Overseas Bank Receives 8.35 Billion Rupees Tax Refund",
            "Summary": "Indian Overseas Bank received a tax refund of 8.35 billion rupees for Assessment Year 2022-23. This substantial refund will positively impact the bank's financial position and cash flow.",
            "Sentiment": "positive",
            "PublishDate": 1764115920583,
            "Source": "stock"
        },
        {
            "Title": "Indian Overseas Bank Partners with NPST to Launch Voice-Based UPI 123Pay for Feature Phone Users",
            "Summary": "Indian Overseas Bank has selected Network People Services Technologies Limited (NPST) to deploy UPI 123Pay, a voice-based payment system targeting 850 million Indians who haven't adopted conventional UPI. The system addresses 400 million feature-phone users and smartphone users uncomfortable with digital interfaces. Users make payments by giving a missed call to receive an IVR callback, then input transaction amounts and UPI PINs through voice or keypad prompts. The system operates without internet connectivity, supports 12 Indian languages, and offers features including balance checks, transaction history, dispute resolution, and UPI PIN management. NPST Chairman Deepak Chand Thakur described the initiative as a transformative step toward inclusive digital economy and indicated future plans to integrate with AI platforms like Alexa and Google Assistant.",
            "Sentiment": "positive",
            "PublishDate": 1762501318509,
            "Source": "stock"
        },
        {
            "Title": "Indian Overseas Bank Cancels Shareholder Meeting as Single Nominee Deemed Elected as Director",
            "Summary": "Indian Overseas Bank has cancelled its Extraordinary General Meeting scheduled for November 20, 2025, after receiving only one valid nomination for the shareholder director position. Shri G. Venkataramanan, a 60-year-old insurance professional with over 35 years of experience, has been deemed elected as Shareholder Director. The Bank's Nomination and Remuneration Committee found his nomination to be fit and proper as per RBI Master Directions. Venkataramanan will assume office from December 3, 2025, and hold the position until December 2, 2028. He previously served as Zonal Manager In-Charge of the South Zone at Life Insurance Corporation of India before superannuating in July 2025. The e-voting process scheduled from November 17-19, 2025, has also been cancelled since the election was the only agenda item.",
            "Sentiment": "neutral",
            "PublishDate": 1762349761133,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indian Overseas Bank Reports Record Net Profit of ₹1,226 Crores in Q2 FY26, Up 57.79% YoY",
            "Summary": "Indian Overseas Bank achieved an all-time high net profit of ₹1,226 crores for the quarter ended September 30, 2025, marking a 57.79% year-on-year increase from ₹777 crores in the same period last year. The bank reported strong business growth with total business mix reaching ₹617,034 crores, up 14.1% year-on-year. Credit growth was robust at 20.78% year-on-year, reaching ₹277,968 crores, while deposits grew 9.15% to ₹339,066 crores. Asset quality improved significantly with gross NPA ratio declining to 1.83% from 2.72% year-on-year, and net NPA ratio dropping to 0.28% from 0.47%. The bank maintained a strong capital adequacy ratio of 17.94% against the regulatory requirement of 11.5%. Net interest margin expanded to 3.21% from 3.08% year-on-year, while cost-to-income ratio improved to 45.76%. The bank operates through 3,373 branches and serves over 42 million customers across India and international locations. Management indicated comfortable achievement of 17-18% credit growth against their 12% guidance and plans to open approximately 240 new branches.",
            "Sentiment": "positive",
            "PublishDate": 1761143459130,
            "Source": "earnings"
        },
        {
            "Title": "Indian Overseas Bank Makes Earnings Call Recording Available for Quarter Ended September 30, 2025",
            "Summary": "Indian Overseas Bank conducted an earnings conference call on October 16, 2025, at 4:30 PM IST to discuss its financial performance for the quarter and half year ended September 30, 2025. The call was held with analysts and investors. The bank has uploaded the recording of this earnings call on its website and provided a direct link for access. The bank informed stock exchanges BSE and NSE about the availability of this recording.",
            "Sentiment": "neutral",
            "PublishDate": 1760624772308,
            "Source": "earnings"
        },
        {
            "Title": "IOB Reports 14.6% Growth in Interest Income and Lower NPA Provisions",
            "Summary": "Indian Overseas Bank (IOB) reported interest earnings of 78.5 billion rupees in Q2, representing a year-over-year increase from 68.5 billion rupees. The bank's provisions for non-performing assets (NPA) decreased to 1.21 billion rupees in Q2 compared to 1.78 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1760597802349,
            "Source": "earnings"
        },
        {
            "Title": "IOB Reports 58% Jump in Q2 Net Profit to 12.2 Billion Rupees",
            "Summary": "Indian Overseas Bank (IOB) reported a net profit of 12.2 billion rupees for Q2, representing a significant increase from 7.7 billion rupees in the same quarter last year. The bank's asset quality showed improvement with Gross Non-Performing Assets (GNPA) declining to 1.83% from 1.97% in the previous quarter, while Net Non-Performing Assets (NNPA) decreased to 0.28% from 0.32% quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1760597293019,
            "Source": "earnings"
        },
        {
            "Title": "Indian Overseas Bank Re-appoints Cameo Corporate Services as Registrar & Share Transfer Agent",
            "Summary": "Indian Overseas Bank's Board of Directors has decided to re-appoint M/s Cameo Corporate Services Ltd. as its Registrar & Share Transfer Agent (RTA) effective from November 1, 2025. The existing contract with Cameo Corporate Services expires on October 31, 2025. The re-appointment was made through an open tender process. Cameo Corporate Services holds SEBI Registration No. INR000003753.",
            "Sentiment": "neutral",
            "PublishDate": 1760532123871,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Overseas Bank Schedules Analyst Conference Call for Q2 FY2026 Results Discussion",
            "Summary": "Indian Overseas Bank will conduct an analyst conference call on October 16, 2025, at 4:30 PM IST to discuss its unaudited financial results for the quarter and half-year ended September 30, 2025. The call will be led by key management including MD & CEO Ajay Kumar Srivastava and Executive Directors Joydeep Dutta Roy and Dhanaraj T. The bank operates 3,373 branches with around 3,567 ATMs domestically and has international presence in Singapore, Hong Kong, Thailand, and Sri Lanka, serving over 41 million active customers. For the quarter ended June 30, 2025, the bank reported operating profit of ₹2,358 crores and net profit of ₹1,111 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1760177098062,
            "Source": "earnings"
        },
        {
            "Title": "Indian Bank Reports Double-Digit Growth in Deposits and Advances",
            "Summary": "Indian Bank reported total deposits of 12.0% year-on-year growth as of September end. The bank's gross advances increased by 12.9% year-on-year during the same period, showing growth across both key banking metrics.",
            "Sentiment": "positive",
            "PublishDate": 1759456962186,
            "Source": "stock"
        },
        {
            "Title": "Indian Overseas Bank Waives Minimum Balance Charges for Regular Savings Accounts from October 2025",
            "Summary": "Indian Overseas Bank announced it will waive penal charges for non-maintenance of minimum average balance in its regular savings accounts starting October 1, 2025. The waiver applies to SB-Public accounts, while charges up to September 30 will continue under existing rules. Managing Director & CEO Ajay Kumar Srivastava stated the decision aims to provide relief to account holders and improve banking experience. Premium savings accounts including SB-MAX, SB-HNI, SB Prime, SB Priority, SB Privilege, and NRI accounts will continue charging penalties for minimum balance shortfalls. The bank had previously waived such charges for government schemes like Pradhan Mantri Jan-Dhan Yojana and pensioner accounts. Separately, RBI imposed a Rs 31.8 lakh penalty on IOB for non-compliance with Priority Sector Lending directions, specifically for collecting loan-related charges on PSL accounts with sanctioned loans up to Rs 25,000. IOB shares closed 2.67% higher at Rs 39.54, though they have declined 31.51% over the past 12 months.",
            "Sentiment": "positive",
            "PublishDate": 1759248050407,
            "Source": "stock"
        },
        {
            "Title": "Indian Overseas Bank Extends Executive Director Joydeep Dutta Roy's Tenure by Three Years",
            "Summary": "The Central Government has extended the tenure of Joydeep Dutta Roy as Executive Director of Indian Overseas Bank for three years beyond October 20, 2025, or until further orders. The extension was granted under the Banking Companies (Acquisition and Transfer of Undertakings) Act, 1970, and the Nationalized Banks (Management and Miscellaneous Provisions) Scheme, 1970. Roy, born on July 1, 1972, will continue in his executive director role at the public sector bank.",
            "Sentiment": "positive",
            "PublishDate": 1758013619664,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indian Overseas Bank Reduces MCLR by 5 Basis Points Across Select Tenors",
            "Summary": "Indian Overseas Bank reduced its Marginal Cost of Funds based Lending Rate (MCLR) by 5 basis points for Overnight, One-year, Two-year, and Three-year tenors, effective September 15, 2025. The Assets and Liabilities Management Committee made this decision in its meeting held on September 11, 2025, after reviewing MCLR workings. One-Month, Three-Months and Six-Months tenors remain unchanged. The revised rates are: Overnight MCLR at 8.00%, One Year MCLR at 8.85%, Two Year MCLR at 8.85%, and Three Year MCLR at 8.90%. The unchanged rates are One-Month at 8.30%, Three-Month at 8.45%, and Six-Month at 8.70%.",
            "Sentiment": "positive",
            "PublishDate": 1757599414350,
            "Source": "stock"
        },
        {
            "Title": "Indian Overseas Bank Reduces MCLR by 10 Basis Points Across All Tenures",
            "Summary": "Indian Overseas Bank reduced its Marginal Cost of Funds Based Lending Rate by 10 basis points across all tenures, effective August 15. The bank's Asset Liability Management Committee approved the decision on August 11. This marks the second consecutive MCLR reduction within a month, following a July 15 revision. The revised rates range from 8.05% for overnight tenure to 8.9% for one-year tenure. Existing borrowers with MCLR-linked loans will benefit from reduced EMIs after their next reset date, while new customers will receive loans at the lower rates. The rate cut is expected to boost retail loan demand, including housing and personal loans.",
            "Sentiment": "positive",
            "PublishDate": 1755241953299,
            "Source": "stock"
        },
        {
            "Title": "Indian Overseas Bank Reduces MCLR by 10 Basis Points and Base Rate by 20 Basis Points",
            "Summary": "Indian Overseas Bank announced a reduction in its Marginal Cost of Funds Based Lending Rate (MCLR) by 10 basis points across all tenors, effective August 15, 2025. The bank's Assets and Liabilities Management Committee made this decision during its meeting on August 11, 2025, after reviewing MCLR workings. The revised rates range from 8.05% for overnight MCLR to 8.95% for three-year MCLR. Additionally, the bank reduced its Base Rate by 20 basis points to 9.80%, also effective from August 15, 2025. These rate reductions will remain in effect until further review by the committee.",
            "Sentiment": "positive",
            "PublishDate": 1754918261686,
            "Source": "stock"
        },
        {
            "Title": "Indian Bank Plans to Reduce ASREC Stake Below 30% by March 2026",
            "Summary": "Indian Bank plans to partially divest its 38.26% stake in asset reconstruction company ASREC (India) Ltd, valued at Rs 37.5 crore. The bank aims to reduce its holding to 30% by the end of this fiscal year and has received an extension until March 2026 to comply with banking regulations that prohibit banks from holding more than 30% in non-subsidiary companies. Managing director Binod Kumar stated the bank has started looking for buyers. Other stakeholders include Bank of India and Union Bank of India with 26% each, and Life Insurance Corporation of India with 9.18%. ASREC, incorporated in October 2004, purchases non-performing assets from banks and financial institutions for resolution. Despite declining bad loan ratios across the banking sector, Kumar indicated that asset reconstruction companies remain attractive businesses. Indian Bank's gross NPA ratio improved to 3.01% from 3.77% year-on-year, while net NPA fell to 0.18% from 0.39%.",
            "Sentiment": "neutral",
            "PublishDate": 1754406799430,
            "Source": "stock"
        },
        {
            "Title": "Indian Overseas Bank Reports Strong Q1 Performance with 75.57% Net Profit Growth and Improved Asset Quality",
            "Summary": "Indian Overseas Bank reported net profit of ₹1,111 crore for the quarter ended June 30, 2025, marking a 75.57% year-on-year growth. The bank's total business reached ₹5,93,000 crore with 12.19% YoY growth. Total deposits grew 10.75% YoY while advances increased 14.05% YoY. Net Interest Income rose to ₹2,746 crore from ₹2,441 crore last year. Asset quality improved with Gross NPA at 1.97% and Net NPA declining to 0.32% from 0.51% a year ago. The bank maintained a strong CASA ratio of 43.78% and achieved a slippage ratio of 0.10%. Net Interest Margin stood at 3.04% compared to 3.06% in the previous year. The bank's Retail, Agriculture and MSME segment constitutes 78.92% of the loan portfolio. Management highlighted that 98% of transactions are now digital and announced plans to open 120 new branches and recruit 900 officers. The bank recovered ₹574 crore from technically written-off accounts and received an income tax refund of ₹1,146 crore during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754406677912,
            "Source": "earnings"
        },
        {
            "Title": "Indian Overseas Bank Appoints Advisor to Sell Rs 12,000 Crore NPAs",
            "Summary": "Indian Overseas Bank has engaged Special Situation Advisors India to find buyers for over Rs 12,000 crore worth of non-performing assets across 67 large corporate accounts. The portfolio includes exposures to Videocon Industries, Frost International, Rotomac Global, Lanco Infratech and ABG Shipyard, totaling Rs 12,224 crore. These accounts are primarily stuck in litigation or undergoing liquidation, with IOB holding less than 10% exposure in most cases. Special Situations Advisors won the mandate by quoting a fee of 11 paise per Rs 1 crore recovered, beating competitors including Deloitte, EY and BoB Capital Markets. The advisor has four months to complete the process. IOB reported its first quarterly net profit exceeding Rs 1,000 crore in the January-March 2025 period.",
            "Sentiment": "neutral",
            "PublishDate": 1753922057910,
            "Source": "stock"
        },
        {
            "Title": "Indian Overseas Bank Makes Analyst Meet Audio Recording Available for Q1 Financial Performance Discussion",
            "Summary": "Indian Overseas Bank conducted an Analyst Meet on July 29, 2025, to discuss the bank's financial performance for the quarter ended June 30, 2025. The meeting was held at 4:00 PM IST. The bank has uploaded the audio recording of the analyst meet to its website, making it accessible through a dedicated link. The bank informed stock exchanges BSE and NSE about the availability of this recording.",
            "Sentiment": "neutral",
            "PublishDate": 1753797276002,
            "Source": "earnings"
        },
        {
            "Title": "Indian Bank Receives Board Approval to Raise Rs 5,000 Crore, Develops Own UPI App",
            "Summary": "Indian Bank has received board approval to raise Rs 5,000 crore during the financial year, though CEO Binod Kumar indicated the fund raise may not be immediately required given the bank's capital adequacy ratio of 17.80% for the April-June 2025 quarter, up from 16.47% in the same quarter last year. The Chennai-based bank is developing its own UPI application called 'IND-UPI' to compete with PhonePe, GPay, and PayTM, which could save approximately Rs 150 crore annually by eliminating the Rs 12 crore monthly fees currently paid to other UPI providers. The bank has also received approval to hire 3,000 employees across all levels during the current financial year, including specialized roles in cyber security and risk management. Indian Bank reported a 24% increase in net profit to Rs 2,973 crore for the April-June 2025 quarter, compared to Rs 2,403 crore in the corresponding quarter last year, with total income growing to Rs 18,721 crore from Rs 16,945 crore. The bank recovered Rs 2,059 crore in the latest quarter and has set a recovery target of Rs 5,500 to Rs 6,500 crore for the year.",
            "Sentiment": "positive",
            "PublishDate": 1753619870875,
            "Source": "stock"
        },
        {
            "Title": "Indian Overseas Bank Gets Regulatory Approval to Settle HKMA Anti-Money Laundering Penalty",
            "Summary": "Indian Overseas Bank has received regulatory approval to settle a penalty imposed by the Hong Kong Monetary Authority (HKMA) related to anti-money laundering lapses. The bank indicated that this settlement will not have a material financial impact on its operations.",
            "Sentiment": "neutral",
            "PublishDate": 1753444178895,
            "Source": "stock"
        },
        {
            "Title": "Indian Bank Reports 24% Jump in Net Profit with Improved Asset Quality",
            "Summary": "Indian Bank posted a net profit of ₹2,973 crore in the first quarter, marking a 23.7% increase from ₹2,403 crore in the same period last year. The bank's Net Interest Income grew 2.9% to ₹6,359 crore compared to ₹6,178 crore year-on-year. Asset quality showed marginal improvement with Gross NPA declining to 3.01% from 3.09% in the previous quarter, while Net NPA decreased slightly to 0.18% from 0.19% sequentially.",
            "Sentiment": "positive",
            "PublishDate": 1753345489047,
            "Source": "earnings"
        }
    ]
}