{
    "Symbol": "IOLCP",
    "ISIN": "INE485C01029",
    "News": [
        {
            "Title": "IOL Chemicals Reports Q3 FY26 Financial Results",
            "Summary": "IOL Chemicals and Pharmaceuticals Limited reported total income of ₹585.68 crore for Q3 FY26, with net profit after tax of ₹20.58 crore. Board declared interim dividend of ₹1 per share.",
            "Sentiment": "positive",
            "PublishDate": 1770888427243,
            "Source": "co_actions_results"
        },
        {
            "Title": "IOL Chemicals Schedules Q3 FY26 Earnings Call",
            "Summary": "IOL Chemicals and Pharmaceuticals Limited announces analyst conference call on February 12, 2026 at 3:00 PM IST to discuss Q3 and nine months FY26 financial performance ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770224260136,
            "Source": "co_actions_results"
        },
        {
            "Title": "IOL Chemicals Files Strike-off Application for Subsidiary",
            "Summary": "IOL Chemicals and Pharmaceuticals has filed an application to strike off its wholly owned subsidiary IOL Life Sciences Limited from the register of companies on January 27, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769520725772,
            "Source": "stocks"
        },
        {
            "Title": "IOL Chemicals Receives EDQM CEP Certificate for Minoxidil Manufacturing",
            "Summary": "IOL Chemicals & Pharmaceuticals Ltd received a Certificate of Suitability (CEP) from the European Directorate for the Quality of Medicines (EDQM) for Minoxidil on December 4th, 2025. The certification enables the company to supply Minoxidil, used for hereditary hair loss treatment, to European markets with regulatory approval.",
            "Sentiment": "positive",
            "PublishDate": 1765151585196,
            "Source": "stock"
        },
        {
            "Title": "IOL Chemicals & Pharmaceuticals Receives CEP Certificate for Minoxidil",
            "Summary": "IOL Chemicals & Pharmaceuticals Ltd received a CEP certificate for Minoxidil on December 4, 2025, for treating hereditary hair loss. This regulatory approval enables the company to market and manufacture this hair loss treatment product in compliance with pharmaceutical standards.",
            "Sentiment": "positive",
            "PublishDate": 1764932001899,
            "Source": "stock"
        },
        {
            "Title": "IOL Chemicals Reports 33% EBITDA Growth in Q2 FY26 Despite Flood-Related Cost Pressures",
            "Summary": "IOL Chemicals achieved revenue of INR 567.5 crores with 7.9% year-on-year growth and EBITDA expansion to 11.1% margins, driven by volume recovery in non-Ibuprofen APIs and paracetamol capacity utilization reaching 55%. The company faced temporary margin pressure from INR 7-8 crores in elevated fuel costs due to Punjab floods but expects normalization in coming quarters while targeting 13-14% EBITDA margins.",
            "Sentiment": "positive",
            "PublishDate": 1763555606279,
            "Source": "earnings"
        },
        {
            "Title": "IOL Chemicals & Pharmaceuticals Plans Capacity Expansion and Diversification Strategy",
            "Summary": "IOL Chemicals & Pharmaceuticals is targeting growth through capacity expansion in ibuprofen and specialty chemicals. The company is implementing backward integration to drive cost efficiency and developing new molecules for API diversification. The strategy includes margin improvement initiatives through energy savings and green chemistry programs. The company reports having a strong export order pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1762963830853,
            "Source": "stock"
        },
        {
            "Title": "IOL Chemicals Reports 30% Decline in Quarterly Profit Despite Revenue Growth",
            "Summary": "IOL Chemicals and Pharmaceuticals Limited reported a net profit of ₹30.00 crore for the quarter ended September 30, 2025, compared to ₹33.96 crore in the previous quarter, representing a decline of 11.7%. However, revenue from operations increased to ₹567.53 crore from ₹551.69 crore in the previous quarter. For the half-year period, net profit reached ₹63.96 crore on revenue of ₹1,119.22 crore. The company operates in two segments - Pharmaceuticals and Chemicals. Total expenses for the quarter were ₹533.89 crore, with cost of materials consumed being the largest component at ₹376.55 crore. The Board of Directors approved these unaudited financial results at their meeting held on November 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762870763332,
            "Source": "earnings"
        },
        {
            "Title": "IOL Chem and Pharma Reports Strong Q2 Growth with 57% Jump in Net Profit",
            "Summary": "IOL Chem and Pharma delivered strong quarterly results with net profit rising to 300 million rupees from 191.5 million rupees year-over-year. Revenue increased to 5.68 billion rupees compared to 5.26 billion rupees in the same period last year. EBITDA grew significantly to 571 million rupees from 415.6 million rupees, while EBITDA margin expanded to 10.06% from 7.9% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762856398383,
            "Source": "earnings"
        },
        {
            "Title": "IOL Chemicals Receives EDQM Certificate for Sitagliptin Phosphate Monohydrate",
            "Summary": "IOL Chemicals and Pharmaceuticals Limited announced that the European Directorate for the Quality of Medicines & Health Care (EDQM) has issued a Certificate of Suitability for the company's API product 'Sitagliptin Phosphate Monohydrate' on October 27, 2025. Sitagliptin Phosphate Monohydrate is an oral antidiabetic medication used to control high blood sugar levels. The certification was communicated to stock exchanges NSE and BSE.",
            "Sentiment": "positive",
            "PublishDate": 1761567716546,
            "Source": "stock"
        },
        {
            "Title": "IOL Chemicals and Pharmaceuticals Incorporates Wholly-Owned UK Subsidiary",
            "Summary": "IOL Chemicals and Pharmaceuticals Limited has incorporated a wholly-owned subsidiary, IOL Pharmaxis UK Limited, in the United Kingdom on October 16, 2025. The subsidiary was established under the Companies Act 2006 with a share capital of GBP 10,000, comprising 10,000 ordinary shares of GBP 1 each. The new entity will operate in the pharmaceuticals and chemicals industry but has not yet commenced business operations. IOL Chemicals holds 100% shareholding in the subsidiary, which will be classified as a related party. The consideration involves cash payment for share subscription, to be remitted in compliance with Foreign Exchange Management regulations.",
            "Sentiment": "positive",
            "PublishDate": 1761319840497,
            "Source": "corporate_action"
        },
        {
            "Title": "Vasudeva Commercials Transfers 3.94% Stake in IOL Chemicals Following NCLT-Approved Demerger",
            "Summary": "Vasudeva Commercials Limited disclosed an off-market transfer of 1,15,78,195 shares (3.94% stake) in IOL Chemicals and Pharmaceuticals Limited to Synthorix Trading Limited. The transfer occurred following the National Company Law Tribunal's approval of a demerger scheme between Vasudeva Commercials (demerged company) and Synthorix Trading (resulting company). Post-transfer, Vasudeva Commercials' holding in IOL Chemicals reduced from 7.94% to 4.00%. The NCLT order was dated September 25, 2025, with formal order on October 9, 2025, and the share transfer completed on October 17, 2025. IOL Chemicals has a total equity share capital of Rs. 58,70,55,020 comprising 29,35,27,510 equity shares of Rs. 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1760782080343,
            "Source": "corporate_action"
        },
        {
            "Title": "IOL Chemicals Receives European Certificate for Pantoprazole API Product",
            "Summary": "IOL Chemicals and Pharmaceuticals Limited received a Certificate of Suitability from the European Directorate for the Quality of Medicines & Health Care (EDQM) for their API product Pantoprazole Sodium Sesquihydrate Process-III on October 14, 2025. Pantoprazole sodium is a proton pump inhibitor that reduces stomach acid and is used to treat gastroesophageal reflux disease (GERD), erosive esophagitis, and Zollinger-Ellison syndrome.",
            "Sentiment": "positive",
            "PublishDate": 1760522829241,
            "Source": "stock"
        },
        {
            "Title": "IOL Chemicals Reports 9.8% Revenue Growth and 19.5% EBITDA Jump in Q1 FY26",
            "Summary": "IOL Chemicals and Pharmaceuticals Limited reported quarterly revenue of Rs. 552 crores, reflecting 9.8% year-on-year growth from Rs. 502 crores in the previous year. EBITDA increased 19.5% to Rs. 69.5 crores from Rs. 58.2 crores, with margins improving 102 basis points to 12.4%. Profit after tax rose 14.4% to Rs. 34 crores. The company's newly commissioned 10,800 MTPA Paracetamol plant has begun exports to European markets and is currently operating at 34% capacity, expected to reach 60% by Q3. The company is targeting a 50-50 split between Ibuprofen and non-Ibuprofen APIs, with non-Ibuprofen currently at 34% share. Export revenue comprises 25% of total sales, with plans to increase this to 40% over two years. The company received REACH registration for Acetic Anhydride in EU markets and earned an EcoVadis Silver Medal for sustainability performance. Management maintains guidance of 14-15% EBITDA margins and 10% revenue growth for the full year.",
            "Sentiment": "positive",
            "PublishDate": 1755069869020,
            "Source": "earnings"
        },
        {
            "Title": "IOL Chemicals Announces Strategic Expansion Plan Focusing on High-Value APIs and Global Markets",
            "Summary": "IOL Chemicals has outlined a strategic expansion plan centered on high-value Active Pharmaceutical Ingredients (APIs), global market penetration, and backward integration. The company is targeting sustainable growth through an innovation-driven roadmap that emphasizes these key areas of development.",
            "Sentiment": "positive",
            "PublishDate": 1754576575347,
            "Source": "stock"
        },
        {
            "Title": "IOL Chem and Pharma Reports Growth in Q1 Financial Performance",
            "Summary": "IOL Chem and Pharma reported quarterly results showing revenue of 5.5 billion rupees compared to 5.02 billion rupees in the same period last year. The company's EBITDA increased to 621 million rupees from 508 million rupees year-over-year, with EBITDA margin improving to 11.3% from 10.11%. Net profit rose to 340 million rupees versus 297 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754557719217,
            "Source": "earnings"
        },
        {
            "Title": "IOL Chemicals Registers Acetic Anhydride Under EU REACH Regulation",
            "Summary": "IOL Chemicals And Pharmaceuticals has successfully registered Acetic Anhydride under the European Union's REACH (Registration, Evaluation, Authorization and Restriction of Chemicals) regulation. This registration allows the company to export Acetic Anhydride to all EU member states.",
            "Sentiment": "positive",
            "PublishDate": 1749822408000,
            "Source": "default"
        },
        {
            "Title": "IOL Chemicals: Q4 Net Profit Rises 13.7%, Margins Expand",
            "Summary": "IOL Chemicals and Pharmaceuticals Ltd reported a 13.7% YoY increase in Q4 FY25 net profit to ₹31.42 crore. Revenue grew 4.7% to ₹527.7 crore. EBITDA jumped 28.5% to ₹62.6 crore, with margins expanding to 11.8% from 9.6% in Q4FY24.",
            "Sentiment": "positive",
            "PublishDate": 1747406114000,
            "Source": "earnings"
        },
        {
            "Title": "IOL Chem and Pharma Reports Q4 Financial Results",
            "Summary": "IOL Chem and Pharma has released its Q4 financial results. The company's EBITDA increased to 630 million rupees from 501 million rupees year-over-year. The EBITDA margin improved to 11.93% from 9.94% year-over-year. Net profit rose to 316 million rupees from 282 million rupees year-over-year and 206 million rupees quarter-over-quarter. Revenue for Q4 was 5.3 billion rupees, up from 5.04 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747403726000,
            "Source": "result"
        },
        {
            "Title": "IOL Chemicals and Pharma to Consider Q4 Results on May 16",
            "Summary": "IOL Chemicals and Pharmaceuticals Limited has announced that it will consider its fourth quarter (Q4) financial results on May 16. This meeting is likely to involve the company's board of directors reviewing and potentially approving the financial statements for the quarter ending March 31, 2023.",
            "Sentiment": "neutral",
            "PublishDate": 1746533981000,
            "Source": "default"
        },
        {
            "Title": "IOL Chemicals and Pharmaceuticals: Chinese Approval for Ibuprofen Export Amid Plant Incident",
            "Summary": "IOL Chemicals received approval from China's Center for Drug Evaluation to export Ibuprofen. Separately, a gas leak at the company's Punjab plant resulted in one fatality and three injuries. The incident is under investigation but operations are unaffected.",
            "Sentiment": "neutral",
            "PublishDate": 1745891152000,
            "Source": "normal_news"
        },
        {
            "Title": "IOL Chemicals and Pharma Receives Approval to Export Ibuprofen to China",
            "Summary": "IOL Chemicals and Pharma has received approval from China's Center for Drug Evaluation (CDE) of the National Medical Products Administration (NMPA) for its product Ibuprofen. This approval authorizes the company to export Ibuprofen to Chinese markets.",
            "Sentiment": "positive",
            "PublishDate": 1745844599000,
            "Source": "default"
        },
        {
            "Title": "IOL Chemicals and Pharmaceuticals: Fatal Gas Leak at Punjab Plant",
            "Summary": "A gas leak at IOL Chemicals and Pharmaceuticals' Barnala plant in Punjab resulted in one death and three injuries. The incident occurred on Sunday, April 27, and was contained within a single unit. Two injured individuals remain under medical observation, while one has been discharged. The company has reported the incident to authorities and investigations are ongoing. Operations at the plant are not impacted.",
            "Sentiment": "negative",
            "PublishDate": 1745832522000,
            "Source": "normal_news"
        },
        {
            "Title": "IOL Chemicals and Pharma Expands Paracetamol and Clopidogrel Production",
            "Summary": "IOL Chemicals and Pharmaceuticals has initiated operations at its new Unit-11 for Paracetamol production. Additionally, the company has increased its manufacturing capacity for Clopidogrel to 240 MTPA (Metric Tonnes Per Annum).",
            "Sentiment": "positive",
            "PublishDate": 1742828536000,
            "Source": "corporate_action"
        }
    ]
}