{
    "Symbol": "IONEXCHANG",
    "ISIN": "INE570A01022",
    "News": [
        {
            "Title": "Ion Exchange Q3 FY26 Results Show Mixed Performance",
            "Summary": "Ion Exchange reports 6% revenue growth to INR 7,344 million in Q3 FY26, but EBITDA declines 21% to INR 593 million. Company secured INR 2,050 million solar contracts while Roha facility ramps up.",
            "Sentiment": "neutral",
            "PublishDate": 1770659697002,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ion Exchange schedules Q3FY26 earnings call",
            "Summary": "Ion Exchange (India) Limited announces conference call with institutional investors and analysts on February 2, 2026 at 2:00 pm IST to discuss Q3FY26 and nine-month financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1769518953528,
            "Source": "co_actions_results"
        },
        {
            "Title": "ION Exchange Wins Court Case Against ₹174.8 Cr Award",
            "Summary": "ION Exchange India successfully gets court dismissal of ₹174.80 crore arbitral award, providing significant financial relief to the water treatment solutions company.",
            "Sentiment": "positive",
            "PublishDate": 1768222696152,
            "Source": "stocks"
        },
        {
            "Title": "Ion Exchange wins arbitral award dismissal case",
            "Summary": "Ion Exchange (India) Limited receives favorable arbitral award as both claim and counter-claim dismissed due to limitation period, removing ₹17.48 crore contingent liability from books.",
            "Sentiment": "positive",
            "PublishDate": 1768221219723,
            "Source": "stocks"
        },
        {
            "Title": "Ion Exchange Wins ₹205 Cr Solar Water Treatment Orders",
            "Summary": "Ion Exchange secures contracts worth ₹205 crores from Rayzon Energy and INOX Solar for ultra-pure water systems and wastewater treatment for solar projects in Gujarat and Odisha.",
            "Sentiment": "positive",
            "PublishDate": 1765805057117,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ion Exchange Reports 14% Revenue Growth in Q2 FY26 Despite Engineering Margin Pressures",
            "Summary": "Ion Exchange (India) Limited reported operating income of INR 7,339 million for Q2 FY26, marking a 14% year-on-year increase. The company's EBITDA stood at INR 685 million with margins at 9.33%, while net profit was INR 499 million, declining 1.4% year-on-year. For the first half of FY26, operating income reached INR 13,171 million, up 9% year-on-year, with net profit of INR 984 million growing 3%. The engineering division recorded revenue of INR 4,562 million (16% growth) but segment EBIT declined 5% to INR 224 million due to legacy project impacts and elevated infrastructure costs. The chemicals segment showed strong performance with revenue of INR 2,184 million (11% growth) and EBIT of INR 591 million (13% growth). The consumer products division achieved INR 858 million revenue (24% growth) while reducing losses. The company commenced stage-wise commissioning of its greenfield manufacturing plant at Roha, Maharashtra in September 2025, with total CAPEX of approximately Rs 450 crores. Ion Exchange also entered a strategic partnership with MANN+HUMMEL Water Membrane Solutions for manufacturing advanced membranes in India. The current order book stands at INR 27,110 million with order inflow of INR 4,700 million during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762982395473,
            "Source": "earnings"
        },
        {
            "Title": "Ion Exchange Reports Q2 FY26 Results with 31% Revenue Growth Despite Margin Pressures",
            "Summary": "Ion Exchange (India) Limited reported consolidated operating income of INR 7,339 million for Q2 FY26, marking a 31% year-over-year increase from INR 5,832 million. However, operating EBITDA margins declined to 9.33% from 10.75% in the previous year. Net profit reached INR 499 million with diluted EPS of INR 4.178 per share. For the half-year period, consolidated revenue grew 8.7% to INR 13,171 million with net profit of INR 984 million. The company completed migration to SAP environment and commenced stage-wise commissioning of its greenfield resin manufacturing plant at Roha, Maharashtra. Engineering segment showed sequential improvement in order flow driven by medium-sized opportunities, while the services division recorded strong growth through acquisition of high-value long-term O&M contracts. The company entered a strategic partnership with MANN+HUMMEL Water & Membrane Solutions for local membrane manufacturing. Engineering order book stands at INR 9,011 crores as of September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762463436043,
            "Source": "earnings"
        },
        {
            "Title": "Ion Exchange Targets ₹2,500+ Crore Order Book Through Water Treatment Expansion",
            "Summary": "Ion Exchange is targeting an order book exceeding ₹2,500 crores, focusing on industrial and municipal water treatment projects. The company is emphasizing exports, desalination, and zero-liquid-discharge systems as key growth areas. Ion Exchange is investing in research and development along with membrane manufacturing to expand its sustainable water-tech solutions and strengthen its global presence.",
            "Sentiment": "positive",
            "PublishDate": 1762439931896,
            "Source": "stock"
        },
        {
            "Title": "Ion Exchange India Reports Mixed Q2 Results with Revenue Growth but Lower Profit",
            "Summary": "Ion Exchange India reported quarterly consolidated net profit of 495.3 million rupees, down from 509.4 million rupees in the same period last year. Revenue increased to 7.34 billion rupees from 6.44 billion rupees year-over-year. EBITDA rose marginally to 685 million rupees from 683 million rupees, while EBITDA margin compressed to 9.33% from 10.6% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762268195259,
            "Source": "earnings"
        },
        {
            "Title": "ION Exchange Launches New Resin Plant in Maharashtra with 3,696 M³ Initial Capacity",
            "Summary": "ION Exchange (India) Limited has begun the gradual launch of its new resin plant located in Roha, Maharashtra. The plant's initial capacity stands at 3,696 M³ and was successfully commissioned by September 30, 2025. The company is implementing a phased approach to the plant's operations.",
            "Sentiment": "positive",
            "PublishDate": 1759218708519,
            "Source": "stock"
        },
        {
            "Title": "Ion Exchange India Revises Record Date to September 2, 2025 for FY2025 Dividend Eligibility",
            "Summary": "Ion Exchange (India) Limited has revised its record date to September 2, 2025, for determining shareholder eligibility for the FY 2024-25 dividend. The company's register of members and share transfer books will remain closed from September 3 to September 9, 2025. The dividend declaration is subject to approval at the company's 61st Annual General Meeting. This revision follows an earlier intimation dated August 5, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754659913593,
            "Source": "corporate_action"
        },
        {
            "Title": "Ion Exchange Reports 3% Revenue Growth to Rs 583 Crores in Q1 FY26, SAP Migration Impacts Operations",
            "Summary": "Ion Exchange (India) Limited reported operating income of Rs 583.2 crores for Q1 FY26, representing a 3% year-on-year increase. EBITDA declined 2% to Rs 62.7 crores with margins at 10.75%, while net profit grew 8% to Rs 48.4 crores. The company's migration to SAP environment created transition challenges that impacted business volumes, particularly affecting the chemicals division in April. Engineering division revenue fell 2% to Rs 318 crores but EBIT surged 48% to Rs 27.8 crores due to a one-time cost rebate from a large EPC contract. Chemical division revenue dropped 5% to Rs 188.9 crores with EBIT declining 6% to Rs 46.7 crores. Consumer products division showed strong growth of 36% to Rs 90.2 crores, reducing losses from Rs 3.4 crores to Rs 0.9 crores. The company's order book stands at Rs 2,664 crores with a bid pipeline exceeding Rs 9,200 crores. Execution of the UP Jal Nigam project remains slow due to fund availability issues, while the company received payments from Sri Lankan authorities. The new Roha manufacturing plant for resin production is expected to be commissioned in the current quarter, designed primarily for export markets across Americas, Europe, Asia-Pacific, and Middle East.",
            "Sentiment": "neutral",
            "PublishDate": 1754658294468,
            "Source": "earnings"
        },
        {
            "Title": "Ion Exchange India Reports Mixed Q1 Results with Profit Growth but Margin Decline",
            "Summary": "Ion Exchange India reported Q1 consolidated net profit of 487 million rupees, up from 450 million rupees in the same period last year. Revenue increased to 5.8 billion rupees from 5.7 billion rupees year-over-year. However, EBITDA declined to 625 million rupees from 642 million rupees, while EBITDA margin compressed to 10.72% from 11.31% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753878160293,
            "Source": "earnings"
        },
        {
            "Title": "Ion Exchange India Presents July 2025 Investor Update Highlighting Strong Growth and Market Position",
            "Summary": "Ion Exchange (India) Limited submitted its July 2025 investor presentation showcasing the company's performance as Asia's largest environment solutions provider. The water treatment company reported operating income of INR 27,371 million and profit after tax of INR 2,083 million for the latest results. The company maintains a 5-year revenue CAGR of 13.1% and PAT CAGR of 17.2%, with ROE of 18.7% and ROCE of 22.0%. Ion Exchange operates through three segments: Engineering (61% of revenue), Chemicals (29%), and Consumer Products (10%). The company has executed over 150,000 projects with operations spanning 23 countries and maintains an order book of approximately INR 22,500 million excluding certain projects. With 61 years of operations, the company operates 7 manufacturing facilities across India and assembly facilities in UAE, Indonesia, Bangladesh and Saudi Arabia. The presentation highlighted market opportunities driven by government initiatives like Jal Jeevan Mission and Swachh Bharat Abhiyan, with the global water treatment market expected to grow at 7.5% CAGR to reach USD 536.41 billion by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1753191933598,
            "Source": "stock"
        },
        {
            "Title": "ION EXCHANGE (INDIA) Reports Q4 Financial Results",
            "Summary": "ION EXCHANGE (INDIA) has released its Q4 financial results. The company reported an EBITDA of 858 million rupees, down from 922 million rupees in the same quarter last year. The EBITDA margin decreased to 10.30% from 11.80% year-over-year. Consolidated net profit for Q4 was 633 million rupees, compared to 728 million rupees in the previous year. Revenue increased to 8.34 billion rupees from 7.8 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1748483588000,
            "Source": "default"
        },
        {
            "Title": "Ion Exchange (India) Reports Q3 Financial Results",
            "Summary": "Ion Exchange (India) has announced its financial results for the third quarter. The company's consolidated net profit increased to 486 million rupees, up from 475 million rupees in the same period last year. Revenue also saw significant growth, reaching 6.9 billion rupees compared to 5.54 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737678239000,
            "Source": "earnings"
        },
        {
            "Title": "ION Exchange (India) Reports Mixed Q3 Financial Results",
            "Summary": "ION Exchange (India) has released its Q3 financial results. The company's EBITDA increased to 756 million rupees from 706 million rupees year-over-year. However, the EBITDA margin decreased to 10.93% from 12.74% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1737643074000,
            "Source": "earnings"
        },
        {
            "Title": "ION Exchange (India) Reports Q3 Financial Results",
            "Summary": "ION Exchange (India) has announced its Q3 financial results. The company's consolidated net profit increased to 486 million rupees, up from 475 million rupees in the same quarter last year. Revenue for Q3 grew significantly to 6.9 billion rupees, compared to 5.54 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1737643070000,
            "Source": "earnings"
        }
    ]
}