{
    "Symbol": "IPCALAB",
    "ISIN": "INE571A01038",
    "News": [
        {
            "Title": "Ipca Labs Starts Production at New Rs 182 Cr Facility",
            "Summary": "Ipca Laboratories commences commercial production at its new greenfield Drug Intermediates/APIs manufacturing facility in Wardha, Maharashtra, established with Rs 182 crores investment.",
            "Sentiment": "positive",
            "PublishDate": 1770639131778,
            "Source": "stocks"
        },
        {
            "Title": "Ipca Labs Board Meet Set for Feb 13 for Q3FY26 Results",
            "Summary": "Ipca Laboratories has scheduled its board meeting for February 13, 2026, to consider Q3FY26 unaudited financial results. Trading window remains closed until February 15, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769061530825,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ipca Labs Block Trade Worth ₹18.13 Crores on NSE",
            "Summary": "Ipca Laboratories witnessed a significant block trade on NSE involving 120,447 shares valued at ₹18.13 crores, executed at ₹1,504.90 per share, indicating institutional interest in the pharmaceutical stock.",
            "Sentiment": "neutral",
            "PublishDate": 1768367475454,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ipca Labs Sells US Subsidiary for $400,000",
            "Summary": "Ipca Laboratories announces sale of 100% shareholding in wholly owned step-down subsidiary Bayshore Pharmaceuticals LLC to Centaur Pharmaceuticals USA Inc for $400,000. Company also updates registered office address.",
            "Sentiment": "neutral",
            "PublishDate": 1768282118244,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ipca Labs Sells US Subsidiary for $400,000",
            "Summary": "Ipca Laboratories announces sale of 100% shareholding in wholly owned step-down subsidiary Bayshore Pharmaceuticals LLC to Centaur Pharmaceuticals USA Inc for $400,000.",
            "Sentiment": "neutral",
            "PublishDate": 1768282089165,
            "Source": "co_actions_results"
        },
        {
            "Title": "IPCA Labs Sells US Subsidiary for $400,000",
            "Summary": "IPCA Laboratories divests entire stake in non-operating US subsidiary Bayshore Pharmaceuticals to Centaur Pharmaceuticals USA for $400,000 to reduce compliance costs.",
            "Sentiment": "neutral",
            "PublishDate": 1768281741031,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ipca Labs Sees ₹19.85 Cr NSE Block Trade",
            "Summary": "Ipca Laboratories witnessed a significant block trade on NSE worth ₹19.85 crores involving 130,260 shares at ₹1,524.00 per share, indicating substantial institutional activity in the pharmaceutical stock.",
            "Sentiment": "neutral",
            "PublishDate": 1768192748257,
            "Source": "co_actions_results"
        },
        {
            "Title": "IPCA Labs Receives US FDA Form 483 with Three Concerns at Tarapur Facility",
            "Summary": "IPCA Labs reported that the US FDA has issued a Form 483 identifying three concerns at the company's Tarapur manufacturing facility. This regulatory action could impact the pharmaceutical company's operations and compliance status at the facility.",
            "Sentiment": "negative",
            "PublishDate": 1764925558648,
            "Source": "stock"
        },
        {
            "Title": "Ipca Laboratories Reports 8% Domestic Growth and 25.46% EBITDA Margin in Q2FY26",
            "Summary": "Ipca Laboratories delivered 8% growth in domestic formulations and improved standalone EBITDA margin to 25.46% from 22.89% in Q2FY26, with API business growing 28% to INR 408 crores. The company increased R&D spend to 3.91% of turnover and expects consolidated margins to be better by 1% in the second half, while maintaining guidance of 10-11% domestic growth for the full year.",
            "Sentiment": "positive",
            "PublishDate": 1763365345590,
            "Source": "earnings"
        },
        {
            "Title": "Ipca Labs Raises Consolidated EBITDA Margin Guidance and Provides Business Segment Growth Outlook",
            "Summary": "Ipca Labs increased its consolidated EBITDA margin guidance to 21% from the earlier 20% target and provided growth projections across business segments including 10-11% for domestic formulations and 14-15% for API business. The company also outlined R&D spending plans at 4% of turnover for the current year, rising to 4.5-4.75% next year.",
            "Sentiment": "positive",
            "PublishDate": 1763091786589,
            "Source": "earnings"
        },
        {
            "Title": "IPCA Laboratories Reports Strong Q2 Growth with Revenue Rising to 25.6 Billion Rupees",
            "Summary": "IPCA Laboratories delivered strong quarterly performance with revenue increasing to 25.6 billion rupees from 23.55 billion rupees year-over-year. The pharmaceutical company's EBITDA grew to 5.44 billion rupees compared to 4.4 billion rupees in the same period last year, while EBITDA margin expanded to 21.32% from 18.7%. Consolidated net profit rose to 2.8 billion rupees from 2.3 billion rupees year-over-year, reflecting improved operational efficiency across key financial metrics.",
            "Sentiment": "positive",
            "PublishDate": 1763022149666,
            "Source": "earnings"
        },
        {
            "Title": "IPCA Laboratories Board Approves Sale of Manufacturing Unit to Suleshvari Pharma for ₹22.15 Crore",
            "Summary": "IPCA Laboratories' board has approved the sale of its drug intermediates and API manufacturing unit to Suleshvari Pharma for ₹22.15 crore. The transaction involves the divestment of a manufacturing facility that produces active pharmaceutical ingredients and drug intermediates.",
            "Sentiment": "neutral",
            "PublishDate": 1760702568279,
            "Source": "order&deals"
        },
        {
            "Title": "Ipca Laboratories Schedules Board Meeting for Q2 Financial Results on November 13",
            "Summary": "Ipca Laboratories has scheduled a Board of Directors meeting on November 13, 2025 to consider and approve the unaudited financial results for the second quarter and half-year ended September 30, 2025. The company's trading window for insiders will remain closed until November 15, 2025, which is 48 hours after the declaration of the financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1760696764802,
            "Source": "corporate_action"
        },
        {
            "Title": "Ipca Laboratories Establishes Wholly Owned Subsidiary in Germany",
            "Summary": "Ipca Laboratories Limited has incorporated a wholly owned subsidiary named Ipca Pharmaceuticals GmbH in Germany with an initial paid-up capital of Euro 25,000. The subsidiary will hold product registrations, participate in institutional business, and distribute generic formulations in Germany.",
            "Sentiment": "positive",
            "PublishDate": 1760592208344,
            "Source": "stock"
        },
        {
            "Title": "Ipca Laboratories Signs Technology Transfer Deal with BioSimilar Sciences for Monoclonal Antibody Biosimilar",
            "Summary": "Ipca Laboratories announced a definitive Technology Transfer and Joint Development Agreement with BioSimilar Sciences PR LLC for a monoclonal antibody biosimilar targeting cancer and autoimmune diseases. The agreement transfers late-stage development, clinical manufacture, and commercial supply to BioSimilar Sciences' facility in Puerto Rico. The biosimilar targets a US market worth over USD 4 billion with expected 12% annual growth. Under the deal, Ipca will receive milestone fees for technology transfer and royalties on net sales upon commercialization. BioSimilar Sciences gets exclusive rights for USA and Canada, and non-exclusive rights for some Latin American countries. The first biosimilar launch is targeted for 2027, with new molecule targets for 2028/29 FDA approval. The partnership leverages OcyonBio's 60 million unit sterile filling capacity in Puerto Rico and is expected to create hundreds of biotech jobs while strengthening the US supply chain for essential medicines.",
            "Sentiment": "positive",
            "PublishDate": 1758713772144,
            "Source": "order&deals"
        },
        {
            "Title": "Ipca Laboratories Reports Mixed Q1 FY26 Results with 10% Domestic Growth, Margin Pressures at Unichem",
            "Summary": "Ipca Laboratories reported quarterly results with domestic business growing 10% and maintaining its 16th rank per IQVIA. Market share increased from 2.01% to 2.08% compared to the previous year. Export business showed strong performance with branded formulations growing 10% to Rs. 124 crores and generic business up 15% to Rs. 326 crores. API business delivered 12% growth driven by Europe and Latin America markets. Standalone EBITDA margins improved to 23.82% from 22.22%, while consolidated margins declined slightly to 18.39% from 18.52%. Standalone net profit increased 26% to Rs. 262 crores, with consolidated net profit up 18% to Rs. 234 crores. Unichem faced challenges with margin pressures due to lost market share on profitable products in the US, business decline in Myanmar and Brazil, plus additional provisions of Rs. 12 crores for currency fluctuation and Rs. 10 crores for Ireland facility closure. The company added 400 people to its cardiovascular division, causing temporary growth slowdown in that therapy area. Management revised full-year guidance, maintaining 9-10% topline growth but reducing EBITDA margin improvement expectation from 100 basis points to 75 basis points.",
            "Sentiment": "neutral",
            "PublishDate": 1755170969213,
            "Source": "earnings"
        },
        {
            "Title": "IPCA Labs Revises Down EBITDA Margin Guidance, Expects 9-10% Topline Growth for FY26",
            "Summary": "IPCA Labs has revised its consolidated EBITDA margin guidance downward, now expecting a 75 basis points improvement compared to the original 100 basis points target. The company's management projects 9-10% overall topline growth for FY26. In the US market, IPCA Labs plans to launch 5-6 products annually and has completed one filing in Q1, with 15-16 products currently under various stages of development. The company's previous guidance for Unichem to achieve Rs 300 crores EBITDA this year is no longer expected to be met, though improvement is anticipated in coming quarters.",
            "Sentiment": "neutral",
            "PublishDate": 1755056990343,
            "Source": "earnings"
        },
        {
            "Title": "IPCA Laboratories Reports 10% Revenue Growth in Q1 Results",
            "Summary": "IPCA Laboratories reported Q1 revenue of 23.1 billion rupees, up from 21 billion rupees year-over-year. EBITDA increased to 4.16 billion rupees from 3.92 billion rupees, though EBITDA margin declined to 18.04% from 18.75%. The company's Q1 EBITDA margin of 18.04% fell short of its full-year guidance of 20%. Consolidated net profit rose to 2.33 billion rupees compared to 1.92 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1754899834596,
            "Source": "earnings"
        },
        {
            "Title": "Ipca Laboratories Schedules Q1FY26 Earnings Conference Call for August 12, 2025",
            "Summary": "Ipca Laboratories Limited has announced a conference call scheduled for Tuesday, August 12, 2025, at 15:30 hrs IST to discuss Q1FY26 earnings and provide a business update. The call will run from 15:30 hrs to 16:30 hrs IST and follows the announcement of the company's Q1FY26 financial results on August 11, 2025. The management will be represented by A K Jain, Managing Director, and Harish Kamath, Corporate Counsel & Company Secretary. Dam Capital Advisors Ltd. will host the conference call for investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1754396247397,
            "Source": "earnings"
        },
        {
            "Title": "IPCA Laboratories Reports 10.8% Year-Over-Year Growth in May 2025",
            "Summary": "IPCA Laboratories has reported a 10.8% year-over-year growth in May 2025. No further details about the specific financial metrics or the company's performance were provided in the given news data.",
            "Sentiment": "positive",
            "PublishDate": 1749528617000,
            "Source": "default"
        },
        {
            "Title": "Ipca Labs: Dolat Capital Maintains 'Add' Rating, Revises Target Price",
            "Summary": "Dolat Capital maintains 'Add' rating on Ipca Labs after Q4 results. They see multiple triggers including cost efficiencies and better scale-up in the Unichem portfolio. The company plans 12-13 new launches in the US market over the next two years, expected to boost its portfolio significantly.",
            "Sentiment": "positive",
            "PublishDate": 1748774909000,
            "Source": "earnings"
        },
        {
            "Title": "IPCA Laboratories: Q4 Profit Rises 14%, Dividend Announced",
            "Summary": "IPCA Laboratories reported Q4 net profit up 14% YoY to ₹68 crore. Revenue increased 11% to ₹2,247 crore. EBITDA grew 33% with margin expansion. The company announced a final dividend of ₹2 per share for FY2025.",
            "Sentiment": "positive",
            "PublishDate": 1748508209000,
            "Source": "earnings"
        },
        {
            "Title": "IPCA Laboratories Reports Lower Than Expected EBITDA Margin",
            "Summary": "IPCA Laboratories has reported a full year EBITDA margin of 19%, which is below the company's guidance of 23-24%. This indicates that the company's profitability has fallen short of its projected targets.",
            "Sentiment": "negative",
            "PublishDate": 1748507558000,
            "Source": "result"
        },
        {
            "Title": "IPCA Laboratories Declares Dividend",
            "Summary": "IPCA Laboratories has announced a dividend of 2 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1748507065000,
            "Source": "result"
        },
        {
            "Title": "IPCA Laboratories Reports Q4 Results and Proposes Green Energy Addition",
            "Summary": "IPCA Laboratories reported its Q4 financial results with improved performance. The company's EBITDA increased to 4.3 billion rupees from 3.2 billion rupees year-over-year, with EBITDA margin rising to 19.09% from 15.83%. Revenue grew to 22.5 billion rupees from 20 billion rupees, and consolidated net profit increased to 680 million rupees from 595 million rupees compared to the same period last year. Additionally, the company has proposed adding green energy generation to its object clause.",
            "Sentiment": "positive",
            "PublishDate": 1748507033000,
            "Source": "default"
        },
        {
            "Title": "IPCA Laboratories to Sell Tarapur Manufacturing Facility",
            "Summary": "IPCA Laboratories has announced the sale of its Tarapur manufacturing facility for 369 million rupees. This decision represents a significant corporate action that may impact the company's operations and financial position.",
            "Sentiment": "neutral",
            "PublishDate": 1743145550000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ipca Laboratories: Q3 Performance Exceeds Expectations, Analyst Raises Target Price",
            "Summary": "Ipca Laboratories reported better-than-expected Q3 FY25 results, outperforming the industry in domestic formulation market. Motilal Oswal has raised the target price for Ipca Labs, citing growth driven by India operations and Unichem.",
            "Sentiment": "positive",
            "PublishDate": 1739506358000,
            "Source": "earnings"
        },
        {
            "Title": "IPCA Labs Expands into Cosmeto Dermatology and Orthopedics",
            "Summary": "IPCA Labs is diversifying its product portfolio by developing new products in the cosmeto dermatology sector. The company has also launched a new division called Flexicare, which will focus on products used in orthopedics. These strategic moves indicate IPCA Labs' efforts to expand its market presence and product offerings.",
            "Sentiment": "positive",
            "PublishDate": 1739503453000,
            "Source": "corporate_action"
        },
        {
            "Title": "IPCA Labs Projects Margin Improvement and Strong EBITDA Outlook",
            "Summary": "IPCA Labs anticipates a margin improvement of 100 to 150 basis points over the next three to four years. While the overall guidance for the year was around 21%, the company now expects standalone EBITDA to remain in the range of 23% to 24% for the entire financial year, as revealed in a concall update.",
            "Sentiment": "positive",
            "PublishDate": 1739503376000,
            "Source": "earnings"
        },
        {
            "Title": "IPCA Labs Projects Strong EBITDA Margin for Financial Year",
            "Summary": "IPCA Labs has provided guidance on its expected EBITDA margin for the current financial year. The company anticipates an overall EBITDA margin of around 21%. However, for the entire financial year, IPCA Labs expects its EBITDA margin to be in the range of 23% to 24%, as stated during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1739503226000,
            "Source": "earnings"
        },
        {
            "Title": "IPCA Laboratories Reports Q3 Revenue Growth",
            "Summary": "IPCA Laboratories has announced its third-quarter revenue results. The company reported revenue of 22.4 billion rupees, compared to 20.5 billion rupees in the same quarter of the previous year, indicating year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1739432260000,
            "Source": "earnings"
        },
        {
            "Title": "IPCA Laboratories Reports Strong Q3 EBITDA Growth",
            "Summary": "IPCA Laboratories has reported a significant increase in its Q3 EBITDA, which rose to 4.63 billion rupees from 3.31 billion rupees year-over-year. This figure exceeded the estimated 4.20 billion rupees. The company's EBITDA margin also improved substantially, reaching 20.62% compared to 16.14% in the same period last year, surpassing the estimated 18%.",
            "Sentiment": "positive",
            "PublishDate": 1739432251000,
            "Source": "earnings"
        },
        {
            "Title": "IPCA Laboratories Reports Strong Q3 Profit Growth",
            "Summary": "IPCA Laboratories has announced its third-quarter consolidated net profit of 2.5 billion rupees, showing a significant increase from 1.8 billion rupees in the same period last year. The reported profit surpassed market estimates of 2.11 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739432174000,
            "Source": "earnings"
        },
        {
            "Title": "Ipca Laboratories: From Bollywood Accountant to Pharma Billionaire",
            "Summary": "Premchand Godha, once Amitabh Bachchan's CA, is now the Executive Chairman of Ipca Laboratories, a pharma company valued at over ₹21,000 crore. Godha, with a net worth of $1.7 billion, transformed Ipca from a struggling company in 1975 to a profitable enterprise, growing its revenue from ₹54 lakh to ₹4,422 crore over the years.",
            "Sentiment": "positive",
            "PublishDate": 1734852280000,
            "Source": "normal_news"
        },
        {
            "Title": "IPCA Laboratories Ltd: Promoter Sells 1.6% Stake, Stock Surges 6%",
            "Summary": "Usha Madhukar Chandurkar, a promoter of IPCA Labs, sold 40 lakh shares (1.6% stake) for ₹600 crore. The stock gained up to 6% on December 19, becoming the top gainer in the Nifty Pharma index. Promoter holding has decreased to 44.7% from 46.3%. The stock is up 44% in 2024, potentially its best performance since 2020.",
            "Sentiment": "positive",
            "PublishDate": 1734599493000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ipca Laboratories: Promoter Sells 1.6% Stake for Rs 600 Crore",
            "Summary": "Usha Madhukar Chandurkar, a promoter of Ipca Laboratories, sold 40 lakh shares (1.6% stake) at Rs 1,501.52 per share, totaling Rs 600.61 crore. This reduced promoter holding from 46.3% to 44.7%.",
            "Sentiment": "neutral",
            "PublishDate": 1734537213000,
            "Source": "block_deals"
        },
        {
            "Title": "IPCA Laboratories Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade of IPCA Laboratories Ltd. shares occurred on the National Stock Exchange (NSE). Approximately 743,560 shares were traded at a price of Rs. 1529.40 per share, totaling Rs. 113.72 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1734506066000,
            "Source": "block_deals"
        },
        {
            "Title": "Significant Block Trade of Ipca Laboratories Ltd Shares",
            "Summary": "A large block trade of Ipca Laboratories Ltd shares occurred on the Bombay Stock Exchange (BSE). Approximately 4,440,830 shares were traded at a price of Rs. 1520.40 per share, totaling Rs. 675.18 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1734506053000,
            "Source": "block_deals"
        },
        {
            "Title": "IPCA Laboratories Reports Highest Growth Among Pharmaceutical Companies in November IPM Data",
            "Summary": "According to the November Indian Pharmaceutical Market (IPM) data, IPCA Laboratories has recorded the highest growth rate among pharmaceutical companies. This indicates strong performance and market share gains for IPCA in the Indian pharmaceutical sector.",
            "Sentiment": "positive",
            "PublishDate": 1733889895000,
            "Source": "result"
        },
        {
            "Title": "Ipca Laboratories Closes Defunct Mexican Subsidiary",
            "Summary": "Ipca Laboratories has announced the voluntary closure of its non-operational wholly-owned subsidiary, Ipca Pharmaceuticals Ltd SA De CV, located in Mexico. The company stated that this closure will not have any impact on its business operations or financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1733357083000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ipca Laboratories Announces Closure of Mexican Subsidiary",
            "Summary": "Ipca Laboratories has announced the voluntary closure of its wholly-owned subsidiary, Ipca Pharmaceuticals Ltd SA de CV, located in Mexico. The company stated that this defunct subsidiary's closure will have no impact on its business operations or financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1733310937000,
            "Source": "corporate_action"
        },
        {
            "Title": "IPCA Laboratories Reports Improved Q2 Financial Performance",
            "Summary": "IPCA Laboratories has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 3.6 billion rupees to 4.4 billion rupees. Additionally, the EBITDA margin rose from 17.65% to 18.7%.",
            "Sentiment": "positive",
            "PublishDate": 1731570488000,
            "Source": "result"
        },
        {
            "Title": "IPCA Laboratories Reports Q2 Revenue Growth",
            "Summary": "IPCA Laboratories has announced its second quarter revenue for the current fiscal year. The company reported revenue of 23.55 billion rupees, compared to 20.4 billion rupees in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731570483000,
            "Source": "result"
        },
        {
            "Title": "IPCA Laboratories Reports Strong Q2 Profit Growth",
            "Summary": "IPCA Laboratories has announced its Q2 consolidated net profit of 2.3 billion rupees, compared to 1.45 billion rupees in the same quarter last year, representing a significant year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731570450000,
            "Source": "result"
        },
        {
            "Title": "IPCA Laboratories Block Trade on BSE",
            "Summary": "<p>A <span class='neutral'>significant</span> <span class='neutral'>block trade</span> of <b>IPCA Laboratories</b> shares occurred on the <b>Bombay Stock Exchange (BSE)</b>. Approximately <span class='neutral'>1,008,521 shares</span> were traded at a price of <span class='neutral'>Rs 1,626.3</span> per share, resulting in a total transaction value of <span class='positive'>Rs 164.02 crore</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728623394000,
            "Source": "block_deals"
        }
    ]
}