{
    "Symbol": "IPL",
    "ISIN": "INE0D6701023",
    "News": [
        {
            "Title": "India Pesticides Q3 FY26 Conference Call Recording",
            "Summary": "India Pesticides Limited makes Q3 FY26 earnings conference call recording available on company website following board approval of unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770879826017,
            "Source": "co_actions_results"
        },
        {
            "Title": "India Pesticides Q3FY26 earnings call on Feb 11",
            "Summary": "India Pesticides Limited has scheduled its Q3FY26 earnings conference call for February 11, 2026, at 12:30 PM IST to discuss unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770035154632,
            "Source": "co_actions_results"
        },
        {
            "Title": "India Pesticides Independent Director Completes Tenure",
            "Summary": "India Pesticides Limited announces completion of Mr. Adesh Kumar Gupta's first term as Independent Director on January 22, 2026, with cessation from all board committees.",
            "Sentiment": "neutral",
            "PublishDate": 1769067056045,
            "Source": "stocks"
        },
        {
            "Title": "India Pesticides Gets BSE Nod for ESOP Share Listing",
            "Summary": "India Pesticides Limited received in-principle approval from BSE for listing 28,79,088 equity shares under its Employee Stock Option Plan 2023, enabling employee stock option exercises.",
            "Sentiment": "positive",
            "PublishDate": 1768230427697,
            "Source": "co_actions_results"
        },
        {
            "Title": "India Pesticides Gets NSE Nod for ESOP Share Listing",
            "Summary": "India Pesticides Limited received in-principle approval from NSE to list 28.79 lakh equity shares under its Employee Stock Option Plan 2023, subject to compliance conditions.",
            "Sentiment": "positive",
            "PublishDate": 1768222978492,
            "Source": "co_actions_results"
        },
        {
            "Title": "India Pesticides Appoints New Independent Director",
            "Summary": "India Pesticides Limited's board approves appointment of Arun Kumar Jain as Additional Non-Executive Independent Director and sets postal ballot schedule for shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1768213042471,
            "Source": "stocks"
        },
        {
            "Title": "India Pesticides Appoints New Independent Director",
            "Summary": "India Pesticides Limited board approves appointment of Arun Kumar Jain as Additional Non-Executive Independent Director and initiates postal ballot process for shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1768212986271,
            "Source": "stocks"
        },
        {
            "Title": "India Pesticides Gets Australia Fungicide Registration",
            "Summary": "India Pesticides Limited secured regulatory approval for its fungicide formulation in Australia on December 26, 2025, marking a significant milestone in strengthening international presence and expected to enhance export revenues.",
            "Sentiment": "positive",
            "PublishDate": 1766745289170,
            "Source": "stocks"
        },
        {
            "Title": "India Pesticides Limited Receives Regulatory Approval for Herbicide Formulation in Serbia",
            "Summary": "India Pesticides Limited obtained approval for registration of its herbicide formulation in Serbia on 06-12-2025, marking expansion into the international market. The regulatory approval represents a significant milestone in strengthening the company's international presence and is expected to contribute to enhanced export revenues.",
            "Sentiment": "positive",
            "PublishDate": 1765023544628,
            "Source": "stock"
        },
        {
            "Title": "India Pesticides Reports 26% Revenue Growth to INR 579 Crores in H1 FY26",
            "Summary": "India Pesticides Limited achieved INR 579 crores revenue in H1 FY26 with 26% year-on-year growth, driven by doubled export sales to INR 140 crores and improved EBITDA margins at 18.6%. The company remains on track to meet its full-year revenue guidance of INR 1,000 crores while maintaining zero debt status and funding growth through internal accruals.",
            "Sentiment": "positive",
            "PublishDate": 1763553039575,
            "Source": "earnings"
        },
        {
            "Title": "India Pesticides Reports Quarterly Results and Re-appoints Two Independent Directors",
            "Summary": "India Pesticides Limited approved its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company reported standalone revenue from operations of Rs. 209.63 crores for the quarter and Rs. 412.87 crores for the half year. Profit after tax stood at Rs. 30.51 crores for the quarter and Rs. 62.61 crores for the half year. The board also approved the re-appointment of Dr. Madhu Dikshit and Mr. Mohan Vasant Tanksale as Non-Executive Independent Directors for a second term of five years, commencing from December 21, 2025 to December 20, 2030, subject to shareholder approval. The company received a notice from the Income Tax Department regarding undisclosed income for the block period April 2018 to February 2025 and has filed the return with tax payment of Rs. 0.18 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1762917942063,
            "Source": "corporate_governance"
        },
        {
            "Title": "India Pesticides Reports Strong Q2 Growth with 21% Rise in Net Profit",
            "Summary": "India Pesticides reported net profit of 320.4 million rupees for Q2, up from 264.8 million rupees in the same period last year. Revenue increased to 2.9 billion rupees from 2.29 billion rupees year-over-year. EBITDA rose to 491 million rupees compared to 339.3 million rupees previously, while EBITDA margin improved to 16.95% from 14.83% in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1762867582175,
            "Source": "earnings"
        },
        {
            "Title": "India Pesticides Limited Shareholders Approve Dr. Udaya Bhaskar Mantripragada as Whole-Time Director for Five Years",
            "Summary": "India Pesticides Limited shareholders approved the regularization of Dr. Udaya Bhaskar Mantripragada as Whole-Time Director and Key Managerial Personnel for a five-year term starting July 23, 2025, at their 40th Annual General Meeting held on August 19, 2025. The appointment was initially approved by the Board of Directors on July 23, 2025, based on the Nomination & Remuneration Committee's recommendation, subject to shareholder approval. Dr. Mantripragada brings over 35 years of experience in Synthetic Organic Chemistry, specializing in dyestuffs and agrochemicals. He holds advanced degrees including a PhD in Natural Products & Synthesis Chemistry and has published 33 international papers with 11 patents. He is not related to any directors, key managerial personnel, or promoters of the company and is not debarred from holding directorship by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1755604469436,
            "Source": "corporate_governance"
        },
        {
            "Title": "India Pesticides Limited's Statutory Auditor M/s Lodha & Co. Completes Five-Year Tenure",
            "Summary": "M/s Lodha & Co., Chartered Accountants completed their five-year tenure as Statutory Auditors of India Pesticides Limited at the conclusion of the company's 40th Annual General Meeting held on August 19, 2025. The auditing firm's tenure ended after serving their first term of five consecutive years. India Pesticides Limited informed stock exchanges BSE and NSE about the completion of the auditor's tenure, with the cessation date being August 19, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755603995487,
            "Source": "corporate_governance"
        },
        {
            "Title": "India Pesticides Reports 25.8% Revenue Growth in Q1 FY26, Targets Rs 1,000 Crores for the Year",
            "Summary": "India Pesticides Limited reported revenue of Rs 282 crores for the quarter ended June 30, 2025, marking a 25.8% year-on-year growth and 34% quarter-on-quarter increase. The company achieved EBITDA of Rs 52 crores with an 18.4% margin, expanding 4.17% year-on-year. Net profit stood at Rs 35 crores, up 79.2% year-on-year with a 12.3% margin. The growth was primarily volume-led, supported by sustained domestic demand and strategic product mix. The company successfully commissioned expanded PEDA intermediate facility, increasing capacity from 2,000 tons to 6,000 tons per annum, with further expansion to 8,500 metric tons planned for Q2 FY26. Formulation capacity was augmented by 3,500 MT per annum. Domestic revenue reached Rs 188 crores compared to Rs 143 crores in the previous year, while export revenue was Rs 87 crores versus Rs 77 crores. Pretilachlor sales contributed Rs 55 crores during the quarter. The company has planned capital expenditure of Rs 116 crores for FY26, with Rs 52 crores for existing facilities and Rs 64 crores for subsidiary Shalvis Specialties at Hamirpur. Management targets Rs 1,000 crores revenue for FY26 with EBITDA margins between 18-20%.",
            "Sentiment": "positive",
            "PublishDate": 1755344069213,
            "Source": "earnings"
        },
        {
            "Title": "India Pesticides Plans ₹116 Cr Capex for FY26 with Capacity Expansion",
            "Summary": "India Pesticides reported strong quarterly results and outlined an aggressive growth strategy. The company announced a ₹116 crore capex plan for FY26, focusing on strategic backward integration and capacity expansion at its Sandila and Hamirpur facilities. The expansion aims to strengthen the company's position in rice herbicides and drive margin-accretive growth in the global agrochemical market.",
            "Sentiment": "positive",
            "PublishDate": 1754665737053,
            "Source": "stock"
        },
        {
            "Title": "India Pesticides Limited Reports Quarterly Financial Results for Quarter Ended June 30, 2025",
            "Summary": "India Pesticides Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of ₹275.41 crores compared to ₹207.65 crores in the previous quarter and ₹220.36 crores in the same quarter last year. Profit after tax stood at ₹35.38 crores versus ₹22.33 crores in the previous quarter and ₹28.06 crores in the corresponding quarter of the previous year. On a consolidated basis, revenue from operations was ₹275.28 crores with profit after tax of ₹34.91 crores. Basic and diluted earnings per share for the quarter were ₹3.07 on a standalone basis and ₹3.03 on a consolidated basis. Other income for June 2025 included ₹2.29 crores received from settlement of an insurance claim under litigation since FY 2013-14. The company operates in the agro chemicals segment as its only operating segment.",
            "Sentiment": "positive",
            "PublishDate": 1754576492679,
            "Source": "earnings"
        },
        {
            "Title": "India Pesticides Limited Submits Business Responsibility and Sustainability Report for FY 2024-25",
            "Summary": "India Pesticides Limited has submitted its Business Responsibility and Sustainability Report for Financial Year 2024-25 to BSE and NSE as part of regulatory compliance with SEBI Listing Obligations. The comprehensive report covers the company's ESG initiatives across environmental, social, and governance aspects. Key highlights include the company's turnover of ₹829.02 crores and net worth of ₹903.44 crores. The pesticide manufacturer operates with 2 plants and 26 offices nationally, serving 18 states in India and exporting to 35 countries, with exports contributing 38% of total turnover. The company employs 1,040 permanent employees and 1,533 workers. The report details various sustainability initiatives including zero liquid discharge systems, renewable energy usage through biomass, waste management practices, and CSR projects worth ₹83 million focusing on community development and child safety. The company has implemented comprehensive policies covering all nine principles of National Guidelines on Responsible Business Conduct.",
            "Sentiment": "neutral",
            "PublishDate": 1753445737866,
            "Source": "corporate_action"
        },
        {
            "Title": "India Pesticides Limited Announces Rs. 65 Crore Investment for New Herbicide Material Production Project",
            "Summary": "India Pesticides Limited plans to implement a new project at its Sandila Plant to produce 4000 MT of 26 DEA, a key starting material for herbicides like Pretilachlor and Butachlor. The project requires an investment of approximately Rs. 65 crore, which will be funded through internal accruals. The company expects to complete the project by September 2026. The Board has given in-principal approval for this project. The initiative aims to enhance backward integration for herbicide production and support the Make in India initiative.",
            "Sentiment": "positive",
            "PublishDate": 1753279741573,
            "Source": "stock"
        },
        {
            "Title": "India Pesticides Limited Appoints Dr. Udaya Bhaskar Mantripragada as Whole-Time Director",
            "Summary": "India Pesticides Limited appointed Dr. Udaya Bhaskar Mantripragada as an Additional Director in the capacity of Whole-Time Director, effective July 23, 2025, for a five-year term subject to shareholder approval. Dr. Bhaskar brings over 35 years of experience in synthetic organic chemistry, specializing in dyestuffs, agrochemicals, and formulations. He holds advanced degrees including a PhD in Natural Products & Synthesis Chemistry and has published 33 international papers with 11 patents. Dr. Bhaskar has worked in top positions at agrochemical companies and has been instrumental in developing commercial technologies for fungicides, herbicides, and insecticides. He is not related to any directors, key managerial personnel, or promoters of the company and is not debarred from holding directorial positions.",
            "Sentiment": "positive",
            "PublishDate": 1753279280119,
            "Source": "corporate_governance"
        },
        {
            "Title": "India Pesticides Limited Whole-Time Director Rajendra Singh Sharma Resigns Due to Health Issues",
            "Summary": "Rajendra Singh Sharma has resigned from his position as Whole-Time Director of India Pesticides Limited, effective from the close of business hours on July 23, 2025. The resignation was due to health issues. Sharma, who holds DIN 02487797, submitted his resignation letter on July 23, 2025, which was accepted by the Board. In his resignation letter, Sharma expressed gratitude to the Board Members for their cooperation during his tenure as Director.",
            "Sentiment": "neutral",
            "PublishDate": 1753278860190,
            "Source": "corporate_governance"
        },
        {
            "Title": "India Pesticides Reports Q4 Financial Results",
            "Summary": "India Pesticides has announced its financial results for the fourth quarter. The company's net profit increased to 223.3 million rupees, compared to 10.3 million rupees in the same quarter last year and 173.6 million rupees in the previous quarter. Revenue for Q4 rose to 2.08 billion rupees from 1.27 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748304304000,
            "Source": "default"
        },
        {
            "Title": "India Pesticides Reports Strong Q4 Financial Results",
            "Summary": "India Pesticides has announced its Q4 financial results. The company's EBITDA increased to 320.9 million rupees from 38.8 million rupees year-over-year. The EBITDA margin improved to 15.45% from 3.07% in the same period. Revenue grew to 2.08 billion rupees from 1.27 billion rupees year-over-year. The company's standalone net profit rose to 223.3 million rupees, up from 10.3 million rupees year-over-year and 173.6 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748269155000,
            "Source": "result"
        },
        {
            "Title": "India Pesticides to Consider Q4 Results on May 26",
            "Summary": "India Pesticides Limited has announced that it will consider and approve its financial results for the fourth quarter on May 26.",
            "Sentiment": "neutral",
            "PublishDate": 1746791593000,
            "Source": "default"
        },
        {
            "Title": "India Pesticides Triples Pretilachlor Technical Production Capacity",
            "Summary": "India Pesticides Limited has announced a significant capacity enhancement for its Pretilachlor Technical product. The company has increased its production capacity from 2,000 MT to 6,000 MT per annum, effectively tripling its output potential for this agrochemical.",
            "Sentiment": "positive",
            "PublishDate": 1745972672000,
            "Source": "default"
        },
        {
            "Title": "India Pesticides Triples Pretilachlor Technical Production Capacity",
            "Summary": "India Pesticides has announced a significant capacity enhancement for its Pretilachlor Technical product. The company has increased its production capacity from 2,000 MT to 6,000 MT per annum, effectively tripling its output potential for this specific product.",
            "Sentiment": "positive",
            "PublishDate": 1745926850000,
            "Source": "default"
        },
        {
            "Title": "India Pesticides Reports Significant Pretilachlor Production Capacity",
            "Summary": "India Pesticides Limited has announced that it possesses a substantial production capacity for Pretilachlor, a widely used herbicide, within India. This information suggests that the company has a strong position in the domestic market for this particular agricultural chemical.",
            "Sentiment": "positive",
            "PublishDate": 1742809192000,
            "Source": "corporate_action"
        },
        {
            "Title": "India Pesticides Reports Decline in Q3 EBITDA",
            "Summary": "India Pesticides has reported a decrease in its third-quarter EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). The company's EBITDA for Q3 stood at 274 million rupees, down from 336 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin percentage has declined compared to the 22.22% reported in the corresponding quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1739012319000,
            "Source": "earnings"
        },
        {
            "Title": "India Pesticides Reports Q3 Financial Results",
            "Summary": "India Pesticides has announced its financial results for the third quarter. The company reported a net profit of 174 million rupees, down from 244.1 million rupees in the same period last year. However, revenue increased to 1.7 billion rupees from 1.51 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739012313000,
            "Source": "earnings"
        },
        {
            "Title": "Income Tax Department Conducts Search at India Pesticides Premises",
            "Summary": "India Pesticides Limited has reported that the Income Tax Department is conducting a search operation at the company's registered office and other premises. The nature and purpose of the search have not been specified in the available information.",
            "Sentiment": "negative",
            "PublishDate": 1734339172000,
            "Source": "corporate_governance"
        },
        {
            "Title": "India Pesticides to Launch New Products in FY '26",
            "Summary": "India Pesticides has announced plans to launch two new products. The first product is expected to be introduced in the first quarter of fiscal year 2026, with a second product scheduled for release in the following quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731295777000,
            "Source": "corporate_action"
        },
        {
            "Title": "India Pesticides Plans INR 100-110 Crore CAPEX for FY '25",
            "Summary": "India Pesticides Limited (IPL) has announced plans to invest INR 100-110 crores in capital expenditure for the fiscal year 2025. This investment will be shared between IPL and its subsidiary, SSL. The announcement was made during a company conference call.",
            "Sentiment": "positive",
            "PublishDate": 1731295599000,
            "Source": "corporate_action"
        },
        {
            "Title": "India Pesticides Projects Revenue Growth from Hamirpur Facility",
            "Summary": "India Pesticides expects to generate revenue of INR 50-60 crores from its Hamirpur facility in FY '26. The company aims to maintain its profit margins while passing on raw material cost reductions to customers, as stated in a recent conference call.",
            "Sentiment": "positive",
            "PublishDate": 1731295375000,
            "Source": "corporate_action"
        },
        {
            "Title": "India Pesticides Reports Improved Q2 EBITDA and Margin",
            "Summary": "India Pesticides has announced its Q2 financial results. The company's EBITDA increased to 329 million rupees from 277 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 14.37% from 13.71% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730900352000,
            "Source": "result"
        },
        {
            "Title": "India Pesticides Reports Q2 Financial Results",
            "Summary": "India Pesticides has announced its financial results for the second quarter. The company's net profit increased to 265 million rupees, up from 198 million rupees year-over-year and 201 million rupees quarter-over-quarter. Revenue for Q2 rose to 2.3 billion rupees, compared to 2.02 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730900282000,
            "Source": "result"
        }
    ]
}