{
    "Symbol": "IRB",
    "ISIN": "INE821I01022",
    "News": [
        {
            "Title": "IRB Infrastructure Reports 15% YoY Toll Revenue Growth",
            "Summary": "IRB Infrastructure Developers Limited achieved approximately 15% year-on-year growth in aggregate toll revenue for January 2026, with collections reaching Rs. 7,503 million compared to Rs. 6,502 million in January 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770377854020,
            "Source": "co_actions_results"
        },
        {
            "Title": "IRB Infrastructure Board Meet on Feb 13 for Q3 Results",
            "Summary": "IRB Infrastructure Developers has scheduled its board meeting for February 13, 2026, to consider Q3FY26 financial results, interim dividend declaration, and potential bonus share issuance.",
            "Sentiment": "neutral",
            "PublishDate": 1770288758009,
            "Source": "co_actions_results"
        },
        {
            "Title": "IRB Infrastructure Completes Gandeva Project Transfer",
            "Summary": "IRB Infrastructure Developers completes transfer of Gandeva Ena Ham project, receives ₹513 crores from equity investment and plans to reduce consolidated debt by ₹700 crores.",
            "Sentiment": "positive",
            "PublishDate": 1770042293708,
            "Source": "co_actions_results"
        },
        {
            "Title": "IRB Infrastructure Signs TOT-17 Project Agreement",
            "Summary": "IRB Infrastructure Developers enters into agreement with IRB Harihara Corridors to serve as project manager for the TOT-17 infrastructure project, expanding its project management portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1768826504793,
            "Source": "stocks"
        },
        {
            "Title": "IRB Infrastructure Auditor Converts to LLP Structure",
            "Summary": "IRB Infrastructure Developers announces that its statutory auditor M S K A & Associates has converted from a firm to Limited Liability Partnership under LLP Act 2008, now operating as M S K A & Associates LLP.",
            "Sentiment": "neutral",
            "PublishDate": 1768470127338,
            "Source": "stocks"
        },
        {
            "Title": "IRB Sindhudurg Airport Gets DGCA Nod for 24x7 Operations",
            "Summary": "IRB Infrastructure's Sindhudurg Airport receives DGCA approval for round-the-clock all-weather operations with IFR certification. December saw record 11,000 passenger movements with expanded parking capacity.",
            "Sentiment": "positive",
            "PublishDate": 1767430710317,
            "Source": "stocks"
        },
        {
            "Title": "IRB Infrastructure: Cintra Releases Share Encumbrance",
            "Summary": "Cintra INR Investments B.V. released encumbrance on 6.04 crore equity shares (10% stake) of IRB Infrastructure Developers Limited on December 30, 2025, while maintaining 19.86% voting rights.",
            "Sentiment": "positive",
            "PublishDate": 1767112753414,
            "Source": "co_actions_results"
        },
        {
            "Title": "IRB Infra Promoter Creates Share Encumbrance",
            "Summary": "IR Holding Private Limited creates encumbrance on 17.08 crore shares of IRB Infrastructure Developers under letter agreement dated December 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766747873297,
            "Source": "stocks"
        },
        {
            "Title": "IRB Infrastructure: GIC Releases Encumbrance on Shares",
            "Summary": "IRB Infrastructure Developers disclosed that GIC released encumbrance on 41.07 crore equity shares (6.8% stake) while maintaining 19.14% voting rights through Bricklayers Investment.",
            "Sentiment": "positive",
            "PublishDate": 1766581699995,
            "Source": "co_actions_results"
        },
        {
            "Title": "IRB Infrastructure Trust Wins TOT-18 Highway Project",
            "Summary": "IRB Infrastructure Trust emerges as preferred bidder for ₹3,087 crore Chandikhole-Bhadrak highway project in Odisha, expanding group's footprint to 13 states with 6th TOT project win.",
            "Sentiment": "positive",
            "PublishDate": 1766479206360,
            "Source": "co_actions_results"
        },
        {
            "Title": "IRB Infrastructure Gets CRISIL AA- Rating Reaffirmed",
            "Summary": "CRISIL Ratings has reaffirmed its CRISIL AA-/Stable long-term and CRISIL A1+ short-term ratings on IRB Infrastructure Developers' ₹1,700 crore bank facilities, maintaining stable outlook.",
            "Sentiment": "positive",
            "PublishDate": 1765436677782,
            "Source": "stocks"
        },
        {
            "Title": "LIC Increases Stake in IRB Infrastructure Developers to 5.004%",
            "Summary": "Life Insurance Corporation of India acquired 9,00,000 shares of IRB Infrastructure Developers Ltd through open market purchase, increasing its shareholding from 4.989% to 5.004%. The transaction was completed on November 28, 2025, triggering disclosure requirements under SEBI regulations for substantial shareholding.",
            "Sentiment": "neutral",
            "PublishDate": 1764598733875,
            "Source": "corporate_action"
        },
        {
            "Title": "IRB Infrastructure Developers Sells Complete VM7 Expressway Stake to IRB InvIT Fund",
            "Summary": "IRB Infrastructure Developers has approved the complete sale of its stake in VM7 Expressway Private Limited to IRB InvIT Fund. The transaction represents a full divestment of the expressway asset to the company's infrastructure investment trust.",
            "Sentiment": "positive",
            "PublishDate": 1764596031631,
            "Source": "order&deals"
        },
        {
            "Title": "IRB Infra's Investment Fund Asked to Consider VM7 Expressway Project Acquisition",
            "Summary": "IRB Infra's investment fund has been requested to evaluate the acquisition of the VM7 Expressway project following board approval. The potential acquisition represents an expansion opportunity for the infrastructure company's investment portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1763640482945,
            "Source": "order&deals"
        },
        {
            "Title": "IRB Infra Secures Rs 9,270 Crore NHAI Order, Expects 18-20% Revenue Growth",
            "Summary": "IRB Infrastructure won a Rs 9,270 crore 20-year project from NHAI, expected to boost toll revenue by 8-10% and close by end of current financial year. The company anticipates overall revenue growth of 18-20% from next financial year, strengthening its position toward Rs 1 lakh crore asset base with comfortable debt-equity ratio of 0.6x.",
            "Sentiment": "positive",
            "PublishDate": 1763365399167,
            "Source": "stock"
        },
        {
            "Title": "IRB Infrastructure Trust Wins ₹9,270 Crore NHAI Highway Project",
            "Summary": "IRB Infrastructure Trust secured the TOT-17 bundle covering 366 km of highways in Uttar Pradesh with an upfront payment of ₹9,270 crore for a 20-year concession period. The project increases the Trust's asset portfolio by 20% to ₹65,000 crore and gives it a 42% market share in the TOT space, with IRB Infrastructure Developers acting as project manager.",
            "Sentiment": "positive",
            "PublishDate": 1763184152188,
            "Source": "order&deals"
        },
        {
            "Title": "IRB Infrastructure Reports 41% Jump in Q2 Net Profit, Declares 7% Interim Dividend",
            "Summary": "IRB Infrastructure Developers Limited reported a 41% year-on-year increase in net profit for Q2, rising from Rs. 100 crores to Rs. 141 crores. Total income grew 3% from Rs. 1,752 crores to Rs. 1,800 crores. The company declared a second interim dividend of 7% (Re. 0.07 per equity share) for FY 2025-26, with record date November 18, 2025. Toll revenue registered 11% growth at Rs. 1,667 crores versus Rs. 1,503 crores in the previous year. The company successfully completed asset transfers between its sponsored InvITs, unlocking approximately Rs. 5,000 crores of equity value. IRB received Provisional COD for its 8-lane Gandeva Ena Expressway project under the Hybrid Annuity Model in Gujarat.",
            "Sentiment": "positive",
            "PublishDate": 1762936367977,
            "Source": "earnings"
        },
        {
            "Title": "IRB Infrastructure Developers Reports Strong Q2 Performance with 41% Jump in Net Profit",
            "Summary": "IRB Infrastructure Developers reported quarterly net profit of 1.41 billion rupees compared to 999 million rupees in the same period last year. The company's EBITDA increased to 9.24 billion rupees from 7.7 billion rupees year-over-year. EBITDA margin improved to 52.8% versus 48.35% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762934582229,
            "Source": "earnings"
        },
        {
            "Title": "IRB Infrastructure Developers to Announce Q2 FY26 Results on November 12, 2025",
            "Summary": "IRB Infrastructure Developers Ltd. will announce its second quarter and half-year results for the period ended September 30, 2025, on November 12, 2025. The results will be available on the company's website. The company will conduct an earnings call on November 14, 2025, at 4:30 p.m. IST with a duration of 45 minutes. Investors and analysts can participate through provided telephone numbers or pre-register online. A transcript of the earnings call will be available by November 21, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762859422672,
            "Source": "earnings"
        },
        {
            "Title": "IRB Infrastructure Developers Reports 9% Annual Growth in October Toll Collections",
            "Summary": "IRB Infrastructure Developers announced a 9% year-on-year increase in gross toll collection for October 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762783183131,
            "Source": "stock"
        },
        {
            "Title": "IRB Infrastructure Fund Acquires Three Highway Projects for ₹8,436 Crore",
            "Summary": "IRB Infrastructure Developers' fund has acquired three highway projects valued at ₹8,436 crore. Following this acquisition, the fund's total assets have expanded to nine projects with a combined worth of ₹16,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1762439943949,
            "Source": "stock"
        },
        {
            "Title": "IRB Infrastructure Signs ₹4,466 Crore Project Management Deal with IRB InvIT Fund",
            "Summary": "IRB Infrastructure Developers has signed agreements with IRB InvIT Fund for project management services. The deal covers three projects - HMTL, KTL, and KGTL - with a total value of ₹4,466 crores spanning 20 years.",
            "Sentiment": "positive",
            "PublishDate": 1761745158758,
            "Source": "stock"
        },
        {
            "Title": "IRB InvIT Fund Raises Rs 3,248 Crore Through Institutional Placement to Acquire Highway Assets",
            "Summary": "IRB InvIT Fund completed its first fundraising since its 2017 listing, raising Rs 3,248.43 crore through an institutional placement of units, exceeding the initial target of Rs 3,000 crore. The fund issued 54.14 crore units at Rs 60 per unit to institutional investors including Anahera Investment Pte Ltd, Kotak Mahindra Bank Limited, and CIM Investment Fund ICAV. The proceeds will partly fund the acquisition of three BOT highway assets - Hapur-Moradabad, Kaithal-Rajasthan Border, and Kishangarh-Gulabpura - from IRB Infrastructure Trust. Post-acquisition, the InvIT will operate nine highway assets with an enterprise value exceeding Rs 16,000 crore and 4,225 operational lane kilometres. The weighted average life of assets will increase from 14 years to 17 years. IRB Infrastructure Trust is expected to receive approximately Rs 4,905 crore as equity consideration, enabling it to pursue new highway projects worth over Rs 15,000 crore. IRB Infrastructure Developers Limited sponsors the InvIT Fund and holds approximately 16% stake.",
            "Sentiment": "positive",
            "PublishDate": 1760499607407,
            "Source": "stock"
        },
        {
            "Title": "IRB Infrastructure Receives Approval for 7.53 Billion Rupee Investment in IRB InvIT Fund",
            "Summary": "IRB Infrastructure has obtained approval to invest up to 7.53 billion rupees in IRB InvIT Fund. The approval enables the infrastructure company to proceed with this substantial investment in the investment trust fund.",
            "Sentiment": "positive",
            "PublishDate": 1759930158399,
            "Source": "stock"
        },
        {
            "Title": "Moody's Confirms IRB Infra's Ba1 Corporate Rating with Stable Outlook",
            "Summary": "Moody's has confirmed IRB Infra's long-term corporate family rating at Ba1 with a stable outlook. The rating agency also maintained the Ba2 rating for the company's USD senior secured notes due 2032.",
            "Sentiment": "positive",
            "PublishDate": 1759913477164,
            "Source": "stock"
        },
        {
            "Title": "IRB Infra Reports 11% Growth in September Toll Collection to ₹557 Crores",
            "Summary": "IRB Infra reported toll collection of ₹557 crores for September, marking an 11% increase from ₹502 crores in the same period last year. The growth demonstrates improved performance in the company's toll collection operations.",
            "Sentiment": "positive",
            "PublishDate": 1759843990801,
            "Source": "stock"
        },
        {
            "Title": "IRB Infrastructure Trust Agrees to Transfer Three Project SPVs Worth INR 8,436 Crore to IRB InvIT Fund",
            "Summary": "IRB Infrastructure Trust has executed a share purchase agreement with IRB InvIT Fund for the transfer of three Project SPVs valued at INR 8,436 crore. The transaction involves the transfer of special purpose vehicles between the infrastructure trust and the InvIT fund.",
            "Sentiment": "neutral",
            "PublishDate": 1759414086324,
            "Source": "order&deals"
        },
        {
            "Title": "IRB Infrastructure Reports 9% Toll Growth Despite Monsoon Impact, Maintains ₹72 Target Price",
            "Summary": "IRB Infrastructure Developers, now part of Ferrovial & GIC group, reported improved toll growth of 9% year-to-date despite early monsoon arrival, with August 2025 tolls rising 12% year-over-year. The growth was driven by the company's private Infrastructure Trust assets. Toll revenue from the Mumbai-Pune expressway increased 5% compared to sub-2.5% in the previous year, while other roads saw 10% toll revenue growth. The company's IRB Public InvIT received minority shareholder approval to transform into a high-yield growth annuity, with CCI approving GIC-backed fund investment. IRB won concessions worth $1.9 billion over FY23-24 and aims to participate in the National Monetisation Pipeline. Analysts maintain a ₹72 target price against current market price of ₹40.83, citing potential from equity releveraging.",
            "Sentiment": "positive",
            "PublishDate": 1759160033046,
            "Source": "stock"
        },
        {
            "Title": "IRB Infra Reports 12% Growth in August 2025 Toll Revenues to ₹563 Crore",
            "Summary": "IRB Infra achieved toll revenues of ₹563 crore in August 2025, marking approximately 12% year-on-year growth. The infrastructure company's toll collection business showed positive momentum during the month.",
            "Sentiment": "positive",
            "PublishDate": 1757333573350,
            "Source": "stock"
        },
        {
            "Title": "IRB Infrastructure's VM7 Expressway Subsidiary Receives Provisional Completion Certificate for Gujarat Expressway Project",
            "Summary": "IRB Infrastructure Developers announced that its wholly-owned subsidiary VM7 Expressway Private Limited received a Provisional Completion Certificate for constructing an eight-lane expressway section from Gandeva to Ena in Gujarat. The project spans 27.5 kilometers and is part of the Delhi-Mumbai Greenfield Expressway under the Bharatmala Pariyojana Phase I. The subsidiary completed 25.07 kilometers of the total project length and is now eligible to receive bi-annual annuity payments from NHAI for a 15-year operation period. The project is expected to generate approximately Rs. 180 crores annually in annuity payments. This marks IRB's second operational Hybrid Annuity Mode project on the Delhi-Mumbai Expressway, following the earlier Vadodara-Kim stretch project.",
            "Sentiment": "positive",
            "PublishDate": 1756127949588,
            "Source": "stock"
        },
        {
            "Title": "IRB Infrastructure Expects Double-Digit Toll Collection Growth with Ganga Project Launch",
            "Summary": "IRB Infrastructure anticipates double-digit growth in toll collections with the upcoming launch of its Ganga project in the second half of the year. The Mumbai-based highway construction firm reported quarterly results showing revenue of ₹2,099 crore, margins of 45.35%, and net profit of ₹202 crore. The company expects around ₹4,000 crore revenue for its construction segment and maintains a healthy order book of approximately ₹30,000 crore. Director Anil Yadav indicated toll collection growth of 10-12%, supported by the Palsit-Dankuni project becoming fully operational in July and the upcoming Ganga project. The company expects muted order inflows in the first half to improve in the second half, with potential opportunities from BOT projects worth ₹40,000-45,000 crore and monetisation programs. IRB's stock has declined 29% over the last year, currently trading at ₹45.57 with a market capitalisation of ₹27,519 crore.",
            "Sentiment": "positive",
            "PublishDate": 1755495991875,
            "Source": "earnings"
        },
        {
            "Title": "IRB Infrastructure Q1 FY26 Net Profit Surges 45% to Rs 202 Crores, Declares 7% Interim Dividend",
            "Summary": "IRB Infrastructure Developers Limited reported a 45% increase in net profit to Rs 202 crores for Q1 FY26 compared to Rs 140 crores in Q1 FY25. The company's board approved consolidated and standalone unaudited financial results for the quarter ended June 30, 2025. Total consolidated income rose 10% year-on-year to Rs 2,165 crores from Rs 1,972 crores. The board declared an interim dividend of Re 0.07 per equity share (7% of face value) for FY 2025-26, with a record date of August 29, 2025, and payment by September 12, 2025. Combined toll revenue of the company and its Private InvIT increased 8% to Rs 1,680 crores from Rs 1,555 crores in the previous year. IRB Infrastructure Trust announced distribution of approximately Rs 53 crores for Q1 FY26, with the company's share being around Rs 27 crores. The company's 27th Annual General Meeting is scheduled for September 18, 2025, through video conferencing.",
            "Sentiment": "positive",
            "PublishDate": 1755161983275,
            "Source": "earnings"
        },
        {
            "Title": "IRB Infrastructure Developers Reports Strong Q1 Growth with 43% Jump in Net Profit",
            "Summary": "IRB Infrastructure Developers reported quarterly net profit of ₹2 billion, up from ₹1.4 billion year-over-year. Revenue increased to ₹20.99 billion from ₹18.5 billion in the same period last year. EBITDA rose to ₹9.52 billion compared to ₹8.57 billion year-over-year, though EBITDA margin declined slightly to 45.36% from 46.25%. The company's O&M order book is expected to reach ₹30,900 crores, representing an increase of approximately ₹3,100 crores following asset transfers from its sponsored private InvIT to public InvIT.",
            "Sentiment": "positive",
            "PublishDate": 1755161311990,
            "Source": "earnings"
        },
        {
            "Title": "IRB Infrastructure Reports 10% Growth in July 2025 Toll Revenue",
            "Summary": "IRB Infrastructure Developers Limited reported toll revenue of Rs. 548 crores for July 2025, representing a 10% increase compared to Rs. 499 crores in July 2024. The revenue comes from 17 toll road projects operated through wholly-owned subsidiaries and joint venture entities under IRB Infrastructure Trust. The company's MP Expressway project generated the highest revenue at Rs. 147.6 crores, followed by Ahmedabad Vadodara Super Express Tollway at Rs. 67.5 crores and Golconda Expressway at Rs. 70.9 crores. Deputy CEO Amitabh Murarka noted strong performance despite seasonal monsoon impacts and expressed optimism for continued growth momentum with the upcoming festive season expected to boost traffic volumes.",
            "Sentiment": "positive",
            "PublishDate": 1754479760553,
            "Source": "stock"
        },
        {
            "Title": "IRB Infra's Palsit Dankuni Project Receives Completion Certificate",
            "Summary": "IRB Infra has been awarded a completion certificate for its Palsit Dankuni Project. This certification is expected to result in an increase of ₹100 crore in annual toll revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1752545463000,
            "Source": "default"
        },
        {
            "Title": "IRB Infrastructure Developers: Q1 FY26 Toll Revenue Grows 8% to ₹1,680 Crore",
            "Summary": "IRB Infrastructure Developers and its InvIT joint venture reported combined toll revenue of ₹1,680 crore for Q1 FY26, up 8% YoY. June 2025 toll collections increased 5% YoY to ₹544.8 crore, despite early monsoon impact. Q4 FY25 saw 14% YoY net profit growth to ₹215 crore, with FY25 net profit up 12% to ₹677 crore.",
            "Sentiment": "positive",
            "PublishDate": 1752240363000,
            "Source": "earnings"
        },
        {
            "Title": "IRB Infra Reports 8% YoY Toll Revenue Growth in Q1 FY26",
            "Summary": "IRB Infrastructure has reported an 8% year-over-year increase in toll revenue for the first quarter of fiscal year 2026, despite challenges posed by monsoon conditions. The company managed to achieve growth in its toll collection business even in the face of adverse weather.",
            "Sentiment": "positive",
            "PublishDate": 1752238047000,
            "Source": "default"
        },
        {
            "Title": "IRB InvIT: Unitholders Approve ₹8,436 Crore Road SPV Acquisition",
            "Summary": "IRB InvIT Fund received unitholder approval to acquire 100% equity in three road project SPVs from IRB Infrastructure Trust for ₹8,436 crore. Unitholders also approved the appointment of IRB Infrastructure Developers as project manager for O&M. The acquisitions are expected to expand the Sponsor's O&M order book by ₹3,100 crore.",
            "Sentiment": "positive",
            "PublishDate": 1751624137000,
            "Source": "corporate_action"
        },
        {
            "Title": "IRB Infrastructure: 9% YoY Growth in May Toll Revenue",
            "Summary": "IRB Infrastructure Developers and IRB Infrastructure Trust reported a 9% year-on-year growth in toll revenue for May 2025, reaching Rs 581 crore. The growth is attributed to the vacation season, despite minor impact from pre-monsoon rains. The company expects continued growth supported by new vehicle additions and upcoming project completions.",
            "Sentiment": "positive",
            "PublishDate": 1749526949000,
            "Source": "result"
        },
        {
            "Title": "IRB Infrastructure: Toll Revenue Rises 9% to ₹581 Crore in May",
            "Summary": "IRB Infrastructure reported a 9% year-on-year increase in toll revenue to ₹581 crore for May 2025. The growth is attributed to the vacation season, with the IRB MP Expressway in Maharashtra being the largest contributor at ₹159.5 crore. The company expects continued growth, supported by new vehicle additions and upcoming project completions.",
            "Sentiment": "positive",
            "PublishDate": 1749481313000,
            "Source": "earnings"
        },
        {
            "Title": "IRB Infra Developers Reports Increased Toll Revenue for May",
            "Summary": "IRB Infra Developers has reported toll revenue of ₹5.81 billion for May, showing an increase from ₹5.36 billion in the same period last year. This represents a year-over-year growth in the company's toll collection.",
            "Sentiment": "positive",
            "PublishDate": 1749468845000,
            "Source": "default"
        },
        {
            "Title": "IRB Infrastructure Developers: Targets Rs 1.4 Lakh Crore Asset Base by 2027",
            "Summary": "IRB Infrastructure plans to achieve a Rs 1.4 lakh crore asset base in three years through its BEST strategy. The company is transferring three BOT highway assets to IRB InvIT Fund for Rs 4,905 crore, which will be reinvested in new projects worth Rs 15,000 crore. IRB aims to execute orders with Rs 3,800-4,000 crore revenue potential by FY26, supported by a Rs 31,000 crore order book.",
            "Sentiment": "positive",
            "PublishDate": 1748911903000,
            "Source": "corporate_action"
        },
        {
            "Title": "IRB Infrastructure: ₹8,450 Crore Highway Assets Transfer to InvIT Arm",
            "Summary": "IRB Infrastructure Developers to transfer three BOT highway assets valued at ₹8,450 crore to IRB InvIT Fund by Q2 FY26. The assets span 1,800 lane kilometres with an equity value of ₹4,905 crore. This move aims to enhance IRB InvIT Fund's portfolio and extend its weighted average life.",
            "Sentiment": "positive",
            "PublishDate": 1748680072000,
            "Source": "corporate_action"
        },
        {
            "Title": "IRB Infrastructure: Major Asset Transfer to IRB InvIT Fund",
            "Summary": "IRB Infrastructure's associate to transfer three BOT highway assets worth ₹8,450 crore to IRB InvIT Fund. The equity value is ₹4,905 crore. Proceeds will fund ₹15,000 crore worth of upcoming projects. The group aims to expand its asset base from ₹80,000 crore to ₹1,40,000 crore in three years.",
            "Sentiment": "positive",
            "PublishDate": 1748625447000,
            "Source": "corporate_action"
        },
        {
            "Title": "IRB Infrastructure Developers Approves Project Agreements Worth ₹4,466 Crore",
            "Summary": "IRB Infrastructure Developers has approved project implementation agreements valued at ₹4,466 crore. The company has not provided specific details about the nature of these projects or their timelines.",
            "Sentiment": "positive",
            "PublishDate": 1748623905000,
            "Source": "default"
        },
        {
            "Title": "IRB Infrastructure Developers Limited: Toll Revenue Expected to Grow in Low Double Digits for FY25",
            "Summary": "IRB Infrastructure anticipates low double-digit toll revenue growth for FY25, following a 23% increase in FY24. The company maintains a 10% market share in India's tolling business. Two new TOT projects have exceeded initial estimates. Construction revenue contributes 15% to overall mix, with a focus on core asset business. The company aims to expand its asset base from ₹80,000 crore to ₹140,000 crore in three years.",
            "Sentiment": "positive",
            "PublishDate": 1747728525000,
            "Source": "earnings"
        },
        {
            "Title": "IRB Infrastructure Developers Reports Q4 Financial Results",
            "Summary": "IRB Infrastructure Developers has announced its Q4 consolidated financial results. The company reported a net profit of 2.15 billion rupees, compared to 1.89 billion rupees in the same quarter last year. Revenue for Q4 stood at 21.49 billion rupees, up from 20.61 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747700313000,
            "Source": "default"
        },
        {
            "Title": "IRB Infrastructure Developers Reports Q4 Financial Results",
            "Summary": "IRB Infrastructure Developers has announced its Q4 financial results. The company's EBITDA increased to 9.98 billion rupees from 8.9 billion rupees year-over-year. The EBITDA margin improved to 46.43% from 43.17% in the same period. Revenue rose to 21.49 billion rupees from 20.61 billion rupees year-over-year. The consolidated net profit for Q4 reached 2.15 billion rupees, up from 1.89 billion rupees year-over-year, but down from 60.26 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747664825000,
            "Source": "result"
        },
        {
            "Title": "IRB Infrastructure Developers: Q4 Profit Rises 14%, Margin Expands",
            "Summary": "IRB Infrastructure Developers reported a 14% increase in consolidated net profit to Rs 215 crore for Q4 FY25. Revenue grew 4.3% to Rs 2,149 crore, while EBITDA rose 12% to Rs 998 crore. The company's margin expanded to 46.4% from 43.2% year-over-year. Toll revenue growth outpaced national average at 23%.",
            "Sentiment": "positive",
            "PublishDate": 1747652940000,
            "Source": "earnings"
        },
        {
            "Title": "IRB Infrastructure Developers Reports Strong Toll Revenue Growth",
            "Summary": "IRB Infrastructure Developers announced significant growth in toll revenue for the fiscal year 2024-25 and March 2025. The company reported a 23% year-over-year increase in gross toll revenue for FY 2024-25, and a 16% year-over-year increase for March 2025 specifically.",
            "Sentiment": "positive",
            "PublishDate": 1744157337000,
            "Source": "result"
        }
    ]
}