{
    "Symbol": "IRCON",
    "ISIN": "INE962Y01021",
    "News": [
        {
            "Title": "IRCON Q3FY26 Results: Revenue Down 20%, Profit Falls 35%",
            "Summary": "IRCON International reported Q3FY26 standalone revenue of ₹1,965.35 crore, down from ₹2,470.35 crore YoY. Net profit declined to ₹91.18 crore from ₹140.65 crore. Board approved interim dividend of ₹1.20 per share.",
            "Sentiment": "negative",
            "PublishDate": 1770810918849,
            "Source": "co_actions_results"
        },
        {
            "Title": "IRCON Board Addresses Exchange Fines, Appoints New KMP",
            "Summary": "IRCON International's board discussed fines imposed by NSE and BSE for Q2FY26 non-compliance with board composition regulations and designated Shri Sudhir Singh as Key Managerial Personnel.",
            "Sentiment": "neutral",
            "PublishDate": 1770141537882,
            "Source": "stocks"
        },
        {
            "Title": "IRCON Appoints Foreign Branch Auditors for FY26",
            "Summary": "IRCON International has appointed statutory foreign branch auditors for FY 2025-26 across four countries - Bangladesh, Sri Lanka, Algeria, and Myanmar, following C&AG approval on 13th January, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768296926907,
            "Source": "stocks"
        },
        {
            "Title": "IRCON Appoints Sudhir Singh as Director (Projects)",
            "Summary": "IRCON International formally appoints Shri Sudhir Singh as Director (Projects) effective January 2, 2026, following Ministry of Railways order and Board approval.",
            "Sentiment": "positive",
            "PublishDate": 1767190371028,
            "Source": "stocks"
        },
        {
            "Title": "IRCON Director (Projects) Anand Kumar Singh Retires",
            "Summary": "IRCON International announces cessation of Shri Anand Kumar Singh from Director (Projects) position due to superannuation on December 31, 2025, following Railway Board guidelines.",
            "Sentiment": "neutral",
            "PublishDate": 1767189290885,
            "Source": "stocks"
        },
        {
            "Title": "Ircon International breaks downward trendline resistance",
            "Summary": "Ircon International stock breaks out from downward-sloping trendline on daily charts, opening room for upward movement. Experts suggest target of ₹220 for high-risk traders in 2-3 months.",
            "Sentiment": "positive",
            "PublishDate": 1767094871151,
            "Source": "stocks"
        },
        {
            "Title": "IRCON International Reports Q2 FY26 Results with Margin Pressure Amid Competitive Market",
            "Summary": "IRCON International reported total revenue of Rs. 2,112 crore and PAT of Rs. 137 crore for Q2 FY26, with order book standing at Rs. 23,865 crore as of September 30, 2025. The company faced margin compression due to competitive pricing pressures and losses in certain projects, though it secured over Rs. 4,000 crore in new orders during the first half and expects full-year revenue of Rs. 10,000-11,000 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1763361945593,
            "Source": "earnings"
        },
        {
            "Title": "Ircon International Provides FY26-27 Revenue and Margin Guidance",
            "Summary": "Ircon International targets INR 4,000 crores order inflows in second half of FY26 and expects consolidated operating revenue of INR 10,000-11,000 crores for FY26, maintaining similar levels around INR 10,000 crores for FY27. The company anticipates PAT margins in the 6-7% range going forward, with a 0.5-1% margin reduction on normal projects due to lower margins on new project wins.",
            "Sentiment": "neutral",
            "PublishDate": 1763092596259,
            "Source": "stock"
        },
        {
            "Title": "IRCON International Reports Quarterly Results and Declares Interim Dividend",
            "Summary": "IRCON International Limited published its unaudited financial results for the quarter and half year ended September 30, 2025, as approved by the Board on November 12, 2025. The company declared an interim dividend of Rs. 5.00 per equity share for FY 2025-26, with the record date fixed as Friday, November 29, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763061976589,
            "Source": "earnings"
        },
        {
            "Title": "Ircon International Reports Decline in Revenue and Profit for Q2 and H1 FY26",
            "Summary": "Ircon International Limited, a Navratna public sector enterprise under the Ministry of Railways, announced its financial results for the second quarter and six months ended September 30, 2025. For Q2 FY26, total income decreased to Rs. 2,112.2 crore from Rs. 2,538.6 crore in Q2 FY25, while revenue from operations fell to Rs. 1,976.8 crore from Rs. 2,447.5 crore. Profit after tax declined to Rs. 136.5 crore compared to Rs. 205.9 crore in the previous year. For the half-year period, total income dropped to Rs. 4,004.6 crore from Rs. 4,923.9 crore, with profit after tax falling to Rs. 300.6 crore from Rs. 430.0 crore. The company's total order book stands at Rs. 23,865 crore, comprising Railways (Rs. 17,952 crore), Highways (Rs. 4,605 crore), and Others (Rs. 1,308 crore). The company maintains an EBITDA margin of 14.1% for the quarter and 15.5% for the half-year.",
            "Sentiment": "negative",
            "PublishDate": 1762974934908,
            "Source": "earnings"
        },
        {
            "Title": "IRCON International Reports Quarterly Results with Prior Period Adjustment for Joint Venture",
            "Summary": "IRCON International Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The Board of Directors approved the results at a meeting held on November 12, 2025. The company identified a prior period error of ₹227.47 crores related to overstatement of deferred tax assets in Chhattisgarh East Railway Limited (CERL), a joint venture. IRCON restated its consolidated financial statements to reflect its 26% share impact of ₹57.57 crores on retained earnings. The adjustment pertains entirely to the earliest period presented with no impact on current or comparative period profit and loss. The company's standalone total income from operations was ₹851.53 crores for the quarter, with net profit after tax of ₹169.97 crores. On a consolidated basis, total income was ₹1,664.19 crores with net profit after tax of ₹150.57 crores for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762964796804,
            "Source": "earnings"
        },
        {
            "Title": "IRCON International Achieves Record ₹10,000 Crore Turnover, Receives Navratna Status",
            "Summary": "IRCON International has achieved a record turnover of ₹10,000 crore and received Navratna status. The company is expanding its operations in rail, highway, and tunnel projects globally. IRCON maintains a healthy order book with focus on high-margin international contracts and has a strong execution pipeline that is expected to provide multi-year revenue visibility for sustained growth.",
            "Sentiment": "positive",
            "PublishDate": 1762960456549,
            "Source": "stock"
        },
        {
            "Title": "IRCON International Reports Decline in Q2 Financial Performance",
            "Summary": "IRCON International reported consolidated net profit of 1.37 billion rupees for Q2, down from 2.06 billion rupees in the same period last year. Revenue decreased to 19.77 billion rupees from 24.44 billion rupees year-over-year. EBITDA fell to 1.41 billion rupees compared to 2.01 billion rupees previously, while EBITDA margin compressed to 7.14% from 8.21% in the prior year period.",
            "Sentiment": "negative",
            "PublishDate": 1762953548453,
            "Source": "earnings"
        },
        {
            "Title": "IRCON International Appoints Vinod Kumar as Executive Director/Civil",
            "Summary": "IRCON International Limited has appointed Shri Vinod Kumar as Executive Director/Civil effective November 3, 2025. The appointment was approved by the Board of Directors upon recommendation of the Nomination and Remuneration Committee. Kumar, an IRSE Officer from the 1998 batch, joins on deputation from the Ministry of Railways. He has previously worked on various railway projects including Lumding-Silchar Gauge Conversion Project, Rangia-Murkongselek Gauge Conversion Project, and Udhampur-Srinagar Baramulla Rail Link Project. Kumar will be part of the company's Senior Management Personnel from his joining date.",
            "Sentiment": "positive",
            "PublishDate": 1762206255557,
            "Source": "corporate_governance"
        },
        {
            "Title": "IRCON International Executive Director Yogesh Kumar Misra Retires Upon Superannuation",
            "Summary": "IRCON International Limited announced that Shri Yogesh Kumar Misra, Executive Director/Infrastructure, ceased to be a Senior Management Personnel of the company on October 31, 2025, upon reaching superannuation age. The cessation was effective end of day on October 31, 2025. IRCON is a Navratna company and Government of India undertaking. The company informed stock exchanges BSE and NSE about this senior management change in compliance with SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1761914509778,
            "Source": "corporate_governance"
        },
        {
            "Title": "IRCON International Joint Venture Wins 1.68 Billion Rupee Contract from MSETCL",
            "Summary": "IRCON International, through a joint venture with Finolex J-Power Systems, has secured a turnkey contract worth 1.68 billion rupees from MSETCL. The contract represents a significant business win for the joint venture partnership.",
            "Sentiment": "positive",
            "PublishDate": 1761324701374,
            "Source": "order&deals"
        },
        {
            "Title": "Ircon International Wins Rs. 360.28 Crore Contract from Petronet LNG for Dahej Plant Works",
            "Summary": "Ircon International Limited secured a contract worth Rs. 360.28 crore from Petronet LNG Limited for civil, structural, and underground works including piling at a PDH-PP Plant with Ethane and Propane Storage and Handling Facilities in Dahej, Gujarat. The domestic contract will be executed over 18 months. The contract value excludes 18% GST. The promoter group has no interest in the entity that awarded the contract.",
            "Sentiment": "positive",
            "PublishDate": 1760767725656,
            "Source": "order&deals"
        },
        {
            "Title": "Coal India and Ircon International Sign MoU for Rail Infrastructure Development",
            "Summary": "Coal India Limited and Ircon International Limited signed a non-binding memorandum of understanding for rail infrastructure development on October 8, 2025 in Kolkata. Coal India shares gained 0.25% to ₹383.05 while Ircon International declined 0.90% to ₹177.48 during Wednesday's trading session. The MoU aims to develop rail infrastructure for Coal India and its subsidiaries. Coal India recorded trading volume of 35.06 lakh shares with turnover of ₹134.72 crore, while Ircon International saw 17.17 lakh shares traded worth ₹30.52 crore. Coal India has a market capitalization of ₹2,36,032.49 crore compared to Ircon International's ₹16,692.27 crore. The partnership is expected to strengthen Coal India's logistics infrastructure as both public sector companies explore railway sector collaboration opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1760000820313,
            "Source": "order&deals"
        },
        {
            "Title": "IRCON International Secures ₹224.50 Crore Railway Infrastructure Project",
            "Summary": "IRCON International received approval from North East Frontier Railways for a ₹224.50 crore project. The project involves upgrading Vande Bharat Express maintenance facilities and constructing a GE locomotive shed, with completion scheduled over 18 months.",
            "Sentiment": "positive",
            "PublishDate": 1758876320249,
            "Source": "stock"
        },
        {
            "Title": "Ircon Renewable Power Commissions Additional 100 MW Solar Capacity, Reaches 400 MW Total",
            "Summary": "Ircon Renewable Power Limited has successfully commissioned an additional 100 MW capacity (Lot-6), bringing its cumulative commissioned capacity to 400 MW out of its total 500 MW plant capacity. The company is a 76% joint venture subsidiary of Ircon International Limited. This expansion represents 80% completion of the renewable energy project's total planned capacity.",
            "Sentiment": "positive",
            "PublishDate": 1757946254117,
            "Source": "stock"
        },
        {
            "Title": "IRCON International Secures ₹510 Crore Order",
            "Summary": "IRCON International has secured a new order worth ₹510 crore.",
            "Sentiment": "positive",
            "PublishDate": 1755844398504,
            "Source": "order&deals"
        },
        {
            "Title": "IRCON International Appoints Vijender Singh as Executive Director (Works)",
            "Summary": "IRCON International Limited appointed Shri Vijender Singh as Executive Director (Works), effective August 11, 2025. The appointment was approved by the Board of Directors upon recommendation of the Nomination and Remuneration Committee. Singh joins on deputation from the Ministry of Railways and becomes part of the Senior Management Personnel. He is an IRSE Officer from the 1996 batch with experience in rail projects including Jammu-Udhampur New Rail Link Project, Station Redevelopment Projects, and major bridges. He previously served as Sr. Division Engineer in Delhi Division.",
            "Sentiment": "positive",
            "PublishDate": 1754920702404,
            "Source": "corporate_governance"
        },
        {
            "Title": "IRCON Board Addresses Stock Exchange Fines for Non-Compliance with Board Composition Rules",
            "Summary": "IRCON International Limited's Board addressed non-compliance issues regarding the composition of the Board and its committees for the quarter ended March 31, 2025. NSE and BSE imposed fines on the company for violations of SEBI regulations related to board and committee composition. The Board noted that as a government company, IRCON depends on the Ministry of Railways for director appointments, as the President of India holds the power to appoint directors including Independent Directors. All directors are appointed by the Government of India through the Ministry of Railways, and IRCON has no role in director appointments unless nominated by the government. The company has requested the Ministry of Railways to appoint the required number of Independent Directors to ensure compliance with regulations.",
            "Sentiment": "negative",
            "PublishDate": 1754489594416,
            "Source": "corporate_governance"
        },
        {
            "Title": "IRCON Targets Long-Term Growth With ₹20,973 Crore Order Book and Infrastructure Expansion Plans",
            "Summary": "IRCON has positioned itself for long-term growth with an order book valued at ₹20,973 crore, with 63% of orders secured through competitive bidding. The company has outlined expansion plans in rail and highway infrastructure sectors. IRCON is targeting opportunities arising from a ₹35.3 trillion rail investment and ₹2.87 lakh crore road budget. The company aims to expand its infrastructure operations both domestically and internationally.",
            "Sentiment": "positive",
            "PublishDate": 1754486638491,
            "Source": "stock"
        },
        {
            "Title": "IRCON International Reports Mixed Q1 Results with Revenue and Profit Decline Despite Margin Improvement",
            "Summary": "IRCON International reported Q1 results showing a decline in key financial metrics compared to the previous year. Revenue fell to 17.9 billion rupees from 22.9 billion rupees year-over-year. Consolidated net profit decreased to 1.64 billion rupees from 2.2 billion rupees in the same period last year. EBITDA dropped to 2 billion rupees from 2.5 billion rupees year-over-year. However, the company's EBITDA margin showed improvement, rising to 11.20% from 10.98% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754483893596,
            "Source": "earnings"
        },
        {
            "Title": "Ircon International Shares Rise 4.3% After Securing Contracts Worth Rs 755.78 Crore",
            "Summary": "Ircon International shares increased 4.3% to Rs 195 after the company secured multiple infrastructure contracts totaling Rs 755.78 crore. Rail Vikas Nigam awarded a contract to Ircon's joint venture (70% stake) with JPWIPL, giving Ircon a Rs 529.04 crore share. Mumbai Metropolitan Region Development Authority awarded two separate contracts: Rs 471.29 crore plus €2.84 million for Metro Line 5 construction including power systems and maintenance, and Rs 642.44 crore plus €2.79 million for Metro Line 6 project. The company reported quarterly results showing net profit declined 3.8% to Rs 246.8 crore, revenue dropped 1% to Rs 3,742.7 crore, and Ebitda fell 56.3% to Rs 286.3 crore. Analysts maintain a 'Sell' rating with average target price of Rs 158, suggesting 17% downside. Shares have gained 18% over three months but declined 39% over the past year.",
            "Sentiment": "positive",
            "PublishDate": 1753076458706,
            "Source": "stock"
        },
        {
            "Title": "Ircon International Secures Multiple Infrastructure Orders Worth Over 11 Billion Rupees",
            "Summary": "Ircon International has received multiple Letter of Awards (LOAs) for infrastructure projects. The company secured an order worth 7.56 billion rupees, in which Ircon's share amounts to 5.29 billion rupees. Additionally, the company received two separate LOAs - one worth 6.4 billion rupees plus Euro 2.8 million, and another worth 4.71 billion rupees plus Euro 2.8 million.",
            "Sentiment": "positive",
            "PublishDate": 1753057656371,
            "Source": "order&deals"
        },
        {
            "Title": "Ircon International Secures Rs 1,113 Crore Mumbai Metro Orders",
            "Summary": "Ircon International Ltd. secured two orders totaling Rs 1,113 crore from Mumbai Metropolitan Region Development Authority for Mumbai Metro Rail Lines-5 and Line-6. The first order worth Rs 471 crore covers Line-5 package 2, involving design, supply and installation of power systems, electrical works, lifts and escalators with a 108-week build period. The second order worth Rs 642 crore is for Line-6 package-2 covering Swami Samarth Nagar to Vikhroli with similar scope and 104-week timeline. Both projects include five years comprehensive maintenance after initial defect liability periods. Despite the order wins, Ircon shares closed 1.52% lower at Rs 186.90, underperforming the Nifty's 0.57% decline. The stock has dropped 40.25% over 12 months and 16.75% year-to-date. Analyst recommendations show one hold and two sell ratings with average price targets indicating 11.2% potential downside.",
            "Sentiment": "neutral",
            "PublishDate": 1752858660542,
            "Source": "order&deals"
        },
        {
            "Title": "IRCON International Secures New Orders Worth 4.71 Billion Rupees and 2.8 Million Euros",
            "Summary": "IRCON International has secured new orders valued at 4.71 billion rupees and 2.8 million euros. The company reported a share value of 5.29 billion rupees from a total value of 7.56 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1752848558131,
            "Source": "stock"
        },
        {
            "Title": "IRCON International Secures ₹7.56 Billion Contract",
            "Summary": "IRCON International has secured a contract worth ₹7.56 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1752847244505,
            "Source": "order&deals"
        },
        {
            "Title": "Ircon International: Secures Rs 1,068 Crore Railway Contract Amid Recent Penalties",
            "Summary": "Ircon International won a Rs 1,068.3 crore EPC contract from East Central Railway for a new bridge construction. The company recently faced fines for non-compliance in board composition. In May, Ircon secured multiple orders including projects in Kerala, Arunachal Pradesh, and Karnataka.",
            "Sentiment": "neutral",
            "PublishDate": 1748833533000,
            "Source": "order&deals"
        },
        {
            "Title": "Ircon International Secures Rs 1,068 Crore EPC Contract for Ganga Rail Bridge Project",
            "Summary": "Ircon International has been awarded an Engineering, Procurement, and Construction (EPC) contract worth Rs 1,068 crore by East Central Railway for the Ganga Rail Bridge Project. The contract involves the construction of a rail bridge over the Ganga River.",
            "Sentiment": "positive",
            "PublishDate": 1748823114000,
            "Source": "default"
        },
        {
            "Title": "IRCON International Secures Rs 1,068 Crore EPC Contract for Ganga Rail Bridge Project",
            "Summary": "IRCON International has been awarded an Engineering, Procurement, and Construction (EPC) contract worth Rs 1,068 crore from East Central Railway. The contract is for the Ganga Rail Bridge Project. No further details about the project timeline or specific scope were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1748678062000,
            "Source": "default"
        },
        {
            "Title": "Ircon International: Q4 Profit Drops 14% YoY, Revenue Declines 10%",
            "Summary": "Ircon International reported a 14% YoY decrease in Q4FY25 consolidated PAT to Rs 212 crore. Revenue from operations fell 10% YoY to Rs 3,412 crore. The board recommended a final dividend of Rs 1 per share. The company's order book as of March 31, 2025, stood at Rs 20,347 crore.",
            "Sentiment": "negative",
            "PublishDate": 1747884400000,
            "Source": "earnings"
        },
        {
            "Title": "IRCON International: Q4 Revenue and Profit Decline, FY25 Guidance Met",
            "Summary": "IRCON International reported a 10% YoY drop in Q4 revenue to ₹3,412 crore and a 15% decrease in net profit to ₹211 crore. EBITDA fell 21.1% to ₹261.4 crore with margins narrowing to 7.7%. The company met its FY25 revenue guidance of ₹10,000-11,000 crore. Full-year operating profit margin was 6.75%, in line with projections.",
            "Sentiment": "neutral",
            "PublishDate": 1747830092000,
            "Source": "earnings"
        },
        {
            "Title": "IRCON International Reports Q4 Results and Recommends Final Dividend",
            "Summary": "IRCON International has announced its quarterly results and dividend recommendation. The company's Q4 consolidated net profit was 2.1 billion rupees, down from 2.47 billion rupees year-over-year, but up from 866 million rupees quarter-on-quarter. Q4 revenue stood at 34.12 billion rupees, compared to 37.87 billion rupees in the same quarter last year. The Q4 EBITDA was 2.6 billion rupees, down from 2.86 billion rupees year-over-year, while the EBITDA margin remained steady at 7.65%. The company has recommended a final dividend of 1 rupee per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747828204000,
            "Source": "result"
        },
        {
            "Title": "IRCON International: Secures Rs 254 Crore KAVACH Contract from South Western Railway",
            "Summary": "IRCON International has won a Rs 253.6 crore contract from South Western Railway to implement KAVACH, an indigenous train collision avoidance system, across 778 route kilometers in Bengaluru and Mysuru divisions. The project is to be completed within 18 months.",
            "Sentiment": "positive",
            "PublishDate": 1747798188000,
            "Source": "order&deals"
        },
        {
            "Title": "IRCON International: Secures ₹254 Crore KAVACH Contract from South Western Railway",
            "Summary": "IRCON International has won a ₹253.6 crore contract from South Western Railway to implement KAVACH, an indigenous train collision avoidance system, across 778 route kilometers in Bengaluru and Mysuru divisions. The project is to be completed within 18 months.",
            "Sentiment": "positive",
            "PublishDate": 1747759397000,
            "Source": "order&deals"
        },
        {
            "Title": "IRCON International Secures Contract Worth 2.54 Billion Rupees",
            "Summary": "IRCON International has been awarded a contract valued at 2.54 billion rupees. No further details about the nature of the contract or the client were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747747067000,
            "Source": "default"
        },
        {
            "Title": "IRCON International: Q4 Results and Dividend Announcement Scheduled for May 21",
            "Summary": "IRCON International will announce Q4 and FY25 results on May 21. The board will consider a final dividend. An earnings call is scheduled for May 22. The trading window is closed from April 1 until 48 hours after results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1747649714000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ircon International: Shares Surge 8% on Rs 51.6 Crore Railway Contract Win",
            "Summary": "Ircon International secured a Rs 51.61 crore order from North Western Railway for installing a Remote Diagnostic and Predictive Maintenance System across multiple divisions in Rajasthan. The contract is to be completed within 24 months.",
            "Sentiment": "positive",
            "PublishDate": 1747378475000,
            "Source": "order&deals"
        },
        {
            "Title": "Ircon International: Secures Rs 187 Crore Contract for Rural Industrial Park in Kerala",
            "Summary": "Ircon International has been awarded a Rs 187.08 crore contract by Kerala State IT Infrastructure Ltd (KSITIL) for constructing a dedicated rural industrial park in Thiruvananthapuram district. The project, to be completed in 30 months, includes infrastructure development and civil works aimed at promoting rural industrialization.",
            "Sentiment": "positive",
            "PublishDate": 1746499677000,
            "Source": "order&deals"
        },
        {
            "Title": "Ircon International Secures 1.87 Billion Rupee Work Order",
            "Summary": "Ircon International has received a work order for a project valued at 1.87 billion rupees (approximately $22.5 million USD). This represents a significant new contract for the company, potentially boosting its project portfolio and future revenue.",
            "Sentiment": "positive",
            "PublishDate": 1746490104000,
            "Source": "default"
        },
        {
            "Title": "IRCON International: Secures ₹187 Crore Contract for Rural Industrial Park in Kerala",
            "Summary": "IRCON International has been awarded a ₹187.08 crore contract by Kerala State IT Infrastructure Ltd for constructing a dedicated rural industrial park in Thiruvananthapuram district. The project, to be completed in 30 months, involves infrastructure development and civil works.",
            "Sentiment": "positive",
            "PublishDate": 1746453397000,
            "Source": "order&deals"
        },
        {
            "Title": "IRCON International Limited: Railway PSU Stock Gains 3% on Recent Update",
            "Summary": "IRCON share price increased by 3.24% to ₹157.95 in Monday's trading session following an unspecified update.",
            "Sentiment": "positive",
            "PublishDate": 1746421934000,
            "Source": "normal_news"
        },
        {
            "Title": "Ircon International Secures 4.58 Billion Rupee Contract",
            "Summary": "Ircon International has been awarded a contract valued at 4.58 billion rupees from North Eastern Electric Power Corporation Ltd.",
            "Sentiment": "positive",
            "PublishDate": 1746403531000,
            "Source": "default"
        },
        {
            "Title": "IRCON International: Secures ₹458 Crore Contract for Arunachal Pradesh Hydro Project",
            "Summary": "IRCON International Ltd has been awarded a ₹458.14 crore civil works contract by NEEPCO for the Tato-I Hydro Electric project in Arunachal Pradesh. The project, to be completed in 45 months, includes construction of headworks, tunnels, and powerhouse infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1746194522000,
            "Source": "order&deals"
        },
        {
            "Title": "IRCON International Secures 4.58 Billion Rupee Contract",
            "Summary": "IRCON International has been awarded a contract valued at 4.58 billion rupees from North Eastern Electric Power Corporation Ltd.",
            "Sentiment": "positive",
            "PublishDate": 1746190734000,
            "Source": "default"
        },
        {
            "Title": "Ircon International Secures 1.27 Billion Rupee Railway Project",
            "Summary": "Ircon International has been awarded a contract by North Western Railway, Indian Railways, for a project valued at 1.27 billion rupees. The project involves designing, manufacturing, supplying, installing, testing, and commissioning a microprocessor-based EI (Electronic Interlocking) system.",
            "Sentiment": "positive",
            "PublishDate": 1744677340000,
            "Source": "order&deals"
        },
        {
            "Title": "IRCON International Secures 1.27 Billion Rupee Railway Project",
            "Summary": "IRCON International has been awarded a contract by the North Western Railway, a division of Indian Railways. The project, valued at 1.27 billion rupees, involves designing, manufacturing, supplying, installing, testing, and commissioning a microprocessor-based Electronic Interlocking (EI) system. This advanced signaling system is crucial for improving railway safety and efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1744389021000,
            "Source": "order&deals"
        }
    ]
}