{
    "Symbol": "IRCTC",
    "ISIN": "INE335Y01020",
    "News": [
        {
            "Title": "IRCTC Q3 FY26: Revenue Jumps 18.3% to ₹144,947 Lakhs",
            "Summary": "IRCTC reports strong Q3 FY26 performance with revenue rising 18.3% YoY to ₹144,947.25 lakhs and net profit growing 15.6% to ₹39,448.63 lakhs. Board declares second interim dividend of ₹3.50 per share.",
            "Sentiment": "positive",
            "PublishDate": 1770900423253,
            "Source": "co_actions_results"
        },
        {
            "Title": "IRCTC Board Meet on Feb 12 for Q3FY26 Results",
            "Summary": "IRCTC schedules board meeting for February 12, 2026 to approve Q3FY26 unaudited financial results and consider declaring 2nd interim dividend. Record date fixed as February 20, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769523656477,
            "Source": "co_actions_results"
        },
        {
            "Title": "IRCTC Shares Drop 2% Despite Strong Financial Growth",
            "Summary": "IRCTC shares declined 2% to ₹616.25 amid bearish market sentiment, though the company reported 31.99% revenue growth to ₹4,674.77 crores and 30.72% net profit increase to ₹1,314.90 crores over two years.",
            "Sentiment": "neutral",
            "PublishDate": 1769165264945,
            "Source": "stocks"
        },
        {
            "Title": "IRCTC announces director change effective Jan 16",
            "Summary": "Indian Railway Catering and Tourism Corporation Limited announces cessation of Shri Manoj Kumar Gangeya as Part-time Government Director effective January 16, 2026, following Railway Board order.",
            "Sentiment": "neutral",
            "PublishDate": 1768570068096,
            "Source": "stocks"
        },
        {
            "Title": "IRCTC Extends Aadhaar-Only Booking Window to Midnight",
            "Summary": "IRCTC expands exclusive online booking window for Aadhaar-verified users to 8 AM-midnight on ARP opening day from January 12, 2026, aimed at reducing touting and helping genuine passengers secure train tickets.",
            "Sentiment": "positive",
            "PublishDate": 1768228652355,
            "Source": "stocks"
        },
        {
            "Title": "IRCTC Restricts Day-1 Bookings to Aadhaar Users Only",
            "Summary": "From January 12, Indian Railways limits online general reserved ticket bookings on opening day of Advance Reservation Period to Aadhaar-authenticated IRCTC users only, aiming to curb agent misuse.",
            "Sentiment": "neutral",
            "PublishDate": 1768208585947,
            "Source": "stocks"
        },
        {
            "Title": "IRCTC Receives GST Order for ₹3.05 Lakh Demand",
            "Summary": "Indian Railway Catering & Tourism Corporation receives GST Order-In-Original from CGST Delhi South demanding ₹3.05 lakh including penalty for FY 2018-19 non-compliance under reverse charge mechanism.",
            "Sentiment": "negative",
            "PublishDate": 1767186294171,
            "Source": "stocks"
        },
        {
            "Title": "IRCTC Maintains Strong Revenue Outlook with ₹825 Target",
            "Summary": "IRCTC shows positive revenue momentum across ticketing, catering, and tourism segments. Railway fare hike from December 26 and RBI payment aggregator approval boost growth prospects with target price of ₹825.",
            "Sentiment": "positive",
            "PublishDate": 1767007107094,
            "Source": "stocks"
        },
        {
            "Title": "IRCTC Prioritizes Aadhaar Users for Ticket Bookings",
            "Summary": "Indian Railways restricts first-day advance ticket bookings to Aadhaar-verified users starting December 29, with phased expansion through January to curb agent misuse and prioritize genuine passengers.",
            "Sentiment": "positive",
            "PublishDate": 1766989947149,
            "Source": "stocks"
        },
        {
            "Title": "IRCTC Fined ₹10.86 Lakh by BSE and NSE for Board Composition Non-Compliance",
            "Summary": "Indian Railway Catering and Tourism Corporation received fines of ₹5.42 lakh each from BSE and NSE for non-compliance with board composition requirements, including failure to appoint a woman director for the quarter ended September 30, 2025. The company has requested waiver of fines citing its status as a government enterprise where director appointments vest with the President of India through the Ministry of Railways, and states the fine has no impact on its financial or operational activities.",
            "Sentiment": "negative",
            "PublishDate": 1764505155775,
            "Source": "corporate_governance"
        },
        {
            "Title": "IRCTC Reports 11% PAT Growth in Q2FY26, Announces Payment Aggregator Business Plans",
            "Summary": "IRCTC delivered strong quarterly results with profit after tax rising 11% to Rs. 342 crores and revenue from operations growing 7.71% to Rs. 1,146 crores, driven by robust performance across internet ticketing, catering and tourism segments. The company received in-principle RBI approval for payment aggregator business and plans to expand digital capabilities through unified travel portal and MICE events while maintaining focus on volume-driven affordable pricing strategy.",
            "Sentiment": "positive",
            "PublishDate": 1763453027683,
            "Source": "earnings"
        },
        {
            "Title": "IRCTC Reports 10.3% Growth in Net Profit, Declares Interim Dividend",
            "Summary": "IRCTC reported net profit of 3.42 billion rupees for Q2, up from 3.1 billion rupees year-over-year. Revenue increased to 11.46 billion rupees from 10.64 billion rupees. EBITDA rose to 4.04 billion rupees from 3.73 billion rupees, with EBITDA margin improving to 35.28% from 35.05%. The company recommended an interim dividend of 5 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1762957052008,
            "Source": "earnings"
        },
        {
            "Title": "IRCTC to Announce Q2FY26 Results on November 12, Board to Consider Interim Dividend",
            "Summary": "IRCTC will release its quarterly results on November 12, with the Board meeting to approve financial results for the quarter and half-year ended September 2025. The Board will also consider declaring an interim dividend for FY 2025-26, with November 21 set as the record date for shareholder eligibility. An earnings call is scheduled for November 13 at 4 p.m. IST, hosted by Dolat Capital, with Chairman and Managing Director Sanjay Kumar Jain participating. In the previous quarter, IRCTC reported total income of Rs 1,220.87 crore and net profit of Rs 330.7 crore, representing a 7% year-on-year increase. IRCTC shares have declined 2.50% in the past five trading sessions and are down 10.68% year-to-date. The stock hit a 52-week high of Rs 859.7 on December 12, 2024, and a 52-week low of Rs 656 on April 7, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762759561596,
            "Source": "earnings"
        },
        {
            "Title": "IRCTC Schedules Q2 Financial Results Review for November 12",
            "Summary": "IRCTC has announced it will review its Q2 financial results on November 12. The company has set this date for examining its quarterly performance.",
            "Sentiment": "neutral",
            "PublishDate": 1761721992008,
            "Source": "earnings"
        },
        {
            "Title": "IRCTC Suspends Staff and Imposes ₹5 Lakh Fine After Violent Clash at Delhi Station",
            "Summary": "A violent clash erupted among catering staff of the Khajuraho Vande Bharat Express at Delhi's Hazrat Nizamuddin railway station on Thursday morning. The altercation between two groups of IRCTC pantry staff began as a verbal argument over placing a water box inside the train and escalated into physical violence involving thrown dustbins, belt swinging, and exchanging blows on Platform Number 7. The incident was captured in a 60-second video that went viral on social media, causing panic among passengers. IRCTC suspended four staff members involved, deactivated their ID cards, and imposed a ₹5 lakh penalty on the service provider. A show cause notice for contract termination was issued to the service provider. The Railway Protection Force filed an FIR under Section 194(2) of the Bharatiya Nyaya Sanhita. Railway officials expressed concern about the impact on Vande Bharat's reputation as a high-end service.",
            "Sentiment": "negative",
            "PublishDate": 1760764367288,
            "Source": "stock"
        },
        {
            "Title": "IRCTC Website and App Experience Downtime During Diwali Booking Rush",
            "Summary": "Indian Railway Catering and Tourism Corporation (IRCTC) website and mobile app went down during peak Diwali booking period. Users attempting to book tickets were informed the site would be non-operational for at least an hour due to technical issues. The outage occurred during Tatkal booking hours, which open at 10 AM for AC coaches and 11 AM for non-AC berths. IRCTC processes 1.25 million tickets daily, representing 84% of all railway tickets sold in India. Despite user frustration, IRCTC shares remained unaffected. The company is valued at $6.5 billion and operates as a monopoly in providing access to India's railway booking system.",
            "Sentiment": "negative",
            "PublishDate": 1760682477974,
            "Source": "stock"
        },
        {
            "Title": "IRCTC To Launch Free Train Ticket Rescheduling Feature in January 2026",
            "Summary": "Indian Railways will introduce a free rescheduling feature for confirmed train tickets, expected to launch in January 2026 on the IRCTC website and app. The new system will allow passengers to change travel dates online without cancellation fees, requiring only payment of fare differences if the new ticket costs more. Currently, passengers face cancellation charges ranging from Rs 60 to Rs 240 for tickets cancelled more than 48 hours before departure, and 25-50% of fare for later cancellations. The feature will work through real-time integration with IRCTC's reservation system, where passengers can log in, select existing bookings, and choose new dates subject to seat availability. Passengers missing trains due to delayed flights will be shifted to the next available train, replacing the current system where they lose their tickets without compensation.",
            "Sentiment": "positive",
            "PublishDate": 1760511338977,
            "Source": "stock"
        },
        {
            "Title": "IRCTC Implements 15-Minute Aadhaar-Only Booking Window Starting October 1",
            "Summary": "IRCTC will reserve the first 15 minutes of online ticket booking exclusively for Aadhaar-authenticated users starting October 1. This rule applies to both general reservations (which open 60 days in advance) and Tatkal bookings. Previously, this restriction only applied to Tatkal tickets. The measure aims to prevent misuse by touts and unauthorized agents who use illegal software to bulk-book tickets and resell them at higher prices. After the 15-minute window, all registered users can book tickets. Authorized railway agents remain restricted from booking during the first 10 minutes of reservations. Physical booking counters at railway stations are unaffected by this change. Users must link their Aadhaar to their IRCTC account before October 1 to access the priority booking window.",
            "Sentiment": "neutral",
            "PublishDate": 1759232708748,
            "Source": "stock"
        },
        {
            "Title": "IRCTC Appoints Manoj Kumar Sharma as Director (Catering Services)",
            "Summary": "Manoj Kumar Sharma has assumed charge as Director (Catering Services) at IRCTC effective September 22, 2025. Sharma, an Indian Railway Traffic Service officer from the 1995 batch, brings 28 years of experience in marketing, business development, operations, and project development across four railway zones. He has been associated with IRCTC since March 12, 2024, as Group General Manager/North Zone. Sharma is not related to any existing directors or key management personnel and holds no shares in the company. The appointment was made through Railway Board's letter dated September 19, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758544636232,
            "Source": "corporate_governance"
        },
        {
            "Title": "IRCTC Reduces Rail Neer Water Bottle Prices Following GST Cut",
            "Summary": "IRCTC announced a reduction in Maximum Retail Price of Rail Neer bottled water effective September 22, 2025. The price for 1000 ml bottles decreased from ₹15 to ₹14, while 500 ml bottles dropped from ₹10 to ₹9. This revision follows the reduction in GST on Packaged Drinking Water from 18% to 5%. The Ministry of Railways approved the price revision to pass on the benefit of reduced tax burden to railway passengers.",
            "Sentiment": "positive",
            "PublishDate": 1758450396370,
            "Source": "stock"
        },
        {
            "Title": "IRCTC Appoints Manoj Kumar Sharma as Director (Catering Services) Until April 2030",
            "Summary": "The Ministry of Railways has approved the appointment of Shri Manoj Kumar Sharma as Director (Catering Services) of IRCTC on an absorption basis. Sharma, who holds the position of IRTS, OSD/CS/IRCTC, will serve in the role until April 30, 2030, which is his superannuation date, or until further orders. The appointment comes with a pay scale of ₹1,80,000-3,40,000. This follows previous announcements regarding the entrustment of additional charge for this position made in July, August, and September 2025. The exact date when Sharma will assume charge will be communicated to the exchanges later.",
            "Sentiment": "neutral",
            "PublishDate": 1758281673462,
            "Source": "corporate_governance"
        },
        {
            "Title": "IRCTC Introduces 15-Minute Priority Window for Aadhaar-Linked Users in Online Ticket Booking",
            "Summary": "Indian Railway Catering and Tourism Corp. will implement a new online ticket booking rule starting October 1, reserving the first 15 minutes after general reservations open exclusively for Aadhaar-linked users on its website and app. Railway counter bookings remain unchanged, while agents face a 10-minute restriction when reservations open. The company received RBI approval for IRCTC Payments Ltd. to operate as an online payment aggregator, aimed at capturing railway and government-linked transactions for additional revenue. IRCTC reported quarterly results showing consolidated net profit rising 7% to Rs 330.7 crore and revenue growing 3.8% to Rs 1,159.68 crore with a 34.3% margin. Growth was driven by e-ticketing segment increasing 9% and tourism segment growing 21%. CMD Sanjay Kumar Jain highlighted plans for technology-driven diversification including AI monetization and four new approved plants.",
            "Sentiment": "positive",
            "PublishDate": 1757950999310,
            "Source": "stock"
        },
        {
            "Title": "IRCTC: Manoj Kumar Sharma Gets Additional Charge as Director (Catering Services)",
            "Summary": "The Ministry of Railways has approved the additional charge of Director (Catering Services) at IRCTC to Shri Manoj Kumar Sharma, effective from August 1, 2025, until a regular incumbent assumes the role or until further orders. Sharma, who is IRTS, OSD/CS at IRCTC on deputation, will handle this position in addition to his existing responsibilities. The approval was granted ex-post facto by the competent authority.",
            "Sentiment": "neutral",
            "PublishDate": 1757416706803,
            "Source": "corporate_governance"
        },
        {
            "Title": "IRCTC Reports 7% Profit Growth, Expands Into AI and Payment Gateway Services",
            "Summary": "Indian Railway Catering & Tourism Corp. reported consolidated net profit of Rs 330.7 crore, up 7% in the first quarter, with revenue growing 3.8% to Rs 1,159.68 crore and maintaining a 34.3% margin. E-ticketing segment grew 9% and tourism expanded 21%, while catering business declined due to high base effect from previous year. The company received RBI permission for payment gateway and aggregation services, with plans to apply for RVL Licence within six months to serve government and private organizations beyond internal customers. IRCTC processed Rs 13,000 crore in GMP value through internal business last year. The company plans to monetize websites using artificial intelligence and has board approval for four new plants. Additionally, Indian Railways launched a Round Trip Package scheme offering 20% discount on return journey base fare for travel between October 13-26 (onward) and November 17-December 1 (return), bookable through IRCTC Rail Connect mobile app.",
            "Sentiment": "positive",
            "PublishDate": 1755597716873,
            "Source": "earnings"
        },
        {
            "Title": "IRCTC Makes Q1FY26 Earnings Call Audio Recording Available to Investors",
            "Summary": "IRCTC has made the audio recording of its Q1FY26 earnings conference call available on its website. The earnings call was held on August 14, 2025, and was organized by Dolat Capital. The company provided a direct link to access the audio recording and made it available through its investor relations section. The audio recording can be accessed at www.irctc.com under the Schedule of Investors Meet section.",
            "Sentiment": "neutral",
            "PublishDate": 1755184112048,
            "Source": "earnings"
        },
        {
            "Title": "IRCTC Board Approves Liquidation Process for RIRTL",
            "Summary": "IRCTC's board has approved the decision to initiate the liquidation process for RIRTL. The board has given the green light to proceed with winding down operations of this entity.",
            "Sentiment": "negative",
            "PublishDate": 1755089150130,
            "Source": "corporate_action"
        },
        {
            "Title": "IRCTC Reports Quarterly Results with Revenue of ₹115,958 Crores",
            "Summary": "IRCTC's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of ₹115,958.10 lakhs on standalone basis and ₹115,968.10 lakhs on consolidated basis. Segment-wise performance showed Internet Ticketing generating ₹35,875.33 lakhs, Catering ₹54,678.13 lakhs, Railneer ₹11,049.09 lakhs, and Tourism ₹14,759.83 lakhs. The company faces ongoing legal challenges including arbitration awards of ₹7,471.65 lakhs related to catering services, disputes with Developer Cum Operators over GST input tax credits of ₹135.98 lakhs, and a National Anti-Profiteering Authority notice for ₹5,041.44 lakhs regarding Railneer pricing. IRCTC has filed appeals in Supreme Court against certain arbitration judgments and maintains that main liabilities should be borne by Indian Railways.",
            "Sentiment": "neutral",
            "PublishDate": 1755088429797,
            "Source": "earnings"
        },
        {
            "Title": "IRCTC Reports Growth in Q1 Financial Performance with Higher Revenue and Profit",
            "Summary": "IRCTC reported Q1 EBITDA of 3.97 billion rupees compared to 3.75 billion rupees in the previous year. The EBITDA margin improved to 34.27% from 33.47% year-over-year. Net profit increased to 3.3 billion rupees from 3.1 billion rupees, while revenue grew to 11.6 billion rupees from 11.2 billion rupees compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1755086440868,
            "Source": "earnings"
        },
        {
            "Title": "Railway Minister Defends IRCTC Catering Tender Process Amid Corruption Allegations",
            "Summary": "Railway Minister Ashwini Vaishnaw addressed corruption allegations in IRCTC's train catering contracts during a Lok Sabha session. MPs raised concerns about awarding over 80% of cluster-A contracts to one family and giving contracts to contractors with pending criminal cases. Vaishnaw defended the tendering process as transparent, stating that 24 bidders participated with 20 entities receiving contracts through highest bidder selection. He denied that any single bidder received 80% of Cluster A contracts and confirmed no contracts were awarded violating tender conditions. The minister highlighted that IRCTC has implemented robust monitoring systems and compliance measures to prevent unethical practices. In 2024-25, Rs 13.2 crore in penalties were imposed based on complaints received by IRCTC. The railway network serves an average of 16.5 lakh meals daily, with the new cluster-based contracting system aimed at improving food quality and hygiene standards.",
            "Sentiment": "neutral",
            "PublishDate": 1754506974763,
            "Source": "stock"
        },
        {
            "Title": "IRCTC Sets August 22, 2025 as Record Date for Final Dividend with TDS Guidelines",
            "Summary": "IRCTC has fixed August 22, 2025 as the record date for determining shareholder eligibility for final dividend for financial year 2024-25. The Board of Directors recommended a final dividend of ₹1.00 per equity share (face value ₹2 each), subject to AGM approval. The dividend will be paid within 30 days of AGM conclusion. The company outlined comprehensive TDS requirements under Income Tax Act provisions, with varying rates for different shareholder categories. For resident shareholders, TDS rates range from 0% (for exempt entities with proper documentation) to 20% (without valid PAN), with 10% standard rate for individuals. Non-resident shareholders face 20% TDS (plus surcharge and cess) or beneficial DTAA rates with proper documentation. Shareholders must submit required documents before book closure period (August 24-30, 2025) to claim exemptions or reduced rates.",
            "Sentiment": "neutral",
            "PublishDate": 1754490450822,
            "Source": "corporate_action"
        },
        {
            "Title": "IRCTC Subsidiary Receives RBI In-Principle Authorization for Online Payment Aggregator Operations",
            "Summary": "IRCTC Payments Limited, a wholly owned subsidiary of Indian Railway Catering and Tourism Corporation Limited (IRCTC), has received in-principle authorization from the Reserve Bank of India to operate as an Online Payment Aggregator under the Payment and Settlement Systems Act, 2007. The RBI granted this authorization through a letter dated August 04, 2025, which was received via email on August 05, 2025. This development allows IRCTC's subsidiary to enter the digital payments space as a payment aggregator.",
            "Sentiment": "positive",
            "PublishDate": 1754396199036,
            "Source": "stock"
        },
        {
            "Title": "IRCTC Appoints Manoj Kumar Sharma as Key Managerial Personnel",
            "Summary": "IRCTC appointed Shri Manoj Kumar Sharma, Director (Catering Services), as Key Managerial Personnel effective August 4, 2025. The appointment was approved by the Board of Directors. Sharma is an Indian Railway Traffic Service officer from the 1995 batch with 28 years of experience. He has been associated with IRCTC since March 12, 2024, serving as Group General Manager/North Zone. His experience spans marketing, business development, operations, transportation, planning, vigilance, safety, IT and project development across four Indian Railway zones.",
            "Sentiment": "neutral",
            "PublishDate": 1754315668744,
            "Source": "corporate_governance"
        },
        {
            "Title": "IRCTC Appoints Manoj Kumar Sharma as Additional Director with Catering Services Charge",
            "Summary": "IRCTC appointed Manoj Kumar Sharma as Additional Director with additional charge of Director (Catering Services), effective August 1, 2025. The Board of Directors approved this appointment, allowing Sharma to assume the additional responsibilities alongside his existing role. Sharma, an Indian Railway Traffic Service officer from the 1995 batch with 28 years of experience, has been associated with IRCTC since March 12, 2024, as Group General Manager/North Zone. He has extensive experience in Marketing, Business Development, Operations, Transportation, and other railway functions across four zones of Indian Railways. Sharma is not related to any Director/KMP of the company and holds no shares in IRCTC. The appointment follows a previous announcement made to exchanges on July 22, 2025, regarding the entrustment of this additional charge.",
            "Sentiment": "neutral",
            "PublishDate": 1754052041062,
            "Source": "corporate_governance"
        },
        {
            "Title": "IRCTC Receives 6,645 Food Quality Complaints in 2024-25, Fines Imposed in 1,341 Cases",
            "Summary": "Railway Minister Ashwini Vaishnaw reported that IRCTC received 6,645 complaints about poor food quality in 2024-25. The railway authority imposed fines on food suppliers in 1,341 cases, issued warnings in 2,995 cases, gave advisories in 1,547 cases, and took other measures in 762 cases. Historical data shows complaints numbered 7,026 in 2023-24, 4,421 in 2022-23, and 1,082 in 2021-22. CPI(M) MP John Brittas raised questions about food quality and contract transparency in trains. Vaishnaw stated that IRCTC awards catering contracts through transparent tender processes to the highest bidders, with contracts currently awarded to 20 entities across train clusters including Vande Bharat and long-distance services. The minister outlined various food quality measures including designated Base Kitchens, CCTV installation, branded raw materials usage, and deployment of Food Safety Supervisors.",
            "Sentiment": "neutral",
            "PublishDate": 1753500623950,
            "Source": "stock"
        },
        {
            "Title": "IRCTC Assigns Additional Charge of Director (Catering Services) to Manoj Kumar Sharma",
            "Summary": "IRCTC announced the assignment of additional charge of Director (Catering Services) to Shri Manoj Kumar Sharma, effective August 1, 2025, following the superannuation of the incumbent Shri Lokiah Ravikumar on July 31, 2025. The Ministry of Railways has decided that Sharma, who serves as OSD/CS at IRCTC on deputation, will hold this additional responsibility pending approval from the Competent Authority. The arrangement will continue until a regular incumbent is appointed or until further orders. The exact date of assumption of charge will be communicated later.",
            "Sentiment": "neutral",
            "PublishDate": 1753197523468,
            "Source": "corporate_governance"
        },
        {
            "Title": "IRCTC Director (Finance) Rabindra Nath Mishra Relinquishes Additional Charge",
            "Summary": "Shri Rabindra Nath Mishra has relinquished his additional charge as Director (Finance) of IRCTC effective July 22, 2025, following a Railway Board directive. Mishra, who holds DIN 09050821 and is from IRAS, stepped down from the finance director position in accordance with Railway Board's letter dated July 22, 2025. The change in directorate was communicated to stock exchanges NSE and BSE as part of regulatory disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1753196992260,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indian Railways: Passenger Fare Hike Announced for July 2025",
            "Summary": "Indian Railways to increase passenger fares from July 1, 2025. Non-AC Mail/Express fares to rise by 1 paise/km, AC class by 2 paise/km. No increase for suburban tickets and second-class travel up to 500 km. Aadhaar authentication required for Tatkal bookings from July 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1750821532000,
            "Source": "corporate_action"
        },
        {
            "Title": "IRCTC: Targeting 10% Growth in FY26 with Expansion Plans",
            "Summary": "IRCTC aims for 10% growth across its four business verticals in FY26. Plans include launching a unified online travel agency portal, establishing 30-35 budget hotels through PPP model, doubling Rail Neer plant capacities, and expanding e-catering services. The company emphasizes affordability while targeting an EBITDA of around 30%.",
            "Sentiment": "positive",
            "PublishDate": 1748755085000,
            "Source": "normal_news"
        },
        {
            "Title": "IRCTC: Q4 Profit Surges 26% YoY to Rs 358 Crore",
            "Summary": "IRCTC reported a 26% YoY increase in Q4FY25 consolidated net profit to Rs 358 crore. Revenue from operations rose 10% to Rs 1,269 crore. For FY25, net profit stood at Rs 1,315 crore, up from Rs 1,111 crore in FY24. Internet ticketing segment showed growth, while catering revenue slightly declined.",
            "Sentiment": "positive",
            "PublishDate": 1748486689000,
            "Source": "earnings"
        },
        {
            "Title": "IRCTC Reports Q4 Results and Recommends Dividend",
            "Summary": "IRCTC has recommended a dividend of 1 rupee per equity share. For Q4, the company reported an EBITDA of 3.85 billion rupees, compared to 3.63 billion rupees in the same quarter last year. The EBITDA margin for Q4 was 30.35%, down from 31.41% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748441724000,
            "Source": "result"
        },
        {
            "Title": "IRCTC Reports Q4 Financial Results",
            "Summary": "IRCTC (Indian Railway Catering and Tourism Corporation) has announced its financial results for the fourth quarter. The company's net profit increased to 3.6 billion rupees, up from 2.84 billion rupees in the same period last year. Revenue for the quarter rose to 12.7 billion rupees, compared to 11.5 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748441636000,
            "Source": "result"
        },
        {
            "Title": "IRCTC: Q4 Profit Jumps 26%, Revenue Rises 10%",
            "Summary": "IRCTC reported a 26% YoY increase in Q4 net profit to ₹358 crore, with revenue rising to ₹1,269 crore. FY25 net profit grew 18% to ₹1,315 crore. Web ticketing and tourism segments saw revenue growth. The board recommended a final dividend of ₹1 per share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1748441077000,
            "Source": "earnings"
        },
        {
            "Title": "IRCTC: Q4 FY25 Results Date Set, Dividend Consideration on Agenda",
            "Summary": "IRCTC to announce Q4 and FY25 results on May 28, 2025. Board to consider dividend declaration. Earnings call scheduled for May 29 at 4:00 p.m. IST.",
            "Sentiment": "neutral",
            "PublishDate": 1748318658000,
            "Source": "corporate_action"
        },
        {
            "Title": "IRCTC to Consider Q4 Results on May 28",
            "Summary": "Indian Railway Catering and Tourism Corporation (IRCTC) has announced that it will consider its fourth quarter (Q4) financial results on May 28.",
            "Sentiment": "neutral",
            "PublishDate": 1746535369000,
            "Source": "default"
        },
        {
            "Title": "IRCTC: New Rule Bans Wait-Listed Passengers from AC and Sleeper Coaches",
            "Summary": "IRCTC implements a new rule from May 1 prohibiting wait-listed passengers from traveling in AC or sleeper coaches. Violators face fines up to ₹440 and must disembark at the next station. The measure aims to reduce overcrowding and improve comfort for confirmed ticket holders.",
            "Sentiment": "neutral",
            "PublishDate": 1746342153000,
            "Source": "normal_news"
        },
        {
            "Title": "IRCTC: Stock Hits 52-Week Low, Potential for Technical Bounce",
            "Summary": "IRCTC stock hit a fresh 52-week low on NSE in April 2025, but showed signs of recovery. Experts suggest high-risk traders could consider buying for a target of Rs 825 in 3-4 weeks.",
            "Sentiment": "neutral",
            "PublishDate": 1744111800000,
            "Source": "normal_news"
        },
        {
            "Title": "Indian Railway Catering and Tourism Corporation (IRCTC): Mandatory Display of Food Menu and Prices in Trains",
            "Summary": "Railway Minister Ashwini Vaishnaw announced that IRCTC must display menus and price lists for food items in trains. Measures include printed menu cards, rate lists in pantry cars, and SMS links to passengers. Steps to improve food quality and hygiene include designated base kitchens, CCTV monitoring, branded raw materials, and regular inspections.",
            "Sentiment": "positive",
            "PublishDate": 1741849683000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indian Railway Catering and Tourism Corporation: Awarded Navratna Status",
            "Summary": "IRCTC has been granted Navratna status by the Government of India, as announced on March 3, 2025. This status provides greater autonomy in decision-making, allowing investments up to Rs 1,000 crore or 15% of net worth without government approval.",
            "Sentiment": "positive",
            "PublishDate": 1741059301000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Railway Catering and Tourism Corp Granted Navratna Status",
            "Summary": "The Government of India has awarded Navratna status to the Indian Railway Catering and Tourism Corporation (IRCTC). This designation is typically given to top-performing public sector enterprises, granting them greater autonomy in decision-making and operations.",
            "Sentiment": "positive",
            "PublishDate": 1741047169000,
            "Source": "corporate_governance"
        },
        {
            "Title": "IRCTC Upgraded to Navratna CPSE Status",
            "Summary": "The government has approved the upgrade of IRCTC (Indian Railway Catering and Tourism Corporation) to Navratna CPSE (Central Public Sector Enterprise) status. This elevation signifies IRCTC's enhanced operational and financial autonomy, potentially allowing for more strategic decision-making and improved performance.",
            "Sentiment": "positive",
            "PublishDate": 1740993336000,
            "Source": "corporate_governance"
        }
    ]
}