{
    "Symbol": "IREDA",
    "ISIN": "INE202E01016",
    "News": [
        {
            "Title": "IREDA Issues Postal Ballot for ₹2,994 Crore QIP",
            "Summary": "Indian Renewable Energy Development Agency Limited announces postal ballot notice for special resolution to raise capital through equity shares issuance worth ₹2,994 crore via qualified institutions placement.",
            "Sentiment": "positive",
            "PublishDate": 1770895644858,
            "Source": "co_actions_results"
        },
        {
            "Title": "IREDA Gets 15.4% Budget Boost for FY27",
            "Summary": "Government increases IREDA investment allocation to ₹40,064 crore for 2026-27, up from revised ₹34,730 crore for 2025-26, marking significant support for renewable energy financing.",
            "Sentiment": "positive",
            "PublishDate": 1769934333843,
            "Source": "union_budget"
        },
        {
            "Title": "IREDA Subsidiary Approves First International Loan",
            "Summary": "IREDA's subsidiary Iggelfil has approved its first international green energy loan, marking a significant milestone in the company's global expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1768579305742,
            "Source": "stocks"
        },
        {
            "Title": "IREDA Reports Strong Q3 FY26 Results with 38% PAT Growth",
            "Summary": "Indian Renewable Energy Development Agency Ltd posted impressive Q3 FY26 results with revenue rising 25% YoY to ₹2,130 crore and profit after tax surging 38% to ₹585 crore, driving shares up 4%.",
            "Sentiment": "positive",
            "PublishDate": 1768209784387,
            "Source": "co_actions_results"
        },
        {
            "Title": "IREDA Q3 Net Profit Surges 38% to ₹584.90 Crore",
            "Summary": "Indian Renewable Energy Development Agency reports strong Q3 FY25 performance with net profit jumping 38% YoY to ₹584.90 crore, driven by 28% loan book growth and improved margins.",
            "Sentiment": "positive",
            "PublishDate": 1768203233140,
            "Source": "co_actions_results"
        },
        {
            "Title": "IREDA jumps 4%, Tejas Networks falls 13% on Q3 results",
            "Summary": "IREDA shares rose over 4% after reporting 37.5% YoY profit growth in Q3 FY26, while Tejas Networks tumbled 13% to 52-week low following net loss of ₹196.55 crores and 88% revenue decline.",
            "Sentiment": "neutral",
            "PublishDate": 1768200827708,
            "Source": "co_actions_results"
        },
        {
            "Title": "IREDA Shares Jump 4% on Strong Q3 Results",
            "Summary": "IREDA shares surged up to 4.13% to ₹142.30 following announcement of Q3 results showing 37.5% YoY growth in net profit to ₹585 crore, demonstrating strong financial performance in renewable energy financing sector.",
            "Sentiment": "positive",
            "PublishDate": 1768192187774,
            "Source": "co_actions_results"
        },
        {
            "Title": "IREDA Q3 Results: Net Profit Jumps 37% to ₹585 Cr",
            "Summary": "IREDA reported strong Q3 performance with net profit rising 37% YoY to ₹585 crore and total income growing 26% to ₹2,140 crore. Shares gained 2% following the earnings announcement.",
            "Sentiment": "positive",
            "PublishDate": 1768191286491,
            "Source": "co_actions_results"
        },
        {
            "Title": "IREDA Q3 PAT jumps 15% YoY, revenue surges 28%",
            "Summary": "IREDA reported strong Q3 FY26 results with consolidated PAT rising 15.4% YoY to ₹1,381.36 crore and revenue from operations surging 28.2% to ₹6,041.82 crore, driven by robust lending business growth.",
            "Sentiment": "positive",
            "PublishDate": 1768191191188,
            "Source": "co_actions_results"
        },
        {
            "Title": "IREDA Reports Strong Q3 Performance with 36% Profit Growth",
            "Summary": "IREDA delivered impressive Q3 results with net profit rising 36.47% YoY to ₹5.80 billion and revenue growing 25.44% to ₹21.30 billion. Asset quality improved with GNPA and NNPA ratios declining quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1768176690907,
            "Source": "co_actions_results"
        },
        {
            "Title": "IREDA Q3 FY26 Results: Net Profit Jumps 15.4% YoY",
            "Summary": "IREDA reported strong Q3 FY26 results with consolidated net profit rising 15.4% YoY to ₹1,381.36 crore and operational revenue growing 28.2% to ₹6,041.82 crore, despite recent share price decline.",
            "Sentiment": "positive",
            "PublishDate": 1768124904348,
            "Source": "co_actions_results"
        },
        {
            "Title": "IREDA Q3 Results: PAT jumps 15% YoY to ₹1,381 cr",
            "Summary": "Indian Renewable Energy Development Agency reports strong Q3 performance with 15% YoY growth in net profit to ₹1,381.36 crore and 28% revenue growth to ₹6,041.82 crore.",
            "Sentiment": "positive",
            "PublishDate": 1768022381380,
            "Source": "co_actions_results"
        },
        {
            "Title": "IREDA Shows Improved Asset Quality in Q3",
            "Summary": "Indian Renewable Energy Development Agency reports sequential improvement in both gross and net non-performing assets for Q3, with GNPA declining to 3.75% and NNPA dropping to 1.68%.",
            "Sentiment": "positive",
            "PublishDate": 1767973142945,
            "Source": "co_actions_results"
        },
        {
            "Title": "IREDA Q3 FY26 Results Show Strong Growth Momentum",
            "Summary": "IREDA reports 38% jump in Q3 FY26 PAT to ₹585 crores with 25% revenue growth. Outstanding loan book reaches ₹87,975 crores, up 28% YoY, while maintaining healthy asset quality metrics.",
            "Sentiment": "positive",
            "PublishDate": 1767970776294,
            "Source": "co_actions_results"
        },
        {
            "Title": "IREDA Q3 Net Profit Surges 36% to ₹5.8B",
            "Summary": "IREDA reports strong Q3 performance with net profit rising 36% YoY to ₹5.80 billion and revenue growing 25% to ₹21.30 billion, demonstrating robust financial growth.",
            "Sentiment": "positive",
            "PublishDate": 1767969073924,
            "Source": "co_actions_results"
        },
        {
            "Title": "IREDA Among 7 Stocks Announcing Q3 Results Today",
            "Summary": "Seven companies including IREDA, Tejas Networks, and Globus Spirits are set to announce their December quarter results today, with market cap ranging from ₹12.78 crore to ₹39,652.30 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1767937877551,
            "Source": "co_actions_results"
        },
        {
            "Title": "IREDA Q3 Results: Focus on Asset Quality & QIP Plans",
            "Summary": "IREDA reports 27.6% loan book growth to ₹87,975 crore ahead of Q3 results. Investors await asset quality updates and ₹3,000 crore QIP timeline clarity after recent business performance.",
            "Sentiment": "neutral",
            "PublishDate": 1767936892323,
            "Source": "co_actions_results"
        },
        {
            "Title": "IREDA Q3 FY26 Results: Analysts Expect Strong Growth",
            "Summary": "IREDA announces Q3 FY26 results on January 9, with analysts expecting double-digit loan growth and stable earnings. Technical analysis shows bullish signals despite recent 35% YTD decline.",
            "Sentiment": "positive",
            "PublishDate": 1767933735589,
            "Source": "co_actions_results"
        },
        {
            "Title": "IREDA Q3 Results on Jan 9; Loan Book Grows 28% YoY",
            "Summary": "IREDA to announce Q3FY26 results on January 9. Loan sanctions up 29% YoY to ₹40,100 crore in April-December period. Shares gain 3.89% in past five sessions despite 34.31% decline over past year.",
            "Sentiment": "positive",
            "PublishDate": 1767845958345,
            "Source": "co_actions_results"
        },
        {
            "Title": "IREDA Board Meet on Jan 9 for Q3FY26 Results",
            "Summary": "Indian Renewable Energy Development Agency Limited has scheduled its board meeting for January 9, 2026, to consider and approve Q3FY26 audited financial results. Trading window closed from January 1.",
            "Sentiment": "neutral",
            "PublishDate": 1767629309558,
            "Source": "co_actions_results"
        },
        {
            "Title": "IREDA Shares Rise 6% on Strong Q3 Business Update",
            "Summary": "IREDA shares gained nearly 6% to ₹147.60 following provisional Q3 FY26 results showing 44% YoY growth in loan disbursements to ₹24,903 crore and 29% increase in sanctions to ₹40,100 crore.",
            "Sentiment": "positive",
            "PublishDate": 1767341321647,
            "Source": "co_actions_results"
        },
        {
            "Title": "IREDA Solar Pump Storage Scheme for Northeast States",
            "Summary": "Indian Renewable Energy Development Agency may introduce new solar pump storage scheme for North Eastern states in upcoming budget announcement.",
            "Sentiment": "positive",
            "PublishDate": 1767329969321,
            "Source": "stocks"
        },
        {
            "Title": "IREDA Budget May Triple to ₹40,000 Cr for Hydro Projects",
            "Summary": "Indian Renewable Energy Development Agency could see its budget increased threefold to ₹40,000 crores, with 25-30% intellectual assistance planned for small hydro projects in the upcoming budget.",
            "Sentiment": "positive",
            "PublishDate": 1767329685151,
            "Source": "stocks"
        },
        {
            "Title": "IREDA Q3: 44% Disbursement Growth, Stock Down 55% from Peak",
            "Summary": "IREDA reports 44% growth in loan disbursements to ₹24,903.00 crores for Q3, with loan book reaching ₹87,975.00 crores. Stock trades at ₹139.90, down 55% from all-time high amid fundraising plans.",
            "Sentiment": "positive",
            "PublishDate": 1767198529107,
            "Source": "co_actions_results"
        },
        {
            "Title": "IREDA Appoints New Senior Management Personnel",
            "Summary": "IREDA announces key appointments including Jagdeep Singh as General Manager (F&A) and Head of Internal Audit, and Tusarkant Parida as Executive Director (F&A), effective December 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767105084983,
            "Source": "stocks"
        },
        {
            "Title": "IREDA Appoints Three Senior Management Personnel Including New Executive Director",
            "Summary": "Indian Renewable Energy Development Agency Limited's Board approved the appointment of Shri Tusarkant Parida as Executive Director (FA), Shri Jagdeep Singh as General Manager (FA), and Smt Punnu Grover as General Manager (FXA). Smt Punnu Grover will continue as Chief Compliance Officer until April 30, 2028, bringing over 29 years of experience and holds a Masters degree in Commerce with membership of the Institute of Cost and Work Accountants of India.",
            "Sentiment": "positive",
            "PublishDate": 1765282544191,
            "Source": "corporate_governance"
        },
        {
            "Title": "IREDA Plans Rs 3,000 Crore Fundraising Through QIP With Up To 5% Discount",
            "Summary": "IREDA plans to raise up to Rs 3,000 crore through a Qualified Institutional Placement (QIP), offering shares at a discount of up to 5%. The fundraising initiative will impact existing shareholders through potential dilution while providing the company with capital for business expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1763456197763,
            "Source": "corporate_action"
        },
        {
            "Title": "IREDA Extends Chief Risk Officer Tenure and Promotes Three Senior Executives",
            "Summary": "Indian Renewable Energy Development Agency Limited (IREDA) announced key leadership changes following a board meeting on November 10, 2025. The company extended Shri Pallav Kapoor's tenure as Chief Risk Officer for three years beyond October 31, 2025, until October 31, 2028. Three executives received promotions: Shri A. Chandrashekar was promoted from Additional General Manager to General Manager (Projects) while continuing as Head of Internal Audit; Shri Sanjay Kumar advanced from Deputy General Manager to Additional General Manager (IT) while remaining Chief Information Security Officer; and Shri K.P. Philip was promoted from Additional General Manager to General Manager (Projects) and appointed as Senior Management Personnel. All appointees hold bachelor's degrees in their respective fields and bring extensive experience ranging from 18 to 34 years.",
            "Sentiment": "positive",
            "PublishDate": 1762824324134,
            "Source": "corporate_governance"
        },
        {
            "Title": "IREDA Reports Strong H1 FY26 Performance with 31% Loan Book Growth and AAA Credit Rating",
            "Summary": "Indian Renewable Energy Development Agency Limited (IREDA) delivered robust performance in H1 FY26 with gross loan portfolio reaching ₹84,477 crores, marking 31% year-on-year growth. The company reported profit after tax of ₹796 crores, representing 86% growth compared to previous year. Net interest margin improved to 1.90% from 1.68% in the prior period. IREDA maintained strong asset quality with 84% secured loans and net NPA at 1.97%. The company holds AAA/Stable domestic credit rating from multiple agencies including ICRA, CARE, India Ratings, Brickwork, and Acuite. Total borrowings stood at ₹69,940 crores with cost of funds at 3.65%. Capital adequacy ratio remained robust at 20.10%, well above minimum regulatory requirements. The company successfully raised ₹2,006 crores through Qualified Institutional Placement in June 2025. IREDA's loan book spans across solar, wind, hybrid, hydro power, and emerging technologies like green hydrogen. The company has supported installations of 27.5 GW renewable energy capacity and sees ₹31.6 lakh crore financing potential across RE sectors till FY30.",
            "Sentiment": "positive",
            "PublishDate": 1762143504655,
            "Source": "stock"
        },
        {
            "Title": "IREDA Receives Credit Rating Upgrade to 'BBB' from S&P Global Ratings",
            "Summary": "Indian Renewable Energy Development Agency Ltd. (IREDA) received an upgrade in its long-term issuer credit rating from S&P Global Ratings to 'BBB' from 'BBB-', with a stable outlook. The short-term rating was also revised to 'A-2' from 'A-3'. This upgrade aligns IREDA's international credit rating with India's sovereign credit rating. S&P Global Ratings cited IREDA's robust asset quality, sound capitalization and strong liquidity profile as key factors for the upgrade. The rating enhancement is expected to strengthen IREDA's funding capabilities, reduce its cost of capital and enhance investor confidence in both equity and debt capital markets. Chairman & Managing Director Pradip Kumar Das stated the upgrade validates IREDA's financial strength and will enable more competitive capital access.",
            "Sentiment": "positive",
            "PublishDate": 1761638665566,
            "Source": "stock"
        },
        {
            "Title": "IREDA Appoints Rahul Kamal as General Manager (Projects)",
            "Summary": "Indian Renewable Energy Development Agency Limited (IREDA) announced that Rahul Kamal has joined the company as General Manager (Projects), a Senior Management Personnel position, effective October 9, 2025. Kamal brings over 24 years of experience and holds degrees in Mechanical Engineering from Delhi College of Engineering, an MBA in Finance from Delhi University, M.Tech in Thermal Engineering from IIT Delhi, and a Master's in Business Law from NLSIU Bangalore. He previously worked with NTPC Limited before joining IREDA.",
            "Sentiment": "positive",
            "PublishDate": 1760429297674,
            "Source": "corporate_governance"
        },
        {
            "Title": "IREDA Reports Improved Asset Quality with Lower GNPA and NNPA Ratios",
            "Summary": "IREDA's quarterly results show improvement in asset quality metrics. Gross Non-Performing Assets (GNPA) decreased to 3.97% from 4.13% quarter-on-quarter. Net Non-Performing Assets (NNPA) also declined to 1.97% from 2.06% quarter-on-quarter. The reduction in both ratios indicates better loan portfolio performance for the renewable energy financing company.",
            "Sentiment": "positive",
            "PublishDate": 1760418856793,
            "Source": "earnings"
        },
        {
            "Title": "IREDA Reports Strong Q2 Performance with 27% Revenue Growth",
            "Summary": "IREDA reported quarterly revenue of 20.6 billion rupees compared to 16.2 billion rupees in the same period last year. The company's standalone net profit increased to 5.5 billion rupees from 3.88 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1760417097820,
            "Source": "earnings"
        },
        {
            "Title": "IREDA to Announce Q2 Results on October 14, Reports 86% Growth in Loan Sanctions",
            "Summary": "Indian Renewable Energy Development Agency Ltd. (IREDA) will announce its quarterly results on October 14. The Navratna PSU operates as a Non-Banking Financial Institution focused on renewable energy financing under the Ministry of New and Renewable Energy. IREDA reported strong operational performance with loan sanctions rising 86% to Rs 33,148 crore in April-September compared to Rs 17,860 crore in the same period last year. Loan disbursements grew 54% to Rs 15,043 crore from Rs 9,787 crore. The outstanding loan book reached Rs 84,445 crore as of September 30, marking a 31% increase from Rs 64,564 crore in the previous year. However, IREDA shares have declined significantly, falling 32.32% year-to-date and trading at Rs 150.09. The stock hit a 52-week high of Rs 239.9 in October 2024 and a low of Rs 137.01 in March.",
            "Sentiment": "neutral",
            "PublishDate": 1760328405296,
            "Source": "earnings"
        },
        {
            "Title": "IREDA Reports 86% Growth in Loan Sanctions to ₹33,148 Crore",
            "Summary": "IREDA announced its business performance for the period ending September 30, 2025. Loan sanctions increased by 86% to ₹33,148 crore compared to ₹17,860 crore in the previous year. Loan disbursements grew by 54% to ₹15,043 crore from ₹9,787 crore. The company's loan book outstanding expanded by 31% to ₹84,445 crore compared to ₹64,564 crore in the same period last year. The results are provisional and subject to audit.",
            "Sentiment": "positive",
            "PublishDate": 1759284287165,
            "Source": "stock"
        },
        {
            "Title": "IREDA Sanctions ₹1,134 Crore Loan for 4.5 GW Solar Cell Manufacturing Facility",
            "Summary": "Indian Renewable Energy Development Agency Limited (IREDA) has sanctioned a ₹1,134 crore loan to its wholly owned subsidiary Insolation Green Energy to establish a 4.5 GW solar cell manufacturing facility in Madhya Pradesh. The total project cost is ₹1,512 crore, with the remaining ₹378 crore funded through internal accruals. The facility will be located in the Manufacturing Zone for Power and Renewable in Narmadapuram district as part of the company's backward and forward integration strategy across the solar value chain. The group expects to achieve 7 GW PV module manufacturing capacity, 4.5 GW solar cell manufacturing capacity, and 18,000 MTA aluminium frame production within two years. Plans include adding 3 GW of ingot and wafer manufacturing capacity by 2028. IREDA shares traded 1.2% higher at ₹155.8 on NSE, while Insolation Energy shares rose 0.30% to ₹199.05 on BSE.",
            "Sentiment": "positive",
            "PublishDate": 1758187737890,
            "Source": "stock"
        },
        {
            "Title": "IREDA Officials to Meet Institutional Investors in Singapore and Japan from September 22-26, 2025",
            "Summary": "IREDA has scheduled meetings with institutional investors and analysts in Singapore and Japan from September 22 to 26, 2025, through physical and virtual formats. The company will discuss only publicly available information during these interactions. IREDA reported quarterly results for the period ended June 30, 2025, showing revenue from operations of $229 million, up 29% compared to the same quarter last year. However, profit after tax declined 36% to $29 million. The company's outstanding loan book grew 26% to $9.4 billion. Gross NPA increased to 4.13% from 2.19% in the previous year, while net NPA rose to 2.06% from 0.95%. IREDA maintains AAA domestic credit ratings and received BBB- long-term rating from S&P Global. The Government of India's shareholding decreased to 71.76% from 75% as of June 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758111498093,
            "Source": "stock"
        },
        {
            "Title": "IREDA Raises ₹453 Crore Through Oversubscribed Perpetual Bond Issue",
            "Summary": "Indian Renewable Energy Development Agency successfully raised ₹453 crore through perpetual bonds offering a 7.70% annual rate. The bond issue was oversubscribed by 2.69 times, receiving total bids worth ₹1,343 crore, indicating strong investor demand for the renewable energy financing company's debt instruments.",
            "Sentiment": "positive",
            "PublishDate": 1757584617682,
            "Source": "stock"
        },
        {
            "Title": "IREDA Appoints Pradipta Kumar Roy as Senior Management Personnel",
            "Summary": "Indian Renewable Energy Development Agency Limited (IREDA) appointed Shri Pradipta Kumar Roy, Additional General Manager (Projects), as Senior Management Personnel. The appointment was approved by the Board of Directors on August 26, 2025, following recommendation from the Nomination and Remuneration Committee. Roy holds a B.Tech degree in Mechanical Engineering from IIT Bombay and an MBA from Faculty of Management Studies, Delhi University. He has completed JAIIB and CAIIB certification courses from Indian Institute of Banking and Finance and brings over 23 years of experience. Roy has been working with IREDA since 2017.",
            "Sentiment": "neutral",
            "PublishDate": 1756219676111,
            "Source": "corporate_governance"
        },
        {
            "Title": "IREDA Exceeds Revenue Target, Reports ₹6,743.32 Crores Against ₹5,957 Crores Goal",
            "Summary": "IREDA has surpassed its revenue target for FY 2024-25, achieving ₹6,743.32 crores compared to its target of ₹5,957 crores. This represents an outperformance of approximately ₹786 crores above the company's set revenue goal.",
            "Sentiment": "positive",
            "PublishDate": 1756108443799,
            "Source": "earnings"
        },
        {
            "Title": "IREDA Signs Agreement With MNRE, Targets ₹8,200 Crore Revenue By FY 2025-26",
            "Summary": "IREDA has signed an agreement with the Ministry of New and Renewable Energy (MNRE). The company is targeting revenue of ₹8,200 crore by FY 2025-26.",
            "Sentiment": "positive",
            "PublishDate": 1756108067931,
            "Source": "stock"
        },
        {
            "Title": "IREDA Appoints Bhagirath Siyag as General Manager (Projects)",
            "Summary": "Indian Renewable Energy Development Agency Limited (IREDA) appointed Shri Bhagirath Siyag as General Manager (Projects) effective August 14, 2025, in a Senior Management Personnel role. Siyag holds a degree in Electrical Engineering from University of Rajasthan, Jaipur and brings over 21 years of experience. He previously worked with NTPC Limited before joining IREDA.",
            "Sentiment": "positive",
            "PublishDate": 1755187482071,
            "Source": "corporate_governance"
        },
        {
            "Title": "IREDA Appoints Seven New Senior Management Personnel Including CTOs and General Managers",
            "Summary": "IREDA's Board of Directors approved the appointment of seven new Senior Management Personnel on August 7, 2025. The appointees include Shailendra Kumar Malviya as Chief Technology Officer, and Koushi Goswami, Rajeev Kumar, and Kuber Malhotra as General Managers in various divisions including Projects and Information Technology. The remaining three appointees are Bhagirath Siyag, Rahul Kamal, and Sujith V Surendran. The new personnel bring extensive experience ranging from 20-23 years, with backgrounds from organizations including NHPC Limited, NTPC Limited, Power Grid Corporation of India Limited, and Solar Energy Corporation of India. Most appointments are effective from August 7, 2025, though some personnel joined the company in early August 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754575102392,
            "Source": "corporate_governance"
        },
        {
            "Title": "IREDA Appoints Kuber Malhotra as Chief Technology Officer",
            "Summary": "Indian Renewable Energy Development Agency Limited (IREDA) has appointed Shri Kuber Malhotra as Chief Technology Officer, replacing Shri N. Balaji effective August 1, 2025. Malhotra also joined the company as General Manager (Information Technology) on the same date. He holds a B.E. degree in Computer Science from Dr. Babasaheb Ambedkar Marathwada University and an MBA from Sikkim Manipal University, bringing over 20 years of experience. Prior to joining IREDA, he worked with Central Warehousing Corporation, IRCON International Limited, and Solar Energy Corporation of India.",
            "Sentiment": "neutral",
            "PublishDate": 1754051001851,
            "Source": "corporate_governance"
        },
        {
            "Title": "IREDA Reports Strong Financial Performance with 36% Revenue Growth in FY25",
            "Summary": "Indian Renewable Energy Development Agency Limited (IREDA) reported robust financial results for the year ended March 31, 2025. The company achieved total income of ₹6,755 crores compared to ₹4,965 crores in the previous year, marking significant growth. Net profit after tax increased to ₹1,699 crores from ₹1,252 crores in FY24. Interest income rose to ₹6,575 crores from ₹4,822 crores. The company's loan assets grew to ₹75,320 crores from ₹58,775 crores. IREDA maintained a strong capital adequacy ratio (CRAR) of 17.77% and earnings per share improved to ₹6.32 from ₹5.16. The company raised ₹4,307 crores through non-convertible securities during the fourth quarter. Total debt stood at ₹64,740 crores with a debt-equity ratio of 6.31. The audited results were reviewed by the Comptroller and Auditor General of India with no significant adverse comments.",
            "Sentiment": "positive",
            "PublishDate": 1753858354766,
            "Source": "earnings"
        },
        {
            "Title": "IREDA's QIP and IPO Success Reflects Strong Investor Confidence in India's Renewable Energy Sector",
            "Summary": "Union Minister Shripad Yesso Naik stated that Indian Renewable Energy Development Agency Ltd.'s successful qualified institutional placement and IPO subscription demonstrates high investor confidence in India's renewable energy sector. IREDA raised Rs 2,005.9 crore through QIP in June by issuing fresh equity shares at Rs 165.14 per share, offering a 5% discount from the floor price of Rs 173.83. The QIP attracted marquee investors including Life Insurance Corporation (50%), Morgan Stanley (9.12%), and Societe Generale (8.98%), showing both domestic institutional and foreign investor interest. IREDA's stock has shown robust gains in the secondary market following its listing at Rs 32 per share. In November 2023, IREDA shares debuted with an 87.5% premium over the issue price, reflecting investor optimism around renewable energy financing and confidence in the company's financials and growth trajectory.",
            "Sentiment": "positive",
            "PublishDate": 1753789232847,
            "Source": "stock"
        },
        {
            "Title": "IREDA Plans Rs 2,500-3,000 Crore QIP Fundraise Following Gensol Engineering Recovery",
            "Summary": "IREDA plans to raise Rs 2,500-3,000 crore through qualified institutional placement this fiscal, allowing the government to dilute another 3.76% stake following a successful IPO in December 2023. The company has already raised Rs 2,005 crore last month through QIP with 3.24% government stake dilution. IREDA had Rs 700 crore exposure to crisis-hit Gensol Engineering and has recovered over Rs 100 crore through bank guarantees and FD withdrawals. The National Company Law Tribunal admitted corporate insolvency proceedings against Gensol Engineering following IREDA's petition. SEBI barred Gensol Engineering and its promoters from securities markets in April over fund diversion and governance lapses. The fundraise will provide borrowing power worth Rs 30,000 crore this fiscal. IREDA reported 49% year-on-year growth in operating profit and 30% rise in total income in the first quarter. The company's outstanding loan book reached Rs 79,941 crore, a 26% increase, with contributions from solar, wind, and emerging technologies. Net worth rose 36% to Rs 12,402 crore. CBDT notified IREDA bonds as 'long-term specified assets' under Section 54EC, enabling capital gains tax exemption for investors effective July 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753155692238,
            "Source": "stock"
        },
        {
            "Title": "Ireda CMD Says No Further Provisioning Expected for Gensol Engineering After 60% Coverage",
            "Summary": "Indian Renewable Energy Development Agency (Ireda) has made 60% provisioning for Gensol Engineering in the current quarter and does not expect additional provisioning if operations resume within months. Gensol Engineering faced regulatory action when SEBI barred its promoters over alleged misuse of Rs 978 crore in loans, leading to management resignations. Ireda's asset quality deteriorated in Q1FY26 with gross NPA rising to 4.13% from 2.45% and net NPA increasing to 2.05% from 1.35%. Total NPAs reached Rs 3,302 crore compared to Rs 1,866 crore in the previous quarter, driven by both Gensol and Ecron Group accounts. Ireda has filed cases against Gensol at NCLT and DRT over its Rs 730 crore exposure. Despite challenges, quarterly revenue increased marginally to Rs 1,947 crore, though profit after tax dropped to Rs 247 crore from Rs 502 crore.",
            "Sentiment": "negative",
            "PublishDate": 1753149732116,
            "Source": "stock"
        },
        {
            "Title": "Indian Renewable Energy Development Agency: Stock Plummets 28% in 2025, Faces Technical Hurdles",
            "Summary": "IREDA shares have fallen 28% year-to-date in 2025, despite operational growth. The stock is trading below key technical indicators, with analysts identifying Rs 185 as a crucial resistance level. Asset quality concerns and rising costs have overshadowed business expansion. Q1FY26 net profit dropped 36% YoY to Rs 247 crore, with increased NPAs.",
            "Sentiment": "negative",
            "PublishDate": 1752812970000,
            "Source": "normal_news"
        },
        {
            "Title": "IREDA Expands Borrowing Limit to ₹1.5 Lakh Crore",
            "Summary": "The Indian Renewable Energy Development Agency (IREDA) has increased its borrowing limit to ₹1.5 lakh crore. This expansion is in response to growing loan demand in the renewable energy sector. The move is aimed at supporting the growth of renewable energy projects in India.",
            "Sentiment": "positive",
            "PublishDate": 1752504573000,
            "Source": "default"
        }
    ]
}