{
    "Symbol": "IRFC",
    "ISIN": "INE053F01010",
    "News": [
        {
            "Title": "IRFC Extends Chief Compliance Officer Tenure by 1 Year",
            "Summary": "Indian Railway Finance Corporation Limited announces extension of Shri Sanjay Jain's tenure as Chief Compliance Officer for one year from February 14, 2026 to February 13, 2027 on contractual basis.",
            "Sentiment": "neutral",
            "PublishDate": 1770807356705,
            "Source": "stocks"
        },
        {
            "Title": "IRFC Signs Key Agreement for Tuticorin Port Development",
            "Summary": "Indian Railway Finance Corporation Limited enters into significant agreement for the development of Tuticorin Port, marking a strategic infrastructure initiative.",
            "Sentiment": "positive",
            "PublishDate": 1770130199033,
            "Source": "stocks"
        },
        {
            "Title": "IRFC explores Swiss franc swap to cut dollar risk",
            "Summary": "IRFC considers converting $1 billion of its $8 billion forex exposure from dollars to Swiss francs to reduce currency risk and borrowing costs, while expanding into metro rail and port financing.",
            "Sentiment": "neutral",
            "PublishDate": 1769387175308,
            "Source": "stocks"
        },
        {
            "Title": "IRFC Plans ₹5 Lakh Cr AUM Growth in 3-5 Years",
            "Summary": "Indian Railway Finance Corporation outlines ambitious expansion strategy targeting ₹5 lakh crore AUM through 20 new entities and diversified funding approach by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1768966307132,
            "Source": "stocks"
        },
        {
            "Title": "IRFC Shifts Focus to Government-Linked Entities",
            "Summary": "Indian Railway Finance Corporation announces strategic shift to fund only government entities and those with strong government linkages, adopting whole-of-government approach for infrastructure projects.",
            "Sentiment": "neutral",
            "PublishDate": 1768888383315,
            "Source": "stocks"
        },
        {
            "Title": "IRFC Reports Record Q3 PAT of ₹1,802 Crore, Up 10.5%",
            "Summary": "Indian Railway Finance Corporation achieves highest-ever quarterly profit with ₹1,802.19 crore PAT in Q3 FY26, marking 10.52% YoY growth. Nine-month PAT reaches ₹5,324.86 crore with double-digit growth of 10.47%.",
            "Sentiment": "positive",
            "PublishDate": 1768815403635,
            "Source": "co_actions_results"
        },
        {
            "Title": "IRFC On Track With 75% of ₹30,000 Cr Disbursement Goal",
            "Summary": "Indian Railway Finance Corporation has distributed 75% of its ₹30,000 crore disbursement target and remains on track to achieve the full goal, demonstrating strong execution capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1768813189902,
            "Source": "stocks"
        },
        {
            "Title": "IRFC Q3 Results: Record Profit of ₹1,802.19 Cr, Up 10.52% YoY",
            "Summary": "IRFC reports highest-ever quarterly profit of ₹1,802.19 crore with 10.52% YoY growth, achieves full-year sanctions target of ₹60,000 crore in nine months, AUM reaches record ₹4.75 lakh crore.",
            "Sentiment": "positive",
            "PublishDate": 1768813096521,
            "Source": "co_actions_results"
        },
        {
            "Title": "IRFC Board Addresses Exchange Fine on Board Compliance",
            "Summary": "Indian Railway Finance Corporation's board deliberated on fines imposed by NSE and BSE for non-compliance with board composition requirements, requesting waiver while seeking expedited director appointments from Ministry of Railways.",
            "Sentiment": "neutral",
            "PublishDate": 1768285300956,
            "Source": "stocks"
        },
        {
            "Title": "IRFC Q3FY26 Earnings Call Set for January 20, 2026",
            "Summary": "Indian Railway Finance Corporation Limited announces conference call with analysts and investors on January 20, 2026 at 11:00 AM IST to discuss Q3FY26 unaudited financial results and nine-month performance.",
            "Sentiment": "neutral",
            "PublishDate": 1768205801302,
            "Source": "co_actions_results"
        },
        {
            "Title": "IRFC Schedules Q3FY26 Results Call on Jan 20",
            "Summary": "Indian Railway Finance Corporation announces conference call with analysts and investors on January 20, 2026 at 11:00 AM IST to discuss Q3FY26 and nine months unaudited financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1768195246165,
            "Source": "co_actions_results"
        },
        {
            "Title": "IRFC to Announce Q3 Results on January 20",
            "Summary": "Indian Railway Finance Corporation Limited has scheduled its board meeting for January 20 to consider and approve the third quarter financial results for the current fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1768194698270,
            "Source": "co_actions_results"
        },
        {
            "Title": "IRFC Achieves Fifth Consecutive 'Excellent' DPE Rating",
            "Summary": "Indian Railway Finance Corporation receives 'Excellent' DPE rating for FY25, marking fifth consecutive year of highest performance rating since listing. Company achieves annual sanction target of ₹60,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1767703594234,
            "Source": "co_actions_results"
        },
        {
            "Title": "IRFC Achieves Fifth Consecutive 'Excellent' DPE Rating",
            "Summary": "Indian Railway Finance Corporation Limited receives 'Excellent' DPE rating for FY25, marking fifth consecutive year of top performance since listing. Company achieves annual sanction guidance of ₹60,000 crore by Q3 end.",
            "Sentiment": "positive",
            "PublishDate": 1767508242605,
            "Source": "stocks"
        },
        {
            "Title": "IRFC Achieves 'Excellent' Rating in MoU Performance FY25",
            "Summary": "Indian Railway Finance Corporation Limited received 'Excellent' rating from Department of Public Enterprises for FY25 performance under MoU parameters covering operational and financial metrics.",
            "Sentiment": "positive",
            "PublishDate": 1767341680377,
            "Source": "stocks"
        },
        {
            "Title": "IRFC sanctions ₹5,000 cr loan to MAHAGENCO",
            "Summary": "Indian Railway Finance Corporation sanctions ₹5,000 crore term loan to Maharashtra State Power Generation Company, with ₹3,000 crore already disbursed on execution day.",
            "Sentiment": "positive",
            "PublishDate": 1767201532193,
            "Source": "co_actions_results"
        },
        {
            "Title": "IRFC Sanctions ₹5,000 Crore Loan to MAHAGENCO",
            "Summary": "Indian Railway Finance Corporation Limited executed a ₹5,000 crore rupee term loan agreement with MAHAGENCO, with ₹3,000 crore already disbursed on December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767195654273,
            "Source": "stocks"
        },
        {
            "Title": "IRFC Shares Drop 4.12% Despite Pre-Budget Rally Hopes",
            "Summary": "Indian Railway Finance Corporation shares fell to ₹127.73 on Monday despite analysts expecting traditional pre-budget gains in railway stocks, with heavy selling pressure dominating trading.",
            "Sentiment": "negative",
            "PublishDate": 1766996272834,
            "Source": "stocks"
        },
        {
            "Title": "IRFC Executes ₹9,821 Cr Refinancing Deal with DFCCIL",
            "Summary": "Indian Railway Finance Corporation refinances World Bank loan for Eastern Dedicated Freight Corridor project, shifting DFCCIL from foreign currency to rupee-denominated financing.",
            "Sentiment": "positive",
            "PublishDate": 1766581283149,
            "Source": "co_actions_results"
        },
        {
            "Title": "IRFC Appoints Joint Statutory Auditors for FY26",
            "Summary": "Indian Railway Finance Corporation Limited announces appointment of M/s OP Totla & Co and M/s KGRS & Co as Joint Statutory Auditors for financial year 2025-26 under CAG directive.",
            "Sentiment": "neutral",
            "PublishDate": 1765864869618,
            "Source": "stocks"
        },
        {
            "Title": "Indian Railway Finance Corporation Appoints Alok Tiwari as Part-time Government Nominee Director",
            "Summary": "Indian Railway Finance Corporation Limited has appointed Shri Alok Tiwari, Joint Secretary at Department of Economic Affairs, as Part-time Government Nominee Director effective December 5th, 2025. The appointment follows Ministry of Railways order and adds an experienced IAS officer with infrastructure finance expertise to IRFC's board.",
            "Sentiment": "neutral",
            "PublishDate": 1764939353891,
            "Source": "corporate_governance"
        },
        {
            "Title": "IRFC Signs USD 300 Million Loan Agreement with Sumitomo Mitsui Banking Corp",
            "Summary": "IRFC has entered into a loan agreement with Sumitomo Mitsui Banking Corp for USD 300 million. This financing arrangement provides IRFC with significant foreign currency funding from the Japanese banking institution.",
            "Sentiment": "positive",
            "PublishDate": 1764719943582,
            "Source": "stock"
        },
        {
            "Title": "Rail Vikas Nigam Limited Fined Rs. 9.77 Lakh by NSE for Board Composition Non-Compliance",
            "Summary": "NSE imposed a fine of Rs. 9,77,040 on Rail Vikas Nigam Limited for non-compliance with board and committee composition regulations for the quarter ended September 30, 2025. The company clarified that as a Government enterprise, all directors are appointed by the Ministry of Railways, and it expects fine waiver upon compliance as per SEBI policy.",
            "Sentiment": "negative",
            "PublishDate": 1764336234981,
            "Source": "corporate_governance"
        },
        {
            "Title": "IRFC Reports Record H1 Profit of ₹3,523 Crores, Declares Interim Dividend of ₹1.05 Per Share",
            "Summary": "Indian Railway Finance Corporation delivered a profit after tax of ₹1,780 crores in Q2 FY 2025-26, marking over 10% growth, while half-year profit reached ₹3,523 crores, the highest in company history. Net worth touched a record ₹56,000 crores with EPS of ₹5.39. The company's Net Interest Margin improved from 1.42% to 1.55% driven by strategic diversification beyond railways. IRFC signed ₹45,000 crores worth of new business agreements in H1 across renewable energy, transmission, coal mining and industrial infrastructure sectors. The Board declared an interim dividend of ₹1.05 per share. The company maintains zero NPA record and provided disbursement guidance of ₹30,000 crores for the fiscal year. Management indicated plans to achieve a 75%-25% mix between railway and diversified assets over the next five years, targeting government and public sector entities to maintain low-risk profile while achieving 2x to 3x margins compared to traditional railway lending.",
            "Sentiment": "positive",
            "PublishDate": 1761217851392,
            "Source": "earnings"
        },
        {
            "Title": "IRFC Reports Record PAT Growth of 10.45% in H1 FY26, Declares Highest-Ever Interim Dividend",
            "Summary": "Indian Railway Finance Corporation (IRFC) reported strong financial results for the quarter and half-year ended September 30, 2025. The company achieved Profit After Tax of INR 3,522.67 crores for the half-year, marking a 10.45% growth compared to INR 3,189.47 crores in the previous year. Quarterly PAT stood at INR 1,776.98 crores versus INR 1,612.65 crores in Q2 FY2024-25, representing 10.19% growth. Total income reached INR 6,371.91 crores for the quarter and INR 13,290.15 crores for the half-year. The company's Assets Under Management increased to INR 4.62 lakh crores despite no new business from Indian Railways. Net Worth reached a record INR 56,193.85 crores with EPS of INR 5.39 per share. IRFC sanctioned new business agreements worth INR 45,382 crores during the half-year across railway-linked sectors including power generation, renewable energy, and industrial infrastructure - a ninefold increase from INR 5,250 crores in the previous financial year. Net Interest Margins improved to 1.55% annualized. The Board declared an interim dividend of INR 1.05 per equity share with October 24, 2025 as the record date.",
            "Sentiment": "positive",
            "PublishDate": 1760516262412,
            "Source": "earnings"
        },
        {
            "Title": "IRFC Schedules Q2 Results Review for October 15",
            "Summary": "Indian Railway Finance Corporation (IRFC) has announced it will review its Q2 results on October 15. The company has set this date for examining its quarterly financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1759835658150,
            "Source": "earnings"
        },
        {
            "Title": "IRFC Signs ₹16,489 Crore Loan Agreements for Thermal Power Projects in Haryana and Maharashtra",
            "Summary": "Indian Railway Finance Corporation Ltd (IRFC) signed two loan agreements totaling ₹16,489 crore to finance supercritical thermal power projects. The first agreement with Haryana Power Generation Corporation Limited (HPGCL) provides up to ₹5,929 crore for an 800 MW supercritical thermal power project at Deenbandhu Chhotu Ram Thermal Power Plant in Yamunanagar. The second agreement with Maharashtra State Power Generation Company Limited (MAHAGENCO) offers up to ₹10,560 crore for a 2x660 MW supercritical expansion project at Koradi Thermal Power Station in Nagpur, adding 1,320 MW capacity. Both projects will strengthen power supply for households, industries, and agriculture in their respective states. The partnerships benefit Indian Railways through coal transportation contracts and freight revenues, with both utilities relying on railway services for coal logistics from eastern coalfields.",
            "Sentiment": "positive",
            "PublishDate": 1759156272478,
            "Source": "stock"
        },
        {
            "Title": "IRFC Joins Consortium for ₹12,250 Crore Talcher Fertilizers Coal Gasification Project",
            "Summary": "IRFC has joined a consortium for Talcher Fertilizers' coal gasification project, providing loan assistance of ₹4,000 crore as part of a sanctioned debt package. The total debt component for the project amounts to ₹12,250 crore, with IRFC participating alongside other lenders. Additionally, the company has sanctioned a ₹126.40 billion loan to CSPGCL.",
            "Sentiment": "positive",
            "PublishDate": 1759104716507,
            "Source": "stock"
        },
        {
            "Title": "IRFC Extends INR 3,388.51 Crore Funding Support to PVUNL for Coal Block Development",
            "Summary": "Indian Railway Finance Corporation (IRFC) has provided loan assistance of INR 3,388.51 crore to Patratu Vidyut Utpadan Nigam Limited (PVUNL) for developing the Banhardih Coal Block in Latehar district, Jharkhand. PVUNL is a joint venture between NTPC Ltd. (74%) and Jharkhand Bijli Vitran Nigam Limited (26%), setting up a 4,000 MW coal-based thermal power project at Patratu in two phases. The Banhardih captive coal block has estimated reserves of around 956 million tonnes and has been allocated to PVUNL for use in this project. Coal from this block will be transported through the Indian Railways network. IRFC, established in 1986 as the financing arm of the Ministry of Railways and recently accorded Navratna status, maintains a zero-NPA portfolio and is expanding its role as a diversified infrastructure financier covering projects with railway linkages including power generation, mining, and logistics.",
            "Sentiment": "positive",
            "PublishDate": 1758974685370,
            "Source": "stock"
        },
        {
            "Title": "IRFC Approves 126.40 Billion Rupees Loan for CSPGCL",
            "Summary": "Indian Railway Finance Corporation (IRFC) has approved a loan of 126.40 billion rupees for CSPGCL. The approval represents a significant financing decision by the railway financing entity.",
            "Sentiment": "positive",
            "PublishDate": 1758893021039,
            "Source": "order&deals"
        },
        {
            "Title": "IRFC Joins Group for Talcher Fertilizers' Coal Gas Project",
            "Summary": "IRFC has joined a group for Talcher Fertilizers' coal gas project. The project appears to be related to energy and fertilizer production.",
            "Sentiment": "neutral",
            "PublishDate": 1758891223096,
            "Source": "stock"
        },
        {
            "Title": "Moody's Maintains Baa3 Rating for IRFC with Stable Outlook",
            "Summary": "Moody's Ratings has confirmed its Baa3 credit rating for Indian Railway Finance Corporation (IRFC) and maintained a stable outlook for the company.",
            "Sentiment": "positive",
            "PublishDate": 1758601569435,
            "Source": "stock"
        },
        {
            "Title": "IRFC Completes ₹1,125 Crore Refinancing for Bhartiya Rail Bijlee Company",
            "Summary": "IRFC has completed a refinancing transaction for Bhartiya Rail Bijlee Company Limited worth ₹1,125 crore. The refinancing represents a significant financial transaction involving the railway finance company.",
            "Sentiment": "positive",
            "PublishDate": 1755760812343,
            "Source": "stock"
        },
        {
            "Title": "IRFC Shares Fall 50% from Peak Despite Double-Digit Profit Growth",
            "Summary": "Indian Railway Finance Corporation (IRFC) shares have declined 50% from their 52-week high and 30% over the past year, despite reporting net profit growth of 11% to Rs 1,746 crore in quarterly results. The stock has fallen 3% since the results announcement and now trades below key moving averages. Technical analysts identify Rs 130 as crucial resistance, with the stock currently finding support at Rs 124. Experts suggest the stock needs to sustain above Rs 130 for potential targets of Rs 138 and Rs 145. IRFC's revenue from operations rose 2% to Rs 6,915 crore. The underperformance reflects broader weakness in railway stocks, with companies like RVNL, IRCTC, and others declining 22-43% over one year.",
            "Sentiment": "negative",
            "PublishDate": 1755664474849,
            "Source": "stock"
        },
        {
            "Title": "IRFC Sanctions ₹199.70 Crore Loan for India's First Multi-Modal Transport Hub at Surat",
            "Summary": "Indian Railway Finance Corporation (IRFC) has sanctioned and executed a term loan facility of ₹199.70 crore with Surat Integrated Transportation Development Corporation Limited (SITCO) to support the development of the Surat Multi-Modal Transport Hub (MMTH). The loan agreement was signed at SITCO's New Delhi office between officials from both organizations. SITCO is a joint venture of the Ministry of Railways and Government of Gujarat, developing India's first international-standard Multi-Modal Transport Hub at Surat. The project will integrate rail, metro, BRTS, city and regional buses, and intermediate transport modes while upgrading passenger amenities and station infrastructure. IRFC, established in 1986 as the financing arm of the Ministry of Railways and recently accorded 'Navratna' status, maintains a zero-NPA portfolio and is expanding its role as a diversified infrastructure financier within the railway ecosystem.",
            "Sentiment": "positive",
            "PublishDate": 1755609673981,
            "Source": "stock"
        },
        {
            "Title": "IRFC Completes Refinancing for Angul Sukinda Railway Limited",
            "Summary": "IRFC has completed refinancing for Angul Sukinda Railway Limited with the objective of enhancing project viability.",
            "Sentiment": "positive",
            "PublishDate": 1754904566188,
            "Source": "stock"
        },
        {
            "Title": "IRFC Reports Strong Q1 Results, Targets INR 30,000 Crore Disbursements in FY26",
            "Summary": "Indian Railway Finance Corporation reported improved quarterly results with Net Interest Margin rising to 1.51% from 1.31% in the previous quarter and profit after tax growing 11% year-on-year. The company has sanctioned INR 25,000 crores worth of projects and disbursed INR 3,000 crores in Q1. IRFC is expanding beyond Indian Railways through its 'IRFC 2.0' strategy, now funding railway ecosystem entities including NTPC, metro projects, and renewable energy companies with railway linkages. The company maintains zero NPAs and targets INR 60,000 crores in sanctions and INR 30,000 crores in disbursements for the full year. Management expects stronger disbursements in Q2 due to refinancing projects and aims to cross INR 5 lakh crores in assets under management by FY27. The company's cost of capital is around 7% and it continues to benefit from tax exemptions for the next 5-7 years due to unabsorbed depreciation.",
            "Sentiment": "positive",
            "PublishDate": 1753882272100,
            "Source": "earnings"
        },
        {
            "Title": "IRFC Secures $300 Million External Commercial Borrowing from Sumitomo Mitsui Banking Corporation",
            "Summary": "Indian Railway Finance Corporation Limited (IRFC) has issued a Letter of Award for an External Commercial Borrowing of JPY equivalent USD 300 million for a 5-year term to Sumitomo Mitsui Banking Corporation. The facility features bullet repayment and semi-annual interest payments. The net proceeds from the ECB will be utilized in accordance with the ECB Regulations of the Reserve Bank of India.",
            "Sentiment": "positive",
            "PublishDate": 1753881833007,
            "Source": "stock"
        },
        {
            "Title": "IRFC Reports Strong Q2 Disbursement Performance",
            "Summary": "IRFC reported strong disbursement performance in Q2 and expects to achieve 50% or more of its FY26 target.",
            "Sentiment": "positive",
            "PublishDate": 1753252473009,
            "Source": "stock"
        },
        {
            "Title": "IRFC Reports Zero Non-Performing Assets in Loan Portfolio",
            "Summary": "Indian Railway Finance Corporation (IRFC) has maintained a clean loan book with no non-performing assets. The company continues to keep its lending portfolio free from bad loans.",
            "Sentiment": "positive",
            "PublishDate": 1753198045009,
            "Source": "stock"
        },
        {
            "Title": "IRFC Reports Record Quarterly Performance with 10.71% PAT Growth",
            "Summary": "Indian Railway Finance Corporation Limited reported its strongest quarterly performance for the quarter ended June 30, 2025. The company achieved total income of Rs. 6,918.24 crore compared to Rs. 6,766.03 crore in the same period last year. Profit After Tax grew by 10.71% to Rs. 1,745.69 crore versus Rs. 1,576.83 crore in the corresponding quarter of the previous year. Net interest margin improved to 1.53% (annualized), marking the best performance in three years. The company's net worth reached Rs. 54,423.96 crore, the highest since inception, with a book value of Rs. 41.65 per share. The debt-to-equity ratio improved to 7.44, and the company maintained zero non-performing assets. The Board also approved a General Corporate Purpose Term Loan/Working Capital Term Loan/Short Term Loan Policy. This marks the first full quarter since IRFC was granted Navratna status by the Government of India.",
            "Sentiment": "positive",
            "PublishDate": 1753190752420,
            "Source": "earnings"
        },
        {
            "Title": "IRFC to Announce Q1 FY26 Results on July 22, Stock Down 34.77% Over Past Year",
            "Summary": "Indian Railway Finance Corporation Ltd. (IRFC) will announce its financial results for the quarter ended June 2025 on Tuesday, July 22. The Board of Directors meeting will consider and approve unaudited financial results for the first quarter of FY26. The company's trading window has been closed since July 1, 2025, and will remain shut until 48 hours after results declaration. An earnings call is scheduled for July 23 at 11 a.m., featuring Chairman and Managing Director Manoj Kumar Dubey and Director Finance Randhir Sahay. In the previous quarter ended March 2025, IRFC reported a 2% decline in net profit to Rs 1,681.87 crore, while revenue from operations increased 3.8% to Rs 6,723.80 crore. IRFC shares have declined significantly, falling 34.77% over the past year, with a 52-week high of Rs 212 and low of Rs 108.04. The stock was trading 0.35% lower at Rs 133.37 on Monday morning.",
            "Sentiment": "negative",
            "PublishDate": 1753072365254,
            "Source": "earnings"
        },
        {
            "Title": "Indian Railway Finance Corporation: Government Approves Rs 10,000 Crore Deep-Discount Bond Issue",
            "Summary": "IRFC received government approval to raise up to Rs 10,000 crore through deep-discount bonds with a 10-year maturity. The issuance, to be completed by March 2027, will be offered at a Rs 4,916 crore discount to face value. This move is part of a broader shift in funding strategy for state-run enterprises. IRFC shares rallied 6.4% to Rs 138.50 on the BSE following the news.",
            "Sentiment": "positive",
            "PublishDate": 1747378601000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Railway Finance Corp: Diversification to Boost Net Interest Margin",
            "Summary": "IRFC aims for 2%+ NIM in FY25 by diversifying into high-margin non-railway assets. Targeting Rs 30,000 crore loan disbursements by FY26, focusing on metro and rapid rail projects. Expects margins to triple compared to previous railway lending. Board approves Rs 60,000 crore fundraising for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1745979182000,
            "Source": "normal_news"
        },
        {
            "Title": "Indian Railway Finance Corporation: Q4 Profit Dips, Plans ₹60,000 Crore Fundraise",
            "Summary": "IRFC reported a 2% YoY decline in Q4 net profit to ₹1,682 crore, while revenue increased 4% to ₹6,723 crore. The company plans to raise ₹60,000 crore in FY26 through various bond issues. The government holds an 86.36% stake in IRFC.",
            "Sentiment": "neutral",
            "PublishDate": 1745829847000,
            "Source": "earnings"
        },
        {
            "Title": "IRFC Approves Resource Raising Plan for FY 2025-26",
            "Summary": "Indian Railway Finance Corporation (IRFC) has approved a plan to raise resources up to 600 billion rupees for the fiscal year 2025-26.",
            "Sentiment": "positive",
            "PublishDate": 1745829354000,
            "Source": "result"
        },
        {
            "Title": "IRFC Reports Mixed Q4 Financial Results",
            "Summary": "Indian Railway Finance Corporation (IRFC) has released its Q4 financial results. The company reported revenue of 67 billion rupees, up from 64.73 billion rupees year-over-year. However, net profit slightly decreased to 16.8 billion rupees from 17.17 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1745829220000,
            "Source": "result"
        },
        {
            "Title": "Indian Railway Finance Corporation: Q4 FY25 Results Announcement Next Week",
            "Summary": "IRFC to announce Q4 and FY25 results on April 28, 2025. Board meeting to approve financial results and market borrowing programme for FY26. Trading window closed from April 1 until 48 hours post-results. Earnings call scheduled for April 29.",
            "Sentiment": "neutral",
            "PublishDate": 1745641868000,
            "Source": "corporate_action"
        },
        {
            "Title": "Indian Railway Finance Corporation: Board Meeting Rescheduled for Q4FY25 Results",
            "Summary": "IRFC has rescheduled its board meeting to April 28, 2025, from April 29, 2025, to declare Q4FY25 results and approve the FY2025-26 market borrowing program. Trading window remains closed until 48 hours after results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1745317659000,
            "Source": "corporate_action"
        },
        {
            "Title": "IRFC Reschedules Board Meeting for Q4 Results and FY 2025-26 Market Borrowing Programme",
            "Summary": "Indian Railway Finance Corporation (IRFC) has rescheduled its board meeting from Tuesday, 29th April, 2025 to Monday, 28th April, 2025. The meeting will consider Q4 results and the market borrowing programme for FY 2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1745243799000,
            "Source": "default"
        }
    ]
}