{
    "Symbol": "IRIS",
    "ISIN": "INE864K01010",
    "News": [
        {
            "Title": "IRIS RegTech Wins DRR Solution Contract from NEC",
            "Summary": "IRIS RegTech Solutions Limited secured a contract from NEC Corporation India for designing, developing and maintaining a Digital Regulatory Reporting solution for IFSCA over seven years.",
            "Sentiment": "positive",
            "PublishDate": 1769681255645,
            "Source": "co_actions_results"
        },
        {
            "Title": "IRIS RegTech Shareholders Approve Independent Director",
            "Summary": "IRIS RegTech Solutions Limited shareholders overwhelmingly approved the appointment of Mr. Madhavan Hariharan as Independent Director through postal ballot with 99.99% votes in favor.",
            "Sentiment": "positive",
            "PublishDate": 1768830371583,
            "Source": "stocks"
        },
        {
            "Title": "IRIS Peridot Launches Business Loan Pilot for MSMEs",
            "Summary": "IRIS RegTech Solutions launches pilot program enabling business loans through IRIS Peridot platform for MSMEs, partnering with multiple lenders to simplify credit access for small businesses.",
            "Sentiment": "positive",
            "PublishDate": 1767770866714,
            "Source": "stocks"
        },
        {
            "Title": "IRIS RegTech Postal Ballot Results Announced",
            "Summary": "IRIS RegTech Solutions Limited announced successful postal ballot results with 99.99% approval for Mr. Madhavan Hariharan's appointment as Independent Director, effective from November 14, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766043931110,
            "Source": "stocks"
        },
        {
            "Title": "IRIS RegTech Extends South African Banking Contract",
            "Summary": "IRIS RegTech Solutions receives formal confirmation for extension of existing engagement with Xpert Decisions Systems for continued implementation and support of CODI deposit insurance solution for South African Reserve Bank.",
            "Sentiment": "positive",
            "PublishDate": 1765452626160,
            "Source": "co_actions_results"
        },
        {
            "Title": "IRIS Business Services Limited Changes Name to IRIS RegTech Solutions Limited",
            "Summary": "IRIS Business Services Limited has officially changed its name to IRIS RegTech Solutions Limited effective November 28, 2025, following receipt of a fresh certificate of incorporation from the Ministry of Corporate Affairs. The company has informed stock exchanges BSE and NSE about the name change and will submit requisite documents to complete the transition process.",
            "Sentiment": "neutral",
            "PublishDate": 1764319847522,
            "Source": "corporate_action"
        },
        {
            "Title": "IRIS Business Services Independent Director Vinod Agarwala Completes Second Term",
            "Summary": "Mr. Vinod Agarwala (DIN: 01725158) completed his second term as Independent Director of IRIS Business Services Limited on November 26, 2025, ending his tenure as Chairman of the Board and member of Audit Committee and Nomination and Remuneration Committee. His three consecutive year term ran from November 27, 2022 to November 26, 2025, with the company expressing appreciation for his valuable guidance and contributions during his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1764240872081,
            "Source": "corporate_governance"
        },
        {
            "Title": "IRIS Business Services Shareholders Approve Company Name Change to IRIS RegTech Solutions",
            "Summary": "IRIS Business Services Limited shareholders approved a special resolution to change the company name to IRIS RegTech Solutions Limited through postal ballot voting that concluded on November 23, 2025. The resolution passed with 99.99% approval from 9,045,571 shares voted, representing 43.99% of outstanding shares, with corresponding amendments to the company's constitutional documents.",
            "Sentiment": "positive",
            "PublishDate": 1763976361084,
            "Source": "corporate_action"
        },
        {
            "Title": "IRIS Business Services Reports 14% ARR Growth in RegTech Amid Margin Pressure from Strategic Investments",
            "Summary": "IRIS Business Services achieved 14% ARR growth in its CARBON platform during the first half, driven by Disclosure Management offerings, while adding Qatar Central Bank and Qatar Tax Authority as new SupTech clients. The company's operating margins dropped to 8% in Q2 as it significantly increased sales and marketing investments by 26% in employee expenses to scale its SaaS business, with management targeting 35% ARR growth for the full year.",
            "Sentiment": "neutral",
            "PublishDate": 1763735115341,
            "Source": "earnings"
        },
        {
            "Title": "IRIS Business Services Reports Strong Q2 Results, Completes Strategic Divestment and Board Changes",
            "Summary": "IRIS Business Services approved unaudited financial results for quarter and half year ended September 30, 2025, alongside completing strategic divestment of Tax Technology GST Application Service Provider business and 100% equity stake in IRIS Logix Solutions to Sovos Compliance Limited. The company appointed Madhavan Hariharan as Additional Independent Director for 5 years while Haseeb Drabu ceased as Independent Director upon completion of his tenure.",
            "Sentiment": "mixed",
            "PublishDate": 1763117362722,
            "Source": "earnings"
        },
        {
            "Title": "IRIS Business Services Independent Director Completes Five-Year Term",
            "Summary": "Mr. Haseeb Drabu ceased to be an Independent Director of IRIS Business Services Limited upon completion of his first five-year term on November 12, 2025. He also stepped down from his roles as Chairman of the Risk Management Committee and member of the Audit Committee, with the company notifying stock exchanges of the change.",
            "Sentiment": "positive",
            "PublishDate": 1763064195541,
            "Source": "earnings"
        },
        {
            "Title": "IRIS Business Services Allots 10,000 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "IRIS Business Services Limited allotted 10,000 equity shares of face value Rs. 10 each to eligible employees who exercised options under the company's Employee Stock Option Scheme 2017. The allotment increased the company's equity share capital to 2,05,68,247 shares totaling Rs. 20,56,82,470, with the new shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763042756661,
            "Source": "corporate_action"
        },
        {
            "Title": "IRIS Business Services Schedules Q2 FY26 Results Announcement and Earnings Call",
            "Summary": "IRIS Business Services Limited will announce its second quarter and half year FY26 results on November 13, 2025. The company has scheduled an earnings call for analysts and investors on November 14, 2025, at 4:00 PM IST. The call will be accessible through universal numbers and international toll-free numbers for various countries including USA, UK, Singapore, and Hong Kong. The management representation will include Co-Founders K. Balachandran and Deepta Rangarajan, Whole Time Director CTO P.K.X. Thomas, and Chief Financial Officer Vineet Kandoi. IRIS Business Services is a Global RegTech company listed on BSE and NSE, serving over 6,000 clients worldwide with regulatory reporting software solutions.",
            "Sentiment": "neutral",
            "PublishDate": 1762817227500,
            "Source": "earnings"
        },
        {
            "Title": "IRIS Business Services Partners with Board International",
            "Summary": "IRIS Business Services has entered into a partnership with Board International. The collaboration brings together the two companies, though specific details about the nature of the partnership, its scope, or expected outcomes were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1762271739207,
            "Source": "order&deals"
        },
        {
            "Title": "IRIS Business Services Wins Qatar Tax Authority Contract for XBRL Financial Reporting Solutions",
            "Summary": "IRIS Business Services Limited has been awarded Contract No. 4629/2025 by the General Tax Authority of Qatar for implementing and supporting financial reports in XBRL format. The 6-year international contract covers implementation, installation, operation, maintenance, and technical support services. This marks IRIS's first SupTech project with a tax authority and strengthens the company's position in the Middle East market. The contract value remains confidential. IRIS must submit a Performance Bank Guarantee and other statutory documents before formal contract execution. The company describes this as a strategically significant win that enhances its global positioning as a provider of SupTech and RegTech solutions.",
            "Sentiment": "positive",
            "PublishDate": 1759309344717,
            "Source": "order&deals"
        },
        {
            "Title": "IRIS Business Services Reports 10% Topline Growth in Q1 FY2026, Ramps Up Regtech Investments",
            "Summary": "IRIS Business Services Limited reported 10% topline growth for the first quarter of FY2026 while scaling its SaaS business in enterprise technology. The company is in an investment phase focused on growing its Suptech and Regtech business lines following the divestment of its Taxtech business. The Suptech division performed well with 19% year-over-year revenue growth and improved margins, securing a prestigious award from Qatar Central Bank in partnership with Accenture to build a digital reporting platform. IRIS launched its AI-enabled automated XBRL report creation product, IRIS Instant, in Malaysian markets. The Regtech business saw IRIS Carbon achieve 10% growth in Annual Recurring Revenue on a quarter-over-quarter basis, with the new Disclosure Management product gaining over two dozen international customers at higher subscription values. However, some anticipated orders for automated data flow solutions in the BFSI segment were deferred to future periods. The company is investing in sales and marketing infrastructure and product strengthening to meet global enterprise customer demands.",
            "Sentiment": "positive",
            "PublishDate": 1755100296950,
            "Source": "earnings"
        },
        {
            "Title": "IRIS Business Services Reports 94% Drop in Q1 Net Profit Despite Revenue Growth",
            "Summary": "IRIS Business Services reported a consolidated net profit of 1.7 million rupees in Q1, marking a significant decline from 28.2 million rupees in the same period last year. The company's revenue increased to 298 million rupees compared to 276.5 million rupees year-over-year, representing growth in the top line despite the substantial drop in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1755077029862,
            "Source": "earnings"
        },
        {
            "Title": "IRIS Business Services Completes Sale of 95% Stake in IRIS Logix to Sovos Compliance",
            "Summary": "IRIS Business Services Limited has completed the sale of its 95% equity stake in IRIS Logix Solutions Private Limited to Sovos Compliance Limited, UK. The transaction was part of a divestment of the company's GST ASP Services Business and was approved by the Board of Directors on July 02, 2025. The sale involved multiple steps including acquiring a 48.99% stake from minority partner Logistics Fund India LLP, transferring a 5% stake to Sovos, Sovos investing through convertible debentures, and transferring the GST ASP Services Business to IRIS Logix on a slump sale basis.",
            "Sentiment": "neutral",
            "PublishDate": 1754404059412,
            "Source": "order&deals"
        },
        {
            "Title": "IRIS Business Services Completes ₹140.57 Crore GST ASP Business Transfer to Subsidiary",
            "Summary": "IRIS Business Services Limited has completed the transfer of its GST Application Service Provider (ASP) Services Business to its subsidiary, IRIS Logix Solutions Private Limited, for ₹1,405.7 million. The transfer was executed as a slump sale on a going concern basis, effective August 1, 2025, under a Business Transfer Agreement dated July 2, 2025. This transaction forms part of a larger composite deal with Sovos Compliance Limited, UK. The transfer follows shareholder approval obtained on July 26, 2025, and was preceded by IRIS acquiring a 48.99% stake in IRIS Logix from minority partner Logistics Fund India LLP, transferring 5% equity stake to Sovos, and Sovos making an investment in IRIS Logix through compulsorily convertible debentures.",
            "Sentiment": "neutral",
            "PublishDate": 1754059888406,
            "Source": "corporate_action"
        },
        {
            "Title": "IRIS Business Services Completes 5% Stake Sale in IRIS Logix to UK's Sovos Compliance",
            "Summary": "IRIS Business Services Limited has completed the sale of 5% equity stake in IRIS Logix Solutions Private Limited to Sovos Compliance Limited, UK. The transaction was approved by the Board of Directors on July 2, 2025, and forms part of a larger divestment of the company's GST ASP Services Business. The sale follows the acquisition of a 48.99% stake in IRIS Logix from minority joint venture partner Logistics Fund India LLP. The transaction represents a sequence of steps in the divestment of IRIS Business Services' GST ASP Services Business to IRIS Logix and the associated stake transfer to Sovos.",
            "Sentiment": "neutral",
            "PublishDate": 1753962316373,
            "Source": "order&deals"
        },
        {
            "Title": "IRIS Business Services Shareholders Approve Transfer of GST ASP Services Business to IRIS Logix Solutions",
            "Summary": "IRIS Business Services Limited held an Extra-Ordinary General Meeting on July 26, 2025, through video conferencing to vote on a related party transaction. The resolution to approve the transfer of the company's GST ASP Services Business to IRIS Logix Solutions Private Limited was passed with unanimous support. Out of 98 members who participated in remote e-voting, representing 4,836,546 shares (23.55% of outstanding shares), all voted in favor of the resolution with 100% assent and 0% dissent. The voting process was conducted through National Securities Depository Limited's e-voting platform, with shareholders holding shares as of July 19, 2025, being eligible to vote. The scrutinizer's report confirmed the resolution was passed with the requisite majority.",
            "Sentiment": "positive",
            "PublishDate": 1753527867906,
            "Source": "corporate_action"
        },
        {
            "Title": "Iris Business Sells Tax Technology Division for 151 Crore Rupees",
            "Summary": "Iris Business has sold its Tax Technology Division for 151 Crore Rupees. The news indicates a significant business transaction involving the company's divestment of a specific division.",
            "Sentiment": "neutral",
            "PublishDate": 1751508939000,
            "Source": "default"
        },
        {
            "Title": "Iris Business Services to Sell GST ASP Business and Subsidiary to Sovos",
            "Summary": "Iris Business Services has announced the sale of its GST ASP (Application Service Provider) business and its subsidiary, Iris Logix, to Sovos for ₹151.24 crore. This corporate action represents a significant business transaction for Iris Business Services.",
            "Sentiment": "positive",
            "PublishDate": 1751475843000,
            "Source": "default"
        },
        {
            "Title": "IRIS Business Services Reports Q4 EBITDA Decline",
            "Summary": "IRIS Business Services experienced a decrease in Q4 EBITDA, dropping to 50 million rupees from 64 million rupees year-over-year. The company's EBITDA margin also declined, falling to 14.52% from 21.15% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1747230501000,
            "Source": "result"
        },
        {
            "Title": "IRIS Business Services Reports Q4 Financial Results",
            "Summary": "IRIS Business Services announced its Q4 consolidated net profit of 28 million rupees, down from 47 million rupees year-over-year and 35 million rupees quarter-over-quarter. The company's Q4 revenue increased to 346 million rupees from 304 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747230257000,
            "Source": "result"
        },
        {
            "Title": "IRIS Business Services Selected for Qatar Central Bank Regulatory Tech Project",
            "Summary": "IRIS Business Services has been chosen by Accenture to participate in a regulatory technology project with Qatar Central Bank. The project involves implementing an XBRL-based data platform, which is likely aimed at enhancing financial reporting and data management capabilities for the central bank.",
            "Sentiment": "positive",
            "PublishDate": 1745063307000,
            "Source": "default"
        },
        {
            "Title": "IRIS Business Services: CEO S Swaminathan Passes Away",
            "Summary": "IRIS Business Services Limited announced the sudden death of CEO S Swaminathan due to cardiac arrest on March 26, 2025. The Board appointed CFO Krishnan Balachandran as interim head to oversee operations until a permanent successor is found.",
            "Sentiment": "negative",
            "PublishDate": 1743014682601,
            "Source": "corporate_governance"
        },
        {
            "Title": "Iris Business Services Signs MoU with Government of Goa for MSME Support",
            "Summary": "Iris Business Services has entered into a Memorandum of Understanding (MoU) with the Government of Goa. The agreement aims to provide data-led technology solutions for Micro, Small, and Medium Enterprises (MSMEs) in the state of Goa. This collaboration is expected to enhance the technological capabilities and efficiency of MSMEs in the region.",
            "Sentiment": "positive",
            "PublishDate": 1740010553000,
            "Source": "corporate_action"
        },
        {
            "Title": "IRIS Business Services Signs MOU with Government of Goa for MSME Solutions",
            "Summary": "IRIS Business Services has entered into a Memorandum of Understanding (MOU) with the Government of Goa. The agreement aims to provide data-driven technology solutions specifically tailored for Micro, Small, and Medium Enterprises (MSMEs) operating in the state of Goa.",
            "Sentiment": "positive",
            "PublishDate": 1739967462000,
            "Source": "corporate_action"
        },
        {
            "Title": "IRIS Business Services Reports Improved Q3 EBITDA and Margin",
            "Summary": "IRIS Business Services has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 50 million rupees, up from 35 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 15.26% from 12.87% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738324435000,
            "Source": "earnings"
        },
        {
            "Title": "IRIS Business Services Reports Q3 Financial Results",
            "Summary": "IRIS Business Services has announced its Q3 consolidated financial results. The company reported a net profit of 35 million rupees, showing a significant increase from 17 million rupees in the same quarter last year. Sequentially, the profit grew from 38 million rupees in the previous quarter. Revenue for Q3 stood at 328 million rupees, up from 273 million rupees in the corresponding period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738324361000,
            "Source": "earnings"
        },
        {
            "Title": "Iris Business Services Collaborates with Karnataka Government to Support MSME Growth",
            "Summary": "Iris Business Services has announced a collaboration with the Government of Karnataka to support the growth of the Micro, Small, and Medium Enterprises (MSME) ecosystem in the state. This partnership aims to foster development and provide support for MSMEs in Karnataka.",
            "Sentiment": "positive",
            "PublishDate": 1737073204000,
            "Source": "corporate_action"
        },
        {
            "Title": "IRIS Business Services Collaborates with Karnataka Government to Support MSME Growth",
            "Summary": "IRIS Business Services has announced a collaboration with the Government of Karnataka aimed at supporting the growth of the Micro, Small, and Medium Enterprises (MSME) ecosystem in the state. This partnership is expected to provide resources and assistance to help strengthen and develop the MSME sector in Karnataka.",
            "Sentiment": "positive",
            "PublishDate": 1737034899000,
            "Source": "corporate_action"
        },
        {
            "Title": "IRIS Business Services Reports Strong Q2 EBITDA Growth",
            "Summary": "IRIS Business Services has reported significant year-over-year improvements in its Q2 financial results. The company's EBITDA increased from 29 million rupees to 50 million rupees, representing a substantial growth. Additionally, the EBITDA margin expanded from 11.92% to 16.32%, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1730115632000,
            "Source": "result"
        },
        {
            "Title": "IRIS Business Services Reports Q2 Revenue Growth",
            "Summary": "IRIS Business Services has reported a revenue of 308 million rupees for the second quarter, compared to 240 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730115625000,
            "Source": "result"
        },
        {
            "Title": "IRIS Business Services Reports Q2 Profit Growth",
            "Summary": "IRIS Business Services has reported a consolidated net profit of 38 million rupees for the second quarter, showing significant growth compared to both the previous year and quarter. The profit increased from 13 million rupees year-over-year and from 28 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730115613000,
            "Source": "result"
        }
    ]
}