{
    "Symbol": "IRISDOREME",
    "ISIN": "INE01GN01025",
    "News": [
        {
            "Title": "IRIS Clothings Q3 Net Profit Rises 30% YoY to ₹30M",
            "Summary": "IRIS Clothings reported a strong 30% year-on-year growth in Q3 net profit, rising to ₹30 million from ₹23 million in the same period last year, demonstrating solid operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1770016041569,
            "Source": "co_actions_results"
        },
        {
            "Title": "IRIS Clothings Reports Strong Q2 Performance with EBITDA Rising to 188M Rupees",
            "Summary": "IRIS Clothings reported quarterly EBITDA of 188 million rupees compared to 50 million rupees in the same period last year. The company's EBITDA margin improved to 10.63% from 4.34% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1762414122045,
            "Source": "earnings"
        },
        {
            "Title": "IRIS Clothings Reports 7.9% Growth in Q2 Net Profit to 41 Million Rupees",
            "Summary": "IRIS Clothings reported a net profit of 41 million rupees for Q2, representing an increase from 38 million rupees in the same period last year. The company's revenue for the quarter reached 443 million rupees, up from 413 million rupees year-over-year, marking a 7.3% revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1762413693212,
            "Source": "earnings"
        },
        {
            "Title": "Iris Clothings Launches Kids Travel Wear Line",
            "Summary": "Iris Clothings has introduced a new line of travel wear for children in collaboration with Doreme. The company is expanding its product offerings in the kids' clothing segment, specifically targeting the travel market.",
            "Sentiment": "positive",
            "PublishDate": 1752570304000,
            "Source": "default"
        },
        {
            "Title": "IRIS Clothings Reports Q4 Financial Results",
            "Summary": "IRIS Clothings announced its Q4 financial results. The company's EBITDA increased to 81 million rupees from 71 million rupees year-over-year, with EBITDA margin improving to 20.16% from 16.81%. Net profit rose to 45 million rupees from 35 million rupees. However, revenue decreased to 402 million rupees from 421 million rupees compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747301976000,
            "Source": "result"
        },
        {
            "Title": "Iris Clothing Announces 1:1 Bonus Share Issue",
            "Summary": "Iris Clothing has declared a bonus share issue in the ratio of 1:1, meaning shareholders will receive one additional share for each share they currently hold. This corporate action aims to reward existing shareholders and potentially increase liquidity in the stock.",
            "Sentiment": "positive",
            "PublishDate": 1747301756000,
            "Source": "result"
        }
    ]
}