{
    "Symbol": "IRMENERGY",
    "ISIN": "INE07U701015",
    "News": [
        {
            "Title": "IRM Energy Q3 FY26 Earnings Call Highlights",
            "Summary": "IRM Energy reports 6% revenue growth to INR 265 crore in Q3 FY26 with 34% EBITDA growth. Company operates 127 CNG stations across 6 geographical areas serving 80,000+ customers.",
            "Sentiment": "positive",
            "PublishDate": 1770722120771,
            "Source": "co_actions_results"
        },
        {
            "Title": "IRM Energy schedules Q3 & 9M FY26 earnings call",
            "Summary": "IRM Energy Limited announces earnings conference call on February 05, 2026 at 11:00 AM IST to discuss Q3 & 9M FY26 financial results with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1769609686160,
            "Source": "co_actions_results"
        },
        {
            "Title": "IRM Energy Elevates Ashish Mittal to Senior Management",
            "Summary": "IRM Energy Limited has categorized Ashish Mittal, General Manager - Commercial & Marketing, as Senior Management Personnel effective December 29, 2025, following board approval.",
            "Sentiment": "positive",
            "PublishDate": 1767009191961,
            "Source": "stocks"
        },
        {
            "Title": "IRM Energy Independent Director C.K. Gopal Resigns",
            "Summary": "IRM Energy Limited announces resignation of Independent Director C.K. Gopal with immediate effect from December 15, 2025, citing personal reasons. He also ceases membership in key board committees.",
            "Sentiment": "neutral",
            "PublishDate": 1765880482950,
            "Source": "stocks"
        },
        {
            "Title": "IRM Energy Commissions 125th CNG Station in Gujarat",
            "Summary": "IRM Energy Limited achieves milestone with commissioning of its 125th CNG station in Banaskantha, Gujarat on December 15, 2025, taking only 282 days to expand from 100 to 125 stations.",
            "Sentiment": "positive",
            "PublishDate": 1765816849112,
            "Source": "stocks"
        },
        {
            "Title": "IRM Energy EVP Commercial Marketing Resigns",
            "Summary": "IRM Energy Limited announces resignation of Executive Vice President Commercial Marketing Raghuvir Solanki effective December 12, 2025, citing personal reasons after nine years of service.",
            "Sentiment": "neutral",
            "PublishDate": 1765552537650,
            "Source": "stocks"
        },
        {
            "Title": "IRM Energy Announces Senior Management Changes in Projects Division",
            "Summary": "IRM Energy's Executive Vice President-Projects Jayaprakash Narayana Murthy resigned due to personal circumstances effective December 8, 2025, with Prakash Singh Parihar appointed as Vice President-Projects from December 9, 2025. The company appointed Parihar, a seasoned professional with over 23 years of experience in City Gas Distribution sector, based on the Nomination and Remuneration Committee's recommendation.",
            "Sentiment": "neutral",
            "PublishDate": 1765208558831,
            "Source": "corporate_governance"
        },
        {
            "Title": "IRM Energy Submits Q2 FY25 IPO Proceeds Monitoring Report to Stock Exchanges",
            "Summary": "IRM Energy Limited filed its monitoring agency report for the quarter ended September 30, 2025, showing utilization of Rs 178.53 million from IPO proceeds toward City Gas Distribution network development in Namakkal and Tiruchirappalli. The company has Rs 2,343.78 million remaining unutilized from the original Rs 3,072.62 million allocated for CGD infrastructure, with unused funds deployed in fixed deposits earning 6.25-7.80% returns.",
            "Sentiment": "neutral",
            "PublishDate": 1763138421763,
            "Source": "stock"
        },
        {
            "Title": "IRM Energy Reports 10% Revenue Growth in Q2FY26, Appoints New CFO and Approves Amalgamation Scheme",
            "Summary": "IRM Energy Limited announced quarterly results for September 30, 2025, with revenue from operations reaching Rs. 2,594.40 million, representing a 10% increase from Rs. 2,315.20 million in the corresponding quarter of the previous year. Standalone profit after tax increased to Rs. 142.04 million compared to Rs. 129.43 million in Q2FY25, while consolidated PAT rose to Rs. 125.57 million from Rs. 120.12 million. The company's board approved the appointment of Arunkumar Saluru as Chief Financial Officer and Key Managerial Personnel effective November 12, 2025. Additionally, the board approved a draft scheme of amalgamation with Enertech Distribution Management Private Limited, which holds 21.12% of IRM Energy's equity share capital. The company's CNG sales volumes increased 20% to 31.89 mmscm, domestic sales volumes grew 42% to 2.43 mmscm, while industrial sales volumes decreased 6% to 19.74 mmscm. The company added 1,657 domestic customers, 12 commercial customers, and 4 CNG stations during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762998762847,
            "Source": "earnings"
        },
        {
            "Title": "IRM Energy Limited CFO Harshal Anjaria Resigns Due to Personal Reasons",
            "Summary": "IRM Energy Limited announced that Mr. Harshal Anjaria has resigned from his position as Chief Financial Officer, effective from the close of business hours on October 17, 2025. Anjaria cited personal reasons for his resignation in his letter dated March 31, 2025. He had been with the company since July 11, 2016, joining during the company's formative years as part of the core team. In his resignation letter, Anjaria expressed gratitude for his tenure and committed to ensuring a smooth transition of his responsibilities. The company had previously issued intimations regarding this resignation on May 22, 2025 and June 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760773894924,
            "Source": "corporate_governance"
        },
        {
            "Title": "IRM Energy Increases Stake in Venuka Polymers to 50% Through Rights Issue",
            "Summary": "IRM Energy Limited acquired 10,50,800 additional equity shares in Venuka Polymers Private Limited through a rights issue for Rs. 1.05 crores. The acquisition increased IRM Energy's shareholding in the associate company from 33.33% to 50%, representing a 16.67% increase. Venuka Polymers operates in manufacturing and distributing irrigation systems and various polymer pipes and fittings, with a turnover of Rs. 97.45 crores for the financial year ended March 31, 2025. The company was incorporated in December 2019 and has shown consistent revenue growth over the past three years. The transaction was conducted on an arm's length basis with no promoter group interest in the acquired entity.",
            "Sentiment": "positive",
            "PublishDate": 1760531712952,
            "Source": "corporate_action"
        },
        {
            "Title": "IRM Energy Limited's COO Prashant Sagar Steps Down",
            "Summary": "IRM Energy Limited announced that Mr. Prashant Sagar has resigned from his position as Executive Vice President – Projects and Chief Operating Officer (COO). His resignation became effective at the close of business hours on September 22, 2025. Sagar, who was designated as Senior Management Personnel, cited pursuing new opportunities as the reason for his departure. The company had previously intimated about his resignation on August 01, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758623829243,
            "Source": "corporate_governance"
        },
        {
            "Title": "IRM Energy Submits IPO Proceeds Monitoring Report for Quarter Ended June 30, 2025",
            "Summary": "IRM Energy Limited submitted a monitoring agency report detailing the utilization of proceeds from its Initial Public Offer for the quarter ended June 30, 2025. The company raised Rs 4,957.59 million in net proceeds through its IPO conducted from October 18-20, 2023. Out of the total proceeds, Rs 2,430.56 million has been utilized as of June 30, 2025, leaving Rs 2,527.03 million unutilized. The funds were allocated for three main purposes: Rs 3,072.62 million for developing City Gas Distribution network in Namakkal and Tiruchirappalli (Tamil Nadu), Rs 1,350 million for debt repayment (fully utilized), and Rs 534.97 million for general corporate purposes. The monitoring report by CRISIL Ratings Limited shows no deviations from disclosed objects and confirms all utilization is as per the offer document. The unutilized funds are invested in fixed deposits with banks earning returns between 3.75% to 7.80%.",
            "Sentiment": "neutral",
            "PublishDate": 1754309968196,
            "Source": "stock"
        },
        {
            "Title": "IRM Energy Executive VP and COO Prashant Sagar's Resignation Remains Unfinalized Due to Incomplete Documentation",
            "Summary": "IRM Energy Limited disclosed that Mr. Prashant Sagar resigned from his position as Executive Vice President (Projects) and Chief Operating Officer on April 30, 2025, citing pursuit of new opportunities. He intended to serve a notice period until July 31, 2025. However, the company has been unable to finalize his cessation date as Mr. Sagar has not provided complete information and documents despite multiple requests sent in May and July 2025. The company closed the trading window for designated persons upon receiving the resignation letter, treating it as unpublished price sensitive information. IRM Energy will disclose the final cessation date once all required documentation is submitted.",
            "Sentiment": "negative",
            "PublishDate": 1754047991391,
            "Source": "corporate_governance"
        },
        {
            "Title": "Irm Energy Plans ₹8,600 Crore Investment for CNG Infrastructure and Biogas Expansion",
            "Summary": "Irm Energy has announced plans to invest ₹8,600 crore to develop four key areas as part of its sustainable growth strategy. The investment will focus on CNG infrastructure expansion, biogas partnerships, and PNG market penetration. The company aims to maintain strong profits and capital efficiency while pursuing this expansion plan.",
            "Sentiment": "positive",
            "PublishDate": 1753979071269,
            "Source": "stock"
        },
        {
            "Title": "IRM Energy Reports Q1 FY2026 Results, Declares Rs. 1.50 Dividend and Approves Merger Plans",
            "Summary": "IRM Energy Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing consolidated revenue from operations of Rs. 2,854.78 million compared to Rs. 2,438.93 million in the same quarter last year. Consolidated profit after tax decreased to Rs. 139.21 million from Rs. 187.03 million year-over-year. The company declared a dividend of Rs. 1.50 per equity share with record date set for September 18, 2025. The Board scheduled the Annual General Meeting for September 25, 2025, and gave in-principle approval for merger with Enertech Distribution Management Private Limited. The company recognized an impairment loss of Rs. 37.52 million on receivables from joint venture Ni-Hon Cylinders Private Limited due to uncertainty in recoverability. CNG sales volumes increased 21% year-over-year to 32.35 mmscm, while overall sales volume grew 14% to 54.80 mmscm. The Board also categorized Mr. Jayaprakash Narayana Murthy as Senior Management Personnel effective August 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753976299900,
            "Source": "earnings"
        },
        {
            "Title": "IRM Energy Reports Q1 FY2026 Results, Declares Rs. 1.50 Dividend and Approves Merger Plans",
            "Summary": "IRM Energy Ltd's board approved unaudited Q1 FY2026 financial results showing consolidated profit after tax of Rs. 139.21 million compared to Rs. 187.03 million in the same quarter last year. Revenue from operations increased to Rs. 2,854.78 million from Rs. 2,438.93 million year-on-year. The board declared a dividend of Rs. 1.50 per share with record date set for September 18, 2025, and scheduled the Annual General Meeting for September 25, 2025. The company gave in-principle approval for merger with Enertech Distribution Management Private Limited, subject to due diligence and regulatory approvals. IRM Energy recognized an impairment loss of Rs. 37.52 million on receivables from joint venture Ni-Hon Cylinders due to recovery uncertainties. The board also categorized Jayaprakash Narayana Murthy as Senior Management Personnel effective August 1, 2025. Overall sales volume increased 14% to 54.80 mmscm, with CNG volumes growing 21% to 32.35 mmscm.",
            "Sentiment": "neutral",
            "PublishDate": 1753975217055,
            "Source": "corporate_action"
        },
        {
            "Title": "IRM Energy Schedules Board Meeting for Q2 2025 Results on July 31",
            "Summary": "IRM Energy Limited has scheduled a Board of Directors meeting for July 31, 2025 to consider and approve unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company has implemented a trading window closure for its securities from July 1, 2025 through August 2, 2025, which extends until 48 hours after the financial results declaration. The trading restriction is part of the company's insider trading prevention code.",
            "Sentiment": "neutral",
            "PublishDate": 1753436309989,
            "Source": "corporate_action"
        },
        {
            "Title": "IRM Energy Announces Gas Allocation Reduction and Mitigation Strategy",
            "Summary": "IRM Energy has announced a 20% reduction in APM gas allocation starting from April 16, 2025. To counteract this reduction, the company has implemented a strategy involving new well gas, which is expected to minimize the impact on the company's profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1744791579000,
            "Source": "default"
        },
        {
            "Title": "IRM Energy Signs RLNG Purchase Agreement with Shell Energy India",
            "Summary": "IRM Energy has executed a Regasified Liquefied Natural Gas (RLNG) purchase agreement with Shell Energy India. Under this agreement, IRM Energy will purchase a total quantity of 1,23,21,200 MMBtu of RLNG from Shell Energy India.",
            "Sentiment": "neutral",
            "PublishDate": 1743034528000,
            "Source": "corporate_action"
        },
        {
            "Title": "IRM Energy Signs RLNG Purchase Agreement with Shell Energy India",
            "Summary": "IRM Energy has announced the execution of a Regasified Liquefied Natural Gas (RLNG) purchase agreement with Shell Energy India. Under this agreement, IRM Energy will purchase a total quantity of 1,23,21,200 MMBTU of RLNG from Shell Energy India.",
            "Sentiment": "positive",
            "PublishDate": 1742987882000,
            "Source": "corporate_action"
        },
        {
            "Title": "IRM Energy Inaugurates 100th CNG Station in Gujarat",
            "Summary": "IRM Energy has achieved a significant milestone by inaugurating its 100th Compressed Natural Gas (CNG) station in Banaskantha, Gujarat, India. This expansion marks a notable growth in the company's infrastructure for alternative fuel distribution.",
            "Sentiment": "positive",
            "PublishDate": 1741575868000,
            "Source": "corporate_action"
        },
        {
            "Title": "Irm Energy Reports Q3 Financial Results",
            "Summary": "Irm Energy has announced its Q3 financial results. The company's consolidated net profit for the quarter stands at 101 million rupees, down from 238 million rupees year-over-year and 120 million rupees quarter-over-quarter. However, the company's revenue has increased to 2.73 billion rupees, up from 2.43 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739233226000,
            "Source": "earnings"
        },
        {
            "Title": "IRM Energy Reports Decline in Q3 EBITDA and Margin",
            "Summary": "IRM Energy's third-quarter EBITDA decreased to 222 million rupees from 422.4 million rupees in the same period last year. The company's EBITDA margin also fell to 8.12% from 17.39% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739206658000,
            "Source": "earnings"
        },
        {
            "Title": "IRM Energy Reports Q3 Revenue Increase",
            "Summary": "IRM Energy has announced its third quarter revenue, which stands at 2.73 billion rupees. This represents an increase from the previous year's figure of 2.43 billion rupees for the same quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739206650000,
            "Source": "earnings"
        },
        {
            "Title": "IRM Energy Reports Q3 Consolidated Net Profit of 101 Million Rupees",
            "Summary": "IRM Energy has announced its Q3 consolidated net profit of 101 million rupees. This represents a decrease from 238 million rupees year-over-year and a decrease from 120 million rupees quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1739206643000,
            "Source": "earnings"
        },
        {
            "Title": "IRM Energy to Pay Rs 35 Crore to Preference Shareholder",
            "Summary": "IRM Energy has announced that it will pay Rs 35 crore to its preference shareholder. This payment will be made from the company's profits.",
            "Sentiment": "positive",
            "PublishDate": 1735638435000,
            "Source": "corporate_action"
        },
        {
            "Title": "IRM Energy Reports Decline in Q2 EBITDA and Margin",
            "Summary": "IRM Energy's Q2 EBITDA decreased to 264.8 million rupees from 419.6 million rupees year-over-year. The company's EBITDA margin also fell to 10.58% from 17.7% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731518622000,
            "Source": "result"
        },
        {
            "Title": "IRM Energy Reports Q2 Revenue Growth",
            "Summary": "IRM Energy has announced its second quarter revenue results. The company reported revenue of 2.5 billion rupees, compared to 2.4 billion rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731518615000,
            "Source": "result"
        },
        {
            "Title": "IRM Energy Reports Q2 Net Profit Decline",
            "Summary": "IRM Energy's second-quarter net profit decreased to 129.4 million rupees, down from 281 million rupees year-over-year. However, it showed an improvement from the previous quarter's 187.7 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1731518608000,
            "Source": "result"
        }
    ]
}