{
    "Symbol": "ISFT",
    "ISIN": "INE566K01011",
    "News": [
        {
            "Title": "IntraSoft Technologies Q3FY26 Results Announced",
            "Summary": "IntraSoft Technologies reported Q3FY26 consolidated revenue of ₹13,666.67 lacs and net profit of ₹261.53 lacs. Nine-month revenue reached ₹39,817.24 lacs with profit of ₹1,012.77 lacs.",
            "Sentiment": "positive",
            "PublishDate": 1770900641864,
            "Source": "co_actions_results"
        },
        {
            "Title": "IntraSoft Technologies Company Secretary Resigns",
            "Summary": "IntraSoft Technologies announces resignation of Company Secretary & Compliance Officer Aakash Kumar Singh effective February 28, 2026, citing better career opportunities as reason for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1768398220033,
            "Source": "stocks"
        },
        {
            "Title": "IntraSoft Technologies Announces Merger with Wholly-Owned Subsidiary OneTwoThree Greetings",
            "Summary": "IntraSoft Technologies Limited has approved a scheme of merger with its wholly-owned subsidiary OneTwoThree Greetings (India) Private Limited under Section 233 of the Companies Act, 2013, with an appointed date of April 1, 2025. The merger aims to consolidate business operations, achieve economies of scale, reduce overhead expenses, and strengthen the company's position through combined resources and streamlined management.",
            "Sentiment": "positive",
            "PublishDate": 1764854054815,
            "Source": "corporate_action"
        },
        {
            "Title": "IntraSoft Technologies Reports Q2 Results, Highlights Business Model Transformation to Vendor Direct Approach",
            "Summary": "IntraSoft Technologies Limited shared its quarterly and half-year results ended September 30, 2025, along with a business performance presentation. The company operates 123 Stores, an e-commerce subsidiary that ranks among the top 300 retailers on Amazon US marketplace, selling 150,000 products across major categories. Revenue from operations increased to ₹13,251.45 crores from ₹12,557.31 crores in the previous year, while profit after tax decreased to ₹341.21 crores from ₹391.69 crores. The company has undergone significant transformation from an inventory-heavy model to a vendor direct model, reducing working capital requirements and debt levels. The vendor direct model involves shipping products directly from brand warehouses to consumers, reducing shipping, storage, and inventory holding costs. IntraSoft plans to expand its brand partner network, increase product offerings, and invest in technology innovation including artificial intelligence capabilities.",
            "Sentiment": "neutral",
            "PublishDate": 1763033841843,
            "Source": "earnings"
        },
        {
            "Title": "IntraSoft Technologies Reports Quarterly Results, Reappoints Key Directors",
            "Summary": "IntraSoft Technologies Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On a consolidated basis, the company reported revenue from operations of Rs 12,899.12 lacs and profit after tax of Rs 410.03 lacs, with earnings per share of Rs 2.51. Standalone revenue was Rs 327.11 lacs with profit after tax of Rs 41.59 lacs and EPS of Rs 0.25. The Board also approved the reappointment of Arvind Kajaria as Managing Director and Sharad Kajaria as Whole-Time Director for three-year terms starting April 1, 2026, subject to shareholder approval. Additionally, the company appointed M/s. Rathi & Associates as Secretarial Auditors for five years from FY 2025-26 to 2029-30 and approved a salary revision for Manager Operations Amritanshu Kajaria from Rs 34.50 lacs to Rs 42.50 lacs per annum effective October 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755172633939,
            "Source": "earnings"
        },
        {
            "Title": "IST Reports 37% Jump in Quarterly Net Profit to 723 Million Rupees",
            "Summary": "IST reported consolidated net profit of 723 million rupees for the quarter, representing a year-on-year increase from 527 million rupees. The company's total income rose to 1.02 billion rupees compared to 784 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1755081520947,
            "Source": "earnings"
        }
    ]
}