{
    "Symbol": "ISGEC",
    "ISIN": "INE858B01029",
    "News": [
        {
            "Title": "ISGEC Heavy Engineering Q3FY26 Results & Board Updates",
            "Summary": "ISGEC Heavy Engineering announced Q3FY26 results with revenue of ₹132,690 lakhs, profit of ₹7,517 lakhs, and approved major capacity expansion worth ₹350.6 crore along with key management re-appointments.",
            "Sentiment": "positive",
            "PublishDate": 1770639854826,
            "Source": "co_actions_results"
        },
        {
            "Title": "Isgec Heavy Engineering Board Meet on Feb 9, 2026",
            "Summary": "Isgec Heavy Engineering Limited has scheduled a board meeting on February 09, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769498158474,
            "Source": "co_actions_results"
        },
        {
            "Title": "ISGEC Heavy Engineering Faces ₹31.91 Lakh Tax Penalty",
            "Summary": "ISGEC Heavy Engineering receives penalty order from tax authorities for alleged wrongful input tax credit availing, with total financial impact of ₹31.91 lakh including interest. Company plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1767786873381,
            "Source": "stocks"
        },
        {
            "Title": "Isgec Heavy Engineering Faces ₹1.71 Lakh GST Penalty",
            "Summary": "Central Tax authority imposes penalty of ₹1,71,116 on Isgec Heavy Engineering for tax-related violations. Company plans to file appeal against the order under GST Act.",
            "Sentiment": "negative",
            "PublishDate": 1767261691102,
            "Source": "stocks"
        },
        {
            "Title": "Isgec Heavy Engineering Faces ₹14.23L CGST Penalty",
            "Summary": "Isgec Heavy Engineering received CGST penalty order of ₹1.29 lakh from Superintendent CGST Raipur on December 31, 2025, with total financial impact of ₹14.23 lakh including tax demand.",
            "Sentiment": "negative",
            "PublishDate": 1767186682751,
            "Source": "stocks"
        },
        {
            "Title": "ISGEC Heavy Engineering Faces ₹1.90 Cr GST Penalty",
            "Summary": "ISGEC Heavy Engineering received GST penalty order of ₹17.33 lakh from Assistant Commissioner, with total financial impact of ₹1.90 crores including tax demand. Company plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1767186456251,
            "Source": "stocks"
        },
        {
            "Title": "Isgec Heavy Engineering Faces ₹19.95 Cr GST Penalty",
            "Summary": "Isgec Heavy Engineering receives ₹13.67 crore penalty from Central Tax authorities for alleged GST violations on advance payments, with total financial impact of ₹19.95 crores including tax demand.",
            "Sentiment": "negative",
            "PublishDate": 1767180379406,
            "Source": "stocks"
        },
        {
            "Title": "Isgec Heavy Engineering Gets Credit Rating Reaffirmation",
            "Summary": "ICRA Limited reaffirmed credit ratings for Isgec Heavy Engineering's subsidiary Saraswati Sugar Mills Limited across facilities worth ₹401.65 crores, maintaining [ICRA]A(Stable) and [ICRA]A1 ratings.",
            "Sentiment": "neutral",
            "PublishDate": 1767179859473,
            "Source": "stocks"
        },
        {
            "Title": "ISGEC Heavy Engineering Senior Management Change",
            "Summary": "ISGEC Heavy Engineering announces retirement of Mr. Suman Kumar Jain from senior management effective December 29, 2025, as disclosed under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1767001632023,
            "Source": "stocks"
        },
        {
            "Title": "ISGEC Heavy Engineering Faces ₹78.88 Lakh GST Penalty",
            "Summary": "ISGEC Heavy Engineering receives GST penalty of ₹24.58 lakh plus interest for alleged ineligible input tax credit claims from cancelled taxpayers.",
            "Sentiment": "negative",
            "PublishDate": 1765864829238,
            "Source": "stocks"
        },
        {
            "Title": "ISGEC Heavy Engineering Completes Incorporation of Wholly Owned Subsidiary in Eswatini",
            "Summary": "ISGEC Heavy Engineering Limited has successfully incorporated its wholly owned subsidiary, Isgec Eswatini (Proprietary) Limited, in Eswatini on December 10, 2025. The company had previously announced its plans for this acquisition through incorporation in November 2025, expanding its international presence through this new subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1765360073908,
            "Source": "corporate_action"
        },
        {
            "Title": "ISGEC Heavy Engineering Faces Rs 40 Lakh Penalty from Customs Authority",
            "Summary": "ISGEC Heavy Engineering has been penalized Rs 31.05 lakh plus Rs 8.94 lakh interest by the Office of the Commissioner of Customs Central Tax for Input Tax Credit claimed in contravention to CGST Rules, 2017. The company faces a total financial impact of Rs 40 lakh and plans to file an appeal under the Goods and Services Tax Act.",
            "Sentiment": "negative",
            "PublishDate": 1765284004443,
            "Source": "stock"
        },
        {
            "Title": "Isgec Heavy Engineering Appoints Manzar Abbas as Chief Information Officer",
            "Summary": "Isgec Heavy Engineering Limited appointed Mr. Manzar Abbas as Chief Information Officer effective December 8, 2025, bringing 25 years of experience in IT strategy, Digital Transformation, and Industry 4.0. The appointment strengthens the company's senior management team with expertise in areas including SAP S/4 Hana and Cyber Security from his previous roles at Orient Electric Limited, Rockman Industries Limited, and Mother Dairy.",
            "Sentiment": "positive",
            "PublishDate": 1765198097344,
            "Source": "corporate_governance"
        },
        {
            "Title": "Isgec Heavy Engineering Delays Acquisition of 26% Stake in FPEL HR1 Energy",
            "Summary": "Isgec Heavy Engineering announced a delay in completing its 26% equity acquisition of FPEL HR1 Energy Private Limited due to ongoing procedural formalities at the target company. The company now expects to complete the transaction within an additional 30-day period beyond the original 60-day timeline from October 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764848713912,
            "Source": "corporate_action"
        },
        {
            "Title": "ISGEC Heavy Engineering Reports 3% Revenue Growth, Order Book Rises to INR 8,789 Crores",
            "Summary": "ISGEC Heavy Engineering's consolidated revenue increased 3% to INR 1,725 crores with order book growing to INR 8,789 crores, driven by strong performance across manufacturing and project segments. The company approved INR 87 crores investment for new skids and modules facility at Dahej SEZ, expecting additional annual revenue of INR 275 crores upon completion, while continuing efforts to sell Philippines biofuel operations.",
            "Sentiment": "positive",
            "PublishDate": 1763548440896,
            "Source": "earnings"
        },
        {
            "Title": "Isgec Heavy Engineering Projects 7-8% Growth for FY26, Significant Expansion for FY27",
            "Summary": "Isgec Heavy Engineering management expects revenue and profits to grow 7-8% in FY26, with significant revenue growth anticipated in FY27 driven by increased order book and new manufacturing capacity. The company is implementing Rs 230 crores capex to expand manufacturing revenue from current Rs 2,500 crores to Rs 3,200-3,300 crores annually upon completion.",
            "Sentiment": "neutral",
            "PublishDate": 1763217642556,
            "Source": "earnings"
        },
        {
            "Title": "ISGEC Heavy Engineering Independent Director Sidharth Prasad's Term Concludes",
            "Summary": "ISGEC Heavy Engineering Limited announced that Mr. Sidharth Prasad's second term as Independent Director will conclude on October 31, 2025. He will cease to be a Director of the Company with effect from the closing hours of October 31, 2025, upon completion of his second term appointment. The Board of Directors and Management expressed appreciation for his valuable contributions, guidance and services during his association with the Company. The company confirmed that the Board composition continues to comply with listing regulations following this cessation.",
            "Sentiment": "neutral",
            "PublishDate": 1761907050376,
            "Source": "corporate_governance"
        },
        {
            "Title": "Isgec Heavy Engineering Acquires 26% Stake in FPEL HR1 Energy for Haryana Solar Project",
            "Summary": "Isgec Heavy Engineering has signed an agreement to purchase a 26% stake in FPEL HR1 Energy Pvt. Ltd. The acquisition is related to a solar power project located in Haryana.",
            "Sentiment": "positive",
            "PublishDate": 1759754738594,
            "Source": "order&deals"
        },
        {
            "Title": "Isgec Heavy Engineering Reports Voting Results from 92nd AGM, All 10 Resolutions Passed",
            "Summary": "Isgec Heavy Engineering Limited reported voting results from its 92nd Annual General Meeting held on September 16, 2025, through video conferencing. The meeting lasted from 11:00 AM to 11:43 AM with 38,550 shareholders on record date. All 10 resolutions were passed, including adoption of standalone and consolidated financial statements, declaration of Rs. 5 dividend per equity share, director appointments and re-designations. Key resolutions included appointing Rajiv Roy Chaudhury and Vivek Dhir as Independent Directors, re-appointing Kishore Chatnani as director, and re-designating both Kishore Chatnani and Sanjay Gulati as Joint Managing Directors. The company also ratified cost auditor remuneration and appointed Pramod Kothari & Co. as Secretarial Auditor. Voting was conducted through remote e-voting and e-voting during the meeting, with 80.97% of outstanding shares participating in voting. Five promoters and 79 public shareholders attended through video conferencing.",
            "Sentiment": "positive",
            "PublishDate": 1758114873969,
            "Source": "corporate_action"
        },
        {
            "Title": "Isgec Heavy Engineering's Subsidiary Sale Transaction Fails as Buyer Defaults on Payment Obligations",
            "Summary": "Isgec Heavy Engineering announced that the sale of its step-down subsidiary Bioeq Energy Holdings One has encountered a major setback. The buyer, Triumph Excel Limited, failed to make required payments and fulfill obligations under the Sale and Purchase Agreement executed on December 09, 2024. The transaction was originally scheduled to complete by September 15, 2025, but has now been jeopardized due to the buyer's default. This follows multiple previous delays - the completion date was initially set for March 10, 2025, then extended to May 10, 2025, and later to July 15, 2025, before the final September 15, 2025 deadline. The sale involves Isgec's wholly owned subsidiary Isgec Investments Pte. Ltd., Singapore disposing of its entire shareholding in Bioeq Energy Holdings One, Cayman Islands. The transaction would have resulted in seven companies ceasing to be step-down subsidiaries and associate companies of Isgec, including entities in Singapore, Netherlands, and Philippines. The company has committed to keeping stakeholders informed of any further developments.",
            "Sentiment": "negative",
            "PublishDate": 1757919988519,
            "Source": "corporate_action"
        },
        {
            "Title": "Isgec Heavy Engineering Revises Dividend Record Date to September 09, 2025",
            "Summary": "Isgec Heavy Engineering Limited has changed its record date for dividend entitlement from September 08, 2025 to September 09, 2025. The revision was made due to a clearing/settlement holiday declared by RBI and a request from National Stock Exchange of India Limited. Shareholders whose names appear in the Register of Members on the revised record date of September 09, 2025 will be entitled to receive the dividend. The company has informed BSE Limited, NSDL, CDSL, and the Registrar & Share Transfer Agent about this change.",
            "Sentiment": "neutral",
            "PublishDate": 1757050330044,
            "Source": "corporate_action"
        },
        {
            "Title": "Isgec Heavy Engineering Reports 22% Revenue Decline in Q1 Despite Strong Order Book of Rs 90,120 Million",
            "Summary": "Isgec Heavy Engineering Limited reported total income of Rs 13,588 million for the quarter ended June 30, 2025, marking a 22.2% year-on-year decline. The company's profit after tax fell 32.9% to Rs 639 million, though EBITDA margin improved to 10.2% from 8.9% in the previous year. All three business segments experienced revenue declines: Industrial Projects down 18.2% to Rs 7,177 million, Manufacturing of Machinery & Equipment down 12.3% to Rs 4,764 million, and Sugar & Ethanol marginally down 0.1% to Rs 2,314 million. The company secured new orders worth Rs 22,370 million during the quarter, maintaining a robust order book of Rs 90,120 million. The order book comprises 83% domestic and 17% international orders, with 78% from private sector clients. Key sectors include refineries (20%), power (18%), and steel, cement & aluminium (14%). The company operates across three segments with Industrial Projects contributing 51% of FY25 revenue, Manufacturing 36%, and Sugar & Ethanol 13%.",
            "Sentiment": "negative",
            "PublishDate": 1756198168811,
            "Source": "earnings"
        },
        {
            "Title": "ISGEC Heavy Engineering Reports 38% Decline in Q1 Net Profit",
            "Summary": "ISGEC Heavy Engineering reported quarterly consolidated net profit of 576 million rupees, down from 936 million rupees in the same period last year. Revenue decreased to 13.4 billion rupees from 15.4 billion rupees year-over-year. EBITDA declined slightly to 1.2 billion rupees from 1.24 billion rupees, while EBITDA margin improved to 8.96% from 8.1% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1755086400024,
            "Source": "earnings"
        },
        {
            "Title": "Isgec Heavy Engineering Faces Rs 23.87 Lakh Tax Penalty from Haryana Authorities",
            "Summary": "Isgec Heavy Engineering Limited received a penalty order of Rs 23,87,276 from the Deputy Excise and Taxation Commissioner in Jagadhari, Ambala, Haryana. The penalty includes Rs 11,87,053 in IGST and Rs 6,00,112 each for CGST and SGST. The action stems from Input Tax Credit claimed by the company but disallowed by the tax authority. The company received notification of this order via email on August 7, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1754644364701,
            "Source": "stock"
        },
        {
            "Title": "Isgec Heavy Engineering Extends Sale Deadline for Bioeq Energy Holdings",
            "Summary": "Isgec Heavy Engineering has extended the deadline for the sale of Bioeq Energy Holdings to September 15, 2025. The extension is due to delays on the buyer's side.",
            "Sentiment": "neutral",
            "PublishDate": 1752586510000,
            "Source": "default"
        },
        {
            "Title": "Water Ingress at Saraswati Sugar Mills Due to Heavy Rain",
            "Summary": "Isgec Heavy Engineering reported that Saraswati Sugar Mills, located in Haryana, experienced water ingress at its facility due to heavy rainfall on June 30. The incident affected the sugar mill's operations.",
            "Sentiment": "negative",
            "PublishDate": 1751376631000,
            "Source": "default"
        },
        {
            "Title": "ISGEC Heavy Engineering Granted Permission to Resume Operations at Uttar Pradesh Factory",
            "Summary": "The National Green Tribunal has given permission for ISGEC Heavy Engineering to resume operations at its factory located in Village Nara, Uttar Pradesh. This decision comes after a previous closure of the unit, though the specific reasons for the closure and the duration are not mentioned in the provided news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1748862419000,
            "Source": "default"
        },
        {
            "Title": "ISGEC Heavy Engineering Reports Q4 Financial Results",
            "Summary": "ISGEC Heavy Engineering has reported its Q4 consolidated net profit at 981 million rupees, compared to 842 million rupees in the same quarter last year, showing an increase. However, the company's Q4 revenue decreased to 17.4 billion rupees from 18.7 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1748513322000,
            "Source": "result"
        },
        {
            "Title": "ISGEC Heavy Engineering: Nippon India Mutual Fund Increases Stake",
            "Summary": "Nippon India Mutual Fund has raised its stake in ISGEC Heavy Engineering to 5.96% by purchasing an additional 1.13% stake through open market transactions. The stock has shown mixed performance, rallying 5% in the last week but declining 32% year-to-date.",
            "Sentiment": "neutral",
            "PublishDate": 1740637299000,
            "Source": "block_deals"
        },
        {
            "Title": "Isgec Heavy Engineering: Nippon India Small Cap Fund Acquires 1.13% Stake",
            "Summary": "Nippon India Small Cap Fund purchased 8.33 lakh shares (1.13% stake) of Isgec Heavy Engineering Ltd. for Rs 76.3 crore at Rs 915 per share. Goldman Sachs India Equity Portfolio sold 10.4 lakh shares (1.41% stake) at Rs 915.49 per share. Isgec's Q3 net profit declined 65% to Rs 23.1 crore due to losses from its newly commissioned ethanol plant in the Philippines.",
            "Sentiment": "neutral",
            "PublishDate": 1740062617000,
            "Source": "block_deals"
        },
        {
            "Title": "Isgec Heavy Engineering Reports Q3 Financial Results",
            "Summary": "Isgec Heavy Engineering announced its Q3 consolidated net profit of 201 million rupees, which is lower compared to 620 million rupees in the same quarter last year (YoY) but higher than 926 million rupees in the previous quarter (QoQ). The company's Q3 revenue stood at 14.96 billion rupees, slightly up from 14.9 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739233317000,
            "Source": "earnings"
        },
        {
            "Title": "ISGEC Heavy Engineering Reports Q3 Financial Results",
            "Summary": "ISGEC Heavy Engineering has reported its Q3 financial results. The company's EBITDA for the quarter stood at 1.18 billion rupees, compared to 1.23 billion rupees in the same quarter last year. The EBITDA margin for Q3 was 7.90%, down from 8.30% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1739194762000,
            "Source": "earnings"
        },
        {
            "Title": "ISGEC Heavy Engineering Reports Q3 Financial Results",
            "Summary": "ISGEC Heavy Engineering announced its Q3 consolidated net profit of 201 million rupees, showing a significant decrease from 620 million rupees year-over-year. However, it's an improvement from the previous quarter's 926 million rupees. The company's Q3 revenue remained relatively stable at 14.96 billion rupees compared to 14.9 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739194659000,
            "Source": "earnings"
        },
        {
            "Title": "ISGEC Heavy Engineering to Consider Q3 Results",
            "Summary": "ISGEC Heavy Engineering has announced that it will consider its financial results for the third quarter on February 10. This indicates that the company is preparing to release its quarterly earnings report, which will provide insights into its financial performance for the period.",
            "Sentiment": "neutral",
            "PublishDate": 1738068779000,
            "Source": "earnings"
        },
        {
            "Title": "Isgec Heavy Engineering Subsidiary to Sell Stake in Bioeq Energy Holdings One",
            "Summary": "Isgec Heavy Engineering's subsidiary has entered into an agreement with Triumph Excel to sell its shareholding in Bioeq Energy Holdings One, Cayman Islands. The deal is valued at $10 million.",
            "Sentiment": "neutral",
            "PublishDate": 1733788619000,
            "Source": "corporate_action"
        },
        {
            "Title": "ISGEC Heavy Engineering Unit Sells Stake in Bioeq Energy Holdings One",
            "Summary": "A subsidiary of ISGEC Heavy Engineering has entered into an agreement with Triumph Excel to sell its shareholding in Bioeq Energy Holdings One, located in the Cayman Islands. The deal is valued at $10 million.",
            "Sentiment": "neutral",
            "PublishDate": 1733752667000,
            "Source": "corporate_action"
        },
        {
            "Title": "ISGEC Heavy Engineering Reports Strong Q2 Financial Results",
            "Summary": "ISGEC Heavy Engineering has announced its Q2 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 926 million rupees, up from 598 million rupees in the same quarter last year. Revenue also saw a notable rise, reaching 16.4 billion rupees compared to 14.73 billion rupees in the previous year's Q2.",
            "Sentiment": "positive",
            "PublishDate": 1731491905000,
            "Source": "result"
        }
    ]
}