{
    "Symbol": "ISHANCH",
    "ISIN": "INE561M01018",
    "News": [
        {
            "Title": "Ishan Dyes Appoints New Company Secretary & Re-appoints Director",
            "Summary": "Ishan Dyes & Chemicals Limited appointed Ms. Vidushi Jain as Whole-Time Company Secretary and re-appointed Mr. Shrinal P Patel as Whole-Time Director for 5 years starting February 1, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770128706230,
            "Source": "stocks"
        },
        {
            "Title": "ISHAN Dyes Company Secretary Anisha Jain Resigns",
            "Summary": "ISHAN Dyes and Chemicals Limited announces resignation of Company Secretary and Compliance Officer Ms. Anisha Jain effective January 27, 2026, citing pursuit of alternate career opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1769515673950,
            "Source": "stocks"
        },
        {
            "Title": "Ishan Dyes Starts Sulphuric Acid Production",
            "Summary": "Ishan Dyes & Chemicals commenced continuous consumption of sulphuric acid from its new Plant Unit 2 on January 23, 2026, with commercial sales to customers starting January 31, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769148852577,
            "Source": "stocks"
        },
        {
            "Title": "Ishan Dyes and Chemicals Reports Net Loss of Rs 332.10 Lakhs in Half-Year Results",
            "Summary": "Ishan Dyes and Chemicals Limited posted a net loss of Rs 332.10 lakhs for the half-year ended September 30, 2025, compared to a profit of Rs 219.80 lakhs in the previous year, with revenue from operations declining to Rs 5553.01 lakhs. The company raised Rs 3,980.65 lakhs through preferential issue of equity shares and convertible warrants, utilizing the funds for plant machinery, working capital, debt repayment, and corporate purposes.",
            "Sentiment": "negative",
            "PublishDate": 1763147005978,
            "Source": "earnings"
        },
        {
            "Title": "Ishan Dyes and Chemicals Issues 45.84 Lakh Convertible Warrants to Promoters via Preferential Allotment",
            "Summary": "Ishan Dyes and Chemicals Limited allotted 45,84,872 convertible equity warrants to promoters Piyushbhai Natvarlal Patel and Anilaben Piyushbhai Patel through preferential allotment. The Board of Directors approved the allotment on September 20, 2025. Piyushbhai Natvarlal Patel received 22,92,436 warrants while Anilaben Piyushbhai Patel received 22,92,436 warrants. The warrants can be converted into equity shares within 18 months from the allotment date. Post-allotment, the promoter group's holding increased to 46.81% on a fully diluted basis from 46.73%. The company's equity share capital stands at Rs. 20.97 crore divided into 2.10 crore shares of Rs. 10 each, with total diluted share capital of Rs. 30.73 crore after considering the warrants.",
            "Sentiment": "neutral",
            "PublishDate": 1758625731521,
            "Source": "corporate_action"
        },
        {
            "Title": "Ishan Dyes and Chemicals Allots 45.84 Lakh Warrants to Promoters and 51.72 Lakh Shares to Non-Promoters",
            "Summary": "Ishan Dyes and Chemicals Limited completed the allotment of 45,84,872 convertible equity warrants to promoter group members Piyushbhai Natvarlal Patel and Anilaben Piyushbhai Patel at Rs. 63 per warrant. The company also allotted 51,72,270 fully paid-up equity shares to 25 non-promoter investors at Rs. 63 per share. The warrants are convertible into equity shares within 18 months from allotment date. The company received Rs. 7.22 crore as 25% warrant subscription money from promoters and Rs. 32.59 crore as full payment from non-promoter allottees. Following the allotment, the company's paid-up equity share capital increased from Rs. 20.97 crore to Rs. 26.14 crore. Out of the approved 54,15,128 equity shares for non-promoters, 2,42,858 shares remained unsubscribed and were disposed of by the board.",
            "Sentiment": "positive",
            "PublishDate": 1758354927582,
            "Source": "corporate_action"
        },
        {
            "Title": "Ishan Dyes and Chemicals Conducts EGM for Share Capital Increase and Warrant Issuance",
            "Summary": "Ishan Dyes and Chemicals Limited held its Extra-Ordinary General Meeting on August 14, 2025, via video conferencing from 1:00 PM to 1:12 PM IST. The meeting was chaired by Shrinal Piyushbhai Patel, Whole Time Director. Three special resolutions were placed before shareholders: increasing authorized share capital with consequent changes to the Memorandum of Association; issuing up to 45,84,872 convertible equity warrants at INR 63 per warrant to promoters, aggregating INR 28,88,46,936; and allotting up to 54,15,128 fully paid equity shares at INR 63 per share to non-promoters/public, totaling INR 34,11,53,064. Remote e-voting was conducted from August 11-13, 2025. Kunal Sharma was appointed as scrutinizer for the e-voting process. Voting results and scrutinizer's report will be submitted later.",
            "Sentiment": "neutral",
            "PublishDate": 1755167272876,
            "Source": "corporate_action"
        },
        {
            "Title": "Ishan Dyes and Chemicals Reports Q1 FY26 Results, Appoints New Secretarial Auditors",
            "Summary": "Ishan Dyes and Chemicals Limited approved its unaudited standalone financial results for the quarter ended June 30, 2025. The company reported net revenue of Rs 1,628.83 lakhs compared to Rs 3,297.34 lakhs in the same quarter last year. Net profit stood at Rs 30.40 lakhs versus Rs 88.07 lakhs in the previous year quarter. Earnings per share was Rs 0.14 compared to Rs 0.42 in the corresponding quarter. The Board appointed M/s Kunal Sharma & Associates as Secretarial Auditors for a five-year term from FY 2025-26 to FY 2029-30, subject to shareholder approval. The company scheduled its 32nd Annual General Meeting for September 29, 2025, to be conducted through video conferencing. The company operates in the chemicals segment and is listed on BSE and NSE.",
            "Sentiment": "negative",
            "PublishDate": 1755000465917,
            "Source": "earnings"
        },
        {
            "Title": "Ishan Dyes and Chemicals Issues Corrigendum for Extraordinary General Meeting on Preferential Issue",
            "Summary": "Ishan Dyes and Chemicals Limited issued a corrigendum for its extraordinary general meeting scheduled for August 14, 2025, addressing corrections in Items 2 and 3 of the explanatory statement. The meeting will consider three special resolutions: increasing authorized share capital from Rs. 25 crores to Rs. 35 crores, issuing up to 45,84,872 convertible equity warrants to promoters at Rs. 63 per warrant aggregating Rs. 28.88 crores, and issuing up to 54,15,128 fully paid equity shares to non-promoters at Rs. 63 per share aggregating Rs. 34.12 crores. The total fundraising amounts to Rs. 63 crores for debt repayment, plant and machinery acquisition, working capital requirements, and general corporate purposes. The relevant date for pricing is July 15, 2025, with the issue price of Rs. 63 being higher than the minimum floor price determined under ICDR regulations and valuation report.",
            "Sentiment": "neutral",
            "PublishDate": 1754573248943,
            "Source": "corporate_action"
        }
    ]
}