{
    "Symbol": "ITC",
    "ISIN": "INE154A01025",
    "News": [
        {
            "Title": "ITC Block Trade Worth Rs. 36.32 Crores on NSE",
            "Summary": "ITC Ltd. witnessed a significant block trade on NSE involving 1,163,502 shares worth Rs. 36.32 crores at Rs. 312.20 per share, indicating substantial institutional activity in the stock.",
            "Sentiment": "neutral",
            "PublishDate": 1770354650409,
            "Source": "co_actions_results"
        },
        {
            "Title": "ITC announces Board changes with new director appointment",
            "Summary": "ITC Limited announces appointment of Mr. Navin Agarwal as Non-Executive Director representing SUUTI from April 1, 2026, replacing Dr. Alok Pande who resigned from the same position.",
            "Sentiment": "neutral",
            "PublishDate": 1769695686877,
            "Source": "stocks"
        },
        {
            "Title": "ITC Reports Q3FY26 Results, Declares ₹6.50 Interim Dividend",
            "Summary": "ITC Limited announced Q3FY26 financial results with revenue from operations at ₹19,359.46 crores and profit of ₹5,088.83 crores from continuing operations. Board declared interim dividend of ₹6.50 per share.",
            "Sentiment": "positive",
            "PublishDate": 1769694741974,
            "Source": "co_actions_results"
        },
        {
            "Title": "ITC takes measured approach to personal care acquisitions",
            "Summary": "While rivals like HUL and Marico aggressively acquire digital-first brands, ITC focuses on selective investments in baby care segment through Mother Sparsh and Mylo, emphasizing sustainable growth over rapid expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1769491979249,
            "Source": "stocks"
        },
        {
            "Title": "ITC Allots 2.69 Lakh Shares Under ESOP Scheme",
            "Summary": "ITC Limited allotted 2,69,610 ordinary shares on January 16, 2026, following exercise of 26,961 employee stock options. The company's issued share capital increased to ₹12,529.23 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1768560170324,
            "Source": "co_actions_results"
        },
        {
            "Title": "ITC hits 52-week low amid cigarette tax hike concerns",
            "Summary": "ITC shares crashed 17% in nine sessions, touching ₹334.85 as brokerages downgrade ratings following government's announcement of additional excise duty on cigarettes effective February 2026.",
            "Sentiment": "negative",
            "PublishDate": 1768291646314,
            "Source": "stocks"
        },
        {
            "Title": "ITC Block Trade Worth ₹28.12 Crores on NSE",
            "Summary": "ITC witnessed a significant block trade on NSE involving 840,519 shares valued at ₹28.12 crores, executed at ₹334.50 per share, indicating institutional investor activity in the stock.",
            "Sentiment": "neutral",
            "PublishDate": 1768285974183,
            "Source": "co_actions_results"
        },
        {
            "Title": "ITC Block Trade Worth ₹69.58 Crores on NSE",
            "Summary": "ITC witnessed a significant block trade on NSE involving 2,083,160 shares worth ₹69.58 crores at ₹334.00 per share, indicating substantial institutional activity in the stock.",
            "Sentiment": "neutral",
            "PublishDate": 1768285951163,
            "Source": "co_actions_results"
        },
        {
            "Title": "ITC Dominates 70% of India's Cigarette Market",
            "Summary": "ITC commands over 70% market share in India's cigarette industry through decades of scale advantages, extensive distribution networks, and regulatory barriers that prevent new competitors from challenging its position.",
            "Sentiment": "neutral",
            "PublishDate": 1768113457949,
            "Source": "stocks"
        },
        {
            "Title": "ITC shares fall 1% on new tobacco excise duty",
            "Summary": "ITC shares declined over 1% following government's new excise duty on tobacco products, sparking investor debate on buying opportunity versus caution amid expected cigarette price hikes.",
            "Sentiment": "negative",
            "PublishDate": 1767945298961,
            "Source": "stocks"
        },
        {
            "Title": "ITC Sees ₹23.82 Cr NSE Block Trade at ₹340.20",
            "Summary": "ITC Ltd. witnessed a significant block trade on NSE worth ₹23.82 crores involving approximately 700,084 shares executed at ₹340.20 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767856179759,
            "Source": "co_actions_results"
        },
        {
            "Title": "ITC Records ₹76.65 Crores NSE Block Trade",
            "Summary": "ITC witnessed a block trade on NSE involving 2.26 million shares at ₹339.00 per share, totaling ₹76.65 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1767688335502,
            "Source": "co_actions_results"
        },
        {
            "Title": "ITC Downgraded to Neutral by Macquarie on Tax Hike",
            "Summary": "Macquarie downgrades ITC to Neutral from Buy, slashes target price 34% to ₹330 citing 40-50% cigarette tax hike impact on volumes and profitability over next two years.",
            "Sentiment": "negative",
            "PublishDate": 1767669992434,
            "Source": "stocks"
        },
        {
            "Title": "ITC Block Trade: ₹19.27 Cr Deal at ₹349.75",
            "Summary": "ITC Ltd. witnessed a significant NSE block trade worth ₹19.27 crores involving approximately 551,059 shares executed at ₹349.75 per share, indicating institutional interest in the tobacco major.",
            "Sentiment": "neutral",
            "PublishDate": 1767597895786,
            "Source": "co_actions_results"
        },
        {
            "Title": "ITC hits 3-year low on steep excise duty hike",
            "Summary": "ITC shares plunge 24% in 2 sessions after government announces additional excise duty on tobacco products. Multiple brokerages downgrade stock citing 40-50% tax burden increase from February 2026.",
            "Sentiment": "negative",
            "PublishDate": 1767584981221,
            "Source": "stocks"
        },
        {
            "Title": "ITC Hits 3-Year Low as Brokerages Downgrade Post Tax Hike",
            "Summary": "ITC shares closed at three-year low of ₹350.10 on Friday after brokerages downgraded the stock following government's excise duty hike on tobacco products. LIC's losses mount to ₹10,445 crore.",
            "Sentiment": "negative",
            "PublishDate": 1767358629032,
            "Source": "stocks"
        },
        {
            "Title": "ITC faces multiple downgrades from brokerages",
            "Summary": "Multiple brokerages downgrade ITC following cigarette excise duty hike, with target prices cut across the board. JPMorgan, Nuvama, PhillipCapital among firms reducing ratings and price targets significantly.",
            "Sentiment": "negative",
            "PublishDate": 1767264591183,
            "Source": "stocks"
        },
        {
            "Title": "ITC Sees ₹18.54 Cr NSE Block Trade at ₹352.35",
            "Summary": "ITC Ltd. witnessed a fresh NSE block trade worth ₹18.54 crores involving approximately 526,316 shares at ₹352.35 per share, showing continued institutional activity in the tobacco major's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1767242043813,
            "Source": "co_actions_results"
        },
        {
            "Title": "ITC crashes 10%, loses Rs 50,000 cr on new tobacco tax",
            "Summary": "ITC shares plummet to 6-year low as new excise duties force 15-40% price hikes, wiping out over Rs 50,000 crore market cap with analysts warning of volume losses to illicit trade.",
            "Sentiment": "negative",
            "PublishDate": 1767240759158,
            "Source": "stocks"
        },
        {
            "Title": "ITC Faces Analyst Concerns Over Tax Hikes & Product Mix",
            "Summary": "Analysts express caution about ITC's performance citing high tax increases and consumer shift from DSFT to Kings cigarettes, creating negative market outlook for the tobacco major.",
            "Sentiment": "negative",
            "PublishDate": 1767240640519,
            "Source": "co_actions_results"
        },
        {
            "Title": "ITC Sees Major Block Trade Worth ₹1,505.25 Crores",
            "Summary": "ITC witnessed a significant block trade on NSE involving 37.59 million shares valued at ₹1,505.25 crores, executed at ₹400.45 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767239545482,
            "Source": "co_actions_results"
        },
        {
            "Title": "ITC Block Trade Worth ₹47.80 Crores on NSE",
            "Summary": "ITC executed a block trade on NSE involving 1,186,665 shares worth ₹47.80 crores at ₹402.80 per share, reflecting continued institutional activity in the tobacco major's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1767156990949,
            "Source": "co_actions_results"
        },
        {
            "Title": "ITC Records Additional Block Trade Worth ₹64.76 Crores",
            "Summary": "ITC witnessed another block trade on NSE worth ₹64.76 crores for 16.11 lakh shares at ₹402.10, following earlier BSE transaction of ₹1,793.9 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1767001266597,
            "Source": "co_actions_results"
        },
        {
            "Title": "ITC Cigarette Prices Rise Up to ₹2 Per Stick",
            "Summary": "Dealer reports indicate cigarette prices have increased by up to ₹2 per stick in some areas, affecting ITC's tobacco product portfolio across select markets.",
            "Sentiment": "neutral",
            "PublishDate": 1766483834530,
            "Source": "stocks"
        },
        {
            "Title": "ITC Completes Voluntary Liquidation of Subsidiary",
            "Summary": "ITC Limited has completed voluntary liquidation of wholly-owned subsidiary Prag Agro Farm Limited effective December 10, 2025, following NCLT Mumbai Bench order received on December 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766124423513,
            "Source": "stocks"
        },
        {
            "Title": "ITC Sees ₹51.27 Cr NSE Block Trade at ₹403.30",
            "Summary": "ITC witnessed a significant block trade on NSE worth ₹51.27 crores involving 1,271,369 shares executed at ₹403.30 per share, indicating substantial institutional activity in the tobacco major's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1765867955676,
            "Source": "co_actions_results"
        },
        {
            "Title": "ITC Records Fresh Block Trade Worth ₹20.19 Crores",
            "Summary": "ITC witnessed another block trade on NSE involving 502,256 shares valued at ₹20.19 crores, executed at ₹402.05 per share, showing continued institutional interest.",
            "Sentiment": "neutral",
            "PublishDate": 1765533056755,
            "Source": "co_actions_results"
        },
        {
            "Title": "ITC Receives ESG Rating of 66 from NSE Sustainability Ratings Analytics",
            "Summary": "ITC Limited received an ESG rating of 66 from NSE Sustainability Ratings Analytics Limited based on financial year 2024-25 data, representing a marginal decline of 1 point compared to the previous year's rating. The company informed stock exchanges about this voluntary ESG assessment as part of regulatory disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1765361926721,
            "Source": "stock"
        },
        {
            "Title": "Lok Sabha Approves Bill Imposing Higher Excise Duties on Tobacco Products",
            "Summary": "The Lok Sabha has approved legislation imposing 60-70% excise duty on unmanufactured tobacco and 25% duty or ₹5,000 per 1,000 sticks on cigars and cheroots. This regulatory change will impact tobacco companies like ITC through increased taxation on their tobacco product segments.",
            "Sentiment": "negative",
            "PublishDate": 1764775384443,
            "Source": "stock"
        },
        {
            "Title": "Government Studying Options to Replace Tobacco Compensation Cess, May Announce in Budget 2026",
            "Summary": "The government is exploring multiple options to replace the existing compensation cess on tobacco products, with a potential announcement expected in Budget 2026. This development could significantly impact ITC and other tobacco companies by changing the tax structure on tobacco products.",
            "Sentiment": "neutral",
            "PublishDate": 1764061073049,
            "Source": "stock"
        },
        {
            "Title": "ITC To Delist From Calcutta Stock Exchange, Retain NSE And BSE Trading",
            "Summary": "ITC plans to voluntarily remove its ordinary shares from the Calcutta Stock Exchange effective November 20, 2025. The company will continue trading on NSE and BSE, consolidating its listing to the two major national exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1763613056803,
            "Source": "corporate_action"
        },
        {
            "Title": "ITC Allots 9.26 Lakh Shares Under Employee Stock Option Schemes",
            "Summary": "ITC issued and allotted 9,26,900 ordinary shares of ₹1 each following the exercise of 92,690 options by employees under the company's Employee Stock Option Schemes. The company's issued and subscribed share capital increased to ₹1252,87,64,561 divided into 1252,87,64,561 ordinary shares of ₹1 each with effect from November 17, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763374234107,
            "Source": "corporate_action"
        },
        {
            "Title": "ITC Shares Worth Rs. 2,035.82 Crores Traded in NSE Block Deal",
            "Summary": "A block trade involving 50,642,408 shares of ITC was executed on NSE at Rs. 402.00 per share, totaling Rs. 2,035.82 crores. The large-volume transaction indicates significant institutional activity in ITC stock at the specified price level.",
            "Sentiment": "neutral",
            "PublishDate": 1763093098005,
            "Source": "order&deals"
        },
        {
            "Title": "Delhi High Court Restrains Hotel from Using ITC's 'BUKHARA' Trademark",
            "Summary": "The Delhi High Court has prohibited Bukhara Inn (Hotel Bukhara) from using the trademark 'BUKHARA', which belongs to ITC Limited. Justice Manmeet Pritam Singh Arora granted an interim injunction after ITC and ITC Hotels filed a case claiming trademark infringement related to their Bukhara restaurant at ITC Maurya in New Delhi. ITC established the Bukhara restaurant in the late 1970s, which earned ₹48.84 crore in 2024-25. The BUKHARA trademark has been registered since 1985 and was declared a 'well-known trademark' in 2024. The court found the hotel's use of the name appeared dishonest and misleading, rejecting the defendant's claim that the name derived from the proprietor's surname 'Bukhari'. The judge noted the adoption appeared to be made with full knowledge of ITC's prior, well-known trademark status. The court has restrained the defendant from using or imitating the 'BUKHARA' mark or any deceptively similar name. The case will resume on April 14, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1762857928112,
            "Source": "stock"
        },
        {
            "Title": "ITC Seeks Shareholder Approval for Two Key Board Appointments via Postal Ballot",
            "Summary": "ITC Limited has issued a postal ballot notice seeking shareholder approval for two director appointments. The company proposes to appoint Amitabh Kant as an Independent Director for five years starting January 1, 2026, and re-appoint Hemant Malik as Wholetime Director for two years from August 12, 2026. Kant, a retired IAS officer with four decades of administrative experience, previously served as G20 Sherpa to the Prime Minister and CEO of NITI Aayog. His proposed annual remuneration ranges between ₹1-1.3 crore. Malik, currently Divisional Chief Executive of the Foods Business Division with 36 years at ITC, will receive a basic salary of ₹16.12 lakh per month with performance bonuses up to 200% of basic salary. Remote e-voting will be conducted from November 16 to December 15, 2025, with results declared on December 16, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762849347977,
            "Source": "corporate_action"
        },
        {
            "Title": "ITC Appoints Amitabh Kant as Director and Approves Delisting from Calcutta Stock Exchange",
            "Summary": "ITC has appointed Amitabh Kant as a new director to its board. The company has also approved a voluntary delisting from the Calcutta Stock Exchange. These corporate governance changes reflect strategic decisions regarding board composition and exchange listings.",
            "Sentiment": "neutral",
            "PublishDate": 1761824860264,
            "Source": "corporate_governance"
        },
        {
            "Title": "ITC Reports 3% Net Profit Growth to Rs 5,126 Crore Despite 1% Revenue Decline",
            "Summary": "ITC reported a 3% year-on-year increase in consolidated net profit to Rs 5,126 crore for the second quarter, while revenue declined 1% to Rs 21,256 crore. The FMCG – Others segment showed 8% revenue growth (excluding notebooks), driven by staples, dairy, premium personal wash, and agarbattis. The business faced operational challenges from excessive rains and GST regime transition. The notebooks business remained under pressure due to low-priced paper imports and increased competition. GST rates were reduced for over half of the FMCG portfolio, with benefits passed to consumers. The segment's EBITDA margin improved by 50 basis points quarter-on-quarter through revenue management, price-volume-value rebalancing, and cost optimization.",
            "Sentiment": "neutral",
            "PublishDate": 1761823762725,
            "Source": "earnings"
        },
        {
            "Title": "ITC Reports Mixed Q2 Results with Net Profit Growth Despite Revenue Decline",
            "Summary": "ITC reported quarterly net profit of 51.8 billion rupees, up from 50.78 billion rupees year-over-year and above estimates of 50.62 billion rupees. However, revenue declined to 193.81 billion rupees from 198.58 billion rupees year-over-year, though it exceeded estimates of 192 billion rupees. EBITDA increased to 62.52 billion rupees from 61.23 billion rupees year-over-year but fell short of estimates of 62.9 billion rupees. EBITDA margin improved to 32.26% from 30.83% year-over-year, nearly matching estimates of 32.7%.",
            "Sentiment": "neutral",
            "PublishDate": 1761822241997,
            "Source": "earnings"
        },
        {
            "Title": "ITC to Announce Q2 Results on October 30, Board to Consider Calcutta Stock Exchange Delisting",
            "Summary": "ITC Ltd. will announce its second quarter results on October 30, 2025, with the Board of Directors meeting to approve unaudited standalone and consolidated financial results for the quarter and six months ended September 30, 2025. The Board will also consider a proposal for voluntary delisting from the Calcutta Stock Exchange Ltd. The trading window for designated employees has been closed from October 1 until 48 hours after results declaration. In the previous quarter, ITC reported a 3.2% year-on-year increase in consolidated net profit to Rs 5,343.41 crore and an 18.86% rise in total income to Rs 23,811.56 crore. ITC shares have declined 13.59% year-to-date, with the stock trading at Rs 418.20, down 0.58% during Tuesday's session. The company operates across FMCG, paperboards and packaging, agri and information technology sectors.",
            "Sentiment": "neutral",
            "PublishDate": 1761638833459,
            "Source": "earnings"
        },
        {
            "Title": "ITC Limited Announces Multiple Corporate Actions Including Director Appointments and Dividend Declarations",
            "Summary": "ITC Limited completed several corporate actions across multiple dates. The company appointed Chandra Kishore Mishra as Independent Director for five years effective September 14, 2024, through postal ballot with 99.83% approval from voting shareholders. For the financial year ended March 31, 2024, the Board recommended a final dividend of ₹7.50 per share, bringing total dividend to ₹13.75 per share including interim dividend of ₹6.25. The company appointed Siddhartha Mohanty as Non-Executive Director for three years from January 1, 2025, representing Life Insurance Corporation of India. ITC declared interim dividend of ₹6.50 per share for financial year ending March 31, 2025, with record date February 12, 2025. The company allotted 8,98,540 ordinary shares under employee stock option schemes on December 16, 2024, increasing share capital to ₹1,251,17,10,391. The Board also recommended a 2% limit of share capital for new Employee Stock Appreciation Rights Scheme and clarified that news regarding GST tax suggestions was not attributable to company events.",
            "Sentiment": "positive",
            "PublishDate": 1761630656791,
            "Source": "corporate_action"
        },
        {
            "Title": "ITC Board to Consider Voluntary Delisting from Calcutta Stock Exchange",
            "Summary": "ITC Limited has informed stock exchanges that its Board of Directors will consider a proposal for voluntary delisting of the company's ordinary shares from The Calcutta Stock Exchange Limited during their board meeting scheduled for October 30, 2025. The company has notified the National Stock Exchange, BSE, and Calcutta Stock Exchange about this agenda item.",
            "Sentiment": "neutral",
            "PublishDate": 1761569025364,
            "Source": "corporate_action"
        },
        {
            "Title": "ITC Ltd. Sees Block Trade Worth Rs. 72.77 Crores on NSE",
            "Summary": "ITC Ltd. witnessed a block trade on the National Stock Exchange worth Rs. 72.77 crores. The transaction involved approximately 1,815,990 shares at a price of Rs. 400.70 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1760588830224,
            "Source": "order&deals"
        },
        {
            "Title": "ITC Ltd. Sees Rs. 20.67 Crore Block Trade on NSE",
            "Summary": "ITC Ltd. witnessed a block trade worth Rs. 20.67 crores on the National Stock Exchange. The transaction involved approximately 513,814 shares at a price of Rs. 402.35 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1758773835286,
            "Source": "order&deals"
        },
        {
            "Title": "ITC and PepsiCo Compete for 10% Stake in Balaji Wafers",
            "Summary": "ITC and PepsiCo are both bidding for a 10% stake in Balaji Wafers. The two companies are competing against each other in this acquisition opportunity for the snack food manufacturer.",
            "Sentiment": "neutral",
            "PublishDate": 1757646180593,
            "Source": "order&deals"
        },
        {
            "Title": "ITC's Aashirvaad Launches High-Protein Atta Product",
            "Summary": "ITC has launched a new high-protein variant under its Aashirvaad brand. The company claims that consuming just three rotis made from this atta fulfills approximately 25% of daily protein requirements.",
            "Sentiment": "positive",
            "PublishDate": 1757501651282,
            "Source": "stock"
        },
        {
            "Title": "ITC Shares Rise 3.5% as GST Overhaul May Reduce Tobacco Tax Burden",
            "Summary": "ITC shares climbed 3.5% to Rs 425.70 following the government's announcement of a GST restructuring that could benefit the tobacco industry. The GST Council approved simplifying the tax structure from four slabs to two main rates of 5% and 18%, while creating a new 40% category for sin goods including cigarettes. Currently, tobacco products face 28% GST plus compensation cess, but will shift to a flat 40% rate once state revenue shortfall loans are repaid. Jefferies estimates this change could reduce ITC's effective tax burden by approximately 5 percentage points, potentially allowing the industry to lower prices and compete better against illicit products. The brokerage noted this restructuring may also reduce policy uncertainty for ITC. The broader GST changes are set for September 22 implementation, though timing for tobacco-specific changes remains unclear.",
            "Sentiment": "positive",
            "PublishDate": 1756967212620,
            "Source": "stock"
        },
        {
            "Title": "ITC Shares Rise 1.4% Following GST Rate Restructuring Announcement",
            "Summary": "ITC shares gained 1.4% to ₹417.55 following the 56th GST Council's approval of tax reforms. The council introduced a two-rate structure of 5% and 18%, with a special 40% rate for sin goods, effective September 22. Key changes include GST on daily essentials reduced to 5%, stationery items reduced to zero, and tobacco products facing 40% GST on MRP compared to the current 28% GST plus cess totaling 53-55% of MRP. ITC operates in both FMCG and paper segments through stationery items. Uncertainty remains regarding the continuation of National Calamity Contingent Duty (NCCD) on tobacco products. The stock has declined 13.7% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1756966084695,
            "Source": "stock"
        },
        {
            "Title": "ITC Ltd. Sees Rs. 105.09 Crore Block Trade on NSE",
            "Summary": "ITC Ltd. witnessed a block trade worth Rs. 105.09 crores on the National Stock Exchange. The transaction involved approximately 2,496,125 shares at a price of Rs. 421.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1756958497633,
            "Source": "order&deals"
        },
        {
            "Title": "ITC Shares in Focus as GST Council Retains 28% Tax, Raises Tobacco Cess to 40%",
            "Summary": "The GST Council announced that tobacco products will continue to face 28% GST with an increased compensation cess of up to 40%, effective September 22, 2025. The new framework will tax tobacco products based on Retail Sale Price rather than transaction value to curb tax evasion. ITC, which generates major operating profit from cigarettes, faces continued margin pressure as tobacco products remain excluded from GST rate cuts that benefit other FMCG categories. While items like toothpaste, namkeens, cheese, and shampoos now attract 5% GST, all tobacco products including cigarettes, pan masala, and gutkha will bear the higher tax burden. Bidis will attract 28% GST plus 18% cess. The Council maintains high taxes on sin goods until compensation cess borrowings are repaid. Jefferies had expected revenue neutrality for the tobacco industry, but the developments suggest persistent margin pressure if companies cannot pass increased tax burden to consumers.",
            "Sentiment": "negative",
            "PublishDate": 1756954982266,
            "Source": "stock"
        },
        {
            "Title": "ITC Announces ₹20,000 Crore Capex for FMCG and Agriculture Expansion",
            "Summary": "ITC Limited has committed ₹20,000 crore in fresh capital expenditure to expand its FMCG portfolio, strengthen agriculture linkages, and scale paperboard operations. Chairman Sanjiv Puri expressed optimism about the Indian market and potential GST reforms that could move from four tax slabs to a simplified two-rate structure of 5% and 18%. Puri believes this GST simplification would reduce consumer costs, ease business compliance, and boost consumption. The company is investing in agriculture through resilient supply chains, digital agri-platforms, and value-added products. ITC sees favorable conditions with easing inflation, softer interest rates, and improving farm incomes. However, Puri cautioned against higher levies on cigarettes, stating past hikes have increased illicit trade. ITC shares closed 1.19% higher at ₹411.50.",
            "Sentiment": "positive",
            "PublishDate": 1756912864715,
            "Source": "stock"
        }
    ]
}