{
    "Symbol": "ITCHOTELS",
    "ISIN": "INE379A01028",
    "News": [
        {
            "Title": "ITC Hotels Announces Non-deal Roadshow in Singapore",
            "Summary": "ITC Hotels Limited has scheduled a non-deal roadshow for February 4-5, 2026, in Singapore, featuring physical one-on-one and group meetings with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1769611865569,
            "Source": "stocks"
        },
        {
            "Title": "ITC Hotels Reports Strong Q3FY26 Performance",
            "Summary": "ITC Hotels Ltd delivered robust Q3FY26 operating results driven by healthy hotel business demand and luxury apartment sales commencement. Strong demand momentum expected to continue with healthy inventory pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1768972452035,
            "Source": "stocks"
        },
        {
            "Title": "ITC Hotels Q3 Net Profit Rises 9.30% to ₹235 Crores",
            "Summary": "ITC Hotels reported consolidated net profit of ₹235.00 crores in Q3, marking a 9.30% year-on-year increase from ₹215.00 crores in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1768898038502,
            "Source": "co_actions_results"
        },
        {
            "Title": "ITC Hotels Secures Delhi Land for ₹3,270 Crore Hotel",
            "Summary": "ITC Hotels has been allotted land by India International Convention & Exhibition Centre in New Delhi on lease basis for developing a 5-star hotel with lease premium of ₹3,270.00 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768176754456,
            "Source": "stocks"
        },
        {
            "Title": "ITC Hotels Secures Delhi Land Lease for ₹3.27 Billion",
            "Summary": "ITC Hotels has acquired a land lease in New Delhi for developing a 5-star hotel property, with the lease valued at ₹3.27 billion, marking a significant expansion in the capital city.",
            "Sentiment": "positive",
            "PublishDate": 1767962801139,
            "Source": "stocks"
        },
        {
            "Title": "ITC Hotels secures ₹327-cr Delhi lease deal",
            "Summary": "ITC Hotels Ltd secured leasehold land allotment from IICC for ₹326.50 crore to develop a premium 5-star hotel at Yashobhoomi, Dwarka, New Delhi on a 91-year lease term.",
            "Sentiment": "positive",
            "PublishDate": 1767959828401,
            "Source": "stocks"
        },
        {
            "Title": "ITC Hotels Secures Land Lease at Yashobhoomi for Hotel",
            "Summary": "ITC Hotels Limited has secured a 91-year lease for land at Yashobhoomi, Dwarka, New Delhi, paying ₹326.50 crores premium to develop a premium 5-star hotel with banqueting facilities.",
            "Sentiment": "positive",
            "PublishDate": 1767958259626,
            "Source": "co_actions_results"
        },
        {
            "Title": "ITC Hotels Allots 1.02 Lakh Shares Under ESOP",
            "Summary": "ITC Hotels Limited allotted 1,02,560 equity shares on December 19, 2025, under its Employee Stock Option Scheme, increasing paid-up share capital to ₹2,08,28,53,588.",
            "Sentiment": "neutral",
            "PublishDate": 1766147603887,
            "Source": "co_actions_results"
        },
        {
            "Title": "BAT Group Companies Sell 9% Stake in ITC Hotels for ₹1,875 Crore",
            "Summary": "Three BAT group entities - Tobacco Manufacturers (India) Limited, Myddleton Investment Company Limited, and Rothmans International Enterprises Limited - sold 18.75 crore shares (9% stake) in ITC Hotels through open market transactions on December 5, 2025. The sale reduced their combined holding from 15.28% to 6.28%, with TMIL retaining 6.28% while MICL and RIEL completely exited their positions.",
            "Sentiment": "neutral",
            "PublishDate": 1765194125245,
            "Source": "corporate_action"
        },
        {
            "Title": "ITC Hotels Seeks Shareholder Approval for Employee Stock Appreciation Rights Scheme",
            "Summary": "ITC Hotels Limited is conducting a postal ballot to approve the ITCHL Employee Stock Appreciation Rights Scheme 2025, allowing equity-settled stock appreciation rights for up to 2% of issued share capital (4,16,54,391 equity shares) for employees and directors. The scheme includes a three-year vesting schedule and aims to attract and retain talent while aligning employee interests with shareholder value through long-term equity-based incentives.",
            "Sentiment": "positive",
            "PublishDate": 1763439805438,
            "Source": "corporate_action"
        },
        {
            "Title": "ITC Hotels Plans Expansion to 220 Hotels and 5,900 Rooms by 2030",
            "Summary": "ITC Hotels has announced ambitious expansion plans targeting over 5,900 rooms across 220 hotels by 2030. The company unveiled its new 'Epiq Collection' brand and is entering new markets as part of its growth strategy. ITC Hotels added 15 new properties in the first half of FY26 and is implementing an asset-right strategy focused on profitable premium hospitality growth.",
            "Sentiment": "positive",
            "PublishDate": 1761324663744,
            "Source": "stock"
        },
        {
            "Title": "ITC Hotels Reports 75% Jump in Q2 Net Profit to 1.33 Billion Rupees",
            "Summary": "ITC Hotels delivered strong quarterly results with net profit rising to 1.33 billion rupees from 760 million rupees in the same period last year. Revenue increased to 8.4 billion rupees compared to 7.77 billion rupees year-over-year. The company's EBITDA grew to 2.5 billion rupees from 2.2 billion rupees, while EBITDA margin improved to 29.7% from 27.8% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761297055239,
            "Source": "earnings"
        },
        {
            "Title": "ITC Hotels Opens 98-Key Welcomhotel in Bodh Gaya, Explores Branded Residences Opportunities",
            "Summary": "ITC Hotels opened a new Welcomhotel in Bodh Gaya, Bihar, featuring 98 rooms and suites with convention facilities on an 18-acre property. The hotel is positioned to enhance MICE tourism in the state and is located 12 km from Gaya International Airport. Managing Director Anil Chadha emphasized the property's focus on celebrating local heritage while maintaining service excellence. The company is also exploring opportunities in branded residences, having received interest from developers to extend its brand into luxury living spaces. Chadha highlighted the company's expertise in cuisine, wellness, and sustainable practices as value additions, noting that all company-owned properties are LEED Platinum certified.",
            "Sentiment": "positive",
            "PublishDate": 1761209712507,
            "Source": "stock"
        },
        {
            "Title": "ITC Hotels Expands Storii Brand to Kerala with 62-Room Wayanad Property",
            "Summary": "ITC Hotels signed definitive agreements with Silvercastle Holidays and Resorts for a 62-room 'Storii by ITC Hotels Wayanad Silverwoods' property located alongside the Banasura Sagar Dam in Wayanad, Kerala. This signing marks the debut of Brand Storii and strengthens the hotel chain's presence in Kerala. Managing Director Anil Chadha highlighted Kerala's diverse landscapes and cultural heritage as compelling factors for the partnership. Storii by ITC Hotels operates as a collection of boutique properties. ITC Hotels Ltd. maintains a portfolio of more than 140 hotels with over 13,000 keys across 90 destinations in India.",
            "Sentiment": "positive",
            "PublishDate": 1756145043428,
            "Source": "stock"
        },
        {
            "Title": "BAT Awaits RBI Approval to Sell 15.29% Stake in ITC Hotels",
            "Summary": "British American Tobacco (BAT) is waiting for Reserve Bank of India (RBI) approval to sell its 15.29% stake in ITC Hotels. The transaction requires regulatory clearance before it can proceed.",
            "Sentiment": "neutral",
            "PublishDate": 1754881902322,
            "Source": "stock"
        },
        {
            "Title": "ITC Hotels Opens New 60-Room Property in Prayagraj, Uttar Pradesh",
            "Summary": "ITC Hotels Ltd opened a new property called 'Welcomhotel Prayagraj' in Uttar Pradesh, featuring 60 rooms and suites. The launch expands the company's presence in North India, bringing its total properties in Uttar Pradesh to seven, with six additional hotels planned for the state. Managing Director Anil Chadha stated the expansion strengthens their footprint in Uttar Pradesh and demonstrates their commitment to creating hospitality experiences that celebrate regional culture while maintaining service excellence standards.",
            "Sentiment": "positive",
            "PublishDate": 1753198759133,
            "Source": "stock"
        },
        {
            "Title": "ITC Hotels: Jefferies Raises Price Target After Strong Q1 Results",
            "Summary": "Jefferies maintains 'buy' rating on ITC Hotels, raising price target to ₹270 from ₹240. Q1 earnings beat estimates with revenue up 16%, EBITDA up 19%, and PAT up 54%. Company aims to expand to over 20,000 keys by 2030 from current 13,500.",
            "Sentiment": "positive",
            "PublishDate": 1752733378000,
            "Source": "earnings"
        },
        {
            "Title": "ITC Hotels: Q1 Profit Soars 54% YoY, Stock Hits Record High",
            "Summary": "ITC Hotels reported a 54% YoY increase in Q1FY26 net profit to Rs 133 crore. Revenue rose 15.5% YoY to Rs 816 crore. The stock surged over 3% to a record high of Rs 246 on BSE. However, PAT fell 48% sequentially due to a 23% drop in revenue from Q4FY25.",
            "Sentiment": "positive",
            "PublishDate": 1752728277000,
            "Source": "earnings"
        },
        {
            "Title": "ITC Hotels: Q1 Profit Surges 54%, Revenue Up 15%",
            "Summary": "ITC Hotels Ltd. reported Q1 FY24 results with net profit increasing 54% YoY to ₹133 crore. Revenue grew 15% to ₹815 crore. EBITDA rose 19% to ₹246 crore, with margins expanding by 87 basis points to 29.9%.",
            "Sentiment": "positive",
            "PublishDate": 1752654783000,
            "Source": "earnings"
        },
        {
            "Title": "ITC Hotels Reports Improved Q1 Financial Performance",
            "Summary": "ITC Hotels announced its Q1 consolidated EBITDA of 2.48 billion rupees, up from 2.1 billion rupees in the same quarter last year. The company's EBITDA margin also improved to 30.5% from 29.7% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1752654362000,
            "Source": "result"
        },
        {
            "Title": "ITC Hotels Reports Increased Q1 Profit and Revenue",
            "Summary": "ITC Hotels has announced its Q1 financial results. The company's consolidated net profit increased to 1.33 billion rupees from 860 million rupees in the same quarter last year. Revenue also saw growth, rising to 8.1 billion rupees from 6.9 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1752654299000,
            "Source": "result"
        },
        {
            "Title": "ITC Hotels Reports Q1 Net Profit Increase",
            "Summary": "ITC Hotels reported a net profit of 1.5 billion rupees in the first quarter, compared to 1 billion rupees in the same period last year. This represents a year-over-year increase in profits. The news is a correction to a previously reported figure.",
            "Sentiment": "positive",
            "PublishDate": 1752654163000,
            "Source": "result"
        },
        {
            "Title": "ITC Hotels: Q1FY26 Results Scheduled for July 16",
            "Summary": "ITC Hotels Ltd. will hold its Board Meeting on July 16 to consider and approve unaudited financial results for Q1FY26 ended June 2025. The company's trading window for designated persons closed on July 1 and will reopen 48 hours after results announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1752551508000,
            "Source": "corporate_action"
        },
        {
            "Title": "GQG Aims to Increase Shareholding in ITC Hotels",
            "Summary": "GQG is reportedly seeking to increase its shareholding in ITC Hotels. The news suggests a potential investment move by GQG in the hospitality sector, specifically targeting ITC Hotels.",
            "Sentiment": "positive",
            "PublishDate": 1749180143000,
            "Source": "default"
        },
        {
            "Title": "ITC Hotels: Launches Premium Gelato Brand 'Yura' in India",
            "Summary": "ITC Hotels has entered the premium gelato market with its new brand 'Yura', debuting at ITC Grand Chola. The Indian gelato market is projected to grow from $3.7 billion in 2024 to $7.4 billion by 2033. ITC adopts an aggressive pricing strategy, offering scoops at ₹195, competing with standalone gelato bars. Yura currently offers 20 flavors with plans for expansion.",
            "Sentiment": "positive",
            "PublishDate": 1749046467000,
            "Source": "corporate_action"
        },
        {
            "Title": "ITC Hotels: Welcomhotel Brand Expands to Vrindavan",
            "Summary": "ITC Hotels signs agreement with KD Greens, Mathura to open a 120-room Welcomhotel in Vrindavan, Uttar Pradesh. This marks the brand's entry into a new market and strengthens ITC Hotels' presence in the state.",
            "Sentiment": "positive",
            "PublishDate": 1747931539000,
            "Source": "corporate_action"
        },
        {
            "Title": "ITC Hotels: Q4 Profit Surges 41% YoY to Rs 257 Crore",
            "Summary": "ITC Hotels reported a 41% YoY increase in Q4FY25 consolidated net profit to Rs 257 crore. Revenue rose 17% to Rs 1,061 crore. For FY25, PAT grew 51% to Rs 635 crore, with revenue up 60% to Rs 3,560 crore. This marks the company's first earnings report since demerging from ITC.",
            "Sentiment": "positive",
            "PublishDate": 1747366574000,
            "Source": "earnings"
        },
        {
            "Title": "ITC Hotels: Q4 Net Profit Jumps 16% YoY to ₹264 Crore",
            "Summary": "ITC Hotels reported a 16% year-on-year increase in net profit to ₹264 crore for Q4 2025. Total income rose 7% to ₹1,016.66 crore. Sequentially, profit surged 43.7% and revenue grew 17%.",
            "Sentiment": "positive",
            "PublishDate": 1747298524000,
            "Source": "earnings"
        },
        {
            "Title": "ITC Hotels Reports Strong Q4 Financial Performance",
            "Summary": "ITC Hotels has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 3.95 billion rupees from 3.2 billion rupees in the previous year. The EBITDA margin also improved, rising to 41.04% from 36.73%. Additionally, ITC Hotels reported a net profit of 2.64 billion rupees, up from 1.84 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747297425000,
            "Source": "result"
        },
        {
            "Title": "ITC Hotels Reports Q4 Revenue Growth",
            "Summary": "ITC Hotels announced its Q4 revenue, which increased to 9.8 billion rupees from 8.7 billion rupees in the same quarter last year, representing year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1747297350000,
            "Source": "result"
        },
        {
            "Title": "ITC Hotels: Macquarie Initiates Coverage with 'Outperform' Rating",
            "Summary": "Macquarie initiates coverage on ITC Hotels with an 'Outperform' rating and a price target of ₹230, implying 18% upside. The brokerage expects improved free cash flow and ROCE growth from 8% to 14%. Ambit Capital also maintains a 'Buy' rating with the same price target, citing favorable macro factors and ongoing upcycle.",
            "Sentiment": "positive",
            "PublishDate": 1743135044000,
            "Source": "normal_news"
        },
        {
            "Title": "ITC Hotels: Shares Hit All-Time High Amid Surging Trade Volume",
            "Summary": "ITC Hotels Ltd. shares reached an all-time high of Rs 193.2 on NSE, rising 14.7% this week. Analysts cite strong hospitality sector performance and the company's expansion plans as drivers. Management aims to double room capacity by 2030. The stock is trading higher with increased volume, and analysts maintain a 'buy' rating with a 12-month target price of Rs 235.",
            "Sentiment": "positive",
            "PublishDate": 1742537744000,
            "Source": "normal_news"
        },
        {
            "Title": "ITC Hotels: BAT Plans to Exit Stake by 2026",
            "Summary": "British American Tobacco (BAT) confirms plans to divest its 15.3% stake in ITC Hotels by 2026, stating no interest in long-term ownership of an Indian hotel chain. BAT aims to use proceeds to reach its leverage corridor target. This follows ITC's July 2023 announcement of a proposed demerger of its hotels business.",
            "Sentiment": "neutral",
            "PublishDate": 1739504989000,
            "Source": "corporate_action"
        },
        {
            "Title": "ITC Hotels: Removal from Sensex and BSE Indices",
            "Summary": "ITC Hotels shares will be removed from Sensex and other BSE indices on February 5, 2025, following its recent demerger and separate listing. The stock is expected to face passive selling of over ₹400 crore due to this exclusion. ITC Hotels' market valuation has decreased from ₹39,000 crore at listing to ₹34,266 crore as of February 4.",
            "Sentiment": "negative",
            "PublishDate": 1738725850000,
            "Source": "corporate_action"
        },
        {
            "Title": "ITC Hotels: Shares Hit 5% Lower Circuit for Second Consecutive Day",
            "Summary": "ITC Hotels' stock price has declined by 5%, reaching the lower circuit limit for the second day in a row.",
            "Sentiment": "negative",
            "PublishDate": 1738210338000,
            "Source": "normal_news"
        }
    ]
}