{
    "Symbol": "ITDC",
    "ISIN": "INE353K01014",
    "News": [
        {
            "Title": "ITDC Board Meet on Feb 9 for Q3FY26 Results",
            "Summary": "India Tourism Development Corporation schedules board meeting on February 09, 2026 to consider unaudited financial results for third quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770125618049,
            "Source": "co_actions_results"
        },
        {
            "Title": "ITDC Clarifies No Material Info Behind Volume Surge",
            "Summary": "India Tourism Development Corporation clarifies to BSE that it has no undisclosed material information following queries about significant trading volume increase in its shares across exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1770021375057,
            "Source": "stocks"
        },
        {
            "Title": "ITDC Reports 31% Drop in Net Profit, Revenue Falls 18.6% in Q2 Results",
            "Summary": "India Tourism Development Corporation (ITDC) reported net profit of ₹16.35 crore in Q2, down 30.87% from ₹23.65 crore in the same quarter last year. Revenue from operations declined 18.6% year-on-year to ₹118.49 crore, though it increased 35% sequentially from ₹87.75 crore in the June quarter. The public sector enterprise under the Ministry of Tourism is focusing on digital transformation, sustainability, and customer engagement going forward. ITDC plans to launch an advanced version of its Ashok Travels & Tours online portal to improve accessibility for travelers. The company operates across hospitality, tours and travel, event management, duty-free shopping, and sound-and-light shows. ITDC shares closed at ₹599 on NSE, up 2.61% from the day's opening.",
            "Sentiment": "negative",
            "PublishDate": 1762953741597,
            "Source": "earnings"
        },
        {
            "Title": "ITDC Reports Strong Q2 Performance with Net Profit of ₹2,676 Crore for Half-Year",
            "Summary": "India Tourism Development Corporation Limited (ITDC) announced its quarterly results for the period ended September 30, 2025. The company reported a net profit of ₹2,676.50 crore for the half-year period, compared to ₹3,659.34 crore in the previous year. Total income reached ₹21,665.05 crore for the half-year versus ₹23,495.21 crore last year. The Board of Directors approved the results in their meeting held on November 11, 2025. The company operates across multiple segments including Hotel Division, International Trade Division, Travels & Tours, and Engineering Consultancy Projects. ITDC is undergoing various disinvestment processes for its hotel properties including Hotel Ashok, Hotel Kalinga Ashok, and subsidiary companies. The auditors issued a qualified opinion due to concerns regarding the Ashok Tours and Travels Delhi division's agreement with Shree Plan Your Journey Pvt. Ltd., citing non-compliance with certain agreement terms and inadequate security deposits.",
            "Sentiment": "neutral",
            "PublishDate": 1762905449389,
            "Source": "earnings"
        },
        {
            "Title": "ITDC Reports 31% Decline in Q2 Net Profit Despite Improved EBITDA Margin",
            "Summary": "ITDC reported quarterly net profit of 167.6 million rupees, down from 244.3 million rupees in the same period last year. Revenue declined to 1.17 billion rupees from 1.44 billion rupees year-over-year. EBITDA decreased to 189.9 million rupees from 201.9 million rupees compared to the previous year. However, EBITDA margin improved to 16.21% from 13.99% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762869546278,
            "Source": "earnings"
        },
        {
            "Title": "ITDC Sets Record Date for Rs. 2.90 Per Share Dividend Payment",
            "Summary": "India Tourism Development Corporation Ltd. (ITDC) has set September 9, 2025 as the record date for determining shareholder eligibility for a proposed dividend of Rs. 2.90 per equity share for the 2024-25 financial year. The dividend is subject to shareholder approval at the upcoming Annual General Meeting scheduled for September 16, 2025. The dividend applies to equity shares with a face value of Rs. 10 each.",
            "Sentiment": "positive",
            "PublishDate": 1756192865220,
            "Source": "corporate_action"
        },
        {
            "Title": "ITDC Reports 16% Drop in Net Profit to ₹1,020 Crore for Q1 FY26",
            "Summary": "India Tourism Development Corporation Ltd reported net profit of ₹1,019.62 lakh for the quarter ended June 30, 2025, compared to ₹1,216.28 lakh in the same period last year. Revenue from operations increased to ₹8,641.35 lakh from ₹8,017.25 lakh year-on-year. The company's Hotel Division contributed ₹7,123.19 lakh to revenue, while Travels & Tours segment generated ₹530.31 lakh. Total comprehensive income for the period was ₹1,062.45 lakh. The auditor issued a qualified opinion citing concerns over compliance with General Sales Agent agreement terms and non-compliance with travel service agreements. The company continues to face governance challenges with only one Independent Director on the Board, preventing proper Audit Committee quorum. ITDC is undergoing disinvestment processes for various hotel properties including Hotel Ashok and subsidiary companies.",
            "Sentiment": "negative",
            "PublishDate": 1755009278090,
            "Source": "earnings"
        },
        {
            "Title": "ITDC Declares Dividend of ₹2.9 Per Share",
            "Summary": "India Tourism Development Corporation (ITDC) has announced a dividend of ₹2.9 per share. No additional details about the dividend, such as the fiscal year or record date, were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1748607135000,
            "Source": "result"
        },
        {
            "Title": "ITDC Reports Improved Q4 Financial Results",
            "Summary": "ITDC has reported its Q4 financial results. The company's EBITDA increased to 322 million rupees from 250 million rupees year-over-year. However, the EBITDA margin decreased to 16.20% from 17.92% compared to the same period last year. Net profit rose to 255 million rupees from 111 million rupees year-over-year and 211 million rupees quarter-over-quarter. Revenue for Q4 grew to 1.99 billion rupees from 1.4 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748607104000,
            "Source": "result"
        },
        {
            "Title": "PM Modi Reviews Progress in Tourism Sector",
            "Summary": "Prime Minister Narendra Modi chaired a meeting to review the progress in the tourism sector. The meeting focused on assessing developments and initiatives in India's tourism industry.",
            "Sentiment": "neutral",
            "PublishDate": 1747729863000,
            "Source": "default"
        },
        {
            "Title": "India Tourism Development Corp to Consider Asset Monetization of Ashok Hotel",
            "Summary": "The Board of Directors of India Tourism Development Corporation (ITDC) is scheduled to meet on March 11 to discuss the potential asset monetization of the Ashok Hotel. This meeting suggests that ITDC is exploring options to generate value from one of its key properties, which could have significant implications for the company's financial strategy and operations.",
            "Sentiment": "neutral",
            "PublishDate": 1741134360000,
            "Source": "corporate_action"
        },
        {
            "Title": "ITDC Board to Consider Asset Monetization of Ashok Hotel",
            "Summary": "India Tourism Development Corporation (ITDC) has announced a board meeting scheduled for March 11 to discuss the potential asset monetization of the Ashok Hotel. This meeting suggests that ITDC is exploring options to generate value from one of its key properties, which could have significant implications for the company's financial strategy and operations.",
            "Sentiment": "neutral",
            "PublishDate": 1741091699000,
            "Source": "corporate_action"
        },
        {
            "Title": "India Tourism Development Corp Reports Q3 EBITDA Growth",
            "Summary": "India Tourism Development Corporation (ITDC) has reported improved financial performance for the third quarter. The company's EBITDA increased to 254 million rupees, up from 225 million rupees in the same period last year. Additionally, ITDC's EBITDA margin expanded to 17.2% from 16.88% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739449293000,
            "Source": "earnings"
        },
        {
            "Title": "India Tourism Development Corporation Reports Q3 Profit and Revenue Growth",
            "Summary": "India Tourism Development Corporation (ITDC) has announced its financial results for the third quarter. The company reported a net profit of 210 million rupees, up from 183 million rupees in the same period last year. Revenue also increased to 1.48 billion rupees from 1.33 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739449287000,
            "Source": "earnings"
        },
        {
            "Title": "ITDC to Consider Q3 Results on February 13",
            "Summary": "India Tourism Development Corporation (ITDC) has announced that it will consider and approve its financial results for the third quarter on February 13.",
            "Sentiment": "neutral",
            "PublishDate": 1738844347000,
            "Source": "result"
        },
        {
            "Title": "India Tourism Development Corporation: Luxury Camps for Maha Kumbh Mela 2025",
            "Summary": "ITDC is setting up luxury camps near the Sangam VIP area for the Maha Kumbh Mela 2025 in Prayagraj, offering various accommodation options and premium services including airport transfers and guided tours. The camps will feature spiritual and cultural activities to enhance the pilgrim experience.",
            "Sentiment": "positive",
            "PublishDate": 1736067027000,
            "Source": "normal_news"
        },
        {
            "Title": "ITDC Reports Decline in Q2 EBITDA and Margin",
            "Summary": "India Tourism Development Corporation (ITDC) has reported a decrease in its second-quarter EBITDA, falling from 240 million rupees in the previous year to 202 million rupees. Additionally, the company's EBITDA margin has contracted from 18.54% to 13.24% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731600141000,
            "Source": "result"
        },
        {
            "Title": "ITDC Reports Q2 FY24 Financial Results",
            "Summary": "India Tourism Development Corporation (ITDC) announced its Q2 financial results. The company reported a net profit of 246 million rupees, up from 197 million rupees year-over-year and 122 million rupees quarter-over-quarter. Revenue for Q2 stood at 1.5 billion rupees, compared to 1.30 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731600077000,
            "Source": "result"
        },
        {
            "Title": "ITDC Appoints M.R. Synrem as Interim Managing Director",
            "Summary": "<p>The Indian government has <span class='positive'>assigned additional responsibilities</span> to <b>M.R. Synrem</b>, <span class='positive'>appointing</span> them as the <span class='neutral'>interim Managing Director</span> of <b>India Tourism Development Corporation (ITDC)</b>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728649370000,
            "Source": "corporate_action"
        }
    ]
}