{
    "Symbol": "ITI",
    "ISIN": "INE248A01017",
    "News": [
        {
            "Title": "ITI Gets IVR BBB-/Stable Credit Rating on Rs 4221.39 Cr",
            "Summary": "Infomerics Valuation and Ratings assigned IVR BBB-/Stable/A3 credit rating to ITI Limited for banking facilities worth Rs 4221.39 crore, comprising long-term and short-term facilities.",
            "Sentiment": "neutral",
            "PublishDate": 1770297342098,
            "Source": "stocks"
        },
        {
            "Title": "ITI Limited Receives Rs.16 Crores EMD from CGST",
            "Summary": "ITI Limited received Rs.16 crores as Earnest Money Deposit from CGST Department for land procurement valuation of 21 acres in K.R. Puram, Bengaluru with indicative value of Rs.800 crores.",
            "Sentiment": "positive",
            "PublishDate": 1769682000178,
            "Source": "stocks"
        },
        {
            "Title": "ITI Limited Files Q3FY26 SEBI Compliance Certificate",
            "Summary": "ITI Limited submitted its quarterly confirmation certificate to stock exchanges for Q3FY26, ensuring compliance with SEBI depositories regulations for dematerialization processes.",
            "Sentiment": "neutral",
            "PublishDate": 1768909024903,
            "Source": "stocks"
        },
        {
            "Title": "ITI Shares Hit 52-Week High, Surge 7% on Volume Spike",
            "Summary": "ITI shares jumped 6.92% to ₹316.15, reaching a 52-week high amid heavy trading volumes of 20.1 lakh shares on NSE. The PSU telecom company recently secured a ₹72.76 crore Ice Hockey Rink project.",
            "Sentiment": "positive",
            "PublishDate": 1768285576871,
            "Source": "stocks"
        },
        {
            "Title": "ITI wins ₹72.76-crore ice hockey rink project",
            "Summary": "State-run PSU ITI Ltd secures turnkey contract from Himachal Pradesh government to build ice hockey facility at Kaza Soma with solar power backup and allied infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1767179621905,
            "Source": "stocks"
        },
        {
            "Title": "ITI Wins ₹72.76 Cr Ice Hockey Rink Project in Kaza",
            "Summary": "ITI Limited secures major infrastructure contract for ice hockey rink development in Kaza, Lahaul & Spiti, featuring solar power backup and comprehensive sports facilities.",
            "Sentiment": "positive",
            "PublishDate": 1767088901927,
            "Source": "stocks"
        },
        {
            "Title": "ITI Clarifies Land Monetization Reports Under Regulation 30",
            "Summary": "ITI Limited issues clarification stating no sale deed executed for Bengaluru land monetization, process in initial stages under NLMC guidance following government directions for debt settlement.",
            "Sentiment": "neutral",
            "PublishDate": 1766057987739,
            "Source": "stocks"
        },
        {
            "Title": "ITI Limited Receives Credit Rating Upgrade from Acuite Ratings",
            "Summary": "ITI Limited received upgraded credit ratings from Acuite Research and Ratings Ltd, with long-term ratings improved to ACUITE BB (Stable) and short-term ratings to ACUITE A4 across various bank facilities. The rating upgrade covers total bank limits of Rs 4,851.69 crore across multiple instruments including cash credit, letters of credit, and bank guarantees from various lenders including Bank of Baroda, State Bank of India, and Canara Bank.",
            "Sentiment": "positive",
            "PublishDate": 1764399843958,
            "Source": "corporate_action"
        },
        {
            "Title": "ITI Limited Reports Quarterly Loss of Rs 5,436 Lakhs Amid Revenue Decline",
            "Summary": "ITI Limited posted a net loss of Rs 5,436 lakhs for the quarter ended September 30, 2025, compared to Rs 7,033 lakhs loss in the previous quarter, with revenue from operations dropping to Rs 4,340 lakhs from Rs 49,801 lakhs. The company continues operating under a government revival plan with financial assistance of Rs 4,15,679 lakhs, having received Rs 3,02,535 lakhs to date, while managing an order book worth Rs 1,87,261 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1763068298618,
            "Source": "earnings"
        },
        {
            "Title": "ITI Partners With Kerala Government To Launch Kerala Savaari 2.0",
            "Summary": "ITI has entered into a partnership with the Kerala Government to introduce Kerala Savaari 2.0.",
            "Sentiment": "positive",
            "PublishDate": 1762925215105,
            "Source": "stock"
        },
        {
            "Title": "ITI Limited Appoints Ramana Babu C V as Director (Finance) on Additional Charge",
            "Summary": "ITI Limited has appointed Shri Ramana Babu C V, Director (Marketing), as Director (Finance) on additional charge for six months effective from October 15, 2025. The appointment follows a Government of India order through the Ministry of Communications, approved by the Appointments Committee of the Cabinet. The additional charge will continue until a regular incumbent assumes the position or until further orders, whichever is earliest. During this period, Ramana Babu will not receive additional remuneration. His Director Identification Number is 10478320, and he is not debarred from holding directorial positions. The appointment comes after the non-extension of tenure for Rajeev Srivastava as Director (Finance) beyond October 14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760507617191,
            "Source": "corporate_governance"
        },
        {
            "Title": "ITI Stock Surges 20% as BSNL Plans 5G Network Upgrade",
            "Summary": "ITI Ltd. shares have jumped nearly 20% over a week following announcements that its major client BSNL will upgrade its indigenously developed 4G network to 5G within six to eight months. Telecom Minister Jyotiraditya Scindia stated that India has joined the global 4G technology club previously dominated by five companies from four countries, and will soon provide end-to-end 5G network capability across India. ITI, which offers telecom products across switching, transmission, and access equipment, operates manufacturing facilities in six locations and has received Rs 3,000 crore from the government as part of a revival plan. The stock advanced 12.6% intraday to Rs 365, with trading volume 21 times its 30-day average and turnover of Rs 847 crore. The stock has gained 48% over the last 12 months but is down 7% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1759902293564,
            "Source": "stock"
        },
        {
            "Title": "ITI Secures ₹110 Crore IT Projects from Gujarat Info Petro Limited",
            "Summary": "ITI has received approval from Gujarat Info Petro Limited for two IT projects worth ₹110 crore. The projects will focus on IT infrastructure development and cybersecurity center setup in Gujarat.",
            "Sentiment": "positive",
            "PublishDate": 1756961490511,
            "Source": "order&deals"
        },
        {
            "Title": "ITI Receives ISRO Praise Following Successful NISAR Satellite Launch",
            "Summary": "ITI received recognition from ISRO after the successful launch of the NISAR satellite using the GSLV F16 rocket. The launch was completed successfully, leading to ISRO's acknowledgment of ITI's contribution to the mission.",
            "Sentiment": "positive",
            "PublishDate": 1755495905717,
            "Source": "stock"
        },
        {
            "Title": "ITI Limited Reports Quarterly Loss of Rs 6,332 Lakhs with Revenue Declining to Rs 49,801 Lakhs",
            "Summary": "ITI Limited posted a net loss of Rs 6,332 lakhs for the quarter ended June 30, 2025, compared to a loss of Rs 9,108 lakhs in the same period last year. Revenue from operations decreased to Rs 49,801 lakhs from Rs 51,998 lakhs year-over-year. The company's total expenses stood at Rs 57,076 lakhs against total revenue of Rs 51,105 lakhs. Basic and diluted earnings per share were negative at Rs 0.65. The telecommunications equipment manufacturer operates under a government revival plan and has received Rs 3,02,535 lakhs out of approved financial assistance of Rs 4,15,679 lakhs. ITI maintains an order book worth Rs 19,158 crores under execution, including the ASCON Phase IV project valued at Rs 8,280.36 crores with the Ministry of Defence. The auditors issued a disclaimer of conclusion citing various compliance and operational concerns across multiple units.",
            "Sentiment": "negative",
            "PublishDate": 1755081288519,
            "Source": "earnings"
        },
        {
            "Title": "ITI Limited Launches India's First AI-Powered Road Safety Pilot Project in Uttar Pradesh",
            "Summary": "ITI Limited announced the launch of an AI and Big Data Analytics-driven pilot project to reduce road accidents and improve enforcement efficiency in Uttar Pradesh, in partnership with technology firm mLogica. The Union Ministry of Road Transport and Highways has approved the initiative. The project will analyze multi-source data including traffic flow, environmental conditions, driver performance, vehicle data, accident reports, and road infrastructure. The six-week prototype phase will consolidate various data sources to develop AI models for predicting accident black spots and identifying root causes. Expected outcomes include identification of accident causes, high-risk areas, data-driven policy recommendations, simulation capabilities, and real-time monitoring. Following successful trials, the AI system will be expanded to core transport functions including licensing, permits, revenue collection, and e-challan operations. Chairman and Managing Director Rajesh Rai expressed excitement about entering AI-driven traffic management. ITI Limited recently won CCTV surveillance and GIS contracts worth around Rs. 88 Crores in Odisha and Chattisgarh states.",
            "Sentiment": "positive",
            "PublishDate": 1754387333623,
            "Source": "stock"
        },
        {
            "Title": "ITI Limited Appoints Shri Arun Agarwal as Government Nominee Director",
            "Summary": "ITI Limited announced the appointment of Shri Arun Agarwal as Government Nominee Director on its Board, effective July 22, 2025, for a three-year term or until further notice. Agarwal, who serves as DDG (Sat.) at DoT, replaces Sh. Sunil Kumar Verma on the Board. The appointment was made through a Ministry of Communications order and will continue until his superannuation or further orders, whichever comes first. Agarwal's Director Identification Number is 05270538, and he is not debarred from holding directorial positions.",
            "Sentiment": "neutral",
            "PublishDate": 1753763552770,
            "Source": "corporate_governance"
        },
        {
            "Title": "ITI Limited Schedules Board Meeting to Consider Rs. 59 Crore Equity Allotment to President of India",
            "Summary": "ITI Limited has announced a Board of Directors meeting scheduled for July 30, 2025, to consider the allotment of equity shares to the President of India on a preferential basis. The allotment involves a capital expenditure infusion of Rs. 59 crore as part of a BIFR revival package order dated January 8, 2013. The government undertaking company has informed stock exchanges BSE and NSE about the board meeting agenda.",
            "Sentiment": "neutral",
            "PublishDate": 1753704412859,
            "Source": "corporate_action"
        },
        {
            "Title": "ITI Limited Appoints Arun Agarwal as Government Nominee Director",
            "Summary": "ITI Limited has appointed Shri Arun Agarwal as Government Nominee Director on its Board, replacing Sh. Sunil Kumar Verma. The appointment is for a three-year term, effective immediately, subject to obtaining DIN. Agarwal holds a Bachelor of Engineering in Electronics and an MBA, is an Indian Telecom Service Officer from the 1990 batch with 33 years of telecom experience, and currently serves as Deputy Director General (Satellite) in the Department of Telecom. The Government of India made this appointment through a Ministry of Communications order dated July 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753272612786,
            "Source": "corporate_governance"
        },
        {
            "Title": "DoT Announces New Rules for Transferring ITI Properties",
            "Summary": "The Department of Telecom (DoT) has introduced new regulations regarding the transfer of properties belonging to ITI (Indian Telephone Industries) to other government departments. These transfers can now be conducted without going through an auction process. The announcement came after a meeting, suggesting that this decision was the result of discussions and deliberations.",
            "Sentiment": "neutral",
            "PublishDate": 1752479559000,
            "Source": "default"
        },
        {
            "Title": "Indian Government Developing Plans to Improve ITI's Financial Stability",
            "Summary": "The Centre (Indian government) is working on plans to enhance the financial stability of ITI (Indian Telephone Industries). No specific details about the plans or ITI's current financial situation are provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752204429000,
            "Source": "default"
        },
        {
            "Title": "ITI Secures Orders Worth ₹88 Crores in Odisha and Chhattisgarh",
            "Summary": "ITI has obtained orders totaling ₹88 crores in the states of Odisha and Chhattisgarh. No further details about the nature of the orders or the specific projects were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751441245000,
            "Source": "default"
        },
        {
            "Title": "Cabinet Meeting to Discuss Asset Transfer for ITI",
            "Summary": "A Cabinet meeting is scheduled today to discuss the potential asset transfer for ITI (Indian Telephone Industries Limited). The news indicates that the government is considering changes related to the company's assets, which could have significant implications for ITI's operations or structure.",
            "Sentiment": "neutral",
            "PublishDate": 1749710089000,
            "Source": "default"
        },
        {
            "Title": "ITI Receives First Payment of ₹25 Crore from C-DOT",
            "Summary": "ITI (Indian Telephone Industries) has received the first tranche of payment amounting to ₹25 crore from C-DOT (Centre for Development of Telematics). This payment is part of a larger ₹200 crore sale deed between the two entities.",
            "Sentiment": "positive",
            "PublishDate": 1748849128000,
            "Source": "default"
        },
        {
            "Title": "ITI Ltd: State-Run Telecom Company Narrows Losses in Q4",
            "Summary": "ITI Ltd reported a significantly reduced net loss of ₹4.4 crore in Q4, compared to ₹238.8 crore loss in the same quarter last year. Revenue increased by 74% to ₹1,045.7 crore. The company's EBITDA loss narrowed to ₹28.2 crore. The improved performance was partly aided by an exceptional gain of ₹62.41 crore.",
            "Sentiment": "positive",
            "PublishDate": 1748401044000,
            "Source": "earnings"
        },
        {
            "Title": "ITI Reports Q4 Financial Results",
            "Summary": "ITI has reported its Q4 financial results. The company recorded a net loss of 48 million rupees, compared to a loss of 2.4 billion rupees in the same quarter last year, showing a significant reduction in losses year-over-year. However, the loss increased from 671 million rupees in the previous quarter. Revenue for Q4 stood at 10.4 billion rupees, up from 6 billion rupees in the same period last year, indicating substantial revenue growth.",
            "Sentiment": "neutral",
            "PublishDate": 1748353658000,
            "Source": "result"
        },
        {
            "Title": "ITI Secures Significant Order Worth Rs. 5,050 Crore",
            "Summary": "ITI (Indian Telephone Industries Limited) has received an order with a total value of Rs. 5,050 crore. This substantial order represents a significant business development for the company, potentially boosting its financial performance and market position.",
            "Sentiment": "positive",
            "PublishDate": 1744175531000,
            "Source": "order&deals"
        },
        {
            "Title": "ITI Launches State Network Operations Center for BharatNet Phase-III in Himachal Pradesh",
            "Summary": "ITI (Indian Telephone Industries Limited) has initiated a State Network Operations Center (S-NOC) for the BharatNet Phase-III project in Himachal Pradesh. This development is part of the broader BharatNet initiative, which aims to improve digital connectivity across India, particularly in rural areas.",
            "Sentiment": "positive",
            "PublishDate": 1744175481000,
            "Source": "corporate_action"
        },
        {
            "Title": "ITI Receives Initial 1 Billion Rupees from C-DOT for Bangalore Land",
            "Summary": "Indian Telephone Industries Limited (ITI) has received the first installment of 1 billion rupees from the Centre for Development of Telematics (C-DOT) as part of a land transaction in Bangalore.",
            "Sentiment": "positive",
            "PublishDate": 1740053982000,
            "Source": "corporate_action"
        },
        {
            "Title": "ITI Ltd: Shares Plummet 15% in Four Sessions Despite Revenue Surge",
            "Summary": "ITI Ltd's stock has fallen 14.9% over four consecutive trading days, becoming the top Nifty smallcap loser. The company reported a net loss of ₹48.9 crore in Q3, but saw a 299.73% increase in revenue to ₹1,034.5 crore. EBITDA loss reduced to ₹10.6 crore. Major projects contributing to performance include ASCON Phase IV and BSNL 4G Rollout.",
            "Sentiment": "negative",
            "PublishDate": 1739855143000,
            "Source": "earnings"
        },
        {
            "Title": "ITI Reports Reduced EBITDA Loss in Q3",
            "Summary": "ITI (Indian Telephone Industries Limited) has reported an EBITDA loss of 105 million rupees for the third quarter, showing a significant improvement from the 435 million rupee loss in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1739440310000,
            "Source": "earnings"
        },
        {
            "Title": "ITI Reports Significant Revenue Growth in Q3",
            "Summary": "ITI, an Indian telecommunications company, has reported a substantial increase in its third-quarter revenue. The company's revenue for Q3 reached 10.35 billion rupees, compared to 2.6 billion rupees in the same period last year, representing a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1739440275000,
            "Source": "earnings"
        },
        {
            "Title": "ITI Reports Reduced Net Loss in Q3",
            "Summary": "ITI Limited, a telecommunications equipment manufacturer, has reported a net loss of 489 million rupees for the third quarter, showing an improvement from the 1 billion rupee loss in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739440225000,
            "Source": "earnings"
        },
        {
            "Title": "ITI Secures Order Worth 167 Crore Rupees",
            "Summary": "ITI Limited has won a significant order valued at 167 crore rupees. This development represents a substantial business opportunity for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1737526120000,
            "Source": "order&deals"
        },
        {
            "Title": "ITI Ltd: Secures ₹64 Crore in Wi-Fi and Security Contracts",
            "Summary": "ITI Ltd has won two significant contracts: ₹35 crore from Sambalpur University for campus-wide Wi-Fi and LAN, and ₹29.14 crore from Central Railways for integrated security systems at six Mumbai railway stations. The projects include installation, commissioning, and maintenance services.",
            "Sentiment": "positive",
            "PublishDate": 1736768114000,
            "Source": "order&deals"
        },
        {
            "Title": "ITI Secures 640 Million Rupee Order",
            "Summary": "ITI Limited has received a new order valued at 640 million rupees. The company, which is likely in the telecommunications or technology sector, has successfully secured this significant contract, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1736765193000,
            "Source": "order&deals"
        },
        {
            "Title": "ITI Ltd: Shares Hit New All-Time High, Soaring Over 13% in Intraday Trade",
            "Summary": "ITI Ltd shares reached a new record high of Rs 432.45, up 13.5% in intraday trading. The stock's market capitalization stood at Rs 41,029.87 crore. ITI Ltd has shown consistent growth, with shares increasing 37.3% in the last year and 66.5% in the last 3 months.",
            "Sentiment": "positive",
            "PublishDate": 1735891162000,
            "Source": "normal_news"
        },
        {
            "Title": "ITI Block Trade: 3,040,125 Shares Traded at Rs 384.5 on NSE",
            "Summary": "A significant block trade occurred for ITI (Indian Telephone Industries Limited) on the National Stock Exchange (NSE). Approximately 3,040,125 shares were traded at a price of Rs 384.5 per share. The total value of this transaction amounts to Rs 116.89 crore. Multiple blocks were involved in this trade.",
            "Sentiment": "neutral",
            "PublishDate": 1735539314000,
            "Source": "block_deals"
        },
        {
            "Title": "ITI Block Trade on NSE: 482,437 Shares Traded at Rs 395",
            "Summary": "A block trade of approximately 482,437 shares of ITI (Indian Telephone Industries Limited) was executed on the National Stock Exchange (NSE) at a price of Rs 395 per share. The total value of this transaction amounts to Rs 19.06 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1733806745000,
            "Source": "block_deals"
        },
        {
            "Title": "ITI Limited Block Trade on NSE",
            "Summary": "A significant block trade of ITI Limited shares occurred on the National Stock Exchange (NSE). Approximately 1,539,411 shares were traded at a price of Rs. 339.00 per share, amounting to a total transaction value of Rs. 52.19 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1733472327000,
            "Source": "block_deals"
        },
        {
            "Title": "ITI Secures ₹95 Crore Contract for Mining Digital Transformation in Uttarakhand",
            "Summary": "ITI has been awarded a contract worth ₹95 crore for implementing a Mining Digital Transformation & Surveillance System (MDTSS) in Uttarakhand. This project aims to digitalize and enhance surveillance in the mining sector of the state.",
            "Sentiment": "positive",
            "PublishDate": 1731924366000,
            "Source": "corporate_action"
        },
        {
            "Title": "ITI Reports Reduced EBITDA Loss in Q2",
            "Summary": "ITI (Indian Telephone Industries Limited) has reported a reduced EBITDA loss of 86 million rupees in the second quarter, compared to a loss of 528 million rupees in the same period last year. This represents a significant year-over-year improvement in the company's operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1731578091000,
            "Source": "result"
        },
        {
            "Title": "ITI Reports Significant Revenue Growth in Q2",
            "Summary": "ITI, an Indian telecommunications company, has reported a substantial increase in its second-quarter revenue. The company's revenue for Q2 reached 10 billion rupees, compared to 2.5 billion rupees in the same quarter of the previous year, representing a 300% year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731578033000,
            "Source": "result"
        },
        {
            "Title": "ITI Reports Reduced Q2 Net Loss",
            "Summary": "ITI (Indian Telephone Industries Limited) has reported a net loss of 701 million rupees for the second quarter, showing an improvement from the 1.3 billion rupee loss in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731577992000,
            "Source": "result"
        },
        {
            "Title": "ITI Ltd: Wins Major BharatNet Phase-3 Contracts Worth ₹4,559 Crore",
            "Summary": "ITI Ltd emerged as the lowest bidder for three packages of BharatNet Phase-3 project, totaling ₹4,559 crore. The company won contracts for Package 15 (Arunachal Pradesh, Nagaland, Manipur) worth ₹1,537 crore, and Packages 8 and 9 (Himachal Pradesh, West Bengal, Andaman and Nicobar Islands) worth ₹3,022 crore. ITI's stock jumped 10.3% to ₹335 on the BSE following the news.",
            "Sentiment": "positive",
            "PublishDate": 1731300152000,
            "Source": "normal_news"
        },
        {
            "Title": "ITI Ltd: Shares Surge 33%, Analyst Predicts Further 10% Upside",
            "Summary": "ITI Ltd shares jumped 33% in one week, closing above the 200-day moving average. Anand James of Geojit Financial Services predicts another 10-11% upside potential, with support levels at Rs 284 or Rs 263.",
            "Sentiment": "positive",
            "PublishDate": 1731300067000,
            "Source": "normal_news"
        },
        {
            "Title": "ITI Ltd: Lowest Bidder for Rs 3,022-Crore BharatNet Project",
            "Summary": "ITI Ltd and its consortium partner emerged as the lowest bidder for BharatNet phase-3 project worth Rs 3,022 crore in Himachal Pradesh, West Bengal, and Andaman & Nicobar Islands. The project aims to provide high-speed broadband connectivity to all gram panchayats and villages in India.",
            "Sentiment": "positive",
            "PublishDate": 1730996022000,
            "Source": "normal_news"
        },
        {
            "Title": "ITI-Led Consortium Wins Rs. 3,022 Crore BharatNet Project",
            "Summary": "A consortium led by ITI Limited has emerged as the lowest bidder (L1) for a Rs. 3,022 crore BharatNet project to develop the middle mile network. This project is likely part of the Indian government's initiative to improve digital connectivity across the country.",
            "Sentiment": "positive",
            "PublishDate": 1730991170000,
            "Source": "corporate_action"
        }
    ]
}