{
    "Symbol": "IVALUE",
    "ISIN": "INE056801025",
    "News": [
        {
            "Title": "iValue Infosolutions Q3FY26 Results: Profit Dips 13%",
            "Summary": "iValue Infosolutions reported consolidated net profit of ₹1,566 lakhs for Q3FY26, down 18.8% YoY. Revenue grew 14.8% to ₹22,567 lakhs despite exceptional items of ₹569 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1770204913407,
            "Source": "co_actions_results"
        },
        {
            "Title": "iValue Infosolutions Pays ₹11,800 Fine to NSE",
            "Summary": "iValue Infosolutions Limited paid a ₹10,000 fine plus GST to NSE for delayed related party transaction disclosure filing, citing inadvertent oversight in first quarterly disclosure post-listing.",
            "Sentiment": "neutral",
            "PublishDate": 1766843756987,
            "Source": "stocks"
        },
        {
            "Title": "iValue Infosolutions Allots 10.75 Lakh Shares via ESOP",
            "Summary": "iValue Infosolutions Limited allotted 10,75,100 equity shares to 47 employees under its Employee Stock Option Plan 2024, increasing paid-up share capital to ₹10.92 crores and realizing ₹2.99 crores.",
            "Sentiment": "positive",
            "PublishDate": 1766559649952,
            "Source": "co_actions_results"
        },
        {
            "Title": "iValue Infosolutions Reports Record Q2 FY26 Performance in First Earnings Call Post-Listing",
            "Summary": "iValue Infosolutions achieved its highest-ever quarterly gross sales of Rs 887 crores (37% YoY growth) and net sales of Rs 329 crores (52% YoY growth) in Q2 FY26, with PAT growing 57% to Rs 29.7 crores. The technology solutions company, operating across cybersecurity, data center infrastructure, and cloud segments, maintains 42% annuity revenue contribution and expects continued growth driven by AI adoption and digital transformation investments.",
            "Sentiment": "positive",
            "PublishDate": 1763391846218,
            "Source": "earnings"
        },
        {
            "Title": "iValue Infosolutions Reports Strong H1FY26 Growth with 34% Revenue Jump to ₹1,494 Crores",
            "Summary": "iValue Infosolutions reported gross sales of ₹1,494 crores for H1FY26, marking a 34% year-on-year increase. The company's EBITDA grew 32% to ₹60 crores, while profit after tax surged 43% to ₹40 crores. The technology distributor expanded its partner network to 111 OEMs and generated 42% of revenue from annuity business. The company plans global expansion through new partnerships with Entrust, Hitachi Vantara, and Micro Focus in data security and AI sectors. iValue is focusing on margin expansion through value-added cybersecurity and cloud solutions for enterprises.",
            "Sentiment": "positive",
            "PublishDate": 1762875090532,
            "Source": "earnings"
        },
        {
            "Title": "iValue InfoSolutions Reports 54% Jump in Q2 Net Profit to 296 Million Rupees",
            "Summary": "iValue InfoSolutions reported quarterly net profit of 296 million rupees compared to 192 million rupees in the same period last year, marking a 54% increase. The company's revenue grew 50% to 3.3 billion rupees from 2.2 billion rupees year-over-year. EBITDA rose to 411 million rupees from 268 million rupees, while EBITDA margin improved slightly to 12.47% from 12.39% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762864832500,
            "Source": "earnings"
        },
        {
            "Title": "iValue Infosolutions Schedules Q2 FY26 Results Announcement and Earnings Call for November 11, 2025",
            "Summary": "iValue Infosolutions Limited will announce its results for the second quarter and half year of FY26, ended September 30, 2025, on November 11, 2025. The company has scheduled an earnings conference call with analysts and investors on the same day at 6:30 PM IST. The management representation will include Chairman & Managing Director Sunil Kumar Pillai, Executive Director Krishna Raj Sharma, and Chief Financial Officer Swaroop Muwvala. iValue Infosolutions operates as a Strategic Technology Advisor, securing and managing enterprises' digital assets in hybrid-cloud environments with 500+ experts and partnerships with top OEMs across India, SAARC and Southeast Asia.",
            "Sentiment": "neutral",
            "PublishDate": 1762464188382,
            "Source": "earnings"
        },
        {
            "Title": "iValue Infosolutions Reports Q1 FY26 Results with Standalone Revenue of Rs 21,457 Lakhs",
            "Summary": "iValue Infosolutions Limited announced its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 21,457 lakhs compared to Rs 25,473 lakhs in the previous quarter and Rs 18,998 lakhs in the same quarter last year. Standalone profit after tax was Rs 1,017 lakhs versus Rs 3,711 lakhs in the previous quarter and Rs 970 lakhs year-on-year. On a consolidated basis, revenue from operations stood at Rs 22,790 lakhs with profit after tax of Rs 1,036 lakhs. The company's earnings per share on a standalone basis was Rs 1.88 for the quarter. The company operates primarily in hardware and software & allied support services and got listed on BSE and NSE on September 25, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760626450451,
            "Source": "earnings"
        }
    ]
}