{
    "Symbol": "IVP",
    "ISIN": "INE043C01018",
    "News": [
        {
            "Title": "IVP Limited Reports Strong Q3 FY26 Performance",
            "Summary": "IVP Limited delivered robust Q3 FY26 results with revenue of ₹14,497 lakhs and net profit of ₹463 lakhs, showing significant growth over the previous year despite exceptional charges.",
            "Sentiment": "positive",
            "PublishDate": 1769687000253,
            "Source": "co_actions_results"
        },
        {
            "Title": "IVP Limited Reports Rs. 195 Lakh Employee Fraud, Files FIR",
            "Summary": "IVP Limited disclosed a Rs. 195 lakh fraud by sales employee involving customer document falsification. Company filed FIR against the employee and made full provision in books with no operational impact.",
            "Sentiment": "negative",
            "PublishDate": 1769679428970,
            "Source": "stocks"
        },
        {
            "Title": "IVP Limited Board Meeting Set for January 29, 2026",
            "Summary": "IVP Limited has scheduled a board meeting on January 29, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed until 48 hours post-announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1769077467011,
            "Source": "co_actions_results"
        },
        {
            "Title": "IVP Limited Reports Employee Fraud Case to Exchanges",
            "Summary": "IVP Limited disclosed fraud by sales employee involving misrepresentation and falsification of customer records. Company investigating financial impact and filing complaint.",
            "Sentiment": "negative",
            "PublishDate": 1768313274861,
            "Source": "stocks"
        },
        {
            "Title": "IVP Limited Shares Investor Presentation for Q2 & H1 FY26 Financial Results",
            "Summary": "IVP Limited submitted an investor presentation to stock exchanges covering unaudited financial results for the quarter and half year ended September 30, 2025. The company reported revenue growth of 20% year-on-year to ₹146.95 crores in Q2 FY26, with EBITDA rising 42% to ₹8.99 crores driven by festive season demand and operational efficiencies in foundry chemicals and polyurethane segments.",
            "Sentiment": "positive",
            "PublishDate": 1763462886658,
            "Source": "stock"
        },
        {
            "Title": "IVP Limited Reports 247% Jump in Quarterly Profit to ₹400 Lakhs",
            "Summary": "IVP Limited announced unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported a quarterly profit of ₹400 lakhs compared to ₹119 lakhs in the previous quarter, marking a significant increase. Revenue from operations grew to ₹14,695 lakhs from ₹13,819 lakhs in the previous quarter. For the half-year period, profit reached ₹519 lakhs versus ₹598 lakhs in the corresponding period last year. Half-year revenue increased to ₹28,514 lakhs from ₹26,027 lakhs. Earnings per share for the quarter stood at ₹3.87 compared to ₹1.15 in the previous quarter. The Board of Directors approved these results at their meeting held on November 5, 2025. The company operates in the manufacturing of chemicals business.",
            "Sentiment": "positive",
            "PublishDate": 1762338699109,
            "Source": "earnings"
        },
        {
            "Title": "IVP Limited Schedules Board Meeting on November 5, 2025 to Approve Q2 Financial Results",
            "Summary": "IVP Limited has scheduled a Board of Directors meeting on November 5, 2025, to consider and approve the unaudited financial results for the second quarter and half year ended September 30, 2025. The company also announced that the trading window will remain closed until 48 hours after the announcement of the financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1761204102741,
            "Source": "corporate_action"
        },
        {
            "Title": "IVP Limited Submits Investor Presentation for Q1 FY26 Results",
            "Summary": "IVP Limited submitted an investor presentation for the quarter ended June 30, 2025. The company operates in two core business verticals: Phenolic Resins (Foundry Chemicals) and Polyurethane Resins, serving foundry applications, footwear solutions, and flexible packaging industries. For Q1 FY26, revenue from operations remained flat year-over-year at ₹138.19 crores compared to ₹138.26 crores in Q1 FY25. However, EBITDA declined significantly by 30% to ₹5.31 crores from ₹7.63 crores, with EBITDA margin compressing to 3.84% from 5.52%. Profit after tax dropped 65% to ₹1.19 crores from ₹3.43 crores. The company cited weak demand in the chemical industry, volatile imported raw material prices, subdued customer production due to early monsoon onset, and intense competition from lower-priced imports as key challenges. IVP operates manufacturing facilities in Tarapur and Bengaluru with a combined annual production capacity of 50,000 tonnes and serves over 500 clients with 150+ products.",
            "Sentiment": "negative",
            "PublishDate": 1756115250243,
            "Source": "earnings"
        },
        {
            "Title": "IVP Limited Shareholders Approve Key Board Appointments at 96th AGM",
            "Summary": "IVP Limited shareholders approved two significant board appointments at their 96th Annual General Meeting. Rajkumar Lekhwani was appointed as Non-Executive Director effective June 6, 2025, liable to retire by rotation. Lekhwani is a 49-year-old Chartered Accountant with over 24 years of experience in finance and business leadership across FMCG, pharmaceuticals, and capital goods sectors, including a 14-year tenure at Procter & Gamble and senior roles at ACG and Crompton Greaves. Additionally, shareholders approved the re-appointment of Mandar P. Joshi as Whole-Time Director & Chief Executive Officer for a three-year term effective August 1, 2025. Joshi, who originally joined as CEO in 2015 and became Whole-Time Director & CEO in 2016, holds a B.Tech from IIT Mumbai and has 29 years of chemical industry experience, including previous roles at Gharda Chemicals and BASF Group. Both appointees are confirmed as not being debarred by any regulatory authority and have no inter-se relationships with other directors or key managerial personnel.",
            "Sentiment": "positive",
            "PublishDate": 1753980609519,
            "Source": "corporate_governance"
        },
        {
            "Title": "IVP Ltd Reports Q1 Results and Announces Chairman Transition",
            "Summary": "IVP Ltd approved its unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of ₹13,819 lakhs compared to ₹13,826 lakhs in the same quarter last year. Net profit for the quarter was ₹119 lakhs, down from ₹343 lakhs in the corresponding quarter of the previous year. In leadership changes, Mr. T.K. Gowrishankar will step down from his position as Director and Chairman effective August 1, 2025. Mr. Rajkumar Lekhwani has been appointed as the new Chairman from the same date. The Board acknowledged Mr. Gowrishankar's guidance and leadership during his tenure. The company operates in the chemicals manufacturing business and has a paid-up equity share capital of ₹1,033 lakhs with earnings per share of ₹1.15 for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1753971568575,
            "Source": "earnings"
        }
    ]
}