{
    "Symbol": "IXIGO",
    "ISIN": "INE0HV901016",
    "News": [
        {
            "Title": "Ixigo Conducts Analyst Meetings with Top Fund Managers",
            "Summary": "Le Travenues Technology Limited (ixigo) held multiple one-on-one meetings with research analysts and fund managers from leading mutual funds on February 11, 2026, confirming no price sensitive information was discussed.",
            "Sentiment": "neutral",
            "PublishDate": 1770820951859,
            "Source": "stocks"
        },
        {
            "Title": "ixigo Launches Airport Cab Service Across India",
            "Summary": "Le Travenues Technology's ixigo introduces Airport Cabs service with on-time pickups, zero cancellations, and coverage across 100+ cities. First-time users get 50% off up to Rs 200.",
            "Sentiment": "positive",
            "PublishDate": 1770806044334,
            "Source": "stocks"
        },
        {
            "Title": "Ixigo Management Meets Prosus Principal in Virtual Session",
            "Summary": "Le Travenues Technology Limited (Ixigo) management conducted a virtual meeting with Gaurav Kothari, Principal from Prosus on February 05, 2026, confirming no unpublished price sensitive information was shared.",
            "Sentiment": "neutral",
            "PublishDate": 1770301432410,
            "Source": "stocks"
        },
        {
            "Title": "ixigo Reports Strong Q3 FY26 Results Despite Flight Disruptions",
            "Summary": "Le Travenues Technology (ixigo) delivered record revenue of INR317.6 crores and GTV of INR4,902.9 crores in Q3 FY26, demonstrating resilience during airline disruptions with 31% revenue growth and 54% PAT increase year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1769696072874,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ixigo Submits Q3FY26 Monitoring Agency Reports",
            "Summary": "Le Travenues Technology (ixigo) filed monitoring agency reports for Q3FY26 showing utilization of IPO and preferential issue proceeds across technology investments, working capital, and strategic initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1769090874804,
            "Source": "stocks"
        },
        {
            "Title": "ixigo Reports Strong Q3FY26 Results with 31% Revenue Growth",
            "Summary": "Le Travenues Technology (ixigo) posted consolidated revenue of ₹3,175.64 crores in Q3FY26, up 31.36% YoY, with net profit rising 54.17% to ₹239.51 crores. The company also raised ₹12,955.63 crores through preferential allotment.",
            "Sentiment": "positive",
            "PublishDate": 1769080123134,
            "Source": "co_actions_results"
        },
        {
            "Title": "Le Travenues Technology Grants 98,944 Stock Options",
            "Summary": "Le Travenues Technology Limited approved grant of 98,944 employee stock options across three ESOS schemes at ₹93 per option exercise price on January 22, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769074092231,
            "Source": "co_actions_results"
        },
        {
            "Title": "IXIGO Q3FY26 Results & Earnings Call on Jan 22",
            "Summary": "Le Travenues Technology Limited (IXIGO) announces board meeting and earnings call scheduled for January 22, 2026, to discuss Q3FY26 financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768798468804,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ixigo shares surge 10% on JM Financial upgrade",
            "Summary": "Le Travenues Technology shares jumped 10% to ₹232.55 after JM Financial upgraded the stock to 'Buy' from 'Reduce', setting a target price of ₹275 despite recent quarterly losses.",
            "Sentiment": "positive",
            "PublishDate": 1768308021240,
            "Source": "stocks"
        },
        {
            "Title": "Ixigo shares surge 9% on JM Financial double upgrade",
            "Summary": "Le Travenues Technology (Ixigo) shares jumped over 9% after JM Financial upgraded rating to 'Buy' from 'Reduce', setting target price at ₹275 with 29% upside potential despite recent correction.",
            "Sentiment": "positive",
            "PublishDate": 1768293017706,
            "Source": "stocks"
        },
        {
            "Title": "Ixigo shares surge 7% on JM Financial upgrade to Buy",
            "Summary": "JM Financial upgraded Le Travenues Technology (Ixigo) to 'Buy' with ₹275 target price, citing attractive valuations after 20% correction, strong fundamentals, and 30% upside potential from current levels.",
            "Sentiment": "positive",
            "PublishDate": 1768286062163,
            "Source": "stocks"
        },
        {
            "Title": "Ixigo Sets Up New Subsidiary in Singapore",
            "Summary": "Le Travenues Technology (Ixigo) establishes Ixigo Pte. Ltd. as a fully-owned subsidiary in Singapore, marking the company's expansion into Southeast Asian markets.",
            "Sentiment": "positive",
            "PublishDate": 1766062564418,
            "Source": "stocks"
        },
        {
            "Title": "IXIGO incorporates Singapore subsidiary for expansion",
            "Summary": "Le Travenues Technology Limited has incorporated IXIGO PTE. LTD., a wholly owned subsidiary in Singapore on December 18, 2025, with SGD 50,000 investment to lead international expansion and strategic initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1766061358941,
            "Source": "co_actions_results"
        },
        {
            "Title": "Le Travenues Technology Grants 508,613 Employee Stock Options Across Four ESOS Schemes",
            "Summary": "Le Travenues Technology's Nomination and Remuneration Committee approved the grant of 508,613 stock options under four employee stock option schemes (ESOS 2013, 2016, 2020, and 2021) at an exercise price of Rs. 93 per option. The options will vest over periods ranging from one to four years and aim to motivate employees, retain talent, and align employee interests with long-term company growth and shareholder value creation.",
            "Sentiment": "positive",
            "PublishDate": 1763394182972,
            "Source": "corporate_action"
        },
        {
            "Title": "MIH Investments One B.V. Acquires 10.6% Stake in Le Travenues Technology (Ixigo) Through Preferential Allotment",
            "Summary": "MIH Investments One B.V. acquired 46,270,092 shares representing 10.6% of Le Travenues Technology Limited (Ixigo) through preferential allotment on November 12, 2025. The acquisition increased MIH's total shareholding from 4.76% to 15.36%, making it a substantial shareholder in the travel technology company.",
            "Sentiment": "positive",
            "PublishDate": 1763362734263,
            "Source": "corporate_action"
        },
        {
            "Title": "Le Travenues Technology (ixigo) Reports 37% Revenue Growth Despite Market Headwinds, Raises INR 1,296 Crores from Prosus",
            "Summary": "Le Travenues Technology (ixigo) reported revenue from operations of INR 282.7 crores for Q2 FY26, marking 37% year-on-year growth despite challenging market conditions. The company achieved GTV growth of 23% to INR 4,347.5 crores and maintained adjusted EBITDA margin at 10% with INR 28.5 crores. The flights segment delivered strong performance with 60% revenue growth and 29% GTV increase, even as the domestic aviation market contracted by 2%. Bus business showed robust growth with 51% GTV increase to INR 571.9 crores and 46% growth in passenger segments. The trains segment faced ecosystem-related adjustments due to Indian Railways policy changes including reduced advance booking windows and Aadhaar authentication requirements, resulting in slower growth. The company announced a fundraise of approximately INR 1,296 crores through preferential issuance to MIH Investments One B.V. (Prosus) to strengthen balance sheet and accelerate AI-led growth initiatives. Cash flow for H1 FY26 stood at INR 91.5 crores. PAT was negative at INR 3.5 crores primarily due to a one-time non-cash ESOP charge of INR 26.9 crores related to early achievement of performance milestones.",
            "Sentiment": "positive",
            "PublishDate": 1762369704231,
            "Source": "earnings"
        },
        {
            "Title": "Le Travenues Technology (ixigo) Passes Three Special Resolutions in Extraordinary General Meeting",
            "Summary": "Le Travenues Technology Limited held an Extraordinary General Meeting on November 1, 2025, where shareholders approved three special resolutions through electronic voting. The first resolution approved the offer, issuance and allotment of equity shares on a private placement/preferential basis, receiving 99.16% votes in favor. The second resolution approved amendments to the Articles of Association and grant of special rights to an identified shareholder pursuant to SEBI Listing Regulations, also receiving 99.16% approval. The third resolution approved amendments to the Articles of Association by deletion of references to Part A and Part B in Section I-Applicability of Table F, receiving 99.43% votes in favor. All resolutions were conducted through remote e-voting and e-voting during the meeting, with scrutinizer Suryakant Gupta overseeing the voting process. The company trades on NSE under symbol IXIGO and BSE under scrip code 544192.",
            "Sentiment": "positive",
            "PublishDate": 1762001814567,
            "Source": "corporate_action"
        },
        {
            "Title": "Ixigo Parent Le Travenues Technology Shares Drop 19% Despite Revenue Growth Following Net Loss Report",
            "Summary": "Le Travenues Technology shares fell 19.3% to Rs 262 after reporting a net loss of Rs 3.4 crore compared to a Rs 13 crore profit in the same quarter last year. The loss included a one-off ESOP expense of Rs 26.9 crore, and excluding this impact, profit before tax increased 26% year-on-year to Rs 24.4 crore. Revenue from operations grew 37% to Rs 283 crore, with flight revenue up 60% to Rs 89.4 crore and bus revenue rising 64% to Rs 65.4 crore. Gross transaction value increased 23% to Rs 4,347.5 crore, driven by growth across flight, bus, and train segments. Adjusted EBITDA rose 36% to Rs 28.5 crore. Prosus recently invested Rs 1,295 crore for a 10% stake at Rs 280 per share.",
            "Sentiment": "negative",
            "PublishDate": 1761804394543,
            "Source": "earnings"
        },
        {
            "Title": "Le Travenues Technology Focuses on AI-Driven Travel Tech and Tier-II Expansion",
            "Summary": "Le Travenues Technology is positioning itself for long-term growth through AI-driven travel technology, expansion into Tier-II markets, and development of margin-rich ancillary revenue streams. The company's strategy aims to strengthen its profitability outlook through these growth initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1761755125862,
            "Source": "stock"
        },
        {
            "Title": "Le Travenues Tech Reports Strong Growth in Buses and Flights Segments",
            "Summary": "Le Travenues Tech reported rapid growth in its quarterly results with significant increases in Gross Transaction Value (GTV). The company's bus segment grew 51% year-over-year while the flights segment increased 29% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761752067514,
            "Source": "earnings"
        },
        {
            "Title": "Le Travenues Tech Reports Q2 Net Loss of 32M Rupees Despite Revenue Growth",
            "Summary": "Le Travenues Tech reported a consolidated net loss of 32 million rupees in Q2, compared to a profit of 131 million rupees in the same period last year. The company's revenue increased to 2.8 billion rupees from 2.06 billion rupees year-over-year. However, EBITDA turned negative with a loss of 38 million rupees versus a gain of 180 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1761744072801,
            "Source": "earnings"
        },
        {
            "Title": "Peak XV Partners Investments V Sells 13 Million Shares in Le Travenues Technology",
            "Summary": "Peak XV Partners Investments V sold 13 million equity shares of Le Travenues Technology Limited through an off-market transaction on October 10, 2025. The sale reduced Peak XV's stake from 10.04% to 6.71% of the total share capital. The shares were sold at face value of Re.1 each, representing 3.33% of the company's total voting capital. Le Travenues Technology trades on BSE and NSE under scrip codes 544192 and IXIGO respectively. Peak XV is not part of the promoter group. The company's total equity share capital remains unchanged at 390,291,963 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1760507178042,
            "Source": "order&deals"
        },
        {
            "Title": "SAIF Partners India IV Reduces Stake in IXIGO by 3.27%",
            "Summary": "SAIF Partners India IV Limited sold 14,275,095 shares of Le Travenues Technology Limited (IXIGO), reducing its shareholding from 5.76% to 2.49%. The transaction occurred on October 10, 2025, through both open market sales (6,469,256 shares) and off-market transactions (7,805,839 shares). SAIF Partners is not part of the promoter group. IXIGO's total equity share capital remains unchanged at Rs. 436,673,699 comprising 436,673,699 equity shares of face value Rs. 1 each. The company's shares are listed on both NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1760416259528,
            "Source": "corporate_action"
        },
        {
            "Title": "Le Travenues Technology Board Approves ₹1,295.56 Crore Equity Share Issuance",
            "Summary": "Le Travenues Technology's board has approved the issuance of 46,270,092 equity shares priced at ₹280 each, raising a total of ₹1,295.56 crore. The funds raised will be utilized for organic and inorganic growth initiatives, working capital requirements, and general corporate purposes. The company has scheduled an Extraordinary General Meeting for November 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760066947984,
            "Source": "corporate_action"
        },
        {
            "Title": "Unnamed Investor Eyes Up to 16% Stake in Ixigo Parent Company",
            "Summary": "Le Travenues Technology Ltd., parent company of travel aggregator Ixigo, announced that an unnamed investor is looking to acquire up to 16% stake through secondary acquisitions. No definitive agreements have been made. The company reported strong quarterly results with revenue up 73% to ₹314.4 crore, EBITDA rising 53.4% to ₹25.47 crore, and net profit increasing 27.7% to ₹18.9 crore. Ixigo maintains its projection of over 40% gross transaction value growth for financial year 2026. Shares closed 1.4% lower at ₹307.5 but have gained 118% over the past six months.",
            "Sentiment": "positive",
            "PublishDate": 1759889236402,
            "Source": "stock"
        },
        {
            "Title": "Le Travenues Tech's Abhibus Partners with OSRTC to Digitize Odisha State Bus Services",
            "Summary": "Le Travenues Tech's Abhibus has partnered with Odisha State Road Transport Corporation (OSRTC) to enhance state bus services in Odisha. The collaboration will provide digital booking capabilities, real-time tracking features, and access to 4,800 daily bus services for passengers in the state.",
            "Sentiment": "positive",
            "PublishDate": 1758782367263,
            "Source": "stock"
        },
        {
            "Title": "Schroders Group Increases Shareholding in Le Travenues Technology by Over 2%",
            "Summary": "Schroders Group entities, acting as discretionary fund managers, increased their shareholding in Le Travenues Technology Limited by more than 2% through share acquisition on September 18, 2025. The acquisition triggered regulatory disclosure requirements under SEBI regulations, with appropriate forms filed to the Bombay Stock Exchange and National Stock Exchange of India. The shares were acquired through open market transactions. Schroders Group does not belong to the promoter group of Le Travenues Technology Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1758525004466,
            "Source": "stock"
        },
        {
            "Title": "Ixigo Shares Rise 3% as Jefferies' Chris Wood Adds Stock to India Portfolio",
            "Summary": "Le Travenues Technology shares jumped over 3% to Rs 282 after Jefferies' Global Head of Equity Strategy Christopher Wood added the Ixigo operator to his India long-only portfolio with a 4% weight. Wood also added Ambuja Cements and Lemon Tree Hotels with 4% weights each, while removing Reliance Industries and Axis Bank and reducing positions in ICICI Bank, REC and JSW Energy. The smallcap company has a market capitalization of Rs 10,883 crore and has delivered 88% returns over the past year, outperforming the Nifty India Tourism index's 13% return. Ixigo reported consolidated net profit of Rs 19 crore in the June quarter, up 28.5% from Rs 15 crore year-on-year, while revenue grew 74% to Rs 321 crore from Rs 184 crore.",
            "Sentiment": "positive",
            "PublishDate": 1758273468705,
            "Source": "stock"
        },
        {
            "Title": "Ixigo Partners with Cred for Enhanced Flight Booking Experience on New Credit Card",
            "Summary": "Le Travenues Technology's Ixigo has partnered with Cred to enhance flight booking services for the new Cred IndusInd Bank RuPay Credit Card. The collaboration aims to provide customers with improved travel experience through streamlined booking processes and special benefits.",
            "Sentiment": "positive",
            "PublishDate": 1758013251249,
            "Source": "order&deals"
        },
        {
            "Title": "ixigo Partners with Delhi Metro and ONDC to Launch QR-Based Metro Ticket Booking Service",
            "Summary": "Le Travenues Technology's ixigo has partnered with Delhi Metro and ONDC to introduce metro ticket booking services. The service features QR-based tickets and offers full cashback for new users.",
            "Sentiment": "positive",
            "PublishDate": 1757661351930,
            "Source": "stock"
        },
        {
            "Title": "Le Travenues Technology Schedules Investor Meeting with International Finance Corporation",
            "Summary": "Le Travenues Technology Limited has scheduled a one-on-one physical meeting with representatives from International Finance Corporation on September 16, 2025, at 12:30 PM IST in New Delhi. The meeting will be attended by Ms. Naina Sharma and Ms. Tamanna Samant, both consultants from International Finance Corporation. The company will use its investor presentation from July 16, 2025, which covers financial results for the quarter ended June 30, 2025. The company noted that the schedule and participants may change due to exigencies.",
            "Sentiment": "neutral",
            "PublishDate": 1757609504621,
            "Source": "stock"
        },
        {
            "Title": "Le Travenues Technology's Abhibus Expands to 17 State Road Transport Corporation Partnerships",
            "Summary": "Le Travenues Technology's Abhibus platform has expanded its partnerships to include 17 State Road Transport Corporations across India. The company added 7 new SRTCs including ASTC, SBSTC, and TSRTC to enhance bus travel options for customers.",
            "Sentiment": "positive",
            "PublishDate": 1756964596844,
            "Source": "stock"
        },
        {
            "Title": "ixigo Launches Tricolour Travel Sale with Up to 15% Discounts on Flights and Hotels",
            "Summary": "ixigo has launched its Tricolour Travel Sale running from August 8-12, 2025, ahead of Independence Day weekend. The sale offers flat 12% off on flights and hotels using coupon code 'FREEDOM' with no minimum booking amount and savings up to Rs.1,000. Additional discounts of up to 15% (maximum Rs.5,000) are available through ICICI Bank and AU Small Finance Bank credit cards. The company is experiencing a 25-30% year-on-year increase in flight bookings for leisure travel around Independence Day, with Dehradun, Port Blair, Goa, and Coimbatore emerging as popular destinations. Group CEO Aloke Bajpai noted increased demand due to the four-day weekend opportunity, with travelers taking advantage of August 15th falling on a Friday.",
            "Sentiment": "positive",
            "PublishDate": 1754634423254,
            "Source": "stock"
        },
        {
            "Title": "SAIF Partners India IV Reduces Stake in Le Travenues Technology to 6.45%",
            "Summary": "SAIF Partners India IV Limited sold 10,125,695 shares of Le Travenues Technology Limited through open market transactions on July 22, 2025. The sale reduced SAIF Partners' shareholding from 9.04% to 6.45%, representing a 2.59% reduction in stake. After the transaction, SAIF Partners holds 25,166,256 shares in the company. Le Travenues Technology's total equity share capital remains unchanged at Rs. 390,291,963 comprising 390,291,963 equity shares of face value Rs. 1 each. The company trades on NSE and BSE under the scrip name IXIGO.",
            "Sentiment": "neutral",
            "PublishDate": 1753273117149,
            "Source": "stock"
        },
        {
            "Title": "Schroder Group Becomes Substantial Shareholder in Le Travenues Technology",
            "Summary": "Schroder Investment Management (Singapore) Ltd and associated Schroder Group entities have acquired shares in Le Travenues Technology Limited through open market purchases on July 17, 2025. The acquisition increased their combined shareholding from 4.920% to 5.176%, crossing the substantial shareholder threshold. The shares were acquired by various Schroder funds including Schroder International Selection Fund Asian Total Return, which purchased 1,658,750 shares (0.425% stake), and other associated funds that collectively acquired 1,000,000 shares (0.256% stake). Le Travenues Technology has a total equity share capital of 390,403,607 shares and is listed on both the National Stock Exchange of India and Bombay Stock Exchange. The Schroder entities are acting as discretionary fund managers and are not part of the promoter group.",
            "Sentiment": "neutral",
            "PublishDate": 1753098694331,
            "Source": "stock"
        },
        {
            "Title": "Le Travenues Technology (ixigo): Q1 FY26 Results Drive Stock Volatility",
            "Summary": "ixigo's parent company reported strong Q1 FY26 results with 73% YoY revenue growth to Rs 314.5 crore and 27% YoY net profit increase to Rs 19 crore. The stock initially surged 19% but later declined 6% to Rs 201.7 after touching a record high of Rs 215.",
            "Sentiment": "positive",
            "PublishDate": 1752815292000,
            "Source": "earnings"
        },
        {
            "Title": "Ixigo: CEO Reveals Strategy Behind Strong Q1 Performance",
            "Summary": "Ixigo's CEO Aloke Bajpai attributes the company's strong Q1 FY26 results to a decade-long strategy focusing on India's underserved market. The company has built a large user base in trains, buses, and flights, targeting the 'next billion users'. Ixigo claims 60% market share in online train bookings, third position in flights, and second in buses.",
            "Sentiment": "positive",
            "PublishDate": 1752800897000,
            "Source": "earnings"
        },
        {
            "Title": "Le Travenues Technology Ltd: Ixigo's Q1 Results Drive 12% Stock Surge",
            "Summary": "Le Travenues Technology Ltd, Ixigo's parent company, reported strong Q1 results with revenue up 73% YoY to ₹314.4 crore and EBITDA growth of 53.4% YoY to ₹25.47 crore. Net profit increased 27.7% YoY to ₹18.9 crore. Flight business revenue grew 148% YoY, while train and bus segments also showed significant growth. The company's stock reached a post-listing high of ₹199.95.",
            "Sentiment": "positive",
            "PublishDate": 1752725571000,
            "Source": "earnings"
        },
        {
            "Title": "Le Travenues Tech Reports Q1 Financial Results",
            "Summary": "Le Travenues Tech has announced its financial results for the first quarter. The company reported a consolidated net profit of 190 million rupees, compared to 148.6 million rupees in the same period last year. Revenue for Q1 increased to 3.14 billion rupees from 1.82 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1752711086000,
            "Source": "default"
        },
        {
            "Title": "Ixigo Aims to Become India's Top AI Travel Tech Platform",
            "Summary": "Ixigo is focusing on expanding its presence in Tier II/III markets in India and offering multi-modal travel options. The company is leveraging technology to drive profits and positioning itself to cater to the next billion users. Ixigo is emphasizing ongoing profitability while expanding across various sectors in the travel industry.",
            "Sentiment": "positive",
            "PublishDate": 1752678396000,
            "Source": "default"
        },
        {
            "Title": "LE Travenues Technology Ltd: Q1 Profit Soars 27.7%, Revenue Up 74.2%",
            "Summary": "LE Travenues Technology Ltd (Ixigo) reported Q1 FY26 net profit of ₹18.9 crore, up 27.7% YoY. Revenue jumped 74.2% to ₹314.4 crore. Gross Transaction Value increased 55% to ₹4,644.7 crore, driven by strong growth in flight and bus segments. EBITDA rose 53.1% to ₹25.5 crore.",
            "Sentiment": "positive",
            "PublishDate": 1752671413000,
            "Source": "earnings"
        },
        {
            "Title": "Le Travenues Tech Reports Q1 Financial Results",
            "Summary": "Le Travenues Tech has announced its Q1 financial results. The company's EBITDA increased to 256 million rupees from 168 million rupees year-over-year. However, the EBITDA margin decreased to 8.14% from 9.24% in the same period. The consolidated net profit rose to 190 million rupees from 148.6 million rupees year-over-year. Revenue showed significant growth, reaching 3.14 billion rupees compared to 1.82 billion rupees in the previous year's Q1.",
            "Sentiment": "positive",
            "PublishDate": 1752668041000,
            "Source": "result"
        },
        {
            "Title": "LE TRAVENUES TECH Reports Strong Q4 Financial Results",
            "Summary": "LE TRAVENUES TECH has announced its Q4 financial results, showing significant year-over-year growth. The company's EBITDA increased from 156M to 248M rupees, while revenue grew from 1.65B to 2.8B rupees. Net profit also rose from 90M to 167M rupees compared to the same quarter last year. However, the EBITDA margin slightly decreased from 9.46% to 8.73%.",
            "Sentiment": "positive",
            "PublishDate": 1747228335000,
            "Source": "result"
        },
        {
            "Title": "Le Travenues Tech to Consider Q4 Results on May 14",
            "Summary": "Le Travenues Tech has announced that it will consider its fourth quarter (Q4) financial results on May 14. This indicates the company is preparing to release its latest quarterly earnings report, which will provide insights into its financial performance for the most recent fiscal period.",
            "Sentiment": "neutral",
            "PublishDate": 1746445104000,
            "Source": "default"
        },
        {
            "Title": "Le Travenues Tech Reports Mixed Q3 Financial Results",
            "Summary": "Le Travenues Tech announced its Q3 consolidated financial results. The company reported a net profit of 155.24 million rupees, which is lower compared to 301 million rupees in the same quarter last year (YoY) but higher than 130.85 million rupees in the previous quarter (QoQ). Revenue for Q3 increased to 2.42 billion rupees from 1.71 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738109890000,
            "Source": "earnings"
        },
        {
            "Title": "LE TRAVENUES TECH Reports Q3 EBITDA Growth with Margin Decline",
            "Summary": "LE TRAVENUES TECH has reported its Q3 financial results. The company's EBITDA increased to 213.4 million rupees from 174.7 million rupees in the same quarter last year. However, the EBITDA margin decreased to 8.82% from 10.24% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738067447000,
            "Source": "earnings"
        },
        {
            "Title": "Le Travenues Technology Reports Q3 Revenue Increase",
            "Summary": "Le Travenues Technology, an Indian technology company, has reported a significant increase in its third-quarter revenue. The company's revenue for Q3 reached 2.42 billion rupees, compared to 1.71 billion rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738067439000,
            "Source": "earnings"
        },
        {
            "Title": "Le Travenues Technology Reports Q3 Financial Results",
            "Summary": "Le Travenues Technology has announced its consolidated financial results for the third quarter. The company reported a net profit of 155.24 million rupees, which represents a decrease compared to the same period last year (301 million rupees) but an increase from the previous quarter (130.85 million rupees).",
            "Sentiment": "neutral",
            "PublishDate": 1738067432000,
            "Source": "earnings"
        },
        {
            "Title": "Le Travenues Technology Ltd: Analyst Predicts 25% Upside for ixigo Stock",
            "Summary": "JM Financial initiates coverage on Le Travenues Technology Ltd (ixigo) with a 'Buy' rating and ₹180 price target, implying 25% upside. The brokerage cites ixigo's strong position in train ticketing, growth in flight and bus segments, and potential benefits from expanding travel market in lower-tier cities. JM Financial forecasts 26% GTV growth and 45% EBITDA expansion over FY24-27.",
            "Sentiment": "positive",
            "PublishDate": 1736850197000,
            "Source": "normal_news"
        },
        {
            "Title": "Le Travenues Technology Limited: ixigo Launches 3X Refund 'Travel Guarantee' for Waitlisted Train Tickets",
            "Summary": "ixigo introduces a 'Travel Guarantee' feature offering 3X refund for unconfirmed waitlisted train tickets. The service is available on the ixigo Trains app for selected trains and classes. If a ticket remains unconfirmed, passengers receive the original fare refund plus two times the fare as a travel coupon.",
            "Sentiment": "positive",
            "PublishDate": 1734515938000,
            "Source": "normal_news"
        }
    ]
}