{
    "Symbol": "IZMO",
    "ISIN": "INE848A01014",
    "News": [
        {
            "Title": "IZMO's Frogdata Partners With FordDirect For Enhanced Services",
            "Summary": "IZMO Ltd announces strategic partnership between its subsidiary Frogdata and FordDirect to enhance dealership services for Ford and Lincoln through FixedOps Solutions Suite access.",
            "Sentiment": "positive",
            "PublishDate": 1769488490414,
            "Source": "stocks"
        },
        {
            "Title": "Izmo Ltd Achieves 84% Space Reduction in SIP Module",
            "Summary": "Izmo Ltd announces significant technological breakthrough with new SIP module for space payload camera electronics, achieving 84% reduction in space requirements compared to previous versions.",
            "Sentiment": "positive",
            "PublishDate": 1768191310469,
            "Source": "stocks"
        },
        {
            "Title": "IZMO Achieves 84% Footprint Reduction in Space-Grade 3D SiP",
            "Summary": "IZMO Limited's Microsystems division successfully designed a high-complexity 3D System-in-Package module for Space Payload Camera Electronics, achieving 84% footprint reduction through advanced stacked-substrate architecture.",
            "Sentiment": "positive",
            "PublishDate": 1768191165364,
            "Source": "stocks"
        },
        {
            "Title": "Izmo Plans Expansion Into Semiconductor Packaging and Optoelectronics Market",
            "Summary": "Izmo announced plans to expand into semiconductor packaging and optoelectronic solutions, targeting the optical transceiver market valued at over $15 billion. The company intends to raise up to INR 200 crore to fund research and development activities and acquire manufacturing equipment for this expansion.",
            "Sentiment": "positive",
            "PublishDate": 1764567770503,
            "Source": "stock"
        },
        {
            "Title": "IZMO Limited Reports 9.8% Revenue Growth in H1 FY26, Advances Silicon Photonics Expansion",
            "Summary": "IZMO Limited achieved INR 116.62 crores revenue in H1 FY26 with 9.8% year-on-year growth, driven by expanding clientele across US and Europe and contributions from subsidiaries. The company secured DSIR recognition for semiconductor R&D, increased IzmoMicro order book to INR 50 crores, and plans INR 150-200 crores fundraising for advanced packaging facility expansion targeting INR 1,000 crores revenue capacity.",
            "Sentiment": "positive",
            "PublishDate": 1763820595474,
            "Source": "earnings"
        },
        {
            "Title": "Izmo Limited Reports 2.7% Revenue Growth to Rs. 60.1 Crores in Q2 FY26",
            "Summary": "Izmo Limited reported quarterly revenue of Rs. 60.1 crores with 2.7% year-on-year growth, while EBITDA excluding other income grew 42.4% to Rs. 13.5 crores and PAT reached Rs. 12.6 crores. The automotive solutions company added 78 new clients in the US and 22 in Europe and UK, driven by synergies from Geronimo acquisition and subsidiary Izmo Microsystems, with increased AI adoption boosting operational efficiencies.",
            "Sentiment": "positive",
            "PublishDate": 1763356659929,
            "Source": "stock"
        },
        {
            "Title": "IZMO Limited Board Approves Fundraising Plan Worth Up To Rs. 200 Crores",
            "Summary": "IZMO Limited's Board of Directors approved a proposal to raise funds up to Rs. 200 crores through equity shares or other securities via permissible modes, subject to regulatory approvals. The company will determine the specific terms including security type, pricing, and timing at a later date, with further disclosures to follow once decisions are finalized.",
            "Sentiment": "positive",
            "PublishDate": 1763065125838,
            "Source": "stock"
        },
        {
            "Title": "Izmo Limited Reports Strong Q2 Performance and Approves Major Strategic Initiatives",
            "Summary": "Izmo Limited's board approved quarterly results showing consolidated revenue of Rs. 60.11 crores and net profit of Rs. 12.56 crores, while also sanctioning fundraising of up to Rs. 200 crores and strategic partnerships for optical transceiver manufacturing. The company allotted 60,629 ESOP shares to employees and granted 29,000 new stock options, alongside approving joint ventures for technology transfer and establishment of manufacturing facilities in the optical transceiver and silicon photonics sectors.",
            "Sentiment": "neutral",
            "PublishDate": 1763063849172,
            "Source": "earnings"
        },
        {
            "Title": "IZMO Limited Grants 29,000 Stock Options to Employees Under ESOP 2013 Scheme",
            "Summary": "IZMO Limited granted 29,000 stock options to eligible employees under its Employee Stock Option Plan 2013 (ESOP 2013) at an exercise price of Rs. 10 per option. Each option is convertible into one equity share of Rs. 10 each. The grant was made based on recommendations from the Nomination Remuneration Committee of the Board of Directors. The exercise period will commence from the date of vesting and expire within sixty months (5 years) from the vesting date. Equity shares arising from the exercise of these options will rank pari passu with all other equity shares of the company. The ESOP 2013 scheme complies with Securities and Exchange Board of India (Share Based Employee Benefits and Sweat Equity) Regulations, 2021.",
            "Sentiment": "positive",
            "PublishDate": 1763035925914,
            "Source": "corporate_action"
        },
        {
            "Title": "IZMO Ltd. Receives DSIR Recognition for In-House R&D Unit in Semiconductor Packaging",
            "Summary": "IZMO Ltd. has been formally recognized by the Department of Scientific and Industrial Research (DSIR), Government of India, as an approved in-house Research & Development unit. The recognition acknowledges the company's leadership in advanced semiconductor packaging and investment in silicon photonics technology. IZMO has made substantial investments in R&D focused on silicon photonics packaging, with capabilities in advanced design engineering and precision integration through its cleanroom facility in Bangalore. The company's R&D programs span RF, MEMs, power, and photonics packaging. Managing Director Sanjay Soni stated the recognition validates their sustained investment in semiconductor packaging and pioneering work in silicon photonics. The company aims to leverage DSIR recognition to access government resources and accelerate its R&D roadmap. IZMO Microsystems, the company's semiconductor division, specializes in silicon photonics packaging and advanced system-in-package manufacturing, providing solutions for high-performance computing, AI infrastructure, telecommunications, aerospace, and green energy sectors.",
            "Sentiment": "positive",
            "PublishDate": 1759213377134,
            "Source": "stock"
        },
        {
            "Title": "IZMO Limited's izmomicro Division Launches High-Power Motor Control Technology for Industrial and EV Applications",
            "Summary": "IZMO Limited announced that its division izmomicro has developed a Galvanic Isolated Hex Bridge Inverter with integrated controller and drivers for three-phase Servo/BLDC motors. The product delivers 100 amps of continuous current at 48 VDC and targets industrial automation, robotics, electric vehicles, aerospace, and defense applications. The inverter has been shipped to a major public sector manufacturer. Managing Director Sanjay Soni highlighted the technology as important for India's expanding industrial and EV ecosystem. The company is focused on leveraging its design expertise for high-volume production and expanding manufacturing capacity. The global power electronics market is expected to exceed USD 40 billion by 2030, while India's EV sector is forecast to grow at 49% CAGR between 2023 and 2030.",
            "Sentiment": "positive",
            "PublishDate": 1757994268376,
            "Source": "stock"
        },
        {
            "Title": "Izmomicron Advances Silicon Photonics Packaging Technology",
            "Summary": "Izmomicron has made significant progress in silicon photonics packaging technology. The development is positioned as advancing India's capabilities in semiconductor integration.",
            "Sentiment": "positive",
            "PublishDate": 1755755936464,
            "Source": "stock"
        },
        {
            "Title": "IZMO Limited Reappoints Shashi Soni as Whole-time Director for Three-Year Term",
            "Summary": "IZMO Limited has reappointed Mrs. Shashi Soni as Whole-time Director for a term from October 1, 2025 to September 30, 2028, subject to shareholder approval. The reappointment was based on the recommendation of the Nomination and Remuneration Committee. Mrs. Soni brings 48 years of business experience across entertainment, industrial gases and transportation sectors, with expertise in HR and administrative matters. She serves as Chairperson and has been involved in company management since incorporation. Mrs. Soni is the mother of Managing Director Mr. Sanjay Soni and mother-in-law of Chief Financial Officer Mrs. Kiran Soni. She is not debarred from holding directorship by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1755097349145,
            "Source": "corporate_governance"
        },
        {
            "Title": "IZMO Limited Reports Quarterly Financial Results for Quarter Ended June 30, 2025",
            "Summary": "IZMO Limited announced its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 1,100.28 lakhs compared to Rs. 1,092.74 lakhs in the same quarter last year, with net profit of Rs. 26.88 lakhs versus Rs. 8.44 lakhs previously. On a consolidated basis, revenue from operations reached Rs. 5,650.94 lakhs compared to Rs. 4,758.01 lakhs in the prior year quarter, with consolidated net profit of Rs. 600.38 lakhs against Rs. 602.75 lakhs. The company added 88 clients in the US market and 27 clients in Europe including UK during the quarter. IZMO entered the Germany market, with initial setup expenses impacting profitability. The company collected $38,000 from image copyright infringement charges as part of legal action against international media companies. Employee benefit expenses included Rs. 98.38 lakhs for stock option expenses under ESOP schemes. The results were reviewed by the Audit Committee and approved by the Board of Directors on August 13, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755086211515,
            "Source": "earnings"
        },
        {
            "Title": "IZMO Limited Launches Automotive AI Factory to Deliver AI Solutions for Automotive Industry",
            "Summary": "IZMO Limited announced the launch of its Automotive AI Factory, an innovation hub designed to accelerate artificial intelligence adoption across the automotive industry. The facility combines data scientists, PhDs, software engineers, and AI specialists with computing infrastructure to deliver end-to-end AI solutions at 70-80% lower cost than Western markets. The AI Factory will create intelligent agents and predictive systems for dealerships and OEMs to optimize pricing, streamline operations, and enhance customer engagement while generating recurring revenue for IZMO. Managing Director Sanjay Soni described it as a strategic leap forward that enables mid-sized automotive businesses to compete with larger players at reduced costs. The platform operates on five pillars including agent-centric architecture, unified data lake, cloud-native infrastructure, optimization expertise, and human-in-the-loop safety. Initial offerings include pricing optimization agents, operations efficiency agents, insight and anomaly detection agents, and productivity assistant agents. IZMO operates three divisions: izmomicro for semiconductor solutions, izmocars for automotive digital retail, and FrogData for AI-driven analytics.",
            "Sentiment": "positive",
            "PublishDate": 1754977554741,
            "Source": "stock"
        },
        {
            "Title": "IZMO Limited Launches Redesigned izmostock Global Portal for Automotive Images",
            "Summary": "IZMO Limited announced the launch of its redesigned global portal izmostock.com, positioning itself as the world's largest repository of studio-quality automotive images. The platform serves a market projected to reach $10.3 billion by 2032. The enhanced portal offers streamlined navigation, comprehensive image sets for nearly every vehicle in every OEM color, flat-rate pricing, and seamless integration capabilities. Since 2003, izmostock has served 4 of the 5 largest global rental car companies, top leasing providers, insurance carriers, and the world's largest auto dealer group. CEO Tej Soni emphasized that the platform delivers real, studio-quality imagery that AI cannot replicate accurately or legally. The company's library contains 2 million standardized, high-resolution images spanning every major make, model, trim, and body style. The automotive e-commerce market is projected to grow from $100 billion in 2024 to over $343 billion by 2032, driving demand for professional vehicle imagery.",
            "Sentiment": "positive",
            "PublishDate": 1754551207069,
            "Source": "stock"
        },
        {
            "Title": "IZMO Microsystems Partners with IIT Madras for Photonic Chip Packaging Solutions",
            "Summary": "IZMO Microsystems, a subsidiary of IZMO, has formed a partnership with the Indian Institute of Technology (IIT) Madras to develop advanced photonic chip packaging solutions. This collaboration aims to leverage cutting-edge technology in the field of photonics, potentially advancing IZMO's capabilities in microelectronics and optical communications.",
            "Sentiment": "positive",
            "PublishDate": 1742880956000,
            "Source": "corporate_action"
        },
        {
            "Title": "IZMO Reports Decline in Q3 EBITDA and Margin",
            "Summary": "IZMO has reported a decrease in its third quarter EBITDA, which fell to 83 million rupees from 105 million rupees in the same period last year. The company's EBITDA margin also declined, dropping to 14.12% from 20.95% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739529131000,
            "Source": "earnings"
        },
        {
            "Title": "IZMO Reports Mixed Q3 Financial Results",
            "Summary": "IZMO has reported its Q3 financial results. The company's consolidated net profit decreased to 61 million rupees from 69 million rupees year-over-year. However, revenue increased to 587 million rupees from 502 million rupees compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739529125000,
            "Source": "earnings"
        },
        {
            "Title": "IZMO Inc Acquires Geronimo Web to Enhance Automotive Digital Marketing",
            "Summary": "IZMO Inc, a subsidiary of IZMO based in the United States, has acquired Geronimo Web, a global leader in digital marketing programs for automotive OEMs and dealers. This acquisition is expected to strengthen IZMO's position in the automotive digital marketing sector.",
            "Sentiment": "positive",
            "PublishDate": 1737472950000,
            "Source": "corporate_action"
        },
        {
            "Title": "IZMO Reports Significant Increase in Q2 Other Income",
            "Summary": "IZMO, an Indian company, has reported a substantial increase in its other income for the second quarter. The company's other income is expected to be 314 million rupees, compared to 7.5 million rupees in the same period last year, representing a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731503956000,
            "Source": "result"
        },
        {
            "Title": "IZMO Reports Q2 EBITDA Growth with Margin Decline",
            "Summary": "IZMO has reported its Q2 financial results. The company's EBITDA increased to 95 million rupees, up from 90 million rupees in the same quarter last year. However, the EBITDA margin decreased to 16.21% from 20.20% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731503920000,
            "Source": "result"
        },
        {
            "Title": "IZMO Reports Significant Profit Growth in Q2",
            "Summary": "IZMO has reported a substantial increase in consolidated net profit for Q2, rising to 299 million rupees from 51.2 million rupees year-over-year and 60 million rupees quarter-over-quarter. The company's revenue also grew to 586 million rupees, up from 448 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731503859000,
            "Source": "result"
        }
    ]
}