{
    "Symbol": "J&KBANK",
    "ISIN": "INE168A01041",
    "News": [
        {
            "Title": "J&K Bank delays QIP as profits rise, no capital rush",
            "Summary": "Jammu & Kashmir Bank postpones qualified institutional placement despite board approval, citing improved profitability and comfortable capital position. MD Chatterjee maintains 12-15% loan growth guidance for FY27.",
            "Sentiment": "positive",
            "PublishDate": 1768975029832,
            "Source": "co_actions_results"
        },
        {
            "Title": "J&K Bank Independent Directors Complete Tenure",
            "Summary": "Jammu & Kashmir Bank announces cessation of two independent directors, Anil Kumar Goel and Umesh Chandra Pandey, upon completion of their second term on January 20, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768911903477,
            "Source": "stocks"
        },
        {
            "Title": "J&K Bank Files Fund Utilisation Statement for Q3 FY26",
            "Summary": "Jammu & Kashmir Bank submitted regulatory compliance statement for December 2025 quarter, confirming no deviations in utilisation of ₹2,800 crores raised through multiple fund-raising exercises since 2017.",
            "Sentiment": "neutral",
            "PublishDate": 1768905991808,
            "Source": "stocks"
        },
        {
            "Title": "J&K Bank Q3FY26 Results: Net Profit Rises 17.6%",
            "Summary": "Jammu and Kashmir Bank reported strong Q3FY26 performance with net profit growing 17.6% to ₹587.51 cr. Net interest income increased 9.9% while total income reached ₹3,853.87 cr, reflecting robust operational growth.",
            "Sentiment": "positive",
            "PublishDate": 1768904880960,
            "Source": "co_actions_results"
        },
        {
            "Title": "J&K Bank Appoints Bigshare Services as New RTA",
            "Summary": "J&K Bank's Board approves appointment of Bigshare Services Private Limited as new Registrar and Transfer Agent, replacing KFin Technologies Limited effective March 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768904409401,
            "Source": "stocks"
        },
        {
            "Title": "J&K Bank Reports Improved Asset Quality in Q3",
            "Summary": "Jammu & Kashmir Bank shows sequential improvement in asset quality with GNPA declining to 3.00% from 3.32% and NNPA reducing to 0.68% from 0.76% quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1768903907657,
            "Source": "co_actions_results"
        },
        {
            "Title": "J&K Bank Q3FY26 Results Call on Jan 20",
            "Summary": "Jammu & Kashmir Bank schedules conference call for January 20, 2026 at 5:00 PM IST to discuss Q3FY26 and nine months financial results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1768298831532,
            "Source": "co_actions_results"
        },
        {
            "Title": "J&K Bank Board Meet on Jan 20 for Q3FY26 Results",
            "Summary": "Jammu & Kashmir Bank has scheduled its board meeting for January 20, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767971436541,
            "Source": "co_actions_results"
        },
        {
            "Title": "J&K Bank Executive Confirms 15% FY26 Loan Growth Target",
            "Summary": "Jammu & Kashmir Bank executive indicates 15% loan growth is likely for FY26, confirming the upper end of the bank's revised 12-15% target range as per CNBC TV18 report.",
            "Sentiment": "positive",
            "PublishDate": 1767677034252,
            "Source": "stocks"
        },
        {
            "Title": "J&K Bank Q3FY26 Business Grows 13.34% to ₹2.72 Lakh Cr",
            "Summary": "Jammu & Kashmir Bank reports provisional Q3FY26 total business of ₹2,72,109.27 crores, marking 13.34% YoY growth. Deposits rise 10.58% while gross advances surge 17.26%, though CASA ratio declines to 44.10%.",
            "Sentiment": "positive",
            "PublishDate": 1767413170077,
            "Source": "co_actions_results"
        },
        {
            "Title": "J&K Bank Director Dr. Pawan Kotwal Resigns",
            "Summary": "Dr. Pawan Kotwal, IAS, resigned as Non-Executive Non-Independent Director of Jammu & Kashmir Bank effective January 01, 2026, following superannuation on December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767265946352,
            "Source": "stocks"
        },
        {
            "Title": "J&K Bank Re-appoints Shahla Ayoub as Independent Director",
            "Summary": "Jammu & Kashmir Bank's Board approves re-appointment of Ms. Shahla Ayoub as Additional Independent Director for three years from December 26, 2025 to December 25, 2028, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1766501916270,
            "Source": "stocks"
        },
        {
            "Title": "RBI Imposes ₹99.30 Lakh Penalty on J&K Bank for Regulatory Non-Compliance",
            "Summary": "Reserve Bank of India imposed a penalty of ₹99.30 lakh on Jammu and Kashmir Bank for multiple violations including failure to escalate rejected complaints to Internal Ombudsman and delays in crediting to Depositor Education and Awareness Fund. The penalty was ordered by RBI's Adjudication Committee of Executive Directors and affects the bank's regulatory compliance standing.",
            "Sentiment": "negative",
            "PublishDate": 1764939671210,
            "Source": "stock"
        },
        {
            "Title": "J&K Bank Executive Director Sudhir Gupta Reappointed, Holds 8,747 Equity Shares",
            "Summary": "Sudhir Gupta has been reappointed as Executive Director of Jammu and Kashmir Bank Limited effective from December 12, 2025. The disclosure reveals he holds 8,747 equity shares representing 0.0007% shareholding in the bank as per SEBI insider trading regulations.",
            "Sentiment": "positive",
            "PublishDate": 1764832383720,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jammu And Kashmir Bank Plans Rs 12.5 Billion Capital Raise Through QIP And Tier 2 Bonds",
            "Summary": "Jammu And Kashmir Bank announced plans to raise up to Rs 7.50 billion through a Qualified Institutional Placement (QIP) and up to Rs 5 billion through Tier 2 bonds. The dual fundraising approach totaling Rs 12.5 billion will strengthen the bank's capital base and support its growth initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1764171807122,
            "Source": "corporate_action"
        },
        {
            "Title": "J&K Bank Shareholders Approve Independent Director Appointment and Chairman Remuneration via Postal Ballot",
            "Summary": "Jammu and Kashmir Bank shareholders passed two resolutions through postal ballot concluded on November 23, 2025 - appointing Arun Gandotra as Independent Director for three years and fixing Non-Executive Chairman remuneration at Rs. 15 lakh annually. The resolutions received overwhelming approval with 91.86% and 99.99% votes in favor respectively, subject to Reserve Bank of India approval for the remuneration structure.",
            "Sentiment": "positive",
            "PublishDate": 1763978733189,
            "Source": "corporate_action"
        },
        {
            "Title": "Jammu And Kashmir Bank Schedules Meeting To Discuss Fundraising Options",
            "Summary": "Jammu And Kashmir Bank has scheduled a meeting on November 26 to discuss fundraising options. The meeting will focus on exploring various capital raising strategies for the bank.",
            "Sentiment": "neutral",
            "PublishDate": 1763640865900,
            "Source": "corporate_action"
        },
        {
            "Title": "Jammu and Kashmir Bank Appoints S. Krishnan as Part-Time Chairman",
            "Summary": "The Reserve Bank of India approved the appointment of Mr. Sankarasubranian Krishnan (DIN: 07261965), an Independent Director, as Part-Time Chairman of Jammu and Kashmir Bank effective November 13, 2025 till March 26, 2028. Krishnan brings over four decades of banking experience, having previously served as MD & CEO of Punjab Sind Bank and Tamil Nadu Mercantile Bank, with expertise in corporate credit, risk management, and digital transformation.",
            "Sentiment": "positive",
            "PublishDate": 1763068456664,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jammu and Kashmir Bank Reports 10.3% Decline in Net Profit for Q2 FY2025-26",
            "Summary": "Jammu and Kashmir Bank announced quarterly results showing net profit of ₹494.11 crores, down 10.3% from ₹550.92 crores in the same quarter last year. The bank's Net Interest Margin compressed to 3.56% from 3.90% year-over-year. Despite the profit decline, the bank showed growth in key metrics with deposits rising 10.2% to ₹1,52,030 crores and net advances increasing 9.4% to ₹1,05,153 crores. Asset quality improved with Gross NPA reducing to 3.32% from 3.95% and Net NPA declining to 0.76% from 0.85%. The bank's Capital Adequacy Ratio strengthened to 15.27% from 14.99%. Digital transactions reached 94.29% of total transactions, and the bank maintained its strong presence with 1,015 branches across India. The MD and CEO will participate in Anand Rathi's G200 Summit on November 13, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762446384952,
            "Source": "corporate_action"
        },
        {
            "Title": "Jammu and Kashmir Bank General Manager Rajesh Gupta Retires",
            "Summary": "Rajesh Gupta, General Manager at Jammu and Kashmir Bank Limited, is retiring from the bank's services effective at the close of business hours on October 31, 2025. Following his retirement, he will also cease to be a Senior Management Personnel of the bank. The bank has disclosed this information to stock exchanges NSE and BSE in compliance with SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1761889377282,
            "Source": "corporate_governance"
        },
        {
            "Title": "J&K Bank Issues Postal Ballot Notice for Director Appointment and Chairman Remuneration",
            "Summary": "Jammu and Kashmir Bank has issued a postal ballot notice to shareholders for two key resolutions. The first seeks approval for appointing Arun Gandotra as an Independent Director for a three-year term from August 26, 2025 to August 25, 2028. Gandotra, a former Executive President of the bank with 35 years of banking experience, was initially appointed as Additional Director in August 2025. The second resolution proposes fixing remuneration for the Non-Executive Part-Time Chairman at Rs 15 lakh per annum, plus sitting fees and expense reimbursements. The e-voting period runs from October 25, 2025 to November 23, 2025, with results to be announced by November 25, 2025. CA Arshad Hussain Mir has been appointed as scrutinizer for the postal ballot process.",
            "Sentiment": "neutral",
            "PublishDate": 1761211227025,
            "Source": "corporate_action"
        },
        {
            "Title": "J&K Bank Reports Q2 FY2026 Results with 1.9% Sequential Profit Growth Despite Grameen Bank Provisions",
            "Summary": "Jammu and Kashmir Bank reported net profit of INR 494 crores for the quarter ended September 30, 2025, showing 1.9% sequential growth. The bank recorded deposit growth of 2.4% sequentially and 10.2% year-on-year, while advances grew 3.9% sequentially and 9.4% year-on-year. CASA ratio improved to 45.89% from 45.71% in the previous quarter, marking the first improvement after nine consecutive quarters. Net Interest Margin contracted to 3.56% from 3.90% in the same period last year due to repo rate cuts. The bank made impairment provisions of INR 92 crores this quarter and INR 87 crores in the previous quarter totaling INR 180 crores for its investment in Jammu and Kashmir Grameen Bank following merger with Ellaquai Dehati Bank. Gross NPA reduced to 3.32% while Net NPA stood at 0.76% with Provision Coverage Ratio above 90%. CRAR was recorded at 15.27% with CET1 at 12.11%. The bank revised its guidance for RoA to 1.20%-1.25% and RoE to 15%-16% for the financial year, maintaining credit growth guidance of 12% and deposit growth of 10%.",
            "Sentiment": "neutral",
            "PublishDate": 1760940625437,
            "Source": "earnings"
        },
        {
            "Title": "Jammu & Kashmir Bank Reports Rs 494 Crore Net Profit for Q2 FY2026",
            "Summary": "Jammu & Kashmir Bank announced its financial results for the quarter and half-year ended September 30, 2025. The bank reported a standalone net profit of Rs 494.11 crore for Q2 FY2026, compared to Rs 484.84 crore in the same quarter last year. For the half-year, net profit reached Rs 978.95 crore versus Rs 966.41 crore in the previous year. Total income for the quarter stood at Rs 3,446.71 crore. The bank's gross NPA ratio improved to 3.32% from 3.95% year-on-year, while net NPA ratio decreased to 0.76% from 0.85%. Capital adequacy ratio under Basel III stood at 15.27% with CET1 ratio at 12.11%. The bank paid Rs 139.62 crore to State Bank of India for their shareholding in Ellaquai Dehati Bank, which merged with J&K Grameen Bank. The results were approved by the Board of Directors on October 18, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760789196493,
            "Source": "earnings"
        },
        {
            "Title": "Jammu & Kashmir Bank Reports 9.89% Growth in Total Business to ₹2.57 Lakh Crore",
            "Summary": "Jammu & Kashmir Bank reported total business of ₹2,57,196.94 crore, marking a 9.89% year-over-year increase. Total deposits grew 10.23% to ₹1,52,032.85 crore, while gross advances rose 8.77% to ₹1,07,945.04 crore. The bank's gross investments reached ₹45,040.46 crore, representing the highest growth rate of 13.62% year-over-year across all reported metrics.",
            "Sentiment": "positive",
            "PublishDate": 1759726757992,
            "Source": "stock"
        },
        {
            "Title": "J&K Bank CEO Presents Rs 130.7 Crore Dividend to UT Administration",
            "Summary": "Jammu and Kashmir Bank CEO Amitava Chatterjee presented dividend cheques totaling Rs 130.77 crore to the Union Territory administration for financial year 2024-25. The payment consisted of two cheques worth Rs 122.85 crore and Rs 7.92 crore, handed over to Lieutenant Governor Manoj Sinha at Raj Bhawan. The dividend represents a 215 percent payout approved at the bank's 87th Annual General Meeting. The UT administration serves as the bank's promoter and major shareholder. Lieutenant Governor Sinha noted the bank's transformation from a Rs 1,139 crore loss in 2019-20 to a Rs 1,700 crore profit in 2023-24. He emphasized the bank's role in financial inclusion and supporting small enterprises. Chatterjee reaffirmed the bank's commitment to banking services and contributing to Mission YUVA for economic growth across the Union Territory.",
            "Sentiment": "positive",
            "PublishDate": 1757182483712,
            "Source": "corporate_action"
        },
        {
            "Title": "Jammu and Kashmir Bank Reports 18% Jump in Net Profit to Rs 2,082 Crores",
            "Summary": "Jammu and Kashmir Bank delivered strong financial performance with net profit rising to Rs 2,082.46 crores from Rs 1,767.27 crores in the previous year. Total income increased to Rs 13,672.67 crores from Rs 12,037.85 crores. Asset quality improved with gross NPA ratio declining to 3.37% from 4.08%, while net NPA ratio remained stable at 0.79%. The bank's capital adequacy ratio strengthened to 16.29% from 15.33%. The provision coverage ratio improved to 90.287%. The bank proposed a dividend of Rs 2.15 per share and received an unmodified audit opinion. During the year, the bank identified 35 fresh fraud cases involving Rs 198.15 crores and transferred NPAs worth Rs 15.27 crores to asset reconstruction companies.",
            "Sentiment": "positive",
            "PublishDate": 1756319537636,
            "Source": "earnings"
        },
        {
            "Title": "Jammu and Kashmir Bank Re-appoints Two IAS Officers as Rotational Directors",
            "Summary": "Jammu and Kashmir Bank shareholders approved the re-appointment of Dr. Pawan Kotwal, IAS and Dr. Mandeep K Bhandari, IAS as Rotational Directors on the Bank's Board at the Annual General Meeting held on August 26, 2025. Dr. Kotwal is a 1994 batch IAS officer serving as Chief Secretary of UT of Ladakh, with previous experience as Principal Secretary for Health and Medical Education, Forest, Ecology and Environment, and Revenue departments. Dr. Bhandari is a 2001 AGMUT cadre IAS officer with MBBS qualification, currently serving as Principal Secretary to the Lieutenant Governor of UT of J&K and CEO of Amarnathji Shrine Board. Both directors bring over two decades of administrative experience across various government positions. Neither director is debarred from holding directorship positions and there are no inter-se relationships disclosed between the directors.",
            "Sentiment": "positive",
            "PublishDate": 1756315902607,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jammu and Kashmir Bank Approves Executive Director Re-appointment and New Independent Director",
            "Summary": "The Board of Directors of Jammu and Kashmir Bank approved the re-appointment of Sudhir Gupta as Executive Director for a term from December 13, 2025 to November 30, 2027, subject to Reserve Bank of India approval. The board also appointed Arun Gandotra as Additional Director in the Independent Directors category for three years, subject to shareholder approval. Gupta, with over 35 years of banking experience, joined the bank as a Probationary Officer in 1989 and oversees Treasury, Credit, Customer Service, Strategy & IT, Finance, Government Banking and Corporate Communication verticals. Gandotra brings 35 years of banking experience, having joined the bank in 1986 as Probationary Officer and retired in 2021 as Executive President, with expertise in Treasury Operations, Credit Risk Management, and various banking functions.",
            "Sentiment": "positive",
            "PublishDate": 1756201853650,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jammu and Kashmir Bank Appoints Sankarasubramanian Krishnan as Part-Time Chairman",
            "Summary": "Jammu and Kashmir Bank's Board of Directors approved the appointment of Mr. Sankarasubramanian Krishnan as Non-Executive Part-Time Chairman, subject to Reserve Bank of India approval. The appointment is effective from the date of RBI approval and will run until March 26, 2028, coinciding with the completion of his first term as an Independent Director. Krishnan brings over four decades of banking experience, having previously served as MD & CEO at Punjab & Sind Bank and Tamilnad Mercantile Bank Ltd. He has held senior positions including Executive Director roles at Syndicate Bank and Canara Bank, with expertise in corporate credit, risk management, and digital transformation initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1756135043987,
            "Source": "corporate_governance"
        },
        {
            "Title": "J&K Bank Reports 16.7% Jump in Net Profit to ₹485 Crores in Q1 FY26",
            "Summary": "Jammu and Kashmir Bank announced its quarterly results showing net profit increased 16.7% to ₹484.84 crores compared to ₹415.49 crores in the same quarter last year. Net Interest Income grew 7% to ₹1,465.43 crores while Operating Income rose 9.7% to ₹1,715.73 crores. The bank's deposits reached ₹1,48,542 crores (up 12.1% YoY) and net advances stood at ₹1,01,230 crores (up 6.1% YoY). Asset quality improved with Gross NPA reducing to 3.50% from 3.91% year-on-year, while Net NPA increased slightly to 0.82% from 0.76%. The bank maintained strong capital adequacy with CRAR at 15.98% and achieved over 94% digital transactions. Return on Assets improved to 1.17% from 1.08% in the previous year. The bank operates 1,019 branches with 841 in J&K, 37 in Ladakh, and 141 across 20 other states and UTs.",
            "Sentiment": "positive",
            "PublishDate": 1754639654552,
            "Source": "stock"
        },
        {
            "Title": "J&K Bank Reports Record Q1 Net Profit of ₹485 Crores Despite Regional Challenges",
            "Summary": "Jammu and Kashmir Bank delivered its highest-ever first quarter net profit of ₹485 crores, marking a 16.7% year-on-year growth despite challenging circumstances including the Pahalgam terror incident and regional tensions. The bank's profitability was impacted by a one-time impairment provision of ₹87 crores related to its investment in J&K Grameen Bank due to RRB amalgamation under government directives. Excluding this provision, net profit growth would exceed 30% year-on-year. The bank achieved above-average deposit growth of 12.1% compared to industry average of 10.1%, though CASA ratio declined from 47.01% to 45.71% as customers migrated to term deposits. Credit growth remained muted at 6.1% year-on-year with a 2.7% quarterly decline. Net Interest Margin contracted to 3.72% due to faster transmission of rate cuts on lending side versus deposit costs. Gross NPA increased slightly to 3.5% while maintaining provision coverage ratio above 90%. The bank maintained its guidance for credit growth of 12%, deposit growth of 10%, and CASA ratio of 48% for the financial year, while revising NIM guidance downward to 3.65%-3.70% following RBI's 50 basis points rate cut.",
            "Sentiment": "positive",
            "PublishDate": 1753954767687,
            "Source": "earnings"
        },
        {
            "Title": "J&K Bank Reports Record Q1 Net Profit of Rs 485 Crores, Up 16.7% YoY Despite One-Time Provision Impact",
            "Summary": "Jammu and Kashmir Bank delivered its highest ever first quarter net profit of Rs 485 crores, representing a 16.7% year-on-year growth. The bank's profitability was impacted by a one-time impairment provision of Rs 87 crores related to its investment in J&K Grameen Bank due to amalgamation requirements under the 'One State One RRB' concept. Excluding this provision, net profit growth would have exceeded 30% YoY. The bank achieved above-average deposit growth of 12.1% compared to the industry average of 10.1%, though CASA ratio declined from 47.01% to 45.71% as customers migrated to term deposits for higher yields. Loan growth remained muted at 6.1% YoY with a 2.7% decline in the quarter, attributed to flat corporate lending and scheduled repayments. Operating income increased 9.7% YoY while NIMs contracted to 3.72% due to faster rate cut transmission on lending versus deposits. GNPA slightly increased to 3.50% and NNPA to 0.82%, though provision coverage ratio remained healthy above 90%. The bank maintained its FY26 guidance except for a downward NIM revision to 3.65-3.70% following RBI's 50 basis point rate cut.",
            "Sentiment": "positive",
            "PublishDate": 1753710916092,
            "Source": "earnings"
        },
        {
            "Title": "J&K Bank Reports 16.7% Jump in Net Profit to ₹485 Crores in Q1 FY26",
            "Summary": "The Jammu and Kashmir Bank announced quarterly results showing net profit increased 16.7% to ₹484.84 crores compared to ₹415.49 crores in the same quarter last year. Net Interest Income grew 7% to ₹1,465.43 crores while Operating Income rose 9.7% to ₹1,715.73 crores. The bank's asset quality improved with Gross NPA declining to 3.50% from 3.91% year-over-year, though Net NPA increased slightly to 0.82% from 0.76%. Deposits grew 12.1% to ₹1,48,542 crores and Net Advances increased 6.1% to ₹1,01,230 crores. The bank's Capital Adequacy Ratio strengthened to 15.98% from 15.07% previously. Return on Assets improved to 1.17% from 1.08% while Cost to Income Ratio decreased to 60.78% from 61.96%. The bank operates 1,019 branches with 841 in J&K, 37 in Ladakh, and 141 across 20 other states. Digital transactions reached 94.02% of total transactions.",
            "Sentiment": "positive",
            "PublishDate": 1753464108176,
            "Source": "earnings"
        },
        {
            "Title": "J&K Bank Reports 17% YoY Growth in Q1 Net Profit to Rs 485 Crores Despite Operational Challenges",
            "Summary": "Jammu & Kashmir Bank reported a net profit of Rs 484.84 crores for the quarter ended June 30, 2025, marking a 16.7% year-on-year increase from Rs 415.49 crores in the same period last year. Net Interest Income grew 7% YoY to Rs 1,465.43 crores, while other income jumped 29% to Rs 250.30 crores. The bank's Return on Assets improved to 1.17% from 1.08% YoY, though Net Interest Margin declined to 3.72% from 3.86% in Q4FY2025. Operating profit increased 13% YoY to Rs 672.84 crores. Deposits rose 12% YoY to Rs 1,48,542 crores, while net advances grew 6.06% YoY to Rs 1,01,230 crores. Gross NPAs improved to 3.50% from 3.91% a year ago, with Net NPA at 0.82%. The bank made an impairment provision of Rs 87.47 crores for its investment in Jammu & Kashmir Grameen Bank following the amalgamation with Ellaquai Dehati Bank. Capital Adequacy Ratio stood at 15.98%. The board scheduled the 87th Annual General Meeting for August 26, 2025, and appointed M/s. D K Pandoh & Associates as Secretarial Auditors for five years, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1753455314262,
            "Source": "earnings"
        },
        {
            "Title": "Jammu & Kashmir Bank Reports 17% YoY Growth in Q1 Net Profit to Rs 484.84 Crores",
            "Summary": "Jammu & Kashmir Bank reported a net profit of Rs 484.84 crores for the quarter ended June 30, 2025, marking a 16.7% year-on-year increase from Rs 415.49 crores in the same period last year. Net Interest Income grew 7% YoY to Rs 1,465.43 crores, while other income jumped 29% to Rs 250.30 crores. The bank's deposits increased 12% YoY to Rs 1,48,542 crores and net advances grew 6.06% YoY to Rs 1,01,230 crores. Gross NPAs improved to 3.50% from 3.91% a year ago, with Net NPA at 0.82%. The Capital Adequacy Ratio stood at 15.98%. The bank made an impairment provision of Rs 87.47 crores for its investment in Jammu & Kashmir Grameen Bank due to the amalgamation with Ellaquai Dehati Bank. Return on Assets improved to 1.17% from 1.08% YoY, while the CASA ratio was 45.71%.",
            "Sentiment": "positive",
            "PublishDate": 1753454302833,
            "Source": "earnings"
        },
        {
            "Title": "Jammu & Kashmir Bank: Mukul Agrawal Acquires 1.3% Stake",
            "Summary": "Ace investor Mukul Mahavir Agrawal purchased a 1.27% stake in Jammu & Kashmir Bank during Q1 FY2026. The bank reported 9.5% YoY growth in total business to Rs 2,49,784.15 crore, with deposits up 12% and advances up 5.5% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1751941901000,
            "Source": "block_deals"
        },
        {
            "Title": "Jammu & Kashmir Bank: Mukul Agrawal Acquires 1.3% Stake, Q1 Business Grows",
            "Summary": "Ace investor Mukul Agrawal bought 1.27% stake in Jammu & Kashmir Bank in Q2. The bank reported 9.5% YoY growth in total business to Rs 2,49,784.15 crore in Q1FY26. Deposits increased 12% YoY, while advances grew 5.5% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1751892414000,
            "Source": "normal_news"
        },
        {
            "Title": "Mukul Mahavir Agarwal Acquires 1.27% Stake in Jammu & Kashmir Bank",
            "Summary": "Investor Mukul Mahavir Agarwal has acquired a 1.27% stake in Jammu & Kashmir Bank's shareholding. No additional details about the transaction or its implications were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1751886130000,
            "Source": "default"
        },
        {
            "Title": "J&K Bank Reports Growth in Deposits and Advances",
            "Summary": "Jammu and Kashmir Bank has reported significant growth in its financial metrics. The bank's total deposits increased by 12.05% year-over-year, reaching ₹1.49 lakh crore in the first quarter. Gross advances also showed growth, climbing by 5.54%. Overall, the bank reported a 9.54% year-over-year growth in total business.",
            "Sentiment": "positive",
            "PublishDate": 1751877402000,
            "Source": "default"
        },
        {
            "Title": "Jammu & Kashmir Bank: Diversifying Loan Mix for Stable Growth",
            "Summary": "J&K Bank aims to diversify its loan mix in rest of India, focusing on housing and mid-corporate segments to reduce concentration risks and build stability. The bank plans to balance growth between Jammu & Kashmir and other regions, with limited impact from recent terror attacks due to low exposure to tourism-linked lending.",
            "Sentiment": "positive",
            "PublishDate": 1750187544000,
            "Source": "normal_news"
        },
        {
            "Title": "J&K Bank: 15% CAGR Loan Book Growth Projected Despite Regional Challenges",
            "Summary": "J&K Bank aims for 14-15% CAGR in loan book over 3-5 years, with 12% growth expected next year. CEO Amitava Chatterjee cites minimal direct exposure to tourism sector. Bank maintains strong CASA ratio but anticipates margin pressure due to RBI rate cuts.",
            "Sentiment": "positive",
            "PublishDate": 1746578626000,
            "Source": "normal_news"
        },
        {
            "Title": "Jammu & Kashmir Bank Reports Q4 Financial Results",
            "Summary": "Jammu & Kashmir Bank announced its Q4 financial results. Net profit decreased to 5.8 billion rupees from 6.4 billion rupees year-over-year, but increased from 5.3 billion rupees quarter-over-quarter. Revenue rose to 32 billion rupees from 29 billion rupees year-over-year. Gross Non-Performing Assets (GNPA) improved to 3.37% from 4.08% in the previous quarter, while Net Non-Performing Assets (NNPA) decreased to 0.79% from 0.94%. The bank recommended a final dividend of 2.15 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746490167000,
            "Source": "default"
        },
        {
            "Title": "Jammu & Kashmir Bank: Q4 Profit Dips 9% YoY Despite Record Annual Earnings",
            "Summary": "J&K Bank reported a 9% YoY decrease in Q4 net profit to Rs 585 crore due to higher provisions. Annual net profit rose 18% to a record Rs 2083 crore. The bank recommended a 215% dividend. Gross NPA ratio improved to 3.37%. Deposits grew 10.24% YoY to Rs 1.49 lakh crore, while advances increased 11.13% to Rs 1.04 lakh crore.",
            "Sentiment": "neutral",
            "PublishDate": 1746460037000,
            "Source": "earnings"
        },
        {
            "Title": "Jammu & Kashmir Bank Announces Q4 Results and Dividend",
            "Summary": "Jammu & Kashmir Bank has recommended a final dividend of 2.15 rupees per equity share. The bank's Q4 Gross Non-Performing Assets (GNPA) decreased to 3.37% from 4.08% in the previous quarter. Net Non-Performing Assets (NNPA) also improved, dropping to 0.79% from 0.94% quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1746453998000,
            "Source": "result"
        },
        {
            "Title": "Jammu & Kashmir Bank Reports Q4 FY23 Financial Results",
            "Summary": "Jammu & Kashmir Bank has announced its financial results for the fourth quarter of the fiscal year. The bank reported a net profit of 5.8 billion rupees, which is lower compared to 6.4 billion rupees in the same quarter last year (YoY) but higher than 5.3 billion rupees in the previous quarter (QoQ). The bank's revenue for Q4 increased to 32 billion rupees from 29 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1746453766000,
            "Source": "result"
        },
        {
            "Title": "Jammu and Kashmir Bank to Consider Q4 Results on May 5",
            "Summary": "Jammu and Kashmir Bank has announced that it will consider its fourth quarter (Q4) financial results on May 5. This announcement indicates that the bank is preparing to release its latest quarterly earnings report, which will provide insights into its financial performance for the most recent fiscal period.",
            "Sentiment": "neutral",
            "PublishDate": 1745411787000,
            "Source": "default"
        },
        {
            "Title": "J&K High Court Stays ₹16,261 Crore GST Demand Against Jammu & Kashmir Bank",
            "Summary": "The Jammu and Kashmir High Court has issued a stay order on the ₹16,261 crore GST demand and associated penalty against Jammu & Kashmir Bank. This legal intervention temporarily halts the enforcement of the tax demand, providing relief to the bank while the matter is further examined by the court.",
            "Sentiment": "positive",
            "PublishDate": 1744352170000,
            "Source": "corporate_action"
        },
        {
            "Title": "J&K Bank Obtains Court Stay on Tax Demand Orders",
            "Summary": "Jammu and Kashmir Bank has reported that an Indian court has issued a stay on the operation of tax demand orders against the bank. This legal development temporarily halts the enforcement of tax-related demands on J&K Bank, providing the institution with some relief in its tax matters.",
            "Sentiment": "positive",
            "PublishDate": 1744202654000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jammu and Kashmir Bank Reports Lower-Than-Expected Growth in Gross Advances",
            "Summary": "Jammu and Kashmir Bank's gross advances increased by 10.32% year-over-year as of March 31, falling short of the bank's guidance of 15% growth. This indicates a slower expansion of the bank's loan portfolio compared to its initial projections.",
            "Sentiment": "negative",
            "PublishDate": 1743751939000,
            "Source": "result"
        },
        {
            "Title": "Jammu and Kashmir Bank Reports 10.24% YoY Increase in Total Deposits",
            "Summary": "Jammu and Kashmir Bank has reported a 10.24% year-over-year increase in total deposits as of March 31. This growth falls short of the bank's guidance of 12% for the period.",
            "Sentiment": "neutral",
            "PublishDate": 1743751882000,
            "Source": "result"
        }
    ]
}