{
    "Symbol": "JAGRAN",
    "ISIN": "INE199G01027",
    "News": [
        {
            "Title": "Jagran Prakashan faces board removal proposal",
            "Summary": "Holding company proposes removal of 7 independent directors and whole-time director citing invalid appointments due to voting rights dispute currently under NCLT proceedings.",
            "Sentiment": "negative",
            "PublishDate": 1770901642323,
            "Source": "stocks"
        },
        {
            "Title": "Jagran Prakashan Q3FY26 Results Show Mixed Performance",
            "Summary": "Jagran Prakashan reported Q3FY26 standalone net profit of ₹5,242.62 lakhs vs ₹5,968.34 lakhs YoY. Revenue declined to ₹41,815.94 lakhs from ₹43,301.09 lakhs in Q3FY25.",
            "Sentiment": "negative",
            "PublishDate": 1770898935009,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jagran Prakashan NCLT hearings rescheduled to Feb 13",
            "Summary": "Jagran Prakashan Limited announces rescheduling of NCLT proceedings involving company petitions to February 13, 2026, after Special Bench focused on urgent IBC matters on February 3, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770211453350,
            "Source": "stocks"
        },
        {
            "Title": "HDFC MF cuts Jagran Prakashan stake to 7.13%",
            "Summary": "HDFC Mutual Fund reduces shareholding in Jagran Prakashan Limited from 9.16% to 7.13%, marking a 2.03% decrease as per SEBI disclosure requirements under Regulation 29.",
            "Sentiment": "neutral",
            "PublishDate": 1768021852886,
            "Source": "mutualfunds"
        },
        {
            "Title": "Jagran Prakashan Receives ₹32.84 Lakh GST Demand",
            "Summary": "Jagran Prakashan receives GST demand order of ₹32.84 lakh from Deputy Commissioner for 2018-23 period. Company believes order is not tenable and plans to file appeal based on legal advice.",
            "Sentiment": "negative",
            "PublishDate": 1767087912657,
            "Source": "stocks"
        },
        {
            "Title": "Jagran Prakashan Updates on NCLT Proceedings in Family Dispute Cases",
            "Summary": "Jagran Prakashan Limited disclosed updates on two ongoing NCLT cases involving the Gupta family members, with proceedings heard on December 1, 2025. The cases involve oppression and mismanagement petitions, with the next hearing scheduled for December 18, 2025, and respondents directed to file replies within one week in one of the matters.",
            "Sentiment": "neutral",
            "PublishDate": 1765286672783,
            "Source": "stock"
        },
        {
            "Title": "Jagran Prakashan Reports Strong Q2 Performance with 14% Advertisement Revenue Growth",
            "Summary": "Jagran Prakashan Limited reported robust quarterly results with advertisement revenue growing 14% year-on-year. The company's print business led the growth with advertisement revenue increasing from Rs 237 crores to Rs 270 crores, while operating profit rose from Rs 64 crores to Rs 84 crores. Radio City maintained an 18% market share with 42% of total clients advertising on the platform. The digital business showed JNM among top 15 in India's news/information category with 65 million unique visitors. Outdoor and events business registered 16% revenue growth driven by asset-based businesses. The company has distributed Rs 1,900 crores to shareholders through dividends and buybacks, maintaining net cash of over Rs 1,000 crores at group level.",
            "Sentiment": "positive",
            "PublishDate": 1762484504261,
            "Source": "earnings"
        },
        {
            "Title": "Jagran Prakashan Reports Strong Q2 Results with 30% Jump in Standalone PAT",
            "Summary": "Jagran Prakashan Limited reported quarterly results ended September 30, 2025. Standalone operating revenues increased 10.1% to Rs 413.77 crores from Rs 375.76 crores. Advertisement revenues grew 12.9% to Rs 276.15 crores while circulation revenues declined slightly to Rs 78.43 crores from Rs 79.87 crores. Digital revenue remained flat at Rs 20.27 crores. Profit after tax surged 30.3% to Rs 61.73 crores from Rs 47.37 crores, with earnings per share rising 30% to Rs 2.83. For the half-year period, operating revenues increased 8.8% to Rs 811.90 crores and PAT jumped 45.7% to Rs 133.07 crores. The company received Rs 31.80 crores from maturity proceeds of a Key man policy during the half-year. On consolidated basis, quarterly operating revenues grew 4.7% to Rs 467.36 crores with PAT increasing 36.7% to Rs 56.94 crores. The company operates across print media, FM radio, digital platforms and outdoor advertising with flagship publication Dainik Jagran.",
            "Sentiment": "positive",
            "PublishDate": 1762461128347,
            "Source": "earnings"
        },
        {
            "Title": "Jagran Prakashan Targets 10-12% Revenue Growth Through Digital Monetization and Print Ad Revival",
            "Summary": "Jagran Prakashan is focusing on digital monetization and advertising recovery in tier-2 and tier-3 markets. The company is receiving growing contributions from Radio City and digital platforms. Jagran Prakashan aims to achieve 10-12% top-line growth through print advertising revival, cost optimization, and strategic content expansion across vernacular markets.",
            "Sentiment": "positive",
            "PublishDate": 1762439392265,
            "Source": "stock"
        },
        {
            "Title": "Jagran Prakashan Updates on NCLT Proceedings in Two Company Petition Cases",
            "Summary": "Jagran Prakashan Limited disclosed updates on two ongoing cases before the NCLT Allahabad. In C.P. No. 64 of 2023 (Mahendra Mohan Gupta and Others v. Devendra Mohan Gupta and Others), senior counsel continued final submissions on behalf of Respondents No. 2 and 5, with the next hearing scheduled for December 1, 2025. In C.P. No. 57 of 2025 (Shailendra Mohan Gupta and Others v. Jagran Media Network Investment Private Limited and Others), the NCLT directed respondents to file their reply before the next hearing date. Both matters are scheduled for further hearing on December 1, 2025 at 3:00 PM. The company stated it will provide updates only when there are material developments in the proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1762438868446,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jagran Prakashan Reports 36% Jump in Q2 Net Profit Despite EBITDA Margin Decline",
            "Summary": "Jagran Prakashan reported consolidated net profit of 586 million rupees for Q2, up from 430 million rupees in the same period last year. Revenue increased to 4.7 billion rupees from 4.5 billion rupees year-over-year. However, EBITDA declined to 666 million rupees from 675 million rupees, while EBITDA margin compressed to 14.25% from 15.12% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762431275502,
            "Source": "earnings"
        },
        {
            "Title": "NCLT Issues Notices in Oppression Case Against Jagran Prakashan, Hearing Set for November 3",
            "Summary": "The National Company Law Tribunal, Allahabad has issued notices in a company petition filed by Shailendra Mohan Gupta and others against Jagran Prakashan Limited and its holding company Jagran Media Network Investment Private Limited. The petition alleges oppression and mismanagement and has been tagged with an existing case from 2023 filed by Mahendra Mohan Gupta, Shailesh Gupta and VRSM Enterprises LLP. The tribunal has directed respondents to file their reply within two weeks and scheduled the next hearing for November 3, 2025. Multiple members of the Gupta family promoter group have been named as respondents in the case.",
            "Sentiment": "negative",
            "PublishDate": 1760775949844,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jagran Prakashan NCLT Hearing in Mahendra Mohan Gupta Case Continues, Next Hearing Scheduled for November 2025",
            "Summary": "Jagran Prakashan is involved in an ongoing NCLT hearing related to the Mahendra Mohan Gupta case. The proceedings are currently in the final submissions phase by respondents. The next hearing has been scheduled for November 3, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760170755845,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jagran Prakashan Faces Company Petition from Non-Executive Director Over Corporate Governance Issues",
            "Summary": "Jagran Prakashan Limited has been served with a company petition by its Non-Executive Director, Shailendra Mohan Gupta, under Sections 241-242 and 244 of the Companies Act, 2013. The petition is filed against JPL, its holding company JMNIPL, and other members of the Gupta Family who comprise the Promoters/Promoters Group. Additionally, a separate company application has been filed challenging resolutions passed by majority directors in JMNIPL and the appointment of an Administrator. The company states that the outcome and financial impact cannot be anticipated at this stage, as claims are in the nature of injunctive and declaratory relief and cannot be quantified. The petition has not yet been listed for hearing, while the company application is scheduled for hearing on September 24, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1758641269558,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jagran Prakashan Approves Board Changes and Executive Reappointments at 49th AGM",
            "Summary": "Jagran Prakashan Limited shareholders approved several key management changes at their 49th Annual General Meeting held on September 19, 2025. The company continued Mr. Shailendra Mohan Gupta as Non-Executive Director, who has been with the company since September 2008 and brings over 45 years of experience across sugar, alcohol, and electronics industries. Three Executive Presidents were reappointed for five-year terms starting October 1, 2025: Mr. Sameer Gupta (Accounts) with 37 years experience including 23 in media, Mr. Devesh Gupta (Product Sales and Marketing) with 29 years experience including 21 in media, and Mr. Tarun Gupta (Commercial), a chartered accountant with 20 years media industry experience. The company also saw leadership transition as Independent Director Mr. Vikram Sakhuja's second term concluded, while appointing Mr. Arun Anant as new Independent Director for a five-year term until 2030. Mr. Anant brings 40 years of industry experience including leadership roles at Hindustan Times Group, The Hindu Group, and Economic Times. Additionally, Adesh Tandon & Associates was appointed as Secretarial Auditors for the term April 1, 2025 to March 31, 2030.",
            "Sentiment": "neutral",
            "PublishDate": 1758294130634,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jagran Prakashan Targets Growth Across Print, Digital, and Events While Managing Radio Segment Challenges",
            "Summary": "Jagran Prakashan has outlined its strategic focus on achieving growth in its print, digital, and events businesses. The company is working on profitability improvement through multiple initiatives including boosting circulation numbers, expanding its digital presence, and implementing cost control measures. However, the company is facing challenges in its radio business segment, which is experiencing poor performance.",
            "Sentiment": "neutral",
            "PublishDate": 1753799268436,
            "Source": "stock"
        },
        {
            "Title": "Jagran Prakashan Reports Strong Q1 Performance with 76% Jump in Standalone Profit",
            "Summary": "Jagran Prakashan Limited reported standalone profit of Rs 6,008.92 lakhs for the quarter ended June 30, 2025, compared to Rs 3,413.53 lakhs in the previous quarter. Revenue from operations increased to Rs 39,813.14 lakhs from Rs 37,044.62 lakhs. On a consolidated basis, the company posted profit of Rs 6,676.07 lakhs versus Rs 4,103.45 lakhs in the prior quarter, with consolidated revenue rising to Rs 46,005.23 lakhs from Rs 44,411.85 lakhs. The company paid an interim dividend of Rs 6 per equity share for financial year 2025. Earnings per share on standalone basis stood at Rs 2.76 compared to Rs 2.02 in the previous quarter. The results include businesses across printing and publishing, FM radio operations, and outdoor advertising services.",
            "Sentiment": "positive",
            "PublishDate": 1753784487533,
            "Source": "earnings"
        },
        {
            "Title": "Jagran Prakashan Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Jagran Prakashan has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 935 million rupees from 1.04 billion rupees in the same quarter last year. Additionally, the EBITDA margin dropped to 18.09% from 20.50% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738756281000,
            "Source": "earnings"
        },
        {
            "Title": "Jagran Prakashan Reports Q3 Financial Results",
            "Summary": "Jagran Prakashan has announced its Q3 consolidated financial results. The company reported a net profit of 626 million rupees, down from 738 million rupees in the same quarter last year. However, revenue showed a slight increase, rising to 5.16 billion rupees from 5.11 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738756275000,
            "Source": "earnings"
        },
        {
            "Title": "Jagran Prakashan Reports Q2 EBITDA Decline",
            "Summary": "Jagran Prakashan, an Indian media company, has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 675 million rupees from 719.3 million rupees year-over-year. The EBITDA margin also declined slightly to 15.12% from 15.68% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730981298000,
            "Source": "result"
        },
        {
            "Title": "Jagran Prakashan Reports Q2 Financial Results",
            "Summary": "Jagran Prakashan has announced its Q2 consolidated net profit of 430 million rupees, showing a slight increase from 424.1 million rupees year-over-year and 412 million rupees quarter-over-quarter. However, Q2 revenue decreased to 4.5 billion rupees from 4.59 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730981108000,
            "Source": "result"
        }
    ]
}