{
    "Symbol": "JAGSNPHARM",
    "ISIN": "INE048B01035",
    "News": [
        {
            "Title": "Jagsonpal Pharma Outlines Growth Strategy for Next 2 Years",
            "Summary": "Jagsonpal Pharmaceutical expects 50% of growth from price increases and new products, with remaining from volume growth over the next one to two years during recent concall guidance.",
            "Sentiment": "positive",
            "PublishDate": 1769136657110,
            "Source": "stocks"
        },
        {
            "Title": "Jagsonpal Pharma Q3 FY26 Earnings Call Audio Available",
            "Summary": "Jagsonpal Pharmaceuticals has made available the audio recording of its Q3 FY26 earnings conference call held on January 22, 2026, discussing quarterly financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1769090635409,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jagsonpal Pharma Q3FY26 Earnings Call on Jan 22",
            "Summary": "Jagsonpal Pharmaceuticals has scheduled an analyst and investor conference call on January 22, 2026, at 5:00 PM IST to discuss Q3FY26 financial results, hosted by Go India Advisors.",
            "Sentiment": "neutral",
            "PublishDate": 1768476616976,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jagsonpal Pharmaceuticals Allots 1.09L Equity Shares",
            "Summary": "Jagsonpal Pharmaceuticals Limited allotted 1,09,180 equity shares under ESOP 2022 to eligible employees, increasing paid-up capital from ₹13.36 crores to ₹13.38 crores.",
            "Sentiment": "positive",
            "PublishDate": 1767700403225,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jagsonpal Pharma Receives ₹1.52 Cr GST Demand Order",
            "Summary": "Jagsonpal Pharmaceuticals receives tax demand order of ₹1.52 crores from Haryana State Tax authorities for FY 2021-22, plans to file appeal against the order.",
            "Sentiment": "negative",
            "PublishDate": 1767094462038,
            "Source": "stocks"
        },
        {
            "Title": "Jagsonpal Pharmaceuticals Allots 56,571 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Jagsonpal Pharmaceuticals Limited allotted 56,571 equity shares of Rs. 2 each to eligible employees under its JPLESOP 2022 plan upon exercise of vested options. The allotment increased the company's paid-up share capital from Rs. 13,34,49,398 to Rs. 13,35,62,540, with total issued shares rising to 6,67,81,270.",
            "Sentiment": "neutral",
            "PublishDate": 1763446638078,
            "Source": "corporate_action"
        },
        {
            "Title": "Jagsonpal Pharmaceuticals Reports Flat Q2 Growth, Appoints New COO and CFO",
            "Summary": "Jagsonpal Pharmaceuticals Limited reported flat quarterly performance with revenue at Rs. 74.5 crores, impacted by GST transition challenges. The company maintained EBITDA at Rs. 18.1 crores with 24.3% margin and PAT grew 10% to Rs. 12.6 crores. For H1 FY26, revenue increased 10% to Rs. 150 crores with PAT jumping 39% to Rs. 23.4 crores. The company appointed Amrut Medhekar as Chief Operating Officer, bringing 30 years of pharma experience from Wockhardt, Zydus, Ranbaxy and Torrent. Nirav Vora joined as Chief Financial Officer with 18 years of finance experience. The Indian pharmaceutical market grew 7.5% in Q2 FY26, though Jagsonpal's therapy segments grew slower at 2.5-3%. GST reforms reduced rates from 12-18% to 5% but created temporary September challenges. The company paid dividends of Rs. 16.7 crores while maintaining cash position of Rs. 160.4 crores. Management expects stronger second-half performance and targets low double-digit growth for the remainder of the year.",
            "Sentiment": "neutral",
            "PublishDate": 1762515330589,
            "Source": "earnings"
        },
        {
            "Title": "Jagsonpal Pharmaceuticals Reports Quarterly Results for Period Ended September 30, 2025",
            "Summary": "Jagsonpal Pharmaceuticals Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The Board of Directors approved these results at a meeting held on November 3, 2025. During the quarter, the company granted 272,500 stock options to eligible employees under its Employee Stock Option Plan 2022 and allotted 104,774 equity shares upon exercise of vested stock options. The company paid a final dividend of Rs. 2.5 per equity share (face value Rs. 2 each), totaling Rs. 166.58 million for the year ended March 31, 2025, following shareholder approval at the Annual General Meeting held on September 24, 2025. The company operates primarily in manufacturing and trading of pharmaceutical products including active pharmaceutical ingredients for customers in India and overseas. The results were reviewed by the Audit Committee and a limited review was conducted by statutory auditors Walker Chandiok & Co LLP.",
            "Sentiment": "neutral",
            "PublishDate": 1762171595209,
            "Source": "earnings"
        },
        {
            "Title": "Jagsonpal Pharma Reports Mixed Q2 Results with Profit Growth Despite Revenue Decline",
            "Summary": "Jagsonpal Pharma announced its Q2 financial results showing net profit increased to 126 million rupees from 115 million rupees year-over-year. However, revenue declined slightly to 745 million rupees from 747 million rupees in the same period last year. The company's EBITDA grew to 165 million rupees compared to 162 million rupees year-over-year, while EBITDA margin improved to 22.15% from 21.69% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762171227343,
            "Source": "earnings"
        },
        {
            "Title": "Jagsonpal Pharmaceuticals Appoints Amrut Medhekar as Chief Operating Officer",
            "Summary": "Jagsonpal Pharmaceuticals Limited appointed Mr. Amrut Medhekar as Chief Operating Officer effective September 04, 2025. The appointment was approved by the Board of Directors based on the recommendation of the Nomination and Remuneration Committee. Medhekar brings over 28 years of experience in sales, marketing, and business operations within the pharmaceutical sector. He holds an MBA in Marketing from Jiwaji University and completed a certificate course in General Management from IIM Ahmedabad. Previously, he served as CEO – Business Operations at Akums Drugs & Pharmaceuticals Limited and held senior leadership positions at Torrent Pharmaceuticals Ltd, Ranbaxy Ltd, Zydus Life Sciences Ltd, and Wockhardt Ltd. Medhekar is not related to any Director or Key Managerial Personnel of the company.",
            "Sentiment": "positive",
            "PublishDate": 1756986297083,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jagsonpal Pharmaceuticals Reports Strong Q1FY26 Results with 23% Revenue Growth and Doubled PAT",
            "Summary": "Jagsonpal Pharmaceuticals delivered robust quarterly performance with revenue rising 23% year-on-year to Rs. 75.5 crores, driven by strong brand equity and focused marketing. The company's PAT doubled to over Rs. 108 million with net margins improving 560 basis points to 14.3%. Operating EBITDA before ESOP grew 24% to Rs. 157 million with margins at 20.8%. The company improved its Gynae CVM ranking to No. 7 as per CMARC and maintains top 5 positions in 14 of its top 15 brands. Cash position strengthened to Rs. 161 crores, an increase of Rs. 153 million over the previous quarter. The company terminated CFO Sachin Jain during probation period for misconduct. Yash Pharma acquisition contributed approximately Rs. 12 crores to topline versus Rs. 3.5 crores last year. Management maintains 15% growth guidance for the year and expects 100-150 basis points EBITDA margin expansion. The company operates with around 900-1000 medical representatives and focuses on subchronic therapeutic segments with roughly 50% business from gynae therapy.",
            "Sentiment": "positive",
            "PublishDate": 1753944950449,
            "Source": "earnings"
        },
        {
            "Title": "Jagsonpal Pharmaceuticals Makes Q1 FY26 Earnings Call Recording Available Online",
            "Summary": "Jagsonpal Pharmaceuticals Limited has made the audio recording of their Q1 FY26 earnings conference call available on their company website. The call was held on July 28, 2025 at 3:00 P.M. to discuss Q1 FY26 financial results. The recording can be accessed through the investor relations section of the company's website at their earnings calls page.",
            "Sentiment": "neutral",
            "PublishDate": 1753706422069,
            "Source": "earnings"
        },
        {
            "Title": "Jagsonpal Pharmaceuticals Reports Strong Q1 Performance with Net Profit Doubling Year-on-Year",
            "Summary": "Jagsonpal Pharmaceuticals Ltd reported net profit of 107 million rupees for Q1, representing a significant increase from 53 million rupees in the same quarter last year and 65 million rupees in the previous quarter. The company's revenue reached 756 million rupees, up from 614 million rupees year-on-year and 585 million rupees quarter-on-quarter, indicating growth across both timeframes.",
            "Sentiment": "positive",
            "PublishDate": 1753662272329,
            "Source": "earnings"
        },
        {
            "Title": "Jagsonpal Pharmaceuticals Reports Quarterly Results with CFO Transition",
            "Summary": "Jagsonpal Pharmaceuticals Limited announced its unaudited financial results for the quarter ended June 30, 2025. The pharmaceutical company, which manufactures and trades pharmaceutical products including active pharmaceutical ingredients in India and overseas, reported basic earnings per share of Rs. 1.60 for the quarter. The company granted 37,500 stock options to eligible employees and allotted 127,850 equity shares under its Employee Stock Option Plan 2022. The Board of Directors recommended a final dividend of Rs. 2.5 per equity share for the year ended March 31, 2025, subject to shareholder approval. Sachin Jain ceased to be the Chief Financial Officer on July 8, 2025, following his release during the probation period, and the company is in the process of hiring a new CFO.",
            "Sentiment": "neutral",
            "PublishDate": 1753514344211,
            "Source": "earnings"
        },
        {
            "Title": "Jagsonpal Pharma Q4 Results and Corporate Updates",
            "Summary": "Jagsonpal Pharma reported Q4 net profit of 66m rupees, up from 35.5m YoY but down from 320m QoQ. Revenue increased to 586m rupees from 434.9m YoY. The company declared a dividend of 2.5 rupees per equity share. Additionally, Jagsonpal Pharma and an unnamed seller mutually agreed to terminate a business transfer agreement for the acquisition of Resilient, as certain conditions could not be met.",
            "Sentiment": "neutral",
            "PublishDate": 1746576817000,
            "Source": "default"
        },
        {
            "Title": "Jagsonpal Pharma Terminates Business Transfer Agreement",
            "Summary": "Jagsonpal Pharma and the seller have mutually agreed to terminate their business transfer agreement for the acquisition of Resilient. The decision was made as certain conditions precedent to the consummation of the transaction could not be fulfilled. As a result, the proposed acquisition of Resilient has been cancelled.",
            "Sentiment": "negative",
            "PublishDate": 1746542108000,
            "Source": "default"
        },
        {
            "Title": "Jagsonpal Pharma Declares Dividend",
            "Summary": "Jagsonpal Pharma has announced a dividend of 2.5 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1746538257000,
            "Source": "result"
        },
        {
            "Title": "Jagsonpal Pharma Reports Strong Q4 Financial Performance",
            "Summary": "Jagsonpal Pharma has reported significant year-over-year improvements in its Q4 financial results. The company's EBITDA increased to 87 million rupees from 26.69 million rupees in the previous year, with EBITDA margin expanding to 14.85% from 6.14%. Net profit rose to 66 million rupees from 35.5 million rupees year-over-year. Revenue also showed strong growth, reaching 586 million rupees compared to 434.9 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1746538218000,
            "Source": "result"
        },
        {
            "Title": "Customs Authority Orders Jagsonpal Pharma to Pay Differential Duty and Penalty",
            "Summary": "The Customs Authority has issued an order to Jagsonpal Pharma, confirming a differential duty of 51 million rupees plus an additional penalty. This decision likely stems from a customs-related issue or discrepancy in the company's import/export activities.",
            "Sentiment": "negative",
            "PublishDate": 1743597108000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jagsonpal Pharmaceuticals Receives FDA Warning and Acquires Resilient Cosmeceuticals' India Business",
            "Summary": "Jagsonpal Pharmaceuticals has received a warning letter from the US FDA citing CGMP deviation and registration and listing violations at their contract manufacturing facility. The financial impact includes a sale of 35 million rupees. Additionally, the company is set to acquire the India business of Resilient Cosmeceuticals for 240 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1740355754000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jagsonpal Pharmaceuticals to Acquire India Business of Resilient Cosmeceuticals",
            "Summary": "Jagsonpal Pharmaceuticals has announced its plan to acquire the India business of Resilient Cosmeceuticals for 240 million rupees. This acquisition represents a significant corporate action that will likely expand Jagsonpal's market presence in the pharmaceutical and cosmeceutical sectors within India.",
            "Sentiment": "positive",
            "PublishDate": 1740147363000,
            "Source": "corporate_action"
        },
        {
            "Title": "USFDA Issues Warning to Jagsonpal Pharmaceuticals' Contract Manufacturer",
            "Summary": "The US Food and Drug Administration (USFDA) has issued a warning regarding observations made during an inspection of a contract manufacturing facility used by Jagsonpal Pharmaceuticals. The financial impact of this warning includes a potential loss of sales amounting to 35 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1740143277000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jagsonpal Pharmaceuticals Receives FDA Warning Letter",
            "Summary": "Jagsonpal Pharmaceuticals has received a warning letter from the U.S. Food and Drug Administration (FDA). The letter cites violations related to Current Good Manufacturing Practice (CGMP) deviations, as well as registration and listing issues. This warning indicates potential regulatory compliance problems for the company in its pharmaceutical manufacturing processes.",
            "Sentiment": "negative",
            "PublishDate": 1740143269000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jagsonpal Pharma Reports Significant Q3 Profit Increase",
            "Summary": "Jagsonpal Pharma announced its Q3 results, showing a substantial increase in net profit to 320 million rupees from 39.63 million rupees year-over-year. Revenue also grew to 740 million rupees from 472 million rupees. The company reported an exceptional item of 232 million rupees. Profit before tax rose to 155 million rupees from 53 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1737591190000,
            "Source": "earnings"
        },
        {
            "Title": "Jagsonpal Pharma Reports Significant Profit Growth in Q3",
            "Summary": "Jagsonpal Pharma has reported a substantial increase in its Profit Before Tax (PBT) for the third quarter. The company's PBT rose to 155 million rupees, compared to 53 million rupees in the same period last year, marking a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1737550351000,
            "Source": "earnings"
        },
        {
            "Title": "Jagsonpal Pharma Reports Exceptional Item of 232 Million Rupees",
            "Summary": "Jagsonpal Pharmaceuticals Limited has reported an exceptional item amounting to 232 million rupees. Exceptional items are unusual or infrequent events that significantly impact a company's financial statements. This substantial amount could have a notable effect on the company's overall financial performance for the reporting period.",
            "Sentiment": "neutral",
            "PublishDate": 1737550345000,
            "Source": "earnings"
        },
        {
            "Title": "Jagsonpal Pharma Reports Significant Q3 EBITDA Growth",
            "Summary": "Jagsonpal Pharma has reported a substantial increase in its Q3 EBITDA, rising to 159 million rupees from 34 million rupees in the same quarter last year. The company's EBITDA margin also improved significantly, reaching 21.45% compared to 7.19% in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1737550337000,
            "Source": "earnings"
        },
        {
            "Title": "Jagsonpal Pharma Reports Significant Increase in Q3 Profit and Revenue",
            "Summary": "Jagsonpal Pharma has announced its financial results for the third quarter. The company's net profit surged to 320 million rupees, compared to 39.63 million rupees in the same period last year. Revenue also saw a substantial increase, reaching 740 million rupees, up from 472 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1737550331000,
            "Source": "earnings"
        },
        {
            "Title": "Jagsonpal Pharma Schedules Board Meeting for Q3 Results",
            "Summary": "Jagsonpal Pharmaceuticals Limited has announced a board meeting scheduled for January 22 to consider and approve the company's financial results for the third quarter. This routine meeting is part of the company's regular financial reporting process.",
            "Sentiment": "neutral",
            "PublishDate": 1736944468000,
            "Source": "result"
        }
    ]
}