{
    "Symbol": "JAINREC",
    "ISIN": "INE0YD401026",
    "News": [
        {
            "Title": "Jain Resource Recycling Board Meet on Feb 09, 2026",
            "Summary": "Jain Resource Recycling Limited schedules board meeting on February 09, 2026, to consider Q3FY26 unaudited financial results. Trading window closed from January 01, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770217786414,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jain Resource Recycling postal ballot results",
            "Summary": "Jain Resource Recycling Limited announces successful completion of postal ballot voting with two resolutions passed - appointment of secretarial auditor and executive director.",
            "Sentiment": "positive",
            "PublishDate": 1768913065595,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jain Resource Recycling Seeks Shareholder Approval",
            "Summary": "Jain Resource Recycling Limited announces postal ballot for appointing Sanchit Jain as Executive Director with ₹6.00 lakh annual remuneration and selecting VAK Associates as secretarial auditors for five years.",
            "Sentiment": "neutral",
            "PublishDate": 1766141245683,
            "Source": "stocks"
        },
        {
            "Title": "SEBI Imposes ₹25 Lakh Penalty on Jain Resource Promoter",
            "Summary": "SEBI penalized Jain Resource Recycling's promoter Kamlesh Jain ₹25 lakh for alleged insider trading in Refex Industries shares. The company states the order won't impact its operations.",
            "Sentiment": "negative",
            "PublishDate": 1765891995195,
            "Source": "stocks"
        },
        {
            "Title": "Jain Resource Recycling Reports 52% Revenue Growth in Q2 FY26 Earnings Call",
            "Summary": "Jain Resource Recycling Limited held its first earnings conference call following its successful listing on NSE and BSE on October 1, 2025, after raising INR 1,250 crores through IPO. The company reported strong quarterly results with revenue from operations reaching INR 2,114 crores compared to INR 1,392 crores in Q2 FY25, reflecting 52% year-on-year growth. EBITDA stood at INR 160 crores versus INR 88 crores in the previous year, showing 82% growth with margins at 7.6%. Profit for the period was INR 99 crores compared to INR 53 crores, representing 88% growth with PAT margins at 4.7%. For the first half of FY26, revenue reached INR 3,663 crores compared to INR 2,889 crores in H1 FY25, marking 27% growth. The company operates across five product verticals with copper contributing 46% of revenue, lead 48%, aluminum 4%, and others 2%. Export markets account for 63% of revenue while domestic sales contribute 37%. The company announced a joint venture with Texas-based CNY Group for a INR 60 crores copper scrap recycling plant in Ahmedabad, and is developing a copper cathode manufacturing facility with Phase 1 capex of INR 95 crores expected to commence operations in Q1 FY27. Management highlighted their global sourcing network spanning 120+ countries and strong market positions with 8.6% market share in lead and 3.4% in copper recycling in India.",
            "Sentiment": "positive",
            "PublishDate": 1761853938652,
            "Source": "earnings"
        },
        {
            "Title": "Ashish Kacholia's Investment in Jain Resource Recycling Delivers 214% Returns in 8 Months",
            "Summary": "Investor Ashish Kacholia's investment in Jain Resource Recycling has generated approximately 214% returns since March 2025. Through Bengal Finance & Investments, Kacholia invested Rs 50 crore in March, purchasing 7,83,375 shares at Rs 638.28 per share. A 1:5 stock split in March increased his holding to 39,16,875 shares with an adjusted cost of Rs 126.75 per share. The company listed on October 1 at a 14% premium to its issue price of Rs 232, closing at Rs 318 on debut day and reaching around Rs 400 by October 24. This values Kacholia's stake at nearly Rs 157 crore, representing about 1.1% ownership. The stock gained momentum following strong quarterly results showing 88% year-on-year net profit growth to Rs 98.6 crore and 52% revenue growth to Rs 2,113.7 crore. EBITDA increased 82% to Rs 160 crore with operating margins improving to 7.6%. Jain Resource Recycling is a Chennai-based company that recycles non-ferrous metals including lead, copper, and aluminium, with a gold refining subsidiary in the UAE. Kacholia also made portfolio changes during the September quarter, adding five new positions while trimming stakes in Dhabriya Polywood, Xpro India, and Brand Concepts.",
            "Sentiment": "positive",
            "PublishDate": 1761375710801,
            "Source": "stock"
        },
        {
            "Title": "Jain Resource Recycling Surges 9% to 52-Week High on Strong Q2 Results",
            "Summary": "Jain Resource Recycling's stock jumped 9% to a new 52-week high following strong quarterly results. The company reported consolidated net profit of Rs 98.6 crore for the September quarter, an 88% increase from Rs 52.6 crore in the same quarter last year. Revenue from operations rose 52% to Rs 2,113.7 crore, while EBITDA increased 82% to Rs 160 crore with margins improving 127 basis points to 7.6%. The Aluminium and Alloys segment saw revenue surge 115% to Rs 154.5 crore, Lead and Ingots business grew 47% to Rs 1,740 crore, and Copper Ingots increased 14% to Rs 1,697.8 crore. The stock has gained 51% from its IPO price of Rs 232 per share since listing on October 1. Investor Ashish Kacholia holds a 1.1% stake through Bengal Finance & Investments, with his investment delivering 156% returns since March. The company operates in non-ferrous metals recycling and manufacturing, with three facilities near Chennai and a gold refining unit in the UAE.",
            "Sentiment": "positive",
            "PublishDate": 1761195135643,
            "Source": "earnings"
        },
        {
            "Title": "Jain Resource Recycling Plans Aggressive Growth Through Forward Integration and Capacity Expansion",
            "Summary": "Jain Resource Recycling has outlined an aggressive growth strategy focused on forward integration, capacity expansion, and entry into new recycling verticals to maintain business momentum.",
            "Sentiment": "positive",
            "PublishDate": 1761149550807,
            "Source": "stock"
        },
        {
            "Title": "Jain Resource Recycling Partners with C&Y Group to Establish Recycling Facility in Ahmedabad",
            "Summary": "Jain Resource Recycling Limited entered into a joint venture agreement with C&Y Group Investments, Inc. on October 22, 2025, to establish and operate a recycling and manufacturing facility in Ahmedabad, Gujarat. The joint venture will focus on recycling various scrap materials including cables, motors, alternators, starters, motor coils, transformers, and copper scrap. A new private limited company will be incorporated in India to serve as the joint venture entity. Jain Resource will hold 52% stake, C&Y Group will hold 45%, and employees will receive 3% as sweat equity shares. The joint venture company will become a subsidiary of Jain Resource. C&Y Group, described as one of the largest scrap metal exporters from North America with operations across multiple countries, will supply guaranteed annual quantities of scrap materials at competitive prices. The initial paid-up share capital will be INR 100 million, potentially increasing to INR 600 million based on funding requirements. All shareholdings will be subject to a 3-year lock-in period from the financial year following commercial production commencement.",
            "Sentiment": "positive",
            "PublishDate": 1761137361831,
            "Source": "order&deals"
        },
        {
            "Title": "Jain Resource Recycling Reports Strong Q2 Growth with 78% Jump in Net Profit",
            "Summary": "Jain Resource Recycling delivered robust quarterly performance with consolidated net profit rising to 992 million rupees from 558 million rupees year-over-year. Revenue increased significantly to 21.14 billion rupees compared to 13.92 billion rupees in the same period last year. EBITDA grew to 1.6 billion rupees from 878 million rupees, while EBITDA margin improved to 7.57% from 6.31% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761056799209,
            "Source": "earnings"
        },
        {
            "Title": "Jain Resource Recycling Approves Q1 & H1 FY2026 Results, Appoints New Director and Auditor",
            "Summary": "Jain Resource Recycling Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025 and half year ended September 30, 2025. The company reported standalone revenue from operations of ₹14,696.91 million for Q1 and ₹35,245.98 million for H1, with profit after tax of ₹591.51 million and ₹1,577.89 million respectively. The Board appointed Mr. Sanchit Jain as Additional Director (Executive), who is the son of Managing Director Mr. Kamlesh Jain and holds a Bachelor's degree in Business Administration from SPJ Global Management, Sydney. The company also appointed M/s. VAK & Associates as Secretarial Auditor for five consecutive years from FY 2025-26 to FY 2029-30. The company operates in three business segments: Aluminium & Aluminium Alloys, Lead & Lead Alloy Ingots, and Copper & Copper Ingots.",
            "Sentiment": "positive",
            "PublishDate": 1761031583974,
            "Source": "earnings"
        },
        {
            "Title": "Jain Resource Recycling Limited Schedules Earnings Conference Call for October 23, 2025",
            "Summary": "Jain Resource Recycling Limited has scheduled an earnings conference call for analysts and investors on October 23, 2025 at 12:00 p.m. IST to discuss the company's unaudited financial results for the quarter ended June 30, 2025 and the quarter and half year ended September 30, 2025. The conference call will be represented by Chairman & Managing Director Kamlesh Jain, Joint Managing Director Mayank Pareek, Director and CFO Hemant Jain, along with senior management team members. The company's Board of Directors meeting is scheduled for October 21, 2025 to consider and approve these financial results. Access details include universal phone numbers and toll-free numbers for international participants from Hong Kong, Singapore, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1760625627805,
            "Source": "earnings"
        },
        {
            "Title": "Ashish Kacholia Adds 50th Stock to Portfolio with Jain Resource Recycling Investment Worth Rs 128 Crore",
            "Summary": "Investor Ashish Kacholia acquired a stake in Jain Resource Recycling through a pre-IPO allocation, marking his 50th stock holding. His 1.14% stake represents 39,16,875 equity shares valued at approximately Rs 128 crore. The shares were allotted to Bengal Finance & Investment Pvt Ltd, an entity associated with Kacholia, making him among the top 10 shareholders. Jain Resource Recycling listed at Rs 265, a 14% premium over the IPO price of Rs 232, and has gained 41% to Rs 326.90. The company's Rs 1,250 crore IPO was oversubscribed 16.8 times, with institutional buyers subscribing 27 times their portion. Jain Resource Recycling operates in non-ferrous metals recycling, manufacturing lead, copper and aluminium through three facilities near Chennai and a gold refining unit in UAE. The company serves clients including Vedanta, Luminous Power, Mitsubishi Corporation and Nissan Trading, with exports to Singapore, China, Japan and South Korea. Kacholia's total portfolio spans 50 stocks worth over Rs 2,894 crore.",
            "Sentiment": "positive",
            "PublishDate": 1759847831564,
            "Source": "stock"
        }
    ]
}