{
    "Symbol": "JAMNAAUTO",
    "ISIN": "INE039C01032",
    "News": [
        {
            "Title": "Jamna Auto Allots 7.14 Lakh Shares Under ESOP",
            "Summary": "Jamna Auto Industries allotted 714,500 equity shares to employees under ESOP-2017 at Rs. 50.00 per share on January 29, 2026, increasing total issued shares to 39.97 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769757590756,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jamna Auto Gets Credit Rating Upgrade from CARE",
            "Summary": "CARE Ratings upgrades Jamna Auto Industries' long-term bank facilities rating to CARE AA; Stable from CARE AA-; Stable for ₹90.00 crore facilities, reflecting improved creditworthiness.",
            "Sentiment": "positive",
            "PublishDate": 1767270233595,
            "Source": "stocks"
        },
        {
            "Title": "Jamna Auto Re-appoints R.S. Jauhar as Chairman",
            "Summary": "Jamna Auto Industries shareholders approve re-appointment of R.S. Jauhar as Chairman and Executive Director for 3 years through postal ballot with 96.82% votes in favor.",
            "Sentiment": "positive",
            "PublishDate": 1767087423538,
            "Source": "stocks"
        },
        {
            "Title": "Jamna Auto Industries Seeks Shareholder Approval for Chairman's Re-appointment via Postal Ballot",
            "Summary": "Jamna Auto Industries has issued a postal ballot notice seeking member approval for re-appointing R.S. Jauhar as Whole-time Director designated as Chairman and Executive Director for a three-year term from January 1, 2026 to December 31, 2028. The e-voting process runs from November 30, 2025 to December 29, 2025, with results to be announced within two working days after voting concludes.",
            "Sentiment": "neutral",
            "PublishDate": 1763976381731,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jamna Auto Industries Updates Integrated Suspension System Plant Setup Plans",
            "Summary": "Jamna Auto Industries has provided an update on its integrated suspension system plant project. The company will establish three separate projects: an Axle Project and Rubber Project under Jamna Auto Industries Ltd, and a Suspension Project under subsidiary Jai Automotive Components Ltd. The Axle and Suspension projects will be located in Indore, Madhya Pradesh, while the Rubber project will utilize existing facilities in Malanpur, Madhya Pradesh. Proposed annual capacities are 24,000 units for axles, 24,00,000 units for rubber components, and 7,200 units for suspension systems. All three projects are expected to commence in Q1 and Q2 of FY2026-27. The overall investment requirement is estimated at Rs. 132 crore, subject to management adjustments.",
            "Sentiment": "positive",
            "PublishDate": 1762940331209,
            "Source": "stock"
        },
        {
            "Title": "Jamna Auto Industries Reports Flat Q2 Net Profit at 397M Rupees, Declares 1 Rupee Dividend",
            "Summary": "Jamna Auto Industries reported consolidated net profit of 397 million rupees for Q2, unchanged from the same period last year. The company's EBITDA increased to 689 million rupees from 661 million rupees year-over-year, with EBITDA margin improving slightly to 12.98% from 12.88%. The company approved a dividend of 1 rupee per share.",
            "Sentiment": "neutral",
            "PublishDate": 1762935661438,
            "Source": "earnings"
        },
        {
            "Title": "Jamna Auto Industries Issues Letters of Confirmation for 10,000 Lost Shares to Five Shareholders",
            "Summary": "Jamna Auto Industries Ltd issued Letters of Confirmation to five shareholders for a total of 10,000 shares due to loss of share certificates. The shareholders include Devender Kumar Gupta (1,000 shares), Arun Kumar Rathi (1,000 shares), Mahendra J Patel (1,000 shares), Atul Shankar Nath (1,000 shares), and Rekha Bector (6,000 shares). All applications were received on September 17, 2025, and the company informed BSE and NSE about this action. The Letters of Confirmation were issued with new certificate numbers ranging from 23452 to 23456.",
            "Sentiment": "neutral",
            "PublishDate": 1758169925365,
            "Source": "corporate_action"
        },
        {
            "Title": "Jamna Auto Industries Sets Record Date for ₹1.10 Final Dividend",
            "Summary": "Jamna Auto Industries Ltd has set September 18, 2025 as the record date for determining shareholder eligibility for a final dividend of ₹1.10 per equity share for financial year 2024-25. The Board of Directors recommended this dividend at their meeting on May 30, 2025, subject to shareholder approval at the Annual General Meeting scheduled for September 25, 2025. Shareholders whose names appear in the register of members or as beneficial owners on the record date will be entitled to receive the dividend. If approved, the dividend payment will be made within 30 days from the declaration date.",
            "Sentiment": "positive",
            "PublishDate": 1757058675398,
            "Source": "corporate_action"
        },
        {
            "Title": "Jamna Auto Industries Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "Jamna Auto Industries reported Q1 consolidated net profit of 457 million rupees, down from 463.8 million rupees in the same period last year. Revenue increased to 5.7 billion rupees compared to 5.57 billion rupees year-over-year. EBITDA rose to 763 million rupees from 748 million rupees, while EBITDA margin slightly decreased to 13.30% from 13.43% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1755160624225,
            "Source": "earnings"
        },
        {
            "Title": "Jamna Auto Industries Reports Q4 Financial Results",
            "Summary": "Jamna Auto Industries has released its Q4 financial results. The company reported an EBITDA of 835 million rupees, down from 887 million rupees year-over-year. The EBITDA margin decreased to 13.1% from 13.9% in the same period last year. Revenue remained stable at 6.4 billion rupees. The consolidated net profit for Q4 was 503 million rupees, compared to 548 million rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1748598771000,
            "Source": "result"
        },
        {
            "Title": "Jamna Auto Industries Reports Q3 EBITDA and Margin Changes",
            "Summary": "Jamna Auto Industries has reported its Q3 EBITDA at 772 million rupees, compared to 863 million rupees in the same quarter last year, showing a year-over-year decrease. However, the company's Q3 EBITDA margin has significantly improved to 13.72% from 1.43% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1739534087000,
            "Source": "earnings"
        },
        {
            "Title": "Jamna Auto Industries Reports Q3 Financial Results",
            "Summary": "Jamna Auto Industries has announced its Q3 consolidated financial results. The company reported a net profit of 438 million rupees, down from 549 million rupees in the same quarter last year. Revenue remained stable at 6 billion rupees, unchanged from the previous year's Q3.",
            "Sentiment": "neutral",
            "PublishDate": 1739534081000,
            "Source": "earnings"
        },
        {
            "Title": "Jamna Auto Industries to Close Dera Bassi Manufacturing Unit",
            "Summary": "Jamna Auto Industries has announced the closure of its manufacturing unit in Dera Bassi. The company stated that this closure will not have a significant impact on its consolidated financial results. This decision appears to be a part of the company's operational restructuring or optimization efforts.",
            "Sentiment": "neutral",
            "PublishDate": 1739492169000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jamna Auto Industries to Close Dera Bassi Manufacturing Unit",
            "Summary": "Jamna Auto Industries has announced that its subsidiary will close its manufacturing unit located in Dera Bassi. The company has stated that this closure will not have a significant impact on the consolidated financial results of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1739446155000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jamna Auto Industries Declares Interim Dividend",
            "Summary": "Jamna Auto Industries has announced an interim dividend of 1 rupee per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1731585940000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jamna Auto Industries Reports Q2 EBITDA Decline",
            "Summary": "Jamna Auto Industries reported a decrease in Q2 EBITDA, falling to 661 million rupees from 791 million rupees year-over-year. The company's EBITDA margin also slightly decreased to 12.88% from 13.03% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731585893000,
            "Source": "result"
        },
        {
            "Title": "Jamna Auto Industries Reports Q2 Financial Results",
            "Summary": "Jamna Auto Industries announced its Q2 consolidated net profit of 390 million rupees, down from 501 million rupees year-over-year and 464 million rupees quarter-over-quarter. The company's Q2 revenue stood at 5.12 billion rupees, a decrease from 6.07 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1731585825000,
            "Source": "result"
        },
        {
            "Title": "Jamna Auto Industries Unit to Close Operations in Uttarakhand",
            "Summary": "Jamna Auto Industries has announced that one of its manufacturing units located in Uttarakhand will cease operations. This decision represents a significant change in the company's operational structure and may have implications for its production capacity and workforce.",
            "Sentiment": "negative",
            "PublishDate": 1730116634000,
            "Source": "corporate_action"
        },
        {
            "Title": "Tejas B. Trivedi Acquires 1.02% Stake in Jamna Auto Industries",
            "Summary": "<p><span class=\"neutral\">Investor</span> <b>Tejas B. Trivedi</b> has been reported to hold a <span class=\"positive\">1.02% stake</span> in <b>Jamna Auto Industries</b> during the <span class=\"neutral\">second quarter</span> of the financial year. This information appears in the company's <span class=\"neutral\">shareholding pattern</span> for Q2.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728972027000,
            "Source": "normal_news"
        }
    ]
}