{
    "Symbol": "JARO",
    "ISIN": "INE00YJ01010",
    "News": [
        {
            "Title": "Jaro Education Q3FY26 Results: Net Profit Rises 281%",
            "Summary": "Jaro Institute reports Q3FY26 net profit of ₹703.06 lakhs vs loss of ₹388.87 lakhs in Q3FY25. Revenue grows 38.6% to ₹6,000.96 lakhs. Nine-month profit at ₹3,158.36 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1769672931977,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jaro Institute Q3FY26 Earnings Call on Jan 30",
            "Summary": "Jaro Institute of Technology Management and Research Limited announces Q3FY26 earnings call scheduled for January 30, 2026 at 2:00 PM IST via virtual meeting format.",
            "Sentiment": "neutral",
            "PublishDate": 1769524905052,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jaro Institute Board Meet on Jan 29 for Q3FY26 Results",
            "Summary": "Jaro Institute of Technology Management and Research Limited has scheduled its board meeting for January 29, 2026, to consider and approve unaudited financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769267706146,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jaro Institute's Auditor Converts to LLP Structure",
            "Summary": "Jaro Institute of Technology Management and Research Limited announces that its statutory auditor M S K A & Associates has converted to Limited Liability Partnership structure, now operating as M S K A & Associates LLP.",
            "Sentiment": "neutral",
            "PublishDate": 1769177570112,
            "Source": "stocks"
        },
        {
            "Title": "Jaro Institute Board Approves ESOP 2026 & Director Reappointment",
            "Summary": "Jaro Institute's board approved new ESOP scheme for 10 lakh options, reappointed independent director Ishan Baveja for 5-year term, and allotted 20,050 equity shares under existing ESOP scheme.",
            "Sentiment": "positive",
            "PublishDate": 1769016329918,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jaro Institute Declares 20% Interim Dividend",
            "Summary": "Jaro Institute of Technology Management and Research Limited declared interim dividend of 20% (Rs. 2.00 per share) for FY26 with record date January 16, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767106987884,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jaro Education Renews 5-Year Partnership with SIU",
            "Summary": "Jaro Institute of Technology Management and Research Limited announces renewal of exclusive partnership with Symbiosis International (Deemed University) for five years, extending collaboration valued at ₹450 crores over past three years.",
            "Sentiment": "positive",
            "PublishDate": 1766999388305,
            "Source": "stocks"
        },
        {
            "Title": "Veranda Learning Announces Jaro-J.K. Shah Partnership",
            "Summary": "Veranda Learning subsidiary J.K. Shah Classes partners with Jaro Education to expand online commerce education delivery across India, targeting Tier 2 and Tier 3 cities through digital infrastructure support.",
            "Sentiment": "positive",
            "PublishDate": 1765964741965,
            "Source": "stocks"
        },
        {
            "Title": "Jaro Institute Receives GST Demand Order of INR 15.19 Lakh for FY 2021-22",
            "Summary": "Jaro Institute of Technology Management and Research Limited received a GST assessment order from Tamil Nadu State Tax authorities demanding INR 15.19 lakh, comprising tax of INR 8.33 lakh, interest of INR 6.03 lakh, and penalty of INR 83,348 for financial year 2021-22. The company states there is no material impact on its operations and believes the demand is not feasible as per law, with plans to file an appeal before the due date.",
            "Sentiment": "negative",
            "PublishDate": 1764255154205,
            "Source": "stock"
        },
        {
            "Title": "Jaro Institute Reports No IPO Proceeds Utilization in First Quarter Post-Listing",
            "Summary": "Jaro Institute of Technology Management and Research Limited has reported zero utilization of its IPO proceeds during the quarter ended September 30, 2025. The company raised Rs 1,700 million through its IPO held from September 22-25, 2025. The monitoring agency report by Crisil Ratings shows that none of the allocated funds were used for the stated purposes: Rs 810 million for marketing and brand building activities, Rs 450 million for loan repayment, Rs 301.53 million for general corporate purposes, and Rs 138.47 million for issue expenses. The total balance of Rs 4,323.18 million remains in the public issue account, which includes Rs 1,700 million from the fresh issue and Rs 2,623.18 million from the offer for sale. The report indicates no deviation from stated objectives and confirms all proceeds remain unutilized during the reporting period.",
            "Sentiment": "neutral",
            "PublishDate": 1761917146330,
            "Source": "stock"
        },
        {
            "Title": "Jaro Education Reports 8.24% Revenue Growth in Q2, Expects 30% Growth for FY26",
            "Summary": "Jaro Institute of Technology Management and Research Limited reported revenue of ₹80.41 crore in Q2 FY26, up 8.24% from ₹74.29 crore in Q2 FY25. EBITDA stood at ₹26.53 crore and PAT at ₹17.02 crore. For H1 FY26, revenue reached ₹141.08 crore compared to ₹134.85 crore in H1 FY25, marking a 4.62% increase. The company implemented AI-driven systems for lead generation and conversion, rolled out new employee incentive structures improving per-employee efficiency from 3 to 5 conversions per month, and opened new branches in Kolkata, Indore, and Nagpur. Jaro established academic collaborations with IIT Bombay and Delhi Technological University for various degree programs, launched premium programs including IIM Mumbai Executive MBA and IIT Delhi PG Diploma in Electric Vehicle Technology. The company formed corporate partnerships with organizations having collective employee strength of 7 lakh employees, including HDFC Bank and HCL Technology. A partnership with Jio integrated learning content for Jio Set-Top Box users, enrolling over 652 learners. New verticals CollegeConnect and SchoolConnect were launched, partnering with IIT Roorkee and IIT Madras respectively. The company expects to add 250-350 employees in H2 FY26 and projects approximately 30% growth in overall revenue and profitability during FY26.",
            "Sentiment": "positive",
            "PublishDate": 1761832438641,
            "Source": "earnings"
        },
        {
            "Title": "Jaro Institute Reports Strong Q2 Performance with 126% Jump in Net Profit Post-IPO Listing",
            "Summary": "Jaro Institute of Technology, Management & Research Limited reported net profit of INR 1,702 lakhs for the quarter ended September 30, 2025, compared to INR 753.30 lakhs in the previous quarter. Revenue from operations increased to INR 8,040.75 lakhs from INR 6,067.46 lakhs quarter-on-quarter. For the half-year period, net profit reached INR 2,455.30 lakhs with revenue of INR 14,108.21 lakhs. The company completed its IPO of 50,56,179 equity shares at INR 890 per share, raising INR 45,000 lakhs through fresh issue and offer for sale. The shares were listed on NSE and BSE on September 30, 2025. Basic earnings per share for the quarter stood at INR 8.33. The company operates in the Education Program Services segment and allotted 8,643 equity shares under its ESOP scheme during the half-year period.",
            "Sentiment": "positive",
            "PublishDate": 1760801511087,
            "Source": "earnings"
        }
    ]
}