{
    "Symbol": "JASH",
    "ISIN": "INE039O01029",
    "News": [
        {
            "Title": "JASH Engineering Reports Rs. 74 Cr January Orders",
            "Summary": "JASH Engineering secured Rs. 74 crore in consolidated orders during January 2026, with Rs. 48 crore from international markets. Total order book stands at Rs. 923 crore as of February 1, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770707441942,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jash Engineering Q3FY26 Earnings Call on Feb 16",
            "Summary": "Jash Engineering Limited has scheduled its Q3FY26 earnings conference call for February 16, 2026 at 4:00 PM IST, featuring Chairman & MD Pratik Patel and CFO Dharmendra Jain.",
            "Sentiment": "neutral",
            "PublishDate": 1770692345706,
            "Source": "co_actions_results"
        },
        {
            "Title": "JASH Engineering to inaugurate new SEZ plant",
            "Summary": "JASH Engineering Limited announces inauguration of its new 70,000 sq feet manufacturing facility at SEZ Pithampur on February 14, 2026, completing its trilogy of SEZ plants.",
            "Sentiment": "positive",
            "PublishDate": 1770009520296,
            "Source": "stocks"
        },
        {
            "Title": "JASH Engineering clarifies minimal JJM exposure",
            "Summary": "JASH Engineering Limited clarifies its limited business exposure to Jal Jeevan Mission projects, stating no outstanding receivables and insignificant involvement in the government initiative.",
            "Sentiment": "neutral",
            "PublishDate": 1769153171103,
            "Source": "stocks"
        },
        {
            "Title": "Jash Engineering Q3 FY26 Newsletter Highlights Growth",
            "Summary": "Jash Engineering submits quarterly newsletter showcasing product innovations, prestigious project wins, and global expansion with ₹60+ crore infrastructure investment.",
            "Sentiment": "positive",
            "PublishDate": 1768980756006,
            "Source": "stocks"
        },
        {
            "Title": "Jash Engineering Revises WesTech Acquisition Deal",
            "Summary": "Jash Engineering amends its acquisition agreement for WesTech Process Equipment India, revising the deal value to ₹29.11 crores with completion deadline extended to January 23, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768565645015,
            "Source": "co_actions_results"
        },
        {
            "Title": "JASH Engineering Reports ₹74 Cr December Orders",
            "Summary": "JASH Engineering Limited secured ₹74 crores in consolidated orders during December 2025, with ₹46 crores from international markets and ₹28 crores from domestic clients.",
            "Sentiment": "positive",
            "PublishDate": 1768202107107,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jash Engineering Secures ₹74 Cr Orders in Dec 2025",
            "Summary": "Jash Engineering reports strong order intake of ₹74 crores in December 2025, with ₹46 crores from international markets. Total order book reaches ₹912 crores with significant overseas contribution.",
            "Sentiment": "positive",
            "PublishDate": 1768201741922,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jash Engineering forms Saudi Arabia subsidiary",
            "Summary": "Jash Engineering Limited establishes fully owned subsidiary 'Rodney Hunt Mahr Industries' in Saudi Arabia, targeting ₹100+ crore revenue by 2030 in water and wastewater sector.",
            "Sentiment": "positive",
            "PublishDate": 1768201509154,
            "Source": "stocks"
        },
        {
            "Title": "Jash Engineering Forms Saudi Arabia Subsidiary",
            "Summary": "Jash Engineering establishes subsidiary in Saudi Arabia with plans for industrial land application, targeting plant construction by July 2026 and production start by July 2027.",
            "Sentiment": "positive",
            "PublishDate": 1768201421443,
            "Source": "stocks"
        },
        {
            "Title": "Jash Engineering Promoter Disposes 20,000 Shares",
            "Summary": "Shreedevi Patel, promoter group member of Jash Engineering Limited, disposed of 20,000 equity shares through gift transaction on December 26, 2025, reducing her shareholding from 0.16% to 0.13%.",
            "Sentiment": "neutral",
            "PublishDate": 1767160980573,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jash Engineering Promoter Acquires 75,000 Shares",
            "Summary": "Promoter Pratik Patel acquired 75,000 equity shares of Jash Engineering Limited through warrant conversion on December 19, 2025, increasing his shareholding by 0.29%.",
            "Sentiment": "neutral",
            "PublishDate": 1766413525070,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jash Engineering Acquires WesTech for ₹31.37 Cr",
            "Summary": "Jash Engineering Limited announces strategic acquisition of 90% stake in WesTech Process Equipment India Private Limited for ₹31.37 crores, marking entry into industrial process equipment segment.",
            "Sentiment": "positive",
            "PublishDate": 1765557601703,
            "Source": "co_actions_results"
        },
        {
            "Title": "JASH Engineering Reports Rs. 43 Cr Monthly Order Intake for November 2025",
            "Summary": "JASH Engineering received consolidated orders worth Rs. 43 Cr in November 2025, with Rs. 23 Cr from Indian market and Rs. 20 Cr from international markets including contributions from JWIL Infra, K.Rajesh & Co., VAtech Wabag, and US-based projects. The company's total consolidated order book position stands at Rs. 928 Cr as of December 1, 2025, with Rs. 288 Cr for Indian market and Rs. 640 Cr for international markets, while Rs. 47 Cr worth of negotiated orders await formal purchase orders.",
            "Sentiment": "positive",
            "PublishDate": 1765346521949,
            "Source": "order&deals"
        },
        {
            "Title": "Jash Engineering Reports 12% Revenue Growth But Profit Hit by US Tariffs in Q2FY26",
            "Summary": "Jash Engineering achieved 12% year-on-year revenue growth but faced significant margin pressure due to 50% US tariffs preventing material dispatch to higher-margin American markets, along with design issues on certain projects. The company revised its annual revenue guidance downward from INR 860 crores to INR 825 crores while maintaining profit expectations of INR 75-85 crores, and announced acquisitions of WesTech and Penstocks UK to diversify markets and reduce US dependency.",
            "Sentiment": "neutral",
            "PublishDate": 1763616175217,
            "Source": "earnings"
        },
        {
            "Title": "Jash Engineering Reports 12% Revenue Growth to Rs. 293 Cr in H1 FY26 Despite Margin Pressures",
            "Summary": "Jash Engineering achieved consolidated revenue growth of 12% from Rs. 260 Cr to Rs. 293 Cr in H1 FY26, driven by sustained demand across domestic and international markets with order book reaching Rs. 890 Cr. However, profit margins declined due to reduced US export sales, negative margin screw generator projects, and increased employee costs, though the company expects significant improvement in H2 FY26 with projected revenue exceeding Rs. 530 Cr.",
            "Sentiment": "negative",
            "PublishDate": 1763101483170,
            "Source": "earnings"
        },
        {
            "Title": "Jash Engineering Secures ₹50 Crore Orders, Total Order Book Reaches ₹890 Crore",
            "Summary": "Jash Engineering secured ₹50 crore worth of orders in October 2025, bringing the company's total order book to ₹890 crore. The order book includes a strong overseas component.",
            "Sentiment": "positive",
            "PublishDate": 1762769566236,
            "Source": "stock"
        },
        {
            "Title": "Jash Engineering's UK Subsidiary to Acquire Penstocks (UK) Limited",
            "Summary": "Waterfront Fluid Controls Limited UK, a subsidiary of Jash Engineering Ltd., has entered into an agreement to acquire Penstocks (UK) Limited based in Leicestershire, UK. The acquisition is subject to due diligence expected to complete in the coming weeks, with the Share Purchase Agreement anticipated to be finalized within November 2025. Through this acquisition, Waterfront will gain a small manufacturing facility in Midlands, special penstock designs, existing clientele, and access to a framework agreement with a water utility company. The deal aims to establish pan-UK presence with operations in Scotland and Midlands, strengthening Waterfront's ability to support clients in marketing and servicing activities. This acquisition aligns with the company's strategy to become a major player in the UK water equipment industry within three years.",
            "Sentiment": "positive",
            "PublishDate": 1761636638599,
            "Source": "order&deals"
        },
        {
            "Title": "Jash Engineering Secures ₹40 Crore New Orders, Total Order Book Reaches ₹869 Crore",
            "Summary": "Jash Engineering secured ₹40 crore in new orders for September 2025, with ₹25 crore from domestic markets and ₹15 crore from international markets. The company's total order book now stands at ₹869 crore, comprising ₹282 crore from India and ₹587 crore from international operations.",
            "Sentiment": "positive",
            "PublishDate": 1760073893534,
            "Source": "order&deals"
        },
        {
            "Title": "Jash Engineering Appoints Rakesh Bhawsar as Independent Director for Five-Year Term",
            "Summary": "Jash Engineering Ltd shareholders approved the appointment of Mr. Rakesh Bhawsar as a Non-Executive Independent Director for a five-year term beginning August 7, 2025. The appointment was approved during the Annual General Meeting held on September 16, 2025, based on recommendations from the Nomination and Remuneration Committee and Board of Directors. Mr. Bhawsar is a practicing Chartered Accountant with over 22 years of experience in auditing, taxation, and management consultancy. He has been a fellow member of the Institute of Chartered Accountants of India since 2002 and specializes in various types of audits including Central Statutory Audit of Banks and Government Companies. Mr. Bhawsar is not related to the company's promoters or promoter group and meets independence criteria under the Companies Act, 2013 and listing regulations.",
            "Sentiment": "positive",
            "PublishDate": 1758132822548,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jash Engineering Secures ₹31 Crores in New Orders During August 2025",
            "Summary": "Jash Engineering secured new orders worth ₹31 crores in August 2025, with ₹11 crores coming from the domestic market and ₹20 crores from global projects. The company's total order book now stands at ₹863 crores, of which ₹571 crores are from overseas projects.",
            "Sentiment": "positive",
            "PublishDate": 1757489489497,
            "Source": "stock"
        },
        {
            "Title": "JASH Engineering Revises Profit Guidance to Rs 80+ Crores Due to US Tariff Impact on Subsidiary",
            "Summary": "JASH Engineering released a detailed note explaining the impact of US tariffs on its subsidiary Rodney Hunt Inc. The company faces a 50% iron and steel tariff imposed by the Trump administration starting June 4, 2025, affecting products imported from India to the US. Rodney Hunt generated $34 million revenue in 2024-25, with $10 million worth of equipment manufactured in Indian plants subject to the tariff. The company anticipates a $2-2.5 million impact on Rodney Hunt's bottom line and $2-3 million impact on top line due to reduced order aggressiveness. JASH has revised its consolidated profit projection from Rs 100+ crores to Rs 80+ crores for 2025-26 while maintaining revenue guidance at Rs 860 crores. To mitigate the impact, the company is pursuing acquisitions including Westec USA's Indian operations (expected to add Rs 60 crores revenue) and a UK company, planning new manufacturing facilities in Houston by 2026 and Saudi Arabia by 2027. The company expects to return to 12-14% consolidated profit range from next year as new quotes incorporate current tariff rates.",
            "Sentiment": "negative",
            "PublishDate": 1757056922924,
            "Source": "stock"
        },
        {
            "Title": "Jash Engineering Projects Turnover to Exceed 12.50 Billion Rupees by 2029-30",
            "Summary": "Jash Engineering has forecasted that its turnover will exceed 12.50 billion rupees by the fiscal year 2029-30. The company has set this financial target as part of its growth projections.",
            "Sentiment": "positive",
            "PublishDate": 1755771132051,
            "Source": "stock"
        },
        {
            "Title": "JASH Engineering Q1 FY26 Results: Revenue Rises to Rs 133 Crore Amid US Tariff Challenges",
            "Summary": "JASH Engineering reported consolidated revenue growth from Rs 116 crore to Rs 133 crore in quarterly results. The company faced challenges with subdued standalone performance due to deferred US deliveries amid tariff uncertainty, which increased from 25% to 50%. Consolidated order book remains strong at Rs 875 crore. The company commissioned a new facility in Chennai and is acquiring 90% stake in WesTech for Rs 40 crore. Management maintains revenue guidance of Rs 860 crore for the year but expects profit impact of $1-2 million due to tariff situation. The company is building a new plant in Houston, originally planned for 2028 but now scheduled for 2026, to mitigate tariff risks. EBITDA declined 4% while profit before tax increased losses from Rs 0.4 crore to Rs 6 crore compared to the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1755178017503,
            "Source": "earnings"
        },
        {
            "Title": "Jash Engineering Expands to New Markets, Targets Rs 1,050 Crores Revenue by FY27",
            "Summary": "Jash Engineering is expanding into new markets including Vietnam, Japan, Israel and South Africa. The company aims to maintain an order book of 10-14 months of revenue and has set a profit guidance of Rs 80-110 crores, with the range dependent on US tariff impacts. For US expansion, the company plans to spend USD 6-6.5 million, with USD 4 million already raised last year and the remaining USD 2 million expected from American bank loans. The company maintains its FY26 revenue guidance of Rs 860 crores with potential to exceed this target, and is targeting revenue of Rs 1,000-1,050 crores for FY27.",
            "Sentiment": "positive",
            "PublishDate": 1754883861576,
            "Source": "stock"
        },
        {
            "Title": "Jash Engineering Appoints Rakesh Bhawsar as Independent Director for 5-Year Term",
            "Summary": "Jash Engineering Ltd appointed Mr. Rakesh Bhawsar as an Additional Director in the category of Non-Executive Independent Director, effective August 7, 2025, for a term of 5 years. The appointment is subject to shareholder approval and was approved by the Board of Directors based on the recommendation of the Nomination and Remuneration Committee. Mr. Bhawsar, a practicing Chartered Accountant since 2002, holds DIN 11102892 and has over 22 years of experience in various audits including Central Statutory Audit of Banks, Government Companies, and Private companies. His specialization areas include Management, Taxation and Legal Consultancy, Internal audits, and Strategic Planning. He is not related to any existing directors of the company and fulfills the independence criteria under the Companies Act, 2013 and Listing Regulations.",
            "Sentiment": "positive",
            "PublishDate": 1754643690646,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jash Engineering Targets ₹860 Crore Revenue by FY26 with ₹875 Crore Order Book",
            "Summary": "Jash Engineering has set a revenue target of ₹860 crore by FY26. The company currently holds an order book worth ₹875 crore and is focusing on expanding in non-US markets. The company plans global growth through a partnership with Wes Tech and the development of a Shivpad plant for municipal-industrial equipment operations.",
            "Sentiment": "positive",
            "PublishDate": 1754577893650,
            "Source": "stock"
        },
        {
            "Title": "Jash Engineering Reports Subdued Q1 Results with Revenue Drop to ₹67 Crore, Maintains Strong Order Book at ₹875 Crore",
            "Summary": "Jash Engineering Limited reported weak quarterly results with consolidated revenue declining to ₹67 crore from ₹133 crore in the previous year quarter. The company posted a net loss of ₹5 crore compared to a marginal profit of ₹0.1 crore in the same period last year. EBITDA fell to ₹1 crore with margins dropping to 0.9% from 4.5% previously. Managing Director Pratik Patel attributed the poor performance to deferred billing for US deliveries due to tariff uncertainties and declining domestic sales in India. Despite weak results, the company maintains a consolidated order book of ₹875 crore. Strategic developments include commissioning a 58,500 sq. ft. facility near Chennai and acquiring 90% stake in WesTech India to enter industrial process equipment segments including mining, metals, and paper industries. The company expects recovery in upcoming quarters and is expanding capacity in Orange and Houston while strengthening non-US presence through acquisitions.",
            "Sentiment": "negative",
            "PublishDate": 1754573272505,
            "Source": "earnings"
        },
        {
            "Title": "Jash Engineering Reports Q1 FY26 Results, Appoints New Director and Auditors",
            "Summary": "Jash Engineering Limited's board approved unaudited standalone and consolidated financial results for Q1 FY2025-26 ended June 30, 2025. On standalone basis, the company reported revenue from operations of Rs 7,712.41 lakhs and profit of Rs 414.77 lakhs. Consolidated revenue stood at Rs 12,761.04 lakhs with a loss of Rs 517.06 lakhs. The board appointed Rakesh Bhawsar as Additional Non-Executive Independent Director for five years, while Vishwapati Trivedi's directorship will end on August 12, 2025. M/s. M. P. Turakhia & Associates were appointed as Cost Auditors and Ankit Joshi as Secretarial Auditor for FY 2025-26. The company increased borrowing limits and investment limits from Rs 300 crores to Rs 500 crores each, subject to shareholder approval. The 51st Annual General Meeting is scheduled for September 16, 2025 via video conference. The board also noted the due diligence process for potential acquisition of WesTech Process Equipment India Private Limited and approved increase in Managing Director's remuneration.",
            "Sentiment": "neutral",
            "PublishDate": 1754559701553,
            "Source": "earnings"
        },
        {
            "Title": "Jash Engineering Reports Q1 Net Loss of 51M Rupees Despite Revenue Growth",
            "Summary": "Jash Engineering reported a consolidated net loss of 51 million rupees in Q1, compared to a profit of 5 million rupees in the same period last year. The company's EBITDA turned negative with a loss of 41 million rupees versus a gain of 34 million rupees year-over-year. However, revenue increased to 1.3 billion rupees from 1.1 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754557704549,
            "Source": "earnings"
        },
        {
            "Title": "Jash Engineering Reports Rs. 78 Cr July Orders, Plans US Production Expansion Amid Tariff Concerns",
            "Summary": "Jash Engineering Ltd received consolidated orders worth Rs. 78 crores in July 2025, comprising Rs. 30 crores from Indian projects and Rs. 48 crores from international projects. Key contributors included NCC Limited, Khiladi Infra, and Thermax Babcock from India, and Flow Control Ltd., Sunol Valley WTP, and Raphael Valves Industries from international markets. The company's total consolidated order book stands at Rs. 875 crores as of August 1, 2025, with Rs. 301 crores for Indian projects and Rs. 574 crores for international projects. The US market accounts for Rs. 337 crores of international orders. Due to tariff uncertainties in the US, the company is restructuring its American operations by deferring Houston office plans in favor of building a new production facility there and extending the Orange manufacturing facility. These expansions, planned for commissioning in 2026, will increase US production capacity from 30-35% to nearly 70%. To mitigate US market risks, Jash Engineering is pursuing the acquisition of WesTech Process Equipment India and a UK-based company to strengthen Waterfront Fluid Control's operations, with both acquisitions planned for September-October 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754479661596,
            "Source": "stock"
        },
        {
            "Title": "JASH Engineering's Subsidiary Shivpad Engineers Begins Commercial Production at New Tamil Nadu Plant",
            "Summary": "JASH Engineering Limited announced that its wholly owned subsidiary, Shivpad Engineers Pvt Ltd, has commenced commercial production at its newly established plant in SIPCOT Industrial Park, Sriperumbudur, effective August 1, 2025. The new manufacturing facility is located at Plot No. G-18/1, SIPCOT Industrial Park, Vallam Vadagal, Palnallur Village, Sriperumbudur, Kanchipuram. This development represents an expansion of JASH Engineering's manufacturing capabilities through its subsidiary operations.",
            "Sentiment": "positive",
            "PublishDate": 1754127201882,
            "Source": "stock"
        },
        {
            "Title": "Jash Engineering Opens New Manufacturing Facility Near Chennai",
            "Summary": "Jash Engineering has announced the opening of a new manufacturing facility and office called Shivpad. The facility is located in SIPCOT Vallam Vadagal, near Chennai.",
            "Sentiment": "positive",
            "PublishDate": 1752126875000,
            "Source": "default"
        },
        {
            "Title": "Jash Engineering Secures New Orders Worth ₹36 Crore",
            "Summary": "Jash Engineering has received new orders valued at ₹36 crore in May. Following this acquisition, the company's total order book now stands at ₹827 crore.",
            "Sentiment": "positive",
            "PublishDate": 1749531146000,
            "Source": "default"
        },
        {
            "Title": "Jash Engineering Reports FY 24-25 Revenue and Expansion Plans",
            "Summary": "Jash Engineering announced unaudited revenue of 7.35 billion rupees for FY 24-25 and projected revenue of 8.60 billion rupees for FY 25-26. The company plans to enhance its US manufacturing capacity to cater to growing US business and to meet the BABA Act deadline by 2029. Jash Engineering expects minimal impact from increased tariffs due to its existing US manufacturing facility.",
            "Sentiment": "positive",
            "PublishDate": 1744329956000,
            "Source": "earnings"
        },
        {
            "Title": "Jash Engineering Plans to Expand US Manufacturing Capacity",
            "Summary": "Jash Engineering announces plans to enhance its manufacturing capacity in the United States to meet growing business demands. The company states it will not be significantly affected by increased tariffs due to its existing US manufacturing facility. Jash Engineering aims to ramp up production in the USA to comply with the BABA (Build America, Buy America) Act deadline by 2029.",
            "Sentiment": "positive",
            "PublishDate": 1744286316000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jash Engineering Reports FY 24-25 Revenue and Projects FY 25-26 Revenue",
            "Summary": "Jash Engineering has reported an unaudited revenue of 7.35 billion rupees for the fiscal year 2024-2025. The company has also projected its revenue for the fiscal year 2025-2026 to be 8.60 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1744286307000,
            "Source": "earnings"
        },
        {
            "Title": "Jash Engineering Anticipates Accelerated Revenue Growth",
            "Summary": "Jash Engineering has announced that they are expecting to reach a revenue of Rs 1000 crores by the financial year 2026-27, which is earlier than their previous projection of 2027-28. This indicates a faster rate of growth than initially planned.",
            "Sentiment": "positive",
            "PublishDate": 1743500525000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jash Engineering Reports 37% Revenue Growth in FY 2023-24",
            "Summary": "Jash Engineering has announced a significant increase in its consolidated revenue for the financial year 2023-24. The company achieved revenue exceeding Rs 710 crores, compared to Rs 516 crores in the previous year, representing a growth of over 37%.",
            "Sentiment": "positive",
            "PublishDate": 1743500409000,
            "Source": "earnings"
        },
        {
            "Title": "Jash Engineering Receives Orders Worth 400 Million Rupees",
            "Summary": "Jash Engineering has reported receiving consolidated orders valued at 400 million rupees for February 2025.",
            "Sentiment": "positive",
            "PublishDate": 1741585670000,
            "Source": "order&deals"
        },
        {
            "Title": "Jash Engineering Reports Strong Order Book of ₹924 Crore",
            "Summary": "As of January 1, 2025, Jash Engineering has announced a consolidated order book position of ₹924 crore. The company's market capitalization stands at ₹3,600 crore.",
            "Sentiment": "positive",
            "PublishDate": 1736486140000,
            "Source": "order&deals"
        },
        {
            "Title": "Jash Engineering Secures Orders Worth ₹80 Crore",
            "Summary": "Jash Engineering has announced that it has received consolidated orders worth ₹80 crore, to be fulfilled by December 2024.",
            "Sentiment": "positive",
            "PublishDate": 1736486088000,
            "Source": "order&deals"
        },
        {
            "Title": "Jash Engineering Secures Orders Worth Rs 113 Crore",
            "Summary": "Jash Engineering has announced that it has negotiated consolidated orders worth Rs 113 crore with its clients. This development indicates potential growth in the company's order book and future revenue prospects.",
            "Sentiment": "positive",
            "PublishDate": 1733807196000,
            "Source": "order&deals"
        },
        {
            "Title": "Jash Engineering Secures Order Worth 70 Crore Rupees in November",
            "Summary": "Jash Engineering has announced that it has won an order valued at 70 crore rupees during the month of November. This significant order represents a positive development for the company's business operations.",
            "Sentiment": "positive",
            "PublishDate": 1733807154000,
            "Source": "order&deals"
        },
        {
            "Title": "Jash Engineering: Targets Rs 900-Crore Order Book for FY26",
            "Summary": "Jash Engineering expects to start FY26 with a Rs 900-crore order book to meet revenue targets of Rs 675 crore. Q2 revenue jumped 47% YoY to Rs 139.58 crore, with net profit up 89% to Rs 16.18 crore. CMD Pratik Patel projects EBITDA margins of 21-23% and PAT margins of 12-13% annually. The company plans to commission two new plants in FY25 and expand its US facility, funded mainly through internal sources.",
            "Sentiment": "positive",
            "PublishDate": 1731820373000,
            "Source": "result"
        },
        {
            "Title": "Jash Engineering: Strong Order Book Growth and 1:5 Stock Split",
            "Summary": "Jash Engineering reported a consolidated order book of Rs. 873 crore as of November 1, 2024, with Rs. 551 crore from international orders. The company secured Rs. 45 crore in new orders in October 2024. A 1:5 stock split was approved, changing share face value from Rs. 10 to Rs. 2.",
            "Sentiment": "positive",
            "PublishDate": 1731412700000,
            "Source": "corporate_action"
        }
    ]
}