{
    "Symbol": "JAYAGROGN",
    "ISIN": "INE785A01026",
    "News": [
        {
            "Title": "Jayant Agro-Organics Board Meet Set for Feb 6, 2026",
            "Summary": "Jayant Agro-Organics Limited has scheduled a board meeting on February 06, 2026, to approve Q3FY26 unaudited financial results. Trading window remains closed until February 10, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769787870615,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jayant Agro-Organics Reports Mixed Performance in Q2 FY2026 Results",
            "Summary": "Jayant Agro-Organics Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. On a standalone basis, the company reported revenue from operations of ₹25,366.34 lakhs for the quarter, down from ₹33,101.78 lakhs in the previous quarter and ₹29,421.81 lakhs in the same quarter last year. Net profit after tax stood at ₹1,232.79 lakhs compared to ₹1,623.14 lakhs in the previous quarter and ₹1,519.48 lakhs in the corresponding quarter of the previous year. On a consolidated basis, revenue from operations was ₹49,959.65 lakhs for the quarter versus ₹67,217.44 lakhs in the previous quarter and ₹59,804.60 lakhs in the same quarter last year. Consolidated net profit after tax was ₹921.24 lakhs compared to ₹1,635.99 lakhs in the previous quarter and ₹1,329.92 lakhs in the year-ago quarter. The company operates in three segments: Castor Oil, Castor Oil Derivatives, and Power Generation. Basic earnings per share on a consolidated basis was ₹3.22 for the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762605961853,
            "Source": "earnings"
        },
        {
            "Title": "Jayant Agro-Organics Approves Unaudited Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Jayant Agro-Organics Limited's Board of Directors approved the unaudited financial results for the quarter ended June 30, 2025, covering both standalone and consolidated financials. The company submitted these results along with a limited review report from statutory auditors M/s. T.P. Ostwal & Associates LLP. The board meeting was held on July 26, 2025, commencing at 12:00 p.m. and concluding at 2:30 p.m. The company manufactures and exports castor oil and its products.",
            "Sentiment": "neutral",
            "PublishDate": 1753530596459,
            "Source": "earnings"
        },
        {
            "Title": "Jayant Agro Organics Reports Significant Increase in Q3 Profit and Revenue",
            "Summary": "Jayant Agro Organics has announced its Q3 financial results, showing substantial year-over-year growth. The company's consolidated net profit rose to 142 million rupees, up from 93 million rupees in the same quarter last year. Revenue also saw a notable increase, reaching 5.8 billion rupees compared to 4.3 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739146209000,
            "Source": "earnings"
        },
        {
            "Title": "Jayant Agro Organics Reports Significant Increase in Q3 EBITDA",
            "Summary": "Jayant Agro Organics has reported a substantial year-over-year improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) rose to 269 million rupees, up from 181 million rupees in the same period last year. Additionally, the EBITDA margin expanded significantly to 4.64% from 0.21% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739012993000,
            "Source": "earnings"
        },
        {
            "Title": "Jayant Agro Organics Reports Significant Increase in Q3 Profit and Revenue",
            "Summary": "Jayant Agro Organics has announced its Q3 financial results, showing substantial year-over-year growth. The company's consolidated net profit rose to 142 million rupees, up from 93 million rupees in the same quarter last year. Revenue also saw a significant increase, reaching 5.8 billion rupees compared to 4.3 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739012988000,
            "Source": "earnings"
        },
        {
            "Title": "Jayant Agro-organics Receives Customs Order Worth 114.9 Million Rupees",
            "Summary": "Jayant Agro-organics, an Indian company, has received a customs order valued at 114.9 million rupees (approximately $1.38 million USD). This order represents a significant business transaction for the company, potentially impacting its revenue and operations.",
            "Sentiment": "positive",
            "PublishDate": 1736122122000,
            "Source": "order&deals"
        },
        {
            "Title": "Jayant Agro-Organics Receives Customs Order Worth 114.9 Million Rupees",
            "Summary": "Jayant Agro-Organics has been awarded a customs order valued at 114.9 million rupees. This order represents a significant business opportunity for the company and may have a positive impact on its financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1735914942000,
            "Source": "order&deals"
        },
        {
            "Title": "Jayant Agro Organics Reports Q2 Profit and Revenue Growth",
            "Summary": "Jayant Agro Organics has announced its Q2 financial results. The company's net profit increased to 152 million rupees, up from 124 million rupees in the same quarter last year. Revenue also saw growth, reaching 2.94 billion rupees compared to 2.57 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1729929822000,
            "Source": "result"
        }
    ]
}