{
    "Symbol": "JAYBARMARU",
    "ISIN": "INE571B01036",
    "News": [
        {
            "Title": "Jay Bharat Maruti Q3FY26 Results & Board Updates",
            "Summary": "Jay Bharat Maruti reports strong Q3FY26 performance with revenue of ₹64,549.43 lakhs and profit after tax of ₹1,790.48 lakhs. Board approves additional capex of ₹130 crore and key director appointment.",
            "Sentiment": "positive",
            "PublishDate": 1770390864861,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jay Bharat Maruti Director Rajiv Gandhi Resigns",
            "Summary": "Jay Bharat Maruti Limited announces resignation of Nominee Director Mr. Rajiv Gandhi effective February 05, 2026, to enable MSIL to appoint new nominee director in his place.",
            "Sentiment": "neutral",
            "PublishDate": 1769864119957,
            "Source": "stocks"
        },
        {
            "Title": "Jay Bharat Maruti clarifies volume surge",
            "Summary": "Jay Bharat Maruti Limited responds to BSE inquiry about significant trading volume increase, stating no undisclosed price-sensitive information exists and attributing volume surge to market conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1767601912165,
            "Source": "stocks"
        },
        {
            "Title": "Jay Bharat Maruti Reports Strong Q2 Performance with Net Profit Surge to 184 Million Rupees",
            "Summary": "Jay Bharat Maruti delivered robust quarterly results with net profit jumping to 184 million rupees from 30 million rupees year-over-year. The company's EBITDA increased significantly to 614 million rupees compared to 340 million rupees in the same period last year. EBITDA margin improved substantially to 10.54% from 6.14% year-over-year. Revenue grew to 5.8 billion rupees versus 5.55 billion rupees in the previous year period.",
            "Sentiment": "positive",
            "PublishDate": 1762420606660,
            "Source": "earnings"
        },
        {
            "Title": "JBM Auto Reports Strong Q1 Results with 2,307 Crore Profit, Sets AGM Date for September 3",
            "Summary": "JBM Auto Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing a profit after tax of Rs 2,307.12 crore on standalone basis and Rs 2,328.81 crore on consolidated basis. Revenue from operations stood at Rs 55,683.24 crore for both standalone and consolidated results. The company's earnings per share increased to Rs 2.13 from Rs 0.50 in the same quarter last year. Revenue from operations included an incentive of Rs 53.20 crore related to investment in Gujarat under the state's Industrial Policy 2015. The Board scheduled the 38th Annual General Meeting for September 3, 2025 via video conferencing, with the record date set for August 27, 2025. The Board also authorized key managerial personnel to decide on potential securities issuance including public offerings, private placements, or qualified institutional placements, subject to shareholder approval at the AGM.",
            "Sentiment": "positive",
            "PublishDate": 1754042743816,
            "Source": "earnings"
        },
        {
            "Title": "Jay Bharat Maruti Reports Strong Q1 Performance with 75% Jump in Net Profit",
            "Summary": "Jay Bharat Maruti delivered robust quarterly results with consolidated net profit surging to 233 million rupees from 54 million rupees year-over-year. The company's EBITDA nearly doubled to 658 million rupees compared to 377 million rupees in the same period last year. EBITDA margin expanded significantly to 11.82% from 7.06% year-over-year, indicating improved operational efficiency. Revenue grew to 5.6 billion rupees from 5.33 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754042350927,
            "Source": "earnings"
        },
        {
            "Title": "Jay Bharat Maruti Reports Improved Q4 Financial Results",
            "Summary": "Jay Bharat Maruti has reported its Q4 financial results. The company's EBITDA increased to 577 million rupees from 432.6 million rupees year-over-year. The EBITDA margin improved to 9.45% from 7.23% in the same period last year. Revenue rose to 6.1 billion rupees from 5.98 billion rupees year-over-year. Net profit for the quarter increased to 196 million rupees from 111.2 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747903900000,
            "Source": "result"
        },
        {
            "Title": "Jay Bharat Maruti Increases Stake in JBM Ogihara Die-Tech",
            "Summary": "Jay Bharat Maruti has acquired an additional 10% stake in JBM Ogihara Die-Tech for 31.4 million rupees. This acquisition increases Jay Bharat Maruti's total stake in JBM Ogihara Die-Tech to 49%.",
            "Sentiment": "positive",
            "PublishDate": 1741264017000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jay Bharat Maruti Reports Q3 Financial Results",
            "Summary": "Jay Bharat Maruti has announced its Q3 financial results. The company's net profit for the quarter stands at 38.5 million rupees, showing a decrease from 65 million rupees year-over-year and an increase from 29.9 million rupees quarter-over-quarter. Revenue for Q3 is reported at 5.9 billion rupees, up from 5.47 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738284332000,
            "Source": "earnings"
        },
        {
            "Title": "Jay Bharat Maruti Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Jay Bharat Maruti has reported a decrease in its Q3 EBITDA to 351.7 million rupees, down from 405.6 million rupees in the same quarter last year. The company's EBITDA margin also declined to 5.95% from 7.41% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738238124000,
            "Source": "earnings"
        },
        {
            "Title": "Jay Bharat Maruti Reports Q3 Revenue Increase",
            "Summary": "Jay Bharat Maruti has announced its third-quarter revenue results. The company reported revenue of 5.9 billion rupees, compared to 5.47 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738238103000,
            "Source": "earnings"
        },
        {
            "Title": "Jay Bharat Maruti Reports Decline in Q3 Net Profit",
            "Summary": "Jay Bharat Maruti has reported a net profit of 38.5 million rupees for the third quarter, showing a year-over-year decrease from 65 million rupees. However, the profit has increased quarter-over-quarter from 29.9 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1738238095000,
            "Source": "earnings"
        },
        {
            "Title": "Jay Bharat Maruti Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Jay Bharat Maruti has reported a decrease in its Q2 EBITDA, which fell to 340 million rupees from 452 million rupees year-over-year. The company's EBITDA margin also declined to 6.14% from 7.38% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730886694000,
            "Source": "result"
        },
        {
            "Title": "Jay Bharat Maruti Reports Q2 Revenue Decline",
            "Summary": "Jay Bharat Maruti, an Indian automotive component manufacturer, has reported its second-quarter revenue for the current fiscal year. The company's revenue stood at 5.55 billion rupees, down from 6.1 billion rupees in the same quarter of the previous year, indicating a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1730886655000,
            "Source": "result"
        },
        {
            "Title": "Jay Bharat Maruti Reports Decline in Q2 Net Profit",
            "Summary": "Jay Bharat Maruti, an Indian automotive components manufacturer, has reported a net profit of 30 million rupees for the second quarter, down from 87 million rupees in the same period last year. This represents a significant year-over-year decrease in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1730886610000,
            "Source": "result"
        }
    ]
}