{
    "Symbol": "JAYKAY",
    "ISIN": "INE903A01025",
    "News": [
        {
            "Title": "Jaykay Enterprises Issues ₹40 Cr Corporate Guarantee",
            "Summary": "Jaykay Enterprises Limited issued a corporate guarantee of ₹40 crores to Axis Bank for securing credit facilities of JK Phillips LLP, its 50:50 joint venture with Phillips Machine Tools India.",
            "Sentiment": "neutral",
            "PublishDate": 1767356027149,
            "Source": "stocks"
        },
        {
            "Title": "Jaykay Enterprises JV Wins ₹162.25 Cr IRCON Order",
            "Summary": "Jaykay Enterprises' joint venture J K Phillips LLP secures major contract from IRCON International for CNC machines supply to MSME training centers across India.",
            "Sentiment": "positive",
            "PublishDate": 1765879069935,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jaykay Enterprises Invests Rs 2 Crore in Wholly-Owned Defence Subsidiary",
            "Summary": "Jaykay Enterprises Limited acquired 2,00,000 additional preference shares worth Rs 2,00,00,000 in JK Defence Aerospace Limited through a rights issue on December 09, 2025. The investment utilizes proceeds from the company's rights issue to fund the defence and aerospace subsidiary, which was incorporated in July 2023 and has yet to commence operations.",
            "Sentiment": "positive",
            "PublishDate": 1765274856310,
            "Source": "corporate_action"
        },
        {
            "Title": "Jaykay Enterprises Announces National Stock Exchange Listing",
            "Summary": "Jaykay Enterprises has unveiled its listing on the National Stock Exchange of India. The listing provides the company access to public capital markets and offers investors an opportunity to participate in the company's equity.",
            "Sentiment": "positive",
            "PublishDate": 1764743429620,
            "Source": "stock"
        },
        {
            "Title": "Jaykay Enterprises Limited Receives NSE Listing and Trading Approval",
            "Summary": "Jaykay Enterprises Limited has received listing and trading approval from the National Stock Exchange of India for 13,02,87,066 equity shares of face value Re. 1/- each on the Main Board. The company's equity shares will be listed and traded on NSE with effect from December 03, 2025, under the symbol JAYKAY, marking an important milestone for enhancing market presence and investor outreach.",
            "Sentiment": "positive",
            "PublishDate": 1764592376299,
            "Source": "corporate_action"
        },
        {
            "Title": "Jaykay Enterprises Seeks Shareholder Approval for Rs 1,650 Crore Related Party Transactions",
            "Summary": "Jaykay Enterprises has issued a postal ballot notice seeking shareholder approval for 11 material related party transactions worth Rs 150 crore each with subsidiaries including JK Phillips LLP, Allen Reinforced Plastics Limited, and Neumesh Labs Private Limited for financial year 2025-26. The transactions involve sale/purchase of goods, services, inter-corporate deposits, and loans to support operational efficiency and business growth across the company's defense, aerospace, and digital manufacturing segments.",
            "Sentiment": "neutral",
            "PublishDate": 1764074260481,
            "Source": "corporate_action"
        },
        {
            "Title": "Jaykay Enterprises Reports Strong Half-Year Performance Despite Misappropriation Issues at Subsidiary",
            "Summary": "Jaykay Enterprises Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. The company reported a net profit of Rs 308.79 lakhs for the quarter and Rs 1,635.13 lakhs for the half-year. Total revenue reached Rs 2,345.59 lakhs for the quarter and Rs 4,346.72 lakhs for the half-year. However, the auditors issued a qualified opinion due to misappropriation of funds and trade receivables worth Rs 152.99 lakhs by an ex-director of subsidiary Neumesh Labs Private Limited. The company has filed an FIR and believes the amount will be recovered without requiring provisions. The company's financial assets constitute more than 50% of total assets, bringing it under Section 45-IA of the Reserve Bank of India Act, though management believes registration is not required as the company is primarily engaged in digital manufacturing and aerospace sector operations. Basic earnings per share stood at Rs 0.47 for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762911378180,
            "Source": "earnings"
        },
        {
            "Title": "Jaykay Enterprises Reports Strong Q2 Performance with Revenue Doubling Year-over-Year",
            "Summary": "Jaykay Enterprises delivered robust Q2 results with consolidated net profit surging to 85 million rupees from 4.2 million rupees in the same quarter last year. Revenue doubled to 631 million rupees compared to 308 million rupees year-over-year. The company's EBITDA grew significantly to 110 million rupees from 31 million rupees, while EBITDA margin expanded to 17.49% from 9.93% in the corresponding period last year.",
            "Sentiment": "positive",
            "PublishDate": 1762871967143,
            "Source": "earnings"
        },
        {
            "Title": "JK Phillips LLP Executes Rs 6.97 Crore Bank Guarantee for Ircon International Project",
            "Summary": "JK Phillips LLP, a 50:50 joint venture between Jaykay Enterprises Limited and Phillips Machine Tools India Private Limited, executed a Counter Bank Guarantee worth Rs 6.97 crore with State Bank of India. This facilitated SBI issuing a Letter of Guarantee to Ircon International Limited for work awarded through a Letter of Award dated September 24, 2025. The project involves design, supply, installation, commissioning, and training of plant and machinery for MSME Training Centres across India on a turnkey basis. The performance bank guarantee expires on October 15, 2027, and is secured against a Fixed Deposit Receipt from JK Phillips LLP.",
            "Sentiment": "neutral",
            "PublishDate": 1760617466027,
            "Source": "order&deals"
        },
        {
            "Title": "Jaykay Enterprises Invests Rs 36 Crore in Subsidiary JK Defence & Aerospace Through Rights Issue",
            "Summary": "Jaykay Enterprises has purchased additional preference shares worth Rs 36 crore in its subsidiary JK Defence & Aerospace Ltd through a rights issue. This transaction represents an investment by the parent company to increase its stake in the defense and aerospace subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1760061998348,
            "Source": "corporate_action"
        },
        {
            "Title": "Jaykay Enterprises' Step-Down Subsidiary Secures Rs. 9.16 Crore Order from Bharat Dynamics",
            "Summary": "Allen Reinforced Plastics Limited, a step-down subsidiary of Jaykay Enterprises Limited, received a second definitive order worth approximately Rs. 9.16 crores (including GST) from Bharat Dynamics Limited for manufacturing Packing Boxes. This follows a previous order of Rs. 6.74 crores received in September, both stemming from an initial communication valued at Rs. 15.90 crores received in August. The order is domestic in nature and does not involve any related party transactions or promoter group interests.",
            "Sentiment": "positive",
            "PublishDate": 1759043428466,
            "Source": "order&deals"
        },
        {
            "Title": "Allen Reinforced Plastics Receives Rs 6.74 Crore Order from Bharat Dynamics Limited",
            "Summary": "Allen Reinforced Plastics Limited, a step-down subsidiary of Jaykay Enterprises Limited, has received a definitive order worth approximately Rs 6.74 crores (including GST) from Bharat Dynamics Limited for manufacturing launcher tubes. This order is part of a larger communication previously announced in August valued at Rs 15.90 crores. The order is domestic in nature and will be executed as per the terms and conditions specified. There is no promoter or group company interest in the entity awarding the order, and it does not constitute a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1758888850020,
            "Source": "order&deals"
        },
        {
            "Title": "J K Phillips LLP Secures Rs. 139.48 Crore Order from Ircon International for MSME Training Centers",
            "Summary": "J K Phillips LLP, a 50:50 joint venture between Jaykay Enterprises Limited and Phillips Machine Tools India Private Limited, received an order worth Rs. 139.48 crores from Ircon International Limited. The contract involves design, supply, installation, commissioning, and training of conventional machineries for MSME training centers across India on a turnkey basis. Key equipment includes CNC EDMs, CMM EDMs, and 3D printers. The project has a completion period of 240 days from September 24, 2025. The contract aims to support capacity building and digital transformation of MSMEs as part of the government's Viksit Bharat initiative to make India a developed nation by 2047.",
            "Sentiment": "positive",
            "PublishDate": 1758734217168,
            "Source": "order&deals"
        },
        {
            "Title": "Jaykay Enterprises Secures ₹94.45 Crore Contract from BrahMos Aerospace",
            "Summary": "Jaykay Enterprises has received a Letter of Intent (LOI) from BrahMos Aerospace Pvt Ltd valued at approximately ₹94.45 crores. This contract award represents a significant business development for Jaykay Enterprises in the aerospace sector.",
            "Sentiment": "positive",
            "PublishDate": 1758188077320,
            "Source": "order&deals"
        },
        {
            "Title": "Jaykay Enterprises Subsidiary Signs Technology Transfer Deal for 3D-Printed Orthopedic Implants",
            "Summary": "JK Digital & Advance Systems Private Limited, a wholly owned subsidiary of Jaykay Enterprises Limited, executed a Transfer of Technology Agreement on September 09, 2025, with Central Scientific Instruments Organisation, Chandigarh for indigenous manufacturing of advanced 3D-printed lattice orthopedic implants using additive manufacturing technology. The agreement covers seven orthopedic implant technologies for spinal and hip surgeries, including TLIF, PLIF, Buttress & Shim Augments, Shell & Wedge Augments, Lattice Cones, Cage Constructs, and Lattice Acetabular Cups. The deal grants rights to utilize the technology for 7 years and aims to reduce reliance on imports while supporting the Make in India initiative in healthcare. This positions Jaykay Enterprises as one of the first Indian companies to offer indigenously manufactured 3D-printed lattice medical implants at affordable costs.",
            "Sentiment": "positive",
            "PublishDate": 1757488362108,
            "Source": "stock"
        },
        {
            "Title": "Allen Reinforced Plastics Receives Rs. 110.35 Crores Worth Letters of Intent from Defense Companies",
            "Summary": "Allen Reinforced Plastics Limited, a step-down subsidiary of Jaykay Enterprises Limited, has received Letters of Intent from two defense companies. BrahMos Aerospace Private Limited issued an LOI valued at approximately Rs. 94.45 crores for manufacturing composite parts, while Bharat Dynamics Limited provided an LOI worth approximately Rs. 15.90 crores for making composite air frames and launcher tubes. Both amounts include GST. The LOIs are expected to strengthen Allen's project pipeline and contribute to future revenues once converted into definitive orders. The orders are domestic in nature and execution timelines will be determined when the LOIs convert to definitive contracts.",
            "Sentiment": "positive",
            "PublishDate": 1754909866497,
            "Source": "order&deals"
        },
        {
            "Title": "Jaykay Enterprises' Subsidiary Allen Reinforced Plastics Receives Orders Worth Rs. 110.35 Crores",
            "Summary": "Jaykay Enterprises Limited submitted its monitoring agency report for the quarter ended June 30, 2025, detailing the utilization of proceeds from its Rights Issue. The report by Acuite Ratings & Research Limited showed deviations of 10-25% in certain objects, with JK Defence Other Miscellaneous expenses exceeding original allocation by 26.61% and Issue Expenses by 8.05%. The company has utilized Rs. 85.75 crores out of the total Rs. 146.14 crores raised, with Rs. 60.40 crores remaining unutilized. Additionally, Allen Reinforced Plastics Limited, a step-down subsidiary, received Letters of Intent from BrahMos Aerospace Private Limited worth approximately Rs. 94.45 crores and from Bharat Dynamics Limited worth approximately Rs. 15.90 crores, both including GST. These potential orders are expected to strengthen Allen's project pipeline and contribute to future revenues.",
            "Sentiment": "positive",
            "PublishDate": 1754664792997,
            "Source": "corporate_action"
        },
        {
            "Title": "Jaykay Enterprises Reports Strong Q1 Growth with Net Profit Rising to 202M Rupees",
            "Summary": "Jaykay Enterprises reported consolidated net profit of 202 million rupees in Q1, compared to 46 million rupees in the same period last year. The company's revenue increased to 774 million rupees from 236 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754662774971,
            "Source": "earnings"
        },
        {
            "Title": "Abhishek Singhania Group Acquires 78.93 Lakh Shares in Jaykay Enterprises Through Preferential Allotment",
            "Summary": "Abhishek Singhania and associated parties acquired 78,93,829 equity shares of Jaykay Enterprises Limited through preferential allotment approved by the company's board on July 28, 2025. The acquisition involved Abhishek Singhania (78,79,646 shares) and Varsha Singhania (14,183 shares), along with 47 persons acting in concert including various Singhania family members and related companies. Following this acquisition, the combined holding of acquirers and associated parties increased from 62.89% to 65.13% of the company's total voting capital. The company's equity share capital expanded from Rs. 12.24 crore to Rs. 13.03 crore, comprising 13,02,87,066 equity shares of Re. 1 each. The transaction was part of a larger preferential allotment of 79,17,936 equity shares to promoter and non-promoter categories.",
            "Sentiment": "neutral",
            "PublishDate": 1753936300653,
            "Source": "corporate_action"
        },
        {
            "Title": "JAYKAY ENTERPRISES Acquires Preference Shares in JK DEFENCE",
            "Summary": "JAYKAY ENTERPRISES has purchased 13,00,000 preference shares in JK DEFENCE. The acquisition is valued at 130 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1747653780000,
            "Source": "default"
        },
        {
            "Title": "JK Digital and AIIMS Collaborate on Neurosurgical Instruments",
            "Summary": "Jaykay Enterprises' subsidiary, JK Digital, has entered into a collaboration with the All India Institute of Medical Sciences (AIIMS) to develop neurosurgical instruments. This partnership aims to combine JK Digital's technological expertise with AIIMS' medical knowledge to create innovative tools for neurosurgery.",
            "Sentiment": "positive",
            "PublishDate": 1746807452000,
            "Source": "default"
        },
        {
            "Title": "JK Defence Secures Industrial Land Allotment in Lucknow",
            "Summary": "JK Defence, a subsidiary of Jaykay Enterprises, has received the final allotment letter for industrial land in Lucknow. This development suggests potential expansion or new operations for the company in the defense sector.",
            "Sentiment": "positive",
            "PublishDate": 1745501711000,
            "Source": "default"
        },
        {
            "Title": "JAYKAY ENTERPRISES Approves Share Issuance",
            "Summary": "JAYKAY ENTERPRISES has approved the issuance of 7.9 million shares at a price of 142 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1744717656000,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Tech and Inveniam Partner to Innovate Alternative Investments",
            "Summary": "JK Tech, a subsidiary of Jaykay Enterprises, has formed a strategic partnership with Inveniam to revolutionize the alternative investments sector using blockchain and AI technologies. This collaboration aims to enhance transparency, efficiency, and accessibility in the alternative investment market.",
            "Sentiment": "positive",
            "PublishDate": 1744702962000,
            "Source": "corporate_action"
        },
        {
            "Title": "JAYKAY ENTERPRISES Acquires Shares of JK TECHNOSOFT",
            "Summary": "JAYKAY ENTERPRISES has approved the acquisition of shares in JK TECHNOSOFT for a sum of 1.12 billion rupees. This corporate action represents a significant investment and potential expansion of JAYKAY ENTERPRISES' portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1744373198000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jaykay Enterprises' Unit JK Defence Acquires 5 Acres of Land in Karnataka",
            "Summary": "JK Defence, a unit of Jaykay Enterprises, has taken possession of 5 acres of land from the Karnataka Industrial Areas Development Board (KIADB). This acquisition suggests potential expansion or new industrial development plans for the company in Karnataka.",
            "Sentiment": "positive",
            "PublishDate": 1741220844000,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Defence Acquires 5 Acres of Land from KIADB",
            "Summary": "JK Defence, a unit of Jaykay Enterprises, has taken possession of 5 acres of land from the Karnataka Industrial Areas Development Board (KIADB). This acquisition suggests potential expansion or new development plans for the company's defence-related operations in Karnataka.",
            "Sentiment": "positive",
            "PublishDate": 1741174620000,
            "Source": "corporate_action"
        }
    ]
}