{
    "Symbol": "JAYNECOIND",
    "ISIN": "INE854B01010",
    "News": [
        {
            "Title": "Jayaswal Neco Signs PLI Scheme MOU with Steel Ministry",
            "Summary": "Jayaswal Neco Industries signed MOU with Ministry of Steel for PLI Scheme 1.2, committing Rs. 45.08 crores investment to boost specialty steel production capacity by 80,000 TPA by FY 29-30.",
            "Sentiment": "positive",
            "PublishDate": 1770717710339,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jayaswal Neco Signs ₹12,262 Cr Steel Plant MOU",
            "Summary": "Jayaswal Neco Industries signed MOU with Maharashtra govt for 2 million tonnes integrated steel plant at Gadchiroli with ₹12,262 crores investment and 2600 jobs.",
            "Sentiment": "positive",
            "PublishDate": 1769515178623,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jayaswal Neco Promoters Create New Pledge on 55.08% Stake",
            "Summary": "Jayaswal Neco Industries promoters agreed to create pledge on 53.48 crore equity shares representing 55.08% stake in favor of debenture trustee Vistra ITCL on December 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766208865493,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jayaswal Neco Industries Approves INR 1,800 Crore NCD Issuance",
            "Summary": "Jayaswal Neco Industries' Committee of Directors approved the issuance of up to 1,80,000 unlisted, secured, redeemable Non-Convertible Debentures worth INR 1,800 crores with a face value of INR 1 lakh each. The NCDs carry a 12.50% annual coupon rate compounded monthly, with allotment scheduled for December 12, 2025, and maturity on November 23, 2031, secured by company assets and promoter guarantees.",
            "Sentiment": "neutral",
            "PublishDate": 1765005869761,
            "Source": "corporate_action"
        },
        {
            "Title": "Jayaswal Neco Industries to Consider 18 Billion Rupee Debenture Fundraising",
            "Summary": "Jayaswal Neco Industries will consider raising funds up to 18 billion rupees through debentures on December 5. The board meeting will evaluate this debt fundraising proposal which could provide significant capital for the company's operations.",
            "Sentiment": "positive",
            "PublishDate": 1764719993469,
            "Source": "stock"
        },
        {
            "Title": "Jayaswal Neco Industries Shareholders Approve Key Board Appointments Through Postal Ballot",
            "Summary": "Jayaswal Neco Industries shareholders approved five resolutions through postal ballot voting, including re-appointments of Arvind Jayaswal as Chairman and Whole-time Director and Ramesh Jayaswal as Managing Director effective January 1, 2026. The company also secured approvals for appointments of Anand Jayaswal as Non-Executive Director and Avneesh Jayaswal as Director and Executive Director, with all resolutions passing with over 99% approval rates.",
            "Sentiment": "positive",
            "PublishDate": 1764665338080,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jayaswal Neco Industries Delivers Multibagger Returns After Avoiding Bankruptcy Through Debt Restructuring",
            "Summary": "Jayaswal Neco Industries, a 50-year-old integrated steel company, avoided bankruptcy through debt restructuring and operational reforms, reducing secured debt from Rs 5,759 crore in March 2020 to Rs 2,721 crore by March 2025. The company delivered multibagger returns with shares rising from Rs 35 to Rs 75 in seven months, while net sales rose 29% to Rs 3,430 crore and PAT jumped from a loss of Rs 66 crore to a profit of Rs 198 crore in the first half of FY26.",
            "Sentiment": "positive",
            "PublishDate": 1763278673749,
            "Source": "stock"
        },
        {
            "Title": "Jayaswal Neco Industries Seeks Shareholder Approval for Key Leadership Appointments via Postal Ballot",
            "Summary": "Jayaswal Neco Industries Limited has issued a postal ballot notice seeking shareholder approval for five key leadership appointments effective January 2026. The company proposes re-appointing Arvind Jayaswal as Chairman and Whole Time Director for three years with monthly compensation increasing from Rs 31.66 lakh to Rs 45.60 lakh by 2028, plus up to 3% commission on net profits. Ramesh Jayaswal's re-appointment as Managing Director includes identical compensation terms. The ballot also covers appointing Anand Jayaswal as Non-Executive Director and Avneesh Jayaswal as Director and Executive Director with monthly compensation ranging from Rs 13.33 lakh to Rs 19.20 lakh. All appointees are from the Jayaswal family. Remote e-voting is scheduled from November 1-30, 2025, with results to be declared within two working days. The cut-off date for eligible voters is October 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761636668620,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jayaswal Neco Industries Reports Strong Q2 Turnaround with 1.05 Billion Rupees Net Profit",
            "Summary": "Jayaswal Neco Industries posted a net profit of 1.05 billion rupees in Q2, marking a significant turnaround from a loss of 342 million rupees in the same period last year. The company's revenue grew to 17.8 billion rupees compared to 12.3 billion rupees year-over-year. EBITDA increased to 3.3 billion rupees from 1.7 billion rupees, while EBITDA margin improved to 18.36% from 13.78% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1760918844885,
            "Source": "earnings"
        },
        {
            "Title": "Jayaswal Neco Industries Reports Strong Q2 Performance and Announces Key Leadership Changes",
            "Summary": "Jayaswal Neco Industries Limited reported quarterly results for the quarter ended September 30, 2025, showing revenue from operations of Rs 1,781 crores compared to Rs 1,230 crores in the same quarter last year. The company posted a profit of Rs 105.13 crores for the quarter versus a loss of Rs 34.21 crores in the previous year quarter. For the half-year period, revenue reached Rs 3,430 crores against Rs 2,668 crores last year, with profit of Rs 198.15 crores compared to a loss of Rs 65.59 crores. The Board approved several leadership appointments effective January 1, 2026, including reappointment of Arvind Jayaswal as Chairman and Whole Time Director for three years, Ramesh Jayaswal as Managing Director for three years, and new appointments of Anand Jayaswal as Non-Executive Director and Avneesh Jayaswal as Whole Time Director. All appointments are subject to shareholder approval through postal ballot. The company also announced early redemption of outstanding Non-Convertible Debentures worth Rs 2,310 crores by December 14, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760702513544,
            "Source": "corporate_action"
        },
        {
            "Title": "Jayaswal Neco Industries Approves Early Redemption of INR 3,200 Crore Debentures",
            "Summary": "Jayaswal Neco Industries Limited approved the exercise of an early repayment option to fully redeem 3,200 non-convertible debentures worth INR 3,200 crores. The company's Committee of Directors made this decision and will repay the outstanding principal amount along with final accrued interest. The record date for redemption is set for December 5, 2025, with payment scheduled between December 9-12, 2025. The debentures have a face value of INR 1 lakh each and are secured, unrated, unlisted, and redeemable. The early repayment option can be exercised after 24 months from the deemed date of allotment, with the company required to provide four months' notice to the debenture trustee, Vistra ITCL (India) Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1754990585267,
            "Source": "corporate_action"
        },
        {
            "Title": "Delhi High Court Suspends Three-Year Prison Sentence of JNIL Managing Director in Coal Block Case",
            "Summary": "The Delhi High Court suspended the three-year imprisonment sentence of Shri Ramesh Jayaswal, Managing Director of Jayaswal Neco Industries Limited (JNIL), in a coal block allocation case. The CBI Special Court had convicted Jayaswal and awarded him three years imprisonment plus a fine of Rs 20 lakhs in connection with the allocation of coal blocks (Brinda, Sisai and Meral) in Jharkhand to Abhijeet Infrastructure Private Limited, where he served as Authorised Signatory. Jayaswal filed an appeal under the Bharatiya Nagarik Suraksha Sanhita, 2023, which was admitted by the Delhi High Court. The company stated there will be no direct financial impact on JNIL other than the fact that Jayaswal is its Managing Director.",
            "Sentiment": "neutral",
            "PublishDate": 1754308716075,
            "Source": "corporate_governance"
        },
        {
            "Title": "Delhi High Court Suspends Sentence of Jayaswal Neco Industries MD in Coal Block Case",
            "Summary": "The Delhi High Court has suspended the sentence imposed on Ramesh Jayaswal, Managing Director of Jayaswal Neco Industries Limited, by the Special CBI Court on December 11, 2024. The High Court's order was dated August 1, 2025, and relates to ongoing proceedings in a coal block case. This development follows a series of CBI court orders and High Court proceedings that the company has been disclosing to stock exchanges since December 2024.",
            "Sentiment": "positive",
            "PublishDate": 1754130077103,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jayaswal Neco Sees Large Block Trade Worth Rs 281.64 Crore on NSE",
            "Summary": "Jayaswal Neco witnessed a significant block trade on the National Stock Exchange involving approximately 65.5 million shares at Rs 43 per share. The transaction was executed through multiple blocks with a total value of Rs 281.64 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1753331496789,
            "Source": "order&deals"
        },
        {
            "Title": "Jayaswal Neco Industries Reports Strong Q1 Turnaround with 930M Rupees Net Profit",
            "Summary": "Jayaswal Neco Industries delivered a significant turnaround in Q1 results, posting a net profit of 930 million rupees compared to a loss of 317 million rupees in the same period last year. Revenue grew to 16.5 billion rupees from 14.38 billion rupees year-over-year. The company's EBITDA nearly doubled to 3.15 billion rupees from 1.65 billion rupees, while EBITDA margin expanded substantially to 19.07% from 11.47% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1752851979736,
            "Source": "earnings"
        },
        {
            "Title": "Jayaswal Neco Industries Reports Significant Profit Growth in Q4",
            "Summary": "Jayaswal Neco Industries has reported a substantial increase in net profit for the fourth quarter. The company's net profit rose to 1.02 billion rupees, up from 20.3 million rupees in the same quarter last year and 769.3 million rupees in the previous quarter. Revenue also increased to 16.75 billion rupees from 14.1 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1745799457000,
            "Source": "default"
        },
        {
            "Title": "Jayaswal Neco Industries Reports Strong Q4 Financial Results",
            "Summary": "Jayaswal Neco Industries has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 3.42 billion rupees from 2.33 billion rupees in the previous year, with EBITDA margin rising to 20.39% from 16.47%. Revenue grew to 16.75 billion rupees from 14.1 billion rupees. Net profit saw a substantial increase to 1.02 billion rupees, up from 20.3 million rupees year-over-year and 769.3 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745579966000,
            "Source": "result"
        },
        {
            "Title": "Jayaswal Neco Industries: Q3 Profit Dips 13.33% YoY Despite Revenue Growth",
            "Summary": "Jayaswal Neco Industries reported Q3 FY25 results with revenue up 6.47% YoY to ₹1656.84 crore, but profit down 13.33% YoY to ₹76.93 crore. QoQ performance improved with revenue up 34.7% and profit surging 324.88%. Operating income fell 15.37% YoY but rose 92.99% QoQ. EPS decreased to ₹0.79, down 13.19% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1737695920000,
            "Source": "earnings"
        },
        {
            "Title": "Jayaswal Neco Industries Reports Q3 Revenue Growth",
            "Summary": "Jayaswal Neco Industries has reported a revenue of 16.6 billion rupees for the third quarter, compared to 15.6 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737622129000,
            "Source": "earnings"
        },
        {
            "Title": "Jayaswal Neco Industries Reports Q3 Financial Results",
            "Summary": "Jayaswal Neco Industries has released its Q3 financial results. The company's EBITDA for the quarter stood at 2.6 billion rupees, compared to 2.9 billion rupees in the same quarter last year. The EBITDA margin decreased to 15.92% from 18.66% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1737622116000,
            "Source": "earnings"
        },
        {
            "Title": "Jayaswal Neco Industries Reports Q3 Net Profit of 769 Million Rupees",
            "Summary": "Jayaswal Neco Industries has reported a net profit of 769 million rupees for the third quarter, compared to 888 million rupees in the same period last year. This represents a year-over-year decrease in net profit.",
            "Sentiment": "neutral",
            "PublishDate": 1737622081000,
            "Source": "earnings"
        },
        {
            "Title": "CBI Convicts Jayaswal Neco Industries' MD in Coal Block Allocation Case",
            "Summary": "Jayaswal Neco Industries has reported that the Central Bureau of Investigation (CBI) has convicted the company's Managing Director in connection with the allocation of coal blocks in Jharkhand. This conviction is likely related to the ongoing investigations into the coal block allocation scam in India.",
            "Sentiment": "negative",
            "PublishDate": 1733812461000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jayaswal Neco Industries Reports Q2 Loss",
            "Summary": "Jayaswal Neco Industries Ltd reported a net loss of 342 million rupees in Q2, compared to a profit of 916 million rupees in the same quarter last year. The company's revenue decreased to 12.30 billion rupees from 15.01 billion rupees year-over-year. Compared to the previous quarter, the loss widened from 316 million rupees, and revenue declined from 14.37 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1730075003000,
            "Source": "result"
        }
    ]
}