{
    "Symbol": "JAYSREETEA",
    "ISIN": "INE364A01020",
    "News": [
        {
            "Title": "Jay Shree Tea Gets BBB-/Stable/A3 Credit Rating",
            "Summary": "Care Ratings reaffirms BBB-/Stable/A3 rating for Jay Shree Tea Industries' ₹376.25 crore facilities, citing strong promoter group, diversified revenue profile, and improved FY25 financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1765378084125,
            "Source": "stocks"
        },
        {
            "Title": "JayShree Tea Industries Reports Mixed Q2 Results with Tea Segment Growth Offsetting Sugar Losses",
            "Summary": "JayShree Tea Industries reported quarterly results for the period ended September 30, 2025. The company's tea segment generated revenue of ₹16,688 lakhs with a profit of ₹3,491 lakhs, while the sugar segment posted revenue of ₹6,405 lakhs but incurred losses of ₹666 lakhs. P&K Fertilisers manufacturing contributed ₹3,260 lakhs in revenue with ₹311 lakhs profit. Total revenue from operations reached ₹26,353 lakhs. The company reported a net profit of ₹1,905 lakhs from continuing operations for the quarter. For the half-year period, total revenue was ₹45,045 lakhs. The Board approved a final dividend of ₹0.50 per share for FY 2024-25, which was paid on August 19, 2025. The company's auditors noted concerns regarding non-provisioning of income tax liability during the quarter, stating this does not comply with accounting standards.",
            "Sentiment": "neutral",
            "PublishDate": 1762903444652,
            "Source": "earnings"
        },
        {
            "Title": "Jay Shree Tea & Industries Reports Mixed Q1 Results with Losses from Continuing Operations",
            "Summary": "Jay Shree Tea & Industries Ltd submitted its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported a net loss of ₹943 lakhs from continuing operations on standalone basis, compared to a loss of ₹851 lakhs in the same quarter last year. Revenue from operations stood at ₹15,911 lakhs versus ₹15,838 lakhs in the previous year quarter. The tea segment generated revenue of ₹8,248 lakhs, P&K Fertilisers ₹1,262 lakhs, and Sugar ₹9,142 lakhs. The company's auditors issued a qualified conclusion due to non-provisioning of income tax liability during the quarter, citing non-compliance with Indian Accounting Standards. The results were approved by the Board of Directors on August 12, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1754993498837,
            "Source": "earnings"
        },
        {
            "Title": "Jayshree Tea & Industries: Q3 Profit Soars 38,631% YoY to ₹73.59 Crore",
            "Summary": "Jayshree Tea & Industries reported Q3 FY25 results with revenue up 13.84% YoY to ₹234.77 crore. Net profit surged 38,631.58% YoY to ₹73.59 crore. EPS increased to ₹6.27, up 8,857.14% YoY. Operating income rose 107.32% YoY despite a 96.78% QoQ decline.",
            "Sentiment": "positive",
            "PublishDate": 1739653184000,
            "Source": "earnings"
        },
        {
            "Title": "Jay Shree Tea & Industries Reports Significant EBITDA Improvement in Q3",
            "Summary": "Jay Shree Tea & Industries has reported a substantial improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) showed a gain of 78 million rupees, compared to a loss of 131 million rupees in the same quarter of the previous year. This represents a positive turnaround in the company's operational profitability. Additionally, the EBITDA margin for Q3 stood at 3.35%, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739438674000,
            "Source": "earnings"
        },
        {
            "Title": "Jay Shree Tea & Industries Reports Significant Profit Increase in Q3",
            "Summary": "Jay Shree Tea & Industries has reported a substantial increase in net profit for the third quarter, rising to 743 million rupees from 17 million rupees in the same period last year. The company's revenue also saw growth, reaching 2.3 billion rupees compared to 1.99 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739438528000,
            "Source": "earnings"
        },
        {
            "Title": "Jay Shree Tea & Industries Reports Q2 Revenue Growth",
            "Summary": "Jay Shree Tea & Industries has announced its second quarter revenue, which has increased to 3 billion rupees from 2.3 billion rupees in the same quarter last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731578435000,
            "Source": "result"
        },
        {
            "Title": "Jay Shree Tea & Industries Reports Strong Q2 Financial Performance",
            "Summary": "Jay Shree Tea & Industries has announced its Q2 financial results, showing significant improvement in EBITDA and EBITDA margin compared to the same period last year. The company's EBITDA increased from 242 million rupees to 511 million rupees year-over-year. Additionally, the EBITDA margin improved from 10.48% to 16.96% in the same period.",
            "Sentiment": "positive",
            "PublishDate": 1731578408000,
            "Source": "result"
        },
        {
            "Title": "Jay Shree Tea & Industries Reports Significant Profit Increase in Q2",
            "Summary": "Jay Shree Tea & Industries has reported a substantial increase in consolidated net profit for the second quarter. The company's net profit rose to 365 million rupees, up from 111 million rupees in the same period last year, marking a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731578304000,
            "Source": "result"
        }
    ]
}