{
    "Symbol": "JBCHEPHARM",
    "ISIN": "INE572A01036",
    "News": [
        {
            "Title": "J.B. Chemicals VP-Legal Himanshu Ranvah Resigns",
            "Summary": "J.B. Chemicals & Pharmaceuticals announces resignation of Vice President-Legal Himanshu Ranvah effective February 6, 2026, with smooth transition planned to Mr. Vishal Chavan.",
            "Sentiment": "neutral",
            "PublishDate": 1770454348528,
            "Source": "stocks"
        },
        {
            "Title": "JB Chemicals Senior Management Resignations",
            "Summary": "J.B. Chemicals & Pharmaceuticals Limited announces resignations of two senior executives - President Operations and President India Business, effective March 5, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770309350469,
            "Source": "stocks"
        },
        {
            "Title": "JB Chemicals Sets Record Date for Interim Dividend",
            "Summary": "J.B. Chemicals & Pharmaceuticals Limited has fixed February 11, 2026 as the record date for determining shareholder eligibility for interim dividend for FY 2025-2026.",
            "Sentiment": "positive",
            "PublishDate": 1770301697534,
            "Source": "co_actions_results"
        },
        {
            "Title": "J.B. Chemicals Shifts Registered Office to Gujarat",
            "Summary": "J.B. Chemicals & Pharmaceuticals Limited has received Ministry of Corporate Affairs approval to relocate its registered office from Maharashtra to Gujarat, with the new address at Iscon Mall, Ahmedabad.",
            "Sentiment": "neutral",
            "PublishDate": 1770227974709,
            "Source": "stocks"
        },
        {
            "Title": "J.B. Chemicals CFO Narayan Saraf to resign Jan 30",
            "Summary": "J.B. Chemicals & Pharmaceuticals announces CFO Mr. Narayan Saraf's resignation effective January 30, 2026, citing personal reasons and pursuit of other professional opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1769682531488,
            "Source": "stocks"
        },
        {
            "Title": "JB Chemicals Issues Corrigendum on Promoter Reclassification",
            "Summary": "J.B. Chemicals & Pharmaceuticals corrects date error in board meeting outcome regarding Tau Investment Holdings' request to reclassify from promoter to public category under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769010685486,
            "Source": "stocks"
        },
        {
            "Title": "JB Chemicals Control Shifts to Torrent Pharmaceuticals",
            "Summary": "Torrent Pharmaceuticals acquires 46.39% stake in JB Chemicals for control, triggering board restructuring with multiple director resignations including CEO Nikhil Chopra.",
            "Sentiment": "neutral",
            "PublishDate": 1768987057401,
            "Source": "co_actions_results"
        },
        {
            "Title": "J.B. Chemicals Allots 37.84 Lakh Shares Under ESOP",
            "Summary": "J.B. Chemicals & Pharmaceuticals allotted 37,84,100 equity shares to employees under stock option scheme, raising ₹183.20 crores and increasing paid-up capital to 16.04 crore shares.",
            "Sentiment": "positive",
            "PublishDate": 1768984726986,
            "Source": "co_actions_results"
        },
        {
            "Title": "JB Chemicals Gets Buy Rating with ₹2,300 Target",
            "Summary": "Prabhudas Lilladher maintains buy rating on JB Chemicals with target price of ₹2,300, citing 16% YoY Q3FY26 EBITDA growth and strong growth drivers including geographical expansion and contract manufacturing scale-up.",
            "Sentiment": "positive",
            "PublishDate": 1768896040759,
            "Source": "stocks"
        },
        {
            "Title": "JB Chemicals Makes Q3FY26 Earnings Call Available",
            "Summary": "J.B. Chemicals & Pharmaceuticals Limited has made the audio recording of its Q3FY26 earnings call held on January 19, 2026 available on its website for investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1768810788922,
            "Source": "co_actions_results"
        },
        {
            "Title": "JB Chemicals Reports Strong Q3FY26 Results",
            "Summary": "JB Chemicals delivered robust Q3FY26 performance with 15% net profit increase to ₹179.00 crores, 10% revenue growth to ₹990.00 crores, and enhanced EBITDA margin of 27.20%.",
            "Sentiment": "positive",
            "PublishDate": 1768568735727,
            "Source": "co_actions_results"
        },
        {
            "Title": "J.B. Chemicals Approves ₹18 Cr Investment in Dubai Unit",
            "Summary": "J.B. Chemicals & Pharmaceuticals board approves additional investment of up to ₹18 crores in wholly-owned Dubai subsidiary Unique Pharmaceutical Laboratories, FZE for operational requirements.",
            "Sentiment": "positive",
            "PublishDate": 1767778495770,
            "Source": "stocks"
        },
        {
            "Title": "J.B. Chemicals faces ₹37 lakh tax demand from TN",
            "Summary": "J.B. Chemicals & Pharmaceuticals receives tax demand order of ₹37 lakhs from Tamil Nadu Commercial Tax Officer for alleged ITC disallowance during FY2018-19. Company plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1766577934030,
            "Source": "stocks"
        },
        {
            "Title": "J.B. Chemicals Achieves ESG Score of 86 in DJSI Ranking",
            "Summary": "J.B. Chemicals & Pharmaceuticals Limited announced its DJSI ESG score of 86, ranking among leading pharmaceutical companies in India and globally in the sustainability index.",
            "Sentiment": "positive",
            "PublishDate": 1766410779643,
            "Source": "stocks"
        },
        {
            "Title": "J.B. Chemicals faces ₹4.01 cr tax demand from UP",
            "Summary": "J.B. Chemicals & Pharmaceuticals receives tax order from Uttar Pradesh authorities demanding ₹4.01 crores for disallowed input tax credit during FY2021-22. Company plans to appeal.",
            "Sentiment": "negative",
            "PublishDate": 1765872794044,
            "Source": "stocks"
        },
        {
            "Title": "J.B. Chemicals Allots 2,500 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "J.B. Chemicals & Pharmaceuticals Limited allotted 2,500 equity shares of Re. 1 each to an employee under its Employee Stock Option Scheme, 2021, realizing Rs. 15,00,000 from the exercise. The company's issued and paid-up capital increased from 15,66,48,456 equity shares to 15,66,50,956 equity shares following this allotment.",
            "Sentiment": "neutral",
            "PublishDate": 1765014254543,
            "Source": "corporate_action"
        },
        {
            "Title": "J.B. Chemicals Allots 21,056 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "J.B. Chemicals & Pharmaceuticals Limited allotted 21,056 fully paid-up equity shares of Re. 1 each to an employee under its Employee Stock Option Scheme, 2021, realizing Rs. 78,43,360. The company's issued and paid-up capital increased from 15,66,27,400 equity shares to 15,66,48,456 equity shares of Re. 1 each.",
            "Sentiment": "neutral",
            "PublishDate": 1763904925996,
            "Source": "corporate_action"
        },
        {
            "Title": "Torrent Pharmaceuticals Launches Open Offer for J.B. Chemicals at INR 1,639.18 Per Share",
            "Summary": "Torrent Pharmaceuticals Limited has initiated an open offer to acquire up to 4,17,45,264 equity shares of J.B. Chemicals & Pharmaceuticals Limited, representing 26% of expanded share capital at INR 1,639.18 per share. The offer aggregates to INR 6,842.8 crore assuming full acceptance, with the offer opening advertisement published on November 17, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763385243891,
            "Source": "order&deals"
        },
        {
            "Title": "J.B. Chemicals Reports 16% Revenue Growth in Q2 FY26, Torrent Acquisition Gets CCI Approval",
            "Summary": "J.B. Chemicals & Pharmaceuticals reported consolidated revenue of ₹1,040 crores for the quarter ended September 30, 2025, compared to ₹896 crores in the same period last year. Net profit increased to ₹208 crores from ₹175 crores year-over-year. For the half-year period, consolidated revenue grew to ₹2,008 crores from ₹1,836 crores, with net profit rising to ₹410 crores from ₹351 crores. The Competition Commission of India approved Torrent Pharmaceuticals' acquisition of the company on October 21, 2025, subject to voluntary modifications. Under the proposed merger scheme, Torrent will issue 51 equity shares for every 100 shares of J.B. Chemicals held by shareholders. The company allotted 9.19 lakh equity shares during the half-year under its ESOS scheme, increasing paid-up capital to ₹15.66 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762885117201,
            "Source": "earnings"
        },
        {
            "Title": "JB Chemicals & Pharma Reports Strong Q2 Performance with 19% Net Profit Growth",
            "Summary": "JB Chemicals & Pharma delivered robust quarterly results with consolidated net profit rising to 2.08 billion rupees from 1.75 billion rupees year-over-year. Revenue increased to 10.85 billion rupees compared to 10 billion rupees in the same period last year. EBITDA grew to 3.1 billion rupees from 2.7 billion rupees, while EBITDA margin improved to 28.54% from 27.04% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1762863338802,
            "Source": "earnings"
        },
        {
            "Title": "CCI Approves Torrent Pharma's Acquisition of J.B. Chemicals & Pharmaceuticals with Conditions",
            "Summary": "The Competition Commission of India has approved Torrent Pharma's takeover of J.B. Chemicals & Pharmaceuticals. The approval comes with certain adjustments or conditions attached to the transaction.",
            "Sentiment": "positive",
            "PublishDate": 1761055801784,
            "Source": "order&deals"
        },
        {
            "Title": "Torrent Pharmaceuticals Issues Corrigendum for J.B. Chemicals Open Offer Worth INR 6,842.80 Crores",
            "Summary": "Torrent Pharmaceuticals Limited has issued a corrigendum to its open offer for acquiring up to 26% stake in J.B. Chemicals & Pharmaceuticals Limited. The offer is priced at INR 1,639.18 per share for 4,17,45,264 equity shares, with a total consideration of INR 6,842.80 crores. The corrigendum was published on September 4, 2025, in multiple newspapers including The Financial Express (English), Jansatta (Hindi), and Navshakti (Marathi). Stock exchanges BSE and NSE have been requested to disseminate this information on their websites. The open offer follows previous public announcements dated June 29, 2025, detailed public statement dated July 4, 2025, and draft letter of offer dated July 11, 2025, all issued in compliance with SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1756985571897,
            "Source": "corporate_action"
        },
        {
            "Title": "JB Chemicals Makes Key Board Changes with CEO Re-appointment and New Independent Directors",
            "Summary": "JB Chemicals & Pharmaceuticals Ltd announced several board changes approved at a meeting held on August 6, 2025. The company re-appointed Nikhil Chopra as Chief Executive Officer and Whole-time Director for a five-year term starting October 5, 2025. Sumit Bose was re-appointed as an independent director for a second five-year term effective August 31, 2025. The company also appointed two new independent directors: Richa Arora for a five-year term effective July 10, 2025, and Ashwani Kumar Puri for a five-year term effective May 14, 2025. Under Chopra's leadership, JB Pharma has achieved 16% growth rate, surpassing the industry average of 10%, with revenue nearly doubling to over INR 3000 crore in FY23. The company has become one of the fastest-growing companies among the top 25 in the pharmaceutical industry for two consecutive years.",
            "Sentiment": "positive",
            "PublishDate": 1754490467357,
            "Source": "corporate_governance"
        },
        {
            "Title": "J.B. Chemicals Reports 9% Revenue Growth to INR 1,094 Crore in Q1 FY26, EBITDA Margins Hit Record 30.2%",
            "Summary": "J.B. Chemicals & Pharmaceuticals delivered quarterly revenues of INR 1,094 crore, marking 9% year-on-year growth. The domestic business grew 14% to INR 678 crore, while international operations increased 2% to INR 416 crore. Operating EBITDA (excluding ESOP and one-off charges) rose 13% to INR 330 crore. The company achieved record operating EBITDA margins of 30.2%, up 120 basis points year-on-year. Gross margins expanded to 68.3% from 66.2% in the previous year. Net profit grew 14% to INR 202 crore. Key brand performance included Sporlac franchise reaching INR 146 crore, Azmarda at INR 75 crore, and Razel crossing INR 100 crore. The CDMO business grew 8% to INR 115 crore with new product launches in Asia Pacific and EU markets. Torrent Pharma announced plans to acquire a controlling stake in J.B. Chemicals for INR 11,917 crore, followed by a merger with a tender offer price of INR 1,639.18 per share.",
            "Sentiment": "positive",
            "PublishDate": 1754403223878,
            "Source": "earnings"
        },
        {
            "Title": "JB Pharma Reports Strong Performance with 30%+ EBITDA Margins and Fastest IPM Growth",
            "Summary": "JB Pharma has achieved EBITDA margins exceeding 30% while recording the fastest IPM (Indian Pharmaceutical Market) expansion among the top 25 companies. The company is implementing a multi-pronged brand strategy focused on chronic care, ophthalmology, and CDMO (Contract Development and Manufacturing Organization) opportunities to drive sustainable growth.",
            "Sentiment": "positive",
            "PublishDate": 1753887498818,
            "Source": "stock"
        },
        {
            "Title": "JB Chemicals & Pharma Reports Growth in Q1 Revenue and Profit",
            "Summary": "JB Chemicals & Pharma reported Q1 revenue of 10.9 billion rupees compared to 10 billion rupees in the previous year. The company's consolidated net profit increased to 2.02 billion rupees from 1.77 billion rupees year-over-year. EBITDA rose to 3 billion rupees from 2.8 billion rupees, while EBITDA margin slightly declined to 27.50% from 27.91% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1753879611869,
            "Source": "earnings"
        },
        {
            "Title": "J.B. Chemicals & Pharmaceuticals Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 511,235 shares of J.B. Chemicals & Pharmaceuticals Ltd. took place on the National Stock Exchange (NSE) at a price of Rs. 1639.00 per share. The total value of the transaction was Rs. 83.79 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1751608264000,
            "Source": "block_details"
        },
        {
            "Title": "J.B. Chemicals & Pharmaceuticals Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 100,280 shares of J.B. Chemicals & Pharmaceuticals Ltd. occurred on the National Stock Exchange (NSE). The trade was valued at Rs. 16.44 Crores, with shares priced at Rs. 1639.50 each.",
            "Sentiment": "neutral",
            "PublishDate": 1751522636000,
            "Source": "block_details"
        },
        {
            "Title": "JB Chemicals: US FDA Approves Depression Medication",
            "Summary": "JB Chemicals and Pharmaceuticals Ltd received final US FDA approval for Amitriptyline Hydrochloride Tablets USP in various dosages. The generic antidepressant is approved for relief of depression symptoms. This approval allows the company to enter the US market with this product, potentially boosting its international growth.",
            "Sentiment": "positive",
            "PublishDate": 1750771627000,
            "Source": "order&deals"
        },
        {
            "Title": "J.B. Chemicals & Pharmaceuticals Receives FDA Approval for Depression Medication",
            "Summary": "J.B. Chemicals & Pharmaceuticals has obtained approval from the U.S. Food and Drug Administration (FDA) for Amitriptyline Hydrochloride Tablets, a medication used to treat depression.",
            "Sentiment": "positive",
            "PublishDate": 1750769968000,
            "Source": "default"
        },
        {
            "Title": "JB Chemicals & Pharma Raises Operating Margin Guidance and Sets Sales Target",
            "Summary": "JB Chemicals & Pharma has announced an increase in its operating margin guidance for the third consecutive year. The company expects EBITDA margins to be between 27% and 29%. Additionally, the company is targeting a sales run rate of nearly 140,000 units per month by the end of the first half of the year. This information was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1747366187000,
            "Source": "default"
        },
        {
            "Title": "JB Chemicals & Pharmaceuticals: Q4 Profit and Revenue Meet Estimates",
            "Summary": "JB Chemicals & Pharmaceuticals Ltd. reported a 16% increase in Q4 FY2025 consolidated net profit to Rs 146 crore, meeting analysts' estimates. Revenue grew 10% to Rs 949 crore, supported by strong domestic formulations and CDMO business performance. Domestic business revenue rose 11% to Rs 519 crore, while international business revenue increased 9% to Rs 430 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747235650000,
            "Source": "earnings"
        },
        {
            "Title": "J.B. Chemicals & Pharmaceuticals Reports Q4 Results and Dividend",
            "Summary": "J.B. Chemicals & Pharmaceuticals announced its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit increased to 1.46 billion rupees from 1.26 billion rupees year-over-year. Revenue rose to 9.5 billion rupees from 8.6 billion rupees. EBITDA improved to 2.3 billion rupees with a margin of 23.85%. The company has recommended a dividend of 7 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747231951000,
            "Source": "result"
        },
        {
            "Title": "J.B. Chemicals & Pharmaceuticals Receives FDA Approval for Bisoprolol Tablets",
            "Summary": "J.B. Chemicals & Pharmaceuticals has obtained approval from the United States Food and Drug Administration (USFDA) for its Abbreviated New Drug Application (ANDA) of Bisoprolol Tablets. This generic version of Zebeta is intended for the management of hypertension.",
            "Sentiment": "positive",
            "PublishDate": 1745194821000,
            "Source": "default"
        },
        {
            "Title": "J.B. Chemicals & Pharmaceuticals Receives FDA Approval for Generic Hypertension Drug",
            "Summary": "J.B. Chemicals & Pharmaceuticals has obtained approval from the U.S. Food and Drug Administration (FDA) for its Abbreviated New Drug Application (ANDA) of Bisoprolol tablets. This generic version of Zebeta is intended for the management of hypertension.",
            "Sentiment": "positive",
            "PublishDate": 1745063296000,
            "Source": "default"
        },
        {
            "Title": "JB Chemicals and Pharmaceuticals: FDA Approves Generic Hypertension Drug",
            "Summary": "JB Chemicals and Pharmaceuticals Ltd. has received USFDA approval for Bisoprolol tablets in 5 mg and 10 mg strengths, a generic version of Teva's Zebeta tablets for hypertension management.",
            "Sentiment": "positive",
            "PublishDate": 1744981813000,
            "Source": "corporate_action"
        },
        {
            "Title": "JB Chemicals Acquires Shares in Jamnagar Renewables One",
            "Summary": "JB Chemicals has approved the acquisition of shares in Jamnagar Renewables One for 70 million rupees. This move suggests an investment in renewable energy assets or projects.",
            "Sentiment": "neutral",
            "PublishDate": 1743595773000,
            "Source": "corporate_action"
        },
        {
            "Title": "JB Chemicals & Pharmaceuticals: Promoter Sells 5.8% Stake for Rs 1,460 Crore",
            "Summary": "Tau Investment Holdings, a promoter of JB Chemicals & Pharmaceuticals Ltd., sold 89.83 lakh shares (5.8% stake) at Rs 1,625 per share, totaling Rs 1,460 crore. Kotak Mahindra Mutual Fund acquired 12.3 lakh shares (0.79% stake) at the same price. The company's stock closed 5.45% lower at Rs 1,615.70 on the National Stock Exchange.",
            "Sentiment": "neutral",
            "PublishDate": 1743093926000,
            "Source": "block_deals"
        },
        {
            "Title": "J.B. Chemicals & Pharmaceuticals Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for J.B. Chemicals & Pharmaceuticals Ltd. The transaction involved approximately 9,000,614 shares, traded at a price of Rs. 1632.30 per share. The total value of the block trade amounted to Rs. 1469.17 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1743047719000,
            "Source": "block_deals"
        },
        {
            "Title": "JB Chemicals & Pharmaceuticals: KKR Plans $300 Million Stake Sale",
            "Summary": "KKR intends to sell up to 10.2% stake in JB Chemicals & Pharmaceuticals through a block deal, worth approximately ₹2,576 crore ($300 million). The floor price is set at ₹1,625 per share, a 4.9% discount to the previous closing price. The sale includes a base offer of 6.8% stake and a greenshoe option of 3.4% stake.",
            "Sentiment": "neutral",
            "PublishDate": 1743033723000,
            "Source": "block_deals"
        },
        {
            "Title": "JB Chemicals & Pharmaceuticals Ltd: KKR to Sell Up to 10.2% Stake",
            "Summary": "KKR plans to sell up to 10.2% stake in JB Chemicals for $300 million. The base offer is 6.8% for $200 million, with an oversubscription option of 3.4% for $100 million. The floor price is ₹1,708.75 per share, a 4.9% discount to the closing price. The block deal will execute on Thursday.",
            "Sentiment": "neutral",
            "PublishDate": 1743003815000,
            "Source": "block_deals"
        },
        {
            "Title": "KKR Entity to Sell 10.2% Stake in JB Chemicals & Pharmaceuticals",
            "Summary": "TAU Investment, a promoter entity of KKR, is set to sell up to 10.2% stake in JB Chemicals & Pharmaceuticals through block deals. The sale involves 1.59 crore shares with a floor price of Rs 1625 per share. The total block deal size is estimated at Rs 2575 crores. Kotak and IIFL are acting as brokers for the deal.",
            "Sentiment": "neutral",
            "PublishDate": 1742996071000,
            "Source": "block_deals"
        },
        {
            "Title": "J.B. Chemicals & Pharma's API Facility Passes USFDA Inspection",
            "Summary": "J.B. Chemicals & Pharmaceuticals' API manufacturing facility D9 in Panoli, Gujarat, underwent a USFDA inspection from March 10-13, 2025. The inspection concluded with no observations, and no Form 483 was issued, indicating compliance with FDA regulations.",
            "Sentiment": "positive",
            "PublishDate": 1742170256000,
            "Source": "corporate_governance"
        },
        {
            "Title": "JB Chemicals & Pharmaceuticals: Gujarat API Facility Clears USFDA Inspection",
            "Summary": "JB Chemicals & Pharmaceuticals' API manufacturing facility in Panoli, Gujarat, successfully passed a USFDA inspection conducted from March 10-13, 2025, with no observations or Form 483 issued.",
            "Sentiment": "positive",
            "PublishDate": 1741954300000,
            "Source": "normal_news"
        },
        {
            "Title": "J.B. Chemicals & Pharma's API Facility Passes USFDA Inspection",
            "Summary": "J.B. Chemicals & Pharmaceuticals' API manufacturing facility D9 in Panoli, Gujarat, underwent a USFDA inspection from March 10-13, 2025. The facility received no observations, and no Form 483 was issued, indicating a successful inspection outcome.",
            "Sentiment": "positive",
            "PublishDate": 1741952071000,
            "Source": "corporate_governance"
        },
        {
            "Title": "USFDA Inspection of J.B. Chemicals' Panoli Facility Concludes with No Observations",
            "Summary": "J.B. Chemicals has announced that the United States Food and Drug Administration (USFDA) has completed its inspection of the company's Panoli facility. The inspection concluded with 'no observations,' and no Form 483 was issued. This outcome is generally considered positive, as it indicates that the facility meets the USFDA's regulatory standards.",
            "Sentiment": "positive",
            "PublishDate": 1741575996000,
            "Source": "corporate_governance"
        },
        {
            "Title": "JB Chemicals: CDMO Business Growth Prospects Boost Target Price",
            "Summary": "JB Chemicals' Contract Development and Manufacturing Organization (CDMO) business is expected to drive robust growth through geographical expansion and product diversification. Nirmal Bang has increased the target price and maintains a 'Buy' rating.",
            "Sentiment": "positive",
            "PublishDate": 1738819112000,
            "Source": "normal_news"
        },
        {
            "Title": "J.B. Chemicals & Pharmaceuticals Reports Strong Q3 Financial Results",
            "Summary": "J.B. Chemicals & Pharmaceuticals has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 1.62 billion rupees from 1.34 billion rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 9.6 billion rupees compared to 8.44 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1738714821000,
            "Source": "earnings"
        },
        {
            "Title": "JB Chemicals & Pharmaceuticals: Q3 Profit Jumps 22%, Declares Dividend",
            "Summary": "JB Chemicals & Pharmaceuticals reported a 22% increase in Q3 FY25 net profit to Rs 163 crore. Revenue grew 14% to Rs 963 crore. The company declared a dividend of Rs 8.50 per share for FY 2024-25, payable on February 21, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1738680826000,
            "Source": "result"
        },
        {
            "Title": "J.B. Chemicals & Pharmaceuticals Reports Q3 EBITDA Growth",
            "Summary": "J.B. Chemicals & Pharmaceuticals announced its Q3 financial results. The company's EBITDA increased to 2.55 billion rupees from 2.23 billion rupees in the same quarter last year. The EBITDA margin remained stable at 26.42% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738677201000,
            "Source": "earnings"
        }
    ]
}