{
    "Symbol": "JBMA",
    "ISIN": "INE927D01051",
    "News": [
        {
            "Title": "JBM Auto Q3 Net Profit Rises to ₹551M",
            "Summary": "JBM Auto reports consolidated net profit of ₹551 million in Q3, marking a year-on-year increase from ₹526 million in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1769764364213,
            "Source": "co_actions_results"
        },
        {
            "Title": "JBM Auto Clarifies No New Agreements; Office Closure",
            "Summary": "JBM Auto confirms no new agreements linked to recent news reports and announces corporate office closure from December 29, 2025, to January 1, 2026, for year-end holidays.",
            "Sentiment": "neutral",
            "PublishDate": 1767084397201,
            "Source": "stocks"
        },
        {
            "Title": "JBM Group Signs Deal to Acquire Major Stake in Glida",
            "Summary": "JBM Group has entered into an exclusive agreement to acquire a major stake in Glida, marking a significant corporate development for the automotive company.",
            "Sentiment": "positive",
            "PublishDate": 1766980347899,
            "Source": "co_actions_results"
        },
        {
            "Title": "JBM Auto Seeks Shareholder Approval for Rs 1,450 Crore Material Related Party Transaction with Subsidiary",
            "Summary": "JBM Auto Limited has issued a postal ballot notice seeking shareholder approval for material related party transactions with its subsidiary JBM Ecolife Mobility Private Limited, valued up to Rs 1,450 crores. The transactions involve financial support including undertakings, sponsor support, comfort letters, indemnity or other financial assistance. JBM Auto holds 83% stake in JBM Ecolife Mobility, which is engaged in electric bus operations and EV ecosystem business. The approval is sought for one year from the date of shareholder consent. Previous transactions with the subsidiary included inter-corporate loans of Rs 366.09 crores, bank guarantees of Rs 38 crores, and sale of goods/services worth Rs 245.37 crores. The e-voting period runs from November 11, 2025 to December 10, 2025, with results to be declared by December 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762817591896,
            "Source": "corporate_action"
        },
        {
            "Title": "JBM Auto Q2 Net Profit Rises 6% to ₹53 Crore Despite Margin Decline",
            "Summary": "JBM Auto reported a net profit of ₹52.6 crore for the second quarter, up 6.2% from ₹49.5 crore in the same period last year. Revenue increased 6.5% to ₹1,368 crore from ₹1,285 crore. However, EBITDA declined 5.6% to ₹155.3 crore, with EBITDA margin narrowing to 11.3% from 12.9%. The Indian Army signed a ₹130.58 crore contract with JBM Auto on October 17, 2025, to procure 113 electric buses and 43 fast chargers, marking the Army's first major electric bus induction under the PM E-Drive programme. The procurement is classified as Buy (Indian–IDDM) supporting local manufacturing and the Aatmanirbhar Bharat vision. JBM Auto shares closed at ₹681.55, up 0.66%.",
            "Sentiment": "positive",
            "PublishDate": 1761828804027,
            "Source": "earnings"
        },
        {
            "Title": "JBM Auto Reports Mixed Q2 Results with Revenue Growth but Lower EBITDA Margin",
            "Summary": "JBM Auto reported Q2 consolidated net profit of 526 million rupees compared to 495 million rupees in the same period last year. Revenue increased to 13.7 billion rupees from 12.8 billion rupees year-over-year. However, EBITDA declined to 1.55 billion rupees from 1.65 billion rupees, while EBITDA margin compressed to 11.33% from 12.83% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1761825369877,
            "Source": "earnings"
        },
        {
            "Title": "Indian Army Awards ₹130 Crore Electric Bus Contract to JBM Auto",
            "Summary": "The Indian Army signed a ₹130.58 crore contract with JBM Auto Ltd on October 17, 2025, for procurement of 113 electric buses and 43 fast chargers. This represents the Army's first major electric bus induction, supporting the government's PM E-Drive programme for clean mobility. The procurement is classified as Buy (Indian–IDDM) — Indigenously Designed, Developed, and Manufactured — aligning with the Aatmanirbhar Bharat vision. The electric buses will be deployed across the three services to modernize transport fleet, reduce fossil fuel dependence, and contribute to India's net-zero carbon emissions goal.",
            "Sentiment": "positive",
            "PublishDate": 1760691856322,
            "Source": "order&deals"
        },
        {
            "Title": "JBM Auto Divests 100% Stake in MH Ecolife Emobility for ₹171.7 Crore",
            "Summary": "JBM Auto Ltd. sold its entire equity stake in MH Ecolife Emobility Pvt Ltd. to JBM Ecolife Mobility Pvt Ltd. for ₹171.7 crore as part of business consolidation efforts. The transaction was completed on October 14, 2025, making MH Ecolife a wholly owned subsidiary of JBM Ecolife instead of JBM Auto. MH Ecolife had a turnover of ₹6,910.45 lakhs and contributed 2.58% to net worth as of March 31, 2025. The transaction qualifies as a related party transaction conducted on an arm's length basis, as JBM Ecolife belongs to the promoter group.",
            "Sentiment": "neutral",
            "PublishDate": 1760456498908,
            "Source": "corporate_action"
        },
        {
            "Title": "JBM Auto Partners With Al Habtoor Motors To Launch E-Buses In UAE",
            "Summary": "JBM Auto has formed a partnership with Al Habtoor Motors to introduce electric buses in the UAE market. The collaboration aims to bring e-bus solutions to the United Arab Emirates through this joint venture between the two companies.",
            "Sentiment": "positive",
            "PublishDate": 1758531073194,
            "Source": "order&deals"
        },
        {
            "Title": "JBM Ecolife Mobility Raises $100 Million from IFC for E-Bus Expansion",
            "Summary": "JBM Ecolife Mobility has secured a $100 million capital investment from the International Financial Corporation. The funding is intended to scale up the deployment of electric buses in the company's operations.",
            "Sentiment": "positive",
            "PublishDate": 1757895093252,
            "Source": "order&deals"
        },
        {
            "Title": "JBM ECOLIFE Mobility Raises $100 Million from IFC for E-Bus Expansion",
            "Summary": "JBM ECOLIFE Mobility has secured a $100 million capital investment from the International Financial Corporation. The funding will be used to scale up the deployment of electric buses.",
            "Sentiment": "positive",
            "PublishDate": 1757588176995,
            "Source": "order&deals"
        },
        {
            "Title": "Delhi CM Proposes Electric School Buses To Reduce Pollution",
            "Summary": "Delhi's Chief Minister has proposed the use of electric school buses as a measure to reduce pollution in the city. This proposal could potentially impact JBM Auto, which operates in the electric vehicle segment.",
            "Sentiment": "positive",
            "PublishDate": 1756199291533,
            "Source": "stock"
        },
        {
            "Title": "JBM Auto Reports Strong Quarterly Results, Expects Substantial Growth in FY26",
            "Summary": "JBM Auto reported consolidated revenue of Rs 1,254 crore in quarterly results, up from Rs 1,144.5 crore in the same quarter last year. Net profit increased to Rs 39 crore from Rs 33.5 crore year-on-year, while Ebitda grew 20.45% to Rs 180 crore from Rs 149 crore. The company maintained Ebitda above 14%, showing improvement over the previous quarter and year-on-year. Vice Chairman and Managing Director Nishant Arya expects substantial top-line growth in FY26 due to investments in technology, capacity and new products. The company's EV segment grew over 36% despite sluggish automotive market conditions. JBM Auto has developed new-generation batteries and addressed rare earth magnet challenges through strategic inventory management. The company plans to reduce debt levels and targets at least 20% increase in positive cash flows compared to last year, aiming for operational cash flow to reach close to 100% of Ebitda by year-end or first half of next financial year.",
            "Sentiment": "positive",
            "PublishDate": 1754011496437,
            "Source": "stock"
        },
        {
            "Title": "JBM Auto Reconstitutes Audit Committee, Appoints Valipe Ramgopal Rao as Independent Director",
            "Summary": "JBM Auto Limited has reconstituted its Audit Committee effective July 30, 2025. The company appointed Mr. Valipe Ramgopal Rao as a new Independent Director member with immediate effect. The reconstituted Audit Committee comprises Mrs. Pravin Tripathi as Chairperson and Independent Director, Mr. Praveen Kumar Tripathi as Member and Independent Director, Mr. Dhiraj Mohan as Member and Whole-time Director, and Mr. Valipe Ramgopal Rao as Member and Independent Director. The decision was made during the Board of Directors meeting held on July 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753874524628,
            "Source": "corporate_governance"
        },
        {
            "Title": "JBM Auto Re-appoints Dhiraj Mohan as Executive & Whole Time Director for 2-Year Term",
            "Summary": "JBM Auto Limited's Board of Directors has re-appointed Mr. Dhiraj Mohan as Executive & Whole Time Director for a 2-year term effective November 5, 2025, subject to shareholder approval. The decision was made based on the recommendation of the Nomination & Remuneration Committee. Mohan, aged 63, holds a Bachelor of Engineering (Mechanical) from Birla Institute of Technology and an MBA from Delhi University. He has been serving as Whole Time Director since November 5, 2022, and brings nearly 4 decades of automotive industry experience. He has led strategic business missions and been instrumental in accomplishing various greenfield and brownfield projects. The company confirmed that Mohan is not debarred from holding the office by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1753872654739,
            "Source": "corporate_governance"
        },
        {
            "Title": "JBM Auto Reports Q1 Results and Seeks Approval for Rs 1,500 Crore Securities Issuance",
            "Summary": "JBM Auto Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 1,234.34 crores compared to Rs 1,054.39 crores in the same quarter last year. Net profit stood at Rs 32.10 crores versus Rs 33.92 crores in the previous year quarter. On a consolidated basis, revenue from operations was Rs 1,253.88 crores against Rs 1,144.50 crores in the corresponding quarter. Consolidated net profit attributable to owners was Rs 36.80 crores compared to Rs 33.40 crores in the same period last year. The Board also approved a proposal to issue securities worth up to Rs 1,500 crores, subject to shareholder approval at the upcoming Annual General Meeting. The company operates through three main segments: Component Division (Rs 773.91 crores revenue), OEM Division (Rs 394.31 crores revenue), and Tool Room Division (Rs 87.13 crores revenue).",
            "Sentiment": "neutral",
            "PublishDate": 1753868527200,
            "Source": "earnings"
        },
        {
            "Title": "JBM Auto Board Approves ₹1,500 Crore Fundraising; Q1 Revenue Rises to ₹12.5 Billion",
            "Summary": "JBM Auto's board has approved fundraising of up to ₹1,500 crore. The company reported Q1 consolidated net profit of ₹368 million compared to ₹333 million year-over-year. Q1 EBITDA remained flat at ₹1.4 billion year-over-year, while EBITDA margin declined to 11.13% from 12.21% in the same period last year. Q1 revenue increased to ₹12.5 billion from ₹11.44 billion year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1753868083171,
            "Source": "corporate_action"
        },
        {
            "Title": "JBM Auto Unveils All-Electric City Bus at UITP Hamburg 2025",
            "Summary": "JBM Auto's subsidiary, JBM Electric Vehicles, has introduced its all-electric city bus named Ecolife at the UITP event in Hamburg, Germany. This launch is aimed at accelerating Europe's transition towards sustainable transportation. The event is scheduled for 2025.",
            "Sentiment": "positive",
            "PublishDate": 1750066245000,
            "Source": "default"
        },
        {
            "Title": "JBM Auto Exploring International Market Opportunities",
            "Summary": "JBM Auto has clarified that its international business models are still in process. The company stated that it is in the exploring stages to enter international markets.",
            "Sentiment": "neutral",
            "PublishDate": 1749600265000,
            "Source": "default"
        },
        {
            "Title": "JBM Auto Explores International Business Opportunities",
            "Summary": "JBM Auto has clarified that their international business models are still in the development stage. The company states that they are in the initial phases of exploring international markets, indicating a potential expansion of their operations beyond their current scope.",
            "Sentiment": "neutral",
            "PublishDate": 1749566147000,
            "Source": "default"
        },
        {
            "Title": "JBM Green Energy Systems Secures 3 GWh Orderbook for BESS Deployments",
            "Summary": "JBM Green Energy Systems, a subsidiary of JBM Auto, has reported a significant increase in its orderbook for Battery Energy Storage Systems (BESS) deployments across India. The company's orderbook has reached 3 GWh for BESS projects, indicating a strong demand for energy storage solutions in the country.",
            "Sentiment": "positive",
            "PublishDate": 1748831968000,
            "Source": "default"
        },
        {
            "Title": "JBM Auto: Battery Subsidiary's Order Book Surges to 3 GWh",
            "Summary": "JBM Auto's subsidiary, JBM Green Energy Systems, has seen its order book for battery energy storage systems (BESS) increase to 3 GWh across India. This includes a recent 1 GWh BESS deployment for SJVN Ltd. The company is working with various electric vehicle segments and aims to support India's 500 GW renewable energy target by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1748827512000,
            "Source": "order&deals"
        },
        {
            "Title": "Government to Provide Electric Buses to Cities Under PM's E-Drive Scheme",
            "Summary": "The Indian government plans to supply electric buses to several cities as part of the Prime Minister's E-Drive initiative. Bengaluru is set to receive approximately 4,500 buses, while Hyderabad and Delhi will each get over 2,000 buses.",
            "Sentiment": "positive",
            "PublishDate": 1747909733000,
            "Source": "default"
        },
        {
            "Title": "JBM Auto Targets Revenue Growth for FY26",
            "Summary": "JBM Auto is aiming for revenue between ₹6,000-6,500 crore in FY26, compared to their FY25 target of ₹5,500 crore, as reported by CNBC TV18.",
            "Sentiment": "positive",
            "PublishDate": 1746597956000,
            "Source": "default"
        },
        {
            "Title": "JBM Auto: Q4 Profit Up 19%, Announces Dividend",
            "Summary": "JBM Auto reported a 19% increase in Q4 net profit to ₹66 crore. Revenue rose 11% to ₹1,646 crore. EBITDA grew 14.7% to ₹197 crore with margin expanding to 12%. The company announced a final dividend of ₹0.85 per share.",
            "Sentiment": "positive",
            "PublishDate": 1746522392000,
            "Source": "earnings"
        },
        {
            "Title": "JBM Auto Reports Q4 Revenue Growth",
            "Summary": "JBM Auto has announced its Q4 revenue, which stands at 16.5 billion rupees, compared to 14.86 billion rupees in the same quarter last year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1746521360000,
            "Source": "result"
        },
        {
            "Title": "JBM Auto Reports Q4 Results and Declares Dividend",
            "Summary": "JBM Auto announced its Q4 financial results, with EBITDA increasing to 1.85 billion rupees from 1.72 billion year-over-year. The EBITDA margin slightly decreased to 11.24% from 11.59%. The company's consolidated net profit rose to 663 million rupees from 557.5 million in the previous year. Additionally, JBM Auto declared a dividend of 0.85 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1746521324000,
            "Source": "result"
        },
        {
            "Title": "JBM Auto to Consider Q4 Results on May 6",
            "Summary": "JBM Auto has announced that it will consider its fourth quarter (Q4) financial results on May 6. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746015909000,
            "Source": "default"
        },
        {
            "Title": "Indian Government to Launch Tender for 10,000 Electric Buses Under PM E-DRIVE Scheme",
            "Summary": "The Union Government of India is set to launch a tender for the procurement of 10,000 electric buses. These buses will be deployed in major cities including Bengaluru, Chennai, Hyderabad, Pune, Mumbai, Surat, Ahmedabad, and New Delhi. This initiative is part of the PM E-DRIVE scheme, launched in September 2024, which aims to support 14,028 e-buses with a subsidy outlay of Rs 4,391 crore. The scheme has a total outlay of Rs 10,900 crore and will be applicable until March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1744775142000,
            "Source": "default"
        },
        {
            "Title": "JBM Auto Considers Equity Dilution in Subsidiary",
            "Summary": "JBM Auto's executive has stated that the company is considering diluting equity in one of its subsidiaries, as reported by CNBC TV18. This move could potentially impact the company's ownership structure and financial position.",
            "Sentiment": "neutral",
            "PublishDate": 1740118642000,
            "Source": "corporate_action"
        },
        {
            "Title": "JBM Auto Announces Substantial Bus Order Backlog",
            "Summary": "JBM Auto has reported a significant orderbook of 11,000 buses, which the company plans to deliver over the next two years. This information was shared on CNBC TV18, indicating a strong demand for the company's bus products and a positive outlook for its production and sales in the near future.",
            "Sentiment": "positive",
            "PublishDate": 1740118610000,
            "Source": "order&deals"
        },
        {
            "Title": "JBM Auto Secures Major Order Worth 5,500 Crore Rupees",
            "Summary": "JBM Auto has won a significant order valued at 5,500 crore rupees. This substantial contract represents a major business development for the company, potentially boosting its revenue and market position in the automotive sector.",
            "Sentiment": "positive",
            "PublishDate": 1739958959000,
            "Source": "order&deals"
        }
    ]
}