{
    "Symbol": "JETFREIGHT",
    "ISIN": "INE982V01025",
    "News": [
        {
            "Title": "Jet Freight Logistics Q3FY26 Results Show Growth",
            "Summary": "Jet Freight Logistics reported Q3FY26 net profit of ₹107.80 lakhs vs ₹156.15 lakhs in Q3FY25. Revenue increased to ₹11,309.96 lakhs from ₹9,407.27 lakhs, showing 20.22% YoY growth despite profit decline.",
            "Sentiment": "neutral",
            "PublishDate": 1770024922621,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jet Freight Logistics EGM for Warrant Issuance",
            "Summary": "Jet Freight Logistics Limited schedules Extra-Ordinary General Meeting on February 20, 2026 to approve issuance of 4,26,32,750 convertible warrants worth ₹76,73,89,500 to promoter and non-promoter investors.",
            "Sentiment": "neutral",
            "PublishDate": 1769523496814,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jet Freight Board Meet Set for Feb 2 for Q3FY26 Results",
            "Summary": "Jet Freight Logistics Limited has scheduled its board meeting for February 02, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769167032615,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jet Freight Board Meet on Jan 20 for Fund Raising",
            "Summary": "Jet Freight Logistics Limited has scheduled a board meeting on January 20, 2026, to consider fund raising proposals through various methods including preferential issue, private placement, or rights issue.",
            "Sentiment": "neutral",
            "PublishDate": 1768471526918,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jet Freight Logistics Promoter Pledges 22.3 Lakh Shares to State Bank of India",
            "Summary": "Dax Francis Theknath, Promoter Executive Director of Jet Freight Logistics Limited, pledged 22,30,000 equity shares (4.81% of total share capital) to State Bank of India on November 24, 2025. The pledge was created for working capital facility purposes of the listed company, with the borrowed amount of Rs. 9,25,22,700 against share value of Rs. 3,88,46,600.",
            "Sentiment": "negative",
            "PublishDate": 1764307257475,
            "Source": "corporate_action"
        },
        {
            "Title": "Jet Freight Logistics Promoter Pledges 32.8 Lakh Shares to Bandhan Bank",
            "Summary": "Dax Francis Theknath, Promoter Executive Director of Jet Freight Logistics Limited, has pledged 32,80,000 equity shares (7.07% of total share capital) to Bandhan Bank Limited for working capital facility purposes. The pledge was created on November 19, 2025, with the amount involved being Rs. 8 crores against shares valued at Rs. 4.68 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1763717987905,
            "Source": "corporate_action"
        },
        {
            "Title": "Jet Freight Logistics Executive Director Releases Pledge on 20.4 Lakh Equity Shares",
            "Summary": "Dax Francis Theknath, Executive Director of Jet Freight Logistics Limited, released pledge on 20,39,500 equity shares. The pledge was originally created in favor of Aditya Birla Finance Limited for working capital facility purposes. Post-release, Theknath holds 96,18,000 shares representing 20.73% of total share capital, with 27,09,500 shares (5.84%) remaining encumbered. The disclosure was made under SEBI regulations for substantial acquisition of shares and insider trading provisions.",
            "Sentiment": "neutral",
            "PublishDate": 1762886333569,
            "Source": "corporate_action"
        },
        {
            "Title": "Jet Freight Logistics Reports Quarterly Results for September 2025",
            "Summary": "Jet Freight Logistics Limited announced its unaudited standalone and consolidated financial results for the quarter ended September 30, 2025. The Board of Directors approved the results during a meeting held on October 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 8,417.24 lakhs for the quarter, compared to Rs. 12,085.68 lakhs in the previous quarter and Rs. 8,736.05 lakhs in the same quarter last year. Profit after tax stood at Rs. 87.08 lakhs for the quarter. On a consolidated basis, revenue from operations was Rs. 8,377.77 lakhs for the quarter, with profit after tax of Rs. 87.24 lakhs. The company operates in freight forwarding business and has subsidiaries including Jet Freight Express Private Limited, Jet Freight Logistics BV, Jet Freight Logistics Inc, and Vank Global Services Private Limited. Basic and diluted earnings per share were reported at Rs. 0.80 for standalone results and Rs. 0.81 for consolidated results.",
            "Sentiment": "neutral",
            "PublishDate": 1761825821824,
            "Source": "earnings"
        },
        {
            "Title": "Jet Freight Logistics Approves Expansion of Business Scope Through MOA Amendment",
            "Summary": "Jet Freight Logistics Limited members approved alterations to the company's Memorandum of Association at a meeting held on September 25, 2025. The changes involve modifications to the Object Clause, specifically adding a new sub-clause that expands the company's business scope to include general trading activities. The amendment allows the company to engage in buying, selling, importing, exporting and trading various goods including machinery components, automobile parts, food products, textiles, electronics, and other consumer items. The new clause also permits business operations through electronic commerce platforms, websites, mobile applications and online marketplaces, along with providing ancillary services such as logistics, warehousing, digital payment processing and customer support.",
            "Sentiment": "positive",
            "PublishDate": 1758810682078,
            "Source": "corporate_action"
        },
        {
            "Title": "Jet Freight Logistics Board Approves Expansion of Business Activities Through MOA Amendment",
            "Summary": "Jet Freight Logistics Limited's Board of Directors has approved alterations to the Object Clause of the company's Memorandum of Association, subject to shareholder approval at the upcoming Annual General Meeting. The amendment expands the company's business scope to include general trading activities across diverse product categories including machinery components, automobile parts, food provisions, textiles, consumer durables, electronics, and various other goods. The expanded mandate also covers trading through electronic commerce platforms, websites, mobile applications, and online marketplaces, along with providing ancillary services such as logistics, warehousing, fulfillment, digital payment processing, and customer support for both domestic and international operations.",
            "Sentiment": "positive",
            "PublishDate": 1756373844811,
            "Source": "corporate_action"
        },
        {
            "Title": "Jet Freight Logistics' Statutory Auditor GMCS & Co Resigns Due to Professional Commitments",
            "Summary": "GMCS & Co, Chartered Accountants, resigned as statutory auditors of Jet Freight Logistics Limited on August 13, 2025, citing pre-occupation with existing professional commitments and unavoidable engagements. The auditor was appointed on May 29, 2024, with a term scheduled to expire on March 31, 2029. Their latest limited review report for the quarter ended June 30, 2025, was submitted on August 12, 2025. The auditor confirmed no concerns with the company and stated no other material reasons for resignation beyond those disclosed. The resignation is effective immediately.",
            "Sentiment": "neutral",
            "PublishDate": 1755160047964,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jet Freight Logistics Reports Q1 FY2026 Results with Revenue of Rs 119.36 Crores",
            "Summary": "Jet Freight Logistics Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue of Rs 119.36 crores and EBITDA of Rs 4.51 crores for the quarter. Standalone profit after tax was Rs 177.53 lakhs compared to Rs 103.31 lakhs in the same quarter last year. Basic earnings per share stood at Rs 0.38. On a consolidated basis, revenue was Rs 119.72 crores with EBITDA of Rs 4.55 crores. The company operates in freight forwarding business and has adopted a new accounting policy for recognizing unbilled revenue in accordance with Ind AS 115, effective from October 1, 2024, which increased revenue by Rs 8.93 crores. The results were reviewed by statutory auditors GMCS & Co.",
            "Sentiment": "positive",
            "PublishDate": 1754995566462,
            "Source": "earnings"
        }
    ]
}