{
    "Symbol": "JGCHEM",
    "ISIN": "INE0MB501011",
    "News": [
        {
            "Title": "J.G.Chemicals Q3FY26 Results Call on Feb 16",
            "Summary": "J.G.Chemicals Limited announces Q3FY26 post-results conference call scheduled for February 16, 2026 at 4:00 PM IST. Management to discuss operational and financial performance with investors.",
            "Sentiment": "neutral",
            "PublishDate": 1770889353774,
            "Source": "co_actions_results"
        },
        {
            "Title": "JG Chemicals Reports 4% Revenue Growth in Q2 FY26, Advances Dahej Expansion Plans",
            "Summary": "JG Chemicals Limited, India's largest zinc oxide manufacturer, posted consolidated revenue of Rs. 220 crores in Q2 FY26 with 4% year-on-year growth and EBITDA margin of 9.94%. The company is progressing with its Rs. 100 crore Dahej greenfield expansion project, expected to commission Phase-1 in H1 FY27 with revenue potential of Rs. 900 crores.",
            "Sentiment": "positive",
            "PublishDate": 1763727093246,
            "Source": "earnings"
        },
        {
            "Title": "J.G. Chemicals Plans Zinc Oxide Capacity Expansion With ₹2,000 Cr Revenue Target By FY28",
            "Summary": "J.G. Chemicals announced plans to add a new 15,000 TPA zinc oxide plant to serve the tyre and rubber industry while targeting revenue of ₹2,000 crores by FY28. The company aims to increase its export share to 40% and focus on backward integration for improved margin resilience.",
            "Sentiment": "positive",
            "PublishDate": 1763137200709,
            "Source": "stock"
        },
        {
            "Title": "J.G. Chemicals Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "J.G. Chemicals posted Q2 consolidated net profit of 144 million rupees, down from 165 million rupees year-over-year, while revenue increased to 2.2 billion rupees from 2.12 billion rupees. The company's EBITDA fell to 179.5 million rupees from 211.1 million rupees, with EBITDA margin compressing to 8.15% from 9.95% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1763127834032,
            "Source": "earnings"
        },
        {
            "Title": "JG Chemicals Reports Q1 Results, Announces INR 100 Crore Gujarat Expansion",
            "Summary": "JG Chemicals Limited reported quarterly results with consolidated revenues of INR 221.4 crores, EBITDA of INR 23.2 crores, and profit after tax of INR 16.35 crores. The Board approved a Greenfield capital expenditure of INR 100 crores for a 40,000 metric ton per annum zinc chemicals facility at Dahej, Gujarat, with potential to generate INR 900 crores in revenue. The company acquired 11.43 acres of land at Dahej and an additional 2.96 acres adjacent to its existing Naidupeta facility. JG Chemicals is India's largest zinc oxide manufacturer and among the top five globally, serving over 200 domestic customers and 50+ international clients across 10+ countries. The company operates at approximately 70% capacity utilization across three plants with combined capacity of 70,000 metric tons per annum. Management expects to increase non-rubber product share from current 15% to 30% over the next four to five years, targeting double-digit volume growth and margin expansion of 200-300 basis points through specialty products.",
            "Sentiment": "positive",
            "PublishDate": 1755518545034,
            "Source": "earnings"
        },
        {
            "Title": "J.G. Chemicals Targets 30% Non-Rubber Revenue Share Through Market Expansion and Capacity Enhancement",
            "Summary": "J.G. Chemicals plans to increase its non-rubber revenue share to 30% by leveraging advanced recycling technology to enter Western India's ceramics, pharmaceutical, and agriculture markets. The company is expanding capacity at its Naidupeta facility and developing new specialized grades to boost 'content per tyre' and improve profit margins.",
            "Sentiment": "positive",
            "PublishDate": 1754930358962,
            "Source": "stock"
        },
        {
            "Title": "J.G. Chemicals Reports Mixed Q1 Results with Revenue Growth and EBITDA Decline",
            "Summary": "J.G. Chemicals reported Q1 consolidated net profit of 157.7 million rupees compared to 152 million rupees in the previous year. Revenue increased to 2.18 billion rupees from 2 billion rupees year-over-year. However, EBITDA declined to 198 million rupees from 224 million rupees, with EBITDA margin compressing to 9.08% from 11.07%. The company has approved capital expenditure for an expansion project in Dahej, Gujarat.",
            "Sentiment": "neutral",
            "PublishDate": 1754925268423,
            "Source": "earnings"
        },
        {
            "Title": "JG Chemicals Ltd: Stock Breaks Out to Record Highs, Analysts Set New Target",
            "Summary": "JG Chemicals Ltd stock broke out from a Cup pattern on daily charts, reaching record highs in July 2025. Analysts suggest a potential target of Rs 592 in the next 1-2 months for short-term traders. The stock previously consolidated after hitting a swing high of 484 on November 27, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1752751800000,
            "Source": "normal_news"
        },
        {
            "Title": "J.G. Chemicals Reports Q4 Financial Results",
            "Summary": "J.G. Chemicals announced its Q4 financial results. The company's EBITDA increased to 196 million rupees from 172 million rupees year-over-year. However, the EBITDA margin decreased to 8.74% from 9.50% in the same period. Consolidated net profit rose to 153 million rupees from 131 million rupees, while revenue grew to 2.24 billion rupees from 1.81 billion rupees compared to the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747483561000,
            "Source": "result"
        },
        {
            "Title": "JG Chemicals Subsidiary Acquires Land in Andhra Pradesh",
            "Summary": "A subsidiary of JG Chemicals has acquired land in Andhra Pradesh. The land acquisition is valued at 23.4 million rupees, excluding taxes.",
            "Sentiment": "positive",
            "PublishDate": 1746534237000,
            "Source": "default"
        },
        {
            "Title": "J.G. Chemicals Reports Strong Q3 Financial Results",
            "Summary": "J.G. Chemicals has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 169.7 million rupees, up from 102 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 2.09 billion rupees compared to 1.6 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1738714933000,
            "Source": "earnings"
        },
        {
            "Title": "J.G. Chemicals Reports Significant EBITDA Growth in Q3",
            "Summary": "J.G. Chemicals has announced its Q3 financial results, showing substantial year-over-year improvement. The company's EBITDA increased from 148 million rupees to 231 million rupees. Additionally, the EBITDA margin expanded from 9.16% to 11.05%, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738669687000,
            "Source": "earnings"
        },
        {
            "Title": "J.G. Chemicals Reports Strong Q3 Financial Results",
            "Summary": "J.G. Chemicals has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 169.7 million rupees, up from 102 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 2.09 billion rupees compared to 1.6 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1738669673000,
            "Source": "earnings"
        },
        {
            "Title": "J. G. Chemicals Reports Strong Q2 Financial Performance",
            "Summary": "J. G. Chemicals has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased from 80 million rupees to 211 million rupees. Additionally, the EBITDA margin expanded from 5.24% to 9.95%.",
            "Sentiment": "positive",
            "PublishDate": 1731575659000,
            "Source": "result"
        },
        {
            "Title": "J. G. Chemicals Reports Significant Increase in Q2 Consolidated Net Profit",
            "Summary": "J. G. Chemicals has reported a consolidated net profit of 165 million rupees for the second quarter, compared to 38 million rupees in the same period last year. This represents a substantial year-over-year increase in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1731575587000,
            "Source": "result"
        }
    ]
}