{
    "Symbol": "JHS",
    "ISIN": "INE544H01014",
    "News": [
        {
            "Title": "JHS Svendgaard Files Q3FY26 Fund Utilization Report",
            "Summary": "JHS Svendgaard Laboratories reported no deviation in utilization of Rs. 29.99 crores raised through preferential issue for Q3FY26, with funds allocated across manufacturing facility equipment and group entity expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1770728412818,
            "Source": "stocks"
        },
        {
            "Title": "JHS Svendgaard allots 18.02 lakh equity shares",
            "Summary": "JHS Svendgaard Laboratories completed conversion of 18,01,801 warrants into equity shares at Rs. 27.75 each, raising Rs. 3.75 crore from Coeus Global Opportunities Fund through preferential allotment.",
            "Sentiment": "positive",
            "PublishDate": 1769922933745,
            "Source": "co_actions_results"
        },
        {
            "Title": "JHS Svendgaard Laboratories Grants 31.30 Lakh Employee Stock Options Under New ESOP Scheme",
            "Summary": "JHS Svendgaard Laboratories' Nomination and Remuneration Committee approved the grant of 31,30,000 employee stock options convertible into equal equity shares of Rs. 10 face value each under its Employee Stock Option Scheme-2025. The options carry an exercise price of Rs. 10 per option with a vesting period starting one year from grant date and extending up to five years, providing eligible employees with potential equity participation in the company.",
            "Sentiment": "positive",
            "PublishDate": 1763103002636,
            "Source": "corporate_action"
        },
        {
            "Title": "JHS Svendgaard Laboratories Reappoints Nikhil Nanda as Managing Director for 5 Years",
            "Summary": "JHS Svendgaard Laboratories Limited has reappointed Nikhil Nanda as Managing Director for a five-year term from July 2, 2025, until the conclusion of the 26th Annual General Meeting in 2030. The appointment was approved by company members on September 20, 2025. Nanda is a first-generation entrepreneur with over 30 years of experience in the FMCG industry, holding a Business Management degree with double majors in Finance and Marketing from FORE School of Management, New Delhi. He started his company in 1997 and took it public with a $10 million IPO in 2006. Nanda is not related to any other directors or key managerial personnel of the company and is not debarred from holding directorial positions.",
            "Sentiment": "positive",
            "PublishDate": 1758535749114,
            "Source": "corporate_governance"
        },
        {
            "Title": "JHS Svendgaard Laboratories Reports Quarterly Profit, Appoints New Auditors",
            "Summary": "JHS Svendgaard Laboratories approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported a standalone net profit of Rs. 105.57 lakhs compared to a loss of Rs. 62.80 lakhs in the same quarter last year. Revenue from operations was Rs. 2,345.41 lakhs. The Board recommended appointing M/s. Dahiya & Associates as Secretarial Auditors and M/s V.K. Khosla & Co. as Statutory Auditors for five consecutive years from 2025-26 to 2029-30, subject to shareholder approval. The Board deferred decision on the Employee Stock Option Scheme 2025 for comprehensive review. The Audit Committee was reconstituted following completion of Mr. Mukul Pathak's tenure, with Kapil Minocha appointed as Chairperson.",
            "Sentiment": "positive",
            "PublishDate": 1755012539675,
            "Source": "earnings"
        }
    ]
}