{
    "Symbol": "JINDWORLD",
    "ISIN": "INE247D01039",
    "News": [
        {
            "Title": "Jindal Worldwide Issues ₹6.89 Cr Corporate Guarantee",
            "Summary": "Jindal Worldwide Limited provides corporate guarantee of ₹6.89 crores to SIDBI for credit facility extended to its wholly-owned subsidiary Planet Spinning Mills Private Limited for machinery purchase.",
            "Sentiment": "neutral",
            "PublishDate": 1765458685550,
            "Source": "stocks"
        },
        {
            "Title": "Jindal Worldwide Reports Mixed Quarterly Performance with Revenue Decline and Subsidiary Restructuring",
            "Summary": "Jindal Worldwide Limited announced unaudited financial results for the quarter ended September 30, 2025, showing standalone revenue from operations of INR 54,810.89 lakhs compared to INR 56,758.92 lakhs in the previous year quarter. The company underwent significant corporate restructuring during the period, disposing of 51% stake in Goodcore Spintex Private Limited in August 2025, converting it from a subsidiary to an associate, and earlier sold its stake in Kashyap Tele-Medicines Limited in May 2025.",
            "Sentiment": "negative",
            "PublishDate": 1763067819069,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Worldwide Re-appoints Chairman and Names New Auditors at Annual Meeting",
            "Summary": "Jindal Worldwide Limited shareholders approved the re-appointment of Dr. Yamunadutt Agrawal as Chairman & Director at their 39th Annual General Meeting held on September 16, 2025. Dr. Agrawal, who has 51 years of experience in the textile industry, is the father of Vice Chairman & Managing Director Amit Agarwal. Shareholders also appointed M/s. R. Choudhary & Associates as Statutory Auditors and M/s. SPANJ & Associates as Secretarial Auditors, both for five-year terms from FY 2025-2026 to FY 2029-2030. R. Choudhary & Associates is a chartered accountants firm with over three decades of experience providing financial and advisory services. SPANJ & Associates is managed by four qualified Company Secretaries operating from Ahmedabad and Mumbai, specializing in corporate law compliance and SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1758103058607,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jindal Worldwide Approves Rs. 70 Crore Corporate Guarantee for Aegios Polyfilms",
            "Summary": "Jindal Worldwide Limited's Operational Committee has approved granting a corporate guarantee of Rs. 70 crore to Aegios Polyfilms Private Limited for additional working capital facilities. The guarantee will be issued in favor of PNB Investment Services Limited, the lender providing enhanced credit limits to Aegios Polyfilms. Both companies share a common director, Mr. Amit Yamunadutt Agrawal, though the transaction is conducted at arm's length. The corporate guarantee will be treated as a contingent liability in Jindal Worldwide's books of accounts.",
            "Sentiment": "neutral",
            "PublishDate": 1756382233556,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Worldwide Limited Approves Q1 FY26 Results and Schedules 39th AGM for September 16, 2025",
            "Summary": "Jindal Worldwide Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of INR 47,234.43 lakhs compared to INR 51,536.56 lakhs in the previous quarter, with profit after tax of INR 1,392.13 lakhs versus INR 742.65 lakhs in the same quarter last year. On a consolidated basis, revenue from operations was INR 53,989.74 lakhs against INR 48,743.07 lakhs in the corresponding quarter of the previous year, with profit after tax of INR 1,743.87 lakhs compared to INR 1,806.30 lakhs. The Board scheduled the 39th Annual General Meeting for September 16, 2025, to be conducted via video conferencing. The company operates primarily in textiles with a small electric vehicles segment and divested its stake in associate Kashyap Tele-Medicines Limited on May 20, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755177973081,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Worldwide Sells Majority Stake in Goodcore Spintec for ₹127.5 Million",
            "Summary": "Jindal Worldwide has sold a 51% stake in Goodcore Spintec for ₹127.5 million. This transaction represents a divestment of the company's majority holding in the subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1754486631057,
            "Source": "order&deals"
        },
        {
            "Title": "Jindal Worldwide's Unit to Launch 165 km Range Electric Vehicle",
            "Summary": "Jindal Worldwide's subsidiary is set to introduce an electric vehicle with a range of 165 km. The company has received approval for the vehicle, and production is ready. Additionally, the dealer network is expanding to 100 locations, indicating a significant push into the electric vehicle market.",
            "Sentiment": "positive",
            "PublishDate": 1751956349000,
            "Source": "default"
        },
        {
            "Title": "Jindal Worldwide Approves Sale of 51% Stake in Goodcore Spintec",
            "Summary": "Jindal Worldwide has approved the sale of a 51% stake in Goodcore Spintec to the company's promoter, Yamunadutt Agarwal. This transaction is classified as a related-party deal. The stake being sold contributes 11.02% of the company's revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1751110365000,
            "Source": "default"
        },
        {
            "Title": "Jindal Worldwide Reports Q4 Financial Results",
            "Summary": "Jindal Worldwide has released its Q4 financial results. The company's EBITDA for Q4 was 490 million rupees, compared to 555.4 million rupees in the same quarter last year. The EBITDA margin decreased to 8.09% from 9.68% year-over-year. The consolidated net profit for Q4 was 220 million rupees, down from 281.7 million rupees year-over-year, but up from 185 million rupees quarter-over-quarter. Q4 revenue increased to 6.1 billion rupees from 5.74 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748440034000,
            "Source": "result"
        },
        {
            "Title": "Jindal Worldwide Sells 2% Stake in Goodcore Spintex",
            "Summary": "Jindal Worldwide has sold a 2% stake in Goodcore Spintex. No further details about the transaction or the reasons behind the sale were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1748351171000,
            "Source": "default"
        },
        {
            "Title": "Jindal Worldwide Expands Retail Presence with 139 New Stores for Premium Brand 'Riccora'",
            "Summary": "Jindal Worldwide has announced the launch of 139 stores across India for its premium textile brand, 'Riccora - The Joy of Luxury.' This significant expansion marks a major step in the company's retail strategy and brand development efforts.",
            "Sentiment": "positive",
            "PublishDate": 1740992111000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Worldwide Sets Record Date for Bonus Share Issuance",
            "Summary": "Jindal Worldwide has announced February 28 as the record date to determine eligible shareholders for the company's upcoming bonus equity share distribution.",
            "Sentiment": "positive",
            "PublishDate": 1739975169000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Worldwide Reports Q3 EBITDA and Margin Results",
            "Summary": "Jindal Worldwide has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 507 million rupees, compared to 506 million rupees in the same quarter last year, showing a slight increase. However, the EBITDA margin decreased to 8.12% from 11.57% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1739364248000,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Worldwide Reports Q3 Financial Results",
            "Summary": "Jindal Worldwide has released its Q3 financial results. The company reported a consolidated net profit of 184 million rupees, compared to 210 million rupees year-over-year and 173 million rupees quarter-over-quarter. Revenue for Q3 increased to 6.24 billion rupees from 4.38 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739364189000,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Worldwide Announces 4:1 Bonus Share Issue",
            "Summary": "Jindal Worldwide has announced the issuance of bonus shares in the proportion of 4:1. This means that for every one share held, shareholders will receive four additional shares.",
            "Sentiment": "positive",
            "PublishDate": 1736295317000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Worldwide Announces 4:1 Bonus Share Issue",
            "Summary": "Jindal Worldwide has announced the issuance of bonus shares in a ratio of 4:1. This means shareholders will receive 4 additional shares for every 1 share they currently hold.",
            "Sentiment": "positive",
            "PublishDate": 1736257992000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Worldwide: Textile Stock Surges 5,071% in 11 Years",
            "Summary": "Jindal Worldwide shares rose from ₹6.10 in 2013 to ₹315.40 in 2024, a 5,071% gain. Q2FY25 revenue increased 45.7% YoY to ₹570.8 crore, with PAT up 35.2% YoY to ₹17.3 crore. EBITDA grew 38.3% YoY to ₹48.4 crore.",
            "Sentiment": "positive",
            "PublishDate": 1732190717000,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Worldwide: Q2FY25 Results Show Strong Growth",
            "Summary": "Jindal Worldwide reported a 47% increase in net sales to Rs 570.81 crores and a 36% rise in net profit to Rs 17.32 crores for Q2FY25 compared to Q2FY24. For H1FY25, net sales grew by 33% to Rs 1,063.30 crore, and net profit increased by 34% to Rs 35.39 crore year-on-year. The company's stock was priced at Rs 326.25 per share, with a 52-week high of Rs 439.80 and a low of Rs 268.",
            "Sentiment": "positive",
            "PublishDate": 1732184759000,
            "Source": "result"
        },
        {
            "Title": "Jindal Worldwide Reports Q2 FY24 Financial Results",
            "Summary": "Jindal Worldwide announced its Q2 FY24 financial results. The company's consolidated net profit increased to 173 million rupees, up from 128 million rupees year-over-year and 181 million rupees quarter-over-quarter. Revenue for Q2 rose to 5.7 billion rupees, compared to 3.91 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731502341000,
            "Source": "result"
        }
    ]
}