{
    "Symbol": "JINDALPHOT",
    "ISIN": "INE796G01012",
    "News": [
        {
            "Title": "Jindal Photo Board Meet Set for Feb 13 Q3 Results",
            "Summary": "Jindal Photo Limited schedules board meeting on February 13, 2026 to consider Q3FY26 standalone and consolidated unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770748963237,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jindal Photo Gets 9.89 Cr Shares in Demerger Deal",
            "Summary": "Jindal Photo Limited receives 9.89 crore equity shares worth ₹10 each from Jindal India Power Limited following approved demerger scheme under NCLT sanction.",
            "Sentiment": "neutral",
            "PublishDate": 1768462736112,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jindal Photo Limited Reports Mixed Quarterly Results with Significant Associate Gains",
            "Summary": "Jindal Photo Limited approved unaudited financial results for the quarter and half year ended September 30, 2025, showing standalone loss of Rs. 74 lakhs but consolidated profit of Rs. 17,217 lakhs driven by Rs. 9,399 lakhs share from associates. The company faces ongoing legal disputes over coal mine compensation claims through joint venture MCCL, with auditors highlighting concerns about loan provisions and recoverable amounts.",
            "Sentiment": "neutral",
            "PublishDate": 1763050783420,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Photo Limited Reports Quarterly Loss Despite Strong Consolidated Performance",
            "Summary": "Jindal Photo Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported a net loss of Rs. 96 lakhs compared to Rs. 71 lakhs loss in the same quarter last year, with total income of Rs. 54 lakhs. However, consolidated results showed strong performance with net profit of Rs. 5,238 lakhs and earnings per share of Rs. 51.07, primarily driven by share of net profit from joint ventures and associates totaling Rs. 5,334 lakhs. The company operates primarily in investment business of shares and securities in group companies. Key matters include ongoing legal proceedings related to compensation claims from coal mine operations through joint venture Mandakini Coal Company Limited, and a pending demerger scheme involving associate company Jindal India Powertech Limited's power business division.",
            "Sentiment": "neutral",
            "PublishDate": 1755096840565,
            "Source": "earnings"
        }
    ]
}