{
    "Symbol": "JINDALSAW",
    "ISIN": "INE324A01032",
    "News": [
        {
            "Title": "Jindal SAW Shows Bearish Reversal Pattern",
            "Summary": "Jindal SAW forms rounding top pattern on 1-hour chart, breaks below Rs 181 support with bearish indicators confirming potential near-term downside pressure amid weakening momentum.",
            "Sentiment": "negative",
            "PublishDate": 1769477698330,
            "Source": "stocks"
        },
        {
            "Title": "Jindal Saw Eyes Jal Jeevan Mission Support & GCC Growth",
            "Summary": "Jindal Saw anticipates continued government support for Jal Jeevan Mission in upcoming budget while expanding GCC operations with new facilities in Abu Dhabi and KSA expected by February 2028.",
            "Sentiment": "positive",
            "PublishDate": 1768881615074,
            "Source": "stocks"
        },
        {
            "Title": "Jindal SAW Q3 Net Profit Falls 48% to ₹260 Cr",
            "Summary": "Jindal SAW reports Q3 consolidated net profit of ₹260 crores, down 48% YoY from ₹500 crores. Revenue declined 6.3% to ₹4,940 crores while EBITDA margin compressed to 12.40%.",
            "Sentiment": "negative",
            "PublishDate": 1768795407008,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jindal Saw Q3FY26 Results: Revenue Up 19.3% YoY",
            "Summary": "Jindal Saw reported Q3FY26 consolidated revenue of ₹49,630 million, up 19.3% YoY. Order book reached record high of $1,481 million with strong pipeline execution ahead.",
            "Sentiment": "positive",
            "PublishDate": 1768564529580,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jindal Saw Q3 Consolidated Net Profit Falls 48% to ₹260cr",
            "Summary": "Jindal Saw reported Q3 consolidated net profit of ₹260 crores vs ₹500 crores YoY. Consolidated revenue declined to ₹494 crores from ₹527 crores, showing continued pressure on financial performance.",
            "Sentiment": "negative",
            "PublishDate": 1768563493302,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jindal Saw Q3 profit slumps 49% YoY; margins contract",
            "Summary": "Jindal Saw's Q3 net profit fell 49% to ₹258 cr, revenue declined 6.2% to ₹4,943 cr, and EBITDA margin contracted to 12.4% from 17.8% YoY amid operational pressures.",
            "Sentiment": "negative",
            "PublishDate": 1768563395863,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jindal Saw Q3FY26 Results Call Set for Jan 19, 2026",
            "Summary": "Jindal Saw Limited announces investor conference call scheduled for January 19, 2026 at 17:00 hrs IST to discuss Q3FY26 financial results, organized by ICICI Securities with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1768308915293,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jindal Saw Reports Sharp Decline in Q2 Financial Performance",
            "Summary": "Jindal Saw reported significantly lower quarterly results with revenue falling to 42.3 billion rupees from 55.72 billion rupees in the same period last year. The company's consolidated net profit dropped to 1.52 billion rupees compared to 5 billion rupees year-over-year. EBITDA declined to 4.5 billion rupees from 9.14 billion rupees, while EBITDA margin compressed to 10.7% from 16.41% in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1760692198279,
            "Source": "earnings"
        },
        {
            "Title": "CCI Officials Visit Jindal Saw Limited's Delhi Offices for Investigation",
            "Summary": "Competition Commission of India (CCI) officials visited Jindal Saw Limited's Delhi offices from September 15-16, 2025 in connection with an investigation. The company provided full cooperation to the authorities during the investigation process. Jindal Saw has committed to keeping stock exchanges updated on further developments regarding this matter. The visit has also been reported by media and news channels.",
            "Sentiment": "neutral",
            "PublishDate": 1758014689537,
            "Source": "stock"
        },
        {
            "Title": "Jindal Saw Reports Softer Q1 FY26 Results Despite Strong Order Book of $1.5 Billion",
            "Summary": "Jindal Saw Limited reported softer quarterly results compared to previous year and recent quarters despite maintaining robust demand and a strong order book. The company faced challenges including cash flow issues with EPC contractors in the water sector (which represents 60% of business), geopolitical conflicts in MENA regions causing export shipment deferrals of approximately 20,000 tons from Q1 to Q2, and scheduled maintenance shutdowns. One blast furnace in Mundra remained under maintenance for 2 months in Q1, impacting production by 40,000-50,000 tons, while the pellet plant in Bhilwara was under maintenance for over a month, resulting in loss of 120,000-130,000 tons of pellet production. Despite these challenges, the company maintained EBITDA of approximately 16%. Working capital borrowings increased while long-term debt decreased after prepaying the entire term loan for Sathavahana facility acquisition. The company now carries long-term debt of less than INR 600 crores, primarily INR 500 crores of LIC bonds payable in 2028-30. UAE operations performed well with sales of approximately $60 million and order book of $270 million. The company has announced three new projects in GCC and MENA regions: a seamless pipe plant in Abu Dhabi, a helical pipe plant in Saudi Arabia, and a DI facility in Saudi Arabia, expected to be operational in 2-3 years. Current order book stands at approximately $1.5 billion with 16 lakh tons of confirmed orders and 2.65 lakh tons of LOIs for ductile domestic market.",
            "Sentiment": "neutral",
            "PublishDate": 1754917118322,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Saw Makes Q1 FY26 Earnings Call Audio Recording Available Online",
            "Summary": "Jindal Saw Limited has published the audio recording of its earnings conference call on the company website. The conference call was organized by ICICI Securities Limited for analysts and investors to discuss the company's unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The call took place on August 06, 2025 at 15:00 IST, and the audio recording is now accessible on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1754497959638,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Saw Reports 25% Revenue Decline in Q1 FY26 Despite Maintaining Strong Order Book",
            "Summary": "Jindal Saw reported quarterly results with total income declining 25% to Rs 33,268 million compared to Rs 44,171 million in the same period last year. EBITDA dropped 34% to Rs 5,596 million, while profit after tax decreased 18% to Rs 3,640 million. The company's EBITDA margin compressed to 16.8% from 19.1% in the previous year. Production volumes fell across segments, with iron & steel pipes production down 11% to 389,000 MT and pellets production declining 25% to 321,000 MT. Sales volumes also decreased, with iron & steel pipes sales dropping 19% to 326,000 MT and pellets sales falling 46% to 222,000 MT. The company attributed the decline to scheduled maintenance of blast furnace and pellet plant, deferred export shipments due to military conflict in the MENA region, and increased receivables from domestic customers facing funding challenges. Despite operational challenges, Jindal Saw maintains a strong order book of $1,305 million for pipes and pellets, expected to be executed over 9-12 months. The company announced three new projects in UAE and Saudi Arabia with combined investment of approximately $428 million, including a seamless pipe facility, HSAW pipe project, and ductile iron pipe project. CARE Ratings reaffirmed the company's credit ratings at CARE A1+ for short-term facilities and CARE AA with stable outlook for long-term debt facilities.",
            "Sentiment": "negative",
            "PublishDate": 1754390389959,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Saw Reports Strong Q1 FY26 Results with 363.94 Crores Net Profit, Announces Leadership Changes",
            "Summary": "Jindal Saw Limited announced its quarterly results for the period ended June 30, 2025, reporting net profit after tax of ₹363.94 crores on revenue from operations of ₹3,300.37 crores. The company's earnings per share stood at ₹5.71 (basic) and ₹5.69 (diluted). On a consolidated basis, the company reported net profit of ₹415.47 crores with revenue from operations of ₹4,084.68 crores. The Board approved several organizational changes including the designation change of Neeraj Kumar from Chief Financial Officer to Chief Operating and Financial Officer effective August 1, 2025, and Narendra Mantri's change from Group CEO and Whole Time Director to Non-Executive Non Independent Director effective August 5, 2025. The company also appointed Deloitte Haskins and Sells LLP as Internal Auditors for financial year 2025-26. The results highlighted that subsidiary Jindal ITF Limited has an ongoing appeal before Delhi High Court regarding an arbitral award of ₹1,891.08 crores.",
            "Sentiment": "positive",
            "PublishDate": 1754388567459,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Saw Reports Decline in Q1 Financial Performance",
            "Summary": "Jindal Saw reported quarterly results showing a decline across key financial metrics. Net profit decreased to 4.24 billion rupees from 4.4 billion rupees in the same period last year. EBITDA fell to 6.7 billion rupees compared to 8.4 billion rupees year-over-year, with EBITDA margin dropping to 16.4% from 17%. Revenue declined to 41 billion rupees from 49.4 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754387473551,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Saw Schedules Q1 FY26 Earnings Conference Call for August 6",
            "Summary": "Jindal Saw Ltd will host a conference call on August 6, 2025, at 15:00 IST to discuss its Q1 FY26 financial results. The call is organized by ICICI Securities Limited for analysts and investors. Company representatives include Vinay Kumar (President and Head Treasury), Narendra Mantri (President, Head Commercial & CFO), and Rajeev Goyal (Sr. Vice President, Head Corporate Finance). The call will be accessible through universal access numbers and toll-free numbers for international participants from Singapore, Hong Kong, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1754027403849,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Saw Ltd: Middle East Expansion Boosts Share Price",
            "Summary": "Jindal Saw Ltd. announced a $105 million investment for a seamless pipe plant in Abu Dhabi and two joint ventures in Saudi Arabia. The company's share price rose 6.09% following the news.",
            "Sentiment": "positive",
            "PublishDate": 1749530735000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal SAW Ltd: $118 Million Investment in Middle East Pipe Manufacturing",
            "Summary": "Jindal SAW Ltd approved three new international investments totaling $118 million to expand pipe manufacturing in the UAE and Saudi Arabia. The largest project is a $105 million seamless pipe facility in Abu Dhabi. Two joint ventures in Saudi Arabia will focus on helically spiral welded pipes and ductile iron pipes, with investments of $10 million and $3 million respectively.",
            "Sentiment": "positive",
            "PublishDate": 1749494110000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Saw Plans Joint Venture for Seamless Pipe Production in Saudi Arabia",
            "Summary": "Jindal Saw is planning to establish a joint venture with BUHUR in Saudi Arabia. The joint venture aims to set up a seamless pipe production facility in the UAE with a capacity of 300,000 tonnes per annum.",
            "Sentiment": "positive",
            "PublishDate": 1749469403000,
            "Source": "default"
        },
        {
            "Title": "Jindal Saw Ltd: Last Day to Buy Shares for Dividend Eligibility",
            "Summary": "June 5 is the last day to buy Jindal Saw Ltd shares to qualify for the Rs 2 per share final dividend for FY2025. The record date is June 4, with a total dividend payout of Rs 127.9 crore. The company's Q4 FY2025 results showed a 42% drop in net profit and a 7% decrease in revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1749006311000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Saw Expects Margin Growth and Volume Increase in Large Diameter Pipes",
            "Summary": "Jindal Saw anticipates incremental margin growth from value-added products such as threading, premium connection, OCTG, and stainless steel. The company maintains its EBITDA estimate of 19% to 20% for the coming year. Additionally, Jindal Saw expects to achieve a 10% to 15% volume growth in large diameter pipes over the next two to three years.",
            "Sentiment": "positive",
            "PublishDate": 1746501691000,
            "Source": "default"
        },
        {
            "Title": "Jindal Saw Reports Significant Debt Reduction in Q4",
            "Summary": "Jindal Saw's consolidated debt has decreased from 38 billion rupees to 29 billion rupees in the fourth quarter, representing a substantial quarter-over-quarter reduction.",
            "Sentiment": "positive",
            "PublishDate": 1746187818000,
            "Source": "default"
        },
        {
            "Title": "Jindal Saw Ltd: Q4 Revenue and Profit Decline Significantly",
            "Summary": "Jindal Saw Ltd reported a 7% decrease in Q4 FY2024-25 consolidated revenue to Rs 5,046.6 crore. Net profit fell 42% to Rs 291.28 crore. EBITDA declined 20% to Rs 736.2 crore with margin contraction to 14.6%. The board recommended a dividend of Rs 2 per share.",
            "Sentiment": "negative",
            "PublishDate": 1746183310000,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Saw Reports Q4 Financial Results",
            "Summary": "Jindal Saw has released its Q4 financial results, showing a decrease in revenue, EBITDA, and net profit compared to the same period last year. Revenue fell from 54.25 billion rupees to 50.5 billion rupees. EBITDA decreased from 9.2 billion rupees to 7.37 billion rupees, with the EBITDA margin dropping from 16.96% to 14.62%. Consolidated net profit declined from 5.02 billion rupees to 2.9 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1746179354000,
            "Source": "result"
        },
        {
            "Title": "Jindal Saw to Consider Q4 Results on May 2",
            "Summary": "Jindal Saw Limited has announced that it will consider and approve its financial results for the fourth quarter on May 2. This is a routine corporate announcement regarding the company's upcoming earnings release.",
            "Sentiment": "neutral",
            "PublishDate": 1745501939000,
            "Source": "default"
        },
        {
            "Title": "High Court Allows NTPC's Petition Against Arbitration Award Won by Jindal Saw's Unit",
            "Summary": "The High Court has ruled in favor of NTPC (National Thermal Power Corporation) by allowing their petition against an arbitration award previously won by a unit of Jindal Saw. This decision overturns the earlier arbitration result, potentially impacting the financial or contractual relationship between NTPC and Jindal Saw's subsidiary.",
            "Sentiment": "negative",
            "PublishDate": 1738567763000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jindal Saw Reports Q3 Revenue Decline",
            "Summary": "Jindal Saw, a major player in the pipe manufacturing industry, has reported its third-quarter revenue figures. The company's revenue for Q3 stood at 52.7 billion rupees, showing a decline from 56.6 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1737706920000,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Saw Reports Q3 EBITDA and Margin Results",
            "Summary": "Jindal Saw has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 9.40 billion rupees, compared to 9.87 billion rupees in the same quarter last year. Despite the slight decrease in EBITDA, the company's EBITDA margin improved to 17.83% from 17.46% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737706849000,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Saw Reports Q3 Consolidated Net Profit of 5 Billion Rupees",
            "Summary": "Jindal Saw, a major Indian pipe manufacturer, has reported its third-quarter consolidated net profit at 5 billion rupees. This represents a slight decrease from the 5.3 billion rupees reported in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1737706760000,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Saw Acquires 31.20% Stake in Renewable Energy Company",
            "Summary": "Jindal Saw has entered into a share purchase agreement to acquire a 31.20% stake in Renew Green MHH One Pvt Ltd, a company involved in power generation from renewable sources. This acquisition will make Renew Green MHH One Pvt Ltd an associate of Jindal Saw.",
            "Sentiment": "positive",
            "PublishDate": 1734441243000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Saw Aims for 15-20% Revenue from Value-Added Products",
            "Summary": "Jindal Saw has announced its focus on developing value-added products, with a goal to generate 15-20% of its revenue from these offerings. However, the company acknowledges that achieving this target is expected to take several years.",
            "Sentiment": "positive",
            "PublishDate": 1729567777000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Saw Announces Investment in Coke Oven Battery",
            "Summary": "Jindal Saw has announced plans to invest between 300 to 350 crore rupees in a coke oven battery project over the next few years, as revealed during a company conference call.",
            "Sentiment": "positive",
            "PublishDate": 1729567705000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Saw Anticipates Growth Surge in Coming Quarters",
            "Summary": "Jindal Saw expects significant growth after one or two quarters of stable performance. This growth is projected to be driven by improvements in their export portfolio and the introduction of new products with higher profit margins, as revealed in a recent conference call.",
            "Sentiment": "positive",
            "PublishDate": 1729567550000,
            "Source": "normal_news"
        },
        {
            "Title": "Jindal Saw Expects Continued High EBITDA Margins and Debt Reduction",
            "Summary": "Jindal Saw anticipates maintaining its current high EBITDA margins of 18-19% for at least the next few quarters. The company also expects to further reduce its debt in the upcoming quarter, as stated in a recent concall update.",
            "Sentiment": "positive",
            "PublishDate": 1729567485000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Saw Reports Improved Q2 Financial Performance",
            "Summary": "Jindal Saw has reported its Q2 financial results, showing improvements in both EBITDA and EBITDA margin compared to the same period last year. The company's EBITDA increased from 8.04 billion rupees to 9.14 billion rupees, while the EBITDA margin improved from 14.71% to 16.41%.",
            "Sentiment": "positive",
            "PublishDate": 1729254140000,
            "Source": "result"
        },
        {
            "Title": "Jindal Saw Reports Q2 Revenue",
            "Summary": "Jindal Saw, an Indian manufacturing company, has reported its second quarter revenue of 55.72 billion rupees, compared to 55 billion rupees in the same quarter last year, showing a slight year-over-year increase.",
            "Sentiment": "neutral",
            "PublishDate": 1729254131000,
            "Source": "result"
        },
        {
            "Title": "Jindal Saw Reports Significant Profit Increase in Q2",
            "Summary": "Jindal Saw, an Indian manufacturing company, has reported a consolidated net profit of 5 billion rupees for the second quarter. This represents a year-over-year increase from 3.7 billion rupees and a quarter-over-quarter increase from 4.4 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1729254122000,
            "Source": "result"
        },
        {
            "Title": "Jindal Saw Schedules Board Meeting for Q2 Results",
            "Summary": "<p><span class='neutral'>Jindal Saw</span> has announced a <b>board meeting</b> scheduled for <span class='neutral'>October 18</span> to consider and approve the company's <span class='neutral'>financial results</span> for the <b>second quarter</b> of the fiscal year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728560782000,
            "Source": "corporate_action"
        }
    ]
}