{
    "Symbol": "JINDALSTEL",
    "ISIN": "INE749A01030",
    "News": [
        {
            "Title": "Jindal Steel Shifts Focus to Flat Products",
            "Summary": "Jindal Steel announces strategic shift towards flat products, targeting 55% flat and 45% long product ratio by Q4 FY26, with plans to achieve 70% value-added profile as production capacities expand.",
            "Sentiment": "positive",
            "PublishDate": 1770003006953,
            "Source": "stocks"
        },
        {
            "Title": "Jindal Steel Expands Angul Capacity to 15.6 MT by Q4 FY26",
            "Summary": "Jindal Steel to commission Basic Oxygen Furnace-III at Angul facility by Q4 FY26, boosting production capacity to 15.6 million tonnes with slurry pipeline completion expected by FY26 end.",
            "Sentiment": "positive",
            "PublishDate": 1770002979131,
            "Source": "stocks"
        },
        {
            "Title": "Jindal Steel Targets 8.5-9 Million Tonnes Sales in FY26",
            "Summary": "Jindal Steel expects to meet its FY26 sales target of 8.5 to 9 million tonnes with strong Q4 performance and aims to reduce net debt to EBITDA below 1.5x as production increases.",
            "Sentiment": "positive",
            "PublishDate": 1770002947858,
            "Source": "stocks"
        },
        {
            "Title": "Jindal Steel Sees Rising Costs, Strong Steel Prices",
            "Summary": "Jindal Steel anticipates coking coal costs to increase by $18-20 per tonne in Q4 FY26, while domestic steel prices have risen INR3,000-3,500 per tonne since December 2024, with strong demand expected to sustain pricing.",
            "Sentiment": "neutral",
            "PublishDate": 1770002911106,
            "Source": "stocks"
        },
        {
            "Title": "Jindal Steel Q3FY26 Earnings Call Set for Jan 31",
            "Summary": "Jindal Steel Limited announces earnings conference call scheduled for January 31, 2026, at 2:00 pm IST to discuss Q3FY26 results with senior management participation including CEO and CFO.",
            "Sentiment": "neutral",
            "PublishDate": 1769584831492,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jindal Steel Q3 FY25 Results on January 30",
            "Summary": "Jindal Steel & Power Limited has scheduled the review of its third quarter financial results for the fiscal year 2024-25 on January 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768806333797,
            "Source": "co_actions_results"
        },
        {
            "Title": "Thyssenkrupp Confirms Talks With Jindal Steel For Sale",
            "Summary": "Thyssenkrupp officially confirms confidential talks with Jindal Steel International for potential sale of steel business, with due diligence ongoing since October and phased acquisition structure under consideration.",
            "Sentiment": "positive",
            "PublishDate": 1767754994401,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jindal Steel Plans Capacity Expansion at Raigarh",
            "Summary": "Jindal Steel announces plans to double structural steel capacity at its Raigarh facility to 2.4 MTPA by mid-2028, with capability to manufacture India's largest parallel flange sections up to 1,100 mm depth.",
            "Sentiment": "positive",
            "PublishDate": 1766979976336,
            "Source": "stocks"
        },
        {
            "Title": "Kotak Cuts JSPL Target Price on Steel Headwinds",
            "Summary": "Kotak Securities reduces Jindal Steel target price from ₹1,250 to ₹1,150 while maintaining buy rating, citing near-term steel pricing pressure but positive long-term outlook on capacity expansions.",
            "Sentiment": "neutral",
            "PublishDate": 1766719500067,
            "Source": "stocks"
        },
        {
            "Title": "Nuvama cuts Jindal Steel target but sees 25% upside",
            "Summary": "Nuvama reduced Jindal Steel's price target by 9.7% to ₹1,264 but maintains buy rating, citing 24.8% upside potential despite near-term steel spread pressures from falling prices and higher production costs.",
            "Sentiment": "neutral",
            "PublishDate": 1766588347724,
            "Source": "stocks"
        },
        {
            "Title": "Jindal Cement Increases Stake to 0.32% in Jindal Steel",
            "Summary": "Jindal Cement Industries acquired additional 2.44 lakh shares of Jindal Steel through open market, increasing total holding to 33.26 lakh shares representing 0.32% stake.",
            "Sentiment": "neutral",
            "PublishDate": 1765473975515,
            "Source": "stocks"
        },
        {
            "Title": "Jindal Cement Industries Acquires 0.24% Stake in Jindal Steel Limited",
            "Summary": "Jindal Cement Industries Private Limited acquired 25,34,369 shares (0.24% stake) in Jindal Steel Limited through open market transactions on December 5, 2025. The acquisition was disclosed under SEBI takeover regulations, with Jindal Cement being part of the promoter group of Jindal Steel Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1765344155939,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Cement Industries Acquires 0.24% Stake in Jindal Steel Limited",
            "Summary": "Jindal Cement Industries Private Limited acquired 24,82,082 shares (0.24% stake) in Jindal Steel Limited through open market transactions on December 3, 2025. The acquisition was disclosed under SEBI takeover regulations, with the target company maintaining an equity share capital of Rs. 1,02,00,88,097 comprising 1,02,00,88,097 equity shares of Re. 1 each.",
            "Sentiment": "neutral",
            "PublishDate": 1765015516960,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Cement Industries Acquires 0.21% Stake in Jindal Steel Limited",
            "Summary": "Jindal Cement Industries Private Limited acquired 21,57,624 shares representing 0.21% stake in Jindal Steel Limited through open market transactions on November 27, 2025. The acquisition was made by the promoter group entity and disclosed under SEBI substantial acquisition regulations, with Jindal Steel's total equity capital remaining at Rs. 1,02,00,88,097.",
            "Sentiment": "neutral",
            "PublishDate": 1764648678070,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Cement Industries Acquires 0.20% Stake in Jindal Steel Limited",
            "Summary": "Jindal Cement Industries Private Limited acquired 20,23,361 shares (0.20% stake) in Jindal Steel Limited through open market transactions on November 25, 2025. The acquisition was made by a promoter group entity as part of substantial shareholding disclosure requirements under SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764314349659,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Cement Industries Acquires Additional Stake in Jindal Steel Limited",
            "Summary": "Jindal Cement Industries Private Limited acquired 28,52,800 shares of Jindal Steel Limited through open market transactions on November 20, 2025, increasing their holding to 8,37,053 shares representing 0.08% of the company's total equity capital. The acquisition was made as part of the promoter group's shareholding activities in compliance with SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764044112865,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Steel Limited Shareholders Approve Five Key Resolutions Through Postal Ballot",
            "Summary": "Jindal Steel Limited shareholders approved five resolutions via remote e-voting concluded on November 22, 2025, including amendment to employee benefit scheme, appointment of Parimal Rai as Independent Director, and remuneration revisions for two Wholetime Directors. The resolutions received strong shareholder support with approval rates ranging from 81.75% to 99.99%, demonstrating investor confidence in the company's governance and compensation decisions.",
            "Sentiment": "positive",
            "PublishDate": 1763985740161,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Cement Industries Acquires 8.08 Lakh Shares in Jindal Steel Limited",
            "Summary": "Jindal Cement Industries Private Limited acquired 8,08,527 shares (0.079%) of Jindal Steel Limited through open market transactions on November 19, 2025. The acquisition was made by a promoter group entity, with the target company maintaining an equity share capital of Rs. 1,02,00,88,097 comprising 1,02,00,88,097 equity shares of Re. 1 each.",
            "Sentiment": "neutral",
            "PublishDate": 1763794320751,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Cement Industries Acquires Shares in Jindal Steel Limited, Becomes Promoter",
            "Summary": "Jindal Cement Industries Private Limited acquired shares in Jindal Steel Limited and has now been classified as part of the promoter and promoters group. The acquisition was completed on November 12, 2025, with Jindal Steel Limited having an equity share capital of Rs. 1,02,00,88,097 comprising 1,02,00,88,097 equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763364631808,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Steel Reports Q2 FY26 Results with New CEO Appointment and Major Capacity Expansions",
            "Summary": "Jindal Steel Limited announced quarterly results with production at 2 million tonnes, down 5% quarter-on-quarter, and sales volume at 1.87 million tonnes, declining 2% sequentially. Consolidated gross revenue fell 6% to INR 13,505 crores due to reduced sales volume and weaker steel prices. The company appointed Gautam Malhotra as CEO, who brings two decades of experience across operations, supply chain, and strategy. During the quarter, Jindal Steel commissioned two major plants at Angul - a 4.6 million tonne blast furnace and a 3 million tonne Basic Oxygen Furnace, more than doubling hot metal capacity to 8.85 million tonnes annually. Consolidated adjusted EBITDA stood at INR 1,875 crores with EBITDA per tonne at INR 10,010. The company faced a planned shutdown impact of approximately INR 174 crores during the quarter. Net debt decreased by INR 244 crores to INR 14,156 crores, maintaining debt-to-EBITDA ratio at 1.48x. Management expects steel prices to stabilize post-festive season as construction demand returns, while maintaining guidance for the full financial year.",
            "Sentiment": "neutral",
            "PublishDate": 1762328941677,
            "Source": "earnings"
        },
        {
            "Title": "Savitri Devi Jindal Transfers 1.13 Crore Jindal Steel Shares as Gift",
            "Summary": "Savitri Devi Jindal, a promoter group member of Jindal Steel & Power Limited, transferred 1,12,68,000 equity shares through an off-market gift transaction on October 7, 2022. Following this transfer, her shareholding decreased from 1,23,84,540 shares (1.21%) to 11,16,540 shares (0.11%) in the company. The disclosure was made under SEBI regulations for substantial acquisition of shares and takeovers. Jindal Steel & Power Limited has an equity share capital of Rs. 1,02,00,88,097 comprising 1,02,00,88,097 equity shares of Re. 1 each, and is listed on NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1761796175695,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Steel Maintains FY'26 Sales Target, Plans INR 4,925 Crores Capex",
            "Summary": "Jindal Steel maintains its sales volume target of approximately 2.5 million tonnes per quarter for FY'26. The company aims to achieve 15.6 million tonnes steel production capacity by FY'26. Management expects coal costs to increase by $3-5 per tonne in Q3 FY'26, while iron ore costs are projected to remain steady. Domestic steel prices are 2-3% lower than Q2 levels. The company has allocated INR 4,925 crores for capital expenditure in H2 FY'26. Volume projections for FY'26-27 will be disclosed during the Q4 earnings call.",
            "Sentiment": "neutral",
            "PublishDate": 1761794980652,
            "Source": "stock"
        },
        {
            "Title": "Jindal Steel Reports Q2FY26 Results and Appoints New CEO",
            "Summary": "Jindal Steel Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. On a consolidated basis, the company reported steel production of 2.00 MT and steel sales of 1.87 MT for Q2FY26. Gross revenue stood at INR 13,505 crores with adjusted EBITDA of INR 1,875 crores and profit after tax of INR 635 crores. For the half-year, steel production was 4.09 MT with sales of 3.78 MT, gross revenue of INR 27,841 crores, and PAT of INR 2,131 crores. The company commissioned India's second largest blast furnace (4.6 MTPA capacity) and a 3 MTPA Basic Oxygen Furnace at Angul, increasing total steelmaking capacity from 9.6 to 12.6 MTPA. Consolidated net debt decreased to INR 14,156 crores from INR 14,400 crores. The Board also appointed Gautam Malhotra as Chief Executive Officer and Key Managerial Personnel, effective October 28, 2025. Malhotra brings 19+ years of experience and has been associated with the company since May 2024.",
            "Sentiment": "positive",
            "PublishDate": 1761656082048,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Steel Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Jindal Steel reported quarterly consolidated net profit of 6.38 billion rupees, declining from 8.6 billion rupees year-over-year, though slightly below the estimated 6.4 billion rupees. Revenue increased to 116.85 billion rupees from 112.13 billion rupees year-over-year, exceeding estimates of 111.55 billion rupees. EBITDA decreased to 20.81 billion rupees from 22 billion rupees year-over-year, while surpassing estimates of 19.62 billion rupees. EBITDA margin compressed to 17.81% from 19.62% year-over-year, marginally above the estimated 17.6%.",
            "Sentiment": "neutral",
            "PublishDate": 1761654503515,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Steel Initiates Postal Ballot for ESOP Amendment and Director Appointments",
            "Summary": "Jindal Steel Limited has initiated a postal ballot process for shareholders to vote on five key resolutions. The company seeks approval to amend its Employee Benefit Scheme 2022, extending the maximum vesting period to 40 years and modifying exercise price parameters. The ballot also includes appointment of Parimal Rai as Independent Director for four years, amendment to the Memorandum of Association to include research activities for carbon capture and decarbonization, and revision of remuneration for Wholetime Directors Sabyasachi Bandyopadhyay and Damodar Mittal. Remote e-voting commenced October 24, 2025 and ends November 22, 2025, with results to be announced by November 25, 2025. The ESOP scheme covers up to 5.1 crore options convertible to equity shares, with eligibility extended to employees of subsidiary, associate, and holding companies.",
            "Sentiment": "neutral",
            "PublishDate": 1761232663262,
            "Source": "corporate_action"
        },
        {
            "Title": "Thyssenkrupp CEO Says Jindal Steel Takeover Talks Are Intensive, Deal May Take Months",
            "Summary": "Thyssenkrupp CEO Miguel Lopez stated that takeover discussions with Jindal Steel International regarding the German company's steel business are intensive and constructive, but a deal would likely take months to complete. Jindal Steel has submitted a non-binding bid for Thyssenkrupp Steel Europe (TKSE). Thyssenkrupp is examining the offer with focus on economic sustainability, green transformation continuation, and employment protection at steel sites. Lopez made these comments while attending the stock market debut of TKMS naval vessels unit at the Frankfurt stock exchange.",
            "Sentiment": "neutral",
            "PublishDate": 1760952599305,
            "Source": "order&deals"
        },
        {
            "Title": "Thyssenkrupp and Kretinsky End Steel Joint Venture Talks, Opening Path for Jindal Steel Takeover",
            "Summary": "Thyssenkrupp and Czech tycoon Daniel Kretinsky have mutually agreed to abandon plans for a 50/50 joint venture for Thyssenkrupp Steel Europe. The EP Group will return its 20 percent stake in TKSE to Thyssenkrupp and receive reimbursement for the purchase price. This development clears a potential obstacle for Jindal Steel's takeover bid for Germany's largest steelmaker. Jindal Steel made a non-binding offer for TKSE in September, which Thyssenkrupp said it would carefully review with particular attention to job implications. The EP Group stated it respects Thyssenkrupp's preference to focus discussions with Jindal Steel International. Thyssenkrupp wants to divest its struggling steel unit facing cheaper Asian competition. TKSE announced plans to cut 11,000 jobs by 2030 and reduce production capacity from 11.5 million tons to 9 million tons annually.",
            "Sentiment": "neutral",
            "PublishDate": 1759457669133,
            "Source": "order&deals"
        },
        {
            "Title": "Jindal Steel Commissions 3 MTPA Basic Oxygen Furnace, Expands Angul Capacity to 9 MTPA",
            "Summary": "Jindal Steel has successfully commissioned a 250 MT Basic Oxygen Furnace (BOF) Converter at its Angul integrated steel plant, adding 3 MTPA of crude steelmaking capacity. The expansion increases the company's total capacity at Angul from 6 MTPA to 9 MTPA, with the first heat already tapped from the new facility. The commissioning works in conjunction with Blast Furnace 2 to synchronize hot metal and steelmaking capacities, ensuring higher throughput into downstream products. Chairman Naveen Jindal stated that the new BOF strengthens India's steel self-reliance capabilities. The company aims to achieve 12 MTPA capacity at Angul within the current financial year. Jindal Steel operates with a mine-to-metal model and has an investment footprint exceeding USD 12 billion across facilities in Angul, Raigarh, and Patratu.",
            "Sentiment": "positive",
            "PublishDate": 1759203360605,
            "Source": "stock"
        },
        {
            "Title": "Jindal Steel Becomes India's First Diversified Large Enterprise Recognized as NCVET Awarding Body",
            "Summary": "Jindal Steel has been recognized as an Awarding Body by the National Council for Vocational Education and Training (NCVET) under the Ministry of Skill Development & Entrepreneurship. The company is the first diversified large Indian enterprise and first integrated steel manufacturer to receive this recognition. The designation grants Jindal Steel PAN-India jurisdiction to design industry-aligned skilling programmes under the National Education Policy and National Credit Framework, focusing on decarbonisation, circular economy, and advanced technologies. Chairman Naveen Jindal stated the recognition allows the company to bring industry standards directly into education and skilling for young Indians. Jindal Steel operates with an investment footprint exceeding USD 12 billion and runs facilities in Angul, Raigarh, and Patratu, with strategic operations across India and Africa.",
            "Sentiment": "positive",
            "PublishDate": 1758948115259,
            "Source": "stock"
        },
        {
            "Title": "Jindal Steel Commissions 5 MTPA Blast Furnace at Angul, Doubles Hot Metal Capacity to 9 MTPA",
            "Summary": "Jindal Steel has commissioned the Bhagavati Subhadrika Blast Furnace – II at its Angul facility in Odisha, adding 5 MTPA capacity and doubling the plant's hot metal production from 4 MTPA to 9 MTPA. The blast furnace, with a useful volume of 5,499 m², ranks among the world's largest and most advanced. Chairman Naveen Jindal led the ceremonial blow-in and stated the expansion strengthens global competitiveness while supporting Atmanirbhar Bharat. The commissioning establishes Angul as Odisha's largest single-location steel plant and positions it as the centerpiece of Jindal Steel's growth strategy toward achieving 12 MTPA capacity. The company plans additional developments at Angul including a dedicated port at Paradeep, slurry pipeline, coal pipe conveyor, the Shreebhoomi Power Plant, and new coke oven facilities.",
            "Sentiment": "positive",
            "PublishDate": 1758877883529,
            "Source": "stock"
        },
        {
            "Title": "Jindal Steel Limited Appoints Rahul Arora as Interim Company Secretary & Compliance Officer",
            "Summary": "Jindal Steel Limited appointed Mr. Rahul Arora as Company Secretary & Compliance Officer in an interim capacity with immediate effect. The appointment was approved by the Board of Directors on September 20, 2025, based on recommendations from the Nomination and Remuneration Committee. Arora, an Associate Member of the Institute of Company Secretaries of India with nearly a decade of experience in secretarial and compliance functions, has been with the company since October 2015, working in the Corporate Secretariat department on governance and compliance matters. He is not related to any Director or Key Managerial Personnel of the company. His appointment terms align with the company's HR policy.",
            "Sentiment": "neutral",
            "PublishDate": 1758358002058,
            "Source": "corporate_governance"
        },
        {
            "Title": "German Union IG Metall Endorses Jindal Steel's Bid for Thyssenkrupp Steel Unit",
            "Summary": "German union IG Metall has praised Jindal Steel's offer for Thyssenkrupp's steel unit, describing it as positive news for employees. The union's endorsement suggests support for the potential acquisition from a labor perspective.",
            "Sentiment": "positive",
            "PublishDate": 1758026639714,
            "Source": "order&deals"
        },
        {
            "Title": "Jindal Steel International Makes Non-Binding Offer for ThyssenKrupp Steel Europe",
            "Summary": "ThyssenKrupp has received a non-binding offer from Jindal Steel International for the purchase of ThyssenKrupp Steel Europe. The offer represents a potential acquisition move by the Indian steel company for the German steelmaker's European operations.",
            "Sentiment": "neutral",
            "PublishDate": 1758024509057,
            "Source": "order&deals"
        },
        {
            "Title": "Jindal Steel Co Chairman Supports Proposed Import Tax to Curb Steel Imports",
            "Summary": "Jindal Steel And Power's Co Chairman stated that a proposed import tax would be effective in reducing steel imports into the country. The executive expressed confidence in the tax measure's potential impact on import volumes.",
            "Sentiment": "positive",
            "PublishDate": 1757313341325,
            "Source": "stock"
        },
        {
            "Title": "Jindal Power Limited Acquires 5,556 Equity Shares in Jindal Steel Limited",
            "Summary": "Jindal Power Limited acquired 5,556 equity shares of Jindal Steel Limited through open market purchase on September 1, 2025. The acquisition increased Jindal Power's shareholding from 1,20,45,827 shares to 1,20,51,383 shares, maintaining its ownership percentage at 1.181% of Jindal Steel's total share capital. Jindal Power is part of the promoter group of Jindal Steel Limited. The transaction was disclosed under SEBI regulations for substantial acquisition of shares and takeovers. Jindal Steel Limited's total equity share capital remains at 1,02,00,88,097 shares and is listed on BSE and National Stock Exchange of India.",
            "Sentiment": "neutral",
            "PublishDate": 1756980438401,
            "Source": "corporate_action"
        },
        {
            "Title": "DRDO Transfers Three Advanced Material Technologies to JSPL for Defence Steel Production",
            "Summary": "DRDO has handed over three advanced material technologies to JSPL to enable the production of DMR-1700 steel sheets and plates for defence applications. This technology transfer will allow JSPL to manufacture specialized steel products for defence sector requirements.",
            "Sentiment": "positive",
            "PublishDate": 1756970811989,
            "Source": "stock"
        },
        {
            "Title": "Jindal Power Limited Acquires Additional 88,124 Shares in Jindal Steel Limited",
            "Summary": "Jindal Power Limited acquired 88,124 equity shares of Jindal Steel Limited through open market purchase on August 29, 2025. The acquisition increased Jindal Power's shareholding from 1.172% to 1.181% of Jindal Steel's total share capital. Jindal Power is part of the promoter group of Jindal Steel Limited. The shares of Jindal Steel Limited are listed on BSE and National Stock Exchange of India Limited. The total equity share capital of Jindal Steel Limited remains at 1,02,00,88,097 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1756966369003,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Steel & Power Executes ₹87.30 Crore Block Trade on NSE",
            "Summary": "Jindal Steel & Power completed a block trade worth ₹87.30 crores on the National Stock Exchange. The transaction involved approximately 859,086 shares at a price of ₹1,016.15 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1755757817395,
            "Source": "order&deals"
        },
        {
            "Title": "India Imposes 5-Year Anti-Dumping Duty on Hot Rolled Steel Imports from Vietnam",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has imposed a 5-year anti-dumping duty on certain hot rolled steel imports from Vietnam. The measure is designed to protect the domestic steel industry from unfair trade practices.",
            "Sentiment": "positive",
            "PublishDate": 1755141312213,
            "Source": "stock"
        },
        {
            "Title": "Jindal Steel Reports 20% QoQ Jump in Adjusted EBITDA for Q1FY26",
            "Summary": "Jindal Steel Limited announced its unaudited financial results for Q1FY26 ended June 30, 2025. The company reported steel production of 2.09 MT and sales of 1.90 MT. Consolidated gross revenue stood at INR 14,336 crores, down 8% quarter-on-quarter. Adjusted EBITDA improved 20% QoQ to INR 2,984 crores, while PAT reached INR 1,496 crores, representing a 36% QoQ increase. Export share increased to 7% from 3% in the previous quarter. Net debt rose to INR 14,400 crores from INR 11,957 crores, with debt-to-EBITDA ratio at 1.49x. The company invested INR 2,226 crores in capex, primarily for Angul expansion projects. Key operational milestones include commissioning India's second-largest blast furnace at Angul, a 0.20 MTPA Continuous Galvanizing Line, and securing the Roida-I Iron Ore and Manganese Block in Odisha with 3 MTPA capacity.",
            "Sentiment": "positive",
            "PublishDate": 1755009245914,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Steel & Power Reports Mixed Q1 Results with Profit Growth Despite Revenue Decline",
            "Summary": "Jindal Steel & Power reported consolidated net profit of 14.9 billion rupees in Q1, up from 13.4 billion rupees in the same period last year. However, revenue declined to 123 million rupees from 136 billion rupees year-over-year. EBITDA increased to 30 billion rupees from 28 billion rupees, while EBITDA margin improved to 24.46% from 20.85% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1755005811122,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Steel Sets Record Date for Rs. 2 Final Dividend Payment",
            "Summary": "Jindal Steel Limited has set Friday, August 22, 2025, as the record date to determine shareholder eligibility for a final dividend of Rs. 2 per equity share for financial year 2024-25. The dividend represents 200% of the face value of Re. 1 per share. Shareholders holding equity shares on the record date will be eligible to receive the dividend payment.",
            "Sentiment": "positive",
            "PublishDate": 1754657937137,
            "Source": "corporate_action"
        },
        {
            "Title": "Dr. Bhaskar Chatterjee Completes Second Term as Independent Director at Jindal Steel Limited",
            "Summary": "Dr. Bhaskar Chatterjee concluded his second term as Independent Director of Jindal Steel Limited on July 28, 2025. He had been appointed for a second term of two consecutive years starting from July 29, 2023. The Board of Directors and management expressed appreciation for his valuable guidance and contributions during his tenure as an Independent Director.",
            "Sentiment": "neutral",
            "PublishDate": 1753728573344,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jindal Steel & Power Rebrands to Jindal Steel Limited",
            "Summary": "Jindal Steel & Power has changed its company name to Jindal Steel Limited. The steel company has undergone this corporate rebranding exercise.",
            "Sentiment": "neutral",
            "PublishDate": 1753179755697,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Steel: Secures 50-Year Mining Lease for Odisha Iron Ore Block",
            "Summary": "Jindal Steel has obtained a 50-year mining lease for the Roida-I iron ore and manganese block in Odisha's Keonjhar district. The 104.84-hectare block has an environmental clearance capacity of 3 MTPA and a mineral deposit of 126.05 million tonnes. This acquisition enhances Jindal Steel's raw material security and supports its integrated steel production plans.",
            "Sentiment": "positive",
            "PublishDate": 1751615577000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Steel Wins Bid for Roida-I Iron Ore and Manganese Block in Odisha",
            "Summary": "Jindal Steel has received a Letter of Intent after successfully winning the bid for the Roida-I Iron Ore and Manganese Block located in Odisha. This development indicates the company's expansion in mineral resources and potentially strengthens its position in the steel industry.",
            "Sentiment": "positive",
            "PublishDate": 1751560714000,
            "Source": "default"
        },
        {
            "Title": "Jindal Steel Plans Capacity Expansion and Starts Galvanizing Line at Angul Plant",
            "Summary": "Jindal Steel has announced two significant developments at its Angul Integrated Steel Complex. The company plans to increase its crude steel capacity by 6 MTPA (Million Tonnes Per Annum) at the Angul plant this year. Additionally, Jindal Steel has started operations of its first galvanizing line at the same complex.",
            "Sentiment": "positive",
            "PublishDate": 1751257360000,
            "Source": "default"
        },
        {
            "Title": "Jindal Steel & Power to Hold Meetings with Investors",
            "Summary": "Jindal Steel & Power has scheduled one-on-one meetings with Government of Singapore Investment Corp and Systematix Group. The meetings are set to take place on June 23 and June 25 in Gurgaon.",
            "Sentiment": "neutral",
            "PublishDate": 1750299990000,
            "Source": "default"
        },
        {
            "Title": "Jindal Steel & Power: Name Change to Jindal Steel",
            "Summary": "Jindal Steel & Power Ltd. has officially changed its name to Jindal Steel Ltd. The board approved this change to align the company's brand identity with its core business focus. The company operates in steel, mining, power, and infrastructure sectors across India, Africa, and Australia.",
            "Sentiment": "neutral",
            "PublishDate": 1750093841000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Steel Outlines Production and Project Timelines",
            "Summary": "Jindal Steel provided updates on their production and project timelines during a conference call. Projects initiated two years ago are expected to yield benefits from FY '26, while recently announced projects will start delivering from FY '27 and '28. The company aims to exceed its guidance, focusing on optimizing its product portfolio. Sales volumes for FY '26 are projected to be between 8.5-9 million tonnes, with crude steel production expected to range from 9-10 million tonnes.",
            "Sentiment": "positive",
            "PublishDate": 1746155362000,
            "Source": "default"
        }
    ]
}