{
    "Symbol": "JINDALPOLY",
    "ISIN": "INE197D01010",
    "News": [
        {
            "Title": "Jindal Poly Films Appoints New Company Secretary",
            "Summary": "Jindal Poly Films Limited's Board of Directors approved the appointment of Ms. Rashmi Gupta as Company Secretary and Compliance Officer on February 07, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770711106518,
            "Source": "stocks"
        },
        {
            "Title": "Jindal Poly Films NCLT Petition Admitted",
            "Summary": "NCLT admits minority shareholders' petition under Section 245 against Jindal Poly Films. Company files appeal with stay application before NCLAT.",
            "Sentiment": "negative",
            "PublishDate": 1770458626172,
            "Source": "stocks"
        },
        {
            "Title": "Jindal Poly Films Q2FY26 Results Announced",
            "Summary": "Jindal Poly Films reported Q2FY26 results with net loss of ₹1,507 cr from continuing operations, revenue decline to ₹41,039 cr, and approved demerger scheme for non-woven business.",
            "Sentiment": "negative",
            "PublishDate": 1766758568464,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jindal Polyfilms Delays Q2 Financial Results Due to Resource Movement Issues",
            "Summary": "Jindal Polyfilms Limited postponed its board meeting scheduled for November 14, 2025, unable to finalize unaudited financial results for the quarter and half year ended September 30, 2025. The delay is attributed to movement of resources within the company and its subsidiaries, with the company requesting stock exchanges for extension and continuation of trading window closure.",
            "Sentiment": "negative",
            "PublishDate": 1763139846070,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Poly Films Company Secretary Ashok Yadav Resigns Due to Personal Reasons",
            "Summary": "Ashok Yadav has resigned from his position as Company Secretary and Compliance Officer at Jindal Poly Films Limited, effective November 9, 2025. The resignation is attributed to personal reasons. Yadav, who holds ACS certification number 14223, submitted his resignation letter to the Board of Directors requesting relief from office duties at the close of business hours on November 9, 2025. The company has notified stock exchanges NSE and BSE about this leadership change as required under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762796935870,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jindal Poly Films Shareholders Approve INR 3,000 Crore Increase in Investment Limits and Promoter Consent Amendment",
            "Summary": "Jindal Poly Films Limited shareholders at their 51st Annual General Meeting approved an increase in the company's limits for loans, investments, guarantees and securities from INR 12,000 crores to INR 15,000 crores. Additionally, shareholders approved an amendment to the Articles of Association requiring prior written consent from Promoter Group Entities for specific company matters when they collectively hold 50% or more of the total paid-up equity share capital or voting rights. The meeting was held on September 30, 2025, with voting results announced on October 3, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1759504125428,
            "Source": "corporate_action"
        },
        {
            "Title": "Anti-Dumping Investigation Launched on PET Film Imports from Four Countries",
            "Summary": "An anti-dumping investigation has been initiated on PET film imports from China, USA, Bangladesh, and Thailand. This investigation relates to Jindal Poly and concerns potential dumping practices in the PET film trade from these four countries.",
            "Sentiment": "neutral",
            "PublishDate": 1759232415112,
            "Source": "stock"
        },
        {
            "Title": "ED Conducts Raids on BC Jindal Group Directors and Employees Under FEMA Violations",
            "Summary": "The Enforcement Directorate conducted raids on directors and employees of BC Jindal Group, including Jindal Poly Films, under the Foreign Exchange Management Act (FEMA). The raids targeted 13 locations across Delhi NCR and Hyderabad. The enforcement action is related to allegations involving foreign investments and fund parking activities by the group.",
            "Sentiment": "negative",
            "PublishDate": 1758174191730,
            "Source": "stock"
        },
        {
            "Title": "Jindal Poly Films Approves Demerger of Nonwoven Business, Reports Strong Q1 Results",
            "Summary": "Jindal Poly Films Limited's board approved a scheme of arrangement to demerge its Nonwoven Fabrics Business division into Global Nonwovens Limited. The demerged division generated Rs. 671.23 crore turnover, representing 60% of the company's total revenue for the financial year ended March 31, 2025. Shareholders will receive 1 equity share of Global Nonwovens for every 4 shares held in Jindal Poly Films in a 4:1 ratio. The company reported strong quarterly results with standalone net profit of Rs. 926 crore for Q1 ended June 30, 2025, compared to Rs. 1,970 crore in the same quarter last year. Consolidated revenue from operations was Rs. 10,834 crore. The board also reappointed Gaurav Jain as internal auditor and appointed DMK Associates as secretarial auditor for five years. The demerger aims to unlock shareholder value through focused business approach and enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1755196599791,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Poly Films: Closure Notice Issued After Fire Incident",
            "Summary": "Industrial Safety Department issued a closure notice to Jindal Poly Films Ltd. following a major fire at its Nashik plant on May 21. The notice cites inadequate fire extinguishing systems and chemical leakage risks. This is the second major fire in 2.5 years at the same plant. Production is temporarily disrupted, and the company is assessing damages.",
            "Sentiment": "negative",
            "PublishDate": 1748337125000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jindal Poly Films: Fire Continues at Nashik Plant, 90% Production Impacted",
            "Summary": "A fire at Jindal Poly Films Ltd.'s subsidiary plant in Nashik, Maharashtra, continues for the fourth day, affecting 90% of production. The fire, which started Tuesday, has led to evacuations of nearby villages. Fire brigades from multiple districts are working to control the blaze, using foam due to the nature of the petroleum products involved. The company reports adequate insurance coverage and is assessing damages.",
            "Sentiment": "negative",
            "PublishDate": 1747976973000,
            "Source": "normal_news"
        },
        {
            "Title": "Jindal Poly Films: Share Price Plunges After Fire at Nashik Plant",
            "Summary": "Jindal Poly Films Ltd. shares dropped 8% following a fire at its subsidiary's Nashik plant on May 21. Production is temporarily halted, and damage assessment is ongoing. The plant has insurance coverage, and the company has informed the insurer.",
            "Sentiment": "negative",
            "PublishDate": 1747890950000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Poly Films: Fire Disrupts Operations at Subsidiary's Nashik Plant",
            "Summary": "A fire broke out at JPFL Films Private Limited's plant in Nashik, Maharashtra on May 21, 2025, at 1:00 AM, partially disrupting production. The plant is a material subsidiary of Jindal Poly Films Ltd. The company is assessing the damage and has notified insurers. The cause of the fire is still unknown.",
            "Sentiment": "negative",
            "PublishDate": 1747851316000,
            "Source": "normal_news"
        },
        {
            "Title": "Jindal Poly Films to Invest ₹700+ Crore in New Production Lines",
            "Summary": "Jindal Poly Films' unit plans to invest over ₹700 crore to establish new production lines for BOPP (42,000 TPA), PET (55,000 TPA), and CPP (18,000 TPA) films in Nashik, Maharashtra.",
            "Sentiment": "positive",
            "PublishDate": 1747104692000,
            "Source": "default"
        },
        {
            "Title": "Jindal Poly Films Reports Q3 Net Loss of 25 Million Rupees",
            "Summary": "Jindal Poly Films has reported a net loss of 25 million rupees in the third quarter, compared to a profit of 875 million rupees in the same period last year. However, the company's revenue increased to 1.87 billion rupees from 1.4 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739751427000,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Poly Films Reports Improved Q3 EBITDA Performance",
            "Summary": "Jindal Poly Films has announced its Q3 financial results, showing significant improvement in EBITDA. The company's EBITDA increased to 115 million rupees, up from 61 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 6.15% from 4.32% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739544536000,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Poly Films Reports Q3 Net Loss of 25 Million Rupees",
            "Summary": "Jindal Poly Films has reported a net loss of 25 million rupees for the third quarter, compared to a profit of 875 million rupees in the same period last year. However, the company's revenue increased to 1.87 billion rupees from 1.4 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739544530000,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Poly Films Reports Significant Increase in Q2 Other Income",
            "Summary": "Jindal Poly Films has reported a substantial increase in its other income for the second quarter. The company's other income rose to 2.7 billion rupees, compared to 943 million rupees in the same quarter of the previous year, marking a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731602344000,
            "Source": "result"
        },
        {
            "Title": "Jindal Poly Films Reports Significant Drop in Q2 EBITDA",
            "Summary": "Jindal Poly Films has reported a substantial decrease in its Q2 EBITDA, which fell to 74 million rupees from 172 million rupees year-over-year. The company's EBITDA margin also declined significantly, dropping to 4.22% from 11.57% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731602306000,
            "Source": "result"
        },
        {
            "Title": "Jindal Poly Films Reports Significant Profit Growth in Q2",
            "Summary": "Jindal Poly Films has announced its Q2 financial results, showing a substantial increase in net profit. The company reported a net profit of 1.84 billion rupees, up from 641 million rupees in the same quarter last year, representing a year-over-year growth. The profit also increased from 1.9 billion rupees in the previous quarter. Additionally, the company's revenue rose to 1.76 billion rupees from 1.49 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731602226000,
            "Source": "result"
        }
    ]
}