{
    "Symbol": "JINDRILL",
    "ISIN": "INE742C01031",
    "News": [
        {
            "Title": "Jindal Drilling Q3 EBITDA Falls to ₹717M",
            "Summary": "Jindal Drilling & Industries reports Q3 EBITDA of ₹717 million, down from ₹807 million year-over-year, with EBITDA margin declining to 29.68% from 33.69%.",
            "Sentiment": "negative",
            "PublishDate": 1769612790064,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jindal Drilling Q3FY26 Earnings Call on Jan 30",
            "Summary": "Jindal Drilling & Industries Limited has scheduled an earnings call on January 30, 2026, at 12:00 PM IST to discuss Q3FY26 results, organized by Antique Stock Broking Limited via virtual meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1769488829585,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jindal Drilling Board Meet Set for Jan 28, 2026",
            "Summary": "Jindal Drilling & Industries Limited has scheduled a board meeting on January 28, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768477864692,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jindal Drilling Promoters Increase Stake to 65.98%",
            "Summary": "Jindal Drilling & Industries promoter group increased shareholding from 64.25% to 65.98% through strategic acquisitions and sales between February-December 2025, adding 498,200 shares net.",
            "Sentiment": "positive",
            "PublishDate": 1766146475484,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maharashtra Seamless' Jack-up Rig Jindal Explorer Begins ONGC Operations",
            "Summary": "Maharashtra Seamless Limited's jack-up rig Jindal Explorer has commenced operations with Oil Natural Gas Corporation Limited (ONGC). The rig was chartered to Jindal Drilling & Industries Limited for a 3-year period and has now started operational activities.",
            "Sentiment": "positive",
            "PublishDate": 1763290551916,
            "Source": "stock"
        },
        {
            "Title": "Jindal Drilling & Industries Expects 35% Operating Margins, Links Growth to India's Oil and Gas Spending",
            "Summary": "Jindal Drilling & Industries stated that its future growth and profitability depend on increasing oil and gas spending in India. The company expects operating margins of around 35% and anticipates that upcoming quarters will perform similarly to past quarters, excluding one-time income from other sources.",
            "Sentiment": "positive",
            "PublishDate": 1762485975932,
            "Source": "stock"
        },
        {
            "Title": "Jindal Drilling & Industries Secures ₹1,369 Crore Order Book with ONGC Contracts",
            "Summary": "Jindal Drilling & Industries has secured a ₹1,369 crore order book through long-term contracts with ONGC. The company is currently operating four rigs and refurbishing one rig in the UAE. This positions the company for capacity expansion and improved margin visibility in offshore drilling operations through FY29.",
            "Sentiment": "positive",
            "PublishDate": 1762268217614,
            "Source": "order&deals"
        },
        {
            "Title": "Jindal Drilling Reports Strong Q2 Performance with Net Profit Surge to 1.27B Rupees",
            "Summary": "Jindal Drilling delivered robust quarterly results with net profit jumping to 1.27 billion rupees from 158.4 million rupees year-over-year. Revenue increased to 2.38 billion rupees compared to 1.72 billion rupees in the same period last year. EBITDA rose to 925.7 million rupees from 312.4 million rupees year-over-year. The company's EBITDA margin expanded significantly to 38.89% from 18.11% in the previous year period.",
            "Sentiment": "positive",
            "PublishDate": 1762260841871,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Drilling & Industries Reports Record Profit of ₹140.84 Crores for FY25",
            "Summary": "Jindal Drilling & Industries Limited announced its 41st Annual General Meeting scheduled for August 28, 2025. The company achieved record financial performance with net profit of ₹140.84 crores (standalone) and ₹215.90 crores (consolidated) for FY 2024-25, compared to ₹114.09 crores and ₹51.14 crores respectively in the previous year. Revenue increased to ₹827.95 crores from ₹617.01 crores. The company maintained high operational efficiency at 98.8% with zero Lost Time Incidents across all rigs. During the year, the company acquired jack-up rig 'Jindal Pioneer' for USD 75 million and operated multiple drilling rigs and equipment sets. The Board recommended a dividend of ₹1 per equity share. The company faced challenges from falling charter hire rates and rising operational costs but demonstrated resilience through strong financial position and operational excellence.",
            "Sentiment": "positive",
            "PublishDate": 1754484694801,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Drilling Reports 23% EBITDA Growth in Q1 FY26, Projects Revenue Above ₹925 Crores for Full Year",
            "Summary": "Jindal Drilling & Industries Limited reported strong quarterly results with EBITDA increasing 23% to ₹107 crores from ₹87 crores in the previous quarter, while revenue remained similar. PAT grew 5% to ₹55 crores and EPS increased from ₹18 to ₹19 per share. The company operates 6 rigs with 4 currently working with ONGC, while Jindal Explorer is under refurbishment for redeployment in October 2025. Management projects FY26 revenue exceeding ₹925 crores with EBITDA between ₹360-380 crores, compared to FY25 revenue of ₹884 crores and EBITDA of ₹237 crores. The company recently acquired Jindal Pioneer for $75 million and maintains a net cash position of ₹112 crores. International rig rates are currently between $80,000-90,000 per day, while the company expects better rates in upcoming ONGC tenders after a previous low-rate contract. ONGC is working with BP until year-end and expected to announce new drilling plans for 2026.",
            "Sentiment": "positive",
            "PublishDate": 1754283087691,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Drilling Projects Revenue Over Rs 925 Crores for FY26 with EBITDA of Rs 360-380 Crores",
            "Summary": "Jindal Drilling's management has projected revenue exceeding Rs 925 crores for FY26, with EBITDA expected between Rs 360-380 crores. For FY27, the company anticipates revenue of around Rs 900 crores and EBITDA of Rs 360-380 crores, based on the assumption that Jindal Pioneer will operate at USD 40,000 per day.",
            "Sentiment": "positive",
            "PublishDate": 1754277846417,
            "Source": "stock"
        },
        {
            "Title": "Jindal Drilling Reports ₹1,538 Crore Order Book, Plans Offshore Expansion",
            "Summary": "Jindal Drilling has an order book worth ₹1,538 crore and maintains strong business relationships with ONGC. The company is purchasing new rigs and focusing on offshore expansion while aiming to maintain steady margins and explore global opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1753887951229,
            "Source": "stock"
        },
        {
            "Title": "Jindal Drilling & Industries Reports Strong Q1 Results, Approves Key Board Appointments",
            "Summary": "Jindal Drilling & Industries Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone net income from operations of Rs 24.09 crores and profit for the period of Rs 56.45 crores, compared to Rs 17.08 crores revenue and Rs 22.98 crores profit in the same quarter last year. On a consolidated basis, profit reached Rs 66.11 crores versus Rs 43.86 crores in the previous year quarter. The Board recommended re-appointment of Dr. Raj Kamal Aggarwal as Independent Director for five years effective November 10, 2025, subject to shareholder approval. The company re-appointed M/s P L Gupta & Co. as Internal Auditors for financial year 2025-26 and recommended appointment of M/s Ajit Mishra & Associates as Secretarial Auditors for five consecutive years from 2025-26 to 2029-30. Earnings per share improved to Rs 19.48 on standalone basis and Rs 22.81 on consolidated basis.",
            "Sentiment": "positive",
            "PublishDate": 1753880308903,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Drilling Reports Q1 FY2026 Results, Recommends Director Reappointment",
            "Summary": "Jindal Drilling and Industries Limited's board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone net income from operations of Rs 24.09 crores and profit for the period of Rs 56.45 crores, compared to Rs 17.08 crores revenue and Rs 22.98 crores profit in the same quarter last year. Consolidated profit reached Rs 66.11 crores versus Rs 43.86 crores in the previous year quarter. The board recommended reappointment of Dr. Raj Kamal Aggarwal as independent director for five years effective November 10, 2025, subject to shareholder approval. M/s P L Gupta & Co. was reappointed as internal auditors for FY2025-26, while M/s Ajit Mishra & Associates was recommended as secretarial auditor for five years from FY2025-26 to FY2029-30. Earnings per share increased to Rs 19.48 from Rs 7.92 in the corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753875515744,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Drilling Reports Q4 Financial Results and Dividend",
            "Summary": "Jindal Drilling announced its Q4 financial results. The company's net profit increased to 532.8 million rupees, up from 318 million rupees year-over-year and 487.5 million rupees quarter-over-quarter. Revenue for Q4 rose to 2.45 billion rupees from 1.98 billion rupees in the same quarter last year. Additionally, the company recommended a dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748304297000,
            "Source": "default"
        },
        {
            "Title": "Jindal Drilling Reports Q4 Results and Dividend Recommendation",
            "Summary": "Jindal Drilling announced its Q4 financial results. The company's revenue increased to 2.45 billion rupees from 1.98 billion rupees year-over-year. EBITDA rose to 869.8 million rupees from 493.9 million rupees, with the EBITDA margin improving to 35.5% from 24.95%. Net profit for Q4 reached 532.8 million rupees, up from 318 million rupees year-over-year and 487.5 million rupees quarter-over-quarter. Additionally, the company recommended a dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748269962000,
            "Source": "result"
        },
        {
            "Title": "Jindal Drilling Secures 3-Year Contract from ONGC",
            "Summary": "Jindal Drilling and Industries has been awarded a contract by Oil & Natural Gas Corporation (ONGC). The contract is for a duration of 3 years with an effective day rate of $35,138.71.",
            "Sentiment": "positive",
            "PublishDate": 1746620431000,
            "Source": "default"
        },
        {
            "Title": "Jindal Drilling and Industries Wins Arbitration Award of 100 Crore",
            "Summary": "Jindal Drilling and Industries has received a favorable arbitration order worth 100 crore rupees. This represents a significant legal victory for the company, potentially improving its financial position.",
            "Sentiment": "positive",
            "PublishDate": 1743760178000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Drilling Acquires Jack-Up Rig for $75 Million",
            "Summary": "Jindal Drilling has acquired a jack-up rig named 'Jindal Pioneer' from Discovery Drilling Pte. Ltd., Singapore, which is a joint venture of the company. The acquisition was made for a consideration of USD 75 million.",
            "Sentiment": "positive",
            "PublishDate": 1741152892000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Drilling Industries: Q3 Profit Soars 106% YoY to ₹65.95 Crore",
            "Summary": "Jindal Drilling Industries reported Q3 FY25 results with a 106.48% YoY increase in profit to ₹65.95 crore. Revenue rose 30.81% YoY to ₹239.46 crore. Operating income surged 256.24% QoQ and 38.6% YoY. EPS reached ₹22.76, up 106.53% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1738130639000,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Drilling Reports Significant Profit Growth in Q3",
            "Summary": "Jindal Drilling has reported a substantial increase in net profit for the third quarter. The company's net profit rose to 488 million rupees, up from 311 million rupees year-over-year and 158 million rupees quarter-over-quarter. Revenue also saw growth, reaching 2.39 billion rupees compared to 1.83 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738023452000,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Drilling Reports Improved Q3 EBITDA and Margin",
            "Summary": "Jindal Drilling has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 550 million rupees to 807 million rupees. Additionally, the EBITDA margin expanded from 30.07% to 33.69%, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1737980477000,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Drilling Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Jindal Drilling has announced its financial results for the third quarter. The company's net profit increased to 488 million rupees, up from 311 million rupees year-over-year and 158 million rupees quarter-over-quarter. Revenue also saw growth, reaching 2.39 billion rupees compared to 1.83 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1737980416000,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Drilling Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Jindal Drilling has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 was 312 million rupees, down from 531 million rupees in the same quarter last year. The EBITDA margin also decreased to 18.11% from 37.41% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730119008000,
            "Source": "result"
        },
        {
            "Title": "Jindal Drilling Reports Q2 FY24 Financial Results",
            "Summary": "Jindal Drilling has announced its Q2 financial results. The company reported a net profit of 158 million rupees, which is lower compared to 308 million rupees in the same quarter last year (YoY) and 230 million rupees in the previous quarter (QoQ). However, the company's revenue increased to 1.72 billion rupees from 1.42 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730118926000,
            "Source": "result"
        },
        {
            "Title": "Jindal Drilling's Rig Starts Three-Year ONGC Contract",
            "Summary": "Jindal Drilling & Industries has announced that its rig 'Jindal Supreme' has begun a three-year contract with ONGC (Oil and Natural Gas Corporation). The contract has an effective day rate of USD 86,327.",
            "Sentiment": "positive",
            "PublishDate": 1729055254000,
            "Source": "corporate_action"
        }
    ]
}