{
    "Symbol": "JIOFIN",
    "ISIN": "INE758E01017",
    "News": [
        {
            "Title": "JioFinance App Launches Fixed Deposit Platform",
            "Summary": "Jio Financial Services introduces comprehensive FD platform on JioFinance app, offering deposits from multiple banks and NBFCs with interest rates up to 8.15% per annum through fully digital process.",
            "Sentiment": "positive",
            "PublishDate": 1770808799648,
            "Source": "stocks"
        },
        {
            "Title": "Jio Financial Co-Chairman Predicts MF Industry Growth",
            "Summary": "Jio Financial Services Co-Chairman forecasts mutual fund industry to double in size over next five years, indicating strong growth potential in asset management sector.",
            "Sentiment": "positive",
            "PublishDate": 1770198894234,
            "Source": "mutualfunds"
        },
        {
            "Title": "Jio Financial Services Partners with BlackRock",
            "Summary": "Jio Financial Services has launched an investment advice platform in collaboration with global asset management giant BlackRock, marking a significant expansion into financial advisory services.",
            "Sentiment": "positive",
            "PublishDate": 1770102366787,
            "Source": "stocks"
        },
        {
            "Title": "Jio Financial Services incorporates JAIML subsidiary",
            "Summary": "Jio Financial Services Limited incorporated wholly owned subsidiary Jio Alternative Investment Manager Limited on January 23, 2026, with Rs. 1 crore initial investment for AIF management.",
            "Sentiment": "positive",
            "PublishDate": 1769237947066,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jio Financial Q3: Profit drops 9% YoY to ₹269cr",
            "Summary": "Jio Financial Services Q3 profit fell 9% YoY to ₹269 crore despite revenue doubling to ₹901 crore. NBFC AUM surged 4.5x to ₹19,049 crore with strong business expansion across segments.",
            "Sentiment": "neutral",
            "PublishDate": 1768475623276,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jio Financial Services Board Meet on Jan 15 for Q3FY26",
            "Summary": "Jio Financial Services has scheduled a board meeting on January 15, 2026, to consider and approve Q3FY26 financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767877756164,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jio Leasing Invests ₹460 Cr in Reliance International",
            "Summary": "Jio Leasing Services has invested ₹460 crores for 46 million optionally convertible preference shares of Reliance International Leasing IFSC, marking a significant strategic investment.",
            "Sentiment": "positive",
            "PublishDate": 1767186868647,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jio Financial's Core Business Overtakes Treasury Income",
            "Summary": "Jio Financial Services marks a strategic shift as core operations income rises five-fold to ₹317 crore, accounting for 52% of total earnings in Q2 FY26, surpassing treasury income for the first time.",
            "Sentiment": "positive",
            "PublishDate": 1767168604793,
            "Source": "stocks"
        },
        {
            "Title": "Jio Financial Invests ₹50 Cr in JLSL Preference Shares",
            "Summary": "Jio Financial Services subscribes to ₹50 crore worth of 8.1% optionally convertible preference shares in wholly owned subsidiary JLSL, bringing total investment to ₹120.05 crore.",
            "Sentiment": "positive",
            "PublishDate": 1766493482924,
            "Source": "stocks"
        },
        {
            "Title": "Jio Financial & BlackRock Invest ₹136 Cr Each in JV",
            "Summary": "Jio Financial Services and BlackRock each invested ₹136 crores in their joint venture JioBlackRock Asset Management, subscribing to 13.60 crore equity shares through rights issue.",
            "Sentiment": "positive",
            "PublishDate": 1765377378277,
            "Source": "co_actions_results"
        },
        {
            "Title": "JioFinance App Launches Unified Dashboard for Multi-Account Financial Tracking",
            "Summary": "Jio Financial Services launched new features on its JioFinance app enabling users to consolidate and track bank accounts, mutual funds, and stock portfolios through a single unified dashboard with AI-powered insights. The platform offers comprehensive asset tracking, real-time financial analysis, and personalized recommendations to help users align spending patterns with long-term financial goals.",
            "Sentiment": "positive",
            "PublishDate": 1763374307741,
            "Source": "stock"
        },
        {
            "Title": "Jio Financial's Subsidiary Invests Rs 45 Crore in Joint Venture with Reliance",
            "Summary": "Jio Leasing Services Limited, a wholly owned subsidiary of Jio Financial Services, subscribed to 4.5 crore preference shares worth Rs 45 crore in Reliance International Leasing IFSC Private Limited on a rights issue basis. The investment brings JLSL's total investment in the 50:50 joint venture with Reliance Strategic Business Ventures Limited to Rs 166.55 crore to fund business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1763105620829,
            "Source": "corporate_action"
        },
        {
            "Title": "Jio Payments Bank Changes Official Website Domain to www.jiopayments.bank.in",
            "Summary": "Jio Payments Bank Limited, a subsidiary of Jio Financial Services Limited, announced a change in its official website domain name following Reserve Bank of India guidelines. The bank's new website address is www.jiopayments.bank.in, replacing the previous domain www.jiobank.in. Customers and stakeholders are advised to use the new domain for official communications and accessing online banking services. JPBL is a digital-first bank incorporated in November 2016 that offers services including zero-balance savings accounts, UPI-enabled payments, sweep accounts, domestic money transfers, and bill payment systems.",
            "Sentiment": "neutral",
            "PublishDate": 1761558375683,
            "Source": "stock"
        },
        {
            "Title": "Jio Financial Services Reports 44% Revenue Growth, Reaches 18 Million Digital Users",
            "Summary": "Jio Financial Services Limited reported consolidated total income of Rs. 1,002 crores for Q2 FY26, marking a 44% year-on-year increase. Net income from business operations grew 5x to Rs. 317 crores, representing 52% of consolidated net total income. The company has reached 18 million unique users across digital platforms. Key business highlights include Jio Credit's assets under management growing 12x to Rs. 14,712 crores, JioBlackRock AMC achieving Rs. 15,980 crores AUM in four months since launch, and payment solutions processing volume increasing 167% to Rs. 13,566 crores. The company received the first tranche of Rs. 3,956 crores from promoter warrant subscription. Jio Payments Bank expanded to 200,000 business correspondent touchpoints and launched 'Savings Pro' account. JioBlackRock's Flexi Cap Fund raised Rs. 1,500 crores through NFO. Consolidated profit after tax stood at Rs. 695 crores versus Rs. 689 crores in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761218206524,
            "Source": "earnings"
        },
        {
            "Title": "JioFinance Launches Digital Gold Offer for Dhanteras with 2% Bonus and Prize Draw",
            "Summary": "Jio Financial Services has launched a digital gold offer running from October 18 to 23 for Dhanteras and Diwali. Customers purchasing digital gold worth ₹2,000 or more receive an additional 2% gold credited to their wallet within 72 hours. Purchases of ₹20,000 or more qualify for a prize draw worth ₹10 lakh total, including smartphones, TVs, gold coins, and gift vouchers. Winners will be notified on October 27, 2025. Digital gold can be purchased starting from ₹10 through JioFinance or MyJio apps, allowing users to buy, store, and redeem gold digitally without visiting physical stores.",
            "Sentiment": "positive",
            "PublishDate": 1760686648399,
            "Source": "stock"
        },
        {
            "Title": "Jio Financial Plans Aggressive Expansion Across Lending, Insurance and Asset Management",
            "Summary": "Jio Financial is targeting aggressive growth across its lending, insurance, and asset management company (AMC) businesses. The company's expansion strategy includes AI-driven underwriting capabilities, a joint venture with BlackRock for asset management, and leveraging cross-selling opportunities within the broader Reliance ecosystem.",
            "Sentiment": "positive",
            "PublishDate": 1760632384940,
            "Source": "stock"
        },
        {
            "Title": "Jio Financial Services Reports 44% YoY Growth in Q2 FY26 Consolidated Income to Rs. 1,002 Crore",
            "Summary": "Jio Financial Services Limited reported consolidated total income of Rs. 1,002 crore for Q2 FY26, marking a 44% year-over-year increase. Net Income from Business grew approximately 5 times YoY to Rs. 317 crore, representing 52% of consolidated net total income excluding dividends, up from 14% in Q2 FY25. The NBFC's Assets Under Management reached Rs. 14,712 crore, up from Rs. 1,206 crore in Q2 FY25. The asset management company's AUM stood at Rs. 15,980 crore, with its maiden actively managed flexi cap fund raising around Rs. 1,500 crore. Pre-provisioning operating profit was Rs. 579 crore compared to Rs. 552 crore in Q2 FY25, while profit after tax reached Rs. 695 crore versus Rs. 689 crore in the previous year. Jio Payments Bank became a wholly-owned subsidiary following the acquisition of State Bank of India's remaining shareholding in June 2025. The JioFinance app now has approximately 18 million unique users across digital platforms. Jio Credit Limited reported 12x YoY growth in AUM and expanded to 14 cities through 15 offices. The payments bank's Business Correspondents network grew to around 200,000 from 2,307 in Q2 FY25, with customer base at 2.95 million and deposit base at Rs. 421 crore.",
            "Sentiment": "positive",
            "PublishDate": 1760620816110,
            "Source": "earnings"
        },
        {
            "Title": "Jio Financial Reports 41% Revenue Growth in Q2 Results",
            "Summary": "Jio Financial announced its quarterly results showing consolidated net profit of 6.95 billion rupees compared to 6.9 billion rupees in the same period last year. The company's revenue increased significantly to 9.81 billion rupees from 6.93 billion rupees year-over-year, representing substantial growth in the top line while profit remained relatively stable.",
            "Sentiment": "positive",
            "PublishDate": 1760619244217,
            "Source": "earnings"
        },
        {
            "Title": "Jio Financial Shares Show Bullish Momentum Ahead of Q2 Results with Potential 9% Upside",
            "Summary": "Jio Financial Services shares are building bullish momentum ahead of quarterly results, with analysts noting consolidation above Rs 300-310 support levels. Technical analysts suggest the stock could test Rs 330 levels if it sustains above Rs 310, representing potential upside. The company previously reported net profit growth of 4% to Rs 324.66 crore and revenue jump of 46.5% to Rs 612.46 crore in Q1. Key focus areas for the upcoming results include profit and revenue growth momentum, net interest income trends, consumer business performance including retail lending and insurance expansion, updates on BlackRock partnership and potential product launches. Technical indicators show the stock holding above its 20-day exponential moving average with support at Rs 300 and resistance near Rs 318-320. A breakout above this range could drive the stock toward Rs 330-340 levels.",
            "Sentiment": "positive",
            "PublishDate": 1760589772442,
            "Source": "earnings"
        },
        {
            "Title": "Jio Payments Bank Expands Toll Management Operations to 13 Locations with New Fastag ANPR System Contracts",
            "Summary": "Jio Payments Bank has launched advanced tolling services for MLFF projects and secured contracts for Fastag ANPR toll systems at two new locations. The expansion brings the bank's toll management operations to 13 locations across the country.",
            "Sentiment": "positive",
            "PublishDate": 1760339645714,
            "Source": "stock"
        },
        {
            "Title": "Jio Financial Services Schedules Quarterly Results Review for October 16",
            "Summary": "Jio Financial Services has announced it will review its quarterly results on October 16. The company has set this date for the examination of its latest financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1759990045150,
            "Source": "earnings"
        },
        {
            "Title": "Jio Payments Bank Launches 'Savings Pro' Offering Up to 6.5% Returns on Surplus Funds",
            "Summary": "Jio Payments Bank Limited, a subsidiary of Jio Financial Services Limited, launched 'Savings Pro', a feature that automatically invests customers' surplus funds exceeding a set threshold into overnight mutual funds. Customers can set a minimum threshold of ₹5,000 and invest up to ₹1,50,000 per day through the JioFinance app. The service offers instant redemption of up to 90% of investments with a maximum limit of ₹50,000, while larger amounts can be redeemed within 1-2 working days. The product has no entry or exit loads, hidden charges, or lock-in periods. Managing Director Vinod Easwaran stated the product addresses customers' need for smarter savings alternatives in a softening interest rate environment, offering a digital solution to turn passive bank balances into earning opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1758517834597,
            "Source": "stock"
        },
        {
            "Title": "Jio Financial Services Block Trade Worth Rs. 57.77 Crores Executed on NSE",
            "Summary": "Jio Financial Services Ltd. completed a block trade on the National Stock Exchange worth Rs. 57.77 crores. The transaction involved approximately 1,816,104 shares at a price of Rs. 318.10 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1758257004197,
            "Source": "order&deals"
        },
        {
            "Title": "Jio Financial Services Forms Joint Venture with Allianz Europe for Reinsurance Business",
            "Summary": "Jio Financial Services has established a joint venture called 'Allianz Jio Reinsurance Limited' with Allianz Europe B.V. The company will invest ₹2.50 lakhs to acquire a 50% ownership stake in the venture. Regulatory approvals for the joint venture have been granted.",
            "Sentiment": "positive",
            "PublishDate": 1757396960040,
            "Source": "order&deals"
        },
        {
            "Title": "Jio Financial Raises Rs 3,956 Crore From Promoters Via Warrant Issue",
            "Summary": "Jio Financial Services Ltd. raised Rs 3,956 crore from its promoter group through a preferential warrant allotment. The NBFC issued 50 crore warrants at Rs 316.50 each, with 25% paid upfront. The warrants were equally distributed between Sikka Ports & Terminals Ltd. and Jamnagar Utilities & Power Pvt. Ltd., each receiving 25 crore warrants. The allotment received approval from the company's Stakeholders' Relationship Committee following earlier board and shareholder approvals. This capital infusion is part of a larger Rs 15,825 crore investment by Mukesh Ambani and his promoter group, giving them over 51% stake in the financial services firm. The stock declined 0.35% to Rs 310.65, having fallen 11.29% over the past 12 months. One analyst maintains a 'hold' rating with a 12-month consensus price target suggesting 4.6% upside potential.",
            "Sentiment": "neutral",
            "PublishDate": 1756880236858,
            "Source": "stock"
        },
        {
            "Title": "Jio Financial Services Reports Strong Growth with AUM Rising to Rs 11,665 Crore",
            "Summary": "Jio Financial Services held its Annual General Meeting, showcasing significant business expansion. The company's assets under management grew substantially to Rs 11,665 crore in Q1 FY26 from Rs 217 crore in Q1 FY25. The company reported a profit after tax of Rs 1,613 crore for FY25. JFS announced strategic partnerships including a joint venture with Allianz for reinsurance and potential exploration of life and general insurance businesses in India. The company's partnership with BlackRock for asset management resulted in a successful fund offering that raised over Rs 17,876 crore. JFS is expanding beyond lending into insurance, wealth management, and securities broking while adopting a digital-first approach using artificial intelligence and data analytics. The company's Payments Bank plans to launch a savings account that automatically invests idle cash into overnight mutual funds.",
            "Sentiment": "positive",
            "PublishDate": 1756380151560,
            "Source": "stock"
        },
        {
            "Title": "Jio Financial Services Launches Tax Filing Feature Starting at ₹24",
            "Summary": "Jio Financial Services Limited has launched a tax planning and filing module on its JioFinance app, developed in partnership with TaxBuddy. The service offers self-filing plans starting at ₹24 and expert-assisted services beginning at ₹999. The module includes a Tax Planner for estimating future tax liabilities and comparing tax regimes, and a Tax Filing feature that allows users to file returns independently or with expert help. Users can monitor return status, track refunds, and receive tax-related alerts through the app. The pricing is competitive compared to other online tax platforms where self-filing typically starts between ₹199-₹499 and assisted plans range from ₹799 to over ₹2,000.",
            "Sentiment": "positive",
            "PublishDate": 1754980296378,
            "Source": "stock"
        },
        {
            "Title": "Jio Financial and 12 Other Companies Set Ex-Dividend Date with Record Date August 11, 2025",
            "Summary": "Thirteen companies including Jio Financial Services have set their ex-dividend date, with August 11, 2025 as the record date. Jio Financial Services declared a final dividend of Rs 0.5 per share, representing a 5% payout. Other notable dividend announcements include Akzo Nobel India offering a special dividend of Rs 156 per share (1560%), Kalyani Steels with Rs 10 per share (200%), and Neelamalai Agro Industries at Rs 30 per share (300%). The complete list includes Castrol India, Globus Spirits, GPT Infraprojects, Indo Count Industries, KP Energy, KPI Green Energy, Rashi Peripherals, Shri Dinesh Mills, Starteck Finance, and Tainwala Chemicals & Plastics. Investors must purchase shares by the ex-dividend date to qualify for dividend payments, with markets following a T+1 settlement cycle.",
            "Sentiment": "positive",
            "PublishDate": 1754626360126,
            "Source": "corporate_action"
        },
        {
            "Title": "Jio Financial Services Plans ₹15,825 Crore Fundraise Through Warrant Issue",
            "Summary": "Jio Financial Services Limited announced its board approved raising up to ₹15,825 crore through issuing 50 crore warrants at ₹316.50 each to promoter group members via private placement. The warrants are convertible to equity shares within 18 months of allotment. The company reported net profit of ₹325 crore for Q1FY26, up 4% year-on-year, while revenue jumped 46.6% to ₹612.46 crore. Additionally, Jio BlackRock, the company's joint venture with BlackRock, received SEBI approval to launch four passive funds including index funds tracking various Nifty indices. Shares closed at ₹320.20, down 0.25% on BSE.",
            "Sentiment": "positive",
            "PublishDate": 1753884862368,
            "Source": "stock"
        },
        {
            "Title": "Jio Financial Services Board Approves Warrant Issuance Worth Up To 158.25 Billion Rupees",
            "Summary": "Jio Financial Services' board has approved the issuance of up to 500 million warrants priced at 316.50 rupees each, with a total value reaching up to 158.25 billion rupees. The company has proposed new allottees for these warrants, including Sikka Ports Terminals and Jamnagar Utilities And Power.",
            "Sentiment": "positive",
            "PublishDate": 1753878656179,
            "Source": "corporate_action"
        },
        {
            "Title": "Jio Financial Board Considers Fundraising Plans to Increase Promoter Stake",
            "Summary": "Jio Financial Services board will meet to discuss raising funds through equity shares, warrants, rights issues, preferential issues, or qualified institutional placement. Promoters, including the Ambani family and group entities, currently hold 47.12% stake and may increase it to 51% through a preferential issue priced at ₹318 per share, potentially raising ₹8,000 crore. The company's shares closed at ₹321 on BSE, up 4.48%. Jio Financial reported 4% year-on-year net profit growth to ₹325 crore in the June quarter, driven by doubled interest income. However, expenses tripled to ₹261 crore due to higher finance and employee costs. Total income rose 48% to ₹619 crore. Jio Credit's assets under management reached ₹11,665 crore, up from ₹217 crore a year ago. The company has partnered with BlackRock for fund management services, with their mutual fund arm launching three cash/debt funds that attracted ₹17,800 crore.",
            "Sentiment": "positive",
            "PublishDate": 1753835661711,
            "Source": "stock"
        },
        {
            "Title": "Jio Financial Services Board to Consider Fundraising Proposal",
            "Summary": "Jio Financial Services has scheduled a board meeting for Wednesday, July 30, to consider a fundraising proposal. The fundraising may involve issuing equity shares or warrants through various methods including rights issue, preferential allotment, or qualified institutional placement (QIP).",
            "Sentiment": "neutral",
            "PublishDate": 1753799796239,
            "Source": "corporate_action"
        },
        {
            "Title": "Jio Financial Services Schedules Board Meeting to Consider Fund Raising Proposals",
            "Summary": "Jio Financial Services Limited has scheduled a Board of Directors meeting for July 30, 2025, to consider and evaluate proposals for raising funds through various methods. The company will explore issuing securities, equity shares, or warrants through rights issue, preferential issue, qualified institutions placement, or other methods. The board will also determine issue prices for these potential fundraising activities, subject to required regulatory and statutory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1753514328292,
            "Source": "corporate_action"
        },
        {
            "Title": "Jio Financial Services Reports 48% YoY Revenue Growth in Q1 FY26, AUM Reaches Rs 11,665 Crores",
            "Summary": "Jio Financial Services Limited reported consolidated total income of Rs 619 crores for Q1 FY26, marking a 48% year-on-year increase from Rs 418 crores in Q1 FY25. The company's lending arm, Jio Credit Limited, saw significant growth with Assets Under Management rising from Rs 217 crores in Q1 FY25 to Rs 11,665 crores in Q1 FY26. The joint venture with BlackRock received regulatory approvals and launched its maiden New Fund Offering, raising over Rs 17,800 crores, making it one of the largest cash and debt fund NFOs in India. Jio Payments Bank's deposits grew 206% year-on-year to Rs 358 crores, while its customer base expanded to 2.58 million from 0.96 million in Q1 FY25. Payment Solutions business recorded Transaction Processing Volume of Rs 7,717 crores, up 93% year-on-year. Consolidated profit after tax stood at Rs 325 crores compared to Rs 313 crores in Q1 FY25. The company completed acquisition of SBI's remaining 14.96% stake in Jio Payments Bank for Rs 105 crores, making it a wholly-owned subsidiary. JioFinance app averaged 8.1 million monthly active users during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753259319286,
            "Source": "earnings"
        },
        {
            "Title": "Jio-Allianz and Valueattics Re Enter India's ₹50,000-Crore Reinsurance Market to Challenge GIC Re Dominance",
            "Summary": "India's reinsurance sector faces new competition as Jio-Allianz and Valueattics Re prepare to enter the ₹50,000-crore market currently dominated by state-run GIC Re. Jio Financial Services and Allianz Group announced a binding agreement to form a 50:50 domestic reinsurance joint venture, with minimum paid-up capital of ₹200 crore. They also signed a non-binding agreement for general and life insurance joint ventures. GIC Re currently holds 51% market share, with the remaining 49% distributed among 11 foreign reinsurance branches. In 2023-24, total reinsurance premium collected was ₹62,113 crore, with ₹50,553 crore from Indian business. The new domestic reinsurers could benefit from regulatory preferences over cross-border reinsurers under IRDAI guidelines. Indian insurers must cede 4% of each policy to GIC Re under mandatory cession rules. Valueattics Re, a joint venture between Fairfax's Prem Watsa and Kamesh Goyal's Oben Ventures, entered the market in March. The entry brings scale and digital reach from Reliance Industries through Jio-Allianz, while Valueattics Re offers Fairfax's global expertise and balance sheet strength.",
            "Sentiment": "positive",
            "PublishDate": 1753058066387,
            "Source": "order&deals"
        },
        {
            "Title": "Jio Financial Services And Allianz Form 50:50 Reinsurance Joint Venture",
            "Summary": "Jio Financial Services Ltd. and Allianz Group announced a 50:50 domestic reinsurance joint venture through Allianz's wholly-owned subsidiary Allianz Europe B.V. The partnership combines Jio Financial's local market expertise and digital infrastructure with Allianz's global reinsurance capabilities to deliver customized reinsurance solutions to insurers. Isha M Ambani, non-executive director of Jio Financial, highlighted the venture's aim to provide innovative solutions leveraging both companies' strengths. Allianz CEO Oliver Bäte emphasized the partnership's role in democratizing access to financial services in India. Allianz had previously exited Indian insurance joint ventures in March 2025 by selling its Rs 24,180 crore stake in Bajaj Allianz General Insurance and Bajaj Allianz Life Insurance to Bajaj Group, while maintaining commitment to India as a growth market. Jio Financial shares closed 0.55% lower at Rs 316.85.",
            "Sentiment": "positive",
            "PublishDate": 1752863474207,
            "Source": "order&deals"
        },
        {
            "Title": "Jio Financial Services: Q1 Profit Up 4% YoY, Revenue Surges 47%",
            "Summary": "Jio Financial Services reported a 3.8% YoY increase in Q1FY26 consolidated net profit to Rs 325 crore. Revenue from operations rose 47% YoY to Rs 612 crore. Interest income grew to Rs 363 crore, while fees and commissions income reached Rs 53 crore. Total expenses increased to Rs 261 crore.",
            "Sentiment": "positive",
            "PublishDate": 1752806719000,
            "Source": "earnings"
        },
        {
            "Title": "Jio Financial Reports Q1 FY24 Results",
            "Summary": "Jio Financial has announced its Q1 consolidated financial results. The company reported a net profit of 3.25 billion rupees, up from 3.13 billion rupees in the same quarter last year. Revenue for Q1 stood at 6.12 billion rupees, an increase from 4.2 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1752801176000,
            "Source": "default"
        },
        {
            "Title": "Jio Financial Services: Q1 Profit Up 3.8%, Revenue Surges 47%",
            "Summary": "Jio Financial Services reported Q1FY26 consolidated net profit of Rs 325 crore, up 3.8% YoY. Revenue from operations increased 47% to Rs 612 crore. Sequentially, PAT rose 27% and revenue grew 24%.",
            "Sentiment": "positive",
            "PublishDate": 1752753786000,
            "Source": "earnings"
        },
        {
            "Title": "Jio Financial Reports Q1 FY24 Results",
            "Summary": "Jio Financial has announced its Q1 consolidated financial results. The company reported a net profit of 3.25 billion rupees, up from 3.13 billion rupees in the same quarter last year. Revenue for Q1 stood at 6.12 billion rupees, compared to 4.2 billion rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1752753691000,
            "Source": "result"
        },
        {
            "Title": "Jio Financial Services: Q1 Results and Analyst Presentation Scheduled for Today",
            "Summary": "Jio Financial Services will announce its Q1 FY2025 earnings today, followed by an analyst presentation at 7:30 PM. The company's mutual fund arm, Jio BlackRock, recently received SEBI approval for five index funds. In Q4 FY2025, Jio Financial reported a 2% YoY growth in consolidated net profit and an 18% YoY increase in revenue from operations.",
            "Sentiment": "neutral",
            "PublishDate": 1752716832000,
            "Source": "earnings"
        },
        {
            "Title": "Jio BlackRock: SEBI Approves Launch of Four Passive Funds",
            "Summary": "Jio BlackRock, a joint venture between Jio Financial Services and BlackRock, has received SEBI approval to launch four passive funds: Nifty Midcap 150 Index Fund, Nifty Next 50 Index Fund, Nifty Smallcap 250 Index Fund, and Nifty 8-13 yr G-Sec Index Fund. The G-Sec fund will have high interest rate risk and low credit risk, while the Smallcap fund is categorized as 'very high' risk.",
            "Sentiment": "positive",
            "PublishDate": 1752645582000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jio BlackRock Receives SEBI Approval for Four Passive Funds",
            "Summary": "Jio Financial Services' joint venture with BlackRock, known as Jio BlackRock, has obtained approval from the Securities and Exchange Board of India (SEBI) to launch four passive funds. This development marks a significant step for Jio Financial Services in expanding its financial product offerings.",
            "Sentiment": "positive",
            "PublishDate": 1752643706000,
            "Source": "default"
        },
        {
            "Title": "Jio Financial Services: Q1 FY26 Results Announcement Scheduled",
            "Summary": "Jio Financial Services Ltd. will announce Q1 FY26 results on July 17, 2025. Board meeting and earnings call scheduled for the same day. Trading window closed from July 1 until 48 hours post-results. Q4 FY25 saw 1.8% YoY profit increase to Rs 316.1 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1752572741000,
            "Source": "corporate_action"
        },
        {
            "Title": "BlackRock Seeks Approval for Eight New Investment Funds",
            "Summary": "BlackRock has requested approval from the market regulator to launch eight new investment funds. The asset management company is looking to expand its fund offerings, potentially providing more investment options for clients. This move suggests BlackRock's intent to grow its presence in the investment market and diversify its product range.",
            "Sentiment": "neutral",
            "PublishDate": 1751964400000,
            "Source": "default"
        },
        {
            "Title": "Jio BlackRock Mutual Fund: Debut with Three Debt Schemes",
            "Summary": "Jio BlackRock Mutual Fund launches three open-ended debt schemes: Liquid Fund, Money Market Fund, and Overnight Fund. The New Fund Offer (NFO) opens on June 30 and closes on July 2. Minimum investment for each fund is ₹500. This marks the official entry of JioBlackRock Asset Management into India's mutual fund market.",
            "Sentiment": "positive",
            "PublishDate": 1751265928000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jio Financial Services: Shares Rally on Regulatory Approvals",
            "Summary": "Jio Financial Services stock gained 0.80% to ₹326.05, marking the fifth consecutive session of gains. The company received SEBI approval for Jio BlackRock Broking to operate as a brokerage firm. Jio Financial has also strengthened its payments banking operations by infusing ₹190 crore and acquiring SBI's 17.8% stake in Jio Payments Bank.",
            "Sentiment": "positive",
            "PublishDate": 1751260487000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jio BlackRock: Sebi Approves Stock Broking Business",
            "Summary": "Jio BlackRock Investment Advisers has received Sebi approval to launch a stock broking business in India. This is the third regulatory clearance for the 50:50 joint venture between Jio Financial Services and BlackRock, following approvals for asset management and investment advisory services.",
            "Sentiment": "positive",
            "PublishDate": 1751078060000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jio BlackRock: SEBI Approves Brokerage Business Launch",
            "Summary": "Jio BlackRock Broking Pvt Ltd. received SEBI approval to start brokerage operations in India. This completes the trio of approvals for Jio BlackRock's joint venture, enabling them to offer comprehensive investment solutions. Jio Financial Services shares rose 4% to Rs 327.75 on BSE following the news.",
            "Sentiment": "positive",
            "PublishDate": 1751002906000,
            "Source": "corporate_action"
        },
        {
            "Title": "SEBI Approves Jio BlackRock Broking as Stock Broker and Clearing Member",
            "Summary": "The Securities and Exchange Board of India (SEBI) has granted approval to Jio BlackRock Broking Private Limited to operate as a stock broker and clearing member. This development allows Jio BlackRock Broking to participate in stock market activities and provide related services.",
            "Sentiment": "positive",
            "PublishDate": 1751001025000,
            "Source": "default"
        }
    ]
}