{
    "Symbol": "JISLDVREQS",
    "ISIN": "IN9175A01010",
    "News": [
        {
            "Title": "Jain Irrigation Q3FY26 Results Show Mixed Performance",
            "Summary": "Jain Irrigation Systems reported Q3FY26 results with standalone revenue of ₹91,966 lakh, up from ₹79,973 lakh YoY, but faced exceptional items impact of ₹2,078 lakh due to new Labour Codes.",
            "Sentiment": "neutral",
            "PublishDate": 1770192406934,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jain Irrigation Reports 20% Revenue Growth to Rs 1,432 Crores in Q2 FY26",
            "Summary": "Jain Irrigation Systems Limited reported quarterly revenue of Rs 1,432 crores compared to Rs 1,191 crores in the same period last year, marking 20% growth. EBITDA grew 43% during the quarter, outpacing revenue growth. The high-tech business segment grew 39%, plastic division increased 9.5%, and agro-processing rose 15%. For the first half, the company achieved around 12% growth with consolidated revenue of approximately Rs 3,000 crores and EBITDA of Rs 400 crores. The company maintains its guidance of over 15% growth for the full year. CEO Anil Jain noted that September quarter is traditionally weak due to monsoon season but expects strong performance in Q3 and Q4. The company has an order book of Rs 1,900 crores, with Rs 1,500 crores expected to be executed by March 2026. Government receivables of around Rs 900 crores related to EPC projects are expected to be collected by FY27. The company is also entering beverage bottling business which could generate Rs 400-500 crores in revenue when fully operational.",
            "Sentiment": "positive",
            "PublishDate": 1762147300579,
            "Source": "earnings"
        },
        {
            "Title": "Jain Irrigation Secures ₹135 Crore Order for 5,438 Solar Water Pumps in Maharashtra",
            "Summary": "Jain Irrigation Systems Limited has secured a ₹135 crore order from Maharashtra State Electricity Distribution Company Limited (MSEDCL) to design, supply, install, and commission 5,438 off-grid DC solar water pumps across Maharashtra. The order is under the Magel Tyala Saur Krushi Pump Yojana/PM-KUSUM B Scheme and includes pumps of 3 HP, 5 HP, and 7.5 HP capacity. This follows the company's successful completion of Phase I in December 2024, where it delivered 4,180 pumps worth ₹103 crore. The company operates with over 9,000 associates worldwide, generates approximately USD 750 million in revenue, and has manufacturing plants in 22 locations globally.",
            "Sentiment": "positive",
            "PublishDate": 1755088264257,
            "Source": "order&deals"
        },
        {
            "Title": "Jain Irrigation Systems Wins TOI Ecopreneur Award 2025 for Water Conservation Leadership",
            "Summary": "Jain Irrigation Systems Ltd. received the TOI Ecopreneur Award 2025 from The Times of India Group for its leadership in sustainable agriculture, biodiversity conservation, and water management. The company's integrated watershed development efforts span over 2,500 acres and include soil conservation, afforestation, and rainwater harvesting structures. Jain Irrigation's agri-tech solutions have empowered over 10 million smallholder farmers globally. The company's micro-irrigation products have delivered water savings of 143 billion cubic metres, energy savings of 26,395 GWh, and reduced 19 million tonnes of CO2-equivalent emissions. The Girna River dam project supports over 1,200 farming families and nearly 4,000 acres of farmland. Conservation zones host over 800 species, including 21 near-threatened birds and animals. The company has distributed more than 75,000 seed balls and saplings across 22 villages. Jain Irrigation employs over 9,000 associates worldwide, generates approximately USD 750 million in revenue, and operates manufacturing plants in 22 global locations.",
            "Sentiment": "positive",
            "PublishDate": 1754404748042,
            "Source": "stock"
        },
        {
            "Title": "Jain Irrigation Reports Q1 FY26 Results with 4.6% Revenue Growth and Margin Expansion",
            "Summary": "Jain Irrigation Systems Limited reported consolidated total revenue of ₹15,456 million for the quarter ended June 30, 2025, representing a 4.6% increase from ₹14,779 million in the same quarter last year. EBITDA grew 13.0% to ₹2,020 million with margins expanding by 98 basis points to 13.1%. Standalone total income reached ₹9,192 million, up 7.3% year-over-year. The company experienced strong demand for Micro Irrigation Systems, Tissue Culture, Exports and Solar Agri Pumps. However, the pipe business faced challenges due to early monsoon and slowdown in government projects. Food processing division operated at higher capacity despite lower mango prices affecting revenue growth. During the quarter, the company received ₹14,967 lakh from warrant holders for allotment of 42,786,430 ordinary equity shares. Management expects demand revival for piping business in H2FY26 with well-spread monsoon and government infrastructure investment commitments.",
            "Sentiment": "neutral",
            "PublishDate": 1753517383113,
            "Source": "earnings"
        }
    ]
}