{
    "Symbol": "JISLJALEQS",
    "ISIN": "INE175A01038",
    "News": [
        {
            "Title": "Jain Irrigation Q3 FY26 Call Recording Available",
            "Summary": "Jain Irrigation Systems has made available the audio recording of its Q3/9M FY26 earnings conference call held on February 4, 2026, in compliance with regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1770207258608,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jain Irrigation Q3 FY26 Earnings Call on Feb 4",
            "Summary": "Jain Irrigation Systems announces Q3 FY26 earnings conference call scheduled for February 4, 2026 at 2:30 PM IST, with management participation from CEO Anil Jain and CFO Bipeen Valame.",
            "Sentiment": "neutral",
            "PublishDate": 1769601169567,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jain Irrigation Reports 20% Revenue Growth in Q2 FY26 Despite Monsoon Challenges",
            "Summary": "Jain Irrigation Systems reported overall income growth of 20% to Rs. 1,432 crores in Q2 FY26 compared to Rs. 1,191 crores in the same period last year. EBITDA grew 43% during the quarter, outpacing revenue growth. The high-tech business segment grew 39%, plastic division grew 9.5%, and agro-processing grew 15%. For the first half, the company achieved around 12% growth and expects to meet its stated goal of over 15% growth for the full year. The company generated Rs. 190 crores net cash from operating activities post working capital changes. Management expects strong performance in Q3 and Q4 due to seasonality. The company is expanding into beverage bottling through its food processing subsidiary, with first two lines expected to add Rs. 400-500 crores in revenue at 65-75% capacity utilization. Government receivables of Rs. 900 crores related to EPC projects are expected to be collected by FY27. The company has an order book of Rs. 1,900 crores, with Rs. 1,500 crores expected to be executed by March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1762147312557,
            "Source": "earnings"
        },
        {
            "Title": "Jain Irrigation Systems Reports Strong Q2 Performance with Return to Profitability",
            "Summary": "Jain Irrigation Systems delivered strong quarterly results, reporting a consolidated net profit of 153 million rupees compared to a loss of 99 million rupees in the same period last year. Revenue grew to 14.3 billion rupees from 11.9 billion rupees year-over-year. The company's EBITDA increased to 2 billion rupees from 1.38 billion rupees, while EBITDA margin improved to 13.91% from 11.64% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761815293641,
            "Source": "earnings"
        },
        {
            "Title": "Jain Irrigation Systems Wins National Award at EEPC India's 56th Export Excellence Awards",
            "Summary": "Jain Irrigation Systems Ltd. received the National Award at EEPC India's 56th Export Excellence Awards during the organization's Platinum Jubilee celebrations. The award recognizes the company's innovation, quality, and sustainable water engineering solutions in global markets. Shri Piyush Goyal, Minister of Commerce and Industry, presented the award to Mr. Anil Jain, Vice Chairman and CEO, and Mr. Athang Jain, President of the company, at a ceremony in New Delhi. The recognition highlights Jain Irrigation's position as a leader in India's export sector and establishes its reputation as a respected global player in water engineering technology.",
            "Sentiment": "positive",
            "PublishDate": 1757647243055,
            "Source": "stock"
        },
        {
            "Title": "Jain Irrigation Plans to Raise Up to Rs 500 Crores Through QIP",
            "Summary": "Jain Irrigation has announced plans to raise up to Rs 500 crores through a Qualified Institutional Placement (QIP). The fundraising initiative will involve issuing shares to qualified institutional investors.",
            "Sentiment": "positive",
            "PublishDate": 1756797334390,
            "Source": "stock"
        },
        {
            "Title": "Jain Irrigation Board to Meet on September 2, 2025 for Fund Raising Consideration",
            "Summary": "Jain Irrigation has announced that its board will convene on September 2, 2025, to consider fund raising initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1756382661924,
            "Source": "corporate_action"
        },
        {
            "Title": "Central Government Suggests Removing GST on Essential Farm Equipment Including Irrigation and Sprinklers",
            "Summary": "The Central Government has suggested eliminating GST on essential farm equipment, specifically including irrigation systems and sprinklers. This proposal would impact companies like Jain Irrigation that manufacture and supply such agricultural equipment.",
            "Sentiment": "positive",
            "PublishDate": 1755599393322,
            "Source": "stock"
        },
        {
            "Title": "Jain Irrigation Secures ₹135-Crore Solar Pump Order from Maharashtra Government",
            "Summary": "Jain Irrigation Systems Limited secured a ₹135-crore order from Maharashtra State Electricity Distribution Company Limited under the PM-KUSUM B scheme. The contract involves supplying 5,438 off-grid solar water pumping systems across Maharashtra districts. This follows the company's successful phase-I execution in December 2024, where it installed 4,180 solar pumps worth ₹103 crore. For the quarter ended June 30, Jain Irrigation reported consolidated net profit of ₹14 crore, up 3% year-on-year, with revenue rising 4.6% to ₹1,546 crore. EBITDA increased 12.8% to ₹202 crore with margin improving to 13.07%. The company's shares closed at ₹52.80, gaining 13.77% on the trading day.",
            "Sentiment": "positive",
            "PublishDate": 1755086675010,
            "Source": "order&deals"
        },
        {
            "Title": "Jain Irrigation Systems Wins TOI Ecopreneur Award 2025 for Biodiversity and Water Conservation Leadership",
            "Summary": "Jain Irrigation Systems Ltd. received the TOI Ecopreneur Honours 2025 from The Times of India Group for its leadership in sustainable agriculture, biodiversity conservation, and climate-resilient water management. The award was received by Mr. Athang Jain, President of Jain Irrigation Systems Ltd., at a ceremony in New Delhi. The company's integrated watershed development efforts span over 2,500 acres, including soil conservation, afforestation, and rainwater harvesting structures. Jain Irrigation's agri-tech solutions have empowered over 10 million smallholder farmers across India and globally. The company's micro-irrigation products have delivered water savings of 143 billion cubic metres, energy savings of 26,395 GWh, and reduced 19 million tonnes of CO2-equivalent emissions. The Girna River dam project has supported over 1,200 farming families and nearly 4,000 acres of farmland. The company's conservation zones host over 800 species, including 21 near-threatened birds and animals. Jain Irrigation has distributed more than 75,000 seed balls and saplings across 22 villages. The company employs over 9,000 associates worldwide, generates revenue of approximately USD 750 million, and operates manufacturing plants in 22 locations globally.",
            "Sentiment": "positive",
            "PublishDate": 1754404757868,
            "Source": "stock"
        },
        {
            "Title": "Jain Irrigation Systems Provides Audio Recording Link for Q1 FY26 Earnings Call",
            "Summary": "Jain Irrigation Systems Limited has made available the audio recording link for their Q1 FY26 earnings conference call that was held on July 26, 2025, at 4:00 PM IST. The company provided the recording link to BSE and NSE stock exchanges. The earnings call was conducted as a group meeting format and the audio recording can be accessed through a designated web link on primeinfobase.in.",
            "Sentiment": "neutral",
            "PublishDate": 1753539556407,
            "Source": "earnings"
        },
        {
            "Title": "Jain Irrigation Systems Reports ₹706 Lakh Standalone Profit for Quarter Ended June 30, 2025",
            "Summary": "Jain Irrigation Systems Ltd. announced its quarterly results with standalone revenue from operations of ₹91,917 lakh and profit after tax of ₹706 lakh for the quarter ended June 30, 2025. On a consolidated basis, the company reported revenue from operations of ₹1,54,565 lakh with profit after tax of ₹1,119 lakh. The company received ₹14,967 lakh from warrant holders against allotment of 42,786,430 ordinary equity shares during the quarter. Standalone basic earnings per share stood at ₹0.10, while consolidated basic earnings per share was ₹0.20. The company operates through two main segments - Hi-tech Agri Input Products (₹57,911 lakh revenue) and Plastic Division (₹34,006 lakh revenue) on standalone basis, with an additional Agro Processing Division (₹45,773 lakh revenue) in consolidated results.",
            "Sentiment": "neutral",
            "PublishDate": 1753516694743,
            "Source": "earnings"
        },
        {
            "Title": "Jain Irrigation Systems Schedules Q1 FY2026 Earnings Conference Call for July 26, 2025",
            "Summary": "Jain Irrigation Systems Limited has scheduled an earnings conference call for Q1 FY2026 on July 26, 2025 at 4:00 PM IST. The call will feature CEO & Managing Director Anil Jain and CFO Bipeen Valame discussing the company's quarterly results. Participants can join via dial-in numbers or through a direct web link. The company has provided multiple access options including primary numbers for domestic participants and international toll-free numbers for USA, UK, Singapore, and Hong Kong. The company trades on BSE and NSE under multiple codes for ordinary and DVR equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1753266484188,
            "Source": "earnings"
        },
        {
            "Title": "Jain Irrigation Reports Improved Q4 FY2023 Financial Results",
            "Summary": "Jain Irrigation Systems Limited has announced its Q4 financial results, showing improvements across key metrics. The company's EBITDA increased to 2.23 billion rupees from 2.16 billion rupees year-over-year, with EBITDA margin rising to 12.8% from 12.5%. Revenue saw a slight increase to 17.5 billion rupees from 17.3 billion rupees. Notably, the company turned a profit of 289 million rupees, compared to a loss of 88 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747207087000,
            "Source": "result"
        },
        {
            "Title": "Jain Irrigation to Consider Q4 Results on May 14",
            "Summary": "Jain Irrigation Systems Limited has announced that it will consider and approve its financial results for the fourth quarter on May 14. This announcement indicates the company's adherence to regulatory requirements for timely financial reporting.",
            "Sentiment": "neutral",
            "PublishDate": 1746619817000,
            "Source": "default"
        },
        {
            "Title": "Jain Irrigation Systems: Q3 Reports Net Loss, Slight Revenue Growth",
            "Summary": "Jain Irrigation Systems reported a consolidated net loss of ₹1.22 crore for Q3 FY25, compared to a net profit of ₹8.59 crore in the year-ago period. Total income increased marginally to ₹1,362.63 crore from ₹1,357.63 crore. The company expects recovery in consumption and strong performance in key areas including piping, solar systems solutions, and international sales.",
            "Sentiment": "neutral",
            "PublishDate": 1738228964000,
            "Source": "earnings"
        },
        {
            "Title": "Jain Irrigation Reports Improved Q3 EBITDA and Margin",
            "Summary": "Jain Irrigation Systems Limited has reported its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.75 billion rupees, up from 1.65 billion rupees in the same quarter of the previous year. Additionally, the EBITDA margin improved to 12.9% from 12.16% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738217456000,
            "Source": "earnings"
        },
        {
            "Title": "Jain Irrigation Reports Decline in Q3 Net Profit",
            "Summary": "Jain Irrigation Systems Limited has reported a significant decrease in its consolidated net profit for the third quarter. The company's net profit fell to 10 million rupees from 98 million rupees in the same period last year. However, revenue remained relatively stable, with a slight increase to 13.6 billion rupees from 13.57 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738217087000,
            "Source": "earnings"
        },
        {
            "Title": "Jain Irrigation Reports Q2 EBITDA Decline",
            "Summary": "Jain Irrigation's Q2 EBITDA decreased to 1.38 billion rupees from 1.78 billion rupees year-over-year. The company's EBITDA margin also fell to 11.64% from 13.09% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730103971000,
            "Source": "result"
        },
        {
            "Title": "Jain Irrigation Reports Q2 FY24 Financial Results",
            "Summary": "Jain Irrigation Systems Limited has reported its financial results for the second quarter of fiscal year 2024. The company experienced a net loss of 99 million rupees, compared to a profit of 88 million rupees in the same quarter last year. Revenue for Q2 decreased to 11.9 billion rupees from 14 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730103743000,
            "Source": "result"
        }
    ]
}