{
    "Symbol": "JITFINFRA",
    "ISIN": "INE863T01013",
    "News": [
        {
            "Title": "JITF Infralogistics Q3FY26 Results Show Mixed Performance",
            "Summary": "JITF Infralogistics reported Q3FY26 standalone revenue of ₹96.99 lakhs with net profit of ₹5.90 lakhs. Consolidated revenue reached ₹82,200.17 lakhs with profit of ₹1,859.95 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770407044707,
            "Source": "co_actions_results"
        },
        {
            "Title": "JITF Infra Logistics Reports Strong Q2 Operational Performance Despite Net Loss",
            "Summary": "JITF Infra Logistics delivered strong quarterly results with revenue growing to 5.4B rupees from 4.8B rupees year-over-year and EBITDA surging to 1.16B rupees from 727M rupees, while EBITDA margin expanded to 21.52% from 15.13%. The company turned profitable at PBT level with 5M rupees versus a 193M rupee loss previously, though it recorded a consolidated net loss of 179M rupees, an improvement from the 240M rupee loss in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1763137185259,
            "Source": "earnings"
        },
        {
            "Title": "JITF Infralogistics' Material Subsidiary JWIL Infra Adopts Employee Stock Option Plan",
            "Summary": "JITF Infralogistics Limited announced that its material subsidiary JWIL Infra Limited has approved and adopted an Employee Stock Option Plan (ESOP) dated November 10, 2025, for granting stock options to eligible employees. Upon full exercise of all options and share allotment, the shareholding of Jindal Urban Infrastructure Services Limited (JUISL), another material subsidiary of JITF Infralogistics, in JWIL will be diluted from 54.60% to 50.01%. Despite this dilution, JWIL will continue to remain a subsidiary of JUISL.",
            "Sentiment": "neutral",
            "PublishDate": 1762830452937,
            "Source": "corporate_action"
        },
        {
            "Title": "Jitf Infralogistics Subsidiary Secures ₹320 Crore Waste-to-Energy Project in Andhra Pradesh",
            "Summary": "Jitf Infralogistics subsidiary has signed a ₹320 crore concession agreement with Swachh Andhra Corporation for a 12 MW waste-to-energy project in Nellore, Andhra Pradesh. The agreement represents a significant contract win for the company in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1760314504013,
            "Source": "stock"
        },
        {
            "Title": "JITF Infralogistics Subsidiaries Sign INR 750 Crore Waste-to-Energy Plant Agreements in Andhra Pradesh",
            "Summary": "JITF Infralogistics Limited announced that two of its subsidiaries have signed concession agreements with Swachh Andhra Corporation on October 9, 2025. Jindal Urban Waste Management (Nellore) Limited will develop a 12 MW waste-to-energy plant in Nellore, Andhra Pradesh, valued at INR 320 crores. Additionally, Jindal Urban Waste Management (Kakinada) Limited will develop a 15 MW waste-to-energy plant at the Kakinada-Rajahmundry Cluster in Andhra Pradesh, valued at INR 430 crores. The combined project value totals INR 750 crores across both renewable energy initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1760090910836,
            "Source": "order&deals"
        },
        {
            "Title": "JITF Infralogistics Appoints New Secretarial Auditor and Plans Registered Office Relocation",
            "Summary": "JITF Infralogistics Limited's Board of Directors approved the appointment of M/s S. Bhawani Shankar Associates as Secretarial Auditor for 5 consecutive years effective from 2025-26, subject to shareholder approval. The Board also approved shifting the company's registered office from Chhattisgarh to Uttar Pradesh, requiring shareholder approval and other necessary approvals. Additionally, the company submitted its unaudited financial results for the quarter ended June 30, 2025, along with a limited review report from statutory auditors M/s Lodha & Co., LLP. The standalone results showed revenue from operations of Rs 82.07 lakhs and profit after tax of Rs 10.24 lakhs for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1755084167483,
            "Source": "corporate_action"
        },
        {
            "Title": "JITF Infralogistics Reports Mixed Q1 Results with Standalone Profit but Consolidated Loss",
            "Summary": "JITF Infralogistics Limited submitted its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 82.07 lakhs compared to Rs 83.77 lakhs in the previous year quarter, with net profit of Rs 10.24 lakhs versus Rs 7.38 lakhs. However, consolidated results showed a net loss of Rs 470.85 lakhs for continuing operations compared to a loss of Rs 36.79 lakhs in the prior year quarter. Consolidated revenue from operations increased to Rs 55,016.44 lakhs from Rs 46,498.39 lakhs. The results were reviewed by statutory auditors Lodha & Co. LLP and approved by the Board of Directors. The company operates primarily in three segments: Water Infrastructure, Urban Infrastructure, and Trading activities, following the disinvestment of its Rail Freight Wagons segment.",
            "Sentiment": "negative",
            "PublishDate": 1755082734069,
            "Source": "earnings"
        },
        {
            "Title": "JITF Infralogistics Reports Mixed Q4 Results",
            "Summary": "JITF Infralogistics announced its quarterly results. The company's EBITDA increased to 1.29 billion rupees from 754.4 million rupees year-over-year, with EBITDA margin improving to 16.43% from 11.55%. Revenue grew to 7.88 billion rupees from 6.53 billion rupees year-over-year. However, consolidated net profit decreased to 5.73 million rupees from 292 million rupees year-over-year, but increased from 11.1 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748262047000,
            "Source": "result"
        },
        {
            "Title": "JITF Infralogistics Reports Mixed Q3 Financial Results",
            "Summary": "JITF Infralogistics announced its Q3 financial results. The company's EBITDA decreased to 1.01 billion rupees from 1.14 billion rupees year-over-year. However, the EBITDA margin improved to 18.92% from 18.49% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738249841000,
            "Source": "earnings"
        },
        {
            "Title": "JITF Infralogistics Reports Decline in Q3 Revenue",
            "Summary": "JITF Infralogistics has reported a decrease in its third-quarter revenue. The company's revenue for Q3 stood at 5.31 billion rupees, down from 6.19 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1738249834000,
            "Source": "earnings"
        },
        {
            "Title": "JITF Infralogistics Reports Significant Decline in Q3 Profit",
            "Summary": "JITF Infralogistics experienced a substantial decrease in consolidated net profit for the third quarter. The company reported a profit of 11.1 million rupees, down from 91.9 million rupees in the same quarter of the previous year. This represents a year-over-year decline of approximately 87.9%. Additionally, the company's performance deteriorated significantly compared to the previous quarter, where it had reported a loss of 257.5 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1738249823000,
            "Source": "earnings"
        },
        {
            "Title": "JITF Infralogistics Reports Increased Q2 Net Loss",
            "Summary": "JITF Infralogistics experienced a significant increase in net loss for Q2, reporting a loss of 240 million rupees compared to a loss of 24 million rupees in the same quarter last year. This represents a tenfold increase in losses year-over-year. Additionally, the loss has tripled from the previous quarter's 80 million rupees. The company's revenue also declined substantially, dropping to 4.8 billion rupees from 7.2 billion rupees in the same quarter last year, indicating a decrease of about 33%.",
            "Sentiment": "negative",
            "PublishDate": 1731327034000,
            "Source": "result"
        }
    ]
}