{
    "Symbol": "JKCEMENT",
    "ISIN": "INE823G01014",
    "News": [
        {
            "Title": "JK Cement Commissions 3 MnTPA Grinding Unit at Buxar",
            "Summary": "JK Cement Limited commissioned a 3.00 MnTPA cement grinding unit at Buxar, Bihar on January 29, 2026, as part of its 6 MnTPA expansion plan. Total grey cement capacity now stands at 31.26 MnTPA.",
            "Sentiment": "positive",
            "PublishDate": 1769679965018,
            "Source": "stocks"
        },
        {
            "Title": "J.K. Cement Block Trade Worth Rs. 18.93 Crores",
            "Summary": "J.K. Cement Ltd. witnessed a significant NSE block trade worth Rs. 18.93 crores involving approximately 33,388 shares at Rs. 5670.00 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769575252016,
            "Source": "co_actions_results"
        },
        {
            "Title": "JK Cement Stock Gets 35% Upside Target from Anand Rathi",
            "Summary": "Anand Rathi maintains 'Buy' rating on JK Cement with target price of ₹7,545, citing strong Q3 performance with 21.4% volume growth and ambitious expansion plans to reach 38 million tonnes capacity by FY28.",
            "Sentiment": "positive",
            "PublishDate": 1768987630699,
            "Source": "stocks"
        },
        {
            "Title": "JK Cement Q3FY26 EBITDA Rises 13% YoY to ₹5.60b",
            "Summary": "JK Cement reports strong Q3FY26 performance with 13% YoY EBITDA growth to ₹5.60 billion and 10% YoY increase in adjusted PAT to ₹2.10 billion, despite margin contraction.",
            "Sentiment": "positive",
            "PublishDate": 1768982148016,
            "Source": "co_actions_results"
        },
        {
            "Title": "Choice Equities Sets ₹7,200 Target for JK Cement",
            "Summary": "Choice Institutional Equities maintains BUY rating on JK Cement with ₹7,200 target price, citing sector tailwinds, capacity expansion to 36+ Mnt by FY27, and ROCE expansion of 495 bps over FY25-28E.",
            "Sentiment": "positive",
            "PublishDate": 1768887049679,
            "Source": "stocks"
        },
        {
            "Title": "JK Cement Commissions Major Production Units in Central India",
            "Summary": "JK Cement announces commissioning of 3.3 million tonne clinkerization unit and 3 million tonne grinding units in Central India, with additional Buxar grinding unit planned for launch.",
            "Sentiment": "positive",
            "PublishDate": 1768879800666,
            "Source": "stocks"
        },
        {
            "Title": "JK Cement Paint Division Targets ₹380-390 Cr Revenue",
            "Summary": "JK Cement's paint division aims for ₹380-390 crore turnover this year, expects breakeven by FY27 with ₹500 crore revenue. Company projects cost savings of ₹120-125 crore by March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768879771447,
            "Source": "stocks"
        },
        {
            "Title": "JK Cement Projects Strong Volume Growth Through FY28",
            "Summary": "JK Cement anticipates grey cement volume growth in early teens for FY27 reaching 22.5-23 million tonnes, with 12-15% growth for FY28 targeting 25.5 million tonnes. Net debt to EBITDA projected at 1.6 by March FY26.",
            "Sentiment": "positive",
            "PublishDate": 1768879742203,
            "Source": "stocks"
        },
        {
            "Title": "JK Cement Releases Q3 FY26 Earnings Call Recording",
            "Summary": "JK Cement Limited has made available the audio recording of its earnings conference call for Q3 FY26 results held on January 19, 2026, discussing unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768828793521,
            "Source": "co_actions_results"
        },
        {
            "Title": "JK Cement Starts 1 MTPA Grinding Facility",
            "Summary": "JK Cement commissions new 1 MTPA cement grinding facility in Panna and Hamirpur as part of 6 MTPA expansion plan, taking total grey cement capacity to 28.26 MTPA.",
            "Sentiment": "positive",
            "PublishDate": 1768553083301,
            "Source": "stocks"
        },
        {
            "Title": "JK Cement Q3FY26 Earnings Call Set for January 19",
            "Summary": "JK Cement Limited announces earnings conference call on January 19, 2026 at 4:00 PM IST to discuss Q3FY26 and nine-month financial results ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768311868333,
            "Source": "co_actions_results"
        },
        {
            "Title": "J.K. Cement Sees ₹17.69 Cr NSE Block Trade",
            "Summary": "J.K. Cement Ltd. witnessed a significant block trade on NSE worth ₹17.69 crores involving approximately 30,387 shares at ₹5,822.50 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767942826351,
            "Source": "co_actions_results"
        },
        {
            "Title": "JK Cement Wins Kishanpura Limestone Block Bid",
            "Summary": "JK Cement has been declared the preferred bidder in the e-auction for the Kishanpura limestone block located in District Nagaur, Rajasthan, strengthening its raw material access.",
            "Sentiment": "positive",
            "PublishDate": 1766714748871,
            "Source": "stocks"
        },
        {
            "Title": "JK Cement Wins Kishanpura Limestone Block Auction",
            "Summary": "JK Cement successfully secured the Kishanpura limestone block in Nagaur, Rajasthan through e-auction, strengthening its raw material access for cement production operations.",
            "Sentiment": "positive",
            "PublishDate": 1766575631038,
            "Source": "stocks"
        },
        {
            "Title": "JK Cement Wins Kishanpura Limestone Block Bid",
            "Summary": "JK Cement Limited declared preferred bidder for Kishanpura limestone block in Rajasthan covering 483 hectares with G3 exploration level, strengthening raw material security.",
            "Sentiment": "positive",
            "PublishDate": 1766573866166,
            "Source": "co_actions_results"
        },
        {
            "Title": "J K Cement Expands Operations with New Production Line and Renewable Energy Investment",
            "Summary": "J K Cement has commenced operations of a new 3.3 MTPA clinker production line at its Panna facility, significantly expanding its manufacturing capacity. The company has also acquired a 12.21% stake in O2 Renewable Energy for ₹51.9 million, diversifying into the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1764771660980,
            "Source": "corporate_action"
        },
        {
            "Title": "J.K. Cement Increases Stake in O2 Renewable Energy to 28.97% with Rs. 5.19 Crore Investment",
            "Summary": "J.K. Cement Limited acquired an additional 12.21% equity stake in O2 Renewable Energy V Private Limited for Rs. 5.19 crore from JSW Neo Energy Limited, increasing its total shareholding from 16.76% to 28.97%. The acquisition strengthens J.K. Cement's renewable energy strategy through investment in a company operating a 22MW wind power project that supplies power to the cement manufacturer and other consumers.",
            "Sentiment": "positive",
            "PublishDate": 1764771349831,
            "Source": "order&deals"
        },
        {
            "Title": "J.K. Cement Sees Rs. 96.45 Crore Block Trade on NSE",
            "Summary": "J.K. Cement executed a block trade worth Rs. 96.45 crores involving approximately 167,377 shares at Rs. 5,762.50 per share on the NSE. The transaction represents a significant institutional or bulk trading activity for the cement company's shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764318165685,
            "Source": "order&deals"
        },
        {
            "Title": "J.K. Cement Seeks Shareholder Approval for New Independent Director and Increased Borrowing Limits",
            "Summary": "J.K. Cement Limited has issued a postal ballot notice seeking shareholder approval for three special resolutions through remote e-voting from November 11 to December 10, 2025. The company proposes to appoint Mr. Alok Dhir as Non-Executive Independent Director for a five-year term from November 1, 2025 to October 31, 2030. Additionally, the company seeks to increase its borrowing limits from Rs. 12,000 crore to Rs. 15,000 crore under Section 180(1)(c) of the Companies Act, 2013, and approval for creating security through charge/mortgage/hypothecation on company assets to secure such borrowings. Mr. Alok Dhir is a 64-year-old Chartered Accountant and lawyer with four decades of experience in corporate commercial law, specializing in Corporate and Financial Restructuring, Insolvency Laws, and Banking Law. The increased borrowing capacity is intended to support the company's expanded business operations, growth plans, and capital expenditure programs. Results will be announced by December 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762817172856,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Cement Reports 19% Revenue Growth in Q2 FY26, EBITDA Margins at 15.9%",
            "Summary": "JK Cement Limited reported revenue from operations of Rs 2,859 crores in Q2 FY26, marking a 19% increase from Rs 2,410 crores in the previous year, though down 10% from the previous quarter's Rs 3,190 crores. EBITDA for the quarter stood at Rs 440 crores compared to Rs 271 crores last year, with margins at 15.9% versus 11.5% in the previous year. For the half-year period, revenue grew 19% to Rs 6,049 crores with EBITDA at Rs 1,113 crores, up 49% from Rs 746 crores. The company's net debt increased to Rs 3,139 crores from Rs 2,551 crores, with net debt to EBITDA ratio at 1.34. JK Cement commissioned a 1 million ton grinding unit at Prayagraj in October and expects to complete its 6 million ton Panna project by December 2025. The company has started construction on its integrated 4 million ton clinker and 3 million ton grinding facility at Jaisalmer, expected to be operational in Q2 FY28. Paint business revenue was Rs 95 crores for the quarter with an EBITDA loss of Rs 14 crores. Management maintained volume growth guidance of around 10% for FY26, targeting close to 20 million tons.",
            "Sentiment": "positive",
            "PublishDate": 1762458863784,
            "Source": "earnings"
        },
        {
            "Title": "JK Cement Reports 17% Profit Growth Despite Margin Pressures from Rising Costs",
            "Summary": "JK Cement reported consolidated profit after tax of Rs 159 crore for the September quarter, marking a 17% year-on-year increase from Rs 136 crore. Revenue from operations grew 18% to Rs 3,019 crore, driven by volume gains. However, total expenses rose to Rs 2,827 crore due to higher power, fuel, and freight costs. Sequentially, revenue declined 10% from the June quarter, with PAT falling from Rs 324 crore due to seasonal weakness and elevated input costs. The company completed amalgamation of Toshali Cements and expanded its Prayagraj grinding unit capacity from 2 MTPA to 3 MTPA. Shares closed 0.5% lower at Rs 6,214.50, though the stock has gained 35.6% year-to-date. Citi maintained a 'Buy' rating with a target price of Rs 7,275, citing strong medium-term growth visibility despite near-term margin pressures.",
            "Sentiment": "neutral",
            "PublishDate": 1762143560608,
            "Source": "earnings"
        },
        {
            "Title": "J.K. Cement Reports Strong Q2 Growth with 28% Jump in Net Profit",
            "Summary": "J.K. Cement delivered robust quarterly performance with consolidated net profit rising to Rs 1.6 billion from Rs 1.25 billion year-over-year. Revenue increased to Rs 30.19 billion compared to Rs 25.6 billion in the same period last year. The company's EBITDA grew significantly to Rs 4.47 billion from Rs 2.83 billion, while EBITDA margin expanded to 14.80% from 11.08% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1761986634324,
            "Source": "earnings"
        },
        {
            "Title": "J.K. Cement Reports Strong Q2 Performance with 175.78 Crore Net Profit, Appoints New Independent Director",
            "Summary": "J.K. Cement Limited announced its unaudited financial results for the second quarter ended September 30, 2025, reporting a net profit of 175.78 crores compared to 50.26 crores in the previous quarter. Revenue from operations reached 3,149.82 crores for the quarter. The company's Board also approved the appointment of Alok Dhir as Additional Non-Executive Independent Director, effective November 1, 2025, subject to shareholder approval. Dhir brings four decades of experience in corporate law, insolvency, and financial restructuring. The company maintains ongoing litigation with the Competition Commission of India regarding penalty matters totaling 128.54 crores and 9.28 crores respectively, with management believing they have strong cases. The auditors provided an unmodified opinion on the financial results.",
            "Sentiment": "positive",
            "PublishDate": 1761986259537,
            "Source": "earnings"
        },
        {
            "Title": "Affle and JK Cement Set to Announce Quarterly Results with Strong Growth Expectations",
            "Summary": "Affle and JK Cement are scheduled to announce their quarterly results. Bloomberg analysts expect Affle to report net profit of Rs 109.5 crore and revenue of Rs 645.9 crore, with EBITDA at Rs 142.7 crore and margin estimated at 22%. In their previous quarter, Affle reported 30.8% rise in net profit to Rs 86.59 crore and revenue growth of 27.8% to Rs 519.5 crore. For JK Cement, analysts forecast net profit of Rs 181.2 crore, revenue of Rs 2,791.4 crore, and EBITDA of Rs 469.9 crore with 16.83% margin. JK Cement previously reported 75.4% increase in net profit to Rs 324.25 crore and 19.4% revenue growth to Rs 3,352.53 crore. The company's board approved expansion plans including a 0.6 MTPA white cement-based wall putty plant in Rajasthan and capacity increase of 0.5 MTPA at its Ujjain cement grinding unit.",
            "Sentiment": "positive",
            "PublishDate": 1761962544575,
            "Source": "earnings"
        },
        {
            "Title": "JK Cement Opens New 1 MNTPA Grinding Unit in Prayagraj, Boosts Total Grey Cement Capacity to 26.26 MNTPA",
            "Summary": "JK Cement has opened a new 1 MNTPA grinding unit in Prayagraj, increasing the location's capacity from 2 MNTPA to 3 MNTPA. This expansion brings the company's total grey cement capacity to 26.26 MNTPA.",
            "Sentiment": "positive",
            "PublishDate": 1761532474800,
            "Source": "stock"
        },
        {
            "Title": "JK Cement Commissions 1 MnTPA Cement Grinding Facility at Prayagraj",
            "Summary": "JK Cement Limited has commissioned a 1.00 MnTPA cement grinding facility at its Prayagraj works. This expansion increases the Prayagraj unit's installed capacity from 2.00 MnTPA to 3.00 MnTPA and raises the company's overall grey cement production capacity to 26.26 MnTPA, including its subsidiary company capacity. The commissioning is part of a previously approved 6 MnTPA expansion plan that includes brownfield expansion of clinker capacity by 3.3 MnTPA and cement grinding capacity by 3 MnTPA at Panna, Hamirpur and Prayagraj, plus 3 MnTPA greenfield cement grinding capacity in Bihar.",
            "Sentiment": "positive",
            "PublishDate": 1761399421377,
            "Source": "corporate_action"
        },
        {
            "Title": "J.K. Cement Schedules Conference Call for November 3 to Discuss Quarterly Results",
            "Summary": "J.K. Cement Limited announced a conference call scheduled for November 3, 2025, at 4 PM IST to discuss financial results for the quarter and half-year ended September 30, 2025, and provide forward outlook. The call will feature the company's senior management team, with dial-in numbers provided for participants from India, Singapore, Hong Kong, USA, and UK. The company noted that the schedule may change due to exigencies.",
            "Sentiment": "neutral",
            "PublishDate": 1760687391094,
            "Source": "earnings"
        },
        {
            "Title": "NCLT Approves JK Cement's Merger With Toshali Cements",
            "Summary": "The National Company Law Tribunal (NCLT) has approved JK Cement's merger plan with Toshali Cements. The merger is set to commence from January 1, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1760528067578,
            "Source": "corporate_action"
        },
        {
            "Title": "J.K. Cement Independent Director Mr. Saurabh Chandra Passes Away",
            "Summary": "J.K. Cement Ltd. announced the passing of Mr. Saurabh Chandra, an Independent Director of the company, on September 16, 2025. The company described his demise as unexpected and an irreparable loss to the organization. All directors and employees have expressed deep sympathy and condolences to his bereaved family. Mr. Chandra held the Director Identification Number (DIN) 02726077 and did not hold directorships in any other listed entities at the time of his passing.",
            "Sentiment": "negative",
            "PublishDate": 1758087373548,
            "Source": "corporate_governance"
        },
        {
            "Title": "JK Cement Receives NCLT Approval for Amalgamation with Wholly-Owned Subsidiary Toshali Cements",
            "Summary": "The National Company Law Tribunal has sanctioned the Scheme of Amalgamation of Toshali Cements Pvt. Ltd, a wholly owned subsidiary, with JK Cement Ltd, effective from January 1, 2024. The merger involves the transfer of all assets, liabilities, and employees from Toshali Cements to JK Cement without any share issuance since Toshali is already a wholly-owned subsidiary. The scheme received approval from 96.59% of unsecured creditors by value, representing 17 out of 94 creditors. JK Cement now awaits certified copies of the NCLT order to file with the Registrar of Companies to complete the merger process. Upon completion, Toshali Cements will be dissolved without winding up, and all its operations will be consolidated under JK Cement.",
            "Sentiment": "positive",
            "PublishDate": 1757683619092,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Cement Schedules Board Meeting for Q2 FY2025-26 Results on November 1",
            "Summary": "JK Cement Ltd has scheduled a Board of Directors meeting on November 1, 2025 to consider and approve unaudited consolidated and standalone financial results for the second quarter and half year ended September 30, 2025. The company has implemented a trading window closure for designated employees, directors, promoters and connected persons from October 1, 2025 until November 3, 2025, which is 48 hours after the declaration of financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1757659601042,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Cement Starts Construction of Rs 3,000 Crore Greenfield Plant in Jaisalmer",
            "Summary": "JK Cement Ltd. commenced construction of a new greenfield cement plant in Jaisalmer, Rajasthan with an investment of approximately Rs 3,000 crores. The facility is being built on 525 acres and is expected to be completed by early 2027. The plant's location provides access to limestone reserves and proximity to high-demand markets in Rajasthan, Gujarat, and Haryana. The project aims to generate direct and indirect employment opportunities and will feature waste heat recovery systems for sustainability. Managing Director Raghavpat Singhania stated the plant will strengthen production capabilities and create employment opportunities. CEO Madhavkrishna Singhania described it as an expansion of production capacity with cutting-edge technology and emphasis on sustainability. JK Cement currently has Grey Cement capacity of 25.26 MTPA and White Cement and Wall Putty capacity of 3.05 MTPA, with presence across 15 states.",
            "Sentiment": "positive",
            "PublishDate": 1757161373750,
            "Source": "stock"
        },
        {
            "Title": "JK Cement Approves Rs 4,805 Crore Expansion Plan and Key Leadership Changes",
            "Summary": "JK Cement's Board approved a greenfield expansion plan to establish a new cement line with 7 million tonnes per annum capacity. The project includes a 4 million tonnes clinkerisation unit and 3 million tonnes cement grinding facility at Jaisalmer, Rajasthan, plus two split grinding units of 2 million tonnes each in Rajasthan and Punjab. Total investment is estimated at Rs 4,805 crores. The company announced leadership changes with Shambhu Singh retiring as Company Secretary after 17 years of service, effective October 31, 2025. Bhumika Sood, currently Deputy Company Secretary, will be appointed as the new Company Secretary and Compliance Officer from November 1, 2025. Additionally, Raghav Moreshwar Tare was appointed as Group Financial Controller under Senior Management from August 1, 2025, while Neeraj Singhal transitioned from Group Financial Controller to Head of Internal Audit & Risk Compliance.",
            "Sentiment": "positive",
            "PublishDate": 1756115647548,
            "Source": "stock"
        },
        {
            "Title": "JK Cement Announces Rs 4,805 Crore Expansion and Leadership Changes",
            "Summary": "JK Cement Ltd approved a greenfield expansion project involving a new cement line with 7 million tonnes per annum capacity. The expansion includes a 4 MnTPA clinkerisation unit and 3 MnTPA cement grinding facility at Jaisalmer, Rajasthan, plus two 2 MnTPA split grinding units in Rajasthan and Punjab, with total investment estimated at Rs 4,805 crores. The company announced leadership changes effective November 1, 2025, with Shambhu Singh retiring as Company Secretary after 17 years of service, and Bhumika Sood, currently Deputy Company Secretary, being appointed as the new Company Secretary and Compliance Officer. Additional senior management changes include Raghav Moreshwar Tare being appointed as Group Financial Controller, while Neeraj Singhal moved from Group Financial Controller to Head of Internal Audit & Risk Compliance.",
            "Sentiment": "positive",
            "PublishDate": 1755244157281,
            "Source": "corporate_governance"
        },
        {
            "Title": "JK Cement Becomes First Indian Company To Launch LC-3 Low-Carbon Cement",
            "Summary": "JK Cement has become the first company in India to introduce LC-3 cement, which is positioned as a low-carbon innovation in the cement industry.",
            "Sentiment": "positive",
            "PublishDate": 1753866802386,
            "Source": "stock"
        },
        {
            "Title": "JK Cement Approves Rs. 480 Crore Investment in Subsidiary for Expansion Projects",
            "Summary": "JK Cement has approved a strategic investment of Rs. 480 crores in its subsidiary Jaykaycem (Central) Ltd. The investment is intended to fund ongoing expansion projects and enhance operational capacity.",
            "Sentiment": "positive",
            "PublishDate": 1753710399436,
            "Source": "corporate_action"
        },
        {
            "Title": "J.K. Cement Declared Preferred Bidder for Limestone Mining Block in Rajasthan",
            "Summary": "J.K. Cement Ltd has been declared the 'Preferred Bidder' by the Government of Rajasthan for a mining lease for the Parewar (SN-III) Limestone Block in Jaisalmer district. The block spans 928 hectares and contains estimated geological resources of 196.18 million tonnes of cement grade limestone and 11.1 million tonnes of SMS grade limestone. The declaration was issued by the Director of Mines & Geology through Declaration No. DMG/Goel/Bid (M)/22 Blocks (14ML, 8CL)/NIT 16/04/2025 on July 4, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753446796087,
            "Source": "stock"
        },
        {
            "Title": "JK Cement Reports 19% Revenue Growth and 41% EBITDA Jump in Q1 FY26",
            "Summary": "JK Cement delivered strong quarterly results with net sales growing 19% year-on-year to Rs. 3,028 crores, though declining 6% sequentially. EBITDA surged 41% annually to Rs. 674 crores with margins at 22.3%. Grey cement volumes increased 15% year-on-year, driven by over 50% growth in Central India and recovery in South region, while North region saw some decline. The company completed de-bottlenecking at Ujjain unit, raising total grey cement capacity to 25.26 million tons, and acquired Saifco as a subsidiary. Management maintains volume guidance of 20 million tons for the fiscal year. The company announced a putty expansion of 6 lakh tons with Rs. 195 crores investment in Rajasthan. Net debt increased to Rs. 2,796 crores with debt-to-EBITDA ratio at 1.29. Paint business reported Rs. 86 crores revenue but continued losses. Incentives for the quarter were Rs. 85 crores. The 6 million tons expansion across multiple locations remains on track for completion by calendar year-end.",
            "Sentiment": "positive",
            "PublishDate": 1753354481158,
            "Source": "earnings"
        },
        {
            "Title": "JK Cement Reports Strong Q1 Performance with 78% Jump in Net Profit",
            "Summary": "JK Cement delivered robust quarterly results with net profit rising to 3.2 billion rupees from 1.8 billion rupees year-over-year. Revenue increased to 33 billion rupees compared to 28 billion rupees in the same period last year. EBITDA grew to 6.9 billion rupees from 4.9 billion rupees, while EBITDA margin expanded to 20.52% from 17.31% year-over-year, indicating improved operational efficiency and profitability across the business.",
            "Sentiment": "positive",
            "PublishDate": 1753057227679,
            "Source": "earnings"
        },
        {
            "Title": "JK Cement Expands Ujjain Unit Capacity by 33% to 2 MTPA",
            "Summary": "JK Cement has expanded its Ujjain unit capacity, increasing grey cement output from 1.5 million tonnes per annum (MTPA) to 2 MTPA. This expansion represents a capacity increase of 0.5 MTPA at the facility.",
            "Sentiment": "positive",
            "PublishDate": 1752919435062,
            "Source": "stock"
        },
        {
            "Title": "JK Cement Reports 78% Jump in Quarterly Net Profit to 3.2 Billion Rupees",
            "Summary": "JK Cement reported net profit of 3.2 billion rupees in Q1, representing a significant increase from 1.8 billion rupees in the same period last year. The company's revenue also grew to 33 billion rupees compared to 28 billion rupees year-over-year, marking an 18% increase in quarterly revenue.",
            "Sentiment": "positive",
            "PublishDate": 1752917814697,
            "Source": "earnings"
        },
        {
            "Title": "JK Cement Schedules Q1 FY26 Conference Call",
            "Summary": "JK Cement has announced a conference call scheduled for July 21 to discuss the company's Q1 FY26 results and future outlook. The call will provide an opportunity for stakeholders to gain insights into the company's performance and strategic plans.",
            "Sentiment": "neutral",
            "PublishDate": 1752307011000,
            "Source": "default"
        },
        {
            "Title": "JK Cement Ltd: ₹15 Final Dividend Declared for FY25",
            "Summary": "JK Cement Ltd has declared a final dividend of ₹15 per equity share for FY 2024-25. The record date is set for July 8, 2025, with book closure from July 9 to July 18, 2025. The dividend is subject to shareholder approval at the upcoming AGM.",
            "Sentiment": "positive",
            "PublishDate": 1751292790000,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Cement to Review Q1 Results on July 19",
            "Summary": "JK Cement has announced that it will review its first quarter results on July 19. The company has not provided any additional details about the financial performance or expectations for this review.",
            "Sentiment": "neutral",
            "PublishDate": 1750941223000,
            "Source": "default"
        },
        {
            "Title": "J.K. Cement Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 86,173 shares of J.K. Cement Ltd. was executed on the National Stock Exchange (NSE) at a price of Rs. 6135.50 per share. The total value of the transaction amounted to Rs. 52.87 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1750045528000,
            "Source": "block_details"
        },
        {
            "Title": "JK Cement: High Margins Expected to Continue for 2-3 Years",
            "Summary": "JK Cement is projected to maintain high EBITDA margins over the next 2-3 years. The company aims to double its capacity to 30 million tonnes by FY26 and reach 50 million tonnes by FY30. Volume growth is expected at 7-8%. JK Cement's strategic expansion into building materials and focused branding efforts are contributing to improved margins. EBITDA margins are expected to rise from Rs 1,000 to Rs 1,200 per tonne in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1749793427000,
            "Source": "normal_news"
        },
        {
            "Title": "J K Cement Acquires Majority Stake in Saifco",
            "Summary": "J K Cement has acquired a 60% stake in Saifco for ₹1.50 billion. This acquisition represents a significant corporate action by J K Cement, potentially expanding its business operations or market presence.",
            "Sentiment": "positive",
            "PublishDate": 1749216228000,
            "Source": "default"
        },
        {
            "Title": "JK Cement Aims to Improve Paint Business Margins and Provides Volume Guidance",
            "Summary": "JK Cement is working on improving margins in its paint business through cost savings from plant modernization and adjustments to the discount structure. The company expects to improve gross margins, which will help reduce losses. JK Cement has provided volume guidance for FY26, targeting close to 20 million. The expansion project is set to be completed within FY26. The company has pushed back its breakeven target from FY26 to FY27.",
            "Sentiment": "neutral",
            "PublishDate": 1748315354000,
            "Source": "default"
        },
        {
            "Title": "J.K. Cement Reports Q4 Financial Results",
            "Summary": "J.K. Cement has released its Q4 financial results. The company's EBITDA increased to 7.64 billion rupees from 5.6 billion rupees year-over-year. The EBITDA margin improved to 21.33% from 18.06% in the same period last year. Consolidated net profit rose to 3.6 billion rupees from 2.18 billion rupees year-over-year. Revenue for Q4 grew to 35.81 billion rupees from 31.06 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748087644000,
            "Source": "result"
        },
        {
            "Title": "JK Cement Ltd: Q4 Net Profit Soars 77%, Revenue Up 13.7%",
            "Summary": "JK Cement Ltd reported a 77% increase in Q4 net profit to ₹417.3 crore. Revenue rose 13.7% to ₹3,343 crore. EBITDA grew 34.5% to ₹736.6 crore, with margin expanding to 22.03% from 18.63% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748083880000,
            "Source": "earnings"
        }
    ]
}