{
    "Symbol": "JKIL",
    "ISIN": "INE576I01022",
    "News": [
        {
            "Title": "J Kumar Infraprojects Q3 FY26 Revenue Drops 12% YoY",
            "Summary": "J Kumar Infraprojects reported Q3 FY26 revenue of INR1,311 crores, down 12% YoY, with EBITDA at INR188 crores. Nine-month revenue grew 2% to INR4,138 crores with stable margins.",
            "Sentiment": "negative",
            "PublishDate": 1770646646298,
            "Source": "co_actions_results"
        },
        {
            "Title": "J Kumar Infraprojects Q3 FY26 Earnings Call Feb 6",
            "Summary": "J Kumar Infraprojects Limited has scheduled an earnings call on February 6, 2026 at 13:30 Hrs IST to discuss Q3 & 9MFY26 operational and financial performance results.",
            "Sentiment": "neutral",
            "PublishDate": 1769767030394,
            "Source": "co_actions_results"
        },
        {
            "Title": "J Kumar Infraprojects Seeks Shareholder Approval for ₹800 Crore Capital Raising Through Postal Ballot",
            "Summary": "J Kumar Infraprojects Limited has issued a postal ballot notice seeking shareholder approval to raise up to ₹800 crores through various securities including equity shares, convertible instruments, and other financial instruments in one or more tranches. The e-voting period runs from November 28, 2025, to December 27, 2025, with funds intended for capital expenditure, debt repayment, working capital requirements, and general corporate purposes.",
            "Sentiment": "positive",
            "PublishDate": 1763984721282,
            "Source": "corporate_action"
        },
        {
            "Title": "J.Kumar Infraprojects Reports 10% Revenue Growth in H1 FY26, Maintains Order Book at INR 20,160 Crores",
            "Summary": "J.Kumar Infraprojects Limited reported consolidated revenue growth of 10% to INR 2,826 crores in H1 FY26 compared to INR 2,574 crores in the previous year. Operating margin increased 10% to INR 411 crores with EBITDA margin at 14.6%. PAT grew 10% to INR 195 crores with PAT margin at 6.9%. The company's total order book stands at INR 20,160 crores as of September 30, comprising metro projects (13%), elevated corridors/flyovers (53%), road and tunnel projects (17%), and other building/civil works (17%). The company has secured INR 150 crores of new orders and is L1 in INR 1,200 crores project in Lucknow. Management expects order inflows of INR 5,000-6,000 crores for FY26 and projects revenue of INR 6,200-6,300 crores, representing 11% growth. Extended monsoon conditions affected execution velocity during the period. Key projects including Chennai Elevated Corridor, MMRDA Anand Nagar-Saket, and GMLR tunnel project are progressing with TBM equipment now at job sites.",
            "Sentiment": "positive",
            "PublishDate": 1762899669691,
            "Source": "earnings"
        },
        {
            "Title": "J Kumar Infra Revises FY26 Revenue Guidance Downward, Maintains Margin Targets",
            "Summary": "J Kumar Infra has updated its FY26 financial guidance during a conference call. The company lowered its revenue guidance from INR 6,500 crores to INR 6,200-6,300 crores, which still represents approximately 11% year-over-year growth. The company expects order inflows of INR 5,000-6,000 crores for FY26 and targets an end-year order book of INR 22,000-23,000 crores. EBITDA margin guidance remains unchanged at 14-15% for FY26, with plans to achieve 15-16% over the next two years. PAT margin is expected to maintain around 7%. Gross debt is projected to remain around INR 800 crores by year-end.",
            "Sentiment": "neutral",
            "PublishDate": 1762746533169,
            "Source": "stock"
        },
        {
            "Title": "J.Kumar Infraprojects Reports 10% Growth in H1FY26 Revenue and Profit",
            "Summary": "J.Kumar Infraprojects Limited announced its financial results for the quarter and half year ended September 30, 2025. The company reported consolidated revenue growth of 10% to ₹2,826 crores for H1FY26 compared to ₹2,574 crores in H1FY25. EBITDA grew 10% to ₹411 crores with margins at 14.6%. Profit after tax increased 10% to ₹194 crores. For Q2FY26, revenue grew 4% to ₹1,343 crores while PAT grew marginally by 0.4% to ₹91 crores. The company maintains a strong order book of ₹20,160 crores as of September 30, 2025, with projects spanning Metro systems (13%), elevated corridors/flyovers (53%), roads and tunnels (17%), and others (17%). The company reported a net cash positive position of ₹124 crores. Managing Director Kamal J. Gupta expressed confidence in the company's foundation for stronger performance in the second half and future growth.",
            "Sentiment": "positive",
            "PublishDate": 1762485104439,
            "Source": "earnings"
        },
        {
            "Title": "J.Kumar Infraprojects Reports Quarterly Results and Approves ₹800 Crore Fundraising Plan",
            "Summary": "J.Kumar Infraprojects Limited announced its quarterly results for the quarter ended September 30, 2025, and approved a fundraising plan of up to ₹800 crores. The Board of Directors approved the Statement of Unaudited Standalone and Consolidated Financial Results along with a Limited Review Report from statutory auditors. The company reported revenue from operations of ₹1,33,696.98 lakhs for the quarter and profit after tax of ₹9,146.36 lakhs. The Board also approved raising funds through issuance of equity shares or other eligible securities via public and/or private offerings, including preferential allotment and qualified institutional placement, subject to necessary approvals including shareholder consent. A committee was constituted to handle matters related to the proposed fundraising, and approval was given for convening a shareholders' meeting to seek approval for the fundraising proposal.",
            "Sentiment": "positive",
            "PublishDate": 1762462667547,
            "Source": "earnings"
        },
        {
            "Title": "J.Kumar Infraprojects Reports Q2 Net Profit of Rs 915 Million",
            "Summary": "J.Kumar Infraprojects posted a net profit of Rs 915 million in Q2, compared to Rs 902 million in the same quarter of the previous year, representing a year-on-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1762418948157,
            "Source": "earnings"
        },
        {
            "Title": "J. Kumar Infraprojects Wins Rs. 77.42 Crore Mumbai Metro Bridge Construction Contract",
            "Summary": "J. Kumar Infraprojects Limited received a Letter of Acceptance from Mumbai Metropolitan Region Development Authority (MMRDA) for constructing foot over bridges for Mumbai Metro Line 4 and 4A at Pant Nagar, Vikhroli, Bhandup and Vijay Garden Metro stations. The total contract value is Rs. 129.04 Crore excluding GST, with J. Kumar holding a 60% share worth Rs. 77.42 Crore through the J. KUMAR-PRS joint venture. The project has a completion timeline of 15 months. The contract is with a domestic entity and does not involve any related party transactions or promoter group interests.",
            "Sentiment": "positive",
            "PublishDate": 1755073671629,
            "Source": "order&deals"
        },
        {
            "Title": "J. Kumar Infraprojects Reports 16% Revenue Growth to INR 1,484 Crores in Q1 FY26",
            "Summary": "J. Kumar Infraprojects delivered strong quarterly results with revenue from operations growing 16% to INR 1,484 crores compared to INR 1,281 crores in Q1 FY25. EBITDA increased 18% to INR 217 crores with margins improving to 14.6% from 14.4%. PAT grew 19% to INR 103 crores, with PAT margin rising to 7% from 6.8%. The company maintains a robust order book of INR 20,946 crores and is cash positive with net debt at negative INR 159 crores. Management expects INR 6,000 crores in new order inflows for the financial year, targeting around INR 2,000 crores in Q2. The company focuses on EPC projects across metros, elevated corridors, tunnels and water infrastructure, avoiding BOT projects. Key ongoing projects include Chennai Elevated Corridor (INR 4,200 crores), GMLR tunnel project with TBM deployment, and various metro projects. Management maintains revenue growth guidance of 15% and expects EBITDA margins to reach 15-16% over the next 6-8 quarters.",
            "Sentiment": "positive",
            "PublishDate": 1754304709198,
            "Source": "earnings"
        },
        {
            "Title": "J.Kumar Infra Projects 15-16% Revenue Growth for FY26 with ₹6,000 Crore Order Inflow Target",
            "Summary": "J.Kumar Infra expects revenue growth of 15-16% for FY26. The company's EBITDA margin stands at 14-15% and aims to reach 15-16% in the next 6-8 quarters. The infrastructure firm has projected order inflow of ₹6,000 crore for FY26. Working capital is expected to remain at 120-125 days. The company has provided capital expenditure guidance of ₹550-600 crore over the next two years, which includes ₹100 crore allocated for maintenance.",
            "Sentiment": "positive",
            "PublishDate": 1753932799260,
            "Source": "stock"
        },
        {
            "Title": "J. Kumar Infraprojects Reports 32% Jump in Quarterly Profit, Announces ₹4 Dividend",
            "Summary": "J. Kumar Infraprojects Ltd. reported a 32% increase in profit after tax to ₹11,414.36 lakhs for the quarter ended June 30, 2025, compared to ₹8,641.75 lakhs in the previous year. Revenue from operations grew 27% to ₹1,63,274.28 lakhs from ₹1,28,149.78 lakhs. The Board approved unaudited financial results and recommended an equity dividend of ₹4.00 per share (face value ₹5.00). The company scheduled its 26th Annual General Meeting for September 23, 2025, with book closure from September 17-23, 2025. Earnings per share increased to ₹15.09 from ₹11.42. The trading window for designated persons will reopen on August 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753781262570,
            "Source": "corporate_action"
        },
        {
            "Title": "J.Kumar Infraprojects Reports 18% Growth in Q1 Net Profit to 1.02 Billion Rupees",
            "Summary": "J.Kumar Infraprojects reported Q1 net profit of 1.02 billion rupees compared to 864 million rupees in the same period last year. The company's revenue increased to 14.79 billion rupees from 12.8 billion rupees year-over-year. EBITDA rose to 2.16 billion rupees from 1.84 billion rupees, while EBITDA margin improved slightly to 14.62% from 14.38% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753780749072,
            "Source": "earnings"
        },
        {
            "Title": "J. Kumar Infraprojects Schedules Q1 FY26 Results Conference Call for July 30",
            "Summary": "J. Kumar Infraprojects Limited has scheduled a conference call on July 30, 2025, at 12:30 PM IST to discuss their Q1 FY26 financial results. The call will feature key executives including Managing Directors Mr. Kamal J. Gupta and Dr. Nalin J. Gupta, along with CFO Mr. Vasant Savla. The company has provided dial-in details for multiple regions including India, Singapore, Hong Kong, UK, and USA. Marathon Capital Advisory Pvt Ltd is coordinating the event, with Dr. Rahul Porwal as the contact person.",
            "Sentiment": "neutral",
            "PublishDate": 1753177690949,
            "Source": "earnings"
        },
        {
            "Title": "J Kumar Infra Targets Order Inflow and EBITDA Growth",
            "Summary": "J Kumar Infra has set a target order inflow of Rs. 6,000 Cr to Rs. 8,000 Cr for FY'26. The company aims to maintain an order book of around Rs. 23,000 Cr by the end of FY'26. Additionally, J Kumar Infra expects EBITDA margins to increase from 14%-15% to 16% over the next 6 to 8 quarters. The company considers these guidance figures conservative and believes it can surpass these numbers.",
            "Sentiment": "positive",
            "PublishDate": 1747884436000,
            "Source": "default"
        },
        {
            "Title": "J.Kumar Infraprojects Reports Q4 Results and Dividend",
            "Summary": "J.Kumar Infraprojects announced its Q4 financial results. The company reported a net profit of 1.14 billion rupees, up from 996.8 million rupees year-over-year and 997.3 million rupees quarter-over-quarter. Revenue for Q4 was 16.33 billion rupees, compared to 14.3 billion rupees in the same quarter last year. The company has recommended a dividend of 4 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747786961000,
            "Source": "default"
        },
        {
            "Title": "J.Kumar Infraprojects Reports Q4 Results and Dividend Recommendation",
            "Summary": "J.Kumar Infraprojects announced its quarterly results and dividend recommendation. The company's Q4 revenue increased to 16.33 billion rupees from 14.3 billion rupees year-over-year. EBITDA rose to 2.35 billion rupees from 2.03 billion rupees, with the EBITDA margin slightly improving to 14.40% from 14.25%. Net profit for Q4 grew to 1.14 billion rupees, up from 996.8 million rupees in the previous year and 997.3 million rupees in the previous quarter. The company has recommended a dividend of 4 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747741490000,
            "Source": "result"
        },
        {
            "Title": "J Kumar Infraprojects: Q4 Profit and Revenue Up 14%, ₹4 Dividend Proposed",
            "Summary": "J Kumar Infraprojects reported a 14.3% YoY increase in Q4 net profit to ₹114 crore. Revenue rose 14.6% to ₹1,632.7 crore. EBITDA grew 15.6% to ₹235 crore with margins at 14.4%. The board proposed a dividend of ₹4 per share for FY25, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1747740871000,
            "Source": "earnings"
        },
        {
            "Title": "J. Kumar Infraprojects to Consider Q4 Results on May 20",
            "Summary": "J. Kumar Infraprojects has announced that it will consider its fourth quarter (Q4) financial results on May 20. This indicates that the company is preparing to release its earnings report for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1747049917000,
            "Source": "default"
        },
        {
            "Title": "J Kumar Infra Secures 1,020 Crore Rupee Order",
            "Summary": "J Kumar Infraprojects Limited has won a new order valued at 1,020 crore rupees. This significant contract represents a major business development for the infrastructure company.",
            "Sentiment": "positive",
            "PublishDate": 1742797469000,
            "Source": "order&deals"
        },
        {
            "Title": "J. Kumar Infraprojects Secures 1.2 Billion Rupee Order",
            "Summary": "J. Kumar Infraprojects Limited has been awarded a new order worth 1.2 billion rupees (approximately $14.5 million USD). This order represents a significant business opportunity for the company in the infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1741324863000,
            "Source": "order&deals"
        },
        {
            "Title": "J.Kumar Infra Projects Forecasts Robust Order Book Growth",
            "Summary": "J.Kumar Infra Projects anticipates its order book to reach approximately Rs 23,000-24,000 crore by the end of the year. This projection includes the potential acquisition of an MMC (Mumbai Metropolitan Region Development Authority) order in the fourth quarter, as revealed during a company conference call.",
            "Sentiment": "positive",
            "PublishDate": 1738812353000,
            "Source": "corporate_governance"
        },
        {
            "Title": "J.Kumar Infra Sets Conservative Revenue Target of Rs 25,000 Crore for FY27",
            "Summary": "J.Kumar Infra has announced a revenue target of approximately Rs 25,000 crore for the fiscal year 2027. The company considers this target to be conservative and expects to exceed this guidance, as revealed during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1738812281000,
            "Source": "earnings"
        },
        {
            "Title": "J.Kumar Infra Projects Order Inflow and Margin Guidance",
            "Summary": "J.Kumar Infra Projects has provided guidance on its expected order inflow and profit margins. The company anticipates securing orders worth between Rs 6,000 crore to Rs 8,000 crore in the current fiscal year. Additionally, J.Kumar Infra is targeting an EBITDA margin of over 15% in the upcoming quarter, as revealed during a recent conference call.",
            "Sentiment": "positive",
            "PublishDate": 1738812204000,
            "Source": "earnings"
        },
        {
            "Title": "J.Kumar Infraprojects Reports 21% Increase in Q3 Net Profit",
            "Summary": "J.Kumar Infraprojects has announced its financial results for the third quarter, reporting a net profit of 1 billion rupees. This represents a significant increase from the 826 million rupees reported in the same quarter of the previous year, indicating a year-over-year growth of approximately 21%.",
            "Sentiment": "positive",
            "PublishDate": 1738655658000,
            "Source": "earnings"
        },
        {
            "Title": "J Kumar Infraprojects: Ace Investors Reduce Stakes Amid Market Volatility",
            "Summary": "Dolly Khanna and Mukul Agrawal reduced their holdings in J Kumar Infraprojects during Q3FY25. Agrawal's stake decreased from 2.64% to 2.61%, while Khanna's name is absent from the latest shareholding pattern. The company received a ₹1,073.39 crore order from NBCC for a group housing project.",
            "Sentiment": "neutral",
            "PublishDate": 1736930243000,
            "Source": "normal_news"
        },
        {
            "Title": "J. Kumar Infra Secures 1,073 Crore Rupee Order",
            "Summary": "J. Kumar Infra has won a significant order worth 1,073 crore rupees. This substantial contract is likely to boost the company's project portfolio and potentially impact its future revenue streams.",
            "Sentiment": "positive",
            "PublishDate": 1736922552000,
            "Source": "order&deals"
        },
        {
            "Title": "J Kumar Infraprojects Secures 630 Crore Rupee Order",
            "Summary": "J Kumar Infraprojects Limited has won a new order valued at 630 crore rupees (approximately $76 million USD). This represents a significant contract for the infrastructure development company, potentially boosting its project pipeline and future revenue prospects.",
            "Sentiment": "positive",
            "PublishDate": 1734503684000,
            "Source": "order&deals"
        },
        {
            "Title": "J Kumar Infra: Strong Q2 Performance Backed by Robust Order Book",
            "Summary": "J Kumar Infraprojects reported healthy execution in Q2, supported by a strong order book. Dolat Capital's review suggests continued positive performance.",
            "Sentiment": "positive",
            "PublishDate": 1730201455000,
            "Source": "result"
        },
        {
            "Title": "J.Kumar Infraprojects Reports Improved Q2 EBITDA and Margin",
            "Summary": "J.Kumar Infraprojects announced its Q2 financial results, showing an increase in EBITDA to 1.9 billion rupees from 1.6 billion rupees year-over-year. The company's EBITDA margin also improved slightly to 14.58% from 14.45% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730112008000,
            "Source": "result"
        },
        {
            "Title": "J.Kumar Infraprojects Reports Q2 Revenue Growth",
            "Summary": "J.Kumar Infraprojects has announced its Q2 revenue, which stands at 12.9 billion rupees, compared to 11 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730111998000,
            "Source": "result"
        },
        {
            "Title": "J.Kumar Infraprojects Reports Q2 Net Profit Increase",
            "Summary": "J.Kumar Infraprojects has reported a net profit of 901 million rupees for the second quarter, showing an increase from 734 million rupees year-over-year and 864 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730111985000,
            "Source": "result"
        },
        {
            "Title": "J Kumar Infra: Secures ₹298 Crore Pune River Development Project",
            "Summary": "<p>J Kumar Infraprojects Ltd. has <span class='positive'>won</span> a <span class='positive'>₹297.83 crore order</span> from Pune Municipal Corporation for <span class='neutral'>developing the Mula river stretch</span>. The project has a <span class='neutral'>36-month execution timeline</span>. The company <span class='positive'>aims to increase</span> its topline by <span class='positive'>over 15%</span> to <span class='positive'>₹5,700 crore</span> this fiscal year and <span class='positive'>targets ₹6,000-8,000 crore</span> in <b>new project inflows</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728903507000,
            "Source": "normal_news"
        },
        {
            "Title": "J Kumar Infraprojects Secures Major Contract",
            "Summary": "<p><span class=\"positive\">J Kumar Infraprojects Limited</span> has <span class=\"positive\">won</span> a <b>significant order</b> valued at <span class=\"positive\">1,848 crore rupees</span>. This <b>substantial contract</b> is likely to <span class=\"positive\">boost</span> the company's project portfolio and potentially <span class=\"positive\">impact</span> its financial performance <span class=\"positive\">positively</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727953787000,
            "Source": "corporate_action"
        },
        {
            "Title": "J Kumar Infraprojects: Secures ₹1,847 Crore MMRDA Contract",
            "Summary": "<p><span class='positive'>J Kumar Infraprojects</span> received a <span class='positive'>₹1,847.72 crore order</span> from <b>MMRDA</b> to <span class='neutral'>design and construct an elevated road</span> in <b>Thane, Maharashtra</b>. The project has a <span class='neutral'>48-month completion timeline</span>. The company's shares <span class='positive'>rose 3%</span> following the announcement.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727944135000,
            "Source": "normal_news"
        }
    ]
}