{
    "Symbol": "JKIPL",
    "ISIN": "INE1FF001016",
    "News": [
        {
            "Title": "Jinkushal Industries Q3FY26 Results Mixed Performance",
            "Summary": "Jinkushal Industries reported Q3FY26 results with standalone revenue of ₹9,077.14 lakhs and profit of ₹417.01 lakhs, while consolidated operations showed a loss of ₹987.19 lakhs despite revenue of ₹4,392.53 lakhs.",
            "Sentiment": "mixed",
            "PublishDate": 1770485986155,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jinkushal Industries Welcomes RBI Rate Cut and Rupee Depreciation as Growth Drivers",
            "Summary": "Jinkushal Industries Limited welcomed the RBI's 25 basis point repo rate cut to 5.25% and the rupee's depreciation from ₹83 to ₹90 per USD over the past year. The company, India's largest non-OEM exporter of used construction and mining equipment, expects the weaker rupee to boost export margins with each $100,000 invoice now yielding ₹7 lakh more in realizations.",
            "Sentiment": "positive",
            "PublishDate": 1764929386518,
            "Source": "stock"
        },
        {
            "Title": "Jinkushal Industries Secures $5 Million Export Order for 100 Backhoe Loaders from North American Buyer",
            "Summary": "Jinkushal Industries Limited announced that its subsidiary Hexco Global FZCO secured a repeat export order worth approximately $5 million (INR 42 crore) from an existing North American customer. The order comprises 100 units of HexL 420X Backhoe Loaders at an average selling price of $50,000 per unit. The supply will be executed progressively over three years with quarterly price alignments based on market conditions. The buyer is described as a long-standing partner and early adopter of HexL machines, continuing to be a key revenue contributor within the company's global operations. The company withheld the customer's name citing strategic and competitive sensitivity reasons.",
            "Sentiment": "positive",
            "PublishDate": 1762804405250,
            "Source": "order&deals"
        },
        {
            "Title": "Jinkushal Industries Reports 89% PAT Growth in H1 FY26 Despite Flat Revenue",
            "Summary": "Jinkushal Industries Limited held its first earnings conference call following its recent stock exchange listing. For the six months ended September 30, 2025, the company achieved revenue of Rs. 121.6 crores compared to Rs. 119.6 crores in H1 FY25. EBITDA increased from Rs. 10.3 crores to Rs. 16.2 crores, with margins strengthening from 4.8% to 9%. PAT grew 89% to Rs. 11 crores from Rs. 5.7 crores in the same period last year. The company operates through three segments: exports of new and customized construction machines, exports of used and refurbished machines, and exports of their proprietary brand HexL. HexL sales accounted for approximately 11% of total revenue with 72 units sold to date. Backhoe loaders became the highest-selling product, contributing nearly 40% of total sales compared to 25% last year. Geographically, Mexico remains the largest market contributing 50% of sales, UAE contributed 28%, and South Africa emerged as the third-largest market at 8%. The debt-to-equity ratio improved to 0.36x from 0.63x as of March 2025. The company targets reaching Rs. 800 crores revenue in the next two to three years with focus on PAT growth of 35-40% CAGR.",
            "Sentiment": "positive",
            "PublishDate": 1762201843920,
            "Source": "earnings"
        },
        {
            "Title": "Jinkushal Industries Corrects Auditor's Report Filing Error for Q2 FY2026 Results",
            "Summary": "Jinkushal Industries Limited informed stock exchanges about an inadvertent error in filing its quarterly results for the period ended September 30, 2025. The company mistakenly uploaded the auditor's report for the previous quarter (June 30, 2025) instead of the correct report for September 30, 2025. The Board of Directors approved the unaudited standalone and consolidated financial results on October 24, 2025. The company has now submitted the correct auditor's report and confirmed that this filing error does not affect the accuracy of the financial results as approved by the Board. The consolidated results show revenue from operations of ₹7,281.66 lakhs for the quarter and profit after tax of ₹444.83 lakhs. On standalone basis, revenue was ₹5,222.66 lakhs with profit after tax of ₹354.53 lakhs for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1761398771121,
            "Source": "earnings"
        },
        {
            "Title": "Jinkushal Industries' Subsidiary Hexco Signs Exclusive Distribution Deal for Construction Equipment in Southern Africa",
            "Summary": "Jinkushal Industries Limited announced that its subsidiary Hexco has entered into a distributor agreement with a major African equipment dealer for exclusive distribution, marketing, and after-sales support of its 'HexL' brand construction equipment across South Africa and neighboring Southern African territories. The agreement was signed on October 13, 2025, with one of the largest African equipment dealers, though the distributor's name was withheld for strategic and competitive reasons. This marks HexL's commercial entry into the African market, transitioning from zero revenue in the region to expected meaningful incremental and recurring revenue. The deal includes exclusivity for the specified territory, minimum annual sales commitments, performance milestones, and after-sales obligations. The company expects this strategic alliance to generate sales momentum and strengthen consolidated profitability over the medium term through higher volumes and improved operating leverage.",
            "Sentiment": "positive",
            "PublishDate": 1760362895541,
            "Source": "order&deals"
        }
    ]
}