{
    "Symbol": "JKLAKSHMI",
    "ISIN": "INE786A01032",
    "News": [
        {
            "Title": "JK Lakshmi Cement MDO Agreement Cancelled by AMDCL",
            "Summary": "JK Lakshmi Cement's MDO Agreement with AMDCL for Umrangso Limestone Mines cancelled after Assam govt directed blocks to be reverted for fresh auction. Company plans to challenge the cancellation notice.",
            "Sentiment": "negative",
            "PublishDate": 1770406796579,
            "Source": "stocks"
        },
        {
            "Title": "JK Lakshmi Cement Expands Durg Plant Investment",
            "Summary": "JK Lakshmi Cement board approves expanded plans for Durg cement plant with total investment raised to ₹3,000 crore, targeting completion by March 2028 with enhanced production capacity.",
            "Sentiment": "positive",
            "PublishDate": 1770130029234,
            "Source": "stocks"
        },
        {
            "Title": "JK Lakshmi Cement Q3FY26 Earnings Call on Feb 4",
            "Summary": "JK Lakshmi Cement has scheduled its Q3FY26 earnings call for February 4, 2026, at 4:00 PM IST. PhillipCapital will host the call with senior management to discuss financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769604333041,
            "Source": "co_actions_results"
        },
        {
            "Title": "JK Lakshmi Cement Reports Q2 Results, Announces Expansion Plans to Reach 30 Million Tons by FY30",
            "Summary": "JK Lakshmi Cement Limited held its quarterly earnings conference call discussing Q2 and H1 FY26 results. The company currently operates at 18 million tons capacity after commissioning the Surat grinding unit in September. Management outlined expansion plans including the Durg Brownfield expansion costing Rs. 3,000 crores, expected to increase capacity to 22.6 million tons by FY28. Three Greenfield plants in Nagaur, Kutch, and Assam are planned for FY29-30, targeting 30 million tons total capacity by FY30. Non-cement revenue reached Rs. 153 crores with 4% EBITDA margin. Premium product proportion increased from 23% to 26%. The company reported trade sales at 53%, blended cement at 62%, lead distance of 395 kilometers, and green power at 46%. CAPEX guidance stands at Rs. 1,000-1,200 crores for the current year and Rs. 1,300-1,500 crores for the next two years. Management noted pricing pressures in non-trade segments across markets while trade prices remained largely intact. The overland conveyor belt project approval is pending with the Ministry of Steel after board approval from Steel Authority of India.",
            "Sentiment": "neutral",
            "PublishDate": 1762753276072,
            "Source": "earnings"
        },
        {
            "Title": "JK Lakshmi Cement Reports Strong Q2 Results with 82.33 Crore Net Profit, Expands Capacity to 18 MTPA",
            "Summary": "JK Lakshmi Cement Limited announced quarterly results showing net profit of Rs. 82.33 crores for July-September 2025, compared to a loss of Rs. 21.79 crores in the same period last year. Net sales increased to Rs. 1,531.77 crores from Rs. 1,234.29 crores. Sales volume grew to 28.43 lakh tonnes from 24.77 lakh tonnes. The company completed a composite scheme of amalgamation with three subsidiary companies effective July 31, 2025. Cement capacity increased from 16.5 MTPA to 18 MTPA after commissioning an additional grinding unit of 13.50 lakh tonnes per annum at Surat and completing de-bottlenecking of cement mills at Jaykaypuram. The company is expanding clinker capacity at Durg with an additional 2.3 million tonnes per annum line and cement grinding units totaling 4.6 million tonnes per annum, with total project cost of Rs. 3,000 crores. Net debt to EBITDA improved to 1.25 times from 2.66 times. The company targets reaching 30 million tonnes cement capacity by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1762425700212,
            "Source": "earnings"
        },
        {
            "Title": "JK Lakshmi Cement Reports Strong Q2 Performance with Revenue Growth and Margin Expansion",
            "Summary": "JK Lakshmi Cement reported Q2 revenue of 15.3 billion rupees compared to 12.3 billion rupees in the same period last year. The company's EBITDA increased significantly to 2.3 billion rupees from 1 billion rupees year-over-year. EBITDA margin expanded to 15% from 8% in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762422768340,
            "Source": "earnings"
        },
        {
            "Title": "JK Lakshmi Cement Reports Q2 Consolidated Net Profit of 810 Million Rupees",
            "Summary": "JK Lakshmi Cement posted a consolidated net profit of 810 million rupees in Q2, marking a significant turnaround from a loss of 310 million rupees in the same quarter of the previous year. This represents a year-over-year improvement of 1.12 billion rupees in the company's quarterly performance.",
            "Sentiment": "positive",
            "PublishDate": 1762422348873,
            "Source": "earnings"
        },
        {
            "Title": "JK Lakshmi Cement Schedules Conference Call to Discuss Quarterly Results",
            "Summary": "JK Lakshmi Cement Limited has announced a conference call organized by Phillip Capital (India) Private Limited scheduled for November 7, 2025 at 4:00 PM IST. The call will feature Mr. Arun Kumar Shukla, President Director, and Mr. Sudhir Bidkar, ED (Corporate Affairs) CFO, who will discuss the company's financial results for the quarter and half-year ended September 30, 2025. The conference call will be recorded and participants can pre-register to join with a Diamond Pass. Multiple dial-in numbers are provided for different regions including USA, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1761851157053,
            "Source": "earnings"
        },
        {
            "Title": "JK Lakshmi Cement Acquires 26% Stake in Ampin C&I Power Four for Solar Power Purchase",
            "Summary": "JK Lakshmi Cement Limited has entered into a Power Purchase Agreement and Share Purchase & Shareholders' Agreement with Ampin C&I Power Four Private Limited. The agreement involves the purchase of solar power under applicable captive power laws, and JK Lakshmi Cement has acquired a 26% equity shareholding in Ampin C&I Power Four Private Limited as part of this arrangement.",
            "Sentiment": "positive",
            "PublishDate": 1758545032102,
            "Source": "order&deals"
        },
        {
            "Title": "JK Lakshmi Cement Expands Capacity to 18 MTPA with New Surat Grinding Unit",
            "Summary": "JK Lakshmi Cement Limited commissioned an additional grinding unit of 13.50 lakh tonnes per annum at Surat and completed de-bottlenecking of cement mills at Jaykaypuram, Sirohi. The expansion increased the company's total cement capacity from 16.5 MTPA to 18 MTPA. The commissioning was completed on September 22, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758539672946,
            "Source": "stock"
        },
        {
            "Title": "JK Lakshmi Cement Reports Strong Q1 Performance with Net Profit Rising to 1.5 Billion Rupees",
            "Summary": "JK Lakshmi Cement delivered robust quarterly results with consolidated net profit surging to 1.5 billion rupees from 567 million rupees year-over-year. Revenue increased to 17.4 billion rupees compared to 15.63 billion rupees in the same period last year. EBITDA grew significantly to 3.3 billion rupees from 2.35 billion rupees year-over-year. The company's EBITDA margin expanded to 19.13% from 15.06% in the previous year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754266102440,
            "Source": "earnings"
        },
        {
            "Title": "JK Lakshmi Cement Acquires 26% Stake in Opera Vayu for Wind and Solar Power Project",
            "Summary": "JK Lakshmi Cement has approved entering into a Power Purchase Agreement and Share Subscription & Shareholders' Agreement with Opera Vayu (Narmada) Private Limited. The company will acquire 26% equity shareholding in the special purpose vehicle for up to ₹4 crore through cash consideration. The SPV will develop a 4 MWp Wind & Solar Hybrid Power Project under the captive power route, enabling JK Lakshmi Cement to source renewable power at competitive rates for 12 years. Opera Vayu, incorporated in August 2022, operates in renewable energy generation and transmission with a net worth of ₹77.56 crores and nil turnover. The acquisition is expected to be completed by December 2025 and will make the SPV an associate company of JK Lakshmi Cement.",
            "Sentiment": "positive",
            "PublishDate": 1754056410325,
            "Source": "order&deals"
        },
        {
            "Title": "JK Lakshmi Cement to Acquire 26% Stake in Renewable Energy SPV for Captive Power",
            "Summary": "JK Lakshmi Cement will acquire a 26% stake in a renewable energy Special Purpose Vehicle (SPV) for captive power generation purposes.",
            "Sentiment": "positive",
            "PublishDate": 1754055837875,
            "Source": "stock"
        },
        {
            "Title": "JK Lakshmi Cement Appoints Two Senior Management Executives",
            "Summary": "JK Lakshmi Cement Limited has appointed Shri Naveen Kumar Sharma as Head - Project and Shri Deepak Sharma as Vice President (Engineering) in the senior management category, effective August 1, 2025. Sharma holds a Master's Degree in Manufacturing Management and Mathematics, is an IIM Ahmedabad alumni, and brings over 36 years of experience in cement, steel and power industries across resource development, green field projects, operations, and sustainability. He serves on multiple industry committees including the National Environment Committee of Confederation of Indian Industry. Deepak Sharma is an engineering graduate in electronics and instrumentation with a Post Graduate Diploma in Business Management, specializing in establishing integrated cement projects and implementing digital automation technologies for manufacturing enhancement.",
            "Sentiment": "positive",
            "PublishDate": 1754052170404,
            "Source": "corporate_governance"
        },
        {
            "Title": "JK Lakshmi Cement Reports Strong Q1 Performance with 40% Jump in Net Profit",
            "Summary": "JK Lakshmi Cement delivered robust Q1 results with consolidated net profit rising to 1.5 billion rupees from 567 million rupees year-over-year. Revenue increased to 17.4 billion rupees compared to 15.63 billion rupees in the same period last year. EBITDA grew to 3.3 billion rupees from 2.35 billion rupees, while EBITDA margin expanded to 19.13% from 15.06% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754050568856,
            "Source": "earnings"
        },
        {
            "Title": "JK Lakshmi Cement Appoints New Deputy Managing Director and Independent Director",
            "Summary": "JK Lakshmi Cement's board approved key leadership appointments subject to shareholder approval. Shrivats Singhania, aged 41, was appointed as Deputy Managing Director for 5 years. He holds degrees from IILM New Delhi and Landmark College, USA, and has completed management programs at Harvard Business School and London Business School. Under his leadership at subsidiary UCWL, solar power capacity increased from 10.1 MW to 15.45 MW in fiscal 2022-23, and cement production capacity doubled from 2.20 MTPA to 4.70 MTPA with a new grinding unit commissioned in March 2024. Vimal Bhandari, aged 67, was appointed as Independent Director for 3 years. He is a Chartered Accountant with over 35 years in financial services, including 25 years at board level. He currently serves as Independent Director on boards of HDFC Trustee, Escorts Kubota, KEC International and Polly Medicure. Arun Kumar Shukla was re-appointed as President & Director for 3 years. Singhania is related to Chairperson & Managing Director Vinita Singhania.",
            "Sentiment": "positive",
            "PublishDate": 1754049497204,
            "Source": "corporate_governance"
        },
        {
            "Title": "JK Lakshmi Cement Wins Bid for Limestone Mining and Cement Plant Project in Assam",
            "Summary": "JK Lakshmi Cement has been declared the leading bidder for a 630-hectare limestone mining and cement plant project in Assam. The company estimates that this project could potentially increase its annual revenue by 30%.",
            "Sentiment": "positive",
            "PublishDate": 1751881135000,
            "Source": "default"
        },
        {
            "Title": "JK Lakshmi Cement Block Trade on NSE",
            "Summary": "A block trade of JK Lakshmi Cement Ltd. shares occurred on the National Stock Exchange (NSE). The trade involved approximately 201,964 shares at a price of Rs. 978.75 per share, totaling Rs. 19.77 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1751880700000,
            "Source": "block_details"
        },
        {
            "Title": "NCLT Approves Amalgamation Plan for JK Lakshmi Cement",
            "Summary": "JK Lakshmi Cement has received approval from the National Company Law Tribunal (NCLT) for its amalgamation plan. The plan involves the merger of Udaipur Cement Works and other unspecified enterprises with JK Lakshmi Cement.",
            "Sentiment": "positive",
            "PublishDate": 1749734623000,
            "Source": "default"
        },
        {
            "Title": "JK Lakshmi Cement: Expansion Plans and Upgraded Rating",
            "Summary": "JK Lakshmi Cement is expanding capacity with projects in Gujarat, Chhattisgarh, Uttar Pradesh, Bihar, and Jharkhand. Total capex is Rs25 bn, with Rs17.5 bn from debt. Dolat Capital has upgraded the stock to 'Add' due to higher profitability.",
            "Sentiment": "positive",
            "PublishDate": 1748499240000,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Lakshmi Cement: Q4 Revenue and Profit Show Solid Growth",
            "Summary": "JK Lakshmi Cement reported a 6.6% increase in Q4 revenue to Rs 1,897.62 crore. Net profit rose by 17% to Rs 183.54 crore. EBITDA grew 4% to Rs 351.20 crore, with a slight margin decrease to 18.5%. The company's share price spiked over 2% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1748404177000,
            "Source": "earnings"
        },
        {
            "Title": "JK Lakshmi Cement: Q4 Profit Up 17%, Dividend Announced",
            "Summary": "JK Lakshmi Cement reported a 17% YoY increase in Q4 net profit to ₹184 crore. Revenue grew 6.5% to ₹1,897.6 crore. The company recommended a dividend of ₹6.50 per share. Expansion plans include enhancing TSR at Sirohi plant, expanding Surat grinding unit, and a ₹2,500 crore capacity expansion project across multiple states.",
            "Sentiment": "positive",
            "PublishDate": 1748349985000,
            "Source": "earnings"
        },
        {
            "Title": "JK Lakshmi Cement Reports Q4 Results and Dividend Recommendation",
            "Summary": "JK Lakshmi Cement has announced its quarterly results and dividend recommendation. The company's Q4 consolidated net profit increased to 1.8 billion rupees from 1.57 billion rupees year-over-year. Revenue rose to 18.98 billion rupees from 17.81 billion rupees in the same period last year. EBITDA slightly improved to 3.67 billion rupees from 3.62 billion rupees, while the EBITDA margin decreased to 19.34% from 20.38% year-over-year. The company has recommended a dividend of 6.50 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748347409000,
            "Source": "result"
        },
        {
            "Title": "JK Lakshmi Cement to Enter Power Purchase Agreement for Solar Power",
            "Summary": "JK Lakshmi Cement plans to enter into a power purchase agreement with a Special Purpose Vehicle (SPV) for solar power. The agreement is valued at 4 crore rupees. Additionally, the company will acquire a 26% equity stake in the SPV.",
            "Sentiment": "positive",
            "PublishDate": 1747916757000,
            "Source": "default"
        },
        {
            "Title": "JK Lakshmi Cement: Rs 45.6 Crore Tax Demand Received",
            "Summary": "JK Lakshmi Cement received a Rs 45.6 crore tax demand from the Income Tax Department for the assessment year 2022-23. The company plans to appeal, believing the demand is legally untenable. They do not anticipate any material impact on their operations or finances.",
            "Sentiment": "neutral",
            "PublishDate": 1742356725000,
            "Source": "corporate_governance"
        },
        {
            "Title": "JK Lakshmi Cement to Invest ₹11,000 Crore in New Assam Plant",
            "Summary": "JK Lakshmi Cement has announced plans to invest ₹11,000 crore in Assam for the construction of a new cement plant. This significant investment demonstrates the company's commitment to expanding its production capacity and strengthening its presence in the northeastern region of India.",
            "Sentiment": "positive",
            "PublishDate": 1741764565000,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Lakshmi Cement Reports Large Block Trade on NSE",
            "Summary": "A significant block trade of JK Lakshmi Cement Ltd. shares occurred on the National Stock Exchange (NSE). Approximately 503,069 shares were traded for a total value of Rs. 34.28 crores, at a price of Rs. 681.40 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1740732153000,
            "Source": "block_deals"
        },
        {
            "Title": "JK Lakshmi Cement Approves Acquisition of 26% Stake in STLC RE",
            "Summary": "JK Lakshmi Cement has announced its approval to acquire a 26% equity shareholding in STLC RE. This strategic move indicates the company's efforts to expand its portfolio or strengthen its position in the cement industry. The acquisition of a significant minority stake suggests potential collaboration or increased influence in STLC RE's operations.",
            "Sentiment": "positive",
            "PublishDate": 1738846182000,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Lakshmi Cement Reports Decline in Q3 EBITDA and Margin",
            "Summary": "JK Lakshmi Cement's third-quarter EBITDA decreased to 2.11 billion rupees from 3.19 billion rupees year-over-year. The company's EBITDA margin also fell to 14.09% from 18.73% in the same period last year, indicating a significant reduction in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1738846070000,
            "Source": "earnings"
        },
        {
            "Title": "JK Lakshmi Cement Reports Decline in Q3 Profit and Revenue",
            "Summary": "JK Lakshmi Cement has reported its financial results for the third quarter. The company's consolidated net profit decreased to 594 million rupees from 1.44 billion rupees in the same period last year. Revenue also declined to 14.97 billion rupees from 17.03 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738846062000,
            "Source": "earnings"
        },
        {
            "Title": "JK Lakshmi Cement: Q3 Results Announcement and Earnings Call Scheduled",
            "Summary": "JK Lakshmi Cement will announce Q3 FY2024-25 results on February 6, 2025. An earnings call is scheduled for February 7, 2025, at 4:00 PM IST. The company's Q2 results showed a 21.6% revenue decline and a net loss, contrasting with a profit in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1738563840000,
            "Source": "earnings"
        },
        {
            "Title": "JK Lakshmi Cement: Stock Exchanges Approve Amalgamation Plan",
            "Summary": "JK Lakshmi Cement received approval from NSE and BSE for its plan to merge three subsidiaries. The scheme involves Udaipur Cement Works, Hansdeep Industries and Trading, and Hidrive Developers and Industries. Shareholders of Udaipur Cement Works will receive 4 shares of JK Lakshmi Cement for every 100 shares held.",
            "Sentiment": "positive",
            "PublishDate": 1735876511000,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Lakshmi Cement: Stock Exchanges Approve Merger with Three Subsidiaries",
            "Summary": "NSE and BSE have given consent to JK Lakshmi Cement Ltd for the merger of its three subsidiaries: Udaipur Cement Works, Hansdeep Industries and Trading, and Hidrive Developers and Industries. The merger aims to simplify the group structure and create a focused entity in the cement business. Shareholders of Udaipur Cement Works will receive 4 shares of JK Lakshmi Cement for every 100 shares held.",
            "Sentiment": "positive",
            "PublishDate": 1735832786000,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Lakshmi Cement: Unexpected Q2 Loss Amid Revenue Decline",
            "Summary": "JK Lakshmi Cement reported a loss of Rs 19.24 crore in Q2 FY25, contrary to analyst expectations. Revenue fell 21.6% to Rs 1,234.39 crore, while EBITDA dropped 59% to Rs 89.36 crore. The company's margin decreased to 7.2% from 13.8% in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1730893559000,
            "Source": "result"
        },
        {
            "Title": "JK Lakshmi Cement's Corporate Guarantee Waived by Udaipur Cement Works Lenders",
            "Summary": "<p><span class='neutral'>JK Lakshmi Cement</span> has announced that the <span class='positive'>lenders</span> of <span class='neutral'>Udaipur Cement Works</span> have <b>waived</b> the <span class='neutral'>corporate guarantee</span> provided by the company. The waived corporate guarantee amounted to <span class='neutral'>16.4 billion rupees</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728394069000,
            "Source": "corporate_action"
        }
    ]
}