{
    "Symbol": "JKPAPER",
    "ISIN": "INE789E01012",
    "News": [
        {
            "Title": "JK Paper Q3FY26 Net Profit Drops 79% to ₹12.67 Cr",
            "Summary": "JK Paper's Q3FY26 net profit declined 79% YoY to ₹12.67 crores due to planned shutdowns, import pressure, and rupee depreciation. Revenue fell 3% to ₹1,343.26 crores.",
            "Sentiment": "negative",
            "PublishDate": 1770296226371,
            "Source": "co_actions_results"
        },
        {
            "Title": "JK Paper Board Meet Set for Feb 5 to Review Q3FY26 Results",
            "Summary": "JK Paper Limited has scheduled a board meeting on February 5, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed until February 8, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769062163740,
            "Source": "co_actions_results"
        },
        {
            "Title": "JK Paper Gets Credit Rating Reaffirmation from Ind-Ra",
            "Summary": "India Ratings and Research reaffirms JK Paper's credit ratings across ₹10,500 million worth of funding facilities, maintaining IND AA/Stable outlook for bank loans and fixed deposits.",
            "Sentiment": "positive",
            "PublishDate": 1768286252337,
            "Source": "stocks"
        },
        {
            "Title": "JK Paper Shareholders Approve Composite Scheme of Arrangement for Multiple Company Amalgamations",
            "Summary": "JK Paper Limited shareholders approved a composite scheme of arrangement involving amalgamation of multiple companies including JKPL Utility Packaging Solutions Private Limited, Securipax Packaging Private Limited, and Horizon Packs Private Limited into JK Paper Limited. The scheme also includes demerger of EnviroTech Ventures Limited's undertaking into PSV Agro Products Private Limited and subsequent amalgamation of EnviroTech Ventures with JK Paper. The shareholder meeting was held on November 2, 2025, through video conferencing as directed by the National Company Law Tribunal, Ahmedabad Bench. The resolution was passed with 99.66% votes in favor, with 324 shareholders casting 12,31,56,196 votes supporting the proposal and only 10 shareholders with 4,14,581 votes against it. The voting included both remote e-voting and e-voting during the meeting, with Advocate Ansh Kakar serving as the scrutinizer.",
            "Sentiment": "positive",
            "PublishDate": 1762201861482,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Paper Reports 27% Decline in Quarterly Net Profit to ₹72 Crore",
            "Summary": "JK Paper Limited reported unaudited financial results for the quarter ended September 30, 2025. The company's net profit declined to ₹72.85 crore compared to ₹99.44 crore in the same quarter last year. Total income decreased to ₹1,378.36 crore from ₹1,469.39 crore year-on-year. The company cited higher wood costs and lower sales realization due to continuing cheap imports as factors affecting performance. During the period, JK Paper acquired an additional 20% stake in subsidiary Radhesham Wellpack Private Limited, bringing its total holding to 80%. The company also completed initial acquisition of 65.7% equity shares in Borkar Packaging Private Limited, making it a subsidiary. The Board approved these results at a meeting held on November 3, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762187339373,
            "Source": "earnings"
        },
        {
            "Title": "JK Paper Reports 42% Drop in Q2 Net Profit Despite Revenue Growth",
            "Summary": "JK Paper reported quarterly consolidated net profit of 748 million rupees, down from 1.3 billion rupees in the same period last year. Revenue increased to 17.5 billion rupees from 16.8 billion rupees year-over-year. EBITDA declined to 2.4 billion rupees from 2.95 billion rupees, while EBITDA margin compressed to 13.95% from 17.59% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762171976891,
            "Source": "earnings"
        },
        {
            "Title": "JK Paper Revises Timeline for Borkar Packaging Acquisition",
            "Summary": "JK Paper Limited updated the timeline for its acquisition of Borkar Packaging Private Limited (BPPL). The initial acquisition of equity shares from existing shareholders, previously expected to be completed within twelve weeks, is now anticipated to conclude within 6 weeks from the date of this intimation. The completion remains subject to fulfillment of conditions in the Share Purchase Subscription and Shareholders Agreement (SPSSHA). This update follows an earlier intimation dated July 28, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760609318937,
            "Source": "order&deals"
        },
        {
            "Title": "DGTR Imposes Anti-Dumping Duties on Multi-Layer Paperboards from Chile and China",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has imposed anti-dumping duties on multi-layer paperboards imported from Chile and China. This development affects JK Paper and the broader paperboard industry in India.",
            "Sentiment": "positive",
            "PublishDate": 1759202478767,
            "Source": "stock"
        },
        {
            "Title": "JK Paper Increases Stake in Radhesham Wellpack to 80%",
            "Summary": "JK Paper has completed the acquisition of an additional 20% stake in Radhesham Wellpack, bringing its total holding in the company to 80%. The transaction represents JK Paper's increased investment in the packaging business.",
            "Sentiment": "positive",
            "PublishDate": 1758883258321,
            "Source": "order&deals"
        },
        {
            "Title": "JK Paper Sets August 18, 2025 as Record Date for Dividend Payment",
            "Summary": "JK Paper Limited has announced August 18, 2025 as the record date for determining shareholder eligibility for dividend payment for the financial year 2024-25. The dividend is subject to declaration at the company's 64th Annual General Meeting scheduled for September 1, 2025. If approved, the dividend will be paid immediately after the AGM but within four weeks of the meeting date. For dematerialized shares, dividend payments will be based on beneficial ownership details received from depositories.",
            "Sentiment": "positive",
            "PublishDate": 1754569325716,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Paper Receives No Objection Letters from BSE and NSE for Composite Scheme of Arrangement",
            "Summary": "JK Paper Limited has received 'No adverse observation' letters from BSE and NSE for its proposed Composite Scheme of Arrangement involving multiple entities including JKPL Utility Packaging Solutions Private Limited, Securipax Packaging Private Limited, Horizon Packs Private Limited, Enviro Tech Ventures Limited and PSV Agro Products Private Limited. The observation letters were issued on August 4, 2025, under Regulation 37 of the Listing Regulations. NSE's letter includes several compliance requirements that JK Paper must fulfill, including disclosure of ongoing legal proceedings, ensuring financial information is not more than 6 months old, and providing detailed information about assets, liabilities, and impact on shareholders. The validity of the observation letter is six months from August 4, 2025, within which the scheme must be submitted to NCLT. The Board of Directors had previously approved the scheme on December 13, 2024, subject to regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1754387926267,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Paper Announces Book Closure and Rs. 5 Per Share Dividend for 64th AGM",
            "Summary": "JK Paper Ltd has announced a book closure period from August 19, 2025, to September 1, 2025, for its 64th Annual General Meeting scheduled on September 1, 2025. The company's Board of Directors has recommended a dividend of Rs. 5 per equity share of Rs. 10 each (50% dividend rate) for the financial year ended March 31, 2025, subject to shareholder approval at the AGM. The dividend will be paid to shareholders whose names appear on the company's register on August 18, 2025, and will be distributed immediately after the AGM but within four weeks of the meeting date.",
            "Sentiment": "positive",
            "PublishDate": 1754372234504,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Paper to Acquire 72% Stake in Borkar Packaging at ₹125.46 Per Share",
            "Summary": "JK Paper has announced its decision to purchase a 72% stake in Borkar Packaging at a price of ₹125.46 per share. This acquisition will give JK Paper majority control over Borkar Packaging's operations.",
            "Sentiment": "positive",
            "PublishDate": 1753706528191,
            "Source": "order&deals"
        },
        {
            "Title": "JK Paper Reports 33% Drop in Quarterly Profit, Approves Rs 500 Crore Debenture Issuance",
            "Summary": "JK Paper Limited reported a net profit of Rs 72.56 crore for the quarter ended June 30, 2025, compared to Rs 109.06 crore in the same period last year. Revenue from operations declined to Rs 1,471.07 crore from Rs 1,554.75 crore year-on-year. The company attributed the performance decline to lower volumes and sales realization due to cheap imports combined with continued high wood costs. The Board approved issuance of redeemable Non-Convertible Debentures up to Rs 500 crore for capital expenditure, working capital, and general corporate purposes. Additionally, the Board approved acquisition of majority stake in Borkar Packaging Private Limited, acquiring 72% shares upfront with the remaining 28% to be acquired within four years. Earnings per share decreased to Rs 4.28 from Rs 6.44 in the corresponding quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1753706442519,
            "Source": "earnings"
        },
        {
            "Title": "JK Paper Reports 42% Decline in Quarterly Net Profit to 812 Million Rupees",
            "Summary": "JK Paper reported quarterly consolidated net profit of 812 million rupees, down from 1.4 billion rupees in the same period last year. Revenue decreased to 16.74 billion rupees from 17.14 billion rupees year-over-year. EBITDA fell to 2.47 billion rupees from 2.8 billion rupees, while EBITDA margin compressed to 14.76% from 16.36% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1753705459888,
            "Source": "earnings"
        },
        {
            "Title": "JK Paper Board Meeting Scheduled for July 28 to Review Q1 Results and NCD Fundraising",
            "Summary": "JK Paper has scheduled a board meeting for July 28 to discuss the company's Q1 results and review plans for Non-Convertible Debenture (NCD) fundraising.",
            "Sentiment": "neutral",
            "PublishDate": 1753103946145,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Paper: Q4 Profit Plunges 72% Amid Import Surge and High Costs",
            "Summary": "JK Paper reported a 72.3% YoY drop in Q4FY25 net profit to Rs 77.05 crore. Revenue declined 1.7% to Rs 1,690 crore. EBITDA fell 42% to Rs 241.63 crore, with margins contracting by 993 bps. The company cited low-priced imports and high wood costs as key factors. A dividend of Rs 5 per share was recommended.",
            "Sentiment": "negative",
            "PublishDate": 1747713032000,
            "Source": "earnings"
        },
        {
            "Title": "JK Paper Ltd: Q4 Net Profit Plummets 72%, Margins Shrink",
            "Summary": "JK Paper's Q4 net profit fell 72% YoY to ₹77 crore. Revenue declined 1.7% to ₹1,689.5 crore. EBITDA margin contracted to 12.8% from 20.9%. The company achieved record sales volume of 8.06 lakh metric tonnes for the year. JK Paper acquired stakes in Radhesham Wellpack and Quadragen Vethealth during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747663070000,
            "Source": "earnings"
        },
        {
            "Title": "JK Paper Reports Profit Impact Due to Import Surge and High Wood Costs",
            "Summary": "JK Paper has stated that their profits have been negatively affected by two main factors: a surge in imports at low prices and high wood costs. The company did not provide specific financial figures or time periods for these impacts.",
            "Sentiment": "negative",
            "PublishDate": 1747662183000,
            "Source": "default"
        },
        {
            "Title": "JK Paper Reports Q4 Results and Recommends Dividend",
            "Summary": "JK Paper has announced its Q4 financial results and recommended a dividend. The company's Q4 consolidated net profit was 762 million rupees, down from 2.76 billion rupees year-over-year and up from 654 million rupees quarter-over-quarter. Q4 revenue stood at 16.9 billion rupees, slightly lower than 17.2 billion rupees in the same quarter last year. The company's Q4 EBITDA was 2.4 billion rupees, down from 4.2 billion rupees year-over-year, with EBITDA margin decreasing to 14.32% from 24.20% in the previous year. JK Paper has recommended a dividend of 5 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747659262000,
            "Source": "result"
        },
        {
            "Title": "JK Paper's Fort Songadh Unit Faces Production Disruption Due to Strike",
            "Summary": "JK Paper reports that trade unions have called a strike at its Fort Songadh unit, disrupting manufacturing activities. The company expects the strike to reduce production by 20%. JK Paper is currently in discussions with the trade unions to resolve the strike.",
            "Sentiment": "negative",
            "PublishDate": 1742220244000,
            "Source": "corporate_governance"
        },
        {
            "Title": "JK Paper: Q3 Profit Plunges 72% Amid Revenue Decline",
            "Summary": "JK Paper's Q3 FY25 results show profit down 72.19% YoY to ₹65.39 crore. Revenue decreased 4.35% to ₹1631.99 crore. Operating income fell 70.63% YoY. EPS at ₹3.86, down 72.19% YoY. Market cap stands at ₹6077.31 crore.",
            "Sentiment": "negative",
            "PublishDate": 1738303582000,
            "Source": "earnings"
        },
        {
            "Title": "JK Paper Ltd: Acquires Quadragen Vethealth for ₹460 Crore, Diversifies into Animal Health",
            "Summary": "JK Paper Ltd has acquired 65% stake in Quadragen Vethealth Pvt. Ltd for ₹460 crore, entering the specialty animal health, nutrition, and feed additives business. The remaining stake is expected to be purchased in four years. This marks JK Paper's fourth acquisition in 2.5 years.",
            "Sentiment": "positive",
            "PublishDate": 1738218196000,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Paper Reports Q3 Results and Announces Acquisition of Quadragen Vethealth",
            "Summary": "JK Paper reported a consolidated net profit of 654 million rupees for Q3, down from 2.35 billion rupees year-over-year and 1.29 billion rupees quarter-over-quarter. Q3 revenue was 17.32 billion rupees, slightly lower than 17.8 billion rupees in the previous year. The company has approved the acquisition of a majority stake in Quadragen Vethealth, starting with a 65% stake at 769.23 rupees per share. The remaining 35% stake will be acquired within the next 4 years.",
            "Sentiment": "neutral",
            "PublishDate": 1738197218000,
            "Source": "earnings"
        },
        {
            "Title": "JK Paper Acquires Majority Stake in Quadragen Vethealth",
            "Summary": "JK Paper has approved the acquisition of a 65% stake in Quadragen Vethealth (QVPL) at 769.23 rupees per share. The company plans to acquire the remaining 35% stake within the next four years.",
            "Sentiment": "positive",
            "PublishDate": 1738164091000,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Paper Ltd: Q3 Profit Plunges 54% Amid Cost Pressures",
            "Summary": "JK Paper reported a 54.2% YoY decline in Q3 FY25 consolidated net profit to ₹333.52 crore. Revenue dipped 0.86% to ₹1,697.99 crore. The company cited low-priced imports and high wood costs as key factors. JK Paper also announced acquisitions in packaging and animal nutrition sectors.",
            "Sentiment": "negative",
            "PublishDate": 1738158555000,
            "Source": "earnings"
        },
        {
            "Title": "JK Paper Reports Significant Decline in Q3 EBITDA and Margin",
            "Summary": "JK Paper has reported its Q3 financial results, showing a substantial decrease in EBITDA and EBITDA margin compared to the same period last year. The company's EBITDA fell to 1.9 billion rupees from 4.28 billion rupees year-over-year. Additionally, the EBITDA margin dropped to 10.96% from 24.04% in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1738153968000,
            "Source": "earnings"
        },
        {
            "Title": "JK Paper Reports Decline in Q3 FY24 Financial Performance",
            "Summary": "JK Paper's Q3 consolidated net profit decreased to 654 million rupees, down from 2.35 billion rupees year-over-year and 1.29 billion rupees quarter-over-quarter. The company's Q3 revenue also saw a slight decline to 17.32 billion rupees from 17.8 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1738153894000,
            "Source": "earnings"
        },
        {
            "Title": "JK Paper to Consider Q3 Results on January 29",
            "Summary": "JK Paper has announced that it will consider its third quarter (Q3) financial results on January 29. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737464492000,
            "Source": "result"
        },
        {
            "Title": "JK Paper Announces Acquisition and Merger Plans",
            "Summary": "JK Paper has approved the acquisition of a majority stake in Radhesham Wellpack. The company will initially purchase 60% of Radhesham Wellpack upfront, with plans to acquire the remaining 40% within two years. The purchase consideration is set at 8,463 rupees per equity share. Additionally, JK Paper has announced a scheme of arrangement to consolidate business operations, which includes merging three wholly-owned subsidiaries with JK Paper.",
            "Sentiment": "positive",
            "PublishDate": 1734310824000,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Paper Announces Merger of Three Wholly Owned Subsidiaries and Acquisition of RWPL",
            "Summary": "JK Paper Limited (JKPL) has announced two significant corporate actions. Firstly, three of its wholly owned subsidiaries will be merged with JKPL. Secondly, the company plans to acquire Ramky Waste Paper Limited (RWPL) in two stages: an initial 60% stake upfront, followed by the remaining 40% within two years.",
            "Sentiment": "positive",
            "PublishDate": 1734092933000,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Paper Acquires Radhesham Wellpack",
            "Summary": "JK Paper has announced the acquisition of Radhesham Wellpack. The purchase consideration for the acquisition is set at 8,463 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1734089173000,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Paper Reports Decline in Q2 EBITDA and Margin",
            "Summary": "JK Paper's Q2 EBITDA decreased to 2.95 billion rupees from 4.66 billion rupees year-over-year. The company's EBITDA margin also dropped to 17.59% from 26.63% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730727585000,
            "Source": "result"
        },
        {
            "Title": "JK Paper Reports Q2 Financial Results",
            "Summary": "JK Paper announced its Q2 consolidated net profit of 1.3 billion rupees, showing a decrease from 3.02 billion rupees year-over-year. However, there's a slight decrease from 1.4 billion rupees quarter-over-quarter. The company's Q2 revenue increased to 16.8 billion rupees from 16.5 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730727505000,
            "Source": "result"
        },
        {
            "Title": "Anti-Dumping Investigation on Virgin Multi-Layer Paperboard Imports",
            "Summary": "<p>An <span class='negative'>anti-dumping investigation</span> has been initiated regarding imports of <span class='neutral'>virgin multi-layer paperboard</span> from <b>Chile</b> and <b>China</b>. This action follows allegations that these imports are causing <span class='negative'>material injury</span> to the <span class='positive'>domestic industry</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728012729000,
            "Source": "corporate_action"
        }
    ]
}