{
    "Symbol": "JKTYRE",
    "ISIN": "INE573A01042",
    "News": [
        {
            "Title": "JK Tyre Gets ESG Rating of 69.8 from SES ESG Research",
            "Summary": "JK Tyre & Industries receives improved ESG rating of 69.8 from SES ESG Research Private Limited, up from previous rating of 69.3 for 2024, based on FY 2024-25 public domain data.",
            "Sentiment": "positive",
            "PublishDate": 1770730721435,
            "Source": "stocks"
        },
        {
            "Title": "JK Tyre Q3FY26 QIP Monitoring Report Shows Progress",
            "Summary": "JK Tyre submits Q3FY26 monitoring agency report for QIP proceeds utilization. Company utilized ₹111.35 crores during quarter, with ₹162.32 crores remaining unutilized.",
            "Sentiment": "neutral",
            "PublishDate": 1770637122673,
            "Source": "stocks"
        },
        {
            "Title": "JK Tyre Approves Rs 1,130 Crore Capacity Expansion",
            "Summary": "JK Tyre & Industries board approves 6.5% capacity expansion for TBR, ASLTR and PCR tyres with Rs 1,130 crore investment, targeting completion by Q2FY28 to capitalize on robust industry demand.",
            "Sentiment": "positive",
            "PublishDate": 1770407001358,
            "Source": "stocks"
        },
        {
            "Title": "JK Tyre Q3FY26 Net Profit Surges 3.7x to ₹209 Cr",
            "Summary": "JK Tyre reports strong Q3FY26 performance with net profit jumping 3.7x to ₹209 crores, revenue at ₹4,236 crores, and EBITDA margin expanding 470 bps to 13.8%.",
            "Sentiment": "positive",
            "PublishDate": 1770382512415,
            "Source": "co_actions_results"
        },
        {
            "Title": "JK Tyre Gets Credit Rating Reaffirmation Post-Merger",
            "Summary": "CARE Ratings reaffirmed JK Tyre's CARE AA-/CARE A1+ ratings following completion of merger with subsidiary Cavendish Industries Limited on December 22, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1768310170653,
            "Source": "stocks"
        },
        {
            "Title": "JK Tyre Completes Cavendish Industries Merger",
            "Summary": "JK Tyre & Industries successfully completes merger of subsidiary Cavendish Industries Ltd, acquired in 2016, achieving 95% capacity utilization and creating operational synergies.",
            "Sentiment": "positive",
            "PublishDate": 1766554072049,
            "Source": "co_actions_results"
        },
        {
            "Title": "HDFC Mutual Fund Increases Stake in JK Tyre to 5.02%",
            "Summary": "HDFC Mutual Fund schemes acquired additional shares in JK Tyre & Industries, raising their aggregate holding to 5.02% of paid-up equity share capital through open market transactions on December 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765801544844,
            "Source": "stocks"
        },
        {
            "Title": "JK Tyre Industries Receives Upgraded ESG Rating from CRISIL",
            "Summary": "JK Tyre Industries' ESG rating has been upgraded by CRISIL ESG Ratings Analytics Limited from 56 to 61, moving the classification from 'Adequate' to 'Strong'. The rating was assigned independently by CRISIL without engagement from the company, based solely on publicly disclosed information under SEBI's ESG rating framework.",
            "Sentiment": "positive",
            "PublishDate": 1764845776192,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Tyre Board Sets December 22 as Record Date for Cavendish Industries Merger",
            "Summary": "JK Tyre's board has approved December 22 as the record date for the merger with Cavendish Industries, establishing share entitlement eligibility. The decision affects shareholders of both companies by determining who will be entitled to receive shares in the merged entity.",
            "Sentiment": "positive",
            "PublishDate": 1764335897322,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Approves JK Tyre's Merger with Cavendish Industries",
            "Summary": "The National Company Law Tribunal sanctioned the amalgamation scheme between JK Tyre Industries Limited and Cavendish Industries Limited with an appointed date of April 1, 2025. Under the merger, Cavendish Industries shareholders will receive 92 equity shares of JK Tyre for every 100 shares held, combining businesses in automotive tyres, tubes and flaps manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1763647739481,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Tyre Subsidiary Sells 40 Lakh Cavendish Industries Shares for Rs 130.64 Crore",
            "Summary": "JK Tornel, a subsidiary of JK Tyre Industries, has agreed to sell 40,00,000 equity shares of Cavendish Industries Ltd. to promoter entities Bengal Assam Company Ltd. and J.K. Fenner (India) Ltd. for Rs 130.64 crore. The transaction is structured as a related party deal at arm's length basis, with Cavendish Industries contributing 27.02% of consolidated income and 21.94% of net worth in FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1763560500153,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Tyre Plans Rs 5,000 Crore Investment Over Six Years to Expand Production Capacity",
            "Summary": "JK Tyre and Industries announced plans to invest Rs 5,000 crore over the next 5-6 years to expand production capacity for both car and truck tyres, including dedicated export lines. Chairman and Managing Director Raghupati Singhania stated the company is currently completing a Rs 4,000 crore investment cycle that began 4 years ago and is expected to end next quarter. The company launched India's first embedded smart tyres for passenger vehicles, featuring advanced sensors that monitor air pressure, temperature, and potential leaks. These tyres are manufactured at the Banmore facility in Madhya Pradesh and will be available through dealerships in 14-17 inch sizes. JK Tyre currently derives 14% of revenue from exports to 110 global markets but faces challenges from 50% US tariffs, leading to strategy shifts toward other markets and increased use of its Mexico plant for US exports. Singhania expects the domestic tyre industry to grow 5-7% this year, with JK Tyre performing slightly better, supported by potential GST changes and small car market revival.",
            "Sentiment": "positive",
            "PublishDate": 1762776361052,
            "Source": "stock"
        },
        {
            "Title": "JK Tyre Reports Record Q2 FY26 Revenue of Rs 4,026 Crores with 10% YoY Growth",
            "Summary": "JK Tyre Industries achieved its highest-ever quarterly consolidated revenue of Rs 4,026 crores in Q2 FY26, marking a 10% year-on-year increase. The company's consolidated EBITDA grew 21% to Rs 536 crores with margins improving to 13.3% from 10.9% in the previous quarter. Profit after tax increased 54% year-on-year to Rs 223 crores. Domestic market volumes grew 15% while export volumes increased 13% quarter-on-quarter despite US tariff uncertainties. The company benefited from GST reduction on tyres from 28% to 18%, which it passed entirely to customers. JK Tyre's Mexican subsidiary JK Tornel recorded sales of Rs 639 crores, up 26% sequentially, with EBITDA reaching Rs 49 crores compared to Rs 10 crores in the previous quarter. The company is implementing three expansion projects worth Rs 1,400 crores across PCR, TBR, and ASLTR categories, expected to start production in Q3 FY26. Management provided guidance for EBITDA margins in the 13-15% range and expects to maintain double-digit revenue growth going forward.",
            "Sentiment": "positive",
            "PublishDate": 1762255914948,
            "Source": "earnings"
        },
        {
            "Title": "JK Tyre Targets ₹20,000+ Crore Revenue By FY27 Through Capacity Expansion",
            "Summary": "JK Tyre is expanding its capacity in radial and EV-ready tyres as part of a global scale-up strategy. The company targets revenue of over ₹20,000 crore by FY27. The expansion focuses on strengthening OEM partnerships and increasing export market penetration to improve margins and establish leadership in sustainable mobility solutions.",
            "Sentiment": "positive",
            "PublishDate": 1761668138518,
            "Source": "stock"
        },
        {
            "Title": "JK Tyre Reports 54% Jump in Net Profit for Q2 FY26",
            "Summary": "JK Tyre & Industries Limited announced its quarterly results for the period ended September 30, 2025. The company reported consolidated revenue from operations of Rs. 4,014.31 crores and profit after tax of Rs. 223 crores, representing a 54% year-on-year increase. EBITDA for the quarter stood at Rs. 536 crores with a margin of 13.3%. Domestic volumes grew 15% driven by growth across segments, while export volumes increased 13% over the previous quarter. The company operates through three geographical segments: India, Mexico, and Others. Both Cavendish (India) and Tornel (Mexico) subsidiaries showed significant performance improvement. JK Tyre received CareEdge ESG 1+ rating for the third consecutive year and has been recognized as 'Great Place to Work' for the fifth consecutive year.",
            "Sentiment": "positive",
            "PublishDate": 1761564701066,
            "Source": "earnings"
        },
        {
            "Title": "JK Tyre & Industries Receives Leadership ESG Rating with 81.2 Overall Score",
            "Summary": "JK Tyre & Industries Ltd. has been assigned a CareEdge-ESG1+ rating by CARE ESG Ratings Limited, placing the company in the 'Leadership' category with an overall ESG score of 81.2. The rating breakdown shows Environmental score of 80.6, Social score of 84.9, and Governance score of 77.5. The company achieved leadership position through best-in-class disclosures, policies, and performance across ESG parameters. Environmental performance was driven by proactive carbon and energy management, renewable energy investments, and decarbonisation technologies. Social leadership was demonstrated through strong performance in product safety, employee health and safety, community development, consumer protection, and value chain management. The governance score reflects well-established ethical and compliance systems. The company received confirmation of these ratings on 27th October 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761563434220,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Tyre & Industries Sees Rs. 22.54 Crore Block Trade on NSE",
            "Summary": "JK Tyre & Industries Ltd. witnessed a block trade worth Rs. 22.54 crores on the National Stock Exchange. The transaction involved approximately 537,134 shares at a price of Rs. 419.60 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1761278832647,
            "Source": "order&deals"
        },
        {
            "Title": "JK Tyre & Industries Schedules Q2 FY2025-26 Results Conference Call for October 29",
            "Summary": "JK Tyre & Industries Ltd has scheduled a conference call to discuss its Quarter 2 FY2025-26 results on Wednesday, October 29, 2025, at 4:00 PM IST. The call will be facilitated by Emkay Global Financial Services Ltd and will feature key company executives including Managing Director Anshuman Singhania, Director and President – International Arun K Bajoria, Financial Advisor AK Kinra, and CFO Sanjeev Aggarwal. The company has provided dial-in numbers for universal access and international toll-free participation across multiple countries.",
            "Sentiment": "neutral",
            "PublishDate": 1761132047425,
            "Source": "earnings"
        },
        {
            "Title": "JK Tyre Plans Rs 1,400 Crore Investment to Boost International Expansion",
            "Summary": "JK Tyre & Industries is investing Rs 1,400 crore to expand production capacity at two locations, with operations expected to ramp up from the third quarter. Managing Director Anshuman Singhania stated the company exports to about 100 countries including UAE, Brazil, Latin America, Mexico, EU and UK. The company positions itself as one of the largest exporters of truck radial tyres from India to the UK and EU, though it remains a small player in European markets with plans to develop new sizes for that region. Singhania highlighted that recent Free Trade Agreements provide Indian tyre manufacturers with competitive advantages. While focusing on organic growth through brownfield expansions, the company remains open to strategic international acquisitions for technology and faster market access. JK Tyre shares closed 0.83% higher at Rs 378 on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1758598518069,
            "Source": "stock"
        },
        {
            "Title": "JK Tyre Faces Revised CGST Penalties of Rs. 1,047.91 Crore",
            "Summary": "JK Tyre has been imposed revised Central Goods and Services Tax (CGST) penalties totaling Rs. 1,047.91 crore for FY 2017-18 and FY 2018-19. The penalties represent a significant financial obligation for the tire manufacturer related to GST compliance issues during these fiscal years.",
            "Sentiment": "negative",
            "PublishDate": 1758106723078,
            "Source": "stock"
        },
        {
            "Title": "JK Tyre Shareholders and Creditors Approve Amalgamation with Cavendish Industries",
            "Summary": "JK Tyre & Industries Limited received approval from both unsecured creditors and equity shareholders for its scheme of amalgamation with Cavendish Industries Limited. The voting was conducted through remote e-voting and physical meetings on September 3, 2025. Unsecured creditors unanimously approved the resolution with 271 creditors voting in favor representing Rs. 1,382.98 crores. Equity shareholders also approved the resolution with 99.99% votes in favor, with 541 shareholders participating representing 20.39 crore shares. The amalgamation scheme was conducted under the directions of the National Company Law Tribunal, Jaipur Bench, with Justice Vijender Jain as the appointed Chairperson. The approval allows JK Tyre's Board to implement the arrangement and make necessary modifications as required by regulatory authorities.",
            "Sentiment": "positive",
            "PublishDate": 1756987643933,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Tyre Reports Best-Ever Domestic Performance with 9% Revenue Growth in Q1 FY26",
            "Summary": "JK Tyre & Industries delivered strong quarterly results with consolidated revenues of Rs.3,891 crores, up 6% year-on-year. The company achieved its best-ever domestic performance with India operations revenue of Rs.3,475 crores, growing 9% annually. Domestic sales grew 11% year-on-year, driven equally by replacement and OE segments. Key highlights include 32% growth in passenger radial replacement volumes, 7% growth in TBR volumes, and 26% growth in farm category replacement. EBITDA stood at Rs.424 crores with margins at 10.9%, improving from 10.2% in the previous quarter. The company reduced net debt by Rs.219 crores to Rs.3,862 crores and maintained capacity utilization at 80%. JK Tornel (Mexico) reported revenues of Rs.505 crores, up 12% quarter-on-quarter, though faced margin pressures due to US tariff uncertainties. Management expects margin recovery as tariff concerns ease and expressed confidence in double-digit growth for the full year, supported by festive season demand and infrastructure push.",
            "Sentiment": "positive",
            "PublishDate": 1755514237994,
            "Source": "earnings"
        },
        {
            "Title": "JK Tyres Targets Debt-to-EBITDA Ratio of 1.5X-1.8X, Expects Strong Double-Digit Growth",
            "Summary": "JK Tyres has set a target debt-to-EBITDA ratio between 1.5X and 1.8X. The company anticipates margin recovery for its Mexico operations following negative quarterly results. JK Tyres expects strong double-digit growth driven by auto industry recovery and resumption of infrastructure projects after elections.",
            "Sentiment": "positive",
            "PublishDate": 1754969852266,
            "Source": "stock"
        },
        {
            "Title": "JK Tyre Reports No Deviation in QIP Fund Utilization for Quarter Ended June 2025",
            "Summary": "JK Tyre & Industries submitted its monitoring agency report for the quarter ended June 30, 2025, showing proper utilization of proceeds from its Qualified Institutions Placement. The company raised INR 500 crores through QIP in December 2023, with funds allocated for capital expenditure (INR 350 crores), working capital requirements (INR 25 crores), and general corporate purposes (INR 116.10 crores). During the quarter, the company utilized INR 50.42 crores for capital expenditure, bringing total utilization to INR 92.92 crores. No funds were utilized for working capital or general corporate purposes during this quarter. The monitoring agency India Ratings & Research confirmed no deviation from stated objectives. Unutilized proceeds of INR 422.69 crores are temporarily parked in fixed deposits with HDFC Bank, earning returns between 7.50% to 7.76%. The company expects to complete all stated objectives by March 2026 as originally planned.",
            "Sentiment": "neutral",
            "PublishDate": 1754920568944,
            "Source": "stock"
        },
        {
            "Title": "JK Tyre Reports 6% Revenue Growth in Q1FY26, Secures $100 Million Sustainability-Linked Loan",
            "Summary": "JK Tyre reported a 6% year-over-year revenue increase in Q1FY26. The company is expanding its product portfolio with new electric vehicle and sustainable tyre launches while pursuing global expansion initiatives. JK Tyre secured a ₹100 million sustainability-linked loan from IFC. The company is focusing on ESG leadership as part of its strategy to drive long-term profitability and increase market share.",
            "Sentiment": "positive",
            "PublishDate": 1754665827413,
            "Source": "earnings"
        },
        {
            "Title": "JK Tyre Reports 51% Jump in Quarterly Profit to Rs 155 Crores",
            "Summary": "JK Tyre & Industries Limited reported consolidated profit after tax of Rs 155 crores for the quarter ended June 30, 2025, representing a 51% increase compared to the previous quarter. Total revenues stood at Rs 3,891 crores with EBITDA of Rs 424 crores, reflecting a 10.9% EBITDA margin. The company achieved 11% year-on-year sales growth driven by steady demand in both replacement and original equipment segments. Domestic market growth remained robust while passenger car tyre exports showed strong traction. Both subsidiaries Cavendish (India) and Tornel (Mexico) contributed significantly to overall financials. On standalone basis, the company reported revenue from operations of Rs 2,877 crores and profit after tax of Rs 143 crores. The company maintains its position among top 20 global tyre manufacturers with 11 manufacturing facilities across India and Mexico.",
            "Sentiment": "positive",
            "PublishDate": 1754638540322,
            "Source": "earnings"
        },
        {
            "Title": "JK Tyre Reports Mixed Q1 Results with Revenue Growth but Lower Margins",
            "Summary": "JK Tyre & Industries reported Q1 revenue of 39 billion rupees, up from 36.39 billion rupees year-over-year. However, EBITDA declined to 4.23 billion rupees from 5 billion rupees in the same period last year. The EBITDA margin compressed to 11% compared to 13.74% in the previous year. The company expects increased tyre demand in the second half driven by growth in infrastructure and the economy.",
            "Sentiment": "neutral",
            "PublishDate": 1754637331614,
            "Source": "stock"
        },
        {
            "Title": "JK Tyre Reports 22% Decline in Q1 Consolidated Net Profit",
            "Summary": "JK Tyre & Industries reported a consolidated net profit of 1.65 billion rupees for Q1, representing a decrease from 2.11 billion rupees in the same quarter of the previous year. This marks a year-on-year decline of approximately 22% in the company's quarterly earnings.",
            "Sentiment": "negative",
            "PublishDate": 1754636854265,
            "Source": "earnings"
        },
        {
            "Title": "JK Tyre & Industries Schedules Board Meeting for Q1 FY2026 Results on August 8, 2025",
            "Summary": "JK Tyre & Industries has announced a Board of Directors meeting scheduled for August 8, 2025, to consider and approve the standalone and consolidated unaudited financial results for the first quarter ended June 30, 2025. The results will be furnished to stock exchanges and published in newspapers immediately after the board meeting. The company's trading window has been closed from July 1, 2025, and will reopen on August 11, 2025, in accordance with insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1754295650887,
            "Source": "earnings"
        },
        {
            "Title": "JK Tyre Schedules Shareholder Meetings for September 3, 2025 on Cavendish Industries Merger",
            "Summary": "JK Tyre & Industries Limited has scheduled meetings for equity shareholders and unsecured creditors on September 3, 2025, to consider the scheme of amalgamation with Cavendish Industries Limited. The meetings will be conducted through video conferencing as directed by the National Company Law Tribunal, Jaipur Bench. The tribunal has appointed Justice Vijender Jain as chairperson for the meetings. Remote e-voting will commence on August 31, 2025 at 9:00 AM and conclude on September 2, 2025 at 5:00 PM. The cut-off date for equity shareholders' voting eligibility is August 27, 2025, while for unsecured creditors it is June 30, 2025. Under the proposed scheme, Cavendish Industries Limited will be merged with JK Tyre & Industries Limited. The scheme requires approval from equity shareholders and unsecured creditors, and is subject to subsequent regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1754059027824,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Tyre & Industries Approves Investment in STTY RE",
            "Summary": "The directors of JK Tyre & Industries have approved an investment of 12.2 million rupees in STTY RE. No further details about the nature of the investment or STTY RE were provided in the given information.",
            "Sentiment": "neutral",
            "PublishDate": 1752062775000,
            "Source": "default"
        },
        {
            "Title": "JK Tyre Aims for 1 Million Unit Capacity Growth by FY26",
            "Summary": "JK Tyre has announced plans to increase its production capacity by 1 million units by the fiscal year 2026. The company is focusing on digital transformation to enhance efficiency in its operations. This strategic move suggests JK Tyre is positioning itself for growth in the coming years, leveraging technology to improve its manufacturing processes.",
            "Sentiment": "positive",
            "PublishDate": 1749214312000,
            "Source": "default"
        },
        {
            "Title": "JK Tyre Supplies Radial Tyres for Electric Buses, Leads Bus Segment",
            "Summary": "JK Tyre is supplying truck radial tyres to electric buses and has become the largest participant in the bus segment with its EV platform, according to a concall update. The company is focusing on the growing electric vehicle market, particularly in the bus sector.",
            "Sentiment": "positive",
            "PublishDate": 1747883946000,
            "Source": "default"
        },
        {
            "Title": "JK Tyre Expects Raw Material Price Stabilization and Margin Improvement",
            "Summary": "JK Tyre anticipates stabilization of raw material prices in the coming quarters. The company executive states that margins are expected to improve immediately in the next financial year compared to FY25, driven by the absence of tariffs on tyre exports from Mexico to the US.",
            "Sentiment": "positive",
            "PublishDate": 1747883757000,
            "Source": "default"
        },
        {
            "Title": "JK Tyre and Industries Ltd: Shares Surge 12% Despite Weak Q4 Results",
            "Summary": "JK Tyre's shares rose 12.5% despite weak Q4 earnings, driven by positive management outlook. Raw material costs are stabilizing, margins expected to expand. The company is ready for EV market and sees good demand from Mexico. Q4 net profit declined 42.7% to ₹97 crore, while revenue increased 1.6% to ₹3,758.6 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747823478000,
            "Source": "earnings"
        },
        {
            "Title": "JK Tyre & Industries Reports Q4 Financial Results and Dividend",
            "Summary": "JK Tyre & Industries announced its Q4 consolidated net profit of 970.4 million rupees, compared to 1.69 billion rupees year-over-year and 515.2 million rupees quarter-over-quarter. The company's Q4 revenue was 37.59 billion rupees, up from 36.98 billion rupees in the same quarter last year. Additionally, the company recommended a dividend of 3 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747786939000,
            "Source": "default"
        },
        {
            "Title": "JK Tyre & Industries Ltd: Q4 Profit Plunges 43% Amid Margin Squeeze",
            "Summary": "JK Tyre & Industries Ltd reported a 42.7% YoY decline in Q4 FY25 consolidated net profit to ₹97 crore. Revenue grew marginally by 1.6% to ₹3,758.6 crore. EBITDA fell 24.6% to ₹363 crore, with margins contracting to 9.7% from 13% due to input costs and pricing pressures.",
            "Sentiment": "negative",
            "PublishDate": 1747746131000,
            "Source": "earnings"
        },
        {
            "Title": "JK Tyre & Industries Reports Q4 Results and Dividend Recommendation",
            "Summary": "JK Tyre & Industries has reported its quarterly results. The company's Q4 EBITDA was 3.63 billion rupees, down from 4.81 billion rupees year-over-year. The EBITDA margin decreased to 9.66% from 13.01% in the same period last year. Q4 revenue increased to 37.59 billion rupees from 36.98 billion rupees year-over-year. The consolidated net profit for Q4 was 970.4 million rupees, down from 1.69 billion rupees year-over-year and up from 515.2 million rupees quarter-on-quarter. The company has recommended a dividend of 3 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747745155000,
            "Source": "result"
        },
        {
            "Title": "JK Tyre & Industries Tax Order Set Aside by Tax Authority",
            "Summary": "JK Tyre & Industries has reported that a tax order against the company has been set aside by the tax authority. This decision suggests a favorable outcome for the company in a tax-related matter, potentially reducing its tax liability or resolving a dispute with tax officials.",
            "Sentiment": "positive",
            "PublishDate": 1741047140000,
            "Source": "corporate_governance"
        },
        {
            "Title": "JK Tyre & Industries: Tax Authority Sets Aside Order Against Company",
            "Summary": "JK Tyre & Industries has announced that a tax authority has set aside an order that was previously issued against the company. This development suggests a favorable resolution to a tax-related matter for JK Tyre.",
            "Sentiment": "positive",
            "PublishDate": 1741006364000,
            "Source": "corporate_governance"
        },
        {
            "Title": "JK Tyre & Industries Ltd: President Anuj Kathuria Resigns Amid Investigation",
            "Summary": "Anuj Kathuria, President (India) of JK Tyre & Industries Ltd, has resigned effective February 14, 2025, citing personal reasons. His resignation comes amid an ongoing investigation by Mumbai police involving serious charges, which Kathuria denies. The company's shares were trading 1.9% lower following the news.",
            "Sentiment": "negative",
            "PublishDate": 1739867612000,
            "Source": "corporate_governance"
        },
        {
            "Title": "JK Tyre & Industries Q3 Results and Stake Increase in Treel Mobility Solutions",
            "Summary": "JK Tyre & Industries reported a consolidated net profit of 515 million rupees in Q3, down from 2.2 billion rupees year-over-year. Revenue slightly decreased to 36.74 billion rupees from 36.9 billion rupees. The company also approved increasing its stake in Treel Mobility Solutions from 26% to 66% for 100 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1738714921000,
            "Source": "earnings"
        },
        {
            "Title": "JK Tyre & Industries Increases Stake in Treel Mobility Solutions",
            "Summary": "JK Tyre & Industries has approved an increase in its stake in Treel Mobility Solutions from 26% to 66%. The deal is valued at 100 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738674080000,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Tyre & Industries Reports Decline in Q3 EBITDA and Margin",
            "Summary": "JK Tyre & Industries has reported a significant decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 3.14 billion rupees from 5.50 billion rupees in the same quarter of the previous year. Additionally, the EBITDA margin dropped to 8.54% from 14.92% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738670645000,
            "Source": "earnings"
        },
        {
            "Title": "JK Tyre & Industries Reports Decline in Q3 FY24 Net Profit",
            "Summary": "JK Tyre & Industries has reported a significant decrease in its consolidated net profit for the third quarter. The company's net profit fell to 515 million rupees, down from 2.2 billion rupees in the same period last year. Revenue also saw a slight decline, dropping to 36.74 billion rupees from 36.9 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738670630000,
            "Source": "earnings"
        },
        {
            "Title": "JK Tyre & Industries Secures $100 Million Sustainability-Linked Loan from IFC",
            "Summary": "JK Tyre & Industries has partnered with the International Finance Corporation (IFC) to secure a $100 million sustainability-linked loan. The company plans to use this funding to support the expansion of its tyre manufacturing capacity. This move aligns with the company's commitment to sustainable growth and environmental responsibility.",
            "Sentiment": "positive",
            "PublishDate": 1737505262000,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Tyre & Industries Secures $100M Sustainability-Linked Loan from IFC",
            "Summary": "JK Tyre & Industries has partnered with the International Finance Corporation (IFC) to secure a $100 million sustainability-linked loan. The company plans to use this funding to support the expansion of its tyre manufacturing capacity. This collaboration demonstrates JK Tyre's commitment to sustainable practices while pursuing growth in its core business.",
            "Sentiment": "positive",
            "PublishDate": 1737464651000,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Tyre & Industries: Rs 7.2 Crore GST Penalty Over Input Tax Credit Dispute",
            "Summary": "JK Tyre & Industries has been penalized Rs 7.2 crore by the GST Authority for not reversing input tax credit on compensation cess for coal from July 2017 to March 2022. The company faces a net demand of Rs 13 lakh after tax department appropriation. JK Tyre plans to appeal, stating the order doesn't significantly impact financials or operations.",
            "Sentiment": "negative",
            "PublishDate": 1734355780000,
            "Source": "corporate_governance"
        },
        {
            "Title": "JK Tyre & Industries Secures €30 Million Loan for Sustainable Expansion",
            "Summary": "JK Tyre & Industries has received a €30 million loan from DEG (Deutsche Investitions- und Entwicklungsgesellschaft) to expand its production capacities in Madhya Pradesh, India. The loan will be used to focus on sustainability initiatives and reducing carbon emissions in the company's manufacturing processes.",
            "Sentiment": "positive",
            "PublishDate": 1734048636000,
            "Source": "corporate_action"
        },
        {
            "Title": "JK Tyre & Industries Secures EUR 30 Million Loan from DEG for Sustainable Expansion",
            "Summary": "JK Tyre & Industries has obtained a EUR 30 million loan from DEG (Deutsche Investitions- und Entwicklungsgesellschaft) to expand its production capacities in Madhya Pradesh, India. The investment focuses on sustainability initiatives and aims to reduce carbon emissions in the company's manufacturing processes.",
            "Sentiment": "positive",
            "PublishDate": 1734011150000,
            "Source": "corporate_action"
        }
    ]
}