{
    "Symbol": "JLHL",
    "ISIN": "INE682M01012",
    "News": [
        {
            "Title": "Jupiter Life Line Hospitals schedules investor meet",
            "Summary": "Jupiter Life Line Hospitals Limited has scheduled an analyst and institutional investor meeting for February 10, 2026, at the Nuvama Conference in Mumbai from 2:00 pm to 5:00 pm.",
            "Sentiment": "neutral",
            "PublishDate": 1770214080808,
            "Source": "stocks"
        },
        {
            "Title": "Jupiter Life Line Q3 Net Profit Drops 18.2% YoY",
            "Summary": "Jupiter Life Line Hospital reports Q3 consolidated net profit of ₹426 million, down from ₹521 million YoY, while revenue grows to ₹3.65 billion from ₹3.30 billion YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1769780024714,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jupiter Life Line Hospitals Q3 FY26 Earnings Call",
            "Summary": "Jupiter Life Line Hospitals Limited announces earnings conference call scheduled for February 02, 2026 at 10:00 AM IST to discuss Q3 & 9M FY26 operational and financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1769174178908,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jupiter LifeLine Hospitals Receives Modified NCLT Order on Amalgamation Scheme",
            "Summary": "The National Company Law Tribunal Mumbai Bench modified its earlier directions regarding the proposed amalgamation between Medulla Healthcare Private Limited and Jupiter LifeLine Hospitals Limited. The NCLT now requires notice to be served only to unsecured creditors with outstanding amounts exceeding Rs 50,000, while all other previous directions remain unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1763469366188,
            "Source": "corporate_action"
        },
        {
            "Title": "Jupiter Lifeline Hospitals Reports 11.7% Revenue Growth in Q2 FY26, Dombivali Hospital Set to Launch Q1 FY27",
            "Summary": "Jupiter Lifeline Hospitals achieved total operating income of Rs. 374.4 crores in Q2 FY26 with 11.7% year-on-year growth, while EBITDA grew 9.3% to Rs. 85.4 crores and PAT increased 11% to Rs. 57.4 crores. The company's Dombivali Hospital is on track to begin operations in Q1 FY27 with Rs. 110 crores CAPEX spent, while construction has commenced for South Pune Hospital and architectural planning progresses for Mira Road Hospital.",
            "Sentiment": "positive",
            "PublishDate": 1763063347664,
            "Source": "earnings"
        },
        {
            "Title": "Jupiter Life Line Hospitals Reports 11% Growth in Q2 Net Profit to 575 Million Rupees",
            "Summary": "Jupiter Life Line Hospitals reported Q2 consolidated net profit of 575 million rupees compared to 518 million rupees in the same period last year. Revenue increased to 3.94 billion rupees from 3.35 billion rupees year-over-year. EBITDA rose to 922 million rupees from 782 million rupees, while EBITDA margin improved slightly to 23.44% from 23.34% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762515868588,
            "Source": "earnings"
        },
        {
            "Title": "Jupiter LifeLine Hospitals Schedules Earnings Conference Call for Q2H1 FY26",
            "Summary": "Jupiter LifeLine Hospitals Limited has announced an earnings conference call for investors and analysts scheduled for November 10, 2025, at 1:30 PM IST. The call will discuss the company's operational and financial performance for Q2H1 FY26. Dr. Ankit Thakker, Joint Managing Director and CEO, will represent the company along with the senior management team. The company has provided pre-registration details and multiple access numbers for participants across different regions including India, USA, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1762002141116,
            "Source": "earnings"
        },
        {
            "Title": "NCLT Approves Jupiter Life Line Hospitals' Amalgamation With Medulla Healthcare",
            "Summary": "The National Company Law Tribunal (NCLT) has approved the amalgamation of Jupiter Life Line Hospitals with Medulla Healthcare. The tribunal determined that no meetings for shareholders and creditors are required for this merger to proceed.",
            "Sentiment": "positive",
            "PublishDate": 1757575567075,
            "Source": "order&deals"
        },
        {
            "Title": "Jupiter Life Line Hospitals Reports 20.5% Revenue Growth in Q1 FY26, PAT Declines 1.6%",
            "Summary": "Jupiter Life Line Hospitals reported total income of INR 347.6 crores for Q1 FY26, marking a 20.5% year-on-year increase. EBITDA grew 19.6% to INR 78.1 crores with margins at 22.5%. However, PAT decreased 1.6% year-on-year to INR 43.9 crores with margins at 12.6%. The company attributed higher depreciation and finance costs to previous year's capex investments including 100 new beds, surgical robots, MRIs, and cath labs, which increased depreciation by over INR 10 crores compared to last year. Average occupancy was 60.1% versus 63.9% last year, though absolute occupancy increased 5% due to expanded bed capacity. ARPOB stood at INR 67,300 with patient volumes growing 11.7% to 2.6 lakh. The company commissioned a 1.2 megawatt solar plant in Madhya Pradesh, bringing total renewable energy capacity to 6.8 megawatts. Three greenfield hospitals in Dombivli, Pune (Bibvewadi), and Mira Road are progressing as planned, with Dombivli expected to start operations next year requiring approximately INR 200 crores additional investment.",
            "Sentiment": "neutral",
            "PublishDate": 1754479585354,
            "Source": "earnings"
        },
        {
            "Title": "Jupiter Life Line Hospitals Reports Mixed Q1 Results with Revenue Growth but Lower Profit",
            "Summary": "Jupiter Life Line Hospitals reported quarterly results showing revenue growth to 3.48 billion rupees from 2.88 billion rupees in the previous year. However, net profit declined to 438 million rupees compared to 445 million rupees in the same period last year. EBITDA increased to 781 million rupees from 653 million rupees year-over-year, while EBITDA margin slightly decreased to 22.47% from 22.63%.",
            "Sentiment": "neutral",
            "PublishDate": 1754047165096,
            "Source": "earnings"
        },
        {
            "Title": "Jupiter Life Line Hospitals Schedules Q1 FY26 Earnings Conference Call for August 4, 2025",
            "Summary": "Jupiter Life Line Hospitals Limited has scheduled an earnings conference call for August 4, 2025, at 11:00 AM IST to discuss operational and financial performance for Q1 FY26. The call will be led by Dr. Ankit Thakker, Joint Managing Director and CEO, along with the senior management team. The company has provided pre-registration details and multiple access numbers for investors and analysts to participate in the discussion.",
            "Sentiment": "neutral",
            "PublishDate": 1753444146362,
            "Source": "earnings"
        },
        {
            "Title": "Jupiter Life Line Hospitals: Expansion Plans and Improved Performance",
            "Summary": "Jupiter Life Line Hospitals plans three new hospitals in Dombivli, Pune, and Mira Road. The company reported 10% growth in ARPOB, with margins improving to 24%. Occupancy rates vary across units, with room for growth in Indore. The company has ₹600 crore in cash and is open to M&A opportunities in western India.",
            "Sentiment": "positive",
            "PublishDate": 1747040082000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jupiter Life Line Hospitals Reports Q4 Results and Dividend",
            "Summary": "Jupiter Life Line Hospitals announced its Q4 financial results and dividend recommendation. The company's Q4 EBITDA increased to 782 million rupees from 622.8 million rupees year-over-year, with EBITDA margin improving to 23.94% from 21.44%. Q4 consolidated net profit slightly decreased to 449 million rupees from 452.7 million rupees year-over-year. Revenue grew to 3.27 billion rupees from 2.9 billion rupees. The company has recommended a dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746795755000,
            "Source": "result"
        },
        {
            "Title": "Jupiter Life Line Hospitals Secures 3.60 Billion Rupees Loan from HDFC Bank",
            "Summary": "Jupiter Life Line Hospitals has entered into a loan agreement with HDFC Bank. The company has availed a term loan of 3.50 billion rupees and an overdraft facility of 100 million rupees, totaling 3.60 billion rupees in financial assistance.",
            "Sentiment": "positive",
            "PublishDate": 1742861403000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jupiter Life Line Hospitals Secures 3.60 Billion Rupees Loan from HDFC Bank",
            "Summary": "Jupiter Life Line Hospitals has entered into a loan agreement with HDFC Bank. The company has availed a term loan of 3.50 billion rupees and an overdraft facility of 100 million rupees, totaling 3.60 billion rupees in financing.",
            "Sentiment": "positive",
            "PublishDate": 1742827231000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jupiter Life Line Hospitals: Steady ARPOB Growth Expected, Expansion Plans on Track",
            "Summary": "Jupiter Life Line Hospitals anticipates gradual growth in average revenue per operating bed (ARPOB) in line with inflation. Insurance contract revisions in H2 2025 are expected to positively impact earnings. The company is expanding with new facilities in Dombivli, Pune, and Mira Road. Q3 FY2025 saw 18% revenue growth and 21% increase in net profit.",
            "Sentiment": "positive",
            "PublishDate": 1739525461000,
            "Source": "earnings"
        },
        {
            "Title": "Jupiter Life Line Reports Strong Q3 Financial Results",
            "Summary": "Jupiter Life Line has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 525 million rupees, up from 437 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 3.2 billion rupees compared to 2.73 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739146434000,
            "Source": "earnings"
        },
        {
            "Title": "Jupiter Life Line Reports Improved Q3 EBITDA and Margin",
            "Summary": "Jupiter Life Line has reported a significant increase in its Q3 EBITDA, rising from 617 million rupees to 751 million rupees year-over-year. The company's EBITDA margin also improved, increasing from 22.62% to 23.42% compared to the same period last year. This performance indicates a strengthening of the company's operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1738932784000,
            "Source": "earnings"
        },
        {
            "Title": "Jupiter Life Line Reports Q3 Financial Results",
            "Summary": "Jupiter Life Line announced its Q3 financial results, showing growth in both revenue and net profit. The company's consolidated net profit increased to 525 million rupees from 437 million rupees year-over-year. Revenue also saw a rise, reaching 3.2 billion rupees compared to 2.73 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738932778000,
            "Source": "earnings"
        },
        {
            "Title": "Jupiter Life Line Hospitals to Expand Capacity at Mira Road",
            "Summary": "Jupiter Life Line Hospitals has announced plans to add 300 beds to their proposed hospital in Mira Road. This expansion will significantly increase the company's healthcare capacity in the area.",
            "Sentiment": "positive",
            "PublishDate": 1737362948000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jupiter Life Line Hospitals Acquires Land for New Hospital",
            "Summary": "Jupiter Life Line Hospitals has purchased land in Mira Road for the purpose of establishing a new hospital. The investment for this acquisition is reported to be 400 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1737362756000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jupiter Life Line Hospitals Expands Capacity by 78 Beds",
            "Summary": "Jupiter Life Line Hospitals has increased its total bed capacity by adding 78 new beds, bringing the hospital's total capacity to 1,061 beds. This expansion represents a significant growth in the hospital's infrastructure and ability to serve patients.",
            "Sentiment": "positive",
            "PublishDate": 1735720651000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jupiter Life Line Hospitals Reports Q2 EBITDA Growth",
            "Summary": "Jupiter Life Line Hospitals has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 749.9 million rupees, up from 610 million rupees in the same quarter last year. The EBITDA margin also saw a slight improvement, rising to 23.25% from 23.19% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731070372000,
            "Source": "result"
        },
        {
            "Title": "Jupiter Life Line Hospitals Reports Q2 Revenue Growth",
            "Summary": "Jupiter Life Line Hospitals has announced its second quarter revenue for the current fiscal year. The company reported revenue of 3.2 billion rupees, compared to 2.6 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731070362000,
            "Source": "result"
        },
        {
            "Title": "Jupiter Life Line Hospitals Reports Q2 Profit Growth",
            "Summary": "Jupiter Life Line Hospitals announced its Q2 consolidated net profit of 515 million rupees, showing a significant increase from 336 million rupees year-over-year and 446 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731070353000,
            "Source": "result"
        }
    ]
}