{
    "Symbol": "JMFINANCIL",
    "ISIN": "INE780C01023",
    "News": [
        {
            "Title": "JM Financial Allots 28,200 Shares Under ESOP Series 16",
            "Summary": "JM Financial's Allotment Committee approved allotment of 28,200 equity shares to eligible employees under ESOP Scheme Series 16, increasing paid-up capital to ₹95,63,64,073.",
            "Sentiment": "positive",
            "PublishDate": 1770303750042,
            "Source": "co_actions_results"
        },
        {
            "Title": "JM Financial Q3 Net Profit Surges 47.6% YoY",
            "Summary": "JM Financial reported consolidated net profit of ₹3.1 billion for Q3, marking a 47.6% increase from ₹2.1 billion in the previous year, though revenue declined 9.7% to ₹9.99 billion.",
            "Sentiment": "positive",
            "PublishDate": 1770293747262,
            "Source": "co_actions_results"
        },
        {
            "Title": "JM Financial flags excise duty risk for oil stocks",
            "Summary": "JM Financial maintains buy ratings on Oil India and ONGC while warning of fiscal risks for state-run oil marketing companies ahead of Budget 2026-27, citing potential excise duty hikes.",
            "Sentiment": "neutral",
            "PublishDate": 1767858488418,
            "Source": "stocks"
        },
        {
            "Title": "JM Financial CEO sees 12-15% market returns in 2026",
            "Summary": "JM Financial's Dimplekumar Shah expects Indian equities to deliver moderate double-digit returns of 12-15% in 2026, driven by earnings-led valuation expansion rather than momentum-driven rallies.",
            "Sentiment": "positive",
            "PublishDate": 1767671763724,
            "Source": "stocks"
        },
        {
            "Title": "JM Financial Gets ESG Score of 66 from SEBI Provider",
            "Summary": "JM Financial Limited receives 'Strong' ESG rating of 66 from SEBI-registered ESG Risk.ai based on FY25 data. The independent assessment was conducted without company engagement.",
            "Sentiment": "positive",
            "PublishDate": 1767275560522,
            "Source": "stocks"
        },
        {
            "Title": "JM Financial Gets ICRA Rating Reaffirmation",
            "Summary": "ICRA Limited reaffirms [ICRA]AA (Stable) ratings for JM Financial's debentures and bank lines while reducing commercial paper programme from ₹300 crore to ₹100 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1767273579187,
            "Source": "stocks"
        },
        {
            "Title": "Credit card issuance drops 28% in Q2 FY26: JM Financial",
            "Summary": "JM Financial report shows credit card issuance declined 28% YoY in Q2 FY26 while other consumption credit segments recovered. Personal loans grew 35% and consumer durables rose 19% in the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1766586574434,
            "Source": "stocks"
        },
        {
            "Title": "SNK Investments completes JM Financial share acquisition",
            "Summary": "SNK Investments Private Limited successfully acquired 9.21 lakh equity shares of JM Financial Limited from Aruna Nimesh Kampani at ₹144.20 per share, completing the inter-se transfer disclosed in December 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766209675084,
            "Source": "co_actions_results"
        },
        {
            "Title": "JM Financial Receives ESG Score of 73.8 from SES ESG Research",
            "Summary": "SES ESG Research Private Limited, a SEBI registered ESG Rating Provider, independently assigned an ESG score of 73.8 (Grade B+) to JM Financial Limited based on FY2024-25 data. The company received this unsolicited rating on December 8, 2025, which was assigned using publicly available information without any engagement from JM Financial.",
            "Sentiment": "positive",
            "PublishDate": 1765291197245,
            "Source": "corporate_governance"
        },
        {
            "Title": "JM Financial Reports Strong Q2FY26 Performance with 77% PAT Growth and Announces Rs 1.5 Interim Dividend",
            "Summary": "JM Financial delivered robust quarterly results with PAT rising 77.3% to Rs 255 crore in Q2FY26, driven by strong performance across corporate advisory, wealth management, and home loans segments. The company announced an interim dividend of Rs 1.5 per share while maintaining leadership positions in IPOs and expanding its wealth management franchise with 2x increase in wealth RMs.",
            "Sentiment": "positive",
            "PublishDate": 1764594980774,
            "Source": "stock"
        },
        {
            "Title": "JM Financial Allots 1,19,783 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "JM Financial's Allotment Committee approved the allotment of 1,19,783 equity shares of face value ₹1 each to eligible employees who exercised stock options across five series (Series 15-19). Following this allotment, the company's paid-up equity share capital stands at ₹95,63,35,873 representing 95,63,35,873 equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763725168381,
            "Source": "corporate_action"
        },
        {
            "Title": "JM Financial Receives Rs 223.32 Crore Income Tax Refund After Tax Authority Order",
            "Summary": "JM Financial Limited received Rs 223.32 crore as income tax refund from tax authorities after certain adjustments, against an originally ordered refund of Rs 230 crore for assessment year 2008-09. The refund amount was credited to the company's bank account on November 14, 2025, following a Deputy Commissioner of Income Tax order received in February 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763201579812,
            "Source": "stock"
        },
        {
            "Title": "JM Financial Establishes New U.S. Subsidiary for Private Wealth Services",
            "Summary": "JM Financial has established a new step-down subsidiary called 'JM Financial Private Wealth, Inc.' in the United States. The subsidiary appears to focus on private wealth management services.",
            "Sentiment": "positive",
            "PublishDate": 1762877361318,
            "Source": "stock"
        },
        {
            "Title": "JM Financial Reports Strong Q2 Results with Operating PAT of INR 270 Crores, Declares Interim Dividend",
            "Summary": "JM Financial Limited reported operating profit after tax of INR 270 crores for the quarter ended September 2025. The company declared an interim dividend of INR 1.5 per share. Fees and commission income reached a record high of INR 341 crores for any quarter, showing 20% year-on-year growth for two consecutive quarters. The company closed 15 capital market transactions worth INR 28,000 crores and has filed documents for 56 IPOs aggregating approximately INR 120,000 crores. Wealth Management business crossed 1,000 sales personnel milestone, while recurring AUM grew 26% year-on-year to INR 32,000 crores. The Affordable Housing business reached AUM of INR 3,031 crores with 28% year-on-year growth. Consolidated net worth increased to INR 10,241 crores, translating to book value per share of INR 107. Annualized ROE based on half-year numbers stood at 14.4%.",
            "Sentiment": "positive",
            "PublishDate": 1762821471379,
            "Source": "earnings"
        },
        {
            "Title": "JM Financial Focuses on Scaling Retail Lending and Asset Management with ₹1.3 Lakh Cr AUM",
            "Summary": "JM Financial is focusing on scaling its retail lending and asset management businesses with a consolidated assets under management (AUM) of ₹1.3 lakh crore. The company aims to improve return ratios through cost optimization, leveraging its strong capital position, and expanding into the digital credit ecosystem. JM Financial is also strengthening its real estate financing and advisory verticals to drive sustainable growth.",
            "Sentiment": "positive",
            "PublishDate": 1762440731998,
            "Source": "stock"
        },
        {
            "Title": "JM Financial Declares Rs 1.5 Per Share Dividend, Reports Strong Q2 Performance",
            "Summary": "JM Financial announced a dividend of Rs 1.5 per share. The company reported Q2 EBITDA of Rs 6 billion compared to Rs 4.9 billion in the same period last year. The EBITDA margin improved significantly to 58.58% from 41.23% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762430729366,
            "Source": "corporate_action"
        },
        {
            "Title": "JM Financial Reports Mixed Q2 Results with Higher Profit but Lower Revenue",
            "Summary": "JM Financial reported consolidated net profit of 2.7 billion rupees for Q2, up from 2.32 billion rupees in the same period last year. However, the company's revenue declined to 10.3 billion rupees compared to 11.9 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1762430236075,
            "Source": "earnings"
        },
        {
            "Title": "JM Financial Schedules Board Meeting to Consider Q2 Results and Interim Dividend",
            "Summary": "JM Financial Limited has announced that its Board of Directors will meet on November 6, 2025, to consider and approve unaudited standalone and consolidated financial results for the second quarter and half year ending September 30, 2025. The board will also consider declaration of an interim dividend for the financial year 2025-26. The company's trading window for equity shares will remain closed from October 1, 2025, and will reopen 48 hours after the financial results are publicly announced.",
            "Sentiment": "neutral",
            "PublishDate": 1761931048085,
            "Source": "corporate_action"
        },
        {
            "Title": "JM Financial Home Loans CEO Says No New Housing Schemes Expected This Festive Season",
            "Summary": "JM Financial Home Loans CEO Manish Sheth stated that homebuyers should not expect new policy announcements or subsidies this festive season, as existing housing schemes are performing well. Under PMAY 2.0, 8.56 lakh homes have been sanctioned, with the Angikaar 2025 campaign launched to increase awareness among eligible beneficiaries. State-level programs like Maharashtra Housing Policy 2025 and Delhi Development Authority's new schemes are expected to show results in coming months. Mid-segment housing demand has tripled over four years, driven by India's rising middle class projected to reach 600 million by 2030. GST reduction on cement from 28% to 18% could reduce construction costs by 3-5%, as cement accounts for nearly one-third of material costs. JM Financial Home Loans aims to scale its loan book to ₹5,000 crore within two years and ₹10,000 crore by FY30.",
            "Sentiment": "neutral",
            "PublishDate": 1758703376455,
            "Source": "stock"
        },
        {
            "Title": "JM Group Entities Pay ₹3.92 Crore to Settle SEBI Case Over NCD Issue Irregularities",
            "Summary": "JM Financial, JM Financial Services, and JM Financial Products settled with SEBI over alleged irregularities in managing Piramal Enterprises' public NCD issue by paying ₹3.92 crore. JM Financial Ltd and JM Financial Services Ltd disgorged illegal gains of ₹1.22 crore and ₹1.33 crore respectively. The companies accepted voluntary three-month debarments from various debt securities activities. SEBI's investigation revealed that JM Financial Products provided loans at 10% interest to 1,008 applicants to purchase NCDs with lower coupon rates of 9-9.35%, then bought back the NCDs at predetermined higher prices on listing day, providing guaranteed profits to applicants. The scheme involved 11.34 lakh NCDs and allegedly generated ₹1.99 crore in net gains for the JM Group entities through shared commissions and incentives from the issuer. The settlement was reached without the entities admitting or denying the violations.",
            "Sentiment": "negative",
            "PublishDate": 1758627258920,
            "Source": "corporate_governance"
        },
        {
            "Title": "JM Financial Reports Record Operating PAT of INR 454 Crores, Net Worth Crosses INR 10,000 Crores",
            "Summary": "JM Financial achieved its highest ever operating PAT of INR 454 crores with net worth crossing INR 10,000 crores for the first time. The company reported 22% year-on-year growth in net revenue and pre-provisioning operating profit. Key highlights include a 56% decline in real estate loan book, INR 1,368 crores in ARC cash recoveries over 12 months, and net reversal of impairment of INR 204 crores. Corporate Advisory and Capital Markets segment showed strong performance with 53% revenue increase and 77% profit before tax growth. The company filed 45 IPO transactions worth INR 1 lakh crores. Wealth management recurring AUM grew 37% to INR 31,180 crores with significant hiring - wealth RMs increased 91% from 91 to 174. JM Financial reduced borrowings by INR 4,300 crores while maintaining growth. The company increased shareholding in JM Financial Credit Solutions to 100% and divested 2.1% stake in home loans business to Bajaj Allianz Life Insurance. Management expects to recover INR 250-300 crores annually over the next 3 years from current NPA of INR 760 crores.",
            "Sentiment": "positive",
            "PublishDate": 1755184513542,
            "Source": "earnings"
        },
        {
            "Title": "JM Financial Targets Over ₹25,000 Crores AUM in Alternatives Business",
            "Summary": "JM Financial has set a target to achieve over ₹25,000 crores in assets under management (AUM) for its alternatives business. The company is expanding its retail mortgages and capital markets operations. JM Financial plans to leverage its strong balance sheet and digital strategy to drive sustainable growth across these business segments.",
            "Sentiment": "positive",
            "PublishDate": 1754912194197,
            "Source": "stock"
        },
        {
            "Title": "JM Financial Reports Record Quarterly Operating PAT of Rs 454 Crore, Up 166% YoY",
            "Summary": "JM Financial Limited announced its highest ever quarterly operating profit after tax of Rs 454 crore for the first quarter ended June 30, 2025, representing a 166% year-on-year increase. The company's net worth crossed Rs 10,000 crore with book value per share at Rs 106.4. Net revenue grew 22% YoY to Rs 779 crore, while pre-provisioning operating profit increased 22% YoY to Rs 389 crore. The real estate loan book declined 56% YoY to Rs 2,063 crore, and borrowings reduced by Rs 4,300 crore over the last year. Key business highlights include achieving #1 position in Equity Capital Markets with 10 marquee transactions, wealth management AUM growing 7% YoY to Rs 1,14,228 crore, and mutual fund AUM increasing 49% YoY to Rs 13,901 crore. The company increased its shareholding in JM Financial Credit Solutions to 100% and Bajaj Allianz Life Insurance acquired a 2.1% stake in JM Financial Home Loans for Rs 65.5 crore, valuing the business at Rs 3,120 crore.",
            "Sentiment": "positive",
            "PublishDate": 1754901707553,
            "Source": "earnings"
        },
        {
            "Title": "JM Financial Reports Strong Q1 Performance with Revenue Growth and Net Profit Surge",
            "Summary": "JM Financial reported Q1 revenue of 11.11 billion rupees compared to 10.77 billion rupees in the same period last year, representing year-over-year growth. The company's consolidated net profit increased significantly to 4.54 billion rupees from 1.71 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754899853103,
            "Source": "earnings"
        },
        {
            "Title": "JM Financial Subsidiary Sells 2.10% Stake in Home Loans Unit to Bajaj Allianz for Rs. 65.50 Crore",
            "Summary": "JM Financial Credit Solutions Limited has signed an investment agreement to sell 1,36,46,000 equity shares of JM Financial Home Loans Limited to Bajaj Allianz Life Insurance Company Limited for Rs. 65.50 crore. The shares are priced at Rs. 48 per share and represent 2.10% of the home loans unit's total issued equity share capital. Following the transaction, JM Financial Credit Solutions' shareholding in the home loans unit will decrease from 8.98% to 6.88%, while JM Financial Limited's effective shareholding will reduce from 98.76% to 96.66%. The investment agreement was executed on August 9, 2025, with completion expected by August 31, 2025. JM Financial Home Loans contributed 8.27% to the consolidated income and 8.24% to the consolidated net worth of JM Financial Limited for the financial year ended March 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754807516238,
            "Source": "order&deals"
        },
        {
            "Title": "JM Financial: Analyst Projects Rs 1,000-Crore Profit in FY26",
            "Summary": "Analyst Digant Haria predicts JM Financial Ltd. will achieve Rs 1,000 crore profit in FY26, up from Rs 800 crore in FY25. The company is pivoting from wholesale lending to focus on wealth management, asset management, and affordable housing finance. Potential write-backs from old real estate loans could boost earnings. JM Financial is also returning to its core strength in deal-making, emphasizing fee income over interest income.",
            "Sentiment": "positive",
            "PublishDate": 1751503844000,
            "Source": "normal_news"
        },
        {
            "Title": "JM Financial to Acquire Remaining Stake in Credit Solutions Subsidiary",
            "Summary": "JM Financial has announced plans to purchase the remaining 2.98% stake in JM Financial Credit Solutions for ₹88.97 crore. This acquisition will make JM Financial Credit Solutions a fully-owned subsidiary of JM Financial.",
            "Sentiment": "positive",
            "PublishDate": 1751106618000,
            "Source": "default"
        },
        {
            "Title": "JM Financial to Review Q1 Results on August 11",
            "Summary": "JM Financial has announced that it will review its first quarter results on August 11. No specific details about the financial performance or expectations were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1750855013000,
            "Source": "default"
        },
        {
            "Title": "JM Financial: Q4 Profit Soars 5-Fold, Dividend Announced",
            "Summary": "JM Financial reported Q4 FY25 net profit of ₹134.6 crore, up from ₹27.5 crore year-over-year. The company announced a dividend of ₹2.7 per share. Net interest income grew 32% to ₹250 crore. Mutual fund AUM doubled to ₹13,419 crore, and elite wealth AUM increased 36% to ₹2,584 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747182761000,
            "Source": "earnings"
        },
        {
            "Title": "JM Financial: Share Price Surges 10% on Q4 Results and Dividend Announcement",
            "Summary": "JM Financial's share price rose 9% in morning trades, reaching an intraday high of ₹116.55, following Q4 results announcement. The company recommended a dividend of ₹2.70 per share for FY 2024-25, subject to shareholder approval at the upcoming AGM scheduled for August 12, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1747109113000,
            "Source": "result"
        },
        {
            "Title": "JM Financial Reports Q4 FY23 Results",
            "Summary": "JM Financial announced its Q4 FY23 consolidated financial results. The company reported a net profit of 2.1 billion rupees, compared to a loss of 2.29 billion rupees in the same quarter last year and a profit of 2.09 billion rupees in the previous quarter. Revenue for Q4 stood at 10 billion rupees, down from 12.61 billion rupees year-over-year. The company has recommended a dividend of 2.7 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747095765000,
            "Source": "default"
        },
        {
            "Title": "JM Financial: Q4 Profit Soars, Dividend Announced, Strategic Shifts Underway",
            "Summary": "JM Financial's Q4 consolidated net profit surged to ₹134.6 crore. The company announced a ₹2.7 per share dividend, increased stake in its distressed credit unit, and is scaling down its wholesale loan book. Asset and wealth management segments showed strong growth. The company received a ₹230 crore tax refund order for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1747064318000,
            "Source": "earnings"
        },
        {
            "Title": "JM Financial Reports Q4 Results and Dividend Recommendation",
            "Summary": "JM Financial has announced its Q4 consolidated net profit of 2.1 billion rupees, compared to a loss of 2.29 billion rupees year-over-year and a profit of 2.09 billion rupees quarter-over-quarter. The company's Q4 revenue stood at 10 billion rupees, down from 12.61 billion rupees in the same quarter last year. Additionally, JM Financial has recommended a dividend of 2.7 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747061575000,
            "Source": "result"
        },
        {
            "Title": "JM Financial to Acquire Remaining Stake in JM Financial Credit Solutions",
            "Summary": "JM Financial has entered into a Share Purchase Agreement (SPA) with INH Mauritius 1 to acquire the remaining 5.97% stake in JM Financial Credit Solutions. The acquisition is valued at 178.05 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1742526592000,
            "Source": "corporate_action"
        },
        {
            "Title": "JM Financial Ltd: Wealth Management Business Transfer to Subsidiary",
            "Summary": "JM Financial will transfer its private wealth management business to wholly-owned subsidiary JM Financial Services for ₹11 crore, effective April 1. The move aims to consolidate wealth management services under a unified structure. The transaction is expected to be finalized by May 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1742222963000,
            "Source": "corporate_action"
        },
        {
            "Title": "JM Financial Approves Business Transfer Agreement with JM Financial Services",
            "Summary": "JM Financial has approved a business transfer agreement with JM Financial Services for the transfer of its private wealth business. The sale consideration is set at 110.8 million rupees, with the business transfer scheduled to take effect from April 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1742210786000,
            "Source": "corporate_action"
        },
        {
            "Title": "JM Financial Receives 2.30 Billion Rupee Tax Refund Order",
            "Summary": "JM Financial has received an order from the Tax Department for a refund of 2.30 billion rupees (approximately $27.8 million USD). This represents a significant financial development for the company, potentially improving its cash position and financial statements.",
            "Sentiment": "positive",
            "PublishDate": 1740096620000,
            "Source": "corporate_action"
        },
        {
            "Title": "JM Financial Receives Tax Refund Order of 2.30 Billion Rupees",
            "Summary": "JM Financial has been issued an order by the tax department for a refund amounting to 2.30 billion rupees (approximately $27.8 million USD). This represents a significant financial development for the company.",
            "Sentiment": "positive",
            "PublishDate": 1740050607000,
            "Source": "corporate_action"
        },
        {
            "Title": "JM Financial Ltd: Stock Down 40% from Highs, Potential Technical Bounce Expected",
            "Summary": "JM Financial Ltd's stock has fallen nearly 40% from its recent highs but has found support above the 200-EMA on weekly charts. Experts suggest high-risk traders might consider buying for a potential bounce towards 150 levels in the next 6-8 months.",
            "Sentiment": "neutral",
            "PublishDate": 1739421000000,
            "Source": "normal_news"
        },
        {
            "Title": "JM Financial: Q3 Profit Falls 22% Amid Loan Book Reduction",
            "Summary": "JM Financial reported a 21.5% YoY decline in Q3 net profit to ₹70.5 crore. Revenue from operations decreased 3.8% to ₹209.2 crore. The company's loan book reduced to ₹4,207 crore from ₹7,529 crore in March 2024. Provision coverage ratio for wholesale real estate loans increased to 93%. Integrated Investment Banking division closed 42 deals raising ₹88,996 crore in CY24. Private Wealth AUM grew 18% YoY to ₹77,024 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1738171998000,
            "Source": "earnings"
        },
        {
            "Title": "JM Financial Reports Q3 FY24 Financial Results",
            "Summary": "JM Financial has announced its consolidated financial results for the third quarter of the fiscal year. The company reported a net profit of 2.1 billion rupees, which is lower compared to 2.78 billion rupees in the same quarter last year (YoY) and 2.3 billion rupees in the previous quarter (QoQ). Revenue for Q3 stood at 11.06 billion rupees, down from 12.36 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1738109800000,
            "Source": "earnings"
        },
        {
            "Title": "JM Financial Reports Decline in Q3 FY24 Financial Performance",
            "Summary": "JM Financial has announced its Q3 financial results, showing a decrease in both net profit and revenue compared to the previous year. The consolidated net profit for Q3 stood at 2.1 billion rupees, down from 2.78 billion rupees year-over-year. Revenue also declined to 11.06 billion rupees from 12.36 billion rupees in the same period last year. However, there was a slight improvement in net profit compared to the previous quarter, which was 2.3 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1738075959000,
            "Source": "earnings"
        },
        {
            "Title": "JM Financial Home Loans Reports Q3 Interest Earnings Growth",
            "Summary": "JM Financial's subsidiary, JM Financial Home Loans, has reported interest earnings of 734 million rupees for the third quarter, compared to 540 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737364161000,
            "Source": "earnings"
        },
        {
            "Title": "JM Financial Home Loans Reports Q3 Net Profit Increase",
            "Summary": "JM Financial's subsidiary, JM Financial Home Loans, has reported a significant increase in its Q3 net profit. The company's net profit for the quarter stood at 150 million rupees, compared to 87 million rupees in the same period last year, marking a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1737364038000,
            "Source": "earnings"
        },
        {
            "Title": "JM Financial: Ankur Jhaveri Appointed as MD and CEO of Institutional Equities Division",
            "Summary": "JM Financial has appointed Ankur Jhaveri as Managing Director and CEO of its Institutional Equities division. Jhaveri, with nearly two decades of experience, joins from Axis Capital and will focus on strengthening sales, trading, research, and derivatives businesses.",
            "Sentiment": "positive",
            "PublishDate": 1736945537000,
            "Source": "corporate_governance"
        },
        {
            "Title": "JM Financial Receives Administrative Warning from SEBI",
            "Summary": "JM Financial has received an administrative warning from the Securities and Exchange Board of India (SEBI). The warning is related to the Initial Public Offering (IPO) of their client, Western Carrier (India) Limited. No further details about the nature of the warning or the specific issues with the IPO have been provided in the news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1735894413000,
            "Source": "corporate_governance"
        },
        {
            "Title": "JM Financial to Consider Q3 Results on January 28",
            "Summary": "JM Financial has announced that it will consider its third quarter (Q3) financial results on January 28. This indicates the company is preparing to release its earnings report for the quarter ending December 31, 2023.",
            "Sentiment": "neutral",
            "PublishDate": 1735312352000,
            "Source": "corporate_action"
        },
        {
            "Title": "JM Financial Reports Decline in Q2 Consolidated Profit",
            "Summary": "JM Financial, a financial services company, has reported a consolidated profit after tax (PAT) of 1.43 billion rupees for the second quarter, down from 2.05 billion rupees in the same period last year. This represents a year-over-year decrease in profit.",
            "Sentiment": "negative",
            "PublishDate": 1729844783000,
            "Source": "result"
        },
        {
            "Title": "JM Financial Reports Q2 Revenue of 11.9 Billion Rupees",
            "Summary": "JM Financial, an Indian financial services company, has reported its second quarter revenue for the current fiscal year. The company's revenue stood at 11.9 billion rupees, compared to 11.97 billion rupees in the same quarter of the previous year, indicating a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1729844710000,
            "Source": "result"
        },
        {
            "Title": "JM Financial Reports 19% Increase in Q2 Net Profit",
            "Summary": "JM Financial, an Indian financial services company, has reported a consolidated net profit of 2.32 billion rupees for the second quarter, up from 1.95 billion rupees in the same period last year. This represents a year-over-year increase of approximately 19%.",
            "Sentiment": "positive",
            "PublishDate": 1729844688000,
            "Source": "result"
        }
    ]
}