{
    "Symbol": "JNKINDIA",
    "ISIN": "INE0OAF01028",
    "News": [
        {
            "Title": "JNK India shareholders approve related party deals",
            "Summary": "JNK India Limited shareholders approved two material related party transaction resolutions through postal ballot with 67.62% votes in favour for both proposals involving subsidiary operations.",
            "Sentiment": "positive",
            "PublishDate": 1770729194135,
            "Source": "co_actions_results"
        },
        {
            "Title": "JNK India Board Meet Set for Feb 9 to Review Q3 Results",
            "Summary": "JNK India Limited has scheduled its board meeting for February 9, 2026, to approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770230895156,
            "Source": "co_actions_results"
        },
        {
            "Title": "JNK India Seeks Shareholder Approval for ₹192.30 Cr RPTs",
            "Summary": "JNK India Limited announces postal ballot for material related party transactions worth ₹192.30 crores with subsidiary JNK Chemdist Technologies and related entities. E-voting period: January 9-February 7, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767869664285,
            "Source": "co_actions_results"
        },
        {
            "Title": "JNK India CFO Pravin Sathe Resigns Effective Dec 16",
            "Summary": "JNK India announces CFO Pravin Sathe's resignation effective December 16, 2025, as he steps down to pursue other professional opportunities in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765864266247,
            "Source": "stocks"
        },
        {
            "Title": "JNK India Reports 71.6% Revenue Growth in Q2 FY26, Secures Ultra-Mega Order Worth Rs. 1,050 Crores",
            "Summary": "JNK India achieved total revenue of Rs. 1,842.1 million in Q2 FY26 with 71.6% year-on-year growth, driven by strong performance in heating equipment segment which contributed 80.3% of revenues. The company secured an ultra-mega cracking furnace order worth Rs. 1,050 crores from JNK Global Company Limited for a petrochemical project, expanding its order book to Rs. 18,499 million and providing strong revenue visibility for future quarters.",
            "Sentiment": "positive",
            "PublishDate": 1763633206887,
            "Source": "earnings"
        },
        {
            "Title": "JNK India Limited Reports IPO Proceeds Monitoring for Quarter Ended September 30, 2025",
            "Summary": "JNK India Limited submitted its monitoring agency report through CRISIL Ratings showing utilization of Rs 262.44 million from IPO proceeds during the quarter ended September 30, 2025, primarily for working capital requirements with Rs 260.67 million earmarked against bank guarantees. The company's net IPO proceeds were revised upward from Rs 2,797.39 million to Rs 2,821.84 million due to lower actual issue expenses, with no deviations reported from stated objectives.",
            "Sentiment": "positive",
            "PublishDate": 1763126023807,
            "Source": "earnings"
        },
        {
            "Title": "JNK India Limited Schedules Q2 and H1 FY26 Earnings Conference Call",
            "Summary": "JNK India Limited, a combustion equipment manufacturer, has scheduled an earnings conference call for November 14, 2025, at 3:00 PM IST to discuss Q2 and H1 FY26 results. The management team will be represented by Chairperson and Whole-Time Director Arvind Kamath, Chief Financial Officer Pravin Sathe, and Senior Manager of Investor Relations Annie Varghese. The company has provided dial-in numbers for various regions including India, Hong Kong, Singapore, USA, and UK for participants to join the virtual conference call.",
            "Sentiment": "neutral",
            "PublishDate": 1762817560265,
            "Source": "earnings"
        },
        {
            "Title": "JNK India Secures Order Worth Over ₹1,000 Crores",
            "Summary": "JNK India has secured a significant order exceeding ₹1,000 crores. The company currently has a market capitalization of ₹1,700 crores.",
            "Sentiment": "positive",
            "PublishDate": 1759739283110,
            "Source": "order&deals"
        },
        {
            "Title": "JNK India Limited Announces Book Closure for Final Dividend Payment",
            "Summary": "JNK India Limited has announced a book closure period from September 19, 2025 to September 25, 2025, with a record date of September 18, 2025, for the payment of final dividend for the financial year 2024-25. The dividend payment is subject to member approval. The company's equity shares are listed on BSE with scrip code 544167 and on NSE with symbol JNKINDIA.",
            "Sentiment": "positive",
            "PublishDate": 1756982788685,
            "Source": "corporate_action"
        },
        {
            "Title": "JNK India Limited Incorporates Joint Venture Company JNK Chemdist Technologies",
            "Summary": "JNK India Limited has successfully incorporated a joint venture company named JNK Chemdist Technologies Private Limited on August 20, 2025. The joint venture company received its Certificate of Incorporation from the Registrar of Companies on August 23, 2025. This development follows an earlier intimation by JNK India dated July 31, 2025, which contained detailed disclosures regarding the joint venture formation.",
            "Sentiment": "positive",
            "PublishDate": 1756129565018,
            "Source": "corporate_action"
        },
        {
            "Title": "JNK India Secures Order from Promoter JNK Global for Refinery Cracker Furnace Project",
            "Summary": "JNK India has secured an order from its promoter JNK Global for design and engineering support services on a refinery cracker furnace project in India. The project is scheduled for completion by December 2027.",
            "Sentiment": "positive",
            "PublishDate": 1755868980649,
            "Source": "order&deals"
        },
        {
            "Title": "JNK India Reports 13.5% Revenue Growth But Faces Margin Pressure from Legacy Projects",
            "Summary": "JNK India Limited reported revenue of INR 1,030 million for Q1 FY2026, representing a 13.5% year-on-year increase. However, EBITDA margin compressed significantly to 7% from 13.4% in the previous year quarter, primarily due to legacy projects impacting profitability. The company maintains an order book of INR 9,828 million extending through Q1 FY2027, with 79.4% from heating systems and 90.9% from domestic orders. JNK India entered a joint venture for green hydrogen and sustainable fuels, holding a 51% stake with expected revenue contribution of 8-10% in FY2026. Management expects two large order finalizations worth INR 2,000-3,000 crores in Q2 FY2026 and anticipates margin recovery from Q3 onwards. The company transitioned to a cost-based revenue recognition method and maintains guidance of 40-50% revenue growth for FY2026 with target EBITDA margins of 13-15% once legacy projects complete.",
            "Sentiment": "neutral",
            "PublishDate": 1755516178888,
            "Source": "earnings"
        },
        {
            "Title": "JNK India Limited Utilizes Rs 2,530 Crores of IPO Proceeds for Working Capital Requirements",
            "Summary": "JNK India Limited has submitted a monitoring agency report detailing the utilization of proceeds from its IPO completed in April 2024. The company raised Rs 2,821.84 crores through fresh issuance and has utilized Rs 2,530.11 crores, leaving Rs 291.73 crores unutilized. The majority of funds (Rs 2,360.11 crores) were deployed for working capital requirements, while Rs 170 crores were used for general corporate purposes. The working capital funding supports the company's need to maintain bank balances for issuing bank guarantees, with sanctioned fund-based facilities of Rs 450 crores and non-fund based limits of Rs 1,124.50 crores. Unutilized funds are deployed in fixed deposits across SBI, HDFC Bank, and ICICI Bank, earning returns between 4.25% to 6.95%. The company has generated Rs 1.21 crores in earnings on unutilized funds.",
            "Sentiment": "neutral",
            "PublishDate": 1755066843172,
            "Source": "stock"
        },
        {
            "Title": "JNK India Limited Uploads Q1FY26 Earnings Call Audio Recording to Company Website",
            "Summary": "JNK India Limited has uploaded the audio recording of their Q1FY26 earnings call to their company website. The earnings call was held on August 11, 2025, at 11:00 AM. The company filed this information with BSE Limited and National Stock Exchange of India Limited under scrip code 544167 and security symbol JNKINDIA. The filing was made in compliance with SEBI regulations 30 and 46(2)(oa) of the Listing Obligations and Disclosure Requirements Regulations, 2015. The audio recording is available on the company's website at https://www.jnkindia.com/. The filing was digitally signed by Ashish Soni, Company Secretary and Compliance Officer, on August 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754922310535,
            "Source": "earnings"
        },
        {
            "Title": "JNK India Reports ₹9,828 Crore Order Book, Plans Multi-Year Growth Strategy",
            "Summary": "JNK India has an order book worth ₹9,828 crore and is planning multi-year growth. The company aims to excel in fired heaters and hydrogen infrastructure segments while focusing on execution and custom exports.",
            "Sentiment": "positive",
            "PublishDate": 1754579921308,
            "Source": "stock"
        },
        {
            "Title": "JNK India Limited Reports Quarterly Financial Results for Quarter Ended June 30, 2025",
            "Summary": "JNK India Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 189.02 million compared to Rs 190.94 million in the previous quarter. The company posted a profit of Rs 11.69 million for the quarter versus Rs 15.86 million in the same period last year. On a consolidated basis, revenue from operations was Rs 991.68 million compared to Rs 190.94 million in the previous quarter, with consolidated profit of Rs 11.27 million. The company's main activity involves designing, engineering, procurement, manufacture, fabrication, erection and commissioning of fired heaters and related combustible engineering products. JNK India completed its IPO of 1,56,49,967 equity shares at Rs 415 per share, with listing on NSE and BSE on April 30, 2024. The utilization of IPO proceeds shows Rs 253.01 million used for working capital requirements and Rs 170.00 million for general corporate purposes as of June 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754577785955,
            "Source": "earnings"
        },
        {
            "Title": "JNK India Reports 41% Jump in Q1 EBITDA to 134 Million Rupees",
            "Summary": "JNK India's Q1 EBITDA increased to 134 million rupees compared to 95 million rupees in the same period last year. The company's EBITDA margin also improved to 13.55% from 10.81% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754576685231,
            "Source": "earnings"
        },
        {
            "Title": "JNK India Reports 82% Drop in Net Profit Despite Revenue Growth",
            "Summary": "JNK India reported net profit of 11.7 million rupees in Q1, down from 65 million rupees in the same period last year, representing an 82% decline. However, the company's revenue increased to 989 million rupees from 879 million rupees year-over-year, showing 12.5% growth.",
            "Sentiment": "negative",
            "PublishDate": 1754575177121,
            "Source": "earnings"
        },
        {
            "Title": "JNK India Limited Forms Joint Venture for Green Hydrogen Technologies with 51% Stake",
            "Summary": "JNK India Limited entered into a joint venture agreement with Mr. Tushar Wagh, Dr. Sunil Dhole and other investors on July 31, 2025. The company will hold 51% equity stake in the new joint venture company, tentatively named JNK Chemdist Technologies Private Limited. JNK India will invest Rs. 5.10 million for the equity stake and an additional Rs. 100 million through preference shares. The joint venture will focus on research, development, marketing, engineering, manufacturing and supply of green hydrogen technologies and other technologies. The JV company will acquire select green hydrogen technologies from the Chemdist group. JNK India will nominate three out of five directors on the joint venture's board, while Mr. Tushar Wagh and Dr. Sunil Dhole will serve as Executive Directors. Dr. Sunil Dhole holds M.Tech and PhD from IIT Kanpur and was nominated for the Padma Shri Award 2023. Mr. Tushar Wagh has expertise in engineering and project management with specialization in industrial separation technologies and green hydrogen. The transaction does not fall under related party transactions and requires no government approvals. The joint venture is expected to be completed within 30-60 days.",
            "Sentiment": "positive",
            "PublishDate": 1753969568244,
            "Source": "order&deals"
        },
        {
            "Title": "JNK India Projects Strong Growth and Margin Improvement for FY26",
            "Summary": "JNK India has announced ambitious projections for FY26. The company expects a 40-50% growth in revenue, with its current revenue standing at 4.7 billion rupees. They anticipate order wins of approximately 1200 crore rupees in FY26. Additionally, JNK India is targeting a margin improvement of 100-200 basis points for the same fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1748852413000,
            "Source": "default"
        },
        {
            "Title": "JNK India Reports Q4 Financial Results",
            "Summary": "JNK India has released its Q4 financial results. The company's EBITDA for Q4 was 186 million rupees, down from 352 million rupees year-over-year. The EBITDA margin decreased to 9.74% from 15.51% in the same period last year. Consolidated net profit for Q4 was 132 million rupees, compared to 166 million rupees in the previous year. Revenue for Q4 stood at 1.91 billion rupees, down from 2.27 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748571267000,
            "Source": "result"
        },
        {
            "Title": "JNK India: Optimistic Outlook for FY26 Despite Recent Challenges",
            "Summary": "JNK India expects good order inflows in FY26 despite execution challenges in the previous fiscal. The company's order book stands at over Rs 1,200 crore, with a strong bidding pipeline of Rs 4,000 crore. JNK is expanding into new product areas and geographies, including the USA and Malaysia.",
            "Sentiment": "positive",
            "PublishDate": 1745283693000,
            "Source": "normal_news"
        },
        {
            "Title": "Suntech Files Arbitration Petition Against Jnk India",
            "Summary": "Suntech has filed an arbitration petition against Jnk India. In response, Jnk India has stated that Suntech's claims are frivolous and unfounded. This suggests a legal dispute between the two companies, with Jnk India strongly contesting the validity of Suntech's claims.",
            "Sentiment": "negative",
            "PublishDate": 1739146257000,
            "Source": "corporate_governance"
        },
        {
            "Title": "JNK India: Confident in Maintaining 18% Ebitda Margin with Strong Order Book",
            "Summary": "JNK India's Chairperson Arvind Kamath expects to maintain 16-18% Ebitda margins annually. The company has a current order book of Rs 1,311 crore and is eyeing a Rs 4,000 crore order pipeline. JNK India aims for growth to over Rs 1200-1300 crore in the next three years.",
            "Sentiment": "positive",
            "PublishDate": 1734502294000,
            "Source": "earnings"
        },
        {
            "Title": "JNK India Reports Q2 Revenue Growth",
            "Summary": "JNK India has announced its Q2 revenue of 1.02 billion rupees, showing an increase from 969 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731565998000,
            "Source": "result"
        },
        {
            "Title": "JNK India Reports Decline in Q2 EBITDA and Margin",
            "Summary": "JNK India's Q2 EBITDA decreased to 116 million rupees from 214 million rupees year-over-year. The company's EBITDA margin also fell to 11.33% from 22.08% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731565944000,
            "Source": "result"
        },
        {
            "Title": "JNK India Reports Q2 Net Profit Decline",
            "Summary": "JNK India has reported a net profit of 75 million rupees for the second quarter, down from 125 million rupees in the same period last year. This represents a year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1731565919000,
            "Source": "result"
        },
        {
            "Title": "JNK India: Strong Q1 Performance Boosts Ebitda Outlook",
            "Summary": "<p>JNK India reports <span class='positive'>139.62% revenue jump</span> in Q1 FY2025. CFO expects to <span class='positive'>exceed 18% Ebitda guidance</span>. <b>Order book grows to Rs 1,450 crore</b>.<br/> Company <span class='positive'>diversifying</span> into <span class='neutral'>waste gas handling</span> and <span class='positive'>renewable energy</span> sectors.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728197727000,
            "Source": "result"
        },
        {
            "Title": "JNK India: Rs 4000 Crore Bid Pipeline Opportunity Ahead",
            "Summary": "<p>JNK India is eyeing a <span class=\"positive\">bid pipeline opportunity</span> worth <span class=\"positive\">Rs 4000 crore</span>, indicating <span class=\"positive\">potential business growth</span> and <span class=\"positive\">expansion prospects</span> for the company.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728046575000,
            "Source": "normal_news"
        }
    ]
}