{
    "Symbol": "JPASSOCIAT",
    "ISIN": "INE455F01025",
    "News": [
        {
            "Title": "Jaiprakash Associates Reports ₹55,357.39 Cr Debt",
            "Summary": "Jaiprakash Associates Limited disclosed total outstanding borrowings of ₹55,357.39 crores as on January 14, 2026, while operating under corporate insolvency resolution process since June 2024.",
            "Sentiment": "negative",
            "PublishDate": 1770297428545,
            "Source": "stocks"
        },
        {
            "Title": "Jaiprakash Associates Executive Director Gets Interim Bail",
            "Summary": "Manoj Gaur, Executive Director of Jaiprakash Associates, has been granted 14-day interim bail by Delhi court in ED's money laundering investigation case.",
            "Sentiment": "neutral",
            "PublishDate": 1769356455456,
            "Source": "stocks"
        },
        {
            "Title": "Jaiprakash Associates Discloses INR 55,371.21 Crores Outstanding Debt Under Insolvency Process",
            "Summary": "Jaiprakash Associates Limited disclosed total outstanding borrowings of INR 55,371.21 crores from multiple banks and financial institutions including NARCL, Axis Bank, SBI, and others for November 2025. The company is currently under Corporate Insolvency Resolution Process since June 2024 with Mr. Bhuvan Madan appointed as Resolution Professional, while lenders are filing and verifying their claims.",
            "Sentiment": "negative",
            "PublishDate": 1764848428073,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jaiprakash Associates' Committee of Creditors Approves Adani Enterprise's Resolution Plan with 93.81% Voting",
            "Summary": "The Committee of Creditors of Jaiprakash Associates Limited, currently under Corporate Insolvency Resolution Process, approved Adani Enterprise Limited's resolution plan dated June 24, 2025 with 93.81% votes, exceeding the required 66% threshold. The Resolution Professional has been authorized to issue a letter of intent to Adani Enterprise as the successful resolution applicant and file an application with the Adjudicating Authority for approval of the resolution plan.",
            "Sentiment": "positive",
            "PublishDate": 1763553468499,
            "Source": "corporate_action"
        },
        {
            "Title": "Five Resolution Plans Under Voting for Debt-Laden Jaiprakash Associates",
            "Summary": "Voting is underway on five resolution plans for Jaiprakash Associates, with proposals from Vedanta Group, Adani Group, Dalmia Bharat Group, Jindal Power, and PNC Infratech being evaluated by the Committee of Creditors led by NARCL. The voting window remains open until November 20. Vedanta Group submitted the highest absolute offer at ₹16,000 crore (₹3,770 crore upfront, ₹13,000 crore over five years), while Adani Group proposed ₹13,500 crore (₹6,005 crore upfront, ₹6,726 crore after two years). In net present value terms, Vedanta's proposal stands at ₹12,505 crore versus Adani's ₹12,050 crore. Other bids include Dalmia Bharat at ₹11,600 crore, PNC Infratech at ₹11,500 crore, and Jindal Power at ₹6,700 crore. Jaiprakash Associates faces admitted claims of ₹57,185 crore from creditors and owns assets including cement facilities, real estate developments, and infrastructure projects.",
            "Sentiment": "neutral",
            "PublishDate": 1762869652974,
            "Source": "order&deals"
        },
        {
            "Title": "Jaiprakash Associates to Release Quarterly Results on November 14, Trading Window Closed",
            "Summary": "Jaiprakash Associates Limited will consider and disseminate its un-audited standalone and consolidated financial results for the quarter and half year ended September 30, 2025 on November 14, 2025. The company is currently under Corporate Insolvency Resolution Process with a Resolution Professional performing functions under the Insolvency and Bankruptcy Code. The trading window has been closed from October 1, 2025 and will remain closed until November 16, 2025 evening, reopening on November 17, 2025 at 9:00 AM. During this period, employees, directors, key managerial personnel, designated persons and their immediate relatives cannot trade in company shares or securities.",
            "Sentiment": "neutral",
            "PublishDate": 1762830398240,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Enterprises Emerges as Top Bidder for Jaiprakash Associates Acquisition",
            "Summary": "Adani Enterprises is likely to become the highest bidder to acquire Jaiprakash Associates (JAL) through insolvency proceedings. The committee of creditors scored Adani's resolution plan highest, followed by Dalmia Cement and Vedanta. Adani's advantage stems from offering payment to lenders within two years, compared to Vedanta's five-year payment schedule. In September, Vedanta had initially emerged as the highest bidder with Rs 12,505 crore net present value. JAL entered insolvency proceedings in June 2024 after defaulting on loans, with financial creditors claiming around Rs 60,000 crore. The company operates across real estate, cement, power, hotels, and road sectors, with major projects including Jaypee Greens in Greater Noida and cement plants in Madhya Pradesh and Uttar Pradesh. The resolution plan is expected to be voted on by creditors within two weeks.",
            "Sentiment": "neutral",
            "PublishDate": 1762750794226,
            "Source": "order&deals"
        },
        {
            "Title": "Jaiprakash Associates' Committee of Creditors Approves Four Key Resolutions in Insolvency Process",
            "Summary": "The twenty-first meeting of the Committee of Creditors for Jaiprakash Associates Limited was held on October 6, 2025, as part of the ongoing Corporate Insolvency Resolution Process. E-voting on resolutions took place from October 11-14, 2025, with all four items receiving approval. The resolutions included: inclusion of verified creditor claims (approved by 89.07%), approval of fees for Grant Thornton Bharat LLP as consultant for liquidation value determination (approved by 85.46%), ratification of a 10-day extension for resolution applicants to submit revised draft resolution plans until September 25, 2025 (approved by 89.07%), and ratification of the extended interval between the 20th and 21st CoC meetings (approved by 89.07%). All resolutions surpassed the required 51% voting threshold.",
            "Sentiment": "neutral",
            "PublishDate": 1760530012328,
            "Source": "corporate_action"
        },
        {
            "Title": "CCI Approves Vedanta's Acquisition of Jaiprakash Associates",
            "Summary": "The Competition Commission of India has approved Vedanta's acquisition of Jaiprakash Associates. The regulatory clearance allows the transaction to proceed.",
            "Sentiment": "positive",
            "PublishDate": 1760445469888,
            "Source": "order&deals"
        },
        {
            "Title": "Jaiprakash Associates Creditors Approve Claims List with 89% Votes During Insolvency Process",
            "Summary": "The twentieth meeting of the Committee of Creditors for Jaiprakash Associates Limited, currently undergoing Corporate Insolvency Resolution Process, was held. E-voting results for approving the list of claims were announced, with 89.07% votes in favor, surpassing the required 51%. The creditors also ratified email communications sent to resolution applicants with 89.48% approval. However, they rejected a proposal for IP insurance policy costs with only 3.61% support. The e-voting process took place from September 11-15, 2025, following the committee meeting held on September 5, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758111466436,
            "Source": "corporate_action"
        },
        {
            "Title": "Jaiprakash Associates' Committee of Creditors Approves Budget and Consultant Fees with 88.70% Votes",
            "Summary": "Jaiprakash Associates Limited, undergoing Corporate Insolvency Resolution Process, held its 18th Committee of Creditors meeting. The e-voting process ran from August 7-11, 2025, with four key resolutions approved. The Committee approved budgeted cash outflows for July-September 2025 to maintain business operations as a going concern, which will be part of insolvency resolution process costs. Additionally, fees for tax consultant M/s Dass Gupta & Associates and facility management consultant Mr. Ashish Narula for Jaypee Greens and Wishtown projects were approved. The Committee also ratified a 10-day extension for site visits starting August 1, 2025. All items received 88.70% approval votes, except the site visit extension which received 92.31%, all exceeding the required 51% threshold.",
            "Sentiment": "neutral",
            "PublishDate": 1755002538957,
            "Source": "corporate_action"
        },
        {
            "Title": "Jaiprakash Associates' Creditors Approve 21 Related Party Transactions During Insolvency Process",
            "Summary": "The Committee of Creditors of Jaiprakash Associates Limited approved 21 related party transactions through e-voting in their seventeenth meeting. The approved transactions include project management consultancy services for hydropower projects in Bhutan to Jaypee Infra Ventures Private Limited, helicopter charter services for rescue operations to Himalyaputra Aviation Limited, IT support services to JIL Information Technology Limited, and various inter-company advances to subsidiaries for statutory compliance expenses. The creditors also approved the re-appointment of three directors with suspended powers - Mr. Manoj Gaur at INR 2.14 crores annual remuneration, Mr. Pankaj Gaur at INR 1.46 crores, and Mr. Naveen Kumar Singh at INR 1.28 crores. All resolutions received voting percentages above the required 66% threshold, with approvals ranging from 85.88% to 87.47%. The transactions will be part of the insolvency resolution process cost and include annual escalations of 5-10% where applicable.",
            "Sentiment": "neutral",
            "PublishDate": 1753158173330,
            "Source": "corporate_action"
        },
        {
            "Title": "Jaiprakash Associates: Adani Group Submits Unconditional ₹12,600 Crore Bid",
            "Summary": "Adani Group has submitted an unconditional ₹12,600 crore bid for Jaiprakash Associates in the ongoing insolvency process. Four other bidders, including Dalmia Bharat with the highest bid of ₹14,600 crore, have tied their offers to the resolution of a land dispute. The Committee of Creditors has asked all bidders to revise and improve their financial offers.",
            "Sentiment": "neutral",
            "PublishDate": 1751914981000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jaiprakash Associates: Resolution Plan Deadline Extended to June 24, 2025",
            "Summary": "Jaiprakash Associates Ltd (JAL) has extended the deadline for submission of resolution plans under its ongoing corporate insolvency process from June 9 to June 24, 2025. The extension was approved by the Committee of Creditors following requests from prospective resolution applicants. JAL's total outstanding loans stand at ₹55,493.43 crore as of February 20, 2025. A consortium of lenders has transferred their outstanding loans to National Asset Reconstruction Company Ltd (NARCL).",
            "Sentiment": "neutral",
            "PublishDate": 1749469860000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jaiprakash Associates: Lenders Approve ₹936 Crore Cash Outflow Amid ED Searches",
            "Summary": "Jaiprakash Associates' lenders approved a ₹936.27 crore cash outflow for Q2 2025 to maintain operations. The Enforcement Directorate initiated searches on May 23, 2025, with the company cooperating fully.",
            "Sentiment": "neutral",
            "PublishDate": 1748177122000,
            "Source": "corporate_governance"
        },
        {
            "Title": "NHAI Seeks Conciliation with Jaiprakash Associates Over ₹1,461 Crore Claims",
            "Summary": "The National Highways Authority of India (NHAI) is planning to initiate a conciliation process with Jaiprakash Associates regarding claims amounting to ₹1,461 crore. This move suggests an attempt to resolve financial disputes between the two entities through negotiation rather than litigation.",
            "Sentiment": "neutral",
            "PublishDate": 1746462392000,
            "Source": "default"
        },
        {
            "Title": "Jaiprakash Associates Assigns Outstanding Debt to NARCL",
            "Summary": "Jaiprakash Associates has assigned its outstanding debt to the National Asset Reconstruction Company Limited (NARCL). This move suggests the company is taking steps to manage its financial liabilities, potentially through a debt restructuring process.",
            "Sentiment": "neutral",
            "PublishDate": 1741824314000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jaiprakash Associates Assigns Outstanding Debt to National Asset Reconstruction Company",
            "Summary": "Jaiprakash Associates has assigned its outstanding debt to the National Asset Reconstruction Company (NARCL). This move suggests the company is taking steps to manage its financial obligations, potentially through a debt restructuring or resolution process.",
            "Sentiment": "neutral",
            "PublishDate": 1741786855000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jaiprakash Associates: NCLT Mandates Single Resolution Plan",
            "Summary": "NCLT Allahabad Bench ruled that Jaiprakash Associates' insolvency resolution must proceed under a single plan for the entire company, rejecting the previous dual-option approach. The resolution professional has set April 5 for issuing the final list of prospective resolution applicants and June 9 as the deadline for submitting firm resolution plans.",
            "Sentiment": "neutral",
            "PublishDate": 1741585691000,
            "Source": "order&deals"
        },
        {
            "Title": "Jaiprakash Associates: Q3 Loss Widens 61% YoY, Revenue Declines",
            "Summary": "Jaiprakash Associates reported Q3 FY25 results with a loss of ₹764.11 crore, up 61.26% YoY. Revenue decreased 9.96% to ₹1491.07 crore. Operating income fell 71.62% YoY. EPS declined to ₹-2.54. Selling, general & administrative expenses increased 3.46% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1739653132000,
            "Source": "earnings"
        },
        {
            "Title": "Jaiprakash Associates Reports Significant Drop in Q3 EBITDA",
            "Summary": "Jaiprakash Associates has reported a substantial decline in its Q3 EBITDA, which fell to 75 million rupees from 969 million rupees in the same quarter last year. The company's EBITDA margin also decreased significantly, dropping to 0.50% from 6.45% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739545022000,
            "Source": "earnings"
        },
        {
            "Title": "Jaiprakash Associates Reports Increased Q3 Net Loss",
            "Summary": "Jaiprakash Associates has reported a consolidated net loss of 7.7 billion rupees for the third quarter, compared to a loss of 4.76 billion rupees in the same period last year. The company's revenue slightly decreased to 14.9 billion rupees from 15.02 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739544959000,
            "Source": "earnings"
        },
        {
            "Title": "Jaiprakash Associates: NCLAT Upholds Insolvency Process",
            "Summary": "The National Company Law Appellate Tribunal (NCLAT) has upheld the insolvency resolution process for Jaiprakash Associates Ltd., rejecting the company's challenge to the NCLT's admission order. ICICI Bank had initiated the insolvency proceedings for a default of Rs 1,269 crore.",
            "Sentiment": "negative",
            "PublishDate": 1733483797000,
            "Source": "order&deals"
        },
        {
            "Title": "Jaiprakash Associates: ₹16,000 Crore Settlement Offer to Avoid Bankruptcy",
            "Summary": "Jaiprakash Associates (JAL) has made a ₹16,000 crore settlement offer to lenders to avoid bankruptcy. The offer includes an initial ₹4,000 crore payment after nine months, with the remaining ₹12,000 crore to be paid after three years. Banks are also considering a ₹12,000 crore offer from NARCL. JAL's insolvency appeal is currently with NCLAT. The company has ₹57,190 crore in admitted claims, making it the second-largest unresolved insolvency case.",
            "Sentiment": "neutral",
            "PublishDate": 1733253336000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jaiprakash Associates: Q2 Losses Widen, Revenue Plummets",
            "Summary": "Jaiprakash Associates reported Q2 FY2024 results with losses increasing by 19.14% YoY to ₹293 crore. Revenue fell 27.53% YoY to ₹1373.67 crore. Operating income declined 1891.82% YoY. EPS decreased to ₹-0.87. The company's stock has seen significant declines, with a -66.67% year-to-date return.",
            "Sentiment": "negative",
            "PublishDate": 1731737124000,
            "Source": "result"
        }
    ]
}