{
    "Symbol": "JPOLYINVST",
    "ISIN": "INE147P01019",
    "News": [
        {
            "Title": "Jindal Poly Investment Board Meet on Feb 13, 2026",
            "Summary": "Jindal Poly Investment and Finance Company Limited has scheduled a board meeting on February 13, 2026, to consider Q3FY26 financial results. Trading window remains closed until 48 hours post-declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1770787786055,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jindal Poly Investment Completes Demerger Scheme",
            "Summary": "Jindal Poly Investment and Finance Company Limited receives shares in demerger scheme involving Jindal India Powertech Limited and Jindal India Power Limited, with preference shares cancelled and new equity shares allotted.",
            "Sentiment": "neutral",
            "PublishDate": 1768462948891,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jindal Poly Investment Reports Strong Q2 Performance with 120% Jump in Standalone Net Profit",
            "Summary": "Jindal Poly Investment and Finance Company Limited reported standalone net profit of Rs 1,484 lakhs for Q2 FY26, up from Rs 673 lakhs in Q2 FY25, driven by gains on fair value changes of Rs 818 lakhs and dividend income of Rs 1,079 lakhs. On consolidated basis, the company posted net profit of Rs 5,754 lakhs for the quarter, significantly boosted by Rs 4,270 lakhs share of profit from associate Jindal India Powertech Limited.",
            "Sentiment": "positive",
            "PublishDate": 1763058397307,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Poly Investment and Finance Appoints Bhuwan Singh Taragi as Company Secretary",
            "Summary": "Jindal Poly Investment and Finance Company Limited appointed Mr. Bhuwan Singh Taragi as Company Secretary and Compliance Officer effective October 16, 2025. The appointment was approved by the Board of Directors on recommendation of the Nomination & Remuneration Committee. Taragi is an Associate Member of the Institute of Company Secretaries of India and brings over 8 years of experience in secretarial practices, listing compliances, and NBFC regulatory matters. He holds a Law degree from Rajasthan University, B.Com from Delhi University, and a Postgraduate degree from IGNOU. The appointment complies with Section 203 of the Companies Act, 2013 and SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1760618608484,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jindal Poly Investment and Finance Company Secretary Swati Tiwari Resigns",
            "Summary": "Jindal Poly Investment and Finance Company Limited announced that Ms. Swati Tiwari has resigned from her position as Company Secretary and Compliance Officer effective September 15, 2025, due to personal reasons. Tiwari, who holds membership number A46625, submitted her resignation letter on September 1, 2025. The company has informed the National Stock Exchange about this change in key managerial personnel as required under listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1757682726672,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jindal Poly Investment Reports 12% Jump in Q1 Net Profit to 628 Million Rupees",
            "Summary": "Jindal Poly Investment and Finance Co reported consolidated net profit of 628 million rupees in Q1, representing a year-over-year increase from 559 million rupees. The company's revenue grew to 84 million rupees compared to 82 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1755098048225,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Poly Investment and Finance Co. Reports Q3 Financial Results",
            "Summary": "Jindal Poly Investment and Finance Co. has announced its Q3 consolidated net profit of 334 million rupees, showing a decrease from 1 billion rupees year-over-year and 1.4 billion rupees quarter-over-quarter. The company's Q3 revenue slightly increased to 78 million rupees from 75 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739281809000,
            "Source": "earnings"
        }
    ]
}