{
    "Symbol": "JPPOWER",
    "ISIN": "INE351F01018",
    "News": [
        {
            "Title": "Jaiprakash Power Q3 Net Profit Drops to ₹38M",
            "Summary": "Jaiprakash Power Ventures reported Q3 net profit of ₹38 million compared to ₹1.25 billion in the previous year, while revenue grew marginally to ₹11.6 billion from ₹11.4 billion year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1770212165177,
            "Source": "co_actions_results"
        },
        {
            "Title": "CRISIL Reaffirms BBB/Stable Rating on Jaiprakash Power Ventures' Rs 5,600 Crore Bank Facilities",
            "Summary": "CRISIL Ratings Limited reaffirmed its CRISIL BBB/Stable rating on Jaiprakash Power Ventures Limited's long-term bank facilities worth Rs 5,600 crore. The rating reaffirmation maintains the company's current credit assessment and provides continued access to banking facilities at existing terms.",
            "Sentiment": "neutral",
            "PublishDate": 1763622743441,
            "Source": "stock"
        },
        {
            "Title": "Jaiprakash Power Ventures Chairman Manoj Gaur Arrested by Enforcement Directorate",
            "Summary": "Shri Manoj Gaur, Non-Executive Chairman of Jaiprakash Power Ventures Limited, was arrested by the Enforcement Directorate under the Prevention of Money Laundering Act, 2002. The alleged offence relates to Jaypee Infratech Limited and Jaiprakash Associates Limited, not the company itself, with management stating no adverse impact on company operations.",
            "Sentiment": "negative",
            "PublishDate": 1763050204705,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jaiprakash Power Ventures Faces Fresh Demand Notice from IDRCL Over Corporate Guarantee Dispute",
            "Summary": "Jaiprakash Power Ventures Limited disclosed that India Debt Resolution Company Limited (IDRCL) has issued a demand notice dated October 24, 2025, seeking payment of outstanding amounts related to a corporate guarantee. The company had previously provided a corporate guarantee for a loan taken by promoter company Jaiprakash Associates Limited. The Debt Resolution Tribunal permitted NARCL to substitute State Bank of India as the lender through an order dated September 24, 2025, following a Joint Assignment Agreement from March 2025 where certain lenders assigned their debts to National Asset Reconstruction Company Limited (NARCL). IDRCL acts as the Power of Attorney holder for NARCL. Jaiprakash Power Ventures maintains that the fresh demand notice lacks substance as the matter remains under judicial consideration and stated it will initiate legal steps to protect its interests. The company's insolvency petition filed by ICICI Bank was admitted by the National Company Law Tribunal in June 2024.",
            "Sentiment": "negative",
            "PublishDate": 1761563451203,
            "Source": "stock"
        },
        {
            "Title": "Jaiprakash Power Ventures Reports 60% Drop in Q2 Net Profit to Rs 182 Crore",
            "Summary": "Jaiprakash Power Ventures Limited reported a net profit of Rs 182 crore for Q2 FY26, down from Rs 272 crore in the previous quarter. Revenue from operations declined to Rs 1,438 crore from Rs 1,583 crore quarter-on-quarter. For the half-year period, net profit reached Rs 460 crore compared to Rs 531 crore in the same period last year. The company's power segment generated Rs 1,438 crore in revenue while coal segment contributed Rs 203 crore. Total comprehensive income for the quarter stood at Rs 182 crore. The company faces ongoing legal challenges including corporate guarantee issues related to Jaiprakash Associates Limited's insolvency proceedings and demand notices from Andhra Pradesh's Director of Mines & Geology totaling Rs 7,167 crore for alleged illegal sand mining activities.",
            "Sentiment": "negative",
            "PublishDate": 1760779536873,
            "Source": "earnings"
        },
        {
            "Title": "Jaiprakash Power Ventures Proposes 50 MW Solar Plant with Rs 300 Crore Investment",
            "Summary": "Jaiprakash Power Ventures Limited's Board of Directors has approved exploring options to set up a 50 MW Solar PV Power Plant at their existing Bina Thermal Power Project site in Madhya Pradesh. The project requires an estimated investment of Rs 300 crores and is subject to necessary approvals including those from lenders. The solar facility would be located at the company's existing 500 MW Jaypee Bina Thermal Power Plant site.",
            "Sentiment": "positive",
            "PublishDate": 1756289093063,
            "Source": "stock"
        },
        {
            "Title": "Jaiprakash Power Ventures Reports 79% Jump in Quarterly Net Profit to Rs 278 Crore",
            "Summary": "Jaiprakash Power Ventures Limited reported a net profit of Rs 278 crore for the quarter ended June 30, 2025, representing a 79% increase from Rs 155 crore in the previous quarter. Revenue from operations rose to Rs 1,583 crore from Rs 1,341 crore in the preceding quarter. The company operates across power generation, coal, and sand mining segments, with power being the primary revenue contributor at Rs 1,583 crore. Total comprehensive income increased to Rs 278 crore from Rs 156 crore quarter-on-quarter. The results were reviewed by the Audit Committee and approved by the Board of Directors. However, auditors issued qualified opinions citing concerns over corporate guarantees provided to Jaiprakash Associates Limited, which is under insolvency proceedings, and disputes with Uttar Pradesh Power Corporation regarding excess payments of Rs 463 crore.",
            "Sentiment": "positive",
            "PublishDate": 1753873553027,
            "Source": "earnings"
        },
        {
            "Title": "Jaiprakash Power Ventures Schedules Board Meeting to Approve Quarterly Financial Results",
            "Summary": "Jaiprakash Power Ventures Limited has scheduled its 152nd Board Meeting for July 30, 2025, to consider and approve unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company has implemented a trading window closure from July 1 to August 1, 2025, during which employees, directors, key managerial personnel, designated persons and their immediate relatives are prohibited from trading in the company's shares or securities.",
            "Sentiment": "neutral",
            "PublishDate": 1753268235343,
            "Source": "corporate_action"
        },
        {
            "Title": "Jaiprakash Power Ventures: Shares Slide Over 5% Amid Volatility",
            "Summary": "Jaiprakash Power Ventures shares fell 5.06% intraday, extending a two-day decline. The stock is under ASM Stage 1 surveillance. Recent rally was driven by Adani Group's reported bid for Jaiprakash Associates, which has a corporate guarantee link to JP Power.",
            "Sentiment": "negative",
            "PublishDate": 1752646935000,
            "Source": "normal_news"
        },
        {
            "Title": "Jaiprakash Power Ventures Ltd: Shares Dip 5% After Recent Rally",
            "Summary": "Jaiprakash Power Ventures Ltd shares fell 4.9% to Rs 25.88, ending a three-day rally that saw 21.7% gains. The decline is attributed to profit booking following optimism around Adani Group's bid for Jaiprakash Associates, which is undergoing insolvency proceedings. Despite the dip, JP Power stock remains up 42.5% in 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1752556240000,
            "Source": "normal_news"
        },
        {
            "Title": "Jaiprakash Power Ventures Ltd: Shares Rally 7% Amid Adani Bid Speculation",
            "Summary": "JP Power shares surged 4.7% on Monday, extending a 7% weekly gain. The stock hit a new 52-week high of Rs 24.86 on Friday. The rally is attributed to reports of Adani Group bidding for Jaiprakash Associates, which has financial ties to JP Power. Six bidders are reportedly interested in acquiring Jaiprakash Associates, currently undergoing insolvency resolution.",
            "Sentiment": "positive",
            "PublishDate": 1752471238000,
            "Source": "normal_news"
        },
        {
            "Title": "Jaiprakash Power Ventures: Stock Surges Amid Adani's Bid for JP Associates",
            "Summary": "Jaiprakash Power Ventures shares hit a 52-week high of Rs 23.85, rallying 27.7% in three days. The surge follows reports of Adani Group bidding to acquire Jaiprakash Associates under insolvency resolution. Analysts advise caution due to approaching resistance levels and potential profit booking.",
            "Sentiment": "positive",
            "PublishDate": 1751969803000,
            "Source": "normal_news"
        },
        {
            "Title": "Jaiprakash Power Ventures Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 22,351,092 shares of Jaiprakash Power Ventures Ltd. occurred on the National Stock Exchange (NSE) for Rs. 50.74 crores. The trade was executed at a price of Rs. 22.70 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1751881171000,
            "Source": "block_details"
        },
        {
            "Title": "Jaiprakash Power Ventures Ltd: Shares Surge 14% Post-AGM",
            "Summary": "JP Power shares closed at Rs 21.57, up 14% after successful 30th AGM on July 5, 2025. Key resolutions were presented and e-voting was enabled. 107 shareholders attended virtually. RSI at 69.5 and stock trading above all key SMAs indicate strong bullish momentum.",
            "Sentiment": "positive",
            "PublishDate": 1751869877000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jaiprakash Power Ventures: Stock Dips 1.58% Amid Market Decline",
            "Summary": "Jaiprakash Power Ventures Ltd. shares fell 1.58% to Rs 17.45 as the Sensex dropped 35.37 points. The stock saw high trading volume with 66,294,165 shares traded and a turnover of Rs 115.22 crore.",
            "Sentiment": "negative",
            "PublishDate": 1749533423000,
            "Source": "normal_news"
        },
        {
            "Title": "Jaiprakash Power Ventures Reports Q4 Financial Results",
            "Summary": "Jaiprakash Power Ventures announced its Q4 financial results. The company reported a net profit of 1.55 billion rupees, which is lower compared to 2.53 billion rupees in the same quarter last year (YoY) and 1.25 billion rupees in the previous quarter (QoQ). The company's revenue for Q4 stood at 13.4 billion rupees, down from 15.1 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1746144640000,
            "Source": "default"
        },
        {
            "Title": "Jaiprakash Power Ventures: Q4 Profit Plunges 73% Amid Revenue Decline",
            "Summary": "Jaiprakash Power Ventures reported a 73% drop in Q4 FY25 net profit to Rs 155.67 crore, down from Rs 588.79 crore in Q4 FY24. Total income decreased to Rs 1,366.67 crore from Rs 1,863.63 crore year-over-year. Expenses rose to Rs 1,165.75 crore. For FY25, net profit fell to Rs 813.55 crore from Rs 1,021.95 crore in FY24.",
            "Sentiment": "negative",
            "PublishDate": 1746112675000,
            "Source": "earnings"
        },
        {
            "Title": "Jaiprakash Power Ventures Reports Q4 Financial Results",
            "Summary": "Jaiprakash Power Ventures has released its Q4 financial results. The company's EBITDA decreased to 3.89 billion rupees from 7.27 billion rupees year-over-year, with EBITDA margin falling to 28.98% from 47.98%. Revenue declined to 13.4 billion rupees from 15.1 billion rupees. Net profit decreased to 1.55 billion rupees from 2.53 billion rupees year-over-year, but increased from 1.25 billion rupees quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1746111985000,
            "Source": "result"
        },
        {
            "Title": "Jaiprakash Power Ventures: Share Price Surges 11% in Morning Trade",
            "Summary": "Jaiprakash Power's stock price jumped 11.43% to ₹14.92 in morning trade on BSE, continuing its upward trend for the second consecutive session. The stock opened at ₹13.48 and was trading at ₹14.79, up 10.46% around 11:50 AM.",
            "Sentiment": "positive",
            "PublishDate": 1742366419000,
            "Source": "normal_news"
        },
        {
            "Title": "Jaiprakash Power Ventures Reports Decline in Q3 Profit and Revenue",
            "Summary": "Jaiprakash Power Ventures has reported its financial results for the third quarter. The company's net profit decreased to 1.24 billion rupees from 1.73 billion rupees in the same quarter last year. Revenue also saw a significant decline, falling to 11.4 billion rupees from 21.9 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738403727000,
            "Source": "earnings"
        },
        {
            "Title": "Jaiprakash Power Ventures Reports Decline in Q3 EBITDA",
            "Summary": "Jaiprakash Power Ventures has reported a significant decrease in its Q3 EBITDA, which fell to 2.9 billion rupees from 5.77 billion rupees in the same quarter last year. The company's EBITDA margin also saw a slight decline, dropping to 25.44% from 26.36% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738403705000,
            "Source": "earnings"
        },
        {
            "Title": "Jaiprakash Power Ventures: Sebi Imposes Rs 54 Lakh Fine for Financial Misrepresentation",
            "Summary": "Sebi fined Jaiprakash Power Ventures, its MD, CEO, and other top officials a total of Rs 54 lakh for misrepresenting financial statements from FY 2012-13 to FY 2021-22. The company overstated its books by not adopting correct accounting practices and not measuring investments at fair value.",
            "Sentiment": "negative",
            "PublishDate": 1735308245000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Andhra Pradesh High Court Stays Rs 1334 Crore Penalty on Jaiprakash Power Ventures",
            "Summary": "Jaiprakash Power Ventures has announced that the Andhra Pradesh High Court has issued a stay order on penalty demands totaling Rs 1334 crore. These penalties were imposed by the Department of Mines & Geology. The court's decision was based on the grounds that the department had overreached its authority in imposing these penalties.",
            "Sentiment": "positive",
            "PublishDate": 1734310819000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Andhra Pradesh High Court Stays Penalty Demands on Jaiprakash Power Ventures",
            "Summary": "The Andhra Pradesh High Court has issued a stay order on penalty demands totaling Rs 1334 crore imposed on Jaiprakash Power Ventures by the Department of Mines & Geology. The court's decision cites an overreach of authority by the department in imposing these penalties.",
            "Sentiment": "positive",
            "PublishDate": 1734090689000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jaiprakash Power Ventures Reports Q2 Financial Results",
            "Summary": "Jaiprakash Power Ventures Limited has announced its Q2 consolidated net profit of 1.82 billion rupees, showing a significant increase from 686 million rupees year-over-year. However, the company's Q2 revenue decreased to 12.26 billion rupees from 13.49 billion rupees in the same period last year. Compared to the previous quarter, net profit increased from 3.48 billion rupees, while revenue decreased from 17.54 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1730075016000,
            "Source": "result"
        }
    ]
}