{
    "Symbol": "JSFB",
    "ISIN": "INE953L01027",
    "News": [
        {
            "Title": "Jana Small Finance Bank allots 21,608 ESOP shares",
            "Summary": "Jana Small Finance Bank allotted 21,608 equity shares under ESOP 2017 and ESOP 2018 schemes, increasing paid-up capital from 105273690 to 105295297 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1770379032461,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jana Small Finance Bank Q3FY26 Net Profit Drops 91%",
            "Summary": "Jana Small Finance Bank reported a 91.24% decline in Q3FY26 net profit to ₹0.97 crores from ₹11.07 crores YoY. Nine-month profit fell 50.61% to ₹18.66 crores despite 20.22% revenue growth.",
            "Sentiment": "negative",
            "PublishDate": 1770376102730,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jana Small Finance Bank Schedules Investor Meet",
            "Summary": "Jana Small Finance Bank announces investor meeting with East Bridge Capital on February 9, 2025, to discuss Q3 FY26 results in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770201452703,
            "Source": "stocks"
        },
        {
            "Title": "Jana Small Finance Bank Appoints Two Independent Directors",
            "Summary": "Jana Small Finance Bank appointed Ajay Rotti and Pankaj Razdan as Additional Independent Directors effective February 2, 2026, for a five-year term under SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1770041126188,
            "Source": "stocks"
        },
        {
            "Title": "Jana Small Finance Bank Board Meet on Feb 6, 2026",
            "Summary": "Jana Small Finance Bank has scheduled a board meeting on February 6, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769245140125,
            "Source": "co_actions_results"
        },
        {
            "Title": "Amansa Holdings reduces stake in Jana Small Finance Bank",
            "Summary": "Amansa Holdings Private Limited has reduced its shareholding in Jana Small Finance Bank from 4.20% to 3.82% through a secondary market sale of 4,01,000 shares on January 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767941186583,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jana Small Finance Bank Files Compliance Details",
            "Summary": "Jana Small Finance Bank submitted regulatory filing confirming Mrs. Lakshmi R. N as Company Secretary and Compliance Officer since August 2018, and KFin Technologies Limited as RTA since September 2013.",
            "Sentiment": "neutral",
            "PublishDate": 1767866702245,
            "Source": "stocks"
        },
        {
            "Title": "Jana Small Finance Bank Allots 16,562 ESOP Shares",
            "Summary": "Jana Small Finance Bank allotted 16,562 equity shares under ESOP 2017 and 2018 schemes on December 16, 2025, increasing paid-up capital to 105,273,690 shares from 105,257,128 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1765951869843,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jana Small Finance Bank Shareholders Approve Appointment of Rakesh Joshi as Independent Director",
            "Summary": "Jana Small Finance Bank's shareholders passed a special resolution through postal ballot to appoint Mr. Rakesh Joshi as Non-Executive Independent Director with 99.89% votes in favor. The remote e-voting process concluded on November 23, 2025, with 271 members participating out of 53,304 total shareholders as of the cut-off date.",
            "Sentiment": "positive",
            "PublishDate": 1763983107148,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jana Small Finance Bank Appoints Mrs. Chitra Talwar as Part-Time Chairperson",
            "Summary": "Jana Small Finance Bank received RBI approval to appoint Mrs. Chitra Talwar as Part-Time Chairperson effective February 8, 2026, following the retirement of current chairperson Mr. R Ramaseshan after completing his maximum eight-year tenure. Mrs. Talwar, who has been serving as an Independent Director since January 2020, brings over three decades of corporate experience from Britannia and PepsiCo with expertise in sales, marketing, and strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1763637839369,
            "Source": "corporate_governance"
        },
        {
            "Title": "RBI Rejects Jana Small Finance Bank's Universal Bank Application",
            "Summary": "Jana Small Finance Bank disclosed that the Reserve Bank of India has returned its application for transitioning to a universal bank, citing non-fulfilment of eligibility requirements. The bank had submitted its application in June 2025. The bank's board approved raising Rs 250 crore through non-convertible debentures on a private placement basis, which will be listed on BSE and form part of Lower Tier II capital under Basel II norms. In quarterly results, net profit declined 40% to Rs 102 crore compared to Rs 171 crore in the same period last year, primarily due to a 22% increase in total expenses to Rs 1,218 crore. Total income rose to Rs 1,516 crore from Rs 1,356 crore year-on-year. Shares closed at Rs 454 on NSE, up 2% for the session and have gained 12% year-to-date.",
            "Sentiment": "negative",
            "PublishDate": 1761625597366,
            "Source": "stock"
        },
        {
            "Title": "RBI Returns Jana Small Finance Bank's Universal Banking Application",
            "Summary": "The Reserve Bank of India returned Jana Small Finance Bank's application for voluntary transition to a universal bank due to non-fulfilment of criteria. The Bengaluru-based lender had applied for the transition in June following RBI guidelines. To qualify for a universal banking licence, banks must meet multiple requirements including stock exchange listing, minimum net worth of Rs 1,000 crore, minimum capital requirements, net profit in the previous two fiscal years, and non-performing asset ratios within prescribed limits. Jana Small Finance Bank, which launched in March 2018 after starting as a microfinance-focused non-bank finance company, failed to meet these criteria. AU Small Finance Bank recently received RBI approval for universal banking transition, while Ujjivan SFB's approval remains pending.",
            "Sentiment": "negative",
            "PublishDate": 1761620742992,
            "Source": "stock"
        },
        {
            "Title": "Jana Small Finance Bank Reports Q2 FY26 Results with 0.3% Growth in Unsecured Assets, Raises ₹250 Crore Tier 2 Capital",
            "Summary": "Jana Small Finance Bank reported quarterly results with CASA growing 14% year-to-date and term deposits growing 11% year-to-date, crossing ₹30,000 crore milestone at ₹32,532 crore. Cost of deposits decreased to 7.88% in Q2 FY26 from higher levels. The bank's secured assets showed strong growth of 35-40% with notable performance in Affordable Housing (34.4% year-on-year), MSME (27% year-on-year), Gold Loans (17.5% quarter-on-quarter), and Two-Wheelers (12.8% quarter-on-quarter). Unsecured assets stabilized with 0.3% growth after previous declines. The bank raised ₹250 crore in Tier 2 capital, improving CAR by 1.25%. Net Interest Margin stood at 6.6% for Q2, down from 6.7% in Q1. The bank reported PAT of ₹75 crore for Q2 and ₹177 crore for first half. Gross loan portfolio reached ₹31,655 crore with 72.5% secured assets, 13.5% unsecured under guarantee programs, and 14% unsecured outside guarantee programs. The bank has expanded its guarantee program coverage, expecting 96% of unsecured portfolio to be under guarantee by March 2027. Management revised PAT growth guidance to 0-2% for the year while maintaining 20% growth targets for loans and deposits.",
            "Sentiment": "neutral",
            "PublishDate": 1761205160727,
            "Source": "earnings"
        },
        {
            "Title": "Jana Small Finance Bank Seeks Shareholder Approval for Rakesh Joshi's Independent Director Appointment",
            "Summary": "Jana Small Finance Bank has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Rakesh Joshi as a Non-Executive Independent Director. Joshi, who holds DIN 09766853, was appointed as an Additional Director on August 27, 2025, and the proposed term runs until August 26, 2030. The 63-year-old brings over 41 years of experience in banking, financial services, and insurance, having previously served as Whole Time Member at IRDAI until December 2023. He will receive an annual remuneration of Rs. 10 lakh plus sitting fees of Rs. 60,000 for Board meetings and Rs. 40,000 for committee meetings. The e-voting period is scheduled from October 24 to November 23, 2025, with results to be announced by November 25, 2025. The cut-off date for voting eligibility is October 17, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761202093534,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jana Small Finance Bank Targets 35-40% Asset Growth in FY26",
            "Summary": "Jana Small Finance Bank expects to achieve 35-40% asset growth in FY26, with growth driven by affordable housing, MSME, and gold loan segments. The bank anticipates lower credit costs and strengthened capital position during this period.",
            "Sentiment": "positive",
            "PublishDate": 1760718476865,
            "Source": "stock"
        },
        {
            "Title": "Jana Small Finance Bank Reports ₹176.92 Crore Net Profit for Half Year Ended September 2025",
            "Summary": "Jana Small Finance Bank Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The bank reported a net profit after tax of ₹176.92 crores for the half year period. Key financial metrics include a Capital Adequacy Ratio of 19.72%, Gross NPA ratio of 2.87%, and Net NPA ratio of 0.94%. The bank's net worth stands at ₹4,028.53 crores with basic earnings per share of ₹16.82 for the half year. Total income for the half year reached ₹3,068.40 crores. The bank's debt-equity ratio improved to 0.89 and return on assets was 0.90% on an annualized basis. During the quarter, the bank acquired loans worth ₹163.21 crores under assignment and transferred non-performing assets worth ₹412.16 crores to Asset Reconstruction Companies.",
            "Sentiment": "positive",
            "PublishDate": 1760696781543,
            "Source": "earnings"
        },
        {
            "Title": "Jana Small Finance Bank Board Approves ₹250 Crore NCD Issuance Through Private Placement",
            "Summary": "Jana Small Finance Bank's board has approved the issuance of Non-Convertible Debentures (NCDs) worth up to ₹250 crores through private placement. This debt instrument will allow the bank to raise capital from select investors without offering the securities to the general public.",
            "Sentiment": "positive",
            "PublishDate": 1760009014158,
            "Source": "corporate_action"
        },
        {
            "Title": "Jana Small Finance Bank Schedules Board Meeting to Consider Non-Convertible Debentures Issuance",
            "Summary": "Jana Small Finance Bank has scheduled a board meeting for October 9 to discuss the issuance of non-convertible debentures along with other matters.",
            "Sentiment": "neutral",
            "PublishDate": 1759724097908,
            "Source": "corporate_action"
        },
        {
            "Title": "Jana Small Finance Bank Appoints Sudhir Madhavan as President & Head Strategic Alliance",
            "Summary": "Jana Small Finance Bank Limited has appointed Sudhir Madhavan as President & Head Strategic Alliance, effective September 25, 2025. Madhavan previously worked with Jana Small Finance Bank from December 10, 2018 to April 30, 2025, before joining Kinara Capital in April 2025. He has now rejoined the bank in his new role. Madhavan brings over 20 years of experience in retail banking, MSME, consumer portfolio management and collections. His previous experience includes positions at Bajaj Finance Limited, ABN Amro and HDFC Bank.",
            "Sentiment": "positive",
            "PublishDate": 1758797266036,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jana and Ujjivan Small Finance Banks May Avoid Promoter Ring-Fencing for Universal Banking License",
            "Summary": "Jana Small Finance Bank and Ujjivan Small Finance Bank may not need to ring-fence promoters when transitioning to universal banks, unlike AU Small Finance Bank which was directed by RBI to set up a holding company and transfer promoter shares. Jana already operates through a listed holding company structure, while Ujjivan became fully publicly held with zero promoter ownership after reverse-merging its holding company last year. AU Small Finance Bank received in-principle approval with conditions, as promoter Sanjay Agarwal and associates hold 22.85% stake. Jana applied for universal banking license in June, Ujjivan in February, and AU SFB in September 2024. The transition would reduce capital adequacy requirements from 15% to 11.5%, lower priority sector lending targets from 60% to 40%, and remove the requirement for 50% of loans to be under ₹25 lakh.",
            "Sentiment": "positive",
            "PublishDate": 1756861215385,
            "Source": "stock"
        },
        {
            "Title": "Jana Small Finance Bank Appoints Rakesh Joshi as Independent Director",
            "Summary": "Jana Small Finance Bank Limited appointed Mr. Rakesh Joshi as an Additional Director (Independent Director) effective August 27, 2025, for a five-year term. Joshi brings over 41 years of experience in banking, financial services, and insurance sectors, including roles in wholesale banking, retail banking, investment banking, and insurance. He previously served as Whole Time Member (Finance and Investments) at the Insurance Regulatory and Development Authority of India (IRDAI) and retired in December 2023. The bank confirmed that Joshi is not related to any existing directors and has not been debarred by regulatory authorities.",
            "Sentiment": "positive",
            "PublishDate": 1756287255619,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jana Small Finance Bank to Merge Holding Companies for Leaner Structure",
            "Summary": "Jana Small Finance Bank is merging its non-operative financial holding company into its core investment company to create a more efficient structure. Jana Capital, the core investment company, holds 100% in Jana Holdings, which owns 21.88% in the bank. CEO Ajay Kanwal stated the merger is unrelated to the bank's universal banking license application and aims to improve efficiency. The three-tier structure was originally required by RBI regulations for small finance bank licensing, but this requirement has since been removed. The bank previously abandoned similar merger plans before its IPO on commercial grounds. Unlike competitors such as Bandhan Financial Services, Jana management has no plans to enter insurance or mutual fund product manufacturing. The bank applied for voluntary transformation to universal banking on June 9. AU Small Finance Bank recently received an in-principle universal banking license from RBI, becoming the first small finance bank to get upgrade approval.",
            "Sentiment": "positive",
            "PublishDate": 1756254451525,
            "Source": "corporate_action"
        },
        {
            "Title": "Jana Small Finance Bank Receives ₹14.32 Crore GST Demand and Penalty Order",
            "Summary": "Jana Small Finance Bank has received a GST demand and penalty order totaling ₹14.32 crore. The bank plans to file an appeal against this order.",
            "Sentiment": "negative",
            "PublishDate": 1756208164238,
            "Source": "stock"
        },
        {
            "Title": "Jana Small Finance Bank Appoints Two Senior Executives, One Resigns Due to Family Health Issues",
            "Summary": "Jana Small Finance Bank announced senior management changes effective August 18, 2025. Asheesh Maroo joins as Chief Credit Officer, bringing 30 years of experience in business and credit risk from YES Bank, ICICI Bank, and Birla Global. Rajesh Sharma joins as Chief Operating Officer with 34 years of experience in operations and customer services from HDFC Bank and Corporation Bank. Ganesh Nagarajan resigned from his position as Chief Operations Officer, with his last working day scheduled for November 17, 2025, citing relocation to Chennai due to family health issues including his wife's medical complications and his 80-year-old mother's health concerns.",
            "Sentiment": "neutral",
            "PublishDate": 1755517818680,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jana Small Finance Bank Schedules Multiple Investor Meetings on August 13, 2025",
            "Summary": "Jana Small Finance Bank has scheduled investor meetings on August 13, 2025, at Trident BKC, Mumbai. The bank's MD & CEO, CFO, and Head of Investor Relations will attend these sessions. The schedule includes a group meeting from 11:00 AM to 12:00 noon with multiple investors including Steinberg India Fund, Sundaram AMC-PMS, Mahindra Manulife Investment Management, OHM Group, Bessemer Venture Partners, and others. Four separate one-to-one meetings are planned throughout the day with Lucky Investments & Bairav IFC (12:00-1:00 PM), Kotak Mahindra AMC (2:00-3:00 PM), Fortuna (3:00-4:00 PM), and Haitong & Batlivala & Karani Securities (4:00-6:00 PM). The bank stated that meeting times may change based on convenience and no unpublished price sensitive information will be shared during the meetings.",
            "Sentiment": "neutral",
            "PublishDate": 1754636160923,
            "Source": "stock"
        },
        {
            "Title": "Jana Small Finance Bank Reports 19.4% Advance Growth, Submits Universal Banking License Application",
            "Summary": "Jana Small Finance Bank Limited submitted its Annual Report for FY 2024-25, showing advances growth of 19.4% to ₹29,545 crores and deposits growth of 29% to ₹29,120 crores. The bank reported net profit of ₹501 crores compared to ₹670 crores in the previous year. Secured portfolio grew 40% year-on-year, now comprising 70% of total advances. The bank has met regulatory criteria and submitted application to RBI for Universal Banking License in Q1 FY2026. Capital Adequacy Ratio stands at 20.68%, well above the regulatory requirement of 15%. Gross NPA ratio increased to 2.71% from 2.11% in the previous year, while Net NPA ratio rose to 0.94% from 0.56%.",
            "Sentiment": "neutral",
            "PublishDate": 1754375636339,
            "Source": "earnings"
        },
        {
            "Title": "Jana Small Finance Bank Reports Mixed Q1 Results Amid MFI Stress, Maintains Growth Guidance",
            "Summary": "Jana Small Finance Bank reported PAT of Rs. 102 crore for Q1, with an additional Rs. 150 crore in accelerated provisions. The bank faced continued stress in its microfinance segment, with unsecured book declining 2.5% quarter-on-quarter, while secured assets showed 3% growth. Gross NPA stood at 2.8% and net NPA at 0.9%. The bank filed its Universal Bank license application on June 9th and added 8 new branches during the quarter. Management expects secured business growth of 12-13% by first half and maintains 20% asset growth guidance. NIMs declined to 6.9% from 7.4% due to investment book yield compression. The bank reduced deposit rates by 50 basis points to 7.75% and expects deposit growth to accelerate. Management anticipates MFI stress to ease in Q2 with significant improvement in Q3, while maintaining conservative credit criteria for unsecured lending.",
            "Sentiment": "neutral",
            "PublishDate": 1753706403685,
            "Source": "earnings"
        },
        {
            "Title": "Jana Small Finance Bank Q1 Net Profit Falls 40% to ₹102 Crore on Higher Expenses",
            "Summary": "Jana Small Finance Bank reported a 40% decline in net profit to ₹102 crore for the quarter ended June 2025, compared to ₹171 crore in the same period last year. The profit drop was attributed to rising costs, with total expenses increasing 22% to ₹1,218 crore from ₹1,000 crore year-on-year due to higher interest and operating expenses. Despite the expense surge, total income grew to ₹1,516 crore from ₹1,356 crore in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1753232267718,
            "Source": "earnings"
        },
        {
            "Title": "Jana Small Finance Bank Reports ₹101.93 Crore Net Profit for Quarter Ended June 30, 2025",
            "Summary": "Jana Small Finance Bank Limited reported net profit after tax of ₹101.93 crores for the quarter ended June 30, 2025, with basic earnings per share of ₹9.69. The bank's asset quality showed gross NPA at 2.91% and net NPA at 0.94%. Capital adequacy ratio stood at 19.97%, while return on assets was 1.07% on an annualized basis. The bank's net worth was ₹3,974.86 crores with operating margin at 19.66% and net profit margin at 6.72%. The board also approved the 19th Annual General Meeting scheduled for August 29, 2025, to be conducted through video conferencing.",
            "Sentiment": "positive",
            "PublishDate": 1753179694988,
            "Source": "earnings"
        },
        {
            "Title": "Jana Small Finance Bank: Applies for Universal Banking Licence",
            "Summary": "Jana Small Finance Bank has submitted an application to the Reserve Bank of India (RBI) for a universal banking licence. The bank cites strong presence in retail and MSME segments, expanded digital and physical footprint, and solid financial performance as reasons for this strategic move.",
            "Sentiment": "positive",
            "PublishDate": 1749524788000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jana Small Finance Bank: Applies for Universal Bank Status",
            "Summary": "Jana Small Finance Bank has submitted an application to the RBI for transition from a small finance bank to a universal bank. The bank must meet criteria including stock exchange listing, minimum net worth of ₹1,000 crore, and specific NPA ratios. The RBI will conduct initial screening before forwarding to a five-member committee for evaluation.",
            "Sentiment": "positive",
            "PublishDate": 1749481516000,
            "Source": "corporate_action"
        },
        {
            "Title": "JANA Small Finance Bank Applies for Universal Bank Status",
            "Summary": "JANA Small Finance Bank has submitted an application to the Reserve Bank of India seeking approval to voluntarily transition into a universal bank. This strategic move is aimed at expanding the bank's service offerings and strengthening its position in the market.",
            "Sentiment": "positive",
            "PublishDate": 1749477428000,
            "Source": "default"
        },
        {
            "Title": "Jana Small Finance Bank: Q4 Profit Plunges 61% YoY",
            "Summary": "Jana Small Finance Bank reported a 61.6% YoY drop in Q4 net profit to Rs 123.50 crore. However, PAT increased 11.3% QoQ. CASA ratio slightly decreased to 18%. Gross NPA improved to 2.5%, while net NPA remained stable at 0.9%. The bank's weighted CAR rose to 20.7% in Q4FY25.",
            "Sentiment": "negative",
            "PublishDate": 1745988683000,
            "Source": "earnings"
        },
        {
            "Title": "Jana Small Finance Bank Reports Q4 Financial Results",
            "Summary": "Jana Small Finance Bank has released its Q4 financial results. The bank reported a net profit of 1.2 billion rupees, down from 3.22 billion rupees year-over-year but up from 1.1 billion rupees quarter-over-quarter. Revenue increased to 11.99 billion rupees from 11.11 billion rupees year-over-year. The Gross Non-Performing Assets (GNPA) ratio improved to 2.71% from 2.8% in the previous quarter, while the Net Non-Performing Assets (NNPA) ratio remained stable at 0.94%.",
            "Sentiment": "neutral",
            "PublishDate": 1745972733000,
            "Source": "default"
        },
        {
            "Title": "Jana Small Finance Bank: Q4 Profit Plunges 62% YoY, Interest Income Up",
            "Summary": "Jana Small Finance Bank reported a 62% year-over-year decrease in Q4 net profit to ₹123 crore. However, the bank's interest income increased by 8% compared to the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1745930974000,
            "Source": "earnings"
        },
        {
            "Title": "Jana Small Finance Bank Q4 Financial Results",
            "Summary": "Jana Small Finance Bank reported its Q4 financial results. The Gross Non-Performing Assets (GNPA) decreased to 2.71% from 2.8% quarter-over-quarter, while Net Non-Performing Assets (NNPA) remained stable at 0.94%. The bank's Q4 net profit was 1.2 billion rupees, down from 3.22 billion rupees year-over-year but slightly up from 1.1 billion rupees quarter-over-quarter. Revenue increased to 11.99 billion rupees from 11.11 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1745929089000,
            "Source": "result"
        },
        {
            "Title": "Jana Small Finance Bank: Q4 Results Announcement Scheduled for April 29",
            "Summary": "Jana Small Finance Bank will announce Q4 and FY25 results on April 29 at 3:30 p.m. An earnings call is scheduled for 5:30 p.m. the same day. The trading window is closed from April 1 to May 1 for insiders. Q3 FY25 saw a 17.75% YoY decline in net profit to Rs 110.7 crore, while net interest income rose 13.4% YoY to Rs 1,177.4 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1745829928000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jana Small Finance Bank: Nuvama Initiates Coverage with 45% Upside Target",
            "Summary": "Nuvama Institutional Equities initiated coverage on Jana Small Finance Bank with a buy rating and a target price of ₹600, citing attractive valuations and expected improvements in asset quality. The bank's gross loan book is projected to grow at 21% CAGR over FY24-27, with secured loans expected to increase to 80% of the portfolio by FY27. Operating expenses are anticipated to remain high in FY25 due to collection efforts but should ease from FY26.",
            "Sentiment": "positive",
            "PublishDate": 1744095310000,
            "Source": "normal_news"
        },
        {
            "Title": "RBI Grants AD-I License to Jana Small Finance Bank",
            "Summary": "The Reserve Bank of India (RBI) has granted an Authorized Dealer Category-I (AD-I) license to Jana Small Finance Bank. This license allows the bank to deal in foreign exchange and expand its international banking services.",
            "Sentiment": "positive",
            "PublishDate": 1741320915000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jana Small Finance Bank: Share Price Surges 18% Post Q3 Results",
            "Summary": "Jana Small Finance Bank's share price increased by over 18% following the announcement of its third quarter results.",
            "Sentiment": "positive",
            "PublishDate": 1737519449000,
            "Source": "earnings"
        },
        {
            "Title": "Jana Small Finance Bank Reports Mixed Q3 Financial Results",
            "Summary": "Jana Small Finance Bank has released its Q3 financial results. The bank's net profit decreased to 1.11 billion rupees from 1.35 billion rupees year-over-year. However, revenue increased to 11.77 billion rupees from 10.38 billion rupees. The bank's asset quality improved, with Gross Non-Performing Assets (GNPA) decreasing to 2.80% from 2.97% quarter-over-quarter, and Net Non-Performing Assets (NNPA) reducing to 0.94% from 0.99%. Provisions and contingencies increased to 2.8 billion rupees from 2.13 billion rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737505378000,
            "Source": "earnings"
        },
        {
            "Title": "Jana Small Finance Bank: Eyeing Universal Banking License",
            "Summary": "Jana Small Finance Bank plans to apply for a universal banking license after the current fiscal year. The bank has made accelerated provisions to keep net NPA below 1% and increased its secured loan book to 68%. For Q3 FY2024, the bank reported an 18% YoY drop in net profit to Rs 111 crore, with gross advances growing 18.5% YoY to Rs 27,984 crore.",
            "Sentiment": "positive",
            "PublishDate": 1737461396000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jana Small Finance Bank Reports Improved Asset Quality in Q3",
            "Summary": "Jana Small Finance Bank has reported improved asset quality metrics for the third quarter. The Gross Non-Performing Assets (GNPA) ratio decreased to 2.80% from 2.97% in the previous quarter. Net Non-Performing Assets (NNPA) ratio also improved, falling to 0.94% from 0.99% quarter-on-quarter. However, provisions and contingencies increased to 2.8 billion rupees from 2.13 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737455501000,
            "Source": "result"
        },
        {
            "Title": "Jana Small Finance Bank Reports Q3 Financial Results",
            "Summary": "Jana Small Finance Bank has announced its financial results for the third quarter. The bank reported a net profit of 1.11 billion rupees, compared to 1.35 billion rupees in the same period last year, indicating a year-over-year decrease. However, the bank's revenue increased to 11.77 billion rupees from 10.38 billion rupees in the previous year, showing growth in its top line.",
            "Sentiment": "neutral",
            "PublishDate": 1737455476000,
            "Source": "earnings"
        },
        {
            "Title": "Jana Small Finance Bank: R Ramaseshan Appointed as Part-Time Chairman",
            "Summary": "Jana Small Finance Bank has appointed R Ramaseshan as Part-Time Chairman (Independent Director) effective November 27, 2024, until February 7, 2026, with RBI approval. Ramaseshan, an Independent Director since 2018, replaces Subhash Khuntia, who will remain on the Board as an Independent Director.",
            "Sentiment": "neutral",
            "PublishDate": 1732733835832,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jana Small Finance Bank Reaffirms Growth Guidance",
            "Summary": "Jana Small Finance Bank has reiterated its previous guidance during a concall update. The bank plans to revisit and provide an updated outlook in the third quarter. They expect to achieve their target of 20% AUM (Assets Under Management) growth in the second half of the financial year.",
            "Sentiment": "positive",
            "PublishDate": 1729567901000,
            "Source": "normal_news"
        },
        {
            "Title": "Jana Small Finance Bank Revises Growth Projections",
            "Summary": "Jana Small Finance Bank has updated its financial projections. The bank now expects a 20% deposit growth for the full year, up from the 10% growth seen in the first half. However, the bank has revised its Profit After Tax (PAT) growth expectation downward to 30% from the previously announced 40%.",
            "Sentiment": "neutral",
            "PublishDate": 1729567880000,
            "Source": "result"
        },
        {
            "Title": "Jana Small Finance Bank Reports Increased Provisions in Q2",
            "Summary": "Jana Small Finance Bank has reported provisions of 2.13 billion rupees for the second quarter, up from 1.96 billion rupees in the previous quarter. This represents an increase in the bank's loan loss reserves.",
            "Sentiment": "neutral",
            "PublishDate": 1729509495000,
            "Source": "result"
        },
        {
            "Title": "Jana Small Finance Bank Reports Q2 Asset Quality Metrics",
            "Summary": "Jana Small Finance Bank has released its Q2 asset quality metrics. The Gross Non-Performing Assets (GNPA) ratio increased to 2.97% from 2.62% in the previous quarter. The Net Non-Performing Assets (NNPA) ratio remained stable at 0.99% quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1729509484000,
            "Source": "result"
        },
        {
            "Title": "Jana Small Finance Bank Reports Q2 Interest Earnings Growth",
            "Summary": "Jana Small Finance Bank has reported interest earnings of 11.66 billion rupees for the second quarter, compared to 9.8 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729509474000,
            "Source": "result"
        }
    ]
}