{
    "Symbol": "JSL",
    "ISIN": "INE220G01021",
    "News": [
        {
            "Title": "Jindal Stainless Incorporates New Subsidiary",
            "Summary": "Jindal Stainless Limited has incorporated a wholly-owned subsidiary 'Jindal Stainless Corporate Management Services Private Limited' to function as a centralized shared services entity following regulatory approval.",
            "Sentiment": "positive",
            "PublishDate": 1770904994594,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSL Overseas Increases Jindal Stainless Stake by 0.04%",
            "Summary": "JSL Overseas Holding Limited acquired 3,61,328 additional shares of Jindal Stainless Limited through market purchases, increasing its holding from 16.31% to 16.35%.",
            "Sentiment": "neutral",
            "PublishDate": 1770112809476,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jindal Stainless Plans Growth Strategy Announcement",
            "Summary": "Jindal Stainless will announce new two-to-three-year volume growth targets and downstream investment plans by Q4 FY26, as revealed during recent conference call discussions.",
            "Sentiment": "positive",
            "PublishDate": 1769135879247,
            "Source": "stocks"
        },
        {
            "Title": "Jindal Stainless Reports CapEx Progress Update",
            "Summary": "Jindal Stainless announces significant progress on FY26 capital expenditure plans, with ₹2,200 crores already invested out of targeted ₹2,700 crores, demonstrating strong execution of expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1769135855697,
            "Source": "stocks"
        },
        {
            "Title": "JSL Shares Q3 FY26 Earnings Call Recording",
            "Summary": "Jindal Stainless Limited makes available audio recording of its Q3 & 9M FY26 earnings call held on January 22, 2026, complying with regulatory disclosure requirements under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769098539520,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jindal Stainless Declares ₹1 Interim Dividend",
            "Summary": "Jindal Stainless has announced an interim dividend of ₹1.00 per share for its shareholders, reflecting the company's commitment to returning value to investors through regular dividend distributions.",
            "Sentiment": "positive",
            "PublishDate": 1768997806506,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jindal Stainless Q3 Net Profit Surges 26.7% YoY",
            "Summary": "Jindal Stainless reports strong Q3 performance with consolidated net profit rising to ₹8.30 billion from ₹6.55 billion year-on-year, while revenue grows 6.3% to ₹105.20 billion.",
            "Sentiment": "positive",
            "PublishDate": 1768997740299,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSPL Gets Morgan Stanley Upgrade to Overweight",
            "Summary": "Morgan Stanley upgrades JSPL from Equal Weight to Overweight rating, raising target price to ₹1,250.00 per share, signaling improved investment outlook for the steel company.",
            "Sentiment": "positive",
            "PublishDate": 1768968071511,
            "Source": "stocks"
        },
        {
            "Title": "Jindal Stainless Grants 1.19M Stock Options to Employees",
            "Summary": "Jindal Stainless Limited approved grant of 1,186,108 stock options to eligible employees under JSL-ESOS 2023 scheme, comprising equal numbers of ESOPs and RSUs with different pricing structures.",
            "Sentiment": "positive",
            "PublishDate": 1768912041816,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jindal Stainless Board Meet on Jan 21 for Q3 Results",
            "Summary": "Jindal Stainless Limited has scheduled its board meeting for January 21, 2026, to consider Q3FY26 unaudited financial results and potential interim dividend declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1768401989821,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jindal Stainless Re-appoints Independent Director",
            "Summary": "Jindal Stainless Limited shareholders approve re-appointment of Dr. Rajeev Uberoi as independent director for second three-year term through postal ballot with 93.86% votes in favour.",
            "Sentiment": "positive",
            "PublishDate": 1767948482457,
            "Source": "stocks"
        },
        {
            "Title": "Jindal Stainless Shareholders Approve Independent Director",
            "Summary": "Jindal Stainless Limited shareholders approve re-appointment of Dr. Rajeev Uberoi as independent director for second three-year term through postal ballot with 93.86% votes in favour.",
            "Sentiment": "positive",
            "PublishDate": 1767948257415,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jindal Stainless Gets Updated ESG Rating of 71 for FY25",
            "Summary": "Jindal Stainless Limited receives revised ESG rating of 71 from NSE Sustainability Ratings & Analytics for Financial Year 2024-25, replacing earlier rating of 68.3.",
            "Sentiment": "positive",
            "PublishDate": 1766752800337,
            "Source": "stocks"
        },
        {
            "Title": "Jindal Stainless Seeks Shareholder Approval for Independent Director Re-appointment via Postal Ballot",
            "Summary": "Jindal Stainless Limited has issued a postal ballot notice seeking shareholder approval for re-appointing Dr. Rajeev Uberoi as Independent Director for a second three-year term from November 2, 2025 to November 1, 2028. The remote e-voting period runs from December 10, 2025 to January 8, 2026, with results to be declared by January 10, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1765282881021,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Stainless Achieves Top 5% Global Ranking in Dow Jones Sustainability Index with ESG Score of 78",
            "Summary": "Jindal Stainless secured 4th position globally in steel sector and 1st in stainless steel with an ESG score of 78 in DJSI assessment, rising from 60 in FY24. The company achieved scores of 83-73-76 in Environmental-Social-Governance dimensions, significantly exceeding global steel industry averages of 37-35-36, and became the sole steel sector recipient of Golden Peacock Award for Sustainability in FY25.",
            "Sentiment": "positive",
            "PublishDate": 1764739755939,
            "Source": "stock"
        },
        {
            "Title": "Jindal Stainless Launches India's Largest Loyalty Program for Stainless Steel Pipes & Tubes",
            "Summary": "Jindal Stainless introduced 'JSL Saathi Pragati', positioned as India's biggest loyalty program for stainless steel pipes and tubes, offering rewards, product verification, and digital features. The program has attracted over 30,000 retailers and fabricators, strengthening the company's distribution network and customer engagement in the stainless steel segment.",
            "Sentiment": "positive",
            "PublishDate": 1764566295083,
            "Source": "stock"
        },
        {
            "Title": "Jindal Stainless Independent Director Mrs. Arti Luniya's Term Ends",
            "Summary": "Mrs. Arti Luniya (DIN: 05341955) ceased to be an Independent Director of Jindal Stainless Limited after closure of business hours on November 25, 2025, following completion of her second consecutive term. The cessation was due to the natural expiry of her directorship term as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1764068410666,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jindal Stainless Announces ₹5,700 Crore Investment to Achieve Global Leadership in Stainless Steel",
            "Summary": "Jindal Stainless has unveiled a ₹5,700 crore investment strategy aimed at establishing itself as a global leader in the stainless steel sector. The investment plan represents the company's strategic expansion initiative to strengthen its position in the competitive stainless steel market.",
            "Sentiment": "positive",
            "PublishDate": 1763472991832,
            "Source": "stock"
        },
        {
            "Title": "Jindal Stainless Reports Strong Q2 FY26 Performance with 15% Volume Growth and 17% EBITDA Rise",
            "Summary": "Jindal Stainless delivered robust quarterly results with deliveries increasing 15% year-on-year to 648,050 metric tons and consolidated EBITDA rising 17% to INR 1,388 crores, driven by strong domestic demand across sectors including white goods, auto, and infrastructure. The company maintained its annual volume guidance of 9-10% growth while expressing concerns over suspended Quality Control Orders (QCO) and CBAM implementation uncertainties affecting export markets.",
            "Sentiment": "positive",
            "PublishDate": 1763384342224,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Stainless Maintains Conservative Growth Target Despite Strong First Half Performance",
            "Summary": "Jindal Stainless achieved 11% volume growth in the first half but maintains its annual growth target of 9-10% due to concerns over CBAM (Carbon Border Adjustment Mechanism) and QCO (Quality Control Orders). The company has partnered with Greenzon Energy to construct a 600 NM3/hour green hydrogen plant in Jajpur.",
            "Sentiment": "neutral",
            "PublishDate": 1762918684246,
            "Source": "stock"
        },
        {
            "Title": "Jindal Stainless Submits Security Cover Certificate for Non-Convertible Debentures",
            "Summary": "Jindal Stainless Limited submitted its Security Cover Certificate to BSE and NSE for the quarter ended September 30, 2025. The certificate was provided by Lodha Co LLP, the company's Joint Statutory Auditor, in compliance with SEBI regulations. The certificate relates to the company's Listed, Rated, Redeemable Non-Convertible Debentures worth Rs. 99 crores that were outstanding as of September 30, 2025. The auditors confirmed that the book value of assets contained in the statement were accurately extracted from the company's unaudited books of accounts and that the company complied with financial covenants for the period ended September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762804895231,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Stainless Outlines Growth Strategy Focused on Domestic Recovery and Export Optimization",
            "Summary": "Jindal Stainless has outlined its growth strategy centered on domestic demand recovery and export mix optimization. The company plans to strengthen its value-added stainless portfolio and specialty grades while expanding downstream facilities to enhance margin contribution. The strategy includes efficiency improvements through digitization and renewable energy integration, with the company targeting long-term EBITDA margin stability.",
            "Sentiment": "positive",
            "PublishDate": 1762786907182,
            "Source": "stock"
        },
        {
            "Title": "Jindal Stainless Reports 32% Jump in Net Profit to Rs 808 Crore on Strong Sales Growth",
            "Summary": "Jindal Stainless reported a 32% year-on-year increase in consolidated net profit to Rs 808 crore in the September quarter, compared to Rs 609 crore in the same period last year. The company's income rose 12% to Rs 10,982.46 crore from Rs 9,823.88 crore, while sales volumes grew 15% to 6,48,050 tonnes from 5,64,627 tonnes. The company experienced consistent demand across industrial pipes and tubes, lifts and elevators, metro, railway coaches, and wagons segments. The white goods segment also gained momentum due to festive-season demand. Managing Director Abhyuday Jindal noted the company maintained market share through competitive pricing and improved services despite challenges from Chinese and Vietnamese imports. During the quarter, Jindal Stainless developed high strength stainless steel rebars for the bullet train project and its defense arm secured an order from L&T for High Nitrogen Steel plates. The company partnered with Greenzo Energy India to establish a green hydrogen plant at its Jajpur facility with 600 Nm3/hr capacity, targeted for completion by mid-2026.",
            "Sentiment": "positive",
            "PublishDate": 1762775966006,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Stainless Reports Quarterly Results and Plans Wholly-Owned Subsidiary",
            "Summary": "Jindal Stainless Limited's Board approved unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. The company also approved incorporation of a wholly-owned subsidiary to serve as a centralized shared services entity due to expanding operations and growing business complexity. During the half-year, the company allotted 650,000 equity shares to JSL Employee Welfare Trust under ESOP 2023, and the ESOP Trust allotted 361,171 equity shares to eligible employees upon exercise of stock options. The company redeemed remaining 1,875 Non-Convertible Debentures amounting to ₹187.50 crore during the half-year period. As of September 30, 2025, the company has outstanding 990 NCDs of face value ₹1,00,000 each, aggregating to ₹99 crore, due for redemption on September 28, 2026. The company's credit ratings continue to be AA-/Stable on Non-Convertible Debentures and A1+ on short-term borrowings.",
            "Sentiment": "neutral",
            "PublishDate": 1762773436186,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Stainless Executive Forecasts Continued Low Prices",
            "Summary": "A Jindal Stainless executive has stated that prices will remain low in the near future. The company official provided this outlook regarding pricing trends for the stainless steel manufacturer.",
            "Sentiment": "negative",
            "PublishDate": 1762771348339,
            "Source": "stock"
        },
        {
            "Title": "Jindal Stainless Reports Strong Q2 Results, Warns of Cheap Import Influx",
            "Summary": "Jindal Stainless delivered robust Q2 financial performance with consolidated net profit rising to 8.07 billion rupees from 6.11 billion rupees year-over-year. Revenue increased to 108.93 billion rupees compared to 98 billion rupees in the previous year. EBITDA grew to 13.87 billion rupees from 11.86 billion rupees, while EBITDA margin improved to 12.74% from 12.14%. The company expressed concerns about an anticipated increase in low-quality, cheap imports entering the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1762769971818,
            "Source": "stock"
        },
        {
            "Title": "Jindal Stainless Schedules Q2H1FY26 Earnings Call for November 11, 2025",
            "Summary": "Jindal Stainless Limited has announced an earnings call for its Q2H1FY26 results scheduled for November 11, 2025 at 4:00 PM IST. The call is being organized by ICICI Securities and will include participation from Managing Director Abhyudaya Jindal, CEO and CFO Tarun Kumar Khulbe, and Head of Investor Relations Shreya Sharma. The company has provided multiple access numbers including universal access numbers for India and international toll-free numbers for USA, UK, Singapore, and Hong Kong. The company noted that the schedule may change due to exigencies on the part of investors or the company.",
            "Sentiment": "neutral",
            "PublishDate": 1762434523588,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Stainless Limited Re-Appoints Dr. Rajeev Uberoi as Independent Director",
            "Summary": "Jindal Stainless Limited's Board of Directors approved the re-appointment of Dr. Rajeev Uberoi as an Independent Director for a second term of three consecutive years, effective November 2, 2025. The decision was made through resolution by circulation on October 28, 2025, based on the recommendation of the Nomination and Remuneration Committee. Dr. Uberoi, a career banker with specialization in governance, legal, compliance and control, previously served as CEO of IDFC Holding Finance Co. Ltd. and held senior positions at various banks including IDFC Bank Ltd., Yes Bank, Standard Chartered Bank, and others. He holds a Ph.D. in Economics, a Masters from McMaster University, and a Post Graduate Diploma in Business Administration from MDI. Dr. Uberoi confirmed he is not debarred from holding directorship and is not related to any other directors of the company.",
            "Sentiment": "positive",
            "PublishDate": 1761650178909,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jindal Stainless Opens New Wet Milling Plant in Odisha with $150 Million Investment",
            "Summary": "Jindal Stainless has opened a new wet milling plant in Odisha to enhance its slag processing capabilities. The company has partnered with Harsco Environmental for this initiative, investing $150 million in the project. The new facility is expected to create 140 jobs and supports the company's circular production and ESG objectives.",
            "Sentiment": "positive",
            "PublishDate": 1760505012279,
            "Source": "stock"
        },
        {
            "Title": "Jindal Stainless Limited Reports Outstanding Debt Securities Worth Rs 99 Crore",
            "Summary": "Jindal Stainless Limited submitted details of its outstanding listed debt securities issued on private placement basis for the half year ended September 30, 2025. The company has one outstanding debt security with ISIN INE220G07127, issued on September 28, 2022, with a maturity date of September 28, 2026. The security carries a coupon rate of 8.62% with annual payment frequency and has an outstanding amount of Rs 99 crore. The submission was made by Navneet Raghuvanshi, Head-Legal, Company Secretary & Compliance Officer, to BSE Limited and National Stock Exchange of India.",
            "Sentiment": "neutral",
            "PublishDate": 1760447693305,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Stainless Launches New Salt Trailers with Lightweight and Energy-Saving Features",
            "Summary": "Jindal Stainless has launched new salt trailers designed with lightweight, rust-proof, and energy-saving features for sustainable transport solutions.",
            "Sentiment": "positive",
            "PublishDate": 1760073157607,
            "Source": "stock"
        },
        {
            "Title": "Jindal Stainless Launches Mumbai Fabrication Unit with ₹125 Crore Investment",
            "Summary": "Jindal Stainless has started its first stainless steel fabrication unit in Mumbai with an investment of ₹125 crore. The facility is expected to have an annual capacity of 18,000 tonnes by FY26-27. The new unit is projected to create over 250 jobs and support infrastructure development.",
            "Sentiment": "positive",
            "PublishDate": 1759728204728,
            "Source": "stock"
        },
        {
            "Title": "Jindal Stainless Supplies Steel for Bangalore Metro Phase 2 Expansion",
            "Summary": "Jindal Stainless has provided high-quality 301N Austenitic stainless steel for the Bangalore Metro Phase 2 project. The company is contributing materials to support the metro system's expansion infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1757480452626,
            "Source": "stock"
        },
        {
            "Title": "JSL Overseas Acquires 1.2 Million Jindal Stainless Shares Through Open Market Purchase",
            "Summary": "JSL Overseas, a co-promoter of Jindal Stainless, purchased 1.2 million shares of the company from the open market. This transaction represents an increase in the promoter group's shareholding in Jindal Stainless through market purchases.",
            "Sentiment": "positive",
            "PublishDate": 1757327745257,
            "Source": "stock"
        },
        {
            "Title": "Jindal Stainless Reports 8% Volume Growth and 23% Sequential EBITDA Jump in Q1FY26",
            "Summary": "Jindal Stainless Limited delivered strong quarterly results with sales volume growing 8% year-on-year to 626,252 metric tons, while remaining flat quarter-on-quarter. EBITDA increased 8% year-on-year and 23% quarter-on-quarter to Rs. 1,310 crores, with PAT rising 11% year-on-year and 21% quarter-on-quarter to Rs. 715 crores. The company benefited from enhanced product mix with increased volumes of value-added products and special grades, particularly in auto, lift elevators, railways, and white goods sectors. Net debt reduced to Rs. 3,869 crores with a comfortable debt-to-EBITDA ratio of 0.81. Subsidiary Chromeni reached 60-65% capacity utilization and turned EBITDA positive. The company maintained its volume growth guidance of 9-10% and EBITDA guidance of Rs. 19,000-21,000 per ton. Management announced Rs. 2,700 crores CAPEX for FY26 and extended its co-branding initiative to kitchenware and sink categories. The Indian Stainless Steel Development Association has filed for trade protection measures against imports from China, Vietnam and Indonesia.",
            "Sentiment": "positive",
            "PublishDate": 1755009023692,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Stainless Sets Record Date for Final Dividend Payment",
            "Summary": "Jindal Stainless Limited has fixed August 22, 2025 as the record date to determine shareholder eligibility for a final dividend of INR 2 per equity share for the financial year 2024-25. The dividend is subject to shareholder approval at the Annual General Meeting. Shareholders whose names appear as beneficial owners or members in the register as of August 22, 2025 will be eligible for the dividend payment, which will be made within 30 days of the AGM date, subject to applicable tax deductions.",
            "Sentiment": "positive",
            "PublishDate": 1754656089071,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Stainless Maintains FY26 Volume Growth Target at 9-10% with EBITDA Guidance of ₹19,000-21,000 Per Ton",
            "Summary": "Jindal Stainless has maintained its volume growth target of 9-10% for FY26. The company continues to guide for EBITDA of ₹19,000-21,000 per ton. Capacity utilization is expected to reach 80-85% by the end of FY26. The company's Chomeni subsidiary is also targeting 80-85% capacity utilization by the second half of FY26.",
            "Sentiment": "positive",
            "PublishDate": 1754624363175,
            "Source": "stock"
        },
        {
            "Title": "Jindal Stainless Targets 4.2 MT Capacity by FY27 with Focus on Defense and Clean Energy",
            "Summary": "Jindal Stainless has outlined plans for steady growth, targeting a production capacity of 4.2 million tonnes by FY27. The company is focusing on high-value sectors including defense and clean energy alloys. The growth strategy includes enhancing operational efficiency through digital manufacturing initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1754476775257,
            "Source": "stock"
        },
        {
            "Title": "Jindal Stainless Reports 11% Revenue Growth in Q1 with Profit Rising to ₹641.64 Crores",
            "Summary": "Jindal Stainless Limited reported standalone revenue from operations of ₹10,340.51 crores for the quarter ended June 30, 2025, compared to ₹9,584.90 crores in the same quarter last year. Net profit increased to ₹641.64 crores from ₹578.32 crores year-over-year. On a consolidated basis, revenue reached ₹10,207.14 crores versus ₹9,429.76 crores in the previous year, with consolidated profit rising to ₹714.66 crores from ₹646.07 crores. The company redeemed remaining Non-Convertible Debentures worth ₹187.50 crores during the quarter and invested ₹79.20 crores to acquire a 33.64% stake in Oyster Green Hybrid One Private Limited for renewable energy projects. Basic earnings per share stood at ₹7.79 on standalone basis and ₹8.67 on consolidated basis.",
            "Sentiment": "positive",
            "PublishDate": 1754475996648,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Stainless: Acquires Stake in Renewable Energy Venture",
            "Summary": "Jindal Stainless Ltd. acquired a 33.64% stake in Oyster Green Hybrid One Pvt. for Rs 79.20 crore to develop a 282-MW hybrid renewable energy project. The company plans to invest up to Rs 132 crores for project commissioning, expected by Q3 FY26. This move aims to meet power requirements for Jindal Stainless' plants, potentially saving on energy costs.",
            "Sentiment": "positive",
            "PublishDate": 1748922835000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Stainless: Acquires Stake in SPV for 282 MW Renewable Energy Project",
            "Summary": "Jindal Stainless Limited acquired a 33.64% stake in Oyster Green Hybrid One Private Limited, an SPV for a 282 MW hybrid renewable energy project. The company invested ₹79.20 crore initially, with a total planned investment of ₹132 crore. The project aims to supply 700 million units of renewable power annually and is expected to be commissioned by Q3 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1748870930000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Stainless Acquires 33.64% Stake in Oyster Renewable's SPV",
            "Summary": "Jindal Stainless has purchased a 33.64% stake in a 282MW Special Purpose Vehicle (SPV) owned by Oyster Renewable. The company plans to invest up to INR 1.32 billion in this Oyster SPV.",
            "Sentiment": "positive",
            "PublishDate": 1748864122000,
            "Source": "default"
        },
        {
            "Title": "Jindal Stainless: Jefferies Initiates Coverage with Bullish Outlook",
            "Summary": "Jefferies initiates coverage on Jindal Stainless with a 'buy' rating and Rs 800 price target. The brokerage cites the company's dominant position in India's stainless steel market and robust financial profile. Jindal Stainless is expected to deliver 10% volume growth and 21% EPS CAGR over FY25-27. India's stainless steel demand is growing at 8% CAGR, twice the global rate.",
            "Sentiment": "positive",
            "PublishDate": 1748503618000,
            "Source": "normal_news"
        },
        {
            "Title": "Jindal Stainless: Rs 40,000 Crore Investment Plan in Maharashtra",
            "Summary": "Jindal Stainless is in talks with the Maharashtra government to acquire land for a Rs 40,000 crore stainless steel facility. The project, to be developed over 10 years, aims for 4 million tonnes annual melting capacity and could create 15,000 jobs. The company is currently expanding its existing capacity from 3 million to 4.2 million tonnes by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1746945644000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Stainless Ltd: Q4 Profit Rises 17.8%, Declares Dividend",
            "Summary": "Jindal Stainless Ltd reported a 17.8% YoY increase in Q4FY25 net profit to ₹590 crore. Revenue rose 7.9% to ₹10,198 crore. EBITDA margin narrowed to 10.4%. The company declared a final dividend of ₹2 per share, bringing the total FY25 dividend to ₹3 per share.",
            "Sentiment": "positive",
            "PublishDate": 1746707341000,
            "Source": "earnings"
        },
        {
            "Title": "Jindal Stainless Reports Q4 Results and Outlines Future Strategy",
            "Summary": "Jindal Stainless announced its Q4 results, with consolidated net profit rising to 5.91B rupees from 5B YoY. Revenue increased to 101.98B rupees from 94.54B YoY. The company declared a final dividend of 2 rupees per equity share. Executives expressed bullishness on domestic growth, expecting 9-10% volume growth in FY26 and a 30% YoY increase in export volumes. They also mentioned plans to file an anti-dumping petition against China and Vietnam for stainless steel pricing. The company noted that U.S. tariffs have improved their export market position and observed signs of recovery in Europe.",
            "Sentiment": "positive",
            "PublishDate": 1746706426000,
            "Source": "default"
        },
        {
            "Title": "Jindal Stainless and AB Energia Launch Odisha's Largest Captive Industrial Solar Plant",
            "Summary": "Jindal Stainless, in collaboration with AB Energia, has established Odisha's largest captive industrial solar plant. The facility is capable of generating approximately 44.3 million units of green energy annually, setting a new benchmark in sustainable industrial practices.",
            "Sentiment": "positive",
            "PublishDate": 1745314207000,
            "Source": "default"
        },
        {
            "Title": "Jindal Stainless Unit Signs 11 MWp Power Purchase Agreement with Sunsure Energy",
            "Summary": "JSL Super Steel, a unit of Jindal Stainless, has entered into an 11 MWp Power Purchase Agreement (PPA) with Sunsure Energy. This agreement is expected to replace 40% of the conventional energy currently used at JSL Super Steel's Ghaziabad facility with renewable energy.",
            "Sentiment": "positive",
            "PublishDate": 1744329971000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Stainless Unit Signs PPA for Renewable Energy",
            "Summary": "JSL Super Steel, a unit of Jindal Stainless, has signed an 11 MWp Power Purchase Agreement (PPA) with Sunsure Energy. This agreement is expected to replace 40% of the conventional energy consumed by JSL Super Steel's facility in Ghaziabad with renewable energy.",
            "Sentiment": "positive",
            "PublishDate": 1744285650000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jindal Stainless Plans Rs 40,000 Crore Investment in Maharashtra Plant",
            "Summary": "Jindal Stainless is considering a significant investment of Rs 40,000 crore to establish a new manufacturing plant in Maharashtra. This move indicates the company's expansion plans and potential growth in its production capacity. The large-scale investment suggests confidence in the steel industry's future and could have positive implications for the local economy in terms of job creation and industrial development.",
            "Sentiment": "positive",
            "PublishDate": 1743120588000,
            "Source": "corporate_action"
        }
    ]
}