{
    "Symbol": "JSLL",
    "ISIN": "INE0J5801029",
    "News": [
        {
            "Title": "Jeena Sikho Lifecare Q3FY26 profit jumps 405%",
            "Summary": "Jeena Sikho Lifecare Limited reported strong Q3FY26 results with net profit rising 405% YoY to ₹6,672.67 lacs. Revenue from operations grew 92% to ₹22,166.47 lacs, driven by robust performance across both ayurvedic products and healthcare services segments.",
            "Sentiment": "positive",
            "PublishDate": 1770472454764,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jeena Sikho Lifecare Approves AED 7.53 Million Loan",
            "Summary": "Jeena Sikho Lifecare Limited's board approved an unsecured loan agreement of AED 7.53 million with its wholly owned subsidiary Jeena Sikho International LLC on January 21, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769006412998,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jeena Sikho Unit Gets Approval for UAE Acquisition",
            "Summary": "Jeena Sikho Lifecare's subsidiary receives board approval to acquire 51% stake in Back to Roots Ayurveda by Dr. Shyam LLC for AED 1.53 million, expanding into UAE healthcare market.",
            "Sentiment": "positive",
            "PublishDate": 1768565078424,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jeena Sikho Partners with Theryco for Amazon Sales",
            "Summary": "Jeena Sikho Lifecare enters procurement agreement with Theryco Healthcare Solutions to manage and sell products on Amazon platform, aiming to strengthen distribution reach.",
            "Sentiment": "positive",
            "PublishDate": 1768291780656,
            "Source": "stocks"
        },
        {
            "Title": "Jeena Sikho LifeCare Publishes Diabetes Research",
            "Summary": "Jeena Sikho LifeCare releases case study and research article on Ayurvedic management of Type 2 diabetes mellitus in two international journals, showcasing the company's research capabilities in traditional medicine.",
            "Sentiment": "positive",
            "PublishDate": 1768209222363,
            "Source": "stocks"
        },
        {
            "Title": "Jeena Sikho Lifecare Publishes 9 Ayurvedic Studies",
            "Summary": "Jeena Sikho Lifecare Limited announces publication of 9 academic case studies and reports in medical journals, showcasing Ayurvedic treatments for diabetes, cancer, kidney disease and other conditions.",
            "Sentiment": "positive",
            "PublishDate": 1767783899892,
            "Source": "stocks"
        },
        {
            "Title": "Jeena Sikho Lifecare Gets NABH Accreditation",
            "Summary": "Jeena Sikho Lifecare Limited receives NABH accreditation for Panchakarma services at its Sanganer Hospital in Rajasthan, valid until November 2028, marking adherence to national healthcare quality standards.",
            "Sentiment": "positive",
            "PublishDate": 1767259442147,
            "Source": "stocks"
        },
        {
            "Title": "Jeena Sikho Lifecare Grants 2.19L Stock Options",
            "Summary": "Jeena Sikho Lifecare Limited granted 2,18,875 employee stock options to 1,176 eligible employees under ESOP 2025 scheme at exercise price of ₹2.00 per option on January 1, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767259022714,
            "Source": "stocks"
        },
        {
            "Title": "Jeena Sikho Lifecare Expands Niva Bupa Network",
            "Summary": "Jeena Sikho Lifecare Limited executes addendum with Niva Bupa Health Insurance, expanding empanelment to include additional hospital units across 20 locations nationwide with updated tariff terms.",
            "Sentiment": "positive",
            "PublishDate": 1766748434965,
            "Source": "stocks"
        },
        {
            "Title": "Jeena Sikho Lifecare Gets Medsave TPA Panel",
            "Summary": "Jeena Sikho Lifecare Limited's Ayurveda Panchkarma hospitals have been empanelled with Medsave Health Insurance TPA Limited as network healthcare provider for cashless treatment services.",
            "Sentiment": "positive",
            "PublishDate": 1766740091696,
            "Source": "stocks"
        },
        {
            "Title": "Jeena Sikho Lifecare Empanelled with Air India",
            "Summary": "Jeena Sikho Lifecare Limited's Ayurveda Panchkarma hospitals have been empanelled with Air India to provide cashless treatment services to employees and eligible beneficiaries across nine hospital locations.",
            "Sentiment": "positive",
            "PublishDate": 1766740028298,
            "Source": "stocks"
        },
        {
            "Title": "Jeena Sikho Lifecare Changes Internal Auditor",
            "Summary": "Jeena Sikho Lifecare Limited's board approved resignation of M/s Deepak K Garg Associates as Internal Auditor and appointed M/s. Forvis Mazars LLP for FY 2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1766500289220,
            "Source": "stocks"
        },
        {
            "Title": "Jeena Sikho Lifecare Reports 66% Revenue Growth in Q2FY26, Expands Bed Capacity to 2,802",
            "Summary": "Jeena Sikho Lifecare Limited reported strong quarterly results with revenue from operations reaching Rs. 190 crores in Q2FY26, marking a 66% year-on-year growth from Rs. 114 crores in Q2FY25 and 9% quarter-over-quarter growth from Rs. 174 crores in Q1FY26. The company's profit after tax surged 121% year-on-year to Rs. 59 crores, with a 15% quarter-over-quarter increase. EBITDA grew 129% year-on-year to Rs. 92 crores, maintaining a strong margin of 48%. The healthcare provider expanded its bed capacity by 582 beds, reaching a total of 2,802 beds with 57% occupancy rate across 58 hospitals and 59 clinics. The company operates in 23 states and 100+ cities. Jeena Sikho announced a strategic partnership with Chandan Diagnostic, providing access to 40 lakh privilege cardholders and establishing diagnostic centers across their network. The company is launching 10 new OTC products by year-end and has tied up with Salesforce for improved data management and customer engagement.",
            "Sentiment": "positive",
            "PublishDate": 1762956648297,
            "Source": "earnings"
        },
        {
            "Title": "Jeena Sikho Lifecare Expands Bed Capacity to 2,220 and Reports Strong Growth Across Services",
            "Summary": "Jeena Sikho Lifecare has increased its bed capacity to 2,220 with an additional 400 beds under development. The company reported significant growth in outpatient services (+67%), inpatient services (+57%), and daycare services (+169%). The company is focusing on the high-margin private sector and plans to launch 6 new Ayurvedic products. It is enhancing its digital infrastructure through a Salesforce partnership. The company maintains a 71% ROCE and has achieved a 47% three-year CAGR. It operates 46 NABH-accredited centres and aims to expand its Ayurvedic healthcare network nationwide using an asset-light strategy and AI efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1762447191371,
            "Source": "stock"
        },
        {
            "Title": "Jeena Sikho Lifecare Reports Strong Q2 Performance with 121% Net Profit Growth",
            "Summary": "Jeena Sikho Lifecare delivered robust quarterly results with net profit surging to 588 million rupees from 266 million rupees year-over-year, representing a 121% increase. Revenue grew significantly to 1.9 billion rupees compared to 1.14 billion rupees in the same period last year, marking a 67% growth. EBITDA more than doubled to 921 million rupees from 403 million rupees year-over-year. The company's EBITDA margin expanded substantially to 48.49% from 35.30% in the previous year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1762443692730,
            "Source": "earnings"
        },
        {
            "Title": "Jeena Sikho Lifecare Schedules Q2FY26 Earnings Conference Call",
            "Summary": "Jeena Sikho Lifecare Limited will host an earnings conference call on November 7, 2025, at 1:30 PM IST to discuss its operational and financial performance for Q2FY26. The call follows the company's board meeting for announcing financial results for the quarter ended September 30, 2025. Managing Director Manish Grover and Chief Financial Officer Nanak Chand will represent the management during the call. The company will provide dial-in numbers for investors and analysts, with audio/video recording and transcript to be made available later. The call details will be uploaded on the company's website at www.jeenasikho.com.",
            "Sentiment": "neutral",
            "PublishDate": 1762384522845,
            "Source": "corporate_action"
        },
        {
            "Title": "Jeena Sikho Lifecare Launches Pet-Yakrit-Pleeha Shuddhi Kit Nationwide",
            "Summary": "Jeena Sikho Lifecare Limited announced the national launch of its Pet Shuddhi product line during a press conference on October 13, 2025, in New Delhi. Managing Director Acharya Manish Ji officially launched the Pet-Yakrit-Pleeha Shuddhi Kit, an Ayurvedic detox product designed for cleansing stomach, liver, and spleen organs. The kit targets conditions including gas, indigestion, constipation, obesity, and liver weakness. The product is now available across India through the Jeena Sikho Hospitals Network. The launch attracted nationwide media attention with coverage across leading newspapers and news channels.",
            "Sentiment": "positive",
            "PublishDate": 1760449808931,
            "Source": "stock"
        },
        {
            "Title": "Jeena Sikho Partners with Chandan Healthcare in 5-Year Diagnostic Deal, Invests ₹42.12 Crores in Warrants",
            "Summary": "Jeena Sikho Lifecare Limited has entered into a five-year exclusive diagnostic collaboration agreement with Chandan Healthcare Limited. Under the partnership, Chandan will serve as the exclusive diagnostic partner for all healthcare services across Jeena Sikho's existing and future facilities. Chandan will establish and operate diagnostic centers within Jeena Sikho's hospitals, clinics, and wellness centers, investing in infrastructure, equipment, and manpower. Jeena Sikho will provide space, utilities, and recognize Chandan as its official diagnostic partner in branding materials. Additionally, Jeena Sikho's board approved subscribing to up to 18 lakh convertible warrants of Chandan Healthcare at ₹234 per warrant, totaling ₹42.12 crores. The warrants can be converted into equity shares within 18 months, with 25% payable at allotment and 75% at conversion.",
            "Sentiment": "positive",
            "PublishDate": 1760349037184,
            "Source": "order&deals"
        },
        {
            "Title": "Jeena Sikho Lifecare Limited Commences Operations at New 230-Bed Hospital in Maharashtra",
            "Summary": "Jeena Sikho Lifecare Limited has started operations at its new hospital in Raigad District, Maharashtra on September 23, 2025. The facility spans 7.9 acres and features 230 beds, 54 rooms, and 3 OPD units. The hospital is located at Prudence Estate, Survey No. 62/1/B, Village Karnala, Taluka-Panvel. This follows the company's earlier proposal for establishing the hospital that was announced in April 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758695025543,
            "Source": "stock"
        },
        {
            "Title": "Jeena Sikho Lifecare's Managing Director Receives 6th National Atal Award 2025 for Ayurveda Contributions",
            "Summary": "Acharya Manish Grover, Managing Director of Jeena Sikho Lifecare Limited, received the 6th National Atal Award 2025 in the Indian Ayurveda category. The award was presented on September 19, 2025, at a ceremony held at the Prime Minister Museum, Teen Murti, New Delhi by the Atal Foundation. The recognition was given for his extraordinary contribution in the field of National Service, particularly his efforts in revolutionizing Ayurveda-based industries, fostering employment generation, and contributing to India's global economic footprint.",
            "Sentiment": "positive",
            "PublishDate": 1758525735931,
            "Source": "stock"
        },
        {
            "Title": "Jeena Sikho Lifecare Incorporates Wholly Owned Subsidiary in UAE",
            "Summary": "Jeena Sikho Lifecare Limited has incorporated a wholly owned overseas subsidiary named Jeena Sikho International LLC under the Shams Authority in UAE. The subsidiary was incorporated on September 11, 2025, and received a business license valid until September 10, 2027. The company invested AED 100,000 through 100 shares of AED 1,000 each via cash consideration. The subsidiary will operate in the health and care industry, carrying on healthcare and related consultancy activities in UAE, aligned with the parent company's main business. Manish Grover serves as Director and Abraham Manu as General Manager of the new entity. The subsidiary is registered at Shams Business Center, Sharjah Media City Free Zone, UAE.",
            "Sentiment": "positive",
            "PublishDate": 1757675764998,
            "Source": "corporate_action"
        },
        {
            "Title": "Jeena Sikho Lifecare Partners with Salesforce and Quadrafort Technologies for Digital Transformation",
            "Summary": "Jeena Sikho Lifecare Limited has entered into partnerships with Salesforce and Quadrafort Technologies to implement digital changes in Ayurvedic healthcare operations.",
            "Sentiment": "positive",
            "PublishDate": 1757670595486,
            "Source": "stock"
        },
        {
            "Title": "Jeena Sikho Lifecare Limited Commences Operations at New 40-Bed Hospital in Jammu",
            "Summary": "Jeena Sikho Lifecare Limited has commenced operations of its new hospital in Jammu on September 11, 2025. The 40-bed facility spans 13,000 sq. ft. and includes 22 rooms and 2 OPDs. The hospital is located at W/No. 68 Greater Kailash Near Indian Oil Petrol Pump Tehsil Bahu, District Jammu. This follows the company's earlier proposal for establishing the hospital that was announced in April 2025.",
            "Sentiment": "positive",
            "PublishDate": 1757665907334,
            "Source": "stock"
        },
        {
            "Title": "Jeena Sikho Lifecare Receives Approval for Anti-Diabetes Clinical Trials on Four Products",
            "Summary": "Jeena Sikho Lifecare has received approval to conduct clinical trials on the anti-diabetes effects of four products: SDM02 Tablets, Shuddhi XS Syrup, Petshuddhi Churna, and Shuddhi Dr. B P Care Tablets. The trials showed strong effectiveness with no reported side effects.",
            "Sentiment": "positive",
            "PublishDate": 1757320843262,
            "Source": "stock"
        },
        {
            "Title": "Jeena Sikho Lifecare Plans New 25-Bed Hospital in Bihar with ₹60 Lakh Investment",
            "Summary": "Jeena Sikho Lifecare plans to open a new hospital in Bhagalpur, Bihar, in October 2025. The facility will feature 25 beds and requires an estimated investment of ₹60 lakhs, which will be funded from the company's own funds.",
            "Sentiment": "positive",
            "PublishDate": 1756978834878,
            "Source": "stock"
        },
        {
            "Title": "Jeena Sikho Lifecare's Ayurveda Hospitals Empanelled with GIPSA for Cashless Treatments",
            "Summary": "Jeena Sikho Lifecare Limited announced that its Ayurveda Panchkarma Hospitals in Derabassi and Chandigarh have been empanelled with the General Insurance Public Sector Association (GIPSA). GIPSA comprises four general insurance companies: New India Assurance Company Limited, National Insurance Company Limited, United India Insurance Company Limited, and Oriental Insurance Company Limited. The empanelment authorizes the hospitals to offer cashless Ayurveda Panchkarma treatments to beneficiaries of public sector insurance companies, subject to respective insurance policy terms and conditions. This facility enables eligible patients to receive treatment without upfront payment.",
            "Sentiment": "positive",
            "PublishDate": 1756966742869,
            "Source": "stock"
        },
        {
            "Title": "Jeena Sikho Lifecare Publishes Four Ayurvedic Case Studies on Liver Health and Diabetes Management",
            "Summary": "Jeena Sikho Lifecare Limited announced the publication of four Ayurvedic case studies by its medical professionals, including Managing Director Acharya Manish Grover. The studies focus on liver health restoration in hepatomegaly with fatty liver, tubal blockage management, early-stage Type 2 diabetes treatment, and liver disease management through diet and Panchakarma therapy. The research demonstrates Ayurvedic approaches to various health conditions, with case studies showing positive outcomes including normalized liver function tests, restored tubal patency, and improved diabetes markers. The studies were co-authored by multiple medical professionals associated with the company and highlight the company's commitment to advancing Ayurvedic research and evidence-based clinical practices.",
            "Sentiment": "positive",
            "PublishDate": 1756363994682,
            "Source": "stock"
        },
        {
            "Title": "Jeena Sikho Lifecare Appoints New COO, Approves Employee Stock Option Scheme and Board Changes",
            "Summary": "Jeena Sikho Lifecare Limited appointed Sahil Jain as Chief Operating Officer effective August 27, 2025. Jain brings over 8 years of experience at the company, having previously led IT, Marketing, Call Center Operations, and Administration departments, along with prior experience at IBM and HCL Australia. The Board approved an Employee Stock Option Scheme 2025 covering up to 250,000 stock options at an exercise price of Rs. 2 per share, subject to shareholder approval. The company redesignated Shreya Grover from Non-Executive Director to Whole-Time Director for a 5-year term. Grover, daughter of Managing Director Manish Grover, has been with the company since June 2021. The Board also appointed Ankur Singh & Associates as Secretarial Auditor for 5 years from FY 2025-26 to FY 2029-30, scheduled the 8th Annual General Meeting for September 29, 2025, and recommended a final dividend of Rs. 1.10 per equity share for the financial year ended March 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1756298286309,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jeena Sikho Lifecare Launches India's First Pet-Yakrit-Pleeha Shuddhi Kit for Triple Detoxification",
            "Summary": "Jeena Sikho Lifecare Limited organized a press conference on August 22, 2025 at Radisson Lucknow City Center to unveil India's first Pet-Yakrit-Pleeha Shuddhi Kit. The product is designed for triple detoxification of the gut, liver, and spleen. The event was addressed by Acharya Manish Ji and Dr. Neha. The company informed stock exchanges BSE and NSE about this product launch through a regulatory filing dated August 23, 2025. The kit incorporates over 20 years of research, clinical trials, and successful outcomes on patients, targeting lifestyle-related diseases from their root causes to treatment.",
            "Sentiment": "positive",
            "PublishDate": 1755955291099,
            "Source": "stock"
        },
        {
            "Title": "Jeena Sikho Lifecare Schedules Board Meeting to Consider Employee Stock Option Scheme 2025",
            "Summary": "Jeena Sikho Lifecare Limited has scheduled a Board of Directors meeting for August 27, 2025, at its registered office in Zirakpur, Punjab. The board will consider and approve a proposal for Employee Stock Option Scheme 2025 under SEBI regulations. The company trades on NSE under symbol JSLL and on BSE with scrip code 544476. The meeting agenda also includes consideration of other matters with the Chairperson's permission.",
            "Sentiment": "neutral",
            "PublishDate": 1755932556057,
            "Source": "corporate_action"
        },
        {
            "Title": "Jeena Sikho Lifecare Receives NABH Certification for Agra and Panchkula Hospital Facilities",
            "Summary": "Jeena Sikho Lifecare Limited has been awarded NABH certification for its hospital facilities in Agra and Panchkula. The Agra facility received certification for Panchakarma services, while the Panchkula facility was certified for Panchakarma, Kayachikitsa, Naturopathy, and Yoga treatments. Both certifications are valid until July 21, 2028. The company also made available the audio recording of their Q1 FY 2025-26 earnings conference call on their website. The earnings call was held on August 18, 2025, to discuss the financial results for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755596611229,
            "Source": "earnings"
        },
        {
            "Title": "Jeena Sikho Lifecare Reports 49.5% Revenue Growth and 62.8% Profit Jump in Q1 Results",
            "Summary": "Jeena Sikho Lifecare Limited reported strong quarterly results with total revenue from operations rising 49.5% to ₹5,665.97 lakhs compared to ₹3,790.1 lakhs in the same period last year. Net profit increased 62.8% to ₹1,291.06 lakhs from ₹792.76 lakhs previously. EBITDA margin improved to 30.9% from 28.3%, while earnings per share grew to ₹6.65 from ₹4.09. The healthcare and wellness company saw strong demand across online and offline channels, with new ayurvedic and herbal product launches contributing to growth. Distribution network expansion helped increase market penetration in Tier 2 and 3 cities. Managing Director Manish Grover expressed satisfaction with the performance across all business segments and optimism about the ayurveda market's long-term growth potential in India.",
            "Sentiment": "positive",
            "PublishDate": 1755321687892,
            "Source": "earnings"
        },
        {
            "Title": "Jeena Sikho Lifecare Reports Strong Q1 Results, Changes Statutory Auditors",
            "Summary": "Jeena Sikho Lifecare Limited reported unaudited quarterly financial results for the quarter ended June 30, 2025. The company posted revenue from operations of Rs. 17,428.59 lakhs and profit after tax of Rs. 5,131.14 lakhs, compared to Rs. 1,614.11 lakhs in the same quarter last year. Basic earnings per share stood at Rs. 4.13 (not annualized). The company's statutory auditors M/s KRA & Co. resigned effective August 14, 2025, citing the company's decision to appoint a global firm following its recent migration to the Main Board and investor suggestions. M/s Walker Chandiok & Co LLP was appointed as the new statutory auditor to fill the casual vacancy until the next AGM, with a proposed five-year term subject to shareholder approval. The company operates in trading of Ayurvedic medicines and providing Ayurvedic therapies. The company's equity shares migrated to the Main Board of BSE/NSE on August 11, 2025, from the NSE SME Emerge Platform.",
            "Sentiment": "positive",
            "PublishDate": 1755152602905,
            "Source": "earnings"
        },
        {
            "Title": "Jeena Sikho Lifecare Limited Publishes Six Medical Research Articles on Ayurvedic Treatments",
            "Summary": "Jeena Sikho Lifecare Limited announced the publication of six research and review articles authored by its medical professionals, including Managing Director Acharya Manish Grover. The articles focus on Ayurvedic treatments for various conditions including adenomyosis, chronic liver disease with diabetes, polycystic kidney disease, infertility, uterine fibroids, and diabetes management. The research demonstrates the company's commitment to advancing Ayurvedic research and evidence-based clinical practices. The articles were co-authored by multiple medical professionals associated with the company and cover case studies showing efficacy of Ayurvedic interventions in managing these health conditions.",
            "Sentiment": "positive",
            "PublishDate": 1755092964577,
            "Source": "stock"
        },
        {
            "Title": "Jeena Sikho Lifecare Receives Approval for Diabetes Tablet Clinical Trials",
            "Summary": "Jeena Sikho Lifecare has obtained approval to conduct clinical trials for a diabetes tablet called 'Shuddhi Dr. Madhumeh'. The tablet is intended for use by diabetic patients.",
            "Sentiment": "positive",
            "PublishDate": 1750923445000,
            "Source": "default"
        }
    ]
}