{
    "Symbol": "JSWCEMENT",
    "ISIN": "INE718I01012",
    "News": [
        {
            "Title": "JSW Cement Guides Mid-High Teen Volume Growth",
            "Summary": "JSW Cement management provides volume guidance of mid to high teens for next year, with North region expected to deliver higher growth rates during concall discussion.",
            "Sentiment": "positive",
            "PublishDate": 1770268005814,
            "Source": "stocks"
        },
        {
            "Title": "JSW Cement Reports Improved Demand and Pricing",
            "Summary": "JSW Cement management reports better demand and pricing trends in January compared to earlier months, with expectations for continued momentum through Q4, according to recent concall updates.",
            "Sentiment": "positive",
            "PublishDate": 1770267443405,
            "Source": "stocks"
        },
        {
            "Title": "JSW Cement Q3 Profit Surges to ₹1.4B from Loss",
            "Summary": "JSW Cement reported consolidated net profit of ₹1.4 billion in Q3 versus loss of ₹688 million year-on-year, with revenue growing 13.1% to ₹16.2 billion.",
            "Sentiment": "positive",
            "PublishDate": 1770217020611,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Cement Completes Sale of Algebra Endeavour",
            "Summary": "JSW Cement Limited has completed the transfer of 100% securities of Algebra Endeavour Private Limited to Nuvoco Vistas Corporation Limited under a Securities Purchase Agreement.",
            "Sentiment": "neutral",
            "PublishDate": 1770132371736,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Cement Board Meet on Feb 4 for Q3FY26 Results",
            "Summary": "JSW Cement Limited has scheduled its board meeting for February 4, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed from January 1-February 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769526393280,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Cement Seeks Shareholder Approval for Director Appointment via Postal Ballot",
            "Summary": "JSW Cement has initiated a postal ballot process to appoint Mr. Sudhir Maheshwari as Non-Executive Non-Independent Director, with e-voting open from November 28, 2025 to December 27, 2025. The appointment follows Maheshwari's recent resignation as Nominee Director after the company's IPO and stock exchange listing, with results expected by December 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764150482938,
            "Source": "corporate_action"
        },
        {
            "Title": "JSW Cement Reports Strong Q2 FY26 Performance with 14.9% Volume Growth and New Capacity Addition",
            "Summary": "JSW Cement achieved total volume sales of 3.11 million MT in Q2 FY26, up 14.9% year-on-year, with revenue rising 17.4% to Rs 1,436.4 crore and operating EBITDA improving 64.2% to Rs 267.5 crore. The company commissioned a 1.0 MTPA grinding unit in Sambalpur, Odisha in September 2025, expanding total grinding capacity to 21.60 MTPA as part of its pan-India expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1763057809592,
            "Source": "stock"
        },
        {
            "Title": "JSW Cement Acquires 26% Stake in JSW Green Energy Fifteen Limited with Power Purchase Agreement",
            "Summary": "JSW Cement has signed a deal to acquire a 26% stake in JSW Green Energy Fifteen Limited. The transaction includes a power purchase agreement between the two companies.",
            "Sentiment": "positive",
            "PublishDate": 1762877350959,
            "Source": "order&deals"
        },
        {
            "Title": "JSW Cement Reports Strong Q2 Growth But Shares Trade Below IPO Price as Lock-in Period Ends",
            "Summary": "JSW Cement delivered strong performance in Q2 FY26 with consolidated revenue rising 17.4% year-on-year to ₹1,436.43 crore and sales volumes increasing 15% to 3.11 million tonnes. The company swung to a net profit of ₹75.36 crore from a net loss of ₹75.82 crore in the previous year. Adjusted EBITDA jumped 114% to ₹267.52 crore, with EBITDA margin improving to 18.62% from 13.2% year-on-year, though down from 20.68% in the previous quarter due to lower realisations. Raw material costs declined due to reduced slag purchases from third-party suppliers. Net debt decreased to ₹3,231 crore from ₹4,566 crore, primarily due to IPO proceeds. The company's Nagaur integrated unit with 3.5 mtpa capacity is on track for commissioning by early Q4 FY26. JSW Cement aims for pan-India presence with 41.85 mtpa grinding capacity and targets 34 mtpa by 2028. About 3.67 crore shares representing 3% of outstanding equity become eligible for trading as the three-month shareholder lock-in period ends. Shares currently trade at ₹128, below the IPO issue price of ₹147, with the stock hitting a post-listing low of ₹125.07.",
            "Sentiment": "neutral",
            "PublishDate": 1762740588615,
            "Source": "earnings"
        },
        {
            "Title": "JSW Cement Reports Strong Q2 Turnaround with 864 Million Rupees Net Profit",
            "Summary": "JSW Cement delivered a significant turnaround in its quarterly results, posting a consolidated net profit of 864 million rupees compared to a loss of 644 million rupees in the same period last year. Revenue grew to 14.4 billion rupees from 12.2 billion rupees year-over-year. The company's EBITDA more than doubled to 2.7 billion rupees from 1.25 billion rupees, while EBITDA margin expanded substantially to 18.58% from 10.21% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762733553950,
            "Source": "earnings"
        },
        {
            "Title": "JSW Cement and Two Other Companies See ₹821 Crore Worth of Shares Freed from Lock-In Period",
            "Summary": "Three companies - JSW Cement, All Time Plastics, and Fusion Finance - had their shareholder lock-in periods end on November 10, freeing up shares worth ₹821 crore for potential trading. JSW Cement released 3.67 crore shares (3% of outstanding equity) after a three-month lock-in, with shares trading below their ₹147 IPO price and hitting a post-listing low of ₹125.07. All Time Plastics freed up 22 lakh shares (3% of outstanding equity) worth ₹67 lakh, with shares trading at ₹305, above their ₹275 IPO price after gaining 12% in the past month. Fusion Finance released 2.01 crore shares (20% of outstanding equity) worth ₹350 crore after an 18-month lock-in period, with shares trading 52% below their ₹368 IPO price. Two of the three companies are currently trading below their issue prices.",
            "Sentiment": "neutral",
            "PublishDate": 1762732921825,
            "Source": "stock"
        },
        {
            "Title": "JSW Cement to Acquire 26% Stake in JSW Green Energy for Solar Power Supply",
            "Summary": "JSW Cement plans to purchase a 26% stake in JSW Green Energy as part of a new agreement for solar power supply.",
            "Sentiment": "positive",
            "PublishDate": 1762530578195,
            "Source": "order&deals"
        },
        {
            "Title": "JSW Cement to Transfer Securities from Algebra Endeavour to Nuvoco Vistas",
            "Summary": "JSW Cement announced it will transfer securities from Algebra Endeavour to Nuvoco Vistas. The announcement provides details about a securities transfer transaction involving these three entities.",
            "Sentiment": "neutral",
            "PublishDate": 1762528230382,
            "Source": "order&deals"
        },
        {
            "Title": "JSW Cement Reports Strong Q2 Turnaround with 864M Rupees Net Profit",
            "Summary": "JSW Cement delivered a significant turnaround in its quarterly results, reporting a net profit of 864 million rupees compared to a loss of 644 million rupees in the same period last year. Revenue grew to 14.4 billion rupees from 12.2 billion rupees year-over-year. The company's EBITDA increased substantially to 2.7 billion rupees from 1.25 billion rupees, while EBITDA margin improved to 18.58% from 10.21% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762526242871,
            "Source": "earnings"
        },
        {
            "Title": "JSW Cement Non-Executive Director Utsav Baijal Resigns Following Company's IPO",
            "Summary": "Utsav Baijal has resigned from his position as Non-Executive Nominee Director on JSW Cement Limited's Board of Directors, effective from the close of business hours on November 4, 2025. His resignation follows the company's recent Initial Public Offering and subsequent stock exchange listing. Baijal's appointment was originally made under a Shareholders Agreement dated July 27, 2021, involving Adarsh Advisory Services Private Limited, AP Asia Opportunistic Holdings Pte. Ltd., and JSW Cement. Under the terms of an Amendment and Waiver Agreement dated August 12, 2024, and following the company's IPO, his continued role as Nominee Director is no longer applicable. He will also cease to be a member of various Board Committees from the same date.",
            "Sentiment": "neutral",
            "PublishDate": 1762275810731,
            "Source": "corporate_governance"
        },
        {
            "Title": "JSW Cement Schedules Results Conference Call for Q2 FY26 Financial Results",
            "Summary": "JSW Cement Limited has scheduled a results conference call for Monday, November 10, 2025, at 10:00 AM IST to discuss its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company's Board of Directors meeting is set for November 7, 2025, to consider these financial results. The conference call will be hosted by JM Financial Institutional Securities Limited and will feature key company participants including CEO Nilesh Narwekar, CFO Narinder Singh Kahlon, Chief Marketing Officer Hitendra Jariwala, and Head of Investor Relations Kunal Mukherjee. The call transcript will be made available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1761907963400,
            "Source": "earnings"
        },
        {
            "Title": "JSW Cement Receives Credit Rating Upgrades from Crisil Ratings",
            "Summary": "JSW Cement Limited received credit rating upgrades from Crisil Ratings Limited across multiple financial instruments. The company's bank loan facility of ₹5,800 crore was upgraded to Crisil AA-/Stable. Short-term debt of ₹110 crore and commercial paper of ₹100 crore were both upgraded to Crisil A1+. The rating upgrades were communicated to stock exchanges BSE and NSE, with the company trading under scrip code 544480 on BSE and symbol JSWCEMENT on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1761857136316,
            "Source": "corporate_action"
        },
        {
            "Title": "JSW Cement Subsidiary Shiva Cement Gets Credit Rating Revision from Crisil",
            "Summary": "JSW Cement Limited informed stock exchanges that its subsidiary Shiva Cement Limited has received a credit rating revision from Crisil Ratings Limited. The rating agency reviewed credit ratings for bank loan facilities worth Rs 86 crore, assigning Crisil AA- ratings across different instrument types. Both companies notified BSE and NSE about the rating update, with detailed rating rationale available on Crisil's website.",
            "Sentiment": "neutral",
            "PublishDate": 1761841491124,
            "Source": "corporate_action"
        },
        {
            "Title": "JSW Cement Director Sudhir Maheshwari Resigns Following Company's IPO and Stock Exchange Listing",
            "Summary": "Sudhir Maheshwari has resigned from his position as Non-Executive Nominee Director on JSW Cement Limited's Board of Directors, effective from the close of business hours on October 24, 2025. His resignation follows the company's recent Initial Public Offering and subsequent listing on stock exchanges. Maheshwari's appointment was originally made under a Shareholders Agreement dated June 22, 2021, involving Adarsh Advisory Services Private Limited, Synergy Metals Investments Holding Limited and JSW Cement. According to an Amendment and Waiver Agreement dated August 12, 2024, his role as Nominee Director became no longer applicable following the IPO. He will also cease to be a member of various Board Committees from the same date.",
            "Sentiment": "neutral",
            "PublishDate": 1761320245277,
            "Source": "corporate_governance"
        },
        {
            "Title": "JSW Cement Launches 1.0 MTPA Grinding Unit in Odisha, Total Capacity Reaches 21.6 MTPA",
            "Summary": "JSW Cement has launched a new cement grinding unit in Sambalpur, Odisha, with a capacity of 1.0 MTPA. This expansion brings the company's total grinding capacity to 21.6 MTPA. The company aims to strengthen its market position in Eastern India through this facility.",
            "Sentiment": "positive",
            "PublishDate": 1759897630559,
            "Source": "stock"
        },
        {
            "Title": "JSW Cement Faces 37 Million Share Unlock Worth $62 Million",
            "Summary": "JSW Cement will see 37 million shares, representing 3% of outstanding equity and valued at $62 million, become available for trading as the one-month shareholder lock-in period expires. The unlock represents the largest among peers in September. Lock-in periods prevent promoters, anchor investors, and institutional participants from selling shares immediately after listing to ensure stock stability and investor confidence. The expiry can increase market liquidity by bringing more shares into circulation, but may also create downward pressure if significant numbers of investors choose to exit their positions, potentially leading to short-term volatility.",
            "Sentiment": "neutral",
            "PublishDate": 1757557912299,
            "Source": "stock"
        },
        {
            "Title": "JSW Cement Shareholder Lock-in Period Ends September 11, Freeing 36.7 Million Shares",
            "Summary": "JSW Cement will see 36.7 million shares (3% of outstanding equity) become eligible for trading when the shareholder lock-in period expires on September 11. The freed shares are valued at ₹553 crore at current market prices. The company debuted on August 14 at a 4% premium to its ₹147 issue price, opening at ₹153 and reaching ₹154.70, giving it a market valuation of ₹20,914 crore. Managing Director Parth Jindal stated the company ranks as the seventh-largest cement company by market capitalization post-listing, with ambitions to reach the top two in the industry. Shares closed 1.11% lower at ₹150.60 on Friday.",
            "Sentiment": "neutral",
            "PublishDate": 1757235777845,
            "Source": "stock"
        },
        {
            "Title": "JSW Cement Reports Multi-fold Jump in Quarterly Profit to Rs 164.74 Crore, Revenue Rises 7.8%",
            "Summary": "JSW Cement reported a profit before exceptional items and tax of Rs 164.74 crore for the quarter ended June 2025, compared to Rs 8.14 crore in the same quarter last year. However, the company posted an overall loss of Rs 1,366.41 crore due to exceptional items related to the conversion of 16 crore Compulsory Convertible Preference Shares into 23.56 crore equity shares, resulting in a valuation difference of Rs 1,466.38 crore. Revenue from operations increased 7.77% to Rs 1,559.82 crore from Rs 1,447.23 crore year-over-year. Total expenses decreased 1% to Rs 1,417.26 crore. This marks the first quarterly results since JSW Cement's listing on August 14, 2025. The company operates with a capacity of 20 million tonnes per annum and is part of the $23 billion JSW Group. Shares closed at Rs 153.65 on BSE, up 1.29%.",
            "Sentiment": "positive",
            "PublishDate": 1756829714139,
            "Source": "earnings"
        },
        {
            "Title": "JSW Cement Reports Strong Q1 Performance with Improved EBITDA Margins",
            "Summary": "JSW Cement reported Q1 EBITDA of 3.23 billion rupees compared to 2 billion rupees in the same period last year. The company's EBITDA margin improved to 20.69% from 13.81% year-over-year. The company also recorded an exceptional item of 14.66 billion rupees during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1756821277762,
            "Source": "earnings"
        },
        {
            "Title": "JSW Cement Reports Significant Increase in Quarterly Net Loss Despite Revenue Growth",
            "Summary": "JSW Cement reported a consolidated net loss of 13.56 billion rupees in Q1, substantially higher than the 151 million rupees loss in the same period last year. The company's revenue increased to 15.6 billion rupees from 14.47 billion rupees year-over-year, showing growth in the top line despite the widened losses.",
            "Sentiment": "negative",
            "PublishDate": 1756820909800,
            "Source": "earnings"
        }
    ]
}