{
    "Symbol": "JSWENERGY",
    "ISIN": "INE121E01018",
    "News": [
        {
            "Title": "JSW Energy Completes ₹1728 Cr Tidong Power Acquisition",
            "Summary": "JSW Neo Energy Limited completes acquisition of Tidong Power Generation Private Limited from Statkraft for ₹1728 crores. The 150 MW hydro project in Himachal Pradesh is expected to commission in Oct-26.",
            "Sentiment": "positive",
            "PublishDate": 1769704254874,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Energy Explores Nuclear Power Expansion Plans",
            "Summary": "JSW Energy announces strategic exploration of large nuclear reactors from India and international sources as part of ambitious nuclear portfolio development initiative.",
            "Sentiment": "positive",
            "PublishDate": 1769582250312,
            "Source": "stocks"
        },
        {
            "Title": "JSW Energy Block Trade Worth Rs. 45.07 Crores on NSE",
            "Summary": "JSW Energy witnessed a significant block trade on NSE involving 1,014,248 shares worth Rs. 45.07 crores at Rs. 444.40 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769575751622,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Energy Sees Rs. 45.58 Crore Block Trade on NSE",
            "Summary": "JSW Energy witnessed a significant block trade worth Rs. 45.58 crores on NSE involving 1,029,652 shares at Rs. 442.65 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769572783923,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Energy Block Trade Worth Rs. 33.25 Crores on NSE",
            "Summary": "JSW Energy witnessed a significant block trade on NSE involving 770,229 shares valued at Rs. 33.25 crores, executed at Rs. 431.65 per share, indicating institutional interest in the power sector stock.",
            "Sentiment": "neutral",
            "PublishDate": 1769499604447,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Energy Expects Slower Renewable Bids Activity",
            "Summary": "JSW Energy anticipates reduced activity in renewable energy bidding due to 40 GW of pending agreements and expected connectivity challenges from FY27.",
            "Sentiment": "neutral",
            "PublishDate": 1769485752598,
            "Source": "stocks"
        },
        {
            "Title": "JSW Energy Plans 1.5 GW Capacity Addition in H2 FY26",
            "Summary": "JSW Energy expects declining interest costs as bank loans adjust and anticipates continued growth in energy generation and cash flow. The company targets adding 1.5 GW capacity in H2 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1769485353652,
            "Source": "stocks"
        },
        {
            "Title": "JSW Energy Targets 40 GWh Storage Capacity by 2030",
            "Summary": "JSW Energy aims to exceed 30 GW power generation and achieve 40 GWh storage by 2030, with 18.7 GW generation and 29.6 GWh storage secured. Open capacity expected to drop from 8% to 5% by April 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769485200468,
            "Source": "stocks"
        },
        {
            "Title": "JSW Energy Q3 Net Profit Surges 151% to ₹4.2B",
            "Summary": "JSW Energy reports consolidated net profit of ₹4.20 billion in Q3, up 151% YoY from ₹1.67 billion. Revenue jumps 70% to ₹40.80 billion versus ₹24.00 billion in previous year.",
            "Sentiment": "positive",
            "PublishDate": 1769177019431,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Energy Gets NCLT Nod for Raigarh Rail Infra Plan",
            "Summary": "JSW Energy Limited receives National Company Law Tribunal approval for its resolution plan for Raigarh Champa Rail Infrastructure Private Limited, following earlier Committee of Creditors approval.",
            "Sentiment": "positive",
            "PublishDate": 1769063639185,
            "Source": "co_actions_results"
        },
        {
            "Title": "Morgan Stanley Sets ₹693 Target for JSW Energy",
            "Summary": "Morgan Stanley maintains Overweight rating on JSW Energy with target price of ₹693, signaling positive outlook for the power generation company's stock performance.",
            "Sentiment": "positive",
            "PublishDate": 1768967543079,
            "Source": "stocks"
        },
        {
            "Title": "JSW Energy Secures Second 1,600 MW Thermal PPA",
            "Summary": "JSW Energy's subsidiary signs second Power Purchase Agreement with West Bengal DISCOM for 1,600 MW thermal power plant at Salboni, expanding total site capacity to 3,200 MW and secured thermal capacity to 10.7 GW.",
            "Sentiment": "positive",
            "PublishDate": 1768917246187,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Energy Gets Stock Exchange Approval for ₹750 Cr Issue",
            "Summary": "JSW Energy Limited receives in-principle approval from BSE and NSE for preferential issuance of 95.24 lakh equity shares and 4.76 crore convertible warrants to promoter group entity JTPM Metal Traders Limited.",
            "Sentiment": "positive",
            "PublishDate": 1768903198976,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Energy Q3FY26 Results Call on Jan 23, 2026",
            "Summary": "JSW Energy Limited announces earnings conference call scheduled for January 23, 2026 at 7:00 PM IST to discuss Q3FY26 financial results. Senior management including Joint MD & CEO will participate.",
            "Sentiment": "neutral",
            "PublishDate": 1768838837504,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Energy breaks inverse head & shoulder pattern",
            "Summary": "JSW Energy breaks out from inverse head & shoulder pattern on daily charts, trading above neckline despite recent dip. Experts suggest buying opportunities with targets of ₹500-550 in coming weeks.",
            "Sentiment": "positive",
            "PublishDate": 1768834236252,
            "Source": "stocks"
        },
        {
            "Title": "JSW Energy Secures Turbine Supply for 1,600 MW Plant",
            "Summary": "JSW Thermal Energy Limited enters contract with Toshiba JSW Power Systems for two 800 MW steam turbine generators for Salboni thermal project in West Bengal, strengthening supply chain control.",
            "Sentiment": "positive",
            "PublishDate": 1768487645219,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Energy Secures Turbine Supply for 1,600 MW Plant",
            "Summary": "JSW Energy's subsidiary signs contract with Toshiba JSW for two 800 MW steam turbine generators for Salboni thermal project in West Bengal, strengthening supply chain control.",
            "Sentiment": "positive",
            "PublishDate": 1768486148513,
            "Source": "co_actions_results"
        },
        {
            "Title": "Motilal Oswal Sets ₹657 Target for JSW Energy",
            "Summary": "Motilal Oswal maintains BUY rating on JSW Energy with ₹657 target price, citing strong execution capabilities and renewable pipeline growth. Company doubled capacity to 13.2GW.",
            "Sentiment": "positive",
            "PublishDate": 1768203942112,
            "Source": "stocks"
        },
        {
            "Title": "JSW Energy faces MSEDCL appeal in electricity dispute",
            "Summary": "MSEDCL has filed an appeal against MERC's December 2025 order that favored JSW Energy and rejected the petition to quash company invoices, escalating the dispute to appellate level.",
            "Sentiment": "neutral",
            "PublishDate": 1768026804089,
            "Source": "stocks"
        },
        {
            "Title": "JSW Energy Subsidiary Gets CARE A Credit Rating",
            "Summary": "JSW Energy's step-down subsidiary O2 Renewable Energy VII Private Limited receives 'CARE A; Stable' rating for long-term bank facilities from Care Ratings Limited on January 5, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767692562122,
            "Source": "stocks"
        },
        {
            "Title": "JSW Energy Subsidiary Gets IND A Credit Rating",
            "Summary": "JSW Renew Energy Seventeen Limited, a step-down subsidiary of JSW Energy, receives 'IND A/Stable/IND A1' credit rating from India Ratings for long-term bank facilities on December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767199682556,
            "Source": "stocks"
        },
        {
            "Title": "JSW Energy Subsidiary Gets IND A/Stable Rating",
            "Summary": "India Ratings assigns 'IND A/Stable' credit rating to XL Xergi Power Private Limited, a step-down subsidiary of JSW Energy Limited, for its long-term bank facilities on December 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767100902242,
            "Source": "stocks"
        },
        {
            "Title": "JSW Energy schedules analyst meet for Jan 7-8, 2026",
            "Summary": "JSW Energy Limited announces analyst and institutional investor meeting scheduled for January 7-8, 2026 at Vijayanagar, Karnataka as per SEBI Listing Regulations compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1767021650862,
            "Source": "stocks"
        },
        {
            "Title": "JSW Energy Subsidiaries Get IND A/Stable Ratings",
            "Summary": "India Ratings assigns IND A/Stable credit ratings to three O2 Renewable Energy subsidiaries of JSW Energy for their long-term bank facilities on December 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765953364819,
            "Source": "stocks"
        },
        {
            "Title": "CLSA Upgrades JSW Energy to Hold, Sets ₹486 Target",
            "Summary": "CLSA has upgraded JSW Energy from its previous rating to 'Hold' with a target price of ₹486 per share, reflecting improved outlook for the power generation company.",
            "Sentiment": "positive",
            "PublishDate": 1765770061173,
            "Source": "stocks"
        },
        {
            "Title": "JSW Energy EGM Passes All Resolutions Successfully",
            "Summary": "JSW Energy's EGM on January 3, 2026 successfully approved ₹3,000 crore preferential issue, ₹10,000 crore fundraising authorization, and material related party transactions with overwhelming shareholder support.",
            "Sentiment": "positive",
            "PublishDate": 1765530232049,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Energy Signs 400 MW PPA with Karnataka DISCOMs",
            "Summary": "JSW Energy's Utkal subsidiary has signed a 25-year power purchase agreement for 400 MW with Karnataka distribution companies at ₹3.58/kWh tariff, starting April 2026.",
            "Sentiment": "positive",
            "PublishDate": 1765525008959,
            "Source": "stocks"
        },
        {
            "Title": "JSW Energy's Subsidiary Clean Solar Power (Bhainsada) Gets CARE AA Stable Rating Reaffirmation",
            "Summary": "CARE Ratings Limited reaffirmed the CARE AA Stable rating for long-term bank facilities of Clean Solar Power (Bhainsada) Private Limited, a step-down subsidiary of JSW Energy Limited. The rating reaffirmation indicates maintained creditworthiness and financial stability for the solar power subsidiary's banking arrangements.",
            "Sentiment": "positive",
            "PublishDate": 1765293978517,
            "Source": "stock"
        },
        {
            "Title": "JSW Energy Schedules Board Meeting to Discuss Fundraising Plans",
            "Summary": "JSW Energy has scheduled a board meeting for December 12 to discuss plans for raising funds. The meeting indicates the company's intention to explore capital raising options, which could impact shareholders and the company's financial structure.",
            "Sentiment": "neutral",
            "PublishDate": 1765291223401,
            "Source": "corporate_action"
        },
        {
            "Title": "JSW Energy Sees Rs. 680.16 Crore Block Trade on NSE",
            "Summary": "JSW Energy witnessed a significant block trade worth Rs. 680.16 crores involving 15,284,419 shares executed at Rs. 445.00 per share on the NSE. The large-scale transaction indicates substantial institutional or bulk investor activity in the power company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1765254954535,
            "Source": "order&deals"
        },
        {
            "Title": "JSW Energy's Resolution Plan for Rail Infrastructure Company Approved",
            "Summary": "JSW Energy's resolution plan for Raigarh Champa Rail Infrastructure Private Limited (RCRIPL) has been approved under the Corporate Insolvency Resolution Process. The approval allows JSW Energy to proceed with its proposed resolution for the distressed rail infrastructure company.",
            "Sentiment": "positive",
            "PublishDate": 1763678867436,
            "Source": "order&deals"
        },
        {
            "Title": "JSW Energy Finance Director Pritesh Vinay Resigns",
            "Summary": "Pritesh Vinay has resigned from his position as Director (Finance) at JSW Energy to pursue opportunities outside the group. The departure affects the company's senior financial leadership structure.",
            "Sentiment": "neutral",
            "PublishDate": 1763422546569,
            "Source": "corporate_governance"
        },
        {
            "Title": "CARE Ratings Reaffirms Credit Ratings for JSW Energy's Step-Down Subsidiary O2 Power",
            "Summary": "CARE Ratings Limited has assigned and reaffirmed credit ratings for O2 Power Private Limited's banking facilities totaling Rs. 3,100 crore, with short-term facilities rated CARE A1+ and long-term facilities rated CARE A+. The rating action affects O2 Power Private Limited, a step-down subsidiary of JSW Energy Limited, with short-term bank facilities enhanced from Rs. 2,000 crore to Rs. 2,395 crore.",
            "Sentiment": "positive",
            "PublishDate": 1763049860267,
            "Source": "corporate_action"
        },
        {
            "Title": "JSW Energy Allots Rs 250 Crore Non-Convertible Debentures",
            "Summary": "JSW Energy Limited has allotted 25,000 unsecured, listed, rated, taxable, redeemable Non-Convertible Debentures with a face value of Rs 1 lakh each, totaling Rs 250 crores. The debentures will be listed on BSE Limited. The coupon/interest payment schedule is set for November 12, 2026, November 12, 2027, and November 10, 2028, with redemption scheduled for November 10, 2028. The debentures will be redeemed at par value. This allotment is part of the company's previously approved plan to raise funds up to Rs 3,000 crores through various instruments including NCDs on a private placement basis.",
            "Sentiment": "neutral",
            "PublishDate": 1762974050267,
            "Source": "corporate_action"
        },
        {
            "Title": "JSW Energy Subsidiaries Receive Credit Rating Reaffirmations from ICRA",
            "Summary": "ICRA Limited reaffirmed credit ratings for three step-down subsidiaries of JSW Energy Limited. Mytrrah Agriya Power Private Limited received an ICRA A- rating with Stable outlook, while JSW Aakash Power Private Limited and JSW Abhinav Power Private Limited both received ICRA A- ratings with Stable outlook. The rating actions were announced on November 11, 2025, with detailed press releases available on ICRA's website.",
            "Sentiment": "positive",
            "PublishDate": 1762909910860,
            "Source": "stock"
        },
        {
            "Title": "JSW Energy Commissions India's Largest Green Hydrogen Plant in Karnataka",
            "Summary": "JSW Energy Limited has commissioned its first green hydrogen manufacturing plant at JSW Steel facility in Vijayanagar, Karnataka. The plant will supply 3,800 tons per annum of green hydrogen and 30,000 tons per annum of green oxygen to JSW Steel for low-carbon steel production under a seven-year offtake agreement. The project operates under the Production Linked Incentive Scheme and is part of JSW Energy's 6,800 TPA allocation under the Strategic Interventions for Green Hydrogen Transition (SIGHT) program by Solar Energy Corporation of India. JSW Energy has also signed a memorandum of understanding with JSW Steel to progressively supply 85,000-90,000 TPA of green hydrogen and 720,000 TPA of green oxygen by 2030. The company currently has 13.3 GW operational capacity and aims to reach 30 GW generation capacity by FY2030.",
            "Sentiment": "positive",
            "PublishDate": 1762831762178,
            "Source": "stock"
        },
        {
            "Title": "Supreme Court Denies JSW Energy's Request to Pause APTEL Decision on CERC Tariff Ruling",
            "Summary": "The Supreme Court has denied JSW Energy's request to pause an APTEL decision that supports a CERC ruling regarding the company. The case involves CERC's decision on tariff for JSW Energy's 1000 MW BESS (Battery Energy Storage System) project. The Supreme Court will hear JSW Energy's appeal concerning this tariff decision.",
            "Sentiment": "negative",
            "PublishDate": 1762766816315,
            "Source": "stock"
        },
        {
            "Title": "JSW Energy Commissions 85 MW Renewable Capacity, Total Installed Capacity Reaches 13.3 GW",
            "Summary": "JSW Energy Limited has commissioned 85 MW of renewable energy capacity, comprising 74 MW of solar capacity (including part of NHPC Hybrid Project) and 11 MW of wind capacity. This brings the company's total installed capacity to 13,295 MW. Renewables now constitute 57% of the overall capacity, with wind at 3,720 MW, solar at 2,286 MW, and hydro at 1,631 MW. The company has locked-in generation capacity of 30.5 GW, including 13.3 GW operational, 12.5 GW under construction across thermal and renewable, 150 MW under-acquisition hydro, and a pipeline of 4.6 GW. JSW Energy also has 29.4 GWh of locked-in energy storage capacity through hydro pumped storage projects of 26.4 GWh and battery energy storage systems of 3.0 GWh. The company targets 30 GW generation capacity and 40 GWh energy storage capacity by FY2030, aiming for carbon neutrality by 2050.",
            "Sentiment": "positive",
            "PublishDate": 1762745252115,
            "Source": "stock"
        },
        {
            "Title": "JSW Renewable Energy (Dolvi) Limited Receives IND A4/Stable Rating for Long-Term Bank Loan Facilities",
            "Summary": "India Ratings and Research has assigned a rating of IND A4/Stable to the Long-Term Bank Loan facilities of JSW Renewable Energy (Dolvi) Limited, a step-down subsidiary of JSW Energy Limited. The rating was assigned on October 30, 2025, with the press release available on India Ratings' website.",
            "Sentiment": "neutral",
            "PublishDate": 1761848582345,
            "Source": "corporate_action"
        },
        {
            "Title": "JSW Energy Plans 5-GWh Battery Assembly Plant in Pune for Third Quarter",
            "Summary": "JSW Energy plans to operationalise its 5-GWh battery assembly plant in Pune, Maharashtra, in the third quarter. Joint Managing Director and CEO Sharad Mahendra announced that trial runs for the green hydrogen project with 3,800 tonnes per annum capacity at Vijayanagar are near complete. The battery facility will support Battery Energy Storage Systems and help meet domestic content requirements when mandated. JSW Energy reported 59% year-on-year revenue growth to Rs 5,361 crore in the July-September period, up from Rs 3,459 crore. However, consolidated net profit declined 17% year-on-year to Rs 705 crore compared to Rs 853 crore in the previous quarter. The company has locked-in storage capacity of 29.4 GWh with agreements for 25.2 GWh, targeting 30 GW generation capacity and 40 GWh storage by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1761458913976,
            "Source": "stock"
        },
        {
            "Title": "JSW Energy Reports 67% EBITDA Growth in Q2 FY26, Adds 5.5 GW Capacity Over 12 Months",
            "Summary": "JSW Energy delivered strong quarterly results with net generation rising 52% year-on-year to 14.9 billion units in Q2 FY26. Total revenue increased 55% to over Rs. 5,300 crores while EBITDA grew 67% to Rs. 3,200 crores. The company's installed capacity reached 13.2 GW, representing 71% year-on-year growth from 7.74 GW. Over the past 12 months, JSW Energy added 5.5 GW of capacity including 3.3 GW renewables and 1.8 GW thermal through acquisitions of KSK and O2 Power plus organic additions. Key developments include commissioning of 240 MW Kutehr hydro project, acquiring GE Power India's boiler manufacturing business, and signing agreement to acquire 150 MW Tidong Hydro Power Plant for Rs. 1,728 crore. The company received a 400 MW LOA for its UTKAL plant at Rs. 5.78 per unit tariff, reducing merchant exposure from 8% to 5%. Net debt stood at Rs. 62,000 crores with debt-to-EBITDA ratio at 5x. JSW Energy maintains its target of exceeding 15 GW capacity by fiscal year-end and 30 GW by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1761140329961,
            "Source": "earnings"
        },
        {
            "Title": "JSW Energy Plans Higher Second Half Investments, Targets 15 GW Capacity by Year-End",
            "Summary": "JSW Energy expects to increase investments in the second half due to slower progress in the first half caused by an extended monsoon season. The company has set its hurdle rate for project returns at mid to high teen IRR. JSW Energy anticipates surpassing 15 gigawatts of installed capacity by fiscal year-end. The company has planned capital spending of INR 130,000 crores by 2030 to achieve 30 gigawatts capacity and 40 gigawatt hours of energy storage.",
            "Sentiment": "positive",
            "PublishDate": 1760931727407,
            "Source": "stock"
        },
        {
            "Title": "JSW Energy Plans Major Capacity Expansion to 14-20 GW by FY30 with 70% Renewable Focus",
            "Summary": "JSW Energy has projected significant capacity growth targeting 14 GW to 20 GW by FY30. The company plans to achieve a 70% renewable energy mix and expects margin expansion through strategic initiatives including Mahanadi, O2 Power, and battery storage integration.",
            "Sentiment": "positive",
            "PublishDate": 1760718501004,
            "Source": "stock"
        },
        {
            "Title": "JSW Energy Reports 67% YoY EBITDA Growth to ₹3,180 Cr in Q2 FY26, Driven by Capacity Additions",
            "Summary": "JSW Energy Limited reported strong quarterly results for Q2 FY26 ended September 30, 2025. EBITDA increased 67% YoY to ₹3,180 crore, while H1 FY26 EBITDA grew 79% YoY to ₹6,237 crore. Total revenue rose 55% YoY to ₹5,361 crore. Net generation increased 52% YoY from 9.8 BUs to 14.9 BUs, driven by organic renewable capacity additions and contributions from Mahanadi plant and O2 Power acquisition. However, reported PAT declined 17% YoY to ₹705 crore in Q2, though it grew 5% YoY in H1 FY26 to ₹1,448 crore. Cash PAT increased 27% YoY to ₹1,512 crore for the quarter. The company added 443 MW of organic renewable capacity during the quarter, including the 240 MW Kutehr Hydroelectric Project. Installed capacity reached 13,211 MW, up 71% YoY. Net debt stood at ₹61,960 crore with a debt-to-equity ratio of 2.1x. The company maintains a locked-in generation capacity of 30.5 GW and targets 30 GW generation capacity by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1760705354245,
            "Source": "earnings"
        },
        {
            "Title": "JSW Energy Subsidiary Secures 400 MW Power Supply Contract Worth 25 Years",
            "Summary": "JSW Energy (Utkal) Limited received a letter of award from Power Company of Karnataka Limited for a 400 MW power supply arrangement spanning 25 years, commencing April 1, 2026. The coal will be sourced from Coal India Limited under the SHAKTI Scheme 2017. Once regulatory approval is obtained and the Power Purchase Agreement is signed, this contract will secure 57% of Utkal's total capacity, providing long-term earnings stability. JSW Energy currently has 30.5 GW of total locked-in generation capacity, including 13.2 GW operational and 12.5 GW under construction across thermal and renewable sources. The company targets reaching 30 GW generation capacity and 40 GWh energy storage capacity by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1760627273691,
            "Source": "stock"
        },
        {
            "Title": "JSW Energy Adds 114 MW Capacity in September, Reaches 13.2 GW Total Installed Capacity",
            "Summary": "JSW Energy expanded its power generation capacity by 114 MW during September. Following this addition, the company's total installed capacity has reached 13.2 GW.",
            "Sentiment": "positive",
            "PublishDate": 1759580439761,
            "Source": "stock"
        },
        {
            "Title": "JSW Energy Subsidiary Files Supreme Court Appeal in Electricity Regulatory Dispute",
            "Summary": "JSW Renew Energy Five Limited, a step-down subsidiary of JSW Energy Limited, has filed a Civil Appeal with the Supreme Court of India on September 24, 2025. The appeal challenges an order dated September 12, 2025 by the Appellate Tribunal for Electricity that dismissed their previous appeal against a Central Electricity Regulatory Commission decision from January 2, 2025. The case relates to Battery Energy Storage Systems Projects from Solar Energy Corporation of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1758809000977,
            "Source": "stock"
        },
        {
            "Title": "JSW Neo Energy Acquires 150 MW Tidong Hydro Power Project for ₹1,728 Crores",
            "Summary": "JSW Neo Energy Limited, a wholly-owned subsidiary of JSW Energy Limited, has signed a definitive agreement to acquire 100% equity shares of Tidong Power Generation Private Limited from Statkraft IH Holding AS. The transaction values the enterprise at ₹1,728 crores and includes a 150 MW under-construction hydro power project located in Kinnaur district of Himachal Pradesh. The plant is expected to be commissioned in October 2026 and has a 22-year Power Purchase Agreement with Uttar Pradesh Power Corporation Ltd for 75 MW capacity at ₹5.57/KWh tariff during May to October. The remaining 75 MW capacity is untied for merchant market sales. The acquisition requires approvals from the Government of Himachal Pradesh and lenders, with completion expected by January 15, 2026. After this transaction, JSW Energy's locked-in generation capacity will reach 30.5 GW, including 1.8 GW hydro capacity. This marks JSW Energy's fourth hydro asset acquisition, supporting their target of 30 GW generation capacity by FY 2030.",
            "Sentiment": "positive",
            "PublishDate": 1758214010948,
            "Source": "order&deals"
        },
        {
            "Title": "JSW Energy Board Approves Demerger of GE Power India's Durgapur Manufacturing Facility",
            "Summary": "JSW Energy's Board of Directors approved a scheme of arrangement for the demerger of GE Power India Limited's Durgapur facility, which manufactures power boiler components, pressure vessels, piping, and coal mills for thermal power plants. Under the share exchange ratio, shareholders of GE Power India will receive 10 shares of JSW Energy for every 139 shares held. The appointed date for the scheme is July 1, 2025. JSW Energy stated the acquisition will enable vertical integration by securing a dedicated boiler parts manufacturing facility, reducing dependency on third-party suppliers, and creating operational synergies. The scheme requires regulatory approvals and no-objection letters from BSE and NSE. The share entitlement ratio was determined by registered valuers, with an independent merchant banker confirming the consideration as fair. New JSW Energy shares issued under the scheme will be listed on both stock exchanges.",
            "Sentiment": "positive",
            "PublishDate": 1758213611967,
            "Source": "corporate_action"
        },
        {
            "Title": "JSW Energy Faces Legal Setback as APTEL Rejects Appeal on 500 MW Battery Storage Project",
            "Summary": "APTEL (Appellate Tribunal for Electricity) has rejected JSWREL's appeal against a CERC (Central Electricity Regulatory Commission) order related to a 500 MW battery energy storage project. JSW Energy is now considering additional legal options, including a potential appeal to the Supreme Court.",
            "Sentiment": "negative",
            "PublishDate": 1757895059298,
            "Source": "stock"
        }
    ]
}