{
    "Symbol": "JSWHL",
    "ISIN": "INE824G01012",
    "News": [
        {
            "Title": "JSW Holdings Q3FY26 Net Profit Rises 1.11% to ₹1,962 Cr",
            "Summary": "JSW Holdings reported Q3FY26 net profit of ₹1,962.04 crores, up 1.11% YoY. Revenue from operations increased 11.78% to ₹3,266.28 crores. Nine-month profit declined 36.46% to ₹9,889.97 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1769678361022,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Holdings Receives ESG Score of 69.6 from SEBI-Registered Rating Provider",
            "Summary": "JSW Holdings Limited received an ESG score of 69.6 for 2025 from SESES ESG Research Pvt. Ltd, a SEBI-registered ESG rating provider, with the rating determined independently without company engagement. The ESG report has been made available on the company's website for stakeholder reference.",
            "Sentiment": "neutral",
            "PublishDate": 1764152505517,
            "Source": "stock"
        },
        {
            "Title": "JSW Holdings Reports 48% Decline in Q2 Revenue and Net Profit",
            "Summary": "JSW Holdings reported Q2 revenue of 836 million rupees, down from 1.62 billion rupees in the same period last year. The company's net profit also declined to 596 million rupees compared to 1.2 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762413685690,
            "Source": "earnings"
        },
        {
            "Title": "JSW Holding Reports 10% Growth in Net Profit for Q1",
            "Summary": "JSW Holding reported a net profit of 197 million rupees for Q1, representing an increase from 179 million rupees in the same period last year. The company's revenue also grew to 286 million rupees compared to 272 million rupees year-over-year. Both financial metrics showed positive growth trends for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753960650235,
            "Source": "earnings"
        },
        {
            "Title": "JSW Holdings Reports 35% Jump in Q1 EBITDA to 20.12 Billion Rupees",
            "Summary": "JSW Holdings reported Q1 EBITDA of 20.12 billion rupees, representing a significant increase from 14.9 billion rupees in the same period last year. The company's EBITDA margin also improved to 15.8% compared to 14.4% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1753952884628,
            "Source": "earnings"
        },
        {
            "Title": "JSW Holding to Review Q1 Results on July 31",
            "Summary": "JSW Holding has announced that it will review its first quarter results on July 31. The company has scheduled a meeting to discuss and analyze the financial performance for the latest quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1751977070000,
            "Source": "default"
        },
        {
            "Title": "JSW Holding Reports Q4 Financial Results",
            "Summary": "JSW Holding has reported its quarterly financial results. The company's net profit for Q4 was 191 million rupees, compared to 194.2 million rupees in the same quarter last year. Revenue for Q4 increased to 295 million rupees from 270 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1748422224000,
            "Source": "result"
        },
        {
            "Title": "JSW Holdings Reports Q3 Financial Results",
            "Summary": "JSW Holdings has announced its Q3 consolidated financial results. The company reported a net profit of 139 million rupees, which is a decrease compared to 347 million rupees in the same quarter last year. However, the revenue for Q3 increased to 262 million rupees from 234 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738658317000,
            "Source": "earnings"
        },
        {
            "Title": "JSW Holdings: Share Price Dips 1.5% Amid Market Rally",
            "Summary": "JSW Holdings shares are trading at ₹13,800, down 1.5% from the previous close. This decline comes despite broader market gains, with Sensex up 0.98% and Nifty up 0.84%. The stock has fluctuated between ₹14,498 and ₹13,350 during the day.",
            "Sentiment": "neutral",
            "PublishDate": 1732858488000,
            "Source": "normal_news"
        },
        {
            "Title": "JSW Holdings: Share Price Declines Amid Market Downturn",
            "Summary": "JSW Holdings shares are down 2.58% to ₹13,871 as of 28 Nov 2024. The stock has fluctuated between ₹14,949.95 and ₹13,588.8 during the day. Sensex and Nifty are also down by 0.66% and 0.67% respectively. Technical analysis suggests initial signs of a trend reversal after a previous uptrend.",
            "Sentiment": "negative",
            "PublishDate": 1732771939000,
            "Source": "normal_news"
        },
        {
            "Title": "JSW Holdings: Share Price Drops 5% Amid Mixed Market",
            "Summary": "JSW Holdings shares are trading at ₹14233.9, down 5% from the previous close. The stock hit a high of ₹14300 and a low of ₹14233.9. Sensex is up 0.06% at ₹80048.08, while Nifty is down 0.07%. The company's peers show mixed performance. JSW Holdings has a ROE of 0.69%, ROA of 0.46%, P/E of 69.55, and P/B of 0.51. FII holding increased to 21.69% in September quarter, while MF holding decreased to 0.04%.",
            "Sentiment": "negative",
            "PublishDate": 1732685681000,
            "Source": "normal_news"
        },
        {
            "Title": "JSW Holdings: Share Price Drops 5% Amid Market Fluctuations",
            "Summary": "JSW Holdings shares are trading at ₹14,983.05, down 5% from the previous close. The stock hit a high of ₹15,760 and a low of ₹14,983.05. Technical analysis suggests initial signs of a trend reversal after a strong uptrend. The company has a ROE of 0.69% and ROA of 0.46%. Promoter holding is 0.00%, MF holding decreased to 0.04%, and FII holding increased to 21.69% in the September quarter.",
            "Sentiment": "negative",
            "PublishDate": 1732599152000,
            "Source": "normal_news"
        },
        {
            "Title": "JSW Holdings: Share Price Drops 4.89% Amid Market Rally",
            "Summary": "JSW Holdings shares are trading at ₹15,750, down 4.89% from the previous close. This decline comes despite broader market gains, with Sensex up 1.65% and Nifty up 1.72%. The stock hit a high of ₹16,900 and a low of ₹15,731.45 during the day.",
            "Sentiment": "negative",
            "PublishDate": 1732512874000,
            "Source": "normal_news"
        },
        {
            "Title": "JSW Holding Reports Significant Revenue Growth in Q2",
            "Summary": "JSW Holding has announced its Q2 revenue of 1.62 billion rupees, showing a substantial increase from 892 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1729846439000,
            "Source": "result"
        },
        {
            "Title": "JSW Holding Reports Significant Profit Increase in Q2",
            "Summary": "JSW Holding has announced its second-quarter financial results, reporting a net profit of 1.2 billion rupees. This represents a substantial increase from the 638 million rupees reported in the same quarter of the previous year, indicating a year-over-year growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1729846392000,
            "Source": "result"
        },
        {
            "Title": "JSW Holdings Ltd: Stock Surges 4.77% Amid Sector Decline",
            "Summary": "<p>JSW Holdings Ltd stock <span class='positive'>rose 4.77%</span> to Rs 8845.1, <span class='positive'>outperforming</span> the BSE Financial Services index which is up 0.3%. The company has <span class='positive'>gained 18.27%</span> over the last month, <b>contrasting</b> with the sector index's <span class='negative'>1.46% fall</span> and SENSEX's <span class='negative'>0.18% drop</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728360000000,
            "Source": "normal_news"
        }
    ]
}