{
    "Symbol": "JSWINFRA",
    "ISIN": "INE880J01026",
    "News": [
        {
            "Title": "JSW Infrastructure Acquires Three Rail Logistics Units",
            "Summary": "JSW Infrastructure Limited has completed the 100% acquisition of three rail logistics subsidiaries - JSW Rail Infra Logistics, JSW Minerals Rail Logistics, and JSW (South) Rail Logistics.",
            "Sentiment": "positive",
            "PublishDate": 1770190506167,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Infra Subsidiary ECTPL Faces TNPPA Appeal",
            "Summary": "Tamil Nadu Power Producers Association appeals against JSW Infrastructure's subsidiary ECTPL following NCLT ruling, though company states no financial or operational impact expected.",
            "Sentiment": "neutral",
            "PublishDate": 1770123741283,
            "Source": "stocks"
        },
        {
            "Title": "JSW Infrastructure Seeks Shareholder Approval for Six Resolutions",
            "Summary": "JSW Infrastructure Limited has issued a postal ballot notice dated January 16, 2026, seeking member approval for six special resolutions including borrowing limit increase to Rs. 20,000 crore and new employee stock ownership plan.",
            "Sentiment": "neutral",
            "PublishDate": 1769603978095,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Infra Gets NCLT Approval for NCR Rail Resolution",
            "Summary": "NCLT Mumbai has approved JSW Infrastructure's resolution plan for NCR Rail, marking a significant development in the corporate restructuring process for the railway infrastructure company.",
            "Sentiment": "positive",
            "PublishDate": 1769175142982,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Infrastructure Falls 2.02% on Nifty Midcap 150",
            "Summary": "JSW Infrastructure shares declined 2.02% to ₹260.05, making it among top losers on Nifty Midcap 150. Despite the drop, company shows strong financials with revenue growing to ₹4,476.14 crores in 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769163686173,
            "Source": "stocks"
        },
        {
            "Title": "JSW Infrastructure Q3FY26 Revenue Grows 14% YoY",
            "Summary": "JSW Infrastructure reports 14% YoY revenue growth to ₹13.50 billion in Q3FY26, with cargo volumes rising 8% to 31.7 MT. Motilal Oswal maintains BUY rating with target price of ₹360.",
            "Sentiment": "positive",
            "PublishDate": 1768982174523,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Infrastructure Gets Buy Rating with ₹339 Target",
            "Summary": "Prabhudas Lilladher maintains buy rating on JSW Infrastructure with revised target price of ₹339, citing inline Q3FY26 performance with 7.8% YoY volume growth and robust logistics business expansion.",
            "Sentiment": "positive",
            "PublishDate": 1768896006466,
            "Source": "stocks"
        },
        {
            "Title": "JSW Infrastructure Postal Ballot Approved",
            "Summary": "JSW Infrastructure shareholders approved material related party transaction between subsidiary JSW Port Logistics and promoter group company JSW Shipping & Logistics with 95.37% votes in favour through postal ballot.",
            "Sentiment": "positive",
            "PublishDate": 1768893741978,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Infra Shares Surge 7% Despite Volume Guidance Cut",
            "Summary": "JSW Infrastructure shares rise 7% as company cuts FY26 volume growth guidance to 5-6% but announces ambitious ₹9,000 crore capex plan and strong revenue projections through FY28.",
            "Sentiment": "positive",
            "PublishDate": 1768576669228,
            "Source": "stocks"
        },
        {
            "Title": "JSW Infra Projects 15% EBITDA Growth by FY27, Doubling by FY28",
            "Summary": "JSW Infrastructure predicts EBITDA growth of about 15% by FY2027 and expects almost doubling by FY2028, building on its FY2026 targets of ₹5,400 crore revenue.",
            "Sentiment": "positive",
            "PublishDate": 1768576590072,
            "Source": "stocks"
        },
        {
            "Title": "JSW Infrastructure Q3FY26 Earnings Call Recording",
            "Summary": "JSW Infrastructure Limited makes available audio recording of earnings conference call for Q3FY26 results held on January 16, 2026, covering unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768574224950,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Infra Completes Full Acquisition of JSW Overseas FZE",
            "Summary": "JSW Infrastructure Limited announces the complete acquisition of JSW Overseas FZE, marking a significant corporate development in the marine port and services sector.",
            "Sentiment": "positive",
            "PublishDate": 1768573361874,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Infrastructure Q3 FY26 Results Show Strong Growth",
            "Summary": "JSW Infrastructure reported 8% YoY growth in cargo handling to 31.73 MT in Q3 FY26, with port revenue rising 9% YoY. Company announced major rail logistics acquisition worth ₹1,212 crore and international expansion in Oman.",
            "Sentiment": "positive",
            "PublishDate": 1768566344481,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Infrastructure Q3 Net Profit Rises 9.1% to ₹359 cr",
            "Summary": "JSW Infrastructure reported Q3 net profit of ₹359 crores, up 9.1% YoY. Revenue grew 14.2% to ₹1,349 crores driven by 8% increase in cargo volumes to 31.7 million tonnes.",
            "Sentiment": "positive",
            "PublishDate": 1768565747741,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Infrastructure Q3 FY26 Results: Revenue Up 14% YoY",
            "Summary": "JSW Infrastructure reports strong Q3 FY26 performance with operational revenue of ₹1,350 crore (up 14% YoY), operating EBITDA of ₹644 crore (up 10% YoY), and PAT of ₹365 crore (up 9% YoY). Cargo volumes grew 8% to 31.7 million tonnes.",
            "Sentiment": "positive",
            "PublishDate": 1768565508406,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Infrastructure Gets Railway Ministry Nod for Acquisition",
            "Summary": "JSW Infrastructure receives Ministry of Railways approval for subsidiary shareholding changes in three rail logistics companies, moving closer to completing strategic acquisition deal.",
            "Sentiment": "positive",
            "PublishDate": 1768473311614,
            "Source": "co_actions_results"
        },
        {
            "Title": "HSBC Upgrades JSW Infrastructure to Hold Rating",
            "Summary": "HSBC has upgraded JSW Infrastructure's rating to hold and raised the target price to ₹280.00, reflecting improved outlook for the infrastructure company's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1768276346984,
            "Source": "stocks"
        },
        {
            "Title": "HSBC upgrades JSW Infra to 'hold', sets ₹280 target",
            "Summary": "HSBC upgraded JSW Infrastructure to 'hold' with ₹280 price target, implying 5.6% upside. Brokerage expects company to double EBITDA by FY28 and meet 400 MTPA capacity target by FY30.",
            "Sentiment": "positive",
            "PublishDate": 1768275149937,
            "Source": "stocks"
        },
        {
            "Title": "JSW Infrastructure Q3FY26 Results Call on Jan 16",
            "Summary": "JSW Infrastructure has scheduled a conference call on January 16, 2026, at 6:00 PM IST to discuss Q3FY26 financial results. The call will be led by senior management including Joint MD & CEO.",
            "Sentiment": "neutral",
            "PublishDate": 1767956776847,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Infrastructure Board Meet on Jan 16 for Q3FY26",
            "Summary": "JSW Infrastructure Limited has scheduled its board meeting for January 16, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window to reopen January 19, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767956131674,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Infra Must Pay ₹965.8 Cr in Tax Penalties",
            "Summary": "JSW Infrastructure faces ₹965.8 million penalty payment following GST notice for 2019-2024 period, escalating from earlier tax compliance issues.",
            "Sentiment": "negative",
            "PublishDate": 1767093738501,
            "Source": "stocks"
        },
        {
            "Title": "JSW Infrastructure Seeks Shareholder Approval for ₹1,212 Crore Rail Logistics Acquisition",
            "Summary": "JSW Infrastructure Limited announces postal ballot seeking member approval for subsidiary's acquisition of three rail logistics companies from promoter group entity for ₹1,212 crore enterprise value.",
            "Sentiment": "positive",
            "PublishDate": 1766150581519,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Infra unit wins ₹63cr cargo terminal contract",
            "Summary": "Navkar Corporation, JSW Infrastructure's subsidiary, secured Letter of Acceptance from Central Railway for developing Gati Shakti Multi-Modal Cargo Terminal at Somathane worth approximately ₹63.22 crores.",
            "Sentiment": "positive",
            "PublishDate": 1766125829808,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Infrastructure Achieves CDP Leadership Rating A-",
            "Summary": "JSW Infrastructure Limited upgraded its CDP climate change score to leadership level A- from previous management level B rating, demonstrating enhanced environmental performance and sustainability commitment.",
            "Sentiment": "positive",
            "PublishDate": 1765517288497,
            "Source": "stocks"
        },
        {
            "Title": "JSW Infrastructure Subsidiary Acquires Three Rail Logistics Companies for ₹744.9 Crore",
            "Summary": "JSW Port Logistics Private Limited, a wholly owned subsidiary of JSW Infrastructure Limited, executed share purchase agreements to acquire 100% equity in three rail logistics companies - JSW Rail Infra Logistics, JSW Minerals Rail Logistics, and JSW (South) Rail Logistics. Independent valuation by PwC Business Consulting Services valued the combined acquisition at ₹744.9 crore, with the transaction being conducted at arm's length basis to strengthen JSW's railway-based freight transportation capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1765204785359,
            "Source": "order&deals"
        },
        {
            "Title": "JSW Infrastructure Reports 4% Cargo Growth to 58.2 MT in H1FY26, Targets 400 MTPA Capacity by FY30",
            "Summary": "JSW Infrastructure handled 58.2 MT cargo in H1FY26 with 4% YoY growth, achieving revenue of ₹2,686 crore (up 23% YoY) and EBITDA of ₹1,387 crore (up 14% YoY). The company plans to expand from current 177 MTPA capacity to 400 MTPA by FY30 through brownfield expansions, greenfield ports including a 27 MTPA facility in Oman, and logistics business scaling to ₹8,000 crore revenue target.",
            "Sentiment": "positive",
            "PublishDate": 1764570831290,
            "Source": "stock"
        },
        {
            "Title": "JSW Infrastructure Acquires 51% Stake in Oman Port Company for $419 Million",
            "Summary": "JSW Infrastructure Ltd will acquire a 51% stake in South Minerals Port Company SAOC, Oman for $419 million, with the transaction set to complete within 60 days. The port special purpose vehicle will develop a 27 million tonnes per annum capacity port facility.",
            "Sentiment": "positive",
            "PublishDate": 1763372300101,
            "Source": "order&deals"
        },
        {
            "Title": "JSW Infrastructure Reports 73% YoY Growth in Cargo Handling for Q2FY26",
            "Summary": "JSW Infrastructure handled 28.9 million tonnes of cargo in Q2FY26, marking a 73% year-on-year growth, and 58.2 million tonnes in H1FY26, up 4.4% YoY. The company reported total revenue of ₹1,372 crore (up 26% YoY) and EBITDA of ₹716 crore (up 18% YoY) for Q2FY26. For H1FY26, total revenue reached ₹2,686 crore (up 23% YoY) with EBITDA of ₹1,387 crore (up 14% YoY). The company maintains a strong balance sheet with net debt of ₹1,810 crore and cash reserves of ₹3,088 crore. JSW Infrastructure has outlined expansion plans to increase capacity from current 177 mtpa to 400 mtpa by FY30, with multiple projects under construction including terminals at Tuticorin, JNPA, and Kolkata. The company signed concession agreements for new projects and completed public hearings for greenfield ports at Keni and Murbe.",
            "Sentiment": "positive",
            "PublishDate": 1761971361252,
            "Source": "stock"
        },
        {
            "Title": "JSW Infrastructure Publishes Q2 FY26 Earnings Call Transcript",
            "Summary": "JSW Infrastructure Limited has made available the transcript of its Q2 FY26 earnings conference call held on October 16, 2025. The transcript has been posted on the company's website and the disclosure was communicated to BSE, NSE, and India International Exchange. The company secretary Hitesh Kanani signed the regulatory communication on October 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761204503255,
            "Source": "earnings"
        },
        {
            "Title": "JSW Infrastructure Plans Rs 5,500 Crore Capex for FY26; Q2 Profit Declines 3.5%",
            "Summary": "JSW Infrastructure announced plans to invest Rs 5,500 crore in FY26, allocating Rs 4,000 crore to its port business and Rs 1,500 crore to logistics operations. The company reported a 3.5% decline in profit after tax to Rs 369 crore for the quarter ended June, while total revenue increased 26% to Rs 1,372 crore. Consolidated EBITDA grew 18% to Rs 716 crore, and operational revenue rose 26% to Rs 1,266 crore, driven by higher port throughput and improved logistics performance. For the first half of FY26, capital expenditure reached approximately Rs 902 crore. The company handled 58.2 million tonnes of cargo during April-September, showing 4% growth despite challenging iron ore export market conditions that resulted in a shortfall of 3.4 million tonnes at one terminal.",
            "Sentiment": "neutral",
            "PublishDate": 1760755358628,
            "Source": "earnings"
        },
        {
            "Title": "JSW Infra Projects 45-50% Consolidated Margins, Opens New Logistics Park in Karnataka",
            "Summary": "JSW Infra expects its consolidated margins to range between 45% to 50%. The company announced a new multi-modal logistics park in Kudathini, Karnataka, which is scheduled to open within 2-3 months.",
            "Sentiment": "positive",
            "PublishDate": 1760671817661,
            "Source": "stock"
        },
        {
            "Title": "JSW Infra Sets Ambitious FY30 Targets with 400 Million Tonnes Cargo Capacity Goal",
            "Summary": "JSW Infra has announced ambitious targets for FY30, aiming to achieve 400 million tonnes cargo handling capacity, ₹8,000 crore logistics revenue, and 25% EBITDA margin in logistics. For the near term, the company expects 8-10% growth in cargo volume for FY26, subject to iron ore market conditions. The logistics business maintains revenue guidance of ₹7-8 billion for FY26, with ₹1 billion EBITDA target and ₹100 crore EBITDA target for Navkar in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1760671489240,
            "Source": "stock"
        },
        {
            "Title": "JSW Infra Targets 20%+ Volume Growth Through Port Expansion Strategy",
            "Summary": "JSW Infra has set a target to achieve sustained volume growth of over 20% compound annual growth rate. The company plans to accomplish this through aggressive port capacity additions, expansion of LNG terminals, and development of new container terminals. This strategy aims to position JSW Infra for long-term leadership in the maritime logistics sector.",
            "Sentiment": "positive",
            "PublishDate": 1760632357205,
            "Source": "stock"
        },
        {
            "Title": "JSW Infrastructure Shares Audio Transcript Link for Q2 FY26 Results Conference Call",
            "Summary": "JSW Infrastructure Limited provided a link to the audio transcript of their Q2 FY26 results conference call held on October 16, 2025. The transcript is hosted on the company's website at https://www.jsw.in/infrastructure/jsw-infrastructure-financial-results-fy-2025-26. The disclosure was made to BSE Limited, National Stock Exchange of India Limited, and India International Exchange (IFSC) Limited. Company Secretary and Compliance Officer Hitesh Kanani signed the communication.",
            "Sentiment": "neutral",
            "PublishDate": 1760623513972,
            "Source": "earnings"
        },
        {
            "Title": "JSW Infrastructure Reports 26% Revenue Growth to ₹1,372 Crore in Q2 FY2026",
            "Summary": "JSW Infrastructure Limited announced its Q2 FY2026 results with total revenue of ₹1,372 crore, up 26% year-on-year. The company handled 28.9 million tonnes of cargo, representing a 3% increase. EBITDA grew 18% to ₹716 crore, while operational EBITDA increased 17% to ₹610 crore. Profit after tax stood at ₹369 crore. The company maintains a strong balance sheet with cash and cash equivalents of ₹3,088 crore and net debt to operating EBITDA ratio of 0.75x. Volume growth was driven by strong performance at South West Port, Jaigarh Port, and Dharamtar Port, though moderated by a 2.1 million tonnes shortfall at Paradip Iron Ore terminal due to weak seaborne iron ore export conditions. Navkar Corporation showed robust growth with EXIM cargo volumes reaching 79,000 TEUs (up 20%) and domestic cargo at 394,000 metric tonnes (up 46%). The company received investment grade ratings of BBB-/Stable from S&P Global Ratings and Fitch Ratings. JSW Infrastructure completed public hearings for proposed Greenfield ports at Keni and Murbe, acquired an 86-acre rail siding in Ballari for ₹57 crore, and signed a 30-year concession agreement for container berths at Netaji Subhas Dock, Kolkata.",
            "Sentiment": "positive",
            "PublishDate": 1760614521406,
            "Source": "earnings"
        },
        {
            "Title": "JSW Infrastructure Reports 17% Growth in Quarterly EBITDA to 6.1 Billion Rupees",
            "Summary": "JSW Infrastructure's quarterly EBITDA increased to 6.1 billion rupees compared to 5.2 billion rupees in the same period last year, representing year-over-year growth. However, the company's EBITDA margin declined to 48.17% from 51.98% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1760611197319,
            "Source": "earnings"
        },
        {
            "Title": "JSW Infrastructure Reports Mixed Q2 Results with Revenue Growth and Profit Decline",
            "Summary": "JSW Infrastructure reported quarterly consolidated net profit of 3.61 billion rupees compared to 3.71 billion rupees in the same period last year, representing a decline. However, the company's revenue increased to 12.65 billion rupees from 10 billion rupees year-over-year, showing growth in the top line despite the profit decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1760610778985,
            "Source": "earnings"
        },
        {
            "Title": "JSW Infrastructure Limited Announces Quarterly Financial Results for September 2025",
            "Summary": "JSW Infrastructure Limited announced the approval of its unaudited financial results for the quarter and half year ended September 30, 2025, following a Board of Directors meeting. The results, reviewed by the Audit Committee, were accompanied by an Independent Auditor's Limited Review Report. The Board meeting commenced at 12 noon IST and concluded at 3:40 p.m. IST on October 16, 2025. Shah Gupta & Co., Chartered Accountants, conducted the independent review and confirmed that nothing came to their attention suggesting the financial statements contained material misstatements or failed to comply with disclosure requirements under listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1760610689068,
            "Source": "earnings"
        },
        {
            "Title": "JSW Infra Subsidiary Faces ₹97 Crore GST Show Cause Notice",
            "Summary": "JSW Infrastructure Limited announced that its subsidiary Ennore Coal Terminal Private Limited (ECTPL) received a GST show cause notice for ₹96.58 crore from Chennai tax authorities. The notice alleges tax contraventions during April 2019 to March 2024 period. ECTPL has 30 days to respond and show cause why the GST amount, along with interest and penalty, should not be demanded. JSW Infra stated the notice has no material impact on company operations and maintains it has strong legal grounds to contest the proceedings. JSW Infrastructure shares closed at ₹322.65, down 0.062% on BSE.",
            "Sentiment": "negative",
            "PublishDate": 1759159360385,
            "Source": "stock"
        },
        {
            "Title": "JSW Infra Signs 30-Year Kolkata Port Agreement and Acquires Karnataka Rail Facility",
            "Summary": "JSW Infrastructure Ltd signed a 30-year concession agreement with Syama Prasad Mookerjee Port Authority, Kolkata, for reconstructing and mechanizing berths 7 and 8 at Netaji Subhash Dock. The project will be executed through JSW Kolkata Container Terminal Pvt Ltd, a wholly-owned subsidiary. Additionally, JSW Port Logistics acquired an 86-acre brownfield rail siding in Kudathini, Karnataka, for ₹57 crore to develop a multi-modal logistics park requiring total investment of ₹380 crore. The facility will include a rail freight terminal, container systems, and inland container depot, with operations expected to begin within six months. JSW Infra operates 12 port concessions across India and one liquid storage terminal in Fujairah, UAE. Company shares closed 0.11% lower at ₹314.90 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1757947483266,
            "Source": "stock"
        },
        {
            "Title": "JSW Infrastructure Subsidiary Signs 30-Year Port Concession Agreement in Kolkata",
            "Summary": "JSW Kolkata Container Terminal Private Limited, a wholly owned subsidiary of JSW Infrastructure Limited, has signed a 30-year concession agreement with Syama Prasad Mookerjee Port Authority, Kolkata. The agreement covers the reconstruction and mechanization of Berth Nos. 7 and 8 at Netaji Subhash Dock on a Design, Build, Finance, Operate and Transfer basis through PPP mode. JSW Infrastructure had previously received the Letter of Award in July 2025 and incorporated the subsidiary company in August 2025 specifically for this project.",
            "Sentiment": "positive",
            "PublishDate": 1757938115374,
            "Source": "order&deals"
        },
        {
            "Title": "JSW Infrastructure Acquires Rail Siding in Karnataka for ₹57 Crore",
            "Summary": "JSW Infrastructure has acquired a brownfield rail siding located at Kudathini, Ballari, Karnataka for ₹57 crore. The acquisition was completed through the company's wholly owned subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1757588170454,
            "Source": "stock"
        },
        {
            "Title": "Moody's Upgrades JSW Infrastructure Outlook to Positive, Maintains BA1 Rating",
            "Summary": "Moody's has changed JSW Infrastructure's outlook to positive while confirming the company's BA1 credit rating. This rating action indicates an improved credit assessment for the infrastructure company.",
            "Sentiment": "positive",
            "PublishDate": 1756113164894,
            "Source": "stock"
        },
        {
            "Title": "Fitch Upgrades JSW Infrastructure Credit Rating to 'BBB-' with Stable Outlook",
            "Summary": "Fitch Ratings has upgraded JSW Infrastructure's credit rating to 'BBB-' and assigned a stable outlook to the company. This rating upgrade reflects an improvement in the credit assessment of JSW Infrastructure by the international rating agency.",
            "Sentiment": "positive",
            "PublishDate": 1756105925763,
            "Source": "stock"
        },
        {
            "Title": "JSW Infrastructure Announces Major Board Restructuring with New Director Appointments and Senior Resignations",
            "Summary": "JSW Infrastructure Limited announced significant board changes effective from August 23, 2025. The company appointed Ms. Neeta Mukerji as Additional and Independent Director for three years and Mr. Devki Nandan Sharma as Additional Director and Whole-Time Director, both subject to shareholder approval. Three directors resigned: Ms. Ameeta Chatterjee's term as Independent Director ended, Mr. Nirmal Kumar Jain resigned as Independent Director due to advancing age, and Mr. Kantilal Narandas Patel resigned as Non-Executive Non-Independent Director for personal reasons. Mr. Lalit Singhvi will transition from Whole-Time Director and CFO to Non-Executive Non-Independent Director upon superannuation. The company also appointed Mr. J Nagarajan as Chief Financial Officer and Mr. Debabrat Mishra as Senior Vice President (Human Resource) and Senior Management Personnel. Ms. Mukerji brings over 30 years of banking experience from institutions including ICICI Bank, ARCIL, and RBL Bank. Mr. Sharma has nearly three decades of experience in Maritime and Infrastructure sectors with qualifications from London Business School and IIM-Ahmedabad.",
            "Sentiment": "neutral",
            "PublishDate": 1755950879613,
            "Source": "corporate_governance"
        },
        {
            "Title": "JSW Infrastructure Releases Investor Presentation Highlighting Growth Strategy and Q1 FY26 Performance",
            "Summary": "JSW Infrastructure Limited disclosed its investor presentation for August 2025, showcasing its position as India's second largest private port operator with 177 mtpa capacity. The company reported total cargo handled of 29.4 MT in Q1 FY26, representing 5% year-on-year growth, with third-party customer share increasing to 52% from 50% in the previous year. Operating revenue grew 21% to ₹1,224 crore, while operating EBITDA increased 13% to ₹581 crore. PAT surged 31% to ₹390 crore. The company outlined its growth strategy to expand capacity to 400 mtpa by FY30 through brownfield expansions, greenfield developments, and strategic acquisitions. Key project updates include ongoing construction at Tuticorin Terminal and JNPA Liquid Terminal, with interim operations already commenced. JSW Infrastructure maintains a strong balance sheet with net debt of ₹1,246 crore and cash reserves of ₹4,360 crore. The company received several awards including Leadership Grade A- in CDP's Supplier Engagement Assessment and recognition for Dharamtar Port's environmental initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1754490685520,
            "Source": "stock"
        },
        {
            "Title": "JSW Infra Establishes New Subsidiary JSW Kolkata Container Terminal Private Limited",
            "Summary": "JSW Infra has formed a new fully owned subsidiary called JSW Kolkata Container Terminal Private Limited. The subsidiary appears to be focused on container terminal operations in Kolkata.",
            "Sentiment": "positive",
            "PublishDate": 1754055889256,
            "Source": "stock"
        },
        {
            "Title": "JSW Infrastructure Incorporates Wholly Owned Subsidiary for Kolkata Port Operations",
            "Summary": "JSW Infrastructure Limited incorporated JSW Kolkata Container Terminal Private Limited as a wholly owned subsidiary on August 1, 2025. The new entity was established to fulfill requirements of a Letter of Award received from Syama Prasad Mookerjee Port Authority for reconstruction of Berth No. 8 and mechanization of Berth Nos. 7 and 8 at Netaji Subhash Dock of Kolkata Dock System. The project involves Design, Build, Finance, Operate and Transfer (DBFOT) basis through PPP mode for container handling services. The LOA terms required incorporation of a Special Purpose Vehicle to enter into a concession agreement within 30 days. JSW Infrastructure holds 100% shareholding in the subsidiary with an initial capital investment of Rs. 1,00,000 through subscription of 10,000 equity shares of Rs. 10 each. The subsidiary operates in the infrastructure sector focusing on port-related industry and has yet to commence business operations.",
            "Sentiment": "positive",
            "PublishDate": 1754055806036,
            "Source": "corporate_action"
        },
        {
            "Title": "JSW Infrastructure Seeks Shareholder Approval for Rajive Kumar's Appointment as Independent Director",
            "Summary": "JSW Infrastructure Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Rajive Kumar as a Non-executive, Independent Director. The Board appointed Kumar as an Additional Director on July 22, 2025, subject to shareholder approval through remote e-voting from July 26 to August 24, 2025. Kumar, a 67-year-old former Indian Administrative Service officer who retired as Chief Secretary of Uttar Pradesh in 2018, brings four decades of government experience including roles as Shipping Secretary and Additional Secretary in Ministry of Petroleum and Natural Gas. He previously served as Chairperson of Uttar Pradesh Real Estate Regulatory Authority from 2018 to 2023. The appointment is for a three-year term from July 22, 2025 to July 21, 2028, and requires approval by special resolution. Kumar currently serves as an Independent Director on ICICI Lombard General Insurance Company Limited and is a member of its Audit Committee. The scrutinizer Mr. Sunil Agarwal will conduct the postal ballot process, with results to be announced by August 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753362223139,
            "Source": "corporate_governance"
        },
        {
            "Title": "JSW Infrastructure Reports IPO Fund Utilization Progress in Quarterly Monitoring Report",
            "Summary": "JSW Infrastructure Limited submitted its monitoring agency report for the quarter ended June 30, 2025, detailing the utilization of Rs. 2,800 crore raised through its IPO of 235,294,117 equity shares. CARE Ratings Limited, serving as the monitoring agency, reported no deviations from stated objectives. The company has utilized Rs. 1,905 crore of the total proceeds, with Rs. 821.13 crore remaining unutilized and deployed in fixed deposits across Axis Bank, IndusInd Bank, and Yes Bank earning returns between 5.00% to 7.90%. Key utilizations include Rs. 880 crore for debt repayment through subsidiaries JSW Dharamtar Port and JSW Jaigarh Port, Rs. 666.05 crore for general corporate purposes including acquisitions, and partial funding for capital expenditure projects including LPG terminal development and container terminal expansion. Some projects are experiencing delays, with the LPG terminal and electric sub-station projects behind schedule due to heavy rains affecting site accessibility and material delivery delays, though the monitoring agency noted no material impact on the company's credit profile.",
            "Sentiment": "neutral",
            "PublishDate": 1753196896458,
            "Source": "stock"
        }
    ]
}