{
    "Symbol": "JSWSTEEL",
    "ISIN": "INE019A01038",
    "News": [
        {
            "Title": "JSW Steel Reports 24.75 Lakh Tonnes Production",
            "Summary": "JSW Steel reported consolidated crude steel production of 24.75 lakh tonnes for January 2026, down 2% YoY from 25.18 lakh tonnes, impacted by BF3 shutdown and US operations outage.",
            "Sentiment": "neutral",
            "PublishDate": 1770699904615,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Steel Shareholders Approve Key Corporate Restructuring",
            "Summary": "JSW Steel shareholders approved three major resolutions through postal ballot including material related party transactions for joint venture with JFE Steel Corporation, transfer of Bhushan Power & Steel's business undertaking, and reduction of shareholding in JSW Kalinga Steel Limited to fifty percent.",
            "Sentiment": "positive",
            "PublishDate": 1770305145024,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Steel Achieves Highest S&P CSA Score in Global Steel",
            "Summary": "JSW Steel secured an outstanding CSA score of 88 in S&P's Corporate Sustainability Assessment 2025, marking its highest ever score and leading the global steel sector with a 7% year-on-year improvement.",
            "Sentiment": "positive",
            "PublishDate": 1769616432377,
            "Source": "stocks"
        },
        {
            "Title": "JSW Steel CFO Reports January Price Hikes",
            "Summary": "JSW Steel's CFO confirms steel price increases implemented in January, indicating potential for additional pricing adjustments ahead based on market conditions.",
            "Sentiment": "positive",
            "PublishDate": 1769576098899,
            "Source": "stocks"
        },
        {
            "Title": "JSW Steel hits all-time high of Rs 1,226.90",
            "Summary": "JSW Steel shares surge 4.76% to reach new peak of Rs 1,226.90 on NSE, driven by strong Q3 performance with revenue at Rs 45,991 crore and net profit jumping to Rs 2,527 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769510231161,
            "Source": "stocks"
        },
        {
            "Title": "JSW Steel Shares Jump 3.67% on High Trading Volume",
            "Summary": "JSW Steel shares surged 3.67% to ₹1,212.90 amid high trading volume. The company reported quarterly revenue of ₹45,991 crore and net profit of ₹2,527 crore for December 2025.",
            "Sentiment": "positive",
            "PublishDate": 1769508372930,
            "Source": "stocks"
        },
        {
            "Title": "JSW Steel raises capacity target to 56 mtpa by FY31",
            "Summary": "JSW Steel increases expansion target to 56 mtpa by FY31, up from earlier 50 mtpa guidance. Company plans ₹1 trillion capex over 4-5 years while Q3 net profit jumps to ₹2,139 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769330354844,
            "Source": "stocks"
        },
        {
            "Title": "JSW Steel Executive Predicts Q4 Margin Improvement",
            "Summary": "JSW Steel executive forecasts better profit margins in the fourth quarter, signaling potential improvement in the steel major's financial performance amid market conditions.",
            "Sentiment": "positive",
            "PublishDate": 1769177168122,
            "Source": "stocks"
        },
        {
            "Title": "JSW Steel Forecasts 7-9% Steel Demand Growth in FY27",
            "Summary": "JSW Steel anticipates steel demand to grow by 7-9% in FY27, reflecting positive outlook for the Indian steel sector amid expected economic expansion and infrastructure development.",
            "Sentiment": "positive",
            "PublishDate": 1769175190869,
            "Source": "stocks"
        },
        {
            "Title": "JSW Steel Plans ₹150-160 Billion Investment in FY26",
            "Summary": "JSW Steel announces major capital expenditure plan of ₹150-160 billion for FY26, signaling significant expansion and growth initiatives across its operations.",
            "Sentiment": "positive",
            "PublishDate": 1769170817724,
            "Source": "stocks"
        },
        {
            "Title": "JSW Steel Q3 Net Profit Surges 235% to ₹2,410 Crore",
            "Summary": "JSW Steel reported exceptional Q3 FY25 performance with net profit jumping 235% to ₹2,410 crore, while revenue grew 11% to ₹45,219 crore. EBITDA reached ₹6,496 crore with 14.1% margin.",
            "Sentiment": "positive",
            "PublishDate": 1769166574176,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Steel Forms JV for Mumbai Land Development Project",
            "Summary": "JSW Steel's board approves formation of joint venture company with 51% stake through subsidiary Peddar Realty Limited for land development project in Mumbai, targeting office and commercial space development.",
            "Sentiment": "positive",
            "PublishDate": 1769164569208,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Steel Q3 preview: Import curbs boost stock",
            "Summary": "JSW Steel shares rose 5.7% since December 30 on safeguard duty announcement, but Q3 earnings expected to decline sequentially due to weak steel prices and higher coking coal costs.",
            "Sentiment": "neutral",
            "PublishDate": 1769057353933,
            "Source": "co_actions_results"
        },
        {
            "Title": "Morgan Stanley Raises JSW Steel Target to ₹1330",
            "Summary": "Morgan Stanley maintains Overweight rating on JSW Steel with revised target price of ₹1330.00, indicating positive outlook on the steel major's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1768968157600,
            "Source": "stocks"
        },
        {
            "Title": "JSW's First Car to Launch Before Diwali 2025",
            "Summary": "Parth Jindal announces JSW's debut vehicle launch before Diwali, with factory construction underway in Shambhaji Nagar. The plug-in hybrid will be priced in ₹15-30 lakh range with 80% localization.",
            "Sentiment": "positive",
            "PublishDate": 1768916106214,
            "Source": "stocks"
        },
        {
            "Title": "JSW Steel Reports 12% Production Growth in 9M FY26",
            "Summary": "JSW Steel achieved 22.65 million tons cumulative production in first nine months of FY26, marking 12% year-over-year growth. JSW Steel USA Ohio facility contributed 0.20 million tons to overall output.",
            "Sentiment": "positive",
            "PublishDate": 1767930637779,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Steel Q3 FY26 Production Reaches 7.48 Million Tonnes",
            "Summary": "JSW Steel reports crude steel production of 7.48 million tonnes for Q3 FY26, demonstrating the company's operational capacity during the quarter across its manufacturing facilities.",
            "Sentiment": "neutral",
            "PublishDate": 1767930614335,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Steel Q3 FY26 Production Rises 6% YoY to 7.48 MT",
            "Summary": "JSW Steel reported consolidated crude steel production of 7.48 million tonnes for Q3 FY26, marking a 6% year-on-year growth despite BF3 shutdown for capacity upgradation at Vijayanagar facility.",
            "Sentiment": "positive",
            "PublishDate": 1767929839226,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Steel Gets A- Credit Rating from Japan Agency",
            "Summary": "Japan Credit Rating Agency assigns A- rating with stable outlook to JSW Steel for both foreign and local currency long-term issuer ratings, citing strong profitability and market position.",
            "Sentiment": "positive",
            "PublishDate": 1766569388565,
            "Source": "stocks"
        },
        {
            "Title": "JSW Steel to Announce Q3 Results on January 23",
            "Summary": "JSW Steel has scheduled the review of its third quarter financial results for January 23, marking an important date for investors and stakeholders awaiting the company's performance update.",
            "Sentiment": "neutral",
            "PublishDate": 1766465371952,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Steel Gets Rating Watch with Positive Outlook",
            "Summary": "ICRA places JSW Steel's long-term ratings on watch with positive implications following board approval for strategic 50:50 JV with Japan's JFE Steel Corporation worth ₹31,500 crores.",
            "Sentiment": "positive",
            "PublishDate": 1765546819210,
            "Source": "stocks"
        },
        {
            "Title": "Jefferies Sets ₹1,300 Target for JSW Steel",
            "Summary": "Jefferies maintains Buy recommendation on JSW Steel with target price of ₹1,300, reflecting positive outlook on the steel major's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1765375501614,
            "Source": "stocks"
        },
        {
            "Title": "JSW Steel Reports 24.39 Lakh Tonnes Crude Steel Production in November 2025, Up 5% Year-on-Year",
            "Summary": "JSW Steel produced 24.39 lakh tonnes of crude steel in November 2025, marking a 5% increase compared to the same period last year. The company operated at 84% capacity utilization due to Blast Furnace 3 being shut down during the period.",
            "Sentiment": "positive",
            "PublishDate": 1765251492924,
            "Source": "stock"
        },
        {
            "Title": "JSW Steel Forms 50:50 Joint Venture With JFE Steel For Bhushan Power And Steel Business",
            "Summary": "JSW Steel has established a 50:50 joint venture partnership with JFE Steel specifically for the Bhushan Power And Steel business operations. The equal partnership structure indicates a strategic collaboration between the two steel companies to jointly manage and operate this business segment.",
            "Sentiment": "positive",
            "PublishDate": 1764817752970,
            "Source": "order&deals"
        },
        {
            "Title": "JSW Steel Completes Acquisition of Saffron Resources Private Limited",
            "Summary": "JSW Steel Limited has completed the acquisition of 100% equity interest in Saffron Resources Private Limited on December 3, 2025, making it a wholly-owned subsidiary. The acquisition was executed in accordance with the Share Purchase Agreement following earlier intimations dated July 18, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1764780727963,
            "Source": "corporate_action"
        },
        {
            "Title": "JSW Steel Appoints Sandeep Batra as President CHRO-Steel Corporate",
            "Summary": "JSW Steel's Board of Directors approved the appointment of Sandeep Batra as President CHRO-Steel Corporate and part of Senior Management effective November 18, 2025. Batra brings 31 years of diverse HR experience across multiple sectors including his recent role as Chief People Officer at Adani Airport Holdings Limited and Adani Digital Labs.",
            "Sentiment": "positive",
            "PublishDate": 1763381618535,
            "Source": "corporate_governance"
        },
        {
            "Title": "JSW Steel's Credit Rating Outlook Upgraded to Stable by India Ratings",
            "Summary": "India Ratings has affirmed JSW Steel Limited's long-term issuer rating and non-convertible debentures at IND AA while changing the outlook to Stable from Rating Watch with Developing Implications. The rating action follows the Supreme Court's judgment dated September 26, 2025, which dismissed appeals by erstwhile promoters and upheld JSW Steel's INR 193.5 billion bid to acquire Bhushan Power and Steel Ltd through the corporate insolvency resolution process. The affirmation reflects expectations of improvement in JSW Steel's consolidated net adjusted leverage from FY26 onwards, supported by healthy domestic demand and volume ramp-up from incremental commissioned capacities at Vijayanagar and BPSL. Net leverage increased to 4.4x in FY25 due to pricing pressure from low-cost Chinese exports but improved to 3.6x in first half FY26 and is expected to sustain below 3.5x from FY26. The company plans a capex of around INR 761.1 billion over FY26-FY29 and aims to increase total capacity in India to 42 mtpa by September 2027 and further to 50 mtpa by FY31.",
            "Sentiment": "positive",
            "PublishDate": 1763006580376,
            "Source": "corporate_action"
        },
        {
            "Title": "JSW Steel in Talks to Sell Up to 50% Stake in Bhushan Power & Steel",
            "Summary": "JSW Steel is working to sell up to half of its ownership in Bhushan Power & Steel Ltd (BPSL). Japan's JFE Steel is the front runner to acquire JSW Steel's 50% stake. JSW Steel is exploring strategic partnerships for BPSL, potentially bringing in a financial or strategic investor. JSW Steel stated it evaluates various opportunities including potential collaborations aimed at enhancing scale, efficiency and global competitiveness, but declined to comment on speculation. BPSL was acquired by JSW Steel under the Insolvency and Bankruptcy Code in 2019 and has an integrated steel-making capacity of around 4.5 million tonnes per annum. The Supreme Court ordered BPSL's liquidation in May 2025, but reversed this decision in September 2025, reinstating JSW Steel's acquisition and allowing the group to proceed with the revival.",
            "Sentiment": "neutral",
            "PublishDate": 1762873499084,
            "Source": "order&deals"
        },
        {
            "Title": "JSW Steel Reports 24.95 Lakh Tonnes Crude Steel Production in October 2025",
            "Summary": "JSW Steel produced 24.95 lakh tonnes of consolidated crude steel in October 2025, marking a 9% year-over-year increase. The company's Indian operations achieved 83% capacity utilization, which was lower due to the shutdown of Blast Furnace 3 at Vijayanagar for capacity upgradation from 3.0 MTPA to 4.5 MTPA. Excluding BF3 capacity, utilization reached 92%. The blast furnace is expected to resume production in February 2026. JSW Steel USA-Ohio contributed 0.55 lakh tonnes to the total production. The company operates with a consolidated crude steel capacity of 35.7 MTPA, including 1.5 MTPA in the US, and domestic capacity of 34.2 MTPA.",
            "Sentiment": "positive",
            "PublishDate": 1762747854919,
            "Source": "stock"
        },
        {
            "Title": "JSW Steel Increases Stake in M Res NSW HCC to 83.33% with $60 Million Investment",
            "Summary": "JSW Steel has raised its stake in M Res NSW HCC Pty Ltd from 66.67% to 83.33% through a $60 million investment. The company purchased non-voting Class B shares for $24 million and subscribed to additional shares for $36 million. This transaction increases JSW Steel's effective interest in Illawarra Metallurgical Coal from 20% to 30%.",
            "Sentiment": "positive",
            "PublishDate": 1761734552370,
            "Source": "stock"
        },
        {
            "Title": "JSW Steel Shares Surge 3% as Nifty Metal Index Extends Rally to Sixth Session",
            "Summary": "JSW Steel shares climbed 3.3% to Rs 1,224, marking the fourth consecutive session of gains with a 7.5% rise over this period. The rally coincided with Nifty Metal's sixth straight session of gains, surging over 6%. JSW Steel reported strong quarterly results with consolidated profit after tax jumping 307% year-on-year to Rs 1,646 crore, while revenue from operations grew 12% to Rs 42,149 crore. Domestic sales reached 6.33 million tonnes with 14% year-on-year growth, while exports surged 89%. Consolidated crude steel production hit a record 7.90 million tonnes, up 17% year-on-year. The company's net debt-to-equity ratio improved to 0.93x from 0.95x in the previous quarter. However, InCred Equities maintained a Reduce rating with a target price of Rs 939, citing concerns over high valuation at nearly 4x book value and net gearing above 75%. JSW Steel shares have gained 33% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1761720394018,
            "Source": "stock"
        },
        {
            "Title": "JSW Steel Plans Odisha Plant Construction Within Year, Seeks New Iron Ore Mines",
            "Summary": "JSW Steel's Co CEO announced plans to begin construction of the company's Odisha steel plant within a year. The company is actively searching for new iron ore mines to meet growing demand for raw materials.",
            "Sentiment": "positive",
            "PublishDate": 1761193045756,
            "Source": "stock"
        },
        {
            "Title": "JSW Steel Expects Significant Decline in Chinese Steel Production by 2026",
            "Summary": "JSW Steel anticipates a substantial reduction of 30-35 million tons in Chinese steel output by 2026. This projection suggests potential shifts in global steel market dynamics that could impact international steel producers and pricing.",
            "Sentiment": "neutral",
            "PublishDate": 1760934163389,
            "Source": "stock"
        },
        {
            "Title": "JSW Steel Confirms FY26 Goals, Plans INR 20,000 Crore Annual Capex",
            "Summary": "JSW Steel management has confirmed its sales and production targets for FY26 and expects annual capital spending of around INR 20,000 crores. The company aims to maintain its net debt to EBITDA ratio below 3X. Management expects iron ore prices to decline in Q3, while steel prices are projected to rise in November-December 2025. Coking coal costs are expected to increase by $3-5 per tonne in Q3. Morgan Stanley maintains an 'Overweight' rating on JSW Steel with a price target of Rs 1,300.",
            "Sentiment": "positive",
            "PublishDate": 1760931394936,
            "Source": "stock"
        },
        {
            "Title": "JSW Steel Executive Forecasts Mixed Commodity Price Trends for Q3",
            "Summary": "A JSW Steel executive has made several price predictions for key commodities. The executive anticipates iron ore prices will decline in Q3, while steel prices are expected to rise during November-December. Additionally, coking coal prices are forecasted to increase by $3-5 per tonne in Q3.",
            "Sentiment": "neutral",
            "PublishDate": 1760704869339,
            "Source": "stock"
        },
        {
            "Title": "JSW Steel Executive Forecasts 8-9% Growth in India's Steel Demand",
            "Summary": "A JSW Steel executive has predicted that India's steel demand will grow by 8-9% during the current fiscal year. This forecast indicates expected expansion in the domestic steel market.",
            "Sentiment": "positive",
            "PublishDate": 1760704290895,
            "Source": "stock"
        },
        {
            "Title": "JSW Steel Plans 690 Billion Rupees Capital Expenditure Over Three Years",
            "Summary": "JSW Steel announced capital expenditure plans of approximately 690 billion rupees over the next three years, with the investment program set to begin in the second half of FY26. The announcement was made by a company executive.",
            "Sentiment": "positive",
            "PublishDate": 1760703721805,
            "Source": "stock"
        },
        {
            "Title": "JSW Steel Executive Highlights Strong India Steel Demand Driven by Government Spending",
            "Summary": "A JSW Steel executive stated that India's steel demand continues to show strength, supported by government spending and steady consumption patterns. The company views the current demand environment as robust.",
            "Sentiment": "positive",
            "PublishDate": 1760703121423,
            "Source": "stock"
        },
        {
            "Title": "JSW Steel Reports 25.7% Drop in Net Profit Despite Revenue Growth",
            "Summary": "JSW Steel reported a net profit of Rs 1,623 crore for the quarter ended September 30, 2025, marking a 25.7% decline from Rs 2,184 crore in the previous quarter. Revenue increased 4.9% to Rs 44,560 crore from Rs 42,460 crore. EBITDA fell 6% to Rs 7,115 crore from Rs 7,576 crore, while margins compressed to 15.8% from 17.6% in the previous quarter. The results came close to analyst estimates across key metrics.",
            "Sentiment": "negative",
            "PublishDate": 1760694705337,
            "Source": "earnings"
        },
        {
            "Title": "JSW Steel Board Approves Reorganization of US Operations and Merger of Indian Units",
            "Summary": "JSW Steel's board has approved a reorganization of its US operations aimed at simplifying the company structure. The consolidation is designed to reduce legal entities and improve compliance, with no sale of foreign investments planned. Additionally, the board has approved the merger of specific Indian units. The company remains cautious about its future outlook for 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1760693462903,
            "Source": "stock"
        },
        {
            "Title": "JSW Steel Reports Strong Q2 Performance with Revenue Up 14% Year-on-Year",
            "Summary": "JSW Steel delivered quarterly revenue of 452 billion rupees, representing a 14% increase from 396 billion rupees in the same period last year, though falling slightly short of analyst estimates of 460.44 billion rupees. The company's consolidated net profit surged to 16.2 billion rupees from 4.4 billion rupees year-on-year, missing analyst expectations of 18.31 billion rupees. EBITDA rose to 71.15 billion rupees compared to 54.37 billion rupees in the previous year, coming close to estimates of 72 billion rupees. The EBITDA margin improved to 15.76% from 13.7% year-on-year, exceeding analyst projections of 15.6%.",
            "Sentiment": "positive",
            "PublishDate": 1760693075419,
            "Source": "earnings"
        },
        {
            "Title": "JSW Steel Reports Record Q2 Production of 7.90 Million Tonnes, Net Profit Rises 307% YoY to ₹1,646 Crores",
            "Summary": "JSW Steel announced its quarterly results with consolidated crude steel production reaching a record 7.90 million tonnes, up 17% year-on-year. The company reported consolidated revenue from operations of ₹45,152 crores and net profit after tax of ₹1,646 crores, representing a 307% increase compared to the same quarter last year. Adjusted EBITDA stood at ₹7,849 crores with a margin of 17.4%. Steel sales volume increased 20% YoY to 7.34 million tonnes. The company's net debt to equity ratio improved to 0.93x from 0.95x in the previous quarter. JSW Steel's Board approved several expansion projects including a 1 MTPA EAF facility in Kadapa, Andhra Pradesh, and various downstream capacity enhancements. The Supreme Court upheld JSW Steel's resolution plan for subsidiary BPSL, dismissing appeals from erstwhile promoters. The company commissioned India's first 25MW Green Hydrogen Electrolyser and secured Board approval for 2.5 GW of renewable energy capacity.",
            "Sentiment": "positive",
            "PublishDate": 1760693027786,
            "Source": "earnings"
        },
        {
            "Title": "JSW Steel Q2 Results Preview: Analysts Expect Margin Contraction Despite Strong Demand",
            "Summary": "JSW Steel is set to announce its second quarter financial results with analysts expecting mixed performance. Bloomberg estimates show revenue projected to rise 2% to Rs 44,171 crore, while profit is expected to decline 21% to Rs 1,727 crore and Ebitda to fall 8% to Rs 6,938 crore. Margins are forecast to compress to 15.71% from 17.55%. The performance reflects weaker steel price realizations offsetting gains from robust domestic demand and steady volume growth. Bank of America maintains a Buy rating with Rs 1,290 target, citing stronger domestic demand and potential policy support through higher import tariffs. Morgan Stanley expects mid-teens year-on-year growth with an Overweight rating and Rs 1,156.80 target. Jefferies projects 11% year-on-year net sales growth to Rs 43,900 crore with a Buy rating. ICICI Securities holds a more cautious view with a Hold rating and Rs 1,010 target. Key concerns include declining realizations of approximately Rs 3,000-3,500 per tonne quarter-on-quarter and higher input costs, while domestic demand strength and capacity additions provide support.",
            "Sentiment": "neutral",
            "PublishDate": 1760589714685,
            "Source": "earnings"
        },
        {
            "Title": "JSW Steel Schedules Analyst Conference Call for October 17 Following Q2 FY2026 Results",
            "Summary": "JSW Steel Limited will conduct a conference call with analysts on October 17, 2025, at 5:30 PM IST to discuss their quarterly and half-year financial results ending September 30, 2025. The call follows a Board of Directors meeting scheduled for the same day to consider the unaudited standalone and consolidated financial results. The management team participating includes Joint Managing Director & CEO Jayant Acharya, Whole Time Director & COO Gajraj Singh Rathore, Director Commercial & Marketing Arun Maheshwari, CFO Swayam Saurabh, and Group Head Investor Relations Ashwin Bajaj. The presentation will be available on the company's website at www.jsw.in. Dial-in numbers are provided for multiple regions including India, USA, UK, Singapore, and Hong Kong, with playback available from October 17-21, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760349043487,
            "Source": "corporate_action"
        },
        {
            "Title": "JSW Steel Reports Record Quarterly Crude Steel Production of 7.90 Million Tonnes",
            "Summary": "JSW Steel achieved record quarterly crude steel production of 7.90 million tonnes in Q2 FY26. Production increased 17% year-over-year and 9% quarter-over-quarter. The company operated at 92% capacity utilization during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1760068734065,
            "Source": "stock"
        },
        {
            "Title": "Supreme Court Dismisses PMLA Case Against JSW Steel",
            "Summary": "The Supreme Court has dismissed a Prevention of Money Laundering Act (PMLA) case against JSW Steel. This legal development removes the PMLA proceedings that were pending against the steel company.",
            "Sentiment": "positive",
            "PublishDate": 1759814947545,
            "Source": "stock"
        },
        {
            "Title": "Moody's Upgrades JSW Steel Outlook to Positive on Capacity Expansion and Growth Strategy",
            "Summary": "Moody's Ratings revised JSW Steel and its US subsidiary Periama Holdings LLC outlook to positive from stable while affirming Ba1 ratings. The upgrade reflects the company's capacity expansion, with production rising 20% in 15 months to 35.7 million tonnes per annum and plans for another 20% increase by 2028. Moody's expects JSW Steel's EBITDA per tonne to average ₹10,500-10,750 and projects earnings to reach ₹300 billion in FY26 and ₹350 billion in FY27. The ramp-up of facilities at Vijayanagar, Salem, Dolvi and BPSL is expected to boost sales volumes to nearly 32 million tonnes by FY27. The positive outlook is supported by JSW Steel's scale, earnings visibility, and ability to refinance debt while maintaining financial discipline, backed by India's steel demand growing at 5-7% annually.",
            "Sentiment": "positive",
            "PublishDate": 1759411835450,
            "Source": "stock"
        },
        {
            "Title": "Supreme Court Upholds JSW Steel's ₹19,700-Crore BPSL Resolution Plan After Overturning Earlier Judgment",
            "Summary": "The Supreme Court overturned its own judgment and upheld JSW Steel's ₹19,700-crore resolution plan for Bhushan Power and Steel Ltd (BPSL). The court rejected the committee of creditors' plea seeking an additional ₹6,100 crore, stating such claims have no basis under the Insolvency and Bankruptcy Code. BPSL was part of the RBI's original 'dirty dozen' referred for insolvency. In May 2025, the Supreme Court had scrapped JSW's plan citing delays and procedural violations, but reversed this decision after review petitions. JSW Steel acquired a 49% stake in BPSL through the insolvency process in 2021, later increasing it to 83% by October 2021, gaining 2.75 MTPA steel-making capacity in Odisha. The court noted that JSW had invested significantly and turned BPSL into a profitable entity. JSW Steel shares gained 1.5% following the announcement, trading 1.1% higher at ₹1,160.5.",
            "Sentiment": "positive",
            "PublishDate": 1758864948260,
            "Source": "order&deals"
        },
        {
            "Title": "Supreme Court Backs JSW Steel's Bhushan Power Acquisition",
            "Summary": "The Supreme Court has ruled in favor of JSW Steel regarding its purchase of Bhushan Power. The court dismissed a request from Bhushan Power's lenders who were seeking a share in the company's EBITDA.",
            "Sentiment": "positive",
            "PublishDate": 1758864444937,
            "Source": "order&deals"
        },
        {
            "Title": "JSW Steel Schedules Q2 2023 Results Review for October 17",
            "Summary": "JSW Steel has announced plans to review its Q2 2023 financial results on October 17. The steel company will be presenting its quarterly performance during this scheduled review.",
            "Sentiment": "neutral",
            "PublishDate": 1758784107887,
            "Source": "earnings"
        }
    ]
}