{
    "Symbol": "JTEKTINDIA",
    "ISIN": "INE643A01035",
    "News": [
        {
            "Title": "JTEKT India Opens Special Window for Share Transfers",
            "Summary": "JTEKT India Limited announces special window from February 05, 2026 to February 04, 2027 for re-lodgement of physical share transfer requests originally submitted before April 01, 2019.",
            "Sentiment": "neutral",
            "PublishDate": 1770279760961,
            "Source": "co_actions_results"
        },
        {
            "Title": "JTEKT India Gets Relief as GST Demand Dropped",
            "Summary": "JTEKT India Limited receives favorable order from Chennai Commercial Tax Department dropping GST demand of Rs. 3,63,25,998 under Section 74 of CGST Act 2017.",
            "Sentiment": "positive",
            "PublishDate": 1769753616363,
            "Source": "stocks"
        },
        {
            "Title": "JTEKT India Wins Rs 2.40 Cr Tax Appeal Case",
            "Summary": "JTEKT India Limited receives favorable order from Commissioner (Appeals) of CGST, Gurugram, dropping Rs. 2.40 crore demand related to supplementary invoices issued during July 2017 to March 2020.",
            "Sentiment": "positive",
            "PublishDate": 1769679327304,
            "Source": "stocks"
        },
        {
            "Title": "JTEKT India Wins GST Appeal Worth ₹43.11 Crores",
            "Summary": "JTEKT India Limited successfully appealed against GST demand of ₹14.37 crores and penalty of ₹28.74 crores, with Commissioner Appeal CGST Gurgaon allowing the appeal in full.",
            "Sentiment": "positive",
            "PublishDate": 1768486829337,
            "Source": "stocks"
        },
        {
            "Title": "JTEKT India clarifies volume surge is market-driven",
            "Summary": "JTEKT India informed BSE that recent significant volume increase in its scrip is purely due to market conditions with no undisclosed price-sensitive information pending announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1767688952136,
            "Source": "stocks"
        },
        {
            "Title": "JTEKT India Approves CVJ Line Capacity Expansion Plan",
            "Summary": "JTEKT India has approved a plan to expand its CVJ line capacity by 0.4 million units, bringing total capacity from the current 0.8 million to 1.2 million by August 2027. The expansion will be funded through internal funds and loans, addressing the current 90% capacity utilization rate.",
            "Sentiment": "positive",
            "PublishDate": 1764914692814,
            "Source": "stock"
        },
        {
            "Title": "JTEKT India Concludes Voluntary Retirement Scheme with Rs. 35.22 Million Financial Impact",
            "Summary": "JTEKT India Limited has completed its Voluntary Retirement/Separation Scheme for eligible workmen with a total financial impact of Rs. 35.22 million towards settlement costs. The scheme, which was announced on November 12, 2025, has now been concluded and affects the company's financial position through separation-related expenses.",
            "Sentiment": "neutral",
            "PublishDate": 1764417732752,
            "Source": "stock"
        },
        {
            "Title": "JTEKT India Reports 5.6% Sales Growth in H1 FY26 Despite Margin Pressure from Fixed Costs",
            "Summary": "JTEKT India achieved 5.6% sales growth in the first half of FY26, outperforming the passenger vehicle market's 1.6% growth, while EBITDA margins improved to 7.2% in Q2 from 5.3% in Q1. The company faced margin pressure due to higher employee costs and delayed new product launches, but expects recovery through expanded exports to Brazil, new product ramp-ups including e-Vitara supplies, and capacity expansion with INR 460 crores CAPEX across multiple facilities.",
            "Sentiment": "neutral",
            "PublishDate": 1763619369398,
            "Source": "earnings"
        },
        {
            "Title": "JTEKT India Reports 4% Revenue Growth But EBITDA Margin Declines in H1 FY26",
            "Summary": "JTEKT India Limited achieved 4% revenue growth to Rs 12,051 million in the first half of FY26, outperforming industry growth of 1.6% due to better vehicle model presence and new drive shaft product introduction. The company's EBITDA margin declined from 7.6% to 6.3% due to increased employee costs from salary increments, higher power tariffs, and adverse product mix affecting profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1763381648528,
            "Source": "earnings"
        },
        {
            "Title": "JTEKT India Reports Q2 Results, Announces Leadership Changes and Voluntary Retirement Scheme",
            "Summary": "JTEKT India Limited announced its unaudited financial results for the second quarter and half year ended September 30, 2025. The company reported revenue from operations of INR 85,010.58 lakhs for Q2 FY2026 compared to INR 80,055.93 lakhs in Q2 FY2025. Net profit for the quarter stood at INR 1,821.77 lakhs versus INR 2,764.11 lakhs in the previous year. For the half year, revenue increased to INR 168,388.28 lakhs from INR 158,551.36 lakhs, while net profit declined to INR 2,955.79 lakhs from INR 3,423.43 lakhs. The Board approved key leadership appointments following the superannuation of Mr. Dinesh Goel from Corporate Quality Department. Mr. Harmeet Singh Bedi was appointed as Function Head Corporate Quality, and Mr. Amit Kumar Sharma as Function Head Design Development, both designated as Senior Managerial Personnel effective November 12, 2025. The company also introduced a Voluntary Retirement/Separation Scheme for eligible workmen, with implementation status and financial impact to be communicated later. Cash and cash equivalents increased significantly to INR 20,192.18 lakhs from INR 1,630.82 lakhs, supported by proceeds from a rights issue of INR 24,718.70 lakhs during the period.",
            "Sentiment": "neutral",
            "PublishDate": 1762972537302,
            "Source": "earnings"
        },
        {
            "Title": "JTEKT India Submits Monitoring Report for Rs 249.89 Crore Rights Issue Fund Utilization",
            "Summary": "JTEKT India Limited submitted its monitoring agency report for fund utilization from its rights issue of equity shares worth Rs 249.89 crore for the quarter ended September 30, 2025. The report was prepared by Brickwork Ratings India Private Limited and shows no deviation from stated objectives. The funds are allocated across five main purposes: Rs 113.51 crore for construction of production facility infrastructure in Gujarat (Rs 22.70 crore utilized), Rs 55.37 crore for capital expenditure on equipment and machinery for Dharuhera facility (no utilization yet), Rs 24.00 crore for repayment of borrowings (no utilization), Rs 53.89 crore for general corporate purposes (Rs 24.70 crore utilized), and Rs 3.12 crore for issue expenses (Rs 2.44 crore utilized). The rights issue period was from August 4, 2025 to August 12, 2025. Unutilized proceeds are deployed in fixed deposits with Axis Bank at interest rates ranging from 4.75% to 7.50%.",
            "Sentiment": "neutral",
            "PublishDate": 1762935430633,
            "Source": "corporate_action"
        },
        {
            "Title": "JTEKT India Reports Mixed Q2 Results with Revenue Growth but Lower Profitability",
            "Summary": "JTEKT India reported quarterly revenue of 6.4 billion rupees compared to 6.1 billion rupees in the same period last year. However, the company's net profit declined to 182 million rupees from 195 million rupees year-over-year. EBITDA also decreased to 463 million rupees from 472 million rupees, while EBITDA margin compressed to 7.24% from 7.8% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762933155824,
            "Source": "earnings"
        },
        {
            "Title": "JTEKT India GST Demand of Rs 24.70 Lakh Dropped by Chennai Tax Authority",
            "Summary": "JTEKT India Limited received an order from the Joint Commissioner (ST) office in Chennai dropping a GST demand of Rs 24,70,944. The company had filed a reply with the Joint Commissioner SGST office Chennai regarding the demand raised in DRC-01, which was accepted by the authority. The GST demand was under section 73/74 of CGST Act 2017. The company stated there is no financial impact from this development.",
            "Sentiment": "positive",
            "PublishDate": 1762068194748,
            "Source": "stock"
        },
        {
            "Title": "JTEKT India Receives GST Show Cause Notice for Rs 3.63 Crore Demand Related to Amalgamated Subsidiary",
            "Summary": "JTEKT India Limited received a Show Cause Notice from the Office of the Joint Commissioner of State Goods & Services Tax, Chennai, concerning its amalgamated subsidiary JTEKT Sona Automotive India Limited. The notice relates to the applicability of GST on expatriates under Reverse Charge Mechanism and demands IGST of Rs 3.63 crore for FY 2019-20, along with penalty under Section 74(5) of the CGST Act, 2017 and interest under Section 50. The company received the notice on September 25, 2025. JTEKT India stated there is no impact on financials, operations or other activities as they are in the process of filing a reply against the notice.",
            "Sentiment": "negative",
            "PublishDate": 1758865233267,
            "Source": "stock"
        },
        {
            "Title": "JTEKT India Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "JTEKT India reported quarterly results showing revenue growth to 5.66 billion rupees compared to 5.53 billion rupees in the same period last year. However, net profit declined to 108 million rupees from 149 million rupees year-over-year. EBITDA decreased to 309 million rupees from 374 million rupees, while EBITDA margin compressed to 5.45% from 6.76% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1755156551041,
            "Source": "earnings"
        },
        {
            "Title": "JTEKT India Raises ₹249.89 Crore Through Rights Issue",
            "Summary": "JTEKT India has completed a rights issue, allotting 2.31 crore shares at ₹108.10 per share, raising a total of ₹249.89 crore. The company successfully executed this equity fundraising through the rights offering mechanism.",
            "Sentiment": "neutral",
            "PublishDate": 1755101287173,
            "Source": "corporate_action"
        },
        {
            "Title": "JTEKT India Revises Wholetime Director Yosuke Fujiwara's Remuneration Package",
            "Summary": "JTEKT India Limited has issued an addendum to its 41st Annual General Meeting notice to include revised remuneration for Wholetime Director Yosuke Fujiwara, effective from July 1, 2025, until his tenure ends on January 31, 2027. The Board approved the revision on July 15, 2025, adding previously missed components typically extended to senior expatriate officials. The new package includes a company car for family use, school fee reimbursement for dependent children, and shifting/relocation expenses upon tenure completion. His basic salary remains unchanged at Rs. 4,00,000 per month, with rent-free accommodation at Rs. 4,50,000 per month. Fujiwara, a 50-year-old Japanese national with over 25 years of experience, was initially appointed as Wholetime Director from February 1, 2025. The revision requires shareholder approval through a special resolution at the upcoming AGM scheduled for August 28, 2025. The company manufactures automotive steering systems and driveline components for major customers including Maruti Suzuki, Toyota Kirloskar, and Mahindra & Mahindra.",
            "Sentiment": "neutral",
            "PublishDate": 1754048029693,
            "Source": "corporate_governance"
        },
        {
            "Title": "JTEKT India Completes Dispatch of Rights Issue Documents to Eligible Shareholders",
            "Summary": "JTEKT India Limited has completed the dispatch of Letter of Offer, Application Form, and Rights Entitlement Letter for its Rights Issue of Equity Shares to eligible shareholders as of July 29, 2025. The dispatch was conducted in compliance with SEBI regulations for shareholders on record as of July 25, 2025. The company had previously received in-principle approval from BSE Limited and National Stock Exchange of India Limited on July 17, 2025, with the Board of Directors approving the terms of the Rights Issue on July 21, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753789612405,
            "Source": "corporate_action"
        },
        {
            "Title": "JTEKT India Announces ₹24,989 Crore Rights Issue at 1:11 Ratio",
            "Summary": "JTEKT India Limited has announced a rights issue to raise up to ₹24,988.84 lakhs through 23,116,407 fully paid-up equity shares. The rights entitlement ratio is set at 1 new share for every 11 existing shares held, priced at ₹108.10 per share (including premium of ₹107.10). The record date is July 25, 2025, with the issue opening on August 4, 2025 and closing on August 12, 2025. Rights entitlements will be credited to eligible shareholders' demat accounts and can be traded or renounced. The company's outstanding equity shares will increase from 254,280,483 to 277,396,890 shares assuming full subscription. Both BSE Limited and National Stock Exchange of India Limited have provided in-principle approval for the rights issue.",
            "Sentiment": "neutral",
            "PublishDate": 1753156499492,
            "Source": "corporate_action"
        },
        {
            "Title": "JTEKT India Approves Rights Issue Fundraising Plan",
            "Summary": "JTEKT India has approved a fundraising plan of up to 250 crore rupees through a rights issue. This decision indicates the company's intention to raise capital by offering new shares to existing shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1752559401000,
            "Source": "default"
        },
        {
            "Title": "JTEKT Board to Discuss Rights Issue Fundraising on July 15",
            "Summary": "JTEKT has scheduled a board meeting for July 15 to discuss fundraising through a rights issue. The company is considering this corporate action as a potential method to raise capital.",
            "Sentiment": "neutral",
            "PublishDate": 1752127231000,
            "Source": "default"
        },
        {
            "Title": "JTEKT India Reports Q4 EBITDA Decline",
            "Summary": "JTEKT India's Q4 EBITDA decreased to 566 million rupees from 697 million rupees year-over-year. The company's Q4 EBITDA margin also declined to 8.72% from 11.03% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1747988656000,
            "Source": "result"
        },
        {
            "Title": "JTEKT India Reports Q4 Financial Results",
            "Summary": "JTEKT India has released its Q4 financial results. The company reported revenue of 6.5 billion rupees, compared to 6.32 billion rupees in the same quarter last year. Net profit for the quarter stood at 247 million rupees, down from 343 million rupees in the year-ago period.",
            "Sentiment": "neutral",
            "PublishDate": 1747988620000,
            "Source": "result"
        },
        {
            "Title": "JTEKT India Reports Decline in Q3 EBITDA and Margin",
            "Summary": "JTEKT India's Q3 EBITDA decreased to 436 million rupees from 510 million rupees year-over-year. The company's EBITDA margin also fell to 7.36% from 9.24% in the same period last year, indicating a significant reduction in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1738222444000,
            "Source": "earnings"
        },
        {
            "Title": "JTEKT India Reports Q3 Financial Results",
            "Summary": "JTEKT India has announced its financial results for the third quarter. The company reported a net profit of 163 million rupees, down from 238 million rupees in the same period last year. However, revenue increased to 5.9 billion rupees from 5.5 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738222394000,
            "Source": "earnings"
        },
        {
            "Title": "JTEKT India Reports Decline in Q2 EBITDA and Margin",
            "Summary": "JTEKT India's Q2 EBITDA decreased to 472 million rupees from 602 million rupees year-over-year. The company's EBITDA margin also fell to 7.8% from 10.3% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731569394000,
            "Source": "result"
        },
        {
            "Title": "JTEKT India Reports Q2 Financial Results",
            "Summary": "JTEKT India has announced its Q2 financial results. The company reported a net profit of 195 million rupees, down from 302 million rupees in the same quarter last year. Revenue for Q2 increased to 6.1 billion rupees from 5.9 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731569304000,
            "Source": "result"
        },
        {
            "Title": "JTEKT India to Invest 2.5 Billion Rupees in New Plant",
            "Summary": "<p><span class=\"positive\">JTEKT India</span> has announced plans to <span class=\"positive\">invest</span> <b>2.5 billion rupees</b> in the construction of a <span class=\"positive\">new manufacturing plant</span>. This <span class=\"positive\">significant investment</span> indicates the company's <span class=\"positive\">commitment</span> to <span class=\"positive\">expanding</span> its production capabilities and potentially its market presence.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728293672000,
            "Source": "corporate_action"
        }
    ]
}