{
    "Symbol": "JTLIND",
    "ISIN": "INE391J01032",
    "News": [
        {
            "Title": "JTL Industries Q3FY26 Results Show Mixed Performance",
            "Summary": "JTL Industries reported consolidated revenue of ₹47,051.71 lakhs for Q3FY26, up from ₹42,930.46 lakhs in Q2FY26. Net profit reached ₹2,648.73 lakhs with EPS of ₹0.67. Nine-month revenue stood at ₹144,368.17 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1769500078392,
            "Source": "co_actions_results"
        },
        {
            "Title": "JTL Industries Board Meet Set for Jan 24, 2026",
            "Summary": "JTL Industries Limited has scheduled a board meeting on January 24, 2026, to consider and approve unaudited financial results for Q3 FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768824770067,
            "Source": "co_actions_results"
        },
        {
            "Title": "JTL Industries Hits Upper Circuit on PSTCL Order Win",
            "Summary": "JTL Industries shares surge 20% to ₹61.84 after securing major order from Punjab State Transmission Corporation for 220kV transmission tower materials, strengthening its power infrastructure position.",
            "Sentiment": "positive",
            "PublishDate": 1768216110588,
            "Source": "co_actions_results"
        },
        {
            "Title": "JTL Industries Wins PSTCL Transmission Tower Order",
            "Summary": "JTL Industries secured order from Punjab State Transmission Corporation Limited for 220kV transmission tower manufacturing and galvanisation, to be executed within FY 2025-26. Stock surged 20% following announcement.",
            "Sentiment": "positive",
            "PublishDate": 1768214703671,
            "Source": "co_actions_results"
        },
        {
            "Title": "JTL Industries: Promoter Group Inter-se Share Transfer",
            "Summary": "Pranav Singla acquires 87,93,428 equity shares (2.24%) from father Vijay Singla through gift transaction on December 10, 2025, under SEBI SAST exemption for immediate relatives.",
            "Sentiment": "neutral",
            "PublishDate": 1767788237650,
            "Source": "co_actions_results"
        },
        {
            "Title": "JTL Industries Records 3.35% Growth in Sales Volume",
            "Summary": "JTL Industries achieved record sales volumes of 272,639 MT for 9 months in FY26, marking a 3.35% year-over-year growth compared to the previous period.",
            "Sentiment": "positive",
            "PublishDate": 1767351031023,
            "Source": "stocks"
        },
        {
            "Title": "JTL Industries Receives GST Demand of ₹31.50 Lacs",
            "Summary": "JTL Industries receives GST demand notice of ₹31.50 lacs plus penalty from Central GST authorities for period 2017-2019. Company disputes demand citing recent GST circular clarifications.",
            "Sentiment": "negative",
            "PublishDate": 1766577640738,
            "Source": "stocks"
        },
        {
            "Title": "JTL Industries Announces Strategic Merger Deal",
            "Summary": "JTL Industries announces merger with private entity to expand market reach, with transaction expected to close by Q2 2024, marking significant strategic expansion move.",
            "Sentiment": "positive",
            "PublishDate": 1765605418224,
            "Source": "co_actions_results"
        },
        {
            "Title": "JTL Industries: SEBI Report Filed for Share Transfer",
            "Summary": "Pranav Singla filed mandatory SEBI report under Regulation 10(7) for inter-se transfer of 87.93 lakh shares from father, paying ₹1.77 lakh fees including GST.",
            "Sentiment": "neutral",
            "PublishDate": 1765542854901,
            "Source": "co_actions_results"
        },
        {
            "Title": "JTL Industries: Promoter Group Plans Inter-Family Share Transfer of 87.93 Lakh Equity Shares",
            "Summary": "Pranav Singla will acquire 87,93,428 equity shares (2.24% stake) of JTL Industries from his father Vijay Singla through a gift transfer without consideration, scheduled on or after December 10, 2025. The inter-family transfer among immediate relatives is exempt from open offer requirements under SEBI regulations, with overall promoter group shareholding remaining unchanged at 49.26%.",
            "Sentiment": "neutral",
            "PublishDate": 1764824225819,
            "Source": "corporate_action"
        },
        {
            "Title": "JTL Industries Completes INR 46.5 Crore Acquisition of RCI Industries Technologies",
            "Summary": "JTL Industries Limited has paid the full consideration amount of INR 46.5 crores for acquiring RCI Industries Technologies Limited as per the NCLT-approved Resolution Plan, with management control handed over on November 20, 2025. The acquisition marks JTL's strategic entry into the copper products segment, expanding its product ecosystem beyond steel pipes to become a diversified multi-material solutions provider.",
            "Sentiment": "positive",
            "PublishDate": 1763717943890,
            "Source": "order&deals"
        },
        {
            "Title": "JTL Industries Whole-time Director Acquires 4 Lakh Equity Shares",
            "Summary": "Dhruv Singla, Whole-time Director and Promoter Group member of JTL Industries Limited, acquired 4,00,000 equity shares representing 0.10% of the paid-up equity share capital through open market transactions on November 20, 2025. The acquisition was disclosed under SEBI regulations for substantial acquisition of shares and takeovers to BSE and NSE exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1763647711534,
            "Source": "corporate_action"
        },
        {
            "Title": "JTL Industries Promoter Pranav Singla Acquires 5 Lakh Shares from Open Market",
            "Summary": "Pranav Singla, Whole-time Director and Promoter Group member of JTL Industries Limited, acquired 5,00,000 equity shares representing 0.13% of the paid-up equity share capital on November 19, 2025. Following this open market acquisition, Singla's total shareholding increased to 53,88,068 shares, representing 1.37% of the company's total share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1763555222111,
            "Source": "corporate_action"
        },
        {
            "Title": "JTL Industries Completes ₹46.50 Crore Payment for RCI Industries Acquisition",
            "Summary": "JTL Industries Limited has completed the full payment of ₹46.50 crores for acquiring RCI Industries Technologies Limited under an NCLT-approved resolution plan, with the final 50% tranche of ₹23.25 crores disbursed on November 19, 2025. The company successfully met the 60-day payment timeline following the tribunal's approval, having earlier paid the first tranche of ₹23.25 crores on November 7, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763544535526,
            "Source": "order&deals"
        },
        {
            "Title": "JTL Industries Reports 37% Q-o-Q PAT Growth Despite 20.5% Revenue Decline in Q2 FY26",
            "Summary": "JTL Industries achieved consolidated PAT of INR 22 crores in Q2 FY26 versus INR 16 crores in Q1, marking 37% quarter-on-quarter growth despite revenue dropping to INR 431 crores from INR 544 crores due to Punjab floods impacting 23,000 tons of dispatches. The company maintains its annual volume guidance of 4.5-5 lakh tons for FY26 and targets 6.5 lakh tons for FY27, with EBITDA per ton improving to INR 4,300 in Q2 from INR 2,300 in Q1 as DFT products turned EBITDA positive.",
            "Sentiment": "positive",
            "PublishDate": 1763366618404,
            "Source": "earnings"
        },
        {
            "Title": "JTL Industries' Rs 675 Crore Warrant Issue Expires Unexercised Due to Low Share Price",
            "Summary": "JTL Industries' 18-month warrant issue period concluded on August 1, 2025, with no warrants converted to equity shares as the stock price remained below the exercise price throughout the period. The company received only Rs 168.75 crore (25% application money) out of the planned Rs 675 crore, creating a significant funding shortfall that impacts project viability, though the company plans to continue projects through internal accruals.",
            "Sentiment": "negative",
            "PublishDate": 1763140950817,
            "Source": "corporate_action"
        },
        {
            "Title": "JTL Industries Reports 48% QoQ EBITDA Growth and 34% PAT Increase in Q2 FY26",
            "Summary": "JTL Industries Limited, a steel tube manufacturing company, announced its financial results for the quarter ended September 30, 2025. The company reported EBITDA growth of 48% quarter-on-quarter to ₹346.53 million with an 8.07% margin. Profit After Tax (PAT) increased 34% QoQ to ₹221.61 million. EBITDA per metric tonne surged 83% to ₹4,247, indicating improved operational efficiency. Sales volume for Q2 reached 81,593 MT, while total income stood at ₹4,312.83 million. For the first half of FY26, sales volumes rose 3.5% year-on-year to 182,210 MT with total income of ₹9,808.90 million. The company achieved a technological milestone by producing its first batch of 0.04mm ultra-thin brass foil for the defense and industrial foil segment. JTL also announced a capacity expansion with a new ERW pipe manufacturing line focused on API-grade, high-thickness pipes for oil & gas, water transmission, and CGD sectors. The company operates manufacturing facilities in Punjab, Maharashtra, and Chhattisgarh with a cumulative capacity of 936,000 MTPA for pipe manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1762778899604,
            "Source": "earnings"
        },
        {
            "Title": "JTL Industries Reports Decline in Q2 Revenue and Net Profit",
            "Summary": "JTL Industries reported quarterly net profit of 199 million rupees, down from 264 million rupees in the same period last year. Revenue fell to 3.7 billion rupees from 4.8 billion rupees year-over-year. EBITDA decreased slightly to 295 million rupees from 298.5 million rupees, while EBITDA margin improved to 7.94% from 6.22% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762760689895,
            "Source": "earnings"
        },
        {
            "Title": "JTL Industries Launches CC Copper Product, Plans to Double Production to 500 MT/Month",
            "Summary": "JTL Industries Limited announced the launch of Continuous Cast (CC) Copper as a new product in its non-ferrous portfolio. The company currently produces approximately 100 metric tonnes of brass per month and expects total monthly production to double to around 200 metric tonnes with the addition of CC Copper. JTL plans to ramp up total production to 500 metric tonnes per month by the end of Q4. The CC Copper product achieves a thickness of 0.08 mm and targets applications in electric vehicles, renewable energy, and infrastructure sectors including battery connectors, solar panels, and power distribution systems. The company's existing brass products are manufactured at 18 mm thickness and processed down to 0.04 mm. JTL Industries is a steel tube manufacturer with facilities in Punjab, Maharashtra, and Chhattisgarh, having a cumulative capacity of approximately 936,000 MTPA for pipe manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1760690330130,
            "Source": "stock"
        },
        {
            "Title": "JTL Industries Receives NCLT Approval to Acquire RCI Industries for Rs 46.5 Crores",
            "Summary": "JTL Industries Limited has received approval from the National Company Law Tribunal (NCLT) in New Delhi for the acquisition of RCI Industries & Technologies Limited through a resolution process. The transaction, valued at Rs 46.5 crores, is fully funded through internal accruals and recently raised capital. JTL had entered an MOU with RCI during Q4FY25 for production of up to 200MT/month of copper and brass alloys via job-work. The acquisition brings RCI's manufacturing plant in Baddi, Himachal Pradesh, which spans 27,000 sq. meters with an installed capacity of 18,000 MTPA for brass & copper strips, 2,000 MTPA for copper wires, and 2,000 MTPA for copper cables. RCI manufactures diversified copper, brass, stainless steel, and special alloy products, serving clients including Havells, Technocraft Industries, Finolex, KDDL Ltd., and the defence sector. The acquisition allows JTL to enter new niche markets, particularly defense components and supply of bullet shells and coin-related components to Mint Factory. Management expects the acquisition to significantly contribute to topline by FY27 and reduce dependence on cyclical steel prices while supporting more stable margins.",
            "Sentiment": "positive",
            "PublishDate": 1760375322998,
            "Source": "order&deals"
        },
        {
            "Title": "JTL Industries Receives NCLT Approval to Acquire RCI Industries for Rs 46.50 Crores",
            "Summary": "JTL Industries Limited has received approval from the National Company Law Tribunal, New Delhi for its resolution plan to acquire RCI Industries & Technologies Limited through a Corporate Insolvency Resolution Process. The NCLT order was dated October 9, 2025. JTL will acquire 95% shareholding in RCI for an upfront cash payment of Rs 46.50 crores, with completion required within 60 days of the NCLT approval. RCI is a BSE-listed company incorporated in 1992 that manufactures diversified copper, brass, aluminum, stainless steel and special alloy products. RCI operates a manufacturing plant in Baddi, Himachal Pradesh with installed capacity of 18,000 MTPA for brass & copper strips and 2,000 MTPA for copper wires and cables. The acquisition will allow JTL to broaden its portfolio with flat and round non-ferrous metal products, particularly copper, strengthening its market position in the non-ferrous sector. RCI's turnover has declined significantly from Rs 1,642.36 crores in 2018-19 to Rs 1.18 crores in 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1760170124746,
            "Source": "order&deals"
        },
        {
            "Title": "JTL Industries Achieves Record H1 FY26 Volumes of 1,82,210 MT Despite Flood Impact",
            "Summary": "JTL Industries reported its highest half-year volumes for H1 FY26 at 1,82,210 metric tons, representing a 3.5% increase compared to the same period in the previous year. The company achieved this growth despite facing challenges from floods during the period.",
            "Sentiment": "positive",
            "PublishDate": 1759720615722,
            "Source": "stock"
        },
        {
            "Title": "JTL Industries Shareholders Approve Director Re-appointments and New Board Addition",
            "Summary": "JTL Industries Limited shareholders approved key board changes at their 34th Annual General Meeting held on September 23, 2025. The company re-appointed Dhruv Singla and Pranav Singla as Whole-time Directors for 5-year terms each. Both directors were previously appointed in August 2021 with tenures set to expire in August 2026. Additionally, shareholders approved the appointment of Jagdeep Kumar Goel as Non-Executive Non-Independent Director. Goel brings over 30 years of experience in taxation, finance, and legal affairs, having served in the Income Tax Department from 1989 to 2022 in senior roles including Principal Commissioner and Director in the CBDT. The board recommendations were initially approved in their August 27, 2025 meeting. Dhruv Singla is the son of Managing Director Madan Mohan, while Pranav Singla is Madan Mohan's nephew, making them cousins. Goel has no family relationships with existing directors or key management personnel.",
            "Sentiment": "neutral",
            "PublishDate": 1758639282633,
            "Source": "corporate_governance"
        },
        {
            "Title": "JTL Industries Receives Three Star Export House Status from DGFT",
            "Summary": "JTL Industries Limited has been awarded the 'Three Star Export House' status by the Directorate General of Foreign Trade (DGFT). The recognition is valid for five years from September 4, 2025 to September 4, 2030. This accreditation acknowledges JTL's consistent contributions to India's export performance and reflects the company's strong export capabilities and adherence to quality standards. The status provides benefits including faster customs clearances, access to export promotion schemes, and easier facilitation for international trade operations. JTL is a steel tube manufacturing company specializing in ERW Black Pipes, Pre-Galvanized and Galvanized Steel Pipes, large diameter tubes and hollow structures, with manufacturing facilities in Punjab, Maharashtra, and Chhattisgarh and a cumulative capacity of approximately 936,000 MTPA for pipe manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1758176771874,
            "Source": "stock"
        },
        {
            "Title": "JTL Industries Appoints New CFO and Enters Joint Bidding Agreement with Nalwa Steel",
            "Summary": "JTL Industries Limited announced leadership changes in its finance department, with Atul Garg resigning as Chief Financial Officer and Naveen Kumar Laroiya being appointed as the new CFO, both effective September 11, 2025. The company's board also approved entering into a Joint Bidding Agreement with Nalwa Steel and Power Limited to participate jointly in a SEBI-organized e-auction with a 50:50 consortium ratio. Laroiya brings 35 years of finance and commercial experience across India, Nepal, and Egypt, with expertise in manufacturing, financial services, and multinational corporate environments. He has previously worked with prominent groups including Aditya Birla, Paul Merchants, and Dhunseri Petrochem, with specialization in corporate finance, audit, compliance, and business restructuring.",
            "Sentiment": "neutral",
            "PublishDate": 1757607958026,
            "Source": "corporate_governance"
        },
        {
            "Title": "JTL Industries Board Approves Key Leadership Appointments and Employee Stock Option Scheme",
            "Summary": "JTL Industries Limited's Board of Directors approved several key appointments and re-appointments during their August 27, 2025 meeting. The board re-appointed Mr. Madan Mohan as Managing Director, Mr. Dhruv Singla and Mr. Pranav Singla as Executive Directors for five-year terms from August 18, 2026 to August 17, 2031. Mr. Jagdeep Kumar Goel was appointed as Additional Director in a non-executive capacity. The board also approved the JTL Industries Limited Employees Stock Option Scheme 2025, allowing stock options for employees of subsidiary companies. Additionally, the board scheduled the 34th Annual General Meeting for September 23, 2025 via video conferencing, set the dividend record date as September 12, 2025, and appointed M/s S.V. Associates as scrutinizer for the AGM voting process. All appointments are subject to shareholder approval at the upcoming AGM.",
            "Sentiment": "positive",
            "PublishDate": 1756297235111,
            "Source": "corporate_governance"
        },
        {
            "Title": "JTL Industries Reports Q1 FY26 Results with Revenue of INR 5,496 Million and 3% PAT Margin",
            "Summary": "JTL Industries held an earnings conference call to discuss quarterly results ended June 30, 2025. The company reported total income of INR 5,496 million with EBITDA of INR 233 million, translating to 4.3% EBITDA margin. Profit after tax stood at INR 165.5 million with 3% PAT margin. Sales volume reached 1,08,406 metric tons, with value-added products accounting for 20% of sales mix. Export volume was 6,404 metric tons, constituting 6% of total sales. The company initiated plans for commissioning ASTM/API-grade pipe production and entered ultra-thin brass foil manufacturing through job-work arrangement. Management faced inventory losses of INR 1,000 per ton due to HR coil price corrections in June after increases in April-May. DFT product sales reached 7,500-8,000 metric tons in the quarter. The company maintains volume guidance of 5 lakh tons for FY26 and targets 30% volume growth for FY27. EBITDA per ton guidance of INR 4,000 remains intact, with long-term target of INR 5,000 plus EBITDA per ton by FY28.",
            "Sentiment": "neutral",
            "PublishDate": 1753271483771,
            "Source": "earnings"
        },
        {
            "Title": "JTL Industries Plans New ASTM/API-Grade Pipe Production",
            "Summary": "JTL Industries has announced plans to start production of ASTM/API-grade pipes, aiming to enter higher-grade markets such as oil & gas and water transmission. This information was shared during a conference call, indicating the company's strategic move to expand its product offerings and target new market segments.",
            "Sentiment": "positive",
            "PublishDate": 1752809252000,
            "Source": "default"
        },
        {
            "Title": "JTL Industries Sets Export and EBITDA Goals, Outlines Sales and Capex Targets",
            "Summary": "JTL Industries has announced several strategic goals and targets during a conference call. The company aims to increase exports to 10% of sales and achieve an EBITDA of over INR 5,000 per ton by FY28. Additionally, JTL Industries targets a sales volume of 500,000 tons in FY26, with a 30% growth expected for FY27. The company has also provided FY26 capex guidance of ₹240-250 crores, with a potential variation of ±10%.",
            "Sentiment": "positive",
            "PublishDate": 1752809188000,
            "Source": "default"
        },
        {
            "Title": "Jtl Industries Reports Q1 Financial Results",
            "Summary": "Jtl Industries has announced its financial results for the first quarter. The company reported a net profit of 159 million rupees, down from 307 million rupees in the same quarter last year. Revenue for Q1 stood at 5 billion rupees, compared to 5.15 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1752711103000,
            "Source": "default"
        },
        {
            "Title": "JTL Industries Reports Decline in Q1 Financial Performance",
            "Summary": "JTL Industries has reported its Q1 financial results. The company's EBITDA decreased to 208 million rupees from 399 million rupees year-over-year. The EBITDA margin fell to 4.13% from 7.75% in the same period last year. Net profit declined to 159 million rupees from 307 million rupees year-over-year. Revenue slightly decreased to 5 billion rupees from 5.15 billion rupees in the previous year's Q1.",
            "Sentiment": "negative",
            "PublishDate": 1752665597000,
            "Source": "result"
        },
        {
            "Title": "JTL Industries to Hold Q1 FY26 Results Conference Call",
            "Summary": "Nuvama Wealth Management will host a conference call with JTL Industries' management to review the company's Q1 FY26 financial results. The call is scheduled for Thursday, July 17.",
            "Sentiment": "neutral",
            "PublishDate": 1752307365000,
            "Source": "default"
        },
        {
            "Title": "JTL Industries: New Pipe Manufacturing Facility Boosts Share Price",
            "Summary": "JTL Industries plans to set up a new Electric Resistance Welded pipe manufacturing facility within 12 months, adding 3 lakh million ton per annum capacity. The facility will target the ASTM/API-grade pipe market, strengthening the company's position in value-added and high-strength steel pipe segments. The company's share price hit a four-month high, rising 6.26% to Rs 85.96.",
            "Sentiment": "positive",
            "PublishDate": 1752137631000,
            "Source": "corporate_action"
        },
        {
            "Title": "JTL Industries Plans Expansion into High-Margin Segments",
            "Summary": "JTL Industries has reported an annual revenue of approximately ₹2000 crore. The company is planning a significant expansion that could more than double this amount once operations begin. JTL Industries aims to diversify into high-margin industries such as Oil & Gas, Water Transmission, and City Gas Distribution (CGD). The expansion plans target EBITDA margins of ₹7,000–₹8,000 per metric ton. As part of this strategy, the company has entered the API-grade ERW pipe segment, focusing on profitable markets. The expansion is expected to result in over ₹7,000 margins and increase the company's product range to more than 500 SKUs.",
            "Sentiment": "positive",
            "PublishDate": 1752135300000,
            "Source": "default"
        },
        {
            "Title": "JTL Industries Introduces New ERW Production Line with 300,000 MTPA Capacity",
            "Summary": "JTL Industries has announced the introduction of a new ASTM/API-Grade ERW (Electric Resistance Welded) production line. This new line has an annual production capacity of 300,000 MTPA (Metric Tons Per Annum). The addition of this production line represents a significant expansion of the company's manufacturing capabilities in the steel pipe industry.",
            "Sentiment": "positive",
            "PublishDate": 1752135082000,
            "Source": "default"
        },
        {
            "Title": "JTL Industries Reports 26.5% Year-on-Year Sales Volume Growth in Q1 FY26",
            "Summary": "JTL Industries has announced a significant increase in its sales volume for the first quarter of fiscal year 2026. The company's sales volume reached a record 1,08,406 metric tons, representing a 26.5% year-on-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1751341022000,
            "Source": "default"
        },
        {
            "Title": "JTL Industries Reports Decline in Q4 EBITDA and Margin",
            "Summary": "JTL Industries has reported its quarterly results. The company's Q4 EBITDA decreased to 174 million rupees from 367.4 million rupees in the same quarter last year. The Q4 EBITDA margin also declined to 3.73% from 7.89% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748340629000,
            "Source": "result"
        },
        {
            "Title": "JTL Industries Reports Q4 Financial Results",
            "Summary": "JTL Industries has released its Q4 financial results. The company's revenue remained stable at 4.66 billion rupees, showing no year-over-year change. However, the standalone net profit decreased to 167.7 million rupees from 291 million rupees in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1748340415000,
            "Source": "result"
        },
        {
            "Title": "JTL Industries Launches Ultra-Thin Brass Foil for Defence and Industrial Markets",
            "Summary": "JTL Industries has expanded its product range by introducing non-ferrous ultra-thin brass foil with a thickness range of 0.04–0.1 mm. This new product is aimed at serving the defence and industrial markets.",
            "Sentiment": "positive",
            "PublishDate": 1747987714000,
            "Source": "default"
        },
        {
            "Title": "ED Conducts Raids on JTL Industries Locations",
            "Summary": "The Enforcement Directorate (ED) has conducted raids on locations associated with JTL Industries. This action suggests an ongoing investigation into the company's financial activities or potential regulatory violations.",
            "Sentiment": "negative",
            "PublishDate": 1744789040000,
            "Source": "default"
        },
        {
            "Title": "JTL Industries Reports 13% Year-on-Year Sales Volume Growth in FY25",
            "Summary": "JTL Industries has announced a 13% year-on-year increase in sales volume for the fiscal year 2025. This growth indicates positive performance and potential market expansion for the company.",
            "Sentiment": "positive",
            "PublishDate": 1743486446000,
            "Source": "result"
        },
        {
            "Title": "JTL Industries Reports Volume of 387,555 MT for FY25",
            "Summary": "JTL Industries has announced a total volume of 387,555 metric tons for the fiscal year 2025. This figure represents the company's production or sales volume for the specified period.",
            "Sentiment": "neutral",
            "PublishDate": 1743486372000,
            "Source": "result"
        },
        {
            "Title": "JTL Industries Expands Production Capacity at Mangaon Facility",
            "Summary": "JTL Industries has implemented Direct Forming Technology (DFT) at its Mangaon facility in Maharashtra, significantly increasing its production capacity from 200,000 MTPA to 450,000 MTPA. This expansion aims to meet growing market demands.",
            "Sentiment": "positive",
            "PublishDate": 1742804894000,
            "Source": "corporate_action"
        },
        {
            "Title": "JTL Industries Deploys Advanced Manufacturing Technology in Maharashtra",
            "Summary": "JTL Industries has implemented 250,000 MT of Advanced Direct Forming Technology (DFT) at its facility in Maharashtra. This technology will be used for the manufacture of square tubes.",
            "Sentiment": "positive",
            "PublishDate": 1742804839000,
            "Source": "corporate_action"
        },
        {
            "Title": "JTL Industries Incorporates New Company Unit",
            "Summary": "JTL Industries has incorporated a new company unit named JTL Engineering Limited, which was formerly known as Nabha Steels & Metals.",
            "Sentiment": "neutral",
            "PublishDate": 1741749964000,
            "Source": "corporate_action"
        }
    ]
}