{
    "Symbol": "JUBLCPL",
    "ISIN": "INE03CC01015",
    "News": [
        {
            "Title": "Jubilant Agri Grants 1,000 Stock Options to Employees",
            "Summary": "Jubilant Agri and Consumer Products Limited's NRC Committee approved grant of 1,000 stock options under JACPL ESOP Scheme 2018 at ₹ 10/- exercise price with 3-year vesting period.",
            "Sentiment": "positive",
            "PublishDate": 1770628859427,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jubilant Agri Allots 3,199 Shares Under ESOP Plan",
            "Summary": "Jubilant Agri & Consumer Products allotted 3,199 equity shares under ESOP 2013, raising ₹11.98 lakh and increasing paid-up capital to ₹151.52 crore on January 6, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767696506544,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jubilant Agri Gets GST Order for ₹1.95 Cr Refund",
            "Summary": "Jubilant Agri and Consumer Products receives GST order demanding ₹1.95 crore tax recovery plus penalty for March-October 2022 period. Company to file appeal, expects no financial impact.",
            "Sentiment": "negative",
            "PublishDate": 1765867420966,
            "Source": "stocks"
        },
        {
            "Title": "Jubilant Agri And Consumer Products Reports Strong Q2 Growth Across Key Metrics",
            "Summary": "Jubilant Agri And Consumer Products delivered robust Q2 performance with net profit rising to 468.7 million rupees from 254.5 million rupees year-over-year. Revenue increased to 5.15 billion rupees compared to 4.02 billion rupees in the same period last year. EBITDA grew to 685 million rupees from 424 million rupees year-over-year, while EBITDA margin expanded to 13.30% from 10.55% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762388810963,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Agri & Consumer Products Plans Double-Digit Revenue Growth",
            "Summary": "Jubilant Agri & Consumer Products plans to achieve double-digit revenue growth driven by adhesives, agri-products, and performance polymers. The company is expanding its product range in NPK fertilizers and SBR latex. The growth strategy involves leveraging innovation-led R&D and pan-India distribution network, with strong volume-led margin guidance.",
            "Sentiment": "positive",
            "PublishDate": 1762269673276,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Agri And Consumer Products Approves Capacity Expansion and Demerger with JASL",
            "Summary": "Jubilant Agri And Consumer Products has approved an increase in its Performance Polymers production capacity. The company has also approved a demerger plan with JASL, with the share exchange ratio set at 1:1.",
            "Sentiment": "positive",
            "PublishDate": 1762257309241,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Agri and Consumer Products Reports Strong Q2 Performance with 16% Revenue Growth",
            "Summary": "Jubilant Agri and Consumer Products Limited reported consolidated revenue from operations of ₹51,182 lakhs for the quarter ended September 30, 2025, compared to ₹44,117 lakhs in the previous quarter. The company's net profit from continuing operations reached ₹4,127 lakhs for the quarter. For the half-year period, revenue grew to ₹95,299 lakhs from ₹76,308 lakhs in the corresponding period last year. The company operates through three main segments: Performance Polymers & Chemicals, PSK Fertilizers, and Agri Nutrients. The Board of Directors has approved a scheme of arrangement for demerger between the company and Jubilant Agri Solutions Limited, involving the transfer of the Agri Division on a going concern basis. Under the proposed scheme, shareholders will receive one equity share of the resulting company for every one share held in the demerged company.",
            "Sentiment": "positive",
            "PublishDate": 1762256324028,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Agri and Consumer Products Reports Strong Q2 Growth with 84% Jump in Net Profit",
            "Summary": "Jubilant Agri and Consumer Products delivered robust quarterly performance with net profit rising to 468.7 million rupees from 254.5 million rupees year-over-year. Revenue increased to 5.15 billion rupees compared to 4.02 billion rupees in the same period last year. EBITDA grew to 685 million rupees from 424 million rupees, while EBITDA margin expanded to 13.30% from 10.55% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762255547966,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Agri and Consumer Products Re-appoints Independent Director, Names New Secretarial Auditor",
            "Summary": "Jubilant Agri and Consumer Products Limited shareholders approved the re-appointment of Ravinder Pal Sharma as Non-Executive Independent Director for a second five-year term from September 3, 2025, to September 2, 2030. Sharma, a Chartered Accountant with over 35 years of experience, previously served as Independent Director from September 2020 to September 2025. The company also appointed Sanjay Grover & Associates as Secretarial Auditors for five consecutive years from financial year 2025-26 to 2029-30. Both appointments were approved at the 17th Annual General Meeting held on August 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1756208917934,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jubilant Agri And Consumer Products Reports Strong Q1 Growth Across Key Metrics",
            "Summary": "Jubilant Agri And Consumer Products delivered robust quarterly performance with consolidated net profit rising to 441 million rupees from 257 million rupees year-over-year. Revenue increased to 4.41 billion rupees compared to 3.57 billion rupees in the same period last year. EBITDA grew to 621 million rupees from 422 million rupees year-over-year, while EBITDA margin expanded to 14.05% from 11.79% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754872013431,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Agri & Consumer Products Targets Double-Digit Growth Through Strategic Expansion and Potential Demerger",
            "Summary": "Jubilant Agri & Consumer Products is targeting sustained double-digit growth with its adhesives and agri segments expected to drive momentum. The company's strategy includes strategic product innovations and channel expansion. The company is also considering a potential agri business demerger aimed at unlocking long-term shareholder value.",
            "Sentiment": "positive",
            "PublishDate": 1754665801385,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Agri and Consumer Products Reports Strong Q1 Performance with 175% Jump in Net Profit",
            "Summary": "Jubilant Agri and Consumer Products Limited released its quarterly results for the period ended June 30, 2025. On a consolidated basis, the company reported revenue from operations of ₹44,195 lakhs compared to ₹35,814 lakhs in the same quarter last year, representing a 23% increase. Net profit surged to ₹4,413 lakhs from ₹2,571 lakhs in the corresponding quarter, marking a 72% growth. The company operates through three main segments: Performance Polymers & Chemicals (₹31,148 lakhs revenue), P&K Fertilizers (₹13,911 lakhs revenue), and Agri Nutrients (₹347 lakhs revenue). Basic earnings per share from continuing operations increased to ₹29.29 from ₹17.16 in the same quarter last year. The company incorporated a new wholly owned subsidiary, Jubilant Agri Solutions Limited, in April 2025. Total comprehensive income for the quarter stood at ₹4,416 lakhs compared to ₹2,567 lakhs in the previous year quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754651857097,
            "Source": "earnings"
        }
    ]
}