{
    "Symbol": "JUBLFOOD",
    "ISIN": "INE797F01020",
    "News": [
        {
            "Title": "Jubilant FoodWorks Q3FY26 Results Show Strong Growth",
            "Summary": "Jubilant FoodWorks reports consolidated revenue of ₹24,372.19 million for Q3FY26, up from ₹21,507.63 million in Q3FY25. Standalone profit reaches ₹540.79 million despite exceptional items.",
            "Sentiment": "positive",
            "PublishDate": 1770741864828,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jubilant FoodWorks Grants 224,148 Stock Options",
            "Summary": "Jubilant FoodWorks NRC Committee approved grant of 224,148 stock options across three ESOP schemes to eligible employees on February 10, 2026, with varying exercise prices and vesting schedules.",
            "Sentiment": "positive",
            "PublishDate": 1770715312179,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jubilant FoodWorks Wins Tax Appeal for FY 2020-21",
            "Summary": "Jubilant FoodWorks receives favorable order from Income Tax Appellate Tribunal declaring assessment order void ab initio on time-barred grounds for Financial Year 2020-21, following earlier tax demand reduction from Rs.216.19 crores to Rs.190.21 crores.",
            "Sentiment": "positive",
            "PublishDate": 1770366289958,
            "Source": "stocks"
        },
        {
            "Title": "Jubilant FoodWorks Receives ₹169.59 Cr Tax Demand",
            "Summary": "Jubilant FoodWorks received assessment order from Income Tax Department raising tax demand of ₹169.59 crores for FY 2021-22. Company plans to file rectification application and appeal.",
            "Sentiment": "negative",
            "PublishDate": 1769933620626,
            "Source": "stocks"
        },
        {
            "Title": "Jubilant FoodWorks Board Meet on Feb 10 for Q3FY26",
            "Summary": "Jubilant FoodWorks has scheduled a board meeting on February 10, 2026, to consider Q3FY26 financial results. Trading window remains closed until February 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769770148169,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jubilant Foodworks shares decline 2.06% to ₹490.70",
            "Summary": "Jubilant Foodworks shares fell 2.06% to ₹490.70 amid bearish sentiment. Q2 FY26 revenue rose to ₹2,340.15 cr with net profit jumping to ₹192.23 cr, though annual profit declined.",
            "Sentiment": "negative",
            "PublishDate": 1769165230032,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jubilant Consumer pledges shares in Jubilant FoodWorks",
            "Summary": "Jubilant Consumer Private Limited has pledged 6 lakh equity shares of Jubilant FoodWorks Limited to Bajaj Finance Limited as security for a loan availed by Jubilant Enpro Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1768543657700,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jubilant FoodWorks Adds 114 New Stores",
            "Summary": "Jubilant FoodWorks expands to 3,594 total locations with 114 new store additions, falling short of its year-end target of 3,750-3,800+ stores.",
            "Sentiment": "neutral",
            "PublishDate": 1767710926278,
            "Source": "stocks"
        },
        {
            "Title": "Jubilant FoodWorks Q3: Revenue Growth Slowest This Year",
            "Summary": "Jubilant FoodWorks Q3 revenue grew 13.4% to ₹2,439 cr, marking slowest growth in current financial year. Company added 114 stores, reaching 3,594 total outlets with full year guidance of 3750-3800+ outlets.",
            "Sentiment": "neutral",
            "PublishDate": 1767709749393,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jubilant FoodWorks Sells Entire Stake in Hashtag Loyalty",
            "Summary": "Jubilant FoodWorks Limited has executed a Share Purchase Agreement to sell its entire 31.66% stake in associate company Hashtag Loyalty Private Limited for ₹641.59 crore to founder Karan Chechani.",
            "Sentiment": "neutral",
            "PublishDate": 1767022820447,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jubilant FoodWorks Receives GST Demand of ₹81.16 Cr",
            "Summary": "Jubilant FoodWorks receives GST demand order of ₹81.16 crores with equal penalty from CGST Mohali for alleged excess ITC claims during FY19-21. Company plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1766764316094,
            "Source": "stocks"
        },
        {
            "Title": "Jubilant FoodWorks Restructures Senior Management with New Appointments and Role Changes",
            "Summary": "Jubilant FoodWorks appointed Virender Singh Sehrawat as EVP & Head-Integrated Supply Chain effective December 15, 2025, while Somnath Das will cease to be part of senior management. Vibhor Gupta will join as EVP Head-Popeyes from January 31, 2026, and Gaurav Pande transitions from Head-Popeyes to Head-Corporate Strategy role.",
            "Sentiment": "neutral",
            "PublishDate": 1765343492697,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jubilant FoodWorks Grants 10.23 Lakh Stock Options Under ESOP 2025 Scheme",
            "Summary": "Jubilant FoodWorks' Nomination, Remuneration and Compensation Committee granted 10,23,160 stock options to eligible employees under the JFL Employees Stock Option Scheme 2025 at an exercise price of Rs. 2 per option. The stock options will vest after July 31, 2028, with exercise periods ranging from one to four years depending on employee category, providing long-term incentives for workforce retention.",
            "Sentiment": "positive",
            "PublishDate": 1764585430142,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant FoodWorks Withholds Dividend Payments Due to Non-Compliant KYC Documentation",
            "Summary": "Jubilant FoodWorks has withheld dividend payments of Rs. 1.20 per equity share for financial year 2024-25 for shareholders who have not submitted required KYC documents as per SEBI regulations. The company approved the dividend at its 30th Annual General Meeting held on August 28, 2025, but payments are being held for non-KYC compliant physical security holders until they provide mandatory documentation including PAN, nomination details, and bank account information.",
            "Sentiment": "neutral",
            "PublishDate": 1764075653486,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant FoodWorks Reports Strong Q2 FY26 Performance with 19.7% Revenue Growth",
            "Summary": "Jubilant FoodWorks delivered consolidated revenue growth of 19.7% year-on-year to Rs. 23.4 billion in Q2 FY26, driven by robust like-for-like growth of 9.1% in Dominos India and 5.6% in Turkey business. The company added 93 stores during the quarter and now operates close to 3,500 stores, with consolidated PAT from continued operations growing 53.7% year-on-year, reflecting strong execution across all markets.",
            "Sentiment": "positive",
            "PublishDate": 1763558472551,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant FoodWorks Clarifies Recent Share Volume Surge to BSE",
            "Summary": "Jubilant FoodWorks responded to BSE's inquiry about increased trading volume, stating the company is unaware of specific reasons and attributes the surge to market conditions. The company confirmed it has disclosed all material information including quarterly results for the quarter ended September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763374271615,
            "Source": "stock"
        },
        {
            "Title": "Jubilant FoodWorks Shares Surge 9% on Strong Q2 Results with 190% PAT Jump",
            "Summary": "Jubilant FoodWorks shares jumped nearly 9% to Rs 622.95 after reporting a 190% year-on-year surge in profit after tax to Rs 186 crore for Q2, with revenue from operations growing 20% to Rs 2,340.15 crore. The Domino's operator expanded its network by 93 stores quarter-on-quarter to reach 3,480 total stores, while operational EBITDA grew 20% to Rs 476 crore with operating margins improving to 20.4%.",
            "Sentiment": "neutral",
            "PublishDate": 1763110322579,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Foodworks Sets Aggressive Growth Targets, Receives Multiple Analyst Upgrades",
            "Summary": "Jubilant Foodworks targets 15% annual growth for Domino's India business through like-for-like growth and store expansion, committing to open approximately 900 stores over three years with minimum 200 basis points EBITDA margin improvement from FY24 base. Multiple brokerages upgraded the stock with target prices ranging from Rs 477 to Rs 1000, reflecting positive analyst sentiment on the company's expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1763091761220,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Foodworks Implements Price Increases with Plans for Further Hikes",
            "Summary": "Jubilant Foodworks implemented price hikes during the last quarter according to a company executive. The company plans to continue exploring additional pricing opportunities going forward.",
            "Sentiment": "neutral",
            "PublishDate": 1763044161489,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Foodworks Reports Strong October Performance",
            "Summary": "An executive at Jubilant Foodworks reported that the company's October performance was strong and exceeded expectations.",
            "Sentiment": "positive",
            "PublishDate": 1763038826305,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Foodworks Announces Price Cuts Following Tax Reductions",
            "Summary": "Jubilant Foodworks announced price reductions on certain items following tax cuts in India. A company executive made the announcement regarding the price adjustments.",
            "Sentiment": "positive",
            "PublishDate": 1763037106705,
            "Source": "stock"
        },
        {
            "Title": "Jubilant FoodWorks Appoints Bikash Agarwal as New Internal Auditor",
            "Summary": "Jubilant FoodWorks Limited announced the appointment of Mr. Bikash Agarwal as Internal Auditor effective November 13, 2025, replacing Ms. Seema Bassi due to a change in her role within the company. The appointment was approved by the Board of Directors on recommendation of the Audit Committee. Agarwal is a qualified Chartered Accountant with nearly two decades of experience, having previously worked with organizations including Lenovo, Coca-Cola, and Flipkart. He has been recognized multiple times for developing fraud detection engines and identifying outliers across large ERPs.",
            "Sentiment": "neutral",
            "PublishDate": 1763033859412,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jubilant Foodworks Reports Strong Q2 Results with Net Profit Surge to 1.86 Billion Rupees",
            "Summary": "Jubilant Foodworks delivered robust quarterly performance with consolidated net profit jumping to 1.86 billion rupees from 640 million rupees in the same period last year. Revenue grew to 23.4 billion rupees compared to 19.55 billion rupees year-over-year. EBITDA increased to 4.76 billion rupees from 3.99 billion rupees, while EBITDA margin remained relatively stable at 20.35% versus 20.39% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1763032227525,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Foodworks Reports Strong Q2 FY26 Growth with Revenue Rising 19.7%",
            "Summary": "Jubilant Foodworks reported its Q2 FY26 financial results showing revenue from operations of ₹23,404 million, marking a 19.7% year-over-year increase. The company's standalone revenue reached ₹16,987 million, representing a 15.8% year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1759722324722,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Foodworks May Benefit from Potential GST Waiver on Pizza Bread",
            "Summary": "Jubilant Foodworks could potentially receive a waiver on GST for pizza bread. This development was reported by CNBC Aawaz.",
            "Sentiment": "positive",
            "PublishDate": 1756885243385,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Foodworks Plans 1,000 New Stores in 3 Years, Targets 200 Basis Points Margin Growth",
            "Summary": "Jubilant Foodworks anticipates improved demand in coming quarters and plans to open 1,000 new stores over the next three years. The company has set a target of 200 basis points margin growth over three years and expects a 10-15% annual decrease in store capital expenditure due to efficiency gains. The company aims to halve the negative impact from new formats within 12-18 months.",
            "Sentiment": "positive",
            "PublishDate": 1755142400475,
            "Source": "stock"
        },
        {
            "Title": "Jubilant FoodWorks Plans Aggressive Expansion Through Store Additions and New Brand Launches",
            "Summary": "Jubilant FoodWorks is pursuing sustained expansion through aggressive store additions and new brand rollouts. The company is focusing on digital ordering growth as part of its expansion strategy. The company expects margin improvement through supply chain efficiencies and product innovation initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1755102850505,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Foodworks Executive Emphasizes Growth Focus, Says Price Increases Will Come at Right Time",
            "Summary": "A Jubilant Foodworks executive stated that the company's primary focus is on growth. The executive indicated that price increases will be implemented at the appropriate moment.",
            "Sentiment": "neutral",
            "PublishDate": 1755089162988,
            "Source": "stock"
        },
        {
            "Title": "Jubilant FoodWorks Reports Strong Q1 FY26 Results with 17% Revenue Growth",
            "Summary": "Jubilant FoodWorks Limited announced its quarterly results for the quarter ended June 30, 2025. On a consolidated basis, revenue from operations increased to INR 22,608.60 million compared to INR 19,330.64 million in the same quarter last year. Consolidated profit for the period reached INR 943.37 million versus INR 580.24 million in the previous year quarter. On a standalone basis, revenue from operations grew to INR 17,015.81 million from INR 14,395.57 million year-over-year, while standalone profit increased to INR 667.00 million from INR 515.09 million. The company's earnings per share from continuing operations stood at INR 1.43 on a consolidated basis and INR 1.01 on a standalone basis. The company entered into a share transfer agreement to sell its entire stake in Russian subsidiary Pizza Restaurants LLC, which has been classified as held for sale and subsequently transferred after the quarter ended.",
            "Sentiment": "positive",
            "PublishDate": 1755082614035,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Foods Expands Popeyes to Mumbai with Four New Stores",
            "Summary": "Jubilant Foods Ltd has launched four Popeyes stores in Mumbai, marking the Louisiana-style fried chicken chain's entry into the city. Popeyes entered India in January 2022 through a master franchise agreement with Jubilant FoodWorks Ltd and is expanding its presence across Bengaluru, Chennai, Hyderabad and NCR. The brand competes with rival QSR chains such as KFC. CEO and Managing Director Sameer Khetarpal expressed confidence that Mumbai customers will embrace the brand's signature offerings, citing incredible response across India.",
            "Sentiment": "positive",
            "PublishDate": 1754505587844,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Foodworks Exits Russian Market",
            "Summary": "Jubilant Foodworks has sold all of its shares in Pizza Restaurants LLC, effectively ending its business operations in Russia.",
            "Sentiment": "neutral",
            "PublishDate": 1752303516000,
            "Source": "default"
        },
        {
            "Title": "Jubilant Foodworks: Q1 Revenue Growth Solid, Analysts Divided",
            "Summary": "Jubilant Foodworks reported 17% consolidated revenue growth to ₹2,261.4 crore in Q1. Dominos India's like-for-like growth was 11.6% with 61 new stores added. Morgan Stanley maintains 'overweight' rating, while CLSA rates it 'underperform'.",
            "Sentiment": "neutral",
            "PublishDate": 1751857930000,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Foodworks Reports 17% Revenue Growth in Q1",
            "Summary": "Jubilant Foodworks has reported revenue of ₹2,261.4 crores for Q1, representing a 17% year-over-year increase. The company, known for its food service operations, has shown significant growth in its latest quarterly results.",
            "Sentiment": "positive",
            "PublishDate": 1751851773000,
            "Source": "default"
        },
        {
            "Title": "Jubilant FoodWorks Delays Sale of Russian Subsidiary",
            "Summary": "Jubilant FoodWorks has announced an update regarding the sale of its step-down subsidiary, Pizza Restaurants LLC in Russia. The company's unit Fidesrus has indicated that the completion of the transaction is now expected by May 30, 2026. The delay is attributed to certain regulatory requirements that must be fulfilled before the sale can be finalized.",
            "Sentiment": "neutral",
            "PublishDate": 1748611621000,
            "Source": "default"
        },
        {
            "Title": "Jubilant Foodworks Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 231,444 shares of Jubilant Foodworks Ltd. took place on the National Stock Exchange (NSE) at a price of Rs. 676.50 per share. The total value of the transaction was Rs. 15.66 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1747376540000,
            "Source": "block_details"
        },
        {
            "Title": "Jubilant FoodWorks Introduces Big Big Pizza, Provides Network Expansion Plans",
            "Summary": "Jubilant FoodWorks has introduced a high-priced product called Big Big Pizza, priced at Rs 700 and Rs 800, which has increased the average ticket price and reduced costs related to delivery, insider crew, and rent as a percentage of orders. The company is facing a 2% to 3% increase in raw material and packaging costs. They have also announced plans to open 280 new Domino's stores, with 250 in India and 30 in Turkey.",
            "Sentiment": "positive",
            "PublishDate": 1747280570000,
            "Source": "default"
        },
        {
            "Title": "Jubilant Foodworks: UBS Advises Caution Despite Strong Q4 Results",
            "Summary": "Jubilant Foodworks reported strong Q4 results with revenue growth of 33.9% to ₹2,107 crore and profit of ₹49.4 crore. EBITDA margins expanded to 19.3%. UBS maintains a 'Sell' rating with a price target of ₹600, citing recent stock run-up as an opportunity for profit booking. The company plans to add 250 Domino's and 30 Popeyes stores in India for FY26E.",
            "Sentiment": "neutral",
            "PublishDate": 1747278069000,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Foodworks Reports Q4 FY23 Financial Results",
            "Summary": "Jubilant Foodworks announced its Q4 FY23 consolidated net profit at 480.1 million rupees, down from 2.08 billion rupees year-over-year but up from 429 million rupees quarter-over-quarter. Q4 revenue increased to 21 billion rupees from 15.73 billion rupees year-over-year. The company has recommended a dividend of 1.2 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747267843000,
            "Source": "default"
        },
        {
            "Title": "Jubilant FoodWorks: Q4 Profit Drops 77% But Beats Estimates",
            "Summary": "Jubilant FoodWorks reported a 76.9% decline in Q4 FY25 consolidated net profit to Rs 48 crore, beating analyst estimates. Revenue rose 33.6% to Rs 2,103 crore. Domino's saw 18.8% revenue growth with 24.6% order growth. The company opened 52 new stores, expanding to 2,179 stores across 475 cities.",
            "Sentiment": "neutral",
            "PublishDate": 1747221968000,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant FoodWorks Q4 Results: Revenue Up, Profit Down, Dividend Declared",
            "Summary": "Jubilant FoodWorks reported mixed Q4 results. Revenue increased to 21 billion rupees from 15.73 billion YoY. However, net profit decreased to 480.1 million rupees from 2.08 billion YoY. EBITDA rose to 3.89 billion rupees, but EBITDA margin fell to 18.51% from 20.18% YoY. The company recommended a dividend of 1.2 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747221914000,
            "Source": "result"
        },
        {
            "Title": "Jubilant FoodWorks: India-Turkey Tensions Impact QSR Giant's Operations",
            "Summary": "Jubilant FoodWorks faces potential challenges due to India-Pakistan conflict and calls for boycotting Turkish products. The company's recent acquisition of DP Eurasia, Domino's Pizza's master franchisee in Turkey, Azerbaijan, and Georgia, is now under scrutiny. Turkey's support for Pakistan in the recent conflict has led to strained India-Turkey trade relations. DP Eurasia contributes 31% of Jubilant's system sales, making it a significant concern for the company's financial performance.",
            "Sentiment": "negative",
            "PublishDate": 1747221546000,
            "Source": "normal_news"
        },
        {
            "Title": "Jubilant FoodWorks to Consider Q4 Results on May 14",
            "Summary": "Jubilant FoodWorks, a leading food service company, has announced that it will consider its fourth quarter (Q4) financial results on May 14. This indicates the company is preparing to release its earnings report for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1745582321000,
            "Source": "default"
        },
        {
            "Title": "Jubilant FoodWorks Reports Strong Q4FY25 Performance for Domino's India",
            "Summary": "Jubilant FoodWorks announced that Domino's India achieved a like-for-like (LFL) growth of 12.1% in Q4FY25. The company also expanded its store network, adding 56 new stores during the quarter, bringing the total JFL Group network to 3,316 stores.",
            "Sentiment": "positive",
            "PublishDate": 1743995734000,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant FoodWorks Reports Strong Revenue Growth in Q4FY25",
            "Summary": "Jubilant FoodWorks, a leading food service company, has reported a significant increase in its consolidated revenue from operations for the fourth quarter of fiscal year 2025. The company's revenue reached ₹21,070 million, marking a substantial year-over-year growth of 33.9%.",
            "Sentiment": "positive",
            "PublishDate": 1743995657000,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant FoodWorks: Q4 Revenue Surges 33.9%, 56 New Stores Added",
            "Summary": "Jubilant FoodWorks reported a 33.9% YoY increase in Q4 FY2025 consolidated revenue to Rs 2,107 crore. The company added 56 new stores, bringing the total to 3,316. Domino's India saw 12.1% like-for-like growth, while Turkey operations grew 0.9%. Annual consolidated revenue rose 44% to Rs 8,145.5 crore.",
            "Sentiment": "positive",
            "PublishDate": 1743866263000,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Foodworks Targets Significant Expansion of Domino's and Popeyes Outlets",
            "Summary": "Jubilant Foodworks, the master franchisee for Domino's Pizza in India, has announced ambitious expansion plans. The company aims to increase its Domino's store count to 3,000 and Popeyes outlets to 250 within the next three years. This strategic move indicates the company's confidence in the growth potential of the quick-service restaurant market in India.",
            "Sentiment": "positive",
            "PublishDate": 1743120592000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant FoodWorks Targets Expansion: 3,000 Domino's and 250 Popeyes Outlets in 3 Years",
            "Summary": "Jubilant FoodWorks, the master franchisee for Domino's Pizza and Popeyes in India, has announced ambitious expansion plans. The company aims to increase its Domino's Pizza outlets to 3,000 and Popeyes outlets to 250 within the next three years. This strategic move indicates significant growth intentions for both brands in the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1743090004000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant FoodWorks Launches 'Elate': India's First Android-Based POS System",
            "Summary": "Jubilant FoodWorks has introduced 'Elate', which is being touted as India's first Android-based Point of Sale (POS) system. This launch is described as a bold step towards creating the technology-driven restaurant of the future. The company aims to pioneer advanced technological solutions in the food service industry with this innovative system.",
            "Sentiment": "positive",
            "PublishDate": 1743060695000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant FoodWorks: CLSA Downgrades Stock, Citing Turkish Lira Risks",
            "Summary": "CLSA downgrades Jubilant FoodWorks to 'hold' with a target price of ₹450, implying a 28% downside. The downgrade is due to potential financial risks from Turkish Lira depreciation affecting DP Eurasia acquisition. Lira's weakness could reduce FY25 consolidated PAT by 3.5-4%. Domestic brokerages remain bullish despite currency concerns.",
            "Sentiment": "negative",
            "PublishDate": 1742538275000,
            "Source": "normal_news"
        },
        {
            "Title": "Jubilant FoodWorks: Turkish Lira Depreciation Raises Financial Concerns",
            "Summary": "CLSA highlights potential financial risks for Jubilant FoodWorks due to sharp depreciation of Turkish Lira. The currency decline could increase debt repayment burden and impact profitability. A 5% Lira depreciation on Wednesday could reduce FY25 consolidated PAT by 2-2.5%. Year-to-date 8.5% depreciation may impact consolidated PAT by 3.5-4%. The weakness could affect DP Eurasia's dividend payments and Jubilant's cash flows.",
            "Sentiment": "negative",
            "PublishDate": 1742442414000,
            "Source": "normal_news"
        }
    ]
}