{
    "Symbol": "JUBLINGREA",
    "ISIN": "INE0BY001018",
    "News": [
        {
            "Title": "Jubilant Ingrevia receives GST demand order for FY18",
            "Summary": "Jubilant Ingrevia Limited disclosed a GST demand order of Rs. 36.04 lakh for Service Tax on Ocean Freight for FY 2017-18, with equal penalty amount. Company plans to file appeal against the order.",
            "Sentiment": "negative",
            "PublishDate": 1770659462283,
            "Source": "stocks"
        },
        {
            "Title": "Jubilant Ingrevia Targets 20% EBITDA Growth",
            "Summary": "Jubilant Ingrevia aims for long-term EBITDA growth of at least 20% over several years, targeting over 25% EBITDA margins in specialty chemicals with FY2027 as key capacity utilization year.",
            "Sentiment": "positive",
            "PublishDate": 1770349574719,
            "Source": "stocks"
        },
        {
            "Title": "Jubilant Ingrevia Q3 Net Profit Drops 32% YoY",
            "Summary": "Jubilant Ingrevia reports Q3 consolidated net profit of ₹469 million, down from ₹694 million YoY. Revenue remains stable at ₹10.5 billion versus ₹10.57 billion in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1770208584223,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jubilant Ingrevia Declares Rs.2.50 Interim Dividend",
            "Summary": "Jubilant Ingrevia Limited announced interim dividend of Rs.2.50 per equity share for FY 2025-26 with record date February 10, 2026. Payment scheduled on or before March 4, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770208172202,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jubilant Ingrevia to Participate in Nuvama Conference",
            "Summary": "Jubilant Ingrevia Limited announces management participation in Nuvama India Conference 2026 scheduled for February 9-10, 2026 at Grand Hyatt Mumbai featuring group and one-on-one meetings.",
            "Sentiment": "neutral",
            "PublishDate": 1770101162976,
            "Source": "stocks"
        },
        {
            "Title": "Jubilant Ingrevia Conference Call Set for Feb 5, 2026",
            "Summary": "Jubilant Ingrevia Limited has scheduled a conference call on February 5, 2026, at 5:00 PM IST to discuss Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768827837206,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jubilant Ingrevia Faces GST Demand of ₹2.18 Cr",
            "Summary": "Jubilant Ingrevia's Nira plant receives GST demand order for FY 2017-18 totaling ₹2.18 crores including tax, interest, and penalty. Company plans to appeal before GSTAT.",
            "Sentiment": "negative",
            "PublishDate": 1766754551246,
            "Source": "stocks"
        },
        {
            "Title": "Jubilant Ingrevia Gets Credit Rating Affirmation on Bank Loan Facilities Worth Rs 23,884 Million",
            "Summary": "India Ratings and Research affirmed Jubilant Ingrevia's IND AA/Stable rating on bank loan facilities of Rs 23,883.8 million, reduced from Rs 24,200 million. The rating agency withdrew its rating on the company's proposed commercial paper worth Rs 4,000 million.",
            "Sentiment": "neutral",
            "PublishDate": 1764680734452,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Ingrevia Redeems Rs. 50 Crore Commercial Paper on Maturity",
            "Summary": "Jubilant Ingrevia Limited successfully redeemed its Rs. 50 crore commercial paper (ISIN-INEOBY014425) on November 21, 2025, which was the scheduled maturity date. The commercial paper was originally issued on September 25, 2025, and the company has fulfilled its debt obligation as planned.",
            "Sentiment": "positive",
            "PublishDate": 1763722338346,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Ingrevia Reports 8% Revenue Growth and 18% PAT Increase in Q2FY26",
            "Summary": "Jubilant Ingrevia achieved revenue of Rs 1,121 crores in Q2FY26 with 8% YoY growth, driven by strong performance in Specialty Chemicals segment and highest quarterly sales volumes in Chemical Intermediates over the last six quarters. The company's EBITDA grew 8% YoY to Rs 146 crores while Profit After Tax surged 18% YoY to Rs 70 crores, supported by volume expansion across CDMO, Fine Chemicals, and Acetyls business despite pricing pressures in some segments.",
            "Sentiment": "positive",
            "PublishDate": 1763358488818,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Ingrevia Reports 8% EBITDA Growth in Q2FY26 with Strong Performance in Specialty Chemicals",
            "Summary": "Jubilant Ingrevia Limited announced quarterly results showing 8% year-over-year EBITDA growth and 18% increase in Profit After Tax. The company's Specialty Chemicals segment drove growth momentum with double-digit revenue growth and maintained 25% margins during the quarter. The Nutrition business recorded steady volume growth across core products, while Chemical Intermediates business achieved highest quarterly sales in the last six quarters. Revenue grew 7% year-over-year to Rs 1,121 crore. On a half-yearly basis, EBITDA grew 18% and Profit After Tax surged 34%. The company successfully delivered volumes against a new Agro CDMO innovator contract and added 104 new molecules in their CDMO/Fine chemicals portfolio. Management expects continued growth momentum in H2FY26, fueled by progress in Specialty Chemicals and Nutrition businesses, with a major CDMO order expected to start in early 2026.",
            "Sentiment": "positive",
            "PublishDate": 1762759951884,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Ingrevia Reports 7% Revenue Growth with Strong CDMO Pipeline Expansion",
            "Summary": "Jubilant Ingrevia achieved its highest quarterly revenue in 10 quarters at INR 1,121 crore, representing 7% year-on-year growth driven by 18% volume expansion. The company reported 8% EBITDA growth to INR 146 crore and 18% increase in profit after tax to INR 70 crore. The Specialty Chemicals segment delivered 12% revenue growth with 26% EBITDA margins, while adding 10+ new molecules with INR 1,200 crore peak annual revenue potential. The company expanded its opportunity funnel to 100+ active opportunities worth INR 3,500 crore potential revenue. A major CDMO contract worth $300 million over 5 years is set to begin in early 2026. The Nutrition segment saw strong volume growth in vitamins B3 and B4, though pricing pressures affected margins. Chemical Intermediates achieved highest quarterly sales in 6 quarters. The company commissioned renewable power at Bharuch, bringing total renewable share to 28% of power requirements, resulting in 16% reduction in energy costs.",
            "Sentiment": "positive",
            "PublishDate": 1761896686287,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Ingrevia Plans 18 New Product Launches in FY'26, Targets INR 2,000 Crore EBITDA by FY'30",
            "Summary": "Jubilant Ingrevia announced plans to introduce 18 new products in FY'26, with focus on growth areas including cosmetics and semiconductor chemicals. The company expects improved margins in its nutrition business as prices stabilize and the share of cosmetic and food-grade products increases. Jubilant Ingrevia has set a target of achieving INR 2,000 crore EBITDA by FY'30. The company anticipates continued growth in H2 FY'26, driven by specialty chemicals and nutritional sectors, along with expected partial recovery in acetyl products.",
            "Sentiment": "positive",
            "PublishDate": 1761622499605,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Ingrevia Sets Revenue Target of ₹7,500-8,000 Crore by FY27",
            "Summary": "Jubilant Ingrevia has announced a revenue target of ₹7,500-8,000 crore and 20 percent EBITDA margin by FY27. The company plans to achieve this through a ₹2,000 crore capital expenditure in specialty chemicals, a CDMO pipeline with ₹1,200 crore peak sales potential, and expected growth in nutrition demand.",
            "Sentiment": "positive",
            "PublishDate": 1761581197002,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Ingrevia Expects Acetyls Recovery and Major CDMO Order Launch",
            "Summary": "Jubilant Ingrevia's Co-Chairman expects a partial recovery in the company's Acetyls portfolio during the second half of FY26. The company is also preparing to begin a major CDMO (Contract Development and Manufacturing Organization) order in early 2026.",
            "Sentiment": "positive",
            "PublishDate": 1761565420534,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Ingrevia Reports Strong Q2 Performance with 17.7% Growth in Net Profit",
            "Summary": "Jubilant Ingrevia delivered robust Q2 results with consolidated net profit rising to 694.7 million rupees from 590 million rupees in the same quarter last year. Revenue increased to 11.21 billion rupees compared to 10.45 billion rupees year-over-year. EBITDA grew to 1.35 billion rupees from 1.24 billion rupees, while EBITDA margin improved to 12.09% from 11.92% in the corresponding period last year.",
            "Sentiment": "positive",
            "PublishDate": 1761561805128,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Ingrevia Redeems Rs. 50 Crore Commercial Paper on Maturity",
            "Summary": "Jubilant Ingrevia Limited has fully redeemed its Commercial Paper worth Rs. 50 crores on the maturity date of September 25, 2025. The Commercial Paper, bearing ISIN INE0BY014417, was originally issued on August 11, 2025. The company informed stock exchanges NSE and BSE about the completion of the redemption process.",
            "Sentiment": "neutral",
            "PublishDate": 1758802417829,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Ingrevia Sets Record Date for Rs. 50 Crore Commercial Paper Maturity",
            "Summary": "Jubilant Ingrevia Limited announced the record date for maturity of its Commercial Paper issue worth Rs. 50 crore. The CP with ISIN INE0BY014425 was issued on September 25, 2025, and will mature on November 21, 2025. The record date has been set for November 20, 2025. The commercial paper is listed on the National Stock Exchange of India.",
            "Sentiment": "neutral",
            "PublishDate": 1758799572280,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Ingrevia Issues Rs. 50 Crore Commercial Papers with 57-Day Tenure",
            "Summary": "Jubilant Ingrevia Limited issued commercial papers worth Rs. 50 crore on September 25, 2025, with a 57-day tenure and 5.95% per annum interest rate. The papers will mature on November 21, 2025, with upfront interest payment and principal repayment at maturity. The commercial papers are listed on the National Stock Exchange and are unsecured with no special rights attached. The Finance Committee had previously approved issuance of commercial papers up to Rs. 600 crore outstanding at any point in time. Following this issuance, the company's total outstanding commercial papers amount to Rs. 100 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1758799083854,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Ingrevia Sets Record Date for Rs. 50 Crore Commercial Paper Maturity",
            "Summary": "Jubilant Ingrevia Limited announced the record date for maturity of its Commercial Paper worth Rs. 50 crore. The record date is November 20, 2025, with maturity on November 21, 2025. The Commercial Paper was issued on September 22, 2025, and is listed on the National Stock Exchange of India Limited with ISIN INE0BY014425.",
            "Sentiment": "neutral",
            "PublishDate": 1758538491688,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Ingrevia Redeems Rs. 50 Crore Commercial Paper on Maturity",
            "Summary": "Jubilant Ingrevia Limited has fully redeemed its Commercial Paper worth Rs. 50 crores on the maturity date of September 16, 2025. The Commercial Paper with ISIN INE0BY014391 was originally issued on July 18, 2025. The company completed the redemption as scheduled on the maturity date.",
            "Sentiment": "neutral",
            "PublishDate": 1758027990807,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Ingrevia Redeems Rs. 70 Crore Commercial Paper on Maturity",
            "Summary": "Jubilant Ingrevia Limited has fully redeemed its Commercial Paper worth Rs. 70 crores on September 15, 2025, which was the maturity date. The Commercial Paper with ISIN INE0BY014409 was originally issued on July 22, 2025. The company completed the redemption as scheduled on the maturity date.",
            "Sentiment": "neutral",
            "PublishDate": 1757935656249,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Ingrevia Shows Recovery Signs After Weak Quarterly Performance",
            "Summary": "Jubilant Ingrevia shares have gained 5% since mid-August after declining 14% following muted revenue growth in the June quarter. The chemical and nutrition products manufacturer derives 56% revenue from domestic operations with only 10% from US exports, limiting tariff impact. The European Union imposed 120% anti-dumping duty on Chinese choline chloride in July, benefiting the company which holds over 50% market share in India for this vitamin B4 product. The company allocated ₹600 crore capex for FY26, spending ₹54 crore in the June quarter to expand production capacity. Revenue breakdown shows specialty chemicals at 46%, chemical intermediaries at 37%, and nutrition products at 17%. Management reported volume uptick in agrochemicals, pharma, and consumer products after six to eight weak quarters. The company targets annualised savings exceeding ₹100 crore in FY26 through its Lean 2.0 cost optimization program. Existing plants at Bharuch and Gajraula will add 15-20% additional capacity, with a new multi-purpose plant construction beginning soon. Equirus Securities projects 34% annual growth in operating margin between FY25 and FY28.",
            "Sentiment": "positive",
            "PublishDate": 1756774289182,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Ingrevia Sets Record Date for Rs. 50 Crore Commercial Paper Maturity",
            "Summary": "Jubilant Ingrevia Limited announced the record date for maturity of its Commercial Paper worth Rs. 50 crore. The CPs are listed on the National Stock Exchange of India Limited with ISIN INE0BY014417. The issue date is August 11, 2025, with maturity scheduled for September 25, 2025. The record date has been set for September 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755025552931,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Ingrevia Issues 500 Million Rupees in Commercial Papers",
            "Summary": "Jubilant Ingrevia has issued commercial papers worth 500 million rupees. Commercial papers are short-term debt instruments used by companies to meet immediate funding requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1754920967908,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Ingrevia Reports 54% Jump in Profit After Tax with Strong Specialty Chemicals Growth",
            "Summary": "Jubilant Ingrevia delivered strong quarterly results with profit after tax rising 54% year-on-year to Rs 75 crore compared to Rs 49 crore in the same quarter last year. EBITDA grew 29% year-on-year to Rs 153 crore, while overall revenue remained stable at Rs 1,038 crore versus Rs 1,024 crore in the previous year. The Specialty Chemicals segment drove performance with 11% revenue growth and achieved its highest ever EBITDA of Rs 130 crore at 27% margin, growing 52% year-on-year. The Nutrition segment saw a 4% revenue decline due to lower niacinamide prices and shipment delays. Chemical Intermediates showed sequential improvement with 1.5% quarter-on-quarter revenue growth and EBITDA margin improving to 4.4%. The company benefits from anti-dumping duties imposed by the European Union on Chinese choline chloride products, creating new export opportunities. Management maintains confidence in reaching peak revenue potential of around Rs 6,500 crore by FY'27 from their Rs 2,000 crore investment program.",
            "Sentiment": "positive",
            "PublishDate": 1754486529399,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Ingrevia Redeems Rs. 100 Crore Commercial Paper on Maturity",
            "Summary": "Jubilant Ingrevia Limited has fully redeemed its Commercial Paper worth Rs. 100 crores on the maturity date of July 31, 2025. The Commercial Paper, bearing ISIN INE0BY014383, was originally issued on June 6, 2025. The company informed stock exchanges BSE and NSE about the completion of the redemption process.",
            "Sentiment": "neutral",
            "PublishDate": 1753969057308,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Ingrevia Reports Quarterly Results for June 2025 with Investment in Renewable Energy",
            "Summary": "Jubilant Ingrevia Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025. On standalone basis, the company reported revenue from operations of ₹97,308 lakhs and net profit of ₹5,901 lakhs, with basic earnings per share of ₹3.70. On consolidated basis, revenue from operations was ₹103,795 lakhs with net profit of ₹7,510 lakhs and basic EPS of ₹4.75. The company operates through three segments: Speciality Chemicals, Nutrition & Health Solutions, and Chemical Intermediates. During the quarter, the company made a third tranche investment in O2 Renewable Energy XVIII Private Limited for renewable energy power generation through solar and wind sources, making it an associate company. The company has outstanding commercial papers worth ₹15,000 lakhs listed on NSE, with maturity dates in July 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753949193675,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Ingrevia Reports Strong Q1 Performance with 54% Jump in Net Profit",
            "Summary": "Jubilant Ingrevia reported quarterly revenue of 10.4 billion rupees compared to 10.2 billion rupees in the same period last year. The company's consolidated net profit increased significantly to 751 million rupees from 487 million rupees year-over-year. EBITDA rose to 1.42 billion rupees from 1.09 billion rupees, while EBITDA margin improved to 13.8% from 10.69% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753948450066,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Ingrevia Schedules Investor Conference Call for Q1 FY26 Results Discussion",
            "Summary": "Jubilant Ingrevia Limited has scheduled an investor conference call on July 31, 2025, at 5:00 pm IST to discuss the unaudited financial results for the quarter ended June 30, 2025. The call will include a management discussion on financial performance followed by a Q&A session. The company will submit the financial results to stock exchanges before hosting the conference call. Jubilant Ingrevia is a globally integrated Life Sciences & Specialty Chemicals company with over 130 products, serving pharmaceutical, nutrition, agrochemical, consumer and industrial customers across multiple geographies including US, EU, Japan, Middle East and South East Asia.",
            "Sentiment": "neutral",
            "PublishDate": 1753261734719,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Ingrevia Confirms Commercial Paper Proceeds Used for Working Capital Requirements",
            "Summary": "Jubilant Ingrevia Limited certified that proceeds from its Commercial Paper issuance with ISINs INE0BY014367, INE0BY014375, and INE0BY014383 were utilized for their disclosed purpose of funding working capital requirements. The company confirmed compliance with SEBI circular regulations and adherence to listing conditions for Commercial Paper as specified in the relevant circular for the quarter ended June 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753260795228,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Ingrevia Sets Record Date for Rs. 70 Crore Commercial Paper Maturity",
            "Summary": "Jubilant Ingrevia Limited has set September 12, 2025 as the record date for the maturity of its Rs. 70 crore Commercial Paper. The CP was issued on July 22, 2025 and is scheduled to mature on September 15, 2025. The instrument carries ISIN INE0BY014409 and is listed on the National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1753258102673,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Ingrevia Issues 500 Million Rupees in Commercial Papers",
            "Summary": "Jubilant Ingrevia has issued commercial papers worth 500 million rupees. No further details about the terms, purpose, or timing of the issuance were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1752840457000,
            "Source": "default"
        },
        {
            "Title": "Anti-Dumping Inquiry Initiated on Methyl Acetoacetate Imports from Switzerland",
            "Summary": "The government has launched an anti-dumping investigation into the import of Methyl Acetoacetate from Switzerland. This inquiry potentially affects Jubilant Ingrevia, a company mentioned in the context of this news.",
            "Sentiment": "neutral",
            "PublishDate": 1751254042000,
            "Source": "default"
        },
        {
            "Title": "Jubilant Ingrevia Issues Commercial Papers Worth ₹1 Billion",
            "Summary": "Jubilant Ingrevia has issued commercial papers worth ₹1 billion (approximately $12 million). Commercial papers are short-term, unsecured debt instruments typically used by companies for immediate financing needs.",
            "Sentiment": "neutral",
            "PublishDate": 1749212444000,
            "Source": "default"
        },
        {
            "Title": "Jubilant Ingrevia Anticipates Growth in Specialty Chemicals and Health Solutions",
            "Summary": "Jubilant Ingrevia expects sustained growth and improved business performance, driven by advancements in specialty chemicals and nutrition and health solutions. The company also plans to implement efficient cost management strategies to further enhance its performance.",
            "Sentiment": "positive",
            "PublishDate": 1747192838000,
            "Source": "default"
        },
        {
            "Title": "Jubilant Ingrevia: Net Profit Soars Over Two-Fold in Q4 FY25",
            "Summary": "Jubilant Ingrevia reported a consolidated net profit of Rs 74.05 crore in Q4 FY25, up from Rs 29.25 crore year-over-year. Total income slightly decreased to Rs 1,059.62 crore. For FY25, net profit rose to Rs 251.17 crore with total income at Rs 4,215.43 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747144166000,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Ingrevia Reports Strong Q4 FY23 Results",
            "Summary": "Jubilant Ingrevia announced its Q4 FY23 financial results. The company reported revenue of 10.51 billion rupees, slightly down from 10.7 billion rupees year-over-year. However, EBITDA increased significantly to 1.47 billion rupees from 912 million rupees, with EBITDA margin improving to 13.95% from 8.4%. The consolidated net profit rose to 740 million rupees from 293 million rupees in the same quarter last year. Additionally, the company declared a dividend of 2.5 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747126348000,
            "Source": "result"
        },
        {
            "Title": "Jubilant Ingrevia to Consider Q4 Results on May 13",
            "Summary": "Jubilant Ingrevia has announced that it will consider its fourth quarter (Q4) financial results on May 13. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745844014000,
            "Source": "default"
        },
        {
            "Title": "Jubilant Ingrevia Acquires Partial Stake in O2 Renewable Energy XVIII",
            "Summary": "Jubilant Ingrevia has successfully acquired 3,602,875 equity shares and 61,346 Compulsorily Convertible Debentures (CCDs) in O2 Renewable Energy XVIII. The company anticipates completing the acquisition of the remaining stake by June 2025.",
            "Sentiment": "positive",
            "PublishDate": 1745599544000,
            "Source": "default"
        },
        {
            "Title": "Jubilant Ingrevia Partners with O2 Power for Renewable Energy",
            "Summary": "Jubilant Ingrevia has entered into a partnership with O2 Power to source renewable energy for its Special Economic Zone (SEZ) manufacturing facility in Bharuch, Gujarat, India. This move demonstrates the company's commitment to sustainable practices and reducing its carbon footprint.",
            "Sentiment": "positive",
            "PublishDate": 1741765463000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Ingrevia Reports Q3 Revenue Increase",
            "Summary": "Jubilant Ingrevia has reported a revenue of 10.56 billion rupees for the third quarter, compared to 9.66 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738052868000,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Ingrevia Reports Significant Increase in Q3 Net Profit",
            "Summary": "Jubilant Ingrevia has announced its consolidated net profit for the third quarter, which stands at 594 million rupees. This represents a substantial increase from the 386 million rupees reported in the same quarter of the previous year, indicating a year-over-year growth in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1738052569000,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Ingrevia Launches New cGMP Facility for Niacinamide Production",
            "Summary": "Jubilant Ingrevia Limited has commissioned a new Current Good Manufacturing Practice (cGMP) facility for the production of Niacinamide. This high bio-content product will serve global leaders in the food, nutrition, and cosmetics industries. The facility's establishment signifies an expansion of Jubilant Ingrevia's manufacturing capabilities and potential market reach.",
            "Sentiment": "positive",
            "PublishDate": 1737936732000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Ingrevia: New Nutraceutical Facility Commissioned in Gujarat",
            "Summary": "Jubilant Ingrevia has commissioned a new cGMP compliant facility in Bharuch, Gujarat, to manufacture nutraceuticals and dietary-active ingredients. The facility, an extension of their USFDA-approved plant, has a capacity of 5,000 metric tonnes and is part of a fully-green supply chain. It will produce Niacinamide for food, nutrition, and cosmetic applications, including infant nutrition.",
            "Sentiment": "positive",
            "PublishDate": 1737800441000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Ingrevia Unit Approves Purchase of Additional Equity in FAPL",
            "Summary": "Jubilant Ingrevia's subsidiary has approved the purchase of 6.67% equity in FAPL (Full company name not provided) at a cost of 10.2915 rupees per share. This acquisition will increase Jubilant Ingrevia's total equity holding in FAPL to 15.79% post-acquisition.",
            "Sentiment": "neutral",
            "PublishDate": 1735603147000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Ingrevia Subsidiary to Increase Stake in FAPL",
            "Summary": "A subsidiary of Jubilant Ingrevia has approved the purchase of 6.67% equity in FAPL (Full name not provided) at a cost of 10.2915 rupees per share. Following this acquisition, Jubilant Ingrevia will hold a total of 15.79% equity shares in FAPL.",
            "Sentiment": "neutral",
            "PublishDate": 1735570535000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Ingrevia Issues Commercial Papers Worth 1 Billion Rupees",
            "Summary": "Jubilant Ingrevia has issued commercial papers amounting to 1 billion rupees on December 11. Commercial papers are short-term, unsecured debt instruments typically used by companies for immediate financing needs.",
            "Sentiment": "neutral",
            "PublishDate": 1733922567000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Ingrevia Announces Significant Capital Expenditure Plans",
            "Summary": "Jubilant Ingrevia has revealed plans for substantial capital expenditure over the next three years. The company anticipates incremental capex of 600 to 800 crore rupees annually during this period. Additionally, the company intends to announce more capex projects in the coming quarters, aligning with its long-term growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1729653528000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Ingrevia Commits to Ambitious Growth Plan",
            "Summary": "The Managing Director of Jubilant Ingrevia has announced the company's commitment to their growth strategy, dubbed 'Pinnacle 345 Vision'. This plan aims to triple the company's revenue and quadruple its EBITDA within a five-year period.",
            "Sentiment": "positive",
            "PublishDate": 1729587041000,
            "Source": "corporate_action"
        }
    ]
}