{
    "Symbol": "JUBLPHARMA",
    "ISIN": "INE700A01033",
    "News": [
        {
            "Title": "Jubilant Pharmova schedules investor meets for Feb 9",
            "Summary": "Jubilant Pharmova announces physical investor/analyst meetings on February 09, 2026 in Mumbai to discuss Q3FY26 earnings with 29 institutional investors at Nuvama India Conference 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770048630956,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jubilant Pharmova faces ₹22.10 cr tax demand",
            "Summary": "Jubilant Pharmova received Income Tax Department order raising ₹22.10 crores tax demand for FY2020, citing arithmetical errors and transfer pricing adjustments. Company plans rectification appeal.",
            "Sentiment": "negative",
            "PublishDate": 1767166807644,
            "Source": "stocks"
        },
        {
            "Title": "Jubilant Pharmova invests in Canadian subsidiary",
            "Summary": "Jubilant Pharmova Limited announces CAD 30,000 investment in Jubilant Pharmaceuticals Inc., Canada, making it a step-down wholly owned subsidiary to establish branded generic business in the Canadian market.",
            "Sentiment": "positive",
            "PublishDate": 1767098106011,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jubilant Pharmova Subsidiary Faces ₹1.73 Cr GST Demand",
            "Summary": "Jubilant Generics Limited receives GST demand order of ₹1.57 crores plus ₹15.68 lakh penalty from Roorkee GST authorities for erroneously sanctioned refund. Company plans appeal.",
            "Sentiment": "negative",
            "PublishDate": 1766818353006,
            "Source": "stocks"
        },
        {
            "Title": "Jubilant Pharmova's Subsidiary Receives GST Demand Order Worth Rs 13.77 Crore",
            "Summary": "Jubilant Biosys Limited, a wholly owned subsidiary of Jubilant Pharmova, received an adjudication order from Deputy Commissioner of Commercial Taxes, Mysuru, demanding GST, interest and penalty totaling Rs 13.77 crore for Financial Year 2021-2022 related to Input Tax Credit issues. The company plans to file a detailed appeal contesting the order and expects no financial or operational impact.",
            "Sentiment": "neutral",
            "PublishDate": 1764933735326,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Pharmova Appoints Daniel J. O'Connor as CEO of Jubilant Therapeutics Inc.",
            "Summary": "Jubilant Pharmova has appointed Daniel J. O'Connor as the Chief Executive Officer of its subsidiary unit Jubilant Therapeutics Inc. The leadership appointment affects the pharmaceutical company's therapeutics division and represents a key management change in the organization's structure.",
            "Sentiment": "positive",
            "PublishDate": 1764644348420,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jubilant Pharmova Completes USFDA Audit of Montreal Facility With 9 Observations",
            "Summary": "Jubilant Pharmova has completed a USFDA audit of its Montreal manufacturing facility. The audit resulted in 9 observations from the regulatory authority.",
            "Sentiment": "neutral",
            "PublishDate": 1762267783836,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Pharmova Grants 1,506 Stock Options to Employees",
            "Summary": "Jubilant Pharmova's Board of Directors approved the grant of 1,506 stock options/restricted stock units (RSUs) to eligible employees under the Jubilant Pharmova Employees Stock Option Plan 2018. The options have an exercise price of Re. 1 each, which equals the face value per equity share. The RSUs will vest at the end of 3 years, subject to fulfillment of pre-vesting conditions. Once vested, the stock options can be exercised within a maximum period of 1 year. The vesting is subject to a minimum period of 1 year and maximum period of 5 years from the grant date as per the company's stock option plan.",
            "Sentiment": "neutral",
            "PublishDate": 1761897151378,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Pharmova Reports Quarterly Results and Completes API Business Transfer",
            "Summary": "Jubilant Pharmova Limited's Board of Directors approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company completed the sale and transfer of its Active Pharmaceutical Ingredients (API) business to wholly-owned subsidiary Jubilant Biosys Limited on September 1, 2025, following board approval in June and shareholder approval in July. The API business has been classified as discontinued operations in standalone results. The transaction was discharged primarily through share issuance and resulted in reversal of deferred tax liability of ₹840 million and creation of tax provision of ₹436 million. The company's continuing operations now comprise management and other support services. Consolidated results show exceptional items during the half-year including ₹217 million gain from asset sales in Maryland, USA, ₹179 million expenses from temporary suspension of Montreal facility operations, and ₹96 million amortization of debt initiation costs.",
            "Sentiment": "neutral",
            "PublishDate": 1761896663594,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Pharmova Reports Strong Q2 Performance with Revenue Growth to 19.6B Rupees",
            "Summary": "Jubilant Pharmova delivered robust quarterly results with revenue increasing to 19.6 billion rupees from 17.5 billion rupees year-over-year. The company's EBITDA rose to 3.41 billion rupees compared to 2.89 billion rupees in the same period last year, while EBITDA margin improved to 17.36% from 16.6%. Consolidated net profit grew to 1.2 billion rupees from 1 billion rupees year-over-year, demonstrating improved profitability across key financial metrics.",
            "Sentiment": "positive",
            "PublishDate": 1761896188205,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Pharmova Arm Plans $300 Million US Investment to Double Sterile Injectable Capacity by FY28",
            "Summary": "Jubilant HollisterStier LLC will invest $300 million by FY28 in its Spokane, Washington facility to double sterile injectable manufacturing capacity. The company launched its third sterile fill and finish line with a $132 million investment as phase one of the expansion. Current production stands at 50 million vials annually, which will increase to 100 million vials upon completion. The investment addresses a 700 million unit demand-supply gap in the US sterile vials market, with total global demand at 6.8 billion units versus 6.1 billion supply. Trump's tariffs have accelerated the original expansion plans by increasing demand for US-based manufacturing. The company received a $150 million US government grant following its success in scaling Covid therapeutics manufacturing. The expanded capacity will serve approximately 350 million patient doses, potentially reaching nearly the entire US population.",
            "Sentiment": "positive",
            "PublishDate": 1760076863460,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Pharmova Invests $132 Million in New High-Speed Production Line in Spokane",
            "Summary": "Jubilant Pharmova has launched a new high-speed production line in Spokane with a $132 million investment. The new facility increases the company's capacity by 50% and has begun generating revenue.",
            "Sentiment": "positive",
            "PublishDate": 1760066937137,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Pharmova Distributes ₹515.59 Crore OCRPS to Acquire API Business from Jubilant Biosys",
            "Summary": "Jubilant Pharmova has approved the distribution of 5,15,59,030 Optionally Convertible Redeemable Preference Shares (OCRPS) valued at ₹5,15,59,03,000 to purchase the API (Active Pharmaceutical Ingredients) business from Jubilant Biosys. The transaction includes an additional cash payment of ₹80 crore.",
            "Sentiment": "positive",
            "PublishDate": 1759305417129,
            "Source": "order&deals"
        },
        {
            "Title": "Jubilant Pharmova Appoints Arun Kumar Sharma as Interim CFO",
            "Summary": "Jubilant Pharmova Limited appointed Arun Kumar Sharma as interim Chief Financial Officer and Key Managerial Personnel effective October 1, 2025. The Board of Directors approved the appointment on September 23, 2025, following recommendations from the Nomination, Remuneration and Compensation Committee and Audit Committee. The appointment is for an interim period to ensure smooth transition while the company continues its process to identify and appoint a permanent CFO. Sharma brings over three decades of experience in corporate finance, global treasury, investor relations, and risk management. He previously held CFO positions within the Jubilant Bhartia Group, including at Jubilant Pharma Holdings Inc. USA for approximately 4 years, Jubilant Lifesciences Limited for approximately 3 years, and Jubilant Pharmova Limited for approximately 2 years from April 2021 to May 2023.",
            "Sentiment": "neutral",
            "PublishDate": 1758608017334,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jubilant Pharmova Completes USFDA Pharmacovigilance Inspection with Zero Observations",
            "Summary": "Jubilant Pharmova Limited announced the completion of a United States Food and Drug Administration Post-marketing Adverse Drug Experience inspection of its subsidiary Jubilant Cadista Pharmaceuticals Inc, USA on September 19, 2025. The inspection concluded with no observations. The company stated this reaffirms their commitment to maintaining high standards of quality, safety, and compliance. Jubilant Cadista Pharmaceuticals is a subsidiary of Jubilant Pharma Limited, which is a wholly-owned subsidiary of Jubilant Pharmova Limited.",
            "Sentiment": "positive",
            "PublishDate": 1758381060315,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Pharmova Schedules Virtual Investor Conference with Eight Investment Firms",
            "Summary": "Jubilant Pharmova Limited has scheduled a virtual meeting with institutional investors on August 13, 2025, as part of the NBIE Virtual Investor Conference. The company will meet with representatives from eight investment firms, including ASK Investment Managers, Bajaj Finserv AMC, Parag Parikh Financial Advisory Services, Karma Capital, 2Point2 Capital, Bank Of India, Bay Capital, and Sundaram Alternates. The meeting is organized by Nirmal Bang Institutional Equities and includes a presentation to be discussed during the session. The company operates as a diversified pharmaceutical company with presence in radiopharmaceuticals, allergy immunotherapy, CDMO sterile injectables, drug discovery services, generics, and proprietary novel drugs. In quarterly results, the company reported revenue of Rs. 1,901 crores with EBITDA margins of 15.8%. The company has set Vision 2030 targets including doubling revenue from current levels, achieving 23-25% EBITDA margins, reaching zero net debt, and high teens return on capital employed.",
            "Sentiment": "neutral",
            "PublishDate": 1754588956656,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Pharmova's Roorkee Facility Completes USFDA Pre-Approval Inspection with 4 Observations",
            "Summary": "Jubilant Pharmova Limited announced that the USFDA concluded a pre-approval inspection of its solid dosage formulations facility at Roorkee, India. The inspection was completed on August 1, 2025, for the facility operated by Jubilant Generics Limited, a subsidiary of Jubilant Pharma Limited. The USFDA issued 4 observations following the audit, and the company will submit an action plan addressing these observations. The Roorkee site's revenue from the US market represents less than one percent of Jubilant Pharmova's total revenues for the trailing twelve-month period from July 2024 to June 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754100071104,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Pharmova Schedules Investor Meetings in Singapore, Reports 10% Revenue Growth",
            "Summary": "Jubilant Pharmova has scheduled investor meetings on August 6, 2025, in Singapore with nine institutional investors including Lion Global Investor, Tree Line Investment Management, and Templeton Emerging Markets Group as part of the Nuvama India Conference. The company reported quarterly results showing revenue growth of 10% year-over-year to Rs. 1,901 crores, with EBITDA margins at 15.8%. The diversified pharmaceutical company operates across radiopharmaceuticals, allergy immunotherapy, sterile injectables, drug discovery services, and generics. Key business highlights include Ruby-Fill maintaining growth momentum in radiopharmaceuticals, capacity expansion at Spokane facility progressing ahead of expectations, and improving growth outlook in generics. The company has set Vision 2030 targets including doubling revenue from current levels, achieving 23-25% EBITDA margins, zero net debt, and high teens return on capital employed.",
            "Sentiment": "positive",
            "PublishDate": 1753985023645,
            "Source": "stock"
        },
        {
            "Title": "Jubilant Pharmova CFO Arvind Chokhany Resigns, Effective September 30, 2025",
            "Summary": "Jubilant Pharmova Limited announced that Arvind Chokhany has resigned from his position as Chief Financial Officer and Whole-Time Director. Chokhany submitted his resignation letter on July 29, 2025, and will cease to hold his positions effective closing business hours of September 30, 2025. The company disclosed this information to BSE and NSE exchanges under regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1753779760038,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jubilant Pharmova Reports Mixed Q1 Results with Higher EBITDA but Lower Net Profit",
            "Summary": "Jubilant Pharmova announced its quarterly financial results showing profit before exceptional items and tax increased to 1.5 billion rupees from 1 billion rupees year-over-year. The company's EBITDA grew to 2.9 billion rupees from 2.5 billion rupees, with EBITDA margin improving to 15.24% from 14.5%. However, consolidated net profit declined significantly to 1 billion rupees compared to 4.8 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1753776471585,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Pharmova Shareholders Approve Sale of API Business to Subsidiary",
            "Summary": "Jubilant Pharmova Limited received shareholder approval through postal ballot for the sale and transfer of its Active Pharmaceutical Ingredients (API) Business to Jubilant Biosys Limited, a wholly-owned subsidiary, on a slump sale basis. The special resolution was passed with 99.997% votes in favor, with 602 shareholders voting for the proposal and 44 against. The postal ballot process concluded on July 24, 2025, with a total of 646 shareholders participating in the e-voting process. The cut-off date for eligible shareholders was June 13, 2025, and the company had 101,083 total shareholders on record.",
            "Sentiment": "positive",
            "PublishDate": 1753377390627,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Pharmova Acquires 14.53% Stake in Isharays Energy for Green Power Supply",
            "Summary": "Jubilant Pharmova will purchase a 14.53% stake in Isharays Energy. This acquisition is aimed at securing green energy supply for the company's Greater Noida manufacturing plant.",
            "Sentiment": "positive",
            "PublishDate": 1753201979070,
            "Source": "order&deals"
        },
        {
            "Title": "Jubilant Pharmova Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 4,804,883 shares of Jubilant Pharmova Ltd. occurred on the National Stock Exchange (NSE) for Rs. 511.96 crores. The trade was executed at a price of Rs. 1065.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1749786345000,
            "Source": "block_details"
        },
        {
            "Title": "Jubilant Pharmova to Transfer API Business to Subsidiary",
            "Summary": "Jubilant Pharmova's board has approved the sale and transfer of its API (Active Pharmaceutical Ingredients) business to its wholly owned subsidiary, Jubilant Biosys Limited. The transfer will be executed on a slump sale basis.",
            "Sentiment": "neutral",
            "PublishDate": 1749774500000,
            "Source": "default"
        },
        {
            "Title": "Jubilant Pharmova: Board Approves API Business Transfer to Subsidiary",
            "Summary": "Jubilant Pharmova's board approved the sale and transfer of its API business to wholly-owned subsidiary Jubilant Biosys on a slump sale basis. The API division had a turnover of ₹609 crore in FY25, 8.35% of consolidated revenue. The transfer is expected to complete by September 1, 2025, with consideration based on book value of assets and liabilities.",
            "Sentiment": "neutral",
            "PublishDate": 1749743601000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Pharmova Approves API Division Transfer to Subsidiary",
            "Summary": "The board of Jubilant Pharmova has approved the transfer of its API (Active Pharmaceutical Ingredients) division to its wholly owned subsidiary, Jubilant Biosys Limited. The transfer will be executed through a slump sale method.",
            "Sentiment": "neutral",
            "PublishDate": 1749723839000,
            "Source": "default"
        },
        {
            "Title": "Jubilant Pharmova's ₹36 Crore Tax Demand Fully Rescinded",
            "Summary": "Jubilant Pharmova has announced that a tax demand of ₹36 crore against the company has been completely rescinded. This development appears to be a positive outcome for the company, relieving it of a significant financial obligation.",
            "Sentiment": "positive",
            "PublishDate": 1749622949000,
            "Source": "default"
        },
        {
            "Title": "Jubilant Pharmova Reports Strong Q4 Results and Declares Dividend",
            "Summary": "Jubilant Pharmova announced its Q4 financial results, showing significant improvements. Revenue increased to 19 billion rupees from 17.6 billion rupees year-over-year. EBITDA rose to 3.45 billion rupees from 2.71 billion rupees, with the EBITDA margin improving to 17.91% from 15.43%. The company reported a consolidated net profit of 1.5 billion rupees, compared to a loss of 590 million rupees in the same period last year. Additionally, Jubilant Pharmova declared a dividend of 5 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747382022000,
            "Source": "result"
        },
        {
            "Title": "Jubilant Pharmova to Consider Q4 Results on May 16",
            "Summary": "Jubilant Pharmova has announced that it will consider its fourth quarter (Q4) financial results on May 16. This is a standard corporate procedure where the company's board will review and potentially approve the financial statements for the last quarter of their fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1746019450000,
            "Source": "default"
        },
        {
            "Title": "Jubilant Pharmova's Subsidiary Acquires 80% Stake in Jasmin and R&D Centre in France",
            "Summary": "Jubilant Pharmova has announced that its subsidiary has subscribed to 80% of the equity capital in Jasmin. Additionally, Jasmin has acquired Pierre Fabre's R&D Centre located in Saint Julien, France. This move suggests an expansion of Jubilant Pharmova's research capabilities and international presence in the pharmaceutical sector.",
            "Sentiment": "positive",
            "PublishDate": 1742451329000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Cadista Facility Receives EIR with VAI Status from USFDA",
            "Summary": "Jubilant Pharmova announced that its Jubilant Cadista facility has successfully closed an inspection by the United States Food and Drug Administration (USFDA). The facility received an Establishment Inspection Report (EIR) with Voluntary Action Indicated (VAI) status, indicating that the inspection was concluded satisfactorily.",
            "Sentiment": "positive",
            "PublishDate": 1741824342000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jubilant Pharmova: FDA Closes Inspection of Maryland Facility with VAI Status",
            "Summary": "Jubilant Cadista Pharmaceuticals, a subsidiary of Jubilant Pharmova, received an Establishment Inspection Report (EIR) with Voluntary Action Indicated (VAI) status from the USFDA for its Maryland facility. The inspection, conducted in January 2025, is now closed. However, the facility's manufacturing operations were previously shut down in April 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1741786957000,
            "Source": "normal_news"
        },
        {
            "Title": "Jubilant Cadista Facility Receives EIR with VAI Status from USFDA",
            "Summary": "Jubilant Pharmova announced that its Jubilant Cadista facility has successfully closed an inspection by the U.S. Food and Drug Administration (USFDA). The facility received an Establishment Inspection Report (EIR) with Voluntary Action Indicated (VAI) status, indicating that the inspection was concluded satisfactorily.",
            "Sentiment": "positive",
            "PublishDate": 1741785278000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jubilant Pharmova Reports Improved Q3 EBITDA and Margin",
            "Summary": "Jubilant Pharmova has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 2.87 billion rupees from 2.18 billion rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 15.78% from 13.09% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738308816000,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Pharmova Reports Significant Increase in Q3 Net Profit and Revenue",
            "Summary": "Jubilant Pharmova has announced its financial results for the third quarter. The company's consolidated net profit rose to 1 billion rupees, up from 668 million rupees in the same period last year. Revenue also increased to 18.1 billion rupees from 16.6 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738308759000,
            "Source": "earnings"
        },
        {
            "Title": "Jubilant Pharmova Unit Prepays $25 Million Term Loan",
            "Summary": "A subsidiary of Jubilant Pharmova has voluntarily prepaid a term loan of $25 million, which is equivalent to approximately Rs. 214 crore. This early repayment demonstrates the company's financial strength and commitment to reducing debt.",
            "Sentiment": "positive",
            "PublishDate": 1737936652000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Pharmova Subsidiary Prepays $25 Million Term Loan",
            "Summary": "A subsidiary of Jubilant Pharmova has voluntarily prepaid a term loan of $25 million, which is equivalent to approximately Rs. 214 crore. This early repayment demonstrates the company's financial strength and commitment to reducing debt.",
            "Sentiment": "positive",
            "PublishDate": 1737729662000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Pharmova: USFDA Issues Five Observations to US Subsidiary's Facility",
            "Summary": "USFDA inspected Jubilant Cadista Pharmaceuticals' facility in Maryland, issuing five observations. The facility will not manufacture products due to closed operations. Jubilant HollisterStier's Washington facility received 'voluntary action indicated' status in September. Jubilant Biosys is set to acquire 80% stake in Pierre Fabre Laboratories' R&D Centre in France.",
            "Sentiment": "neutral",
            "PublishDate": 1737079175000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jubilant Pharmova Reports Improved Q2 Financial Performance",
            "Summary": "Jubilant Pharmova has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 2.89 billion rupees from 2.4 billion rupees in the same quarter last year. Additionally, the EBITDA margin improved to 16.6% from 14.39% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729839309000,
            "Source": "result"
        },
        {
            "Title": "Jubilant Pharmova Reports Q2 Revenue Growth",
            "Summary": "Jubilant Pharmova has announced its second quarter revenue results. The company reported revenue of 17.5 billion rupees, compared to 16.8 billion rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729839228000,
            "Source": "result"
        },
        {
            "Title": "Jubilant Pharmova Reports Significant Increase in Q2 Profit",
            "Summary": "Jubilant Pharmova, a pharmaceutical company, has reported a substantial increase in its consolidated net profit for the second quarter. The company's net profit rose to 1 billion rupees, up from 625 million rupees in the same period last year, representing a 60% year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1729839205000,
            "Source": "result"
        },
        {
            "Title": "Jubilant Pharmova's Tax Demand Reduced",
            "Summary": "<p>A unit of <span class='neutral'>Jubilant Pharmova</span> has <span class='positive'>successfully</span> applied for <span class='neutral'>rectification</span>, resulting in the <span class='positive'>deletion</span> of a <b>381.3 million rupees</b> <span class='negative'>tax demand</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728558877000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jubilant Pharmova's Subsidiary to Acquire Majority Stake in Jasmin",
            "Summary": "<p><span class='positive'>Jubilant Pharmova</span> announced that its subsidiary, <b>JBIRSPL</b>, will <span class='positive'>acquire</span> 80% equity in <b>Jasmin</b> for up to 4.4 million euros. Jasmin will then <span class='positive'>acquire</span> <b>Pierre Fabre's</b> <span class='positive'>R&D center</span> in Saint Julien, France. The <span class='positive'>acquired</span> entity specializes in <span class='positive'>drug discovery</span> for <b>biologics</b> and <b>ADCs</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728045918000,
            "Source": "corporate_action"
        }
    ]
}