{
    "Symbol": "JUNIPER",
    "ISIN": "INE696F01016",
    "News": [
        {
            "Title": "Juniper Hotels Q3FY26 Earnings Call on Feb 11",
            "Summary": "Juniper Hotels Limited has scheduled an earnings conference call on February 11, 2026, at 4:15 PM IST to discuss Q3FY26 results with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1770267792242,
            "Source": "co_actions_results"
        },
        {
            "Title": "Juniper Hotels Appoints New Independent Director",
            "Summary": "Juniper Hotels Limited successfully appointed Mr. Mayur Chokshi as Non-Executive Independent Director through postal ballot with 99.99% shareholder approval on January 21, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769090491676,
            "Source": "stocks"
        },
        {
            "Title": "Juniper Hotels Postal Ballot Passes Special Resolution",
            "Summary": "Juniper Hotels Limited successfully passes special resolution through postal ballot for payment of remuneration to Non-Executive Independent Director Mr. Rajiv Kaul with 99.99% approval.",
            "Sentiment": "positive",
            "PublishDate": 1766746010361,
            "Source": "stocks"
        },
        {
            "Title": "Juniper Hotels Fined ₹2.65L for Board Compliance Issue",
            "Summary": "Juniper Hotels paid ₹2.65 lakh fine for non-compliance with SEBI board composition regulations. Company appointed new independent director and commits to stricter governance.",
            "Sentiment": "neutral",
            "PublishDate": 1766037747841,
            "Source": "stocks"
        },
        {
            "Title": "Juniper Hotels Issues Postal Ballot Notice for Director",
            "Summary": "Juniper Hotels Limited issues postal ballot notice seeking shareholder approval for Mayur Chokshi's appointment as Non-Executive Independent Director through remote e-voting from December 23, 2025 to January 21, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766037262687,
            "Source": "stocks"
        },
        {
            "Title": "Juniper Hotels VP of Corporate Communications Resigns",
            "Summary": "Nikita Das, Vice President of Corporate Communications and Marketing at Juniper Hotels Limited, resigned effective December 5, 2025, to pursue better opportunities. The resignation affects the company's senior management team in the marketing and communications domain.",
            "Sentiment": "neutral",
            "PublishDate": 1764939344711,
            "Source": "corporate_governance"
        },
        {
            "Title": "Juniper Hotels Board Approves Participation in Gstaad Hotels' Insolvency Resolution Process",
            "Summary": "Juniper Hotels Limited's Board approved participation in the Corporate Insolvency Resolution Process of Gstaad Hotels Private Limited, which owns and operates JW Marriott Bengaluru with Rs. 246.93 crore turnover. The acquisition involves claims of approximately Rs. 1,175 crore and aligns with Juniper's growth strategy in the premium hospitality sector, subject to Committee of Creditors and NCLT approval.",
            "Sentiment": "neutral",
            "PublishDate": 1764227587550,
            "Source": "order&deals"
        },
        {
            "Title": "Juniper Hotels Reports Strong Q2 FY26 Performance with 28% EBITDA Growth and Expansion Pipeline Progress",
            "Summary": "Juniper Hotels delivered robust quarterly results with total income reaching INR 235 crores, EBITDA growing 28% year-on-year to INR 82.6 crores, and profit after tax of INR 16.8 crores versus a loss of INR 27.8 crores in the previous year. The company's development pipeline remains on track with Bangalore Phase 1 (235 keys) expected to be ready by end of fiscal year, while management has submitted bids for strategic developments in Andaman, Delhi's Yashobhoomi, and other locations to expand their portfolio from current 1,900 keys to 4,091 keys.",
            "Sentiment": "positive",
            "PublishDate": 1763357733300,
            "Source": "earnings"
        },
        {
            "Title": "Juniper Hotels Reports Monitoring Agency Findings for IPO Proceeds Utilization",
            "Summary": "Juniper Hotels Limited disclosed its monitoring agency report for the quarter ended September 30, 2025, regarding the utilization of proceeds from its Rs. 1,800 crore Initial Public Offer. CARE Ratings Limited, serving as the monitoring agency, reported no deviation from stated objects. The company had no utilization during the reporting quarter. Out of the total IPO proceeds, Rs. 1,500 crore was allocated for repayment of outstanding borrowings and Rs. 233.08 crore for general corporate purposes. As of the quarter end, Rs. 77.14 crore has been utilized for general corporate purposes, leaving Rs. 155.94 crore unutilized. The company has invested the unutilized proceeds in fixed deposits with Kotak and ICICI banks, earning returns between 6.15% to 7.61% per annum. There has been a delay in utilization of proceeds under General Corporate Purpose, with the company having utilized Rs. 77.14 crore against the scheduled deployment of Rs. 233.084 crore by March 31, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1762931928270,
            "Source": "stock"
        },
        {
            "Title": "Juniper Hotels Reports Highest Ever Q2 Revenue of ₹235 Crores, Swings to Profit",
            "Summary": "Juniper Hotels Limited announced its quarterly results with total income reaching ₹235 crores, marking the highest ever Q2 performance with 5% year-on-year growth. The company reported EBITDA of ₹87.3 crores, up 20% year-on-year with margins expanding to 37%. The company swung to a profit after tax of ₹16.8 crores compared to a loss of ₹27.8 crores in the same quarter last year. Key performance indicators showed consolidated ARR at ₹10,599 and RevPAR at ₹7,663. The company reported progress on development projects including Phase I Bengaluru (235 keys) on track for launch by year-end, Kaziranga Resort (111 keys) ground-breaking in September 2025, and Guwahati (340 keys) and Phase II Bengaluru (273 keys) in pre-development stages. The company has submitted bids for greenfield development projects in Andaman Nicobar Islands and Dwarka. An exceptional item of ₹3.8 crores was recorded for legal case settlement fees during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762928893980,
            "Source": "earnings"
        },
        {
            "Title": "Juniper Hotels Reports Net Profit of ₹1,635 Crores for Q2 FY2025 Despite Fire Incident Loss",
            "Summary": "Juniper Hotels Limited announced quarterly results for the quarter and six months ended September 30, 2025. The company reported a net profit of ₹1,635.46 crores for the quarter, compared to a net loss of ₹5,024.93 crores in the same period last year. Revenue from operations stood at ₹23,022.23 crores for the quarter. The company recorded exceptional losses of ₹1,714.18 crores due to a fire incident at its Bangalore property on April 20, 2025, which impacted the under-construction building and assets. The insurance company has admitted the claim and released an interim payment of ₹500 lakhs. Additionally, a subsidiary settled a litigation matter for ₹378.56 crores. The board also updated the list of Senior Management Personnel while Key Managerial Personnel remain unchanged. Earnings per share improved to ₹0.76 for the quarter compared to negative ₹2.25 in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762767246918,
            "Source": "earnings"
        },
        {
            "Title": "Juniper Hotels Reports 7.48% Revenue Growth and Returns to Profitability in Q2",
            "Summary": "Juniper Hotels reported Q2 revenue of 2.3 billion rupees, representing a 7.48% increase from 2.14 billion rupees in the same period last year. The company returned to profitability with a consolidated net profit of 168 million rupees, compared to a loss of 278 million rupees in the previous year. EBITDA improved to 826 million rupees from 644 million rupees, while EBITDA margin expanded to 35.87% from 30.03%.",
            "Sentiment": "positive",
            "PublishDate": 1762766802485,
            "Source": "earnings"
        },
        {
            "Title": "Juniper Hotels Schedules Q2 FY26 Results Conference Call",
            "Summary": "Juniper Hotels Limited has scheduled an earnings conference call to discuss their Q2 FY26 results on Tuesday, November 11, 2025, at 1:30 PM IST. The call will be attended by key management including Chairman and Managing Director Arun Kumar Saraf, CEO Varun Saraf, CFO Tarun Jaitly, and other senior management members. The company has provided dial-in numbers for analysts and investors, including international toll-free options for Hong Kong, UK, Singapore, and USA participants.",
            "Sentiment": "neutral",
            "PublishDate": 1762430186798,
            "Source": "earnings"
        },
        {
            "Title": "Juniper Hotels Completes Earnings Conference Call for Quarter Ended June 30, 2025",
            "Summary": "Juniper Hotels Limited conducted an earnings conference call on August 13, 2025, at 4:00 p.m. IST to discuss its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The call concluded at 4:50 p.m. IST. The audio recording of the earnings call is available on the company's website. The company confirmed that no unpublished price sensitive information was shared with investors during the call.",
            "Sentiment": "neutral",
            "PublishDate": 1755096898673,
            "Source": "earnings"
        },
        {
            "Title": "Juniper Hotels Reports Strong Q1 Results with 11% Revenue Growth and 27% EBITDA Jump",
            "Summary": "Juniper Hotels Limited announced its quarterly financial results with total income rising 11% year-over-year to ₹227.3 crore. EBITDA increased 27% to ₹86.4 crore, with margins improving to 38% from 33% in the previous year. Profit before tax surged 167% to ₹35.1 crore excluding exceptional items. The hospitality company, which operates 8 hotel assets with 2,130 keys across luxury brands including Grand Hyatt, Andaz, and Hyatt Regency, maintained occupancy at 71% while achieving 9% growth in average room rates to ₹10,568. Food & beverage and MICE revenue grew 12% to ₹69 crore. The company is expanding with multiple projects including a Bengaluru asset expected to begin operations by fiscal year-end, and construction on a Kaziranga project set to commence in September 2025. Management noted achieving the highest Q1 revenue despite geopolitical headwinds affecting occupancy, particularly at Andaz Delhi.",
            "Sentiment": "positive",
            "PublishDate": 1755062406568,
            "Source": "earnings"
        },
        {
            "Title": "Juniper Hotels Board Approves Re-appointment of Rajiv Kaul as Independent Director for Second Term",
            "Summary": "Juniper Hotels Limited's Board of Directors approved the re-appointment of Mr. Rajiv Kaul as an Independent Director for a second term of 4 years, from September 20, 2025 to September 19, 2029. The decision was made based on the recommendation of the Nomination and Remuneration Committee and is subject to shareholder approval. Kaul's current term as Independent Director expires on September 19, 2025. He holds a master's in business administration in hospitality management from ESSEC Business School, France, and previously worked with HLV Limited in various positions including brand advisor and president at Leela Hotels. The company confirmed that Kaul is not debarred from accessing capital markets and is not related to any other director of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1754986410503,
            "Source": "corporate_governance"
        },
        {
            "Title": "Juniper Hotels Reports Q1 FY26 Results; Fire Incident at Bangalore Property Leads to ₹1,714 Crore Exceptional Loss",
            "Summary": "Juniper Hotels Limited announced its quarterly results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of ₹22,074.18 crores, compared to ₹19,960.23 crores in the same quarter last year. Consolidated profit after tax stood at ₹900.18 crores versus ₹1,166.54 crores in the previous year quarter. The company recorded an exceptional loss of ₹1,714.18 crores due to a fire incident at its under-construction Bangalore property on April 20, 2025. The fire affected part of the building, furniture and fixtures, with no casualties reported. Juniper has submitted an insurance claim and received an interim payment of ₹500 crores from the insurance company. The company also reconstituted its Nomination and Remuneration Committee and Corporate Social Responsibility Committee. Standalone revenue from operations was ₹18,990.48 crores for the quarter, with profit after tax of ₹1,076.32 crores. Basic and diluted earnings per share on consolidated basis was ₹0.40 for the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754985255337,
            "Source": "earnings"
        },
        {
            "Title": "Juniper Hotels Reports Mixed Q1 Results with Net Profit Decline Despite PBT Growth",
            "Summary": "Juniper Hotels reported consolidated net profit of 90 million rupees for Q1, down from 117 million rupees in the same period last year. However, the company's profit before tax (PBT) increased significantly to 350 million rupees compared to 131 million rupees year-over-year. The results included an exceptional item worth 171 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1754984748635,
            "Source": "earnings"
        },
        {
            "Title": "Juniper Hotels Reports Improved Q4 EBITDA and Margin",
            "Summary": "Juniper Hotels has reported its Q4 financial results. The company's EBITDA increased to 1.17 billion rupees, up from 911 million rupees in the same quarter of the previous year. The EBITDA margin also improved, rising to 42.05% from 37.14% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748424054000,
            "Source": "result"
        },
        {
            "Title": "Juniper Hotels Reports Q4 Revenue and Profit Growth",
            "Summary": "Juniper Hotels announced its Q4 financial results. The company's revenue increased to 2.8 billion rupees from 2.4 billion rupees in the same quarter last year. The consolidated net profit rose to 550 million rupees, up from 467 million rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1748423965000,
            "Source": "result"
        },
        {
            "Title": "Juniper Hotels Acquires Shares of Jenipro Hotels for 5-Star Hotel Development",
            "Summary": "Juniper Hotels has executed a Share Purchase Agreement to acquire shares of Jenipro Hotels. This acquisition is aimed at developing a 5-star hotel on land in Kaziranga. The move signifies Juniper Hotels' expansion plans and investment in luxury hospitality infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1742342648000,
            "Source": "corporate_action"
        },
        {
            "Title": "Juniper Hotels Acquires Jenipro Hotels to Develop 5-Star Hotel in Kaziranga",
            "Summary": "Juniper Hotels has executed a share purchase agreement to acquire shares of Jenipro Hotels. This acquisition is aimed at developing a 5-star hotel on land in Kaziranga.",
            "Sentiment": "positive",
            "PublishDate": 1742305557000,
            "Source": "corporate_action"
        },
        {
            "Title": "Juniper Hotels Plans Significant Expansion by FY26-28",
            "Summary": "Juniper Hotels has announced ambitious growth plans, aiming to double its number of hotel keys by fiscal year 2026-2028. This expansion strategy, dubbed 'Juniper 2.0', marks a significant phase of growth for the company in the hospitality sector.",
            "Sentiment": "positive",
            "PublishDate": 1739260440000,
            "Source": "corporate_action"
        },
        {
            "Title": "Juniper Hotels Reports Q3 Revenue Increase",
            "Summary": "Juniper Hotels has announced its third-quarter revenue results. The company reported revenue of 2.5 billion rupees, compared to 2.3 billion rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739260315000,
            "Source": "earnings"
        },
        {
            "Title": "Juniper Hotels Reports Q3 EBITDA Growth",
            "Summary": "Juniper Hotels has reported an increase in Q3 EBITDA to 1 billion rupees, up from 973 million rupees in the same quarter last year. However, the EBITDA margin decreased to 36.77% from 41.17% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739260243000,
            "Source": "earnings"
        },
        {
            "Title": "Juniper Hotels Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Juniper Hotels has announced a substantial year-over-year increase in its consolidated net profit for the third quarter. The company's net profit rose to 325 million rupees, compared to 35 million rupees in the same period last year, representing a notable improvement in financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1739260029000,
            "Source": "earnings"
        },
        {
            "Title": "Juniper Hotel to Consider Q3 Results on February 11",
            "Summary": "Juniper Hotel has announced that it will consider its third quarter (Q3) financial results on February 11. This indicates that the company is preparing to review and potentially approve its quarterly financial statements for public release.",
            "Sentiment": "neutral",
            "PublishDate": 1738844614000,
            "Source": "result"
        },
        {
            "Title": "Juniper Hotels: CLSA Initiates 'Outperform' Rating, Shares Surge 7%",
            "Summary": "CLSA initiated coverage on Juniper Hotels with an 'outperform' rating and a target price of Rs 430. The company, India's largest owner of Hyatt-affiliated rooms, is well-positioned to capitalize on the projected 10.4% CAGR growth in the Indian hospitality industry from FY2024 to FY2029. CLSA forecasts a 16% Ebitda CAGR for Juniper Hotels from FY2025 to FY2027, citing improvements in occupancy and room rates at flagship properties.",
            "Sentiment": "positive",
            "PublishDate": 1733388383000,
            "Source": "normal_news"
        },
        {
            "Title": "Juniper Hotels Reports Q2 EBITDA Growth",
            "Summary": "Juniper Hotels announced its Q2 financial results. The company's EBITDA increased to 644 million rupees from 602 million rupees year-over-year. However, the EBITDA margin decreased to 30.03% from 35.74% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731307007000,
            "Source": "result"
        },
        {
            "Title": "Juniper Hotels Reports Increased Q2 Loss and Revenue",
            "Summary": "Juniper Hotels announced its Q2 financial results, reporting a consolidated net loss of 278 million rupees, up from 156 million rupees in the same quarter last year. However, the company's revenue increased to 2.14 billion rupees from 1.68 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731306908000,
            "Source": "result"
        },
        {
            "Title": "Juniper Hotels Secures ₹280 Crore Loan for Bangalore Hotel Acquisition",
            "Summary": "<p><span class='neutral'>Juniper Hotels</span> has <span class='positive'>approved</span> a <b>term loan</b> of <span class='neutral'>₹280 crore</span> from <span class='neutral'>ICICI Bank</span>. The loan is intended to <span class='positive'>finance</span> the <b>acquisition</b> of a <span class='neutral'>hotel property</span> in <span class='neutral'>Bangalore</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728017020000,
            "Source": "corporate_action"
        }
    ]
}