{
    "Symbol": "JUSTDIAL",
    "ISIN": "INE599M01018",
    "News": [
        {
            "Title": "Just Dial Q3 PAT Expected Up 17% YoY: ICICI Securities",
            "Summary": "ICICI Securities forecasts Just Dial's Q3 FY27 net profit to rise 17% YoY to ₹153.60 crores, with revenue expected to grow 7.5% to ₹308.90 crores amid steady operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1769148970135,
            "Source": "co_actions_results"
        },
        {
            "Title": "Just Dial Q3 profit drops 10% YoY on tax, labour costs",
            "Summary": "Just Dial reported 10.2% decline in Q3 FY26 net profit to ₹118 cr due to higher tax rate and exceptional expenses from new labour codes, while revenue grew 6.4% to ₹305.7 cr with strong EBITDA margin of 31.2%.",
            "Sentiment": "neutral",
            "PublishDate": 1768362752108,
            "Source": "co_actions_results"
        },
        {
            "Title": "Just Dial Q3 results: Revenue up 6.4%, profit down 10.2%",
            "Summary": "Just Dial reported mixed Q3 results with revenue rising 6.4% to ₹305.60 crores but net profit declining 10.2% to ₹117.90 crores. EBITDA margins expanded to 31.1% while traffic fell 3.5% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1768358009186,
            "Source": "co_actions_results"
        },
        {
            "Title": "Just Dial Q3 Revenue Grows 6.27% YoY to ₹305 Crores",
            "Summary": "Just Dial reports Q3 revenue growth to ₹305 crores despite net profit decline to ₹118 crores. EBITDA margin improves to 31.17% from 30.14% year-on-year, showing operational efficiency gains.",
            "Sentiment": "neutral",
            "PublishDate": 1768349801199,
            "Source": "co_actions_results"
        },
        {
            "Title": "Just Dial Q3FY26: Revenue up 6.4% YoY to ₹305.7 cr",
            "Summary": "Just Dial reports Q3FY26 revenue of ₹305.7 crores, up 6.4% YoY. EBITDA margin improves to 31.2% while net profit declines 10.2% to ₹118.0 crores due to exceptional expenses from new labour code implementation.",
            "Sentiment": "neutral",
            "PublishDate": 1768320698059,
            "Source": "co_actions_results"
        },
        {
            "Title": "Just Dial Q3FY26: Net profit drops 10.2% YoY to ₹1,179.3 cr",
            "Summary": "Just Dial reported Q3FY26 net profit of ₹1,179.3 million, down 10.2% YoY. Revenue grew 6.4% to ₹3,056.9 million. Exceptional item of ₹210.8 million impacted results due to new labour codes.",
            "Sentiment": "neutral",
            "PublishDate": 1768318683574,
            "Source": "co_actions_results"
        },
        {
            "Title": "Just Dial Q3FY26: Net profit drops 10.2% YoY to ₹1,179.3 cr",
            "Summary": "Just Dial reported Q3FY26 net profit of ₹1,179.3 million, down 10.2% YoY. Revenue grew 6.4% to ₹3,056.9 million. Company faced ₹210.8 million exceptional charge due to new labour codes.",
            "Sentiment": "neutral",
            "PublishDate": 1768316790867,
            "Source": "co_actions_results"
        },
        {
            "Title": "Just Dial Q3 Results Review Scheduled January 13",
            "Summary": "Just Dial has announced it will review its third quarter financial results on January 13. The e-commerce aggregator company will present its quarterly performance to stakeholders.",
            "Sentiment": "neutral",
            "PublishDate": 1767754693703,
            "Source": "co_actions_results"
        },
        {
            "Title": "Just Dial faces ₹6.62 cr GST penalty order",
            "Summary": "Just Dial Limited received a GST penalty order of ₹6.62 crore from Mumbai tax authorities for alleged excess input tax credit availment during FY 2018-19, with total demand including interest at ₹15.21 crore.",
            "Sentiment": "negative",
            "PublishDate": 1766842090255,
            "Source": "stocks"
        },
        {
            "Title": "Just Dial Forecasts Growth Through AI Platform Expansion and B2B Scaling",
            "Summary": "Just Dial has forecasted significant growth driven by AI-powered platform expansion and scaling of its JD Mart B2B operations. The company's growth strategy includes digital transformation initiatives for small and medium enterprises. Just Dial expects steady revenue progress, supported by its strong financial position and high-profit operating model.",
            "Sentiment": "positive",
            "PublishDate": 1760373972969,
            "Source": "stock"
        },
        {
            "Title": "Just Dial Reports Mixed Q2 Results with Revenue Growth and Profit Decline",
            "Summary": "Just Dial reported quarterly net profit of 1.19 billion rupees, down from 1.54 billion rupees in the same period last year. The company's revenue increased to 3.03 billion rupees compared to 2.85 billion rupees year-over-year. The results show contrasting performance with revenue growth of approximately 6% while net profit declined by about 23%.",
            "Sentiment": "neutral",
            "PublishDate": 1760367958050,
            "Source": "earnings"
        },
        {
            "Title": "Just Dial: Q1 Profit Rises 13% YoY, Revenue Up 6%",
            "Summary": "Just Dial reported a 13% YoY increase in Q1 FY26 net profit to Rs 160 crore. Revenue grew 6.2% YoY to Rs 298 crore. EBITDA rose 7.2% to Rs 86.4 crore with a margin of 29%. Quarterly unique visitors reached 193.2 million, up 6.6% YoY. Active paid campaigns increased 4.3% YoY to 617,340.",
            "Sentiment": "positive",
            "PublishDate": 1752637822000,
            "Source": "earnings"
        },
        {
            "Title": "Just Dial Reports Q1 Financial Results",
            "Summary": "Just Dial has announced its Q1 financial results. The company's net profit increased to 1.6 billion rupees from 1.4 billion rupees year-over-year. Revenue rose to 2.98 billion rupees from 2.8 billion rupees. EBITDA grew to 864 million rupees from 807 million rupees, with the EBITDA margin improving to 29% from 28.76% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1752625008000,
            "Source": "default"
        },
        {
            "Title": "Just Dial: Q1 Net Profit Rises 13% to ₹160 Crore",
            "Summary": "Just Dial reported a 13% YoY increase in net profit to ₹160 crore for Q1 FY2026. Revenue grew 6.2% to ₹298 crore, while EBITDA rose 7.2% to ₹86.4 crore. EBITDA margin improved slightly to 29%.",
            "Sentiment": "positive",
            "PublishDate": 1752592571000,
            "Source": "earnings"
        },
        {
            "Title": "Just Dial Reports Q1 Financial Results",
            "Summary": "Just Dial has announced its Q1 financial results. The company reported a net profit of 1.6 billion rupees, up from 1.4 billion rupees in the same quarter last year, representing a 14.29% increase year-over-year. Revenue for Q1 stood at 2.98 billion rupees, compared to 2.8 billion rupees in the previous year, showing a 6.43% increase year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1752591056000,
            "Source": "result"
        },
        {
            "Title": "Just Dial Targets 25% EBITDA Margin for FY26",
            "Summary": "During a conference call, Just Dial's management provided guidance for the company's financial performance, targeting an EBITDA margin of 25% for the fiscal year 2026.",
            "Sentiment": "positive",
            "PublishDate": 1745294843000,
            "Source": "default"
        },
        {
            "Title": "Just Dial Ltd: Shares Surge 9% on Strong Q4 Performance",
            "Summary": "Just Dial shares rose 9% following Q4 results. Key factors: 11.3% year-on-year growth in collections, ₹5,200 crore cash reserves, and 860 basis points improvement in full-year margins to 29.4%. Quarterly net profit up 20% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1745210295000,
            "Source": "earnings"
        },
        {
            "Title": "Just Dial: Q4 Net Profit Surges 36% on Strong Merchant Acquisition",
            "Summary": "Just Dial reported a 36.2% YoY increase in Q4 net profit to Rs 157.6 crore. Revenue grew 7% YoY to Rs 289.2 crore. EBITDA rose 21.8% to Rs 86.1 crore with margin expansion to 29.8%. FY25 saw 61% YoY net profit growth to Rs 584.2 crore. Quarterly unique visitors reached 191.3 million, up 11.8% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1745207194000,
            "Source": "earnings"
        },
        {
            "Title": "Just Dial Reports Strong Q4 Financial Results",
            "Summary": "Just Dial has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 860 million rupees from 707 million rupees in the previous year, with the EBITDA margin expanding to 29.74% from 26.16%. Net profit rose to 1.58 billion rupees from 1.16 billion rupees, while revenue grew to 2.89 billion rupees from 2.7 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1745064049000,
            "Source": "result"
        },
        {
            "Title": "Just Dial: Net Profit Soars 61% in FY25, Revenue Up 9.5%",
            "Summary": "Just Dial reported a 61% YoY increase in net profit to Rs 584.2 crore for FY25. Q4 profit stood at Rs 157.6 crore. FY25 revenue grew 9.5% to Rs 1,141.9 crore, with Q4 revenue at Rs 289.2 crore, up 7% YoY. Q4 unique visitors increased 11.8% YoY to 191.3 million. Total business listings reached 48.8 million by FY25 end.",
            "Sentiment": "positive",
            "PublishDate": 1745041365000,
            "Source": "earnings"
        },
        {
            "Title": "Nuvama Upgrades Just Dial to 'Buy' Rating",
            "Summary": "Nuvama, a financial services firm, has upgraded its rating for Just Dial from 'Hold' to 'Buy'. This change in recommendation suggests an improved outlook for Just Dial's stock performance.",
            "Sentiment": "positive",
            "PublishDate": 1739957717000,
            "Source": "normal_news"
        },
        {
            "Title": "Just Dial Ltd: Q3 Results Disappoint, Shares Tumble 9%",
            "Summary": "Just Dial reported Q3 revenue growth of 8.4% YoY and 0.9% QoQ, below expectations. Implied billings growth was muted at 3.4% YoY. EBITDA margin improved to 30.1%. Cash balance reached ₹5,060 crore. Kotak maintains 'Buy' rating but cuts price target to ₹1,330. Ambit issues 'Sell' rating with ₹1,037 target, citing concerns over collections growth.",
            "Sentiment": "negative",
            "PublishDate": 1736749075000,
            "Source": "earnings"
        },
        {
            "Title": "Citi Upgrades Just Dial and Raises Target Price",
            "Summary": "Citi has upgraded its rating for Just Dial following the company's third-quarter results. The financial institution has also increased its target price for Just Dial from 1075 to 1270, indicating a positive outlook on the company's performance and future prospects.",
            "Sentiment": "positive",
            "PublishDate": 1736746371000,
            "Source": "earnings"
        },
        {
            "Title": "Just Dial Ltd.: Q3 Profit Decline Triggers 10% Stock Plunge",
            "Summary": "Just Dial Ltd. shares fell nearly 10% on Monday following a sequential decline in Q3 net profit. The stock has experienced volatility in 2024, dropping despite a recent 'buy' upgrade from Citi Research. Just Dial's shares have fallen over 10% in the last four sessions, erasing some of its 25% gain from the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1736744013000,
            "Source": "earnings"
        },
        {
            "Title": "Just Dial Reports Strong Q3 Financial Results",
            "Summary": "Just Dial has announced its Q3 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's net profit increased to 1.3 billion rupees, up from 920 million rupees in the same quarter last year and 1.54 billion rupees in the previous quarter. Revenue also saw growth, reaching 2.87 billion rupees compared to 2.65 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1736727778000,
            "Source": "earnings"
        },
        {
            "Title": "Just Dial: Q3 FY25 Profit Surges 42.71% YoY to ₹131.31 Crore",
            "Summary": "Just Dial reported Q3 FY25 results with revenue up 8.41% YoY to ₹287.33 crore and profit rising 42.71% YoY to ₹131.31 crore. Operating income increased by 54.59% YoY. EPS stood at ₹15.44, up 42.7% YoY. Analyst consensus recommends 'Buy'.",
            "Sentiment": "positive",
            "PublishDate": 1736575189000,
            "Source": "earnings"
        },
        {
            "Title": "Just Dial Reports Strong Q3 Financial Performance",
            "Summary": "Just Dial has announced its Q3 financial results, showing significant improvement in key metrics. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 866 million rupees, up from 604 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 30.14% from 22.79% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1736521371000,
            "Source": "earnings"
        },
        {
            "Title": "Just Dial Reports Q3 FY24 Financial Results",
            "Summary": "Just Dial announced its financial results for the third quarter of fiscal year 2024. The company reported a net profit of 1.3 billion rupees, up from 920 million rupees in the same quarter last year. Revenue for Q3 stood at 2.87 billion rupees, compared to 2.65 billion rupees in the previous year. Sequentially, net profit decreased from 1.54 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1736521308000,
            "Source": "earnings"
        },
        {
            "Title": "Just Dial: Q2 Profit Soars 114%, Revenue Up 9%",
            "Summary": "<p>Just Dial reported a net profit of <span class=\"positive\">Rs 154 crore</span> for Q2 FY2025, <span class=\"positive\">up 114% YoY</span>. <b>Revenue from operations</b> <span class=\"positive\">increased 9%</span> to <span class=\"neutral\">Rs 285 crore</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728635290000,
            "Source": "result"
        },
        {
            "Title": "Just Dial Reports Strong Q2 Financial Performance",
            "Summary": "<p>Just Dial has announced its Q2 financial results, showing <span class='positive'>significant</span> year-over-year <span class='positive'>improvements</span>. The company's <b>EBITDA</b> (Earnings Before Interest, Taxes, Depreciation, and Amortization) <span class='positive'>increased</span> from 488 million rupees to 820 million rupees. Additionally, the EBITDA margin <span class='positive'>expanded</span> from 18.73% to 28.79%, indicating <span class='positive'>enhanced</span> operational efficiency.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728634169000,
            "Source": "result"
        },
        {
            "Title": "Just Dial Reports Q2 Revenue Growth",
            "Summary": "<p><span class='neutral'>Just Dial</span>, an <span class='neutral'>Indian local search engine company</span>, has reported its <b>second quarter revenue</b> for the current fiscal year. The company's <span class='positive'>revenue increased</span> to <b>2.8 billion rupees</b>, up from 2.61 billion rupees in the same quarter of the previous year, representing a <span class='positive'>year-over-year growth</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728634079000,
            "Source": "result"
        },
        {
            "Title": "Just Dial Reports Significant Profit Growth in Q2",
            "Summary": "<p><span class='positive'>Just Dial</span>, an Indian local search engine company, has reported a <span class='positive'>substantial increase</span> in its second-quarter <span class='positive'>net profit</span>. The company's net profit for Q2 reached <b>1.5 billion rupees</b>, compared to <b>718 million rupees</b> in the same period last year, marking a <span class='positive'>year-over-year growth</span> of approximately <span class='positive'>109%</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728634060000,
            "Source": "result"
        }
    ]
}