{
    "Symbol": "JWL",
    "ISIN": "INE209L01016",
    "News": [
        {
            "Title": "Jupiter Wagons Q3FY26 Results Show Mixed Performance",
            "Summary": "Jupiter Wagons reported Q3FY26 standalone revenue of ₹77,593.09 lakhs, down from ₹1,00,003.51 lakhs in Q3FY25. Net profit declined to ₹5,833.45 lakhs from ₹9,786.28 lakhs YoY.",
            "Sentiment": "negative",
            "PublishDate": 1770810981552,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jupiter Wagons Seeks Shareholder Approval for Director",
            "Summary": "Jupiter Wagons Limited initiates postal ballot process to appoint Mark Damian Stevenson as Non-Executive Director, with e-voting scheduled from January 23 to February 21, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769003770659,
            "Source": "stocks"
        },
        {
            "Title": "Jupiter Wagons drops 3% after 37% rally streak",
            "Summary": "Jupiter Wagons shares fell 3% to ₹336.70 following profit booking after a five-day rally of nearly 37%. The surge was driven by promoter Tatravagonka A.S. increasing stake to 19.24% through warrant conversion.",
            "Sentiment": "neutral",
            "PublishDate": 1766989451133,
            "Source": "stocks"
        },
        {
            "Title": "Jupiter Wagons Surges 35% on Promoter Stake Hike",
            "Summary": "Jupiter Wagons shares jumped 35% over four sessions after promoter Tatravagonka A.S. increased stake to 19.24% through warrant conversion worth ₹134.99 crore, signaling confidence in growth prospects.",
            "Sentiment": "positive",
            "PublishDate": 1766587870757,
            "Source": "stocks"
        },
        {
            "Title": "Jupiter Wagons Files Insider Trading Disclosure",
            "Summary": "Jupiter Wagons received insider trading disclosure from promoter TATRAVAGONKA A.S. for acquisition of 28.72 lakh equity shares through warrant conversion on December 19, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766140887503,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jupiter Wagons Appoints Mark Damian Stevenson as Director",
            "Summary": "Jupiter Wagons Limited's Board approved the appointment of Mark Damian Stevenson as Additional Non-Executive Non-Independent Director effective December 15, 2025, subject to shareholder approval through postal ballot.",
            "Sentiment": "positive",
            "PublishDate": 1765784322840,
            "Source": "stocks"
        },
        {
            "Title": "Jupiter Wagons Reports 71% Sequential Revenue Growth in Q2 FY26 After Wheelset Supply Recovery",
            "Summary": "Jupiter Wagons achieved consolidated revenue of INR 786 crore in Q2 FY26, marking 71% sequential growth as wheelset supply disruptions that affected Q1 were resolved from late July onwards. The company maintains a strong order book of INR 5,538 crore and expects continued margin improvements in the second half, with subsidiaries including electric mobility and BESS businesses targeting breakeven by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1763387229075,
            "Source": "earnings"
        },
        {
            "Title": "Jupiter Wagons Lowers FY26 Revenue Target Due to Wheelset Supply Issues, Targets Rs 100 Crore This Year",
            "Summary": "Jupiter Wagons has reduced its FY26 revenue target due to wheelset supply problems but maintains its margin objectives. The company aims for Rs 100 crores revenue this year and plans to double it by FY27. The electric mobility sector is expected to break even by the end of the fiscal year and achieve EBITDA positivity by FY27. The company expects EBITDA margins for its electric mobility business by FY27 to match those of existing businesses, despite ongoing wheelset availability challenges.",
            "Sentiment": "neutral",
            "PublishDate": 1763004734721,
            "Source": "stock"
        },
        {
            "Title": "Jupiter Wagons Targets Rs 8,000 Crore Revenue by FY28 Despite Q2 Performance Decline",
            "Summary": "Jupiter Wagons aims to achieve consolidated revenues of Rs 7,000-8,000 crore by FY28 with EBITDA margins of 14-15%, driven by its expanding wheelset and wagon businesses. Managing Director Vivek Lohia expects the wheelset business alone to generate Rs 2,000-3,000 crore in revenue by FY28. The company reported Q2FY26 consolidated revenue of Rs 786 crore, down 22% from Rs 1,009 crore in Q2FY25. EBITDA declined 25% to Rs 104 crore with margins at 13.2%, while net profit dropped 43% to Rs 45 crore. FY26 is expected to remain softer due to earlier wheelset supply chain disruptions, though these issues have been resolved. The company maintains a robust order book with strong private sector demand and expects Indian Railways to require 50,000-60,000 wagons for freight targets. The wheelset business has grown over 100% with healthy margins, and an integrated plant in Odisha is under development.",
            "Sentiment": "neutral",
            "PublishDate": 1762945490314,
            "Source": "stock"
        },
        {
            "Title": "Jupiter Wagons Submits Monitoring Agency Reports for Multiple Fund Raising Activities",
            "Summary": "Jupiter Wagons Limited submitted monitoring agency reports from CARE Ratings for the quarter ended September 30, 2025, covering three fund raising activities. The reports covered a Rs. 403.41 crore Qualified Institutional Placement (QIP) from November 2023, a Rs. 135 crore Preferential Share Warrant Issue from June 2024, and a Rs. 800 crore QIP from July 2024. For the first QIP, Rs. 6.36 crore was utilized during the quarter with Rs. 43.64 crore remaining unutilized. The warrant issue had Rs. 33.75 crore raised with full utilization for subsidiary investment. The larger QIP showed Rs. 27.22 crore utilized during the quarter with Rs. 198.96 crore remaining unutilized. All reports indicated no deviation from stated objects and compliance with regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1762904485620,
            "Source": "corporate_action"
        },
        {
            "Title": "Jupiter Wagons Reports 31% Revenue Growth, Expands Into EV Cargo Segment",
            "Summary": "Jupiter Wagons reported Q2FY26 revenue of ₹890 crores, marking a 31% year-over-year increase. The company maintains an order book of ₹6,200 crores and plans to expand manufacturing capacity by 20% in FY26. The company has entered the electric vehicle cargo segment through 'Jupiter Electric' and is focusing on rolling stock and brake system manufacturing. Jupiter Wagons is targeting export markets and pursuing component backward integration as part of its strategy to enhance margins.",
            "Sentiment": "positive",
            "PublishDate": 1762875950420,
            "Source": "earnings"
        },
        {
            "Title": "Jupiter Wagons Reports Mixed Financial Performance in Latest Results",
            "Summary": "Jupiter Wagons Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. On a standalone basis, the company reported total income of Rs 1,139.53 crores for the quarter compared to Rs 1,086.10 crores in the previous quarter. However, the company recorded a net loss of Rs 502.59 crores for the quarter versus a profit of Rs 439.17 crores in the preceding quarter. For the half-year period, standalone total income reached Rs 2,225.63 crores with a net loss of Rs 63.42 crores. On a consolidated basis, quarterly total income was Rs 1,786.10 crores with a net loss of Rs 458.59 crores, while half-year consolidated income stood at Rs 4,076.75 crores with a net profit of Rs 478.60 crores. The consolidated results included an exceptional item of Rs 1,039.65 crores related to lease rent payment by subsidiary Stone India Limited to Shyama Prasad Mookerjee Port following a Calcutta High Court order. The company's inventory levels increased significantly to Rs 4,118.91 crores as of September 30, 2025, compared to Rs 769.40 crores in March 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762852999934,
            "Source": "earnings"
        },
        {
            "Title": "Jupiter Wagons Reports 40% Decline in Q2 Net Profit to 530 Million Rupees",
            "Summary": "Jupiter Wagons reported a net profit of 530 million rupees for Q2, down from 886 million rupees in the same period last year. The company's EBITDA decreased to 880 million rupees from 1.3 billion rupees year-over-year. EBITDA margin also contracted to 12.45% compared to 13.69% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762851516273,
            "Source": "earnings"
        },
        {
            "Title": "Jupiter Electric Mobility Expands Dealership Network with New Showrooms in Five Cities",
            "Summary": "Jupiter Electric Mobility has expanded its dealership network by opening new showrooms in Delhi, Ghaziabad, Trivandrum, Ahmedabad, and Pune. This expansion represents the company's efforts to grow its retail presence across multiple Indian cities.",
            "Sentiment": "positive",
            "PublishDate": 1762519370416,
            "Source": "stock"
        },
        {
            "Title": "Jupiter Wagons Receives ESG Rating of 46 from SEBI-Registered Rating Provider",
            "Summary": "Jupiter Wagons Limited received an ESG rating of 46 from ESG Risk Assessments and Insights Limited, India's first ESG rating provider and Category I Subscriber-Pays ESG rating provider registered with SEBI. The company clarified that it did not engage the rating agency for this assessment. ESG Risk Assessments and Insights Limited independently assigned the rating based on publicly available information pertaining to FY 2024-25. The rating was communicated to Jupiter Wagons via email on October 28, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761660358358,
            "Source": "stock"
        },
        {
            "Title": "Jupiter Wagons Unit Launches Battery Energy Storage Systems",
            "Summary": "Jupiter Wagons' unit has introduced containerized battery energy storage systems available in 10-foot and 20-foot configurations. The systems offer storage capacities ranging from 241 KWH to 3 MWH and are designed to replace diesel generators, store solar energy, and provide backup power solutions.",
            "Sentiment": "positive",
            "PublishDate": 1758781500197,
            "Source": "stock"
        },
        {
            "Title": "Jupiter Wagons Appoints Vinod Kumar Agarwal as Chief Financial Officer",
            "Summary": "Jupiter Wagons Limited's Board of Directors approved the appointment of Vinod Kumar Agarwal as Chief Financial Officer and Key Managerial Personnel, effective September 24, 2025. Agarwal replaces Sanjiv Keshri in the role of determining materiality of events and making disclosures to stock exchanges. The appointment was made based on recommendations from the Nomination and Remuneration Committee and Audit Committee. Agarwal brings 17 years of finance experience with expertise in financial planning, fundraising, business process re-engineering, treasury management, and corporate governance. His appointment is on a full-time basis.",
            "Sentiment": "positive",
            "PublishDate": 1758700795747,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jupiter Wagons Gets Exchange Approval for Promoter Reclassification",
            "Summary": "Jupiter Wagons Limited received approval from NSE and BSE for reclassification of Ms. Sagarika Gupta from 'Promoter' to 'Public' shareholder category. The company had submitted the application on August 14, 2025, and both exchanges approved it on September 18, 2025. Following the approval, Ms. Sagarika Gupta ceased to be a member of the Promoter/Promoter Group with immediate effect. The reclassification resulted in a minor change in shareholding structure - promoter and promoter group holding decreased from 68.11% to 68.09%, while public shareholding increased from 31.89% to 31.91%. The total number of shares remained unchanged at 42,44,98,049.",
            "Sentiment": "neutral",
            "PublishDate": 1758201198335,
            "Source": "corporate_action"
        },
        {
            "Title": "Jupiter Wagons Subsidiary Secures Rs. 113 Crore Railway Contract for 9,000 LHB Axles",
            "Summary": "Jupiter Wagons subsidiary has secured a railway order worth Rs. 113 crore for manufacturing 9,000 LHB (Linke Hofmann Busch) axles. This contract represents a significant business win for the company's subsidiary in the railway components sector.",
            "Sentiment": "positive",
            "PublishDate": 1757511451334,
            "Source": "order&deals"
        },
        {
            "Title": "Jupiter Electric Mobility Opens First Showroom in Hyderabad",
            "Summary": "Jupiter Electric Mobility has opened its first showroom in Hyderabad as part of its nationwide expansion plans. This marks the company's initial retail presence in the electric mobility sector.",
            "Sentiment": "positive",
            "PublishDate": 1755849721153,
            "Source": "stock"
        },
        {
            "Title": "Jupiter Wagons Subsidiary Wins ₹215 Crore Contract for Vande Bharat Train Components",
            "Summary": "Jupiter Wagons' subsidiary has secured a Letter of Intent (LOI) worth ₹215 crore to supply 5,376 wheelsets for Vande Bharat trains. The contract strengthens the company's order book and enhances its participation in India's rail infrastructure sector, positioning it for growth in the high-speed rail segment.",
            "Sentiment": "positive",
            "PublishDate": 1755686457735,
            "Source": "order&deals"
        },
        {
            "Title": "Jupiter Wagons Q1 FY26 Revenue Drops 53% to INR425 Crore Due to Wheelset Supply Issues",
            "Summary": "Jupiter Wagons reported standalone total income of INR425 crore in Q1 FY26, down 53% from INR902 crore in Q1 FY25, primarily due to reduced wagon production volumes caused by wheelset supply shortages from Indian Railways. The company delivered 826 railway wagons and 4,811 wheelsets during the quarter. Standalone EBITDA was INR51 crore and PAT was INR33 crore. The company maintains a confirmed order book of INR5,972 crore with approximately 11,500 wagon units. Jupiter Wagons commenced electric LCV production in June, dispatching over 50 vehicles and opening its first showroom in Bengaluru. The wheelsets business generated approximately INR100 crore revenue with expectations of INR550 crore for FY26. Management expects to recover lost production in coming quarters as wheelset supply has normalized and maintains 10-15% revenue growth guidance for FY26, targeting INR8,000-10,000 crore revenue by FY28.",
            "Sentiment": "neutral",
            "PublishDate": 1755596815401,
            "Source": "earnings"
        },
        {
            "Title": "Jupiter Wagons Submits Application to Reclassify Promoter Sagarika Gupta to Public Shareholder",
            "Summary": "Jupiter Wagons Limited has submitted an application to stock exchanges NSE and BSE to reclassify Mr. Sagarika Gupta from 'Promoter' category to 'Public' category shareholder. The application was submitted on August 14, 2025, following board approval on August 12, 2025. The reclassification process began after the company received a request letter from the promoter on August 5, 2025, seeking the category change under SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1755181143852,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jupiter Wagons Projects Wheel Set Revenue Growth from Rs 550 Cr to Rs 1,000 Cr, Targets Rs 8,000-10,000 Cr by FY28",
            "Summary": "Jupiter Wagons expects wheel set revenue of Rs 550 crore for the current year, projected to increase to Rs 1,000 crore next year. The company forecasts Rs 2,000-3,000 crore for wheel business and Rs 500-1,000 crore for battery/EV business in FY27-28. Despite Q1 challenges, Jupiter Wagons reaffirms 10-15% revenue growth and 14-15% EBITDA margins for FY26. The company aims to achieve Rs 8,000-10,000 crore revenue by FY28 when its Orissa plant becomes operational.",
            "Sentiment": "positive",
            "PublishDate": 1755142415747,
            "Source": "stock"
        },
        {
            "Title": "Jupiter Wagons Q1 FY26 Revenue Falls 48% to ₹459 Crore Due to Wheel Set Supply Shortage",
            "Summary": "Jupiter Wagons reported consolidated revenue of ₹459.3 crore for Q1 FY26, declining 47.8% year-on-year due to shortage of wheel sets from Railway Wheel Factory, Indian Railways, particularly affecting 25 Ton Axle load wagons which comprise majority of the company's order book. EBITDA dropped 56.2% to ₹59.8 crore with margins contracting to 13.0% from 15.5% in the previous year. Net profit fell 66.2% to ₹31.1 crore, resulting in earnings per share of ₹0.77. The company maintains an order book of ₹5,972 crore as of June 30, 2025. Jupiter Electric Mobility opened its first showroom in Bengaluru and signed an MoU with Pickkup to deploy 300 electric vehicles. The company has acquired land in Odisha for India's first private rail wheel and axle forging plant with planned investment of ₹2,500 crore in phases, expected to begin operations by 2027. Jupiter Wagons received an upgraded long-term credit rating of ACUITE AA with stable outlook.",
            "Sentiment": "negative",
            "PublishDate": 1755009187708,
            "Source": "earnings"
        },
        {
            "Title": "Jupiter Wagons Reports 67% Drop in Quarterly Profit, Approves Promoter Reclassification",
            "Summary": "Jupiter Wagons Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 41,085.10 lakhs compared to Rs 100,203.75 lakhs in the previous quarter, while profit declined to Rs 3,285.50 lakhs from Rs 9,732.73 lakhs in the preceding quarter. On a consolidated basis, revenue from operations fell to Rs 45,934.28 lakhs from Rs 104,454.77 lakhs in the previous quarter, with profit dropping to Rs 3,107.21 lakhs from Rs 10,259.15 lakhs. The Board also approved Ms. Sagarika Gupta's request for reclassification from 'Promoter and Promoter Group' category to 'Public' category, subject to stock exchange approvals. The company operates primarily in metal fabrication, manufacturing load bodies for commercial vehicles and rail freight wagons.",
            "Sentiment": "negative",
            "PublishDate": 1754998471367,
            "Source": "earnings"
        },
        {
            "Title": "Jupiter Wagons Reports Decline in Q1 Financial Performance",
            "Summary": "Jupiter Wagons reported Q1 EBITDA of 507 million rupees compared to 1.29 billion rupees in the previous year. The company's EBITDA margin decreased to 12.35% from 14.4% year-over-year. Net profit fell to 328 million rupees from 892 million rupees, while revenue dropped to 4 billion rupees from 9 billion rupees compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1754996617976,
            "Source": "earnings"
        },
        {
            "Title": "Jupiter Wagons Secures INR 242.41 Crore Order from GATX India for 583 Specialized Wagons",
            "Summary": "Jupiter Wagons Ltd. has secured an order worth INR 242.41 crore from GATX India Private Limited for manufacturing and supplying 583 specialized wagons. The contract includes BLSS container carrier wagons, ACT2 bi-level SUV carriers that can accommodate up to 10 SUVs per wagon, and BOXNHL high-capacity open wagons with payload capacity exceeding 70 tonnes for bulk commodities like coal and iron ore. These wagons are designed for efficient transport of bulk commodities, passenger vehicles, and containerized freight with high-capacity, long-distance operations capabilities. Managing Director Vivek Lohia stated this order strengthens their association with GATX India and marks an important step in their customer diversification strategy. Jupiter Wagons operates manufacturing facilities in Kolkata, Jamshedpur, Indore, Jabalpur, Aurangabad, and Bangalore, serving clients including Indian Railways, Tata Motors, Adani Group, and GE.",
            "Sentiment": "positive",
            "PublishDate": 1754882263124,
            "Source": "order&deals"
        },
        {
            "Title": "Jupiter Wagons Promoter Sagarika Gupta Seeks Reclassification to Public Shareholder Category",
            "Summary": "Jupiter Wagons Limited received a request from promoter Sagarika Gupta to reclassify her shareholding from 'Promoter and Promoter Group' category to 'Public' category. Gupta holds 55,100 equity shares representing 0.01% of the company's total equity share capital. The shares were transmitted to her following the death of her father, Late Samir Kumar Gupta, who was a promoter. In her request, Gupta stated she does not exercise control over the company, is not involved in management, and holds no special rights. The reclassification is subject to approval from the Board of Directors and stock exchanges BSE Limited and National Stock Exchange of India Limited, along with compliance with applicable regulatory conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1754401750352,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jupiter Wagons Ltd.: Multibagger Stock Faces Q4 Decline Amid Ambitious Growth Plans",
            "Summary": "Jupiter Wagons Ltd. reported a 2% decline in Q4 FY2025 net profit to Rs 103 crore, with revenue down 6.4% to Rs 1,044 crore. The company aims for Rs 10,000 crore revenue by FY2027 with 27% EBITDA margin. Current order book stands at Rs 6,303.6 crore. The stock has rallied over 3000% in five years but is down 21.87% YTD in 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1750142991000,
            "Source": "earnings"
        },
        {
            "Title": "Jupiter Electric Mobility Opens First Showroom in Bengaluru",
            "Summary": "Jupiter Electric Mobility, a subsidiary of Jupiter Wagons, has opened its first showroom in Bengaluru. This marks the beginning of the company's pan-India expansion. The company has also launched Electric Last Mile Commercial Vehicles (E-LCVs) aimed at transforming the last-mile delivery sector across India.",
            "Sentiment": "positive",
            "PublishDate": 1749479620000,
            "Source": "default"
        },
        {
            "Title": "Jupiter Electric Mobility Signs MoU with Pickkup for EV Adoption in Logistics",
            "Summary": "Jupiter Electric Mobility, a unit of Jupiter Wagons, has signed a Memorandum of Understanding (MoU) with Pickkup to promote electric vehicle adoption in India's logistics sector. As part of the agreement, 300 JEM Tez electric vehicles will be added to Pickkup's fleet to enhance sustainable delivery solutions for last-mile and mid-mile operations.",
            "Sentiment": "positive",
            "PublishDate": 1748390400000,
            "Source": "default"
        },
        {
            "Title": "Jupiter Electric Mobility Signs MoU with Pickkup for EV Adoption in Logistics",
            "Summary": "Jupiter Electric Mobility, a unit of Jupiter Wagons, has signed a Memorandum of Understanding (MoU) with Pickkup to promote electric vehicle adoption in India's logistics sector. As part of the agreement, 300 JEM TEZ electric vehicles will be added to Pickkup's fleet, enhancing sustainable delivery solutions for last-mile and mid-mile operations.",
            "Sentiment": "positive",
            "PublishDate": 1748353043000,
            "Source": "default"
        },
        {
            "Title": "Jupiter Wagons Expects Strong Growth and Revenue Increase",
            "Summary": "Jupiter Wagons anticipates significant growth from its Orissa project, projecting revenues of nearly Rs 3,000 crore. The company expects to double its brake and wheelsets revenue to over Rs 800 crore in the current financial year. In the e-LCV segment, Jupiter Wagons aims to achieve sales of over 100 cars per month within the next 3-4 months. The company foresees strong numbers until FY28, particularly after the expected railway tender this year. Jupiter Wagons also expects its EBITDA margin to exceed the current 14.2% and anticipates strong revenues in the brake business this year.",
            "Sentiment": "positive",
            "PublishDate": 1747711671000,
            "Source": "default"
        },
        {
            "Title": "Jupiter Wagons: Q4 Revenue and Profit Decline, Margin Expands",
            "Summary": "Jupiter Wagons Ltd. reported a 6.4% decrease in Q4 FY25 revenue to Rs 1,044 crore and a 1.8% drop in net profit to Rs 103 crore. However, EBITDA margin expanded to 14.6% from 13.2%. The company's order book stands at Rs 6,303.6 crore, including significant orders from Ambuja Cement, ACC, and Braithwaite & Co.",
            "Sentiment": "neutral",
            "PublishDate": 1747649495000,
            "Source": "earnings"
        },
        {
            "Title": "Jupiter Wagons Reports Q4 EBITDA and Margin",
            "Summary": "Jupiter Wagons has reported its Q4 financial results. The company's EBITDA for Q4 was 1.45 billion rupees, compared to 1.48 billion rupees in the same quarter last year. The EBITDA margin for Q4 improved to 14.43% from 13.27% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747646771000,
            "Source": "result"
        },
        {
            "Title": "Jupiter Wagons Reports Q4 Financial Results",
            "Summary": "Jupiter Wagons has reported its Q4 financial results. The company's revenue for the quarter was 10 billion rupees, compared to 11 billion rupees in the same quarter last year, showing a year-over-year decrease. The standalone net profit for Q4 was 973 million rupees, down from 1.04 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747646716000,
            "Source": "result"
        },
        {
            "Title": "Jupiter Wagons Ltd: Jabalpur Plant Halts Production for 15-20 Days",
            "Summary": "Jupiter Wagons Ltd has temporarily closed its Jabalpur plant due to unavoidable circumstances. The company is working to resolve the issue and expects to resume normal production shortly. Separately, its subsidiary JTRF has acquired land in Odisha for a new railwheel and axle forging plant.",
            "Sentiment": "neutral",
            "PublishDate": 1745305818000,
            "Source": "normal_news"
        },
        {
            "Title": "Jupiter Wagons' Subsidiary to Establish Railwheel & Axle Plant in Odisha",
            "Summary": "Jupiter Tatravagonka, a subsidiary of Jupiter Wagons, has secured land in Odisha for a new railwheel and axle manufacturing facility. The company plans to invest 25 billion rupees in this new plant, which represents a significant expansion of their operations in the railway equipment sector.",
            "Sentiment": "positive",
            "PublishDate": 1743725274000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jupiter Wagons Subsidiary to Establish Railwheel & Axle Plant in Odisha",
            "Summary": "Jupiter Tatravagonka, a subsidiary of Jupiter Wagons, has secured land in Odisha for a new railwheel and axle manufacturing facility. The company plans to invest 25 billion rupees in this new plant, signaling a significant expansion in its production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1743680998000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jupiter Wagons Targets Electric LCV Market with Ambitious Sales Goal",
            "Summary": "Jupiter Wagons is focusing its electric mobility efforts on the Light Commercial Vehicle (LCV) market. The company aims to sell 100,000 electric vehicles within the next five years. The Managing Director discussed the company's EV strategy, product pipeline, supply chain management, and future plans in an interview with BusinessLine.",
            "Sentiment": "positive",
            "PublishDate": 1741238586000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jupiter Wagons Approves Related Party Transaction and Relocates Foundry",
            "Summary": "Jupiter Wagons has approved a related party transaction with JTRFPL for up to 20 billion rupees. Additionally, the company announced that its new captive alloy steel foundry will be relocated to Bandel, West Bengal.",
            "Sentiment": "neutral",
            "PublishDate": 1741134310000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jupiter Wagons Approves Related Party Transaction and Relocates Foundry",
            "Summary": "Jupiter Wagons has announced the approval of a related party transaction with JTRFPL for up to 20 billion rupees. Additionally, the company plans to relocate its new captive alloy steel foundry to Bandel, West Bengal.",
            "Sentiment": "neutral",
            "PublishDate": 1741095164000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jupiter Wagons: Rs 10,000 Crore Revenue Target with EV Truck Launch",
            "Summary": "Jupiter Wagons aims for Rs 10,000 crore revenue and 27% EBITDA margin by FY27, driven by new facilities and entry into the EV truck segment. The company launched JEM Tez, a 1-tonne payload electric LCV, and plans to introduce 2-tonne and 3-tonne vehicles by year-end. Their new Pithampur facility will produce 8,000 EVs annually in 2-3 years.",
            "Sentiment": "positive",
            "PublishDate": 1741065600000,
            "Source": "normal_news"
        },
        {
            "Title": "Jupiter Electric Mobility Targets Rs 100 Crore Revenue in First Year",
            "Summary": "The Managing Director of Jupiter Wagons has announced that the company's subsidiary, Jupiter Electric Mobility, is aiming to achieve a revenue of Rs 100 crore in its first year of operations. The company is projecting a year-on-year growth of at least 2x.",
            "Sentiment": "positive",
            "PublishDate": 1740991339000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jupiter Wagons Announces New E-LCV Production Facility",
            "Summary": "Jupiter Wagons has unveiled plans for a new manufacturing facility designed to produce 8,000 to 10,000 electric light commercial vehicles (E-LCVs) annually. This expansion into the electric vehicle market represents a significant development for the company, potentially positioning it as a notable player in the growing E-LCV sector.",
            "Sentiment": "positive",
            "PublishDate": 1740991126000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jupiter Electric Mobility Launches JEM TEZ and New Manufacturing Facility",
            "Summary": "Jupiter Wagons' subsidiary, Jupiter Electric Mobility, has launched a new product called JEM TEZ and inaugurated a state-of-the-art manufacturing facility in Indore. This development represents a significant expansion in the company's electric mobility segment.",
            "Sentiment": "positive",
            "PublishDate": 1740991095000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jupiter Wagons Targets Revenue Growth in Wheel Business",
            "Summary": "Jupiter Wagons aims to double its revenue from the wheel business to Rs 600 crore by FY26. The company plans to achieve this growth through increased production capacity, strong order inflows, and improved domestic manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1740626839000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jupiter Wagons Secures Major Order and Expands Production Capacity",
            "Summary": "Jupiter Tatravagonka Railwheel Factory, a subsidiary of Jupiter Wagons, has secured a significant order worth Rs 255 crore from Braithwait & Co. Additionally, the company announced that its new facility in Odisha will increase annual production capacity to 100,000 wheel sets, reducing dependence on imports.",
            "Sentiment": "positive",
            "PublishDate": 1740626689000,
            "Source": "order&deals"
        },
        {
            "Title": "Jupiter Wagons Secures ₹600 Crore Order from Ambuja Cement and ACC",
            "Summary": "Jupiter Wagons has received a significant order from Ambuja Cement and ACC for the manufacture and supply of BCFCM rakes wagon. The order is valued at ₹600 crore, marking a substantial business opportunity for the company in the railway wagon manufacturing sector.",
            "Sentiment": "positive",
            "PublishDate": 1739405682000,
            "Source": "order&deals"
        }
    ]
}