{
    "Symbol": "JYOTICNC",
    "ISIN": "INE980O01024",
    "News": [
        {
            "Title": "Jyoti CNC Board Meet Set for Feb 10 Q3FY26 Results",
            "Summary": "Jyoti CNC Automation has scheduled its board meeting for February 10, 2026, to consider and approve standalone and consolidated financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770281280072,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jyoti CNC Automation Appoints New Independent Director",
            "Summary": "Jyoti CNC Automation Limited appointed Mrs. Prafulla P. Shenoy as Additional Independent Director effective January 19, 2026. She brings 36 years of banking experience from IDBI and SIDBI.",
            "Sentiment": "positive",
            "PublishDate": 1768824838855,
            "Source": "stocks"
        },
        {
            "Title": "Jyoti CNC Automation Doubles Manufacturing Capacity at French Subsidiary Huron Graffenstaden",
            "Summary": "Jyoti CNC Automation commenced expanded operations at its subsidiary Huron Graffenstaden SAS in Strasbourg, France, doubling the facility's manufacturing capacity. The expansion strengthens the company's global manufacturing presence and enhances capabilities to meet rising demand from the aerospace sector and global customers.",
            "Sentiment": "positive",
            "PublishDate": 1763706855850,
            "Source": "stock"
        },
        {
            "Title": "Jyoti CNC Automation Receives ₹4.46 Crore Tax Demand Order from CGST Authority",
            "Summary": "Jyoti CNC Automation Limited received a demand order from Additional Commissioner, CGST Commissionerate, Rajkot for ₹4,45,59,720 comprising tax of ₹2,22,79,860 along with interest and penalty for alleged non-compliance with e-way bill regulations. The company is consulting with tax and legal advisors to challenge the order at an appropriate forum, with total financial impact potentially reaching ₹4.46 crore.",
            "Sentiment": "negative",
            "PublishDate": 1763460121770,
            "Source": "stock"
        },
        {
            "Title": "Jyoti CNC Automation Reports 17.9% Revenue Growth in Q2 FY26, Plans Capacity Expansion to 16,000 Machines",
            "Summary": "Jyoti CNC Automation achieved consolidated revenue of Rs. 508 crores in Q2 FY26 with 17.9% growth and maintains healthy order book of Rs. 4,546 crores across aerospace, defense, and automotive sectors. The company is expanding production capacity from 6,000 to 16,000 machines annually by September 2026 while targeting 30-35% growth trajectory for next three years.",
            "Sentiment": "positive",
            "PublishDate": 1763357027242,
            "Source": "earnings"
        },
        {
            "Title": "Jyoti CNC Automation Targets 30-35% Growth Over Next 2-3 Years",
            "Summary": "Jyoti CNC Automation expects 30-35% growth over the next 2-3 years driven by expansion plans. The company aims to achieve over 90% capacity utilization by FY26. The company anticipates 4-5% margin improvement after developing its own human controllers, drives, and motors. Jyoti CNC maintains a 40-60 performance split between first and second halves of the year, with Q3 and Q4 traditionally being its strongest performing quarters.",
            "Sentiment": "positive",
            "PublishDate": 1762831841264,
            "Source": "stock"
        },
        {
            "Title": "Jyoti CNC Automation Reports Strong Q2FY26 Results with 17.9% Revenue Growth",
            "Summary": "Jyoti CNC Automation Limited reported revenue of INR 508 crores for Q2FY26, marking a 17.9% increase from the previous year. The company achieved EBITDA of INR 125 crores with a 24.5% margin and profit after tax of INR 86 crores with a 16.8% margin. For the half-year period, revenue reached INR 918 crores, up 15.8% year-on-year. The company maintains a robust order book of INR 4,546 crores, providing visibility for the next 24-30 months. Operations remained steady across automotive, aerospace, defence, and general engineering verticals. The company is operating at approximately 88% capacity utilization. Capacity expansion of additional 120 machines at the Huron facility in France is nearing completion. The Board approved purchase of 20 acres at Tumakuru Machine Tools Park in Karnataka for future manufacturing expansion.",
            "Sentiment": "positive",
            "PublishDate": 1762827995551,
            "Source": "earnings"
        },
        {
            "Title": "Jyoti CNC Automation Reports Strong Q2 Performance with 75% Revenue Growth",
            "Summary": "Jyoti CNC Automation Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The company's standalone revenue from operations increased to ₹443.08 crores in Q2 compared to ₹253.60 crores in the same quarter last year. Net profit after tax rose to ₹75.72 crores from ₹47.26 crores year-on-year. For the half year, revenue reached ₹829.94 crores versus ₹597.34 crores in the previous year, with net profit of ₹147.64 crores compared to ₹70.82 crores. On a consolidated basis, Q2 revenue was ₹459.54 crores against ₹303.83 crores last year, with net profit of ₹74.36 crores versus ₹47.78 crores. The company operates in the Machine Tool Industry segment and has subsidiaries in France, Germany, Canada and Turkey. Basic earnings per share for the quarter stood at ₹3.47.",
            "Sentiment": "positive",
            "PublishDate": 1762679131276,
            "Source": "earnings"
        },
        {
            "Title": "Jyoti CNC Automation Schedules Earnings Call for Q2 FY26 Results",
            "Summary": "Jyoti CNC Automation Limited has scheduled an earnings call to discuss its financial results for the quarter ended September 30, 2025. The call is set for Monday, November 10, 2025 at 5:00 PM India time. The session will be represented by Chairman and Managing Director Parakramsinh Jadeja along with the senior management team. ICICI Securities is coordinating the conference call, providing multiple access numbers including toll-free options for Singapore, Hong Kong, UK, and USA participants.",
            "Sentiment": "neutral",
            "PublishDate": 1762346081861,
            "Source": "earnings"
        },
        {
            "Title": "Jyoti CNC Automation Independent Director Prasad Parameswaranpillai Naga Resigns",
            "Summary": "Prasad Parameswaranpillai Naga has resigned from his position as Non-Executive and Independent Director of Jyoti CNC Automation Limited, effective from the close of business hours on October 26, 2025. Naga, who holds DIN 07430506, cited other pre-occupations as the reason for his resignation. His departure also means he will step down from his roles on the Audit Committee, Nomination and Remuneration Committee, and Stakeholder Relationship Committee. The director confirmed there are no other material reasons beyond those stated for his resignation. The company has informed stock exchanges BSE and NSE about the resignation.",
            "Sentiment": "neutral",
            "PublishDate": 1761547333701,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jyoti CNC Automation Sees Rs. 16.24 Crore Block Trade on NSE",
            "Summary": "Jyoti CNC Automation Ltd. witnessed a block trade worth Rs. 16.24 crores on the NSE. The transaction involved approximately 180,200 shares at a price of Rs. 901.05 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1759472947912,
            "Source": "order&deals"
        },
        {
            "Title": "Jyoti CNC Automation Reports 13.4% Revenue Growth and 40.2% PAT Jump in Q1 FY26",
            "Summary": "Jyoti CNC Automation delivered strong quarterly results with revenue rising to INR 410 crores from INR 361 crores year-over-year. The CNC machine manufacturer, ranked among the top 10 globally, reported profit after tax of INR 71.2 crores, marking a 40.2% increase. PAT margin improved to 17.4% from 14% in the previous year period. The company maintained a gross margin of 55.9% while EBITDA grew 6.5% to INR 100.2 crores, though EBITDA margin compressed to 24.4% from 26%. Machine sales volume increased significantly to 1,117 units from 788 units. The company holds an order book of INR 4,412 crores and recorded new orders worth INR 451 crores during the quarter. Revenue contribution came from auto and auto components (36%), aerospace and defense (30%), general engineering (26%), and others (8%). Jyoti CNC operates with manufacturing capacity of over 6,000 machines annually at 75% utilization and plans to expand capacity to 10,000 machines by September 2026. The company approved land purchase in Karnataka for support centers and is exploring opportunities in US and China markets.",
            "Sentiment": "positive",
            "PublishDate": 1754889674941,
            "Source": "earnings"
        },
        {
            "Title": "Jyoti CNC Automation Appoints Two Senior Management Personnel",
            "Summary": "Jyoti CNC Automation Limited appointed Alay M. Dave as Chief Operating Officer and Vijay Pratap Singh as Chief Strategy and Transformation Officer, both designated as Senior Management Personnel effective August 06, 2025. Dave brings 25 years of experience while Singh has 24 years of experience, both possessing relevant knowledge, skills, and expertise for their assigned roles.",
            "Sentiment": "positive",
            "PublishDate": 1754492110342,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jyoti CNC Plans International Expansion Through US and China Facilities",
            "Summary": "Jyoti CNC announced plans to expand its sales and service network internationally by establishing or acquiring facilities in the United States and China. The company is looking to grow its presence in these key markets through either new establishments or acquisitions.",
            "Sentiment": "positive",
            "PublishDate": 1754468086034,
            "Source": "stock"
        },
        {
            "Title": "Jyoti CNC Auto Reports Strong Q1 Growth with Revenue Rising to 4 Billion Rupees",
            "Summary": "Jyoti CNC Auto reported quarterly revenue of 4 billion rupees compared to 3.62 billion rupees in the same period last year. The company's consolidated net profit increased to 714 million rupees from 509 million rupees year-over-year. EBITDA grew to 1 billion rupees from 940 million rupees, though EBITDA margin declined to 24.4% from 26% compared to the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754467453147,
            "Source": "earnings"
        },
        {
            "Title": "Jyoti CNC Automation: Strategic Land Acquisition and Potential Stake Sale",
            "Summary": "Jyoti CNC Automation acquires 20 acres in Tumakuru Machine Tools Park for expansion. Non-promoter shareholders may divest 6% stake via block deals worth ₹1,542 crore. Company projects 35-40% topline growth under current capacity.",
            "Sentiment": "positive",
            "PublishDate": 1751633935000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jyoti CNC Automation Acquires Land in Karnataka for Expansion",
            "Summary": "Jyoti CNC Automation has acquired 20 acres of land in the Tumakuru Machine Tools Park, Karnataka. This acquisition is intended for the company's future expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1751630903000,
            "Source": "default"
        },
        {
            "Title": "Jyoti CNC Automation: Non-Promoter Shareholders Offload 6% Stake for Rs 1,489 Crore",
            "Summary": "Vijay Mohanlal Parekh and Paresh Mohanlal Parekh, non-promoter shareholders of Jyoti CNC Automation Ltd., sold a combined 6% stake (1.37 crore shares) for Rs 1,489 crore through block deals. Each sold a 3.01% stake at around Rs 1,087 per share. Kotak Funds-India Midcap acquired a 1.66% stake. The stock closed 5.92% lower at Rs 1,059.",
            "Sentiment": "neutral",
            "PublishDate": 1751302196000,
            "Source": "block_deals"
        },
        {
            "Title": "Jyoti CNC Automation Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 488,315 shares of Jyoti CNC Automation Ltd. occurred on the National Stock Exchange (NSE) at a price of Rs. 1088.60 per share. The total value of the transaction was Rs. 53.16 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1751257236000,
            "Source": "block_details"
        },
        {
            "Title": "Jyoti CNC Automation: Stock Dips 4% Following ₹1,499 Crore Block Deal",
            "Summary": "Jyoti CNC Automation's stock fell up to 4% after a block deal involving 1.37 crore shares (6.06% of equity) at ₹1,087 per share, totaling ₹1,499 crore. Non-promoter shareholders were expected to divest a 6% stake.",
            "Sentiment": "negative",
            "PublishDate": 1751255360000,
            "Source": "block_deals"
        },
        {
            "Title": "Jyoti CNC Automation Ltd. Reports Major Block Trade on NSE",
            "Summary": "A significant block trade of Jyoti CNC Automation Ltd. shares occurred on the National Stock Exchange (NSE). The trade involved approximately 13,553,065 shares at a price of Rs. 1087.00 per share, totaling Rs. 1473.22 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1751255137000,
            "Source": "block_details"
        },
        {
            "Title": "Jyoti CNC Automation: Non-Promoters to Sell 6% Stake in ₹1,542 Crore Block Deal",
            "Summary": "Non-promoter shareholders of Jyoti CNC Automation Ltd plan to sell a 6% stake through block deals, valued at ₹1,542 crore, including an upsize option of ₹304 crore. The company expects 35-40% topline growth under current capacity and maintains a robust order book with 25-27% margins.",
            "Sentiment": "neutral",
            "PublishDate": 1751026402000,
            "Source": "block_deals"
        },
        {
            "Title": "Jyoti CNC Automation: Targeting 90% Capacity Utilisation for FY26 Growth",
            "Summary": "Jyoti CNC Automation aims to maintain FY25 growth in FY26, targeting 90% capacity utilisation. The company has a Rs 4,500 crore order book, plans to expedite execution within 18-20 months, and anticipates further capacity expansion within two years. A new manufacturing facility is scheduled for FY27, with current capacity addition focused on general engineering and entry-level products.",
            "Sentiment": "positive",
            "PublishDate": 1748395985000,
            "Source": "normal_news"
        },
        {
            "Title": "Jyoti CNC Automation Reports Strong Q3 Financial Results",
            "Summary": "Jyoti CNC Automation has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 802 million rupees from 480 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 4.50 billion rupees compared to 3.8 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739146216000,
            "Source": "earnings"
        },
        {
            "Title": "Jyoti CNC Automation Reports Q3 EBITDA Growth",
            "Summary": "Jyoti CNC Automation has reported its Q3 financial results. The company's EBITDA increased to 1.12 billion rupees, up from 963 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 25.04% from 25.47% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739011410000,
            "Source": "earnings"
        },
        {
            "Title": "Jyoti CNC Automation to Consider Q3 Results on February 8",
            "Summary": "Jyoti CNC Automation has announced that it will consider its third quarter (Q3) financial results on February 8. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738672511000,
            "Source": "earnings"
        },
        {
            "Title": "Jyoti CNC Automation: Shares Soar 147% in a Year, 312.7% Above IPO Price",
            "Summary": "Jyoti CNC Automation shares have surged 147% in the past year to ₹1,366, and are up 312.7% from the IPO price of ₹331. The company's Q2FY25 order book improved by 26% to ₹42,893 million, with aerospace contributing 43%. The company's growth is driven by strong demand in aerospace, auto components, and electronics manufacturing sectors.",
            "Sentiment": "positive",
            "PublishDate": 1736400025000,
            "Source": "normal_news"
        },
        {
            "Title": "Jyoti CNC Automation: Analyst Projects 5% Upside to ₹1,450",
            "Summary": "Equirus initiates coverage on Jyoti CNC Automation with an 'Add' rating and ₹1,450 price target. The company plans ₹400 crore capex over two years to expand production capacity from 4,400 to 16,000 machines annually. Equirus projects 40% CAGR in sales and 66% in PAT over FY24-FY27.",
            "Sentiment": "positive",
            "PublishDate": 1735529243000,
            "Source": "normal_news"
        },
        {
            "Title": "Jyoti CNC: Strong Order Book and Capacity Expansion Drive Growth",
            "Summary": "Jyoti CNC reports a robust order book and plans for capacity expansion, indicating potential for future growth.",
            "Sentiment": "positive",
            "PublishDate": 1732013656000,
            "Source": "normal_news"
        },
        {
            "Title": "JYOTI CNC AUTO Reports Strong Q2 Revenue Growth",
            "Summary": "JYOTI CNC AUTO has announced its Q2 revenue, which stands at 4.3 billion rupees, compared to 3 billion rupees in the same quarter last year, representing a significant year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731572731000,
            "Source": "result"
        },
        {
            "Title": "Jyoti CNC Automation Reports Strong Q2 Financial Performance",
            "Summary": "Jyoti CNC Automation has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.06 billion rupees, up from 546 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 24.73% from 18.06% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1731572728000,
            "Source": "result"
        }
    ]
}