{
    "Symbol": "JYOTHYLAB",
    "ISIN": "INE668F01031",
    "News": [
        {
            "Title": "Jyothy Labs Q3FY26 Results: Revenue Up 5.1% YoY",
            "Summary": "Jyothy Labs reported Q3FY26 revenue of ₹73,961 lacs, up 5.1% YoY, but net profit declined 7.2% to ₹8,112 lacs. Nine-month revenue grew 2.2% to ₹2,22,688 lacs.",
            "Sentiment": "neutral",
            "PublishDate": 1770662655417,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jyothy Labs Q3FY26 Results Call on Feb 9",
            "Summary": "Jyothy Labs Limited announces conference call for analysts and investors on February 9, 2026 at 16:00 hrs IST to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770052472077,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jyothy Labs Promoters Transfer 78.5 Crore Shares to Family Trusts",
            "Summary": "M.P. Ramachandran and M.G. Shanthakumari transferred 64.11 lakh and 14.36 crore equity shares respectively to M.P. Ramachandran Family Trust and M.P. Ramachandran Family Trust II through off-market gift transactions. The transfer maintains overall promoter group holdings at 62.89% with no change in total shareholding structure, representing an internal reorganization within the promoter group.",
            "Sentiment": "neutral",
            "PublishDate": 1763364309566,
            "Source": "corporate_action"
        },
        {
            "Title": "Jyothy Labs Reports Flat Q2 Growth Amid GST Disruption, Targets Double-Digit Volume Growth by Year-End",
            "Summary": "Jyothy Labs posted 0.4% revenue growth to Rs. 736 crore in Q2 with 2.8% volume growth, impacted by GST rate revisions that disrupted distribution channels particularly in personal care segment. The company maintains EBITDA margin at 16.1% and aims for double-digit volume growth by FY26 exit, supported by strong cash position of Rs. 801 crore and new product launches in fabric care.",
            "Sentiment": "neutral",
            "PublishDate": 1763205887194,
            "Source": "corporate_action"
        },
        {
            "Title": "Jyothy Labs Reports Flat Sales Growth Despite 3% Volume Increase in Q2",
            "Summary": "Jyothy Laboratories reported flat year-over-year sales growth in Q2 FY26, while volumes increased by 3%. The gap between value and volume growth resulted from MRP reductions, higher grammage, and promotional price-offs in select categories. The company anticipates a 2%-2.5% value-volume gap going forward. Motilal Oswal maintains a 'Neutral' stance on the stock, describing it as a weak quarter despite the volume growth.",
            "Sentiment": "negative",
            "PublishDate": 1763018795466,
            "Source": "earnings"
        },
        {
            "Title": "Jyothy Labs Reports Decline in Q2 Profitability Metrics",
            "Summary": "Jyothy Labs reported Q2 EBITDA of 1.18 billion rupees compared to 1.38 billion rupees in the same period last year. The company's EBITDA margin decreased to 16.1% from 18.87% year-over-year. Consolidated net profit for the quarter stood at 878 million rupees, down from 1.05 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762931386062,
            "Source": "earnings"
        },
        {
            "Title": "Jyothy Labs Reports 1.4% Revenue Growth Amid Urban Market Softness in Q1 FY26",
            "Summary": "Jyothy Labs reported revenue of Rs. 751 crore for the quarter ended June 30, 2025, reflecting 1.4% value growth and 3.6% volume growth year-on-year. The company maintained EBITDA margin at 16.5% with operating EBITDA of Rs. 124 crore and PAT of Rs. 97 crore. Gross margin declined 330 basis points to 48% due to input cost pressures and competitive intensity in the dish wash segment. The fabric care segment delivered mid-single-digit volume growth, with liquid detergents more than doubling growth versus the same period last year. Dish wash segment faced intensive competitive activity affecting value growth despite healthy volumes, with Pril liquid posting double-digit volume growth. Rural markets outperformed urban areas, while modern trade and e-commerce sustained double-digit growth compared to volume pressures in general trade. The company expects meaningful improvements in Q3 and Q4 supported by recovery in urban discretionary spending and festive season momentum. Management indicated they are working to turn around the household insecticide segment by the second half of FY27.",
            "Sentiment": "neutral",
            "PublishDate": 1755177577290,
            "Source": "earnings"
        },
        {
            "Title": "Jyothy Labs Reports 13.7% Revenue Growth in Q1 with Net Profit of Rs 96.79 Crores",
            "Summary": "Jyothy Labs Limited reported quarterly results with revenue from operations of Rs 751.21 crores compared to Rs 741.18 crores in the same quarter last year, marking a 1.35% increase. Net profit reached Rs 96.79 crores versus Rs 101.83 crores in the previous year quarter. Total income stood at Rs 770.65 crores against Rs 754.87 crores year-over-year. The company's fabric care segment generated Rs 332.77 crores in revenue, while dishwashing contributed Rs 248.19 crores. Household insecticides recorded Rs 45.47 crores and personal care segment achieved Rs 93.93 crores. Basic and diluted earnings per share were Rs 2.64 compared to Rs 2.77 in the same quarter last year. The company sold its entire equity stake in subsidiary Jyothy Kallol Bangladesh Limited for Rs 210 lacs, resulting in a loss of Rs 370 lacs recorded as exceptional item in the previous quarter. Following this divestment, Jyothy Labs now presents standalone financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1754984135772,
            "Source": "earnings"
        },
        {
            "Title": "Jyothy Labs Forecasts Subdued Urban Demand in H1 FY26",
            "Summary": "Jyothy Labs anticipates that urban demand will remain subdued in the first half of fiscal year 2026 due to ongoing macroeconomic pressures. This outlook suggests potential challenges for the company's sales and growth in urban markets during that period.",
            "Sentiment": "negative",
            "PublishDate": 1747041265000,
            "Source": "default"
        },
        {
            "Title": "Jyothy Labs: Q4 Profit Dips 2.4%, Dividend Declared",
            "Summary": "Jyothy Labs reported a consolidated net profit of ₹76.25 crore for Q4, down 2.4% year-on-year from ₹78.15 crore. The company has also announced a dividend.",
            "Sentiment": "neutral",
            "PublishDate": 1747040038000,
            "Source": "earnings"
        },
        {
            "Title": "Jyothy Labs Reports Q4 Financial Results",
            "Summary": "Jyothy Labs has announced its Q4 financial results. The company's revenue increased to 6.67 billion rupees from 6.6 billion rupees year-over-year. EBITDA rose to 1.12 billion rupees from 1.08 billion rupees, with the EBITDA margin improving to 16.78% from 16.42% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747039244000,
            "Source": "result"
        },
        {
            "Title": "Jyothy Labs Declares Dividend of ₹3.5 Per Share",
            "Summary": "Jyothy Labs has announced a dividend of ₹3.5 per share for its shareholders. This corporate action represents a distribution of the company's profits to its investors.",
            "Sentiment": "positive",
            "PublishDate": 1747039149000,
            "Source": "result"
        },
        {
            "Title": "Jyothy Labs to End Laundry Service Operations at Kankaria Coaching Depot",
            "Summary": "Jyothy Labs has announced that it will cease its laundry service operations at the Coaching Depot in Kankaria by April 30. This move indicates a potential restructuring or discontinuation of a specific business segment for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1744380947000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jyothy Labs to Sell Entire Stake in Jyothy Kallol Bangladesh",
            "Summary": "The Board of Directors of Jyothy Labs has approved the sale of the company's entire equity stake in its subsidiary, Jyothy Kallol Bangladesh. This decision represents a significant corporate action that will likely impact the company's operations and financial structure in Bangladesh.",
            "Sentiment": "neutral",
            "PublishDate": 1742947893000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jyothy Labs to Sell Entire Stake in Bangladesh Subsidiary",
            "Summary": "Jyothy Labs' board has approved the sale of the company's entire equity stake in its subsidiary, Jyothy Kallol Bangladesh. This decision represents a significant corporate action that will likely impact the company's operations and financial structure in Bangladesh.",
            "Sentiment": "neutral",
            "PublishDate": 1742905302000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jyothy Labs Reports Strong Q3 Volume Growth",
            "Summary": "Jyothy Labs has reported a Q3 volume growth of 8%, surpassing market estimates of 5%. This indicates robust performance and potentially increased market share for the company in the third quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738312902000,
            "Source": "earnings"
        },
        {
            "Title": "Jyothy Labs Reports Q3 Financial Results",
            "Summary": "Jyothy Labs has released its Q3 financial results. The company's EBITDA for the quarter was 1.16 billion rupees, compared to 1.19 billion rupees in the same quarter last year. The EBITDA margin decreased to 16.43% from 17.51% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738310688000,
            "Source": "earnings"
        },
        {
            "Title": "Jyothy Labs Reports Q3 Financial Results",
            "Summary": "Jyothy Labs has announced its financial results for the third quarter. The company's consolidated net profit decreased to 874 million rupees from 909 million rupees in the same quarter last year. However, revenue increased to 7 billion rupees from 6.7 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738310608000,
            "Source": "earnings"
        },
        {
            "Title": "Jyothy Labs Reports Q2 Revenue",
            "Summary": "Jyothy Labs announced its second quarter revenue of 7.33 billion rupees, compared to 7.3 billion rupees in the same quarter last year, showing a slight increase year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731394830000,
            "Source": "result"
        },
        {
            "Title": "Jyothy Labs Reports Q2 EBITDA Growth",
            "Summary": "Jyothy Labs announced its Q2 financial results, showing an EBITDA of 1.38 billion rupees, up from 1.35 billion rupees in the same quarter last year. The company's EBITDA margin also improved to 18.87% from 18.48% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731394823000,
            "Source": "result"
        },
        {
            "Title": "Jyothy Labs Reports Slight Increase in Q2 Net Profit",
            "Summary": "Jyothy Labs, an Indian consumer goods company, announced its financial results for the second quarter. The company's consolidated net profit increased marginally to 1.05 billion rupees, compared to 1.04 billion rupees in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1731394760000,
            "Source": "result"
        }
    ]
}