{
    "Symbol": "JYOTISTRUC",
    "ISIN": "INE197A01024",
    "News": [
        {
            "Title": "Jyoti Structures Appoints Amit Dutta as COO",
            "Summary": "Jyoti Structures Limited announces appointment of Amit Dutta as Chief Operating Officer to strengthen operational leadership and enhance EPC project execution capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1770283169040,
            "Source": "stocks"
        },
        {
            "Title": "Jyoti Structures Q3FY26 Rights Issue Monitoring Report",
            "Summary": "Jyoti Structures submitted monitoring agency report for Q3FY26 showing ₹78.18 crore utilization during quarter, with ₹59.88 crore remaining unutilized from ₹459.69 crore revised issue size.",
            "Sentiment": "neutral",
            "PublishDate": 1769176721213,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jyoti Structures Q3FY26 Revenue Jumps 52% to ₹208.96 Cr",
            "Summary": "Jyoti Structures Limited reported strong Q3FY26 results with revenue rising 52% YoY to ₹208.96 crores. Net profit increased 45% to ₹17.02 crores, while nine-month revenue grew 55% to ₹515.72 crores.",
            "Sentiment": "positive",
            "PublishDate": 1769176005811,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jyoti Structures Reports Strong Q2 and H1 FY2025-26 Results with 42% Revenue Growth",
            "Summary": "Jyoti Structures Limited, an infrastructure and power transmission EPC company, reported quarterly revenue of ₹155.21 crores versus ₹109.29 crores, marking 42% growth, with EBITDA rising 54% to ₹13.40 crores. The company's half-yearly performance showed 59.7% revenue growth to ₹317.61 crores and 68.5% EBITDA growth, reflecting strong operational execution and healthy project pipeline in transmission and distribution sectors.",
            "Sentiment": "positive",
            "PublishDate": 1763060569801,
            "Source": "earnings"
        },
        {
            "Title": "Jyoti Structures Reports Rs 20.88 Crore Profit for Half-Year, Allots Employee Stock Options",
            "Summary": "Jyoti Structures Limited reported a net profit of Rs 20.88 crore for the half-year ended September 30, 2025, compared to Rs 12.16 crore in the previous year. Revenue from operations increased to Rs 308.76 crore from Rs 195.79 crore. The company's board approved the allotment of 24,06,800 equity shares and 8,000 equity shares under the JSL ESOS 2021 scheme. The monitoring agency report showed progress in utilizing proceeds from the rights issue, with Rs 174.63 crore raised for NCLT-approved resolution plan dues and operational requirements. The company's share price has declined 40% over the last 12 months, trading at Rs 11.1 per share as of November 10, 2025, below the rights issue price of Rs 15.0 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1762992592701,
            "Source": "corporate_action"
        },
        {
            "Title": "Jyoti Structures Wins Rs. 288.36 Crore Transmission Line Project from AESL Projects",
            "Summary": "Jyoti Structures Limited secured a Notification of Award from AESL Projects Limited for a transmission line project worth Rs. 288.36 crores excluding GST. The project involves supply of towers, survey, soil investigation, foundations, erection, stringing, testing and commissioning of a portion of +800 kV HVDC Bhadla 3 – Fatehpur Transmission Line on turnkey basis in central India. The completion period is set at 36 months from the Letter of Award. The company confirmed that none of the promoter/promoter group/group companies have any interest in AESL Projects Limited, and the order does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1760534814448,
            "Source": "stock"
        },
        {
            "Title": "Jyoti Structures Files Application Against Non-Fund Based Lenders for Resolution Plan Violations",
            "Summary": "Jyoti Structures Limited filed an application with the National Company Law Tribunal, Mumbai Bench, seeking directions against certain non-fund based lenders for violating the company's approved resolution plan. The company alleges these lenders contravened provisions of the resolution plan and NCLT Mumbai orders dated August 20, 2024, which were later affirmed by the National Company Law Appellate Tribunal, New Delhi on December 9, 2024. The application seeks necessary directions and action against the non-compliant lenders.",
            "Sentiment": "negative",
            "PublishDate": 1760354327474,
            "Source": "stock"
        },
        {
            "Title": "Jyoti Structures Extends CEO Rajesh Kumar Singh's Tenure by 13 Months Until July 2028",
            "Summary": "Jyoti Structures Limited has extended the tenure of CEO Rajesh Kumar Singh from the current expiry date of 30 June 2027 to 31 July 2028. The Board of Directors approved this extension on 26 August 2025, based on recommendations from the nomination and remuneration committee. Singh holds a Bachelor of Engineering in mechanical engineering from NIT Silchar and CEO certification from IIM Lucknow, bringing over 30 years of experience in project management, cost analysis, and resource planning. He previously led the team that completed the longest private High Voltage Direct-Current line in India.",
            "Sentiment": "positive",
            "PublishDate": 1756192877464,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jyoti Structures Reports No Deviations in Rights Issue Proceeds Utilization for Q1 FY26",
            "Summary": "Jyoti Structures Limited submitted its monitoring agency report for the quarter ended June 30, 2025, detailing the utilization of proceeds from its Rights Issue II worth Rs. 459.69 crore. The company's rights issue, conducted from February 17 to March 10, 2025, received 92.11% subscription. CARE Ratings Limited, the monitoring agency, reported no deviations from the stated objects of the issue. During the quarter, the company utilized Rs. 270 crore across various purposes including Rs. 97.76 crore for dissenting financial creditors, Rs. 19.31 crore for employee dues, Rs. 27.11 crore for operational creditors, Rs. 90.15 crore for meeting costs and margin requirements, Rs. 45.29 crore for general corporate purposes, and Rs. 17.62 crore for issue-related expenses. The monitoring agency noted that Rs. 162.54 crore remains unutilized and is deployed in fixed deposits with HDFC Bank. The company's share price declined approximately 20% over the 12 months leading to June 30, 2025. The monitoring agency highlighted concerns about fund commingling and lack of board approval for certain general corporate purpose expenditures totaling Rs. 34.92 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1755190608665,
            "Source": "corporate_action"
        },
        {
            "Title": "Jyoti Structures Approves Q1 FY26 Results and Multiple Key Appointments",
            "Summary": "Jyoti Structures Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025, during a meeting held on August 14, 2025. The company made several key appointments including re-appointment of M/s. Bhushan Khot and Co. as Internal Auditor, appointment of M/s. K N B J & Associates as additional Internal Auditor, CMA Dr. Narhar K. Nimkar as Cost Auditor, M/s Santosh M. Raikar & Co. as Tax Auditor, and M/s Sandeep Dubey & Associates as Secretarial Auditor for a 5-year term. The Board also approved allotment of equity shares under the JSL ESOS 2021 scheme: 4,39,000 shares at Rs. 5 exercise price, 10,000 shares at Rs. 10 exercise price, and 53,333 shares at Rs. 15 exercise price, totaling 5,02,333 shares. Additionally, the company constituted a Corporate Social Responsibility Committee with Dr. Rajendra Prasad Singh as Chairperson, Mrs. Monica Chaturvedi, Mr. Abdul Hameed Khan, and Mrs. Pragati Nagar as members. The Board also approved the Directors' Report for FY 2024-25 and matters related to the 50th Annual General Meeting.",
            "Sentiment": "positive",
            "PublishDate": 1755188475970,
            "Source": "corporate_action"
        },
        {
            "Title": "Jyoti Structures Reports Strong Revenue and Profit Growth in Q1 Despite Margin Compression",
            "Summary": "Jyoti Structures delivered strong financial performance in Q1 with consolidated net profit surging to 112 million rupees from 51 million rupees year-over-year, representing a 120% increase. Revenue grew significantly to 1.56 billion rupees compared to 883 million rupees in the previous year, marking a 77% jump. EBITDA rose to 70 million rupees from 58 million rupees year-over-year. However, EBITDA margin contracted to 4.49% from 6.51% in the same period last year, indicating pressure on profitability despite higher absolute earnings.",
            "Sentiment": "positive",
            "PublishDate": 1755187529904,
            "Source": "earnings"
        },
        {
            "Title": "Jyoti Structures Secures New Contracts Worth ₹639 Crores",
            "Summary": "Jyoti Structures has secured new contracts valued at ₹639 crores. The company announced this contract win, which represents a significant business development for the organization.",
            "Sentiment": "positive",
            "PublishDate": 1754883883241,
            "Source": "stock"
        },
        {
            "Title": "Jyoti Structures Seeks NCLT Help to Stop WBSEDCL from Collecting Pre-CIRP Dues",
            "Summary": "Jyoti Structures has approached the National Company Law Tribunal (NCLT) for assistance in preventing the West Bengal State Electricity Distribution Company Limited (WBSEDCL) from collecting dues that predate the Corporate Insolvency Resolution Process (CIRP). This action suggests that Jyoti Structures is seeking legal protection against claims for payments that may have been incurred before the company entered insolvency proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1751895494000,
            "Source": "default"
        },
        {
            "Title": "Jyoti Structures Reports Q4 Financial Results",
            "Summary": "Jyoti Structures has released its Q4 financial results. The company's EBITDA increased to 130 million rupees from 66 million rupees year-over-year. The EBITDA margin improved to 7.88% from 5.12% in the same period last year. The consolidated net profit for Q4 was 119 million rupees, compared to 141 million rupees year-over-year and 115 million rupees quarter-on-quarter. Q4 revenue stood at 1.6 billion rupees, up from 1.3 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748442896000,
            "Source": "result"
        },
        {
            "Title": "Ashish Kacholia Increases Stake in Jyoti Structures",
            "Summary": "Investor Ashish Kacholia has increased his stake in Jyoti Structures by 0.04% during the fourth quarter of the fiscal year. This minor change in ownership reflects ongoing investor interest in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1744117312000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Jyoti Structures Reports Strong Order Book of Over Rs. 1,800 Crore",
            "Summary": "Jyoti Structures has announced that based on current orders, the company's carry forward order book will be approximately over Rs. 1,800 crore. The majority of these orders are expected to be executed within the next 12 to 18 months.",
            "Sentiment": "positive",
            "PublishDate": 1742360820000,
            "Source": "order&deals"
        },
        {
            "Title": "Jyoti Structures Secures ₹3.89 Billion Order from Adani Energy",
            "Summary": "Jyoti Structures has received a significant order worth ₹3.89 billion (approximately $47 million) from Adani Energy. This order represents a major business opportunity for Jyoti Structures and demonstrates Adani Energy's continued investment in infrastructure projects.",
            "Sentiment": "positive",
            "PublishDate": 1740463641000,
            "Source": "order&deals"
        },
        {
            "Title": "Jyoti Structures Plans to Restart Raipur Tower Manufacturing Unit",
            "Summary": "Jyoti Structures is preparing plans to restart its third tower manufacturing unit located in Raipur. The unit has an annual manufacturing capacity of 40,000 MT. The company is keeping implementation plans ready, indicating a potential increase in production capacity in the near future.",
            "Sentiment": "positive",
            "PublishDate": 1740112006000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jyoti Structures to Restart Second Tower Unit in Nasik",
            "Summary": "Jyoti Structures has announced plans to restart its second tower unit located in Nasik by the end of March. This move indicates a potential expansion or resumption of operations for the company in the manufacturing of tower structures.",
            "Sentiment": "positive",
            "PublishDate": 1740111947000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jyoti Structures Initiates One-Time Settlement Negotiations with Lender",
            "Summary": "Jyoti Structures has authorized and approved discussions and negotiations to finalize a potential one-time settlement with an unspecified lender. This move suggests the company is taking steps to address its financial obligations and potentially restructure its debt.",
            "Sentiment": "neutral",
            "PublishDate": 1739855654000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jyoti Structures Reports Significant Revenue Growth in Q3",
            "Summary": "Jyoti Structures has reported a substantial increase in its third-quarter revenue. The company's revenue for Q3 reached 1.37 billion rupees, compared to 558 million rupees in the same period last year, marking a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738573611000,
            "Source": "earnings"
        },
        {
            "Title": "Jyoti Structures Reports Profitable Q3 EBITDA",
            "Summary": "Jyoti Structures has reported a significant turnaround in its third-quarter financial performance. The company achieved an EBITDA profit of 120 million rupees, compared to a loss of 40 million rupees in the same quarter of the previous year. Additionally, the company's EBITDA margin for the quarter stood at 8.76%.",
            "Sentiment": "positive",
            "PublishDate": 1738573598000,
            "Source": "earnings"
        },
        {
            "Title": "Jyoti Structures Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Jyoti Structures has reported a substantial year-over-year increase in its consolidated net profit for the third quarter. The company's net profit rose to 112 million rupees, up from 11 million rupees in the same period last year, marking a tenfold increase.",
            "Sentiment": "positive",
            "PublishDate": 1738573559000,
            "Source": "earnings"
        },
        {
            "Title": "Jyoti Structures Secures 7.41 Billion Rupee Contract from Powergrid Corporation of India",
            "Summary": "Jyoti Structures has been awarded a significant work order from Powergrid Corporation of India. The project value is reported to be 7.41 billion rupees, representing a major contract for the company in the power infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1737678143000,
            "Source": "order&deals"
        },
        {
            "Title": "Jyoti Structures Secures 7.41 Billion Rupee Project from PowerGrid Corporation of India",
            "Summary": "Jyoti Structures has been awarded a significant project by PowerGrid Corporation of India. The project is valued at 7.41 billion rupees, marking a substantial business opportunity for the company.",
            "Sentiment": "positive",
            "PublishDate": 1737646281000,
            "Source": "order&deals"
        },
        {
            "Title": "Jyoti Structures Secures 33 Crore Rupee Order",
            "Summary": "Jyoti Structures Limited has won a new order worth 33 crore rupees. The company, which has a market capitalization of 232 crore rupees, has not provided further details about the nature or scope of the order.",
            "Sentiment": "positive",
            "PublishDate": 1734672971000,
            "Source": "order&deals"
        },
        {
            "Title": "Jyoti Structures Approves Rights Issue to Raise ₹500 Crore",
            "Summary": "Jyoti Structures has announced approval for a fund-raising initiative through a rights issue of equity shares. The company aims to raise an aggregate amount of up to ₹500 crore through this corporate action.",
            "Sentiment": "positive",
            "PublishDate": 1732492589000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jyoti Structures Approves Rights Issue to Raise Up to Rs. 500 Crores",
            "Summary": "Jyoti Structures has announced approval for a fund-raising initiative through a rights issue of equity shares. The company aims to raise an aggregate amount of up to Rs. 500 crores through this corporate action.",
            "Sentiment": "positive",
            "PublishDate": 1732275587000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jyoti Structures to Consider Fund Raising in Upcoming Board Meeting",
            "Summary": "Jyoti Structures has announced a board meeting scheduled for November 22 to discuss and consider options for raising funds. This indicates that the company may be looking to strengthen its financial position or fund potential growth initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1731931114000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jyoti Structures Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Jyoti Structures has reported a decrease in its Q2 EBITDA, which fell to 69 million rupees from 103 million rupees in the same quarter last year. The company's EBITDA margin also declined, dropping to 6.43% from 12.64% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730902198000,
            "Source": "result"
        },
        {
            "Title": "Jyoti Structures Reports Q2 FY24 Financial Results",
            "Summary": "Jyoti Structures announced its Q2 FY24 financial results. The company reported a consolidated net profit of 71 million rupees, down from 112 million rupees year-over-year and 51 million rupees quarter-over-quarter. Revenue for the quarter increased to 1.1 billion rupees, up from 815 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730902130000,
            "Source": "result"
        },
        {
            "Title": "Jyoti Structures Secures 149.4 Million Rupee Switchgear Order",
            "Summary": "Jyoti Structures Limited has announced that its Switchgear Division has received an order worth 149.4 million rupees. This order represents a significant business development for the company's switchgear segment.",
            "Sentiment": "positive",
            "PublishDate": 1730805048000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jyoti Structures: Secures ₹450 Crore Transmission Line Order from Adani",
            "Summary": "Jyoti Structures received a ₹450 crore order from Adani Energy Solutions for a transmission line project in Gujarat, to be completed by April 2026. The company's shares rose 5% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1729659612000,
            "Source": "normal_news"
        },
        {
            "Title": "Jyoti Structures Secures 450 Crore Rupee Contract from Adani Energy Solutions",
            "Summary": "Jyoti Structures has received a Letter of Acceptance from Adani Energy Solutions Limited for a project valued at 450 crore rupees. This represents a significant business opportunity for Jyoti Structures in the energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1729657721000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jyoti Structures Allots Warrants to Bengal Finance & Investments",
            "Summary": "Jyoti Structures has allotted 1.8 crore warrants to Bengal Finance & Investments, a company owned by Ashish Kacholia, at a price of 13.2 rupees per warrant.",
            "Sentiment": "positive",
            "PublishDate": 1729071232000,
            "Source": "corporate_action"
        },
        {
            "Title": "Jyoti Structures: Ashish Kacholia Acquires 2.52% Stake",
            "Summary": "<p><span class='positive'>Ace investor</span> Ashish Kacholia has <span class='positive'>purchased</span> a <b>2.52% stake</b> (approximately 2.2 crore shares) in Jyoti Structures, as per the June 2024 quarter shareholding pattern. Following this news, the stock <span class='positive'>closed 4.8% higher</span> at <b>Rs 26.75</b> on BSE. The company's market capitalization stands at <b>Rs 2,338.90 crore</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728304658000,
            "Source": "block_deals"
        },
        {
            "Title": "Ashish Kacholia Acquires 2.52% Stake in Jyoti Structures",
            "Summary": "<p><span class='positive'>Investor</span> <b>Ashish Kacholia</b> has emerged as a <span class='positive'>significant shareholder</span> in <b>Jyoti Structures</b>, holding a <span class='neutral'>2.52% stake</span> in the company as of the <span class='neutral'>second quarter</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728292755000,
            "Source": "normal_news"
        }
    ]
}