{
    "Symbol": "KABRAEXTRU",
    "ISIN": "INE900B01029",
    "News": [
        {
            "Title": "Kabra Extrusiontechnik Board Meet Set for Jan 29",
            "Summary": "Kabra Extrusiontechnik Limited has scheduled its board meeting for January 29, 2026, to approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769169089972,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kabra Extrusiontechnik Receives GST Notice for Rs 1.66 Crore Tax and Penalty",
            "Summary": "Kabra Extrusiontechnik Limited has received a notice under Section 130 of the Goods and Service Tax Act, 2017 from the Office of the Deputy Commissioner, Ghaziabad, Uttar Pradesh for tax and penalty amounting to Rs 1,65,73,048. The company received the notice on November 10, 2025. Kabra Extrusiontechnik stated it is examining the notice and will take suitable legal steps to challenge it, expecting a favorable outcome. The company indicated there is no financial implication other than the mentioned amount and it does not have material impact on operations or financial position.",
            "Sentiment": "negative",
            "PublishDate": 1762807639910,
            "Source": "stock"
        },
        {
            "Title": "Kabra Extrusiontechnik Reports 50.8% QoQ Revenue Growth to ₹1,358 Mn in Q2",
            "Summary": "Kabra Extrusiontechnik Ltd. reported operating revenues of ₹1,346 million in Q2, representing a 56.6% quarter-over-quarter growth. The Extrusion Machinery division contributed ₹887 million with 48.0% QoQ growth, while the Geon division (formerly Battrixx) generated ₹470 million with 56.3% QoQ growth. EBITDA improved to ₹90 million from negative ₹30 million in the previous quarter. Profit After Tax reached ₹3 million compared to a loss of ₹76 million in Q1. Chairman Managing Director Anand Kabra noted strong performance from both divisions but highlighted challenges in export demand due to global macroeconomic factors and rising tariffs. Domestic demand faces temporary moderation due to extended monsoon and delayed government spending. The Geon division showed exceptional growth driven by battery pack sales, E-3Wheeler batteries, electric commercial vehicle batteries, and Battery Energy Storage Systems. Geon is expanding into the B2C market with lithium-ion inverter batteries and is currently in an investment phase to enhance R&D capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1762470263734,
            "Source": "earnings"
        },
        {
            "Title": "Kabra Extrusiontechnik Reports Net Loss of Rs 96.3 Crores in Q2 FY26",
            "Summary": "Kabra Extrusiontechnik Limited reported a net loss of Rs 96.3 crores for the quarter ended September 30, 2025, compared to a net loss of Rs 157.24 crores in the previous quarter. For the half-year period, the company's net loss stood at Rs 587.55 crores versus Rs 150.86 crores in the same period last year. Revenue from operations declined to Rs 548.58 crores in Q2 from Rs 661.28 crores in the previous quarter. The company operates in two business segments: Extrusion Machinery and Battery Division. Total expenses for the quarter were Rs 135.44 crores. The Board of Directors approved these unaudited financial results in their meeting held on November 6, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762456686511,
            "Source": "earnings"
        },
        {
            "Title": "Kabra Extrusion Technik Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Kabra Extrusion Technik reported quarterly results showing revenue growth to 1.35 billion rupees from 1.28 billion rupees year-over-year. However, net profit declined to 10 million rupees from 12.7 million rupees in the same period last year. EBITDA dropped significantly to 96 million rupees from 225 million rupees year-over-year, while EBITDA margin compressed to 7.13% from 17.55% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762431717322,
            "Source": "earnings"
        },
        {
            "Title": "Ekta Kabra Increases Stake in Kabra Extrustiontechnik Limited Through Open Market Purchase",
            "Summary": "Ekta Kabra, a promoter of Kabra Extrustiontechnik Limited, acquired 1,00,000 shares through open market purchase on September 19, 2025. Her shareholding increased from 31,67,600 shares (9.06%) to 32,67,600 shares (9.35%). The combined holding of Ekta Kabra and persons acting in concert rose from 60.21% to 60.50% of the company's total equity share capital of 3,49,72,836 shares of Rs. 5 each. The promoter group includes family members and related entities such as Anand S. Kabra (18.20% stake), Kolsite Corporation LLP (10.89% stake), and Shreevallabh Kabra Family Trust (8.71% stake).",
            "Sentiment": "neutral",
            "PublishDate": 1758524599356,
            "Source": "corporate_action"
        },
        {
            "Title": "Kabra Extrusiontechnik Approves New Director Appointments and Chairman Emeritus Position Through Postal Ballot",
            "Summary": "Kabra Extrusiontechnik Limited shareholders approved multiple resolutions through postal ballot on September 11, 2025. The company appointed Mr. Bajrang Lal Bagra as Non-Executive Non-Independent Director for five years effective August 7, 2025, and Mr. Munjal Kapadia as Non-Executive Independent Director effective September 15, 2025. Mr. Shreevallabh Kabra, the founder and Executive Chairman of the company, was designated as Chairman Emeritus. Bagra holds a Master's degree in Commerce and is an ICAI fellow with over 30 years of management experience across diverse industries. Kapadia, aged 47, brings nearly three decades of experience in plastic processing and rigid polymer packaging, serving as Managing Director of Manika Plastech Limited. The company also amended its Articles of Association to create the Chairman Emeritus position, which allows the holder to provide guidance and mentorship while attending board meetings as an invitee without voting rights. The position can be held for life or until resignation, with the board authorized to provide compensation and facilities for services rendered.",
            "Sentiment": "positive",
            "PublishDate": 1757691972233,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kabra Extrusiontechnik Seeks Shareholder Approval for Director Appointments and Chairman Emeritus Position",
            "Summary": "Kabra Extrusiontechnik Ltd has issued a postal ballot notice seeking shareholder approval for four key resolutions. The company proposes to appoint Bajrang Lal Bagra as Non-Executive Non-Independent Director and Munjal Kapadia as Non-Executive Independent Director for a five-year term from August 2025 to August 2030. The company also seeks to amend its Articles of Association to include provisions for appointing a Chairman Emeritus and proposes to appoint founder Shreevallabh Kabra to this new advisory role for five years starting September 2025, with annual compensation of Rs. 1 crore plus perquisites. The e-voting period runs from August 13 to September 11, 2025, with results to be announced within two working days. Shreevallabh Kabra will step down from his Executive Director and Chairperson positions on September 15, 2025, as part of succession planning.",
            "Sentiment": "neutral",
            "PublishDate": 1754978699340,
            "Source": "corporate_action"
        },
        {
            "Title": "Kabra Extrusiontechnik Appoints New Independent Director, Executive Director to Step Down",
            "Summary": "Kabra Extrusiontechnik Limited's Board of Directors approved the appointment of Mr. Munjal Kapadia as Additional Director in the capacity of Independent, Non-Executive Director effective August 7, 2025. Mr. Kapadia, aged 47, brings nearly three decades of experience in plastic processing and rigid polymer packaging industry and serves as Managing Director of Manika Plastech Limited. The Board also approved Mr. Shreevallabh Kabra's resignation from Executive Director position effective September 15, 2025, due to advancing age. Mr. Kabra, the Founder of Kolsite Group and Executive Chairman with over five decades of experience in plastics extrusion, will assume the honorary title of Chairman Emeritus in an advisory capacity. The Board approved amendments to Articles of Association to include the Chairman Emeritus clause, subject to shareholder approval. Mr. Kapadia's five-year appointment and Mr. Kabra's new role both require shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1754549404916,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kabra Extrusiontechnik Reports Loss in Q1 FY2026, Announces Leadership Changes and New Appointments",
            "Summary": "Kabra Extrusiontechnik Limited reported a standalone net loss of ₹683.93 lakhs for the quarter ended June 30, 2025, compared to a profit of ₹256.24 lakhs in the same period last year. Revenue from operations declined to ₹8,596.68 lakhs from ₹8,820.21 lakhs year-over-year. The company announced significant leadership changes with Shreevallabh Kabra resigning as Chairman while continuing as Director, Anand Kabra being re-designated from Vice-Chairman and Managing Director to Chairman and Managing Director, and Ekta Kabra moving from Managing Director to Vice-Chairman and Managing Director. The board appointed new internal auditors for both divisions - KRSN & Associates for the Extrusion Division and Pravin N Jain & Associates for the GEON Division. Additionally, Subharata Ghosh was appointed as Chief Operating Officer, and Bajrang Lal Bagra will transition from Independent Director to Non-Executive Non-Independent Director subject to shareholder approval. The company operates in two segments: Extrusion Machinery Division and Battery Division, with the Battery Division reporting a segment loss of ₹820 lakhs during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754046667637,
            "Source": "earnings"
        },
        {
            "Title": "Kabra Extrusiontechnik's Geon Launches Inverter Battery Line for Home Backup",
            "Summary": "Kabra Extrusiontechnik has announced that its brand Geon has launched a new inverter battery line for home backup solutions. This move marks the company's first entry into the Business-to-Consumer (B2C) market segment.",
            "Sentiment": "positive",
            "PublishDate": 1751954496000,
            "Source": "default"
        },
        {
            "Title": "Kabra Extrusiontechnik Recommends Dividend of 2.5 Rupees per Share",
            "Summary": "Kabra Extrusiontechnik has recommended a dividend of 2.5 rupees per equity share. No additional details about the dividend, such as the fiscal year or record date, were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747403895000,
            "Source": "result"
        },
        {
            "Title": "Kabra Extrusiontechnik Reports Q4 Financial Results",
            "Summary": "Kabra Extrusiontechnik has reported its Q4 financial results. The company's EBITDA decreased to 54 million rupees from 279 million rupees year-over-year. The EBITDA margin fell to 3.9% from 16.61% year-over-year. Net profit for Q4 was 120 million rupees, down from 171.2 million rupees year-over-year but up from 66 million rupees quarter-over-quarter. Q4 revenue was 1.4 billion rupees, compared to 1.68 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1747403848000,
            "Source": "result"
        },
        {
            "Title": "Kabra Extrusiontechnik Reports Q3 Financial Results",
            "Summary": "Kabra Extrusiontechnik has announced its Q3 financial results. The company's net profit increased to 66 million rupees, up from 33 million rupees in the same quarter last year. However, this represents a decrease from the previous quarter's net profit of 127 million rupees. Revenue for Q3 stood at 1.2 billion rupees, slightly down from 1.24 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738628030000,
            "Source": "earnings"
        },
        {
            "Title": "Kabra Extrusiontechnik Reports Significant Increase in Q3 EBITDA and Margin",
            "Summary": "Kabra Extrusiontechnik has reported a substantial year-over-year improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) rose to 149 million rupees, compared to 88 million rupees in the same period last year. Additionally, the EBITDA margin expanded to 12.27% from 7.15% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1738583706000,
            "Source": "earnings"
        },
        {
            "Title": "Kabra Extrusiontechnik Reports Q3 Financial Results",
            "Summary": "Kabra Extrusiontechnik has announced its Q3 financial results. The company's net profit doubled year-over-year to 66 million rupees, compared to 33 million rupees in the same quarter last year. However, it decreased quarter-over-quarter from 127 million rupees. Revenue for Q3 stood at 1.2 billion rupees, slightly down from 1.24 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1738583655000,
            "Source": "earnings"
        },
        {
            "Title": "Kabra Extrusiontechnik Reports Q2 Revenue Decline",
            "Summary": "Kabra Extrusiontechnik, an Indian manufacturing company, has reported its second quarter revenue for the current fiscal year. The company's revenue stood at 1.3 billion rupees, showing a significant decrease from 1.82 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1729676440000,
            "Source": "result"
        },
        {
            "Title": "Kabra Extrusiontechnik Reports Strong Q2 Financial Performance",
            "Summary": "Kabra Extrusiontechnik has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 114 million rupees to 225 million rupees. Additionally, the EBITDA margin expanded from 6.27% to 17.6%, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1729676436000,
            "Source": "result"
        },
        {
            "Title": "Kabra Extrusiontechnik Reports Significant Profit Growth in Q2",
            "Summary": "Kabra Extrusiontechnik has announced its Q2 financial results, reporting a net profit of 127 million rupees. This represents a substantial increase from the 57 million rupees reported in the same quarter of the previous year, indicating a year-over-year growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1729676397000,
            "Source": "result"
        }
    ]
}