{
    "Symbol": "KAJARIACER",
    "ISIN": "INE217B01036",
    "News": [
        {
            "Title": "Kajaria Ceramics Appoints New Chief HR Officer",
            "Summary": "Kajaria Ceramics Limited announces appointment of Ashish Goel as Chief Human Resources Officer effective February 13, 2026, while Praveen Prakash steps down from senior management role.",
            "Sentiment": "neutral",
            "PublishDate": 1770890488078,
            "Source": "stocks"
        },
        {
            "Title": "Kajaria Ceramics Seeks Shareholder Approval for New Directors",
            "Summary": "Kajaria Ceramics Limited has issued a postal ballot notice dated January 30, 2026, seeking member approval for the appointment of two independent directors through e-voting from February 11 to March 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770704084020,
            "Source": "stocks"
        },
        {
            "Title": "Kajaria Ceramics Q3 Revenue Rises to ₹11.68B",
            "Summary": "Kajaria Ceramics reports Q3 revenue of ₹11.68 billion compared to ₹11.55 billion in the previous year, marking a modest year-on-year growth for the ceramics manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1769769015352,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kajaria Ceramics Q3FY26 earnings call on Jan 30",
            "Summary": "Kajaria Ceramics has scheduled its Q3FY26 earnings conference call for January 30, 2026, at 5:00 PM IST to discuss quarterly results and financial performance with investors.",
            "Sentiment": "neutral",
            "PublishDate": 1769248528010,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kajaria Ceramics Reports Physical Share Transfer Status",
            "Summary": "Kajaria Ceramics submitted compliance report to stock exchanges showing one physical share transfer request was received and processed during December 2025-January 2026 period under SEBI's special window.",
            "Sentiment": "neutral",
            "PublishDate": 1767787741522,
            "Source": "stocks"
        },
        {
            "Title": "Kajaria Ceramics Addresses ₹20 Cr Fraud in Subsidiary",
            "Summary": "Kajaria Ceramics disclosed a ₹20 crore fraud at subsidiary Kerovit Global involving fake vendor payments by CFO. Company implements stricter controls under Operation Manthan while achieving ₹150 crore annual cost savings.",
            "Sentiment": "negative",
            "PublishDate": 1766824603956,
            "Source": "stocks"
        },
        {
            "Title": "Kajaria Ceramics Shares Conference Call Recording",
            "Summary": "Kajaria Ceramics uploaded audio recording of December 22, 2025 investor conference call discussing ₹200 crore fraud case at subsidiary KBPL, available on company website.",
            "Sentiment": "neutral",
            "PublishDate": 1766150793217,
            "Source": "stocks"
        },
        {
            "Title": "Kajaria Ceramics COO Marketing Retires Dec 19",
            "Summary": "Kajaria Ceramics announces retirement of Mr. Bhupendra G. Vyas, COO (Marketing), effective December 19, 2025, as part of senior management changes under regulatory disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1766137758621,
            "Source": "stocks"
        },
        {
            "Title": "Kajaria Ceramics Appoints Two Independent Directors",
            "Summary": "Kajaria Ceramics Limited has appointed Mr. Hitesh Sohanlal Jain and Mr. Pradeep Udhas as Additional Non-executive Independent Directors for five-year terms effective December 19, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766045707426,
            "Source": "stocks"
        },
        {
            "Title": "Kajaria Ceramics Seeks Shareholder Approval for Leadership Restructuring Through Postal Ballot",
            "Summary": "Kajaria Ceramics is conducting a postal ballot from November 16 to December 15, 2025, seeking shareholder approval for re-designating Ashok Kajaria as Chairman, Chetan Kajaria as Vice Chairman, and Rishi Kajaria as Managing Director for 5-year terms from October 1, 2025 to September 30, 2030. The leadership restructuring involves executive directors receiving remuneration up to 5% of net profits each, with voting results to be announced by December 16, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763192724188,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kajaria Ceramics Reports 58% PAT Growth Despite Flat Revenue in Q2 FY26, Achieves 17.94% EBITDA Margin",
            "Summary": "Kajaria Ceramics posted consolidated revenue of INR 1,186 crores in Q2 FY26, showing marginal 1% year-on-year growth. The company achieved significant margin expansion with EBITDA improving to 17.94%, up 447 basis points year-on-year and 122 basis points sequentially. PAT surged 58% to INR 133 crores compared to INR 84 crores in Q2 FY25. The tiles segment remained flat at INR 1,051 crores, while bathware segment grew 14% to INR 102 crores and adhesives revenue increased to INR 32 crores from INR 18 crores. The company is undergoing organizational transformation including sales unification, cost optimization initiatives, and strategic restructuring. Management implemented cost-saving measures including packaging reengineering saving INR 30-35 crores annually, reduced workforce by 250 people, and optimized procurement processes. Working capital days improved to 56 days from 58 days. The company appointed management consultants to enhance market share and established a new team to engage architects and influencers. Management expects volume growth in the second half and maintains a retail-to-project mix of approximately 70:30.",
            "Sentiment": "positive",
            "PublishDate": 1761121252891,
            "Source": "earnings"
        },
        {
            "Title": "Kajaria Ceramics Maintains 40-50% Profit Distribution Policy, Projects INR 18,000 Crore Export Industry Revenue",
            "Summary": "Kajaria Ceramics has maintained its dividend policy of distributing 40-50% of profits to shareholders. The company expects the export industry revenue to reach approximately INR 18,000 crores this year.",
            "Sentiment": "positive",
            "PublishDate": 1760673069583,
            "Source": "stock"
        },
        {
            "Title": "Kajaria Ceramics Reports Q2 FY26 Results, Declares Rs 8 Interim Dividend",
            "Summary": "Kajaria Ceramics Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 1,079.09 crores for the quarter, with profit after tax of Rs 120.72 crores. For the half-year period, standalone revenue reached Rs 2,141.58 crores with profit after tax of Rs 241.59 crores. On a consolidated basis, quarterly revenue from operations stood at Rs 1,186.01 crores with profit of Rs 133.98 crores, while half-year consolidated revenue was Rs 2,288.75 crores with profit of Rs 244.29 crores. The Board approved an interim dividend of Rs 8 per equity share for financial year 2025-26, with record date set for October 24, 2025, and payment by November 14, 2025. The company also granted 1,35,000 stock options to eligible employees under the ESOP Scheme 2015 at an exercise price of Rs 800 per share.",
            "Sentiment": "positive",
            "PublishDate": 1760603193153,
            "Source": "corporate_action"
        },
        {
            "Title": "Kajaria Ceramics Announces Leadership Transition with Founder Becoming Chairman",
            "Summary": "Kajaria Ceramics announced a leadership reshuffle with founder Ashok Kajaria, 78, being redesignated as Chairman under the whole-time director category for five years from October 1, 2025. The Board approved appointments of his sons Chetan Kajaria as Vice Chairman and Rishi Kajaria as Managing Director for the same term. All appointments require shareholder approval. Chetan Kajaria, who holds degrees in Petrochemical Engineering and an MBA, has served as Joint Managing Director for over a decade since joining in 2000. The Board also approved increasing investment in subsidiary Kajaria Adhesive Private Limited from Rs 16 crore to Rs 23 crore, with an additional Rs 6 crore for working capital support.",
            "Sentiment": "positive",
            "PublishDate": 1759132898112,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kajaria Ceramics Clarifies Media Report on Independent Director, States No Company Impact",
            "Summary": "Kajaria Ceramics has issued a clarification regarding a media report about an independent director. The company has confirmed that there is no impact on the company from this matter.",
            "Sentiment": "neutral",
            "PublishDate": 1755098083795,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kajaria Ceramics Sees Rs. 86.89 Crore Block Trade on NSE",
            "Summary": "Kajaria Ceramics executed a block trade worth Rs. 86.89 crores on the National Stock Exchange. The transaction involved approximately 743,065 shares at a price of Rs. 1,169.30 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1753764387248,
            "Source": "order&deals"
        },
        {
            "Title": "Kajaria Ceramics Reports Margin Expansion Despite Revenue Decline in Q1 FY26",
            "Summary": "Kajaria Ceramics reported consolidated revenue of INR 1,104 crores for Q1 FY26, marking a 1% year-on-year decline due to low tiles volume growth and closure of the plywood division. However, EBITDA margins improved significantly to 16.72% from 15% in Q1 FY25. The company is implementing a major organizational restructuring by unifying its three separate tile divisions (ceramic, PVT, and GVT) into one integrated operation to optimize costs and improve efficiency. This consolidation involves combining sales teams and distribution networks that previously operated separately. Management announced that promoters have foregone their salaries (previously INR 17 crores annually) until the company achieves a run rate of INR 1,000 crores EBITDA. The adhesives division is expected to grow from INR 75 crores to INR 120 crores this year, while the Bathware division targets INR 480 crores from INR 400 crores previously. The company expects minimal capex of INR 100-150 crores this year with no new capacity additions planned.",
            "Sentiment": "neutral",
            "PublishDate": 1753430648583,
            "Source": "earnings"
        },
        {
            "Title": "Kajaria Ceramics Reports Improved Q1 Margins, Projects Revenue Growth in Bathware and Adhesives",
            "Summary": "Kajaria Ceramics reported better Q1 gross margins driven by improved sales prices and reduced raw material costs. The company has not provided exact margin guidance, stating that margins depend on selling prices, gas prices, and costs. Kajaria projects bathware revenue at Rs. 480 crore, up from Rs. 400 crore last year, and adhesives revenue to reach Rs. 120 crore, up from Rs. 75 crore last year. The company plans to boost growth by utilizing existing inventory and capacity rather than expanding production capacity.",
            "Sentiment": "positive",
            "PublishDate": 1753241655567,
            "Source": "stock"
        },
        {
            "Title": "Kajaria Ceramics Reports 1% Revenue Decline to ₹1,104 Crores in Q1 FY26, Margins Improve to 16.72%",
            "Summary": "Kajaria Ceramics Limited reported consolidated revenue of ₹1,104 crores for Q1 FY26, marking a 1% year-on-year decline from ₹1,114 crores in Q1 FY25. The decline was attributed to low growth in tiles volume and reduced plywood sales due to division closure. However, EBITDA margins improved significantly to 16.72% from 15% in the previous year quarter, driven by cost reduction initiatives and human resource optimization. Profit after tax increased 21% to ₹109 crores from ₹90 crores. The company operates with annual tile capacity of 90.50 million square meters across nine plants and maintains its position as India's largest ceramic/vitrified tiles manufacturer. Net debt position improved to ₹515 crores as of June 2025. The company reopened its trading window 48 hours after announcing quarterly results on July 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753175969197,
            "Source": "corporate_action"
        },
        {
            "Title": "Kajaria Ceramics Reports Growth in Q1 Revenue and Profitability",
            "Summary": "Kajaria Ceramics reported Q1 revenue of 11 billion rupees compared to 10.9 billion rupees in the same period last year. The company's consolidated net profit increased to 1.09 billion rupees from 900 million rupees year-over-year. EBITDA rose to 1.97 billion rupees from 1.7 billion rupees, while EBITDA margin improved to 17.85% from 15.60% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753174624499,
            "Source": "earnings"
        },
        {
            "Title": "Kajaria Ceramics Starts Commercial Production at Tijara Facility",
            "Summary": "Kajaria Ceramics has announced that its Tijara facility has begun commercial production. No further details about the facility's capacity, products, or impact on the company's operations were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1748605497000,
            "Source": "default"
        },
        {
            "Title": "Kajaria Ceramics: Q4 Profit Plunges 59% Amid Weak Demand",
            "Summary": "Kajaria Ceramics reported a 59% drop in Q4 net profit to ₹43 crore, impacted by weak demand and losses from discontinued plywood operations. Revenue rose marginally by 1.1% to ₹1,222 crore. EBITDA declined 20% with margins narrowing to 11.3%. The company maintains a healthy balance sheet with net cash of ₹424 crore.",
            "Sentiment": "negative",
            "PublishDate": 1746525113000,
            "Source": "earnings"
        },
        {
            "Title": "Kajaria Ceramics Reports Q4 Results and Strategic Changes",
            "Summary": "Kajaria Ceramics has withdrawn its 300 million rupees investment proposal in Kajaria Ultima and discontinued operations of Kajaria Plywood. The company has also reduced production capacity at its Sikandrabad plant to 8.80 MS. In Q4, Kajaria Ceramics reported an EBITDA of 1.3 billion rupees, down from 1.73 billion rupees year-over-year. The Q4 EBITDA margin decreased to 11.32% from 13.94% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1746520891000,
            "Source": "result"
        },
        {
            "Title": "Kajaria Ceramics Reports Q4 Financial Results and Dividend Declaration",
            "Summary": "Kajaria Ceramics announced its Q4 financial results. Revenue slightly increased to 12.2B rupees from 12.1B year-over-year. However, the company reported a consolidated net loss of 549M rupees compared to a profit of 950M in the same period last year. Despite the loss, Kajaria Ceramics declared a dividend of 4 rupees per share.",
            "Sentiment": "negative",
            "PublishDate": 1746520716000,
            "Source": "result"
        },
        {
            "Title": "Kajaria Ceramics to Consider Q4 Results on May 6",
            "Summary": "Kajaria Ceramics has announced that it will consider its fourth quarter (Q4) financial results on May 6. This indicates the company is preparing to release its latest earnings report, which will provide insights into its financial performance for the most recent quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745585505000,
            "Source": "default"
        },
        {
            "Title": "Kajaria Ceramics Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade of approximately 437,321 shares of Kajaria Ceramics Ltd. occurred on the National Stock Exchange (NSE) at a price of Rs. 795.75 per share. The total value of the transaction amounted to Rs. 34.80 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1744784431000,
            "Source": "block_details"
        },
        {
            "Title": "Kajaria Ceramics Acquires 75% Stake in Kajaria Adhesive",
            "Summary": "Kajaria Ceramics has acquired a 75% ownership stake in Kajaria Adhesive. This acquisition represents a significant corporate action, potentially expanding Kajaria Ceramics' product portfolio or market presence in the adhesives sector.",
            "Sentiment": "positive",
            "PublishDate": 1739535787000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kajaria Ceramics Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Kajaria Ceramics, a leading ceramics company, has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter stood at 1.5 billion rupees, down from 1.78 billion rupees in the same quarter last year. The EBITDA margin also decreased to 12.80% from 15.52% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738657949000,
            "Source": "earnings"
        },
        {
            "Title": "Kajaria Ceramics Reports Q3 Revenue of 11.6 Billion Rupees",
            "Summary": "Kajaria Ceramics, a leading tile manufacturer in India, has announced its third-quarter revenue results. The company reported revenue of 11.6 billion rupees, showing a slight increase from 11.5 billion rupees in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1738657942000,
            "Source": "earnings"
        },
        {
            "Title": "Kajaria Ceramics Reports Decline in Q3 Net Profit",
            "Summary": "Kajaria Ceramics, a leading tile manufacturer, has reported a consolidated net profit of 790 million rupees for the third quarter, down from 1.08 billion rupees in the same period last year. This represents a significant year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1738657900000,
            "Source": "earnings"
        },
        {
            "Title": "Kajaria Ceramics Ltd. Experiences Significant Block Trade on NSE",
            "Summary": "A block trade of approximately 478,001 shares of Kajaria Ceramics Ltd. occurred on the National Stock Exchange (NSE) at a price of Rs. 1024.40 per share. The total value of this transaction amounted to Rs. 48.97 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1737531004000,
            "Source": "block_deals"
        },
        {
            "Title": "Kajaria Ceramics Maintains Three-Year Guidance Despite Current Muted Performance",
            "Summary": "Kajaria Ceramics has announced during a conference call that it is maintaining its overall three-year guidance, despite experiencing muted performance in the current year. The company expressed optimism for the future, indicating potential for improved growth in the coming year.",
            "Sentiment": "positive",
            "PublishDate": 1729653457000,
            "Source": "normal_news"
        },
        {
            "Title": "Kajaria Ceramics Provides EBITDA Guidance and Three-Year Vision",
            "Summary": "Kajaria Ceramics has provided EBITDA guidance of 15% to 17% for the current year, expecting to be at the lower end of this range. The company's three-year vision maintains the same EBITDA guidance of 15% to 17%, though exact margins for each year remain uncertain.",
            "Sentiment": "neutral",
            "PublishDate": 1729653450000,
            "Source": "normal_news"
        },
        {
            "Title": "Kajaria Ceramics Revises Margin Guidance and Volume Growth Projections",
            "Summary": "Kajaria Ceramics has updated its financial outlook during a recent conference call. The company now expects its margin to be at the lower end of the previously announced 15% to 17% range by year-end. Additionally, Kajaria Ceramics is projecting a 9% to 10% volume growth for the full year.",
            "Sentiment": "neutral",
            "PublishDate": 1729653428000,
            "Source": "result"
        },
        {
            "Title": "Kajaria Ceramics: Q2 Results Show Low Volume, Margins Expected to Recover by Q4",
            "Summary": "Kajaria Ceramics reported low volume in Q2 results. Margins are anticipated to gradually improve, with a recovery expected by Q4 according to Systematix analysis.",
            "Sentiment": "neutral",
            "PublishDate": 1729650790000,
            "Source": "result"
        },
        {
            "Title": "Kajaria Ceramics MD Optimistic About Tile Industry Demand",
            "Summary": "The Managing Director of Kajaria Ceramics has expressed a positive outlook for the tile industry's demand. The company anticipates that strong real estate demand will drive improved sales of tiles in the second half of the fiscal year 2025.",
            "Sentiment": "positive",
            "PublishDate": 1729588257000,
            "Source": "normal_news"
        },
        {
            "Title": "Kajaria Ceramics Announces Dividend",
            "Summary": "Kajaria Ceramics has declared a dividend of 5 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1729586848000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kajaria Ceramics Reports Q2 Revenue Growth",
            "Summary": "Kajaria Ceramics, a leading tile manufacturer, has reported a revenue of 11.8 billion rupees for the second quarter, compared to 11.2 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729586527000,
            "Source": "result"
        },
        {
            "Title": "Kajaria Ceramics Reports Q2 EBITDA Decline",
            "Summary": "Kajaria Ceramics experienced a year-over-year decrease in Q2 EBITDA, dropping from 1.79 billion rupees to 1.58 billion rupees. The company's EBITDA margin also declined, falling from 16.00% to 13.40% compared to the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1729586511000,
            "Source": "result"
        },
        {
            "Title": "Kajaria Ceramics Reports Q2 Net Profit Decline",
            "Summary": "Kajaria Ceramics, a leading tile manufacturer in India, has reported a consolidated net profit of 850 million rupees for the second quarter, down from 1.08 billion rupees in the same period last year. This represents a year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1729586434000,
            "Source": "result"
        },
        {
            "Title": "Kajaria Ceramics Ltd Block Trade on NSE",
            "Summary": "<p>A <span class='neutral'>block trade</span> of approximately <b>698,919</b> shares of <span class='neutral'>Kajaria Ceramics Ltd</span> was executed on the <span class='neutral'>National Stock Exchange (NSE)</span> for <b>Rs. 98.14 crores</b>. The trade was carried out at a price of <b>Rs. 1404.10</b> per share.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728545987000,
            "Source": "block_deals"
        }
    ]
}