{
    "Symbol": "KAKATCEM",
    "ISIN": "INE437B01014",
    "News": [
        {
            "Title": "Kakatiya Cement Posts Q3 FY26 Loss of ₹491.20 Lakhs",
            "Summary": "Kakatiya Cement Sugar & Industries reported a net loss of ₹491.20 lakhs for Q3 FY26, with revenue declining 24.47% YoY to ₹1,306.98 lakhs. Nine-month losses widened to ₹1,962.14 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1770367321699,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kakatiya Cement Board Meet Set for Feb 6, 2026",
            "Summary": "Kakatiya Cement Sugar & Industries schedules board meeting on February 6, 2026 to review Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769164716613,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kakatiya Cement Gets Warning Letters from NSE, BSE",
            "Summary": "Kakatiya Cement Sugar & Industries receives warning letters from NSE and BSE for non-compliance with SEBI LODR Regulation 18(2)(b) regarding audit committee quorum requirements.",
            "Sentiment": "negative",
            "PublishDate": 1767776073029,
            "Source": "stocks"
        },
        {
            "Title": "Kakatiya Cement Sugar Industries Reports Rs 414.86 Crore Loss in Q2 FY2025",
            "Summary": "Kakatiya Cement Sugar Industries Limited reported a net loss of Rs 414.86 crore for the quarter ended September 30, 2025, compared to a profit of Rs 6.91 crore in the same quarter last year. Total income from operations declined to Rs 254.06 crore from Rs 220.40 crore in the previous year quarter. The company's half-year performance showed a net loss of Rs 147.09 crore against a loss of Rs 8.49 crore in the corresponding period last year. The company operates in three segments: Cement (Rs 179.02 crore revenue), Sugar (Rs 75.04 crore revenue), and Power (no revenue reported). All three segments reported losses before tax and interest. The company settled a transmission charges dispute with TG TRANSCO by paying Rs 73.73 crore as principal amount, which was shown as an exceptional item. Earnings per share stood at negative Rs 14.78 for the quarter. The Board of Directors approved these results in a meeting held on November 3, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762160023612,
            "Source": "earnings"
        },
        {
            "Title": "Kakatiya Cement Receives Court-Backed Mining Permits for Limestone Extraction Until November 2025",
            "Summary": "Kakatiya Cement Sugar & Industries Limited obtained interim court orders from the High Court of Andhra Pradesh dated October 8, 2025, granting relief until November 19, 2025 in Writ Petition No. 26267 of 2025. Following these orders, the District Forest Officer of NTR Division, Vijayawada issued permits on October 21, 2025, allowing the company to continue mining operations and transport 69,000 metric tons of limestone from Jaggaipeta Reserve Forest mining lease area to its cement plant. The permits are valid until November 19, 2025. The company stated there is currently no financial and operational impact from these developments.",
            "Sentiment": "positive",
            "PublishDate": 1761210700629,
            "Source": "stock"
        },
        {
            "Title": "Kakatiya Cement Sugar & Industries Declares Rs. 3.00 Per Share Dividend for FY2025",
            "Summary": "Kakatiya Cement Sugar & Industries Limited announced a dividend of Rs. 3.00 per share for the financial year ending March 31, 2025. The dividend was approved at the company's 46th Annual General Meeting held on August 28, 2025. The dividend will be paid by September 27, 2025, to shareholders whose names appear on the register as of August 21, 2025. The company noted that final results will be communicated after e-voting results are scrutinized and the scrutinizer's report is received.",
            "Sentiment": "positive",
            "PublishDate": 1756368125752,
            "Source": "corporate_action"
        },
        {
            "Title": "Kakatiya Cement Sugar & Industries Reports Net Loss of Rs 322.28 Lacs in Q1",
            "Summary": "Kakatiya Cement Sugar & Industries Limited reported a net loss of Rs 322.28 lacs for the quarter ended June 30, 2025, compared to a loss of Rs 154.02 lacs in the same quarter last year. Revenue from operations stood at Rs 2,555.98 lacs, down from Rs 3,002.84 lacs in the corresponding quarter of the previous year. The company's cement segment generated Rs 1,985.72 lacs in sales while the sugar segment contributed Rs 570.26 lacs. Total expenses increased to Rs 3,080.90 lacs from Rs 3,572.33 lacs in the year-ago quarter. The company's earnings per share was negative at Rs 4.15 compared to negative Rs 1.98 in the same quarter last year. The board approved these unaudited financial results during a meeting held on August 11, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1754907825015,
            "Source": "earnings"
        },
        {
            "Title": "Kakatiya Cement Sugar & Industries Announces Book Closure and AGM for August 2025",
            "Summary": "Kakatiya Cement Sugar & Industries Limited has announced a book closure period from August 22, 2025 to August 28, 2025 for the Annual General Meeting and dividend payment. The company's register of members and share transfer books will remain closed during this period to determine eligible shareholders. The Annual General Meeting is scheduled for August 28, 2025. The book closure applies to equity shares with symbol KAKATCEM (BSE code 500234).",
            "Sentiment": "neutral",
            "PublishDate": 1753948381811,
            "Source": "corporate_action"
        },
        {
            "Title": "Kakatiya Cements Sugar & Industries Restarts Clinker Production",
            "Summary": "Kakatiya Cements Sugar & Industries has announced the resumption of its clinker production facility. The company cited favorable market conditions as the reason for restarting operations. This move suggests an improvement in demand or pricing for clinker, a key component in cement manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1745315776000,
            "Source": "default"
        },
        {
            "Title": "Kakatiya Cement Sugar & Industries Reports Q2 Financial Results",
            "Summary": "Kakatiya Cement Sugar & Industries has announced its Q2 financial results. The company's net profit decreased to 6.9 million rupees from 18 million rupees in the same quarter last year. Revenue also declined to 220 million rupees from 377 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731052350000,
            "Source": "result"
        }
    ]
}