{
    "Symbol": "KALAMANDIR",
    "ISIN": "INE438K01021",
    "News": [
        {
            "Title": "Sai Silks Q3FY26 Revenue Drops to ₹411.25 Crores",
            "Summary": "Sai Silks (Kalamandir) reported Q3FY26 revenue of ₹411.25 crores vs ₹448.5 crores last year due to festive calendar shift. 9-month revenue grew 16.1% to ₹1,234 crores with PAT rising 50% to ₹108 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1769491250222,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sai Silks Schedules Analyst Meet on Jan 30, 2026",
            "Summary": "Sai Silks (Kalamandir) Limited announces virtual one-to-one investor and analyst meeting scheduled for January 30, 2026, at 11:30 AM under SEBI LODR Regulation 30 compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1769067389748,
            "Source": "stocks"
        },
        {
            "Title": "Sai Silks Kalamandir Plans Maharashtra Expansion",
            "Summary": "Sai Silks Kalamandir announces strategic expansion into Maharashtra and Kerala markets while pausing Tamil Nadu growth to strengthen existing store networks and explore new retail formats.",
            "Sentiment": "positive",
            "PublishDate": 1768965074160,
            "Source": "stocks"
        },
        {
            "Title": "SAI Silks Projects 35% PAT Growth for FY2026",
            "Summary": "SAI Silks Kalamandir expects gross margins of 42-43% and EBITDA margins of 17-18% for FY2026, with aggressive store expansion plans targeting 65,000+ sq ft this year and 80,000-85,000 sq ft for FY2027.",
            "Sentiment": "positive",
            "PublishDate": 1768965041762,
            "Source": "co_actions_results"
        },
        {
            "Title": "SAI Silks Sets Ambitious Growth Targets for FY26-27",
            "Summary": "SAI Silks (Kalamandir) targets 15% Q4 FY26 revenue growth and 15-20% growth for FY27, aiming for ₹2,000 crores revenue through same-store sales growth and new store expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1768965010043,
            "Source": "stocks"
        },
        {
            "Title": "Sai Silks Q3FY26 Investor Presentation Filed",
            "Summary": "Sai Silks (Kalamandir) Limited files investor presentation for Q3FY26 under Regulation 30, showcasing 79 stores across South India with strong financial performance and expansion plans.",
            "Sentiment": "neutral",
            "PublishDate": 1768827181945,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sai Silks Q3FY26 Net Profit Drops 17% to ₹38.14 Cr",
            "Summary": "Sai Silks (Kalamandir) reported Q3FY26 net profit of ₹38.14 crores, down 17% YoY, while revenue declined 8.3% to ₹411.25 crores amid margin pressure and higher costs.",
            "Sentiment": "negative",
            "PublishDate": 1768818604431,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sai Silks Schedules Q3FY26 Results Call on Jan 20",
            "Summary": "Sai Silks (Kalamandir) Limited announces conference call on January 20, 2026 at 11:00 AM IST to discuss Q3FY26 unaudited results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768306308547,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sai Silks Expands Hosur Store by 3,996 Sq Ft",
            "Summary": "Sai Silks (Kalamandir) has expanded its Kanchipuram Varamahalakshmi Silks store in Hosur, Tamil Nadu by 3,996 square feet, strengthening its retail presence in the region.",
            "Sentiment": "positive",
            "PublishDate": 1768228101797,
            "Source": "stocks"
        },
        {
            "Title": "Sai Silks Expands Hosur Store by 3,996 Sq Ft",
            "Summary": "Sai Silks (Kalamandir) Limited extends its existing Kanchipuram Varamahalakshmi Silks store at Hosur, Tamil Nadu by 3,996 square feet, effective January 12, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768217461251,
            "Source": "stocks"
        },
        {
            "Title": "Sai Silks shares plunge 12% on weak Q3 update",
            "Summary": "Sai Silks (Kalamandir) shares fell 12% after reporting 8% decline in Q3 turnover to ₹411 crore. Stock now trades 40% below IPO price of ₹222 despite opening five new stores during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1767663147659,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sai Silks Q3 Revenue Expected to Drop 8.9% YoY",
            "Summary": "Sai Silks (Kalamandir) anticipates Q3 revenue of ₹4.10 billion compared to ₹4.50 billion in the same quarter last year, reflecting a decline in performance.",
            "Sentiment": "negative",
            "PublishDate": 1767359519081,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sai Silks Q3FY26 turnover at ₹411 cr, adds 5 stores",
            "Summary": "Sai Silks (Kalamandir) reports Q3FY26 turnover of ₹411 crores versus ₹449 crores in Q3FY25, while 9-month turnover grows to ₹1,235 crores. Company opened 5 new stores during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1767349302115,
            "Source": "stocks"
        },
        {
            "Title": "SAI Silks Opens 79th Store in Kakinada Under Valli Brand",
            "Summary": "SAI Silks (Kalamandir) expands retail footprint with new store launch in Kakinada, Andhra Pradesh on December 19, 2025, marking its 79th outlet under the Valli Silks brand.",
            "Sentiment": "positive",
            "PublishDate": 1766123767106,
            "Source": "stocks"
        },
        {
            "Title": "Sai Silks Opens 78th Store in Vizianagaram",
            "Summary": "Sai Silks (Kalamandir) expands retail footprint with launch of 78th store in Vizianagaram, Andhra Pradesh on December 17, 2025, under Valli Silks format, strengthening regional presence.",
            "Sentiment": "positive",
            "PublishDate": 1765950570135,
            "Source": "stocks"
        },
        {
            "Title": "Sai Silks Opens 77th Store in Hyderabad",
            "Summary": "Sai Silks (Kalamandir) Limited launched its 77th store under Valli Silks format at Kothapet, Hyderabad on December 13, 2025, marking continued retail expansion in Telangana.",
            "Sentiment": "positive",
            "PublishDate": 1765607429230,
            "Source": "stocks"
        },
        {
            "Title": "Sai Silks Opens 76th Store in Nellore",
            "Summary": "Sai Silks (Kalamandir) Limited launches its 76th store under Valli Silks format in Nellore, Andhra Pradesh on December 11, 2025, continuing its retail expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1765435324726,
            "Source": "stocks"
        },
        {
            "Title": "Sai Silks (Kalamandir) Opens 75th Store in Mysore Under Kanchipuram Varamahalakshmi Silks Format",
            "Summary": "Sai Silks (Kalamandir) has opened its 75th store in Mysore, Karnataka, operating under the Kanchipuram Varamahalakshmi Silks format. This expansion represents the company's continued retail growth and strengthening of its presence in the Karnataka market.",
            "Sentiment": "positive",
            "PublishDate": 1765162578784,
            "Source": "stock"
        },
        {
            "Title": "Sai Silks (Kalamandir) Reports 28% Revenue Growth to INR 444 Crores in Q2 FY26",
            "Summary": "Sai Silks (Kalamandir) Limited reported quarterly revenue of INR 444 crores compared to INR 347 crores in the previous year, marking 28% growth. EBITDA margin improved to 16.21% from 15.95%, while PAT increased to INR 40 crores from INR 23.75 crores. Same-store sales growth stood at 17.5%. For the half-year, revenue reached INR 823 crores versus INR 614 crores, representing 34% growth. Half-year EBITDA margin expanded significantly to 15.68% from 12%, and PAT grew to INR 70 crores from INR 26 crores. The company added 33,000 square feet of retail space through six new store openings during the first half, with no store closures. The company converted existing stores to its Valli format, bringing the total Valli format stores to seven. Management expects annual growth of 18-20% and projects second-half revenue of around INR 925 crores. The ethnic retail market benefited from favorable wedding calendar and early festive season onset, driving stronger consumer demand.",
            "Sentiment": "positive",
            "PublishDate": 1762160002473,
            "Source": "earnings"
        },
        {
            "Title": "Sai Silks Kalamandir Targets 100+ Stores and ₹4,500 Crore Revenue by FY27",
            "Summary": "Sai Silks Kalamandir has announced expansion plans to establish a network of over 100 stores and achieve revenue of ₹4,500 crore by FY27. The company's growth strategy includes pan-India expansion, developing a premium silk portfolio, implementing omni-channel sales approach, and improving EBITDA margins to 13-14%.",
            "Sentiment": "positive",
            "PublishDate": 1761580594262,
            "Source": "stock"
        },
        {
            "Title": "Sai Silks (Kalamandir) Reports Quarterly Results for September 2025",
            "Summary": "Sai Silks (Kalamandir) Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The Board of Directors approved the financial statements, which were recommended by the Audit Committee and reviewed by statutory auditors. The company reported total income of ₹464.80 crores for the quarter compared to ₹272.19 crores in the previous year quarter. Net profit after tax stood at ₹41.33 crores for the current quarter versus ₹10.15 crores in the same period last year. For the half year, total income reached ₹853.55 crores compared to ₹522.02 crores in the previous year. The company's total assets stood at ₹1,802.18 crores as of September 30, 2025. Cash and cash equivalents were ₹38.52 crores at the end of the period. The results were accompanied by statements of assets & liabilities, cash flow statements, and a limited review report from statutory auditors.",
            "Sentiment": "positive",
            "PublishDate": 1761569034686,
            "Source": "earnings"
        },
        {
            "Title": "SAI Silks Denies Merger Plans With Kalamandir Fashions",
            "Summary": "SAI Silks has clarified that it has no plans for a merger with Kalamandir Fashions. The company made this statement to address speculation about a potential combination between the two fashion retailers.",
            "Sentiment": "neutral",
            "PublishDate": 1760628788606,
            "Source": "stock"
        },
        {
            "Title": "Sai Silks Announces Merger With Kalamandir Fashions",
            "Summary": "Sai Silks has announced a merger with Kalamandir Fashions. The merger aims to expand market reach and broaden the product line for the combined entity.",
            "Sentiment": "positive",
            "PublishDate": 1760525044742,
            "Source": "order&deals"
        },
        {
            "Title": "Sai Silks Kalamandir Shares Surge 11% on Strong Quarterly Results Despite Trading Below IPO Price",
            "Summary": "Sai Silks Kalamandir shares jumped over 11% following their September quarter business update, marking their best single-day gain since listing. The company reported turnover of ₹444 crore for the September quarter, representing 28% growth compared to ₹347 crore in the same quarter last year. For the first half of the financial year, turnover increased 34% to ₹823 crore. The company opened five new stores during the quarter and plans to expand with 10 additional stores across Karnataka, Tamil Nadu, Telangana, and Andhra Pradesh. Trading volume was exceptionally high with 60 lakh shares traded in the first 50 minutes compared to the 20-day average of 91,000 shares. The stock closed 10% higher at ₹170.6, reversing year-to-date losses but remaining below the IPO price of ₹222. The stock has gained 50% from its post-listing low of ₹113.",
            "Sentiment": "positive",
            "PublishDate": 1759466131468,
            "Source": "stock"
        },
        {
            "Title": "Sai Silks Reports 28% Revenue Growth to ₹444 Crore in Q2 FY26",
            "Summary": "Sai Silks achieved a turnover of ₹444 crore in Q2 FY26, representing a 28% increase. The company opened 5 new stores during the quarter and has plans to open 10 additional stores.",
            "Sentiment": "positive",
            "PublishDate": 1759317250319,
            "Source": "earnings"
        },
        {
            "Title": "Sai Silks (Kalamandir) Opens 74th Valli Silks Store in Vijayawada",
            "Summary": "Sai Silks (Kalamandir) Limited opened its 74th store under the Valli Silks format in Vijayawada, Andhra Pradesh on September 29, 2025. The company announced this store opening as part of its retail expansion efforts. The announcement was made through a disclosure to stock exchanges NSE and BSE.",
            "Sentiment": "positive",
            "PublishDate": 1759127845800,
            "Source": "stock"
        },
        {
            "Title": "Sai Silks (Kalamandir) Opens 73rd Valli Silks Store in Tirupati",
            "Summary": "Sai Silks (Kalamandir) Limited opened its 73rd store under the Valli Silks format in Tirupati, Andhra Pradesh on September 24, 2025. The company announced this store opening as part of its retail expansion in the region. The announcement was made through a disclosure to stock exchanges NSE and BSE.",
            "Sentiment": "positive",
            "PublishDate": 1758693618659,
            "Source": "stock"
        },
        {
            "Title": "Sai Silks (Kalamandir) Opens 72nd Store in Atapur, Hyderabad",
            "Summary": "Sai Silks (Kalamandir) has launched its 72nd store in Atapur, Hyderabad. The new store opening is part of the company's ongoing retail expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1758520206245,
            "Source": "stock"
        },
        {
            "Title": "Sai Silks (Kalamandir) Opens 71st Valli Silks Store in Hyderabad",
            "Summary": "Sai Silks (Kalamandir) Limited opened its 71st store under the Valli Silks format in Nizampet, Hyderabad, Telangana on August 09, 2025. The company announced this store opening as part of its retail expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1754718871157,
            "Source": "stock"
        },
        {
            "Title": "Sai Silks (Kalamandir) Opens 70th Store Under Kanchipuram Varamahalakshmi Silks Format",
            "Summary": "Sai Silks (Kalamandir) Limited opened its 70th store under the Kanchipuram Varamahalakshmi Silks format in Tirupati, Andhra Pradesh on August 07, 2025. The company announced this store expansion to stock exchanges as part of its disclosure requirements.",
            "Sentiment": "positive",
            "PublishDate": 1754544892618,
            "Source": "stock"
        },
        {
            "Title": "Sai Silks (Kalamandir) Reports 42% Revenue Growth and 200% EBITDA Jump in Q1 FY26",
            "Summary": "Sai Silks (Kalamandir) Limited reported strong quarterly results with total revenue reaching INR 379 crores compared to INR 267 crores in the previous year, marking 42% year-on-year growth. EBITDA surged 200% to INR 57.13 crores from INR 19 crores, while PAT increased over 1,300% to INR 30 crores from INR 2 crores. The company achieved 29% same-store sales growth, driven by favorable wedding calendar and strong consumer demand in bridal and festive wear categories. Gross margin improved to 42.07% from 41.26%. The company opened one new Varamahalakshmi Silks store, bringing total retail presence to 7.27 lakh square feet across 69 stores in over 20 cities. Management announced plans to launch a new format called Valli Silks, targeting women's sarees in the low-priced silk segment. The company is targeting around 15% top-line growth and expects to maintain current margin levels. Management indicated no further tax provisions from previous years will be required going forward.",
            "Sentiment": "positive",
            "PublishDate": 1753791908726,
            "Source": "earnings"
        },
        {
            "Title": "Sai Silks Kalamandir Reports Strong Q1 FY26 Results with 42% Revenue Growth",
            "Summary": "Sai Silks (Kalamandir) Limited, a leading South Indian ethnic wear retailer, reported significant growth in quarterly results. Revenue from operations increased 41.80% to ₹379.02 crores compared to ₹267.29 crores in the same quarter last year. The company's profit after tax surged dramatically by 1,339.26% to ₹30.06 crores from ₹2.09 crores in the previous year quarter. EBITDA margin improved to 15.07% from 7.08% year-over-year, while PAT margin expanded to 7.93% from 0.78%. The company operates 69 stores across 21 cities in four states - Telangana, Karnataka, Andhra Pradesh, and Tamil Nadu, plus Puducherry. It runs four brand formats: Kalamandir, Kanchipuram Varamahalakshmi Silks, Mandir, and KLM Fashion Mall, serving 7.75 million customers overall. The company has received 27 awards and recognitions since 2012, including recent honors for Best Retailer of the Year and Pioneer in Ethnic Retail Fashion.",
            "Sentiment": "positive",
            "PublishDate": 1753519962107,
            "Source": "earnings"
        },
        {
            "Title": "Sai Silks Sets ₹2,000 Crore Revenue Target by FY27",
            "Summary": "Sai Silks has announced a revenue target of ₹2,000 crore by FY27. The company plans to achieve this through nationwide retail expansion, improving private label profitability, and increasing omnichannel presence in both value and premium silk market segments.",
            "Sentiment": "positive",
            "PublishDate": 1753450376118,
            "Source": "stock"
        },
        {
            "Title": "Sai Silks (Kalamandir) Reports Strong Q1 Performance with Revenue Up 42% and Net Profit Surging to 300M Rupees",
            "Summary": "Sai Silks (Kalamandir) delivered robust Q1 results with revenue rising to 3.8 billion rupees from 2.67 billion rupees year-over-year. The company's net profit jumped significantly to 300 million rupees compared to 21 million rupees in the same period last year. EBITDA increased substantially to 571 million rupees from 190 million rupees year-over-year, while EBITDA margin expanded to 15.1% from 7.08% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753430036892,
            "Source": "earnings"
        },
        {
            "Title": "Sai Silks (Kalamandir) Board Approves Quarterly Results, Sets Rs 1 Final Dividend and AGM Date",
            "Summary": "Sai Silks (Kalamandir) Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 379.02 crores and profit of Rs 30.06 crores for the quarter. The Board declared a final dividend of Rs 1 per equity share (face value Rs 2) with August 22, 2025 as the record date. The 17th Annual General Meeting is scheduled for August 29, 2025 via video conference. The Board recommended appointing M/s P S Rao & Associates as Secretarial Auditor for a five-year term. The company achieved debt-free status on working capital borrowings and plans to clear remaining term loans of Rs 16 crores. Basic earnings per share stood at Rs 2.04 for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753429961252,
            "Source": "corporate_action"
        },
        {
            "Title": "Sai Silks (Kalamandir) Schedules Q1 FY26 Earnings Call for July 26",
            "Summary": "Sai Silks (Kalamandir) has scheduled its quarterly earnings conference call for July 26 at 11 AM to discuss Q1 FY26 results.",
            "Sentiment": "neutral",
            "PublishDate": 1753161337687,
            "Source": "earnings"
        },
        {
            "Title": "SAI Silks Reports 42% Growth in Q1 FY 2025-26 Turnover",
            "Summary": "SAI Silks has reported a turnover of approximately ₹379.02 crores for Q1 FY 2025-26, compared to ₹267.29 crores in Q1 FY 2024-25. This represents a growth of about 42% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1751444057000,
            "Source": "default"
        },
        {
            "Title": "Sai Silks (Kalamandir) Q4 Results and Dividend Announcement",
            "Summary": "Sai Silks (Kalamandir) has announced its Q4 financial results and dividend. The company's Q4 revenue increased to 3.99 billion rupees from 3.6 billion rupees year-over-year. However, net profit decreased to 135.1 million rupees from 287.3 million rupees year-over-year. EBITDA rose to 584.4 million rupees from 541.6 million rupees, while EBITDA margin slightly decreased to 14.65% from 15.06%. The company has recommended a final dividend of 1 rupee per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747409181000,
            "Source": "result"
        },
        {
            "Title": "Sai Silks (Kalamandir) to Consider Q4 Results on May 16",
            "Summary": "Sai Silks (Kalamandir) has announced that it will consider its fourth quarter financial results on May 16. This indicates that the company is preparing to release its earnings report for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1746619206000,
            "Source": "default"
        },
        {
            "Title": "Sai Silks (Kalamandir) Reports 11% QoQ Increase in Q4 FY25 Turnover",
            "Summary": "Sai Silks (Kalamandir) has announced its financial results for the fourth quarter of fiscal year 2025. The company reported a turnover of 3.99 billion rupees, representing an 11% increase compared to the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1743639083000,
            "Source": "earnings"
        },
        {
            "Title": "Sai Silks (Kalamandir) Reports 11% Quarter-on-Quarter Growth in Q4 FY25",
            "Summary": "Sai Silks (Kalamandir) has announced its financial results for the fourth quarter of fiscal year 2025. The company reported a turnover of 3.99 billion rupees, representing an 11% increase compared to the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1743600912000,
            "Source": "earnings"
        },
        {
            "Title": "Sai Silks (Kalamandir) Limited: Q3 Profit Soars 43.86% YoY, Revenue Up 15.72%",
            "Summary": "Sai Silks (Kalamandir) reported Q3 FY25 results with profit rising 43.86% YoY to ₹46.02 crore and revenue increasing 15.72% YoY to ₹454.2 crore. Operating income grew 27.01% YoY. EPS reached ₹3.12, up 39.91% YoY. QoQ performance showed significant improvement with revenue up 28.46% and profit surging 93.69%.",
            "Sentiment": "positive",
            "PublishDate": 1738217151000,
            "Source": "earnings"
        },
        {
            "Title": "Sai Silks (Kalamandir) Reports Improved Q3 EBITDA and Margin",
            "Summary": "Sai Silks (Kalamandir) has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 790 million rupees from 582 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 17.59% from 15.22% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738056087000,
            "Source": "earnings"
        },
        {
            "Title": "Sai Silks (Kalamandir) Reports Q3 Revenue Increase",
            "Summary": "Sai Silks (Kalamandir) has announced its third-quarter revenue results. The company reported revenue of 4.48 billion rupees, compared to 3.82 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738056025000,
            "Source": "earnings"
        },
        {
            "Title": "Sai Silks (Kalamandir) Reports Q3 Net Profit Increase",
            "Summary": "Sai Silks (Kalamandir) has reported a net profit of 460 million rupees for the third quarter, showing a significant increase from 320 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738055988000,
            "Source": "earnings"
        },
        {
            "Title": "Sai Silks Reports 18% Growth in Q3 FY 2024-25 Turnover",
            "Summary": "Sai Silks has announced its financial performance for the third quarter of fiscal year 2024-25. The company achieved a turnover of approximately Rs. 449 crores, compared to Rs. 382 crores in the same period last year, representing a growth of 18%.",
            "Sentiment": "positive",
            "PublishDate": 1735715987000,
            "Source": "earnings"
        },
        {
            "Title": "Sai Silks (Kalamandir) Reports Q2 Financial Results",
            "Summary": "Sai Silks (Kalamandir) has announced its Q2 financial results. The company's EBITDA for the quarter is 560 million rupees, compared to 550 million rupees in the same quarter last year, showing a slight increase. However, the EBITDA margin has decreased from 16.83% to 16.14% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730711453000,
            "Source": "result"
        },
        {
            "Title": "Sai Silks (Kalamandir) Reports Q2 Revenue Growth",
            "Summary": "Sai Silks (Kalamandir) has announced its second quarter revenue for the current fiscal year. The company reported revenue of 3.5 billion rupees, compared to 3.26 billion rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730711424000,
            "Source": "result"
        },
        {
            "Title": "Sai Silks (Kalamandir) Reports Slight Increase in Q2 Net Profit",
            "Summary": "Sai Silks (Kalamandir) has reported a net profit of 238 million rupees for the second quarter, compared to 234 million rupees in the same period last year, showing a marginal year-over-year increase.",
            "Sentiment": "neutral",
            "PublishDate": 1730711372000,
            "Source": "result"
        }
    ]
}