{
    "Symbol": "KALPATARU",
    "ISIN": "INE227J01012",
    "News": [
        {
            "Title": "Multiple Companies Report Q3 FY26 Financial Results",
            "Summary": "Sun TV Network reports ₹862.16 crore operational income for Q3 FY26, while OnMobile Global shows ₹1,456.97 million revenue. Finkurve Financial Services posts strong growth with ₹5,247.06 lakhs income.",
            "Sentiment": "positive",
            "PublishDate": 1770713984500,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kalpataru to Join Axis Capital Conference Feb 12",
            "Summary": "Kalpataru Limited announces participation in Advantage India conference organized by Axis Capital on February 12, 2026, featuring one-on-one and group interactions with institutional investors.",
            "Sentiment": "neutral",
            "PublishDate": 1770459892462,
            "Source": "stocks"
        },
        {
            "Title": "Kalpataru Limited Appoints New Company Secretary",
            "Summary": "Kalpataru Limited's Board appointed Mr. Gajendra Mewara as Company Secretary and Compliance Officer with effect from February 6, 2026, following recommendation from Nomination and Remuneration Committee.",
            "Sentiment": "positive",
            "PublishDate": 1770395488460,
            "Source": "stocks"
        },
        {
            "Title": "Kalpataru Limited Postal Ballot Results Approved",
            "Summary": "Kalpataru Limited successfully passes all four ordinary resolutions through postal ballot with 99.65% approval rate for material related party transactions with subsidiaries and promoter group entities.",
            "Sentiment": "positive",
            "PublishDate": 1770041165172,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kalpataru Board Meet Set for Feb 6 on Q3 Results",
            "Summary": "Kalpataru Limited schedules board meeting for February 06, 2026 to approve Q3FY26 financial results and consider fund raising through Non-Convertible Debentures on private placement basis.",
            "Sentiment": "neutral",
            "PublishDate": 1769870932462,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kalpataru Shares Surge 10% on Strong Q3 Collections",
            "Summary": "Kalpataru Ltd shares jumped nearly 10% after reporting 17% YoY growth in Q3 FY26 collections to ₹1,101 crore, despite 14% decline in pre-sales. Nine-month performance showed robust 23% growth in pre-sales and 30% jump in collections.",
            "Sentiment": "positive",
            "PublishDate": 1768306449067,
            "Source": "stocks"
        },
        {
            "Title": "Kalpataru Q3 Pre-sales Drop 14% YoY, Collections Rise 17%",
            "Summary": "Kalpataru reports mixed Q3 performance with pre-sales declining 14% year-on-year while collections showed strong growth of 17% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1768263021078,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kalpataru Q3: Pre-Sales Drop 14%, Collections Rise 17%",
            "Summary": "Kalpataru reports mixed Q3 performance with pre-sales declining 14% year-over-year while collections showed strong growth of 17% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1768221970352,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kalpataru Q3FY26: Collections Rise 17% to ₹1,101 Cr",
            "Summary": "Kalpataru Limited reports Q3FY26 collections of ₹1,101 crores, up 17% YoY, while pre-sales declined 14% to ₹870 crores. Nine-month performance shows strong growth with 23% increase in pre-sales.",
            "Sentiment": "positive",
            "PublishDate": 1768219274085,
            "Source": "stocks"
        },
        {
            "Title": "Kalpataru's Subsidiary Faces ₹6.56 Cr CGST Demand",
            "Summary": "Kalpataru Properties Thane receives CGST demand order of ₹6.56 crores for FY2018-19 related to RERA income differences and ITC violations. Company plans to appeal the order.",
            "Sentiment": "negative",
            "PublishDate": 1767196143240,
            "Source": "stocks"
        },
        {
            "Title": "Kalpataru Limited Faces ₹80.71 Cr GST Demand Order",
            "Summary": "Kalpataru Limited receives GST demand order of ₹80.71 crores from Joint Commissioner, CGST Mumbai for non-payment of GST on flats allotted to society members. Company plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1767075469089,
            "Source": "stocks"
        },
        {
            "Title": "Kalpataru Limited Company Secretary Resigns",
            "Summary": "Abhishek Thareja resigns as Company Secretary and Compliance Officer of Kalpataru Limited effective December 12, 2025, to pursue entrepreneurial journey and personal aspirations.",
            "Sentiment": "neutral",
            "PublishDate": 1765552568628,
            "Source": "stocks"
        },
        {
            "Title": "Kalpataru Limited Withdraws Demerger Scheme for Project Yoganand After NCLT Approval",
            "Summary": "Kalpataru Limited has successfully withdrawn its scheme of arrangement for demerging Project Yoganand (Borivali, Mumbai) to wholly owned subsidiary Kalpataru Residency Private Limited, with NCLT Mumbai Bench approving the withdrawal on November 25, 2025. The withdrawal reverses the company's earlier demerger plan that was approved by the Board in November 2025, affecting the corporate restructuring strategy for the Mumbai-based project.",
            "Sentiment": "neutral",
            "PublishDate": 1765288946435,
            "Source": "corporate_action"
        },
        {
            "Title": "Kalpataru Subsidiary Faces Rs 7.22 Crore Tax Demand Over Transfer Pricing Dispute",
            "Summary": "Kalpataru Limited's wholly owned subsidiary KHPL received an Income Tax assessment order for financial year 2022-23, raising a demand of Rs 7,21,88,390 due to transfer pricing adjustments with associated enterprises. The company believes the demand is not maintainable and is planning to file an appeal against the order, with potential indirect financial impact on Kalpataru Limited depending on proceedings outcome.",
            "Sentiment": "negative",
            "PublishDate": 1764421750161,
            "Source": "stock"
        },
        {
            "Title": "Kalpataru Limited Reports No Deviation in IPO Fund Utilization for September 2025 Quarter",
            "Summary": "Kalpataru Limited confirmed no deviation in the utilization of Rs. 1,590 crore raised through its IPO, with funds deployed as planned for debt repayment (Rs. 1,192.50 crore utilized) and general corporate purposes (Rs. 145.12 crore utilized during the quarter). The company maintains Rs. 200.09 crore as unutilized funds, with Rs. 125 crore held in fixed deposits, while monitoring agency CARE Ratings validated the proper fund deployment across the company and its subsidiaries.",
            "Sentiment": "positive",
            "PublishDate": 1763174746875,
            "Source": "corporate_action"
        },
        {
            "Title": "Kalpataru Limited Reports 43% Growth in Pre-Sales for H1 FY26 in First Earnings Call as Listed Company",
            "Summary": "Kalpataru Limited, a Mumbai-based real estate developer, reported pre-sales of Rs. 2,577 crores for H1 FY26, marking a 43% year-on-year growth. Collections reached Rs. 2,308 crores, reflecting 37% growth. The company achieved quarterly pre-sales of Rs. 1,329 crores in Q2 FY26, up 19% year-on-year. Revenue from operations stood at Rs. 1,237 crores for H1 FY26, with adjusted EBITDA at Rs. 293 crores. Net debt improved to Rs. 8,025 crores from Rs. 9,310 crores at FY25 year-end, reducing the net debt-to-equity ratio to 2.0x from 3.8x. The company launched Kalpataru Estella at Park City Thane and a new tower at Srishti Namaah in Mira Road during the quarter. Kalpataru One at Worli generated Rs. 720 crores in sales during H1. The company maintains guidance of Rs. 7,000 crores in pre-sales and Rs. 5,700 crores in collections for FY26, representing approximately 55-56% growth. Management expects net debt to reduce to around Rs. 7,300 crores by year-end.",
            "Sentiment": "positive",
            "PublishDate": 1763038053208,
            "Source": "earnings"
        },
        {
            "Title": "Kalpataru Ltd Sells Office Space Worth Rs 304 Crore to Shipping Company",
            "Summary": "Kalpataru Ltd sold five floors totaling 93,266 sq ft of office space for Rs 304 crore to a shipping company in its commercial project 'Kalpataru Virtus' at Vikhroli East, Mumbai. The project covers 2.75 lakh sq ft carpet area and is expected to be completed by December 2027. Over the past year, Kalpataru has sold commercial properties worth Rs 1,200 crore and currently has 2.5 lakh sq ft of premium commercial space available for sale. The company reported 41% growth in pre-sales to Rs 4,531 crore in the last fiscal year and 83% rise in sales bookings to Rs 1,249 crore during the first quarter. However, Kalpataru posted a consolidated net loss of Rs 49.42 crore in the first quarter compared to Rs 0.69 crore loss in the previous year, with total income declining to Rs 456.78 crore from Rs 544.67 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1762859492149,
            "Source": "stock"
        },
        {
            "Title": "Kalpataru Limited Reports 19% YoY Growth in Pre-Sales to INR 1,329 Crore for Q2FY26",
            "Summary": "Kalpataru Limited reported pre-sales of INR 1,329 crore for Q2FY26, marking a 19% year-on-year increase from INR 1,117 crore in Q2FY25. Collections grew 37% YoY to INR 1,162 crore. For H1FY26, pre-sales reached INR 2,577 crore (43% YoY growth) with collections of INR 2,308 crore (37% YoY growth). Average sales realization increased significantly by 27% YoY to INR 16,977 per sq.ft. in Q2FY26. The company launched new projects including Kalpataru Estella at Parkcity, Thane. Net debt reduced to INR 8,025 crore as of September 30, 2025, with debt-to-equity ratio improving to 2.0x from 3.8x in March 2025. Revenue from operations stood at INR 794 crore in Q2FY26, up 57% YoY. The company received occupation certificates for 0.96 msf area in Q2FY26. Kalpataru maintains guidance of INR 7,000 crore pre-sales and INR 5,700 crore collections for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1762827565001,
            "Source": "earnings"
        },
        {
            "Title": "Kalpataru Limited Reports Net Loss of Rs 47 Crore in Q2 FY26 Despite Revenue Growth",
            "Summary": "Kalpataru Limited posted a consolidated net loss of Rs 47 crore for the quarter ended September 30, 2025, compared to a net profit of Rs 27 crore in the same period last year. Revenue from operations increased to Rs 793 crore from Rs 606 crore year-on-year. For the half-year period, the company reported a net loss of Rs 47 crore against a profit of Rs 27 crore in the previous year, while revenue grew to Rs 1,236 crore from Rs 1,079 crore. The company's total expenses rose to Rs 822 crore in the quarter from Rs 437 crore last year. Finance costs increased significantly to Rs 44 crore from Rs 11 crore. The company's cash and cash equivalents stood at Rs 210 crore as of September 30, 2025. The Board approved the unaudited financial results at a meeting held on November 10, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762822656418,
            "Source": "earnings"
        },
        {
            "Title": "Kalpataru Limited Appoints New Internal Auditor",
            "Summary": "Kalpataru Limited's Board of Directors appointed Mr. Nilesh Khandelwal as Internal Auditor, replacing Ms. Swati Doshi. The appointment was made following the Audit Committee's recommendation as part of re-alignment of roles and responsibilities within the Group Assurance Department. Khandelwal, a Chartered Accountant with over 25 years of experience in Internal Audit and Risk Management, will conduct internal audit starting from October 01, 2025. He has previously worked with organizations including Lodha, RSM India, Future Group, Hypercity Retail, and Aneja Associates, specializing in audit strategy, governance, compliance, and risk mitigation.",
            "Sentiment": "neutral",
            "PublishDate": 1762804421761,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kalpataru Limited Withdraws Demerger Scheme for Project Yoganand",
            "Summary": "Kalpataru Limited's Board of Directors approved the withdrawal of a demerger scheme that would have transferred Project Yoganand, located in Borivali, Mumbai, to its wholly owned subsidiary Kalpataru Residency Private Limited. The scheme was originally approved in June 2024 to facilitate funding and refinancing from investors and lenders by creating a special purpose vehicle. However, following the company's Initial Public Offering, Kalpataru now has adequate cash flows and lenders no longer require the project demerger. The withdrawal has no financial impact on either Kalpataru Limited or Kalpataru Residency Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1762803679920,
            "Source": "corporate_action"
        },
        {
            "Title": "Kalpataru Reports Sharp Decline in Q2 EBITDA and Margins",
            "Summary": "Kalpataru's Q2 EBITDA dropped significantly to 67 million rupees compared to 353 million rupees in the same quarter last year. The company's EBITDA margin also declined substantially to 0.84% from 6.97% year-over-year, indicating reduced profitability during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762789246649,
            "Source": "earnings"
        },
        {
            "Title": "Kalpataru Limited Reports Strong Growth in Q2 and H1 FY26 Operational Metrics",
            "Summary": "Kalpataru Limited disclosed operational updates showing strong year-over-year growth across key metrics. For Q2 FY26, pre-sales reached INR 1,329 crore, marking a 19% increase from INR 1,117 crore in Q2 FY25. Collections grew 37% to INR 1,162 crore compared to INR 849 crore in the previous year quarter. For H1 FY26, pre-sales surged 43% to INR 2,577 crore from INR 1,799 crore in H1 FY25, while collections increased 37% to INR 2,308 crore from INR 1,687 crore. The company noted that these figures are provisional and subject to limited review.",
            "Sentiment": "positive",
            "PublishDate": 1760613017382,
            "Source": "stock"
        },
        {
            "Title": "Kalpataru Subsidiary Azure Tree Lands Receives ₹24.01 Crore Tax Demand",
            "Summary": "Azure Tree Lands, a subsidiary of Kalpataru, has received a tax demand of ₹24.01 crore for fiscal year 2023-24. This tax liability affects the subsidiary's financial position and may impact the parent company's overall financial performance.",
            "Sentiment": "negative",
            "PublishDate": 1758817947518,
            "Source": "stock"
        },
        {
            "Title": "Kalpataru Limited Reports No Deviation in IPO Proceeds Utilization for Quarter Ended June 30, 2025",
            "Summary": "Kalpataru Limited confirmed no deviation in the utilization of its IPO proceeds for the quarter ended June 30, 2025. The company raised INR 1,590 crores through its IPO, with equity shares listed on BSE and NSE from July 1, 2025. During the quarter, INR 500 crores was utilized - INR 300 crores for repayment of the company's outstanding borrowings and INR 200 crores for repayment of subsidiary borrowings. The remaining INR 1,090 crores remains unutilized, with the balance proceeds remitted between July 1-3, 2025, in line with the stated objectives. The original allocation included INR 1,192.50 crores for debt repayment, INR 311.36 crores for general corporate purposes, and INR 86.14 crores for issue expenses. CARE Ratings Limited serves as the monitoring agency and confirmed the utilization aligns with the prospectus objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1755104705574,
            "Source": "stock"
        },
        {
            "Title": "Kalpataru Focuses on Record Order Book and Global Expansion for Multi-Year Growth",
            "Summary": "Kalpataru is leveraging its record order book and global infrastructure opportunities to drive multi-year growth. The company has a diversified EPC portfolio spanning power, rail, and civil sectors. Kalpataru is focusing on execution efficiency and overseas expansion as key strategies to enhance margins.",
            "Sentiment": "positive",
            "PublishDate": 1755103987512,
            "Source": "stock"
        },
        {
            "Title": "Kalpataru Limited Reports 83% Jump in Pre-Sales to ₹1,249 Crore in Q1 FY26",
            "Summary": "Kalpataru Limited announced strong operational performance for the quarter ended June 30, 2025, with pre-sales growing 83% year-on-year to ₹1,249 crore. Collections increased 37% to ₹1,147 crore, while average selling realization doubled to ₹22,476 per sq.ft. from ₹11,199 per sq.ft. in the same period last year. Area sold declined 9% to 0.56 million sq.ft. The company utilized ₹1,192.5 crore from IPO proceeds for debt repayment, improving the net debt-to-equity ratio to 2.0x from 3.8x in March 2025. Net debt stands at ₹7,939 crore as of June 30, 2025. Revenue from operations was ₹443 crore with adjusted EBITDA of ₹104 crore at 23.4% margin, while the company reported a net loss of ₹52 crore. For FY26, the company has guided for pre-sales of around ₹7,000 crore (55% growth) and collections of approximately ₹5,700 crore (56% growth). The company has a launch pipeline of 3.16 million sq.ft. saleable area across Mumbai and Thane for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1755102590552,
            "Source": "earnings"
        },
        {
            "Title": "Kalpataru Limited Reports Net Loss of Rs 5,184 Lakhs in Q1 FY26",
            "Summary": "Kalpataru Limited reported a consolidated net loss of Rs 5,184 lakhs for the quarter ended June 30, 2025, compared to a net profit of Rs 2,032 lakhs in the previous quarter. Revenue from operations declined to Rs 44,320 lakhs from Rs 50,689 lakhs in the prior quarter. The company's total expenses increased to Rs 51,223 lakhs, with finance costs rising significantly to Rs 3,185 lakhs. Basic earnings per share stood at negative Rs 2.92. The company granted 15,94,100 employee stock options under ESOS 2024 at an exercise price of Rs 306 per option. The Board approved these unaudited financial results on August 13, 2025, following Audit Committee recommendations.",
            "Sentiment": "negative",
            "PublishDate": 1755101173980,
            "Source": "earnings"
        },
        {
            "Title": "Kalpataru Limited Seeks Shareholder Approval for Employee Stock Option Scheme and Related Party Transactions",
            "Summary": "Kalpataru Limited has issued a postal ballot notice seeking shareholder approval on six special business items. The company is requesting ratification of its Employee Stock Option Scheme 2024, which allows granting up to 54 lakh stock options to employees of the company, subsidiaries, and group companies. The scheme was originally approved before the company's IPO and requires post-listing ratification under SEBI regulations. Additionally, shareholders will vote on three material related party transactions: a Rs 400 crore personal guarantee by Managing Director Parag M. Munot for subsidiary Alder Residency's ICICI Bank loan, a Rs 1,734 crore corporate guarantee by Agile Real Estate Private Limited for the company's HDFC Bank facilities, and a Rs 615 crore corporate guarantee between subsidiaries for KPPL's HDFC Bank facilities. The e-voting period runs from August 1-30, 2025, with results to be declared by August 30.",
            "Sentiment": "neutral",
            "PublishDate": 1753974396028,
            "Source": "corporate_action"
        },
        {
            "Title": "Kalpataru Ltd Reports 41% Jump in Pre-Sales to Rs 4,531 Crore, Turns Profitable",
            "Summary": "Kalpataru Ltd achieved pre-sales of Rs 4,531 crore in FY25, marking a 41% increase from Rs 3,202 crore in the previous year, driven by higher residential property demand. The Mumbai-based real estate developer turned profitable with a net profit of Rs 21.62 crore compared to a loss of Rs 94.98 crore in the preceding year. Total income rose to Rs 2,331.59 crore from Rs 2,039.93 crore. The company launched 7 new projects totaling 6.5 million square feet and signed development agreements for two society redevelopment projects worth Rs 2,100 crore. Net debt decreased by Rs 673 crore to Rs 9,310 crore. Kalpataru raised Rs 1,590 crore through its IPO in June 2025, utilizing Rs 1,192.5 crore for debt repayment, improving its debt-to-equity ratio. The company has completed 77 projects and has 35 ongoing projects with 47.3 million square feet of developable area, primarily in Mumbai Metropolitan Region and Pune markets.",
            "Sentiment": "positive",
            "PublishDate": 1753091844033,
            "Source": "earnings"
        },
        {
            "Title": "Kalpataru Ltd Reports 41% Jump in Pre-Sales to ₹4,531 Crore in FY25",
            "Summary": "Mumbai-based realty firm Kalpataru Ltd achieved pre-sales of ₹4,531 crore in FY25, marking a 41% increase from ₹3,202 crore in the previous year, driven by higher residential property demand. The company launched 7 new projects totaling 6.5 million square feet and signed development agreements for two society redevelopment projects worth ₹2,100 crore. Kalpataru posted a net profit of ₹21.62 crore compared to a loss of ₹94.98 crore in the preceding year, while total income rose to ₹2,331.59 crore from ₹2,039.93 crore. Net debt decreased by ₹673 crore to ₹9,310 crore. The company raised ₹1,590 crore through its IPO in June 2025, utilizing ₹1,192.5 crore for debt repayment. Kalpataru has completed 77 projects and has 35 ongoing projects with 47.3 million square feet of developable area, primarily focused on Mumbai Metropolitan Region and Pune markets.",
            "Sentiment": "positive",
            "PublishDate": 1753013898212,
            "Source": "stock"
        },
        {
            "Title": "Kalpataru Poised for Growth with Strong Residential Plans and Debt Reduction",
            "Summary": "Kalpataru is preparing for rapid growth with robust plans for residential launches and smart debt reduction strategies. The company is expanding its redevelopment portfolio and showing positive operational metrics. Kalpataru is also increasing its annuity income, which is helping to strengthen its position in the premium housing markets of Mumbai Metropolitan Region (MMR) and Pune.",
            "Sentiment": "positive",
            "PublishDate": 1752678233000,
            "Source": "default"
        },
        {
            "Title": "Kalpataru Reports Q4 Financial Results",
            "Summary": "Kalpataru announced its Q4 financial results. The company's consolidated net profit decreased to 141 million rupees from 243 million rupees in the same quarter last year. Revenue increased to 5.97 billion rupees from 4.9 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1752670993000,
            "Source": "result"
        }
    ]
}