{
    "Symbol": "KALYANIFRG",
    "ISIN": "INE314G01014",
    "News": [
        {
            "Title": "Kalyani Forge Q3FY26 Results & CFO Appointment",
            "Summary": "Kalyani Forge reported Q3FY26 results with revenue of ₹5,786.32 lakhs, posted net loss of ₹11.90 lakhs, and appointed Jagdish Baheti as new CFO effective February 11, 2026.",
            "Sentiment": "negative",
            "PublishDate": 1770815289383,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kalyanforge Reports Q2 FY26 Results with Improved Margins Despite US Tariff Impact",
            "Summary": "Kalyanforge Limited reported total income of Rs 56.23 crores for Q2 FY26, down from previous levels due to US tariff-related export reductions, while PAT increased to Rs 2.15 crores and EBITDA margin improved to 12.6%. The company maintained profitability through cost control measures, won new MNC customer orders worth Rs 5-10 crores annually in the Axle business, and commissioned Rs 7 crores of CapEx projects while strengthening governance and compliance systems.",
            "Sentiment": "neutral",
            "PublishDate": 1763618051803,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kalyani Forge Reports 53% PAT Margin Improvement Despite Export Challenges in Q2FY26",
            "Summary": "Kalyani Forge Limited held an investor conference call presenting quarterly results showing improved profitability despite reduced US exports due to tariff-related issues. The company achieved a 53% improvement in PAT margin from the previous quarter and EBITDA margin growth to 13% through cost control measures and operational efficiency improvements. Domestic sales maintained momentum following post-GST cuts, while export sales currently represent 20% of total sales. The company successfully ramped up high-volume, non-auto export business in the USA and commenced Europe transmission business consignments. New business developments included acquiring a new MNC customer in the axle business and order wins worth Rs. 95.47 crores. The company completed Rs. 7 crores of projects from capital work in progress, with 58% of the capex program in process or completed. Vriddhi Council strategic projects delivered gains and savings worth Rs. 17 crores. The company implemented clean audit review actions, new ERP controls, and compliance software while improving Internal Financial Controls scores.",
            "Sentiment": "positive",
            "PublishDate": 1763012609884,
            "Source": "earnings"
        },
        {
            "Title": "Kalyani Forge Appoints New Independent Director, Reports Quarterly Results with Auditor Disclaimers",
            "Summary": "Kalyani Forge Limited's Board approved the appointment of Mr. Vishwanathan Swaminathan as Additional Independent Director for five years, effective November 12, 2025, subject to shareholder approval. He will assume committee positions held by Mr. Abhijit Sen upon the latter's retirement on February 2, 2026. The company reported unaudited financial results for the quarter and half-year ended September 30, 2025, showing profit before tax of ₹429.25 lakhs for the half-year compared to ₹617.51 lakhs in the previous year. However, statutory auditors M.P. Chitale & Co. issued a disclaimer opinion citing concerns over stock valuation methodology refinement, pending reconciliations of trade receivables and payables, inadequate documentation of internal financial controls, and GST balance reconciliation issues. The Board also adopted new policies on materiality and related party transactions.",
            "Sentiment": "negative",
            "PublishDate": 1762994272476,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kalyani Forge Reports Q1 Results with Leadership Changes and Auditor Concerns",
            "Summary": "Kalyani Forge Limited reported unaudited standalone financial results for the quarter ended June 30, 2025. The company posted revenue from operations of ₹6,413.27 lakhs compared to ₹5,673.83 lakhs in the same quarter last year. Profit after tax increased to ₹140.65 lakhs from ₹34.76 lakhs year-over-year. Earnings per share stood at ₹3.87 versus ₹0.96 in the previous year quarter. The company announced leadership changes with Ms. Rachana Agarwal resigning as Company Secretary and Compliance Officer on July 10, 2025, and Ms. Aishwarya Parwal being appointed to the same position. The statutory auditors M/s M.P. Chitale & Co expressed concerns about stock valuation methodology refinements, trade receivables and payables reconciliations, internal financial controls documentation, and GST reconciliations. Management responded that they are addressing these issues and will implement corrections in the next quarter, including SAP Controlling module re-implementation and GST consultant analysis.",
            "Sentiment": "neutral",
            "PublishDate": 1755082450463,
            "Source": "earnings"
        },
        {
            "Title": "Kalyani Forge Sets Record Date for Dividend Payment and AGM Schedule",
            "Summary": "Kalyani Forge Limited has set August 22, 2025 as the record date for dividend payment. The company will hold its Annual General Meeting on August 29, 2025. The record date has been established for the purpose of dividend declaration. The announcement was signed by Executive Chairperson Mrs. Rohini G. Kalyani and represents a revised intimation following clarification sought by BSE on August 11, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755081377932,
            "Source": "corporate_action"
        },
        {
            "Title": "Kalyani Forge Limited Announces Book Closure and AGM Dates for Dividend Declaration",
            "Summary": "Kalyani Forge Limited has set book closure dates from August 23 to August 29, 2025, for dividend declaration purposes and its Annual General Meeting. The AGM is scheduled for August 29, 2025. Shareholders must be registered by the cut-off date of August 22, 2025, to be eligible for electronic voting at the meeting. The company is listed on BSE with scrip code 513509 and on NSE with symbol KALYANIFRG.",
            "Sentiment": "neutral",
            "PublishDate": 1754576128357,
            "Source": "corporate_action"
        },
        {
            "Title": "Kalyani Forge Corrects Statutory Auditor Appointment Term in Revised Board Meeting Outcome",
            "Summary": "Kalyani Forge Limited revised its Board Meeting outcome from May 27, 2025, to correct a typographical error regarding the appointment of M/s. M. P. Chitale & Co. as Statutory Auditors. The auditing firm has been appointed for a five-year term from April 1, 2025, to March 31, 2030, extending until the AGM in 2030, subject to shareholder approval at the upcoming Annual General Meeting. M/s. M. P. Chitale & Co. is a chartered accountant firm with over 200 professionals, headquartered in Mumbai with branches in Pune, specializing in various sectors including banking, manufacturing, and capital markets.",
            "Sentiment": "neutral",
            "PublishDate": 1754464004660,
            "Source": "corporate_action"
        }
    ]
}