{
    "Symbol": "KALYANKJIL",
    "ISIN": "INE303R01014",
    "News": [
        {
            "Title": "Kalyan Jewellers Reports Strong Q3FY26 Performance",
            "Summary": "Kalyan Jewellers delivered robust Q3FY26 results with consolidated revenue of ₹1,03,434 Mn (42% YoY growth) and PAT of ₹4,163 Mn (90% YoY growth), driven by strong performance across India and Middle East operations.",
            "Sentiment": "positive",
            "PublishDate": 1770375963389,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kalyan Jewellers Shares Fall 12% on Eighth Day",
            "Summary": "Kalyan Jewellers shares dropped 12% on Wednesday, marking the eighth consecutive session of losses. The stock has declined 22% during this streak and is down 18% over the past 12 months.",
            "Sentiment": "negative",
            "PublishDate": 1768975217015,
            "Source": "stocks"
        },
        {
            "Title": "Kalyan Jewellers Independent Director Completes Tenure",
            "Summary": "Kalyan Jewellers announces cessation of Independent Director Ms. Kishori J Udeshi upon completion of her second consecutive term on January 16, 2026, as per SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768568253718,
            "Source": "stocks"
        },
        {
            "Title": "Kalyan Jewellers schedules Q3FY26 earnings call",
            "Summary": "Kalyan Jewellers India Limited announces earnings conference call on February 6, 2026 at 5:00 PM IST to discuss Q3 FY26 financial and operational performance under Regulation 30 compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1768374148120,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kalyan Jewellers Appoints Two Independent Directors",
            "Summary": "Kalyan Jewellers India Limited announced the appointment of Ms. Radhika Ramani and Mr. C.R. Rajagopal as Additional Directors (Non-Executive & Independent) for a five-year term until January 13, 2031.",
            "Sentiment": "positive",
            "PublishDate": 1768368952783,
            "Source": "stocks"
        },
        {
            "Title": "Kalyan Jewellers Appoints Two Independent Directors",
            "Summary": "Kalyan Jewellers India Limited appointed Ms. Radhika Ramani and Mr. C.R Rajagopal as Additional Directors (Non-Executive & Independent) for a five-year term effective January 14, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768368599452,
            "Source": "stocks"
        },
        {
            "Title": "Kalyan Jewellers Q3 revenue surges 42% on festive demand",
            "Summary": "Kalyan Jewellers reports 42% consolidated revenue growth in Q3 FY26 driven by strong festive demand. Digital platform Candere records exceptional 147% growth while international operations expand 36%.",
            "Sentiment": "positive",
            "PublishDate": 1767795550857,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kalyan Jewellers stock zooms 7% on Q3 revenue surge",
            "Summary": "Kalyan Jewellers shares jumped 7% as Q3 FY26 revenue grew 42% driven by festive demand. Jewellery sector rallied with Titan up 5% and Senco Gold leading gains at 15%.",
            "Sentiment": "positive",
            "PublishDate": 1767754220386,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kalyan Jewellers' Candere Platform Surges 147% YoY",
            "Summary": "Kalyan Jewellers' digital platform Candere demonstrates exceptional growth momentum with approximately 147% year-over-year revenue increase, highlighting the company's successful digital transformation strategy.",
            "Sentiment": "positive",
            "PublishDate": 1767754195549,
            "Source": "stocks"
        },
        {
            "Title": "Kalyan Jewellers Allots 1.1 Lakh Equity Shares Under Employee Stock Option Plan",
            "Summary": "Kalyan Jewellers allotted 1,10,071 equity shares of face value Rs. 10 each to eligible employees upon exercise of vested options under ESOP 2020. The allotted shares will rank equally with existing equity shares and the company is completing formalities for listing these shares on NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1764067792664,
            "Source": "corporate_action"
        },
        {
            "Title": "Kalyan Jewellers Seeks Shareholder Approval to Double Employee Stock Options to 60 Lakh",
            "Summary": "Kalyan Jewellers India Limited has issued a postal ballot notice seeking shareholder approval to amend its Employee Stock Option Plan 2020 (ESOP 2020). The company proposes to increase the aggregate number of employee stock options from 30 lakh to 60 lakh, exercisable into an equal number of equity shares with face value of Rs. 10 each. The e-voting period runs from November 15, 2025 to December 14, 2025, with results to be declared by December 16, 2025. The cut-off date for eligible voting members is November 8, 2025. The amendment requires special resolution approval and aims to provide opportunities for more employees to participate in the company's growth. Each option converts to one equity share upon exercise, with a maximum of 12 lakh options per employee. The exercise period spans 5 years from vesting date, with vesting occurring between 1-3 years from grant date.",
            "Sentiment": "positive",
            "PublishDate": 1763016903835,
            "Source": "corporate_action"
        },
        {
            "Title": "Kalyan Jewellers Reports Strong Q2 Performance with Net Profit Doubling Year-on-Year",
            "Summary": "Kalyan Jewellers India reported consolidated net profit of 2.61 billion rupees in Q2, compared to 1.31 billion rupees in the same quarter last year. Revenue increased to 78.56 billion rupees from 60.58 billion rupees year-on-year. EBITDA rose to 4.97 billion rupees versus 3.2 billion rupees, while EBITDA margin improved to 6.33% from 5.27% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762733507421,
            "Source": "earnings"
        },
        {
            "Title": "Kalyan Jewellers Projects 18-20% Revenue Growth in FY26 with Aggressive Store Expansion Plan",
            "Summary": "Kalyan Jewellers has projected revenue growth of 18-20% for FY26, supported by store expansion across India and the Middle East. The company plans to add 30 new stores annually, including franchise outlets. The jewellery retailer expects margin stability through gold exchange programs and premiumization strategies. The company is focusing on omni-channel integration and working capital optimization to support long-term value creation.",
            "Sentiment": "positive",
            "PublishDate": 1762526237419,
            "Source": "stock"
        },
        {
            "Title": "Kalyan Jewellers Net Profit Doubles to ₹260 Crore on Strong Revenue Growth",
            "Summary": "Kalyan Jewellers India Ltd reported a 99.5% year-on-year increase in net profit to ₹260 crore for the quarter ended September 2025, compared to ₹130 crore in the same period last year. Revenue from operations grew 37.4% to ₹7,856 crore from ₹6,057 crore year-on-year. EBITDA increased 55.8% to ₹497.1 crore against ₹319 crore in the same quarter last year, with EBITDA margin improving to 6.3% from 5.3% in the corresponding period. Shares ended at ₹512.75, up ₹0.25 or 0.049% on the BSE.",
            "Sentiment": "positive",
            "PublishDate": 1762512742403,
            "Source": "earnings"
        },
        {
            "Title": "Kalyan Jewellers Announces Q2 Financial Results Release Date",
            "Summary": "Kalyan Jewellers has announced that it will release its Q2 financial results on November 7. The jewelry retailer has scheduled this date for the disclosure of its quarterly performance metrics.",
            "Sentiment": "neutral",
            "PublishDate": 1759987735073,
            "Source": "earnings"
        },
        {
            "Title": "Kalyan Jewellers Reports Slowest Growth in Four Quarters Despite Festive Boost",
            "Summary": "Kalyan Jewellers reported consolidated revenue growth in the September quarter, marking its lowest sales growth in four quarters. India operations grew 31% year-on-year with same-store sales growth of 16%, both lower than the previous year. International operations, representing 12% of consolidated revenue, grew 17% with Middle East revenue up 10% driven by same-store sales. The company attributed growth to strong festive and wedding seasons. Candere, the digital-first brand, delivered standout performance with 127% revenue growth driven by increased footfalls and website traffic. Kalyan expanded by opening 15 new showrooms in India, two in the Middle East, and 15 Candere outlets domestically, bringing total store count to 436 with about 300 in India. The company received approval to release real estate collateral tied to repaid debt and resumed debt reduction aligned with FY2026 targets.",
            "Sentiment": "neutral",
            "PublishDate": 1759718145625,
            "Source": "earnings"
        },
        {
            "Title": "Warburg Pincus in Talks to Acquire 10% Stake in Kalyan Jewellers' Candere Unit",
            "Summary": "Global private equity firm Warburg Pincus is in discussions to purchase a 10% stake in Candere, the lifestyle unit of Kalyan Jewellers. The potential deal is valued between ₹800-850 crore. The transaction would involve Warburg Pincus acquiring a minority stake in the jewelry retailer's digital and lifestyle segment.",
            "Sentiment": "positive",
            "PublishDate": 1756870426554,
            "Source": "order&deals"
        },
        {
            "Title": "Kalyan Jewellers Sets Record Date for Final Dividend and AGM",
            "Summary": "Kalyan Jewellers India Limited has set September 5, 2025, as the record date for determining shareholder eligibility for the final dividend and participation in the 17th Annual General Meeting scheduled for September 12, 2025. The Board has recommended a final dividend of 15% (₹1.50 per share), subject to shareholder approval at the AGM. If approved, the dividend will be paid within 30 days from the date of approval. The AGM will be conducted through video conferencing in compliance with regulatory requirements.",
            "Sentiment": "positive",
            "PublishDate": 1754917042775,
            "Source": "corporate_action"
        },
        {
            "Title": "Kalyan Jewellers Reports 31% Revenue Growth and 49% PAT Growth in Q1 FY26",
            "Summary": "Kalyan Jewellers India Limited reported consolidated revenue of INR 7,268 crores for Q1 FY26, representing 31% growth over the previous year. Consolidated profit after tax increased 49% to INR 264 crores from INR 178 crores. The India business achieved 31% revenue growth to INR 6,142 crores with PAT growing 55% to INR 256 crores. The company's FOCO (franchise-owned, company-operated) revenue share reached 43% as of June 30, 2025. Management announced plans to launch a third retail format focusing on regional brands, with the first regional brand expected before the end of calendar year 2025. The company has paused debt reduction to facilitate release of INR 200 crores worth of collaterals from banks. A pilot project involving leaner credit periods with vendors showed higher returns than corporate ROCE, with plans to implement this strategy across operations requiring INR 1,500-2,000 crores in working capital. Candere, the company's e-commerce business, posted revenue of INR 66 crores versus INR 39 crores in the previous year, with management expecting it to reach PAT neutral by year-end.",
            "Sentiment": "positive",
            "PublishDate": 1754887742724,
            "Source": "earnings"
        },
        {
            "Title": "Kalyan Jewellers Temporarily Pauses Debt Reduction to Release Land Collateral",
            "Summary": "Kalyan Jewellers has temporarily halted its debt reduction strategy to focus on releasing non-core land assets used as bank collateral. Executive Director Ramesh Kalyanaraman described this as a strategic pause rather than a permanent stop. The company reduced debt by over Rs 500 crore in the last year and a half and is working to release Rs 200 crore worth of collateral through bank paperwork. The company plans to resume debt repayment within a couple of months once the collateral is released. Despite the pause, Kalyan Jewellers continues its expansion plans with a new jewellery line targeting regional markets and plans to open five showrooms in the next 12 months, requiring Rs 300 crore capex including inventory. The company is developing a jewellery park in Kerala for contract manufacturers and has piloted a lean credit procurement model, reducing average credit period from 30-32 days to about one-third of that duration. Management expects margins to exceed 7% and ROCE to grow organically by 1-2% annually through asset-light expansion and operating leverage.",
            "Sentiment": "positive",
            "PublishDate": 1754755889294,
            "Source": "stock"
        },
        {
            "Title": "Kalyan Jewellers Assures New Ventures Won't Impact ROCE, Receives Subsidized Land from Kerala",
            "Summary": "Kalyan Jewellers has assured that its new ventures will not reduce the company's Return on Capital Employed (ROCE). The company received subsidized land worth Rs 5 crore from the Kerala government with minimal construction costs. The jeweller stated it has no plans for in-house manufacturing and is reevaluating its previous credit period policy.",
            "Sentiment": "positive",
            "PublishDate": 1754630710530,
            "Source": "stock"
        },
        {
            "Title": "Kalyan Jewellers Shares Drop 9% Despite Strong Quarterly Results and Citi's ₹700 Target Price",
            "Summary": "Kalyan Jewellers shares declined 9% to ₹551.90 despite opening higher at ₹615.65. The Kerala-based jewellery maker reported strong quarterly performance with 31% revenue growth year-on-year and 18% same-store sales growth in India. EBITDA and profit before tax increased 35% and 49% respectively, exceeding Citi's estimates by 9% and 14%. Citi maintained a 'Buy' rating and raised its price target to ₹700. The company is implementing a 'lean credit procurement' pilot project that could require ₹1,500-2,000 crore capital infusion if rolled out company-wide. Management plans to open five stores under a regional brands strategy and has paused debt reduction to monetize real estate collateral. Executive Director Ramesh Kalyanaraman expressed optimism about the upcoming festive season despite gold price volatility. Eight out of nine analysts covering the stock have 'Buy' ratings. The stock has fallen 27% in 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754626784803,
            "Source": "stock"
        },
        {
            "Title": "Kalyan Jewellers Reports 48% Jump in Q1 Net Profit to 2.64 Billion Rupees",
            "Summary": "Kalyan Jewellers India reported consolidated net profit of 2.64 billion rupees in Q1, up from 1.78 billion rupees in the same period last year. Revenue increased to 73 billion rupees from 55.35 billion rupees year-on-year. EBITDA rose to 5.08 billion rupees compared to 3.76 billion rupees previously, while EBITDA margin improved to 6.99% from 6.79% in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1754561967338,
            "Source": "earnings"
        },
        {
            "Title": "Kalyan Jewellers Plans 170 New Stores via Franchise Model to Cut Debt by Rs 300 Crore",
            "Summary": "Kalyan Jewellers plans to open 170 stores through franchise model, with 90 Kalyan stores (including 7 overseas in UK, US and Middle East) and 80 Candere lifestyle jewellery stores. The company currently operates 406 showrooms across India and Middle East. The franchise expansion strategy aims to reduce debt by Rs 300 crore, primarily targeting Gold Metal Loan liabilities, following last year's Rs 400 crore debt reduction. Domestic expansion will focus on non-south markets including tier I-IV cities. The company has allocated Rs 350-400 crore capex for maintenance and inventory. Kalyan Jewellers reported consolidated net revenue of Rs 5,557.63 crore in the first quarter and holds 8-9% market share in the organised segment. The company plans to establish a contract manufacturing hub in Thrissur and is exploring opportunities in Australia, Malaysia, and Singapore.",
            "Sentiment": "positive",
            "PublishDate": 1754204631819,
            "Source": "stock"
        },
        {
            "Title": "Kalyan Jewellers: JM Financial Initiates Coverage with Buy Rating and Rs 700 Target",
            "Summary": "JM Financial has initiated coverage on Kalyan Jewellers with a 'buy' rating and a target price of Rs 700, implying a 19.4% upside. The brokerage cites strong store expansion strategy, improving financials, and favorable industry trends. Kalyan's franchise-led model is enabling rapid scale-up, with plans for 85-90 new stores annually through FY28. The company is expected to see 25% revenue CAGR and 31% PAT CAGR from FY25 to FY28.",
            "Sentiment": "positive",
            "PublishDate": 1752563986000,
            "Source": "normal_news"
        },
        {
            "Title": "Kalyan Jewellers: Q1 Revenue Surges 31%, Stock Dips 3.6%",
            "Summary": "Kalyan Jewellers reported 31% YoY growth in Q1FY26 consolidated revenue. India operations saw 31% growth with 18% same-store-sales increase. International revenue grew 31%, Middle East up 26%. Digital brand Candere's revenue rose 67%. Company added 19 new showrooms, plans 170 more in FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1751954742000,
            "Source": "result"
        },
        {
            "Title": "Kalyan Jewellers: 31% Revenue Growth in Q1 FY26, Driven by Akshaya Tritiya and Wedding Season",
            "Summary": "Kalyan Jewellers reported 31% YoY consolidated revenue growth in Q1 FY26. Indian operations grew 31% with 18% same-store-sales-growth. International operations, including Middle East, also grew 31%. The company opened 10 new showrooms in India, 1 in the US, and 8 Candere showrooms. Plans to launch 170 showrooms in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1751862853000,
            "Source": "result"
        },
        {
            "Title": "Kalyan Jewellers Reports 31% Revenue Growth in Q1",
            "Summary": "Kalyan Jewellers has reported a 31% year-over-year revenue growth in the first quarter, despite challenges from gold price fluctuations and global tensions. The company's performance in this period demonstrates resilience in the face of market volatility.",
            "Sentiment": "positive",
            "PublishDate": 1751856458000,
            "Source": "default"
        },
        {
            "Title": "Kalyan Jewellers India Ltd: Citi Maintains 'Buy' Rating with ₹650 Target",
            "Summary": "Citi reaffirms 'Buy' rating on Kalyan Jewellers with a ₹650 price target. The company plans 90 new stores in FY26, reports strong demand, and aims to repay ₹350 crore debt. Q4 results show 36.5% YoY profit increase to ₹187.6 crore and 36.6% revenue growth to ₹6,181.5 crore. Final dividend of ₹1.50 per share announced for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1750314215000,
            "Source": "earnings"
        },
        {
            "Title": "Kalyan Jewellers: Q4 Profit Surges 36%, Announces Dividend Amid Market Tension",
            "Summary": "Kalyan Jewellers reported a 36% YoY increase in Q4 FY25 consolidated net profit to ₹188 crore. Operating revenue rose 37% to ₹6,182 crore. The company announced a final dividend of ₹1.50 per share. Shares gained up to 3% despite market decline due to India-Pakistan conflict.",
            "Sentiment": "positive",
            "PublishDate": 1746771426000,
            "Source": "result"
        },
        {
            "Title": "Kalyan Jewellers: Q4 Net Profit Surges 36% YoY to Rs 188 Crore",
            "Summary": "Kalyan Jewellers reported strong Q4FY25 results with consolidated revenue up 37% YoY to Rs 6,182 crore and net profit rising 36% YoY to Rs 188 crore. India operations saw 38% YoY revenue growth, while Middle East revenue increased 26% YoY. Full-year FY25 consolidated revenue grew 35% to Rs 25,045 crore with net profit up 20% to Rs 714 crore.",
            "Sentiment": "positive",
            "PublishDate": 1746761927000,
            "Source": "earnings"
        },
        {
            "Title": "Kalyan Jewellers Announces Expansion Plans and Profit Margin Targets",
            "Summary": "Kalyan Jewellers has set a target for profit before tax (PBT) margins to exceed 5%. The company also plans to expand its Candere brand by launching 80 new showrooms across India during the current financial year. These showrooms will be a mix of franchise-owned company-operated (FOCO) and company-owned company-operated (COCO) models.",
            "Sentiment": "positive",
            "PublishDate": 1746761714000,
            "Source": "default"
        },
        {
            "Title": "Kalyan Jewellers Plans Debt Reduction and Expansion",
            "Summary": "Kalyan Jewellers expects to reduce its debt in India by ₹350-400 crore during the current financial year. The company also plans to open 170 new showrooms across its Kalyan and Candere formats in the same period.",
            "Sentiment": "positive",
            "PublishDate": 1746761368000,
            "Source": "default"
        },
        {
            "Title": "Kalyan Jewellers Reports Strong Q4 FY23 Results, Declares Dividend",
            "Summary": "Kalyan Jewellers India announced its Q4 FY23 financial results. The company's consolidated net profit increased to 1.88 billion rupees, up from 1.38 billion rupees year-over-year. Revenue for the quarter rose to 61.8 billion rupees from 45.3 billion rupees in the same period last year. The company has recommended a final dividend of 1.50 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746749142000,
            "Source": "default"
        },
        {
            "Title": "Kalyan Jewellers: FY25 Profit Rises 20%, Revenue Up 35%",
            "Summary": "Kalyan Jewellers reported consolidated revenue of Rs 25,045 crore in FY25, up 35% year-over-year. Consolidated Profit After Tax increased by 19.79% to Rs 714 crore. Q4 FY25 saw 37% revenue growth and 36% PAT growth. Indian operations and Middle East segment both showed strong growth. The company's Candere platform recorded revenue of 28 crore with a net loss of 12 crore in Q4.",
            "Sentiment": "positive",
            "PublishDate": 1746716644000,
            "Source": "earnings"
        },
        {
            "Title": "Kalyan Jewellers: Q4 Profit and Revenue Surge Over 36%, Dividend Declared",
            "Summary": "Kalyan Jewellers reported a 36.5% YoY increase in Q4 net profit to ₹187.6 crore. Revenue rose 36.6% YoY to ₹6,181.5 crore. EBITDA grew 34.8% to ₹399 crore. The company declared a final dividend of ₹1.50 per share for FY2025.",
            "Sentiment": "positive",
            "PublishDate": 1746701279000,
            "Source": "earnings"
        },
        {
            "Title": "Kalyan Jewellers: Q4 Profit Soars 36%, Announces Dividend",
            "Summary": "Kalyan Jewellers reported a 36% YoY increase in Q4 FY25 consolidated net profit to ₹188 crore. Revenue from operations rose 37% YoY to ₹6,182 crore. For FY25, consolidated revenue grew 35% to ₹25,045 crore, with PAT at ₹714 crore. The company announced a dividend of ₹1.50 per share.",
            "Sentiment": "positive",
            "PublishDate": 1746701046000,
            "Source": "result"
        },
        {
            "Title": "Kalyan Jewellers: Q4 Results Date Set, Dividend Decision Pending",
            "Summary": "Kalyan Jewellers to announce Q4 and FY25 results on May 8, 2025. Board to consider final dividend recommendation. Earnings call scheduled for 5 p.m. on the same day. Trading window closed for designated persons until 48 hours post-results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1746599241000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kalyan Jewellers Reports Strong Q4 Performance",
            "Summary": "Kalyan Jewellers has reported impressive growth in Q4, with a 21% increase in same-store sales. The company's Middle East operations have shown even stronger performance, with revenue growth of approximately 24% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1743994575000,
            "Source": "result"
        },
        {
            "Title": "Kalyan Jewellers Reports Strong Q4 FY2025 Revenue Growth",
            "Summary": "Kalyan Jewellers has announced impressive financial results for the fourth quarter of fiscal year 2025. The company reported a consolidated revenue growth of approximately 37% year-over-year. Additionally, their India operations witnessed a revenue growth of about 39% compared to the same period in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1743994433000,
            "Source": "earnings"
        },
        {
            "Title": "Kalyan Jewellers India Limited: Stock Declines Amid US Tariff Concerns",
            "Summary": "Kalyan Jewellers' stock fell 0.83% to ₹506.85 on NSE. The company disclosed no new encumbrances by promoters. Market sentiment affected by new US tariffs potentially impacting India's jewellery exports. The 26% reciprocal tariff could increase costs for US retailers by 20% on Indian fine jewellery.",
            "Sentiment": "negative",
            "PublishDate": 1743662984000,
            "Source": "normal_news"
        },
        {
            "Title": "Kalyan Jewellers Enters Loan Agreement with UK Subsidiary",
            "Summary": "Kalyan Jewellers has entered into a loan agreement with its wholly-owned subsidiary, Kalyan Gold & Diamond Jewellery, located in the United Kingdom. This financial arrangement suggests potential expansion or operational support for the company's UK operations.",
            "Sentiment": "neutral",
            "PublishDate": 1741957338000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kalyan Jewellers: Stock Rebounds, Snapping Three-Day Losing Streak",
            "Summary": "Kalyan Jewellers share price gained 3.5% in morning trades, reaching an intraday high of ₹421.85, despite overall market weakness. The stock had previously corrected 13% since March 5th and is down 47% year-to-date. The company recently outlined principles for fair disclosure of unpublished price sensitive information.",
            "Sentiment": "neutral",
            "PublishDate": 1741681254000,
            "Source": "normal_news"
        },
        {
            "Title": "Kalyan Jewellers: Promoters Create Additional Stock Pledge",
            "Summary": "Kalyan Jewellers' share price declined following the announcement that the company's promoters have created an additional pledge on their stake.",
            "Sentiment": "negative",
            "PublishDate": 1738815900000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kalyan Jewellers: Promoters Create Additional Share Pledge",
            "Summary": "Promoters of Kalyan Jewellers India Ltd. created an additional pledge on 2.5 crore shares on February 3, increasing the total pledge in favor of KJG Consulting to 10.73% from 8.26%. The pledge is for issuing Non-Convertible Debentures. The company's shares are trading 2.5% lower following this news.",
            "Sentiment": "negative",
            "PublishDate": 1738815352000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kalyan Jewellers: Share Price Surges 28.5% in Six Sessions",
            "Summary": "Kalyan Jewellers' share price increased by 28.5% over the last six sessions. The company reported a 21.23% rise in consolidated net profit and a 40% increase in total revenue for Q3 FY2024-25. Today's trading saw the stock open at ₹567.85 on BSE, reaching an intraday high of ₹571.60 and low of ₹552.40.",
            "Sentiment": "positive",
            "PublishDate": 1738727769000,
            "Source": "earnings"
        },
        {
            "Title": "Kalyan Jewellers: Shares Surge 15% in Single-Day Rally",
            "Summary": "Kalyan Jewellers stock rises 15% to ₹578.25, marking a 35% increase from recent lows. The company reported 24% Same-Store Sales Growth in Q4, added 24 new showrooms, and saw 16% growth in Middle East business. Retail investors increased to 5.6 lakh, and mutual fund holdings stand at 11.75%.",
            "Sentiment": "positive",
            "PublishDate": 1738662641000,
            "Source": "normal_news"
        },
        {
            "Title": "Kalyan Jewellers: Share Price Rallies on Budget Duty Cut",
            "Summary": "Kalyan Jewellers' stock extends post-budget rally for the third session, rising 3% intraday. The surge is attributed to the government's proposal to reduce customs duty on jewelry from 25% to 20%. The company recently reported a 21.2% increase in Q3 net profit.",
            "Sentiment": "positive",
            "PublishDate": 1738565066000,
            "Source": "normal_news"
        },
        {
            "Title": "Kalyan Jewellers: Margin Expansion Expected from FY27 with COCO Model",
            "Summary": "Kalyan Jewellers anticipates margin expansion from FY27 as it transitions to the Company-Owned Company-Operated (COCO) model. Current expansion focuses on the FOCO model, causing temporary margin contraction. Q3 performance was strong with 44% PAT growth, excluding customs duty impact. The company plans to repay Rs 150 crore debt this year and may consider buybacks or opening owned stores after debt repayment.",
            "Sentiment": "positive",
            "PublishDate": 1738301142000,
            "Source": "earnings"
        },
        {
            "Title": "Kalyan Jewellers India Ltd: Stock Rises 5% Post Q3 Results, Management Guides Better Earnings",
            "Summary": "Kalyan Jewellers' stock rose 5% after Q3 results. Management guided for better earnings and store openings next year. Citi reduced target price to Rs 650 but sees 47.5% return potential. Company plans to repay Rs 150 crore debt, add 90 stores by FY26, and expects PBT growth to outpace revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1738296575000,
            "Source": "earnings"
        }
    ]
}