{
    "Symbol": "KAMATHOTEL",
    "ISIN": "INE967C01018",
    "News": [
        {
            "Title": "Kamat Hotels Board Meet on Feb 3 for Q3FY26 Results",
            "Summary": "Kamat Hotels (India) Limited has scheduled a board meeting on February 03, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769583259175,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kamat Hotels Reports 12% Revenue Decline in Q2 FY26, Maintains INR 400 Crore Annual Guidance",
            "Summary": "Kamat Hotels India Limited reported consolidated revenue of INR 75 crores for Q2 FY26, representing a 12% year-on-year decline. EBITDA fell 63% to INR 8 crores with margins at 10.43%, and the company posted a loss of INR 30 lakhs compared to INR 8 crores profit in the previous year's quarter. For H1 FY26, revenue remained flat at INR 158 crores with EBITDA declining 28% to INR 26 crores. The company attributed poor performance to multiple factors including road washouts affecting Shimla and Manali properties, pre-opening expenses for 5 new hotels adding 280 rooms, renovation work at Orchid Pune impacting MICE business, and monsoon-related revenue drops in Mumbai and Maharashtra. Despite challenges, management maintains confidence in achieving INR 400 crore annual revenue guidance, citing strong Q3 wedding season bookings and improved performance from previously opened hotels. The company now operates 24 properties with 2,100 rooms and withdrew a pending merger proposal due to regulatory delays.",
            "Sentiment": "negative",
            "PublishDate": 1762933105872,
            "Source": "earnings"
        },
        {
            "Title": "Kamat Hotels Submits Q2 FY26 Investor Presentation to Stock Exchanges",
            "Summary": "Kamat Hotels (India) Limited submitted its investor presentation for Q2 and H1 FY26 results to BSE and NSE. The company operates 24 properties with 2,100 keys across 9 states under 5 brands including The Orchid, IRA by Orchid, Lotus Resorts, Fort Jadhav Gadh, and Mahodadhi Palace. For Q2 FY26, operational income was INR 826 million compared to INR 854 million in Q2 FY25, showing a decline of 3.3%. EBITDA dropped to INR 180 million from INR 224 million, with margins falling to 21.79% from 26.22%. The company reported a PAT of INR 39 million versus INR 82 million in the previous year. For H1 FY26, operational income was INR 1,578 million with EBITDA of INR 259 million and PAT of INR 22 million. The company has 9 new properties with 700 keys in pipeline and plans to expand to 26 properties with 2,500 keys by FY26 under its KHIL 3.0 strategy. Recent launches include properties in Panchgani, Rishivan, Hyderabad, Dwarka, and Porvorim.",
            "Sentiment": "neutral",
            "PublishDate": 1762604130945,
            "Source": "earnings"
        },
        {
            "Title": "Kamat Hotels Reports Q2 Net Loss of 29.4M Rupees Against Previous Year's Profit",
            "Summary": "Kamat Hotels (India) reported a net loss of 29.4 million rupees in Q2, compared to a profit of 83.5 million rupees in the same quarter last year. Revenue declined to 7.51 billion rupees from 8.54 billion rupees year-over-year. EBITDA dropped significantly to 78.3 million rupees from 224.6 million rupees, while EBITDA margin compressed to 10.43% from 26.32% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762591366266,
            "Source": "earnings"
        },
        {
            "Title": "Kamat Hotels Reports 385.01 Lakh Profit in Q2 FY26, Withdraws Merger Scheme",
            "Summary": "Kamat Hotels (India) Limited reported a standalone profit of 385.01 lakhs for the quarter ended September 30, 2025, compared to 849.82 lakhs in the previous quarter. Revenue from operations declined to 5,085.04 lakhs from 5,615.98 lakhs in the prior quarter. The company's Board approved the withdrawal of a merger scheme involving Savarwadi Rubber Agro Private Limited and Treeo Resort Private Limited, citing prolonged delays in the approval process. The company settled a legal matter for 250 lakhs during the quarter, which was disclosed as exceptional income. Basic earnings per share stood at 1.27 for the quarter. The company continues to operate its Lotus Resort-Konark unit despite lease extension being granted only until September 2025, with management expecting further extension based on ongoing discussions with the Government of Odisha.",
            "Sentiment": "neutral",
            "PublishDate": 1762590927681,
            "Source": "earnings"
        },
        {
            "Title": "Kamat Hotels Schedules Earnings Conference Call for Q2/H1-FY2026 Results",
            "Summary": "Kamat Hotels (India) Limited will host an earnings conference call on November 10, 2025, at 12:30 p.m. IST to discuss its unaudited standalone and consolidated financial results for the second quarter and half year ended September 30, 2025. The call will be organized by Valorem Advisors and attended by Executive Director Vishal Vithal Kamat, Chief Financial Officer Smita Nanda, and Company Secretary Nikhil Singh. Dial-in details have been provided for investors and analysts, with access numbers for multiple countries including the US, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1762415809233,
            "Source": "earnings"
        },
        {
            "Title": "Kamat Hotels Opens Two New IRA by Orchid Properties in Dwarka and Goa, Adding 93 Keys",
            "Summary": "Kamat Hotels (India) Limited opened two new properties under its IRA by Orchid brand - IRA by Orchid in Dwarka, Gujarat with 50 keys and IRA by Orchid Porvorim in Goa with 43 keys. Both properties operate under management contract models and add 93 new keys to KHIL's portfolio. The Dwarka property is located near Dwarkadhish Temple and Arabian Sea, featuring banqueting facilities and a restaurant serving Gujarati, North Indian, and international cuisines. The Goa property offers a multi-cuisine restaurant, poolside bar, and event spaces for weddings and corporate gatherings. Executive Chairman Dr. Vithal Venketesh Kamat stated the launches strengthen the company's presence in India's pilgrimage circuit and leisure tourism segment. Executive Director Vishal Vithal Kamat noted the expansion brings the company closer to offering Orchid hospitality across India's iconic destinations. KHIL operates over 2,100 keys across various cities in India.",
            "Sentiment": "positive",
            "PublishDate": 1760772677015,
            "Source": "stock"
        },
        {
            "Title": "Kamat Hotels Shareholders Approve Re-appointment of Independent Director and New Secretarial Auditors",
            "Summary": "Kamat Hotels shareholders approved two key appointments at their 38th Annual General Meeting held on September 26, 2025. Mr. Vilas Ramchandra Koranne was re-appointed as an Independent Director for a second five-year term from June 29, 2026, to June 28, 2031. Koranne holds a B.E. (Civil) from Bombay University and worked for 33 years at M.C.G.M. in various engineering positions before joining Kamat Hotels' board in June 2021. He holds no shares in the company and has no relationships with other directors. Additionally, M/s. DM & Associates, Company Secretaries LLP was appointed as Secretarial Auditors for five years from April 1, 2025, to March 30, 2030, replacing their previous tenure that ended March 31, 2025. The firm is a Limited Liability Partnership with six partners providing corporate law services across various sectors including Companies Act, FEMA, SEBI regulations, and foreign direct investments.",
            "Sentiment": "neutral",
            "PublishDate": 1758975891985,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kamat Hotels Opens 70-Room Orchid Hotel in Panchgani",
            "Summary": "Kamat Hotels (India) Limited opened The Orchid Hotel in Panchgani, Maharashtra, featuring 70 rooms including 47 guest rooms and 23 luxury tent accommodations. The property operates under a leased model and includes amenities such as a swimming pool, 20,000 square feet of landscaped lawn, banquet facilities, and a multi-cuisine restaurant. Located in the Sahyadri ranges, the eco-friendly hotel targets destination weddings, corporate events, and leisure travelers. Executive Chairman Dr. Vithal Venkatesh Kamat highlighted Panchgani's popularity as a leisure destination, while Executive Director Vishal Vithal Kamat emphasized the property's potential as a wedding and celebration venue. The opening strengthens the company's presence in Maharashtra's hill-station segment, adding to its portfolio of 1,900+ operational keys across various Indian cities.",
            "Sentiment": "positive",
            "PublishDate": 1758693150166,
            "Source": "stock"
        },
        {
            "Title": "Kamat Hotels Opens Two New Properties in Rishikesh and Hyderabad, Adding 117 Keys",
            "Summary": "Kamat Hotels (India) Limited has opened two new properties: The Orchid Rishivan Hotel in Rishikesh and IRA by Orchid Hotel in Hyderabad, adding 117 new keys to their portfolio. The Rishikesh property features 54 elegantly designed rooms with amenities including a spa, swimming pool, recreation centre, conference room and yoga space next to a centuries-old Shivling temple, operating under a revenue sharing model. The Hyderabad property offers 63 modern rooms with contemporary dining facilities under a leased model. Executive Chairman Dr. Vithal Venkatesh Kamat stated the launches highlight their dual focus on eco-luxury in India's spiritual heartland while expanding their contemporary hospitality brand in a vibrant metro. Executive Director Vishal Vithal Kamat noted that Rishikesh taps into rising demand for wellness tourism and destination weddings, while Hyderabad positions them to serve the corporate and social events market. The company operates 1,800+ keys across various cities including Mumbai, Pune, Nashik, Jamnagar, Bhubaneshwar, Konark, Puri, Shimla, Manali, Goa, Ayodhya and Noida.",
            "Sentiment": "positive",
            "PublishDate": 1758527647549,
            "Source": "stock"
        },
        {
            "Title": "Kamat Hotels Expects Demand Boost from Proposed GST Rate Cuts",
            "Summary": "The hospitality industry anticipates increased demand following proposed GST simplification and rate reductions. Vishal Vithal Kamat, executive director of Kamat Hotels India Ltd, believes lower GST rates will encourage customer spending and strengthen India's tourism positioning. He noted that the current 18% GST rate on hotels makes India less competitive compared to destinations like Thailand and Taiwan, potentially causing loss of foreign tourists. While restaurants benefit from a 5% GST rate, Kamat emphasized that rationalizing higher tax brackets is essential for attracting travelers and increasing forex inflows. He expects the changes to drive premiumization trends and alter customer behavior, particularly among repeat visitors who may upgrade to better products. Despite a soft first quarter, Kamat projects strong growth through September-November as consumers will have more disposable income. The GST Council is scheduled to decide on rate cuts for over 150 items during its September 3-4 meeting, with proposals to shift items from 12% and 18% slabs to 5% or nil GST categories.",
            "Sentiment": "positive",
            "PublishDate": 1756859679947,
            "Source": "stock"
        },
        {
            "Title": "Kamat Hotels Signs Agreement for Second North Goa Property Under IRA by Orchid Brand",
            "Summary": "Kamat Hotels (India) Limited has signed a management agreement to operate a second luxury hotel in North Goa under the 'IRA by Orchid Hotel' brand. The 43-room property will feature amenities including a banquet hall, swimming pool, two in-house restaurants, and health club. The hotel is scheduled to become operational by September 30, 2025. Executive Chairman Dr. Vithal Kamat described this as another milestone in the company's growth journey under the IRA by Orchid brand, emphasizing their commitment to eco-friendly hospitality experiences. Executive Director Vishal Kamat noted that the property is designed to serve both leisure and business guests with sustainable hospitality experience.",
            "Sentiment": "positive",
            "PublishDate": 1755596678031,
            "Source": "stock"
        },
        {
            "Title": "Kamat Hotels Reports 12% Revenue Growth in Q1 FY26, Plans to Expand to 30 Hotels",
            "Summary": "Kamat Hotels (India) Limited reported consolidated revenue of INR 83 crores for Q1 FY26, representing 12% year-on-year growth. EBITDA increased 37% to INR 18 crores with a margin of 21.91%, while profit after tax surged 291% to INR 4 crores. The company currently operates 19 hotels with approximately 1,825 rooms and plans to expand to 30 operational hotels by year-end, adding properties in Rishikesh, Dwarka, Bhavnagar, Panchgani, Nashik, Hyderabad, Dehradun, and Gwalior. Executive Director Vishal Kamat noted that election-related disruptions in May affected performance but the company maintains revenue guidance of INR 400 crores for FY26. The company has achieved debt-free status and expects to reach INR 500 crores revenue in FY27. New properties include Orchid Rishikesh opening in August with targeted ARR of INR 15,000, and expansion focuses on premium wedding destinations and larger inventory hotels.",
            "Sentiment": "positive",
            "PublishDate": 1754391628537,
            "Source": "earnings"
        },
        {
            "Title": "Kamat Hotels Plans 37% Room Growth by FY26 with 7 New Properties and Debt Reduction Target",
            "Summary": "Kamat Hotels has outlined expansion plans targeting 37% room growth by FY26 through the addition of 7 new properties. The company's strategy includes focusing on digital sales channels and brand expansion while aiming to reduce debt to ₹500 million to support profitable growth across the country.",
            "Sentiment": "positive",
            "PublishDate": 1753971717340,
            "Source": "stock"
        },
        {
            "Title": "Kamat Hotels Reports Strong Q1 Performance with 36% Jump in EBITDA",
            "Summary": "Kamat Hotels delivered robust quarterly results with EBITDA rising to 181 million rupees from 133 million rupees year-over-year. The company's EBITDA margin improved to 22% compared to 18% in the same period last year. Consolidated net profit surged to 36 million rupees from 11 million rupees year-over-year, while revenue grew to 826 million rupees from 737 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753953865514,
            "Source": "earnings"
        },
        {
            "Title": "Kamat Hotels Signs Lease Agreement for 70-Room Luxury Resort in Panchgani Under The Orchid Brand",
            "Summary": "Kamat Hotels (India) Limited has signed a lease agreement to manage and operate a luxury hotel and park resort in Panchgani, Maharashtra, under The Orchid Hotel brand. The property will feature 70 rooms, including 47 guest rooms and 23 luxury tent accommodations, along with amenities such as a swimming pool, 20,000 square feet of open lawn, banquet hall, and multi-cuisine restaurant. The resort is positioned as a premium leisure destination for tourists, corporate retreats, and wedding events. The property is expected to be fully operational by September 2025. Dr. Vithal Kamat, Executive Chairman & Managing Director, stated this addition reinforces the company's presence in Maharashtra by bringing sustainable luxury to Panchgani's hills.",
            "Sentiment": "positive",
            "PublishDate": 1753871783750,
            "Source": "stock"
        },
        {
            "Title": "High Court Orders Release of Funds to Kamat Hotels",
            "Summary": "The High Court has directed the release of 156.7 million rupees to Kamat Hotels (India). As part of the order, the company is required to deposit 50 million rupees with the Directorate of Enforcement.",
            "Sentiment": "positive",
            "PublishDate": 1750343032000,
            "Source": "default"
        },
        {
            "Title": "Kamat Hotels Gains Control of Ilex Developers & Resorts",
            "Summary": "Kamat Hotels (India) has announced that it has gained control over Ilex Developers & Resorts Limited. No further details about the nature of the control or the terms of the acquisition were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750331844000,
            "Source": "default"
        },
        {
            "Title": "Kamat Hotels Signs Management Agreement for IRA by Orchid Hotel",
            "Summary": "Kamat Hotels (India) has signed an agreement for the management of IRA by Orchid Hotel. No further details about the agreement or the hotel were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1747751008000,
            "Source": "default"
        },
        {
            "Title": "Kamat Hotels Signs Agreement to Manage New Orchid Hotel in Rishikesh",
            "Summary": "Kamat Hotels has entered into an agreement to manage a new 54-room Orchid Hotel property in Rishikesh. This expansion marks the company's entry into the popular tourist destination and spiritual hub in northern India, potentially strengthening its presence in the hospitality sector.",
            "Sentiment": "positive",
            "PublishDate": 1741327999000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kamat Hotels Signs Management Agreement for New Orchid Hotel in Mandavi",
            "Summary": "Kamat Hotels (India) has entered into a management agreement for a new Orchid Hotel in Mandavi. The hotel operations are expected to commence by December 2027, indicating a long-term expansion plan for the company's hospitality portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1740096532000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kamat Hotels Signs Management Agreement for New Orchid Hotel in Mandavi",
            "Summary": "Kamat Hotels (India) has entered into a management agreement for a new Orchid Hotel in Mandavi. The hotel operations are expected to commence by December 2027, marking an expansion of the company's hotel portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1740060169000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kamat Hotels Aims for Rs 100 Crore Plus EBITDA",
            "Summary": "Kamat Hotels has set a target of achieving over Rs 100 crore in EBITDA. Despite initial skepticism, the management expresses confidence in reaching this financial goal. This information was shared during a recent conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1738726193000,
            "Source": "earnings"
        },
        {
            "Title": "Kamat Hotels Revises Guidance and Targets Higher Average Room Rate",
            "Summary": "Kamat Hotels has revised its guidance due to certain outlooks, emphasizing transparency. The company expects its Average Room Rate (ARR) to increase as hotels stabilize and mature, with a target of over Rs 7,000.",
            "Sentiment": "positive",
            "PublishDate": 1738726156000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kamat Hotels (India) Reports Q3 Revenue Growth",
            "Summary": "Kamat Hotels (India) has announced its Q3 revenue results. The company reported revenue of 1.1 billion rupees, compared to 861 million rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738570570000,
            "Source": "earnings"
        },
        {
            "Title": "Kamat Hotels (India) Reports Significant Profit Increase in Q3",
            "Summary": "Kamat Hotels (India) has reported a substantial increase in consolidated profit before tax for the third quarter. The company's profit before tax rose to 353 million rupees, compared to 99 million rupees in the same period last year. This represents a year-over-year growth of approximately 256%. The company also noted an exceptional item of 325 million rupees, which likely contributed to the significant profit increase.",
            "Sentiment": "positive",
            "PublishDate": 1738570514000,
            "Source": "earnings"
        },
        {
            "Title": "Kamat Hotels (India) Reports Strong Q3 EBITDA Growth",
            "Summary": "Kamat Hotels (India) has announced its Q3 financial results, showing significant improvement in EBITDA performance. The company's EBITDA increased to 441 million rupees, up from 176 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 39.79% from 20.45% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738570284000,
            "Source": "earnings"
        },
        {
            "Title": "Kamat Hotels Terminates Joint Development Agreement for Odisha Hotel",
            "Summary": "Kamat Hotels (India) has announced the termination of a previously established Joint Development Agreement for a hotel project in Odisha. The termination will take effect from January 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1736813468000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kamat Hotels Terminates Joint Development Agreement for Odisha Hotel",
            "Summary": "Kamat Hotels (India) has announced the termination of a previously established joint development agreement for a hotel project in Odisha. The termination will take effect on January 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1736775498000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kamat Hotels Reports Q2 EBITDA of 224.6M Rupees",
            "Summary": "Kamat Hotels has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter stands at 224.6 million rupees, compared to 187 million rupees in the same quarter last year. However, the EBITDA margin has decreased from 29.14% to 26.31% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1729843443000,
            "Source": "result"
        },
        {
            "Title": "Kamat Hotels Reports Significant Profit Increase in Q2",
            "Summary": "Kamat Hotels has reported a substantial increase in its consolidated net profit for the second quarter, rising to 83 million rupees from 0.3 million rupees in the same period last year. The company's revenue also saw a notable improvement, reaching 854 million rupees compared to 640 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729843320000,
            "Source": "result"
        }
    ]
}