{
    "Symbol": "KAMDHENU",
    "ISIN": "INE390H01020",
    "News": [
        {
            "Title": "Kamdhenu Gets ₹63.40L GST Demand from CGST Alwar",
            "Summary": "Kamdhenu Limited received GST demand order of ₹63.40 lakhs from CGST Alwar for alleged wrongly availed Input Tax Credit during FY 2018-19 to FY 2021-22. Company plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1767336577343,
            "Source": "stocks"
        },
        {
            "Title": "Kamdhenu Limited Reports Highest-Ever Profitability with 14% PBT Margins in H1FY26",
            "Summary": "Kamdhenu Limited, India's largest manufacturer and seller of branded TMT Bars in the retail segment, reported its quarterly results for the period ended September 30, 2025. Revenue from operations reached ₹387 crore with profit before tax margins expanding to 14.0% from 10.9% in the previous year, marking a 310 basis points improvement. Profit before tax grew 33% to ₹54 crore while profit after tax increased 28% to ₹40 crore. Royalty income witnessed robust growth of 27% year-on-year to ₹286 crore, including a one-time royalty payment. Revenue from own facilities stood at ₹301 crore with sales volumes of 61,400 MT, while franchise volumes rose 8% to 18 lakh MT. Chairman Managing Director Satish Kumar Agarwal noted that some key operating regions experienced abnormal weather conditions and extended rainfall during the quarter, temporarily impacting volumes and revenue growth. Average selling prices were softer due to weaker steel prices, affecting realizations. The company operates through a franchise business model with over 10,000 dealers and over 500 distributors across India.",
            "Sentiment": "positive",
            "PublishDate": 1762815623442,
            "Source": "earnings"
        },
        {
            "Title": "Kamdhenu Limited Reports Quarterly Results and Modifies Fund Allocation for Preferential Issue Proceeds",
            "Summary": "Kamdhenu Limited's Board approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported revenue from operations of Rs 190.14 crores for the quarter, compared to Rs 195.78 crores in the previous quarter. Net profit after tax was Rs 19.80 crores versus Rs 21.29 crores in the prior quarter. The Board also approved modifications to fund allocation for preferential issue proceeds due to non-exercise of conversion by warrant holders. Out of 27.50 lakh convertible warrants allotted, 14.97 lakh warrants lapsed, resulting in forfeiture of Rs 13.21 crores. The company received Rs 57.44 crores against the targeted Rs 97.08 crores. The Board approved reallocating Rs 11 crores originally designated for office premises construction to other objectives and extended the fund utilization timeline from December 31, 2025, to December 31, 2026, subject to shareholder approval through postal ballot.",
            "Sentiment": "neutral",
            "PublishDate": 1762790869056,
            "Source": "earnings"
        },
        {
            "Title": "Kamdhenu Plans Aggressive Expansion with 40 Lakh MT Steel Capacity and 100+ Franchisees",
            "Summary": "Kamdhenu has outlined an aggressive expansion strategy targeting 40 lakh MT steel rebar capacity and establishing a network of over 100 franchisees. The company aims to achieve ₹22,000 crore in brand sales while increasing royalty income through its franchisee-led business model. The expansion includes strengthening its presence in structural steel and colour-coated sheets segments. Kamdhenu plans to deepen its penetration in tier-2 markets through its franchisee network and continues to focus on innovation with premium PAS 10000 TMT bars and structural solutions.",
            "Sentiment": "positive",
            "PublishDate": 1762785562396,
            "Source": "stock"
        },
        {
            "Title": "Kamdhenu Reports 18% Growth in Q2 Net Profit to 187 Million Rupees",
            "Summary": "Kamdhenu reported net profit of 187 million rupees in Q2, up from 159 million rupees in the same quarter last year. Revenue remained flat at 1.9 billion rupees compared to the previous year. EBITDA increased significantly to 239 million rupees from 163 million rupees year-over-year. The company's EBITDA margin improved to 12.51% from 8.59% in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762776338249,
            "Source": "earnings"
        },
        {
            "Title": "Kamdhenu Limited Forfeits Rs 13.21 Crore as 27.5 Lakh Warrants Lapse Unexercised",
            "Summary": "Kamdhenu Limited announced that 27,50,000 warrants have lapsed after allottees failed to exercise their conversion option within the 18-month period. The warrants were allotted on February 22, 2024, with a deadline of August 22, 2025 for conversion into equity shares. The company has forfeited Rs 13,21,27,900, representing 25% of the issue price collected upfront during warrant allotment. Four entities were involved: Minerva Ventures Fund had 6,97,200 pending warrants resulting in Rs 6,15,27,900 forfeiture, NAV Capital VCC had 5,00,000 pending warrants with Rs 4,41,25,000 forfeited, Arrow Emerging Opportunities Fund Limited had 2,00,000 pending warrants leading to Rs 1,76,50,000 forfeiture, and Ariston Capital Limited had 1,00,000 pending warrants resulting in Rs 88,25,000 forfeiture. The warrants officially lapsed on August 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755940093406,
            "Source": "corporate_action"
        },
        {
            "Title": "Kamdhenu Ventures Reports Decline in Q1 Profit and Revenue",
            "Summary": "Kamdhenu Ventures reported consolidated net profit of 9 million rupees in Q1, down from 16 million rupees in the same period last year. The company's revenue also decreased to 502 million rupees compared to 545 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1755181611700,
            "Source": "earnings"
        },
        {
            "Title": "Kamdhenu Targets Growth Through Franchise Expansion and Premium TMT Innovations",
            "Summary": "Kamdhenu is pursuing rapid growth through franchise expansion and a focus on structural steel. The company is developing new premium TMT innovations as part of its growth strategy. The company aims to increase royalty income, achieve higher margins, and gain greater market share while maintaining a zero-debt balance sheet.",
            "Sentiment": "positive",
            "PublishDate": 1754923068228,
            "Source": "stock"
        },
        {
            "Title": "Kamdhenu Limited Reports 38.8% Jump in Quarterly Net Profit, Plans 31st AGM",
            "Summary": "Kamdhenu Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The steel products manufacturer reported net profit of Rs 2,142.39 lakhs compared to Rs 1,543.75 lakhs in the same quarter last year, marking a 38.8% increase. Revenue from operations rose to Rs 19,577.81 lakhs from Rs 18,453.23 lakhs year-over-year. Total comprehensive income reached Rs 2,205.41 lakhs versus Rs 1,513.48 lakhs in the previous year. Earnings per share stood at Rs 0.76 compared to Rs 0.57 in the corresponding quarter. The company's paid-up equity share capital increased to Rs 2,813.83 lakhs from Rs 2,773.83 lakhs following the allotment of 4 crore equity shares in April 2025 upon warrant conversion, raising Rs 1,059 lakhs. The Board also decided to convene the company's 31st Annual General Meeting through video conferencing, with specific date and time to be announced separately.",
            "Sentiment": "positive",
            "PublishDate": 1754910796053,
            "Source": "earnings"
        },
        {
            "Title": "Kamdhenu Reports Strong Q4 Financial Results",
            "Summary": "Kamdhenu has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 236.6 million rupees from 157.9 million rupees in the previous year. The EBITDA margin also improved to 11.96% from 8.97%. Revenue rose to 1.98 billion rupees from 1.76 billion rupees. Net profit slightly increased to 170.9 million rupees from 167.5 million rupees year-over-year, and showed a substantial increase from 124.5 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1746617935000,
            "Source": "result"
        },
        {
            "Title": "Kamdhenu Reports Improved Q3 EBITDA and Margin",
            "Summary": "Kamdhenu Limited has reported significant year-over-year improvements in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 206 million rupees, up from 142 million rupees in the same quarter of the previous year. Additionally, Kamdhenu's EBITDA margin expanded to 11.79%, compared to 9.13% in the year-ago period, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739360139000,
            "Source": "earnings"
        },
        {
            "Title": "Kamdhenu Reports Increased Q3 Profit and Revenue",
            "Summary": "Kamdhenu Limited has announced its financial results for the third quarter. The company's net profit increased to 125 million rupees, up from 111 million rupees in the same quarter last year. Revenue also saw growth, reaching 1.8 billion rupees compared to 1.55 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739360133000,
            "Source": "earnings"
        }
    ]
}