{
    "Symbol": "KAMOPAINTS",
    "ISIN": "INE0BTI01037",
    "News": [
        {
            "Title": "Kamdhenu Ventures Q3FY26 Results & Warrant Issue",
            "Summary": "Kamdhenu Ventures reports Q3FY26 results with consolidated revenue of Rs 6,323.20 lakhs and net profit of Rs 99.13 lakhs. Board approves Rs 20.16 crore warrant issue to promoter group.",
            "Sentiment": "positive",
            "PublishDate": 1770891930059,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kamdhenu Paints Opens New Depot in Delhi NCR's Mayapuri Industrial Area",
            "Summary": "Kamdhenu Paints announced the opening of a new depot in Delhi's Mayapuri industrial area to strengthen last-mile reach and enable faster supply to distributors, retailers, and customers in the National Capital Territory. The company also plans to open a Showroom cum Experience Centre in Kirti Nagar soon, as part of its expansion strategy to deepen market presence for decorative paints and premium wood coatings.",
            "Sentiment": "positive",
            "PublishDate": 1763639071796,
            "Source": "stock"
        },
        {
            "Title": "Kamdhenu Ventures Reports 4% Revenue Growth to Rs 57 Crore in Q2 Despite Weather Challenges",
            "Summary": "Kamdhenu Ventures Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company's paint business delivered revenue of Rs 57 crore, representing a 4% year-on-year increase despite unsupportive weather conditions. EBITDA stood at Rs 4 crore with a margin of 6.5%, while profit after tax was Rs 1 crore. Managing Director Saurabh Agarwal highlighted the company's focus on strengthening brand presence, expanding distribution networks, and introducing innovative products. The company has planned several new product launches for the second half of FY26 and anticipates a revival in consumer sentiment supported by government initiatives including GST reduction. Kamdhenu operates through 30 sales depots with a dealer network of 4,400 and offers 40 SKUs across product categories in the decorative paints segment.",
            "Sentiment": "positive",
            "PublishDate": 1762897741793,
            "Source": "earnings"
        },
        {
            "Title": "Kamdhenu Ventures Reports Net Loss and Approves Rs 42.5 Crore Corporate Guarantee",
            "Summary": "Kamdhenu Ventures Limited reported a net loss of Rs 35.72 lakhs for the quarter ended September 30, 2025, compared to a loss of Rs 32.06 lakhs in the same period last year. For the half-year period, the company's net loss widened to Rs 52.99 lakhs from Rs 32.06 lakhs previously. The Board approved providing a corporate guarantee of Rs 42.5 crores to Indian Bank for credit facilities obtained by its wholly owned subsidiary, Kamdhenu Colour and Coatings Limited. The company will charge a guarantee fee of 1% per annum for this facility. The consolidated results showed better performance with net profit of Rs 270.98 lakhs for the half-year ended September 30, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762854344881,
            "Source": "earnings"
        },
        {
            "Title": "Kamdhenu Ventures Company Secretary Nikhil Sukhija Resigns to Pursue Career Opportunities",
            "Summary": "Kamdhenu Ventures Limited announced that Nikhil Sukhija resigned from his position as Company Secretary and Compliance Officer, effective October 15, 2025. Sukhija submitted his resignation letter on September 16, 2025, citing his decision to pursue alternate career opportunities outside the organization. He was relieved from his duties at the closure of working hours on October 15, 2025, which was his last working day. The company trades on NSE under the symbol KAMOPAINTS and on BSE with scrip code 543747.",
            "Sentiment": "neutral",
            "PublishDate": 1760530879841,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kamdhenu Ventures' Company Secretary Nikhil Sukhija Resigns to Pursue External Career Opportunities",
            "Summary": "Nikhil Sukhija (ACS 66209) has resigned from his position as Company Secretary and Compliance Officer of Kamdhenu Ventures Limited, effective October 15, 2025. He is leaving to pursue career opportunities outside the organization that align with his long-term career aspirations and personal goals. Sukhija has also resigned from his role as Company Secretary of Kamdhenu Colour and Coatings Limited, a wholly owned subsidiary of Kamdhenu Ventures Limited, with the same effective date. In his resignation letter dated September 16, 2025, Sukhija described his time at Kamdhenu Group as extremely rewarding and expressed gratitude for the professional growth opportunities provided during his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1758107872276,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kamdhenu Ventures Reports Mixed Q1 Results, Appoints New Auditors and Plans 6th AGM",
            "Summary": "Kamdhenu Ventures Limited reported its quarterly results for the quarter ended June 30, 2025. On a standalone basis, the company recorded a net loss of Rs 19.86 lakhs compared to a loss of Rs 22.77 lakhs in the same quarter last year. However, on a consolidated basis, the company posted a net profit of Rs 87.29 lakhs, down from Rs 159.42 lakhs in the previous year's corresponding quarter. Consolidated revenue from operations stood at Rs 5,023.89 lakhs versus Rs 5,445.69 lakhs in the prior year quarter. The company's board also approved the appointment of M/s DSP & Associates as statutory auditors for a five-year term from the 6th AGM to the 11th AGM, subject to shareholder approval. Additionally, the board decided to convene the company's 6th Annual General Meeting through video conferencing, with the date and time to be announced separately. The company utilized Rs 3.34 lakhs from its equity issue proceeds for general corporate purposes during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1755169672014,
            "Source": "earnings"
        },
        {
            "Title": "Kamdhenu Ventures: Q3 Profit Plunges 51% Amid Revenue Decline",
            "Summary": "Kamdhenu Ventures reported Q3 FY25 results with profit falling 51.11% YoY to ₹1.99 crore and revenue declining 6.35% YoY to ₹74.05 crore. However, QoQ performance improved with revenue up 35.03% and profit increasing 67.23%. EPS decreased to ₹0.06, down 53.85% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1739653126000,
            "Source": "earnings"
        },
        {
            "Title": "Kamdhenu Ventures Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Kamdhenu Ventures has reported a decrease in its Q3 EBITDA, which fell to 46 million rupees from 62 million rupees in the same quarter last year. The company's EBITDA margin also declined, dropping to 6.27% from 7.80% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739446366000,
            "Source": "earnings"
        },
        {
            "Title": "Kamdhenu Ventures Reports Decline in Q3 Financial Performance",
            "Summary": "Kamdhenu Ventures has reported a decrease in both net profit and revenue for the third quarter. The company's consolidated net profit fell to 20 million rupees from 41 million rupees in the same period last year. Revenue also declined to 740 million rupees from 791 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739446363000,
            "Source": "earnings"
        },
        {
            "Title": "Kamdhenu Ventures Reports Q2 Financial Results",
            "Summary": "Kamdhenu Ventures has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is 35 million rupees, down from 49 million rupees in the same quarter last year. The EBITDA margin has decreased to 6.31% from 7.47% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731318112000,
            "Source": "result"
        },
        {
            "Title": "Kamdhenu Ventures Reports Q2 Revenue Decline",
            "Summary": "Kamdhenu Ventures has reported a revenue of 548 million rupees for the second quarter, compared to 658 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731318039000,
            "Source": "result"
        },
        {
            "Title": "Kamdhenu Ventures Reports Q2 Profit Decline",
            "Summary": "Kamdhenu Ventures has reported a consolidated net profit of 11.9 million rupees for the second quarter, down from 34 million rupees in the same period last year. This represents a significant year-over-year decrease in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1731318012000,
            "Source": "result"
        },
        {
            "Title": "Kamdhenu Ventures: Stock Plummets 53% in a Week, Hits Lower Circuit",
            "Summary": "<p>Kamdhenu Ventures' stock hit its <span class='negative'>5th consecutive lower circuit</span>, <span class='negative'>dropping 53%</span> in one week to Rs 27.22. The company <span class='neutral'>clarified operations are normal</span> and the price movement is market-driven. Q1FY25 saw a <span class='negative'>12% YoY revenue decline</span> and <span class='negative'>26% YoY profit drop</span>.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728036093000,
            "Source": "normal_news"
        },
        {
            "Title": "Kamdhenu Paints: Launches First Exclusive Retail Outlet, Plans 50 More",
            "Summary": "<p><span class='positive'>Kamdhenu Paints</span> opened its <b>first exclusive retail outlet</b> in <span class='neutral'>Gurugram</span>, aiming to establish <b>50 such stores</b> across <span class='neutral'>India</span> within a year through <span class='positive'>dealer partnerships</span>. The company currently has <b>33 sales depots</b> and over <b>4,300 dealers</b> nationwide.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727433081000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kamdhenu Paints: Launches First Exclusive Outlet, Plans 50 Stores Nationwide",
            "Summary": "<p><span class='positive'>Kamdhenu Paints</span> opened its <b>first exclusive retail outlet</b> in Gurugram, aiming to establish <span class='positive'>50 such stores</span> across India within a year through dealer partnerships. The company currently has <b>33 sales depots</b> and over <b>4,300 dealers</b> nationwide. <span class='negative'>Kamdhenu Ventures Limited's stock closed 20% lower</span> at ₹46.68 on the NSE.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1727433081000,
            "Source": "normal_news"
        }
    ]
}