{
    "Symbol": "KANANIIND",
    "ISIN": "INE879E01037",
    "News": [
        {
            "Title": "Kanani Industries Approves Q3FY26 Financial Results",
            "Summary": "Kanani Industries Limited's Board approved unaudited standalone and consolidated financial results for quarter ended December 31, 2025, following regulatory compliance under SEBI guidelines.",
            "Sentiment": "neutral",
            "PublishDate": 1770893179303,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kanani Industries Reports Mixed Financial Results for Quarter Ended September 2025",
            "Summary": "Kanani Industries Limited submitted its unaudited financial results for the quarter and half-year ended September 30, 2025. On a standalone basis, the company reported a net loss of Rs 7.43 lakhs for the quarter compared to a net loss of Rs 6.10 lakhs in the previous quarter. Revenue from operations was Rs 102.46 lakhs for the quarter. On a consolidated basis, the company showed better performance with net profit of Rs 5.45 lakhs for the quarter versus Rs 4.25 lakhs in the previous quarter. Total consolidated revenue reached Rs 4,871.75 lakhs for the quarter. The company's paid-up equity share capital stands at Rs 1,978.68 lakhs. Basic earnings per share for continuing operations was Rs 0.04 on standalone basis and Rs 0.07 on consolidated basis for the quarter. The results were reviewed by the Audit Committee and approved by the Board of Directors. The company operates primarily in one reportable segment and has a foreign subsidiary, KIL International Limited, which has been consolidated since 2011.",
            "Sentiment": "neutral",
            "PublishDate": 1762956796574,
            "Source": "earnings"
        },
        {
            "Title": "Harshil Premjibhai Kanani Reduces Stake in Kanani Industries Limited",
            "Summary": "Harshil Premjibhai Kanani, a promoter of Kanani Industries Limited, disposed of 946,833 equity shares through open market transactions. His shareholding decreased from 58.11% to 57.63% of the company's total share capital. The disposal was executed on March 19, 2024, with the company's shares listed on both BSE and NSE. The total equity share capital of Kanani Industries remained unchanged at 197,868,000 shares before and after the transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1761795511000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kanani Industries Reports Mixed Quarterly Performance with Consolidated Profit Despite Standalone Loss",
            "Summary": "Kanani Industries Limited released its unaudited financial results for the quarter ended June 30, 2025. The company reported a standalone net loss of Rs. 5.10 lakhs compared to a loss of Rs. 4.09 lakhs in the same quarter last year. However, on a consolidated basis, the company achieved a net profit of Rs. 28.32 lakhs, significantly higher than Rs. 25.98 lakhs in the corresponding quarter of the previous year. Standalone revenue from operations was Rs. 1,020.46 lakhs, while consolidated revenue reached Rs. 8,369.46 lakhs compared to Rs. 6,654.44 lakhs in the same quarter last year. The company's paid-up equity share capital remained stable at Rs. 1,978.68 lakhs with a face value of Re. 1 per share. The results were reviewed by the audit committee and approved by the board of directors. The company's foreign subsidiary KIL International Limited contributed total revenues of Rs. 7,348.99 lakhs and net profit of Rs. 33.42 lakhs for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754390992317,
            "Source": "earnings"
        }
    ]
}