{
    "Symbol": "KANORICHEM",
    "ISIN": "INE138C01024",
    "News": [
        {
            "Title": "Kanoria Chemicals Q3FY26 Revenue Jumps 42% YoY",
            "Summary": "Kanoria Chemicals & Industries reported strong Q3FY26 results with revenue rising 42% YoY to ₹23,059 lakhs. Net profit turned positive at ₹393 lakhs vs loss of ₹1,970 lakhs in Q3FY25.",
            "Sentiment": "positive",
            "PublishDate": 1770894257818,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kanoria Chemicals wins Supreme Court tax appeal case",
            "Summary": "Supreme Court dismissed CIT-IV Kolkata's appeal against Kanoria Chemicals on January 28, 2026, following precedent set in Jindal Steel case from December 2023.",
            "Sentiment": "positive",
            "PublishDate": 1769794153664,
            "Source": "stocks"
        },
        {
            "Title": "Kanoria Chemicals Reports Mixed Results with Gain from Subsidiary Divestment",
            "Summary": "Kanoria Chemicals Industries Limited reported quarterly results for the period ended September 30, 2025. The company's revenue from operations increased to Rs 19,087 lakhs compared to Rs 16,094 lakhs in the same quarter last year. However, the company recorded a significant gain of Rs 9,766 lakhs from loss of control of discontinued operations, primarily due to APAG Holding AG ceasing to be a subsidiary on July 31, 2025. The company also reported exceptional items including impairment in investment value of Rs 1,064 lakhs. For continuing operations, the company showed a profit before tax of Rs 853 lakhs. The Solar Power Division was previously sold in June 2024 and is being treated as discontinued operations. The company operates primarily in chemicals manufacturing, which is considered as one reportable segment.",
            "Sentiment": "neutral",
            "PublishDate": 1762800725750,
            "Source": "earnings"
        },
        {
            "Title": "Kanoria Chemicals Enters Shareholders Agreement with Four International Entities",
            "Summary": "Kanoria Chemicals & Industries Limited entered into a shareholders agreement with APAG Holding AG (Switzerland), Anevolve Private Limited, Asia Investments UK Private Limited, and CoSyst Holding AG on September 15, 2025. The agreement follows up on the company's earlier communication dated July 29, 2025. The company has informed stock exchanges BSE and NSE about this development for their records.",
            "Sentiment": "neutral",
            "PublishDate": 1758029571253,
            "Source": "corporate_action"
        },
        {
            "Title": "Kanoria Chemicals Shareholders Approve 100% Divestment of Material Subsidiary",
            "Summary": "Kanoria Chemicals & Industries Limited received shareholder approval for the dilution and divestment of 100% shareholding in its material subsidiary through a postal ballot conducted via remote e-voting. The special resolution was passed with overwhelming support, securing 99.98% of votes in favor (32,115,282 votes) against 0.02% opposing votes (5,629 votes). A total of 232 shareholders participated in the voting process out of 18,580 total shareholders as of the cut-off date of July 25, 2025. The e-voting period ran from August 5 to September 3, 2025, with results scrutinized by chartered accountant Amit Choraria.",
            "Sentiment": "positive",
            "PublishDate": 1756984834313,
            "Source": "corporate_action"
        },
        {
            "Title": "Kanoria Chemicals Reports Loss of ₹767 Lakhs in Q1 FY26 Amid Subsidiary Stake Dilution Plans",
            "Summary": "Kanoria Chemicals & Industries Limited reported a standalone net loss of ₹767 lakhs for the quarter ended June 30, 2025, compared to a profit of ₹64 lakhs in the same quarter last year. Revenue from operations decreased to ₹18,658 lakhs from ₹16,168 lakhs year-on-year. The company recorded an exceptional item of ₹1,064 lakhs due to impairment of its investment in APAG Holding AG. On a consolidated basis, the loss was ₹1,378 lakhs. The Board approved a proposal for diluting its stake in subsidiary APAG Holding AG from 55% to approximately 14.3% through a strategic investor transaction involving USD 19.38 million. The company operates across three segments: Chemicals, Electronic Automotive, and Textile, with the Electronic Automotive segment reporting a loss of ₹968 lakhs during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754383015088,
            "Source": "earnings"
        },
        {
            "Title": "Kanoria Chemicals to Sell Complete Stake in Apag Holding AG",
            "Summary": "Kanoria Chemicals has announced its decision to sell its entire 100% stake in Apag Holding AG. The transaction involves the complete divestment of the company's ownership in the subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1753797834713,
            "Source": "corporate_action"
        },
        {
            "Title": "Kanoria Chemicals & Industries Reports Q4 Financial Results",
            "Summary": "Kanoria Chemicals & Industries reported its Q4 financial results. The company's EBITDA decreased to 169.9 million rupees from 286.3 million rupees year-over-year. EBITDA margin fell to 3.94% from 7.92%. Revenue increased to 4.3 billion rupees from 3.62 billion rupees. The company reported a loss before tax of 85 million rupees compared to a profit of 24.4 million rupees in the previous year. An exceptional item of 294.4 million rupees was noted. The consolidated net loss widened to 363.8 million rupees from 93 million rupees year-over-year and 166.7 million rupees quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747826767000,
            "Source": "result"
        },
        {
            "Title": "Kanoria Chemicals and Industries Establishes Subsidiaries in Germany and Canada",
            "Summary": "Kanoria Chemicals and Industries has incorporated two new subsidiaries, one in Germany and another in Canada. This expansion indicates the company's efforts to broaden its international presence and potentially enter new markets.",
            "Sentiment": "positive",
            "PublishDate": 1744813243000,
            "Source": "default"
        },
        {
            "Title": "Kanoria Chemicals & Industries Reports Increased Q3 Net Loss",
            "Summary": "Kanoria Chemicals & Industries has reported a consolidated net loss of 167 million rupees for the third quarter, compared to a loss of 81.3 million rupees in the same period last year. The company's revenue slightly increased to 3.5 billion rupees from 3.4 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739443794000,
            "Source": "earnings"
        },
        {
            "Title": "Kanoria Chemicals & Industries Reports Improved Q2 EBITDA and Margin",
            "Summary": "Kanoria Chemicals & Industries has reported a significant improvement in its Q2 financial performance. The company's EBITDA increased to 402 million rupees from 319 million rupees year-over-year. Additionally, the EBITDA margin expanded to 10.77% from 8.60% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731487154000,
            "Source": "result"
        },
        {
            "Title": "Kanoria Chemicals & Industries Reports Q2 Financial Results",
            "Summary": "Kanoria Chemicals & Industries announced its Q2 financial results. The company reported a consolidated net loss of 139 million rupees, an improvement from the 184 million rupee loss in the same quarter last year. Revenue remained stable at 3.7 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731486957000,
            "Source": "result"
        },
        {
            "Title": "Kanoria Chemicals' Ankleshwar Plant Closure Order Revoked",
            "Summary": "<p>Kanoria Chemicals and Industries has announced that the <span class='positive'>closure order</span> for its <b>Ankleshwar plant</b> has been <span class='positive'>revoked</span>. This indicates that the company has likely <span class='positive'>resolved</span> any issues that led to the initial closure order and can now <span class='positive'>resume operations</span> at the facility.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728474209000,
            "Source": "corporate_action"
        }
    ]
}