{
    "Symbol": "KANPRPLA",
    "ISIN": "INE694E01014",
    "News": [
        {
            "Title": "Kanpur Plastipack Q3FY26 earnings call on Feb 17",
            "Summary": "Kanpur Plastipack Limited announces earnings conference call scheduled for February 17, 2026 at 10:30 AM to discuss Q3FY26 results following financial results announcement on February 04, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769863281893,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kanpur Plastipack Converts 4.52 Lakh Warrants into Equity Shares",
            "Summary": "Kanpur Plastipack Limited allotted 4,52,000 equity shares at ₹130 per share through conversion of warrants, raising ₹4.07 crore from promoters and public investors. The company's paid-up share capital increased to ₹24.01 crore with 5,60,000 warrants remaining pending for conversion within 18 months.",
            "Sentiment": "positive",
            "PublishDate": 1765266810236,
            "Source": "corporate_action"
        },
        {
            "Title": "Kanpur Plastipack Schedules Committee Meeting for Warrant Conversion to Equity Shares",
            "Summary": "Kanpur Plastipack Limited has scheduled a Preferential Issue Committee meeting on December 9, 2025, to approve allotment of equity shares upon conversion of 10,12,000 fully convertible warrants at ₹130 per warrant. The company received confirmation letters from allottees regarding payment of balance issue price and their intention to convert warrants into equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764839484521,
            "Source": "corporate_action"
        },
        {
            "Title": "Kanpur Plastipack Forms 50:50 Joint Venture with Italy's Essegomma for High-Performance Yarn Business",
            "Summary": "Kanpur Plastipack Limited signed a joint venture agreement with Essegomma S.p.A., Italy on November 18, 2025, to establish a 50:50 JVC in India for sales, marketing, trading, and distribution of high-performance polypropylene yarn. The partnership combines Essegomma's European expertise in Taslan yarn technology with Kanpur Plastipack's manufacturing base and infrastructure facilities in India to produce premium-quality technical yarns for global markets and high-end textile applications.",
            "Sentiment": "positive",
            "PublishDate": 1763537959525,
            "Source": "order&deals"
        },
        {
            "Title": "Kanpur Plastipack Reports Strong Q2 FY26 Results with 4x Net Profit Growth and Announces INR 105 Crore Capex Plan",
            "Summary": "Kanpur Plastipack delivered robust quarterly results with total income rising 8% to INR 166 crores and net profit surging 4 times to INR 7.56 crores, driven by strong FIBC and fabric segment demand. The company announced a strategic INR 105 crore capex program for capacity expansion and diversification into needle-punch non-woven products, while completing acquisition of 76.19% stake in Valex Ventures for European market access.",
            "Sentiment": "positive",
            "PublishDate": 1763447243059,
            "Source": "earnings"
        },
        {
            "Title": "Kanpur Plastipack Seeks Shareholder Approval for Employee Stock Option Scheme and Independent Director Appointment",
            "Summary": "Kanpur Plastipack Limited has issued a postal ballot notice seeking shareholder approval for its maiden Employee Stock Option Scheme-2025 covering up to 5,00,000 options and confirmation of Basant Seth's appointment as Independent Director. The e-voting period runs from November 20, 2025 to December 19, 2025, with results to be declared by December 22, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763444685154,
            "Source": "corporate_action"
        },
        {
            "Title": "Kanpur Plastipack Makes Earnings Call Audio Recording Available for Q2 Results",
            "Summary": "Kanpur Plastipack Limited conducted an earnings conference call for its quarterly results ended September 30, 2025, on November 13, 2025 at 2:00 PM. The company has made the audio recording of the call available on its website for stakeholders and investors to access.",
            "Sentiment": "positive",
            "PublishDate": 1763046157132,
            "Source": "earnings"
        },
        {
            "Title": "Kanpur Plastipack Approves Rs 105.26 Crore Expansion Plan and New Director Appointment",
            "Summary": "Kanpur Plastipack Limited's board approved multiple strategic initiatives on November 10, 2025. The company appointed Basant Seth, a qualified Chartered Accountant with four decades of banking and finance experience, as an Additional Independent Director. The board approved capital expenditure of Rs 105.26 crore across two major projects: Rs 47.22 crore for capacity enhancement including a new FIBC division building targeting 6,000 MT additional capacity over 5 years, modern roll management system, and trading division warehouse; and Rs 58.04 crore for diversification into non-woven fabrics manufacturing using needle-punching technology for automotive, home furnishing, and geotextile applications. Additionally, the company approved its maiden Employee Stock Option Scheme-2025 covering 5,00,000 options convertible into equity shares of Rs 10 face value each. The board also granted in-principle approval for a 50:50 joint venture with Italy's Essegomma S.p.A. to establish a joint venture company in India for sales, marketing, and distribution of high-performance polypropylene yarn.",
            "Sentiment": "positive",
            "PublishDate": 1762801484371,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kanpur Plastipack Reports Strong Q2 Growth with 7.2% Revenue Increase and Subsidiary Acquisition",
            "Summary": "Kanpur Plastipack Limited reported quarterly results for the period ended September 30, 2025, showing revenue from operations of Rs. 16,196.42 lacs compared to Rs. 15,101.79 lacs in the same quarter last year, representing a 7.2% increase. Net profit for continuing operations reached Rs. 755.95 lacs versus Rs. 144.30 lacs in the previous year quarter. The company's manufacturing division generated Rs. 14,925.10 lacs in revenue while the trading division contributed Rs. 1,696.67 lacs. Basic earnings per share for continuing operations stood at Rs. 3.25 compared to Rs. 0.67 in the prior year quarter. The company allotted 3,33,700 equity shares to Chairman and Managing Director Manoj Agarwal on November 1, 2025, against the acquisition of 76.19% holding in Valex Ventures Limited (UK), making it a subsidiary. The company operates in manufacturing of FIBC, fabric, multifilament yarn, and CPP films, along with trading activities.",
            "Sentiment": "positive",
            "PublishDate": 1762801119965,
            "Source": "earnings"
        },
        {
            "Title": "Kanpur Plastipack Forms 50:50 Joint Venture With Essegomma, Plans 472.2 Million Rupees Investment",
            "Summary": "Kanpur Plastipack has formed a 50:50 joint venture with Essegomma. The company plans a total investment of 472.2 million rupees for three projects, which includes 580.4 million rupees for a new greenfield manufacturing facility.",
            "Sentiment": "positive",
            "PublishDate": 1762788080391,
            "Source": "order&deals"
        },
        {
            "Title": "Kanpur Plastipack Shareholders Approve Deputy MD Payment Changes and Foreign Company Acquisition",
            "Summary": "Kanpur Plastipack Limited held its Annual General Meeting on September 8, 2025, where shareholders approved several key resolutions. The company changed payment terms for Deputy Managing Director Shri Shashank Agarwal. M/s Adesh Tandon & Associates was appointed as secretarial auditors for five years from April 1, 2025 to March 31, 2030. Shareholders also approved the acquisition of foreign company Valex Ventures Ltd through a combination of equity share swap via preferential allotment and cash consideration.",
            "Sentiment": "neutral",
            "PublishDate": 1757424061185,
            "Source": "corporate_action"
        },
        {
            "Title": "Kanpur Plastipack Limited Conducts Earnings Call for Quarter Ended June 30, 2025",
            "Summary": "Kanpur Plastipack Limited held an earnings conference call on August 19, 2025, to discuss their unaudited financial results for the quarter ended June 30, 2025. The company, which manufactures and exports flexible intermediate bulk containers, PP multifilament yarn, UV master batches, fabrics, and CPP films, has made the audio recording of the call available on their website. The call covered both standalone and consolidated unaudited financial results. However, no specific financial figures, management commentary, or operational highlights were provided in the available transcript.",
            "Sentiment": "neutral",
            "PublishDate": 1755605417647,
            "Source": "earnings"
        },
        {
            "Title": "Kanpur Plastipack Sets September 1 Record Date for Dividend Eligibility",
            "Summary": "Kanpur Plastipack Limited announced September 1, 2025 as the record date for determining shareholder eligibility for dividend payment. The company's share transfer books will remain closed from September 2-8, 2025 for the Annual General Meeting and dividend entitlement purposes. Valid share transfers received on or before September 1, 2025 will be registered for dividend eligibility. For dematerialized shares, beneficial owners listed with NSDL and CDSL at close of business on September 1, 2025 will be entitled to dividend payment. The dividend payment date for financial year 2024-25 is scheduled for September 16, 2025, subject to declaration at the Annual General Meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1755604936533,
            "Source": "corporate_action"
        },
        {
            "Title": "Kanpur Plastipack Reports Strong Q1 Performance with 34% Revenue Growth and Margin Expansion",
            "Summary": "Kanpur Plastipack Limited delivered robust quarterly results with revenue growing 34% year-on-year to ₹182.24 crore. EBITDA surged 119% to ₹15.54 crore with margins expanding to 8.53%. The company turned profitable with net profit of ₹6.91 crore compared to a loss in the same quarter last year. FIBC segment contributed 48.75% of revenue while exports account for approximately 70% of total revenue across 60+ countries. The company raised ₹13.15 crore via preferential issue to reduce debt and acquired UK-based Valex Ventures to strengthen European presence. Management is focusing on high-margin products, operational efficiency improvements, and aims to achieve net debt-free status within a year. The company operates four integrated manufacturing units and meets nearly 50% of energy needs through solar power.",
            "Sentiment": "positive",
            "PublishDate": 1755345376089,
            "Source": "earnings"
        },
        {
            "Title": "Kanpur Plastipack Q1 Net Profit Surges to 72M Rupees Despite Revenue Decline",
            "Summary": "Kanpur Plastipack reported Q1 consolidated net profit of 72 million rupees, more than doubling from 30 million rupees in the same period last year. However, Q1 revenue declined to 1.78 billion rupees from 1.8 billion rupees year-over-year. The company recorded an exceptional item of 116 million rupees during the quarter. Q1 profit before tax (PBT) decreased to 97 million rupees compared to 140 million rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1755097935174,
            "Source": "earnings"
        },
        {
            "Title": "Kanpur Plastipack Acquires 76.19% Stake in UK's Valex Ventures for ₹8.02 Crore",
            "Summary": "Kanpur Plastipack Limited's Board approved the acquisition of 76.19% equity stake in UK-based Valex Ventures Limited for ₹8.02 crore from promoter Manoj Agarwal. The consideration will be paid through issuance of 3,33,700 equity shares at ₹202.61 per share (₹6.76 crore) and ₹1.26 crore in cash. Valex Ventures distributes industrial-grade flexible intermediate bulk containers across the UK market and reported revenue of GBP 11.68 lakh for FY 2024-25. The acquisition aims to expand Kanpur Plastipack's geographical reach to the UK market. The company also approved standalone and consolidated unaudited financial results for the quarter ended June 30, 2025, and announced book closure from September 2-8, 2025 for the Annual General Meeting scheduled on September 8, 2025. The transaction requires shareholder approval and stock exchange clearances.",
            "Sentiment": "positive",
            "PublishDate": 1755092354165,
            "Source": "order&deals"
        },
        {
            "Title": "Kanpur Plastipack Schedules Board Meeting to Consider UK Company Acquisition",
            "Summary": "Kanpur Plastipack Ltd has scheduled a board meeting for August 13, 2025 to consider the acquisition of a UK-based company from a related party. The acquisition will be funded through the issuance of equity shares or other securities via methods including preferential issue or qualified institutional placement. This agenda item is in addition to previously announced matters for the board meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1754649897852,
            "Source": "corporate_action"
        },
        {
            "Title": "Kanpur Plastipack Allots 10.12 Lakh Convertible Warrants at ₹130 Each to Promoters and Public Investors",
            "Summary": "Kanpur Plastipack Limited has allotted 10,12,000 fully convertible equity warrants at ₹130 per warrant on a preferential basis, raising ₹13.16 crores. The warrants were allocated to promoters (2,62,000 warrants), promoter group members (4,43,000 warrants), and public investors (3,07,000 warrants). Key recipients include Shashank Agarwal (1,62,000 warrants), Raghushree Earning Solutions LLP (3,85,000 warrants), and Jayatika Goyal (1,80,000 warrants). Investors paid ₹40 per warrant upfront and must pay the remaining ₹90 upon conversion within 18 months. Each warrant converts into one equity share with a face value of ₹10. The allotment received approvals from BSE and NSE and follows earlier board and shareholder approvals. The securities are subject to lock-in restrictions as per regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1754551687857,
            "Source": "corporate_action"
        },
        {
            "Title": "Kanpur Plastipack Reports Strong Q4 Financial Results",
            "Summary": "Kanpur Plastipack has reported significant improvements in its Q4 financial performance. The company's profit before tax (PBT) increased to 139 million rupees from 30 million rupees year-over-year. EBITDA rose to 179 million rupees from 76 million rupees, with the EBITDA margin improving to 9.78% from 5.09%. Net profit for Q4 was 29 million rupees, up from 26 million rupees year-over-year. Revenue also increased to 1.8 billion rupees from 1.6 billion rupees. The company reported an exceptional item of 116 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1747314231000,
            "Source": "result"
        },
        {
            "Title": "Kanpur Plastipack to Consider Fund Raising",
            "Summary": "Kanpur Plastipack has announced a board meeting scheduled for May 15 to discuss and potentially approve raising funds through equity or other securities.",
            "Sentiment": "neutral",
            "PublishDate": 1747053987000,
            "Source": "default"
        },
        {
            "Title": "Kanpur Plastipack Sells CPP Division to SRF for 492.5 Million Rupees",
            "Summary": "Kanpur Plastipack has signed an Assets Purchase Agreement with SRF, selling the plant and machinery of its CPP (Cast Polypropylene) Division for 492.5 million rupees. This sale represents a significant corporate action for Kanpur Plastipack, potentially impacting its business operations and financial structure.",
            "Sentiment": "neutral",
            "PublishDate": 1742170395000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kanpur Plastipack Sells CPP Division to SRF",
            "Summary": "Kanpur Plastipack has signed an assets purchase agreement with SRF to sell its Cast Polypropylene (CPP) Division. The sale includes the plant and machinery of the CPP Division for a sum of 492.5 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1741864839000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kanpur Plastipack Approves Sale of CPP Division Plant and Machinery",
            "Summary": "Kanpur Plastipack has approved the sale of its CPP (Cast Polypropylene) Division plant and machinery for ₹49 crore. The company, with a market capitalization of ₹274 crore, is divesting this specific division, which suggests a significant corporate restructuring or strategic move.",
            "Sentiment": "neutral",
            "PublishDate": 1741676761000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kanpur Plastipack Reports Significant EBITDA Improvement in Q3",
            "Summary": "Kanpur Plastipack has reported a substantial improvement in its Q3 EBITDA, turning a loss of 35 million rupees in the previous year to a gain of 146 million rupees. The company's EBITDA margin for the quarter stands at 9.08%.",
            "Sentiment": "positive",
            "PublishDate": 1738749590000,
            "Source": "earnings"
        },
        {
            "Title": "Kanpur Plastipack Reports Profit in Q3, Revenue Increases",
            "Summary": "Kanpur Plastipack has reported a net profit of 75 million rupees in the third quarter, compared to a loss of 67 million rupees in the same period last year. The company's revenue for Q3 increased to 1.6 billion rupees from 1.2 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738749519000,
            "Source": "earnings"
        },
        {
            "Title": "Kanpur Plastipack Reports Significant Profit Growth in Q3",
            "Summary": "Kanpur Plastipack has announced its financial results for the third quarter. The company's net profit increased substantially to 75 million rupees, up from 14 million rupees in the same quarter of the previous year. Revenue also saw growth, rising to 1.6 billion rupees from 1.5 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738749428000,
            "Source": "earnings"
        }
    ]
}