{
    "Symbol": "KANSAINER",
    "ISIN": "INE531A01024",
    "News": [
        {
            "Title": "Kansai Nerolac Executive Director Resigns",
            "Summary": "Hirokazu Kotera resigns as Executive Director of Kansai Nerolac Paints effective March 31, 2026, following directions from promoter company Kansai Paint Co. Ltd., Japan.",
            "Sentiment": "neutral",
            "PublishDate": 1770136940970,
            "Source": "stocks"
        },
        {
            "Title": "Kansai Nerolac Grants 3,313 RSUs to Employees",
            "Summary": "Kansai Nerolac Paints' Nomination and Remuneration Committee approved grant of 3,313 Restricted Stock Units to selected employees under RSU Plan 2022, with grant date set for 15th February, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770135993200,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kansai Nerolac Q3 FY26 Results: Revenue Up 3.5%",
            "Summary": "Kansai Nerolac Paints reported Q3 FY26 revenue of ₹1907.35 crores, up 3.5% YoY. Industrial coatings showed strong growth led by automotive segment, while decorative demand remained subdued.",
            "Sentiment": "neutral",
            "PublishDate": 1770128301110,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kansai Nerolac Allots 3,771 Equity Shares Under RSU Plan",
            "Summary": "Kansai Nerolac Paints Limited allotted 3,771 equity shares of Re. 1 each pursuant to exercise of Restricted Stock Units under RSU Plan 2022, increasing total issued shares to 80,85,24,735.",
            "Sentiment": "neutral",
            "PublishDate": 1769683936886,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kansai Nerolac Q3FY26 Earnings Call on Feb 4",
            "Summary": "Kansai Nerolac Paints announces Q3FY26 results conference call scheduled for February 4, 2026 at 11:00 AM IST, hosted by ICICI Securities with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1769606544081,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kansai Nerolac Faces ₹80.29L Tax Penalty Order",
            "Summary": "Kansai Nerolac Paints receives tax penalty order of ₹80.29 lakh from Deputy Commissioner of State Tax, Mumbai for partial disallowance of Input Tax Credit claimed during FY 2021-22. Company plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1767010278886,
            "Source": "stocks"
        },
        {
            "Title": "Kansai Nerolac Board Meet Set for Feb 3, 2026",
            "Summary": "Kansai Nerolac Paints announces board meeting on February 3, 2026, to review Q3 FY26 financial results. Trading window closed for designated persons from January 1-5, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766580065912,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kansai Nerolac Sells 60% Stake in Sri Lankan Unit",
            "Summary": "Kansai Nerolac has divested 60% of its shareholding in its Sri Lankan subsidiary Kansai Paints Lanka, marking a significant strategic move in the company's international operations.",
            "Sentiment": "neutral",
            "PublishDate": 1765893315616,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kansai Nerolac Completes Sri Lankan Unit Divestment",
            "Summary": "Kansai Nerolac Paints has completed the sale of its 60% stake in Sri Lankan subsidiary to Atire Private Limited for LKR 18 lakh, receiving regulatory approval and executing the agreement.",
            "Sentiment": "neutral",
            "PublishDate": 1765455477065,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kansai Nerolac Paints Closes Trading Window for Designated Persons",
            "Summary": "Kansai Nerolac Paints has closed its trading window for designated persons and their immediate relatives from December 4, 2025 to December 17, 2025 under SEBI insider trading regulations. The closure affects only company insiders while general investors can continue trading normally during this period.",
            "Sentiment": "neutral",
            "PublishDate": 1764843448981,
            "Source": "corporate_action"
        },
        {
            "Title": "Kansai Nerolac Paints Allots 7,922 Equity Shares Under Employee Stock Plan",
            "Summary": "Kansai Nerolac Paints Limited's Board approved allotment of 7,922 equity shares of Re. 1 face value each pursuant to exercise of Restricted Stock Units under RSU Plan 2022. The allotment increases the company's total issued share capital to Rs. 80,85,20,964 with shares identical to existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764587223391,
            "Source": "corporate_action"
        },
        {
            "Title": "Kansai Nerolac Paints Faces Rs 48.03 Lakh GST Penalty Over Input Tax Credit Dispute",
            "Summary": "Kansai Nerolac Paints received a penalty of Rs 48,02,629 from the Assistant Commissioner of Central Tax, Vijayawada under Section 74 of CGST Act for partial disallowance of Input Tax Credit claimed during FY2018-19 in Andhra Pradesh. The company maintains it has relevant records to support its ITC claim and plans to file an appeal, stating there is no material impact on its financial operations or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1763991039923,
            "Source": "stock"
        },
        {
            "Title": "Kansai Nerolac Paints Sets EBITDA Margin Targets and Announces Capex Plans",
            "Summary": "Kansai Nerolac Paints has outlined its financial guidance during a conference call. The company expects EBITDA margins of 13-14% in the short term and aims for 15% in the long term. For FY26, management expects to maintain margins above 13%, supported by benign material costs. The company has planned capital expenditure of over 200 crores for regular activities. Management expects Q4 FY26 to show better growth prospects than previous quarters for both decorative and industrial segments.",
            "Sentiment": "positive",
            "PublishDate": 1762400115456,
            "Source": "stock"
        },
        {
            "Title": "Kansai Nerolac Paints Plans Growth Through Decorative Paints Expansion and Industrial Tech Upgrades",
            "Summary": "Kansai Nerolac Paints has outlined its growth strategy focusing on expansion in decorative paints, waterproofing, and construction chemicals. The company plans to add over 2,500 new dealers and launch new premium products to support this expansion. In the industrial segment, the company is upgrading to waterborne technology to maintain its leadership position and anticipates demand recovery from the automotive and infrastructure sectors.",
            "Sentiment": "positive",
            "PublishDate": 1762186911660,
            "Source": "stock"
        },
        {
            "Title": "Kansai Nerolac Paints Warns of Short-Term Growth Impact from Weather Conditions",
            "Summary": "Kansai Nerolac Paints has cautioned that a short Diwali season and ongoing monsoons may negatively impact its short-term growth. The company expects strong momentum in its automotive and performance coatings segments, while anticipating a gradual recovery in the decorative segment.",
            "Sentiment": "neutral",
            "PublishDate": 1762184178399,
            "Source": "stock"
        },
        {
            "Title": "Kansai Nerolac Paints Reports Mixed Q2 Results with Revenue Growth and Margin Decline",
            "Summary": "Kansai Nerolac Paints reported quarterly net profit of 1.36 billion rupees compared to 1.3 billion rupees in the same period last year. Revenue increased to 18.71 billion rupees from 18.63 billion rupees year-over-year. However, EBITDA declined to 2.12 billion rupees from 2.15 billion rupees, while EBITDA margin compressed to 11.32% from 11.54% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762181806241,
            "Source": "earnings"
        },
        {
            "Title": "Kansai Nerolac Paints Schedules Q2 FY 2025-26 Results Conference Call",
            "Summary": "Kansai Nerolac Paints Limited will host a conference call on November 4, 2025, at 10:30 hrs India Time to discuss its Q2 FY 2025-26 financial results. The call will be led by Managing Director Pravin Chaudhari, Chief Financial Officer Yash Ahuja, and Director of Corporate Planning, IT & Materials Jason Gonsalves. ICICI Securities is organizing the group conference call, which will be accessible through multiple international toll-free numbers for global participants.",
            "Sentiment": "neutral",
            "PublishDate": 1761557773110,
            "Source": "earnings"
        },
        {
            "Title": "Kansai Nerolac Paints Begins Chennai Billing Operations for Industrial Business",
            "Summary": "Kansai Nerolac Paints has started its billing process from Chennai for industrial operations. The paint company has initiated this operational change as part of its industrial business activities.",
            "Sentiment": "neutral",
            "PublishDate": 1760016374322,
            "Source": "stock"
        },
        {
            "Title": "Kansai Nerolac Paints Provides Rs 45 Crore Loan to Wholly Owned Subsidiary Nerofix",
            "Summary": "Kansai Nerolac Paints Limited has entered into a loan agreement with its wholly owned subsidiary Nerofix Private Limited for Rs 45 crores. The unsecured loan carries an interest rate of 8.50% per annum with quarterly payments, and has a tenure of 5 years. The interest rate may be revised annually by Kansai Nerolac. The transaction is classified as a related party transaction conducted at arm's length. The loan agreement was executed on August 26, 2025, with no security provided for the loan.",
            "Sentiment": "neutral",
            "PublishDate": 1756214590625,
            "Source": "stock"
        },
        {
            "Title": "Kansai Nerolac Sees Rs 24.38 Crore Block Trade on NSE",
            "Summary": "Kansai Nerolac witnessed a block trade worth Rs 24.38 crore on the National Stock Exchange. The transaction involved approximately 1,002,300 shares executed at a price of Rs 243.25 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1755677333809,
            "Source": "order&deals"
        },
        {
            "Title": "Kansai Nerolac Paints Approves Merger with Wholly Owned Subsidiary Nerofix Private Limited",
            "Summary": "Kansai Nerolac Paints Limited's Board of Directors approved a scheme of amalgamation to merge its wholly owned subsidiary, Nerofix Private Limited, with itself. The appointed date for the merger is April 1, 2025, subject to regulatory and shareholder approvals. Nerofix Private Limited operates in the adhesives and paint-related products business with a turnover of Rs. 125.33 crore, while Kansai Nerolac reported Rs. 7,496.71 crore in turnover. Upon completion, all assets, liabilities, and business operations of Nerofix will transfer to Kansai Nerolac, while Nerofix's shares held by the parent company will be cancelled. No cash consideration or share exchange is involved in the transaction. The merger aims to provide synergy benefits, economies of scale, growth, and expansion opportunities. There will be no change in Kansai Nerolac's shareholding pattern as this involves a wholly owned subsidiary merger.",
            "Sentiment": "positive",
            "PublishDate": 1754910839630,
            "Source": "corporate_action"
        },
        {
            "Title": "Kansai Nerolac Reports 1.8% Revenue Growth in Q1 FY26 Amid Competitive Pressures and Regional Challenges",
            "Summary": "Kansai Nerolac Paints reported quarterly results with standalone revenue growth of 1.8% and consolidated revenue growth of 1.4%. The company's EBITDA declined by 6.7% on standalone basis and 8% on consolidated basis. Decorative segment volumes remained flat while industrial segment showed higher single-digit growth. The company faced challenges from early monsoon onset impacting May sales, geopolitical tensions affecting North region sales where the company is strong, and continued losses from Bangladesh operations. Paint+ product range now contributes over 12% of sales with 28 products in market. The company added 400 new Nerolac NXTGEN shops and expanded dealer network to over 30,000 direct dealers. Managing Director Pravin Chaudhari noted dealers returning to Nerolac from competitors, citing better ROI compared to new competition. Industrial business showed market-leading growth despite sluggish automotive demand. The company capitalized its Jainpur water-based facility adding 44,000 KL capacity. Antidumping duty on Chinese titanium dioxide is expected to cause 1% to 1.3% inflation in decorative segment. Management expects quarter 2 to perform better due to earlier Diwali timing and improved construction activity.",
            "Sentiment": "neutral",
            "PublishDate": 1754662544874,
            "Source": "earnings"
        },
        {
            "Title": "Kansai Nerolac Paints Approves LKR 300 Million Investment in Sri Lanka",
            "Summary": "Kansai Nerolac Paints has approved an investment of LKR 300 million in Sri Lanka. The approval represents the company's expansion plans in the Sri Lankan market.",
            "Sentiment": "positive",
            "PublishDate": 1754317723944,
            "Source": "stock"
        },
        {
            "Title": "Kansai Nerolac Reports 1.8% Revenue Growth to Rs 2,087 Crores in Q1 FY2026",
            "Summary": "Kansai Nerolac Paints Limited reported quarterly results with net revenue of Rs 2,087.42 crores, representing 1.8% growth compared to the same quarter last year. However, EBITDA declined 6.7% to Rs 311.97 crores and profit before tax decreased 4.1% to Rs 310.08 crores year-over-year. The company's decorative segment showed signs of revival but was impacted by early monsoon and April disturbances affecting key northern markets. Automotive demand remained better than market average, while performance coatings registered strong growth. Raw material prices remained stable, though forex volatility continued. Managing Director Pravin Chaudhari expects improvement in decorative demand driven by favorable monsoon and early Diwali onset, with industrial segment growth trajectory expected to continue. The domestic paint industry is estimated at Rs 77,500 crores as of March 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754311254207,
            "Source": "earnings"
        },
        {
            "Title": "Kansai Nerolac Paints Announces CFO Transition as P.D. Pai Retires, Yash Ahuja Takes Over",
            "Summary": "Kansai Nerolac Paints Limited announced a change in its Chief Financial Officer position. P.D. Pai will retire from his role as CFO effective July 31, 2025, after 36 years with the company. The Board expressed appreciation for his valuable contributions during his tenure. Yash Ahuja has been appointed as the new Chief Financial Officer starting August 1, 2025. Ahuja brings over 24 years of finance experience and holds chartered accountant credentials along with a commerce degree and executive education from UC Berkeley. He previously worked with organizations including Panasonic, Wrigley, Hewlett-Packard, General Electric, and SpiceJet in finance and strategy roles. Ahuja had been serving as Senior Vice President - Finance (CFO Designate) since April 16, 2025. Additionally, he will assume the role of Chief Risk Officer from August 1, 2025, replacing Pai in that position as well. The company has updated its Key Managerial Personnel structure, with Pravin D. Chaudhari (Managing Director), Yash Ahuja (Chief Financial Officer), and G.T. Govindarajan (Company Secretary) authorized to determine materiality of events and make related disclosures to stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1753433407918,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kansai Nerolac Paints Schedules Q1 FY 2025-26 Results Conference Call for August 5",
            "Summary": "Kansai Nerolac Paints Limited will host a conference call on August 5, 2025, at 11:30 hrs India Time to discuss Q1 FY 2025-26 financial results. The call will be attended by Managing Director Pravin Chaudhari, CFO designate Yash Ahuja, and Director of Corporate Planning Jason Gonsalves. The company has provided multiple access numbers including domestic and international toll-free options for investors and analysts to participate in the results discussion.",
            "Sentiment": "neutral",
            "PublishDate": 1753342565490,
            "Source": "earnings"
        },
        {
            "Title": "Kansai Nerolac Paints to Announce Q1 Results on August 4",
            "Summary": "Kansai Nerolac Paints has scheduled the announcement of its first quarter results for August 4.",
            "Sentiment": "neutral",
            "PublishDate": 1750857741000,
            "Source": "default"
        },
        {
            "Title": "Kansai Nerolac Paints: Last Day to Buy Shares for Dividend Eligibility",
            "Summary": "June 20 is the last day to buy Kansai Nerolac Paints shares to qualify for the final dividend of Rs 2.5 and special dividend of Rs 1.25 per share for FY2025. The record date is set for June 23, with total dividend payout around Rs 303 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1750389120000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kansai Nerolac Paints Reports Q4 FY23 Financial Results",
            "Summary": "Kansai Nerolac Paints announced its Q4 financial results. Net profit increased to 1.23 billion rupees from 1.01 billion rupees year-over-year. Revenue rose to 17.4 billion rupees from 16.62 billion rupees in the same period last year. The company declared a dividend of 3.75 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746576796000,
            "Source": "default"
        },
        {
            "Title": "Kansai Nerolac Paints: Q4 Revenue Up, Margins Squeezed",
            "Summary": "Kansai Nerolac Paints reported Q4 FY25 results with revenue up 2.7% YoY to ₹1,817 crore, but net profit down 6.5% to ₹108.5 crore. EBITDA margin declined to 9.1% from 10.1% last year. Full-year revenue rose 1.4% to ₹7,496.7 crore. The company declared a total dividend of ₹3.75 per share. Management cited forex volatility impacting margins but noted strong performance in decorative and automotive segments.",
            "Sentiment": "neutral",
            "PublishDate": 1746552604000,
            "Source": "earnings"
        },
        {
            "Title": "Kansai Nerolac Paints Announces Q4 Results and Dividend",
            "Summary": "Kansai Nerolac Paints has declared a dividend of 3.75 rupees per equity share. For Q4, the company reported an EBITDA of 1.8B rupees, unchanged year-over-year, with an EBITDA margin of 10.28% compared to 10.77% in the previous year. Net profit for Q4 increased to 1.23B rupees from 1.01B rupees year-over-year. Revenue for Q4 grew to 17.4B rupees from 16.62B rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1746543922000,
            "Source": "result"
        },
        {
            "Title": "Kansai Nerolac: Vision 2030 Signals Strong Growth and Industrial Focus",
            "Summary": "Kansai Nerolac's Vision 2030 emphasizes growth in the industrial segment, with innovation and stability in auto and decorative segments. Rural markets are outperforming urban areas, and the decorative business is expected to recover in the medium term. Despite high competition, the company anticipates stability over the next 9-12 months, supported by technological advancements.",
            "Sentiment": "positive",
            "PublishDate": 1745215558000,
            "Source": "normal_news"
        },
        {
            "Title": "Kansai Nerolac Paints: New Managing Director Appointed",
            "Summary": "Kansai Nerolac Paints has appointed Pravin Chaudhari as its new Managing Director, effective April 10, 2025. He replaces Anuj Jain, who is retiring early. Chaudhari, with over 30 years of industry experience, has been with Kansai Nerolac since 1993 and previously served as an Executive Officer at Kansai Paint Co Ltd in Japan.",
            "Sentiment": "neutral",
            "PublishDate": 1744299762000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kansai Nerolac Paints Tax Demand Significantly Reduced",
            "Summary": "Kansai Nerolac Paints has announced that its tax demand has been reduced from 783 million rupees to 151.6 million rupees. This represents a substantial decrease in the company's tax liability.",
            "Sentiment": "positive",
            "PublishDate": 1741182518000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kansai Nerolac Paints Reports Strong Q3 Results and Announces Capacity Expansion",
            "Summary": "Kansai Nerolac Paints reported a significant increase in Q3 net profit, rising to 5.3 billion rupees from 1.5 billion rupees year-over-year. Revenue grew slightly to 18.42 billion rupees, up from 18.14 billion rupees. The company's profit before tax increased to 2.28 billion rupees from 2.13 billion rupees. An exceptional item of 4.79 billion rupees was reported. The company also announced plans to expand its auto paints capacity at the Sayakha plant by 4,200 KL/annum, with an investment of 410 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738801283000,
            "Source": "earnings"
        },
        {
            "Title": "Kansai Nerolac Paints to Expand Auto Paint Capacity at Sayakha Plant",
            "Summary": "Kansai Nerolac Paints has announced plans to increase the production capacity of auto paints at its Sayakha plant by 4,200 KL per annum. The company will invest 410 million rupees for this capacity addition.",
            "Sentiment": "positive",
            "PublishDate": 1738764979000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kansai Nerolac Paints: Q3 Profit Surges 341% on Land Sale Gains",
            "Summary": "Kansai Nerolac Paints reported a 341.4% YoY increase in Q3 FY25 net profit to ₹680.9 crore, primarily due to a ₹665.4 crore gain from land sale in Mumbai. Revenue grew marginally by 0.2% to ₹1,921.9 crore. EBITDA fell 3.7% to ₹235 crore with a margin of 12.2%. The company recorded a ₹186.3 crore impairment provision for subsidiaries in Bangladesh and Sri Lanka.",
            "Sentiment": "positive",
            "PublishDate": 1738761571000,
            "Source": "earnings"
        },
        {
            "Title": "Kansai Nerolac Paints Reports Q3 Profit Before Tax Increase",
            "Summary": "Kansai Nerolac Paints has reported a profit before tax (PBT) of 2.28 billion rupees for the third quarter, compared to 2.13 billion rupees in the same period last year. The company also noted an exceptional item of 4.79 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738760229000,
            "Source": "earnings"
        },
        {
            "Title": "Kansai Nerolac Paints Reports Improved Q3 EBITDA and Margin",
            "Summary": "Kansai Nerolac Paints has announced its Q3 financial results. The company's EBITDA increased to 2.48 billion rupees from 2.4 billion rupees year-over-year. Additionally, the EBITDA margin improved to 13.46% from 13.22% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738760220000,
            "Source": "earnings"
        },
        {
            "Title": "Kansai Nerolac Paints Reports Significant Profit Increase in Q3",
            "Summary": "Kansai Nerolac Paints has announced its financial results for the third quarter. The company reported a substantial increase in net profit, rising to 5.3 billion rupees from 1.5 billion rupees in the same period last year. Revenue also saw a slight increase, reaching 18.42 billion rupees compared to 18.14 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738760214000,
            "Source": "earnings"
        },
        {
            "Title": "Kansai Nerolac Paints Ltd. Block Trade on NSE",
            "Summary": "A significant block trade occurred for Kansai Nerolac Paints Ltd. on the National Stock Exchange (NSE). Approximately 2,496,070 shares were traded at a price of Rs. 239.25 per share, totaling Rs. 59.72 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1738135310000,
            "Source": "block_deals"
        },
        {
            "Title": "Kansai Nerolac Paints to Consider Q3 Results on February 5",
            "Summary": "Kansai Nerolac Paints has announced that it will consider its financial results for the third quarter of the fiscal year on February 5. This announcement indicates the company's scheduled board meeting to review and approve the quarterly financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1735297574000,
            "Source": "earnings"
        },
        {
            "Title": "Kansai Nerolac Revises Growth Expectations Downward",
            "Summary": "Kansai Nerolac has announced in a conference call that it expects lower top-line growth for the year than initially estimated. This revision is due to lower growth experienced in the first and second quarters.",
            "Sentiment": "negative",
            "PublishDate": 1731295120000,
            "Source": "normal_news"
        },
        {
            "Title": "Kansai Nerolac Paints Reports Q2 Financial Results",
            "Summary": "Kansai Nerolac Paints has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is 2.15 billion rupees, down from 2.7 billion rupees in the same quarter last year. The EBITDA margin has also decreased to 11.54% from 14.62% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730894930000,
            "Source": "result"
        },
        {
            "Title": "Kansai Nerolac Paints Reports Q2 Revenue Growth",
            "Summary": "Kansai Nerolac Paints has reported a revenue of 18.6 billion rupees for the second quarter, compared to 18.45 billion rupees in the same period last year, indicating a slight year-over-year increase.",
            "Sentiment": "neutral",
            "PublishDate": 1730894921000,
            "Source": "result"
        },
        {
            "Title": "Kansai Nerolac Paints Reports Q2 Net Profit Decline",
            "Summary": "Kansai Nerolac Paints has reported a significant decrease in its Q2 net profit. The company's net profit for the quarter stood at 1.3 billion rupees, down from 1.8 billion rupees in the same quarter last year (YoY). This represents a sequential decrease from 2.4 billion rupees in the previous quarter (QoQ).",
            "Sentiment": "negative",
            "PublishDate": 1730894910000,
            "Source": "result"
        },
        {
            "Title": "Kansai Nerolac Paints Completes Land Sale in Lower Parel",
            "Summary": "Kansai Nerolac Paints has finalized the sale of its land in Lower Parel to Aethon Developers, a subsidiary of Runwal Developers. The approved sale is valued at Rs 726 crores.",
            "Sentiment": "positive",
            "PublishDate": 1729779033000,
            "Source": "corporate_action"
        }
    ]
}