{
    "Symbol": "KARMAENG",
    "ISIN": "INE725L01011",
    "News": [
        {
            "Title": "Karma Energy Q3FY26 Results: Profit Drops to ₹21.65 Lac",
            "Summary": "Karma Energy Limited reported Q3FY26 net profit of ₹21.65 lac, down from ₹104.76 lac in Q2FY26. Revenue declined to ₹119.55 lac while nine-month profit reached ₹187.22 lac.",
            "Sentiment": "negative",
            "PublishDate": 1770887554060,
            "Source": "co_actions_results"
        },
        {
            "Title": "Karma Energy Board Meet Set for Feb 12 Q3 Results",
            "Summary": "Karma Energy Limited announces board meeting on February 12, 2026 to consider and adopt unaudited financial results for Q3 FY26 ended December 31, 2025 under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769837017234,
            "Source": "co_actions_results"
        },
        {
            "Title": "Karma Energy Limited Reports Strong Q2 Performance with 72% Jump in Net Profit",
            "Summary": "Karma Energy Limited announced its quarterly results for the second quarter and half year ended September 30, 2025. The company reported a net profit of Rs 104.76 lacs for Q2, representing a significant increase from Rs 60.81 lacs in the previous quarter. For the half year, net profit reached Rs 165.67 lacs compared to Rs 265.56 lacs in the previous period. Revenue from operations for Q2 stood at Rs 462.41 lacs, up from Rs 305.82 lacs in Q1. The company's earnings per share for Q2 was Rs 0.91 compared to Rs 0.53 in the previous quarter. Karma Energy operates primarily in renewable power generation and has no subsidiary, associate, or joint venture companies. The results were approved by the Board of Directors and reviewed by statutory auditors who issued an unmodified report.",
            "Sentiment": "positive",
            "PublishDate": 1762951047884,
            "Source": "earnings"
        },
        {
            "Title": "Karma Energy Limited Reports 60.81 Lac Profit After Tax for Quarter Ended June 30, 2025",
            "Summary": "Karma Energy Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of 305.82 lac, up from 94.40 lac in the previous quarter and 239.58 lac in the same quarter last year. Total income reached 377.32 lac compared to 187.07 lac in the previous quarter. The company posted a profit after tax of 60.81 lac versus 30.45 lac in the previous quarter and 93.48 lac in the corresponding quarter last year. Exceptional items of 81.43 lac contributed to the results, consisting of interest received on debtors written off in prior years. The company operates primarily in renewable power generation and has no subsidiary, associate, or joint venture companies. The Board also approved the notice for the Annual General Meeting scheduled for September 25, 2025. Earnings per share stood at 0.53 rupees for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755000237736,
            "Source": "earnings"
        },
        {
            "Title": "Karma Energy Approves Sale of Bay Wind Projects to Ram Krishna Iron Works",
            "Summary": "Karma Energy has approved the sale of its Bay Wind Projects to Ram Krishna Iron Works. This decision represents a significant corporate action that will likely impact the company's asset portfolio and potentially its financial position.",
            "Sentiment": "neutral",
            "PublishDate": 1735603275000,
            "Source": "corporate_action"
        },
        {
            "Title": "Karma Energy Approves Sale of Bay Wind Projects",
            "Summary": "Karma Energy has approved the sale of its Bay Wind Projects to Ram Krishna Iron Works. This decision represents a significant corporate action, potentially impacting the company's asset portfolio and future operations in the renewable energy sector.",
            "Sentiment": "neutral",
            "PublishDate": 1735556126000,
            "Source": "corporate_action"
        }
    ]
}