{
    "Symbol": "KARNIKA",
    "ISIN": "INE0MGA01012",
    "News": [
        {
            "Title": "Karnika Industries Sets Thursday as Final Day for 4:1 Bonus Share Eligibility",
            "Summary": "Karnika Industries has set Thursday as the last day for investors to purchase shares to qualify for its 4:1 bonus issue. The ex-date is Friday, August 29, 2025, meaning shareholders must hold shares before this date to receive four additional shares for every one share owned. Transactions completed on Thursday will reflect in demat accounts before the ex-date, qualifying investors for the bonus allotment. The company is issuing bonus shares from free reserves at no additional cost to existing shareholders. While the face value remains unchanged, the total number of shares increases with a proportional share price adjustment expected post-bonus.",
            "Sentiment": "positive",
            "PublishDate": 1756347425910,
            "Source": "corporate_action"
        },
        {
            "Title": "Karnika Industries to Establish New Denim Plant in Gurgaon",
            "Summary": "Karnika Industries has announced plans to set up a new manufacturing facility in Gurgaon for denim production. The company will invest 50 million rupees in this expansion. With the increased production capacity, Karnika Industries expects its profits to rise by 300 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1732492630000,
            "Source": "corporate_action"
        },
        {
            "Title": "Karnika Industries to Establish New Denim Plant in Gurgaon",
            "Summary": "Karnika Industries has announced plans to set up a new manufacturing facility in Gurgaon for denim production. The company will invest 50 million rupees in this expansion. With the increased production capacity, Karnika Industries expects its profits to rise by 300 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1732275083000,
            "Source": "corporate_action"
        }
    ]
}