{
    "Symbol": "KARURVYSYA",
    "ISIN": "INE036D01028",
    "News": [
        {
            "Title": "Karur Vysya Bank Opens New Chennai Branch",
            "Summary": "Karur Vysya Bank announces the inauguration of its 900th branch in Chennai-Tondiarpet on February 06, 2026, expanding its presence in Tamil Nadu's capital city.",
            "Sentiment": "positive",
            "PublishDate": 1770040678064,
            "Source": "stocks"
        },
        {
            "Title": "Karur Vysya Bank alerts on potential strike impact",
            "Summary": "Karur Vysya Bank notifies exchanges about UFBU strike call on January 27, 2026, warning of potential disruption to branch operations and normal banking services.",
            "Sentiment": "negative",
            "PublishDate": 1769248497631,
            "Source": "stocks"
        },
        {
            "Title": "Karur Vysya Bank Allots 23,631 Equity Shares to MD & CEO",
            "Summary": "Karur Vysya Bank allotted 23,631 equity shares worth Rs. 2 each to MD & CEO B Ramesh Babu under ESOS 2018 scheme as part of FY 2021-22 variable pay compensation structure.",
            "Sentiment": "neutral",
            "PublishDate": 1769177783640,
            "Source": "co_actions_results"
        },
        {
            "Title": "Karur Vysya Bank Re-appoints CEO for Third Term",
            "Summary": "The Karur Vysya Bank board approved re-appointment of B Ramesh Babu as Managing Director and CEO for a third term of two years from July 29, 2026, subject to RBI and shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1769177697600,
            "Source": "stocks"
        },
        {
            "Title": "Karur Vysya Bank Q3 Net Profit Jumps 38% to ₹690 Cr",
            "Summary": "Karur Vysya Bank reported strong Q3 performance with net profit rising 38% year-on-year to ₹690 crores from ₹500 crores in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1769159533687,
            "Source": "co_actions_results"
        },
        {
            "Title": "Karur Vysya Bank Q3FY26 Results Call on Jan 23",
            "Summary": "Karur Vysya Bank schedules conference call with investors and analysts on January 23, 2026 at 6:00 PM IST to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768382154836,
            "Source": "co_actions_results"
        },
        {
            "Title": "Karur Vysya Bank Opens New Branch in Pune",
            "Summary": "Karur Vysya Bank inaugurated its new branch in Pune's Sahakar Nagar on January 12, 2026, expanding its all-India network to 899 branches. The branch offers comprehensive banking services including accounts, deposits, and loans.",
            "Sentiment": "positive",
            "PublishDate": 1768227025101,
            "Source": "stocks"
        },
        {
            "Title": "KVB Launches Capital Gains Account Scheme for Taxpayers",
            "Summary": "Karur Vysya Bank introduces Capital Gains Account Scheme following government authorization, enabling taxpayers to park asset sale proceeds while maintaining tax exemptions under Income Tax Act, 1961.",
            "Sentiment": "positive",
            "PublishDate": 1767961244350,
            "Source": "stocks"
        },
        {
            "Title": "Karur Vysya Bank Opens New Branch in Pune",
            "Summary": "Karur Vysya Bank inaugurates its 899th branch at Pune-Sahakar Nagar on January 12, 2026, expanding its presence in Maharashtra's financial hub.",
            "Sentiment": "positive",
            "PublishDate": 1767960986481,
            "Source": "stocks"
        },
        {
            "Title": "Karur Vysya Bank Board Meet on Jan 23 for Q3FY26 Results",
            "Summary": "Karur Vysya Bank schedules board meeting for January 23, 2026 to approve Q3FY26 unaudited financial results. Trading window closed from January 1-25, 2026 for insider trading compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1767941134711,
            "Source": "co_actions_results"
        },
        {
            "Title": "Karur Vysya Bank Q3FY26: Total business grows 16.29%",
            "Summary": "Karur Vysya Bank reports Q3FY26 business update with total business growth of 16.29% YoY to ₹2,11,643 crore. Advances grew 17.15% to ₹97,048 crore while deposits increased 15.57% to ₹1,14,595 crore.",
            "Sentiment": "positive",
            "PublishDate": 1767250226113,
            "Source": "co_actions_results"
        },
        {
            "Title": "Karur Vysya Bank Gets ICRA Rating Reaffirmation",
            "Summary": "ICRA reaffirms [ICRA]A1+ credit rating for Karur Vysya Bank's ₹10,000 crore Certificate of Deposit Programme, maintaining the bank's strong short-term credit profile.",
            "Sentiment": "positive",
            "PublishDate": 1765435614671,
            "Source": "stocks"
        },
        {
            "Title": "Karur Vysya Bank Reduces External Benchmark Rate by 25 Basis Points",
            "Summary": "Karur Vysya Bank revised its External Benchmark Rate-Repo linked (EBR-R) from 8.80% to 8.55% effective December 06, 2025. The rate reduction affects the bank's lending rates tied to the external benchmark and was communicated to stock exchanges under regulatory disclosure requirements.",
            "Sentiment": "positive",
            "PublishDate": 1765009616665,
            "Source": "stock"
        },
        {
            "Title": "Karur Vysya Bank Grants 52,017 Stock Options to MD & CEO B Ramesh Babu",
            "Summary": "Karur Vysya Bank's Nomination and Remuneration Committee approved granting 52,017 stock options under the KVBESOPS 2018 scheme to Managing Director & CEO B Ramesh Babu at Rs. 247.03 per option as part of his variable pay for FY 2024-25. The options will vest over three years with 33.33% vesting after one year, 33.33% after two years, and 33.34% after three years, with each option convertible to one equity share upon vesting.",
            "Sentiment": "positive",
            "PublishDate": 1764945455612,
            "Source": "corporate_action"
        },
        {
            "Title": "Karur Vysya Bank Senior Management Personnel Completes Term",
            "Summary": "Shri Mahendran K, General Manager (Country Head-PMD) and part of senior management at Karur Vysya Bank, completed his term and demitted office on November 29, 2025. The bank informed stock exchanges NSE and BSE about the completion of the senior executive's tenure as required under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764565979450,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karur Vysya Bank Opens New Branches in Tirunelveli and Kakinada, Expands Network to 898 Branches",
            "Summary": "Karur Vysya Bank inaugurated new branches in Melapalayam, Tirunelveli district and Sarpavaram Junction, Kakinada on November 27, 2025, bringing its all-India branch network to 898 branches. The expansion strengthens the bank's presence in Tamil Nadu and Andhra Pradesh, offering comprehensive banking services including accounts, deposits, loans, and digital solutions to drive financial inclusion in these regions.",
            "Sentiment": "positive",
            "PublishDate": 1764246998571,
            "Source": "stock"
        },
        {
            "Title": "Karur Vysya Bank Reduces MCLR Rates by 25 Basis Points Across All Tenors",
            "Summary": "Karur Vysya Bank has revised its Marginal Cost of Funds Based Lending Rates (MCLR) downward by 25 basis points across all tenors, with overnight MCLR reducing from 9.15% to 8.90% and one-year MCLR decreasing from 9.45% to 9.20%. The revised rates will be effective from November 22, 2025, potentially making loans cheaper for borrowers and affecting the bank's lending portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1763728304021,
            "Source": "stock"
        },
        {
            "Title": "Karur Vysya Bank Seeks Shareholder Approval for Dr. Mythili Vutukuru's Appointment as Independent Director",
            "Summary": "Karur Vysya Bank has issued a postal ballot notice seeking shareholder approval for appointing Dr. Mythili Vutukuru as Non-Executive Independent Director for three years from September 24, 2025 to September 23, 2028. The remote e-voting process will be conducted from November 21, 2025 to December 20, 2025, with Dr. Vutukuru bringing Information Technology expertise as an Associate Professor at IIT Bombay and member of NSE Clearing's Standing Committee on Technology.",
            "Sentiment": "neutral",
            "PublishDate": 1763547163313,
            "Source": "corporate_action"
        },
        {
            "Title": "Karur Vysya Bank Allots 1,54,722 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Karur Vysya Bank's Board approved the allotment of 1,54,722 equity shares with face value of ₹2 each under the KVB ESOS 2011-2018 Scheme during its board meeting. The decision affects employees participating in the stock option scheme and represents the bank's execution of its employee compensation program.",
            "Sentiment": "neutral",
            "PublishDate": 1763444098015,
            "Source": "corporate_action"
        },
        {
            "Title": "Karur Vysya Bank Opens New Branch in Madurai, Expands to 896 Branches Nationwide",
            "Summary": "Karur Vysya Bank opened a new branch in Kochadai Village of Madurai West, bringing the total number of branches in the city to 48. The branch was inaugurated by Dr. Koothan U.T and Dr. Hemalekha. With this expansion, KVB now operates 896 branches across India and 2,226 ATMs and cash recyclers. The new branch will offer comprehensive banking services including accounts, deposits, loans, and will cater to retail, institutional and consumer lending needs. Managing Director CEO Ramesh Babu stated this expansion strengthens their mission to drive financial inclusion and provide modern banking facilities to the local population. The bank reported total business of Rs. 2,03,216 crores as of September 30, 2025, with deposits of Rs. 1,10,492 crores and advances of Rs. 92,724 crores. Net profit for Q2 FY26 was Rs. 574 crores with Net NPA at 0.19%.",
            "Sentiment": "positive",
            "PublishDate": 1762843271818,
            "Source": "stock"
        },
        {
            "Title": "Karur Vysya Bank Funds Palliative Care Facility in Visakhapatnam Through CSR Initiative",
            "Summary": "Karur Vysya Bank has provided CSR support to Sneha Sandhya Age Care Foundation for constructing an integrated palliative and geriatric care facility in Visakhapatnam. The bank's contribution enabled the construction and equipping of an entire inpatient wing with 16 inpatient rooms and two nursing stations under Block-C. The facility, developed over 1.08 acres, will provide specialized services including geriatric care, palliative care, respite care, and dementia residential care. This initiative is part of KVB Aarogya, the bank's flagship CSR healthcare program. Sneha Sandhya Age Care Foundation, established in 2012, was the first organization to start palliative care services in Andhra Pradesh outside Hyderabad. The facility is nearing completion and will serve hundreds of patients annually while training medical professionals in geriatric and palliative care.",
            "Sentiment": "positive",
            "PublishDate": 1762842384781,
            "Source": "stock"
        },
        {
            "Title": "Karur Vysya Bank Reports 17% YoY Net Profit Growth, Reaches INR 2 Lakh Crore Business Milestone",
            "Summary": "Karur Vysya Bank achieved a significant milestone of INR 2 lakh crores in total business for Q2 FY26, with net profit rising 17% year-on-year to INR 574 crores. The bank reported total business of INR 2,03,216 crores, reflecting 15% annual growth, with advances at INR 92,724 crores and deposits at INR 1,10,492 crores, both growing 15% year-on-year. Net interest margin was maintained at 3.77%, down 9 basis points sequentially. The quarter included a major recovery of INR 295 crores from a written-off account, comprising INR 157 crores principal and INR 139 crores interest. Fresh slippages increased to INR 350 crores from INR 188 crores in the previous quarter, with INR 218 crores originating from two corporate accounts that management chose to recognize early. Gross NPAs increased slightly from 0.66% to 0.76%, while net NPAs remained steady at 0.19%. The bank maintained its full-year guidance of 3.7%-3.75% for net interest margins and expects to keep gross NPAs below 1.5%. CASA balances crossed INR 30,000 crores, and the bank opened 7 branches in the first half with plans for 21 more branches during the year.",
            "Sentiment": "positive",
            "PublishDate": 1761361830039,
            "Source": "earnings"
        },
        {
            "Title": "Karur Vysya Bank Reports Net Profit of Rs 521 Crore for Q2 FY26",
            "Summary": "Karur Vysya Bank announced its quarterly results for the quarter ended September 30, 2025. The bank reported a net profit of Rs 521.45 crore compared to Rs 573.96 crore in the previous quarter. Interest earned increased to Rs 2,568.55 crore from Rs 2,386.53 crore in the prior quarter. Total income rose to Rs 3,320.29 crore from Rs 3,015.80 crore. Operating expenses stood at Rs 730.07 crore versus Rs 690.46 crore in the previous quarter. The bank's gross NPA ratio improved to 0.76% from 1.10% in the corresponding period last year, while net NPA ratio was 0.19% compared to 0.28% previously. Capital adequacy ratio under Basel III stood at 16.58%. Return on assets was 1.72% on an annualized basis. The bank operates across Treasury, Corporate/Wholesale banking, Retail banking, and other banking operations segments.",
            "Sentiment": "neutral",
            "PublishDate": 1760697871832,
            "Source": "earnings"
        },
        {
            "Title": "Karur Vysya Bank Reports 21% Growth in Q2 Net Profit to 5.74 Billion Rupees",
            "Summary": "Karur Vysya Bank reported net profit of 5.74 billion rupees in Q2, representing a year-over-year increase from 4.74 billion rupees. Revenue grew to 28.08 billion rupees compared to 23.8 billion rupees in the same period last year. The bank's gross non-performing assets (GNPA) ratio increased to 0.76% from 0.66% on a quarter-over-quarter basis, while net non-performing assets (NNPA) ratio remained stable at 0.19%.",
            "Sentiment": "positive",
            "PublishDate": 1760696420880,
            "Source": "earnings"
        },
        {
            "Title": "Mid-Cap Banks Report Strong Loan Growth in Latest Quarter",
            "Summary": "Several mid-cap banks including Karur Vysya Bank, Bandhan Bank, and RBL Bank reported impressive loan growth for the quarter ended September. These results were released ahead of their full earnings reports.",
            "Sentiment": "positive",
            "PublishDate": 1760348737148,
            "Source": "stock"
        },
        {
            "Title": "Karur Vysya Bank Reports 15.37% Growth in Total Business to ₹2,03,211 Crore",
            "Summary": "Karur Vysya Bank Limited reported total business growth of 15.37% year-over-year, reaching ₹2,03,211 crore. The bank's total deposits increased by 15.29% year-over-year to ₹1,10,492 crore, while advances rose by 15.47% year-over-year to ₹92,719 crore.",
            "Sentiment": "positive",
            "PublishDate": 1759304680865,
            "Source": "earnings"
        },
        {
            "Title": "Karur Vysya Bank Reduces Base Rate and BPLR Effective September 27, 2025",
            "Summary": "Karur Vysya Bank announced a revision in its interest rates effective September 27, 2025. The Base Rate will be reduced from 11.85% to 11.15%, representing a decrease of 70 basis points. The Benchmark Prime Lending Rate (BPLR) will decrease from 16.85% to 16.15%, also a reduction of 70 basis points. The rate changes were communicated to stock exchanges on September 25, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758803414545,
            "Source": "stock"
        },
        {
            "Title": "Karur Vysya Bank Appoints New Independent Director and Head of Internal Audit",
            "Summary": "Karur Vysya Bank appointed Dr. Mythili Vutukuru as an Additional Director in the Independent Category, effective September 24, 2025. Dr. Vutukuru is an Associate Professor in Computer Science and Engineering at IIT Bombay with expertise in computer systems, networking, and cloud computing. Her appointment requires shareholder approval within three months. The bank also appointed Shri R Ganesan as Head of Internal Audit effective October 1, 2025, for a minimum three-year term. Ganesan, who has 34 years of experience with the bank, replaces Shri L Murali who is retiring on September 30, 2025. Additionally, the bank allotted 22,893 equity shares of face value ₹2 each under the KVB ESOS 2018 scheme.",
            "Sentiment": "positive",
            "PublishDate": 1758768261900,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karur Vysya Bank Challenges Income Tax Assessment Reopening in Madras High Court",
            "Summary": "Karur Vysya Bank has filed writ petitions before the Madurai bench of Madras High Court challenging the reopening of income tax assessments for assessment years 2020-21, 2021-22, and 2022-23. The bank received notices under Section 148 and orders under Section 148A(3) from the jurisdictional assessing officer of the Income Tax Department for initiation of reopening assessments. The bank filed the writ petition on September 22, 2025, and believes it has adequate legal grounds to defend the issues involved. The bank expects no material impact on its financial position or operations due to this matter.",
            "Sentiment": "neutral",
            "PublishDate": 1758627944076,
            "Source": "stock"
        },
        {
            "Title": "Karur Vysya Bank Participates in ICICI Securities BFSI Conference, Discusses U.S. Tariff Impact",
            "Summary": "Karur Vysya Bank participated in the BFSI yatra Investors Conference organized by ICICI Securities in Chennai. The bank's top management team including Executive Director Sankar B, CFO R Ramshankar, Chief Risk Officer Jatla Sivaramakrishna, and Head of Commercial Banking Group K P Muthukumar attended the physical group meeting with institutional investors and analysts from 12 firms including Bandhan AMC, Axis Asset Management, Franklin Templeton, and others. The bank disclosed its exposure to U.S. tariff-impacted segments at 1.20% of total advances as of June 2025, with textiles being the largest component at 0.86%. The bank has strategically reduced its textile portfolio from 8.00% in March 2021 to 5.43% in June 2025. Total MSME exposure to U.S. exports stands at 0.56% of total advances. The bank expects the Indian economy to remain resilient through strategic shifts in exports to other countries and increased domestic market focus.",
            "Sentiment": "neutral",
            "PublishDate": 1758518364720,
            "Source": "stock"
        },
        {
            "Title": "Karur Vysya Bank Opens Three New Branches and Reduces MCLR Rates",
            "Summary": "Karur Vysya Bank opened three new branches on September 8, 2025, in Madurai, Coimbatore, and Visakhapatnam, expanding its presence in Tamil Nadu and Andhra Pradesh. The bank also revised its Marginal Cost of Funds Based Lending Rates (MCLR) effective September 7, 2025, reducing rates across all tenors. The overnight MCLR decreased by 10 basis points from 9.25% to 9.15%, while the one-year MCLR dropped from 9.55% to 9.45%. One-month and three-month MCLR rates were reduced from 9.40% to 9.30%, and six-month MCLR decreased from 9.55% to 9.45%.",
            "Sentiment": "positive",
            "PublishDate": 1757061456707,
            "Source": "stock"
        },
        {
            "Title": "Karur Vysya Bank Sets August 26 Record Date for 1:5 Bonus Issue",
            "Summary": "Karur Vysya Bank announced a 1:5 bonus issue with August 26 as the record date. Shareholders will receive one additional share for every five shares held at no extra cost. Investors must hold shares at market close on the record date to qualify and need to purchase shares at least two trading days before due to the T+1 settlement cycle. The bonus issue increases outstanding shares while maintaining market capitalization, with stock price adjusting proportionately. The bank views this as rewarding shareholder loyalty and demonstrating confidence in its financial position. KVB shares closed flat at Rs 258.25 on Friday.",
            "Sentiment": "positive",
            "PublishDate": 1756088997489,
            "Source": "corporate_action"
        },
        {
            "Title": "Karur Vysya Bank Announces Bonus Issue of Shares",
            "Summary": "Karur Vysya Bank has announced a bonus issue of shares through newspaper advertisements published on August 14, 2025. The announcement was made in Business Standard (All Edition, English) and Dinamalar (Trichy Edition, Tamil). The bank disclosed this information to stock exchanges NSE and BSE as part of regulatory compliance requirements.",
            "Sentiment": "positive",
            "PublishDate": 1755187080591,
            "Source": "corporate_action"
        },
        {
            "Title": "Karur Vysya Bank Opens Three New Branches in Trichy, Kurnool, and Mumbai",
            "Summary": "Karur Vysya Bank inaugurated three new branches on August 11, 2025. The branches are located at Trichy KK Nagar-Udayanpatti (branch number 889), Kurnool-Nandyal Check Post in Andhra Pradesh (branch number 890), and Mumbai-Godbundar Road in Thane West (branch number 891). This expansion adds to the bank's existing branch network across different states.",
            "Sentiment": "positive",
            "PublishDate": 1754576480813,
            "Source": "stock"
        },
        {
            "Title": "Karur Vysya Bank Reports 14% YoY Net Profit Growth, Announces 1:5 Bonus Issue",
            "Summary": "Karur Vysya Bank reported net profit of Rs. 521 crores for the quarter ended June 30, 2025, marking a 14% year-on-year increase and 2% quarter-on-quarter growth. The bank's total business reached Rs. 1,96,024 crores with 15% year-on-year growth. Advances rose to Rs. 89,374 crores (6% QoQ growth) while deposits increased to Rs. 1,06,650 crores (4% QoQ growth). Net interest margin stood at 3.86%, declining 19 basis points from the previous quarter. The bank maintained its NIM guidance of 3.7-3.75% for the full year. Gross NPAs improved to 0.66% from 0.74% sequentially, while net NPAs remained steady at 0.19%. Credit cost was 0.54% annualized. The board proposed a 1:5 bonus issue subject to shareholder approval. Operating expenses decreased to Rs. 721 crores with cost-to-income ratio at 47.22%. The bank maintained guidance for credit growth above 2% over industry growth, gross NPA below 1.5%, and cost-to-income ratio below 50%.",
            "Sentiment": "positive",
            "PublishDate": 1753931993608,
            "Source": "earnings"
        },
        {
            "Title": "Karur Vysya Bank Celebrates 109th Founder's Day, Launches Cybersecurity Awareness Initiative",
            "Summary": "Karur Vysya Bank celebrated its 109th Founder's Day in Karur with RBI Deputy Governor Shri Swaminathan J as the Chief Guest. The event was attended by customers, Board of Directors, founding family members, and employees. As part of the celebrations, Shri Swaminathan J remotely launched KVB's Cybersecurity Awareness Initiative in Trichy, designed to promote digital safety and responsible financial practices among the public. The initiative will reach various sections of society through mass media campaigns, offline and branch activations, and workshops across schools, colleges, workplaces, residential communities, and senior citizen forums. Managing Director & CEO Shri Ramesh Babu emphasized the bank's commitment to serving with integrity and creating awareness for digital security. The celebration also featured the unveiling of a brand film showcasing the bank's 109-year journey from its humble beginnings to becoming a modern, tech-driven financial institution with a national footprint.",
            "Sentiment": "positive",
            "PublishDate": 1753449732856,
            "Source": "stock"
        },
        {
            "Title": "Karur Vysya Bank Board Approves AGM Date, Share Capital Increase, and New Employee Stock Option Scheme",
            "Summary": "Karur Vysya Bank's Board of Directors approved several key decisions. The 106th Annual General Meeting is scheduled for August 21, 2025, via video conferencing. The Board approved increasing authorized share capital from ₹200 crore to ₹250 crore, divided into 125 crore equity shares of ₹2 each, subject to shareholder approval. A new employee stock option scheme KVB-ESOS-2025 was approved, covering 3 crore equity shares with options vesting between 1-3 years and exercise period of maximum 2 years. The Board allotted 25,141 equity shares to employees under existing ESOS schemes, 15,697 shares to MD & CEO B Ramesh Babu, and 21,884 shares to senior management as part of variable pay for FY 2023-24. M/s. S.A.E. & Associates LLP was appointed as Secretarial Auditors for FY 2025-26 to FY 2029-30 at ₹2.25 lakh per annum. The record date for proposed dividend for FY 2024-25 was fixed as August 7, 2025, with dividend payment scheduled on or after August 22, 2025, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1753420839011,
            "Source": "corporate_action"
        },
        {
            "Title": "Karur Vysya Bank Reports 15.27% Business Growth and 13.51% Net Profit Rise in Q1 Results",
            "Summary": "Karur Vysya Bank announced its quarterly results showing total business growth of 15.27% year-over-year to Rs 1,96,024 crore. Net profit increased 13.51% to Rs 521 crore compared to Rs 459 crore in the corresponding quarter. Deposits grew 15.49% to Rs 1,06,650 crore while advances rose 15.01% to Rs 89,374 crore. The bank's Net Interest Margin declined to 3.86% from 4.14% in the previous year quarter. Asset quality improved with Gross NPA at 0.66% and Net NPA at 0.19%. Capital Adequacy Ratio stood at 17.36% with Tier 1 at 16.33%. The CASA ratio was 27.48% and Cost to Income ratio at 47.24%. The board approved bonus shares in 1:5 proportion subject to shareholder approval. Managing Director Ramesh Babu noted the bank successfully front-loaded growth in the first quarter and achieved sustained performance across growth, profitability, and asset quality metrics.",
            "Sentiment": "positive",
            "PublishDate": 1753360645615,
            "Source": "earnings"
        },
        {
            "Title": "Karur Vysya Bank Reports Q1 Results and Announces 1:5 Bonus Share Issue",
            "Summary": "Karur Vysya Bank announced its quarterly results for the quarter ended June 30, 2025, with net profit of Rs. 521.45 crores compared to Rs. 458.65 crores in the same quarter last year. The bank's Board of Directors approved a bonus share issue in the ratio of 1:5, meaning shareholders will receive one bonus share for every five shares held, subject to shareholder approval at the AGM. The record date for bonus share entitlement is August 26, 2025. The bank's gross NPA ratio improved to 0.66% from 1.32% in the previous year, while net NPA ratio decreased to 0.19% from 0.38%. Capital adequacy ratio stood at 17.36%. The bonus shares will be funded from the Securities Premium Account and are expected to be credited within two months of Board approval.",
            "Sentiment": "positive",
            "PublishDate": 1753355916784,
            "Source": "corporate_action"
        },
        {
            "Title": "Karur Vysya Bank Reports Strong Q1 Results with 15.56% Profit Growth and Announces Bonus Share Issue",
            "Summary": "Karur Vysya Bank reported strong quarterly results with interest income rising to 25.69 billion rupees from 22.9 billion rupees year-over-year. The bank's net profit increased 15.56% compared to the previous year, reaching 5.2 billion rupees versus 4.5 billion rupees in the same period last year. Additionally, the company approved the issuance of bonus shares in a 1:5 ratio, meaning shareholders will receive one bonus share for every five shares held.",
            "Sentiment": "positive",
            "PublishDate": 1753348973999,
            "Source": "earnings"
        },
        {
            "Title": "Karur Vysya Bank Considers First Bonus Issue Since 2018",
            "Summary": "Karur Vysya Bank's board will consider a bonus share issue alongside its quarterly results announcement. This would mark the bank's first bonus issue in seven years and fourth overall. The bank previously issued bonus shares in 2002 (1:1 ratio), 2010 (2:5 ratio), and 2018 (1:10 ratio). Shares traded 1% lower at ₹268.6, despite gaining 8% over the past month and 20% year-to-date in 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753335734258,
            "Source": "corporate_action"
        },
        {
            "Title": "Karur Vysya Bank Board to Consider Bonus Share Issue After Seven Years",
            "Summary": "Karur Vysya Bank's Board of Directors will meet on July 24 to consider a bonus share issue proposal alongside quarterly financial results. This would be the bank's first bonus issue in seven years and fourth since listing. The bank has previously issued bonus shares in 2002 (1:1 ratio), 2010 (2:5 ratio), and 2018 (1:10 ratio). The record date has not been announced yet. In Q4FY25, the bank reported net profit of Rs 513.36 crore, up 12.55% year-on-year, with total income rising 7.5% to Rs 3,025.26 crore. Bank shares gained up to 3% to hit Rs 276 on the announcement, later trading 0.71% higher at Rs 270.1.",
            "Sentiment": "positive",
            "PublishDate": 1753088244833,
            "Source": "corporate_action"
        },
        {
            "Title": "Karur Vysya Bank to Consider Bonus Share Issue After Seven-Year Gap",
            "Summary": "Karur Vysya Bank will hold a board meeting on July 24 to consider issuing bonus shares to shareholders, marking the first such consideration in seven years. This would be the bank's fourth bonus issue, following previous distributions in 2002 (1:1 ratio), 2010 (2:5 ratio), and 2018 (1:10 ratio). The record date has not been disclosed. The board will also review quarterly results on the same day. The bank's shares closed at ₹268.3, down 0.8%, near its 52-week high of ₹277.5. The stock has gained 10% over the past month and 19% over the past year.",
            "Sentiment": "positive",
            "PublishDate": 1752911415020,
            "Source": "corporate_action"
        },
        {
            "Title": "Karur Vysya Bank: Q1 Deposits and Advances Surge 15% YoY",
            "Summary": "Karur Vysya Bank reported a 15.49% YoY increase in total deposits to ₹1.06 lakh crore and a 15% YoY growth in advances to ₹89,370 crore for Q1 FY26. Total business rose 15.27% YoY to ₹1.96 lakh crore. CASA deposits grew 4.51% YoY to ₹29,306 crore. The bank's stock gained 2.88% intraday on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1751360951000,
            "Source": "result"
        },
        {
            "Title": "Karur Vysya Bank Reports Growth in Deposits and Advances",
            "Summary": "Karur Vysya Bank has reported growth in its financial metrics. Total deposits increased by 15.49% to Rs 1,06,650 crore. Advances rose by 15.00% to Rs 89,370 crore. The bank's total business reached Rs 1,96,020 crore, marking a 15.27% increase from Rs 1,70,059 crore in the previous period.",
            "Sentiment": "positive",
            "PublishDate": 1751359631000,
            "Source": "default"
        },
        {
            "Title": "Karur Vysya Bank: Targets 2% Above Industry Credit Growth in FY26",
            "Summary": "Karur Vysya Bank expects credit growth to exceed industry average by 2% in FY26. Plans to open 28 new branches in H1. Anticipates Net Interest Margin of 3.7-3.75%, cost-to-income ratio around 50%, GNPA below 150 bps, and Net NPA under 1%. Q4 FY25 net profit up 13% to Rs 513 crore.",
            "Sentiment": "positive",
            "PublishDate": 1748152330000,
            "Source": "earnings"
        },
        {
            "Title": "Karur Vysya Bank: Q4 Results Show Resilience Despite NIM Pressure",
            "Summary": "Karur Vysya Bank's Q4 results reveal strong growth in risk assessment model (~20% YoY), controlled operating expenses, and low net non-performing assets. However, the bank faces potential NIM pressure due to a high share of EBLR loans (~52%).",
            "Sentiment": "neutral",
            "PublishDate": 1747719672000,
            "Source": "earnings"
        },
        {
            "Title": "Karur Vysya Bank: Q4 Profit Rises 13%, Announces Dividend",
            "Summary": "Karur Vysya Bank reported a 13% increase in Q4 net profit to Rs 513 crore. Net interest income rose 9% to Rs 1,089 crore. The bank announced a dividend of Rs 2.6 per share. Gross NPA improved to 0.76% from 0.83% quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747659671000,
            "Source": "result"
        },
        {
            "Title": "Karur Vysya Bank: Q4 Profit Up 13%, Declares Dividend",
            "Summary": "Karur Vysya Bank reported a 12.6% YoY increase in Q4 net profit to ₹513.4 crore. NII rose 9.1% to ₹1,089.2 crore. Gross NPA improved to 0.76% from 0.83% QoQ, while Net NPA remained at 0.20%. The bank declared a dividend of ₹2.6 per share for FY2025.",
            "Sentiment": "positive",
            "PublishDate": 1747653247000,
            "Source": "earnings"
        },
        {
            "Title": "Karur Vysya Bank Reports 14% YoY Growth in Total Business for FY25",
            "Summary": "Karur Vysya Bank has released its provisional business update for the fiscal year 2025, reporting a 14% year-over-year growth in total business. This update indicates positive performance and expansion for the bank in the given financial period.",
            "Sentiment": "positive",
            "PublishDate": 1743491593000,
            "Source": "result"
        }
    ]
}