{
    "Symbol": "KAVDEFENCE",
    "ISIN": "INE641C01019",
    "News": [
        {
            "Title": "Kavveri Defence Reverses RTA Change Decision",
            "Summary": "Kavveri Defence & Wireless Technologies Limited rescinded its November 2025 board resolution to change its Registrar and Transfer Agent, maintaining services with existing RTA M/s. Integrated Registry Management Services Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1768214791525,
            "Source": "stocks"
        },
        {
            "Title": "Kavveri Defence Develops Indigenous Antenna System for Indian Armed Forces Drone Operations",
            "Summary": "Kavveri Defence Wireless Technologies Limited successfully designed and developed an advanced dual-polarized, high-gain antenna system that has been shipped to a defence customer supplying drone platforms to the Indian Armed Forces. The company's antenna system was selected over a North American supplier under an emergency procurement requirement, marking a significant achievement in India's defence technology self-reliance.",
            "Sentiment": "positive",
            "PublishDate": 1764829891608,
            "Source": "stock"
        },
        {
            "Title": "Kavveri Defence Wireless Technologies Appoints Ms. Renu Choudhary as Company Secretary",
            "Summary": "Kavveri Defence Wireless Technologies Limited's Board of Directors approved the appointment of Ms. Renu Choudhary as Whole-Time Company Secretary, Key Managerial Personnel and Compliance Officer effective November 29, 2025. Ms. Choudhary is an Associate Member of ICSI with over 5 years of experience in secretarial matters and was appointed based on the Nomination and Remuneration Committee's recommendation.",
            "Sentiment": "positive",
            "PublishDate": 1764422024956,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kavveri Defence & Wireless Technologies Reports Quarterly Results and Changes Share Transfer Agent",
            "Summary": "Kavveri Defence & Wireless Technologies Limited announced unaudited financial results for the quarter and half year ended September 30, 2025, alongside appointing M/s. Satellite Corporate Services Private Limited as new share transfer agent effective November 17, 2025. The company's auditors issued qualified opinions on both standalone and consolidated results, citing unconfirmed balances and exclusion of several subsidiaries from consolidated statements.",
            "Sentiment": "neutral",
            "PublishDate": 1763175465172,
            "Source": "earnings"
        },
        {
            "Title": "KAVVERI Defence & Wireless Technologies Expands Manufacturing Operations with New Bengaluru Facility",
            "Summary": "KAVVERI Defence & Wireless Technologies has established a new 10,000 square feet manufacturing facility in Bengaluru. The company has outlined plans for a future 50,000 square feet expansion and intends to convert its headquarters into a research and development center focused on innovation.",
            "Sentiment": "positive",
            "PublishDate": 1759997786018,
            "Source": "stock"
        },
        {
            "Title": "Kavveri Defence Approves Quarterly Results and Key Leadership Changes",
            "Summary": "Kavveri Defence & Wireless Technologies Limited's board approved unaudited financial results for the quarter ended June 30, 2025. The board recommended continuing Mr. L R Venugopal as Non-Executive Director beyond age 75, subject to shareholder approval. The company also proposed redesignating Mr. Sankethram Reddy from Executive Director to Whole-time Director effective October 1, 2025, pending member approval. Mr. Sankethram Reddy, who holds a Masters in Finance, is the son of Managing Director Mr. Chennareddy Shivkumar Reddy and Whole-time Director Mrs. Rajupeta Kasturi Hanumenthareddy. The board noted an SOP fine levied by NSE. The auditors provided a limited review report with qualified opinion on the quarterly results.",
            "Sentiment": "neutral",
            "PublishDate": 1755184771172,
            "Source": "corporate_action"
        },
        {
            "Title": "Kavveri Defence's North American Subsidiary Til-Tek Secures $2 Million US Multinational Contract",
            "Summary": "Kavveri Defence & Wireless Technologies Limited announced that its North American subsidiary, Til-Tek, has been approved as a vendor by a leading US-based multinational company. The engagement represents a $2 million revenue opportunity, with Til-Tek's RF antenna products being exclusively embedded into the customer's network design framework. The customer is engaged in large-scale industrial and infrastructure solutions with global presence across the United States, Europe, and Asia-Pacific region. This engagement follows the replacement of a long-standing international incumbent, with the relationship expected to expand into Kavveri serving as a comprehensive RF subsystem partner. The contract involves continuous supply of RF products to an international entity, with volumes expected to scale steadily over the coming quarters.",
            "Sentiment": "positive",
            "PublishDate": 1753337282709,
            "Source": "order&deals"
        }
    ]
}