{
    "Symbol": "KAYA",
    "ISIN": "INE587G01015",
    "News": [
        {
            "Title": "Kaya Limited Board Approves Preferential Issue Variation",
            "Summary": "Kaya Limited's board approved variation in preferential issue objects to include working capital requirements alongside growth and business expansion, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1769592239925,
            "Source": "stocks"
        },
        {
            "Title": "Kaya Reports Higher Q3 Losses Despite Revenue Growth",
            "Summary": "Kaya's Q3 net loss widened to 355 million rupees from 154 million rupees year-over-year, while revenue grew marginally to 600 million rupees from 584 million rupees in the same period.",
            "Sentiment": "negative",
            "PublishDate": 1769588277563,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kaya Limited VP Marketing Nishant Nayyar Resigns",
            "Summary": "Kaya Limited announces resignation of Mr. Nishant Nayyar, Vice President & Head Marketing, effective April 23, 2026, citing personal reasons for departure from senior managerial position.",
            "Sentiment": "neutral",
            "PublishDate": 1769181954749,
            "Source": "stocks"
        },
        {
            "Title": "Kaya Limited Board Meet on Jan 28 for Q3FY26 Results",
            "Summary": "Kaya Limited announces board meeting scheduled for January 28, 2026, to consider Q3FY26 financial results. Trading window closed from January 1-30, 2026 as per regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1768542438208,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kaya Limited Appoints Saurav Jha as Chief Business Officer",
            "Summary": "Kaya Limited has appointed Saurav Jha as Chief Business Transformation Officer effective December 22, 2025. Jha brings over 18 years of experience from companies like CaratLane and Urban Company.",
            "Sentiment": "positive",
            "PublishDate": 1765960653857,
            "Source": "stocks"
        },
        {
            "Title": "KAYA Reports Wider Net Loss Despite Revenue Growth in Q2",
            "Summary": "KAYA reported a consolidated net loss of 187.6 million rupees in Q2, compared to a loss of 156.7 million rupees in the same period last year. The company's revenue increased to 538.5 million rupees from 525.2 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1763029371704,
            "Source": "earnings"
        },
        {
            "Title": "Kaya's Head Office and Clinic Undergo Income Tax Survey",
            "Summary": "Kaya's head office and clinic were surveyed by income tax authorities. The company states it has fully complied with the survey process and indicates no further updates are needed.",
            "Sentiment": "neutral",
            "PublishDate": 1758791653570,
            "Source": "stock"
        },
        {
            "Title": "Tax Officials Visit Kaya's Head Office and Clinic; Operations Continue Normally",
            "Summary": "Tax officials conducted visits to Kaya's head office and clinic facilities. The company is fully cooperating with the officials during this process. Kaya has reported that these visits have not caused any significant impact on its business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1758171136061,
            "Source": "stock"
        },
        {
            "Title": "Kaya Limited Raises Rs. 75 Crore Through Preferential Share Allotment to Axana Estates LLP",
            "Summary": "Kaya Limited allotted 20,90,068 equity shares at Rs. 358.84 per share to Axana Estates LLP on a preferential basis, raising Rs. 75 crore. The allotment was approved by the Board of Directors and received shareholder approval through a special resolution. Following this allotment, the company's paid-up equity share capital increased to Rs. 15.18 crore, comprising 1,51,87,609 equity shares with a face value of Rs. 10 each. The shares were issued at a premium of Rs. 348.84 per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1755000044064,
            "Source": "corporate_action"
        },
        {
            "Title": "Kaya Limited Reports Rs 1,407 Crore Loss in Q1 FY26, Plans Rs 75 Crore Capital Raise",
            "Summary": "Kaya Limited reported a standalone net loss of Rs 1,406.54 crore for the quarter ended June 30, 2025, compared to a profit of Rs 648.98 crore in the same quarter last year. Revenue from operations declined to Rs 5,279.22 crore from Rs 5,203.49 crore year-on-year. On a consolidated basis, the company posted a loss of Rs 1,408.73 crore versus a profit of Rs 10,269.77 crore in the previous year quarter. The company's auditors highlighted concerns about its negative net worth and working capital position, though management believes it can meet obligations through promoter support and available funds. Kaya has approved raising Rs 7,500 crore through preferential equity shares to Axana Estates LLP, with funds earmarked for strategic expansion including new clinics, relocations, renovations and equipment purchases. The company operates in the skin care and hair care business segment.",
            "Sentiment": "negative",
            "PublishDate": 1754389240872,
            "Source": "earnings"
        },
        {
            "Title": "Kaya Limited Receives Stock Exchange Approval for Rs 75 Crore Preferential Share Issue",
            "Summary": "Kaya Limited has received in-principle approval from BSE and NSE for a preferential issue of 20,90,068 equity shares at Rs. 358.84 per share, totaling Rs. 75 crore, to Axana Estates LLP. The approvals were granted on July 31, 2025, with BSE providing approval via letter ref. no. LOD/PREF/PB/FIP/643/2025-26 and NSE through letter ref. no. NSE/LIST/49430. The equity shares have a face value of Rs. 10 each. The company had previously communicated about this preferential issue on June 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754048537643,
            "Source": "corporate_action"
        },
        {
            "Title": "Kaya Limited Shareholders Approve Preferential Equity Share Issuance with 99.99% Majority",
            "Summary": "Kaya Limited conducted an Extraordinary General Meeting on July 22, 2025, via video conferencing to vote on the issuance of equity shares on a preferential basis. The special resolution received overwhelming shareholder support, with 7,772,945 votes in favor (99.99%) and only 13 votes against (0.01%). A total of 72 shareholders participated in the voting process, including 68 through remote e-voting and 4 during the meeting. The company has 19,735 total shareholders on record. The meeting was attended by 31 shareholders through video conferencing, comprising 17 from the promoter group and 14 from the public category. The voting results and scrutinizer's report have been submitted to stock exchanges BSE and NSE, and uploaded on the company's website.",
            "Sentiment": "positive",
            "PublishDate": 1753171440576,
            "Source": "corporate_action"
        },
        {
            "Title": "Kaya Ltd: Prashant Jain Acquires 1.1% Stake, Stock Surges 13%",
            "Summary": "Investor Prashant Jain bought 1,41,980 shares (1.08% stake) in Kaya Ltd in Q4. The stock jumped 13% following the news. Kaya reported a Q3FY25 net loss of Rs 15.4 crore on revenue of Rs 58.3 crore. The company recently partnered with Marico to expand its personal care product reach.",
            "Sentiment": "positive",
            "PublishDate": 1744185913000,
            "Source": "block_deals"
        },
        {
            "Title": "Prashant Jain Acquires 1.08% Stake in Kaya Ltd in Q4",
            "Summary": "Investor Prashant Jain has emerged as a significant shareholder in Kaya Ltd, acquiring a 1.08% stake in the company during the fourth quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1744180691000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kaya Ltd Reports Q2 Financial Results",
            "Summary": "Kaya Ltd announced its Q2 financial results. The company reported a consolidated net loss of 156.7 million rupees, compared to a loss of 116.4 million rupees in the same quarter last year. However, it showed a significant improvement from the previous quarter, with a profit of 1.03 billion rupees. The Q2 revenue increased to 525.2 million rupees from 507 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730134524000,
            "Source": "result"
        }
    ]
}