{
    "Symbol": "KAYNES",
    "ISIN": "INE918Z01012",
    "News": [
        {
            "Title": "Kaynes Technology Q3 Profit Rises 15% to ₹766M",
            "Summary": "Kaynes Technology India reported Q3 consolidated net profit of ₹766M, up 15% YoY from ₹665M, though below estimates of ₹1.1B. Revenue grew 21% to ₹8B from ₹6.6B YoY.",
            "Sentiment": "positive",
            "PublishDate": 1770302019065,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kaynes Technology Subsidiary Changes Name to Gridcrest",
            "Summary": "Kaynes Technology India Limited announces name change of wholly owned subsidiary from ISKRAEMECO INDIA PRIVATE LIMITED to GRIDCREST TECHNOLOGIES PRIVATE LIMITED effective February 02, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770034116187,
            "Source": "stocks"
        },
        {
            "Title": "Kaynes Technology Block Trade Worth Rs. 16.72 Crores",
            "Summary": "Kaynes Technology India Ltd. witnessed a significant NSE block trade worth Rs. 16.72 crores involving approximately 49,181 shares at Rs. 3399.70 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770015531550,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kaynes Technology Board Meet Set for Feb 5, 2026",
            "Summary": "Kaynes Technology India Limited announces board meeting on February 05, 2026 to consider Q3FY26 unaudited standalone and consolidated financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769515399558,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kaynes Technology Gets IND A-/Stable Credit Rating",
            "Summary": "India Ratings assigns IND A-/Stable/IND A1 rating to Kaynes Technology's INR7,700 million bank loan facilities, affirming INR6,250 million existing limits and assigning INR1,450 million new limits.",
            "Sentiment": "positive",
            "PublishDate": 1769254423125,
            "Source": "stocks"
        },
        {
            "Title": "India-Germany Semiconductor Partnership Announced",
            "Summary": "Prime Minister and German opposition leader Merz announce collaboration on semiconductor partnership between India and Germany, potentially benefiting companies like Kaynes Technology India.",
            "Sentiment": "positive",
            "PublishDate": 1768202899546,
            "Source": "stocks"
        },
        {
            "Title": "Kaynes Tech shares fall 6.5% amid analyst downgrades",
            "Summary": "Kaynes Technology shares declined 6.5% to ₹3,736.10, hitting 52-week low of ₹3,711.00. Jefferies maintained buy rating but cut price target to ₹5,940 from ₹7,780, implying 55% upside potential.",
            "Sentiment": "negative",
            "PublishDate": 1767689853156,
            "Source": "stocks"
        },
        {
            "Title": "PLI Scheme Opens Door to Chinese Investment with Conditions",
            "Summary": "MeitY Secretary confirms Chinese investments complying with FDI norms eligible for Electronics Component PLI benefits, signaling case-by-case assessment approach.",
            "Sentiment": "neutral",
            "PublishDate": 1767339320804,
            "Source": "stocks"
        },
        {
            "Title": "Kaynes Technology Gets Credit Rating Reaffirmation",
            "Summary": "CARE Ratings reaffirmed CARE A-: Stable/CARE A2 rating for Kaynes Technology's bank facilities worth ₹625.20 crores, citing strong ESDM presence and expanding order book despite execution risks.",
            "Sentiment": "positive",
            "PublishDate": 1766143718600,
            "Source": "stocks"
        },
        {
            "Title": "Kaynes Technology Gets CRISIL A Rating on Watch",
            "Summary": "CRISIL assigns A rating with developing watch to Kaynes Technology's ₹770 crore bank facilities, reflecting adequate safety for debt servicing amid emerging credit profile situation.",
            "Sentiment": "neutral",
            "PublishDate": 1765809726037,
            "Source": "stocks"
        },
        {
            "Title": "Kaynes Technology Gets ICRA A- Credit Rating",
            "Summary": "Kaynes Technology India receives ICRA A- (Positive) rating for ₹216 crore fund-based facilities including cash credit and packing credit from ICRA Limited on December 13, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765809322168,
            "Source": "stocks"
        },
        {
            "Title": "Morgan Stanley Sets Equal-Weight on Kaynes Tech",
            "Summary": "Morgan Stanley assigns Equal-weight rating to Kaynes Technology India with target price of ₹6,155.00, indicating neutral outlook on the electronics manufacturing stock.",
            "Sentiment": "neutral",
            "PublishDate": 1765424534777,
            "Source": "stocks"
        },
        {
            "Title": "Kotak Securities Cuts Kaynes Tech Target to ₹4,150",
            "Summary": "Kotak Securities has revised its target price for Kaynes Technology India downward to ₹4,150, reflecting updated valuation assessment for the electronics manufacturing services company.",
            "Sentiment": "negative",
            "PublishDate": 1765375949008,
            "Source": "stocks"
        },
        {
            "Title": "Kaynes Technology Block Trade Worth ₹16.34 Crores",
            "Summary": "Kaynes Technology India Ltd. witnessed a significant block trade on NSE worth ₹16.34 crores involving 37,569 shares at ₹4,349.00 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1765375867337,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kaynes Technology India Block Trade Worth Rs. 16.34 Crores on NSE",
            "Summary": "Kaynes Technology India Ltd. executed a block trade on NSE involving approximately 37,569 shares at Rs. 4,349.00 per share. The transaction was valued at Rs. 16.34 crores, representing a significant institutional trading activity for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1765338736309,
            "Source": "order&deals"
        },
        {
            "Title": "Kaynes Technology Denies Auditor Change Reports, Clarifies No Negotiations Underway",
            "Summary": "Kaynes Technology India Limited issued a clarification to stock exchanges denying media reports about changing auditors, stating no negotiations are taking place and no decisions are under consideration by the Board or Audit Committee. The company attributed the reports to incorrect interpretation of management's general remarks during a media interaction and confirmed current statutory auditors continue their approved tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1765264770998,
            "Source": "stock"
        },
        {
            "Title": "Kaynes Technology India Schedules Business Update Conference Call",
            "Summary": "Kaynes Technology India Limited has scheduled a conference call for December 8, 2025 at 8:30 AM IST to provide a business update to analysts and investors. The call will be hosted by Axis Capital and will feature management discussion followed by a Q&A session with key executives including the Chairperson, Executive Vice Chairman, Managing Director, and CFO.",
            "Sentiment": "neutral",
            "PublishDate": 1765093988237,
            "Source": "stock"
        },
        {
            "Title": "Kaynes Technology India Block Trade Worth Rs. 19.49 Crores Executed on NSE",
            "Summary": "Kaynes Technology India Ltd. witnessed a block trade on NSE involving approximately 41,412 shares at Rs. 4,707.00 per share, totaling Rs. 19.49 crores. The transaction represents a significant institutional or bulk trading activity in the electronics manufacturing company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764907510307,
            "Source": "order&deals"
        },
        {
            "Title": "Kaynes Technology Responds to Kotak Institutional Equities Report Observations",
            "Summary": "Kaynes Technology issued clarifications addressing observations from a Kotak Institutional Equities report dated December 3, 2025, covering goodwill recognition, contingent liabilities of Rs. 520 Cr, related-party transaction disclosures, borrowing costs, and capitalized intangible assets. The company explained accounting treatments for acquisitions, disclosed performance bank guarantees of Rs. 96.8 Cr for Iskraemeco projects, acknowledged inadvertent non-disclosure of related-party transactions in standalone statements, and clarified that average borrowing cost including bill discounting was 10% rather than 17.7%.",
            "Sentiment": "neutral",
            "PublishDate": 1764904344990,
            "Source": "stock"
        },
        {
            "Title": "Kotak Identifies Disclosure Inconsistencies Across Kaynes Entities",
            "Summary": "Kotak has identified multiple inconsistencies in disclosures across various entities within Kaynes. The observation raises concerns about the company's reporting practices and transparency standards.",
            "Sentiment": "negative",
            "PublishDate": 1764837951298,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kaynes Reports Expected Margin Improvement and Plans to Maintain EBITDA Levels",
            "Summary": "Kaynes reported an expected improvement in its margins during its latest results. The company plans to maintain its EBITDA margins going forward, indicating focus on profitability sustainability.",
            "Sentiment": "positive",
            "PublishDate": 1763439217658,
            "Source": "stock"
        },
        {
            "Title": "Kaynes Technology India Block Trade Worth Rs. 209.09 Crores on NSE",
            "Summary": "Kaynes Technology India executed a block trade on NSE involving 343,304 shares at Rs. 6,090.50 per share, totaling Rs. 209.09 crores. The transaction represents a significant institutional trading activity for the technology company's shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763437641178,
            "Source": "order&deals"
        },
        {
            "Title": "Kaynes Technology Faces Key Trading Session as 11.6 Million Shares Exit Lock-in Period",
            "Summary": "Kaynes Technology India's shareholder lock-in period ends on November 18, making 11.6 million shares (20% of outstanding equity) eligible for trading after the stock declined for four consecutive sessions. Despite strong September quarter results showing 102% profit growth to ₹121.4 crore and 58.4% revenue increase to ₹906.2 crore, the stock trades 17% down year-to-date at ₹6,339.",
            "Sentiment": "neutral",
            "PublishDate": 1763114923033,
            "Source": "stock"
        },
        {
            "Title": "Kaynes Technology Seeks Shareholder Approval for Leadership Changes Through Postal Ballot",
            "Summary": "Kaynes Technology India Limited has issued a postal ballot notice seeking shareholder approval for two key leadership appointments. The company proposes to appoint Dr. Muthukumar Narayanaswamy as Director and Managing Director for a five-year term from September 24, 2025 to September 23, 2030, with an annual remuneration of INR 1.8 crore. Additionally, the company seeks approval to change the designation of Mr. Ramesh Kunhikannan from Managing Director to Executive Vice Chairman in the category of Whole Time Director for the residual term from September 24, 2025 to March 31, 2029, also with INR 1.8 crore annual remuneration. The e-voting period runs from November 13, 2025 to December 12, 2025. Dr. Narayanaswamy brings nearly four decades of experience across automotive, rubber, and industrial products sectors, having held leadership positions at TTK-LIG Limited, TVS Group companies, and Cummins Meritor. Mr. Ramesh Kunhikannan has been with the company since incorporation and is married to Mrs. Savitha Ramesh, the company's Chairperson and Whole-time Director.",
            "Sentiment": "neutral",
            "PublishDate": 1762897117301,
            "Source": "corporate_action"
        },
        {
            "Title": "Kaynes Technology Independent Director Anup Kumar Bhat Resigns Due to Other Commitments",
            "Summary": "Anup Kumar Bhat has resigned from his position as Independent Director of Kaynes Technology India Limited with immediate effect. His resignation is attributed to his commitment towards various other assignments requiring his attention. Bhat will also cease to be a member of the Audit Committee, Corporate Social Responsibility Committee, Nomination Remuneration Committee, and Risk Management Committee. He confirmed that there are no material reasons for his resignation other than those mentioned in his resignation communication. The resignation was effective November 10, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762829550937,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kaynes Technology Submits Monitoring Agency Reports for QIP Proceeds Utilization",
            "Summary": "Kaynes Technology India Limited submitted monitoring agency reports for two Qualified Institutional Placements (QIPs) for the quarter ended September 30, 2025. The first QIP, allotted on December 21, 2023, raised INR 1,374 crore with ICRA Limited as monitoring agency. The second QIP, allotted on June 24, 2025, raised Rs 16,000 million with CRISIL Ratings Limited as monitoring agency. For the December 2023 QIP, the company utilized INR 99.863 crore during the quarter, with total utilization reaching INR 837.244 crore and INR 536.756 crore remaining unutilized. Proceeds were used for OSAT facility establishment, PCB facility development, and general corporate purposes including acquisitions and statutory payments. For the June 2025 QIP, the company utilized Rs 297.70 million during the quarter towards debt repayment, inorganic growth opportunities, and general corporate purposes. Both monitoring agencies reported no major deviations from disclosed objectives, with unutilized funds deployed in fixed deposits and mutual funds.",
            "Sentiment": "neutral",
            "PublishDate": 1762606431949,
            "Source": "stock"
        },
        {
            "Title": "Kaynes Technology Reports 58% Revenue Growth to INR 9,062 Million in Q2 FY26",
            "Summary": "Kaynes Technology India Limited reported strong quarterly results with revenue of INR 9,062 million, marking 58% year-on-year growth. Operational EBITDA reached INR 1,480 million with 80% growth and margin expansion of 190 basis points to 16.3%. Profit after tax stood at INR 1,214 million, representing a 13.4% PAT margin. The company's order book increased to INR 80,994 million compared to INR 54,228 million in the previous year. For the first half of FY26, total revenue was INR 15,797 million with 47% year-on-year growth. The company achieved a milestone by delivering India's first commercially manufactured multi-chip module at its Sanand OSAT facility in collaboration with Alpha Omega Semiconductor and Mitsui Company. Kaynes received government approval for advanced PCB manufacturing projects and is transitioning from an EMS player to a fully integrated ESDM company. The company maintains revenue guidance of $1 billion by FY28 and $2 billion by FY30.",
            "Sentiment": "positive",
            "PublishDate": 1762606075292,
            "Source": "earnings"
        },
        {
            "Title": "Kaynes Technology Targets $1 Billion Revenue by FY28, Expects 50-60% Volume Growth",
            "Summary": "Kaynes Technology announced ambitious growth plans during a management update. The company expects significant volume growth of over 50-60% in the second half. Management anticipates higher profit margins from their new PCB facility compared to current consolidated margins. The company has set a revenue target of $1 billion by FY28.",
            "Sentiment": "positive",
            "PublishDate": 1762401231958,
            "Source": "stock"
        },
        {
            "Title": "Kaynes Technology Delivers India's First Commercial Multi-Chip Module at Sanand Facility",
            "Summary": "Kaynes Technology achieved a milestone by delivering India's first commercial multi-chip module at its Sanand facility. The company partnered with Alpha & Omega Semiconductor and Mitsui & Company for this development. This represents a significant manufacturing achievement in India's semiconductor sector.",
            "Sentiment": "positive",
            "PublishDate": 1762400083674,
            "Source": "stock"
        },
        {
            "Title": "Kaynes Technology Reports No Deviations in Fund Utilization for Two QIP Issues",
            "Summary": "Kaynes Technology India Limited confirmed no deviations or variations in fund utilization for the quarter and half year ended September 30, 2025, for two Qualified Institutional Placements. The first QIP was allotted on December 21, 2023, with gross proceeds of Rs. 14,000 million and net proceeds of Rs. 13,740 million after issue expenses of Rs. 260 million. The second QIP was allotted on June 24, 2025, raising gross proceeds of Rs. 16,000 million with net proceeds of Rs. 15,740 million after issue expenses of Rs. 250.34 million. The second QIP funds were allocated for debt repayment (Rs. 8,412.61 million), inorganic growth opportunities including acquisitions (Rs. 1,600 million with Rs. 482.67 million utilized), and general corporate purposes (Rs. 3,737.05 million with Rs. 602.42 million utilized). Unused funds from both issues are deposited in scheduled commercial banks and permitted investments as per company policy.",
            "Sentiment": "neutral",
            "PublishDate": 1762281274223,
            "Source": "corporate_action"
        },
        {
            "Title": "Kaynes Technology India Reports Strong Q2 Growth with Net Profit Doubling to 1.21 Billion Rupees",
            "Summary": "Kaynes Technology India reported consolidated net profit of 1.21 billion rupees for Q2, compared to 602 million rupees in the same period last year. Revenue increased to 9.06 billion rupees from 5.7 billion rupees year-over-year. EBITDA rose to 1.48 billion rupees versus 821 million rupees previously, while EBITDA margin improved to 16.33% from 14.35% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762272689173,
            "Source": "earnings"
        },
        {
            "Title": "Semiconductor Production Begins at Kaynes Tech and CG Power Manufacturing Plants",
            "Summary": "Ashwani Vaishnaw announced that semiconductor production has commenced at manufacturing facilities operated by Kaynes Tech and CG Power. This marks the operational start of semiconductor manufacturing at both companies' plants.",
            "Sentiment": "positive",
            "PublishDate": 1762154687075,
            "Source": "stock"
        },
        {
            "Title": "Kaynes Tech Extends CEO Sharma's Notice Period to November 8",
            "Summary": "Kaynes Tech has extended CEO Sharma's notice period, with the new last working day scheduled for November 8. The company announced this change to the previously established departure timeline.",
            "Sentiment": "neutral",
            "PublishDate": 1761912911664,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kaynes Circuits India Plans ₹3,280 Crore Investment in Tamil Nadu",
            "Summary": "Kaynes Circuits India announced plans to invest ₹3,280 crore in Tamil Nadu under the Electronics and Computer Software Export Promotion Scheme (ECMS). The investment targets production worth ₹26,315 crore and aims to create 2,480 new jobs.",
            "Sentiment": "positive",
            "PublishDate": 1761587876161,
            "Source": "stock"
        },
        {
            "Title": "Kaynes Technology Subsidiary Acquires Additional 7% Stake in Sensonic GmbH for One Euro",
            "Summary": "Kaynes Technology's wholly owned subsidiary Kaynes Singapore executed a Share Purchase Agreement on October 20, 2025, to acquire an additional 7% stake in Sensonic GmbH from Frauscher Sensor Technology Group GmbH for one Euro. This increases Kaynes Singapore's existing 54% stake in Sensonic GmbH. The transaction does not affect management control and is not classified as a related party transaction. In quarterly results, Kaynes Technology reported net profit growth of 47% to ₹74.6 crore, exceeding estimates of ₹70.4 crore. EBITDA expanded 68% to ₹113 crore, while margins improved to 16.7% from 13.3%. Revenue grew 33.6% to ₹673.4 crore but missed estimates by ₹85.6 crore. The company raised ₹1,600 crore through QIP in June, with ₹1,480 crore remaining unused. Shares closed down 2.43% at ₹6,700.",
            "Sentiment": "neutral",
            "PublishDate": 1761225303876,
            "Source": "stock"
        },
        {
            "Title": "Kaynes Technology Delivers India's First Commercially Manufactured Multi-Chip Module",
            "Summary": "Kaynes Semicon Private Limited, a wholly owned subsidiary of Kaynes Technology India Limited, shipped 900 Multi-Chip Modules (MCMs) - the Intelligent Power Module (IPM5) - from its Sanand facility to Alpha & Omega Semiconductor (AOS). This represents India's first commercially manufactured MCM under the India Semiconductor Mission 1.0. The IPM module integrates 17 dies including six IGBTs, two controller ICs, six FRDs and three diodes into a single package for motor control and power applications. Kaynes Semicon's facility is designed to reach 6.3 million chips per day capacity when fully operational, with full mass production targeted for January 2026. AOS is expected to occupy majority of initial capacity, with production ramping up to 1.5 million chips per day by Q1 2026-27. The partnership includes Mitsui & Co., which provides global logistics expertise and procurement network for critical raw materials including lead frames, wires, and mold compounds.",
            "Sentiment": "positive",
            "PublishDate": 1760537873504,
            "Source": "stock"
        },
        {
            "Title": "Kaynes Semicon and UST Form Rs 3,330 Crore Joint Venture for Semiconductor Production in India",
            "Summary": "Kaynes Semicon and UST have established a joint venture valued at Rs 3,330 crore focused on semiconductor production in India. The partnership represents a significant investment in India's semiconductor manufacturing sector.",
            "Sentiment": "positive",
            "PublishDate": 1759129513633,
            "Source": "order&deals"
        },
        {
            "Title": "Kaynes Tech Targets Next Growth Phase, Plans CEO Announcement",
            "Summary": "Kaynes Tech announced its aim to reach the next growth stage. The company stated it will reveal its new CEO at an appropriate time.",
            "Sentiment": "positive",
            "PublishDate": 1759120006465,
            "Source": "stock"
        },
        {
            "Title": "PM Modi Announces India's Local Semiconductor Production Goals",
            "Summary": "Prime Minister Modi announced India's objective to produce semiconductors domestically. The statement relates to Kaynes Technology in the semiconductor manufacturing sector.",
            "Sentiment": "positive",
            "PublishDate": 1758778004960,
            "Source": "stock"
        },
        {
            "Title": "Kaynes Tech Appoints New Managing Director, Stock Rises 2%",
            "Summary": "Kaynes Technology appointed Muthukumar Narayanaswamy as Managing Director for a five-year term and re-designated Ramesh Kunhikannan from MD to Executive Vice Chairman. CEO Rajesh Sharma resigned and will step down on October 31, 2025, to pursue external opportunities. CFO Jairam Sampath stated the CEO succession was planned, with an internal candidate expected to be announced within 3-4 days. The company's growth trajectory and capital expenditure plans for the next 2-3 years remain unchanged. Kaynes Tech shares have surged nearly 12 times since its IPO at ₹587 per share and were trading 2% higher at ₹7,369.",
            "Sentiment": "positive",
            "PublishDate": 1758694273088,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kaynes Technology India Restructures Leadership with New Managing Director Appointment",
            "Summary": "Kaynes Technology India has made significant leadership changes by transitioning Mr. Ramesh Kunhikannan to the role of Executive Vice Chairman. The company has appointed Dr. Muthukumar Narayanaswamy as Additional Director and Managing Director for a five-year term. These appointments represent a restructuring of the company's senior management positions.",
            "Sentiment": "neutral",
            "PublishDate": 1758690470152,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kaynes Technology to Announce New CEO Within Days",
            "Summary": "Kaynes Technology will reveal the name of its new CEO in the next few days. The company has not disclosed additional details about the selection process or the incoming executive.",
            "Sentiment": "neutral",
            "PublishDate": 1758263132521,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kaynes Technology CEO Rajesh Sharma Resigns, Stock Falls 4%",
            "Summary": "Kaynes Technology Ltd. announced that CEO Rajesh Sharma has resigned to pursue opportunities outside the organization. His resignation takes effect from the close of business hours on October 31, 2025. Following the announcement, the company's stock declined 4%, reaching an intraday low of Rs 6,882. Sharma is an associate member of The Institute of Chartered Accountants of India, holds a commerce graduate degree from Bangalore University, and has over 15 years of experience in accounting and finance.",
            "Sentiment": "negative",
            "PublishDate": 1758262739417,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kaynes Technology Integrates Mustard Smartglasses Core Team to Strengthen AR/AI Wearables Capabilities",
            "Summary": "Kaynes Technology India Limited integrated the core team behind Mustard Smartglasses, a company specializing in AI-powered, waveguide-based smart wearable technology. The integration brings expertise in lightweight, AI-powered wearables that combine AI audio, camera systems, and advanced waveguide optics for real-time AR overlays. This move strengthens Kaynes' position as an ODM/OEM partner for designing and manufacturing AR/VR smart glasses platforms for global brands. The addition includes deep experience with Digi-lens waveguide optics and supports Kaynes' open, developer-centric ecosystem. The integration enables applications ranging from real-time translation and enhanced accessibility for consumers to AI-driven remote inspection for enterprises.",
            "Sentiment": "positive",
            "PublishDate": 1757156308606,
            "Source": "stock"
        },
        {
            "Title": "India-Singapore Partnership Announced for Semiconductor, Quantum Computing and AI Development",
            "Summary": "Prime Minister Modi announced Singapore's company participation in Semicon India 2025. The collaboration between India and Singapore will focus on quantum computing, artificial intelligence, and skill development initiatives. Kaynes Tech is mentioned in connection with this partnership.",
            "Sentiment": "positive",
            "PublishDate": 1756971928813,
            "Source": "stock"
        },
        {
            "Title": "Kaynes Technology to Launch First Indian-Made Semiconductor Chip on October 5th",
            "Summary": "Kaynes Technology announced it will release its first Indian-manufactured semiconductor chip on October 5th. This represents the company's entry into domestic semiconductor production.",
            "Sentiment": "positive",
            "PublishDate": 1756880913558,
            "Source": "stock"
        },
        {
            "Title": "PM Modi Announces Development of New Design Linked Incentive Program",
            "Summary": "Prime Minister Modi announced that the Indian government is developing a new Design Linked Incentive Program. This announcement was made in relation to Kaynes Tech.",
            "Sentiment": "positive",
            "PublishDate": 1756792334148,
            "Source": "stock"
        },
        {
            "Title": "Kaynes Technology Subsidiary KSPL Issues CCPS to US Technology for OSAT Collaboration",
            "Summary": "Kaynes Technology's subsidiary KSPL has issued Compulsory Convertible Preference Shares (CCPS) to US Technology as part of an OSAT (Outsourced Semiconductor Assembly and Test) collaboration agreement between the two companies.",
            "Sentiment": "positive",
            "PublishDate": 1756745124340,
            "Source": "order&deals"
        },
        {
            "Title": "Kaynes Tech Plans Commercial Chip Delivery in Q4 FY26",
            "Summary": "Kaynes Tech announced plans to begin commercial delivery of its chips in Q4 FY26. The company is preparing to enter the commercial chip manufacturing and delivery phase.",
            "Sentiment": "positive",
            "PublishDate": 1756701243518,
            "Source": "stock"
        },
        {
            "Title": "Motilal Oswal Mutual Fund Increases Stake in Kaynes Technology to 5.03%",
            "Summary": "Motilal Oswal Mutual Fund acquired additional shares in Kaynes Technology India Limited through market transactions, increasing its shareholding from 4.69% to 5.03%. The fund acquired 2,25,015 additional shares, bringing its total holding to 33,66,952 shares representing 5.0285% of the company's equity share capital. The acquisition was made through 17 different schemes of Motilal Oswal Mutual Fund including focused fund, midcap fund, flexi cap fund, and various index funds. The transaction was completed on July 3, 2025, and the disclosure was filed under SEBI regulations for substantial acquisition of shares.",
            "Sentiment": "neutral",
            "PublishDate": 1756126364469,
            "Source": "corporate_action"
        }
    ]
}