{
    "Symbol": "KCEIL",
    "ISIN": "INE0RCG01017",
    "News": [
        {
            "Title": "Kay Cee Energy & Infra Sues Zee Rajasthan News Channel for ₹5 Crore Damages",
            "Summary": "Kay Cee Energy & Infra has filed a legal case against Zee Rajasthan News Channel, seeking ₹5 crore in damages and requesting a ban on future defamatory remarks by the news channel.",
            "Sentiment": "negative",
            "PublishDate": 1757670151364,
            "Source": "stock"
        },
        {
            "Title": "Kay Cee Energy & Infra: Successful QIP Raises ₹2502.72 Lakhs",
            "Summary": "Kay Cee Energy & Infra has raised ₹2502.72 Lakhs through its first Qualified Institutional Placement (QIP). The company allocated 12,64,000 equity shares at ₹198 per share to qualified institutional buyers. The funds will be used for working capital requirements to support growth plans.",
            "Sentiment": "positive",
            "PublishDate": 1745558997000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kay Cee Energy & Infra Announces Qualified Institutions Placement",
            "Summary": "Kay Cee Energy & Infra has announced a Qualified Institutions Placement (QIP) of equity shares. The company has set the floor price for the issue at 208.10 rupees per share. This move suggests the company is seeking to raise capital through institutional investors.",
            "Sentiment": "positive",
            "PublishDate": 1745244606000,
            "Source": "default"
        },
        {
            "Title": "Kay Cee Energy Secures 13 Crore Rupee Order",
            "Summary": "Kay Cee Energy, a company with a market capitalization of 170 crore rupees, has won an order worth 13 crore rupees. This development is significant for the small and medium enterprise (SME) sector.",
            "Sentiment": "positive",
            "PublishDate": 1743149712000,
            "Source": "order&deals"
        },
        {
            "Title": "Kay Cee Energy & Infra Approves Share Issuance via QIP",
            "Summary": "Kay Cee Energy & Infra has approved the issuance of shares worth up to 450 million rupees through a Qualified Institutional Placement (QIP).",
            "Sentiment": "positive",
            "PublishDate": 1738066092000,
            "Source": "corporate_action"
        }
    ]
}