{
    "Symbol": "KCP",
    "ISIN": "INE805C01028",
    "News": [
        {
            "Title": "KCP Limited Gets CRISIL Rating Reaffirmation",
            "Summary": "CRISIL Ratings reaffirmed KCP Limited's credit ratings on December 15, 2025, maintaining CRISIL A+/Stable for long-term facilities worth ₹579.96 crores and CRISIL A1 for short-term facilities.",
            "Sentiment": "positive",
            "PublishDate": 1765869357273,
            "Source": "stocks"
        },
        {
            "Title": "KCP Limited Seeks Shareholder Approval for Re-appointment of Key Directors",
            "Summary": "KCP Limited has issued a postal ballot notice seeking shareholder approval to re-appoint Dr. V.L. Indira Dutt as Chairperson Managing Director and Smt. V. Kavitha Dutt as Joint Managing Director for three years from March 1, 2026. The e-voting period runs from December 7, 2025 to January 5, 2026, with proposed remuneration packages including salaries of Rs. 13 lakh and Rs. 11 lakh per month respectively, plus commission not exceeding 5.5% and 3.5% of net profits.",
            "Sentiment": "neutral",
            "PublishDate": 1764838212636,
            "Source": "corporate_action"
        },
        {
            "Title": "KCP Limited Reports Strong Quarterly Performance with Leadership Reappointments",
            "Summary": "KCP Limited's Board approved unaudited financial results for the quarter and half-year ended September 30, 2025, showing consolidated revenue of Rs. 676.51 crores for the quarter. The Board also approved the re-appointment of Dr. V.L. Indira Dutt as Chairperson Managing Director and Smt. V. Kavitha Dutt as Joint Managing Director for 3 years effective March 1, 2026, subject to shareholder approval through postal ballot.",
            "Sentiment": "negative",
            "PublishDate": 1763064055329,
            "Source": "earnings"
        },
        {
            "Title": "KCP Limited Receives USD 4 Million Dividend from Vietnam Subsidiary",
            "Summary": "KCP Limited received a dividend of USD 4 million (Rs. 35.12 crores) from its subsidiary KCP Vietnam Industries Ltd., Vietnam for the year 2024. The company notified stock exchanges BSE and NSE about this dividend receipt from its Vietnamese operations.",
            "Sentiment": "positive",
            "PublishDate": 1760697785462,
            "Source": "corporate_action"
        },
        {
            "Title": "KCP Limited Reports Strong Q1 Performance with Consolidated Profit Rising to Rs 89.76 Crores",
            "Summary": "KCP Limited's Board approved quarterly results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of Rs 676.51 crores compared to Rs 634.78 crores in the previous quarter and Rs 691.03 crores in the same quarter last year. Consolidated profit for the period reached Rs 89.76 crores, significantly higher than Rs 72.40 crores in the previous quarter and Rs 50.54 crores in the corresponding quarter of the previous year. On a standalone basis, revenue from operations was Rs 388.03 crores versus Rs 372.19 crores in the previous quarter, with profit of Rs 14.28 crores compared to Rs 34.58 crores in the prior quarter. The company's consolidated earnings per share stood at Rs 4.92 compared to Rs 2.92 in the previous quarter. KCP Vietnam Industries Limited's charter capital was increased by $9 million during the quarter, with KCP Limited's share increasing by $6 million while maintaining its 66.667% shareholding proportion.",
            "Sentiment": "positive",
            "PublishDate": 1754903617908,
            "Source": "earnings"
        },
        {
            "Title": "KCP Reports Strong Q1 Performance with EBITDA Rising to 1.1B Rupees",
            "Summary": "KCP delivered mixed quarterly results with EBITDA increasing significantly to 1.1 billion rupees compared to 667 million rupees in the same period last year. The company's EBITDA margin expanded substantially to 16.4% from 9.7% year-over-year. Revenue declined slightly to 6.76 billion rupees versus 6.9 billion rupees in the prior year period. Consolidated net profit nearly doubled to 635 million rupees from 321 million rupees year-over-year, demonstrating improved profitability despite the revenue decline.",
            "Sentiment": "positive",
            "PublishDate": 1754902691246,
            "Source": "earnings"
        },
        {
            "Title": "KCP Reports Q4 Financial Results",
            "Summary": "KCP has released its Q4 financial results. The company's EBITDA decreased to 1.02 billion rupees from 1.13 billion rupees year-over-year. The EBITDA margin declined to 16.12% from 18.23% compared to the same period last year. Revenue slightly increased to 6.3 billion rupees from 6.25 billion rupees year-over-year. Consolidated net profit decreased to 376 million rupees from 556 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1748422882000,
            "Source": "result"
        },
        {
            "Title": "K.C.P. Reports Decline in Q3 Revenue",
            "Summary": "K.C.P. has reported a decrease in its third-quarter revenue. The company's Q3 revenue stood at 6 billion rupees, compared to 7.8 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1739343322000,
            "Source": "earnings"
        },
        {
            "Title": "K.C.P. Reports Significant Decline in Q3 EBITDA and Margin",
            "Summary": "K.C.P. has reported a substantial decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 490 million rupees from 990 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin dropped to 8.15% from 12.74% year-over-year, indicating a significant reduction in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1739342998000,
            "Source": "earnings"
        },
        {
            "Title": "K.C.P. Reports Significant Decline in Q3 Consolidated Net Profit",
            "Summary": "K.C.P. Limited has reported a substantial decrease in its consolidated net profit for the third quarter. The company's net profit fell to 160 million rupees, down from 700 million rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1739342883000,
            "Source": "earnings"
        },
        {
            "Title": "KCP Reports Decline in Q2 Revenue",
            "Summary": "KCP, an Indian company, has reported its second quarter revenue for the current fiscal year. The company's revenue stood at 6 billion rupees, down from 7 billion rupees in the same quarter of the previous year, indicating a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1731048288000,
            "Source": "result"
        },
        {
            "Title": "KCP Reports Strong Q2 Financial Performance",
            "Summary": "KCP has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 738 million rupees to 1.14 billion rupees. Additionally, KCP's EBITDA margin expanded from 10.54% to 18.94%, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1731048167000,
            "Source": "result"
        },
        {
            "Title": "KCP Reports Significant Increase in Q2 Consolidated Net Profit",
            "Summary": "KCP, an Indian company, has reported a consolidated net profit of 384 million rupees for the second quarter, compared to 177 million rupees in the same period last year. This represents a substantial year-over-year increase in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1731048105000,
            "Source": "result"
        }
    ]
}