{
    "Symbol": "KCPSUGIND",
    "ISIN": "INE790B01024",
    "News": [
        {
            "Title": "KCP Sugar Reports Q3 FY26 Results with Strong Recovery",
            "Summary": "KCP Sugar and Industries Corporation posted Q3 FY26 standalone revenue of ₹4194.93 lakhs and net profit of ₹77.26 lakhs, marking significant improvement from previous year's loss of ₹4198.62 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770807989089,
            "Source": "co_actions_results"
        },
        {
            "Title": "KCP Sugar Acquires Stake in Altair Infrasec",
            "Summary": "KCP Sugar and Industries Corporation Ltd. board approves acquisition of 1,460 shares in Altair Infrasec Private Limited for ₹1.65 crores on January 22, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769082077497,
            "Source": "co_actions_results"
        },
        {
            "Title": "KCP Sugar Promoter Vinod Sethi Acquires Additional 10,000 Shares",
            "Summary": "Mr. Vinod R. Sethi, Promoter and Executive Chairman of K.C.P. Sugar and Industries Corporation Ltd., acquired 10,000 equity shares representing 0.01% of the company's total issued and paid-up share capital through open market purchase on November 24, 2025. Following this acquisition, his total shareholding increased to 3,03,610 shares representing 0.26% of the company's equity share capital of 11,33,85,050 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764155234287,
            "Source": "corporate_action"
        },
        {
            "Title": "KCP Sugar Promoter Vinod Sethi Acquires Additional 10,000 Shares",
            "Summary": "Mr. Vinod R. Sethi, Promoter and Executive Chairman of K.C.P. Sugar and Industries Corporation Ltd., acquired 10,000 equity shares (0.01% of total share capital) through open market purchase on November 18, 2025. Following this acquisition, his total shareholding increased to 2,93,610 shares representing 0.26% of the company's total issued and paid-up share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1763812310753,
            "Source": "corporate_action"
        },
        {
            "Title": "KCP Sugar Promoter Vinod Sethi Acquires Additional 50,000 Shares",
            "Summary": "Promoter and Executive Chairman Vinod R. Sethi acquired 50,000 equity shares of KCP Sugar and Industries Corporation Ltd through open market purchase on November 14, 2025, representing 0.04% of the company's total issued and paid-up share capital. Following this acquisition, Sethi's total shareholding increased to 2,85,61,027 shares, representing 25.20% of the company's equity share capital of 11,33,85,050 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763465307659,
            "Source": "corporate_action"
        },
        {
            "Title": "K.C.P. Sugar Reports Quarterly Results for Second Quarter Ended September 2025",
            "Summary": "K.C.P. Sugar and Industries Corporation Limited announced its unaudited standalone and consolidated financial results for the second quarter and half year ended September 30, 2025. The company's board meeting was held on November 11, 2025, where directors approved the financial statements including balance sheet, cash flow statement, and segmental reporting. The statutory auditors B. Purushottam Co. issued an unmodified audit report on the unaudited financial results. The company operates in sugar manufacturing, rectified spirit, alcohol production, and heavy industrial machinery fabrication with factories located in Andhra Pradesh and Tamil Nadu.",
            "Sentiment": "neutral",
            "PublishDate": 1762897802887,
            "Source": "earnings"
        },
        {
            "Title": "KCP Sugar Reports Q1 Results, Schedules 30th AGM and Proposes Re. 0.10 Final Dividend",
            "Summary": "KCP Sugar and Industries Corporation Ltd announced its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company scheduled its 30th Annual General Meeting for September 25, 2025, to be held through video conferencing at 11:00 AM IST. The Board proposed a final dividend of Re. 0.10 per equity share, subject to shareholder approval at the AGM. The record date for dividend eligibility has been set as September 18, 2025, with book closure from September 19-25, 2025. Additionally, the Board approved the appointment of M/s. P Muthukumaran and Associates as Secretarial Auditor for five consecutive years until the AGM in 2030, pending shareholder approval. The company's other income included fair value gains on equity investments of Rs. 2,280.52 lakhs during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1755085805953,
            "Source": "earnings"
        },
        {
            "Title": "Investor Dolly Khanna Increases Stake in KCP Sugar & Industries Corp",
            "Summary": "Prominent investor Dolly Khanna has increased her stake in KCP Sugar & Industries Corp from 1.75% to 1.85% during the fourth quarter of the fiscal year. This slight increase in ownership suggests a positive outlook on the company's performance or potential by the investor.",
            "Sentiment": "positive",
            "PublishDate": 1744780127000,
            "Source": "default"
        },
        {
            "Title": "KCP Sugar Reports Increased Net Loss in Q3",
            "Summary": "KCP Sugar's consolidated net loss for the third quarter widened to 378 million rupees, compared to a loss of 43 million rupees in the same period last year. The company's revenue slightly increased to 841 million rupees from 826 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739233380000,
            "Source": "earnings"
        },
        {
            "Title": "KCP Sugar Reports Increased Q3 Net Loss",
            "Summary": "KCP Sugar's consolidated net loss for the third quarter expanded to 378 million rupees, compared to a loss of 43 million rupees in the same period last year. The company's revenue slightly increased to 841 million rupees from 826 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739186863000,
            "Source": "earnings"
        },
        {
            "Title": "KCP Sugar & Industries Reports Q2 Results",
            "Summary": "KCP Sugar & Industries Corporation has reported its Q2 financial results. The company's profit before tax (PBT) for the quarter was 282 million rupees, compared to 307 million rupees in the same quarter last year. Additionally, the company reported an exceptional item of 48 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1730198542000,
            "Source": "result"
        },
        {
            "Title": "KCP Sugar & Industries Reports Q2 EBITDA Loss",
            "Summary": "KCP Sugar & Industries Corporation has reported an EBITDA loss of 13.7 million rupees for the second quarter, compared to a profit of 115 million rupees in the same period last year. This represents a significant year-over-year decline in the company's operational performance.",
            "Sentiment": "negative",
            "PublishDate": 1730197616000,
            "Source": "result"
        },
        {
            "Title": "KCP Sugar & Industries Corp Reports Q2 Revenue Decline",
            "Summary": "KCP Sugar & Industries Corp has reported a revenue of 737 million rupees for the second quarter, compared to 935 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1730197605000,
            "Source": "result"
        },
        {
            "Title": "KCP Sugar & Industries Corp Reports Q2 Financial Results",
            "Summary": "KCP Sugar & Industries Corp has announced its Q2 consolidated net profit, which stands at 202 million rupees. This represents a year-over-year decrease from 279 million rupees in the same quarter last year. However, it shows a significant quarter-over-quarter increase from 541 million rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1730197595000,
            "Source": "result"
        }
    ]
}