{
    "Symbol": "KDDL",
    "ISIN": "INE291D01011",
    "News": [
        {
            "Title": "KDDL Q3 FY26: Strong 88.9% YoY profit surge",
            "Summary": "KDDL Limited reports impressive Q3 FY26 results with standalone profit jumping 88.9% YoY to ₹3,045 lakhs. Revenue grew 19.0% to ₹11,557 lakhs, while consolidated profit reached ₹3,829 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770801480617,
            "Source": "co_actions_results"
        },
        {
            "Title": "KDDL Subsidiary Renames to Kamla Business Services",
            "Summary": "KDDL Limited announces subsidiary company name change from Kamla Tesio Dials Limited to Kamla Business Services Limited, effective January 14, 2026, following MCA approval.",
            "Sentiment": "neutral",
            "PublishDate": 1768500902420,
            "Source": "stocks"
        },
        {
            "Title": "KDDL Boosts Ownership to 80% in Watch Subsidiary",
            "Summary": "KDDL Limited increases shareholding to 80% in Artisan Watch Products through ₹2.40 crore rights issue subscription, strengthening its position in the watch manufacturing segment.",
            "Sentiment": "positive",
            "PublishDate": 1767203594112,
            "Source": "co_actions_results"
        },
        {
            "Title": "KDDL Limited Reports 30% Revenue Growth in Q2 FY26, Driven by Precision Engineering Expansion",
            "Summary": "KDDL Limited achieved total income of INR 126.8 crores in Q2 FY26 with 30% year-on-year growth, while consolidated revenue crossed INR 1,000 crores for H1 FY26 at INR 1,007.9 crores. The company's Precision Engineering division led growth with 55% quarterly increase, supported by expanding electroplating capacity and strong export demand, while watch components face headwinds from global market challenges.",
            "Sentiment": "positive",
            "PublishDate": 1763630784173,
            "Source": "earnings"
        },
        {
            "Title": "KDDL Limited Reports Strong H1 FY26 Performance with 44% YoY Growth in Precision Engineering",
            "Summary": "KDDL Limited released its investor presentation for Q2 and H1 FY26, highlighting key business developments across its segments. The Precision Engineering division delivered robust revenue growth of 44% year-over-year in H1 FY26. The company's bracelet business continued to grow as planned, while the packaging division maintained its growth trajectory with rapid business expansion. KDDL operates across watch components (dials, hands, indexes, and bracelets), ornamental packaging for luxury boxes, and precision engineering for automotive, aerospace, and industrial sectors. The company declared an interim dividend of ₹15 per share for the period. KDDL is actively exploring opportunities in non-Swiss watch markets to expand its customer base and strengthen its geographic presence, as the Swiss watch market continues to experience a slowdown.",
            "Sentiment": "positive",
            "PublishDate": 1762936474191,
            "Source": "earnings"
        },
        {
            "Title": "KDDL Reports 30% Revenue Growth but Net Profit Declines 21% in Q2",
            "Summary": "KDDL reported quarterly revenue of 5.16 billion rupees, up from 3.96 billion rupees year-over-year. The company's EBITDA increased to 720 million rupees from 631 million rupees, though EBITDA margin compressed to 13.94% from 15.93%. Consolidated net profit declined to 194 million rupees compared to 245.6 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1762784125949,
            "Source": "earnings"
        },
        {
            "Title": "KDDL Limited Reports Quarterly Results and Declares 150% Interim Dividend",
            "Summary": "KDDL Limited's Board of Directors approved unaudited financial results for the quarter and half year ended September 30, 2025. The company declared an interim dividend of Rs. 15 per equity share (150%) on face value of Rs. 10 each, with record date fixed as November 14, 2025. During the quarter, KDDL invested Rs. 199.04 lakhs to acquire 11,058 Rights Equity Shares of ETHOS Limited at Rs. 1,800 per share. Post this transaction, the company holds 50.12% shareholding in Ethos Limited. The company also invested Rs. 160 lakhs in the previous quarter to acquire 80% shareholding in newly incorporated Artisan Watch Products Private Limited. The Board meeting was held on November 10, 2025, and the financial results have been reviewed by statutory auditors.",
            "Sentiment": "positive",
            "PublishDate": 1762783610114,
            "Source": "corporate_action"
        },
        {
            "Title": "KDDL Limited Provides EUR 2.63 Million Corporate Guarantee for Subsidiary's Working Capital Loan",
            "Summary": "KDDL Limited has provided a corporate guarantee of EUR 2.63 million (equivalent to CHF 2.44 million) for a revolving loan facility extended as a Working Capital Demand Loan by ICICI Bank UK PLC-Germany Branch to Pylania AG, its wholly owned subsidiary. The company states that no promoters, members of the promoter group, or directors have any interest in this transaction, which is conducted on an arm's length basis. The guarantee will be disclosed as a contingent liability in the company's financial statements, with no other impact on the listed entity at this point.",
            "Sentiment": "neutral",
            "PublishDate": 1762477058794,
            "Source": "corporate_action"
        },
        {
            "Title": "KDDL Limited Sets September 8, 2025 as Record Date for Dividend Payment and E-voting",
            "Summary": "KDDL Limited announced that September 8, 2025 will serve as the record date for dividend payment. This date also coincides with the cut-off date for e-voting for the company's 45th Annual General Meeting. The company had previously announced a book closure period from September 9 to September 15, 2025 for dividend payment and the Annual General Meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1756314110278,
            "Source": "corporate_action"
        },
        {
            "Title": "KDDL Limited Reports Strong Q1 FY26 Results with 35% Revenue Growth",
            "Summary": "KDDL Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. Standalone revenue from operations increased to Rs 11,010 lakhs from Rs 8,140 lakhs in the same quarter last year, representing significant growth. Profit for the period rose to Rs 1,190 lakhs compared to Rs 976 lakhs in the previous year quarter. On a consolidated basis, revenue reached Rs 35,993 lakhs versus Rs 41,958 lakhs in the prior quarter. The company operates primarily in precision and watch components segment, and watches, accessories and luxury items. During the quarter, KDDL invested Rs 160 lakhs to acquire 80% shareholding in newly incorporated Artisan Watch Products Private Limited. The company's subsidiary Ethos Limited completed a rights issue of 22,77,250 shares at Rs 1,800 per share. Basic earnings per share on standalone basis was Rs 9.68 compared to Rs 7.79 in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1755184665867,
            "Source": "earnings"
        },
        {
            "Title": "KDDL Reports Q4 Results and Recommends Final Dividend",
            "Summary": "KDDL has announced its Q4 financial results and a dividend recommendation. The company's Q4 revenue increased to 4.2 billion rupees from 3.48 billion rupees year-over-year. However, consolidated net profit decreased to 203.1 million rupees from 255.7 million rupees year-over-year. EBITDA rose to 644.4 million rupees from 606 million rupees, but the EBITDA margin declined to 15.36% from 17.43%. The company has recommended a final dividend of 5 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747655394000,
            "Source": "result"
        },
        {
            "Title": "Mahen Distribution Acquires Shares in Silvercity Brands AG",
            "Summary": "Mahen Distribution has acquired 874,000 partly paid shares of Silvercity Brands AG at a price of CHF 2.86 per share, totaling approximately INR 25 crore. This acquisition is related to KDDL Ltd, suggesting a potential corporate action or investment move.",
            "Sentiment": "neutral",
            "PublishDate": 1742374746000,
            "Source": "corporate_action"
        },
        {
            "Title": "KDDL Reports Q3 EBITDA Growth with Slight Margin Decline",
            "Summary": "KDDL has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 779 million rupees from 657 million rupees in the same quarter last year. However, the EBITDA margin decreased slightly to 16.50% from 17.66% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739539019000,
            "Source": "earnings"
        },
        {
            "Title": "KDDL Reports Strong Q3 Financial Performance",
            "Summary": "KDDL has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 325 million rupees from 259 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 4.7 billion rupees compared to 3.72 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739539014000,
            "Source": "earnings"
        },
        {
            "Title": "KDDL Reports Mixed Q2 Results",
            "Summary": "KDDL, a company in the watch and precision engineering industry, has released its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased slightly to 631 million rupees from 623 million rupees year-over-year. However, the EBITDA margin decreased from 18.34% to 15.93% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731332426000,
            "Source": "result"
        },
        {
            "Title": "KDDL Reports Q2 Revenue Increase",
            "Summary": "KDDL, an Indian company, has announced its second quarter revenue for the current fiscal year. The company reported revenue of 3.96 billion rupees, compared to 3.4 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731332333000,
            "Source": "result"
        },
        {
            "Title": "KDDL Reports Q2 Financial Results",
            "Summary": "KDDL has announced its Q2 consolidated net profit of 245.6 million rupees, showing a slight decrease from 254 million rupees year-over-year. However, it represents an increase from 172.7 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1731332275000,
            "Source": "result"
        }
    ]
}