{
    "Symbol": "KDL",
    "ISIN": "INE0O4R01018",
    "News": [
        {
            "Title": "KORE Digital Reports Q1 Sales of ₹156 Crore",
            "Summary": "KORE Digital has reported sales of ₹156 crore for the first quarter of FY26. The company's current market capitalization stands at ₹380 crore. No additional details about the company's performance or comparisons to previous periods were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1751442142000,
            "Source": "default"
        },
        {
            "Title": "Kore Digital to Acquire Majority Stakes in Three Companies",
            "Summary": "Kore Digital has announced plans to acquire 98% ownership in three companies: Franken Telecom, KDL Realinfra, and Wolter Infratech. This move suggests a significant expansion strategy for Kore Digital, potentially diversifying its portfolio and strengthening its market position.",
            "Sentiment": "positive",
            "PublishDate": 1735689905000,
            "Source": "corporate_action"
        },
        {
            "Title": "KORE Digital to Acquire Majority Stakes in Three Companies",
            "Summary": "KORE Digital has announced plans to acquire 98% ownership in three companies: Franken Telecom, KDL Realinfra, and Wolter Infratech. This move suggests a significant expansion strategy for KORE Digital, potentially strengthening its position in the telecom and infrastructure sectors.",
            "Sentiment": "positive",
            "PublishDate": 1735641999000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kore Digital Approves 2:1 Bonus Share Issue",
            "Summary": "Kore Digital has approved the issuance of bonus equity shares in a ratio of 2:1. This means shareholders will receive two additional shares for every one share they currently hold, effectively tripling their shareholding without any additional cost.",
            "Sentiment": "positive",
            "PublishDate": 1733270638000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kore Digital Approves 2:1 Bonus Share Issue",
            "Summary": "Kore Digital has approved the issuance of bonus equity shares in a ratio of 2:1. This means shareholders will receive two additional shares for every one share they currently hold.",
            "Sentiment": "positive",
            "PublishDate": 1733229250000,
            "Source": "corporate_action"
        }
    ]
}