{
    "Symbol": "KEC",
    "ISIN": "INE389H01022",
    "News": [
        {
            "Title": "KEC International Wins Orders Worth Rs. 1,020 Crores",
            "Summary": "KEC International secured new orders worth Rs. 1,020 crores across Civil, Transportation, T&D, and Cables verticals. Year-to-date order intake reaches Rs. 20,300 crores with wins in hospital construction and railway projects.",
            "Sentiment": "positive",
            "PublishDate": 1770087917634,
            "Source": "co_actions_results"
        },
        {
            "Title": "KEC International Q3FY26 Results Show Strong Growth",
            "Summary": "KEC International reported Q3FY26 consolidated revenue of Rs. 6,001.35 crore, up 12.19% YoY, with net profit at Rs. 127.46 crore despite exceptional charges of Rs. 58.78 crore related to new Labour Codes.",
            "Sentiment": "positive",
            "PublishDate": 1769773831779,
            "Source": "co_actions_results"
        },
        {
            "Title": "KEC International Q3FY26 Earnings Call on Jan 30",
            "Summary": "KEC International announces analyst/investor conference call scheduled for January 30, 2026, at 5:00 PM IST to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769157289748,
            "Source": "co_actions_results"
        },
        {
            "Title": "KEC International Appoints Somraj Roy as CHRO",
            "Summary": "KEC International Limited has appointed Mr. Somraj Roy as Chief Human Resources Officer effective January 15, 2026. Roy brings over 30 years of HR experience across manufacturing, EPC, and defence sectors.",
            "Sentiment": "positive",
            "PublishDate": 1768476589780,
            "Source": "stocks"
        },
        {
            "Title": "HC to Hear KEC International's Tender Plea on Jan 19",
            "Summary": "High Court scheduled to hear KEC International's plea on January 19 regarding participation in other companies' tenders amid ongoing Power Grid Corporation ban.",
            "Sentiment": "neutral",
            "PublishDate": 1767866142855,
            "Source": "stocks"
        },
        {
            "Title": "KEC International Wins ₹1,050 Cr Contract Orders",
            "Summary": "KEC International secured new contracts worth ₹1,050 crores across wind projects, civil works for steel companies, and T&D supply orders in the Americas, marking maiden entry into wind energy segment.",
            "Sentiment": "positive",
            "PublishDate": 1767248863802,
            "Source": "co_actions_results"
        },
        {
            "Title": "KEC International Receives GST Order from Rajasthan",
            "Summary": "KEC International disclosed receiving a GST adjudication order from Rajasthan authorities on December 30, 2025, involving alleged disallowance of input tax credit worth ₹26.64 lakh for FY 2018-19.",
            "Sentiment": "negative",
            "PublishDate": 1767195912638,
            "Source": "stocks"
        },
        {
            "Title": "KEC International Executive Director Retires",
            "Summary": "KEC International announces superannuation of Mr. Kaushal Kodesia, Executive Director – Special Projects, effective December 31, 2025, as he ceases to be Senior Management Personnel.",
            "Sentiment": "neutral",
            "PublishDate": 1767179886374,
            "Source": "stocks"
        },
        {
            "Title": "HDFC MF cuts KEC International stake to 6.93%",
            "Summary": "HDFC Mutual Fund reduces shareholding in KEC International by 2.04% to 6.93% as of December 22, 2025, selling 46.23 lakh shares through open market transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1766573523702,
            "Source": "stocks"
        },
        {
            "Title": "KEC International Receives GST Order from Rajasthan",
            "Summary": "KEC International disclosed receiving a GST adjudication order from Rajasthan authorities on December 22, 2025, involving tax demand of ₹99.72 lakh and equal penalty amount.",
            "Sentiment": "negative",
            "PublishDate": 1766492966037,
            "Source": "stocks"
        },
        {
            "Title": "KEC International Gets Relief from High Court",
            "Summary": "High Court halts PGCIL's decision to exclude KEC International from tenders for 9 months, allowing company to continue bidding in ongoing projects until further notice.",
            "Sentiment": "positive",
            "PublishDate": 1766222270743,
            "Source": "stocks"
        },
        {
            "Title": "KEC International Gets Credit Rating Reaffirmation",
            "Summary": "CARE Ratings reaffirmed KEC International's credit ratings for banking facilities worth ₹19,800 crores, with long-term facilities rated CARE A (Stable) and enhanced short-term facilities.",
            "Sentiment": "positive",
            "PublishDate": 1765893599706,
            "Source": "stocks"
        },
        {
            "Title": "Indo Borax Open Offer: Zenrock Acquires 50.80% Stake",
            "Summary": "Zenrock Chemicals and consortium execute mandatory open offer for Indo Borax & Chemicals following 50.80% stake acquisition at ₹256.30 per share on December 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765799859751,
            "Source": "co_actions_results"
        },
        {
            "Title": "KEC International Wins Orders Worth ₹1,150 Crores",
            "Summary": "KEC International secured new orders totaling ₹1,150 crores across T&D and Civil businesses in India, including its largest-ever India T&D order for 765kV transmission line and substation works.",
            "Sentiment": "positive",
            "PublishDate": 1765557332751,
            "Source": "co_actions_results"
        },
        {
            "Title": "KEC International Executive Director Renewables Resigns",
            "Summary": "Mr. Manjit Singh Sethi, Executive Director Renewables at KEC International, has resigned from his position effective December 12, 2025, citing personal reasons after a 44-year tenure with the company.",
            "Sentiment": "neutral",
            "PublishDate": 1765551182880,
            "Source": "stocks"
        },
        {
            "Title": "KEC International Receives ESG Rating of 65",
            "Summary": "KEC International Limited has been assigned an ESG rating of 65 by CFC Finlease Private Limited, as disclosed under SEBI regulations on December 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765467667742,
            "Source": "stocks"
        },
        {
            "Title": "KEC International Gets Credit Rating Reaffirmation with Enhanced Facility Limit to Rs. 24,100 Crore",
            "Summary": "ICRA Limited reaffirmed KEC International's credit ratings across multiple facilities while enhancing the total credit limit from Rs. 21,850 crore to Rs. 24,100 crore. The ratings include ICRA A+ (Stable) for long-term facilities and ICRA A1+ for short-term limits, with notable increases in non-fund based limits and bill discounting facilities.",
            "Sentiment": "positive",
            "PublishDate": 1764082399753,
            "Source": "stock"
        },
        {
            "Title": "KEC International Sees Rs. 95.18 Crore Block Trade on NSE",
            "Summary": "KEC International witnessed a significant block trade worth Rs. 95.18 crores involving 1,343,486 shares executed at Rs. 708.45 per share on NSE. The large-volume transaction indicates institutional activity and could impact the stock's liquidity and price movement.",
            "Sentiment": "neutral",
            "PublishDate": 1763619400698,
            "Source": "order&deals"
        },
        {
            "Title": "KEC International Clarifies PGCIL Letter Has No Material Impact on Operations",
            "Summary": "KEC International issued a clarification stating that a communication from PGCIL will not materially impact its ongoing operations or financial position, with PGCIL representing only 4% of the company's Rs. 17,066 crores YTD order intake in FY26. The company maintains confidence in achieving its annual order intake target based on a robust tender pipeline of over Rs. 1,80,000 crores and is exploring various options including legal recourse regarding the PGCIL matter.",
            "Sentiment": "negative",
            "PublishDate": 1763541838684,
            "Source": "stock"
        },
        {
            "Title": "KEC International Secures Rs. 1,016 Crores in New Orders Across Multiple Business Segments",
            "Summary": "KEC International Ltd., a global infrastructure EPC major and RPG Group company, has secured new orders worth Rs. 1,016 crores across Civil, Oil & Gas Pipelines, Transmission & Distribution, and Cables & Conductors businesses. The orders include the company's maiden Oil & Gas order in the Middle East and luxury villa development projects, bringing their year-to-date order intake to over Rs. 17,000 crores with 17% growth over the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1763366180204,
            "Source": "order&deals"
        },
        {
            "Title": "KEC International Projects Civil Business Revenue Growth to Rs. 5,000 Cr in FY26",
            "Summary": "KEC International expects its civil business revenue to reach Rs. 5,000 crores in FY26, representing an increase from Rs. 4,400 crores in the previous year. The company also anticipates its railway segment revenue to reach Rs. 2,000 crores for FY26. These projections were shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1762918059752,
            "Source": "stock"
        },
        {
            "Title": "KEC International Targets 15% Revenue Growth and 8% EBITDA Margin for FY26",
            "Summary": "KEC International expects 15% revenue growth for FY26, having already achieved 15% growth in the first half. The company aims for an 8% EBITDA margin for the full year, requiring over 8.5% margin in the second half as the first half margin was 7%. Interest costs are predicted to be about 2.5% of revenue this year, with net debt anticipated to normalize to approximately Rs. 5,000 crore by year-end.",
            "Sentiment": "positive",
            "PublishDate": 1762917507378,
            "Source": "stock"
        },
        {
            "Title": "KEC International Reports 88% Jump in Q2 Net Profit to 1.61 Billion Rupees",
            "Summary": "KEC International reported strong quarterly results with net profit rising to 1.61 billion rupees from 854.1 million rupees in the same period last year. Revenue increased to 60.91 billion rupees compared to 51.13 billion rupees previously. EBITDA grew to 4.3 billion rupees from 3.2 billion rupees, while EBITDA margin improved to 7.07% from 6.26%.",
            "Sentiment": "positive",
            "PublishDate": 1762789258098,
            "Source": "earnings"
        },
        {
            "Title": "KEC International Issues $26.67 Million Corporate Guarantee for Subsidiary Al Sharif Group KEC Limited",
            "Summary": "KEC International Limited has issued a corporate guarantee worth USD 26.67 million on November 3, 2025, for its subsidiary Al Sharif Group KEC Limited. The guarantee was provided in favor of an overseas bank that has extended banking facilities to the subsidiary. The company stated that promoter/promoter group/group companies have no interest in this transaction. KEC International noted that the corporate guarantee represents a contingent liability for the company, with no present impact on operations.",
            "Sentiment": "neutral",
            "PublishDate": 1762203925829,
            "Source": "corporate_action"
        },
        {
            "Title": "KEC International Secures Largest Ever Substation Order Worth Rs. 1,038 Crore in Saudi Arabia",
            "Summary": "KEC International has secured a Rs. 1,038 crore order for Design, Supply and Installation of 380 kV GIS Substation in Saudi Arabia. This represents the company's largest ever substation order and strengthens its presence in the Middle East region. The order is part of KEC's Transmission & Distribution business vertical. With this win, the company's year-to-date order intake has exceeded Rs. 16,000 crore, marking approximately 20% growth. KEC International is a global infrastructure EPC company and flagship of RPG Group, with operations across power transmission, civil, transportation, renewables, oil & gas pipelines, and cables sectors in over 110 countries.",
            "Sentiment": "positive",
            "PublishDate": 1760530039778,
            "Source": "order&deals"
        },
        {
            "Title": "KEC International Secures Rs. 1,064 Crore Order for Saudi Arabia Transmission Line Project",
            "Summary": "KEC International Limited has secured a new order worth Rs. 1,064 crore for the design, supply and installation of a 380 kV transmission line in Saudi Arabia. The order was received in the normal course of business within the company's international Transmission & Distribution (T&D) segment. MD & CEO Vimal Kejriwal noted that consecutive wins in Saudi Arabia and earlier Middle East orders have strengthened the international T&D order book, with the Middle East serving as a strategic growth driver. This order brings the company's year-to-date order intake above Rs. 15,000 crore. KEC International is a global infrastructure EPC company with presence across power transmission & distribution, civil, transportation, renewables, oil & gas pipelines and cables & conductors, operating in over 110 countries as the flagship company of RPG Group.",
            "Sentiment": "positive",
            "PublishDate": 1760424399987,
            "Source": "order&deals"
        },
        {
            "Title": "KEC International Secures Rs. 1,174 Crores in New T&D Orders from India and Middle East",
            "Summary": "KEC International Limited has secured new orders worth Rs. 1,174 crores for Transmission & Distribution projects in India and the Middle East. The orders include ± 800 kV HVDC and 765 kV transmission lines from a private developer in India, and 380 kV transmission lines in Saudi Arabia. MD & CEO Vimal Kejriwal noted that the HVDC transmission line order increased the share of orders from private developers in India T&D order intake for the year, while the Saudi Arabia order strengthened the company's leadership in the Middle East T&D market. With these orders, KEC's year-to-date order intake stands at approximately Rs. 14,000 crores.",
            "Sentiment": "positive",
            "PublishDate": 1760366007601,
            "Source": "stock"
        },
        {
            "Title": "KEC International Secures Orders Worth ₹1,102 Crores Across Multiple Projects",
            "Summary": "KEC International has won new orders totaling ₹1,102 crores spanning various projects. The orders include civil work for a 150 MW thermal power plant, TCAS orders for Indian Railways, and cable and tower supplies in the Americas and Middle East regions.",
            "Sentiment": "positive",
            "PublishDate": 1759735064285,
            "Source": "order&deals"
        },
        {
            "Title": "KEC International Secures Rs. 3,243 Crores in New Orders, Largest EPC Contract to Date",
            "Summary": "KEC International Limited has secured new orders worth Rs. 3,243 crores across its Transmission & Distribution business segments. The orders include 400 kV transmission lines in the United Arab Emirates and supply of towers, hardware and poles in the Americas. The company describes this as its largest ever EPC order. MD & CEO Vimal Kejriwal noted that the order strengthens KEC's presence in the Middle East and expands its international T&D order book. With these new orders, the company's year-to-date order intake reaches approximately Rs. 11,700 crores. KEC International is a global infrastructure EPC company with presence in power transmission, civil, transportation, renewables, oil & gas pipelines and cables sectors across 110+ countries.",
            "Sentiment": "positive",
            "PublishDate": 1758547600283,
            "Source": "stock"
        },
        {
            "Title": "KEC International Targets 15% Growth in FY26 Led by Transmission Business Expansion",
            "Summary": "KEC International is targeting 15% growth in FY26, driven by strong momentum in its transmission and distribution business. MD and CEO Vimal Kejriwal highlighted that the company's India transmission revenue grew from Rs 2,000 crore three years ago to over Rs 7,000 crore this year. The business comprises 60% transmission-related operations and 40% non-transmission activities, with transmission expected to grow above 15% while other segments may grow below 15%. The growth outlook is supported by India's increased renewable energy target of 600 GW by 2032 and strong international demand in the Middle East and Americas. The company faces execution challenges including labor availability and supply chain constraints, though both are showing improvement. Project timelines have been adjusted with substations now expected to take 15-18 months. In Q1FY26, consolidated revenue increased 11.3% to Rs 5,023 crore, EBITDA grew 19% to Rs 350 crore, and profit after tax surged 42% to Rs 125 crore compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1756274537234,
            "Source": "stock"
        },
        {
            "Title": "KEC International Issues $13.2 Million Corporate Guarantee for Subsidiary",
            "Summary": "KEC International Limited issued a corporate guarantee worth USD 13.20 million on August 26, 2025, for its subsidiary Al Sharif Group & KEC Limited Company. The guarantee was provided to an overseas bank that extended banking facilities to the subsidiary. The company stated that promoter/promoter group/group companies have no interest in this transaction. KEC International noted that the corporate guarantee represents a contingent liability for the company, with no present impact on operations.",
            "Sentiment": "neutral",
            "PublishDate": 1756221468111,
            "Source": "corporate_action"
        },
        {
            "Title": "KEC International Secures New Orders Worth Rs. 1,402 Crores Across Multiple Business Segments",
            "Summary": "KEC International Limited has secured new orders worth Rs. 1,402 crores across its various business segments. The Transmission & Distribution business won orders for a 765 kV transmission line from a private player in India and supply of towers, hardware and poles in the Americas. The Civil business secured a repeat order for a high-rise residential project from a real estate developer in Northern India. The Cables & Conductors business won orders for supply of various cables and conductors in India and overseas markets. MD & CEO Vimal Kejriwal noted that the year-to-date order intake has surpassed Rs. 8,400 crores, with these orders expected to contribute substantially towards the company's targeted growth.",
            "Sentiment": "positive",
            "PublishDate": 1755411420844,
            "Source": "stock"
        },
        {
            "Title": "KEC International Extends AED 175 Million Corporate Guarantee for Subsidiary Until 2028",
            "Summary": "KEC International Limited has extended the tenure of an existing corporate guarantee of AED 175 million issued on behalf of its subsidiary, Al Sharif Group & KEC Limited Company. The guarantee, which favors an overseas bank providing banking facilities to the subsidiary, has been extended until August 14, 2028. The promoter/promoter group/group companies have no interest in this transaction. The corporate guarantee represents a contingent liability for KEC International, with no current impact on the company.",
            "Sentiment": "neutral",
            "PublishDate": 1755188309100,
            "Source": "corporate_action"
        },
        {
            "Title": "KEC International Seeks Shareholder Approval for CEO Re-appointment and New Independent Director",
            "Summary": "KEC International has issued a postal ballot notice seeking shareholder approval for two key appointments. The company is proposing the re-appointment of Mr. Vimal Kejriwal as Managing Director & CEO for one year effective April 1, 2026, with a total remuneration package including basic salary of Rs. 1.98 crore, other allowances of Rs. 6.62 crore, and performance bonus up to Rs. 6 crore annually. Additionally, the company seeks approval for appointing Mr. Harsh Vardhan Shringla, former Foreign Secretary of India, as an Independent Director for five years from August 9, 2025 to August 8, 2030. Under Kejriwal's leadership, the company's revenue grew from Rs. 8,468 crore to Rs. 21,847 crore, EBITDA increased three times from Rs. 512 crore to Rs. 1,528 crore, and market capitalization rose from Rs. 2,058 crore to Rs. 20,837 crore. The e-voting period runs from August 15 to September 13, 2025, with results to be announced by September 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755181281263,
            "Source": "corporate_governance"
        },
        {
            "Title": "KEC International Appoints Former Foreign Secretary Harsh Vardhan Shringla as Independent Director",
            "Summary": "KEC International's Board of Directors approved the appointment of Harsh Vardhan Shringla as Additional Director (Non-Executive, Independent) for a five-year term from August 09, 2025 to August 08, 2030. The appointment is subject to shareholder approval. Shringla served as Foreign Secretary of India from 2020-22 and was Chief Coordinator for India's G20 Presidency in 2023. He has nearly 40 years of diplomatic experience, including roles as Ambassador to the United States, Bangladesh, and Thailand. He joined the Indian Foreign Service in 1984 after working in India's corporate sector. Shringla has been nominated by the President of India as a member of the Rajya Sabha and holds a degree from St. Stephen's College, Delhi University. He is not related to any existing directors or key managerial personnel of the company.",
            "Sentiment": "positive",
            "PublishDate": 1754749097381,
            "Source": "corporate_governance"
        },
        {
            "Title": "KEC International Issues SAR 123.75 Million Corporate Guarantee for Subsidiary",
            "Summary": "KEC International Limited has issued a corporate guarantee worth SAR 123.75 million on August 09, 2025, for its subsidiary Al Sharif Group & KEC Limited Company. The guarantee was provided to an overseas bank that extended banking facilities to the subsidiary. The promoter and group companies have no interest in this transaction. The guarantee represents a contingent liability for KEC International, with no current impact on the company.",
            "Sentiment": "neutral",
            "PublishDate": 1754736674688,
            "Source": "corporate_action"
        },
        {
            "Title": "KEC International Makes Q1 FY26 Earnings Call Transcript Available Online",
            "Summary": "KEC International Limited has published the transcript of its earnings conference call held on July 29, 2025, on the company's website. The call discussed the unaudited financial results for the quarter ended June 30, 2025. The transcript is now accessible at the company's earnings call transcripts section on their website.",
            "Sentiment": "neutral",
            "PublishDate": 1754052642270,
            "Source": "earnings"
        },
        {
            "Title": "KEC International Shares Rise After Securing ₹1,509 Crore New Orders",
            "Summary": "KEC International shares gained following the company's announcement of new orders worth ₹1,509 crore across multiple business segments. The orders span Transmission & Distribution (including 400 kV transmission lines in India and 500/400/220 kV lines internationally), Cables & Conductors (supply contracts in domestic and overseas markets), and Transportation (Train Collision Avoidance System under the Kavach project). With these orders, the company's year-to-date order intake exceeded ₹7,000 crore. The company reported quarterly results showing net profit increased 42.3% year-on-year to ₹125 crore, while consolidated revenue grew 11.3% to ₹5,023 crore. Shares traded 0.7% higher, though the stock has declined nearly 28% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1753857036975,
            "Source": "stock"
        },
        {
            "Title": "KEC International Secures New Orders Worth Rs. 1,509 Crores Across Multiple Business Segments",
            "Summary": "KEC International Limited, a global infrastructure EPC company and RPG Group flagship, has secured new orders worth Rs. 1,509 crores across its various business segments. The Transmission & Distribution business won orders for 400 kV Quad Transmission lines in India, 500/400/220 kV Overhead Transmission lines overseas, and supply of towers, hardware and poles in the Americas and Middle East. The Transportation division secured an order in joint venture for Train Collision Avoidance System (TCAS) under Kavach in India. The Cables & Conductors business won orders for supply of various cables and conductors in India and overseas markets. MD & CEO Vimal Kejriwal highlighted that these orders include a significant international order expanding their global T&D footprint and a repeat order from a private developer strengthening their domestic T&D presence. With these new orders, the company's year-to-date order intake has exceeded Rs. 7,000 crores.",
            "Sentiment": "positive",
            "PublishDate": 1753852781908,
            "Source": "order&deals"
        },
        {
            "Title": "KEC International Projects Margin Growth and Revenue Targets Amid Strong T&D Performance",
            "Summary": "KEC International expects margins to increase by 0.5-1% in FY27 compared to FY26 levels. The company has confirmed a 15% revenue growth target and projects EBITDA margins between 8-8.5% for FY26. The renewable business segment is anticipated to grow to ₹3,000-4,000 crore over the next 2-3 years. KEC International reported strong double-digit EBITDA margins in its Transmission & Distribution (T&D) business.",
            "Sentiment": "positive",
            "PublishDate": 1753845587116,
            "Source": "stock"
        },
        {
            "Title": "KEC International Projects Strong Growth with ₹40,000+ Crore Order Book",
            "Summary": "KEC International has forecasted strong growth for FY26, backed by an order book exceeding ₹40,000 crore. The company expects to benefit from global transmission and distribution opportunities and anticipates improved margins across all business segments.",
            "Sentiment": "positive",
            "PublishDate": 1753720373134,
            "Source": "stock"
        },
        {
            "Title": "KEC International Re-appoints Vimal Kejriwal as MD & CEO for One-Year Term",
            "Summary": "KEC International's Board of Directors approved the re-appointment of Vimal Kejriwal as Managing Director & CEO for a one-year term from April 1, 2026 to March 31, 2027, subject to shareholder approval. The company also announced that Nirupama Rao's second term as Independent Director ended on July 28, 2025, and she ceased to be a Director and chairperson/member of respective Board committees. Kejriwal has been with the company for more than two decades and brings over four decades of global experience across infrastructure, oil & gas, pharmaceuticals, fertilizers, and investment banking sectors. He is a Chartered Accountant and Company Secretary with qualifications from Kellogg School of Management and serves on various industry committees including FICCI Transport Infrastructure Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1753715310160,
            "Source": "corporate_governance"
        },
        {
            "Title": "KEC International Reports 42% Jump in Quarterly Profit to Rs 124.60 Crore",
            "Summary": "KEC International Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of Rs 5,022.88 crore, up from Rs 4,511.89 crore in the same quarter last year. Net profit increased to Rs 124.60 crore compared to Rs 87.58 crore in the previous year quarter. On a standalone basis, revenue reached Rs 4,029.94 crore versus Rs 3,888.25 crore last year, with profit after tax at Rs 36.83 crore against Rs 32.15 crore. The company operates through two main segments - Engineering, Procurement and Construction (EPC) business covering power transmission, railways, and infrastructure projects, and Others comprising mainly cable business. The company noted an ongoing government investigation related to a transmission project, with a chargesheet filed but not yet taken cognizance by the court, stating it expects no material impact on operations.",
            "Sentiment": "positive",
            "PublishDate": 1753714170565,
            "Source": "earnings"
        },
        {
            "Title": "KEC International: Shares Rise on Securing Rs 1,236 Crore Civil Project",
            "Summary": "KEC International's stock price increased by 4.62% after securing new orders worth Rs 1,236 crore for civil projects in India. The orders include high-rise residential projects in Western India, involving over 50 lakh square feet of development. CEO Vimal Kejriwal highlighted this as a key milestone in their strategic expansion into the premium high-rise residential segment.",
            "Sentiment": "positive",
            "PublishDate": 1750824622000,
            "Source": "order&deals"
        },
        {
            "Title": "KEC International Secures ₹1,236 Crore Order in Civil Business",
            "Summary": "KEC International has secured new orders worth ₹1,236 crore in its Civil business. This order marks the largest in the company's Buildings & Factories sector. The news indicates a significant business development for KEC International in the construction industry.",
            "Sentiment": "positive",
            "PublishDate": 1750820927000,
            "Source": "default"
        },
        {
            "Title": "KEC International: Targets 8% EBITDA Margin in FY26 with Strong T&D Focus",
            "Summary": "KEC International aims for 8-8.5% EBITDA margin in FY26, projecting 15% revenue growth. The company targets Rs 30,000 crore order book intake, with 70% from T&D business. It's expanding internationally and shifting focus from lower-margin transportation to high-value projects.",
            "Sentiment": "positive",
            "PublishDate": 1749171806000,
            "Source": "earnings"
        },
        {
            "Title": "KEC International: Secures ₹2,211 Crore in New Orders Across Multiple Segments",
            "Summary": "KEC International has won new orders worth ₹2,211 crore in transmission and distribution, oil and gas pipeline, and cables businesses. The company's year-to-date order intake now exceeds ₹4,200 crore, representing a 40% growth compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1749030114000,
            "Source": "order&deals"
        },
        {
            "Title": "KEC International Secures ₹22.11 Billion Order",
            "Summary": "KEC International has secured a new order valued at ₹22.11 billion. The news briefly mentions the company's acquisition of this significant contract, though no further details about the nature of the order or the client are provided in the given information.",
            "Sentiment": "positive",
            "PublishDate": 1749028866000,
            "Source": "default"
        },
        {
            "Title": "KEC International Sees Large Opportunity in Renewable Energy Market",
            "Summary": "KEC International has identified a significant opportunity in the renewable energy market. The company expects 350 Gigawatt of renewable energy to be built in the next 6-7 years. This information was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1748402416000,
            "Source": "default"
        },
        {
            "Title": "KEC International Forecasts Improved Margins and Revenue Growth",
            "Summary": "KEC International expects margins to increase to 8-8.5% in FY26 from the current 7%, citing stability in costs of cement, steel, and aluminum. The civil segment is projected to return to 7-8% margin. The company targets revenue of Rs. 25,000 cr this year, a 15% growth. Water business revenue is expected to reach Rs. 1,200-1,500 cr. The company's 100% unit is anticipated to generate Rs. 3,500 cr revenue by FY27, with positive outlook for railways business. Margins are expected to improve in FY25 from the current 10% to 11-12%.",
            "Sentiment": "positive",
            "PublishDate": 1748402329000,
            "Source": "default"
        }
    ]
}