{
    "Symbol": "KECL",
    "ISIN": "INE134B01017",
    "News": [
        {
            "Title": "Kirloskar Electric Q3FY26 Results Show Strong Growth",
            "Summary": "Kirloskar Electric Company reported Q3FY26 standalone revenue of ₹15,511 lakhs, up 27.9% YoY, with net profit rising to ₹440 lakhs from ₹310 lakhs in Q3FY25.",
            "Sentiment": "positive",
            "PublishDate": 1770877009736,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kirloskar Electric signs addendum to property sale deal",
            "Summary": "Kirloskar Electric Company Limited entered into an addendum to its registered property sale agreement on December 26, 2025, for 1.06 acres of land in Hubli, Karnataka originally agreed in March 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1766740454430,
            "Source": "stocks"
        },
        {
            "Title": "Kirloskar Electric Seeks Shareholder Approval to Raise CFO's Salary by ₹10 Lakh",
            "Summary": "Kirloskar Electric Company has issued a postal ballot notice seeking member approval to increase Director (Finance) and CFO Sanjeev Kumar Shivappa's annual remuneration from ₹65 lakh to ₹75 lakh, effective July 1, 2025. The salary revision is based on company performance recommendations by the Nomination and Remuneration Committee, with e-voting scheduled from November 22 to December 21, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763656351587,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kirloskar Electric Reports Quarterly Results and Senior Management Reorganization",
            "Summary": "Kirloskar Electric Company Limited announced its unaudited standalone and consolidated financial results for the quarter and six months ended September 30, 2025. The Board of Directors approved the results at their meeting on November 11, 2025, signed by Executive Chairman Vijay Ravindra Kirloskar. The company also implemented changes in senior management due to internal reorganization, effective immediately. The reorganization affects multiple senior positions including Vice Presidents across various divisions such as Human Resources, Information Technology, Legal & Secretarial, and different business units like HT Machines, LT Transformers, Cast Resin Transformers, Oil Filled Transformers, Switchgear, and Sales & Marketing divisions. The financial results were subject to limited review by statutory auditors and approved by the Audit Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1762862704420,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Electric Reports Strong EBITDA Growth Despite Revenue Decline in Q2",
            "Summary": "Kirloskar Electric reported Q2 EBITDA of 64 million rupees compared to 0.6 million rupees in the same period last year, with EBITDA margin improving significantly to 4.53% from 0.04%. The company's net profit increased to 63 million rupees from 52 million rupees year-over-year. However, Q2 revenue declined to 1.4 billion rupees from 1.62 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762844762423,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Electric Company Independent Director Dr. Ashok Misra Completes Second Term",
            "Summary": "Dr. Ashok Misra, Independent Director of Kirloskar Electric Company Limited, completed his second term of five consecutive years on November 4, 2025. He ceased to be a director of the company and also stepped down as a member of the Audit Committee and the Nomination and Remuneration Committee of the Board. The company stated that there is no requirement to reconstitute the board committees following his retirement, as the composition remains in line with regulatory requirements. The Board of Directors expressed gratitude for his contributions and professional guidance during his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1762287758219,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kirloskar Electric Approves Voluntary Retirement Scheme for Hubli Unit Employees",
            "Summary": "Kirloskar Electric Company Limited's Board of Directors approved a Voluntary Retirement Scheme for eligible employees and DREs at its Hubli Unit through a circular resolution. The company will communicate the financial impact of the scheme to stock exchanges once it concludes. The approval was granted on October 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760506305434,
            "Source": "corporate_action"
        },
        {
            "Title": "Kirloskar Electric Company Senior VP Sales & Marketing Retires",
            "Summary": "Mr. Kaushik Goswamy, Senior Vice President-Sales & Marketing of Kirloskar Electric Company Limited, has retired from his position effective September 19, 2025. The retirement was announced by Company Secretary & Compliance Officer Mahabaleshwar Bhat in a communication to stock exchanges BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1758282108286,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kirloskar Electric Shareholders Approve Key Resolutions at 78th AGM Including Director Reappointments",
            "Summary": "Kirloskar Electric Company Ltd. shareholders approved multiple resolutions at their 78th Annual General Meeting held on September 16, 2025 via video conferencing. Key approvals included adoption of audited financial statements for the year ended March 31, 2025, reappointment of Vijay R Kirloskar as director who was retiring by rotation, and reappointment of Anand B Hunnur as Managing Director for a three-year term effective July 12, 2025. Other approved matters included revision in remuneration for Executive Chairman Vijay R Kirloskar, appointment of S. P. Ghali & Co. as Secretarial Auditor for five years, appointment of BMS Auditing as auditor for the UAE branch office, ratification of Cost Auditors' remuneration for the financial year ending March 31, 2025, and continuation of Ravi Ghai as independent director after age seventy-five.",
            "Sentiment": "neutral",
            "PublishDate": 1758114437168,
            "Source": "corporate_action"
        },
        {
            "Title": "Kirloskar Electric Reports Quarterly Results; Board Approves Director Continuation Beyond Age 75",
            "Summary": "Kirloskar Electric Company Ltd. reported unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On a standalone basis, the company posted revenue from operations of ₹13,224 lakhs compared to ₹13,347 lakhs in the same quarter last year. Net profit after tax was ₹69 lakhs versus ₹227 lakhs in the previous year quarter. The board approved the continuation of Mr. Ravi Ghai as Independent Director beyond age 75, subject to shareholder approval at the upcoming Annual General Meeting. The company also appointed M/s. Rao, Murthy & Associates as Cost Auditors for financial year 2025-26. The company operates in three segments: Power generation/distribution (₹7,207 lakhs revenue), Rotating machines (₹5,944 lakhs revenue), and Others (₹169 lakhs revenue). Basic earnings per share stood at ₹0.10 for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754992784477,
            "Source": "earnings"
        },
        {
            "Title": "NCLT Approves Merger of Four Subsidiaries with Kirloskar Electric Company",
            "Summary": "The National Company Law Tribunal Bengaluru Bench has approved the merger of four wholly owned subsidiaries - KELBUZZ Trading Private Limited, Luxquisite Parkland Private Limited, SLPKG Estate Holdings Private Limited and SKG Terra Promenade Private Limited - with Kirloskar Electric Company Limited, effective from April 1, 2024. The tribunal has directed the company to issue notices to specified authorities including the Ministry of Corporate Affairs, Income Tax Authorities, and other regulatory bodies for submitting representations within 30 days. The company must also publish notices in Business Standard (English) and Vishwavani (Kannada) newspapers. The case is scheduled for hearing on September 18, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754131847748,
            "Source": "corporate_action"
        },
        {
            "Title": "Kirloskar Electric Co Reports Q4 Financial Results",
            "Summary": "Kirloskar Electric Co has released its Q4 financial results. The company's EBITDA increased to 117 million rupees from 110 million rupees year-over-year. The EBITDA margin improved to 9.05% from 6.54% in the same period last year. However, revenue decreased to 1.3 billion rupees from 1.7 billion rupees year-over-year. The company's net profit rose to 67 million rupees from 57 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748418296000,
            "Source": "result"
        },
        {
            "Title": "Kirloskar Electric Company Ltd: Meena Kirloskar Appointed Vice-Chairperson",
            "Summary": "Kirloskar Electric Company Ltd. has appointed Meena Kirloskar as Vice-Chairperson, effective immediately. She will retain her existing role as Non-Executive and Non-Independent Director alongside the new position. The decision was made at a board meeting held today.",
            "Sentiment": "neutral",
            "PublishDate": 1745843571000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kirloskar Electric Co Reports Q3 Revenue Decline",
            "Summary": "Kirloskar Electric Co announced its third-quarter revenue of 1.19 billion rupees, showing a decrease from 1.3 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1739346678000,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Electric Reports Improved Q3 EBITDA and Margin",
            "Summary": "Kirloskar Electric Company has reported a significant improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 80 million rupees, up from 56 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin expanded to 6.67% from 4.42% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739346629000,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Electric Reports Increased Q3 Net Profit",
            "Summary": "Kirloskar Electric Company has reported a net profit of 31 million rupees for the third quarter, compared to 17 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739346543000,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Electric Reports Q2 Revenue Increase",
            "Summary": "Kirloskar Electric Company has reported a revenue of 1.62 billion rupees for the second quarter, compared to 1.45 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730792038000,
            "Source": "result"
        },
        {
            "Title": "Kirloskar Electric Co. Reports Q2 Net Profit of 52M Rupees",
            "Summary": "Kirloskar Electric Co. has announced its financial results for the second quarter. The company reported a net profit of 52 million rupees, which is a slight decrease from the 56.6 million rupees reported in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1730792013000,
            "Source": "result"
        }
    ]
}