{
    "Symbol": "KEEPLEARN",
    "ISIN": "INE055C01020",
    "News": [
        {
            "Title": "DSJ Keep Learning Limited Receives Show Cause Notice for Profession Tax Delay",
            "Summary": "DSJ Keep Learning Limited received a Show Cause Notice from the Maharashtra Government's Profession Tax Office under the Maharashtra Tax on Professions, Trades, Callings and Employments Act, 1975. The notice was physically received on September 10, 2025, and pertains to delayed payment of monthly profession tax for certain months during FY 2021-22. The authority has demanded interest of ₹5,628 under Section 9(2) of the Act for the period from April 1, 2021, to March 31, 2022. The company stated there is no impact on its financial, operational, or other activities and will respond to the notice taking necessary steps as per applicable law.",
            "Sentiment": "neutral",
            "PublishDate": 1757590897730,
            "Source": "stock"
        },
        {
            "Title": "DSJ Keep Learning Limited CFO Rahul Regoti Resigns Due to Personal Reasons",
            "Summary": "DSJ Keep Learning Limited announced that Mr. Rahul Regoti has resigned from his position as Chief Financial Officer (CFO) and Key Managerial Personnel (KMP) due to personal reasons. The resignation becomes effective from the close of business hours on March 3, 2025. The company acknowledged the valuable services rendered by Regoti during his tenure. DSJ Keep Learning Limited, formerly known as DSJ Communications Limited, is listed on BSE (scrip code: 526677) and NSE (symbol: KEEPLEARN).",
            "Sentiment": "neutral",
            "PublishDate": 1757077109702,
            "Source": "corporate_governance"
        },
        {
            "Title": "DSJ Keep Learning Limited Reports Quarterly Financial Results for June 2025",
            "Summary": "DSJ Keep Learning Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported total revenue from operations of Rs 270.91 lakh, compared to Rs 255.81 lakh in the same quarter last year. Net profit for the quarter was Rs 30.55 lakh, significantly higher than Rs 11.28 lakh in the corresponding period last year. Basic earnings per share improved to Rs 0.07 from Rs 0.01 year-over-year. Total expenses for the quarter were Rs 239.14 lakh, with employee benefit expenses being the largest component at Rs 116.31 lakh. The company operates solely in education activities as its single reportable segment. The Board of Directors approved these results in their meeting held on August 14, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755187449834,
            "Source": "earnings"
        }
    ]
}