{
    "Symbol": "KEI",
    "ISIN": "INE878B01027",
    "News": [
        {
            "Title": "KEI Industries Reports Strong 9M FY26 Performance",
            "Summary": "KEI Industries showcases robust financial growth with revenue of INR 82,714 Mn in 9M FY26, strong order book of INR 37,243 Mn, and expanding retail presence across diverse product portfolio including cables and wires.",
            "Sentiment": "positive",
            "PublishDate": 1770469584813,
            "Source": "stocks"
        },
        {
            "Title": "KEI Industries Gets Credit Rating Revision from ICRA",
            "Summary": "ICRA Limited revises KEI Industries' credit rating limits, increasing long-term facilities from Rs. 3,210.00 crore to Rs. 3,310.00 crore while maintaining AA+ stable outlook and reducing short-term limits.",
            "Sentiment": "positive",
            "PublishDate": 1770202773700,
            "Source": "stocks"
        },
        {
            "Title": "KEI Industries Delists from Calcutta Stock Exchange",
            "Summary": "KEI Industries Limited has been voluntarily delisted from The Calcutta Stock Exchange effective February 3, 2026, while maintaining listings on NSE and BSE for continued trading.",
            "Sentiment": "neutral",
            "PublishDate": 1770112247114,
            "Source": "co_actions_results"
        },
        {
            "Title": "KEI Industries Reports Strong Q3 FY26 Growth",
            "Summary": "KEI Industries delivered impressive Q3 FY26 results with net sales of INR2,954 crores (19.51% growth), EBITDA of INR354 crores (39% growth), and PAT of INR234.86 crores (42.5% growth). Export sales surged 95% to INR544 crores.",
            "Sentiment": "positive",
            "PublishDate": 1769668993836,
            "Source": "co_actions_results"
        },
        {
            "Title": "KEI Industries Shares Drop 4% Despite Strong Q3 Results",
            "Summary": "KEI Industries reported robust Q3 FY26 results with ₹2,954 crore revenue and ₹235 crore profit, yet shares fell 4% due to high valuations at 42.7x PE ratio and profit booking by investors.",
            "Sentiment": "neutral",
            "PublishDate": 1769074240334,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kei Industries Targets 16-18% Volume Growth",
            "Summary": "Kei Industries management projects volume growth of 16-18% with additional price increases from input cost inflation expected to drive higher overall growth rates.",
            "Sentiment": "positive",
            "PublishDate": 1769065437334,
            "Source": "stocks"
        },
        {
            "Title": "Kei Industries Completes Cable Price Adjustments",
            "Summary": "Kei Industries management confirms completion of required price increases for cables and wires, with current sales aligned to January's average copper and aluminium prices during recent concall.",
            "Sentiment": "neutral",
            "PublishDate": 1769065376378,
            "Source": "stocks"
        },
        {
            "Title": "KEI Industries Targets 11% EBITDA Margin This Year",
            "Summary": "KEI Industries management has set an ambitious target of achieving 11% EBITDA margin for the current fiscal year, as announced during the company's recent conference call with investors and analysts.",
            "Sentiment": "positive",
            "PublishDate": 1769064807010,
            "Source": "co_actions_results"
        },
        {
            "Title": "KEI Industries Submits Q3 FY26 QIP Monitoring Report",
            "Summary": "KEI Industries submitted its quarterly monitoring report for QIP proceeds utilization for Q3 FY26, showing ₹171.50 crore deployment towards Sanand facility during the quarter with no deviations reported.",
            "Sentiment": "neutral",
            "PublishDate": 1769005989097,
            "Source": "stocks"
        },
        {
            "Title": "KEI Industries Q3FY26 Net Profit Surges 42.5% to ₹2,349cr",
            "Summary": "KEI Industries reported strong Q3FY26 results with net profit jumping 42.5% YoY to ₹2,348.61 crores. Revenue grew 19.5% to ₹29,547 crores. Board declared interim dividend of ₹4.50 per share.",
            "Sentiment": "positive",
            "PublishDate": 1768998732034,
            "Source": "co_actions_results"
        },
        {
            "Title": "KEI Industries Board Meet on Jan 21 for Q3 Results",
            "Summary": "KEI Industries has scheduled a board meeting on January 21, 2026, to consider Q3FY26 financial results, interim dividend declaration, and voluntary delisting from Calcutta Stock Exchange.",
            "Sentiment": "neutral",
            "PublishDate": 1768314083763,
            "Source": "co_actions_results"
        },
        {
            "Title": "JPMorgan Initiates KEI Industries Coverage with OW Rating",
            "Summary": "JPMorgan has initiated coverage on KEI Industries with an Overweight rating and set a target price of ₹5,250.00 per share, indicating positive analyst sentiment for the electrical cable manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1768189615740,
            "Source": "stocks"
        },
        {
            "Title": "KEI Industries Receives ESG Rating of 72 from NSE",
            "Summary": "KEI Industries Limited has been assigned an ESG rating of 72 by NSE Sustainability, placing the company in the 'Leader' category for Environmental, Social and Governance performance.",
            "Sentiment": "positive",
            "PublishDate": 1767879544247,
            "Source": "stocks"
        },
        {
            "Title": "KEI Industries Gets ESG1 Rating with 72.8 Score",
            "Summary": "KEI Industries Limited receives CareEdge-ESG1 rating with a score of 72.8 from CARE ESG Ratings Limited, reflecting leadership in ESG risk management through best-in-class disclosures and performance.",
            "Sentiment": "positive",
            "PublishDate": 1765803884584,
            "Source": "stocks"
        },
        {
            "Title": "KEI Industries Maintains FY26 Revenue Growth Guidance",
            "Summary": "KEI Industries reaffirms its FY26 revenue growth guidance of 18-20% while continuing to target 100 basis points annual margin improvement over three years.",
            "Sentiment": "positive",
            "PublishDate": 1765773253398,
            "Source": "stocks"
        },
        {
            "Title": "Morgan Stanley Maintains Overweight on KEI Industries",
            "Summary": "Morgan Stanley maintains 'Overweight' rating on KEI Industries with a price target of ₹4,793.00, reflecting positive outlook on the cable manufacturer's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1765770163059,
            "Source": "stocks"
        },
        {
            "Title": "Kei Industries Starts Cable Production at Sanand",
            "Summary": "Kei Industries has commenced production of low tension and high tension cables at its Phase 1 facility in Sanand, marking a significant operational milestone for the company.",
            "Sentiment": "positive",
            "PublishDate": 1765411979559,
            "Source": "stocks"
        },
        {
            "Title": "KEI Industries Starts Commercial Production at Sanand",
            "Summary": "KEI Industries commenced first phase of commercial production for LT/HT cables at its Sanand facility on December 10, 2025, with total project investment of ₹2,000 crores.",
            "Sentiment": "positive",
            "PublishDate": 1765376975618,
            "Source": "stocks"
        },
        {
            "Title": "KEI Industries Commences Cable Production at Sanand Phase 1 Facility",
            "Summary": "KEI Industries has started manufacturing low tension and high tension cables at its Sanand Phase 1 facility. This operational milestone expands the company's production capacity in the cable manufacturing segment.",
            "Sentiment": "positive",
            "PublishDate": 1765363567011,
            "Source": "stock"
        },
        {
            "Title": "Kei Industries Begins Trial Production at Sanand Facility",
            "Summary": "Kei Industries has commenced trial production at its Sanand facility, marking a key operational milestone for the company. Commercial production at the facility is scheduled to begin by December 10, 2025, which will expand the company's manufacturing capacity.",
            "Sentiment": "positive",
            "PublishDate": 1764633504350,
            "Source": "stock"
        },
        {
            "Title": "KEI Industries Wins Global Gold Awards for Corporate Reporting Excellence",
            "Summary": "KEI Industries Limited received Gold Awards in Integrated Report and Annual Report categories at the LACP Spotlight Awards 2025, achieving a worldwide rank of 39 out of 100 entries with a score of 98 out of 100. The company's Integrated Annual Report FY25 in the 100 million-1 billion revenue category earned global top 100 recognition at the prestigious international competition for corporate communications.",
            "Sentiment": "positive",
            "PublishDate": 1763466318630,
            "Source": "stock"
        },
        {
            "Title": "KEI Industries Projects FY26 Revenue of ₹8,250 Crores with 11.3% EBITDA Margin",
            "Summary": "KEI Industries has provided guidance for FY26, projecting revenue of ₹8,250 crores, representing a 17% year-over-year growth, with an EBITDA margin of 11.3%. The company maintains a strong order book of ₹5,400 crores across its EPC and cable segments. KEI Industries is expanding capacity by 25% at its Pathredi and Silvassa manufacturing units. The company plans capital expenditure of ₹600 crores over two years for EHV cable expansion. Strategic focus areas include exports growth, retail network expansion, and maintaining margin stability through backward integration initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1762875007885,
            "Source": "stock"
        },
        {
            "Title": "KEI Industries Schedules Multiple Analyst and Investor Meetings in November",
            "Summary": "KEI Industries Limited has announced a series of meetings with analysts and institutional investors scheduled throughout November. The company will participate in virtual one-on-one and group meetings with Nirmal Bang Securities on November 7, followed by physical meetings in Mumbai with UBS Securities India, Spark Institutional Equities, Kotak Securities, and JM Financial Institutional Securities between November 12-21. The company stated that no unpublished price-sensitive information will be shared during these meetings, and presentations will follow the same format as those available on the company's website and stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1762001806295,
            "Source": "stock"
        },
        {
            "Title": "KEI Industries Reports Strong Q2 Performance with 19% Revenue Growth and 31% PAT Increase",
            "Summary": "KEI Industries delivered robust quarterly results with net sales reaching INR 2,726 crores, marking 19.38% growth. The Wire and Cable segment grew 22% year-over-year. EBITDA increased 31.2% to INR 311.63 crores with margins improving to 11.43% from 10.4% previously. Profit after tax surged 31.47% to INR 203 crores. Export sales achieved an all-time high of INR 472 crores, representing 96% growth. The company maintains a strong order book of INR 3,824 crores. The Sanand plant's first phase faces a 4-month delay but is expected to be operational by November 2025, with over 50% capacity coming online from December. Management reaffirmed growth guidance of over 20% for the full year and projects 20% CAGR for the next 3-5 years. The company has 2,100 active dealers and continues to see strong demand across energy, infrastructure, and data center segments.",
            "Sentiment": "positive",
            "PublishDate": 1761073279486,
            "Source": "earnings"
        },
        {
            "Title": "KEI Industries Reports 19% Revenue Growth to ₹2,726 Crores in Q2 FY26",
            "Summary": "KEI Industries achieved net sales of ₹2,726 crores in Q2 FY26, marking 19.38% growth. The Wire and Cable segment grew 22% year-on-year. EBITDA increased 31.2% to ₹311.63 crores with margins improving to 11.43% from 10.4% in the previous year. Profit after tax rose 31.47% to ₹203 crores. Export sales reached an all-time high of ₹472 crores, representing 96% growth. Extra High-Voltage Cable sales grew 76% to ₹128 crores. The company maintains an order book of ₹3,824 crores as of September 30, 2025. Management expects the first phase of the Sanand plant to become operational by November 2025, with 50% capacity coming online from December. The company reaffirmed its growth guidance of over 20% for the full year, up from the earlier 17-18% target. B2C sales through dealer network contributed 54% of total sales at ₹1,475 crores. The company operates through 2,100 active dealers.",
            "Sentiment": "positive",
            "PublishDate": 1760895137880,
            "Source": "earnings"
        },
        {
            "Title": "KEI Industries Shares Audio Recording of Quarterly Results Investor Call",
            "Summary": "KEI Industries Limited has made available the audio recording of its analysts and investors call discussing unaudited standalone and consolidated financial results for the quarter ended September 30, 2025. The investor call was conducted on October 16, 2025, after the board approved the quarterly results on October 15, 2025. The company provided a direct link to access the audio recording of the earnings call.",
            "Sentiment": "neutral",
            "PublishDate": 1760616630014,
            "Source": "earnings"
        },
        {
            "Title": "KEI Industries Shares Drop 9% Despite 31% Net Profit Growth in Q2",
            "Summary": "KEI Industries shares fell 9% to Rs 4,032 despite reporting strong quarterly results. The cable and wire manufacturer posted a 31.3% year-on-year increase in net profit to Rs 204 crore for the September quarter, up from Rs 155 crore previously. Revenue from operations grew 19.4% to Rs 2,726 crore compared to Rs 2,284 crore in the same period last year. Operating margins remained relatively stable at 9.9%, up just 20 basis points from 9.7% in the previous year's quarter. EBITDA increased to Rs 269 crore from Rs 221 crore. Nuvama Institutional Equities maintained a Buy rating with a target price of Rs 4,450, citing strong demand in the cables sector. The stock has rallied 53% over the past six months and continues to benefit from infrastructure and real estate demand in power and housing sectors.",
            "Sentiment": "neutral",
            "PublishDate": 1760590216751,
            "Source": "stock"
        },
        {
            "Title": "KEI Industries Block Trade Worth Rs. 66.97 Crores Executed on NSE",
            "Summary": "KEI Industries witnessed a block trade on the National Stock Exchange involving approximately 160,403 shares at a price of Rs. 4,175.40 per share. The total transaction value amounted to Rs. 66.97 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1760587173382,
            "Source": "order&deals"
        },
        {
            "Title": "KEI Industries Reports QIP Fund Utilization Progress with Sanand Project Delays",
            "Summary": "KEI Industries Limited submitted its monitoring agency report for the quarter ended September 30, 2025, detailing utilization of proceeds from its Rs. 2,000 crore Qualified Institutions Placement. The report, prepared by CARE Ratings Limited, shows the company has utilized Rs. 1,269.14 crore out of total proceeds, with Rs. 730.86 crore remaining unutilized. The Sanand cable manufacturing facility project experienced delays due to revisions in original drawings and designs, causing extended delivery schedules for plant machinery and building construction. Payments have been shifted to FY26 and subsequent years, with Phase 2 expected to commence in Q4FY27. The company utilized Rs. 269.30 crore during the quarter for the Sanand facility and Rs. 85.93 crore for raw material purchases under general corporate purposes. Debt repayment of Rs. 275.99 crore was completed in FY25. Unutilized funds are deployed in fixed deposits across various banks earning returns between 4% to 7.51%. The company reported 20% revenue growth in FY25 and 25% growth in Q1FY26, with capacity utilization at 80%.",
            "Sentiment": "neutral",
            "PublishDate": 1760537838046,
            "Source": "corporate_action"
        },
        {
            "Title": "KEI Industries Reports Strong Q2 Performance with Revenue Growth and New Manufacturing Facility Progress",
            "Summary": "KEI Industries Limited reported quarterly results with revenue from operations of ₹27,263.49 million and net profit of ₹2,035.13 million. The company's half-year revenue reached ₹53,166.65 million with net profit of ₹3,992.60 million. Basic earnings per share stood at ₹21.30 for the quarter and ₹41.78 for the half-year. The Board reviewed progress on the new cable manufacturing facility in Sanand, Gujarat, where LT/HT cable production is expected to begin in November 2025, with EHV cable production planned for Q4 FY 2026-27. The company maintains technical collaboration with BRUGG CABLES for manufacturing EHV cables up to 400kV. During the period, 48,000 equity shares were allotted under the employee stock option scheme, increasing paid-up capital to ₹191.20 million.",
            "Sentiment": "positive",
            "PublishDate": 1760528982539,
            "Source": "earnings"
        },
        {
            "Title": "Kei Industries Plans Capacity Expansion and Export Push Amid Industry Growth Outlook",
            "Summary": "Kei Industries is pursuing faster growth through capacity expansion and export initiatives. The cable and wire industry is expected to grow 11-13% through FY29, driven by power infrastructure development, renewables, data centers, and EV charging infrastructure. The company's management plans to increase market share in the extra high voltage (EHV) segment, enhance its order book, and improve profitability through branding initiatives and global expansion.",
            "Sentiment": "positive",
            "PublishDate": 1754393224598,
            "Source": "stock"
        },
        {
            "Title": "KEI Industries Reports Strong Q1 FY26 Performance with 28% Revenue Growth and Healthy Order Book",
            "Summary": "KEI Industries, a leading cables and wires manufacturer, reported revenue of INR 25,903 million in Q1 FY26, representing 28.06% year-over-year growth. The company achieved EBITDA of INR 2,976 million with an 11.49% margin and PAT of INR 1,957 million, up 30.28% from the previous year. For FY25, KEI recorded revenue of INR 97,359 million with EBITDA of INR 10,628 million at 10.92% margin. The company maintains a healthy order book of INR 40,121 million as of June 2025. KEI operates across multiple segments including EHV, HT and LT power cables, house wire, and stainless steel wire, with manufacturing facilities at 8 locations. The company has a distribution network of 2,090+ dealers/distributors and serves 2,000+ institutional customers. Export sales accounted for 13% of revenue in FY25, with presence in 60+ countries. The company maintains strong return ratios with ROCE of 25% and ROE of 16% in FY25, along with a comfortable debt profile and AA+ credit rating.",
            "Sentiment": "positive",
            "PublishDate": 1754389825452,
            "Source": "stock"
        },
        {
            "Title": "KEI Industries Reports 25% Revenue Growth to Rs 2,590 Crores in Q1 FY26",
            "Summary": "KEI Industries delivered strong quarterly results with net sales rising 25.44% to Rs 2,590.32 crores. EBITDA grew 28% to Rs 297.62 crores with margins improving to 11.49% from 11.25%. Profit after tax increased 30.28% to Rs 195.75 crores. The wire and cable segment showed robust growth of approximately 32%, while export sales surged 61% to Rs 374 crores, driven by 122% growth in cable and wire exports. Domestic institutional cable sales grew 24% to Rs 711 crores, and B2C sales through distribution networks increased 22% to Rs 1,326 crores. The company maintains an order book of Rs 3,921 crores and expects its Sanand facility's first phase to commence commercial production by September 2025. Management guided for 18% revenue growth for the full year and aims to maintain EBITDA margins around 11%. The company targets 17-18% export contribution and 20% year-on-year CAGR growth over the next 2-3 years after completing the Sanand project.",
            "Sentiment": "positive",
            "PublishDate": 1753796701708,
            "Source": "earnings"
        },
        {
            "Title": "KEI Industries Plans Export Push Through Gujarat Plant Expansion",
            "Summary": "KEI Industries, India's second largest cables & wire company by market capitalisation, is expanding its Sanand facility in Gujarat to boost export business. Chairman Anil Gupta announced that Phase 1 of the capacity expansion will be operational by September 2025, with the full project completing by Q1FY27. The company aims to increase its export revenue share from the current 13% to 20% over the next two to three years. The Gujarat facility's proximity to the sea will reduce logistics and shipping costs for international markets. KEI Industries is actively seeking product certifications in various countries to stay ahead of competitors entering international markets. The company reported quarterly results showing 11% revenue growth to Rs 2,590 crore and 31% profit increase to Rs 196 crore. Despite new players entering the cables and wires space, management expressed confidence in maintaining domestic market share while expanding geographically.",
            "Sentiment": "positive",
            "PublishDate": 1753261799332,
            "Source": "stock"
        },
        {
            "Title": "KEI Industries Reports ₹1,958 Crore Net Profit on ₹25,903 Crore Revenue in Q1 FY2026",
            "Summary": "KEI Industries Limited reported standalone quarterly results with revenue from operations of ₹25,903.16 million and net profit of ₹1,957.47 million for the quarter ended June 30, 2025. The company's earnings per share stood at ₹20.49 (basic) and ₹20.47 (diluted). The Board reviewed the project implementation status for setting up a cable manufacturing facility at Sanand, Ahmedabad, Gujarat, noting that the first phase of LT/HT Cables production will commission by September 2025 and EHV Cable production will start by Q1 FY 2026-27. The company operates through three main segments: Cables & Wires (₹24,771.21 million revenue), Stainless Steel Wire (₹521.25 million), and EPC Projects (₹994.05 million). KEI Industries has a technical collaboration agreement with BUGG to manufacture EHV cables up to 400kV.",
            "Sentiment": "positive",
            "PublishDate": 1753185695933,
            "Source": "earnings"
        },
        {
            "Title": "Kei Industries Schedules Earnings Conference Call",
            "Summary": "Kei Industries has scheduled an earnings conference call for July 23 at 12 PM. This announcement is a correction to a previous statement.",
            "Sentiment": "neutral",
            "PublishDate": 1752814554000,
            "Source": "default"
        },
        {
            "Title": "KEI Industries Acquires Industrial Land in Gujarat",
            "Summary": "KEI Industries has purchased industrial land in Gujarat for 230.5 million rupees. This acquisition is intended to support the company's future growth plans.",
            "Sentiment": "positive",
            "PublishDate": 1752666293000,
            "Source": "default"
        },
        {
            "Title": "KEI Industries: Targets 18% Revenue Growth by FY26 with Export Focus and Capacity Expansion",
            "Summary": "KEI Industries aims for 17-18% revenue growth in FY26, driven by new plant commissioning in Sanand, Gujarat. Exports expected to contribute 17-18% of revenue this year, up from 13% last year. Company targets 25-30% revenue from exports within five years. Full Sanand plant completion expected by March 2026, with major revenue impact in FY27.",
            "Sentiment": "positive",
            "PublishDate": 1750908027000,
            "Source": "normal_news"
        },
        {
            "Title": "KEI Industries Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 340,184 shares of KEI Industries Ltd. occurred on the National Stock Exchange (NSE) for Rs. 121.85 crores. The trade was executed at a price of Rs. 3581.90 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1750307166000,
            "Source": "block_details"
        },
        {
            "Title": "KEI Industries Ltd. Block Trades on NSE",
            "Summary": "Two significant block trades of KEI Industries Ltd. shares occurred on the National Stock Exchange (NSE). The first trade involved approximately 188,776 shares at Rs. 3589.20 per share, totaling Rs. 67.76 crores. The second trade was for about 203,724 shares at Rs. 3590.10 per share, amounting to Rs. 73.14 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1750220374000,
            "Source": "block_details"
        },
        {
            "Title": "KEI Industries: Stock Corrects 22% After 1000% Five-Year Rally",
            "Summary": "KEI Industries' stock has corrected 22% from its all-time high of Rs 5,040 in June 2024 to Rs 3,748. The company has seen double-digit revenue growth over the past five years, but margins remain flat. Analysts maintain a positive outlook with 17 out of 21 recommending 'buy'. Jefferies projects a 31% annualized earnings growth for FY 2025-2027. However, increased competition, particularly from UltraTech Cement's entry into the wire market, poses a potential risk.",
            "Sentiment": "neutral",
            "PublishDate": 1749451969000,
            "Source": "normal_news"
        },
        {
            "Title": "Delhi High Court Quashes Tax Demand Order Against KEI Industries",
            "Summary": "KEI Industries has reported that the Delhi High Court has quashed a tax demand order against the company. The order, which demanded a tax payment of 590.4 million rupees, has been nullified by the court's decision.",
            "Sentiment": "positive",
            "PublishDate": 1748260095000,
            "Source": "default"
        },
        {
            "Title": "KEI Industries Acquires Land in Rajasthan",
            "Summary": "KEI Industries has acquired land from RIICO (Rajasthan State Industrial Development and Investment Corporation) at Salarpur, Rajasthan. The acquisition cost is reported to be 935.8 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1747828045000,
            "Source": "default"
        },
        {
            "Title": "KEI Industries Provides Guidance on EV Infrastructure, Capacity Expansion, and Financial Outlook",
            "Summary": "KEI Industries has provided guidance on several aspects of its business during a recent conference call. The company is expanding into EV infrastructure and kits for electrical vehicles. A new EHV capacity in Sanand is expected to be operational by FY '26-'27, enabling production of long-length drums to address export growth limitations. The company aims for a 17%-18% growth rate this year and expects to maintain an EBITDA margin of around 11%, with potential improvements through economies of scale. KEI Industries also assured that raw material cost fluctuations would be passed through, minimizing impact on financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1746675283000,
            "Source": "default"
        },
        {
            "Title": "KEI Industries: Targets 17-18% Revenue Growth for FY26, Boosted by Renewables and Real Estate",
            "Summary": "KEI Industries expects 17-18% revenue growth in FY26, driven by demand from renewable energy, data centers, infrastructure, and real estate. Exports projected to account for 16-17% of total sales. New capacity at Sanand plant to come online in 3-4 months. Q4FY25 revenue was ₹2,915 crore with 10.3% margin and ₹226 crore profit. Company aims to maintain 11% EBITDA margin.",
            "Sentiment": "positive",
            "PublishDate": 1746614807000,
            "Source": "earnings"
        },
        {
            "Title": "KEI Industries: Q4 Profit Surges 34%, Stock Rises 4%",
            "Summary": "KEI Industries reported a 34.4% YoY increase in Q4 FY25 net profit to Rs 227 crore. Revenue grew 25% to Rs 2,915 crore. EBITDA rose 18% to Rs 301.3 crore, though margins slightly declined. The stock rose 4.1% to Rs 3,326.60 on BSE following the results.",
            "Sentiment": "positive",
            "PublishDate": 1746592524000,
            "Source": "earnings"
        },
        {
            "Title": "Kei Industries Reports Strong Q4 Financial Results",
            "Summary": "Kei Industries has announced its Q4 financial results, showing significant year-over-year growth. The company's net profit increased to 2.3 billion rupees, up from 1.69 billion rupees in the same quarter last year. This represents a 36% year-over-year increase. Revenue also saw substantial growth, rising to 29.14 billion rupees from 23.2 billion rupees in the previous year, marking a 25.6% increase.",
            "Sentiment": "positive",
            "PublishDate": 1746576825000,
            "Source": "default"
        },
        {
            "Title": "KEI Industries Reports Strong Q4 Financial Results",
            "Summary": "KEI Industries has announced its Q4 financial results, showing significant year-over-year growth. The company's EBITDA increased to 3 billion rupees from 2.45 billion rupees in the previous year. Net profit rose to 2.3 billion rupees from 1.69 billion rupees year-over-year. Revenue also saw a substantial increase, reaching 29.14 billion rupees compared to 23.2 billion rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 10.34% from 10.54% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1746537262000,
            "Source": "result"
        },
        {
            "Title": "KEI Industries: Q4 Profit Jumps 34%, Revenue Up 25% Amid Margin Pressure",
            "Summary": "KEI Industries reported Q4 FY2025 results with net profit rising 34.4% YoY to ₹227 crore. Revenue grew 25% to ₹2,915 crore, driven by strong demand for cables and wires. EBITDA increased 18% YoY, but margins narrowed to 10.3% from 11% last year.",
            "Sentiment": "positive",
            "PublishDate": 1746535641000,
            "Source": "earnings"
        },
        {
            "Title": "KEI Industries to Consider Q4 Results on May 6",
            "Summary": "KEI Industries has announced that it will consider its fourth quarter (Q4) financial results on May 6. This indicates that the company is preparing to release its earnings report for the last quarter of its fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1744893203000,
            "Source": "default"
        }
    ]
}