{
    "Symbol": "KELLTONTEC",
    "ISIN": "INE164B01030",
    "News": [
        {
            "Title": "Kellton Tech Board Meet Set for Feb 12 to Review Q3 Results",
            "Summary": "Kellton Tech Solutions has scheduled its board meeting for February 12, 2026, to consider and approve unaudited financial results for Q3 FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770736803089,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kellton Tech Solutions Corrects Clerical Error in AGM Resolution for USD 50 Million FCCB Fundraising",
            "Summary": "Kellton Tech Solutions Limited identified and rectified an inadvertent clerical error in a resolution passed at its Annual General Meeting held on September 30, 2025, regarding the approval for raising funds through Foreign Currency Convertible Bonds on a private placement basis. The correction changed the fundraising limit from INR 5 crore to USD 50 million, with the company confirming that the discrepancy was purely clerical and did not impact the intent or substance of the shareholder-approved resolution.",
            "Sentiment": "neutral",
            "PublishDate": 1764331666932,
            "Source": "corporate_action"
        },
        {
            "Title": "Kellton Tech Acquires Kumori Technologies for ₹52.50 Crore to Boost ServiceNow Capabilities",
            "Summary": "Kellton Tech Solutions announced the acquisition of ServiceNow specialist Kumori Technologies for up to ₹52.50 crore, making it a wholly owned subsidiary. The acquisition strengthens Kellton's global ServiceNow delivery capabilities and advances its AI-led intelligent automation strategy for Fortune 500 enterprises.",
            "Sentiment": "positive",
            "PublishDate": 1764223681741,
            "Source": "order&deals"
        },
        {
            "Title": "Kellton Tech Solutions Reports Quarterly Results and Corporate Actions",
            "Summary": "Kellton Tech Solutions Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company's consolidated revenue from operations was Rs. 29,969.02 lakhs for the quarter and Rs. 59,516.46 lakhs for the six-month period. Net profit after tax reached Rs. 2,413.30 lakhs for the quarter and Rs. 4,770.56 lakhs for the half-year. During the period, the company undertook a share split in the ratio of 1:5, converting each equity share of Rs. 5 into five shares of Rs. 1 each. The company allotted 4,02,35,000 equity shares upon conversion of Foreign Currency Convertible Bonds aggregating to USD 10 million. Additionally, Kellton issued 55,00,000 share warrants at Rs. 126 each on a preferential basis, receiving Rs. 17,32,50,000 as upfront payment representing 25% of the issue price. The company operates through two main segments: Digital Transformation and Enterprise Solutions, with Consulting services. The trading window for designated persons remains closed and will reopen 48 hours after the results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1762975728075,
            "Source": "earnings"
        },
        {
            "Title": "Kellton Tech Solutions Targets Multi-Year Growth Through Digital Transformation Services",
            "Summary": "Kellton Tech Solutions is targeting multi-year growth driven by strong demand for digital transformation services. The company is expanding its AI, cloud, and cybersecurity practices across the U.S. and Europe. It has a large deal pipeline in the banking, financial services, insurance (BFSI) and healthcare sectors. The company is investing in productized platforms to increase its recurring revenue share. Management has provided strong guidance with expected margin expansion from an offshore shift strategy.",
            "Sentiment": "positive",
            "PublishDate": 1762963789931,
            "Source": "stock"
        },
        {
            "Title": "Kellton Tech Solutions Reports 22% Growth in Quarterly Net Profit to 241M Rupees",
            "Summary": "Kellton Tech Solutions reported quarterly consolidated net profit of 241 million rupees compared to 197 million rupees in the same period last year, marking a 22% increase. Revenue grew to 3 billion rupees from 2.71 billion rupees year-over-year. EBITDA increased to 366 million rupees from 325 million rupees, while EBITDA margin improved to 12.2% from 12% in the corresponding period last year.",
            "Sentiment": "positive",
            "PublishDate": 1762955063016,
            "Source": "earnings"
        },
        {
            "Title": "Kellton Tech Solutions Approves $40 Million Foreign Currency Convertible Bonds Issuance",
            "Summary": "Kellton Tech Solutions Limited's Board of Directors approved the issuance of up to $40 million in Foreign Currency Convertible Bonds (FCCBs). The issuance follows member approval obtained at the Annual General Meeting held on September 30, 2025. The board also constituted a Securities Issuance Committee to determine and finalize detailed terms and conditions of the FCCBs and handle associated matters. The company will provide updates to stock exchanges on material milestones of the proposed FCCB issuance, including terms confirmation, documentation progress, expected timelines, and approvals as they develop.",
            "Sentiment": "positive",
            "PublishDate": 1762007510507,
            "Source": "corporate_action"
        },
        {
            "Title": "Kellton Tech Solutions Partners with UN Population Fund for AI Solutions Development",
            "Summary": "Kellton Tech Solutions has been selected by the United Nations Population Fund (UNFPA) to build next-generation AI solutions for global impact. The company will design and deliver Generative AI-driven applications to strengthen digital innovation and human-centered transformation across UNFPA's global programs. The collaboration aims to accelerate progress toward UN Sustainable Development Goals by integrating responsible AI practices with UNFPA's vision of ensuring health, rights, and well-being. Kellton expects this strategic win to accelerate its growth trajectory, enhance its presence in global markets, and add value to its order book and financial performance. The partnership reinforces Kellton's position as a trusted AI and digital transformation partner for global institutions and the public sector.",
            "Sentiment": "positive",
            "PublishDate": 1761793625849,
            "Source": "order&deals"
        },
        {
            "Title": "Kellton Tech Solutions Passes All 10 Resolutions at AGM, Approves USD 50 Million FCCB and INR 250 Crore Fundraising",
            "Summary": "Kellton Tech Solutions Limited successfully conducted its 31st Annual General Meeting on September 30, 2025, where all 10 proposed resolutions were passed with requisite majority through e-voting. Key approvals include adoption of audited standalone and consolidated financial statements for the year ended March 31, 2025, re-appointment of Mr. Srinivas Potluri as director, re-appointment of M/S. Anant Rao & Mallik as statutory auditors for second term, and appointment of Mr. N.V.S.S. Suryanarayana Rao as secretarial auditor for 5 years. The company also approved significant fundraising initiatives including issuance of Foreign Currency Convertible Bonds up to USD 50 million and raising funds up to INR 250 crore through equity shares and other eligible securities. Additional approvals included increasing authorized share capital from INR 60 crore to INR 100 crore, enhancing borrowing limits from INR 500 crore to INR 750 crore, and empowering the company to give loans or invest funds in excess of limits under Section 186 of the Companies Act, 2013. The meeting had 75 participants through video conferencing, with a record date of September 23, 2025, covering 207,341 total shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1759491669066,
            "Source": "corporate_action"
        },
        {
            "Title": "Kellton Tech Solutions Allots 55 Lakh Convertible Warrants on Preferential Basis",
            "Summary": "Kellton Tech Solutions Limited has allotted 55,00,000 convertible warrants on a preferential basis, with each warrant convertible into one equity share of face value ₹5. The company received 25% of the total consideration upfront, with the remaining 75% payable upon conversion. The warrants can be converted into equity shares within 18 months from the allotment date, either in one or multiple tranches. The Board has authorized a Securities Issuance Committee to oversee all activities related to the preferential issue, including monitoring, allotment processes, receipt of funds, documentation, regulatory filings, and applications for listing and trading of the resulting equity shares upon conversion.",
            "Sentiment": "positive",
            "PublishDate": 1758306814810,
            "Source": "corporate_action"
        },
        {
            "Title": "Kellton Tech Solutions Celebrates Role in Sony LIV's Asia Cup 2025 Digital Experience",
            "Summary": "Kellton Tech Solutions Limited issued a press release celebrating Sony LIV's user experience during the Asia Cup 2025. The company highlighted its contribution through cloud-native engineering, low-latency streaming, and large-scale digital transformation capabilities that enabled seamless delivery of the sporting event. Kellton provided technical expertise in scalability, security, and speed to support the OTT platform's live sports streaming. The company positions itself as a global leader in AI and digital transformation, headquartered in Hyderabad with over 1,800 employees across the United States, Europe, and Asia-Pacific region.",
            "Sentiment": "positive",
            "PublishDate": 1757647619605,
            "Source": "stock"
        },
        {
            "Title": "Kellton Tech Solutions Signs MoU with E-Group ICT Software to Build Sovereign AI Ecosystem",
            "Summary": "Kellton Tech Solutions Limited has signed a Memorandum of Understanding with Hungary-based E-Group ICT Software Zrt to collaborate on an AI project under the EU-India Framework Agreement. The partnership will create an 'AI Gigafactory' where Kellton will provide expertise in software development and technology support. The collaboration focuses on building a sovereign, human-centric AI ecosystem combining Europe's emphasis on sovereignty and trusted innovation with India's technology expertise. The initiative is anchored in E-Group's Budapest Initiative and aims to deliver an integrated framework for AI, data processing, and cloud infrastructure prioritizing transparency, security, and long-term resilience. Kellton will contribute expertise in AI, Generative AI, Cloud, and Cybersecurity to the AI Roadmap initiative.",
            "Sentiment": "positive",
            "PublishDate": 1757475161199,
            "Source": "order&deals"
        },
        {
            "Title": "Kellton Tech Solutions Approves USD 50 Million FCCB and INR 250 Crore QIP Fundraising Plans",
            "Summary": "Kellton Tech Solutions Ltd. board approved plans to raise funds through Foreign Currency Convertible Bonds up to USD 50 million and through Qualified Institutional Placement up to INR 250 crores. The company also approved increasing its authorized share capital from INR 60 crores to INR 100 crores with corresponding amendments to its Memorandum of Association. Additional board decisions included re-appointment of Srinivas Potluri as director, re-appointment of M/s. Anant Rao & Malik as statutory auditor for FY 2025-26 to FY 2029-30, appointment of N.V.S.S. Suryanarayana Rao as secretarial auditor for the same period, approval for incorporating a wholly owned subsidiary in Ireland, and scheduling the Annual General Meeting for September 30, 2025. All fundraising and capital structure changes are subject to regulatory approvals and shareholder consent.",
            "Sentiment": "positive",
            "PublishDate": 1757170477134,
            "Source": "corporate_action"
        },
        {
            "Title": "Kellton Tech Solutions Reschedules Board Meeting, Adds Fund Raising Proposal to Agenda",
            "Summary": "Kellton Tech Solutions Limited has rescheduled its Board Meeting from September 5, 2025 to September 6, 2025. The company has expanded the meeting agenda to include consideration of a proposal to raise funds through issuance of equity shares or convertible securities, in addition to previously disclosed AGM-related items. The fund raising proposal would be subject to requisite regulatory and statutory approvals. The meeting will also address routine and ancillary business matters along with the Annual General Meeting agenda items.",
            "Sentiment": "neutral",
            "PublishDate": 1757043515773,
            "Source": "corporate_action"
        },
        {
            "Title": "Kellton Tech Solutions Confirms Promoter Commitment to Subscribe 45 Lakh Warrants in Preferential Issue",
            "Summary": "Kellton Tech Solutions Limited issued a clarification stating that promoter entity Matnic Finvest LLP has provided firm commitment to subscribe to 45,00,000 warrants in the preferential issue that was approved by shareholders at an Extraordinary General Meeting held on July 11, 2025. The clarification was issued in response to a stock exchange observation seeking explicit statement of promoters' intent to participate in the warrant subscription. The subscription will be completed according to applicable laws including Companies Act 2013, SEBI ICDR Regulations 2018, and SEBI LODR Regulations 2015, covering pricing, lock-in, and disclosure requirements. The disclosure aims to remove ambiguity from the explanatory statement and explicitly record the promoters' subscription intent.",
            "Sentiment": "neutral",
            "PublishDate": 1756187427640,
            "Source": "corporate_action"
        },
        {
            "Title": "Kellton Tech Solutions Reports 12.8% Revenue Growth in Q1 FY26",
            "Summary": "Kellton Tech Solutions Limited announced its quarterly results for the period ended June 30, 2025. The company reported consolidated revenue of ₹29,547.44 lakhs, representing a 12.8% year-over-year increase from ₹26,192.75 lakhs in the same quarter last year. Net profit rose to ₹2,265.10 lakhs compared to ₹1,994.29 lakhs in the previous year, marking a 13.5% growth. The company achieved an EBITDA of ₹358 million with a margin of 12.1% and PAT margin of 7.7%. Earnings per share stood at ₹2.32. The company operates across three segments: Digital Transformation (83%), Enterprise Solutions (13.9%), and Consulting (3.1%). During the quarter, Kellton launched KAI, an enterprise-grade Agentic AI platform, and secured three new client projects including partnerships with a global beverage leader, a U.S. health insurer, and an Indian travel technology provider. The company also completed a stock split in the ratio of 1:5, subdividing shares from ₹5 face value to ₹1 each, with the record date set as July 25, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755008624873,
            "Source": "earnings"
        },
        {
            "Title": "Kellton Tech Solutions Completes Stock Split, Reduces Share Face Value from ₹5 to ₹1",
            "Summary": "Kellton Tech Solutions Limited has completed its stock split, reducing the face value of equity shares from ₹5 to ₹1 each. The split became effective from July 28, 2025, with a new ISIN INE164B01030 assigned to the post-split shares. The company processed 150,721 records covering 362,792,165 new shares with ₹1 face value, while debiting 72,558,433 shares with the previous ₹5 face value. Both NSDL and CDSL depositories have confirmed successful processing of the corporate action. The split affects all existing and prospective shareholders, with the changes reflected in trading from the effective date.",
            "Sentiment": "neutral",
            "PublishDate": 1753755439178,
            "Source": "corporate_action"
        }
    ]
}