{
    "Symbol": "KERNEX",
    "ISIN": "INE202H01019",
    "News": [
        {
            "Title": "Kernex Microsystems Board Meet Set for Feb 12, 2026",
            "Summary": "Kernex Microsystems schedules board meeting on February 12, 2026, to consider Q3FY26 unaudited financial results. Trading window remains closed until February 14, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770639999690,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kernex Microsystems Wins ₹2,465.7 Cr Order",
            "Summary": "Kernex Microsystems (India) secures major order worth ₹2,465.7 crores with 12-month execution timeline. Company currently maintains market cap of ₹2,105 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768522656995,
            "Source": "co_actions_results"
        },
        {
            "Title": "KERNEX Wins ₹2,465.71 Cr KAVACH Equipment Order",
            "Summary": "KERNEX Microsystems secured a major ₹2,465.71 crore order from Chittaranjan Locomotive Works for supply and commissioning of 3,024 sets of on-board KAVACH locomotive safety equipment with 12-month execution timeline.",
            "Sentiment": "positive",
            "PublishDate": 1768449930301,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kernex shares fall 9% on missed order deadline",
            "Summary": "Kernex Microsystems shares declined up to 15.93% after failing to meet Chittaranjan Locomotive Works order deadline. Other Kavach-linked stocks also traded lower amid spillover effect.",
            "Sentiment": "negative",
            "PublishDate": 1768215347149,
            "Source": "stocks"
        },
        {
            "Title": "Kernex Microsystems Falls 16% on KAVACH Order Rejection",
            "Summary": "Kernex Microsystems shares plunged 16% after CLW rejected its request to extend delivery deadline for KAVACH equipment order worth ₹1,730 crores, citing certification delays.",
            "Sentiment": "negative",
            "PublishDate": 1768196893398,
            "Source": "stocks"
        },
        {
            "Title": "Kernex Microsystems Reports Strong Q2 Performance with 910.36 Lakh Profit Before Tax",
            "Summary": "Kernex Microsystems (India) Limited announced consolidated profit before tax of ₹910.36 lakhs for the quarter ended September 30, 2025, with total income reaching ₹4,748.81 lakhs. The railway safety systems manufacturer's Board approved unaudited standalone and consolidated financial results, showing improved operational performance despite auditor emphasis on long-outstanding receivables and bank guarantees under arbitration.",
            "Sentiment": "neutral",
            "PublishDate": 1763051163659,
            "Source": "earnings"
        },
        {
            "Title": "Kernex Microsystems Receives Credit Ratings from CARE Ratings Limited",
            "Summary": "Kernex Microsystems (India) Limited has received credit ratings from CARE Ratings Limited. The company was assigned CARE BBB- with Stable outlook for long-term bank facilities worth Rs. 175 crore. For long-term/short-term bank facilities of Rs. 100 crore, the company received CARE BBB- Stable/CARE A3 ratings. The company informed stock exchanges BSE and NSE about these rating assignments.",
            "Sentiment": "neutral",
            "PublishDate": 1762184545560,
            "Source": "corporate_action"
        },
        {
            "Title": "KERNEX Microsystems Receives RDSO Approval for Kavach System Version 4.0, Total Orders Hit ₹3,346.35 Crores",
            "Summary": "KERNEX Microsystems (India) has received RDSO approval for its Kavach System Version 4.0. The company's total orders have reached ₹3,346.35 crores including GST. Deliveries are scheduled to commence on April 1, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1760425758904,
            "Source": "stock"
        },
        {
            "Title": "Kernex Microsystems Appoints Ganesh Kumar Dwivedy as President of Kavach Operations",
            "Summary": "Kernex Microsystems (India) Ltd appointed Mr. Ganesh Kumar Dwivedy as President of Kavach Operations and Related Projects, with the Board of Directors approving the appointment on September 26, 2025. Dwivedy brings over 36 years of experience in railway signaling and safety systems, including roles across multiple Indian Railways zones and international railway systems. His most recent position was Principal Chief Signal & Telecommunication Engineer at South Central Railway, Secunderabad, where he led a ₹1900 crore rollout of Automatic Block Signalling across 1600 RKms and oversaw the first successful deployment of the indigenous KAVACH ATP system across 1200 RKms. He holds degrees in Electronics Engineering and Advanced Electronics & Communication, with expertise spanning general management, operations, safety management, and telecommunication systems. Dwivedy is not related to any directors of the company.",
            "Sentiment": "positive",
            "PublishDate": 1758938497292,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kernex Microsystems Forms Joint Venture with Venkata Rami Reddy Constructions for Railway Project",
            "Summary": "Kernex Microsystems (India) Limited has entered into a joint venture agreement with Venkata Rami Reddy Constructions (VRRC). The joint venture will focus on upgrading Kavach Version 3.2 to 4.0 in the Sadashivpet Road to Bidar - Parli Vaijnath Parbhani section of South Central Railway and executing future projects. Kernex will hold an 80% share while VRRC will hold 20%, though this ratio may change based on future project scope. The parties are not related to promoter groups, and the transaction does not fall under related party transactions. VRRC has not requested nominee director appointments.",
            "Sentiment": "positive",
            "PublishDate": 1758179615754,
            "Source": "order&deals"
        },
        {
            "Title": "Kernex Microsystems Partners With Venkata Rami Reddy Constructions for Railway Safety Enhancements",
            "Summary": "Kernex Microsystems has formed a partnership with Venkata Rami Reddy Constructions focused on railway safety enhancements. The collaboration aims to improve safety measures in the railway sector.",
            "Sentiment": "positive",
            "PublishDate": 1758179261113,
            "Source": "order&deals"
        },
        {
            "Title": "KERNEX Microsystems Wins ₹209.82 Crore Contract for Train Safety System",
            "Summary": "KERNEX Microsystems has secured a ₹209.82 crore contract from DFCCIL for the Kavach Train Collision Prevention System on the Eastern Dedicated Freight Corridor. The contract involves implementing safety technology designed to prevent train collisions on the freight corridor infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1756451327031,
            "Source": "order&deals"
        },
        {
            "Title": "KERNEX-KEC Consortium Wins Rs. 151.41 Crore KAVACH Railway Project Contract",
            "Summary": "The KERNEX-KEC Consortium received a Letter of Acceptance from West Central Railways, Bhopal for a KAVACH project valued at Rs. 151.41 crores including GST. The project involves provision of KAVACH indigenous ATP system on UHF backbone along with OFC with route diversity in Itarsi-Khandwa, Bina-Ruthiyai and associated sections of Bhopal Division. The contract has a completion period of 600 days. KERNEX's cumulative KAVACH orders since April 1, 2024 now total Rs. 3,136.53 crores including GST. The contract is domestic in nature and does not involve any promoter group interest or related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1755596422821,
            "Source": "order&deals"
        },
        {
            "Title": "Kernex Microsystems Reports Strong Q1 Performance with Net Profit Doubling",
            "Summary": "Kernex Microsystems delivered robust Q1 results with consolidated net profit rising to Rs 74.6 million from Rs 36.2 million year-over-year. The company's EBITDA increased significantly to Rs 129.4 million compared to Rs 50.9 million in the same period last year. EBITDA margin improved to 22.49% from 16.95% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1755154240727,
            "Source": "earnings"
        },
        {
            "Title": "Kernex Microsystems Shareholders Approve Sreelakshmi Manthena as Managing Director",
            "Summary": "Kernex Microsystems (India) Limited shareholders approved the appointment of Ms. Sreelakshmi Manthena (DIN: 07996443) as Managing Director through a postal ballot conducted via remote e-voting. The special resolution received overwhelming support with 223 shareholders holding 5,643,600 shares (99.995%) voting in favor, while only 7 shareholders holding 280 shares (0.005%) voted against the proposal. The e-voting process ran from July 11, 2025 to August 9, 2025, with a total of 230 shareholders participating in the voting process. The scrutinizer's report was prepared by D.S. Rao, a practicing company secretary, confirming the voting results were conducted in accordance with applicable regulations.",
            "Sentiment": "positive",
            "PublishDate": 1754924666878,
            "Source": "corporate_action"
        },
        {
            "Title": "Western Railway Suburban Trains to Get Kavach Safety Feature by Next Year End",
            "Summary": "Western Railway suburban trains will be equipped with the Kavach safety feature by the end of next year. Kavach is a safety enhancement system for railway operations.",
            "Sentiment": "positive",
            "PublishDate": 1754278201246,
            "Source": "stock"
        },
        {
            "Title": "Kernex Microsystems Secures Rs. 21.03 Crore Railway Contract for Kavach System Upgrade",
            "Summary": "Kernex Microsystems India Limited received a Letter of Acceptance from South Central Railways for upgrading Kavach Version 3.2 to 4.0 in the Sadashivpet Road-Bidar-Parli Vaijnath-Parbhani railway section. The contract, awarded to KERNEX-VRRC JV, is valued at Rs. 21.03 crores including 18% GST and must be completed within 24 months. This is a domestic contract with no related party transactions or promoter group interests involved.",
            "Sentiment": "positive",
            "PublishDate": 1753258092487,
            "Source": "stock"
        },
        {
            "Title": "Kernex Microsystem Secures ₹311 Crore Order",
            "Summary": "Kernex Microsystem has received an order valued at ₹311 crore. No further details about the order or its nature were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1749799531000,
            "Source": "default"
        },
        {
            "Title": "Kernex Microsystems (India) Secures 1.83 Billion Rupee Order",
            "Summary": "Kernex Microsystems (India) has received an order worth 1.83 billion rupees. No additional details about the nature of the order or the client were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1749428043000,
            "Source": "default"
        },
        {
            "Title": "KERNEX MICROSYSTEMS (INDIA) Secures ₹1.83 Billion Order",
            "Summary": "KERNEX MICROSYSTEMS (INDIA) has secured a new order valued at ₹1.83 billion. The news briefly mentions this significant business development for the company, indicating a substantial contract or project acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1749217835000,
            "Source": "default"
        },
        {
            "Title": "Kernex Microsystems India: Railway Safety Stock Surges on New Kavach Order",
            "Summary": "Kernex Microsystems India secured a ₹85 crore Kavach order from North Central Railways as part of a consortium. This follows a recent ₹325.33 crore order from South Eastern Railways for the Train Collision Avoidance System. The stock hit a 5% upper circuit for the second consecutive day, reaching ₹855.55.",
            "Sentiment": "positive",
            "PublishDate": 1743568320000,
            "Source": "order&deals"
        },
        {
            "Title": "Kernex-KEC Consortium Secures Kavach Project Contract",
            "Summary": "Kernex Microsystems (India) and KEC International have formed a consortium that has received a Letter of Acceptance (LOA) for the Kavach project. The project bid was accepted at a cost of 851.4 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1743500482000,
            "Source": "order&deals"
        },
        {
            "Title": "Kernex Microsystems: Consortium Wins Rs 325 Crore Kavach Contract",
            "Summary": "Kernex-MRT consortium awarded Rs 325.33 crore contract by South Eastern Railway for Kavach safety system implementation across 688 RKM in Kharagpur and Chakradharpur divisions. Project to be completed within 1,000 days.",
            "Sentiment": "positive",
            "PublishDate": 1740712586000,
            "Source": "order&deals"
        },
        {
            "Title": "Kernex Microsystems (India) Secures 3.25 Billion Rupee Order",
            "Summary": "Kernex Microsystems (India) has received a significant order worth 3.25 billion rupees (approximately $39.5 million USD). This substantial contract represents a major business development for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1740702242000,
            "Source": "order&deals"
        },
        {
            "Title": "Kernex Microsystems (India) Secures 3.25 Billion Rupee Order",
            "Summary": "Kernex Microsystems (India) has received a significant order valued at 3.25 billion rupees. This substantial contract represents a major business development for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1740656970000,
            "Source": "order&deals"
        },
        {
            "Title": "Kernex Microsystems Reports Significant Revenue Growth in Q3",
            "Summary": "Kernex Microsystems has reported a substantial increase in its third-quarter revenue. The company's revenue for Q3 reached 368 million rupees, compared to 83 million rupees in the same period last year, representing a year-over-year growth of approximately 343%.",
            "Sentiment": "positive",
            "PublishDate": 1739425797000,
            "Source": "earnings"
        },
        {
            "Title": "Kernex Microsystems Reports Profitable Q3 Results",
            "Summary": "Kernex Microsystems has reported a consolidated net profit of 72 million rupees for the third quarter, marking a significant turnaround from a loss of 85 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739425602000,
            "Source": "earnings"
        },
        {
            "Title": "Kernex Microsystems: Secures ₹2,041 Crore Railway Safety Contract",
            "Summary": "Kernex Microsystems India secured a ₹2,041 crore order from Chittaranjan Locomotive Works for 2,500 onboard KAVACH equipment sets. The project, aimed at enhancing railway safety, is to be completed within 12 months. The stock hit a new all-time high, locked in 5% upper circuit for the fifth consecutive day.",
            "Sentiment": "positive",
            "PublishDate": 1733987952000,
            "Source": "order&deals"
        },
        {
            "Title": "Kernex Micro Systems Secures Major Kavach Order Worth Rs. 2,041.04 Crores",
            "Summary": "Kernex Micro Systems (India) has been awarded a significant order for the Kavach project, valued at Rs. 2,041.04 crores. This order represents a major business opportunity for the company in the railway safety and automation sector.",
            "Sentiment": "positive",
            "PublishDate": 1733834415000,
            "Source": "order&deals"
        },
        {
            "Title": "Kernex Microsystems: Secures ₹2,041 Crore Order for Railway Safety Equipment",
            "Summary": "Kernex Microsystems has won a ₹2,041 crore order from Chittaranjan Locomotive Works for 2,500 sets of onboard KAVACH equipment, to be completed by 2025. The company's stock hit a 5% upper circuit at ₹1,140 per share following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1733718708000,
            "Source": "order&deals"
        },
        {
            "Title": "Kernex Microsystems Secures Major Order Worth 2,041 Crore Rupees",
            "Summary": "Kernex Microsystems has won a significant order valued at 2,041 crore rupees. The company's current market capitalization stands at 19.7 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1733462223000,
            "Source": "order&deals"
        },
        {
            "Title": "Kernex Microsystems (India) Reports Significant Q2 EBITDA Improvement",
            "Summary": "Kernex Microsystems (India) has reported a substantial improvement in its Q2 EBITDA, turning a loss of 34 million rupees in the previous year into a gain of 102.5 million rupees. The company's Q2 EBITDA margin stands at 24.87%.",
            "Sentiment": "positive",
            "PublishDate": 1731583009000,
            "Source": "result"
        },
        {
            "Title": "Kernex Microsystems Reports Significant Revenue Growth in Q2",
            "Summary": "Kernex Microsystems (India) has reported a substantial increase in its second-quarter revenue. The company's revenue for Q2 reached 412 million rupees, compared to 14 million rupees in the same period last year, representing a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731582785000,
            "Source": "result"
        },
        {
            "Title": "Kernex Microsystems Reports Profit in Q2 FY2024",
            "Summary": "Kernex Microsystems (India) has reported a consolidated net profit of 68.5 million rupees in the second quarter, compared to a loss of 44 million rupees in the same quarter last year. The company also showed improvement from the previous quarter, with profit increasing from 36.2 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1731582750000,
            "Source": "result"
        },
        {
            "Title": "Kernex Microsystems Secures 43.5M Rupee Order for Train Safety System",
            "Summary": "<p><span class=\"positive\">Kernex Microsystems (India)</span> has been <span class=\"positive\">awarded</span> a <b>contract worth 43.5 million rupees</b> by the <span class=\"neutral\">Rail Coach Factory</span> in Kapurthala. The order is for the <span class=\"neutral\">supply, installation, testing, and commissioning</span> of the <span class=\"positive\">Train Collision Avoidance System (KAVACH)</span> for train sets.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728998191000,
            "Source": "corporate_action"
        }
    ]
}