{
    "Symbol": "KEYFINSERV",
    "ISIN": "INE681C01015",
    "News": [
        {
            "Title": "Keynote Financial Services Q3FY26 Results",
            "Summary": "Keynote Financial Services reports consolidated net profit of ₹449.14 lakhs for Q3FY26, with total income reaching ₹1,311.14 lakhs despite operational challenges.",
            "Sentiment": "positive",
            "PublishDate": 1770894891447,
            "Source": "co_actions_results"
        },
        {
            "Title": "Keynote Financial Services Board Meet on Feb 12",
            "Summary": "Keynote Financial Services Limited has scheduled its board meeting for February 12, 2026, to consider Q3FY26 unaudited financial results. Trading window remains closed for designated persons.",
            "Sentiment": "neutral",
            "PublishDate": 1770024985810,
            "Source": "stocks"
        },
        {
            "Title": "Keynote Financial Services Cancels 14.52 Lakh Shares",
            "Summary": "Keynote Financial Services Limited receives stock exchange approval for extinguishment and cancellation of 14,51,702 equity shares under selective capital reduction scheme approved by NCLT Mumbai.",
            "Sentiment": "neutral",
            "PublishDate": 1768903286816,
            "Source": "co_actions_results"
        },
        {
            "Title": "Keynote Financial Services Gets Regulatory Fine Waiver from Stock Exchanges",
            "Summary": "NSE and BSE waived fines of Rs. 2,73,760 each plus GST imposed on Keynote Financial Services Limited for delayed compliance with SEBI LODR Regulations related to Audit Committee and Nomination & Remuneration Committee requirements. The fines were levied due to non-compliance with Regulations 18(1) and 19(1)/(2) for the quarter ended June 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763451832521,
            "Source": "corporate_governance"
        },
        {
            "Title": "Keynote Financial Services Receives NSE Waiver for Corporate Governance Reporting Fines",
            "Summary": "Keynote Financial Services was fined by NSE and BSE for clerical errors in corporate governance reporting for the quarter ended June 30, 2025, related to audit and nomination committee disclosures. The company's board reviewed the matter and NSE granted a waiver for the fine, noting that the committees were properly constituted and the error was purely procedural and promptly corrected.",
            "Sentiment": "positive",
            "PublishDate": 1763127661609,
            "Source": "corporate_governance"
        },
        {
            "Title": "Keynote Financial Services Reports Quarterly Loss Despite Revenue Growth",
            "Summary": "Keynote Financial Services posted a net loss of Rs 16.9 crores for the quarter ended September 30, 2025, compared to a profit of Rs 21.0 crores in the same period last year, despite total income rising to Rs 114.2 crores from Rs 80.9 crores. The company's board approved these unaudited financial results on November 14, 2025, showing deteriorated profitability across its advisory services, broking, trading, and investment activities segments.",
            "Sentiment": "neutral",
            "PublishDate": 1763118583468,
            "Source": "earnings"
        },
        {
            "Title": "Keynote Financial Services Announces Book Closure and ₹1 Dividend for 32nd AGM",
            "Summary": "Keynote Financial Services Limited has declared a book closure period from September 19 to September 26, 2025, for its 32nd Annual General Meeting and dividend payment. The company will pay a dividend of ₹1 per equity share of ₹10 each, representing a 10% dividend rate. Shareholders on record as of September 20, 2025, will be eligible for the dividend payment.",
            "Sentiment": "positive",
            "PublishDate": 1756193587826,
            "Source": "corporate_action"
        },
        {
            "Title": "Keynote Financial Services Approves Q1 Results and Declares 10% Dividend for 32nd AGM",
            "Summary": "Keynote Financial Services Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025, on both standalone and consolidated basis. The company scheduled its 32nd Annual General Meeting for September 26, 2025, to be conducted through video conference. The Board declared a dividend of ₹1 per equity share of ₹10 each, representing a 10% dividend. The register of members will remain closed from September 19 to September 26, 2025, for dividend payment and AGM purposes. The Board meeting was held on August 14, 2025, and lasted from 12:00 to 15:30.",
            "Sentiment": "positive",
            "PublishDate": 1755167337963,
            "Source": "corporate_action"
        }
    ]
}