{
    "Symbol": "KFINTECH",
    "ISIN": "INE138Y01010",
    "News": [
        {
            "Title": "KFin Technologies Announces Senior Management Changes",
            "Summary": "KFin Technologies Limited announces change in role for Anish Kumar as Chief Compliance Officer and appointment of Shailaja V as Chief Risk Officer & Data Protection Officer, both effective February 09, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770654842000,
            "Source": "stocks"
        },
        {
            "Title": "KFin Technologies Allots 35,287 Shares Under ESOP",
            "Summary": "KFin Technologies Limited allotted 35,287 equity shares to eligible employees under its Employee Stock Option Plan 2020, increasing paid-up share capital to Rs. 1,72,49,76,790.",
            "Sentiment": "positive",
            "PublishDate": 1770491589912,
            "Source": "co_actions_results"
        },
        {
            "Title": "KFin Technologies seeks stock exchange nod for reclassification",
            "Summary": "KFin Technologies submits application to NSE and BSE for reclassifying Capital Foods Private Limited from promoter group to public category under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770210833792,
            "Source": "stocks"
        },
        {
            "Title": "KFin Technologies CCO Manju Anand Resigns",
            "Summary": "KFin Technologies announces resignation of Ms. Manju Anand as Chief Compliance Officer and Legal Head, effective January 31, 2026, after tendering resignation in September 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769869916177,
            "Source": "stocks"
        },
        {
            "Title": "Wasatch Advisors Increases Kfin Technologies Stake",
            "Summary": "US-based Wasatch Advisors LP acquired additional 220,783 shares of Kfin Technologies through open market purchase, increasing its shareholding from 9.105% to 9.233%.",
            "Sentiment": "neutral",
            "PublishDate": 1769050887440,
            "Source": "co_actions_results"
        },
        {
            "Title": "KFin Technologies Gets Reclassification Request",
            "Summary": "Capital Foods Private Limited requests reclassification from promoter group to public category under SEBI regulations. The entity holds no shares in KFin Technologies following divestment by General Atlantic entities.",
            "Sentiment": "neutral",
            "PublishDate": 1768459534857,
            "Source": "co_actions_results"
        },
        {
            "Title": "KFin Tech Gets Promoter Group Reclassification Request",
            "Summary": "House of Anita Dongre Private Limited requests reclassification from promoter group to public category following divestment by General Atlantic entities, holding no shares in KFin Technologies.",
            "Sentiment": "neutral",
            "PublishDate": 1767864615194,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wasatch Advisors Increases Stake in KFin Technologies",
            "Summary": "US-based Wasatch Advisors LP acquired 263,663 additional shares of KFin Technologies through open market purchases on December 29, 2025, increasing its shareholding from 7.067% to 7.220%.",
            "Sentiment": "neutral",
            "PublishDate": 1767166382931,
            "Source": "co_actions_results"
        },
        {
            "Title": "KFin Technologies Allots 5,506 Shares Under ESOP",
            "Summary": "KFin Technologies allotted 5,506 equity shares under its Employee Stock Option Plan 2020, increasing paid-up share capital to ₹172.46 crores with 17.25 crore shares outstanding.",
            "Sentiment": "positive",
            "PublishDate": 1766115885560,
            "Source": "co_actions_results"
        },
        {
            "Title": "KFin Technologies Schedules US Investor Roadshows",
            "Summary": "KFin Technologies announces participation in investor non-deal roadshows across the United States from December 15-19, 2025, meeting with 18 institutional investors and funds organized by Investec.",
            "Sentiment": "neutral",
            "PublishDate": 1765475499725,
            "Source": "stocks"
        },
        {
            "Title": "KFin Technologies Seeks Shareholder Approval for Board Changes and Director Remuneration",
            "Summary": "KFin Technologies has issued a postal ballot notice seeking member approval for appointing Devang Gheewalla as Nominee Director, changing Alok Chandra Misra's designation from Nominee to Non-Executive Director with Rs. 25.50 lakh annual remuneration, and approving up to Rs. 30 lakh annual remuneration for Independent Directors. The e-voting period runs from November 19 to December 18, 2025, with results to be announced by December 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763470335453,
            "Source": "corporate_action"
        },
        {
            "Title": "KFin Technologies Allots 87,700 Equity Shares Under Employee Stock Option Plan",
            "Summary": "KFin Technologies allotted 87,700 equity shares of face value Rs. 10 each to eligible employees under its Employee Stock Option Plan 2020. The company's paid-up share capital increased from Rs. 1,72,31,33,070 comprising 17,23,13,307 shares to Rs. 1,72,40,10,070 comprising 17,24,01,007 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763054309551,
            "Source": "corporate_action"
        },
        {
            "Title": "KFin Technologies Allots 16,492 Equity Shares Under Employee Stock Option Plan",
            "Summary": "KFin Technologies Limited has allotted 16,492 equity shares with a face value of Rs. 10 each following the exercise of options by eligible grantees under the KFin Employee Stock Option Plan 2020. The allotment was approved by the Nomination and Remuneration Committee of the Board of Directors on November 6, 2025. As a result, the company's issued, subscribed, and paid-up equity share capital increased from Rs. 1,72,29,68,150 (comprising 17,22,96,815 equity shares) to Rs. 1,72,31,33,070 (comprising 17,23,13,307 equity shares).",
            "Sentiment": "neutral",
            "PublishDate": 1762487281736,
            "Source": "corporate_action"
        },
        {
            "Title": "KFintech Reports 10.3% Revenue Growth in Q2, Completes Ascent Fund Services Acquisition",
            "Summary": "KFintech delivered revenue of INR 309 crores in Q2, marking 10.3% year-on-year growth and 12.8% sequential growth. The company completed the acquisition of Singapore-based Ascent Fund Services, expanding its global footprint to 18 geographies. Domestic mutual fund business grew 10.2% while International and Other Investor Solutions increased 7.1%. The company won 4 out of 4 new mutual fund mandates launched in India and added nearly 500 clients in Issuer Solutions. EBITDA grew 7.2% year-on-year with margins at 43.9% for the quarter. The company launched IGNITE platform and IRIS product, while maintaining its position as the country's largest registrar and transfer agent. SIP book continues to hold at around 40% market share. Management expects better performance ahead with markets turning around and strong IPO pipeline through December.",
            "Sentiment": "positive",
            "PublishDate": 1762304599101,
            "Source": "earnings"
        },
        {
            "Title": "KFIN Tech Maintains EBITDA Margin Guidance at 40-45%, Expects Margin Alignment with Ascent in 3-5 Years",
            "Summary": "KFIN Tech has maintained its EBITDA margin guidance at 40-45% and expects its margins to match Ascent's margins within 3-5 years. The company's SIP book represents approximately 40% of total AUM. KFIN Tech anticipates a neutral impact from the Ascent acquisition in FY26, with EPS growth expected to begin the following year. The company projects long-term market share growth.",
            "Sentiment": "positive",
            "PublishDate": 1761709005942,
            "Source": "stock"
        },
        {
            "Title": "Kfin Technologies Projects ₹7,500 Crore Market Cap and ₹4,200 Crore Revenue by FY27",
            "Summary": "Kfin Technologies has outlined growth projections targeting a market capitalization exceeding ₹7,500 crore and revenue run rate of ₹4,200 crore by FY27. The company's strategy focuses on scaling its global fund administration business, integrating the Ascent acquisition, and maintaining its registrar and transfer agent (RTA) market share above 33 percent.",
            "Sentiment": "positive",
            "PublishDate": 1761580627968,
            "Source": "stock"
        },
        {
            "Title": "KFin Technologies Reports 20.8% Revenue Growth in Q2 FY2026 Results",
            "Summary": "KFin Technologies announced its quarterly results for the quarter ended September 30, 2025. Consolidated revenue from operations increased to ₹3,092.34 million compared to ₹2,740.58 million in the previous quarter, marking a 12.8% sequential growth. Year-over-year revenue growth was 10.2% from ₹2,804.74 million in the same quarter last year. Consolidated profit for the quarter rose to ₹933.13 million from ₹772.57 million in the previous quarter. For the half-year period, total revenue reached ₹5,832.92 million versus ₹5,180.36 million in the previous year, representing a 12.6% increase. The company operates through three main segments: Domestic mutual fund investor solutions (₹2,179.09 million revenue), Issuer solutions (₹482.75 million), and International and other investor solutions (₹430.50 million). The company maintains a provision of ₹87.18 million related to a legacy client matter involving unauthorized share transfers. KFin Technologies paid a final dividend of ₹7.50 per share and granted 250,000 employee stock options during the period.",
            "Sentiment": "positive",
            "PublishDate": 1761574631088,
            "Source": "earnings"
        },
        {
            "Title": "KFIN Tech Acquires Majority Stake in Ascent Fund Services for $35 Million",
            "Summary": "KFIN Tech has acquired a 51% controlling stake in Ascent Fund Services for $35 million. The acquisition is aimed at expanding KFIN Tech's presence in the global fund administration business.",
            "Sentiment": "positive",
            "PublishDate": 1760707104376,
            "Source": "order&deals"
        },
        {
            "Title": "KFin Technologies Completes $34.7 Million Acquisition of 51% Stake in Ascent Fund Services Singapore",
            "Summary": "KFin Technologies Limited has completed the acquisition of a 51% controlling stake in Ascent Fund Services (Singapore) Pte. Ltd. through its wholly owned subsidiary KFin Technologies (Singapore) Pte. Ltd. The transaction was completed on October 13, 2025, for USD 34,680,013.93. The acquisition involved subscribing to 763,651 ordinary shares and purchasing 4,533,030 ordinary shares from existing shareholders. KFin had previously entered into definitive agreements for this transaction on April 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760362463994,
            "Source": "order&deals"
        },
        {
            "Title": "Kfin Technologies Invests $35 Million in Singapore Subsidiary and Acquires Majority Stake in Fund Services Company",
            "Summary": "Kfin Technologies has made a $35 million investment in its subsidiary Kfin Technologies (Singapore) Pte. Ltd. Additionally, the company has acquired a 51% stake in Ascent Fund Services (Singapore) Pte. Ltd, which provides fund administration services. These transactions represent Kfin Technologies' expansion into Singapore's financial services market through both subsidiary investment and strategic acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1759909802297,
            "Source": "order&deals"
        },
        {
            "Title": "KFIN Technologies Block Trade Worth Rs. 54.50 Crores Executed on NSE",
            "Summary": "KFIN Technologies executed a block trade on the National Stock Exchange involving approximately 505,806 shares at a price of Rs. 1,077.50 per share. The total transaction value amounted to Rs. 54.50 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1759466089995,
            "Source": "order&deals"
        },
        {
            "Title": "KFin Technologies Denies General Atlantic Stake Sale Rumors",
            "Summary": "KFin Technologies has denied market rumors regarding a stake sale by General Atlantic. The company clarified that no such plans or negotiations are currently underway.",
            "Sentiment": "neutral",
            "PublishDate": 1758544278465,
            "Source": "stock"
        },
        {
            "Title": "KFin Technologies Becomes First Registrar and Transfer Agent at IFSC GIFT City",
            "Summary": "KFin Technologies Limited achieved a milestone by becoming the first Registrar and Transfer Agent at the International Financial Services Centre (IFSC), GIFT City in Gujarat, India. The company registered itself in the depository system of India International Depository IFSC Limited (IIDI). KFin Technologies also secured its first Issuer Solution mandate in GIFT City, serving as the Registrar to Offer for the upcoming IPO of XED Executive Development Limited, which plans to list on NSE IFSC Limited and India International Exchange (IFSC) Limited.",
            "Sentiment": "positive",
            "PublishDate": 1758200420129,
            "Source": "stock"
        },
        {
            "Title": "KFin Technologies Schedules Investor Roadshows in Hong Kong and Singapore",
            "Summary": "KFin Technologies will participate in investor non-deal roadshows organized by IIFL Capital from September 22-25, 2025. The company will conduct 14 one-on-one meetings with institutional investors and fund managers across Hong Kong and Singapore. Participants include North Rock Capital Management, Ghisallo Capital Management, Matthews International, Indus Capital Partners, Mirae Asset Global Investments, Capital World Investors, Viridian Asset Management, Morgan Stanley Investment Management, First State, Sixteenth Street Capital, Oxbow Capital Management, Millennium Capital Management, Schonfeld Strategic Advisors, and White Oak Capital. The company will present using the same materials made available on stock exchange and company websites on July 24, 2025. The schedule is subject to change due to exigencies.",
            "Sentiment": "neutral",
            "PublishDate": 1758130050524,
            "Source": "stock"
        },
        {
            "Title": "KFin Technologies Appoints Muralidharan Sivaramakrishnan as Senior VP and Enhances Amit Murarka's Role to CFO International Business",
            "Summary": "KFin Technologies announced two senior management changes. Muralidharan Sivaramakrishnan has been appointed as Senior Vice President - International Business, bringing over 20 years of experience in transformation programs and large-scale operations. He previously served as Managing Director at State Street from 2022 to 2025, leading middle office functions and driving AI/ML automation. Amit Murarka's role has been enhanced to Chief Financial Officer - International Business and Head of IR, M&A. Murarka, who joined KFintech in June 2021, has 17 years of experience in finance and strategy, and played a key role in the company's public listing in 2022. Both appointments are effective from September 12, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1757655989862,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kfin Technologies Settles SEBI Case for Rs 88 Lakh Over RTA Rule Violations",
            "Summary": "Kfin Technologies paid Rs 87.7 lakh to SEBI to settle allegations of violating Registrars to an Issue and Share Transfer Agents (RTA) rules. The settlement followed a SEBI inspection covering February 1 to November 30, 2023, which found the company failed to exercise due diligence while processing share dematerialisation requests. SEBI also found that Kfin failed to mark 17.98 lakh folios lacking PAN details and 17.75 lakh folios without bank account details for enhanced due diligence. After receiving a show cause notice in July 2024, Kfin filed a settlement application in August 2024. The adjudication proceedings have been disposed of, though SEBI retains the right to take further action if any misrepresentation is discovered or settlement terms are breached.",
            "Sentiment": "negative",
            "PublishDate": 1756217816529,
            "Source": "corporate_governance"
        },
        {
            "Title": "KFin Technologies Reports 15.4% Revenue Growth in Q1 FY26, Wins 3 New Mutual Fund Mandates",
            "Summary": "KFin Technologies reported revenue growth of 15.4% year-on-year in quarterly results. The domestic mutual fund business grew 17.2%, with fee-based revenue up 15.7% and value-added services revenue increasing 51%. The company won 3 out of 4 new mutual fund mandates during the quarter, including Abakkus Asset Manager, Marcellus, and Pantomath. Issuer Solutions revenue grew 25.5% with 880 new corporate clients added, bringing total roster to approximately 9,000 clients. Market share in NIFTY listed companies by market cap improved from 48% to 51%. International business grew 36% year-on-year, while AIF business expanded market share from 34% to 37%. The company launched its KRA business and signed 5 clients within weeks. EBITDA margins maintained at 41.5% and PAT grew 13.5% year-on-year. The company holds cash and cash equivalents of INR750 crores. Management expects to cross 10,000 corporate clients by year-end and anticipates continued growth momentum in subsequent quarters.",
            "Sentiment": "positive",
            "PublishDate": 1753796741904,
            "Source": "earnings"
        },
        {
            "Title": "KFIN Tech Projects 40-45% EBITDA Margins, 30-35% Growth in International Solutions",
            "Summary": "KFIN Tech expects to maintain EBITDA margins between 40-45% and targets 30-35% growth in International and Other Investor Solutions, excluding GBS. The company anticipates no further decline in mutual fund yields for FY24 after Q1, while projecting transaction volumes to grow by 20-25% in the coming years. KFIN Tech continues to forecast a 3-4% annual yield drop in its Mutual Funds Division.",
            "Sentiment": "positive",
            "PublishDate": 1753673731252,
            "Source": "stock"
        },
        {
            "Title": "KFin Technologies Sets August 22 Record Date for Final Dividend, AGM Scheduled for August 28",
            "Summary": "KFin Technologies Limited has fixed August 22, 2025 as the record date for determining shareholder eligibility for the final dividend for FY 2025. The dividend is subject to approval at the company's 8th Annual General Meeting, which will be held on August 28, 2025 at 3:00 p.m. IST through video conferencing. The Board of Directors had previously recommended the final dividend for the financial year ended March 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753371424258,
            "Source": "corporate_action"
        },
        {
            "Title": "Kfintech Reports Strong Growth with Over 35% CAGR",
            "Summary": "Kfintech's executive reported the company is maintaining growth at over 35% compound annual growth rate. The company is experiencing strong performance in domestic mutual funds and issuer solutions. New business areas including global fund administration, alternative investment funds, wealth management, pension services, and digital mobility solutions generated 29% revenue growth year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1753370335170,
            "Source": "stock"
        },
        {
            "Title": "KFin Technologies Reports Q1 FY26 Results with 772.57 Million Profit",
            "Summary": "KFin Technologies Limited announced its quarterly results for the quarter ended June 30, 2025. The company reported a consolidated profit of INR 772.57 million compared to INR 680.72 million in the same quarter last year. Revenue from operations stood at INR 2,740.58 million versus INR 2,375.62 million in the previous year quarter. The company operates through three segments: Domestic mutual fund investor solutions (INR 2,044.14 million revenue), Issuer solutions (INR 330.32 million), and International and other investor solutions (INR 366.12 million). Basic earnings per share increased to INR 4.49 from INR 3.98 in the comparable quarter. The company has recognized a provision of INR 85.71 million related to potential claims from a past client regarding unauthorized share transfers. KFin has entered into agreements to acquire a 51% stake in Ascent Fund Services for USD 34.68 million, with a path to 100% ownership over five years. The Board has proposed a dividend of INR 7.50 per share subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1753363291085,
            "Source": "earnings"
        },
        {
            "Title": "KFin Technologies: Sharp 7% Fall as 10% Equity Changes Hands",
            "Summary": "KFin Technologies shares dropped up to 7% after 1.72 crore shares (10% of total) were traded in block deals. The average price was ₹1,045 per share, totaling ₹1,800 crore. General Atlantic Singapore Fund Pte. likely sold over 10% stake at an 8.3% discount to previous close.",
            "Sentiment": "negative",
            "PublishDate": 1747109872000,
            "Source": "block_deals"
        },
        {
            "Title": "KFIN Technologies Ltd. Sees Large Block Trades on NSE",
            "Summary": "Two significant block trades of KFIN Technologies Ltd. shares occurred on the National Stock Exchange (NSE). The first trade involved approximately 8,724,259 shares at Rs. 1053.20 per share, totaling Rs. 918.84 crores. The second trade involved about 2,040,542 shares at Rs. 1046.80 per share, amounting to Rs. 213.60 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1747108046000,
            "Source": "block_details"
        },
        {
            "Title": "KFin Technologies Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade of approximately 1,589,065 shares of KFin Technologies Ltd. occurred on the National Stock Exchange (NSE) at a price of Rs. 1040.00 per share. The total value of the transaction amounted to Rs. 165.26 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1747107957000,
            "Source": "block_details"
        },
        {
            "Title": "KFin Technologies: General Atlantic to Sell 6.9% Stake in Block Deal",
            "Summary": "General Atlantic plans to sell up to 6.9% stake in KFin Technologies via block deals, worth approximately Rs 1,209.5 crore. The floor price is set at Rs 1,025 per share, an 8.3% discount to the current market price. KFin Technologies recently reported a 14.3% YoY rise in Q4 FY25 net profit and a 23.8% YoY increase in revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1747107247000,
            "Source": "block_deals"
        },
        {
            "Title": "KFin Technologies: General Atlantic to Sell ₹1,209 Crore Stake via Block Deals",
            "Summary": "General Atlantic Singapore Fund Pte plans to offload up to 6.9% stake in KFin Technologies through block deals. The sale involves 1.18 crore shares at a floor price of ₹1,025 per share, an 8.3% discount to current market price. KFin Tech recently reported a 14.3% YoY increase in Q4 net profit and 23.8% YoY rise in revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1747055468000,
            "Source": "block_deals"
        },
        {
            "Title": "General Atlantic to Sell 6.9% Stake in KFin Technologies",
            "Summary": "General Atlantic Singapore Fund Pte is reportedly planning to sell a 6.9% equity stake (1.18 crore shares) in KFin Technologies through block deals. The offer size is estimated at 1,209.5 crore rupees, with a floor price of 1,025 rupees per share. This floor price represents a discount of 8.3% compared to the current market price.",
            "Sentiment": "neutral",
            "PublishDate": 1747051861000,
            "Source": "default"
        },
        {
            "Title": "KFin Technologies: General Atlantic Plans 6% Stake Sale via Block Deals",
            "Summary": "Private equity firm General Atlantic is likely to sell around 6% stake in KFin Technologies through block deals. The sale is expected at a 5-8% discount to the previous closing price. KFin Technologies recently reported a 14.3% YoY increase in Q4 net profit to Rs 85 crore and a 23.8% YoY rise in revenue to Rs 282.7 crore. The company has recommended a final dividend of Rs 7.50 per share for FY24.",
            "Sentiment": "neutral",
            "PublishDate": 1746674666000,
            "Source": "block_deals"
        },
        {
            "Title": "General Atlantic PE to Sell 6% Stake in KFIN Tech",
            "Summary": "General Atlantic Private Equity is reportedly planning to sell approximately 6% of the total outstanding shares in KFIN Tech through block deals. The sale is expected to be priced at a 5-8% discount compared to the day's closing price, according to sources cited by CNBCTV18.",
            "Sentiment": "neutral",
            "PublishDate": 1746631720000,
            "Source": "default"
        },
        {
            "Title": "KFin Technologies: New KYC Registration Agency Launched to Streamline Financial Onboarding",
            "Summary": "KFin Technologies has launched KFIN KRA, a new KYC Registration Agency, to simplify customer onboarding in India's financial sector. The platform offers integrated KYC services, uses AI for faster processing, and provides secure connectivity to financial institutions.",
            "Sentiment": "positive",
            "PublishDate": 1746180254000,
            "Source": "normal_news"
        },
        {
            "Title": "KFin Technologies: Launches Blockchain-Backed KYC Registration Agency",
            "Summary": "KFin Technologies Limited announced the launch of KFIN KRA, a blockchain-backed KYC Registration Agency through its subsidiary. The platform aims to streamline customer onboarding processes across India's digital economy, offering integrated services and advanced authentication features.",
            "Sentiment": "positive",
            "PublishDate": 1746169316000,
            "Source": "corporate_action"
        },
        {
            "Title": "KFin Technologies: Strong FY2025 Results and Strategic Acquisition",
            "Summary": "KFin Technologies reported a 30.2% YoY revenue increase to ₹10,907.5 million and 35.2% PAT growth to ₹3,326.3 million for FY2025. The company proposed a ₹7.50 per share dividend and announced plans to acquire a 51% stake in Ascent Fund Services (Singapore) Pte. Ltd. KFin maintained a 32.4% market share in India's mutual fund industry AAUM and expanded its international presence.",
            "Sentiment": "positive",
            "PublishDate": 1745904697000,
            "Source": "result"
        },
        {
            "Title": "Kfin Technologies: Share Price Jumps 5% Following Q4 Results",
            "Summary": "Kfin Technologies' share price increased by 5% in Tuesday's trading session after announcing Q4 financial results. As of 9:40 am, the stock was trading at ₹1,299 per share on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1745899744000,
            "Source": "earnings"
        },
        {
            "Title": "Kfin Tech Reports Q4 Financial Results and Dividend",
            "Summary": "Kfin Tech announced its Q4 consolidated net profit of 851 million rupees, down from 902 million rupees in the previous quarter. Revenue for Q4 was 2.82 billion rupees, compared to 2.9 billion rupees in the previous quarter. The company has recommended a dividend of 7.5 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1745885426000,
            "Source": "default"
        },
        {
            "Title": "KFintech Reports Strong Growth in NPS Subscriber Base",
            "Summary": "KFintech announced that its National Pension System (NPS) subscriber base has grown to 1.62 million, representing a year-over-year increase of 32.4%. This growth rate significantly outpaces the industry average of 12.2% for the same period.",
            "Sentiment": "positive",
            "PublishDate": 1745852417000,
            "Source": "default"
        },
        {
            "Title": "KFin Technologies: Q4 Profit Up 14%, ₹7.50 Dividend Proposed",
            "Summary": "KFin Technologies reported a 14.3% YoY increase in Q4 FY25 consolidated net profit to ₹85 crore. Revenue rose 23.8% to ₹282.7 crore. EBITDA grew 16.9% to ₹122.2 crore, though margin slightly decreased. Board recommends ₹7.50 per share final dividend for FY24.",
            "Sentiment": "positive",
            "PublishDate": 1745848942000,
            "Source": "earnings"
        },
        {
            "Title": "KFIN Technologies Announces Dividend",
            "Summary": "KFIN Technologies has recommended a dividend of 7.5 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1745846464000,
            "Source": "result"
        },
        {
            "Title": "KFIN Tech Reports Q4 Financial Results",
            "Summary": "KFIN Tech has released its Q4 financial results. The company reported an EBIT of 1.06 billion rupees, down from 1.14 billion rupees in the previous quarter. The EBIT margin decreased to 37.32% from 39.38% quarter-over-quarter. Consolidated net profit stood at 851 million rupees, compared to 902 million rupees in the previous quarter. Revenue for Q4 was 2.82 billion rupees, down from 2.9 billion rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745846426000,
            "Source": "result"
        },
        {
            "Title": "KFin Technologies: Ambitious Growth Plans and Global Expansion",
            "Summary": "KFin Technologies aims for over 20% CAGR in profit and revenue for the next three years. The company plans global expansion, targeting 40-50% international revenue within five years. KFin currently holds a 60% share of asset management companies in India and expects to increase its AUM market share from 35% to 40%.",
            "Sentiment": "positive",
            "PublishDate": 1745459102000,
            "Source": "normal_news"
        },
        {
            "Title": "KFin Technologies: Acquires 51% Stake in Singapore's Ascent Fund Services",
            "Summary": "KFin Technologies has agreed to purchase a 51% stake in Singapore-based Ascent Fund Services for $34.7 million, with plans to achieve full ownership over five years. This acquisition aims to accelerate KFintech's entry into the global fund administration market. The company's stock price jumped over 8% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1744867087000,
            "Source": "corporate_action"
        }
    ]
}