{
    "Symbol": "KHADIM",
    "ISIN": "INE834I01025",
    "News": [
        {
            "Title": "Khadim India Q3FY26 Results: Revenue Drops 21.8% YoY",
            "Summary": "Khadim India reported Q3FY26 revenue of ₹862.37 million, down 21.8% YoY. Company posted net loss of ₹1.74 million vs profit of ₹11.68 million in Q3FY25, impacted by new labour codes.",
            "Sentiment": "negative",
            "PublishDate": 1770717911274,
            "Source": "co_actions_results"
        },
        {
            "Title": "Khadim India Reports Mixed Q2 FY26 Results with Revenue Decline and GST Implementation Benefits",
            "Summary": "Khadim India Limited reported revenue of INR 1,016 million for Q2 FY26 with gross margin of 47.1% and PAT margin of 1.7%, while successfully implementing GST cuts across its 893-store network. The company expects margin improvements in Q3 following GST reduction to 5% for footwear under INR 2,500, with distribution subsidiary KSR Footwear set to list early next week.",
            "Sentiment": "neutral",
            "PublishDate": 1763200690960,
            "Source": "earnings"
        },
        {
            "Title": "Khadim India Reports Financial Results Following Distribution Business Demerger",
            "Summary": "Khadim India Limited announced its unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. The company completed a demerger of its Distribution Business to KSR Footwear Limited (KFL) effective May 1, 2025, with an appointed date of April 1, 2025. As part of the scheme, KFL allotted 1,83,78,382 new equity shares to Khadim's shareholders on June 7, 2025. The company canceled its investment of ₹80.10 million in KFL, and KFL ceased to be a wholly-owned subsidiary from April 1, 2025. The demerged distribution business results are disclosed as discontinued operations in the financial statements. The Board of Directors approved these results at a meeting held on November 7, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762626412421,
            "Source": "earnings"
        },
        {
            "Title": "Khadim India Reports Mixed Financial Results and Appoints New Internal Auditor",
            "Summary": "Khadim India Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported revenue from operations of Rs. 1,015.99 million for the quarter, compared to Rs. 1,973.03 million in the corresponding quarter of the previous year. For the six-month period, revenue stood at Rs. 2,139.94 million versus Rs. 4,100.33 million in the previous year. The company showed a profit from continuing operations with basic earnings per share of Rs. 0.51 for the quarter. Additionally, the Board approved the appointment of Mr. Avijit Mukherjee as Internal Auditor, effective November 7, 2025. Mr. Mukherjee is a Chartered Accountant with 21 years of experience and has been associated with Khadim India Limited for the last 15 years in various capacities within the Accounts and Internal Audit departments.",
            "Sentiment": "neutral",
            "PublishDate": 1762530159003,
            "Source": "earnings"
        },
        {
            "Title": "Khadim India Reports Muted Q1 Performance with 0.9% PAT Margin Amid Soft Demand Environment",
            "Summary": "Khadim India Limited reported quarterly results with revenue from operations of Rs. 957 million and profit after tax of Rs. 8.6 million, representing a PAT margin of 0.9%. The company's gross margin stood at 47.7% while EBITDA margin was 12.9%. Performance was impacted by muted demand due to unpredictable weather and global factors affecting consumer sentiment, particularly in Tier 2 and Tier 3 cities. The company faced margin pressure from increased promotional discounting, with discount sales rising from 18% to 33% year-over-year. Khadim entered a strategic partnership with Skechers and launched a new athleisure segment. The company operates 884 stores including 207 company-owned and 677 franchisee outlets. E-commerce contributed 1.34% of total revenue. Management expressed optimism about the upcoming festive season and plans to focus on scaling sub-brands British Walkers and Sharon while expanding through the True Franchised Model.",
            "Sentiment": "neutral",
            "PublishDate": 1756219302005,
            "Source": "earnings"
        },
        {
            "Title": "Khadim India Focuses on Premiumisation and Expansion Strategy",
            "Summary": "Khadim India is pursuing a growth strategy centered on premiumisation and geographic expansion into southern and western markets. The company has partnered with Skechers and operates through an asset-light franchise model. With over 884 stores and pan-India presence, the company aims to capture 85% of the footwear market potential. A demerger is planned as part of the next growth phase.",
            "Sentiment": "positive",
            "PublishDate": 1755562376036,
            "Source": "stock"
        },
        {
            "Title": "Khadim India Reports 8.1% Revenue Decline and 81.7% Profit Drop in Q1 Results",
            "Summary": "Khadim India Limited reported revenue of Rs 957 million in Q1, down 8.1% from Rs 1,041 million in the previous year. The footwear retailer's profit after tax fell 81.7% to Rs 8.6 million from Rs 47.1 million. Gross margin contracted to 47.7% from 54.5%, while EBITDA margin declined to 12.9% from 16.8%. The company attributed the revenue decline primarily to lower franchise sales and margin pressure from promotional discounts offered during the quarter. Khadim operates 884 stores across 24 states and 4 union territories, maintaining its position as India's second largest footwear retailer with the largest presence in East India. The company completed the demerger of its distribution and manufacturing segments into KSR Footwear Limited and entered a strategic partnership with Skechers to sell their products in select Khadim stores.",
            "Sentiment": "negative",
            "PublishDate": 1755524561293,
            "Source": "earnings"
        },
        {
            "Title": "Khadim India Reports Quarterly Results and Changes Registered Office Address",
            "Summary": "Khadim India Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs. 957.04 million and profit from continuing operations of Rs. 8.62 million for the quarter. The company also announced a change in its registered office address from DLF IT Park to RDB Primarc TechPark, both located in New Town, Kolkata, effective August 12, 2025. The results include discontinued operations showing a loss of Rs. 45.29 million. The company operates primarily in the footwear and accessories segment and has a foreign subsidiary, Khadim Shoe Bangladesh Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1754992672914,
            "Source": "earnings"
        },
        {
            "Title": "Khadim India Provides Guidance on Cost Allocation for Demerger",
            "Summary": "Khadim India has offered guidance regarding the cost allocation related to its acquisition due to a demerger with KSR Footwear Ltd. The company is providing information to stakeholders about how costs will be distributed or accounted for in this corporate restructuring process.",
            "Sentiment": "neutral",
            "PublishDate": 1750686665000,
            "Source": "default"
        },
        {
            "Title": "Khadim India Reports Q4 Financial Results",
            "Summary": "Khadim India has reported its latest quarterly financial results. The company's net profit for Q4 was 9 million rupees, compared to 10.5 million rupees in the same quarter last year. Revenue for Q4 stood at 938 million rupees, slightly up from 935 million rupees in the year-ago period.",
            "Sentiment": "neutral",
            "PublishDate": 1747732932000,
            "Source": "result"
        },
        {
            "Title": "NCLT Sanctions Scheme of Arrangement Between Khadim India and KSR Footwear",
            "Summary": "Khadim India has announced that the National Company Law Tribunal (NCLT) has sanctioned a scheme of arrangement between Khadim India and KSR Footwear. This legal approval suggests a significant corporate restructuring or merger between the two entities in the footwear industry.",
            "Sentiment": "positive",
            "PublishDate": 1745244142000,
            "Source": "default"
        },
        {
            "Title": "NCLT Kolkata Approves Scheme of Arrangement for Khadim India",
            "Summary": "Khadim India has announced that the National Company Law Tribunal (NCLT) Kolkata has sanctioned a scheme of arrangement between the company and KSR Footwear. This approval suggests a significant corporate restructuring or reorganization involving Khadim India and its subsidiary or related entity, KSR Footwear.",
            "Sentiment": "positive",
            "PublishDate": 1743172944000,
            "Source": "corporate_action"
        },
        {
            "Title": "Khadim India Ltd: Demerger of Distribution Business Expected by March 2025",
            "Summary": "Khadim India Ltd. plans to complete the demerger of its distribution business by March 2025, with listing of the new entity KSR Footwear Ltd. expected by May. The company anticipates margin expansion of 100-200 basis points in FY 2025-26. Khadim is exploring quick commerce partnerships and plans to launch an athleisure segment. Q3 FY2025 revenue grew 2.5% YoY to Rs 160.2 crore.",
            "Sentiment": "positive",
            "PublishDate": 1739781479000,
            "Source": "corporate_action"
        },
        {
            "Title": "Khadim India Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Khadim India's third-quarter EBITDA decreased to 148 million rupees from 182 million rupees year-over-year. The company's EBITDA margin also fell to 9.24% from 11.65% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739265610000,
            "Source": "earnings"
        },
        {
            "Title": "Khadim India Reports Q3 Financial Results",
            "Summary": "Khadim India announced its third-quarter financial results. The company reported a net profit of 12 million rupees, down from 18 million rupees in the same quarter last year. However, revenue increased to 1.6 billion rupees from 1.5 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739265484000,
            "Source": "earnings"
        }
    ]
}