{
    "Symbol": "KHAICHEM",
    "ISIN": "INE745B01028",
    "News": [
        {
            "Title": "Khaitan Chemicals Reports Strong Q3FY26 Results",
            "Summary": "Khaitan Chemicals & Fertilizers posted ₹2,043.96 lakhs net profit for Q3FY26, marking significant improvement from ₹1,255.16 lakhs in Q3FY25. Revenue grew 33.7% YoY to ₹26,573.29 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1769000617392,
            "Source": "co_actions_results"
        },
        {
            "Title": "Khaitan Chemicals Appoints Independent Director",
            "Summary": "Khaitan Chemicals and Fertilizers Limited shareholders approve appointment of Mr. Suman Jyoti Khaitan as Independent Director for five-year term during members meeting held on January 12, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768212012123,
            "Source": "stocks"
        },
        {
            "Title": "Khaitan Chemicals and Fertilizers Reconstitutes Stakeholders Relationship Committee",
            "Summary": "Khaitan Chemicals and Fertilizers Limited's Board of Directors approved the reconstitution of its Stakeholders Relationship Committee on November 20, 2025, adding an Executive Director to strengthen oversight and governance. The reconstituted committee includes Mr. Deepak Kumar Khemka as Non-Executive Independent Director, Ms. Payal Gupta as Non-Executive Independent Women Director, and Mr. Praveen Uniyal as Whole Time Director.",
            "Sentiment": "positive",
            "PublishDate": 1763632143415,
            "Source": "corporate_governance"
        },
        {
            "Title": "Khaitan Chemicals Promoter Increases Stake to 72.64% Through Open Market Purchase",
            "Summary": "The Majestic Packaging Co Pvt. Ltd., a promoter of Khaitan Chemicals and Fertilizers Limited, purchased 60,000 equity shares through open market transactions on stock exchanges on November 4, 2025. Following this acquisition, the aggregate shareholding of the promoter/promoter group in the company has increased to 72.64% of the current issued capital. The company has informed both BSE and NSE about this change in promoter shareholding.",
            "Sentiment": "positive",
            "PublishDate": 1762240627586,
            "Source": "corporate_action"
        },
        {
            "Title": "Khaitan Chemicals Reports 34% Revenue Growth in Q2 FY26 with Strong Fertilizer Demand",
            "Summary": "Khaitan Chemicals and Fertilizers Limited reported operational revenue of INR 3,086 million for Q2 FY26, marking a 34% year-on-year increase. For the first half of FY26, revenue reached INR 5,429 million, up 51% compared to the previous year. The company achieved EBITDA of INR 310 million with a 10.05% margin for the quarter, and INR 628 million with 11.57% margin for the half-year. Net profit stood at INR 215 million for Q2 and INR 429 million for H1 FY26. The fertilizer segment contributed 84% to total revenue while chemicals accounted for 16%. Fertilizer volumes increased 11% to 2.58 lakh MT in the first half, driven by strong demand for Single Super Phosphate (SSP) products. The company operates six manufacturing plants across multiple states and holds approximately 10% market share in India's SSP market through its Khaitan and Utsav brands.",
            "Sentiment": "positive",
            "PublishDate": 1761897987259,
            "Source": "earnings"
        },
        {
            "Title": "Khaitan Chemicals & Fertilizers Reports Strong Q2 Turnaround with 215M Rupees Net Profit",
            "Summary": "Khaitan Chemicals & Fertilizers delivered a significant turnaround in Q2 performance, reporting a net profit of 215 million rupees compared to a loss of 31 million rupees in the same period last year. The company's revenue grew to 3.1 billion rupees from 2.3 billion rupees year-over-year. EBITDA increased substantially to 311 million rupees from 86 million rupees, while EBITDA margin expanded to 10.08% from 3.73% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761727152920,
            "Source": "earnings"
        },
        {
            "Title": "Khaitan Chemicals & Fertilizers Promoter Group Shareholding Increases to 67.42%",
            "Summary": "The Majestic Packaging Co Pvt. Ltd., a promoter of Khaitan Chemicals & Fertilizers Limited, purchased 2,500 equity shares through the open market on September 17, 2025. This acquisition increased the aggregate promoter group shareholding to 67.42% of the company's issued capital.",
            "Sentiment": "neutral",
            "PublishDate": 1758182697680,
            "Source": "corporate_action"
        },
        {
            "Title": "The Majestic Packaging Co. Increases Stake in Khaitan Chemicals and Fertilizers Limited",
            "Summary": "The Majestic Packaging Co. Pvt Ltd acquired 11,500 additional shares in Khaitan Chemicals and Fertilizers Limited through open market transactions. The acquisition increased their shareholding from 2,20,65,510 shares (22.75%) to 2,20,77,010 shares (22.76%). The Majestic Packaging Co. belongs to the promoter/promoter group of Khaitan Chemicals and Fertilizers Limited. The target company's equity share capital remains at Rs. 9,69,89,200 comprising 9,69,89,200 equity shares of Re. 1 each. The shares are listed on NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1756986713392,
            "Source": "corporate_action"
        },
        {
            "Title": "Khaitan Chemicals Reports Strong Q1 FY26 Results with 13.53% EBITDA Margin Recovery",
            "Summary": "Khaitan Chemicals & Fertilizers Limited, India's second-largest SSP producer with 10% market share, reported significant improvement in quarterly results. The company achieved operational revenue of INR 2,343 million with EBITDA of INR 317 million (13.53% margin) and PAT of INR 214 million (9.13% margin). This marks a strong recovery from FY24 losses of INR 705 million. The company operates 6 manufacturing plants with 11.1 LMT SSP capacity across 19 states through 6,500+ dealers. Revenue breakdown shows 79% from fertilizers and 21% from chemicals. The company plans to focus on debottlenecking existing infrastructure, launching innovative products like Urea-SSP, and expanding into untapped geographies while maintaining financial discipline to strengthen its balance sheet.",
            "Sentiment": "positive",
            "PublishDate": 1756381458881,
            "Source": "earnings"
        },
        {
            "Title": "Majestic Packaging Increases Stake in Khaitan Chemicals & Fertilizers to 22.75%",
            "Summary": "Majestic Packaging, a promoter of Khaitan Chemicals & Fertilizers, has increased its stake in the company to 22.75%.",
            "Sentiment": "positive",
            "PublishDate": 1756209724463,
            "Source": "stock"
        },
        {
            "Title": "Khaitan Chemicals & Fertilizers Reports Strong Q1 Turnaround with 214M Rupees Net Profit",
            "Summary": "Khaitan Chemicals & Fertilizers delivered a significant turnaround in Q1 performance, reporting a net profit of 214 million rupees compared to a loss of 167 million rupees in the same period last year. The company's revenue grew substantially to 2.34 billion rupees from 1.3 billion rupees year-over-year. EBITDA improved dramatically to 317 million rupees versus a loss of 69 million rupees in the previous year, with EBITDA margin expanding to 13.53% from negative 5.28% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1753277327129,
            "Source": "earnings"
        },
        {
            "Title": "Khaitan Chemicals Approves Quarterly Results and Acquires 26% Stake in Solar Power Company",
            "Summary": "Khaitan Chemicals and Fertilizers Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company also approved acquisition of a 26% equity stake in KRSKA Solar Private Limited for ₹37.93 lakh through subscription of 1,333 equity shares and 3,77,989 OCRPS. KRSKA Solar operates a grid-connected solar power plant in Madhya Pradesh and was incorporated in 2022. The acquisition aims to enable Khaitan Chemicals to procure renewable power through group captive mechanism, reduce dependency on grid power, optimize energy costs, and reduce carbon footprint. Khaitan Chemicals will consume 85% of the power generated. The solar power supply is expected to commence within 2-3 months from equity infusion completion.",
            "Sentiment": "positive",
            "PublishDate": 1753277179515,
            "Source": "stock"
        },
        {
            "Title": "Khaitan Chemicals Approves Quarterly Results and Acquires 26% Stake in Solar Power Company",
            "Summary": "Khaitan Chemicals and Fertilizers Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company also approved acquiring a 26% equity stake in KRSKA Solar Private Limited for ₹37.93 lakh through subscription of 1,333 equity shares and 3,77,989 OCRPS. The acquisition aims to enable renewable power procurement through group captive mechanism, reduce grid power dependency, optimize energy costs, and lower carbon footprint. KRSKA Solar operates a grid-connected solar power plant in Madhya Pradesh and will supply 85% of generated power to Khaitan Chemicals. The solar power supply is expected to commence within 2-3 months of equity infusion completion.",
            "Sentiment": "positive",
            "PublishDate": 1753276214993,
            "Source": "corporate_action"
        },
        {
            "Title": "Khaitan Chemicals And Fertilizers Approves 26% Stake Purchase in Krska Solar",
            "Summary": "Khaitan Chemicals And Fertilizers has approved the purchase of a 26% shareholding in Krska Solar. This acquisition represents the company's entry into the solar energy sector through a minority stake investment.",
            "Sentiment": "positive",
            "PublishDate": 1753275724074,
            "Source": "order&deals"
        },
        {
            "Title": "Khaitan Chemicals And Fertilizers to Meet with Dymon Asia Capital Investors",
            "Summary": "Khaitan Chemicals And Fertilizers has announced that it will engage with investors and analysts from Dymon Asia Capital on July 14. This meeting suggests the company is actively communicating with potential investors and financial analysts, which is a common practice for publicly traded companies to maintain transparency and investor relations.",
            "Sentiment": "neutral",
            "PublishDate": 1752063484000,
            "Source": "default"
        },
        {
            "Title": "Khaitan Chemicals & Fertilizers Reports Q4 Profit Turnaround",
            "Summary": "Khaitan Chemicals & Fertilizers has reported a net profit of 86 million rupees in Q4, compared to a loss of 374 million rupees in the same quarter last year. The company's revenue increased significantly to 1.61 billion rupees from 508 million rupees year-over-year. The profit before tax (PBT) was 10 million rupees, reversing the previous year's loss of 394 million rupees. The company also reported a deferred tax of 76 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1745453475000,
            "Source": "default"
        },
        {
            "Title": "Khaitan Chemicals & Fertilizers Reports Profit in Q4 FY2023",
            "Summary": "Khaitan Chemicals & Fertilizers has reported a net profit of 86 million rupees in Q4, compared to a loss of 374 million rupees in the same quarter last year. The company's revenue increased significantly to 1.61 billion rupees, up from 508 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745418905000,
            "Source": "result"
        },
        {
            "Title": "Khaitan Chemicals & Fertilizers: Q3 Profit Soars to ₹12.55 Crore, Revenue Up 56%",
            "Summary": "Khaitan Chemicals & Fertilizers reported Q3 FY25 results with a profit of ₹12.55 crore, reversing last year's loss. Revenue increased by 56.02% YoY to ₹198.76 crore. EPS rose to ₹1.29, up 146.4% YoY. Operating income grew 145.45% YoY despite a 13.83% QoQ revenue decline.",
            "Sentiment": "positive",
            "PublishDate": 1737178548000,
            "Source": "earnings"
        },
        {
            "Title": "Khaitan Chemicals & Fertilizers Reports Profit in Q3",
            "Summary": "Khaitan Chemicals & Fertilizers has reported a significant turnaround in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) improved to 107.6 million rupees, compared to a loss of 147 million rupees in the same quarter of the previous year. The EBITDA margin for Q3 stood at 5.41%.",
            "Sentiment": "positive",
            "PublishDate": 1737019359000,
            "Source": "earnings"
        },
        {
            "Title": "Khaitan Chemicals & Fertilizers Reports Significant Revenue Growth in Q3",
            "Summary": "Khaitan Chemicals & Fertilizers has announced its financial results for the third quarter. The company reported a revenue of 2 billion rupees, compared to 1.27 billion rupees in the same quarter of the previous year. This represents a substantial year-over-year increase in revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1737019305000,
            "Source": "earnings"
        },
        {
            "Title": "Khaitan Chemicals & Fertilizers Reports Profit in Q3",
            "Summary": "Khaitan Chemicals & Fertilizers has reported a net profit of 126 million rupees in the third quarter, marking a significant turnaround from a loss of 270 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1737019277000,
            "Source": "earnings"
        },
        {
            "Title": "Khaitan Chemicals & Fertilizers Reports Decline in Q2 EBITDA",
            "Summary": "Khaitan Chemicals & Fertilizers experienced a decrease in its Q2 EBITDA, which fell to 86 million rupees from 105 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 3.73% from 5.42% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731598182000,
            "Source": "result"
        },
        {
            "Title": "Khaitan Chemicals & Fertilizers Reports Q2 Net Loss",
            "Summary": "Khaitan Chemicals & Fertilizers reported a net loss of 31 million rupees in Q2, compared to a loss of 1.1 million rupees in the same quarter last year. The loss increased significantly from the previous quarter, where it stood at 167 million rupees. Despite the increased loss, the company's revenue grew to 2.3 billion rupees, up from 1.9 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731598118000,
            "Source": "result"
        }
    ]
}