{
    "Symbol": "KHAITANLTD",
    "ISIN": "INE731C01018",
    "News": [
        {
            "Title": "Khaitan India Q3FY26 Revenue Jumps 50% to ₹2,682.89 Lakhs",
            "Summary": "Khaitan (India) Limited reported strong Q3FY26 results with revenue rising 50% YoY to ₹2,682.89 lakhs and net profit increasing 61% to ₹123.59 lakhs, driven by robust electrical goods segment performance.",
            "Sentiment": "positive",
            "PublishDate": 1769693400039,
            "Source": "co_actions_results"
        },
        {
            "Title": "Khaitan Chemical Q3 Net Profit Surges 62% YoY",
            "Summary": "Khaitan Chemical reports strong Q3 performance with net profit rising to ₹204 million from ₹126 million YoY, while revenue grows 32.5% to ₹2.65 billion and EBITDA margin expands significantly.",
            "Sentiment": "positive",
            "PublishDate": 1769041242878,
            "Source": "co_actions_results"
        },
        {
            "Title": "Khaitan (India) Limited Incorporates Two Wholly-Owned Subsidiaries",
            "Summary": "Khaitan (India) Limited's Board approved the incorporation of two wholly-owned subsidiaries - Khaitan Strategy Limited and Khaitan Fans and Appliances Limited, each with authorized share capital of Rs 15 lakh. The newly incorporated subsidiaries will operate under 100% ownership of the parent company, with capital investment amounts to be decided by the Board.",
            "Sentiment": "negative",
            "PublishDate": 1763135074926,
            "Source": "earnings"
        },
        {
            "Title": "Radico Khaitan Completes Rampur Jugalbandi Whisky Series with Final Two Limited Editions",
            "Summary": "Radico Khaitan launched the final two editions of its Rampur Jugalbandi series at the TFWA World Exhibition in Cannes. The release of Rampur Jugalbandi #7 and #8 completes the eight-part limited-edition Indian Single Malt collection that began in 2022. Jugalbandi #7 features ex-bourbon and Mizunara casks with tropical fruits, vanilla, and sandalwood notes, while #8 combines ex-bourbon and sherry PX casks delivering dried fruits, dark chocolate, and warm spices flavors. The series has been released incrementally with two expressions launched each year since 2022. All whiskies are produced at Rampur Distillery in Uttar Pradesh. Both expressions will be available in select international markets and global travel retail from November 2025. Radico Khaitan operates distilleries in Rampur, Sitapur, and Aurangabad, and exports to over 100 countries. The company's shares were trading at ₹2,899.50, up by ₹16.70 or 0.58% on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1759131032876,
            "Source": "stock"
        },
        {
            "Title": "Khaitan (India) Limited Appoints Two New Independent Directors and Re-appoints Whole-time Director",
            "Summary": "Khaitan (India) Limited shareholders approved key board appointments at their 88th Annual General Meeting held on September 25, 2025. The company regularized the appointment of two new Independent Directors: Ms. Pooja Kalanouria, a qualified Company Secretary with over 5 years of experience in compliance and governance, and Ms. Ayushi Khaitan, a Company Secretary and Commerce postgraduate with over 8 years of corporate governance experience. Both directors will serve 5-year terms starting October 1, 2025. Additionally, Mr. Sunay Krishna Khaitan was re-appointed as Whole-time Director for a 3-year term from the same date. Mr. Khaitan has been with the company as Executive Director since November 2016 and brings nearly 15 years of experience in marketing fans and electrical appliances. All three directors are stated to be unrelated to other company directors.",
            "Sentiment": "positive",
            "PublishDate": 1758902714048,
            "Source": "corporate_governance"
        },
        {
            "Title": "Radico Khaitan Shares Rise 2.17% on Luxury Vodka Launch and Jefferies Buy Rating",
            "Summary": "Radico Khaitan shares gained 2.17% to ₹2,933.30 following the launch of luxury vodka 'The Spirit of Kashmyr' in Maharashtra and Goa markets and a bullish initiation by Jefferies. The stock opened at ₹2,904 against previous close of ₹2,870.90, reaching an intraday high of ₹2,947. Trading volumes reached 1.10 lakh shares worth ₹32.31 crore. Jefferies initiated coverage with a 'Buy' rating and ₹3,500 target price, representing 19% upside, naming Radico as its top pick among spirits companies with projected over 35% earnings per share compound annual growth rate. The brokerage also initiated 'Buy' ratings on United Spirits (target ₹1,570) and Allied Blenders (target ₹620). Radico launched The Spirit of Kashmyr, India's first homegrown luxury vodka, priced between ₹2,800-4,000, which won 'Best Luxury Vodka' award within a month of its Uttar Pradesh launch. Jefferies expects double-digit revenue growth and margin expansion in the spirits category but cautioned about regulatory risks in key states and potential commodity inflation in ethanol and glass packaging.",
            "Sentiment": "positive",
            "PublishDate": 1757916144959,
            "Source": "stock"
        },
        {
            "Title": "Radico Khaitan Acquires 47.5% Stake in Shah Rukh Khan's D'Yavol Alcohol Brand",
            "Summary": "Radico Khaitan Ltd. acquired a 47.5% equity stake in D'Yavol, an alcohol brand co-founded by Shah Rukh Khan and Aryan Khan, along with Zerodha's Nikhil Kamath. The acquisition connects Radico Khaitan's Abhishek Khaitan with the celebrity-backed venture. Shah Rukh Khan stated they are building something bold and future-facing, while Nikhil Kamath emphasized that D'Yavol is an Indian brand with global competitive ambitions. This investment reflects a growing trend of celebrities entering the alcohol business, with other Indian personalities like Rana Daggubati, Danny Denzongpa, Sanjay Dutt, and Yuvraj Singh backing various alcohol brands. The trend mirrors international celebrity involvement in the liquor industry, including brands by Kendall Jenner, Ryan Reynolds, George Clooney, and Dwayne Johnson.",
            "Sentiment": "positive",
            "PublishDate": 1755103041838,
            "Source": "stock"
        },
        {
            "Title": "Madanlal Jawanmalji Jain Acquires 1.17% Stake in Khaitan (India)",
            "Summary": "Investor Madanlal Jawanmalji Jain has emerged as a significant shareholder in Khaitan (India), holding a 1.17% stake in the company during the third quarter. The company's net worth is reported to be 1,132.8 crore rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1736985870000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Investor Madanlal Jawanmalji Jain Acquires 1.17% Stake in Khaitan (India)",
            "Summary": "Investor Madanlal Jawanmalji Jain has been reported to hold a 1.17% stake in Khaitan (India) during the third quarter. The company's net worth is stated to be 1,132.8 crore rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1736935504000,
            "Source": "corporate_governance"
        }
    ]
}