{
    "Symbol": "KHANDSE",
    "ISIN": "INE060B01014",
    "News": [
        {
            "Title": "Khandwala Securities Board Meet on Feb 12, 2026",
            "Summary": "Khandwala Securities Limited has scheduled a board meeting for February 12, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770210329241,
            "Source": "co_actions_results"
        },
        {
            "Title": "Khandwala Securities Appoints Mrs. Suzan Vakil as Independent Director Through Postal Ballot",
            "Summary": "Khandwala Securities Limited successfully passed a special resolution appointing Mrs. Suzan Vakil (DIN: 11289012) as an Independent Director through remote e-voting postal ballot process that concluded on December 8, 2025. The resolution received overwhelming shareholder approval with 99.99% of valid votes cast in favor, with 139 shareholders participating and casting 9,410,710 total valid votes.",
            "Sentiment": "positive",
            "PublishDate": 1765269460960,
            "Source": "corporate_action"
        },
        {
            "Title": "Khandwala Securities Reports Net Loss in Q2 FY2026 Results",
            "Summary": "Khandwala Securities Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The company reported a standalone net loss of Rs 24.33 lakhs for the quarter compared to a profit of Rs 15.50 lakhs in the same quarter last year. For the half year period, the standalone net loss was Rs 58.67 lakhs versus a profit of Rs 22.51 lakhs in the previous year. On a consolidated basis, the company posted a net loss of Rs 24.37 lakhs for the quarter against a profit of Rs 9.21 lakhs in the corresponding quarter of the previous year. The consolidated half-yearly net loss stood at Rs 58.69 lakhs compared to a profit of Rs 22.51 lakhs last year. The Board of Directors approved these unaudited financial results at their meeting held on November 10, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762762388540,
            "Source": "earnings"
        },
        {
            "Title": "Khandwala Securities Seeks Shareholder Approval for Independent Director Appointment via Postal Ballot",
            "Summary": "Khandwala Securities Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mrs. Suzan Vakil as an Independent Director. Mrs. Vakil was appointed as Additional Director on September 11, 2025, for a five-year term ending September 10, 2030. She holds degrees in Legislative Law and Commerce, with over 15 years of experience as an Advocate and 9 years as a Solicitor, specializing in power, renewable energy, infrastructure and commercial disputes. The remote e-voting period runs from November 9, 2025 (9:00 AM) to December 8, 2025 (5:00 PM), with results to be announced within two working days. The company has engaged NSDL for e-voting services and appointed Mr. Bhuwnesh Bansal as scrutinizer for the postal ballot process.",
            "Sentiment": "neutral",
            "PublishDate": 1762540927191,
            "Source": "corporate_action"
        },
        {
            "Title": "Khandwala Securities Appoints Mrs. Suzan Vakil as Independent Director for Five Years",
            "Summary": "Khandwala Securities Limited appointed Mrs. Suzan Vakil as an Additional Director (Non-Executive, Independent) for a five-year term from September 11, 2025 to September 10, 2030. The appointment is subject to shareholder approval and was recommended by the Nomination and Remuneration Committee. Mrs. Vakil holds LLB and B.Com degrees, became a solicitor from Bombay Incorporated Law Society in 2016, and has over 15 years of experience as an Advocate and 9 years as a Solicitor, specializing in power, renewable energy, infrastructure and commercial disputes. The company reconstituted its board committees with Mrs. Vakil serving as Chairman of the Nomination and Remuneration Committee and as a member of the Audit Committee and Stakeholders Relationship Committee. She is not related to any other directors and is not debarred from holding directorship.",
            "Sentiment": "positive",
            "PublishDate": 1757593631320,
            "Source": "corporate_governance"
        },
        {
            "Title": "Khandwala Securities Reports Loss and Appoints New Statutory Auditors",
            "Summary": "Khandwala Securities Limited reported a net loss of Rs 58.58 lakhs for the quarter ended June 30, 2025, compared to a profit of Rs 47.83 lakhs in the same quarter last year. Revenue from operations declined to Rs 114.20 lakhs from Rs 252.06 lakhs year-on-year. The company's Board approved the appointment of M/s. Pravesh Agarwal & Associates as new statutory auditors for a five-year term, replacing M/s. Aniket Kulkarni & Associates whose term concludes at the upcoming Annual General Meeting. The new auditors will serve from the 32nd AGM until the 37th AGM in 2030, subject to shareholder approval. Earnings per share stood at negative Rs 0.38 compared to positive Rs 0.31 in the previous year quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754998650789,
            "Source": "earnings"
        }
    ]
}