{
    "Symbol": "KICL",
    "ISIN": "INE029L01018",
    "News": [
        {
            "Title": "Kalyani Investment Company Appoints Anurag Jain as CEO and CFO",
            "Summary": "Kalyani Investment Company Limited's Board of Directors approved the appointment of Mr. Anurag Jain as both Chief Executive Officer and Chief Financial Officer effective November 14, 2025. The appointment affects the company's leadership structure, with Jain bringing over 11 years of progressive experience in finance, accounting, and business performance management as a Chartered Accountant.",
            "Sentiment": "positive",
            "PublishDate": 1763117688449,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kalyani Investment Company Reports ₹309.89 Million Standalone Profit Despite Market Volatility",
            "Summary": "Kalyani Investment Company posted standalone profit after tax of ₹309.89 million for the quarter ended September 30, 2025, with dividend income of ₹410.81 million, though consolidated earnings per share declined to ₹43.36 from ₹88.13 in the previous year. The investment company faced challenges from its associate Hikal Limited, which reversed ₹807 million in revenue due to incomplete performance obligations and ongoing environmental compliance issues under Supreme Court proceedings.",
            "Sentiment": "negative",
            "PublishDate": 1763115534183,
            "Source": "earnings"
        },
        {
            "Title": "Shekhar Bhivpathaki Steps Down from CEO and CFO Roles at Kalyani Investment Company",
            "Summary": "Shekhar Bhivpathaki has resigned from his positions as Chief Executive Officer and Chief Financial Officer at Kalyani Investment Company.",
            "Sentiment": "negative",
            "PublishDate": 1761736277230,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kalyani Investment Company Announces Special Call Auction for October 29, 2025",
            "Summary": "Kalyani Investment Company Limited has notified its members about a Special Call Auction scheduled for October 29, 2025, on NSE and BSE. The company has been identified as an eligible Investment Holding Company for this special auction process, which is being conducted for price discovery of the company's equity shares. The auction follows circulars issued by NSE and BSE on October 15, 2025, and is pursuant to SEBI regulations for Investment Holding Companies.",
            "Sentiment": "neutral",
            "PublishDate": 1760695458602,
            "Source": "corporate_action"
        },
        {
            "Title": "Kalyani Investment Company Responds to IIAS Advisory Against Amit Kalyani's Hikal Board Appointment",
            "Summary": "Kalyani Investment Company Limited has submitted a response to Institutional Investors Advisory Services (IIAS) regarding the proposed appointment of Mr. Amit Kalyani as a non-executive director of Hikal Limited at its annual general meeting on September 23, 2025. IIAS advised shareholders to vote against the resolution, citing concerns over a dispute between two promoter groups regarding a 1994 family arrangement. Kalyani Investment, which owns 31.36% shareholding in Hikal, argued that IIAS supported similar reappointment in September 2023 despite the same dispute being pending. The company clarified that Amit Kalyani is not a signatory to the family arrangement and has been made a party solely in his capacity as Chairman of investment companies. Meanwhile, Stakeholders Empowerment Services (SES) has recommended voting in favor of Amit Kalyani's appointment, stating no governance concerns were identified. The Pune sessions court order directing reinvestigation into a 2017 suicide case involving Amit Kalyani has been stayed by the Bombay High Court.",
            "Sentiment": "neutral",
            "PublishDate": 1758515497720,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kalyani Investment Company Re-appoints Amit B. Kalyani as Director, Names New Secretarial Auditors",
            "Summary": "Kalyani Investment Company Limited shareholders approved key appointments at their 16th Annual General Meeting held on September 17, 2025. The company re-appointed Mr. Amit B. Kalyani (DIN 00089430) as a Director liable to retire by rotation. Amit Kalyani serves as Vice-Chairman and Joint Managing Director of Bharat Forge Limited and is married to Mrs. Deeksha A. Kalyani, who is also a Director of the company. Additionally, shareholders appointed M/s SVD & Associates as Secretarial Auditors for a five-year term, effective from the conclusion of the 16th Annual General Meeting until the 21st Annual General Meeting in 2030. SVD & Associates is a Pune-based firm with three decades of experience in corporate compliance and governance, holding Firm Unique Code P2013MH031900 and Peer Review No.6357/2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758113121360,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kalyani Investment Company Reports 20% Revenue Growth But 30% Profit Decline in Q1 Results",
            "Summary": "Kalyani Investment Company Limited announced its Q1 FY2026 results with total income rising to ₹57.82 crore from ₹48.08 crore year-over-year. However, profit after tax declined significantly to ₹20.76 crore from ₹29.69 crore in the same period last year. Earnings per share dropped to ₹4.76 from ₹6.80. The revenue growth was primarily driven by higher interest income from fixed deposits, which increased to ₹46.39 crore from ₹34.38 crore. Despite the revenue increase, total expenses surged dramatically to ₹27.92 crore from ₹7.91 crore, mainly due to other expenses rising to ₹26.73 crore from ₹6.50 crore. The company operates as an investment holding company earning income through dividends, interest and gains on investments in group companies. Net gain on fair value changes decreased to ₹11.43 crore from ₹13.70 crore. The consolidated results include a negative ₹7.12 crore share from associate company Hikal Limited. Auditors noted ongoing investigations related to alleged environmental law non-compliance at the associate company.",
            "Sentiment": "negative",
            "PublishDate": 1754894287573,
            "Source": "earnings"
        },
        {
            "Title": "Kalyani Investment Reports Q4 Revenue Increase",
            "Summary": "Kalyani Investment has reported a quarterly revenue of 214 rupees, compared to 203 million rupees in the same quarter of the previous year. This represents a year-over-year increase in revenue.",
            "Sentiment": "positive",
            "PublishDate": 1748341466000,
            "Source": "result"
        },
        {
            "Title": "Kalyani Investment Reports Q4 Consolidated Net Profit of Rs 256.7 Million",
            "Summary": "Kalyani Investment has reported its quarterly consolidated net profit. For the fourth quarter, the company's net profit stood at Rs 256.7 million, compared to Rs 292 million in the same quarter of the previous year, indicating a year-on-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1748341373000,
            "Source": "result"
        },
        {
            "Title": "Kalyani Investment Reports Decline in Q3 Consolidated Net Profit",
            "Summary": "Kalyani Investment Company has reported a consolidated net profit of 32 million rupees for the third quarter, down from 61 million rupees in the same period last year. This represents a significant year-over-year decrease in the company's quarterly earnings.",
            "Sentiment": "negative",
            "PublishDate": 1738827781000,
            "Source": "earnings"
        },
        {
            "Title": "Kalyani Investment: SEBI Settlement for Disclosure Violations",
            "Summary": "Kalyani Investment Company, a Bharat Forge promoter, settles with SEBI for ₹1.12 crore over alleged disclosure norm violations related to related party transactions and audit committee approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1734970212000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kalyani Investment Company Reports Q2 Financial Results",
            "Summary": "Kalyani Investment Company has announced its Q2 consolidated net profit of 385 million rupees, up from 311 million rupees in the same quarter last year. The company's dividend income for Q2 also increased to 439 million rupees from 376 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731480908000,
            "Source": "result"
        }
    ]
}