{
    "Symbol": "KILITCH",
    "ISIN": "INE729D01010",
    "News": [
        {
            "Title": "Kilitch Drugs Reports No Deviation in Rights Issue Fund Utilization for Q2 FY26",
            "Summary": "Kilitch Drugs (India) Limited's monitoring agency report for the quarter ended September 30, 2025, confirms no deviation in the utilization of Rs. 49.92 crore raised through rights issue. The company utilized Rs. 18.30 crore towards its Greenfield project at Pen, Maharashtra, and Rs. 0.61 crore for general corporate purposes, with remaining funds invested in fixed deposits.",
            "Sentiment": "positive",
            "PublishDate": 1763174559279,
            "Source": "corporate_action"
        },
        {
            "Title": "Kilitch Drugs Reports 18% Jump in H1FY26 Profit to ₹10.30 Crore",
            "Summary": "Kilitch Drugs Limited announced an 18.1% increase in Profit After Tax to ₹10.30 crore for H1FY26, up from ₹8.72 crore in H1FY25, driven by improved operational efficiencies and better product mix. The pharmaceutical company also reported 14.23% growth in total income to ₹101.28 crore and completed a rights issue of ₹49.92 lakh to fund its upcoming Greenfield project at Pen.",
            "Sentiment": "positive",
            "PublishDate": 1763135144666,
            "Source": "earnings"
        },
        {
            "Title": "Kilitch Drugs Reports Mixed Quarterly Performance with Rights Issue Completion",
            "Summary": "Kilitch Drugs (India) Limited reported standalone net loss of Rs. 5.27 per share for the quarter ended September 30, 2025, while successfully completing a rights issue of Rs. 4,992.51 lakhs primarily for funding capital expenditure at their Greenfield Project. The pharmaceutical company's board approved both standalone and consolidated unaudited financial results, with consolidated operations showing net profit of Rs. 4.97 per share for the same period.",
            "Sentiment": "neutral",
            "PublishDate": 1763065744470,
            "Source": "earnings"
        },
        {
            "Title": "Kilitch Drugs Reports Mixed Q2 Results with Revenue Growth but Lower Profit",
            "Summary": "Kilitch Drugs (India) reported Q2 consolidated net profit of 81.8 million rupees, down from 86.2 million rupees year-over-year, while revenue increased to 489.2 million rupees from 474.7 million rupees. The company's EBITDA rose to 40.7 million rupees from 39.1 million rupees, with EBITDA margin improving to 17.14% from 15.09% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1763043813971,
            "Source": "earnings"
        },
        {
            "Title": "Kilitch Drugs Postpones Rights Issue Credit and Listing Dates by One to Two Days",
            "Summary": "Kilitch Drugs (India) Limited has postponed the credit and listing dates for its rights issue of 13,98,463 equity shares. The credit of rights equity shares has been rescheduled from August 25, 2025 to August 26, 2025, while the listing date has been moved from August 26, 2025 to August 28, 2025. The rights issue involves equity shares with a face value of Rs. 10 each at an issue price of Rs. 357 per share, totaling Rs. 4,992.51 lakhs. The issue is offered to eligible shareholders in a ratio of 2 rights equity shares for every 23 fully paid-up equity shares held as of the record date of July 15, 2025. The finalization of basis of allotment and allotment was completed on August 25, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1756139637021,
            "Source": "corporate_action"
        },
        {
            "Title": "Kilitch Drugs Postpones Rights Issue Allotment Process by Three Days",
            "Summary": "Kilitch Drugs (India) Limited has postponed the finalization of basis of allotment and allotment schedule for its Rights Issue from August 22, 2025 to August 25, 2025. The postponement was decided in consultation with the National Stock Exchange and the Registrar to the Issue. The company's Rights Issue involves 13,98,463 equity shares of Rs. 10 face value each at an issue price of Rs. 357 per share, aggregating Rs. 4,992.51 lakhs. The rights are offered in the ratio of 2 rights equity shares for every 23 fully paid-up equity shares held by eligible shareholders as on the record date of July 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755875039480,
            "Source": "corporate_action"
        },
        {
            "Title": "Kilitch Drugs Reports Q2 2025 Results, Schedules AGM and Key Board Appointments",
            "Summary": "Kilitch Drugs (India) Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. Standalone net sales reached Rs 3,412.20 lakhs compared to Rs 3,342.16 lakhs in the same quarter last year, with net profit after tax of Rs 479.41 lakhs versus Rs 405.40 lakhs previously. Consolidated net sales were Rs 4,313.98 lakhs against Rs 3,345.16 lakhs in the prior year quarter. The company scheduled its 33rd Annual General Meeting for September 26, 2025, via video conferencing. The Board approved several key appointments including re-appointment of Mukund Mehta as Managing Director for 5 years from April 1, 2026, continuation of Vasudev Krishna Murti as Independent Director, and appointment of Deep Shukla & Associates as Secretarial Auditor for FY 2025-26 to 2029-30. The company proposed a rights issue of 13,968,463 equity shares at Rs 357 per share, aggregating Rs 4,992.51 lakhs, in the ratio of 2 rights shares for every 23 existing shares held as of July 15, 2025. Share transfer books will remain closed from September 19-26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755097267979,
            "Source": "earnings"
        },
        {
            "Title": "Kilitch Drugs Reports Strong Q1 Performance with Doubled Net Profit and Revenue Growth",
            "Summary": "Kilitch Drugs delivered robust quarterly results with consolidated net profit rising to 30 million rupees from 13 million rupees year-over-year. Revenue increased to 431 million rupees compared to 335 million rupees in the same period last year. The company's EBITDA grew significantly to 33 million rupees from 17 million rupees year-over-year, while EBITDA margin expanded to 7.56% from 4.96% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755093081314,
            "Source": "earnings"
        },
        {
            "Title": "Kilitch Drugs Approves Rights Issue Price at 357 Rupees Per Share",
            "Summary": "The Board of Directors of Kilitch Drugs has approved a rights issue price of 357 rupees per share. This corporate action allows existing shareholders to purchase additional shares at a specified price, often at a discount to the market price.",
            "Sentiment": "neutral",
            "PublishDate": 1752069009000,
            "Source": "default"
        },
        {
            "Title": "Kilitch Drugs Reports Significant Profit and Revenue Growth in Q4",
            "Summary": "Kilitch Drugs has reported a substantial increase in both net profit and revenue for the fourth quarter. The company's net profit rose to 104.4 million rupees, up from 46.8 million rupees year-over-year and 56.5 million rupees quarter-over-quarter. Revenue also saw a significant increase, reaching 563 million rupees compared to 391 million rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747700283000,
            "Source": "default"
        },
        {
            "Title": "Kilitch Drugs Reports Strong Q4 Financial Results",
            "Summary": "Kilitch Drugs has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 139.1 million rupees from 52 million rupees in the same quarter last year. The EBITDA margin improved to 24.7% from 13.33%. Revenue rose to 563 million rupees from 391 million rupees. Net profit for Q4 reached 104.4 million rupees, up from 46.8 million rupees year-over-year and 56.5 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747671647000,
            "Source": "result"
        },
        {
            "Title": "Kilitch Drugs (India) Reports Significant Q3 EBITDA Growth",
            "Summary": "Kilitch Drugs (India) has announced its Q3 financial results, showing a substantial improvement in EBITDA. The company's EBITDA increased to 87 million rupees, up from 23 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 15.54% from 7.14% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739280394000,
            "Source": "earnings"
        },
        {
            "Title": "Kilitch Drugs (India) Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Kilitch Drugs (India) has announced its Q3 financial results, showing substantial year-over-year and quarter-over-quarter growth. The company's consolidated net profit reached 60 million rupees, up from 29 million rupees in the same quarter last year and 86 million rupees in the previous quarter. Revenue also saw a significant increase, rising to 562 million rupees from 318 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739280326000,
            "Source": "earnings"
        },
        {
            "Title": "Kilitch Drugs (India) Invests $200,000 in Kilitch Estro Biotech",
            "Summary": "Kilitch Drugs (India) has made a strategic investment of $200,000 in Kilitch Estro Biotech. This move suggests the company is expanding its interests or operations in the biotech sector, potentially to enhance its research and development capabilities or diversify its product portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1737505278000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kilitch Drugs (India) Invests $200,000 in Kilitch Estro Biotech",
            "Summary": "Kilitch Drugs (India) has made a strategic investment of $200,000 in Kilitch Estro Biotech. This move suggests the company is expanding its operations or diversifying its portfolio in the biotech sector.",
            "Sentiment": "positive",
            "PublishDate": 1737461345000,
            "Source": "corporate_action"
        }
    ]
}