{
    "Symbol": "KIMS",
    "ISIN": "INE967H01025",
    "News": [
        {
            "Title": "KIMS Reports Q3FY26 Results, Plans Rs 100 Cr Investment",
            "Summary": "Krishna Institute of Medical Sciences posted consolidated revenue of Rs 9,977 million in Q3FY26, up from Rs 7,724 million in Q3FY25. The company approved additional investment of up to Rs 100 crores in subsidiary Sarvejana Healthcare.",
            "Sentiment": "positive",
            "PublishDate": 1770384790120,
            "Source": "co_actions_results"
        },
        {
            "Title": "KIMS Shareholders Approve Related Party Transaction",
            "Summary": "Krishna Institute of Medical Sciences shareholders approved material related party transaction with subsidiary KIMS Hospital Bengaluru through postal ballot with 93.18% votes in favor.",
            "Sentiment": "positive",
            "PublishDate": 1770120596943,
            "Source": "co_actions_results"
        },
        {
            "Title": "KIMS Schedules Q3FY26 Results Conference Call",
            "Summary": "Krishna Institute of Medical Sciences announces earnings conference call on February 7, 2026, hosted by IIFL Capital to discuss Q3FY26 results and business strategy with senior management.",
            "Sentiment": "neutral",
            "PublishDate": 1770045328610,
            "Source": "co_actions_results"
        },
        {
            "Title": "KIMS Seeks Shareholder Approval for ₹150 Cr Loan",
            "Summary": "Krishna Institute of Medical Sciences announces postal ballot for shareholder approval of material related party transaction involving ₹150 crore loan to subsidiary KIMS Hospital Bengaluru Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1767373679181,
            "Source": "co_actions_results"
        },
        {
            "Title": "KIMS Subsidiary Faces ₹12.42 Cr GST Demand Order",
            "Summary": "Krishna Institute of Medical Sciences' subsidiary Spanv Medisearch receives GST demand order worth ₹12.42 crores from Nagpur tax authorities for alleged non-payment on medicines for inpatients.",
            "Sentiment": "negative",
            "PublishDate": 1767280142366,
            "Source": "stocks"
        },
        {
            "Title": "KIMS Hospitals Signs Chennai Land Lease for New Facility",
            "Summary": "Krishna Institute of Medical Sciences enters lease agreement for 1.168 acres in Chennai to establish 300-bed super specialty hospital with ₹300.00 crore investment over 36 months.",
            "Sentiment": "positive",
            "PublishDate": 1766258253834,
            "Source": "stocks"
        },
        {
            "Title": "KIMS Increases Stake in Sarvejana to 75.53%",
            "Summary": "Krishna Institute of Medical Sciences acquired additional 6.94% stake in Sarvejana Healthcare for ₹148.09 crores, increasing total holding from 68.59% to 75.53% in its material subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1766147875512,
            "Source": "co_actions_results"
        },
        {
            "Title": "KIMS Starts Operations at 350-Bed Bengaluru Hospital",
            "Summary": "Krishna Institute of Medical Sciences commenced operations at its new 350-bed multi-specialty hospital facility at PES University campus in Electronic City, Bengaluru on December 15, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765797268004,
            "Source": "stocks"
        },
        {
            "Title": "KIMS Hospitals Q2 FY26: Revenue Grows 23.3% to INR 965 Crores Despite Margin Pressure from New Hospital Ramp-up",
            "Summary": "KIMS Hospitals reported Q2 FY26 revenue of INR 965 crores with 23.3% year-on-year growth, but EBITDA declined 6.7% to INR 208 crores and PAT dropped to INR 72 crores from INR 121 crores last year due to losses from newly commissioned hospitals. The company expects new facilities in Thane, Bangalore, and Nashik to achieve EBITDA breakeven within 12 months of commissioning, with management confident about ramp-up trajectory and 20% CGHS price hike benefits flowing from Q4.",
            "Sentiment": "neutral",
            "PublishDate": 1763103489269,
            "Source": "earnings"
        },
        {
            "Title": "KIMS Hospitals Reports 23% Revenue Growth Despite Margin Pressure in Q2FY26",
            "Summary": "Krishna Institute of Medical Sciences Limited reported consolidated revenue of INR 9,649 million for Q2FY26, marking a 23.3% year-on-year growth and 9.8% quarter-on-quarter increase. However, EBITDA declined 6.7% year-on-year to INR 2,082 million, with margins compressing to 21.6% from 28.5% in the previous year. Profit after tax dropped to INR 720 million from INR 1,207 million in Q2FY25. The company corrected data errors in its investor presentation related to bed numbers and occupancy percentages across multiple pages. KIMS operates across Telangana, Andhra Pradesh, Maharashtra, Karnataka and Kerala with a total bed capacity of 6,114 beds. The hospital chain achieved operational highlights including 15.3% growth in inpatient volume and 25.1% increase in outpatient volume. Average revenue per occupied bed grew 9.8% year-on-year to INR 42,016. The company has expansion plans including new facilities in Bangalore, Ongole, Anantapur, Kondapur and Rajahmundry with expected investments ranging from INR 40-350 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1762907456946,
            "Source": "stock"
        },
        {
            "Title": "KIMS Plans Double-Digit Revenue Growth Through Bengaluru Expansion and Tier-2 Hospital Development",
            "Summary": "KIMS outlined a strong growth strategy centered on expanding its healthcare network and optimizing operations. The company is establishing a new 700+ bed facility in Bengaluru and expanding tier-2 hospitals in Andhra Pradesh and Telangana. KIMS targets double-digit revenue growth by increasing Average Revenue Per Occupied Bed (ARPOB) and optimizing its specialty mix. The growth plan emphasizes operational leverage, retaining medical talent, and pursuing strategic acquisitions to strengthen market leadership position.",
            "Sentiment": "positive",
            "PublishDate": 1762871995858,
            "Source": "stock"
        },
        {
            "Title": "KIMS Hospitals Plans South India Expansion With 18-20% Annual Growth Target",
            "Summary": "KIMS Hospitals operates over 5,000 beds across South India and plans to add new hospitals in Hyderabad, Bengaluru, and Kerala. The company targets 18-20% annual growth through specialty diversification, digital health initiatives, and research programs. KIMS is focusing on operational efficiency and clinical excellence to achieve sustainable margin growth.",
            "Sentiment": "positive",
            "PublishDate": 1762528807636,
            "Source": "stock"
        },
        {
            "Title": "KIMS Hospitals Reports Quarterly Results and Approves Subsidiary Merger",
            "Summary": "Krishna Institute of Medical Sciences Limited (KIMS) announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported revenue from operations of Rs 850 million for the quarter, compared to Rs 738 million in the previous quarter. Net profit for the quarter was Rs 56 million versus Rs 99 million in the prior quarter. For the half-year period, revenue reached Rs 1,588 million with net profit of Rs 155 million. The Board also approved the merger of two wholly-owned subsidiaries - KIMS Hospitals Private Limited and Chalasani Hospitals Private Limited - with the holding company. On a consolidated basis, the company reported quarterly revenue of Rs 2,038 million and net profit of Rs 167 million. The consolidated half-year revenue was Rs 4,009 million with net profit of Rs 355 million.",
            "Sentiment": "neutral",
            "PublishDate": 1762507754539,
            "Source": "earnings"
        },
        {
            "Title": "Krishna Institute of Medical Sciences Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Krishna Institute of Medical Sciences reported quarterly revenue of 9.6 billion rupees, up from 7.77 billion rupees in the same period last year. However, consolidated net profit declined to 669 million rupees from 1.07 billion rupees year-over-year. EBITDA decreased to 2.04 billion rupees from 2.18 billion rupees, with EBITDA margin falling to 21.23% from 28% compared to the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762506849903,
            "Source": "earnings"
        },
        {
            "Title": "Krishna Institute of Medical Sciences Sees Block Trade Worth Rs. 71.89 Crores",
            "Summary": "Krishna Institute of Medical Sciences Ltd. witnessed a block trade on NSE involving approximately 1,003,735 shares at Rs. 716.25 per share, totaling Rs. 71.89 crores. The transaction represents a significant institutional trade in the healthcare company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1761553667300,
            "Source": "stock"
        },
        {
            "Title": "Krishna Institute Of Medical Sciences Opens 450-Bed Hospital in Bengaluru",
            "Summary": "Krishna Institute Of Medical Sciences has begun operations at a new 450-bed multi-specialty hospital in Mahadevapura, Bengaluru. The facility includes over 120 ICU beds and more than 100 OPD beds. This marks the company's first expansion into the Bengaluru area.",
            "Sentiment": "positive",
            "PublishDate": 1757921754436,
            "Source": "stock"
        },
        {
            "Title": "KIMS Targets 25-30% Revenue Growth Over Next Four Years, Plans to Boost ARPOB to Rs 55,000",
            "Summary": "Krishna Institute of Medical Sciences Ltd. (KIMS) is targeting 25-30% year-on-year revenue growth over the next three to four years, according to Chairman and Managing Director Dr Bhaskar Rao. The company aims to increase its Average Revenue Per Occupied Bed (ARPOB) from the current Rs 43,000 to Rs 55,000. KIMS is opening 900 beds this year in Bangalore and Thane, which are expected to contribute to higher ARPOBs within two quarters. The company's debt stands at approximately Rs 600-700 crore with a debt-to-Ebitda ratio of less than 1:1. The blended debt-to-Ebitda ratio including subsidiaries is around 2.5, which management aims to reduce to 1.5-2 or preferably below 1.5. KIMS shares closed 0.96% lower at Rs 739 on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1755936540313,
            "Source": "stock"
        },
        {
            "Title": "KIMS Hospital Reports 26.8% Revenue Growth to INR879 Crores in Q1 FY26, EBITDA Margins Decline to 22.7%",
            "Summary": "Krishna Institute of Medical Sciences Limited reported revenue of INR879 crores for Q1 FY26, marking 26.8% year-on-year growth and 9.6% quarter-on-quarter growth. EBITDA stood at INR200 crores with 8.5% year-on-year growth but declined 1.4% quarter-on-quarter. EBITDA margin compressed to 22.7% from 26.6% in Q1 FY25 and 25.3% in Q4 FY25. PAT decreased to INR85 crores from INR95 crores in Q1 FY25 and INR106 crores in Q4 FY25. The company launched new units including Thane facility and two Bangalore units with 800 beds capacity. New hospital operations faced combined losses of INR21 crores in Q1, with Thane contributing INR11 crores, Nashik INR7 crores, and Kannur INR3.5 crores. Management expects EBITDA losses of INR8-10 crores from Maharashtra cluster in Q2 and additional INR10-15 crores drag from Bangalore units starting September. The company operates 25 centers across 5 states with 8,000 bed capacity and projects EBITDA margins in 22-25% range for the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1755095977627,
            "Source": "earnings"
        },
        {
            "Title": "Krishna Institute of Medical Sciences Sees Rs. 109.18 Crore Block Trade on NSE",
            "Summary": "Krishna Institute of Medical Sciences Ltd. witnessed a block trade worth Rs. 109.18 crores on the National Stock Exchange. The transaction involved approximately 1,537,402 shares traded at a price of Rs. 710.15 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1754628210695,
            "Source": "order&deals"
        },
        {
            "Title": "KIMS Reports Patient Growth Across All Units, Plans Two New Bangalore Facilities",
            "Summary": "KIMS reported an increase in patient numbers across all its units, with particularly strong performance at its new Thane location. The company executive expressed confidence in achieving FY26 goals. KIMS plans to open two new units in Bangalore during Q2.",
            "Sentiment": "positive",
            "PublishDate": 1754485763361,
            "Source": "stock"
        },
        {
            "Title": "KIMS Plans Expansion With New Hospital Projects Across Multiple Cities",
            "Summary": "KIMS is pursuing rapid growth through several expansion initiatives. The company is developing new projects in Bengaluru and planning to add more beds at its facilities in Ongole, Anantapur, and Kondapur. Additionally, KIMS is establishing a new multispecialty hospital in Rajahmundry. The expansion strategy emphasizes technology-driven care and diverse specialty services, with the goal of increasing ongoing revenue.",
            "Sentiment": "positive",
            "PublishDate": 1754476763836,
            "Source": "stock"
        },
        {
            "Title": "KIMS Hospitals Reports 26.8% Revenue Growth to ₹879 Cr in Q1 FY26",
            "Summary": "Krishna Institute of Medical Sciences Limited (KIMS Hospitals) reported total revenue of ₹879 crores for Q1 FY26, representing 26.8% year-on-year growth and 9.6% quarter-on-quarter growth. EBITDA reached ₹200 crores with 8.5% YoY growth but declined 1.4% QoQ. EBITDA margin compressed to 22.7% from 26.6% in Q1 FY25 and 25.3% in Q4 FY25. Profit after tax decreased to ₹85 crores from ₹95 crores in Q1 FY25 and ₹106 crores in Q4 FY25. Consolidated earnings per share stood at ₹1.96, down 9.2% YoY. The company reported strong operational metrics with inpatient volume growing 15.3% YoY to 57,275 and outpatient volume increasing 19.3% YoY to 5,02,492. Average revenue per occupied bed (ARPOB) rose 11.8% YoY to ₹43,011. Cash and equivalents totaled ₹70 crores. CMD Dr. B Bhaskar Rao noted robust performance despite the seasonally lean quarter and confirmed two Bangalore units will commence operations in Q2.",
            "Sentiment": "positive",
            "PublishDate": 1754475979013,
            "Source": "earnings"
        },
        {
            "Title": "Krishna Institute of Medical Sciences Reports Q1 Consolidated Net Profit of 786 Million Rupees",
            "Summary": "Krishna Institute of Medical Sciences recorded a consolidated net profit of 786 million rupees in Q1, compared to 866 million rupees in the same quarter of the previous year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1754472008663,
            "Source": "earnings"
        },
        {
            "Title": "Krishna Institute of Medical Sciences Ltd. Reports Large Block Trade",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for Krishna Institute of Medical Sciences Ltd. Approximately 797,020 shares were traded at a price of Rs. 647.65 per share, totaling Rs. 51.62 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1747205651000,
            "Source": "block_details"
        },
        {
            "Title": "Krishna Institute Of Medical Sciences Reports Strong Q4 Financial Results",
            "Summary": "Krishna Institute Of Medical Sciences has reported a significant increase in its Q4 consolidated net profit, rising to 1.02 billion rupees from 655 million rupees year-over-year. The company's Q4 revenue also saw growth, reaching 7.97 billion rupees compared to 6.34 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747095782000,
            "Source": "default"
        },
        {
            "Title": "Krishna Institute of Medical Sciences Reports Strong Q4 Financial Results",
            "Summary": "Krishna Institute of Medical Sciences has announced its Q4 financial results. The company's consolidated net profit increased to 1.02 billion rupees, up from 655 million rupees year-over-year and 887 million rupees quarter-over-quarter. Revenue also saw growth, reaching 7.97 billion rupees compared to 6.34 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747058359000,
            "Source": "result"
        },
        {
            "Title": "Krishna Institute of Medical Sciences Ltd. Sees Block Trade of Rs. 16.15 Crores",
            "Summary": "A block trade of approximately 306,372 shares of Krishna Institute of Medical Sciences Ltd. occurred on the National Stock Exchange (NSE) at a price of Rs. 527.00 per share. The total value of the transaction amounted to Rs. 16.15 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1741244239000,
            "Source": "block_deals"
        },
        {
            "Title": "Krishna Institute of Medical Sciences: Targets 20% Growth in FY26 with Expansion Plans",
            "Summary": "KIMS aims for 18-20% growth in FY26 through new hospital launches and O&M contracts. Plans include opening 3-4 hospitals this fiscal year and 3 more via O&M contracts next year. The company is open to acquiring hospitals under O&M contracts with call options for future buyouts.",
            "Sentiment": "positive",
            "PublishDate": 1740541334000,
            "Source": "corporate_action"
        },
        {
            "Title": "KIMS Enters Operations and Management Agreement with Splendid Hospitals",
            "Summary": "Krishna Institute of Medical Sciences (KIMS) has signed an operations and management agreement with Splendid Hospitals. Under this agreement, KIMS will be responsible for running, managing, operating, directing, and controlling the hospital, as well as providing medical services.",
            "Sentiment": "positive",
            "PublishDate": 1740029600000,
            "Source": "corporate_action"
        },
        {
            "Title": "Krishna Institute of Medical Sciences Enters Management Agreement with UAIMS Hospital",
            "Summary": "Krishna Institute of Medical Sciences has signed an operations and management agreement with UAIMS Hospital. The initial agreement is for 7 years, with a potential extension of 3 years. As part of the deal, Krishna Institute of Medical Sciences will receive a 9% revenue fee from UAIMS Hospital.",
            "Sentiment": "positive",
            "PublishDate": 1739838530000,
            "Source": "corporate_action"
        },
        {
            "Title": "Krishna Institute of Medical Sciences Signs Operations and Management Agreement with UAIMS Hospital",
            "Summary": "Krishna Institute of Medical Sciences has entered into an operations and management agreement with UAIMS Hospital. The initial agreement is for 7 years, with a potential extension of 3 years. As part of this agreement, Krishna Institute of Medical Sciences will receive a 9% revenue fee from UAIMS Hospital.",
            "Sentiment": "positive",
            "PublishDate": 1739798654000,
            "Source": "corporate_action"
        },
        {
            "Title": "Krishna Institute of Medical Sciences Reports Q3 Financial Results",
            "Summary": "Krishna Institute of Medical Sciences has announced its Q3 consolidated financial results. The company reported a net profit of 887 million rupees, showing an increase from 718 million rupees year-over-year. However, this represents a decrease from 1.1 billion rupees quarter-over-quarter. The Q3 revenue stood at 7.7 billion rupees, up from 6 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738843458000,
            "Source": "earnings"
        },
        {
            "Title": "KIMS Enters 20-Year Hospital Lease Agreement with Valiyath Institute",
            "Summary": "Krishna Institute of Medical Sciences (KIMS) has entered into a long-term lease agreement with Valiyath Institute for a hospital facility. The lease duration is set for 20 years, with KIMS agreeing to pay a monthly rental of 3.1 million rupees for the hospital premises.",
            "Sentiment": "positive",
            "PublishDate": 1738067074000,
            "Source": "corporate_action"
        },
        {
            "Title": "KIMS Hospitals: Chairman Projects 50% Revenue Jump by FY26",
            "Summary": "KIMS Hospitals' Chairman Dr. B Bhaskar Rao expects a 50% revenue increase by FY26, driven by expansion plans in Thane and Bengaluru, and higher average revenue per occupied bed (ARPOB). The company aims to focus on complex procedures and transplants, with new oncology and mother-child departments contributing to growth. ARPOB has risen from Rs 31,000 to Rs 38,000-40,000, with further increases expected as the company adds 1,000 beds in metro areas.",
            "Sentiment": "positive",
            "PublishDate": 1735962057000,
            "Source": "normal_news"
        },
        {
            "Title": "Krishna Institute of Medical Sciences Acquires Additional Stake in Arunodaya Hospitals",
            "Summary": "Krishna Institute of Medical Sciences (KIMS) has acquired an additional 3% stake in Arunodaya Hospitals for 22.5 million rupees. This acquisition strengthens KIMS' position in the healthcare sector and expands its portfolio of medical facilities.",
            "Sentiment": "positive",
            "PublishDate": 1733400912000,
            "Source": "corporate_action"
        },
        {
            "Title": "KIMS Announces Major Expansion Plans",
            "Summary": "Krishna Institute of Medical Sciences (KIMS) has unveiled expansion plans to add approximately 2,085 beds across multiple cities. The company plans to invest between Rs. 1,870 - 2,010 crore as capital expenditure for this expansion, according to their investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1731296528000,
            "Source": "corporate_action"
        },
        {
            "Title": "KIMS Signs 15-Year Management Agreement for Super Specialty Hospital in Andhra Pradesh",
            "Summary": "Krishna Institute of Medical Sciences (KIMS) has entered into a 15-year operations and management agreement with Insignia Healthcare Private Limited. The agreement is for a 150-bed super specialty hospital located in Andhra Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1731290109000,
            "Source": "corporate_action"
        },
        {
            "Title": "Krishna Institute of Medical Sciences Reports Q2 Profit and Revenue Growth",
            "Summary": "Krishna Institute of Medical Sciences Ltd. has reported a consolidated net profit of 1.2 billion rupees for the second quarter, up from 1 billion rupees year-over-year and 952 million rupees quarter-over-quarter. The company's revenue also increased to 7.77 billion rupees, compared to 6.52 billion rupees year-over-year and 6.88 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731284241000,
            "Source": "result"
        },
        {
            "Title": "KIMS Expands to Kerala with 3000-Bed Plan",
            "Summary": "Krishna Institute of Medical Sciences (KIMS) has announced plans to expand its operations to Kerala. The company aims to establish 3000 hospital beds in the state over the next 5 years, potentially creating 10,000 new jobs in the process.",
            "Sentiment": "positive",
            "PublishDate": 1730892771000,
            "Source": "corporate_action"
        },
        {
            "Title": "Krishna Institute of Medical Sciences Increases Stake in Sarvejana Healthcare",
            "Summary": "Krishna Institute of Medical Sciences has acquired an additional 2.21% stake in Sarvejana Healthcare for 368.80 million rupees. This acquisition increases their total ownership in Sarvejana Healthcare to 66.35%.",
            "Sentiment": "positive",
            "PublishDate": 1729590874000,
            "Source": "corporate_action"
        },
        {
            "Title": "KIMS Hospitals: ₹700 Crore Medical Tech Deal with Wipro GE Healthcare",
            "Summary": "KIMS Hospitals signed a 3-year MoU with Wipro GE Healthcare for medical technology procurement worth up to ₹700 crore. The deal covers new equipment and servicing for KIMS' 12 existing and 4 upcoming hospitals. Wipro GE Healthcare will be KIMS' end-to-end medical technology partner, supporting its expansion across Southern and Western India.",
            "Sentiment": "positive",
            "PublishDate": 1729259862000,
            "Source": "normal_news"
        },
        {
            "Title": "KIMS Signs MoU with Wipro GE Healthcare for Rs 700 Crore Deal",
            "Summary": "Krishna Institute of Medical Sciences (KIMS) has entered into a Memorandum of Understanding (MoU) with Wipro GE Healthcare. The agreement is valued at up to Rs 700 crore, indicating a significant partnership between the healthcare provider and the medical technology company.",
            "Sentiment": "positive",
            "PublishDate": 1729238999000,
            "Source": "corporate_action"
        },
        {
            "Title": "KIMS Hospital Partners with Intuitive for Robotic-Assisted Surgery",
            "Summary": "<p><span class='positive'>KIMS Hospital</span> has signed a <b>Memorandum of Understanding (MoU)</b> with <span class='positive'>Intuitive</span>, a company specializing in <span class='positive'>robotic-assisted surgery systems</span>. This <span class='positive'>partnership</span> aims to introduce <span class='positive'>advanced surgical technologies</span> at KIMS Hospital, potentially <span class='positive'>improving patient outcomes</span> and <span class='positive'>expanding access</span> to <span class='positive'>minimally invasive surgical procedures</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727989782000,
            "Source": "corporate_action"
        }
    ]
}