{
    "Symbol": "KINGFA",
    "ISIN": "INE473D01015",
    "News": [
        {
            "Title": "Kingfa Science Q3FY26 Monitoring Report Filed",
            "Summary": "Kingfa Science & Technology (India) Limited files monitoring agency report for Q3FY26, showing Rs.115.15 crore utilization from Rs.500 crore preferential issue proceeds.",
            "Sentiment": "neutral",
            "PublishDate": 1770618899521,
            "Source": "stocks"
        },
        {
            "Title": "Kingfa Science Technology Reports 11.12% Revenue Growth in H1 FY2025-26",
            "Summary": "Kingfa Science Technology (India) Limited reported net revenue from operations of Rs. 92,762.34 lakhs for the first half of FY2025-26, compared to Rs. 83,476.50 lakhs in the same period of the previous year, marking an 11.12% increase. For the quarter ended September 30, 2025, the company achieved net revenue of Rs. 46,568.91 lakhs versus Rs. 41,832.80 lakhs in the previous quarter, representing an 11.32% growth. The company's net profit after tax for the quarter stood at Rs. 4,114.38 lakhs compared to Rs. 3,979.10 lakhs in the previous quarter. Earnings per share increased to Rs. 30.36 from Rs. 32.86 in the previous quarter. The company maintains a domestic sales share of 92-93% with exports contributing 7-8% to total revenue.",
            "Sentiment": "positive",
            "PublishDate": 1762965020539,
            "Source": "earnings"
        },
        {
            "Title": "Kingfa Science Technology Reports No Utilization of Rs 500 Crore Preferential Issue Proceeds",
            "Summary": "Kingfa Science Technology (India) Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing no utilization of funds from its Rs 500 crore preferential issue. The entire amount remains deployed in fixed deposits (Rs 499.90 crore) with Industrial and Commercial Bank of China Limited and savings/current accounts (Rs 0.10 crore). CARE Ratings Limited, serving as the monitoring agency, reported no deviation from stated objects. The funds are allocated for five purposes: Phase 2 factory building construction at Chakan, Pune (Rs 187 crore), office administration and R&D building at Chakan, Pune (Rs 44 crore), plant and machinery (Rs 102 crore), land acquisition for South India expansion (Rs 42 crore), and general corporate purposes (Rs 125 crore). All projects have a targeted completion timeline of June 2027. The company has obtained necessary government and statutory approvals as required.",
            "Sentiment": "neutral",
            "PublishDate": 1762956958766,
            "Source": "corporate_action"
        },
        {
            "Title": "Kingfa Science & Tech Reports Higher Q2 Net Profit and Revenue",
            "Summary": "Kingfa Science & Tech reported Q2 net profit of 411.4 million rupees compared to 372.5 million rupees in the same period last year. Revenue increased to 4.66 billion rupees from 4.18 billion rupees year-over-year. EBITDA rose to 606 million rupees from 558 million rupees, while EBITDA margin decreased slightly to 13.01% from 13.35% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762949859574,
            "Source": "earnings"
        },
        {
            "Title": "Kingfa Science & Technology (India) Receives Exchange Approval for ₹500 Crore Preferential Share Issue",
            "Summary": "Kingfa Science & Technology (India) Limited has received in-principle approval from NSE and BSE for issuing up to 14,40,920 equity shares on a preferential basis at ₹3,470 per share. The shares have a face value of ₹10 each and include a premium of ₹3,460 per share. The approval letters were received from both exchanges on September 18, 2025, with NSE letter number NSE/LIST/50485 and BSE letter number LOD/PREF/MV/FIP/907/2025-26. The shares will be issued for cash on a preferential basis.",
            "Sentiment": "positive",
            "PublishDate": 1758195568460,
            "Source": "corporate_action"
        },
        {
            "Title": "Kingfa Science & Technology (India) Conducts EGM to Approve Preferential Equity Share Issue",
            "Summary": "Kingfa Science & Technology (India) Limited held an Extra-Ordinary General Meeting on September 17, 2025, via video conferencing from 11:30 AM to 11:52 AM IST. The meeting was attended by 52 members and chaired by Mr. Bo Jingen, Chairperson & Managing Director. The primary agenda was to consider and approve the offer, issue and allotment of equity shares on a preferential basis through a special resolution. The Chairperson explained that the proposed preferential issue would fund Phase II factory building and R&D at Chakan (Pune), plant and machinery at Bhiwadi (Rajasthan), land acquisition in South India, and general corporate purposes. The company provided remote e-voting facilities from September 14-16, 2025, and additional e-voting during the meeting. Ms. Shaswati Vaishnav served as the Scrutinizer for the voting process. The resolution is deemed passed subject to receipt of requisite majority, with detailed voting results to be shared on company and NSDL websites.",
            "Sentiment": "positive",
            "PublishDate": 1758105061092,
            "Source": "corporate_action"
        },
        {
            "Title": "Kingfa Science & Technology India Approves INR 500 Crore Preferential Share Issue to Seven Investors",
            "Summary": "Kingfa Science & Technology (India) Limited's board approved the issuance of up to 14,40,920 equity shares at INR 3,470 per share to seven non-promoter investors through preferential allotment, raising up to INR 499.99 crore. The investors include multiple SBI mutual fund schemes, Custody Bank of Japan Ltd, and Sanshi Fund-I. The shares carry a face value of INR 10 each with a premium of INR 3,460 per share. Post-allotment, the investors will collectively hold approximately 10.63% of the company's equity. The proposal requires shareholder approval at an extraordinary general meeting scheduled for September 17, 2025. The board also fixed the 41st Annual General Meeting for September 29, 2025, and reappointed K. Suryanarayanan as Cost Auditor for the year ending March 31, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1755869698654,
            "Source": "corporate_action"
        },
        {
            "Title": "Kingfa Science & Technology (India) Schedules Board Meeting to Consider Preferential Securities Issue",
            "Summary": "Kingfa Science & Technology (India) Limited has scheduled a Board meeting on August 22, 2025 to consider raising funds through a preferential issue of securities to one or more persons. The proposal requires shareholder approval and will be conducted in accordance with SEBI regulations and the Companies Act, 2013. The company has closed its trading window for directors, promoters, designated persons, connected persons, and their immediate relatives with immediate effect. The trading window will reopen 48 hours after the meeting outcome is announced. The Board will also consider convening an Extra-Ordinary General Meeting or Postal Ballot process to seek shareholder approval for the fund raising proposal.",
            "Sentiment": "neutral",
            "PublishDate": 1755532909578,
            "Source": "corporate_action"
        },
        {
            "Title": "Kingfa Science & Technology Reconstitutes Board Committees with New Leadership",
            "Summary": "Kingfa Science & Technology (India) Limited has reconstituted three key Board committees following changes in directorship. Mr. Subramanyan S. K will assume chairperson roles across the Audit Committee, Nomination and Remuneration Committee, and Corporate Social Responsibility Committee from August 28, 2025. These changes follow the completion of Mr. Dilip Dinkar Kulkarni's second consecutive term as Independent Director on August 27, 2025. The Audit Committee includes Ms. Nilima Ramrao Shinde, Mr. R. Sudhinder as Independent Director members, and Mr. D. Bajaji as Executive Director member. The Nomination and Remuneration Committee comprises the same independent directors. The CSR Committee features Mr. Sun Yajie as Executive Director member from July 31, 2025, replacing Mr. Wu Xiaohui who resigned from the Board, alongside Mr. Doraiswami Balaji as Executive Director member.",
            "Sentiment": "neutral",
            "PublishDate": 1753907474001,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kingfa Science & Technology India Reports 10.93% Revenue Growth in Q1 FY2026",
            "Summary": "Kingfa Science & Technology (India) Limited reported total revenue from operations of Rs. 46,193.43 lakhs for Q1 FY2025-26, representing a 10.93% increase compared to Rs. 41,643.69 lakhs in the same period last year. Domestic sales grew to Rs. 42,512.28 lakhs from Rs. 38,923.14 lakhs, while export sales increased to Rs. 3,681.15 lakhs from Rs. 2,720.55 lakhs. However, revenue declined 1.62% compared to the previous quarter (Q4 FY2024-25). The company reported net profit after tax of Rs. 3,979.10 lakhs for the quarter, with basic and diluted earnings per share of Rs. 32.86 each. Export sales represented 8% of total revenue while domestic sales accounted for 92%.",
            "Sentiment": "positive",
            "PublishDate": 1753886111540,
            "Source": "stock"
        },
        {
            "Title": "Kingfa Science & Tech Reports Mixed Q1 Results with Revenue Growth and Profit Decline",
            "Summary": "Kingfa Science & Tech reported Q1 net profit of 380 million rupees, down from 391 million rupees in the previous year. Revenue increased to 4.62 billion rupees from 4.16 billion rupees year-over-year. EBITDA rose to 581 million rupees from 574 million rupees, while EBITDA margin compressed to 12.58% from 13.79% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1753883321096,
            "Source": "earnings"
        },
        {
            "Title": "Kingfa Science & Technology (India) Approves Quarterly Results and Board Changes",
            "Summary": "Kingfa Science & Technology (India) Limited's Board approved unaudited standalone financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs. 46,193.43 lakhs and net profit of Rs. 3,979.10 lakhs for the quarter. The Board made significant leadership changes including the appointment of Mr. Subramanyan S.K. as Additional Independent Director for a 5-year term and Mr. Sun Yajie as Additional Executive Director for 3 years. Mr. Wu Xiaohui resigned as Non-Executive-Non-Independent Director due to personal and professional commitments. The company manufactures reinforced polypropylene and operates as a single reportable segment. The financial results were reviewed by statutory auditors M/s. P G Bhagwat LLP.",
            "Sentiment": "neutral",
            "PublishDate": 1753882281542,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kingfa Science & Technology (India) Approves Q1 Results, Appoints Two Directors, Accepts One Resignation",
            "Summary": "Kingfa Science & Technology (India) Limited's Board of Directors approved unaudited standalone financial results for the quarter ended June 30, 2025, and made several board changes. The company reported revenue from operations of Rs 46,193.43 lakhs and net profit of Rs 3,979.10 lakhs for the quarter. The board appointed Mr. Subramanyan S.K. as Additional Director designated as Independent Director for a 5-year term, and Mr. Sun Yajie as Additional Director designated as Executive Director for a 3-year term. Both appointments are effective July 30, 2025. Additionally, the board accepted the resignation of Mr. Wu Xiaohui as Non-Executive-Non-Independent Director due to personal and professional commitments. The company manufactures reinforced polypropylene and operates as a single reportable segment. Basic and diluted earnings per share stood at Rs 32.86 for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1753881780502,
            "Source": "corporate_action"
        },
        {
            "Title": "KINGFA SCIENCE & TECH Reports Q4 Financial Results",
            "Summary": "KINGFA SCIENCE & TECH has released its Q4 financial results. The company's EBITDA increased to 605 million rupees from 508.8 million rupees year-over-year. The EBITDA margin improved to 12.87% from 12.58% in the same period last year. Net profit rose to 419 million rupees, up from 335.5 million rupees year-over-year and 346 million rupees quarter-over-quarter. Revenue for Q4 reached 4.7 billion rupees, compared to 4.04 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748437015000,
            "Source": "result"
        },
        {
            "Title": "Kingfa Science & Tech Reports Strong Q3 Financial Results",
            "Summary": "Kingfa Science & Tech has announced its Q3 financial results, showing significant year-over-year growth. The company's net profit increased to 346 million rupees, up from 243 million rupees in the same quarter last year. Revenue also saw growth, reaching 4.4 billion rupees compared to 3.94 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739320509000,
            "Source": "earnings"
        },
        {
            "Title": "Kingfa Science & Technology Reports Improved Q3 EBITDA and Margin",
            "Summary": "Kingfa Science & Technology has reported a significant increase in its Q3 EBITDA, rising to 514 million rupees from 379 million rupees in the same quarter last year. The company's EBITDA margin also improved, reaching 11.67% compared to 9.63% in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739278374000,
            "Source": "earnings"
        },
        {
            "Title": "Kingfa Science & Technology Reports Q3 Financial Results",
            "Summary": "Kingfa Science & Technology has announced its financial results for the third quarter. The company reported a net profit of 346 million rupees, up from 243 million rupees in the same period last year. Revenue for Q3 increased to 4.4 billion rupees from 3.94 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739278367000,
            "Source": "earnings"
        },
        {
            "Title": "Kingfa Science & Tech Reports Improved Q2 EBITDA and Margin",
            "Summary": "Kingfa Science & Tech has announced its Q2 financial results. The company's EBITDA increased to 558 million rupees, up from 449 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 13.35% from 12.79% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730200853000,
            "Source": "result"
        },
        {
            "Title": "Kingfa Science & Technology Reports Q2 Revenue Growth",
            "Summary": "Kingfa Science & Technology has reported a revenue of 4.2 billion rupees for the second quarter, compared to 3.51 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730200843000,
            "Source": "result"
        },
        {
            "Title": "Kingfa Science & Technology Reports Q2 Profit Increase",
            "Summary": "Kingfa Science & Technology has reported a net profit of 372 million rupees for the second quarter, showing an increase from 296 million rupees year-over-year and 390.7 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730200831000,
            "Source": "result"
        }
    ]
}