{
    "Symbol": "KIOCL",
    "ISIN": "INE880L01014",
    "News": [
        {
            "Title": "KIOCL Reports Q3 FY26 Profit After Previous Losses",
            "Summary": "KIOCL Limited posted net profit of ₹18.13 crores in Q3 FY26, reversing from losses in previous quarters. Revenue reached ₹175.39 crores with improved operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1770904824056,
            "Source": "co_actions_results"
        },
        {
            "Title": "KIOCL Credit Rating Downgraded and Withdrawn by BWR",
            "Summary": "Brickwork Ratings downgrades KIOCL's bank loan facilities rating to BWR A- with negative outlook before withdrawing ratings following full repayment of ₹1,050 crore facilities.",
            "Sentiment": "negative",
            "PublishDate": 1766217051160,
            "Source": "co_actions_results"
        },
        {
            "Title": "KIOCL Reports Reduced Net Loss and Significant Revenue Growth in Q2",
            "Summary": "KIOCL reported a net loss of 171.5 million rupees in Q2, a substantial improvement from the previous year's loss of 692 million rupees. The company's revenue surged to 1.42 billion rupees compared to 161.4 million rupees in the same quarter last year, indicating strong operational recovery despite continued losses.",
            "Sentiment": "negative",
            "PublishDate": 1763117797817,
            "Source": "earnings"
        },
        {
            "Title": "KIOCL Stock Falls 7% After 50% Surge Amid Minimal Free Float",
            "Summary": "KIOCL Ltd. shares dropped over 7% to ₹578 on Tuesday following a nearly 50% surge over three trading sessions. The stock had gained 20% on both Friday and Monday, with Monday's trading volumes reaching 2.6 crore shares compared to the 20-day average of 16.2 lakh shares. The iron ore mining company experiences exaggerated price movements due to having almost zero free float, with the government holding a 99% stake. KIOCL's market capitalization exceeded ₹38,000 crore as of Monday's close, with Monday's turnover being five times higher than the company's free float market cap. Tuesday's decline also occurred on heavy volumes of close to 20 lakh shares.",
            "Sentiment": "neutral",
            "PublishDate": 1759810743213,
            "Source": "stock"
        },
        {
            "Title": "KIOCL Shares Surge 19% to 52-Week High, Exchanges Seek Clarification on Volume Spike",
            "Summary": "KIOCL shares jumped 19% on Monday, reaching a 52-week high of Rs 629.30 on NSE, extending a three-session rally to 48%. The surge prompted exchanges to seek clarification from the company due to unusually high trading volumes. Over 2 crore shares were traded by 2 pm with total value touching Rs 1,320 crore. KIOCL, a Ministry of Steel company, operates iron ore mining and beneficiation activities in Karnataka with a 3.5 MTPA iron-oxide pellet plant. The stock has delivered 230% returns over three years and 67% in one year, significantly outperforming benchmark indices. Technical indicators show the stock trading above its 50-day and 200-day moving averages but in overbought territory. The company reported a standalone net loss of Rs 38 crore in the June quarter, an improvement from Rs 51 crore loss in the previous year, though revenue declined 32% to Rs 108 crore.",
            "Sentiment": "positive",
            "PublishDate": 1759743876356,
            "Source": "stock"
        },
        {
            "Title": "KIOCL Reports Narrowed Net Loss Despite Revenue Decline in Q1",
            "Summary": "KIOCL reported a net loss of 378 million rupees in Q1, which was lower than the previous year's loss of 507.2 million rupees. However, the company's revenue declined to 909 million rupees compared to 1.47 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1755098010291,
            "Source": "earnings"
        },
        {
            "Title": "KIOCL Limited Receives Final Approval to Exit 100% Export Oriented Unit Scheme",
            "Summary": "KIOCL Limited has received final exit approval from the Development Commissioner of Cochin Special Economic Zone to exit the 100% Export Oriented Unit (EOU) Scheme. The approval is subject to compliance with Foreign Trade Policy 2023 conditions, including settlement of customs/excise duties and taxes, execution of legal undertakings, and other statutory requirements. The company's Letter of Permission dated September 3, 1982 and Green Card issued under the EOU Scheme have been cancelled. KIOCL had been operating under the EOU scheme since October 1, 1981 for manufacturing iron ore pellets at its Panambur, Mangaluru facility. The Assistant Commissioner of Customs has certified that there are 4 cases of confirmed demands involving Rs. 36.95 crore pending in various appellate forums against KIOCL Limited. The company has executed a legal undertaking for payment of penalties that may be imposed under the Foreign Trade Act, 1992.",
            "Sentiment": "neutral",
            "PublishDate": 1754897038064,
            "Source": "stock"
        },
        {
            "Title": "KIOCL Reports Q4 Financial Results",
            "Summary": "KIOCL has reported its quarterly financial results. The company's revenue for Q4 was 2.47 billion rupees, compared to 3.7 billion rupees in the same quarter last year. KIOCL reported a net loss of 368.6 million rupees for Q4, an improvement from the 430 million rupees loss in the previous year's corresponding quarter. Compared to the previous quarter, the loss has decreased from 477.9 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1748433963000,
            "Source": "result"
        },
        {
            "Title": "No Decision on KIOCL and NMDC Merger, Says India Steel Ministry",
            "Summary": "The Indian Steel Ministry has stated that there is currently no decision regarding a merger between KIOCL (Kudremukh Iron Ore Company Limited) and NMDC (National Mineral Development Corporation). This information was reported by the Economic Times, clarifying the status of potential consolidation in the state-owned mining sector.",
            "Sentiment": "neutral",
            "PublishDate": 1741683636000,
            "Source": "corporate_action"
        },
        {
            "Title": "KIOCL Reports Q3 EBITDA Loss of 435 Million Rupees",
            "Summary": "KIOCL, a mining company, has reported a significant downturn in its financial performance for the third quarter. The company posted an EBITDA loss of 435 million rupees, contrasting sharply with the 362 million rupees gain it had reported in the same period last year. This represents a substantial year-over-year decline in the company's operational profitability.",
            "Sentiment": "negative",
            "PublishDate": 1739436947000,
            "Source": "earnings"
        },
        {
            "Title": "KIOCL Reports Significant Revenue Decline in Q3",
            "Summary": "KIOCL, a mining and mineral processing company, has reported a substantial decrease in its third-quarter revenue. The company's revenue for Q3 stood at 1.8 billion rupees, compared to 5.5 billion rupees in the same period last year, representing a significant year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1739436920000,
            "Source": "earnings"
        },
        {
            "Title": "KIOCL Reports Q3 Net Loss of 478 Million Rupees",
            "Summary": "KIOCL Limited, a public sector undertaking, has reported a net loss of 478 million rupees for the third quarter. This marks a significant downturn compared to the same period last year when the company posted a profit of 390 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1739436889000,
            "Source": "earnings"
        },
        {
            "Title": "India Steel Minister Proposes Merger of KIOCL with NMDC",
            "Summary": "The Indian Steel Minister has proposed a merger between KIOCL (Kudremukh Iron Ore Company Limited) and NMDC (National Mineral Development Corporation). The minister also stated that KIOCL is currently in a critical condition, suggesting financial or operational difficulties for the company.",
            "Sentiment": "negative",
            "PublishDate": 1737118330000,
            "Source": "corporate_action"
        },
        {
            "Title": "India Steel Ministry Proposes Merger of KIOCL and NMDC",
            "Summary": "The Indian Steel Ministry has proposed a merger between KIOCL (Kudremukh Iron Ore Company Limited) and NMDC (National Mineral Development Corporation). Following the proposed merger, NMDC aims to export iron ore pellets from KIOCL. This information comes from a government source, as reported by Reuters.",
            "Sentiment": "neutral",
            "PublishDate": 1736165443000,
            "Source": "corporate_action"
        },
        {
            "Title": "KIOCL Ltd Resumes Pellet Plant Operations in Mangalore",
            "Summary": "KIOCL Limited has announced that its pellet plant unit located in Mangalore has resumed operations. This restart of the production facility is likely to impact the company's output and potentially its financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1733374785000,
            "Source": "corporate_action"
        },
        {
            "Title": "KIOCL Reports Increased Q2 EBITDA Loss",
            "Summary": "KIOCL, a public sector mining company, has reported an EBITDA loss of 672 million rupees for the second quarter, compared to a loss of 194 million rupees in the same period last year. This represents a significant increase in the company's losses year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730290815000,
            "Source": "result"
        },
        {
            "Title": "KIOCL Reports Significant Revenue Decline in Q2",
            "Summary": "KIOCL, an Indian mining company, has reported a substantial year-over-year decrease in its second-quarter revenue. The company's revenue for Q2 stood at 159 million rupees, compared to 4.3 billion rupees in the same quarter of the previous year. This represents a dramatic decline of approximately 96% in revenue.",
            "Sentiment": "negative",
            "PublishDate": 1730290805000,
            "Source": "result"
        },
        {
            "Title": "KIOCL Reports Increased Q2 Net Loss",
            "Summary": "KIOCL Limited has reported a net loss of 692 million rupees for the second quarter, which is a significant increase from the 214 million rupee loss in the same quarter last year. The loss has also widened compared to the previous quarter's loss of 507 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1730290794000,
            "Source": "result"
        }
    ]
}