{
    "Symbol": "KIRIINDUS",
    "ISIN": "INE415I01015",
    "News": [
        {
            "Title": "Kiri Industries Files Q3 FY26 Monitoring Report",
            "Summary": "Kiri Industries submitted monitoring agency report for December 31, 2025 quarter showing utilization of Rs 2.16 crore from preferential issue proceeds towards legal fees, with Rs 93.61 crore remaining unutilized.",
            "Sentiment": "neutral",
            "PublishDate": 1770906190333,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kiri Industries Q3 FY26 Earnings Call on Feb 11",
            "Summary": "Kiri Industries Limited announces earnings conference call scheduled for February 11, 2026 at 10:30 AM IST to discuss Q3/9M-FY26 financial performance with investors and general public.",
            "Sentiment": "neutral",
            "PublishDate": 1770283223379,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kiri Industries Issues LOI for Hybrid Power Project",
            "Summary": "Kiri Industries Limited issued Letter of Intent for INR 100.80 crore hybrid power project installation in Gujarat with 9.45 MW wind and 8 MW solar capacity, expected commissioning within 10 months.",
            "Sentiment": "positive",
            "PublishDate": 1769605948829,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kiri Industries' Subsidiary Gets PLI Scheme Approval",
            "Summary": "Indo Asia Copper Limited, a subsidiary of Kiri Industries, received approval under the Production Linked Incentive Scheme for White Goods with a committed investment of ₹258.97 crore for copper tubes manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1769597864505,
            "Source": "stocks"
        },
        {
            "Title": "Kiri Industries Approves $168M Investment in Subsidiary",
            "Summary": "Kiri Industries Limited board approves additional USD 168 million investment in wholly owned Singapore subsidiary Claronex Holdings to enable debt repayment and business operations.",
            "Sentiment": "positive",
            "PublishDate": 1767441173471,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kiri Industries Gets $689.03M From DyStar Stake Sale",
            "Summary": "Kiri Industries receives $689.03 million from the sale of its stake in DyStar, marking a significant divestment for the chemicals company.",
            "Sentiment": "positive",
            "PublishDate": 1767356376952,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kiri Industries Receives $689M from DyStar Sale",
            "Summary": "Kiri Industries receives full US$689.03 million consideration from DyStar stake sale, concluding decade-long legal battle that began in 2015 with court-awarded interest and costs.",
            "Sentiment": "positive",
            "PublishDate": 1767170195830,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kiri Industries Rejects DyStar Stake Proposal",
            "Summary": "Kiri Industries has rejected receivers' new proposal for DyStar stake, citing cash concerns and uncertainty. The company opposes deadline extension to March 2026.",
            "Sentiment": "negative",
            "PublishDate": 1765857680419,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kiri Industries Q2 FY26 Results: DyStar Sale Deadline Extended to December 1, Copper Project Progresses",
            "Summary": "Kiri Industries reported Q2 FY26 standalone revenue of Rs. 195 crores (34% YoY growth) but posted net loss of Rs. 21 crores due to elevated legal expenses from ongoing DyStar litigation. The DyStar sale deadline has been extended to December 1, 2025, with Longsheng required to deposit additional USD 5.11 million in escrow, while the company's copper project at Jafrabad advances with 70% fund utilization and trial production targeted for December 2028.",
            "Sentiment": "neutral",
            "PublishDate": 1763123476597,
            "Source": "earnings"
        },
        {
            "Title": "Kiri Industries Reports Monitoring Agency Assessment for Preferential Issue Proceeds Utilization",
            "Summary": "Kiri Industries Limited submitted a monitoring agency report from CRISIL Ratings for the quarter ended September 30, 2025, regarding utilization of proceeds from its preferential issue of convertible warrants. The company raised Rs 492.02 crores through the preferential issue conducted from September 27 to October 15, 2024. Out of Rs 398.88 crores received so far, Rs 396.25 crores has been utilized across five objectives: debt repayment (Rs 122.35 crores utilized out of Rs 125 crores allocated), working capital requirements (Rs 147.77 crores out of Rs 150.02 crores), legal/professional fees for Singapore case (Rs 34.92 crores out of Rs 50 crores), financial assistance to group companies (Rs 70 crores out of Rs 117 crores), and general corporate purposes (Rs 21.21 crores out of Rs 50 crores). The remaining Rs 2.63 crores is held in fixed deposits. An additional Rs 93.14 crores is expected from warrant holders who have 18 months from allotment date to convert warrants into equity shares. The monitoring agency reported no deviations from disclosed objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1762568257992,
            "Source": "corporate_action"
        },
        {
            "Title": "Kiri Industries Expands Into Copper Smelting and Fertilizer Sectors Through Indo Asia Copper Ltd",
            "Summary": "Kiri Industries is pursuing diversified growth by entering the copper smelting and fertilizer sectors through Indo Asia Copper Ltd. The company leverages its core strength in dyes and chemicals, with exports reaching over 50 countries. Kiri Industries plans to strengthen backward integration and expand its specialty chemical offerings. The company is focusing on sustainability and value-added segments to build a global specialty materials platform.",
            "Sentiment": "positive",
            "PublishDate": 1762526775601,
            "Source": "stock"
        },
        {
            "Title": "Kiri Industries Reports Mixed Q2 Results with Revenue Growth but Declining Profitability",
            "Summary": "Kiri Industries reported quarterly revenue of 2.1 billion rupees, up from 1.7 billion rupees in the same period last year. However, the company's consolidated net profit declined significantly to 200 million rupees from 803 million rupees year-over-year. The company also posted an EBITDA loss of 137 million rupees, wider than the 46 million rupee loss recorded in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762504603795,
            "Source": "earnings"
        },
        {
            "Title": "Kiri Industries' DyStar Share Sale Faces Further Delay as Buyer Misses Regulatory Approval Deadlines",
            "Summary": "Kiri Industries announced that Zhejiang Longsheng Group has failed to meet conditions for acquiring the company's 37.57% stake in DyStar Global Holdings (Singapore) for USD 676.26 million. The purchaser missed both the original deadline of October 2, 2025, and the extended deadline of November 3, 2025, primarily due to failure to obtain regulatory approvals. Court-appointed receivers have granted another extension until December 1, 2025, requiring an additional deposit of USD 5.11 million into escrow, adding to the USD 3.48 million previously paid. The transaction involves 2,623,354 equity shares with additional consideration of USD 20.29 million potentially payable. Kiri Industries is seeking legal counsel to protect its rights in the matter.",
            "Sentiment": "negative",
            "PublishDate": 1762339777136,
            "Source": "order&deals"
        },
        {
            "Title": "Kiri Industries Schedules Earnings Conference Call for Q2/H1-FY26 Results",
            "Summary": "Kiri Industries Limited has announced an earnings conference call to discuss its financial performance for the quarter and half-year ended September 30, 2025. The virtual conference call is scheduled for Friday, November 7, 2025, at 5:30 PM IST. The management team will be represented by Chairman and Managing Director Manish Kiri, Vice-President Accounts and Finance Jayesh Hirani, Company Secretary Suresh Gondalia, and CEO of Indo Asia Copper Limited Ranjit Singh Chugh. The company has provided dial-in details including universal and international toll-free numbers for various countries. The company stated that no unpublished price sensitive information will be shared during the meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1762149053345,
            "Source": "earnings"
        },
        {
            "Title": "Kiri Industries Submits Investor Presentation for September 18, 2025 Meeting",
            "Summary": "Kiri Industries Limited submitted an investor presentation to stock exchanges for an upcoming investors/analyst group meeting scheduled for September 18, 2025, at 11:00 A.M. (IST). The presentation covers the company's operations as a manufacturer and exporter of dyes, dye intermediates, and basic chemicals from India. Key financial highlights for FY25 show operational revenue of INR 7,400 million, negative EBITDA of INR 540 million, and negative PAT of INR 1,084 million. The company operates manufacturing facilities in Gujarat and has a market capitalization of approximately INR 39,958.84 million as of June 30, 2025. The presentation also details the company's diversification into copper smelting and fertilizer sectors through subsidiary Indo Asia Copper Ltd., with an estimated project cost of INR 10,661 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1758113589195,
            "Source": "stock"
        },
        {
            "Title": "Kiri Industries Reports 8% Revenue Growth in Q1 FY26, DyStar Sale Expected by October 2025",
            "Summary": "Kiri Industries Limited reported standalone revenue of Rs. 181 crores in Q1 FY26, reflecting 8% year-on-year growth. EBITDA increased to Rs. 17.3 crores from Rs. 13.6 crores in the same quarter last year. The company posted a profit after tax of Rs. 7.2 crores compared to a loss of Rs. 1.7 crores in Q1 FY25. On consolidated basis, revenue reached Rs. 202 crores with 10% growth. The DyStar share sale agreement with Zhejiang Longsheng Group for $696 million remains on track with completion expected by October 2, 2025, extendable to November 3, 2025. The company is developing a copper project at Pipavav Port, Gujarat, with partial operations expected to begin in FY27, targeting Rs. 12,000 crores revenue in the first operational year. Management revised revenue guidance downward by 20% to Rs. 800-900 crores standalone and Rs. 1,200-1,300 crores consolidated due to ongoing industry headwinds. Legal costs for the quarter were approximately Rs. 7 crores. The company plans to invest half of DyStar sale proceeds into the copper project as equity.",
            "Sentiment": "neutral",
            "PublishDate": 1755518969788,
            "Source": "earnings"
        },
        {
            "Title": "Kiri Industries Promoters Convert 4.39 Million Warrants to Equity Shares",
            "Summary": "Manishkumar P Kiri, representing the promoter group of Kiri Industries Limited, disclosed the allotment of 4,393,592 equity shares through warrant conversion on a preferential basis. The Board of Directors approved this conversion on August 11, 2025. Following this transaction, the promoter group's voting rights increased from 6.82% to 13.64% of total share capital. The company's equity share capital expanded from Rs. 556.29 crore (55.63 million shares) to Rs. 600.23 crore (60.02 million shares). The promoter group includes Manishkumar P Kiri, Anupama Manishkumar Kiri, Arunaben Pravinbhai Kiri, and Hemil Manishkumar Kiri as acquirers, along with several persons acting in concert. Kiri Industries shares are listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1754985132070,
            "Source": "corporate_action"
        },
        {
            "Title": "Kiri Industries Provides Audio Recording Link for Q1-FY26 Earnings Conference Call",
            "Summary": "Kiri Industries Limited made available an audio recording link for their Q1-FY26 earnings conference call held on August 11, 2025, at 5:00 PM IST. The call was conducted on a group meet basis to discuss quarterly financial performance. Company Secretary Suresh Gondalia signed off on the disclosure, which complies with SEBI Listing Obligations and Disclosure Requirements under Regulation 30.",
            "Sentiment": "neutral",
            "PublishDate": 1754922119787,
            "Source": "earnings"
        },
        {
            "Title": "Kiri Industries Reports Q1-FY26 Results with Mixed Performance Amid DyStar Sale Process",
            "Summary": "Kiri Industries Limited reported Q1-FY26 results showing consolidated revenue of INR 2,021 million, up 10.2% year-over-year. However, the company posted a consolidated net loss of INR 514 million compared to INR 11 million loss in the previous year, with EBITDA margin at negative 8.07%. On a standalone basis, revenue reached INR 1,808 million with a net profit of INR 72 million and positive PAT margin of 3.98%. The company's performance was impacted by pricing pressures from market competition, raw material cost inflation, and legal expenses related to ongoing proceedings against Longsheng Group. Meanwhile, Kiri has entered into a Share Purchase Agreement dated May 29, 2025, for the sale of its 37.57% stake in DyStar to Zhejiang Longsheng Group for a base consideration of USD 676.26 million, with transaction completion expected by October 2, 2025. The company's revenue breakdown shows 48% from dye intermediates, 39% from dyes, and 13% from basic chemicals.",
            "Sentiment": "neutral",
            "PublishDate": 1754907733532,
            "Source": "earnings"
        },
        {
            "Title": "Kiri Industries Appoints New Secretarial Auditor for 5-Year Term",
            "Summary": "Kiri Industries Limited has changed its Secretarial Auditor following the completion of M/s. Kashyap R. Mehta & Associates' tenure for F.Y. 2024-25. The outgoing auditor expressed unwillingness to continue for the subsequent financial year. The Board of Directors approved the appointment of M/s. Kashyap R. Mehta & Partners as the new Secretarial Auditor for a 5-year term from F.Y. 2025-26 to F.Y. 2029-30, subject to shareholder approval at the upcoming Annual General Meeting. The new firm is led by Mr. Kashyap Mehta, who has four decades of experience and offers comprehensive corporate, secretarial, regulatory compliance services, and SEBI-related advisory services to both listed and unlisted clients.",
            "Sentiment": "neutral",
            "PublishDate": 1754897954927,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kiri Industries Reports Mixed Q1 Results with Revenue Growth but Sharp Profit Decline",
            "Summary": "Kiri Industries reported Q1 revenue of 2 billion rupees, up from 1.8 billion rupees in the same quarter last year. However, the company's consolidated net profit dropped significantly to 101 million rupees compared to 922 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754896351362,
            "Source": "earnings"
        },
        {
            "Title": "Kiri Industries Incorporates Step-Down Subsidiary in China with $5 Million Capital",
            "Summary": "Kiri Industries Limited has established Shanghai Claronex Technology Co Ltd as a step-down wholly owned subsidiary in China through its subsidiary Claronex Holdings Pte. Ltd. The new entity was incorporated on July 31, 2025, with a registered capital of $5 million and is yet to commence business operations. Shanghai Claronex Technology will engage in technical services, engineering management services, consultancy services, trading and allied activities. The subsidiary was created to explore future business opportunities and potentially expand operations. Kiri Industries holds 100% shareholding in the new entity through cash consideration.",
            "Sentiment": "positive",
            "PublishDate": 1754656668978,
            "Source": "corporate_action"
        },
        {
            "Title": "Kiri Industries Sells 37.57% Stake in DyStar to Longsheng for $676.3 Million",
            "Summary": "Kiri Industries has finalized a deal to sell its 37.57% stake in DyStar to Longsheng for $676.3 million. The agreement includes a potential additional payment of $20.3 million. This transaction is described as a significant achievement in resolving a long-standing issue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1749199579000,
            "Source": "default"
        },
        {
            "Title": "Kiri Industries: Q4 Loss Widens, Sells DyStar Stake for $676 Million",
            "Summary": "Kiri Industries reported a Q4 net loss of ₹84.6 crore, wider than last year's ₹9.6 crore loss. Revenue dropped 6.5% to ₹205 crore. The company agreed to sell its 37.57% stake in DyStar to Zhejiang Longsheng Group for $676.26 million, with potential additional payment of $20.29 million.",
            "Sentiment": "negative",
            "PublishDate": 1748593140000,
            "Source": "earnings"
        },
        {
            "Title": "Kiri Industries Reports Q4 Financial Results",
            "Summary": "Kiri Industries has released its Q4 financial results. The company reported revenue of 2.1 billion rupees, down from 2.2 billion rupees in the same quarter last year. EBITDA showed improvement, with a gain of 11 million rupees compared to a loss of 72 million rupees in the previous year. The EBITDA margin increased to 5.48% from 3.47% year-over-year. However, the consolidated net loss widened to 850 million rupees from 96 million rupees in the same quarter last year.",
            "Sentiment": "mixed",
            "PublishDate": 1748591231000,
            "Source": "result"
        },
        {
            "Title": "Kiri Industries: Sells 37% Stake in DyStar for $676 Million",
            "Summary": "Kiri Industries has agreed to sell its 37.57% stake in DyStar Global to Zhejiang Longsheng Group for $676.26 million, with a potential additional $20.29 million. The deal value exceeds Kiri's current market cap of ₹3,800 crore. The transaction is subject to closing conditions and regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1748578899000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kiri Industries Signs $676 Million Agreement to Sell 37.57% Stake in DyStar",
            "Summary": "Kiri Industries has signed a share purchase agreement to sell 37.57% of its stake in DyStar to Zhejiang Longsheng for $676 million (approximately Rs 5,630 crore). The deal includes a potential additional consideration of $20.29 million payable by the purchaser.",
            "Sentiment": "positive",
            "PublishDate": 1748577508000,
            "Source": "default"
        },
        {
            "Title": "Kiri Industries Reports Increased Q3 EBITDA Loss",
            "Summary": "Kiri Industries has reported an EBITDA loss of 444 million rupees for the third quarter, compared to a loss of 208 million rupees in the same period last year. This represents a significant increase in the company's losses year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739432810000,
            "Source": "earnings"
        },
        {
            "Title": "Kiri Industries Reports Increased Q3 Consolidated Net Profit",
            "Summary": "Kiri Industries has reported a consolidated net profit of 1.77 billion rupees for the third quarter, showing an increase from 1.26 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739432104000,
            "Source": "earnings"
        },
        {
            "Title": "Singapore Court Upholds Kiri Industries' Buyout Award",
            "Summary": "The Singapore Court has rejected an appeal by Senda International Capital against a previous ruling in favor of Kiri Industries. The court has awarded interest on a USD 603.8 million buyout amount to Kiri Industries, reinforcing the original decision.",
            "Sentiment": "positive",
            "PublishDate": 1738300002000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kiri Industries Reports Significant EBITDA Improvement in Q2",
            "Summary": "Kiri Industries has reported a substantial improvement in its Q2 EBITDA, turning a loss of 99 million rupees in the previous year into a gain of 171 million rupees. The company's Q2 EBITDA margin stands at 6.26%.",
            "Sentiment": "positive",
            "PublishDate": 1731481664000,
            "Source": "result"
        },
        {
            "Title": "Kiri Industries Reports Q2 Revenue Growth",
            "Summary": "Kiri Industries has announced its second quarter revenue for the current fiscal year. The company reported revenue of 2.7 billion rupees, compared to 2.3 billion rupees in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731481542000,
            "Source": "result"
        },
        {
            "Title": "Kiri Industries Reports Significant Profit Increase in Q2",
            "Summary": "Kiri Industries has reported a substantial increase in consolidated net profit for the second quarter. The company's net profit rose to 803 million rupees, up from 188 million rupees in the same period last year, marking a 327% year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731481508000,
            "Source": "result"
        },
        {
            "Title": "Kiri Industries Approves Warrant Issue at Rs 369 Per Share",
            "Summary": "<p><span class='neutral'>Kiri Industries</span> has received <span class='positive'>in-principle approval</span> for the issue and allotment of <b>1.33 crore warrants</b> at a price of <b>Rs 369 per share</b>. This <span class='neutral'>corporate action</span> indicates a potential <span class='positive'>increase in the company's capital</span> and may signal <span class='positive'>confidence in its future prospects</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728884915000,
            "Source": "corporate_action"
        }
    ]
}