{
    "Symbol": "KIRLPNU",
    "ISIN": "INE811A01020",
    "News": [
        {
            "Title": "Kirloskar Pneumatic Selected for PLI White Goods Scheme",
            "Summary": "Kirloskar Pneumatic Company has been provisionally chosen by the Indian government in the latest round of the Production Linked Incentive scheme for white goods manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1769175430587,
            "Source": "stocks"
        },
        {
            "Title": "Kirloskar Pneumatic Grants 8,000 Stock Options",
            "Summary": "Kirloskar Pneumatic Company Limited's board committee approved granting 8,000 stock options to eligible employees under its 2019 ESOP scheme with an exercise price of ₹840 per option.",
            "Sentiment": "positive",
            "PublishDate": 1769165839700,
            "Source": "stocks"
        },
        {
            "Title": "Kirloskar Pneumatic Q3FY26 Results & Leadership Change",
            "Summary": "Kirloskar Pneumatic reports Q3FY26 standalone net profit of ₹431 cr, declares ₹3.50 interim dividend, and appoints Aman Rahul Kirloskar as new Managing Director effective April 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769160355538,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kirloskar Systems acquires 20 shares in T Care India",
            "Summary": "Kirloskar Systems Private Limited disclosed acquisition of 20 shares carrying voting rights in T Care India Limited through open market purchase on December 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766211543685,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kirloskar Pneumatic Allots 24,500 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Kirloskar Pneumatic Company's Stakeholders Relationship Committee approved allotment of 24,500 equity shares of Rs. 2 face value each to eligible employees who exercised stock options under KPCL Employee Stock Option Scheme 2019. The company's paid-up share capital increased to Rs. 12,98,79,180 comprising 6,49,39,590 equity shares, with the new shares ranking equally with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764409375413,
            "Source": "corporate_action"
        },
        {
            "Title": "Tata Mutual Fund Increases Stake in Kirloskar Pneumatic to 7.09%",
            "Summary": "Tata Mutual Fund acquired 62,531 shares of Kirloskar Pneumatic Co. Ltd through secondary market purchase, increasing its holding from 6.99% to 7.09%. The acquisition involves multiple Tata fund schemes including Multicap Fund, ELSS Fund, and Retirement Savings Funds, representing a strategic increase in the pneumatic equipment manufacturer.",
            "Sentiment": "neutral",
            "PublishDate": 1763981151263,
            "Source": "stock"
        },
        {
            "Title": "Kirloskar Pneumatic Receives Customs Order for Rs 1.19 Crore Differential Duty Demand",
            "Summary": "Kirloskar Pneumatic Company received an order from Principal Commissioner of Customs (Imports) demanding differential duty of Rs 1,19,35,360 and equal penalty due to re-assessment of imported goods classification under Custom Tariff Heading. The company plans to file an appeal against the order and does not foresee material impact on its financial operations or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1763101430720,
            "Source": "stock"
        },
        {
            "Title": "Kirloskar Pneumatic Reports Challenging H1 FY26 with Sales Down to INR 650 Crores",
            "Summary": "Kirloskar Pneumatic Company Limited reported sales of INR 650 crores in H1 FY26, down from INR 706 crores in the previous year. The company faced challenges across order booking, sales, and execution, with order book at INR 1,667 crores as of October 1st compared to INR 1,624 crores in April. EBITDA for H1 stood at INR 109 crores (16.4%) versus 20% in H1 FY25. The gas compression segment was particularly impacted, with the company losing market share in CNG packages due to competitive pricing pressures. However, the Tezcatlipoca centrifugal compressor showed strong performance with 115 orders this year, of which 88 have been delivered. The company expects strong double-digit growth for the full year and has applied under the production-linked incentive scheme to enter the commercial air conditioning market with its Zephyros C system, targeting a INR 5,000 crore market opportunity. Management maintains confidence in achieving over 15% revenue growth for FY26.",
            "Sentiment": "negative",
            "PublishDate": 1762195083159,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Pneumatic Announces Senior Management Change Due to Superannuation",
            "Summary": "Kirloskar Pneumatic Company Limited announced that Mr. Sanjay Grover, Vice President-IBD, ceased his position due to superannuation on November 1, 2025. The material event occurred post working hours on Saturday, November 1, 2025. The company disclosed this change in senior management personnel as required under SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762004879530,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kirloskar Pneumatic Reports Decline in Q2 Financial Performance",
            "Summary": "Kirloskar Pneumatic Company reported quarterly revenue of 3.78 billion rupees, down from 4.3 billion rupees in the same period last year. The company's net profit decreased to 432 million rupees from 675 million rupees year-over-year. EBITDA fell to 581 million rupees compared to 936 million rupees previously, with EBITDA margin contracting to 15.37% from 21.73% in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1761640873478,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Pneumatic Reports Q2 FY26 Results with Revenue of Rs 6,501 Million",
            "Summary": "Kirloskar Pneumatic Company Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported revenue from operations of Rs 6,501 million compared to Rs 2,817 million in the previous quarter. Net profit for the quarter stood at Rs 713 million versus Rs 944 million in the prior quarter. On a consolidated basis, revenue reached Rs 6,681 million with net profit of Rs 2,113 million for the half-year period. The company's Compression Systems segment generated revenue of Rs 3,464 million during the quarter. Earnings per share on a standalone basis was Rs 10.98 for the quarter. The company allotted 17,700 equity shares under its ESOS 2019 scheme during the half-year period, with 1,600 shares allotted on September 15, 2025, and listed on October 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761640793318,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Pneumatic Shareholders Approve Re-appointment of Independent Director Through Postal Ballot",
            "Summary": "Kirloskar Pneumatic Company Limited completed a postal ballot process on September 25, 2025, where shareholders voted on the re-appointment of Mr. Tejas Deshpande as an Independent Director for a second term of five years. The special resolution was passed with 83.66% of valid votes in favor and 16.34% against. A total of 404 shareholders participated in the remote e-voting process, representing 4,57,12,047 shares. The voting period ran from August 27 to September 25, 2025, with CS Sridhar Mudaliar of SVD & Associates serving as the scrutinizer. The company has 71,056 total shareholders as of the cut-off date of August 22, 2025. The postal ballot notice was dispatched on August 25, 2025, and the results were declared following regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1758892552705,
            "Source": "corporate_action"
        },
        {
            "Title": "Kirloskar Pneumatic Approves Re-appointment of Independent Director Tejas Deshpande for Second 5-Year Term",
            "Summary": "Kirloskar Pneumatic Company Limited's Board of Directors approved the re-appointment of Mr. Tejas Deshpande as an Independent Director for a second consecutive term of 5 years, effective from October 27, 2025 to October 26, 2030. The decision was made based on recommendations from the Nomination and Remuneration Committee and requires shareholder approval through postal ballot. Mr. Deshpande, aged 44 years, is a lawyer with nearly two decades of experience practicing in Mumbai High Court and Supreme Court of India, specializing in real estate, infrastructure and company law. He has contributed to legal publications including research work on Indian Contract Act. The company confirmed that Mr. Deshpande is not related to any other Board directors and is not debarred from holding directorship by any regulatory authority.",
            "Sentiment": "neutral",
            "PublishDate": 1755324199787,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kirloskar Pneumatic Q1 FY26 Results: Revenue Flat at Rs 272 Crores, Management Expects Recovery by Q3",
            "Summary": "Kirloskar Pneumatic Company reported Q1 FY26 sales of Rs 272 crores, matching previous year levels. The company faced challenges including global economic uncertainty, delayed order finalization, and supply chain issues with European suppliers, particularly Howden compressors. Despite the slow start, management maintains its Rs 2,000 crore revenue target for the year, expecting gradual improvement in Q2 and recovery to planned numbers by Q3. The company achieved several positives including net working capital below 12% of sales for the first time, cash flow generation of over Rs 100 crores, and new order bookings of Rs 365 crores. EBITDA margins remained stable at 15.7% with profit after tax growing to Rs 28.1 crores. The company launched new products including Tezcatlipoca centrifugal compressors expecting Rs 100 crore orders and Tyche semi-hermetic compressors for commercial refrigeration. Management cited structural challenges in the oil and gas sector but noted strong demand for CNG packages globally and continued focus on in-house manufacturing capabilities.",
            "Sentiment": "neutral",
            "PublishDate": 1753872247318,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Pneumatic's Independent Director Mrs Nalini Venkatesh Steps Down After Completing Five-Year Tenure",
            "Summary": "Mrs Nalini Venkatesh has ceased to be an Independent Director of Kirloskar Pneumatic Company Limited upon completion of her five-year tenure on July 24, 2025. She was re-appointed through postal ballot on July 30, 2020 for a second term of five consecutive years from July 25, 2020 to July 24, 2025. Along with her directorship, she also steps down from her roles as a member of the Corporate Social Responsibility Committee and Stakeholders' Relationship Committee. The company has expressed appreciation for her contribution during her tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1753428080556,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kirloskar Pneumatic Appoints Varsha Vasant Purandare as Independent Director for 5-Year Term",
            "Summary": "Kirloskar Pneumatic Company Limited shareholders approved the appointment of Ms. Varsha Vasant Purandare as an Independent Director at their Annual General Meeting held on July 22, 2025. The appointment is effective from April 24, 2025 to April 23, 2030, spanning a five-year term. The decision was passed through a Special Resolution during the shareholder meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1753273156098,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kirloskar Pneumatic Reports Q1 FY26 Results with 13.1% EBITDA Margin and Rs 1,725 Crore Order Book",
            "Summary": "Kirloskar Pneumatic Company Limited reported quarterly results with total income of Rs 280.24 crores and profit before tax of Rs 36.81 crores, representing a 15.7% margin. The company achieved an EBITDA of Rs 37 crores with a 13.1% margin and profit after tax of Rs 28 crores at 10% margin. The company maintains an order book of Rs 1,725 crores. The compression segment contributes approximately 90% of total revenue and primarily serves the petrochemical, oil and gas sectors. Key developments include the launch of Tyche, a semi-hermetic reciprocating refrigeration compressor, and the establishment of a lost foam castings foundry at the Nashik division with 2,400 tonnes annual melting capacity. Net working capital to sales ratio stands at 11.30%.",
            "Sentiment": "positive",
            "PublishDate": 1753260813116,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Pneumatic Reports Mixed Q1 Results with Revenue Decline but Profit Growth",
            "Summary": "Kirloskar Pneumatic Company reported Q1 revenue of 2.72 billion rupees, down from 2.75 billion rupees in the same period last year. The company's net profit increased to 281 million rupees compared to 269 million rupees year-over-year. EBITDA declined to 358 million rupees from 392 million rupees, with EBITDA margin falling to 13.16% from 14.26% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753171053778,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Pneumatic Company Limited: Declares ₹3.50 Interim Dividend for FY25",
            "Summary": "Kirloskar Pneumatic announced an interim dividend of ₹3.50 per share (175%) for FY25. Record date is set for February 7, 2025, with payment scheduled by February 25, 2025. Q3FY25 results show 3% YoY increase in PAT to ₹36 crore, while total income rose 11% YoY to ₹346 crore.",
            "Sentiment": "positive",
            "PublishDate": 1738218883000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kirloskar Pneumatic Company: Q3 Profit Up 4.26%, Revenue Rises 11.06%",
            "Summary": "Kirloskar Pneumatic Company reported Q3 FY25 results with profit at ₹36.43 crore, up 4.26% YoY, and revenue at ₹342.63 crore, up 11.06% YoY. The company declared an interim dividend of ₹3.5 with a record date of 07 Feb, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1738217195000,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Pneumatic Co Reports Q3 Financial Results",
            "Summary": "Kirloskar Pneumatic Co has reported its Q3 financial results. The company's EBITDA for the quarter was 486 million rupees, compared to 526 million rupees in the same quarter last year. The EBITDA margin decreased to 14.28% from 17.06% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738053700000,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Pneumatic Co Reports Q3 Net Profit of 359 Million Rupees",
            "Summary": "Kirloskar Pneumatic Co has announced its financial results for the third quarter. The company reported a net profit of 359 million rupees, compared to 349 million rupees in the same period last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738053675000,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Pneumatic to Consider Q3 Results on January 28",
            "Summary": "Kirloskar Pneumatic Company Limited has announced that it will consider its third quarter (Q3) financial results on January 28. This indicates the company is preparing to disclose its performance for the most recent fiscal quarter to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1737384794000,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Pneumatic Acquires Majority Stake in Systems and Components (India)",
            "Summary": "Kirloskar Pneumatic has acquired a 55.26% stake in Systems and Components (India) for 155 million rupees. This acquisition represents a significant corporate action, potentially expanding Kirloskar Pneumatic's business operations or market presence.",
            "Sentiment": "neutral",
            "PublishDate": 1733319670000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kirloskar Pneumatic Reports Significant Q2 EBITDA Growth",
            "Summary": "Kirloskar Pneumatic Company has reported a substantial increase in its Q2 EBITDA, rising to 935 million rupees from 317 million rupees year-over-year. The company's EBITDA margin also improved significantly, reaching 21.72% compared to 11.23% in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1729845385000,
            "Source": "result"
        },
        {
            "Title": "Kirloskar Pneumatic Reports Strong Q2 Financial Results",
            "Summary": "Kirloskar Pneumatic Company has reported significant year-over-year growth in its Q2 financial results. The company's net profit increased to 675 million rupees from 202 million rupees in the same quarter last year. Revenue also saw substantial growth, rising to 4.3 billion rupees from 2.8 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729845289000,
            "Source": "result"
        }
    ]
}