{
    "Symbol": "KIRLOSIND",
    "ISIN": "INE250A01039",
    "News": [
        {
            "Title": "Kirloskar Ferrous declares ₹3 interim dividend",
            "Summary": "Kirloskar Ferrous Industries announces interim dividend of ₹3 per equity share for FY2025-26 with record date February 16, 2026 and payment by March 6, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770730693564,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kirloskar Ferrous Q3FY26 Earnings Call on Feb 11",
            "Summary": "Kirloskar Ferrous Industries has scheduled a conference call on February 11, 2026 at 3:00 p.m. IST to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770491720563,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kirloskar Industries Director D. Sivanandhan Steps Down",
            "Summary": "Kirloskar Industries announces cessation of Independent Director Mr. D. Sivanandhan on February 3, 2026, following completion of his second term upon reaching age 75 years.",
            "Sentiment": "neutral",
            "PublishDate": 1770097696264,
            "Source": "stocks"
        },
        {
            "Title": "Kirloskar Industries Reports KFIL Share Allotment",
            "Summary": "Kirloskar Industries' subsidiary KFIL allots 30,685 equity shares under employee stock option scheme, increasing paid-up capital to ₹82.44 crores with 16.49 crore shares outstanding.",
            "Sentiment": "neutral",
            "PublishDate": 1767792046601,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kirloskar Industries Appoints New Head HR",
            "Summary": "Kirloskar Industries Limited announces the appointment of Rohan Sapkal as Head Human Resources effective January 1, 2026, along with multiple board appointments and CFO designation.",
            "Sentiment": "positive",
            "PublishDate": 1767245031844,
            "Source": "stocks"
        },
        {
            "Title": "Kirloskar Industries HR Head Jagdish Purandare Resigns",
            "Summary": "Kirloskar Industries announces resignation of Head - Human Resource Jagdish Purandare, effective December 31, 2025, as he takes up new role within Kirloskar Group.",
            "Sentiment": "neutral",
            "PublishDate": 1767244739018,
            "Source": "stocks"
        },
        {
            "Title": "Kirloskar Industries Reports KFIL Plant Operations Resume",
            "Summary": "Kirloskar Industries announced that material subsidiary KFIL has resumed operations at its Jejuri plant from January 13, 2026, following completion of upgrade activities.",
            "Sentiment": "positive",
            "PublishDate": 1766819928151,
            "Source": "stocks"
        },
        {
            "Title": "Kirloskar Industries Allots 6,206 Shares Under ESAR Plan",
            "Summary": "Kirloskar Industries Limited allotted 6,206 equity shares under its Employee Stock Appreciation Rights Plan 2019, increasing paid-up share capital to ₹10.51 crores from ₹10.50 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1766553011056,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kirloskar Industries Reports Share Acquisition",
            "Summary": "Geetanjali Vikram Kirloskar acquired shares in Kirloskar Industries through open market purchase on December 17, 2025, as disclosed under SEBI substantial acquisition regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1766210909138,
            "Source": "stocks"
        },
        {
            "Title": "Kirloskar Industries Updates on Subsidiary Plant Status",
            "Summary": "Kirloskar Industries Limited informed exchanges about material subsidiary Kirloskar Ferrous Industries' continued suspension of Hiriyur plant operations for maintenance activities.",
            "Sentiment": "neutral",
            "PublishDate": 1765457173451,
            "Source": "stocks"
        },
        {
            "Title": "Kirloskar Industries CFO Bharathan Gopalakrishnan Takes Additional Role at Subsidiary Avante Spaces",
            "Summary": "Bharathan Gopalakrishnan, Chief Financial Officer of Kirloskar Industries Limited, has been appointed as CFO of the company's wholly-owned subsidiary Avante Spaces Limited effective December 3, 2025. The appointment was approved by Avante's Board of Directors based on recommendations from the Nomination and Remuneration Committee and Audit Committee, with Gopalakrishnan bringing over 18 years of experience in banking, financial services, and project financing.",
            "Sentiment": "positive",
            "PublishDate": 1764747535592,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kirloskar Industries Initiates Postal Ballot for Three Director Appointments",
            "Summary": "Kirloskar Industries Limited has announced a postal ballot process to seek shareholder approval for appointing three directors - Sumit Mitra and Sathyamoorthy Venkataramani as Independent Directors for five-year terms, and Rahul Kirloskar as Non-Independent Non-Executive Director. The remote e-voting period runs from 23 November 2025 to 28 December 2025, with Mrs. Manasi Paradkar appointed as scrutinizer for the voting process.",
            "Sentiment": "neutral",
            "PublishDate": 1764416002467,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kirloskar Ferrous Reports Mixed Q2 FY26 Results with Strong Tube Growth Offsetting Pig Iron Margin Pressure",
            "Summary": "Kirloskar Ferrous Industries achieved 9.4% growth in PBT to INR 126 crores and EBITDA growth to INR 214 crores despite pig iron prices dropping 11% to INR 37,098 per metric ton. The company delivered strong performance in tubes with 24% volume growth and 18% value growth, while pig iron margins remain under severe pressure with the company not covering costs in the segment.",
            "Sentiment": "neutral",
            "PublishDate": 1763386022945,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Industries Reports Mixed Quarterly Performance with Strong Profit Growth",
            "Summary": "Kirloskar Industries Limited announced unaudited financial results for the quarter ended 30 September 2025, showing total income of ₹56.20 crores (standalone) and ₹1,791.41 crores (consolidated) with profit after tax of ₹39.56 crores and ₹98.49 crores respectively. The results were approved by the Board of Directors on 14 November 2025, with basic earnings per share of ₹37.98 (standalone) and ₹49.55 (consolidated), though other comprehensive income showed significant negative impact in the standalone results.",
            "Sentiment": "positive",
            "PublishDate": 1763194591374,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Ferrous Q2 Net Profit Rises 11% to ₹86.2 Crore on Revenue Growth",
            "Summary": "Kirloskar Ferrous Industries reported net profit of ₹86.2 crore for the quarter ended September 2025, an 11% increase from ₹77.6 crore in the same period last year. Revenue from operations grew 5.3% to ₹1,755 crore from ₹1,666 crore year-on-year. EBITDA increased 11% to ₹215.3 crore compared to ₹194 crore previously, with EBITDA margin improving to 12.3% from 11.6%. The company is a leading producer of pig iron and grey iron castings serving automotive, engines, compressors, textiles, and pumps sectors. Shares closed 3.55% lower at ₹487.45 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1762431370237,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Industries CFO Anandh Baheti Resigns to Pursue Career Growth Opportunities",
            "Summary": "Anandh Baheti has resigned from his position as Chief Financial Officer and Key Managerial Person at Kirloskar Industries Limited and its wholly-owned subsidiary Avante Spaces Limited. Baheti tendered his resignation on August 29, 2025, citing pursuit of other career growth opportunities as the reason for his departure. He was relieved from his duties effective from the close of business hours on November 4, 2025, after serving his notice period. The company has expressed appreciation for his services and contributions during his tenure as CFO. Kirloskar Industries is currently in the process of appointing a suitable candidate for the CFO and KMP positions, with details to be shared with stock exchanges once finalized.",
            "Sentiment": "neutral",
            "PublishDate": 1762275338458,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kirloskar Ferrous Industries Allots 1.16 Lakh Equity Shares Under Employee Stock Option Schemes",
            "Summary": "Kirloskar Ferrous Industries Limited allotted 1,16,315 equity shares of ₹5 each following the exercise of stock options under its Employee Stock Option Schemes. The allotment was approved by the company's Stakeholders Relationship Committee through a circular resolution on November 3, 2025. Following this allotment, the company's issued, subscribed and paid-up share capital increased to ₹82,42,76,915, comprising 16,48,55,383 equity shares of ₹5 each. Kirloskar Industries Limited, the parent company, informed stock exchanges about this development as Kirloskar Ferrous Industries is its listed material subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1762270852671,
            "Source": "corporate_action"
        },
        {
            "Title": "Kirloskar Ferrous Industries Secures ₹358 Crore Contract from ONGC",
            "Summary": "Kirloskar Ferrous Industries Limited received a contract from Oil and Natural Gas Corporation Limited for supply of regular EUE Tubing, Pup Joints and Cross overs. The contract is valued at approximately ₹358 crores including 12% GST and runs from October 21, 2025 to October 20, 2026. The contract involves supply of products as per specifications mentioned in the agreement with a domestic entity. The transaction does not involve any promoter group interest and is not a related party transaction. Kirloskar Industries Limited, the parent company, informed stock exchanges about this material update from its listed subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1761201260394,
            "Source": "order&deals"
        },
        {
            "Title": "Kirloskar Ferrous Industries Temporarily Suspends Baramati Plant Operations for Maintenance",
            "Summary": "Kirloskar Ferrous Industries Limited (KFIL) will temporarily suspend operations at its Baramati plant in Maharashtra from October 19, 2025, for approximately 12 days to conduct annual maintenance and repairs activities. KFIL is a listed material subsidiary of Kirloskar Industries Limited. The suspension is part of scheduled maintenance work at the manufacturing facility.",
            "Sentiment": "neutral",
            "PublishDate": 1761072929822,
            "Source": "stock"
        },
        {
            "Title": "Kirloskar Ferrous Industries Temporarily Suspends Baramati Plant Operations for Maintenance",
            "Summary": "Kirloskar Ferrous Industries Limited (KFIL), a material subsidiary of Kirloskar Industries Limited, announced a temporary suspension of operations at its Baramati plant in Maharashtra starting October 19, 2025, for approximately 12 days. The suspension is for annual maintenance and repairs activities. KFIL disclosed this information under SEBI Listing Regulations, and parent company Kirloskar Industries informed stock exchanges about this update from its subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1760878778205,
            "Source": "stock"
        },
        {
            "Title": "Kirloskar Industries' Ferrous Industries Unit Halts Hiriyur Plant Operations for Maintenance",
            "Summary": "Kirloskar Industries announced that its Ferrous Industries division has temporarily suspended operations at its Hiriyur plant for a 40-day maintenance period. The planned shutdown affects the company's manufacturing activities at this facility during the maintenance window.",
            "Sentiment": "neutral",
            "PublishDate": 1760511306157,
            "Source": "stock"
        },
        {
            "Title": "Kirloskar Industries Discloses 2009 Family Settlement Deed Following SEBI Legal Clarification",
            "Summary": "Kirloskar Industries Limited disclosed a Deed of Family Settlement dated September 11, 2009, entered into by individual members of the Kirloskar family. The disclosure follows a legal clarification from SEBI obtained through Bombay High Court proceedings. The company filed a writ petition challenging constitutional validity of certain SEBI disclosure regulations. During hearings, SEBI clarified that mere disclosure of agreements does not mean the listed entity admits the agreement is binding on its management, control, or liabilities. The company emphasized it is not a party to the family settlement, has never ratified it, and does not admit it has any impact on company management or control. The family settlement involved distribution of shares across various Kirloskar Group companies among family members including Atul Kirloskar, Sanjay Kirloskar, Vikram Kirloskar, Rahul Kirloskar, and Gautam Kulkarni, with detailed share allocation schedules and financial arrangements totaling hundreds of crores.",
            "Sentiment": "neutral",
            "PublishDate": 1758866143066,
            "Source": "stock"
        },
        {
            "Title": "Kirloskar Ferrous Industries Allots 87,690 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Kirloskar Ferrous Industries Limited has allotted 87,690 equity shares of ₹5 each following the exercise of stock options under its Employee Stock Option Schemes. The Stakeholders Relationship Committee approved this allotment during its meeting on September 3, 2025. As a result, the company's issued, subscribed and paid-up share capital has increased to ₹82,36,95,340, comprising 16,47,39,068 equity shares of ₹5 each. Kirloskar Industries Limited, the parent company, informed stock exchanges about this material update from its listed subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1756972998363,
            "Source": "corporate_action"
        },
        {
            "Title": "Kirloskar Industries Reports Strong Q1 FY2026 Results with 44% Jump in Consolidated Net Profit",
            "Summary": "Kirloskar Industries announced its Q1 FY2026 financial results with mixed standalone performance but strong consolidated growth. Standalone total income declined to ₹14.91 crores from ₹15.79 crores year-over-year, while profit before tax increased to ₹10.07 crores from ₹7.65 crores and net profit grew to ₹7.83 crores from ₹6.47 crores. Consolidated performance showed robust growth with revenue from operations rising to ₹1,705.48 crores from ₹1,558.96 crores, profit before tax jumping to ₹132.59 crores from ₹96.10 crores, and net profit surging to ₹95.37 crores from ₹66.26 crores. The iron casting segment led with ₹1,000.45 crores revenue and ₹100.13 crores profit before interest and tax, followed by tubes (₹570.77 crores revenue) and steel (₹358.07 crores revenue). Consolidated EBITDA margin improved to 13.4% from 12.1%, while earnings per share increased to ₹42.11 from ₹28.73. The company allotted 3,425 equity shares under its employee stock appreciation rights plan and initiated voluntary liquidation of subsidiary ISMT Enterprises SA Luxemburg.",
            "Sentiment": "positive",
            "PublishDate": 1754981296186,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Industries Reports Strong Q1 Performance with 57% Jump in Net Profit",
            "Summary": "Kirloskar Industries delivered robust quarterly results with consolidated net profit rising to 440 million rupees from 280 million rupees year-over-year. Revenue increased to 17.1 billion rupees compared to 15.6 billion rupees in the same period last year. The company's EBITDA grew to 2.2 billion rupees from 1.78 billion rupees, while EBITDA margin improved to 12.82% from 11.46% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754980632468,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Ferrous Industries Completes AGM with Key Board Appointments",
            "Summary": "Kirloskar Ferrous Industries Limited held its 34th Annual General Meeting on August 4, 2025, through video conferencing. The company had 1,06,695 total members on the record date of July 28, 2025, with 70 shareholders attending the meeting (9 promoters and 61 public shareholders). All seven resolutions were approved, including the adoption of audited financial statements for the year ended March 31, 2025, confirmation of interim and final dividend payments, and reappointment of Rahul Chandrakant Kirloskar as director. Key new appointments included Ms. Aditi Atul Kirloskar as a director liable to retire by rotation, and M/s. M.J. Risbud & Co as secretarial auditor for a five-year term from the 34th to 39th AGM. The company also received authority to raise funds up to ₹1,000 crores through non-convertible debentures on a private placement basis. Parent company Kirloskar Industries Limited informed stock exchanges about these developments from its material subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1754561752326,
            "Source": "corporate_action"
        },
        {
            "Title": "Kirloskar Industries Reports 29% Jump in Q1 Profit to ₹127 Crore",
            "Summary": "Kirloskar Industries delivered strong quarterly results with consolidated net profit rising 29.1% to ₹127.2 crore compared to ₹98.5 crore in the same period last year. Revenue from operations grew 5.4% to ₹1,681 crore from ₹1,553 crore. EBITDA increased 16% to ₹216.9 crore from ₹187 crore, while EBITDA margin expanded to 12.9% from 12%, indicating improved cost efficiencies and favorable business mix. The company's shares closed 1.24% lower at ₹4,192.30 on the NSE ahead of the earnings announcement. Kirloskar Industries operates across wind power generation, real estate, and holds investments in group companies including Kirloskar Pneumatic and Kirloskar Ferrous.",
            "Sentiment": "positive",
            "PublishDate": 1754409015458,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Ferrous Industries Reports Q1 FY26 Results with Revenue of ₹1,685 Crores",
            "Summary": "Kirloskar Ferrous Industries Limited reported quarterly results with revenue from operations of ₹1,685.1 crores compared to ₹1,553.7 crores in the same quarter last year. EBITDA stood at ₹213.9 crores (12.7% margin) versus ₹187.4 crores (12.1% margin) year-on-year. Profit after tax increased to ₹95.8 crores from ₹75.6 crores in the previous year quarter. The company operates across four segments: Pig Iron, Casting, Steel, and Tubes. Volume growth was recorded across most segments with Pig Iron volumes up 5% year-on-year and Tubes volumes up 42% year-on-year. The company emerged as preferred bidder for Jambunatha iron ore mine in Karnataka and proposed a merger scheme for two wholly-owned subsidiaries. Management noted steady recovery in steel and tubes business with good demand from the tractor sector, though margins remain under pressure for Pig Iron and Steel business.",
            "Sentiment": "positive",
            "PublishDate": 1754403275782,
            "Source": "stock"
        },
        {
            "Title": "Kirloskar Ferrous Reports 36% Net Profit Growth Despite Stock Decline",
            "Summary": "Kirloskar Ferrous Industries reported a 36% increase in net profit to ₹95 crore for the first quarter ended June 30, 2025, compared to ₹70 crore in the same period last year. Revenue from operations grew 9% to ₹1,698 crore from ₹1,554 crore. EBITDA increased 16% to ₹217 crore with margins improving to 12.8% from 12%. The company manufactures pig iron and grey iron castings, serving foundries and various industries including automotive, engines, compressors, textiles, and pumps. Despite the positive financial results, shares fell 5.85% to close at ₹553.00 on BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1754302485230,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Industries Schedules Board Meeting for August 12 to Approve Quarterly Financial Results",
            "Summary": "Kirloskar Industries Limited has scheduled a Board of Directors meeting for August 12, 2025, to consider and approve standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The company has implemented a trading window closure for its securities from July 1, 2025, which will remain in effect until August 18, 2025, in accordance with insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1754054361969,
            "Source": "corporate_action"
        },
        {
            "Title": "Kirloskar Ferrous Industries Schedules Conference Call to Discuss Q1FY26 Financial Results",
            "Summary": "Kirloskar Ferrous Industries Limited has scheduled a conference call for investors and analysts on August 5, 2025, at 4:00 p.m. IST to discuss the company's unaudited financial results for the quarter ended June 30, 2025. The call will cover both standalone and consolidated results and will be hosted by Antique Stock Broking Limited. The senior management team participating includes Managing Director R.V. Gumaste and Executive Director (Finance) and CFO R.S. Srivatsan. The presentation materials will be made available on the company's website. Kirloskar Industries Limited, the parent company, informed stock exchanges about this development from its listed subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1753969583614,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Ferrous Emerges as Preferred Bidder for Karnataka's Jambunatha Iron Ore Mine",
            "Summary": "Kirloskar Ferrous Industries Ltd has been declared the preferred bidder for the Jambunatha iron ore mine in Karnataka following an electronic auction conducted on January 27, 2025. The company emerged as the highest bidder in the auction initiated under Karnataka government's tender notification dated October 3, 2024. The final mining lease grant remains subject to multiple conditions including necessary payments, meeting tender terms, securing government approvals and clearances, and executing relevant agreements. Kirloskar Ferrous shares closed at ₹577.75, down 0.22% on the BSE.",
            "Sentiment": "positive",
            "PublishDate": 1753202360988,
            "Source": "stock"
        },
        {
            "Title": "Kirloskar Industries Reports Q4 Results and Dividend Declaration",
            "Summary": "Kirloskar Industries has reported its Q4 financial results. The company's EBITDA decreased to 2.1 billion rupees from 2.4 billion rupees year-over-year. The EBITDA margin declined to 11.78% from 13.90% in the same period. Revenue slightly increased to 17.5 billion rupees from 17.3 billion rupees year-over-year. Consolidated net profit decreased to 468 million rupees from 612 million rupees year-over-year. Additionally, the company has declared a dividend of 13 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1747727814000,
            "Source": "result"
        },
        {
            "Title": "Kirloskar Industries Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Kirloskar Industries has reported a decrease in its third-quarter EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) and EBITDA margin compared to the same period last year. The company's Q3 EBITDA fell to 1.73 billion rupees from 2.27 billion rupees year-over-year. Additionally, the EBITDA margin declined to 10.72% from 14.61% in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1739173149000,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Industries Reports Q3 Revenue Growth",
            "Summary": "Kirloskar Industries has announced its third quarter revenue, which stands at 16.1 billion rupees. This represents an increase from the previous year's third quarter revenue of 15.5 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739173111000,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Industries Reports Decline in Q3 Consolidated Net Profit",
            "Summary": "Kirloskar Industries has reported a consolidated net profit of 240 million rupees for the third quarter, down from 500 million rupees in the same period last year. This represents a significant year-over-year decrease in the company's quarterly earnings.",
            "Sentiment": "negative",
            "PublishDate": 1739173080000,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Oil Engines: Appeal Filed Against SEBI's Disclosure Order",
            "Summary": "Kirloskar Industries Ltd will challenge SEBI's recent order to disclose the 2009 family settlement deed under SEBI LODR Regulations. The company received SEBI's advice on December 30, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1735977025000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kirloskar Industries: To Challenge SEBI Order on Family Settlement Disclosure",
            "Summary": "Kirloskar Industries plans to legally challenge SEBI's directive to disclose a 2009 family settlement deed. The company argues the deed's binding nature is sub-judice since 2018 and SEBI's decision contains factual inaccuracies. Kirloskar Industries maintains the deed doesn't impact or create liability for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1735652956000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kirloskar Industries: Q2 Profit Up, MD to Step Down",
            "Summary": "Kirloskar Industries reported a 9.2% YoY increase in Q2 net profit to ₹49.7 crore, with revenue up 7% to ₹1,687.7 crore. EBITDA fell 19.6% to ₹211.7 crore, reducing margins. MD Mahesh Chhabria to retire early, stepping down on March 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1731574196000,
            "Source": "result"
        },
        {
            "Title": "Kirloskar Industries Reports Q2 Financial Results",
            "Summary": "Kirloskar Industries has released its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is 2.12 billion rupees, compared to 2.63 billion rupees in the same quarter last year. The EBITDA margin has decreased from 16.99% to 12.56% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731566180000,
            "Source": "result"
        },
        {
            "Title": "Kirloskar Industries Reports Q2 Revenue Growth",
            "Summary": "Kirloskar Industries has reported a revenue of 16.87 billion rupees for the second quarter, compared to 15.8 billion rupees in the same period last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731566177000,
            "Source": "result"
        },
        {
            "Title": "Kirloskar Industries Reports Q2 Profit Increase",
            "Summary": "Kirloskar Industries has reported a consolidated net profit of 500 million rupees for the second quarter, up from 460 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731566081000,
            "Source": "result"
        }
    ]
}