{
    "Symbol": "KIRLOSENG",
    "ISIN": "INE146L01010",
    "News": [
        {
            "Title": "Kirloskar Oil Engines Q3 FY26 Results & Dividend",
            "Summary": "Kirloskar Oil Engines reported Q3 FY26 standalone revenue of ₹1,380.61 crores with net profit of ₹86.32 crores. Board declared interim dividend of ₹2.50 per share with record date February 20, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770812116685,
            "Source": "co_actions_results"
        },
        {
            "Title": "Geetanjali Vikram Kirloskar Acquires 200 Shares",
            "Summary": "Geetanjali Vikram Kirloskar acquired 200 equity shares of Kirloskar Oil Engines through open market transactions, filing disclosure under SEBI regulations on December 19, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766221241449,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kirloskar Oil Engines Receives Favorable GST Order with Significant Tax Demand Reduction",
            "Summary": "Kirloskar Oil Engines received a partial favorable order from Deputy Commissioner of State Tax, Pune, resulting in significant reduction of GST tax demand from Rs.9,74,06,747 to Rs.23,96,748, penalty from Rs.1,34,41,427 to Rs.2,47,734, and interest from Rs.7,62,33,455 to Rs.19,66,778 related to ITC mismatch for FY2021-22. The company expects no material impact on its financial or operational activities and plans to file an appeal within prescribed timelines.",
            "Sentiment": "positive",
            "PublishDate": 1765286656806,
            "Source": "stock"
        },
        {
            "Title": "Kirloskar Oil Engines Sets Cut-off Date for Postal Ballot on Director Appointment",
            "Summary": "Kirloskar Oil Engines has fixed December 12, 2025 as the cut-off date for members to vote electronically through postal ballot on the appointment of Mr. Srikumar Vijayasekharan as Additional Non-Executive Independent Director for a five-year term. The appointment, effective from November 11, 2025, requires shareholder approval with the postal ballot notice to be circulated within prescribed timelines.",
            "Sentiment": "neutral",
            "PublishDate": 1765196280246,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kirloskar Oil Engines Reports Record Q2 Revenue of INR 1,593 Crores, Up 35% Year-on-Year",
            "Summary": "Kirloskar Oil Engines achieved its highest quarterly revenue crossing INR 1,500 crores for the first time, driven by strong 41% growth in Power Generation business and 40% growth in Industrial segment. The company delivered robust performance across all business units with net profit rising 44% to INR 141 crores, supported by healthy demand in defense, railways, and power generation markets.",
            "Sentiment": "positive",
            "PublishDate": 1763460450421,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Oil Engines Appoints Srikumar Vijayasekharan as Independent Director",
            "Summary": "Kirloskar Oil Engines has appointed Mr. Srikumar Vijayasekharan as an Additional Non-Executive Director in the capacity of Independent Director for a five-year term starting November 11, 2025. The appointment is subject to member approval. Vijayasekharan, aged 64, is a Chartered Accountant with over 40 years of experience and served as Chief Operating Officer of Deloitte South Asia from 2015 to 2023. During his tenure as COO, the firm grew over four times. He has extensive experience in audit and assurance services across manufacturing, financial services, healthcare, technology, and consumer business sectors. He currently serves as an Independent Director on the Board of Arka Fincap Limited. The appointee holds no shares in Kirloskar Oil Engines and is not related to any existing board member.",
            "Sentiment": "positive",
            "PublishDate": 1762906246290,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kirloskar Oil Engines Reports Record Q2FY26 Performance with 35% Revenue Growth",
            "Summary": "Kirloskar Oil Engines Limited delivered its best-ever quarterly performance in Q2FY26, with standalone net sales crossing ₹1,500 crore for the first time, reaching ₹1,593 crore compared to ₹1,184 crore in Q2FY25, marking a 35% year-on-year increase. Standalone net profit grew 44% to ₹141 crore from ₹98 crore in the previous year. EBITDA increased 45% to ₹214 crore with margins improving to 13.4% from 12.4%. For the half-year period H1FY26, standalone net sales reached ₹3,027 crore, up 20% from ₹2,518 crore in H1FY25, while net profit grew 23% to ₹264 crore. On consolidated basis, revenue from continuing operations for Q2FY26 was ₹1,948 crore, up 30% year-on-year, with net profit from continuing operations rising 51% to ₹159 crore. The company announced a strategic restructuring on October 10th, transferring its B2C operations to wholly owned subsidiary La-Gajjar Machineries Private Limited through a slump sale, aligning with its goal to reach ₹2 billion topline by 2030. All segments within the standalone business recorded double-digit growth, with the Power Generation Business Unit showing robust performance.",
            "Sentiment": "positive",
            "PublishDate": 1762905487189,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Oil Engines Reports 34% Drop in Quarterly Net Profit to ₹134.90 Crores",
            "Summary": "Kirloskar Oil Engines Limited reported a net profit of ₹134.90 crores for the quarter ended September 30, 2025, compared to ₹204.20 crores in the same period last year, marking a 34% decline. Revenue from operations decreased to ₹1,244.65 crores from ₹1,306.01 crores year-on-year. For the half-year period, net profit fell to ₹258.73 crores from ₹352.53 crores in the previous year. The company's Board approved the transfer of its Business to Customer (B2C) segment, including Water Management Solutions domestic and export business, to its wholly owned subsidiary La-Gajjar Machineries Private Limited through a slump sale. The company also invested $2 million (approximately ₹17.76 crores) in Series A-1 Preferred Stock of its US subsidiary Kirloskar Americas Corporation. Total assets stood at ₹4,747.19 crores as of September 30, 2025, compared to ₹4,307.50 crores in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762896980700,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Oil Engines Reports 26% Jump in Q2 Net Profit to 1.62 Billion Rupees",
            "Summary": "Kirloskar Oil Engines posted a net profit of 1.62 billion rupees in Q2, up from 1.28 billion rupees in the same period last year. Revenue increased to 19.48 billion rupees compared to 14.98 billion rupees year-over-year. EBITDA rose to 3.82 billion rupees from 2.97 billion rupees, while EBITDA margin declined slightly to 19.58% from 19.83% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762864863997,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Oil Engines Allots 36,279 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Kirloskar Oil Engines Limited allotted 36,279 fully paid-up equity shares of Rs. 2 each through its Employee Stock Option Plan 2019. The allotment was approved by the Stakeholders Relationship Committee at a meeting held on November 11, 2025. Following this allotment, the company's issued and subscribed capital increased from Rs. 29,05,91,200 to Rs. 29,06,63,758, while the paid-up capital rose from Rs. 29,05,90,270 to Rs. 29,06,62,828. The total number of issued and subscribed equity shares increased to 14,53,31,879 shares, with paid-up shares reaching 14,53,31,414.",
            "Sentiment": "neutral",
            "PublishDate": 1762836125360,
            "Source": "corporate_action"
        },
        {
            "Title": "Kirloskar Oil Engines Transfers B2C Business Segment to Subsidiary La-Gajjar Machineries",
            "Summary": "Kirloskar Oil Engines Limited has transferred its Business to Customer (B2C) segment to wholly-owned subsidiary La-Gajjar Machineries Private Limited through a slump sale. The B2C segment contributed INR 592.61 crore in revenue from operations (11.59% of total) and INR 591.25 crore in turnover (11.66% of total) in FY 2024-25. The consideration involves issuance of 10,65,150 equity shares of La-Gajjar Machineries with face value of INR 10 each. The business transfer agreement was executed on October 10, 2025, with the transfer effective from October 11, 2025. The transaction aims to drive operational efficiencies, streamline go-to-market channels, optimize resource allocation, and create a simplified corporate structure for long-term growth. This continues the company's three-year strategy to separate B2C and B2B operations for enhanced efficiency and focused growth potential.",
            "Sentiment": "positive",
            "PublishDate": 1760111513953,
            "Source": "corporate_action"
        },
        {
            "Title": "Kirloskar Oil Engines Discloses 2009 Family Settlement Deed Following SEBI Legal Clarification",
            "Summary": "Kirloskar Oil Engines Limited disclosed a Deed of Family Settlement dated September 11, 2009, involving individual members of the Kirloskar family. The disclosure follows a legal clarification from SEBI obtained through a writ petition filed by the company before the Bombay High Court. SEBI clarified that mere disclosure of an agreement by a listed entity does not mean the company admits the agreement is binding on itself or impacts its management, control, or creates any liability. The company emphasized it is not a party to the family settlement, has never ratified it, and the deed does not impose any restrictions or create liabilities for the company. The family settlement involved distribution of shares among five family members - Atul Kirloskar, Sanjay Kirloskar, Vikram Kirloskar, Rahul Kirloskar, and Gautam Kulkarni - across various Kirloskar Group companies including share transfers, cash payments, and restructuring of holdings through investment companies.",
            "Sentiment": "neutral",
            "PublishDate": 1758866123717,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kirloskar Oil Engines Receives GST Show Cause Notice for Rs 18.7 Crore Tax Demand",
            "Summary": "Kirloskar Oil Engines Limited received a show cause notice from the Office of Deputy Commissioner of State Tax, Pune, Maharashtra for ITC mismatch in FY 2021-22 under GST regulations. The notice proposes a penalty of Rs 1.34 crore, interest of Rs 7.62 crore, and tax demand of Rs 9.74 crore, totaling approximately Rs 18.7 crore. The company stated it does not foresee any material impact on its financial, operations or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1758780594235,
            "Source": "stock"
        },
        {
            "Title": "Kirloskar Oil Engines Receives GST Show Cause Notice for HSN Misclassification",
            "Summary": "Kirloskar Oil Engines Limited received a Show Cause Notice from the Office of Deputy Commissioner of State Tax, Pune, Maharashtra for miss-classification in outward supply due to HSN under GST regulations. The notice demands penalty of Rs. 76,47,755, interest of Rs. 3,20,37,279, and tax demand of Rs. 4,05,52,111. The company stated it does not foresee any material impact on its financial, operations or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1758303148538,
            "Source": "stock"
        },
        {
            "Title": "Kirloskar Oil Engines Reports Record Q1 Sales of Rs 1,434 Crores, Power Generation Segment Drives Growth",
            "Summary": "Kirloskar Oil Engines Limited achieved record quarterly net sales of Rs 1,434 crores for Q1 FY'26, marking 8% year-on-year growth. The power generation business recorded its highest ever Q1 sales at Rs 609 crores with 15% growth, driven by strong demand across infrastructure and real estate sectors. EBITDA stood at Rs 190 crores with 13.2% margin versus 13% last year. The company successfully transitioned to CPCB IV+ emission norms and launched new products including Sentinel and Optiprime ranges. Export sales grew 21% to Rs 136 crores, primarily from Middle East recovery. Industrial segment declined 8% due to railway pre-buy effects from previous year. The company secured strategic defense projects with NPCIL and Indian Navy for prototype development. B2C business grew 4% with international B2C surging 76%. Consolidated revenue reached Rs 1,751 crores with net profit of Rs 134 crores. The company divested its cables and pipes business Optiqua as part of core strategy focus. Management expressed confidence in sustained domestic demand and expects continued growth momentum.",
            "Sentiment": "positive",
            "PublishDate": 1755000513948,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Oil Engines Re-appoints Gauri Kirloskar as Managing Director for Three Years",
            "Summary": "Kirloskar Oil Engines Limited shareholders approved the re-appointment of Ms. Gauri Kirloskar as Whole Time Director and Managing Director for a three-year term effective May 20, 2025. The decision was made at the Annual General Meeting held on August 7, 2025. She has also been re-appointed as Key Managerial Personnel of the company with effect from the same date.",
            "Sentiment": "positive",
            "PublishDate": 1754657861405,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kirloskar Oil Engines Targets Double-Digit Revenue Growth Through Diversification Strategy",
            "Summary": "Kirloskar Oil Engines is pursuing growth across multiple sectors driven by increasing demand for power generation, defense applications, and high-power generators. The company is expanding its export operations in the Middle East and North Africa (MENA) region while diversifying into water management and financial services. These strategic initiatives are aimed at maintaining double-digit revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1754493403448,
            "Source": "stock"
        },
        {
            "Title": "Kirloskar Oil Engines' Subsidiary Changes Auditors Due to RBI Guidelines",
            "Summary": "G. D. Apte & Co., Chartered Accountants, resigned as statutory auditors of Arka Financial Holdings Private Limited (AFHPL), a material subsidiary of Kirloskar Oil Engines Limited, effective August 6, 2025. The resignation occurred because RBI guidelines limit audit firms to a maximum of eight RBI-regulated NBFCs, and G. D. Apte & Co. already audits eight other NBFCs. AFHPL has applied for registration with RBI as a Core Investment Company on June 29, 2025, which would make it an RBI-regulated entity upon registration. To fill the vacancy, AFHPL's Board of Directors approved the appointment of Sudit K. Parekh & Co. LLP Chartered Accountants as statutory auditors for a three-year term starting August 6, 2025, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1754483816123,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kirloskar Oil Engines Reports Mixed Q1 Results with Revenue Growth but Lower Profit",
            "Summary": "Kirloskar Oil Engines reported Q1 revenue of 17.6 billion rupees, up from 16.4 billion rupees in the previous year. EBITDA increased to 3.3 billion rupees from 3.2 billion rupees year-over-year, though EBITDA margin declined to 18.48% from 19.68%. Consolidated net profit decreased to 1.4 billion rupees compared to 1.6 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1754481937616,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Oil Engines Reports Q4 Results and Dividend",
            "Summary": "Kirloskar Oil Engines has announced its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit decreased to 1.3 billion rupees from 1.49 billion rupees year-over-year. Revenue increased to 17.5 billion rupees from 16.6 billion rupees. EBITDA rose slightly to 3.13 billion rupees, while EBITDA margin decreased to 17.86%. The company has recommended a dividend of 4 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747228004000,
            "Source": "result"
        },
        {
            "Title": "Kirloskar Oil Engines: Steady Demand and Market Share Despite Global Uncertainties",
            "Summary": "Kirloskar Oil Engines expects stable demand and market share despite global tariff uncertainties. Exports (10% of revenue) show no significant disruptions. The company's in-house technology and localized supply chains provide a competitive edge. Data center segment is the fastest-growing vertical. KOEL recently secured a ₹270 crore defence order for engine development.",
            "Sentiment": "positive",
            "PublishDate": 1744791676000,
            "Source": "normal_news"
        },
        {
            "Title": "Kirloskar Oil Engines: Secures Rs 270 Crore Navy Deal for Indigenous Marine Diesel Engine",
            "Summary": "Kirloskar Oil Engines has secured a Rs 270 crore order from the Indian Defence Ministry to design and develop a 6MW Medium Speed Marine Diesel Engine. The project, under the Make-I category, aims to achieve over 50% indigenous content. The government will fund 70% of the project cost. The deal includes developing a detailed design for a 3-10MW diesel engine range.",
            "Sentiment": "positive",
            "PublishDate": 1743654821000,
            "Source": "order&deals"
        },
        {
            "Title": "Kirloskar Oil Engines Secures Order Worth 2.70 Billion Rupees",
            "Summary": "Kirloskar Oil Engines has received a significant order valued at 2.70 billion rupees, excluding taxes. This order represents a substantial business opportunity for the company and may positively impact its financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1743639127000,
            "Source": "order&deals"
        },
        {
            "Title": "Kirloskar Oil Engines Secures 2.70 Billion Rupee Order",
            "Summary": "Kirloskar Oil Engines has received a significant order valued at 2.70 billion rupees, excluding taxes. This order represents a substantial business opportunity for the company and may positively impact its financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1743598849000,
            "Source": "order&deals"
        },
        {
            "Title": "Kirloskar Oil Engines Reports Q3 Financial Results",
            "Summary": "Kirloskar Oil Engines has announced its Q3 consolidated financial results. The company reported a net profit of 713 million rupees, down from 898 million rupees in the same quarter last year. However, revenue increased to 15 billion rupees from 13.9 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739320546000,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Oil Engines Reports Q3 Financial Results",
            "Summary": "Kirloskar Oil Engines has released its Q3 financial results. The company reported an EBITDA of 2.54 billion rupees, compared to 2.57 billion rupees in the same quarter last year. The EBITDA margin for Q3 was 17.44%, down from 18.49% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1739273032000,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Oil Engines Reports Q3 Financial Results",
            "Summary": "Kirloskar Oil Engines announced its Q3 financial results. The company reported a consolidated net profit of 713 million rupees, down from 898 million rupees in the same quarter last year. However, revenue increased to 15 billion rupees from 13.9 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739273026000,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Oil Engines Incorporates Wholly Owned Subsidiary in UAE",
            "Summary": "Kirloskar Oil Engines has announced the incorporation of a new wholly owned subsidiary in the United Arab Emirates. This strategic move suggests the company is expanding its international presence and potentially targeting growth opportunities in the Middle East region.",
            "Sentiment": "positive",
            "PublishDate": 1737126341000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kirloskar Oil Engines Ltd: Sebi Opposes Appeal on Family Settlement Disclosure",
            "Summary": "Sebi opposes KOEL's appeal in SAT against advisory to disclose Deed of Family Settlement. Sebi argues the advisory is an administrative order and not appealable. KOEL contends the agreement doesn't impact broader shareholding. SAT to hear the matter on April 7.",
            "Sentiment": "neutral",
            "PublishDate": 1737117378000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kirloskar Oil Engines: CEO of B2C Vertical Resigns, Successor Named",
            "Summary": "Aseem Srivastav, CEO of Kirloskar Oil Engines' B2C vertical, will step down on December 31, 2024. Rahul Sahai, current CEO of B2B Business Vertical, will succeed him effective January 1, 2025. Srivastav is leaving to take on a new role within the Kirloskar Group.",
            "Sentiment": "neutral",
            "PublishDate": 1733483315000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kirloskar Oil Engines Reports Strong Q2 Financial Results",
            "Summary": "Kirloskar Oil Engines has announced its Q2 consolidated net profit of 1.28 billion rupees, showing significant growth from 780 million rupees year-over-year and 1.6 billion rupees quarter-over-quarter. The company's Q2 revenue also increased to 15 billion rupees from 13.05 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731456043000,
            "Source": "result"
        }
    ]
}