{
    "Symbol": "KIRLOSBROS",
    "ISIN": "INE732A01036",
    "News": [
        {
            "Title": "Kirloskar Brothers Q3 & 9MFY26 earnings call on Feb 6",
            "Summary": "Kirloskar Brothers Limited announces earnings call on February 06, 2026 at 9:30 AM IST to discuss Q3 & 9MFY26 financial results with analysts and investors under Regulation 30.",
            "Sentiment": "neutral",
            "PublishDate": 1769776767166,
            "Source": "co_actions_results"
        },
        {
            "Title": "Supreme Court Makes Interim Stay Absolute for KBL",
            "Summary": "Supreme Court makes interim stay absolute on Bombay High Court ruling affecting Kirloskar Brothers Ltd, directing expeditious appeal disposal within three months.",
            "Sentiment": "positive",
            "PublishDate": 1768383801025,
            "Source": "stocks"
        },
        {
            "Title": "Kirloskar Brothers Faces ₹5.29 Cr GST Demand Order",
            "Summary": "Kirloskar Brothers Limited receives GST order demanding ₹5.29 crores in tax with equal penalty for Chennai operations covering FY2018-19 to FY2023-24 period.",
            "Sentiment": "negative",
            "PublishDate": 1767373186725,
            "Source": "stocks"
        },
        {
            "Title": "Kirloskar Brothers Tax Notices Withdrawn",
            "Summary": "Kirloskar Brothers announces withdrawal of tax notices against directors and closure of related legal cases, marking resolution of regulatory matters.",
            "Sentiment": "positive",
            "PublishDate": 1765870041634,
            "Source": "stocks"
        },
        {
            "Title": "Kirloskar Brothers Limited Appoints Brij Bhushan Nagpal as Independent Director Through Postal Ballot",
            "Summary": "Kirloskar Brothers Limited successfully passed a special resolution appointing Mr. Brij Bhushan Nagpal (DIN: 01853613) as an Independent Director through postal ballot e-voting conducted from November 07 to December 06, 2025. The resolution received majority support with 4,13,37,793 votes in favor against 1,97,97,874 votes against, meeting regulatory requirements under SEBI listing regulations despite initially appearing to lack the requisite 3/4th majority.",
            "Sentiment": "positive",
            "PublishDate": 1765190909004,
            "Source": "corporate_action"
        },
        {
            "Title": "Kirloskar Brothers Closes Subsidiary TSKL Following NCLT-Approved Merger",
            "Summary": "Kirloskar Brothers Ltd announced the closure of its wholly-owned subsidiary TSKL after NCLT approved its merger with KPML. TSKL will be dissolved from December 05, 2025, completing the corporate restructuring process.",
            "Sentiment": "neutral",
            "PublishDate": 1764939387350,
            "Source": "corporate_action"
        },
        {
            "Title": "Kirloskar Brothers Receives Withdrawal of GST Demand Notices Worth Rs. 15.48 Crore",
            "Summary": "Kirloskar Brothers Limited received confirmation that demand notices issued to its directors under the Andhra Pradesh GST Act, 2017, claiming tax arrears of Rs. 15,48,06,528/- for 2023-24 and Rs. 15,48,02,928/- for 2017-18, have been withdrawn by the Deputy Assistant Commissioner of State Tax. The withdrawal comes after the company and its directors filed writ petitions challenging the demand notices before the Andhra Pradesh High Court, which had granted interim stay against recovery proceedings.",
            "Sentiment": "positive",
            "PublishDate": 1763714753982,
            "Source": "stock"
        },
        {
            "Title": "Kirloskar Brothers Directors File Writ Petition Against Rs. 15.48 Crore GST Demand Notice",
            "Summary": "Directors of Kirloskar Brothers Limited filed a writ petition with Andhra Pradesh High Court challenging GST demand notices for Rs. 15.48 crore related to tax arrears from a joint venture project. The company previously secured an interim stay against recovery proceedings for a similar demand notice, with financial implications remaining uncertain pending legal resolution.",
            "Sentiment": "negative",
            "PublishDate": 1763554180192,
            "Source": "stock"
        },
        {
            "Title": "Kirloskar Brothers Gets Credit Rating Outlook Upgraded to Positive by CRISIL",
            "Summary": "CRISIL Ratings Limited has revised the outlook on Kirloskar Brothers Limited's long-term bank facilities to Positive from Stable while reaffirming the rating at CRISIL AA. The short-term rating has been reaffirmed at CRISIL A1+. The total bank loan facilities rated amount to Rs. 1,700 crore. The rating covers bank guarantee facilities of Rs. 1,100 crore and proposed long-term bank loan facilities of Rs. 100 crore.",
            "Sentiment": "positive",
            "PublishDate": 1762897817878,
            "Source": "stock"
        },
        {
            "Title": "Kirloskar Brothers Q2 FY26: Revenue Flat at Rs 1,028 Crores, JJM Fund Delays Impact Growth",
            "Summary": "Kirloskar Brothers Limited reported consolidated revenue of Rs 1,028 crores for Q2 FY26, remaining stable year-on-year. First half revenue was Rs 2,007 crores, down 3% compared to the same period last year. The company faced challenges from extended monsoon and Jal Jeevan Mission fund delays at state level, despite central fund releases. Standalone order book (excluding small pumps) grew 13% to Rs 2,127 crores. International operations showed strong performance with US and Thailand growing 21% and 158% respectively in constant currency, while South Africa grew 27%. EBITDA for the quarter stood at Rs 124 crores with 12% margins. The company maintained strict commercial policies, withholding dispatches until payment certainty. Domestic subsidiaries registered 14% revenue growth and 26% PAT improvement year-on-year. Management expressed confidence in meeting growth aspirations in the second half, citing healthy order inflows and strong pipeline across segments.",
            "Sentiment": "neutral",
            "PublishDate": 1762897295295,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Brothers Seeks Shareholder Approval for Independent Director Appointment",
            "Summary": "Kirloskar Brothers Limited is conducting a postal ballot to seek shareholder approval for appointing Mr. Brij Bhushan Nagpal as an Independent Director. The appointment is effective from November 3, 2025, for a five-year term until November 2, 2030. The remote e-voting period runs from November 7, 2025 (9:00 AM) to December 6, 2025 (5:00 PM). Mr. Nagpal brings over 40 years of corporate experience, having recently served as Executive Director at Luminous Power Technologies. The appointment requires approval through a special resolution, with voting conducted exclusively through electronic means in compliance with regulatory guidelines.",
            "Sentiment": "neutral",
            "PublishDate": 1762461859390,
            "Source": "corporate_action"
        },
        {
            "Title": "Kirloskar Brothers Management Provides Growth and Margin Guidance",
            "Summary": "Kirloskar Brothers management provided guidance on their operational outlook. For UK operations, they expect to return to double-digit margins in the medium term, though not in the short term. Management expressed confidence in achieving double-digit growth aspirations, supported by their strong order book and seasonal business pattern where 60-62% of business typically occurs in the second half. They remain optimistic about their growth trajectory, citing a healthy balance between domestic and international markets, robust order pipeline, and focus on operational excellence.",
            "Sentiment": "positive",
            "PublishDate": 1762401223151,
            "Source": "stock"
        },
        {
            "Title": "Kirloskar Brothers Receives NCLT Approval for Subsidiary Amalgamation Scheme",
            "Summary": "Kirloskar Brothers Limited announced that the National Company Law Tribunal (NCLT) Mumbai Bench has approved the scheme of amalgamation between two of its wholly-owned subsidiaries - The Kolhapur Steel Limited (transferor company) and Karad Projects And Motors Limited (transferee company). The NCLT order was dated November 3, 2025, with an appointed date of October 3, 2024. The Kolhapur Steel Limited is engaged in steel castings and metal fabrication, while Karad Projects And Motors Limited manufactures energy-efficient motors and related components. The amalgamation aims to achieve operational efficiencies, simplify corporate structure, reduce administrative costs, and optimize resource utilization. Since both companies are wholly-owned subsidiaries, no new shares will be issued and there will be no change in Kirloskar Brothers' shareholding pattern. The Income Tax Department raised concerns about potential tax avoidance through carry-forward losses, but NCLT approved the scheme after reviewing all regulatory reports and undertakings from the companies.",
            "Sentiment": "positive",
            "PublishDate": 1762257174260,
            "Source": "corporate_action"
        },
        {
            "Title": "Kirloskar Brothers Reports Strong Q2 Performance with 38% Jump in Consolidated Net Profit",
            "Summary": "Kirloskar Brothers Limited reported consolidated net profit of Rs 987 million for the quarter ended September 30, 2025, compared to Rs 957 million in the previous quarter. Revenue from operations reached Rs 10,277 million versus Rs 9,790 million in the preceding quarter. On a standalone basis, the company posted net profit of Rs 376 million for the quarter. For the half-year period, consolidated revenue stood at Rs 20,067 million with net profit of Rs 1,377 million. The company operates in the fluid machinery and systems segment with operations both within India (Rs 6,581 million revenue) and outside India (Rs 3,696 million revenue) for the quarter. Basic earnings per share on consolidated basis was Rs 8.94 for the quarter. The Board of Directors approved these results at their meeting held on November 3, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762191599392,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Brothers Approves Quarterly Results and Appoints New Independent Director",
            "Summary": "Kirloskar Brothers Limited's Board of Directors approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company appointed Mr. Brij Bhushan Nagpal as Additional Director in the Independent Director category for a 5-year term starting November 3, 2025, subject to shareholder approval. Nagpal brings over 40 years of experience in corporate management, finance, and governance, having previously served as Executive Director at Luminous Power Technologies, a subsidiary of Schneider Electric. He holds no shares in the company and his appointment was recommended by the Nomination and Remuneration Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1762172794573,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kirloskar Brothers Reports Decline in Q2 Profitability and Margins",
            "Summary": "Kirloskar Brothers reported consolidated net profit of 710 million rupees in Q2, down from 957 million rupees in the same quarter last year. Revenue decreased slightly to 10.28 billion rupees from 10.36 billion rupees year-over-year. EBITDA fell to 1.08 billion rupees compared to 1.42 billion rupees in the previous year's Q2. The company's EBITDA margin compressed to 10.55% from 13.72% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762170831580,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Court Stays Bombay High Court Order in Kirloskar Brothers-Kirloskar Proprietary Trademark Dispute",
            "Summary": "The Supreme Court of India stayed the effect and operation of the Bombay High Court's order dated October 10, 2025 in a trademark licensing dispute between Kirloskar Proprietary Limited and Kirloskar Brothers Limited. The case involves restrictions on licensing the Kirloskar trademark to group companies for similar business activities. The Bombay High Court had initially stayed a trial court's injunction order in July 2025, allowing licensing to member companies while prohibiting assignment to other Kirloskar group companies. In October 2025, the High Court modified its order to also restrict licensing to group companies. The Supreme Court found this expansion of restraint inappropriate while the appeal remains pending and scheduled the next hearing for November 4, 2025. Kirloskar Brothers Limited stated that the financial implications of this litigation cannot be determined at this time.",
            "Sentiment": "neutral",
            "PublishDate": 1761072939830,
            "Source": "stock"
        },
        {
            "Title": "Supreme Court Stays Bombay High Court Order Against Kirloskar Brothers Limited",
            "Summary": "The Supreme Court of India stayed the Bombay High Court's order dated October 10, 2025 in a special leave petition filed by Kirloskar Proprietary Limited against Kirloskar Brothers Limited. The dispute involves trademark licensing rights for the Kirloskar mark. The Bombay High Court had modified its earlier July 25, 2025 order to restrict both assignment and licensing of the Kirloskar trademark to group companies for similar business activities. The Supreme Court found that expanding the restraint scope while an appeal was pending was inappropriate and stayed the October 10 order. The matter is scheduled for hearing on November 4, 2025. Kirloskar Brothers Limited stated that the financial implications of this litigation cannot be determined at this time.",
            "Sentiment": "neutral",
            "PublishDate": 1760897518780,
            "Source": "stock"
        },
        {
            "Title": "Kirloskar Brothers' NCLAT Appeal Dismissed as Infructuous Following Final Decision on Main Petition",
            "Summary": "Kirloskar Brothers Limited announced that the National Company Law Appellate Tribunal (NCLAT) dismissed the company's appeal against an interim order dated October 5, 2023, as infructuous. The dismissal came after the advocate submitted that the main Company Petition No. 193/2017 had been finally decided on May 21, 2024, making the appeal against the interim order redundant. The NCLAT issued its dismissal order on September 19, 2025. The company and its Managing Director Sanjay Kirloskar had filed the appeal against the interim order passed by NCLT. Kirloskar Brothers stated it does not anticipate any material impact on its business operations from this development and will keep exchanges informed of any material developments.",
            "Sentiment": "neutral",
            "PublishDate": 1760532592856,
            "Source": "stock"
        },
        {
            "Title": "Bombay High Court Modifies Order, Restricts Kirloskar Proprietary from Licensing Trademarks to Competing Group Companies",
            "Summary": "The Bombay High Court modified its ad-interim order dated July 25, 2025, regarding Kirloskar trademark usage. The court now restrains Kirloskar Proprietary Limited (KPL) from both licensing and assigning Kirloskar marks to other group companies for competing or overlapping businesses with Kirloskar Brothers Limited. The modification was made on October 10, 2025, following an interim application filed by Kirloskar Brothers Limited seeking correction of the earlier order. While KPL can still create licenses for Kirloskar marks in favor of member companies according to its articles of association, it cannot license or assign these marks to other Kirloskar group companies for similar business activities. The company stated that the expected financial implications of this litigation cannot be determined at this time.",
            "Sentiment": "neutral",
            "PublishDate": 1760185924523,
            "Source": "stock"
        },
        {
            "Title": "Kirloskar Brothers Secures Major Order for Over 14,000 Pump Sets from Indian Oil Corporation",
            "Summary": "Kirloskar Brothers has received a significant order for more than 14,000 pump sets from Indian Oil Corporation Ltd. The company will execute the order within one year, with full payment scheduled upon delivery.",
            "Sentiment": "positive",
            "PublishDate": 1759306936087,
            "Source": "order&deals"
        },
        {
            "Title": "SEBI Demands Disclosure of 2009 Kirloskar Family Agreement, Cites Non-Compete Clause",
            "Summary": "SEBI has filed an affidavit in Bombay High Court seeking disclosure of a 2009 family agreement that divided Kirloskar Group companies among Sanjay Kirloskar, Atul Kirloskar, and Rahul Kirloskar. The regulator is opposing a plea by four listed Kirloskar companies - Kirloskar Oil Engines, Kirloskar Industries, Kirloskar Ferrous Industries, and Kirloskar Pneumatic Company - which challenged SEBI's December 2024 advisory requiring disclosure of the deed of family settlement. SEBI argues the agreement contains a non-compete clause restricting Kirloskar Oil Engines from entering businesses competing with other Kirloskar entities, constituting material information shareholders deserve to know. The 2009 settlement designated Atul Kirloskar as promoter of four companies, Rahul Kirloskar as promoter of the same companies plus GG Dandekar Properties, and Sanjay Kirloskar as promoter of flagship company Kirloskar Brothers.",
            "Sentiment": "neutral",
            "PublishDate": 1757670315533,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kirloskar Brothers Obtains Interim Stay Against Rs. 15.48 Crore GST Recovery Proceedings",
            "Summary": "Kirloskar Brothers Limited received an interim stay from the Andhra Pradesh High Court against recovery proceedings for alleged GST tax arrears of Rs. 15.48 crore. The tax demand relates to an unincorporated joint venture IVRCL-KBL-MEIL formed with IVRCL Ltd. and Megha Engineering & Infrastructure Ltd. for a project with the Water Resources Department of Andhra Pradesh. The company had filed a writ petition challenging the demand notice issued by the Assistant Commissioner, State Tax Department, Government of Andhra Pradesh. The High Court granted the interim stay on August 20, 2025, which was made available to the company on August 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1756297219969,
            "Source": "stock"
        },
        {
            "Title": "Kirloskar Brothers Challenges Rs. 15.48 Crore GST Demand in Andhra Pradesh High Court",
            "Summary": "Kirloskar Brothers Limited filed a writ petition with the Andhra Pradesh High Court challenging a GST demand notice of Rs. 15.48 crore issued by state tax authorities. The tax demand relates to alleged arrears for 2017-18 associated with an unincorporated joint venture between IVRCL Ltd., Kirloskar Brothers, and Megha Engineering & Infrastructure Ltd. for a project with the Water Resources Department of Andhra Pradesh. The company received the demand notice requiring payment within 7 days and has sought to set aside the assessment order along with an interim stay. The company stated that financial implications cannot be determined at this stage due to the ongoing legal proceedings.",
            "Sentiment": "negative",
            "PublishDate": 1754998523324,
            "Source": "stock"
        },
        {
            "Title": "Kirloskar Brothers Receives Partial Stay from Bombay High Court in Trademark Dispute with Kirloskar Proprietary",
            "Summary": "Kirloskar Brothers Limited received a partial stay order from the Bombay High Court regarding restrictions on Kirloskar Proprietary Limited's trademark licensing activities. The court modified the January 9, 2025 Pune District Court order that had restrained KPL from creating third-party interests in Kirloskar trademarks. Under the new ruling, KPL can grant licenses for Kirloskar marks to its member companies in accordance with its articles of association, but remains restricted from assigning these marks to other Kirloskar group companies for businesses that overlap with KBL's operations. The ongoing litigation stems from a trademark dispute where KBL challenged KPL's attempt to terminate trademark license agreements. The financial implications of this litigation cannot be determined at this stage.",
            "Sentiment": "neutral",
            "PublishDate": 1754997578042,
            "Source": "stock"
        },
        {
            "Title": "Kirloskar Brothers Limited Seeks Shareholder Approval for Harsh Vardhan Shringla's Independent Director Appointment",
            "Summary": "Kirloskar Brothers Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Harsh Vardhan Shringla as an Independent Director. The Board appointed Shringla as an Additional Director effective August 02, 2025, subject to shareholder approval through e-voting. Shringla, aged 63, is a former Foreign Secretary of India (2020-22) and served as Chief Coordinator for India's G20 Presidency (2022-23). He has been Ambassador to the United States, Bangladesh, and Thailand, and was recently nominated to the Rajya Sabha. The proposed appointment is for a five-year term from August 02, 2025 to August 01, 2030. The e-voting period runs from August 12, 2025 at 9:00 AM to September 10, 2025 at 5:00 PM. The resolution requires approval as a Special Resolution, with the cut-off date for voting eligibility set as August 08, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754924995827,
            "Source": "corporate_action"
        },
        {
            "Title": "Kirloskar Brothers Q1 FY26 Revenue Declines 5% to Rs 979 Crores, EBITDA Margins Improve to 13%",
            "Summary": "Kirloskar Brothers Limited reported consolidated revenue of Rs 979 crores for Q1 FY26, down 5% year-on-year from Rs 1,031 crores. EBITDA remained stable at Rs 128 crores versus Rs 127 crores last year, with margins expanding to 13% from 12.3%. The company recorded order inflows of Rs 1,336 crores, reflecting 9% year-on-year growth. Standalone domestic business revenue declined 7% to Rs 621 crores, but EBITDA grew 10% to Rs 79 crores with margins improving 200 basis points to 12.7%. International business saw modest 2% degrowth due to election-related delays in US and Thailand markets. The company's performance was impacted by early monsoon affecting small pump demand in agricultural sector, though industrial segment showed strong demand. Raw material price softening and operational efficiency initiatives supported margin improvements despite challenging operating environment.",
            "Sentiment": "neutral",
            "PublishDate": 1754641099802,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Brothers Limited Faces Fine for Non-Filing of Annual Secretarial Compliance Report",
            "Summary": "Kirloskar Brothers Limited has been fined by BSE for failing to file the PDF document for its Annual Secretarial Compliance Report for the financial year ended March 31, 2025. The exchange notified the company on June 26, 2025, about the non-compliance with Regulation 24A of SEBI Listing Regulations. The company filed a waiver application with the exchange on July 11, 2025. The Board of Directors was briefed about the matter and the actions taken by both the exchange and the company during their meeting on August 01, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1754049466119,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kirloskar Brothers Reports Q1 Results and Appoints Former Foreign Secretary as Independent Director",
            "Summary": "Kirloskar Brothers Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 6,206 million compared to Rs 6,652 million in the same quarter last year. Profit after tax stood at Rs 470 million versus Rs 409 million in the previous year quarter. On a consolidated basis, revenue from operations was Rs 9,790 million against Rs 10,309 million in the corresponding quarter of the previous year, with consolidated profit after tax at Rs 675 million compared to Rs 656 million. The company also appointed Mr. Harsh Vardhan Shringla, a 63-year-old diplomat who served as India's Foreign Secretary from 2020-22, as an Additional Independent Director for a five-year term starting August 2, 2025, subject to shareholder approval. The consolidated results showed revenue split between domestic operations at Rs 6,222 million and international operations at Rs 3,568 million for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754030108754,
            "Source": "corporate_action"
        },
        {
            "Title": "Kirloskar Brothers Reports 15% Revenue Decline in Q1 with Profit at Rs 470 Million",
            "Summary": "Kirloskar Brothers Limited reported quarterly results with revenue from operations declining to Rs 6,206 million compared to Rs 6,652 million in the same quarter last year. The company posted a profit after tax of Rs 470 million versus Rs 409 million in the previous year quarter. On a consolidated basis, revenue decreased to Rs 9,790 million from Rs 10,309 million year-over-year, while consolidated profit after tax remained relatively stable at Rs 675 million compared to Rs 656 million. The company operates in the fluid machinery and systems segment, with consolidated revenue split between domestic operations at Rs 6,222 million and international operations at Rs 3,568 million. Earnings per share on a standalone basis was Rs 5.93 compared to Rs 5.15 in the same quarter last year, while consolidated EPS increased to Rs 8.40 from Rs 8.20.",
            "Sentiment": "neutral",
            "PublishDate": 1754029320361,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Brothers Q4 Financial Results",
            "Summary": "Kirloskar Brothers reported its Q4 financial results. The company's EBITDA decreased to 1.8 billion rupees from 1.91 billion rupees year-over-year, with EBITDA margin declining to 14.79% from 15.62%. Consolidated net profit also decreased to 1.4 billion rupees from 1.5 billion rupees. However, revenue increased to 12.8 billion rupees from 12 billion rupees compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747214474000,
            "Source": "result"
        },
        {
            "Title": "Kirloskar Brothers to Consider Q4 Results on May 14",
            "Summary": "Kirloskar Brothers Limited has announced that it will consider and approve its financial results for the fourth quarter of the fiscal year on May 14. This meeting will likely provide insights into the company's performance for the last quarter and potentially for the entire fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1746627187000,
            "Source": "default"
        },
        {
            "Title": "Kirloskar Brothers Reports Improved Q3 EBITDA and Margin",
            "Summary": "Kirloskar Brothers has announced its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.66 billion rupees, up from 1.24 billion rupees in the same quarter of the previous year. Additionally, the EBITDA margin improved to 14.50% from 12.81% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739350994000,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Brothers Reports Q3 Revenue Growth",
            "Summary": "Kirloskar Brothers Limited has reported a revenue of 11.4 billion rupees for the third quarter, showing an increase from 9.7 billion rupees in the same period last year. This represents a year-over-year growth in the company's quarterly revenue.",
            "Sentiment": "positive",
            "PublishDate": 1739350990000,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Brothers Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Kirloskar Brothers Limited has announced its financial results for the third quarter, reporting a consolidated net profit of 1.17 billion rupees. This represents a substantial increase from the 820 million rupees reported in the same period of the previous year, indicating a year-over-year growth in the company's profitability.",
            "Sentiment": "positive",
            "PublishDate": 1739350944000,
            "Source": "earnings"
        },
        {
            "Title": "Kirloskar Brothers: Court Grants Interim Relief in Trademark Dispute",
            "Summary": "Pune District Court issued an interim order restraining Kirloskar Proprietary Limited (KPL) from using the 'Kirloskar' trademark, favoring Kirloskar Brothers Limited (KBL) in their ongoing dispute. The court rejected KPL's claim that trademark agreements were terminable, emphasizing their connection to a broader family settlement.",
            "Sentiment": "positive",
            "PublishDate": 1737568095000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kirloskar Brothers Ltd: Court Allows Continued Use of 'Kirloskar' Brand",
            "Summary": "A Pune district court has ruled in favor of Kirloskar Brothers Ltd (KBL), allowing them to continue using the 'Kirloskar' surname as their brand name. The court rejected claims of agreement breaches by Kirloskar Proprietary Ltd (KPL) and deemed the alleged violations as trivial. This decision stems from a dispute over trademark usage and licensing agreements within the Kirloskar Group.",
            "Sentiment": "positive",
            "PublishDate": 1737545061000,
            "Source": "order&deals"
        },
        {
            "Title": "Kirloskar Brothers: Stock Shows Signs of Recovery After Consolidation",
            "Summary": "Kirloskar Brothers stock has rallied 100% in the past year and over 30% in the last month. The stock recently bounced back after consolidating around 2,200 levels, which acted as support in September, June, and May 2024.",
            "Sentiment": "positive",
            "PublishDate": 1732681800000,
            "Source": "normal_news"
        },
        {
            "Title": "Kirloskar Brothers Reports Strong Q2 Financial Performance",
            "Summary": "Kirloskar Brothers has reported significant year-over-year improvements in its Q2 financial results. The company's EBITDA increased to 1.42 billion rupees from 948 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 13.72% from 10.38% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730187953000,
            "Source": "result"
        },
        {
            "Title": "Kirloskar Brothers Reports Q2 Revenue Decline",
            "Summary": "Kirloskar Brothers, an Indian pump manufacturing company, has reported a revenue of 6.9 billion rupees for the second quarter, down from 9 billion rupees in the same period last year. This represents a significant year-over-year decrease in revenue.",
            "Sentiment": "negative",
            "PublishDate": 1730187884000,
            "Source": "result"
        },
        {
            "Title": "Kirloskar Brothers Reports Significant Profit Increase in Q2",
            "Summary": "Kirloskar Brothers Limited has reported a consolidated net profit of 957 million rupees for the second quarter, compared to 504 million rupees in the same period last year. This represents a substantial year-over-year increase in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1730187859000,
            "Source": "result"
        }
    ]
}