{
    "Symbol": "KITEX",
    "ISIN": "INE602G01020",
    "News": [
        {
            "Title": "Kitex Garments Board Meet Set for Feb 13, 2026",
            "Summary": "Kitex Garments Limited has scheduled its Board meeting for February 13, 2026, to consider Q3 FY26 unaudited financial results. Trading window remains closed until 48 hours post-announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1770374122953,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kitex Garments Gets Credit Rating Update from India Ratings",
            "Summary": "India Ratings affirms ₹2,440 million facilities at IND A/Negative/IND A1 and assigns ₹1,039.80 million new facilities for Kitex Garments, with outlook revised to negative.",
            "Sentiment": "neutral",
            "PublishDate": 1769592872621,
            "Source": "stocks"
        },
        {
            "Title": "Kitex Garments Reports Zero Physical Share Transfers",
            "Summary": "Kitex Garments Limited reported no physical share transfer requests received or processed during the special re-lodgement window from July 07, 2025 to January 06, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769505474336,
            "Source": "stocks"
        },
        {
            "Title": "Kitex Garments Reports Mixed Results with Standalone Profit but Consolidated Loss",
            "Summary": "Kitex Garments Limited reported standalone net profit of Rs 1,087.28 lakhs for the quarter ended September 30, 2025, compared to Rs 2,605.08 lakhs in the previous year quarter. However, the company posted a consolidated net loss of Rs 621.85 lakhs versus a profit of Rs 1,930.34 lakhs in the same period last year. Revenue from operations declined to Rs 12,009.92 lakhs from Rs 19,669.19 lakhs year-on-year on standalone basis. The company received Rs 9,486.65 lakhs from associate company Kitex USA LLC towards outstanding trade receivables, leading to a write-back of Rs 1,750 lakhs provision recorded as exceptional income. Auditors have qualified their opinion regarding the company's investment in Kitex USA LLC worth Rs 2,776.24 lakhs, citing inability to verify recoverability due to the associate's fully eroded net worth. The Board approved quarterly results and a proposed demerger scheme with Kitex Childrenswear Limited.",
            "Sentiment": "negative",
            "PublishDate": 1762952972976,
            "Source": "earnings"
        },
        {
            "Title": "Usha CP Acquires Additional 2.90% Stake in Kitex Garments Through Off-Market Transaction",
            "Summary": "Usha CP has acquired 57,76,573 shares of Kitex Garments Limited, representing 2.90% of the company's total share capital, through an off-market transaction. Prior to this acquisition, Usha CP held 90,11,573 shares (4.52% stake) in the garment company. Following the transaction, her total shareholding has increased to 32,35,000 shares. The acquisition was disclosed under SEBI regulations for substantial acquisition of shares. Kitex Garments is listed on both BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1762486397442,
            "Source": "corporate_action"
        },
        {
            "Title": "Kitex Garments Corrects Demerger Disclosure, Reports Financial Results with Dividend Proposal",
            "Summary": "Kitex Garments Limited issued a correction to its Scheme of Arrangement disclosure between Kitex Childrenswear Limited and Kitex Garments Limited, rectifying a typographical error regarding turnover percentage from '54.50% of the total turnover of the Demerged Company' to '54.50% to the total turnover of the Resulting Company in the immediately preceding financial year'. The company announced audited standalone and consolidated financial results for the quarter and year ended March 31, 2024. The Board recommended a final dividend of Rs. 1.50 per equity share, subject to shareholder approval at the upcoming Annual General Meeting. The demerger involves the Textile Business Division with a turnover of Rs. 34,964.19 lakhs. Under the scheme, shareholders will receive 9,706 equity shares of face value Re. 1 each in the Resulting Company for every 100 shares of face value Rs. 100 each held in the Demerged Company. The auditors issued a qualified opinion on standalone results due to concerns over the recoverability of investment in associate Kitex USA LLC amounting to Rs. 2,776.24 lakhs, while consolidated results received an unmodified opinion.",
            "Sentiment": "neutral",
            "PublishDate": 1757138948618,
            "Source": "corporate_action"
        },
        {
            "Title": "Kitex Garments' Subsidiary Begins Commercial Production at Telangana Manufacturing Unit",
            "Summary": "Kitex Garments Limited announced that its subsidiary company, Kitex Apparel Parks Limited, has commenced commercial production at its manufacturing unit located in Warangal District, Telangana State. The company informed stock exchanges NSE and BSE about this operational milestone.",
            "Sentiment": "positive",
            "PublishDate": 1756384246925,
            "Source": "stock"
        },
        {
            "Title": "Kitex Garments Reports 3.3% Revenue Growth Despite US Market Challenges, Launches Domestic Brand",
            "Summary": "Kitex Garments Limited reported total income of ₹201.31 crores, EBITDA of ₹41.63 crores, and profit after tax of ₹26.05 crores for the quarter ended June 30, 2025. Revenue grew 3.3% compared to the corresponding quarter of the previous year, despite industry slowdown caused by US market uncertainties and tariff revisions that made customers hesitant to place orders. The company launched its US babywear brand 'Little Star' in the Indian market, targeting additional revenue of ₹1,000 crores over the next 2-3 years as part of its shift toward domestic markets amid trade uncertainties. The brand will initially launch on Indian e-commerce platforms before expanding to offline retail. Associate company Kitex USA LLC repatriated approximately ₹80 crores against ₹97 crores of pending receivables, with the remaining ₹17 crores expected by September 2025. Kitex USA LLC reported a profit of 8 lakhs USD during financial year 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1755088624521,
            "Source": "earnings"
        },
        {
            "Title": "Kitex Garments Launches US Brand 'Little Star' in India, Targets Rs 1,000 Crore Revenue",
            "Summary": "Kitex Garments launched its US babywear brand 'Little Star' in the Indian market, aiming to generate an additional Rs 1,000 crore in revenue over the next two to three years. Managing Director Sabu M Jacob stated this domestic expansion is a strategic move to mitigate risks from international market challenges, including trade uncertainties and tariffs from the Trump administration affecting Indian exporters to the US. The brand, previously exclusive to the US market, will initially launch on major e-commerce platforms before expanding to physical retail stores. Jacob highlighted India's high birth rate of around 24 million births annually and noted that market research suggests India's newborn apparel sector could reach Rs 1.46 lakh crore by 2030. The company has deferred discussions on its proposed investment in Andhra Pradesh due to ongoing tariff-related uncertainties.",
            "Sentiment": "positive",
            "PublishDate": 1754589360057,
            "Source": "stock"
        },
        {
            "Title": "Kitex Garments Board Approves Doubling of Authorized Share Capital to ₹50 Crores",
            "Summary": "Kitex Garments Limited's Board of Directors approved increasing the company's authorized share capital from ₹25 crores to ₹50 crores. The increase will double the authorized equity shares from 25 crore shares to 50 crore shares, each with a face value of ₹1. This decision requires shareholder approval at the upcoming Annual General Meeting and will necessitate changes to Clause V of the company's Memorandum of Association. The board meeting was held on August 4, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754315599157,
            "Source": "corporate_action"
        },
        {
            "Title": "Kitex Garments Launches 'Little Star' USA Brand in India, Targets INR 1,000 Crores Revenue",
            "Summary": "Kitex Garments Limited, the world's second largest manufacturer of infant and children's apparel, has launched its 'Little Star' USA brand in the Indian market. The company is targeting annual revenue of INR 1,000 crores within 2-3 years for this brand. The strategic move represents diversification into India's domestic kidswear sector as U.S. authorities impose higher tariffs on textile imports from India. Little Star will debut on multiple online platforms with a digital-first approach, offering apparel for newborns, infants, and young children. India's infant and children's wear market is projected to reach INR 1,46,763 crores by 2030, growing at 3% CAGR for infant wear and 2.6% for children's wear. The country witnesses nearly 24 million live births annually, which is 6 times that of the U.S. The phased rollout starts with major cities through e-commerce platforms before expanding to retail channels.",
            "Sentiment": "positive",
            "PublishDate": 1754311749269,
            "Source": "stock"
        },
        {
            "Title": "Kitex Garments Reports Mixed Q1 Results, Plans 30 Billion Rupee Fundraise",
            "Summary": "Kitex Garments reported mixed quarterly results with net profit declining to 261 million rupees from 300 million rupees year-over-year, while revenue increased to 1.97 billion rupees from 1.9 billion rupees. EBITDA decreased to 370 million rupees from 418 million rupees, with EBITDA margin compressing to 18.82% from 21.93%. The company plans to raise up to 30 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1754311288580,
            "Source": "stock"
        },
        {
            "Title": "Kitex Garments Reports Q1 Results, Plans ₹3,000 Crore Fund Raise and Share Capital Increase",
            "Summary": "Kitex Garments Limited announced its quarterly results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹19,669.19 lakhs and net profit of ₹2,605.08 lakhs. On consolidated basis, revenue was ₹19,669.19 lakhs with net profit of ₹1,930.38 lakhs. The board approved an enabling resolution to raise funds up to ₹3,000 crores through equity shares via qualified institutional placement, private placement or other permissible modes, subject to shareholder approval. The company also approved increasing its authorized share capital from ₹25 crores to ₹50 crores, pending shareholder consent. The auditors issued qualified opinions on both standalone and consolidated results due to concerns over the recoverability of ₹2,776.24 lakhs investment in associate Kitex USA LLC and ₹11,817.34 lakhs trade receivables from the same entity, which has been reporting continuous losses and has fully eroded net worth.",
            "Sentiment": "neutral",
            "PublishDate": 1754310619020,
            "Source": "earnings"
        },
        {
            "Title": "Kitex Garments to Explore Long-Term Funding Options on August 4",
            "Summary": "Kitex Garments has announced plans to explore long-term funding options, with this initiative scheduled for August 4. The company is looking into financing alternatives as part of its capital planning strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1753878127749,
            "Source": "stock"
        },
        {
            "Title": "Kitex Garments Reports Q4 Financial Results",
            "Summary": "Kitex Garments has announced its Q4 financial results. The company's EBITDA increased to 482 million rupees from 349.5 million rupees year-over-year. However, the EBITDA margin decreased to 16.05% from 20.19% compared to the same period last year. Net profit rose to 396 million rupees from 260 million rupees year-over-year, and 434 million rupees quarter-over-quarter. Revenue significantly increased to 3 billion rupees from 1.73 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748527987000,
            "Source": "result"
        },
        {
            "Title": "Kitex Garments Begins Trial Run at Warangal Unit",
            "Summary": "Kitex Garments has announced that its unit has commenced a trial run at its new facility in Warangal. This development indicates progress in the company's expansion plans and potential increase in production capacity.",
            "Sentiment": "positive",
            "PublishDate": 1745495406000,
            "Source": "default"
        },
        {
            "Title": "Kitex Garments and Kitex Childrenswear Announce Investment and Demerger Plans",
            "Summary": "Kitex Garments and Kitex Childrenswear are planning significant corporate actions. Kitex Garments will invest 1.1 billion rupees in Kitex Apparel Parks, with 70% of the investment coming from the company itself. Additionally, Kitex Childrenswear will demerge its textile business division. As part of this demerger, shareholders will receive 9,706 shares of Kitex Garments Limited (KGL) for every 100 shares held in Kitex Childrenswear Limited (KCL).",
            "Sentiment": "positive",
            "PublishDate": 1739751203000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kitex Childrenswear to Demerge Textile Business Division",
            "Summary": "Kitex Garments has announced that its subsidiary, Kitex Childrenswear Limited (KCL), will demerge its textile business division. As part of the demerger process, shareholders will receive 9,706 shares of Kitex Garments Limited (KGL) for every 100 shares held in KCL. This corporate action is likely aimed at restructuring the company's operations and potentially unlocking value for shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1739541081000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kitex Garments and Subsidiary to Invest in Kitex Apparel Parks",
            "Summary": "Kitex Garments and its subsidiary, Kitex Childrenswear, are planning to make additional investments in Kitex Apparel Parks. The total investment amount is 1.1 billion rupees, with Kitex Garments contributing 70% of the funds.",
            "Sentiment": "positive",
            "PublishDate": 1739539271000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kitex Garments Reports Strong Q3 Financial Performance",
            "Summary": "Kitex Garments has announced its financial results for the third quarter. The company's net profit has more than doubled to 434 million rupees, compared to 210 million rupees in the same period last year. Revenue also saw significant growth, reaching 2.76 billion rupees, up from 1.6 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739539041000,
            "Source": "earnings"
        },
        {
            "Title": "Kitex Garments to Invest ₹50.21 Crore in Subsidiary",
            "Summary": "Kitex Garments has announced plans to invest ₹50.21 crore in its subsidiary unit, Kitex Apparel Parks Limited. This investment decision indicates a significant expansion or development initiative within the company's operations.",
            "Sentiment": "positive",
            "PublishDate": 1737363727000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kitex Garments: Shares Hit Upper Circuit After 2:1 Bonus Share Allotment",
            "Summary": "Kitex Garments allotted 13.3 crore bonus shares in a 2:1 ratio to eligible shareholders, with the record date of January 17, 2025. The company's paid-up equity share capital increased to ₹19.95 crore. Shares locked at 5% upper circuit at ₹256.35 on BSE.",
            "Sentiment": "positive",
            "PublishDate": 1737358204000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kitex Garments Approves 2:1 Bonus Share Issue",
            "Summary": "Kitex Garments has approved a bonus issue of shares in the ratio of 2:1. This means shareholders will receive two additional shares for every one share they currently hold.",
            "Sentiment": "positive",
            "PublishDate": 1732254668000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kitex Garments to Consider Bonus Equity Shares",
            "Summary": "Kitex Garments has announced that it will consider issuing bonus equity shares at its board meeting scheduled for November 22.",
            "Sentiment": "positive",
            "PublishDate": 1731926985000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kitex Garments Reports Significant Profit Increase in Q2",
            "Summary": "Kitex Garments has reported a substantial increase in net profit for the second quarter. The company's net profit rose to 399 million rupees, compared to 132 million rupees in the same period last year, marking a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730281472000,
            "Source": "result"
        }
    ]
}