{
    "Symbol": "KKCL",
    "ISIN": "INE401H01017",
    "News": [
        {
            "Title": "KKCL Schedules Q3 FY26 Earnings Call on Feb 12",
            "Summary": "Kewal Kiran Clothing Limited announces earnings conference call on February 12, 2026 at 12:30 PM to discuss Q3 & 9M FY26 operational and financial performance with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1770456736679,
            "Source": "stocks"
        },
        {
            "Title": "KKCL Board Meet on Feb 10 for Q3FY26 Results",
            "Summary": "Kewal Kiran Clothing Limited has scheduled its board meeting for February 10, 2026, to consider Q3FY26 audited financial results and declare first interim dividend for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1769242437149,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kewal Kiran Clothing Appoints Deepak Bhatnagar as General Manager for Killer Retail Division",
            "Summary": "Kewal Kiran Clothing Limited appointed Deepak Bhatnagar as General Manager for Killer Retail effective December 3, 2025, bringing 18 years of retail industry experience from companies like Lifestyle, Shoppers Stop and Westside. The appointment strengthens the company's retail management team with experienced leadership for its Killer brand operations.",
            "Sentiment": "positive",
            "PublishDate": 1764761791222,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kewal Kiran Clothing Reports 14.9% Revenue Growth in Q2 FY26, Adds 29 New Stores",
            "Summary": "Kewal Kiran Clothing Limited delivered strong quarterly results with consolidated revenue reaching Rs. 354 crores, up 14.9% year-on-year, while standalone revenue grew 14% to Rs. 288 crores. The company achieved 17.3% apparel volume growth and 22.1% improvement in average realization per unit. EBITDA stood at Rs. 71 crores with margins at 20%, exceeding the guided range of 17-18%. The company expanded its retail footprint by adding 29 exclusive brand outlets during the quarter, bringing total stores to 652 as of September 30, 2025. Killer brand operates 437 EBOs, maintaining its dominant presence. Management reported positive response to spring-summer 2026 trade shows across all major brands and welcomed the government's GST reduction on selected apparel price points. The company maintains its Vision 2028 roadmap targeting Rs. 1500 crores revenue through organic growth, with plans to open 90-100 stores annually and explore potential acquisitions for inorganic growth.",
            "Sentiment": "positive",
            "PublishDate": 1761073679994,
            "Source": "earnings"
        },
        {
            "Title": "Kewal Kiran Clothing Reports 14.9% Revenue Growth in Q2 FY26 with Strong Brand Performance",
            "Summary": "Kewal Kiran Clothing Limited delivered consolidated revenue of Rs. 354 crores in Q2 FY26, marking 14.9% year-on-year growth. Standalone revenue grew 14% to Rs. 288 crores. The company achieved 17.3% apparel volume growth and 22.1% improvement in average realization per unit. EBITDA reached Rs. 71 crores with 11% growth and margins of 20%, exceeding the guided range of 17-18%. The company added 29 exclusive brand outlets during the quarter, bringing total stores to 652. Killer brand operates 437 EBOs and contributes the highest margins. Management reported positive response to spring-summer 2026 trade shows across all brands. The company benefits from recent GST reduction on selected apparel price points and maintains double-digit growth guidance. Vision 2028 roadmap targets Rs. 1500 crores revenue through organic growth. Management expects to open 90-100 stores annually and maintains EBITDA margin guidance of 17-18% for the full year.",
            "Sentiment": "positive",
            "PublishDate": 1760872986497,
            "Source": "earnings"
        },
        {
            "Title": "Kewal Kiran Clothing Plans Brand-Focused Retail Expansion and Premium Denim Strategy for FY26 Growth",
            "Summary": "Kewal Kiran Clothing has outlined strategic plans focused on brand-driven retail growth and an enhanced premium denim product mix. The company aims to boost profitability and achieve steady growth in FY26 through these initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1760547098725,
            "Source": "stock"
        },
        {
            "Title": "Kewal Kiran Clothing Reports Best-Ever Quarterly Performance with 14.9% Revenue Growth",
            "Summary": "Kewal Kiran Clothing Limited reported its best-ever quarterly performance for Q2 FY26, with revenue from operations growing 14.9% year-on-year to ₹354.1 crores compared to ₹308.2 crores in Q2 FY25. Gross profit increased 15.8% to ₹149.2 crores with margins at 42.1%. EBIDTA grew 11.0% to ₹71.0 crores with margins at 20.0%, surpassing company guidance. For the first half of FY26, revenue grew 27.9% to ₹587.8 crores. The company expanded its retail presence by adding 29 Exclusive Brand Outlets during the quarter, bringing the total to 652 EBOs alongside 3,000+ Multi-Brand Outlets. KKCL served as an official partner for the Asia Cup 2025 Cricket Series, enhancing brand visibility across India and South Asia. Joint Managing Director Hemant Jain attributed the performance to strategic execution, favorable macroeconomic conditions, and disciplined operational management, with growth driven by volume expansion and higher realizations across retail and non-retail channels.",
            "Sentiment": "positive",
            "PublishDate": 1760528003705,
            "Source": "earnings"
        },
        {
            "Title": "Kewal Kiran Clothing Reports Lower Quarterly Profit Despite Revenue Growth",
            "Summary": "Kewal Kiran Clothing Limited reported quarterly results with revenue from operations of Rs. 28,784 lakhs compared to Rs. 25,317 lakhs in the previous year quarter. However, profit before tax declined to Rs. 5,636 lakhs from Rs. 8,208 lakhs in the corresponding quarter, primarily due to lower other income. Other income for the quarter included realized gain of Rs. 382 lakhs and unrealized gain of Rs. 122 lakhs, compared to realized gain of Rs. 2,851 lakhs and unrealized gain of Rs. 379 lakhs in the previous year quarter. The company's earnings per share stood at Rs. 6.91 compared to Rs. 10.46 in the same quarter last year. The Board of Directors approved these audited financial results in their meeting held on October 15, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1760525952511,
            "Source": "earnings"
        },
        {
            "Title": "Kewal Kiran Clothing Reports 54.5% Revenue Growth in Q1 FY26, Targets 100+ Store Additions",
            "Summary": "Kewal Kiran Clothing Limited reported consolidated revenue of ₹235 crore, up 54.5% year-on-year, with standalone revenue reaching ₹181 crore, up 20%. EBITDA increased 50.6% to ₹42 crore with margins at 17.8%. The company achieved 46.4% volume growth and 14.4% increase in average realization per unit. Retail channel grew 86% while non-retail channel expanded 29%, with same-store sales growth of 25%. The company added 14 exclusive brand outlets in the quarter, bringing total stores to 623, and plans to add 100+ stores in FY26. Killer, Kraus and Junior Killer brands showed stronger contribution, with denim maintaining above 50% of product mix. Management provided FY26 guidance of 18-20% consolidated revenue growth, 42-45% gross margins, and 17-18% EBITDA margins. The company received positive feedback from its Spring-Summer 2026 trade show and expects to maintain growth momentum through festive and winter seasons.",
            "Sentiment": "positive",
            "PublishDate": 1754902462971,
            "Source": "earnings"
        },
        {
            "Title": "Kewal Kiran Announces Expansion Plans for FY28 Focusing on Killer and Kraus Brands",
            "Summary": "Kewal Kiran has unveiled expansion plans targeting FY28, focusing on its Killer and Kraus brands. The company's strategy involves brand expansion through design and retail integration.",
            "Sentiment": "positive",
            "PublishDate": 1754576607527,
            "Source": "stock"
        },
        {
            "Title": "Kewal Kiran Clothing Reports 54.5% Revenue Growth in Q1 FY26",
            "Summary": "Kewal Kiran Clothing Limited announced its Q1 FY26 financial results with revenue from operations growing 54.5% year-on-year to ₹233.8 crores compared to ₹151.2 crores in Q1 FY25. EBITDA increased 50.6% to ₹41.5 crores from ₹27.6 crores, while profit after tax rose 26.9% to ₹32.0 crores from ₹25.2 crores. Gross profit grew 43.5% to ₹98.6 crores. The company added 14 new exclusive brand outlets during the quarter, bringing total store count to 623 as of June 30, 2025. Chairman Kewalchand P. Jain attributed the growth to strong volume expansion, improved realizations, and the integration of Kraus acquisition. The company operates brands including Killer, Integriti, Lawman, Easies, Junior Killer, and Kraus across retail and non-retail channels.",
            "Sentiment": "positive",
            "PublishDate": 1754575004664,
            "Source": "corporate_action"
        },
        {
            "Title": "Kewal Kiran Clothing Reports 9.3% Revenue Growth in Q1 FY26",
            "Summary": "Kewal Kiran Clothing Limited reported standalone revenue from operations of Rs. 18,128 lakhs for the quarter ended June 30, 2025, compared to Rs. 15,125 lakhs in the same period last year. Net profit increased to Rs. 3,054 lakhs from Rs. 2,531 lakhs year-over-year. On a consolidated basis, revenue grew to Rs. 23,375 lakhs from Rs. 15,125 lakhs, while consolidated net profit attributable to owners reached Rs. 3,128 lakhs versus Rs. 2,521 lakhs in the previous year. Other income for the quarter included a realized gain of Rs. 460 lakhs from sale of investment and unrealized mark-to-market gain of Rs. 777 lakhs on standalone basis. The company noted that revenue is unevenly spread throughout the year due to the nature of its business. Basic earnings per share improved to Rs. 4.96 from Rs. 4.11 on standalone basis and Rs. 5.08 from Rs. 4.09 on consolidated basis.",
            "Sentiment": "positive",
            "PublishDate": 1754573359943,
            "Source": "earnings"
        },
        {
            "Title": "Kewal Kiran Clothing Schedules Q1FY26 Earnings Conference Call for August 8, 2025",
            "Summary": "Kewal Kiran Clothing Limited has scheduled a virtual earnings conference call on August 8, 2025, at 11:30 AM to discuss operational and financial performance for Q1FY26. The call will be open to investors, analysts, and the general public. The session will be represented by Joint Managing Director Hemant Jain and President Retail Pankaj Jain. Participants can join through multiple international dial-in numbers, with pre-registration available through a provided link. Marathon Capital Advisory Private Limited is coordinating the event.",
            "Sentiment": "neutral",
            "PublishDate": 1754040716490,
            "Source": "earnings"
        },
        {
            "Title": "Kewal Kiran Clothing Announces Q4 Results and Dividend",
            "Summary": "Kewal Kiran Clothing reported its Q4 financial results. The company's EBITDA remained relatively stable at 423 million rupees compared to 424 million rupees year-over-year, with EBITDA margin decreasing from 19.34% to 18.05%. Net profit declined to 280 million rupees from 376 million rupees year-over-year. Revenue increased to 2.3 billion rupees from 2.2 billion rupees. The company also recommended a dividend of 2 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1747062185000,
            "Source": "result"
        },
        {
            "Title": "Kewal Kiran Clothing Ltd: Kraus Acquisition Boosts Growth Amid Standalone Slowdown",
            "Summary": "Kewal Kiran projects double-digit revenue growth for Q4 and FY26, with streamlined production schedules. The company expects to maintain an EBITDA margin of 18-20%. Anand Rathi maintains a 'Buy' rating on the stock.",
            "Sentiment": "positive",
            "PublishDate": 1739528715000,
            "Source": "earnings"
        },
        {
            "Title": "Kewal Kiran Clothing Reports Q2 Financial Results",
            "Summary": "Kewal Kiran Clothing announced its Q2 financial results. The company's net profit increased to 645 million rupees, up from 498 million rupees year-over-year and 253 million rupees quarter-over-quarter. However, revenue slightly decreased to 2.5 billion rupees from 2.62 billion rupees compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1729861658000,
            "Source": "result"
        }
    ]
}