{
    "Symbol": "KLL",
    "ISIN": "INE0Q2V01012",
    "News": [
        {
            "Title": "Kaushalya Logistics Expands Network to 15 Depots Under CCFA Model",
            "Summary": "Kaushalya Logistics has expanded its network to a total of 15 depots under the CCFA (Carrying and Forwarding Agent) model. This expansion indicates growth in the company's distribution capabilities and potential market reach.",
            "Sentiment": "positive",
            "PublishDate": 1744691819000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kaushalya Logistics Expands Network to Over 100 Depots Nationwide",
            "Summary": "Kaushalya Logistics has expanded its operations, surpassing 100 depots across India. This significant milestone indicates substantial growth in the company's logistics network and its ability to serve a wider geographical area.",
            "Sentiment": "positive",
            "PublishDate": 1742532199000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kaushalya Logistics Expands Operations with New Depot for Adani Group",
            "Summary": "Kaushalya Logistics has expanded its footprint by establishing a new depot in Tohana for the Adani Group. This expansion is operating under the Carrying and Forwarding Agent (CFA) model. The company, with a market capitalization of 171 crore rupees, is classified as a Small and Medium Enterprise (SME).",
            "Sentiment": "positive",
            "PublishDate": 1741326924000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kaushalya Logistics Expands Operations with New Depot for Adani Group",
            "Summary": "Kaushalya Logistics has expanded its operational footprint by establishing a new depot in Tohana for the Adani Group. This expansion is being implemented under the Carrying and Forwarding Agent (CFA) model, indicating a strategic partnership to enhance logistics services for Adani Group in the region.",
            "Sentiment": "positive",
            "PublishDate": 1741326840000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kaushalya Logistics Expands Operations with New Depot for ACC and Ambuja Cement",
            "Summary": "Kaushalya Logistics has accelerated its growth by establishing a new depot to serve ACC and Ambuja Cement. This expansion indicates a strategic move to enhance the company's logistics capabilities and strengthen its partnership with major cement manufacturers.",
            "Sentiment": "positive",
            "PublishDate": 1741240730000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kaushalya Logistics Expands Operations with New Depot in Darbhanga",
            "Summary": "Kaushalya Logistics has expanded its operations by opening a new depot in Darbhanga. This expansion signifies the company's growth strategy and efforts to enhance its logistics network.",
            "Sentiment": "positive",
            "PublishDate": 1740983443000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kaushalya Logistics Expands Network with New Depot in Varanasi for Adani Cement Group",
            "Summary": "Kaushalya Logistics has strengthened its network by establishing a new depot in Varanasi, specifically for the Adani Cement Group. This expansion indicates a strategic move to enhance the company's logistics capabilities and service offerings for a major client in the cement industry. The company's market capitalization is reported to be 170 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1740374072000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kaushalya Logistics Expands Partnership with Adani Cement",
            "Summary": "Kaushalya Logistics has expanded its footprint by partnering with Adani Cement under the CCFA (Cement Carrier Franchise Agreement) model. This strategic move indicates a growth in the company's logistics operations and potentially strengthens its position in the cement transportation sector.",
            "Sentiment": "positive",
            "PublishDate": 1737348757000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kaushalya Logistics Opens New Depot for Ambuja Cement in Haryana",
            "Summary": "Kaushalya Logistics has announced the opening of a new depot for Ambuja Cement, an Adani Group company, in Haryana. This development suggests an expansion of distribution capabilities for Ambuja Cement in the region. Kaushalya Logistics, with a market capitalization of 175 crore rupees, is likely facilitating this expansion as a logistics partner.",
            "Sentiment": "positive",
            "PublishDate": 1737001765000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kaushalya Logistics Receives CFA Operation Approval from Adani Cement in Haryana",
            "Summary": "Kaushalya Logistics has obtained approval for Carrying and Forwarding Agent (CFA) operations from Adani Cement in the state of Haryana. This approval allows the company to act as a logistics partner for Adani Cement's distribution network in the region.",
            "Sentiment": "positive",
            "PublishDate": 1734496268000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kaushalya Logistics Expands Cement Logistics Operations in Uttar Pradesh",
            "Summary": "Kaushalya Logistics is set to expand its cement logistics operations by establishing new depots for JK Cement in Uttar Pradesh. This expansion indicates a strategic move to strengthen the company's presence in the cement logistics sector within the state.",
            "Sentiment": "positive",
            "PublishDate": 1734409298000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kaushalya Logistics Partners with Maersk Line for Surface Transportation in India",
            "Summary": "Kaushalya Logistics has entered into a partnership with Maersk Line to enhance surface transportation services in India. This collaboration aims to strengthen the logistics and transportation infrastructure within the country.",
            "Sentiment": "positive",
            "PublishDate": 1730706688000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kaushalya Logistics Secures Agricultural Contract in Uttarakhand",
            "Summary": "Kaushalya Logistics has obtained a Full Truck Load (FTL) contract with Uttarakhand Seeds & Tarai Development Corporation, marking its expansion into agricultural logistics. This move signifies the company's growth and diversification into a new sector of the logistics industry.",
            "Sentiment": "positive",
            "PublishDate": 1730090711000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kaushalya Logistics Expands FTL Segment with New Client",
            "Summary": "<p><span class=\"positive\">Kaushalya Logistics</span> has <span class=\"positive\">expanded</span> its <b>Full Truck Load (FTL)</b> segment by <span class=\"positive\">adding</span> <span class=\"neutral\">Bondada Engineering</span> as a new client. This development suggests <span class=\"positive\">growth</span> in the company's logistics operations and client base.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728631804000,
            "Source": "corporate_action"
        }
    ]
}