{
    "Symbol": "KMSUGAR",
    "ISIN": "INE157H01023",
    "News": [
        {
            "Title": "K.M. Sugar Mills Board Meet Set for Feb 10, 2026",
            "Summary": "K.M. Sugar Mills Ltd. schedules board meeting on February 10, 2026 to consider Q3FY26 unaudited financial results. Trading window closed from January 1 till February 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770375201202,
            "Source": "co_actions_results"
        },
        {
            "Title": "K.M. Sugar Mills Reports Erroneous Share Transfer",
            "Summary": "K.M. Sugar Mills disclosed that Stockholding Corporation of India erroneously transferred 5,00,000 equity shares (0.54%) to wrong demat account without authorization on December 11, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1767767431893,
            "Source": "stocks"
        },
        {
            "Title": "KM Sugar Mills Reports Quarterly Financial Results for September 2025",
            "Summary": "KM Sugar Mills Limited announced its unaudited standalone and consolidated financial results for the quarter ended September 30, 2025. The company's board approved the results following recommendations from the Audit Committee. The results were reviewed by statutory auditors Mehrotra & Mehrotra, Chartered Accountants. The company operates in two main segments - Sugar and Distillery. Sugar segment generated revenue of Rs. 16,009 lakhs for the quarter, while Distillery segment contributed Rs. 1,940 lakhs. The company has a wholly owned subsidiary, K.M. Spirits Allied Industries Limited, which has not yet commenced operations. The board meeting was held on November 10, 2025, commencing at 1:30 PM and concluding at 5:20 PM.",
            "Sentiment": "neutral",
            "PublishDate": 1762781019213,
            "Source": "earnings"
        },
        {
            "Title": "K.M Sugar Mills Limited Submits Annual Secretarial Compliance Report for FY2025",
            "Summary": "K.M Sugar Mills Limited has submitted its Annual Secretarial Compliance Report for the financial year ended March 31, 2025, to NSE and BSE. The report was prepared by Pragati Gupta, Practising Company Secretary, and shows full compliance with applicable SEBI regulations during the review period. The company reported no non-compliance issues, no regulatory actions taken against it, and no auditor resignations during the year. The report covers compliance with various SEBI regulations including Listing Obligations, Prohibition of Insider Trading, and Takeover Regulations. All required policies have been adopted and updated timely, and the company maintains proper disclosure practices on its website.",
            "Sentiment": "positive",
            "PublishDate": 1757135803125,
            "Source": "corporate_governance"
        },
        {
            "Title": "K M Sugar Mills Reports Strong Q1 Results, Announces Leadership Changes and Distillery Division Demerger",
            "Summary": "K M Sugar Mills Limited approved its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 20,823 lakhs, up from Rs 16,950 lakhs in the same quarter last year, with profit after tax of Rs 1,313 lakhs compared to Rs 701 lakhs previously. The board approved the resignation of Ms. Pooja Dua as Company Secretary & Compliance Officer and appointed Ms. Ritika Tandon as her replacement, both effective August 07, 2025. Additionally, the company approved a scheme to demerge its Distillery Division into K M Spirits and Allied Industries Limited on a going concern basis. The Distillery Division generated turnover of Rs 91.21 crore, representing 13.29% of total standalone turnover. Shareholders of K M Sugar Mills will receive equity shares in the resulting company at a ratio of 1 share of face value Rs 10 for every 5 shares held in the parent company. The demerger requires approvals from stock exchanges, SEBI, NCLT, shareholders, creditors and other regulatory authorities.",
            "Sentiment": "positive",
            "PublishDate": 1754572867935,
            "Source": "earnings"
        },
        {
            "Title": "K M Sugar Mills Restructures Distillery Unit Capacity",
            "Summary": "K M Sugar Mills has announced a re-arrangement of its distillery unit capacity. The licensed capacity for country liquor has been increased from 25,00,000 liters to 60,00,000 liters, while the capacity for industrial alcohol has been reduced from 1,50,00,000 liters to 1,15,00,000 liters. The overall capacity remains unchanged at 1,75,00,000 liters.",
            "Sentiment": "neutral",
            "PublishDate": 1729605168000,
            "Source": "corporate_action"
        }
    ]
}