{
    "Symbol": "KNRCON",
    "ISIN": "INE634I01029",
    "News": [
        {
            "Title": "KNR Constructions Q3 Net Profit Drops 59% YoY",
            "Summary": "KNR Constructions reported consolidated net profit of 1.03 billion rupees in Q3, marking a significant decline of 59% compared to 2.5 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1770289546397,
            "Source": "co_actions_results"
        },
        {
            "Title": "C&C Constructions Forms Power Transmission Subsidiary",
            "Summary": "C&C Constructions Limited incorporated wholly owned subsidiary Ceigall Transmission and Distribution Limited on January 05, 2026, for power transmission and distribution business with authorized capital of ₹1.00 lakh.",
            "Sentiment": "positive",
            "PublishDate": 1767708795389,
            "Source": "co_actions_results"
        },
        {
            "Title": "Road & highway stocks crash up to 53% in 2025",
            "Summary": "KNR Constructions leads sector decline with 53% drop as road awards remain subdued. Flat Budget 2025 capex allocation and shrinking market share of listed developers fuel investor concerns ahead of FY27E budget.",
            "Sentiment": "negative",
            "PublishDate": 1767587651358,
            "Source": "stocks"
        },
        {
            "Title": "KNR Constructions Wins Income Tax Appeals for 4 Years",
            "Summary": "KNR Constructions receives favorable orders from Commissioner of Income Tax (Appeals)-12, Hyderabad for assessment years 2017-18 to 2020-21, allowing company's appeals against disallowed Section 80-IA deductions.",
            "Sentiment": "positive",
            "PublishDate": 1767247964389,
            "Source": "stocks"
        },
        {
            "Title": "KNR Constructions faces ₹5.37 cr tax demand order",
            "Summary": "KNR Constructions receives revised tax authority order demanding ₹5.37 crores for alleged GST violations including excess ITC claims and delayed return filings. Company plans to appeal.",
            "Sentiment": "negative",
            "PublishDate": 1766760088724,
            "Source": "stocks"
        },
        {
            "Title": "KNR Constructions exits 4 road projects for ₹1,543 cr",
            "Summary": "KNR Constructions signed agreements to sell 100% stake in four road SPVs to Indus Infra Trust for ₹1,543.19 crore, expecting completion by September.",
            "Sentiment": "positive",
            "PublishDate": 1766667807350,
            "Source": "co_actions_results"
        },
        {
            "Title": "KNR Constructions Receives ₹72.03 Cr IT Demand Order",
            "Summary": "KNR Constructions receives income tax demand of ₹72.03 crores including ₹42.33 crores interest for AY 2007-08 related to alleged short-term capital gains on agricultural land sale.",
            "Sentiment": "negative",
            "PublishDate": 1765797746996,
            "Source": "stocks"
        },
        {
            "Title": "KNR Constructions Credit Rating Reviewed by CRISIL",
            "Summary": "CRISIL Ratings reviewed KNR Constructions Limited's credit rating, assigning CRISIL AA Stable for long-term bank facilities and CRISIL A1 for short-term facilities. Both ratings were removed from Rating Watch with Developing Implications, indicating resolution of previous rating uncertainties.",
            "Sentiment": "positive",
            "PublishDate": 1764310422263,
            "Source": "stock"
        },
        {
            "Title": "KNR Constructions Receives Completion Certificate for Rs 1,180 Crore Tamil Nadu Highway Project",
            "Summary": "KNR Constructions Limited received completion certificate for construction of elevated highway along Avinashi Road in Coimbatore city from Goldwins to Uppilipalayam under EPC mode, with project cost of Rs 1,180 crores. The highway project spanning Km 147/100-157/200 of SH-52 in Tamil Nadu was completed and certified, marking successful delivery of major infrastructure development.",
            "Sentiment": "positive",
            "PublishDate": 1763798999835,
            "Source": "stock"
        },
        {
            "Title": "KNR Constructions Secures Rs. 319.24 Crore Bridge Construction Contract",
            "Summary": "KNR Constructions Limited received a Letter of Acceptance from Musi Riverfront Development Corporation Limited for constructing an iconic bridge across Mir Alam Tank worth Rs. 319.24 crore excluding GST under EPC mode. The project has a construction period of 24 months and the company has closed its trading window from November 21-23, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763717253286,
            "Source": "order&deals"
        },
        {
            "Title": "KNR Constructions Secures Rs 3.2 Billion Project Contract",
            "Summary": "KNR Constructions has received a Letter of Acceptance for a project valued at Rs 3.2 billion. This contract award represents a significant business development for the construction company.",
            "Sentiment": "positive",
            "PublishDate": 1763716963209,
            "Source": "stock"
        },
        {
            "Title": "KNR Constructions Reports Q2FY26 Results with Revenue Decline and Settlement with NHAI",
            "Summary": "KNR Constructions reported standalone revenue of INR 493 crores for Q2FY26 with EBITDA margin of 10.9%, while securing settlement agreement with NHAI for Ramanattukara project and receiving LOA for two new EPC projects worth INR 531 crores in Telangana. The company faces challenges with order inflows due to sluggish project awarding by NHAI and extended monsoon conditions affecting execution, while targeting INR 8,000-10,000 crores of new orders by end of FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1763623365629,
            "Source": "earnings"
        },
        {
            "Title": "HDFC Mutual Fund Reduces Stake in KNR Constructions to 5.45%",
            "Summary": "HDFC Mutual Fund sold 40 lakh shares of KNR Constructions on November 11, 2025, reducing its shareholding by 0.36% to 5.45% of the company's paid-up equity share capital. The transaction was conducted through open market sale, with the fund's total holding decreasing from the previously reported level in compliance with SEBI disclosure regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763098451160,
            "Source": "corporate_action"
        },
        {
            "Title": "KNR Constructions Targets Double-Digit Revenue Growth With ₹12,000 Crore Order Book",
            "Summary": "KNR Constructions has outlined its growth strategy with a strong order book valued at ₹12,000 crores. The company is focusing on efficient execution across road, water, and irrigation projects while targeting double-digit revenue growth and margin stability. The company plans to leverage new BOT (Build-Operate-Transfer) and HAM (Hybrid Annuity Model) projects to enhance long-term cash flow visibility.",
            "Sentiment": "positive",
            "PublishDate": 1762963445706,
            "Source": "stock"
        },
        {
            "Title": "KNR Constructions Reports Strong Q2 Performance with 99% Revenue Growth",
            "Summary": "KNR Constructions Limited announced its quarterly results for the period ended September 30, 2025. The company reported standalone revenue from operations of Rs 64,680.36 lakhs compared to Rs 32,508.25 lakhs in the previous quarter, representing significant growth. Net profit after tax stood at Rs 2,790.87 lakhs for the quarter versus Rs 5,128.59 lakhs in the prior quarter. For the half-year period, revenue reached Rs 97,188.61 lakhs with net profit of Rs 7,919.46 lakhs. On a consolidated basis, the company achieved revenue of Rs 65,397.48 lakhs for the quarter with net profit of Rs 9,568.04 lakhs. The Board of Directors approved these unaudited financial results at their meeting held on November 12, 2025. The company's earnings per share for the quarter was Rs 0.99 on a standalone basis.",
            "Sentiment": "positive",
            "PublishDate": 1762954684194,
            "Source": "earnings"
        },
        {
            "Title": "KNR Constructions Reports Sharp Decline in Q2 Financial Performance",
            "Summary": "KNR Constructions reported significantly lower financial results for Q2. Revenue dropped to 6.5 billion rupees from 19.45 billion rupees in the same quarter last year. Net profit fell to 1.05 billion rupees compared to 4.4 billion rupees year-over-year. EBITDA declined to 1.9 billion rupees from 8.7 billion rupees, while EBITDA margin compressed to 29.78% from 44.72% in the corresponding period last year.",
            "Sentiment": "negative",
            "PublishDate": 1762951737390,
            "Source": "earnings"
        },
        {
            "Title": "KNR Constructions' Subsidiary Receives Completion Certificate for Kerala Highway Project",
            "Summary": "KNR Guruvayur Infra Private Limited, a wholly owned subsidiary of KNR Constructions Limited, received a Provisional Certificate of Completion for a six-laning highway project in Kerala. The project involves upgrading NH-66 from Valanchery bypass to Kappirikkad section under the Bharathmala Pariyojana on Hybrid Annuity Mode. The project had a bid cost of Rs 2,140 crores and was appointed on 21st January 2022 with a construction period of 1,274 days including an extension of time of 364 days. The completion certificate was effective from 17th July 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761564709866,
            "Source": "stock"
        },
        {
            "Title": "KNR Constructions' Subsidiary Settles with NHAI, Avoids Penalties Through Viaduct Construction Agreement",
            "Summary": "KNR Constructions Limited's subsidiary, KNR Ramanatttukara Infra Private Limited (KRIPL), signed a settlement agreement with the National Highways Authority of India (NHAI). Under the agreement, KRIPL will construct a 377-meter viaduct between Km 276.730 to Km 277.140 at its own cost, with completion required by February 28, 2026, including a 90-day grace period. NHAI granted an extension of time without damages for the project work. The provisional completion certificate for the remaining project (excluding the viaduct stretch) is expected by July 18, 2025, without damages. As part of the settlement, KRIPL and its promoters agreed not to participate in NHAI bids until November 30, 2025. In return, NHAI agreed to drop all penalty and debarment proceedings against KRIPL and its promoters.",
            "Sentiment": "positive",
            "PublishDate": 1760617482168,
            "Source": "stock"
        },
        {
            "Title": "KNR Construction Secures ₹72.8 Crore Flyover Project in Hyderabad",
            "Summary": "KNR Construction has won an EPC (Engineering, Procurement, and Construction) project worth ₹72.8 crore from the Greater Hyderabad Municipal Corporation. The project involves construction of flyovers at Kukatpally 'Y' Junction.",
            "Sentiment": "positive",
            "PublishDate": 1759237696557,
            "Source": "stock"
        },
        {
            "Title": "KNR Constructions Secures Rs. 459 Crore Infrastructure Project in Telangana",
            "Summary": "KNR Constructions Limited received a Letter of Acceptance for a construction project worth Rs. 459.07 crore in Telangana. The project involves construction of multi-level flyovers and grade separators at Khajaguda Junction and IIIT Junction, along with widening and development of roads including a 215 feet road from CP Cyberabad Officer to Gachibowli Junction and a 150 feet road from Anjaiah Nagar to Ramky Tower Road. The project will be executed on an Engineering Procurement Construction (EPC)/Turnkey basis with a 24-month completion timeline. The company has closed its trading window for securities from September 23-25, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758618679755,
            "Source": "stock"
        },
        {
            "Title": "C&C Constructions Board Approves ₹50 Crore Inter-Corporate Deposit from Ceigall India",
            "Summary": "C&C Constructions' board has approved a ₹50 crore inter-corporate deposit from Ceigall India as part of a revival plan. The deposit is intended to support the company's revival efforts.",
            "Sentiment": "positive",
            "PublishDate": 1758205720582,
            "Source": "stock"
        },
        {
            "Title": "KNR Constructions Targets 15-20% Growth in FY26 With ₹6,963 Crore Order Book",
            "Summary": "KNR Constructions has set a growth target of 15-20% for FY26, supported by an order book worth ₹6,963 crore. The company operates with no debt and focuses on high-profit road and irrigation projects to maintain profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754929375264,
            "Source": "stock"
        },
        {
            "Title": "KNR Constructions Reports Decline in Q1 Profit and Revenue",
            "Summary": "KNR Constructions reported consolidated net profit of 1.23 billion rupees in Q1, down from 1.65 billion rupees in the same period last year. The company's revenue also declined to 6.12 billion rupees compared to 9.85 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1754916145276,
            "Source": "earnings"
        },
        {
            "Title": "C&C Constructions Wins ₹66 Crore Arbitration Award Against HPRIDC",
            "Summary": "C&C Constructions has secured a ₹66 crore arbitration award against HPRIDC (Himachal Pradesh Rural Infrastructure Development Corporation). The arbitration ruling was decided in favor of the construction company.",
            "Sentiment": "positive",
            "PublishDate": 1753710405048,
            "Source": "stock"
        },
        {
            "Title": "KNR Constructions Receives Favorable Delhi High Court Order on NHAI Suspension",
            "Summary": "KNR Constructions Limited received a favorable interim order from Delhi High Court regarding a suspension imposed by NHAI on its subsidiary KNR Ramanattukara Infra Private Limited. The suspension was imposed following infrastructure failure in a project stretch from Ch 276.8 to Ch 277.05 on May 19, 2025, which led to NHAI suspending the subsidiary from participating in bidding processes for one month or until completion of investigation. The Delhi High Court ruled that the suspension period has expired and the investigation is completed, stating that the suspension order should not be treated as disqualification anymore. The court noted that barring the petitioner's right to bid in future bidding under the guise of suspension appears to be a drastic measure. The next hearing is scheduled for July 25, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753181306826,
            "Source": "stock"
        },
        {
            "Title": "KNR Constructions: Joint Venture Secures ₹4,800 Crore NTPC Contract",
            "Summary": "KNR Constructions and Harsha Constructions joint venture received a Letter of Acceptance from NTPC subsidiary for a ₹4,800 crore contract to develop and operate Banhardih coal mining block in Jharkhand for 5 years. KNR Constructions will operate 74% of the block. The stock jumped 9% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1750848236000,
            "Source": "order&deals"
        },
        {
            "Title": "KNR Constructions Joint Venture Secures ₹4,800 Crore Contract",
            "Summary": "KNR Constructions, in a joint venture, has secured a contract worth ₹4,800 crore for a duration of 5 years. The company holds a 74% share in this venture. KNR Constructions expects to generate ₹710 crore annually from this contract, which is projected to increase their revenue by 17% to ₹4,754 crore in the upcoming financial year.",
            "Sentiment": "positive",
            "PublishDate": 1750845781000,
            "Source": "default"
        },
        {
            "Title": "KNR Construction Secures ₹4,800 Crore Contract",
            "Summary": "KNR Construction has been awarded a new contract valued at ₹4,800 crore. The news indicates a significant business development for the company in the construction sector.",
            "Sentiment": "positive",
            "PublishDate": 1750844480000,
            "Source": "default"
        },
        {
            "Title": "KNR Constructions Reports Q4 Financial Results",
            "Summary": "KNR Constructions has released its Q4 financial results. The company's EBITDA for Q4 was 2.2 billion rupees, down from 3.75 billion rupees year-over-year. The EBITDA margin decreased to 22.71% from 26.49% in the same period last year. The consolidated net profit for Q4 was 1.39 billion rupees, compared to 3.53 billion rupees year-over-year and 2.5 billion rupees quarter-over-quarter. Q4 revenue stood at 9.75 billion rupees, down from 14.1 billion rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748523761000,
            "Source": "result"
        },
        {
            "Title": "KNR Constructions Reports Mixed Q3 Results",
            "Summary": "KNR Constructions has reported its Q3 financial results. The company's consolidated net profit increased to 2.5 billion rupees, up from 1.4 billion rupees in the same quarter last year. However, revenue decreased to 8 billion rupees from 10 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739492295000,
            "Source": "earnings"
        },
        {
            "Title": "KNR Constructions Reports Improved Q3 EBITDA and Margin",
            "Summary": "KNR Constructions has announced its Q3 financial results, showing significant improvement in both EBITDA and EBITDA margin compared to the same period last year. The company's EBITDA increased to 2.56 billion rupees from 2.26 billion rupees year-over-year. Additionally, the EBITDA margin expanded to 30.14% from 22.68% in the previous year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739449310000,
            "Source": "earnings"
        },
        {
            "Title": "KNR Constructions Reports Mixed Q3 Financial Results",
            "Summary": "KNR Constructions announced its Q3 consolidated financial results. The company's net profit increased to 2.5 billion rupees from 1.4 billion rupees year-over-year, showing significant growth. However, revenue decreased to 8 billion rupees from 10 billion rupees compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739449304000,
            "Source": "earnings"
        },
        {
            "Title": "KNR Constructions Limited Secures Two Orders Totaling 525 Crore Rupees",
            "Summary": "KNR Constructions Limited has won two significant orders. The first order is worth 327 crore rupees, while the second order amounts to 198 crore rupees. The combined value of these orders is 525 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1736122097000,
            "Source": "order&deals"
        },
        {
            "Title": "KNR Construction: Secures Rs 328-Crore Irrigation Project in Telangana",
            "Summary": "KNR Construction Ltd. has received a Letter of Acceptance for a Rs 327.89 crore irrigation project in Telangana. The project, part of the Sita Rama Lift Irrigation Project, involves earth work, embankment formation, and canal lining. The contract period is 24 months with a two-year defect liability period.",
            "Sentiment": "positive",
            "PublishDate": 1735993262000,
            "Source": "order&deals"
        },
        {
            "Title": "KNR Constructions: Q2 Results Review - Growth Sustainability Hinges on Order Inflow",
            "Summary": "Dolat Capital's review of KNR Constructions' Q2 results emphasizes the need for continued order inflow to maintain growth. The report suggests that future performance and sustainability of the company's growth trajectory are dependent on securing new orders.",
            "Sentiment": "neutral",
            "PublishDate": 1731578230000,
            "Source": "result"
        },
        {
            "Title": "KNR Constructions Reports Strong Q2 FY24 Financial Results",
            "Summary": "KNR Constructions has announced its Q2 FY24 consolidated financial results. The company's net profit increased significantly to 4.4 billion rupees, up from 1.47 billion rupees year-over-year and 1.7 billion rupees quarter-over-quarter. Revenue rose to 19.45 billion rupees from 10.38 billion rupees in the same quarter last year. EBITDA improved to 8.7 billion rupees from 2.3 billion rupees year-over-year, with the EBITDA margin expanding to 44.72% from 22.30% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1731455968000,
            "Source": "result"
        },
        {
            "Title": "KNR Constructions Receives 318 Crore Rupees Settlement from NHAI",
            "Summary": "<p><span class=\"positive\">KNR Constructions</span> has received <span class=\"positive\">318 crore rupees</span> through a <b>settlement agreement</b> between its unit and the <span class=\"neutral\">National Highways Authority of India (NHAI)</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727968955000,
            "Source": "corporate_action"
        },
        {
            "Title": "KNR Constructions: NHAI Pays Rs 317.69 Crore in Settlement",
            "Summary": "<p><span class='positive'>KNR Constructions</span> received <span class='positive'>Rs 317.69 crore</span> from <b>NHAI</b> as part of an agreement, including <span class='positive'>Rs 175.83 crore</span> owed and <span class='positive'>Rs 141.86 crore</span> in interest. The company's <b>SPV</b> <span class='positive'>paid off all outstanding debts</span>. <b>NHAI</b> will <span class='neutral'>take over toll collections</span> for the <b>Muzaffarpur Barauni</b> project from <span class='neutral'>Nov. 1, 2024</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727953535000,
            "Source": "normal_news"
        }
    ]
}