{
    "Symbol": "KODYTECH",
    "ISIN": "INE0Q7P01013",
    "News": [
        {
            "Title": "Kody Technolab Partners With Falcon Tech Robotics And Hypermedia For 360 Odigo Robot Launch",
            "Summary": "Kody Technolab has formed a partnership with Falcon Tech Robotics and Hypermedia to launch the 360 Odigo Robot. The collaboration aims to strengthen the company's position in Middle East robotics market.",
            "Sentiment": "positive",
            "PublishDate": 1764230864409,
            "Source": "stock"
        },
        {
            "Title": "KODY TECHNOLAB Exports 75 ODIGO Robots in Record Time",
            "Summary": "KODY TECHNOLAB has successfully manufactured and exported 75 ODIGO robots in a remarkably short period, demonstrating the company's manufacturing capabilities and efficiency. This achievement highlights the company's ability to meet production demands and compete in the robotics market.",
            "Sentiment": "positive",
            "PublishDate": 1742545315000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kody Technolab Secures Order for Two Autonomous Mobile Robots",
            "Summary": "Kody Technolab has received an order for two Autonomous Mobile Robots (AMRs). This development indicates the company's involvement in advanced robotics technology and suggests potential growth in their automation solutions business.",
            "Sentiment": "positive",
            "PublishDate": 1739233182000,
            "Source": "order&deals"
        },
        {
            "Title": "Kody Technolab Secures Order for Two Autonomous Mobile Robots",
            "Summary": "Kody Technolab has received an order for two Autonomous Mobile Robots (AMRs). This order signifies the company's involvement in advanced robotics technology and could potentially indicate growth in their automation solutions business.",
            "Sentiment": "positive",
            "PublishDate": 1739192129000,
            "Source": "order&deals"
        },
        {
            "Title": "KODY TECHNOLAB Enters Joint Venture for Robot Manufacturing in UAE",
            "Summary": "KODY TECHNOLAB has signed a Joint Venture Memorandum of Understanding (MOU) with Platinum Incorporated, a company registered under UAE laws. The partnership aims to collaborate in manufacturing and dealing with robots in the UAE, as well as exporting robots from the UAE.",
            "Sentiment": "positive",
            "PublishDate": 1735196508000,
            "Source": "corporate_action"
        }
    ]
}