{
    "Symbol": "KOHINOOR",
    "ISIN": "INE080B01012",
    "News": [
        {
            "Title": "Kohinoor Foods CFO Pradeep Goswami Resigns Due to Personal Reasons",
            "Summary": "Pradeep Goswami resigned from his position as Chief Financial Officer and Key Managerial Personnel of Kohinoor Foods Limited, effective from the close of business hours on November 17, 2025. The resignation was voluntary and attributed to personal reasons, with the management accepting his resignation and planning to address the matter in the upcoming Board Meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1763383865741,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kohinoor Foods Reports Quarterly Results Amid Financial Distress and Legal Challenges",
            "Summary": "Kohinoor Foods Limited announced its quarterly results for the period ended September 30, 2025, while facing significant financial difficulties including bank loan defaults and multiple legal proceedings. The company is operating under a one-time settlement arrangement with lenders, having paid Rs 205 crores against a revised settlement amount of Rs 227.45 crores, with ongoing insolvency petitions and asset attachment orders pending in various courts.",
            "Sentiment": "negative",
            "PublishDate": 1763046432095,
            "Source": "earnings"
        },
        {
            "Title": "Kohinoor Foods Receives DRT Order to Pay Banks INR 926.13 Crores Within 30 Days",
            "Summary": "Kohinoor Foods Limited received an order from the Debt Recovery Tribunal-III, Delhi directing the company to pay banks INR 926.13 crores within 30 days. The company entered into a one-time settlement with banks and deposited INR 205 crores against INR 227.45 crores plus future delayed period interest. However, two member banks among the consortium lenders have communicated their inability to proceed, citing non-compliance with settlement terms. The company is contesting the DRT order and has requested all member banks to extend the payment period for the balance amount. The company acknowledges material impact on its financial and operational activities regarding this order.",
            "Sentiment": "negative",
            "PublishDate": 1762176036832,
            "Source": "stock"
        },
        {
            "Title": "Kohinoor Foods Board Approves Q1 Results, Capital Increase, and AGM Schedule",
            "Summary": "Kohinoor Foods Limited's Board of Directors held a meeting on August 13, 2025, approving quarterly financial results for the period ended June 30, 2025. The Board approved an increase in authorized capital from Rs. 75 crores to Rs. 375 crores, subject to shareholder approval. The 36th Annual General Meeting has been scheduled for September 30, 2025, at 11:30 A.M. The company has also set book closure dates from September 20-30, 2025. The company operates in food manufacturing, trading, and marketing as a single business segment. The financial results show the company has entered into a One Time Settlement (OTS) with consortium banks for Rs. 227.45 crores, having paid Rs. 200 crores with a balance of Rs. 27.45 crores due by September 27, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755091736748,
            "Source": "corporate_action"
        },
        {
            "Title": "Kohinoor Foods Issues Duplicate Share Certificates to Shareholders",
            "Summary": "Kohinoor Foods Limited has issued duplicate share certificates and dematerialized securities to several shareholders following the loss or misplacement of original share certificates. The company processed requests for shareholder Manoj Jindel involving multiple certificate numbers with distinctive numbers ranging from 186880 to 4788500. The issuance was handled through the company's Registrar and Transfer Agent, Skyline Financial Services Private Limited, and the company has informed BSE and NSE about these transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1754653368369,
            "Source": "corporate_action"
        },
        {
            "Title": "Kohinoor Foods Limited Receives Enforcement Directorate Summon Under FEMA",
            "Summary": "Kohinoor Foods Limited has received a summon from the Directorate of Enforcement, Ministry of Finance, Government of India, under sections 37(1) and (3) of FEMA. The summon requires the company to produce various documents either in person or through a representative. The summon was issued to the Director of Kohinoor Foods Limited for an address in Manesar, Gurgaon, though the company states it does not operate from that mentioned address. The company's Director or representative is preparing to appear before the authorities and submit the required documents.",
            "Sentiment": "negative",
            "PublishDate": 1753787468350,
            "Source": "stock"
        },
        {
            "Title": "Kohinoor Foods Approves Sale of Factory Unit for 1.90 Billion Rupees",
            "Summary": "Kohinoor Foods has approved the sale of one of its factory units for 1.90 billion rupees (approximately $23 million USD). This decision represents a significant corporate action that could impact the company's operations and financial position.",
            "Sentiment": "positive",
            "PublishDate": 1745453451000,
            "Source": "default"
        },
        {
            "Title": "Kohinoor Foods Approves Sale of Factory Unit for 1.90 Billion Rupees",
            "Summary": "Kohinoor Foods has approved the sale of one of its factory units for 1.90 billion rupees (approximately $23 million USD). This decision represents a significant corporate action that could impact the company's operations and financial position.",
            "Sentiment": "positive",
            "PublishDate": 1745410459000,
            "Source": "default"
        },
        {
            "Title": "Kohinoor Foods Receives Rs 200 Crore Payment and NOC for Plant Sale",
            "Summary": "Kohinoor Foods has received Rs 200 crore from a buyer as part of a one-time settlement (OTS) and tripartite agreement (TPA). The lead bank has issued a No Objection Certificate (NOC) for the sale of the company's Haryana plant and machinery. The company's current market capitalization is Rs 140 crore.",
            "Sentiment": "positive",
            "PublishDate": 1745314808000,
            "Source": "default"
        },
        {
            "Title": "Kohinoor Foods: Share Price Surges on One-Time Settlement Approval",
            "Summary": "Kohinoor Foods Ltd.'s share price hit a 20% upper circuit after its one-time settlement proposal was approved by the lead consortium lender. The settlement involves repayment of Rs 227.45 crores plus delayed interest, with an upfront payment of Rs 25 crore and the majority to be paid by December 31, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1735035321000,
            "Source": "corporate_action"
        }
    ]
}