{
    "Symbol": "KOKUYOCMLN",
    "ISIN": "INE760A01029",
    "News": [
        {
            "Title": "Kokuyo Camlin Board Approves Remuneration Changes",
            "Summary": "Kokuyo Camlin's board approved remuneration for Chairman and Vice Chairman for FY27, revised Managing Director's pay from January 2026, and noted withdrawal of promoter reclassification request.",
            "Sentiment": "neutral",
            "PublishDate": 1769796966632,
            "Source": "stocks"
        },
        {
            "Title": "Kokuyo Camlin Reports Strong Q3 Turnaround",
            "Summary": "Kokuyo Camlin achieved net profit of 40 million rupees in Q3, reversing previous year's loss of 42 million rupees. Revenue grew to 1.8 billion rupees from 1.6 billion rupees year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1769780578573,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kokuyo Camlin Share Transfer via Transmission",
            "Summary": "Ms. Anagha S. Dandekar acquires 100,000 equity shares of Kokuyo Camlin Limited through transmission from late promoter Mr. Subhash D. Dandekar under SEBI SAST exemption regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1767697838935,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kokuyo Camlin Faces ₹95.42L GST Demand from Bihar",
            "Summary": "Kokuyo Camlin receives GST assessment order from Bihar authorities for FY2021-22, demanding ₹95.42 lakh including tax, interest, and penalty. Company plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1766475699587,
            "Source": "stocks"
        },
        {
            "Title": "Kokuyo Camlin Receives GST Audit Order with Tax Demand of Rs. 66,862 Plus Interest and Penalties",
            "Summary": "Kokuyo Camlin Limited received an audit report order from the Commissioner of Central GST, Delhi, demanding additional tax of Rs. 66,862 along with interest of Rs. 57,548 and penalties of Rs. 9,829 across seven violations including non-payment of late fees, non-reversal of input tax credit, and short payment of taxes. The company stated there is no material impact on its financials, operations, or other activities due to this tax order.",
            "Sentiment": "negative",
            "PublishDate": 1764076534124,
            "Source": "stock"
        },
        {
            "Title": "Kokuyo Camlin Reports Quarterly Loss of Rs 70.85 Lakh with Modified Auditor Conclusion",
            "Summary": "Kokuyo Camlin Limited reported a net loss of Rs 70.85 lakh for the quarter ended September 30, 2025, compared to a profit of Rs 179 lakh in the corresponding quarter of the previous year. Revenue from operations declined to Rs 7,597.60 lakh from Rs 8,237 lakh year-on-year. For the half-year period, the company posted a net loss of Rs 100.55 lakh versus a profit of Rs 216 lakh in the previous year. The company's auditors expressed a modified conclusion in their limited review report, citing previous year inventory discrepancies of Rs 2,356.81 lakh that were identified between physical quantity recorded in books and actual physical inventory. The auditors noted that management has not identified the possible impact of these discrepancies on prior periods, which constituted a departure from Indian Accounting Standards requiring retrospective correction of material prior period errors.",
            "Sentiment": "negative",
            "PublishDate": 1762303522762,
            "Source": "earnings"
        },
        {
            "Title": "KOKUYO CAMLIN Reports Q2 Net Profit of 78.6M Rupees After Previous Year Loss",
            "Summary": "KOKUYO CAMLIN posted a net profit of 78.6 million rupees in Q2, compared to a loss of 106 million rupees in the same period last year. The company's quarterly revenue reached 1.74 billion rupees versus 1.7 billion rupees in the prior year period, showing modest growth.",
            "Sentiment": "positive",
            "PublishDate": 1762258627288,
            "Source": "earnings"
        },
        {
            "Title": "Kokuyo Camlin Seeks Shareholder Approval for Executive Director Appointment via Postal Ballot",
            "Summary": "Kokuyo Camlin Limited has issued a postal ballot notice seeking shareholder approval for appointing Mr. Takashi Itoguchi as Executive Director for three years from August 8, 2025 to August 7, 2028. The e-voting period runs from September 17 to October 16, 2025, with results announced by October 18, 2025. Itoguchi, 50, is a law graduate from Doshisha University who joined Kokuyo in 1998 and has over 27 years of experience in business analysis and budgeting. He played a key role in Kokuyo's entry into the Indian market through the acquisition of Camlin Ltd. His proposed monthly salary is ₹2,26,000 plus house rent allowance of ₹92,217 and other benefits including rent-free furnished accommodation up to ₹2,00,000 monthly. The company reported revenue of ₹76,252.88 lakhs and profit after tax of ₹583.30 lakhs for 2024-25. Kokuyo Co. Ltd., Japan holds 74.44% stake in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1758010863622,
            "Source": "corporate_action"
        },
        {
            "Title": "KOKUYO CAMLIN Reports Decline in Q1 Profitability and Margins",
            "Summary": "KOKUYO CAMLIN reported quarterly results showing a decline across key financial metrics. EBITDA fell to 196 million rupees from 278 million rupees in the same period last year, while EBITDA margin contracted to 8.67% from 12.15%. Net profit decreased to 101 million rupees compared to 162 million rupees year-over-year. Revenue also declined slightly to 2.26 billion rupees from 2.28 billion rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754660615703,
            "Source": "earnings"
        },
        {
            "Title": "KOKUYO CAMLIN Reports Q4 Financial Results",
            "Summary": "KOKUYO CAMLIN has released its Q4 financial results. The company reported an EBITDA of 132 million rupees, down from 225.5 million rupees year-over-year. The EBITDA margin decreased to 6.60% from 10.38% in the same period last year. Net profit for Q4 was 44 million rupees, a decrease from 104.2 million rupees year-over-year, and a loss of 42 million rupees quarter-over-quarter. Revenue for Q4 stood at 2 billion rupees, down from 2.17 billion rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748447446000,
            "Source": "result"
        },
        {
            "Title": "Kokuyo Camlin Reports Q3 Financial Results and Reveals Financial Impact of Misstated Entries",
            "Summary": "Kokuyo Camlin reported a net loss of 42 million rupees in Q3, an improvement from the 56 million rupee loss in the same quarter last year. However, the loss widened from 106 million rupees in the previous quarter. Q3 revenue decreased to 1.6 billion rupees from 1.67 billion rupees year-over-year. The company also disclosed a financial impact of 214.4 million rupees due to misstated entries and records manipulation.",
            "Sentiment": "negative",
            "PublishDate": 1739405770000,
            "Source": "earnings"
        },
        {
            "Title": "KOKUYO CAMLIN Reports Financial Misstatement Impact",
            "Summary": "KOKUYO CAMLIN has disclosed that the financial impact resulting from misstated entries and manipulation of records amounts to 214.4 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1739373047000,
            "Source": "corporate_governance"
        },
        {
            "Title": "KOKUYO CAMLIN Reports Significant Drop in Q3 EBITDA",
            "Summary": "KOKUYO CAMLIN has reported a substantial decrease in its Q3 EBITDA, which fell to 4.4 million rupees from 125 million rupees year-over-year. The company's EBITDA margin also declined sharply, dropping to 0.27% from 7.45% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739368079000,
            "Source": "earnings"
        },
        {
            "Title": "KOKUYO CAMLIN Reports Q3 Financial Results",
            "Summary": "KOKUYO CAMLIN has reported its Q3 financial results. The company recorded a net loss of 42 million rupees, which is an improvement from the 56 million rupees loss in the same quarter last year. However, the loss has increased from 106 million rupees in the previous quarter. Revenue for Q3 stood at 1.6 billion rupees, slightly down from 1.67 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739368023000,
            "Source": "earnings"
        },
        {
            "Title": "KOKUYO CAMLIN Reports Q2 Financial Results",
            "Summary": "KOKUYO CAMLIN has reported its Q2 financial results. The company posted a net loss of 106 million rupees, compared to a loss of 95 million rupees in the same quarter last year. However, this represents a significant improvement from the previous quarter, where the company reported a profit of 162 million rupees. Revenue for Q2 stood at 1.7 billion rupees, down from 1.9 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731588655000,
            "Source": "result"
        },
        {
            "Title": "Kokuyo Camlin Initiates Forensic Audit for Inventory Irregularities",
            "Summary": "Kokuyo Camlin has launched a forensic audit, effective immediately, to investigate irregularities in inventory management procedures at one of its factories. The company has engaged PricewaterhouseCoopers Pvt. Ltd. as the investigation agency to conduct the audit.",
            "Sentiment": "negative",
            "PublishDate": 1730982331000,
            "Source": "corporate_action"
        }
    ]
}