{
    "Symbol": "KOLTEPATIL",
    "ISIN": "INE094I01018",
    "News": [
        {
            "Title": "Kolte-Patil Q3 Net Profit Drops 82% to ₹45M",
            "Summary": "Kolte-Patil Developers reports significant decline in Q3 performance with net profit falling to ₹45 million from ₹253 million year-on-year, while revenue decreased to ₹2.65 billion.",
            "Sentiment": "negative",
            "PublishDate": 1770295972909,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kolte-Patil Board Meet Set for Feb 5 to Review Q3FY26",
            "Summary": "Kolte-Patil Developers has scheduled its board meeting for February 5, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769613197771,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kolte-Patil Q3 FY26: Sales ₹605 cr, Record Collections",
            "Summary": "Kolte-Patil Developers reports Q3 FY26 sales of ₹605 crore with highest ever quarterly collections of ₹709 crore, up 25% YoY. Stock gains 1.58% on BSE.",
            "Sentiment": "positive",
            "PublishDate": 1768399091715,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kolte-Patil signs ₹850 cr Pune residential project",
            "Summary": "Kolte-Patil Developers signs joint development deal for 1.1 million sq ft residential project in Pune's Bhugaon area with estimated GDV of ₹850 crores, strengthening presence in high-potential micro-markets.",
            "Sentiment": "positive",
            "PublishDate": 1768377997987,
            "Source": "stocks"
        },
        {
            "Title": "Kolte-Patil Announces Trading Window Closure for Q3 Results",
            "Summary": "Kolte-Patil Developers announces trading window closure from January 1, 2026, ahead of Q3 FY26 financial results declaration for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766491460690,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kolte-Patil Developers Raises Rs. 109.94 Crore Through Non-Convertible Debentures from Marubeni Corporation",
            "Summary": "Kolte-Patil Developers Limited allotted 10,994 Series 4 fully secured, listed, rated, redeemable non-convertible debentures of Rs. 1,00,000 each to Marubeni Corporation, Japan, raising Rs. 109.94 crore on private placement basis. The funds will be utilized for general corporate purposes including construction and development projects, with debentures having a tenure of 9 years 11 months and 1 day from December 5, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1764917564147,
            "Source": "corporate_action"
        },
        {
            "Title": "Kolte-Patil Developers Seeks Shareholder Approval for Director Appointments and Commission Structure",
            "Summary": "Kolte-Patil Developers has issued a postal ballot notice seeking shareholder approval for appointing Ms. Avani Vishal Davda as Independent Director and Mr. Dalip Charanjit Sehgal as Non-Executive Director. The company also seeks approval for paying commission up to 1% of net profits to Non-Executive Independent Directors from FY2025-26 onwards, with remote e-voting scheduled from November 29, 2025 to December 28, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764329126498,
            "Source": "corporate_action"
        },
        {
            "Title": "Kolte-Patil Developers Appoints New Director as Board Member Resigns",
            "Summary": "Kolte-Patil Developers Limited appointed Mr. Dalip Charanjit Sehgal as Additional Non-Executive Director while accepting the resignation of Mr. Tuhin Parikh from the same position, both effective November 25, 2025. The board changes involve experienced professionals, with Sehgal bringing over four decades of retail and mall management experience, subject to shareholder approval for his appointment.",
            "Sentiment": "neutral",
            "PublishDate": 1764073204437,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kolte-Patil Developers: Promoter Family Executes Inter-se Share Transfer of 990,522 Shares",
            "Summary": "Mrs. Vandana Naresh Patil transferred 990,522 shares (1.12% of diluted share capital) to Mr. Harshavardhan Naresh Patil through an inter-se gift transaction on November 14, 2025. The transfer was executed under SEBI takeover regulation exemptions, with Mr. Harshavardhan's shareholding increasing to 2.15% while Mrs. Vandana's holding decreased to 5% post-transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1763363868261,
            "Source": "corporate_action"
        },
        {
            "Title": "Kolte-Patil Developers Reports Zero Utilization of Rs. 417.03 Crore Preferential Issue Proceeds",
            "Summary": "Kolte-Patil Developers Limited reported nil utilization of proceeds from its Rs. 417.03 crore preferential equity issue during the quarter ended September 30, 2025, with funds temporarily deployed in mutual funds and bank accounts. The monitoring agency CARE Ratings found no deviation from stated objects, while all proceeds remain unutilized and earmarked for general corporate purposes, real estate project development, and government premium payments with completion targeted by December 23, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1763109851470,
            "Source": "corporate_action"
        },
        {
            "Title": "Kolte-Patil Developers Reports Q2FY26 Results; Blackstone Completes 40% Stake Acquisition",
            "Summary": "Kolte-Patil Developers Limited announced quarterly results with pre-sales value of Rs. 670 crore, up 9% quarter-on-quarter, and collections of Rs. 596 crore, up 8% quarter-on-quarter. Average price realization increased 7% to Rs. 7,823 per sq. ft. Total income stood at Rs. 162 crore. Blackstone-affiliated funds completed their stake acquisition and currently hold 40% in the company. The company acquired 7.5 acres of land in Bhugaon, Pune in October 2025, with an estimated saleable area of 1.9 million sq. ft. and gross development value of Rs. 1,400 crore. For H1FY26, pre-sales reached Rs. 1,286 crore with volume of 1.70 million sq. ft., while collections totaled Rs. 1,146 crore. The company has a total portfolio of 37 million sq. ft. including unsold inventory, development pipeline and land bank. Life Republic township contributed 0.51 million sq. ft. of sales during the quarter. The company launched Serenova project in Versova market within Mumbai Metropolitan Region.",
            "Sentiment": "positive",
            "PublishDate": 1762914415388,
            "Source": "earnings"
        },
        {
            "Title": "Kolte-Patil Developers Appoints New Independent Director, Accepts Two Key Resignations",
            "Summary": "Kolte-Patil Developers Limited's Board made several leadership changes on November 11, 2025. The company appointed Ms. Avani Vishal Davda as Additional Director (Non-Executive and Independent) for a five-year term, subject to shareholder approval. Simultaneously, the Board accepted the resignation of Mrs. Sudha Pravin Navandar as Independent Director, citing other commitments. The company also accepted the resignation of Mr. Atul Bohra as Group Chief Executive Officer to pursue professional opportunities outside the organization. Ms. Davda brings over two decades of experience across real estate, consumer, retail and hospitality sectors, having held leadership positions at companies including Tata Starbucks, Tata Consumer Products, and Godrej Natures Basket. She was featured in Fortune US's global list of 40 Under 40 Leaders in 2013. The Board reconstituted various committees, with Ms. Davda becoming Chairperson of the Audit Committee and Nomination and Remuneration Committee, replacing Mrs. Navandar.",
            "Sentiment": "neutral",
            "PublishDate": 1762909305200,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kolte-Patil Developers Cancels Post-Results Conference Call Amid Leadership Transition",
            "Summary": "Kolte-Patil Developers announced it will not host a conference call following its Q2 H1 FY26 results announcement. The company cited ongoing integration and leadership transition as reasons, stating it is undertaking internal restructuring measures and Board-level realignments to strengthen governance, enhance operational efficiency, and align with long-term strategic priorities. Stakeholders and investors can access the quarterly results release, investor presentation, and press release discussing board and leadership changes through provided links on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1762877936384,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kolte Patil Developers Reports Record Q2FY26 Pre-Sales of ₹1,003 Crore, Plans Aggressive Expansion",
            "Summary": "Kolte Patil Developers achieved record pre-sales of ₹1,003 crore in Q2FY26, marking a 33% year-on-year growth. The company is targeting aggressive expansion across Pune, Mumbai, and Bengaluru markets with a launch pipeline of 12 million square feet planned over FY26-FY27. The developer is strategically focusing on mid-income and redevelopment projects while aiming to double annual sales to ₹5,000 crore by FY28. The company plans to strengthen its balance sheet through ₹200 crore debt reduction and targets achieving a 20% return on equity.",
            "Sentiment": "positive",
            "PublishDate": 1762876635653,
            "Source": "stock"
        },
        {
            "Title": "Kolte-Patil Developers Reports Q2 Loss of 104.3M Rupees, Revenue Drops to 1.39B Rupees",
            "Summary": "Kolte-Patil Developers reported a consolidated net loss of 104.3 million rupees in Q2, compared to a profit of 97.4 million rupees in the same period last year. The company's revenue declined to 1.39 billion rupees from 3.08 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762862771125,
            "Source": "earnings"
        },
        {
            "Title": "Kolte-Patil Developers: Promoter Group Members Acquire Shares Through Inter-Family Gift Transfers",
            "Summary": "Two promoter group members of Kolte-Patil Developers Limited have submitted revised disclosures for share acquisitions through gift transfers. Harshavardhan Naresh Patil acquired 990,522 equity shares (1.11% stake) from Vandana Naresh Patil, while Priyanjali Naresh Patil acquired 1,902,645 equity shares (2.15% stake) from the same transferor. Both transactions were scheduled for November 14, 2025, and represent inter-family transfers by way of gift between immediate relatives. The original disclosures were submitted on October 28, 2025, but the acquisitions were not completed on November 4, 2025 due to technical reasons, prompting the revised filings dated November 6, 2025. The transfers are exempt from open offer requirements under SEBI regulations as they involve immediate relatives within the promoter group.",
            "Sentiment": "neutral",
            "PublishDate": 1762492167451,
            "Source": "corporate_action"
        },
        {
            "Title": "Kolte-Patil Developers Increases Authorized Capital Following Subsidiary Amalgamation",
            "Summary": "Kolte-Patil Developers Limited has increased its authorized share capital following the amalgamation of its wholly owned subsidiary, Kolte-Patil Integrated Townships Limited. The National Company Law Tribunal, Mumbai approved the scheme of amalgamation, with the order effective from October 31, 2025. The company's authorized capital has been increased to Rs. 2,24,00,01,000, comprising Rs. 1,24,00,01,000 in equity shares (12,40,00,100 shares of Rs. 10 each) and Rs. 1,00,00,00,000 in preference shares (10,00,00,000 shares of Rs. 10 each). The company has submitted an updated Memorandum of Association to stock exchanges NSE and BSE, with no changes made to the Articles of Association.",
            "Sentiment": "neutral",
            "PublishDate": 1761894470918,
            "Source": "corporate_action"
        },
        {
            "Title": "Kolte-Patil Developers Raises Rs 139.96 Crore Through Debenture Allotment to Marubeni Corporation",
            "Summary": "Kolte-Patil Developers Limited allotted 13,996 Series 4 secured, listed, rated, redeemable, non-convertible debentures worth Rs 139.96 crore to Marubeni Corporation, Japan on a private placement basis. Each debenture has a par value of Rs 1 lakh. The debentures are zero coupon instruments with a 10-year tenure and will be listed on BSE Limited. The debentures are secured by properties including unsold earmarked units, development rights, and cash flows from a project managed by subsidiary Kolte-Patil Integrated Townships Limited. The funds will be utilized for general corporate purposes including construction and development projects. The debentures will be redeemed at par after 10 years, with fortnightly redemption payments of principal amounts and redemption premium tied to the sale of earmarked units.",
            "Sentiment": "positive",
            "PublishDate": 1760595512538,
            "Source": "corporate_action"
        },
        {
            "Title": "Kolte-Patil Developers Reports 9% QoQ Growth in Q2 FY26 Sales at Rs. 670 Crore",
            "Summary": "Kolte-Patil Developers Limited reported quarterly sales value of Rs. 670 crore, marking a 9% quarter-on-quarter increase. Collections reached Rs. 596 crore, up 8% QoQ, while realization improved 7% QoQ to Rs. 7,823 per sq. ft. Sales volume was 0.86 million sq. ft., reflecting 2% QoQ growth. The company's flagship Life Republic project contributed 0.51 million sq. ft. in sales volume. In October 2025, the company acquired a 7.5-acre land parcel in Bhugaon, Pune, with estimated saleable area of 1.9 million square feet and Gross Development Value of Rs. 1,400 crore. Funds affiliated with Blackstone increased their holding to 40% in the company during the quarter. Managing Director Rajesh Patil highlighted the healthy sequential growth and expressed optimism about demand driven by economic growth and benign interest rates.",
            "Sentiment": "positive",
            "PublishDate": 1760445432244,
            "Source": "stock"
        },
        {
            "Title": "Kolte-Patil Developers Acquires 7.5 Acres in Pune for ₹1,400 Crore Project",
            "Summary": "Kolte-Patil Developers has acquired approximately 7.5 acres of land in Bhugaon, Pune. The project has an estimated value of ₹1,400 crore and will feature about 1.9 million square feet of saleable space. The company has a market capitalization of ₹3,800 crore.",
            "Sentiment": "positive",
            "PublishDate": 1760069568635,
            "Source": "stock"
        },
        {
            "Title": "BREP Asia III Extends Kolte-Patil Developers Open Offer Deadline to September 9, 2025",
            "Summary": "BREP Asia III India Holding Co VII Pte. Ltd., along with partners Blackstone Real Estate Partners Asia III L.P. and Blackstone Real Estate Partners (Offshore) X.TE-F (AIV) L.P., has announced an open offer to acquire up to 2,30,56,825 equity shares of Kolte-Patil Developers Limited, representing 26% of the Emerging Voting Capital. The offer price is set at INR 329 per share, with a total consideration of up to INR 758,56,95,425 assuming full acceptance. The tendering period, originally scheduled to close on September 8, 2025, has been extended by one day to September 9, 2025, due to the Maharashtra government declaring September 8 as a public holiday for Eid-e-Milad festival. The Securities and Exchange Board of India permitted this extension through an email dated September 5, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757148006154,
            "Source": "order&deals"
        },
        {
            "Title": "Kolte-Patil Developers Reports No Deviations in Rs 417 Crore Preferential Issue Fund Utilization",
            "Summary": "Kolte-Patil Developers Limited submitted a monitoring agency report for the quarter ended June 30, 2025, regarding the utilization of proceeds from their preferential issue worth Rs 417.03 crore. CARE Ratings Limited, serving as the monitoring agency, reported no deviations from the stated objects of the issue. The funds were allocated for three purposes: Rs 104 crore for general corporate purposes, Rs 265 crore for development of new real estate projects including land acquisition, and Rs 48.03 crore for payment of government premiums and purchase of floor space index. During the quarter, no funds were utilized, and the entire amount remains invested in liquid mutual funds and money market funds with banks including Axis, ICICI Prudential, and Tata. The company has until December 23, 2026, to complete the utilization of these proceeds. All statutory approvals are pending and will be obtained in due course.",
            "Sentiment": "neutral",
            "PublishDate": 1755189282278,
            "Source": "corporate_action"
        },
        {
            "Title": "Blackstone-Linked Entity Acquires 25.71% Stake in Kolte-Patil Developers, Becomes Promoter",
            "Summary": "BREP Asia III India Holding Co VII Pte. Ltd., a Blackstone-affiliated entity, acquired 2,27,96,353 equity shares (25.71% stake) in Kolte-Patil Developers Limited from the promoter group on August 11, 2025. The acquisition was executed under a share purchase agreement dated March 13, 2025. Following this transaction, the acquirer's total holding increased to 3,54,72,038 shares, representing 40% of the company. The acquirer previously held 1,26,75,685 shares (14.29%) and has gained joint control alongside existing promoters, classifying it as a promoter of the real estate developer. The transaction was conducted off-market as part of a public announcement for an open offer made on March 13, 2025. Kolte-Patil Developers' total equity share capital remains at INR 88,68,00,940 divided into 8,86,80,094 equity shares with a face value of INR 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1755150758898,
            "Source": "corporate_action"
        },
        {
            "Title": "BREP Asia III India Holding Acquires 40% Stake in Kolte-Patil Developers for ₹751 Crores",
            "Summary": "BREP Asia III India Holding Co VII Pte. Ltd. acquired 2,27,96,353 equity shares of Kolte-Patil Developers Limited from the promoter group on August 11, 2025. The acquisition was executed at ₹329 per share through an off-market transaction, increasing BREP's shareholding from 14.29% to 40% of the company's equity share capital. The shares were purchased from promoters including Rajesh Anirudha Patil, Naresh Anirudha Patil, Milind Digambar Kolte, and their family members under a share purchase agreement dated March 13, 2025. The acquired shares have been placed in a share escrow account as per SEBI regulations and will be released to the acquirer's demat account in due course. BREP Asia III India Holding is associated with Blackstone Real Estate Partners Asia III L.P. and Blackstone Real Estate Partners (Offshore) X.TE-F (AIV) L.P. as persons acting in concert.",
            "Sentiment": "neutral",
            "PublishDate": 1754973492843,
            "Source": "order&deals"
        },
        {
            "Title": "Kolte-Patil Developers Undergoes Major Board Restructuring with 6 Resignations and 3 New Appointments",
            "Summary": "Kolte-Patil Developers Limited announced significant changes to its Board of Directors effective August 11, 2025. The company appointed three new Additional Directors: Tuhin Parikh (Head of Real Estate India at Blackstone), Asheesh Mohta (Head of Real Estate Acquisitions India at Blackstone), and Mohit Arora (Managing Director in Real Estate Group at Blackstone), all as Non-Executive and Non-Independent Directors. Simultaneously, six directors resigned: Milind Kolte (Executive Director), Yashvardhan Patil (Joint Managing Director), Nirmal Kolte (Executive Director), and three Independent Directors - Achyut Watwe, Umesh Joshi, and Dhananjay Barve. These changes stem from a Share Purchase Agreement and Shareholders Agreement dated March 13, 2025, executed between the company and BREP Asia III India Holding Co VII Pte. Ltd. The board also appointed Girish Vanvari as Chairman and reconstituted various committees including Audit, Nomination and Remuneration, Stakeholders Relationship, and Risk Management Committees. All resigning directors confirmed no material reasons for resignation beyond the agreement terms.",
            "Sentiment": "neutral",
            "PublishDate": 1754914753632,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kolte-Patil Developers Terminates Partnership with Amco Landmarks Realty",
            "Summary": "Kolte-Patil Developers has ended its partnership with Amco Landmarks Realty. The real estate developer has concluded its business relationship with the partner company.",
            "Sentiment": "neutral",
            "PublishDate": 1754571551289,
            "Source": "stock"
        },
        {
            "Title": "Kolte-Patil Developers Divests Stakes in Multiple Subsidiaries and Partnership",
            "Summary": "Kolte-Patil Developers has completed three divestment transactions. The company sold its entire stake in Kolte-Patil Realtors Estate to Anisha Family Ventures. Additionally, a company unit sold a 42.5% stake in Ayaan Vihan Land Development. The company also exited as a 35% partner from Regenesis Project Management LLP.",
            "Sentiment": "neutral",
            "PublishDate": 1754531906077,
            "Source": "stock"
        },
        {
            "Title": "Kolte-Patil Developers Exits Three Business Entities, Receives Rs 311.25 Lakhs",
            "Summary": "Kolte-Patil Developers has completed the sale of its entire stake in wholly owned subsidiary Kolte-Patil Realtors Estate Private Limited to Anisha Family Ventures LLP for Rs 1 lakh. The company also retired as a partner from Regenesis Project Management LLP, where it held a 35% stake, receiving Rs 310 lakhs as consideration. Additionally, its wholly owned subsidiary Kolte-Patil Properties Private Limited exited from Ayaan Vihan Land Development, where it held a 42.5% stake, for Rs 0.25 lakhs. All three transactions were completed on August 6, 2025. The sale to Anisha Family Ventures LLP constitutes a related party transaction as the buyer is part of the promoter group, though the company states it was conducted at arm's length based on an independent valuation. The company noted these transactions are not material to its operations.",
            "Sentiment": "neutral",
            "PublishDate": 1754507878574,
            "Source": "order&deals"
        },
        {
            "Title": "Kolte-Patil Developers Reports Q1 FY26 Results with Blackstone Investment of Rs 417 Crore",
            "Summary": "Kolte-Patil Developers reported Q1 FY26 financial results with total income of Rs 96.8 crore compared to Rs 350.3 crore in Q1 FY25. The company posted negative EBITDA of Rs 11.2 crore versus positive Rs 39.7 crore in the previous year, and negative PAT of Rs 17 crore against Rs 6.2 crore profit in Q1 FY25. Sales volume reached 0.84 million square feet with 5% quarter-on-quarter growth, generating sales value of Rs 616 crore. Collections stood at Rs 550 crore with operating cash flow of Rs 164 crore. Average realization was Rs 7,337 per square foot. Blackstone Funds acquired 14.3% equity stake through preferential allotment, infusing Rs 417 crore as growth capital. The company plans to launch 6-7 million square feet worth over Rs 5,000 crore across Pune and Mumbai regions during the financial year. Management expects 30% year-on-year presales growth and projects EBITDA margins in mid-teens range with gross margins of 25-30%.",
            "Sentiment": "neutral",
            "PublishDate": 1754501954776,
            "Source": "earnings"
        },
        {
            "Title": "Kolte-Patil Developers Projects Over 30% Presales Growth for FY26",
            "Summary": "Kolte-Patil Developers anticipates over 30% yearly growth in presales for FY26. The company expects gross margins of 25-30% and EBITDA margins in the mid-teens. The developer projects steady revenue growth in FY26, expecting better performance than FY25. Detailed profit and loss guidance will be provided next quarter. The company plans to launch 6-7 million square feet of projects in Pune and Mumbai for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1753932020315,
            "Source": "stock"
        },
        {
            "Title": "Kolte-Patil Developers Reports Loss in Q1 FY2026, Approves Rs 250 Crore Debenture Issue",
            "Summary": "Kolte-Patil Developers Limited reported a consolidated net loss of Rs 1,688 lakhs for the quarter ended June 30, 2025, compared to a profit of Rs 637 lakhs in the same quarter last year. Revenue from operations declined to Rs 8,236 lakhs from Rs 34,075 lakhs year-over-year. The company's Board approved the issuance of secured, rated, listed, redeemable Non-Convertible Debentures worth up to Rs 250 crores on a private placement basis. During the quarter, the company completed a preferential allotment of 1,26,75,685 equity shares to BREP Asia III India Holding Co VII Pte. Ltd. at Rs 329 per share, raising Rs 41,703 lakhs. The company's debt-equity ratio improved to 0.89 from 1.36 in the previous year. Basic earnings per share stood at negative Rs 2.21 compared to positive Rs 0.82 in the corresponding quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1753774510496,
            "Source": "corporate_action"
        },
        {
            "Title": "Kolte-Patil Developers Reports Sharp Revenue Decline and Swings to Loss in Q1",
            "Summary": "Kolte-Patil Developers reported Q1 revenue of 824 million rupees, a significant decrease from 3.41 billion rupees in the same quarter last year. The company posted a consolidated net loss of 170 million rupees compared to a profit of 62 million rupees in the prior year quarter.",
            "Sentiment": "negative",
            "PublishDate": 1753774053620,
            "Source": "earnings"
        },
        {
            "Title": "Kolte-Patil Developers to Review Debt Securities Fundraising Plan",
            "Summary": "Kolte-Patil Developers announced plans to review its strategy for raising funds through debt securities. The real estate developer is evaluating its approach to debt-based fundraising as part of its capital structure planning.",
            "Sentiment": "neutral",
            "PublishDate": 1753275716859,
            "Source": "corporate_action"
        },
        {
            "Title": "Kolte-Patil Reports Mixed Q1 FY26 Performance",
            "Summary": "Kolte-Patil sold 0.84 million sq. ft. in Q1 FY26, a 5% increase quarter-over-quarter. Sales value reached Rs 616 crore, down 13% year-over-year. Collections for Q1 FY26 were Rs 550 crore, a 22% decrease quarter-over-quarter. The company's realizations decreased to Rs 7,337 per sq. ft.",
            "Sentiment": "neutral",
            "PublishDate": 1752451639000,
            "Source": "default"
        },
        {
            "Title": "Kolte-Patil Developers: Q1 FY26 Sales Volume Up 5.2% QoQ, Collections at ₹550 Crore",
            "Summary": "Kolte-Patil Developers reported Q1 FY26 sales volume of 0.84 million sq ft, up 5.2% QoQ. Sales value reached ₹616 crore with collections at ₹550 crore. Average realization was ₹7,337 per sq ft. Life Republic Township contributed 0.53 million sq ft to sales. Blackstone fund acquired a 14.3% stake in the company on June 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1752308619000,
            "Source": "result"
        },
        {
            "Title": "Kolte-Patil Reports Mixed Q1 FY26 Results with Strong Launch Plans",
            "Summary": "Kolte-Patil's Q1 FY26 results show mixed performance. Collections reached ₹550 crores, a 22% decrease from the previous quarter. Realizations dropped to ₹7,337 per square foot. The company sold 0.84 million square feet, up 5% from the previous quarter, but sales value declined to ₹616 crore, down 13% year over year. Despite this, the company's MD announced strong launch plans in Pune and Mumbai to boost growth in FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1752306750000,
            "Source": "default"
        },
        {
            "Title": "Kolte-Patil Developers: Blackstone Acquires 14.3% Stake Through Preferential Allotment",
            "Summary": "Kolte-Patil Developers allotted 1.26 crore shares (14.3% equity) to Blackstone affiliate BREP Asia III India Holding Co VII Pte. at Rs 329 per share, totaling Rs 417 crore. This is part of Blackstone's plan to acquire a 26% stake for Rs 759 crore, with potential to increase to 40% through an open offer.",
            "Sentiment": "positive",
            "PublishDate": 1750690777000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kolte-Patil Developers Approves Equity Share Issuance to BREP Asia III",
            "Summary": "Kolte-Patil Developers has approved the issuance of 1.27 crore equity shares to BREP Asia III India Holding Co VII Pte. Ltd. The shares will be issued at a price of 329 rupees per share, with the total value of the issuance reaching up to 4.17 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1750685148000,
            "Source": "default"
        },
        {
            "Title": "CCI Approves BREP Asia III India Holding's Stake Acquisition in Kolte-Patil Developers",
            "Summary": "The Competition Commission of India (CCI) has approved the acquisition of a certain stake in Kolte-Patil Developers by BREP Asia III India Holding. The specific percentage of the stake being acquired was not mentioned in the provided news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1749600279000,
            "Source": "default"
        },
        {
            "Title": "CCI Approves BREP Asia III India Holding's Stake Acquisition in Kolte-Patil Co-Developers",
            "Summary": "The Competition Commission of India (CCI) has given approval for BREP Asia III India Holding to acquire a stake in Kolte-Patil Co-Developers. This decision represents a significant corporate action involving Kolte-Patil's development subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1749558035000,
            "Source": "default"
        },
        {
            "Title": "Kolte-Patil Developers: Q4 Profit Soars to Rs 66.29 Crore",
            "Summary": "Kolte-Patil Developers reported a consolidated net profit of Rs 66.29 crore for Q4 FY2024-25, compared to a loss in the previous year. Total income increased to Rs 723.20 crore. For the full fiscal year, net profit was Rs 109.33 crore, with total income rising to Rs 1,763.73 crore.",
            "Sentiment": "positive",
            "PublishDate": 1748253104000,
            "Source": "earnings"
        },
        {
            "Title": "Kolte Patil Developers Reports Profit in Q4, Revenue Increase",
            "Summary": "Kolte Patil Developers has reported a significant turnaround in its financial performance for the fourth quarter. The company's EBITDA profit stood at 1.06 billion rupees, compared to a loss of 179.7 million rupees in the same period last year. The EBITDA margin for Q4 was 14.8%. The consolidated net profit for the quarter was 653 million rupees, reversing a loss of 271.1 million rupees from the previous year. Revenue for Q4 increased to 7.18 billion rupees from 5.3 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748227325000,
            "Source": "result"
        },
        {
            "Title": "Kolte-Patil Developers Reports Q4 Profit of 662m Rupees",
            "Summary": "Kolte-Patil Developers Ltd reported a consolidated net profit of 662 million rupees in the latest quarter, compared to a loss of 261 million rupees in the same quarter last year. The company's revenue increased to 7.18 billion rupees from 5.26 billion rupees year-over-year. Sequentially, profit rose from 263 million rupees and revenue increased from 3.49 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748223217000,
            "Source": "default"
        },
        {
            "Title": "Kolte-Patil Developers Reports Strong Financial Performance in FY25",
            "Summary": "Kolte-Patil Developers announced impressive financial results for the fiscal year 2025. The company achieved annual sales of 27.91 billion rupees and record-breaking annual collections of 2,432 crore rupees. Additionally, Kolte-Patil launched new projects with a Gross Development Value (GDV) of approximately 4,000 crore rupees during FY25.",
            "Sentiment": "positive",
            "PublishDate": 1745194881000,
            "Source": "default"
        },
        {
            "Title": "Kolte-Patil Developers: Q4 Sale Bookings Drop 15% to Rs 631 Crore",
            "Summary": "Kolte-Patil Developers reported a 15% decline in Q4 sale bookings to Rs 631 crore, with sales volume down 23%. FY25 saw marginal 1% decrease in bookings to Rs 2,791 crore. The company cited delays in planned project launches as a factor. Blackstone is set to acquire a 40% stake in the company for Rs 1,150 crore.",
            "Sentiment": "negative",
            "PublishDate": 1744981823000,
            "Source": "earnings"
        },
        {
            "Title": "Kolte-Patil Developers Reports Strong Financial Performance for FY25",
            "Summary": "Kolte-Patil Developers announced its financial results for FY25, reporting annual sales of 27.91 billion rupees. The company achieved its highest-ever annual collections of 2,432 crore rupees. Additionally, Kolte-Patil launched new projects with a Gross Development Value (GDV) of approximately 4,000 crore rupees during the fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1744897835000,
            "Source": "default"
        },
        {
            "Title": "Blackstone: Strategic Partnership with Kolte-Patil Developers, Acquiring 66% Stake",
            "Summary": "Blackstone to acquire up to 66% stake in Kolte-Patil Developers Limited for ₹1,800 crore ($240 million). The deal includes 14.3% new equity, 25.7% from promoters, and a potential 26% through open offer. This marks Blackstone's entry into India's residential real estate sector.",
            "Sentiment": "positive",
            "PublishDate": 1742194096000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kolte-Patil and Blackstone Form Strategic Partnership for Indian Residential Real Estate",
            "Summary": "Kolte-Patil Developers Limited has entered into a strategic partnership with Blackstone, a global investment firm, to drive growth in India's residential real estate sector. This collaboration aims to leverage Kolte-Patil's local expertise and Blackstone's global resources to expand their presence in the Indian housing market.",
            "Sentiment": "positive",
            "PublishDate": 1742182471000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kolte Patil Developers: Blackstone to Acquire 40% Stake for Rs 1,166 Crore",
            "Summary": "Blackstone's entity BREP Asia III India Holding Co is set to acquire a 40% stake in Kolte Patil Developers for Rs 1,166 crore. The acquisition includes a 14.3% stake through preferential allotment for Rs 417.03 crore and a 26% stake through share purchase agreement for Rs 759 crore. Blackstone will be classified as a promoter with joint control after the transaction.",
            "Sentiment": "positive",
            "PublishDate": 1741938443000,
            "Source": "corporate_action"
        },
        {
            "Title": "Blackstone Group: Invests ₹1,800 Crore in Kolte-Patil Developers",
            "Summary": "Blackstone to acquire 14.3% stake in Kolte-Patil Developers for ₹1,800 crore through preferential allotment. Open offer announced for additional 26% stake. Blackstone to gain joint control alongside existing promoters.",
            "Sentiment": "positive",
            "PublishDate": 1741858299000,
            "Source": "corporate_action"
        }
    ]
}