{
    "Symbol": "KOPRAN",
    "ISIN": "INE082A01010",
    "News": [
        {
            "Title": "Kopran Q3 EBITDA Drops 10% YoY to ₹178M",
            "Summary": "Kopran reported Q3 EBITDA of ₹178 million, down from ₹198 million year-over-year, with EBITDA margin declining to 9.14% from 11.93% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1769074814176,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kopran Faces GST Authority Search at Facilities",
            "Summary": "Maharashtra GST authorities initiated search operations at Kopran Limited's Mumbai office and Khopoli facility on January 21, 2026, under Section 67 of state GST Act. Company cooperating fully.",
            "Sentiment": "negative",
            "PublishDate": 1768995657945,
            "Source": "stocks"
        },
        {
            "Title": "Kopran Board Meeting Set for January 22, 2026",
            "Summary": "Kopran Limited has scheduled a board meeting on January 22, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768302316290,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kopran Limited Gets CRISIL Rating Reaffirmation",
            "Summary": "CRISIL reaffirms credit ratings for Kopran Limited and subsidiary with BBB+/watch developing for long-term and A2/watch developing for short-term facilities till March 31, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767265689743,
            "Source": "stocks"
        },
        {
            "Title": "Kopran Limited Reports Mixed Financial Performance in Q2 FY2025",
            "Summary": "Kopran Limited announced its quarterly results for the quarter ended September 30, 2025. On a consolidated basis, the company reported revenue from operations of Rs 790.93 lakhs compared to Rs 15,156.29 lakhs in the same quarter last year. The company posted a net loss of Rs 992.32 lakhs for the quarter versus a profit of Rs 738.41 lakhs in the corresponding period of the previous year. For the half-year period, consolidated revenue stood at Rs 25,312.55 lakhs compared to Rs 29,099.84 lakhs in the previous year. The company's standalone revenue for the quarter was Rs 4,238.93 lakhs against Rs 7,352.96 lakhs in the same quarter last year. The Board of Directors approved these unaudited financial results at their meeting held on November 12, 2025. The company operates primarily in the pharmaceuticals business through its group entities.",
            "Sentiment": "negative",
            "PublishDate": 1762977628848,
            "Source": "earnings"
        },
        {
            "Title": "Kopran Outlines Growth Strategy Through API Expansion and Latin America Market Entry",
            "Summary": "Kopran has outlined its growth strategy focusing on API and formulation expansion. The company plans to enter export markets in Latin America and has received new molecule approvals. Kopran is adding capacity at its Khopoli plant and will focus on value-added specialty APIs along with enhanced global regulatory filings to drive margin expansion.",
            "Sentiment": "positive",
            "PublishDate": 1762963809968,
            "Source": "stock"
        },
        {
            "Title": "Kopran Reports Q2 Loss with Revenue Decline",
            "Summary": "Kopran reported quarterly results showing an EBITDA loss of 52 million rupees compared to a gain of 156 million rupees in the same period last year. Revenue declined to 1.2 billion rupees from 1.52 billion rupees year-over-year. The company posted a consolidated net loss of 100 million rupees, contrasting with a profit of 74 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762938136767,
            "Source": "earnings"
        },
        {
            "Title": "Kopran Limited: Promoter Group Share Transactions Under SEBI Regulations",
            "Summary": "Kopran Limited disclosed share transactions within its promoter group under SEBI regulations. Surendra Somani acquired 35,635 shares through an off-market transaction, increasing his holding from 9,27,975 shares (1.92%) to 9,63,610 shares (2.00%). Simultaneously, Kumkum Somani sold 35,635 shares, reducing her holding from 35,635 shares (0.07%) to zero shares. The transactions occurred between promoter group members, with the company's total equity share capital remaining at INR 48.28 crores. Other promoter group entities including Vandana Somani, Varun Somani, Oriental Enterprises Partnership Firm, Panorama Finvest Private Ltd, Parijat Shipping and Finale Limited, and Sarvamangal Mercantile Company Limited maintained their existing shareholdings.",
            "Sentiment": "neutral",
            "PublishDate": 1757939024950,
            "Source": "corporate_action"
        },
        {
            "Title": "Kopran Limited Promoter Group Completes Share Transfer Transactions",
            "Summary": "Kopran Limited's promoter group members completed off-market share transfer transactions. In the first transaction, Mridula Somani, Nupur Somani, and Adarsh Somani transferred their combined holdings of 12,39,650 shares (2.57% of total voting capital), reducing their holdings to zero. In the second transaction, Hridai Somani, Jaya Somani, Suhrid Somani, and Susheel G Somani transferred 7,40,700 shares (1.53% of total voting capital), also reducing their individual holdings to zero. Kumkum Somani retained 35,635 shares (0.07%). The company's equity share capital remained unchanged at INR 48.28 crores before and after both transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1757499492244,
            "Source": "corporate_action"
        },
        {
            "Title": "KOPRAN Co-Promoters Finalize Family Agreement To Strengthen Management Control",
            "Summary": "KOPRAN's co-promoters have finalized a family agreement aimed at strengthening management control of the company.",
            "Sentiment": "positive",
            "PublishDate": 1756802436768,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kopran Limited Promoter Group to Acquire 4.18% Stake Through Inter-Family Transfer",
            "Summary": "The promoter group of Kopran Limited will acquire 20,15,985 equity shares (4.18% of share capital) through an inter-family transfer scheduled for September 1, 2025. The acquirers include Varun Somani, Vadana Somani, and Surendra Somani, along with four associated entities. The shares will be transferred without consideration as gifts from eight family members including Hridai Somani, Jaya Somani, and others. The transaction aims to resolve family disputes, settle business partition inequalities, and preserve family property while avoiding litigation. Following the acquisition, the promoter group's total shareholding will increase from 22.81% to 26.99%. The transfer is exempt from open offer requirements under SEBI takeover regulations. The 60-day volume weighted average market price was ₹178.65 on BSE and ₹178.70 on NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1756109888602,
            "Source": "corporate_action"
        },
        {
            "Title": "Kopran Limited Sets September 4, 2025 as Record Date for Dividend Payment",
            "Summary": "Kopran Limited has announced September 4, 2025 as the record date for dividend payment, pending shareholder approval at the Annual General Meeting scheduled for September 11, 2025. The dividend payment is subject to tax deduction at source if approved by members at the AGM. The company trades on BSE under scrip code 524280 and on NSE under the symbol KOPRAN.",
            "Sentiment": "neutral",
            "PublishDate": 1754910748461,
            "Source": "corporate_action"
        },
        {
            "Title": "Kopran Limited Board Approves Updated Merger Plan with Kopran Laboratories Limited",
            "Summary": "Kopran Limited's Board of Directors has approved an updated merger plan with Kopran Laboratories Limited, a promoter group company. The decision was made after considering fresh documentation including a valuation report dated August 07, 2025, by Ernst & Young Merchant Banking Services LLP, a fairness opinion from Saffron Capital Advisors, and an auditor's certificate from Khandelwal Jain & Co. The board meeting addressed previous regulatory observations from BSE and NSE regarding delayed filings and requirements for fresh board approval with updated financials. The board concluded that no changes are required to the original scheme approved on March 20, 2025, and the swap ratio remains unchanged. The merger involves Kopran Laboratories Limited as the transferor company merging with Kopran Limited as the transferee company.",
            "Sentiment": "neutral",
            "PublishDate": 1754642855315,
            "Source": "corporate_action"
        },
        {
            "Title": "Kopran Limited Reports Q1 FY2026 Results with Revenue of Rs 13,522 Lakhs",
            "Summary": "Kopran Limited reported revenue from operations of Rs 13,522 lakhs for the first quarter ended June 30, 2025, compared to Rs 13,944 lakhs in the same quarter last year. The company's EBITDA decreased to Rs 1,413 lakhs from Rs 1,816 lakhs year-over-year, with EBITDA margin declining to 10.45% from 13.03%. Net profit fell to Rs 745 lakhs from Rs 1,110 lakhs in the corresponding quarter of the previous year. The pharmaceutical company operates through two main verticals - APIs through wholly-owned subsidiary Kopran Research Laboratories Ltd, and formulations through Kopran Limited. API segment generated Rs 8,303 lakhs in revenue while formulations contributed Rs 5,078 lakhs during the quarter. The company exports to over 50 nations and maintains regulatory approvals from major global authorities including US FDA, EU GMP, WHO GMP, and ANVISA.",
            "Sentiment": "negative",
            "PublishDate": 1753781933298,
            "Source": "earnings"
        },
        {
            "Title": "Kopran Ltd Approves Q1 FY26 Results and Major Board Changes",
            "Summary": "Kopran Ltd approved its unaudited financial results for the quarter ended June 30, 2025, at a board meeting held on July 29, 2025. The company reported consolidated revenue from operations of Rs 13,521.62 lakhs for Q1 FY26 compared to Rs 13,943.65 lakhs in the same quarter last year. Consolidated profit for the quarter stood at Rs 744.93 lakhs versus Rs 1,109.54 lakhs in the previous year quarter. The board approved significant leadership changes including the appointment of Chandresh Gunvant Gandhi as Additional Independent Director for a five-year term from July 29, 2025 to July 28, 2030. Surendra Somani, who currently serves as Executive Vice-chairman, will be appointed as Chairman & Managing Director for three years from January 1, 2026 to December 31, 2028. This follows the resignation of Susheel Somani as Non-Executive Director due to continued ill health, effective July 29, 2025. The company also appointed M/s Smita Prabhu & Associates as Secretarial Auditor for five years from FY 2025-26 to FY 2029-30. The 66th Annual General Meeting is scheduled for September 11, 2025 through video conferencing.",
            "Sentiment": "neutral",
            "PublishDate": 1753779801518,
            "Source": "corporate_action"
        },
        {
            "Title": "Kopran Reports Decline in Q1 Financial Performance Across Key Metrics",
            "Summary": "Kopran reported Q1 revenue of 1.3 billion rupees, down from 1.4 billion rupees in the same period last year. The company's consolidated net profit fell to 74 million rupees from 110 million rupees year-over-year. EBITDA decreased to 165 million rupees from 196 million rupees, while EBITDA margin contracted to 12% from 14.05% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1753779372149,
            "Source": "earnings"
        },
        {
            "Title": "KOPRAN Reports Q4 Financial Results and Declares Dividend",
            "Summary": "KOPRAN announced its Q4 financial results, showing a decrease in performance compared to the previous year. The company reported an EBITDA of 202 million rupees, down from 244 million rupees year-over-year. The EBITDA margin also decreased to 11.71% from 13.11%. Revenue for Q4 was 1.7 billion rupees, lower than the 1.86 billion rupees in the same period last year. The consolidated net profit for Q4 was 97 million rupees, significantly lower than the 186 million rupees reported in the previous year. Despite the decline in financial performance, KOPRAN declared a dividend of 3 rupees per share.",
            "Sentiment": "negative",
            "PublishDate": 1747300907000,
            "Source": "result"
        },
        {
            "Title": "USFDA Inspection at Kopran API Unit Concludes Without Observations",
            "Summary": "The United States Food and Drug Administration (USFDA) has completed its inspection of Kopran's Active Pharmaceutical Ingredient (API) unit in Mahad. The inspection concluded without any observations, indicating a positive outcome for the company.",
            "Sentiment": "positive",
            "PublishDate": 1745831738000,
            "Source": "default"
        },
        {
            "Title": "Kopran Ltd: Madhuri Kela Increases Stake in Q4 FY25",
            "Summary": "Madhuri Madhusudan Kela, wife of ace investor Madhusudan Kela, has increased her stake in Kopran Ltd to 1.46% in Q4 FY25 from 1.04% in Q3. Kopran's board approved a merger with Kopran Laboratories Ltd. The company's Q3 FY25 results showed a decline in net sales and profit. The stock has fallen 37% over the past year but gained 4% in March 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1744266153000,
            "Source": "normal_news"
        },
        {
            "Title": "Madhuri Madhusudan Kela Increases Stake in Kopran Limited",
            "Summary": "Investor Madhuri Madhusudan Kela has increased their stake in Kopran Limited by 0.42% during the fourth quarter of the fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1744200873000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kopran Approves Merger with Kopran Laboratories",
            "Summary": "Kopran has approved the merger of Kopran Laboratories with itself. The merger swap ratio has been set at 100 shares of Kopran for every 45 shares of Kopran Laboratories.",
            "Sentiment": "neutral",
            "PublishDate": 1742469164000,
            "Source": "corporate_action"
        },
        {
            "Title": "KOPRAN Reports Q3 Financial Results",
            "Summary": "KOPRAN has announced its Q3 financial results. The company's consolidated net profit decreased to 104 million rupees from 158 million rupees year-over-year. However, revenue increased to 1.7 billion rupees from 1.59 billion rupees compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739267624000,
            "Source": "earnings"
        },
        {
            "Title": "Kopran Reports Decline in Q3 Consolidated Net Profit",
            "Summary": "Kopran Limited has reported a consolidated net profit of 104 million rupees for the third quarter, down from 158 million rupees in the same period last year. This represents a year-over-year decrease in profitability for the pharmaceutical company.",
            "Sentiment": "negative",
            "PublishDate": 1739267616000,
            "Source": "earnings"
        },
        {
            "Title": "Kopran Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Kopran, a pharmaceutical company, has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 decreased to 156 million rupees from 228 million rupees in the same quarter last year. Additionally, the EBITDA margin fell to 10.27% from 14.96% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731482418000,
            "Source": "result"
        },
        {
            "Title": "Kopran Reports Q2 Revenue of 1.52 Billion Rupees",
            "Summary": "Kopran, an Indian pharmaceutical company, has reported its second quarter revenue for the current fiscal year. The company's revenue stood at 1.52 billion rupees, compared to 1.5 billion rupees in the same quarter of the previous year, showing a slight year-over-year increase.",
            "Sentiment": "neutral",
            "PublishDate": 1731482377000,
            "Source": "result"
        },
        {
            "Title": "Kopran Reports Decline in Q2 Consolidated Net Profit",
            "Summary": "Kopran, an Indian pharmaceutical company, has reported a consolidated net profit of 74 million rupees for the second quarter, down from 138 million rupees in the same period last year. This represents a significant year-over-year decrease in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1731482350000,
            "Source": "result"
        }
    ]
}