{
    "Symbol": "KOTHARIPRO",
    "ISIN": "INE823A01017",
    "News": [
        {
            "Title": "Kothari Products Board Meet Set for Feb 13, 2026",
            "Summary": "Kothari Products Ltd has scheduled a board meeting on February 13, 2026, to consider and approve Q3FY26 financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769756819809,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kothari Products Limited Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "Kothari Products Limited submitted unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025, prepared in compliance with Indian Accounting Standards. The company's statutory auditors G.M. Kapadia & Company provided an unmodified opinion on both standalone and consolidated financial results, with the Board of Directors approving the results at their meeting held on November 13, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763058577963,
            "Source": "earnings"
        },
        {
            "Title": "Kothari Products Reports Mixed Q1 Results with Strong Consolidated Profit Growth",
            "Summary": "Kothari Products Limited reported contrasting performance for Q1 FY2026. On a standalone basis, total income from operations declined 39.5% to Rs. 7,539 lakhs from Rs. 12,470 lakhs, while net profit after tax increased 55.4% to Rs. 544 lakhs from Rs. 350 lakhs. Consolidated results showed stronger performance with total income rising 8.4% to Rs. 27,468 lakhs and net profit after tax surging 303.2% to Rs. 2,125 lakhs from Rs. 527 lakhs. Consolidated earnings per share improved significantly to Rs. 3.03 from Rs. 1.77, while standalone EPS decreased to Rs. 0.91 from Rs. 1.17. The company's consolidated operations include subsidiaries Virgo Ventures Pvt. Ltd and Kothari Products Singapore Pvt. Ltd, along with associate companies in real estate.",
            "Sentiment": "positive",
            "PublishDate": 1755330871457,
            "Source": "earnings"
        },
        {
            "Title": "Kothari Products Reports Quarterly Results and Approves Subsidiary Buyback Offer",
            "Summary": "Kothari Products Limited announced its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 6,599 lacs and net profit of Rs 544 lacs, with basic earnings per share of Rs 0.91. On a consolidated basis, revenue from operations was Rs 24,841 lacs with net profit of Rs 2,125 lacs and basic earnings per share of Rs 3.03. The board of directors approved a buyback offer from subsidiary Kothari Products Singapore Pte. Ltd. for 5,760,000 shares (20% of total subsidiary shares) at USD 1.3679 per share. The statutory auditors issued unmodified opinions for both standalone and consolidated results.",
            "Sentiment": "positive",
            "PublishDate": 1755097234375,
            "Source": "earnings"
        },
        {
            "Title": "Kothari Products Reports Q4 Financial Results",
            "Summary": "Kothari Products has released its Q4 financial results. The company's EBITDA improved to a gain of 18 million rupees, compared to a loss of 16 million rupees in the same quarter last year. The Q4 EBITDA margin was 0.82%. The consolidated net profit for Q4 was 103 million rupees, down from 114 million rupees year-over-year, but up from 106 million rupees quarter-over-quarter. Q4 revenue stood at 2.3 billion rupees, a decrease from 2.8 billion rupees in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1748444997000,
            "Source": "result"
        },
        {
            "Title": "Kothari Products Reports Mixed Q3 Financial Results",
            "Summary": "Kothari Products has reported its Q3 financial results. The company's net profit increased to 106 million rupees, up from 89 million rupees in the same quarter last year. However, it experienced a significant loss of 1.2 billion rupees compared to the previous quarter. Q3 revenue slightly decreased to 2.2 billion rupees from 2.25 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739751511000,
            "Source": "earnings"
        },
        {
            "Title": "Kothari Products Reports Mixed Q3 Financial Results",
            "Summary": "Kothari Products has announced its Q3 financial results. The company reported a net profit of 106 million rupees, up from 89 million rupees in the same quarter last year, representing a year-over-year increase. However, compared to the previous quarter, the company experienced a significant loss of 1.2 billion rupees. Q3 revenue stood at 2.2 billion rupees, slightly down from 2.25 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739537691000,
            "Source": "earnings"
        },
        {
            "Title": "Kothari Products Recommends 1:1 Bonus Share Issue",
            "Summary": "Kothari Products has recommended the issuance of bonus shares in a 1:1 ratio. This means that for every existing share held by shareholders, they will receive one additional share at no cost.",
            "Sentiment": "positive",
            "PublishDate": 1735518141000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kothari Products Recommends 1:1 Bonus Share Issue",
            "Summary": "Kothari Products has recommended the issuance of bonus shares in a 1:1 ratio. This means shareholders will receive one new share for each share they currently hold, effectively doubling the number of shares without changing the company's overall value.",
            "Sentiment": "positive",
            "PublishDate": 1735302469000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kothari Products Ltd: Shares Surge 20% on Potential Bonus Issue Announcement",
            "Summary": "Kothari Products Ltd. shares hit upper circuit of 20% after announcing a board meeting to consider a bonus issue of shares on December 27. This would be the company's first bonus issue since 2016. The board will also consider increasing the authorized share capital.",
            "Sentiment": "positive",
            "PublishDate": 1734677394000,
            "Source": "corporate_action"
        }
    ]
}