{
    "Symbol": "KOTHARIPET",
    "ISIN": "INE720A01015",
    "News": [
        {
            "Title": "Kothari Petrochemicals Reports Mixed Q2 Results with Higher Profit but Lower Revenue",
            "Summary": "Kothari Petrochemicals reported Q2 net profit of 184 million rupees compared to 163 million rupees in the same period last year, representing year-over-year growth. However, the company's Q2 revenue declined to 1.4 billion rupees from 1.5 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762965574442,
            "Source": "earnings"
        },
        {
            "Title": "Kothari Petrochemicals Reports Mixed Q1 Results with Revenue Growth and Profit Decline",
            "Summary": "Kothari Petrochemicals reported quarterly net profit of 176 million rupees compared to 190 million rupees in the same period last year, representing a decline. The company's revenue increased to 1.61 billion rupees from 1.45 billion rupees year-over-year, showing growth in the top line despite lower profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1754985840856,
            "Source": "earnings"
        },
        {
            "Title": "Kothari Petrochemicals Reports Q4 Financial Results",
            "Summary": "Kothari Petrochemicals has released its Q4 financial results. The company's EBITDA for Q4 was 233 million rupees, compared to 260 million rupees in the same quarter last year. The EBITDA margin stood at 15.21%, down from 15.5% year-over-year. Revenue for Q4 was 1.5 billion rupees, a decrease from 1.7 billion rupees in the previous year. However, the company's net profit increased to 173 million rupees from 152 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748419446000,
            "Source": "result"
        },
        {
            "Title": "Kothari Petrochemicals Reports Decline in Q3 EBITDA",
            "Summary": "Kothari Petrochemicals has reported a decrease in its Q3 EBITDA, which fell to 179 million rupees from 203 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 13.64% from 16.24% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739177921000,
            "Source": "earnings"
        },
        {
            "Title": "Kothari Petrochemicals Reports Q3 Financial Results",
            "Summary": "Kothari Petrochemicals has announced its Q3 financial results. The company reported a net profit of 129 million rupees, down from 144 million rupees in the same quarter last year. However, revenue increased to 1.3 billion rupees from 1.2 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739177818000,
            "Source": "earnings"
        },
        {
            "Title": "Kothari Petrochemicals Acquires Land for Expansion",
            "Summary": "Kothari Petrochemicals has approved the purchase of land in Andhra Pradesh for 740 million rupees. This acquisition is part of the company's future expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1730711562000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kothari Petrochemicals Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Kothari Petrochemicals has reported a decrease in its Q2 EBITDA, which fell to 205 million rupees from 274 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 11.38% from 16.98% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730711228000,
            "Source": "result"
        },
        {
            "Title": "Kothari Petrochemicals Reports Q2 Revenue Growth",
            "Summary": "Kothari Petrochemicals has announced its second quarter revenue for the current fiscal year. The company reported revenue of 1.8 billion rupees, compared to 1.62 billion rupees in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730711189000,
            "Source": "result"
        },
        {
            "Title": "Kothari Petrochemicals Reports Q2 Net Profit Decline",
            "Summary": "Kothari Petrochemicals has reported a net profit of 163 million rupees for the second quarter, down from 185 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1730711166000,
            "Source": "result"
        }
    ]
}