{
    "Symbol": "KOTYARK",
    "ISIN": "INE0J0B01017",
    "News": [
        {
            "Title": "Kotyark Industries Receives Final ARAI Approval for B20 & B30 Biodiesel Meeting CPCB IV+ Emission Standards",
            "Summary": "Kotyark Industries has obtained final approval from ARAI for its B20 and B30 biodiesel products that successfully passed CPCB IV+ emission norms in both pre- and post-durability testing phases. The approval positions the company to commercialize its biodiesel products that meet stringent environmental emission standards.",
            "Sentiment": "positive",
            "PublishDate": 1764057717721,
            "Source": "stock"
        },
        {
            "Title": "Kotyark Industries Receives ARAI Test Results for Biodiesel Blends Meeting Emission Standards",
            "Summary": "Kotyark Industries received draft test results from ARAI for B20 and B30 biodiesel blends. The test results show that emissions from these biodiesel blends meet CPCB IV+ standards. The company views this as strengthening their commitment to green energy solutions.",
            "Sentiment": "positive",
            "PublishDate": 1758621336423,
            "Source": "stock"
        },
        {
            "Title": "Kotyark Industries Receives High Court Approval to Continue Rajasthan Operations",
            "Summary": "The High Court has granted permission to Kotyark Industries to continue operating at its Rajasthan facility. The court ruling allows the company to maintain its business operations at the location.",
            "Sentiment": "positive",
            "PublishDate": 1756304080179,
            "Source": "stock"
        },
        {
            "Title": "Kotyark Industries Announces Cancellation of OMC Tender",
            "Summary": "Kotyark Industries has announced the cancellation of an Oil Marketing Company (OMC) tender. This cancellation is expected to have an impact on the company's revenue. However, Kotyark Industries has expressed its intention to participate in a new tender that will be issued.",
            "Sentiment": "neutral",
            "PublishDate": 1742170357000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kotyark Industries Announces Cancellation of OMC Tender",
            "Summary": "Kotyark Industries has announced the cancellation of an Oil Marketing Company (OMC) tender. This cancellation is expected to have an impact on the company's revenue. However, Kotyark Industries has expressed its intention to participate in a new tender that will likely be issued to replace the cancelled one.",
            "Sentiment": "neutral",
            "PublishDate": 1741869348000,
            "Source": "corporate_action"
        },
        {
            "Title": "Kotyark Industries Secures Biodiesel Supply Tender Worth 5.64 Billion Rupees",
            "Summary": "Kotyark Industries has been awarded a tender to supply 48,381 kiloliters of biodiesel to Oil Marketing Companies (OMCs). The contract is valued at 5.64 billion rupees, representing a significant business opportunity for the company in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1732234326000,
            "Source": "order&deals"
        },
        {
            "Title": "Kotyark Industries Secures Biodiesel Supply Tender Worth 5.64 Billion Rupees",
            "Summary": "Kotyark Industries has been awarded a tender to supply 48,381 KL of biodiesel to Oil Marketing Companies (OMCs). The contract is valued at 5.64 billion rupees, representing a significant business opportunity for the company in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1732191960000,
            "Source": "order&deals"
        }
    ]
}