{
    "Symbol": "KPEL",
    "ISIN": "INE127T01021",
    "News": [
        {
            "Title": "K.P. Energy Wins 99 MW Wind Power Project in Gujarat",
            "Summary": "K.P. Energy secures contract for 99 MW wind power project in Bhuj, Gujarat from Inox Renewable Solutions, involving installation of Inox Wind Turbine Generators.",
            "Sentiment": "positive",
            "PublishDate": 1769769094263,
            "Source": "co_actions_results"
        },
        {
            "Title": "K.P. Energy Shares Q3 FY26 Earnings Call Recording",
            "Summary": "K.P. Energy Limited has made available the audio recording of its analyst/investor earnings conference call held on January 28, 2026, discussing Q3 FY26 financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1769611775145,
            "Source": "co_actions_results"
        },
        {
            "Title": "KP Energy Schedules Q3FY26 Earnings Call on Jan 28",
            "Summary": "KP Energy Limited announces earnings conference call on January 28, 2026 at 4:30 PM IST to discuss Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768978269548,
            "Source": "co_actions_results"
        },
        {
            "Title": "KP Energy Q3 Net Profit Surges 56% to ₹41.30 Crores",
            "Summary": "KP Energy Limited reported consolidated net profit of ₹41.30 crores in Q3, marking a significant 56.44% year-on-year growth from ₹26.40 crores in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1768974671674,
            "Source": "co_actions_results"
        },
        {
            "Title": "K.P. Energy Completes Warrant Conversion Worth ₹28.37 Cr",
            "Summary": "K.P. Energy Limited successfully converted 6,88,800 warrants into equity shares for promoter Dr. Faruk G. Patel at ₹412 per share, raising ₹21.28 crores and increasing paid-up capital to ₹33.79 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768974417194,
            "Source": "co_actions_results"
        },
        {
            "Title": "K.P. Energy Board Meet on Jan 21 for Q3 Results",
            "Summary": "K.P. Energy Limited has scheduled a board meeting on January 21, 2026, to consider Q3FY26 unaudited financial results and declare third interim dividend for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1768555739899,
            "Source": "co_actions_results"
        },
        {
            "Title": "KP Group Signs ₹4,000 Cr Gujarat Renewable Energy MoU",
            "Summary": "KP Group partners with Gujarat government for 855 MW renewable energy projects worth ₹4,000 crore, including solar and wind-solar hybrid facilities across multiple locations in the state.",
            "Sentiment": "positive",
            "PublishDate": 1768291206854,
            "Source": "stocks"
        },
        {
            "Title": "KP Energy Signs ₹4000 Cr Gujarat Renewable Deal",
            "Summary": "KP Energy's parent company KP Group has signed an MoU with Gujarat government to develop renewable energy projects worth ₹4000 crores with 855 MW capacity, marking a significant expansion in the state's clean energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1768262829503,
            "Source": "stocks"
        },
        {
            "Title": "K.P. Energy Plans 855 MW Renewable Energy Projects",
            "Summary": "K.P. Energy announces ambitious plans to develop renewable energy projects with a combined capacity of 855 MW, marking a significant expansion in the company's clean energy portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1768228054784,
            "Source": "stocks"
        },
        {
            "Title": "KP Energy Signs ₹4,000 Cr Gujarat Renewable MoU",
            "Summary": "KP Energy Limited enters MoU with Gujarat Government for 855 MW renewable energy projects worth ₹4,000 crore, including solar and wind-solar hybrid projects across Devbhumi Dwarka and Kutch.",
            "Sentiment": "positive",
            "PublishDate": 1768228000994,
            "Source": "stocks"
        },
        {
            "Title": "K.P. Energy Signs ₹4000 Cr Gujarat Renewable Deal",
            "Summary": "K.P. Energy has entered into a significant agreement with the Gujarat Government for renewable energy projects valued at ₹4000 crores, marking a major expansion in the state's clean energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1768227770235,
            "Source": "co_actions_results"
        },
        {
            "Title": "K.P. Energy Signs $4 Billion Renewable Deal with Botswana",
            "Summary": "K.P. Energy Limited announces major collaboration agreement with Botswana for renewable energy projects valued at $4 billion, marking significant expansion into African markets.",
            "Sentiment": "positive",
            "PublishDate": 1765972658332,
            "Source": "co_actions_results"
        },
        {
            "Title": "KP Energy Reports 55% Revenue Growth in H1 FY26, Order Book Stands at 2.2 GW",
            "Summary": "KP Energy Limited delivered strong financial performance with total income rising 55% to INR 524 crore in H1 FY26, while EBITDA grew 60% and profit after tax increased 42%. The renewable energy solutions provider maintains a robust order book of 2.2 GW worth INR 2,900 crore and expects additional orders by December 2025 following PPA executions.",
            "Sentiment": "positive",
            "PublishDate": 1763378655491,
            "Source": "earnings"
        },
        {
            "Title": "K.P. Energy Limited Seeks Shareholder Approval for Independent Director Appointment via Postal Ballot",
            "Summary": "K.P. Energy Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Dr. Indu Gupta Rao as Non-Executive Independent Director for a five-year term from September 29, 2025 to September 28, 2030. The e-voting process will be conducted from November 18, 2025 to December 17, 2025, with results to be declared by December 19, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763191199487,
            "Source": "corporate_governance"
        },
        {
            "Title": "K.P. Energy Appoints Dr. Neethimani Karunamoorthy as Director-Technical",
            "Summary": "K.P. Energy Limited's Board of Directors approved the appointment of Dr. Neethimani Karunamoorthy as Director-Technical and Senior Management Personnel effective November 15, 2025. Dr. Karunamoorthy brings extensive expertise in wind energy project development, construction, and asset management with a Ph.D. in Wind Energy and leadership roles in industry organizations including the Indian Wind Power Association.",
            "Sentiment": "positive",
            "PublishDate": 1763124752331,
            "Source": "corporate_governance"
        },
        {
            "Title": "KP Group and Senvion India Partner to Develop Up to 2GW Wind and Hybrid Renewable Projects",
            "Summary": "KP Group through its entities KPI Green Energy Limited, KP Energy Limited, and KP Green Engineering Limited signed a framework agreement with wind turbine manufacturer Senvion India to jointly develop up to 2GW of wind and wind-solar hybrid projects across multiple Indian states over the next three years. The collaboration combines KP Group's project development and Balance of Plant expertise with Senvion's turbine technology to deliver integrated renewable energy solutions, with KP Group handling site development and Senvion supplying wind turbine generators.",
            "Sentiment": "positive",
            "PublishDate": 1763068134575,
            "Source": "order&deals"
        },
        {
            "Title": "K.P. Energy Limited Gets Credit Rating Reaffirmation from CARE Ratings",
            "Summary": "CARE Ratings Limited has reaffirmed K.P. Energy Limited's credit ratings with Long-term bank facilities rated CARE A-: Stable and Long-term/Short-term bank facilities rated CARE A-: Stable/CARE A2+. The Long-term bank facilities amount was enhanced from ₹386.21 crore to ₹513.01 crore, while Long-term/Short-term bank facilities increased from ₹90.00 crore to ₹150.00 crore. The rating considers the company's significant increase in scale of operations and order book position while maintaining healthy profitability in FY25 and Q1FY26. Total operating income grew by 97% in FY25 over FY24, while order book increased from ₹1,320 crore as on June 01, 2024, to ₹3,086 crore as on June 30, 2025. The company successfully completed a critical wind independent power production project of 28.6MW in Vagra, Gujarat without cost and time overrun. The stable outlook reflects CARE's expectation that K.P. Energy will sustain its financial risk profile considering its established market position, healthy order book and long-standing customer relationships.",
            "Sentiment": "positive",
            "PublishDate": 1763001156551,
            "Source": "corporate_action"
        },
        {
            "Title": "K.P. Energy Reports 55% Revenue Growth to ₹524 Crores in H1 FY2026",
            "Summary": "K.P. Energy Limited announced its financial results for the quarter and half year ended September 30, 2025. The company reported total income of ₹524 crores in H1 FY2026, representing a 55% year-on-year increase from ₹337 crores in H1 FY2025. EBITDA grew 59% to ₹118 crores compared to ₹74 crores in the previous year. Profit After Tax surged 442% to ₹61 crores from ₹11 crores in H1 FY2025. The company's earnings per share increased 441% to ₹9.15 from ₹1.69. Net worth expanded 58% to ₹376 crores from ₹238 crores. Cash flow from operating activities improved significantly to ₹85 crores compared to ₹6 crores in the previous year. The company operates in renewable energy solutions with a focus on wind and hybrid projects, maintaining a total renewable portfolio of 1,994 MW and an operational IPP asset base of 48.5 MW.",
            "Sentiment": "positive",
            "PublishDate": 1762496274769,
            "Source": "earnings"
        },
        {
            "Title": "K.P. Energy Reports 44% Jump in Q2 Net Profit to 359 Million Rupees",
            "Summary": "K.P. Energy reported consolidated net profit of 359 million rupees in Q2, representing a 44% increase from 249 million rupees in the same period last year. The company's EBITDA rose significantly to 758 million rupees compared to 403 million rupees year-over-year, marking an 88% growth. EBITDA margin improved to 21.9% from 20.3% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762493462612,
            "Source": "earnings"
        },
        {
            "Title": "KP Energy Partners with Fabtech Group for Global Green Infrastructure in Healthcare Sectors",
            "Summary": "K.P. Energy Limited announced a Memorandum of Understanding with Fabtech Group to develop green energy powered life sciences projects globally. Under the partnership, KP Group will provide solar, wind, hybrid, Battery Energy Storage System (BESS) and green hydrogen-based power solutions for Fabtech Group's pharma, biotech and healthcare projects. The collaboration aims to create sustainable, low-carbon digital ecosystems worldwide. Both companies will jointly explore opportunities in India, the Middle East, and Africa, focusing on sustainability and renewable-powered infrastructure. KP Group, established in 1994, specializes in renewable energy projects, while Fabtech Group provides turnkey solutions for life sciences and healthcare sectors with operations across MENA and GCC regions.",
            "Sentiment": "positive",
            "PublishDate": 1761638713634,
            "Source": "order&deals"
        },
        {
            "Title": "KP Group Partners With Gujarat Government for Hydrogen and EV Fuel Stations",
            "Summary": "KP Group has entered into a partnership with the Gujarat Government to establish hydrogen and electric vehicle fuel stations. This partnership was announced at the Vibrant Gujarat Regional Conference 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760083153871,
            "Source": "stock"
        },
        {
            "Title": "K.P. Energy Partners with South Korea's Jeonbuk Province for Green Hydrogen Development",
            "Summary": "K.P. Energy has established a partnership with Jeonbuk Province in South Korea to advance green hydrogen initiatives. The collaboration represents a global partnership focused on developing green hydrogen projects.",
            "Sentiment": "positive",
            "PublishDate": 1759233957492,
            "Source": "stock"
        },
        {
            "Title": "K.P. Energy Reports 63% Revenue Growth to Rs 220.6 Crores in Q1 FY26",
            "Summary": "K.P. Energy Limited reported strong quarterly results with consolidated revenue rising 63% to Rs 220.6 crores compared to Rs 135.2 crores in the same quarter last year. EBITDA increased 63% to Rs 49.6 crores from Rs 30.4 crores, while profit after tax grew 40% to Rs 25.4 crores from Rs 18.2 crores. The company maintains an order book of 2.22 GW valued at over Rs 3,000 crores. The revenue mix comprises 95% EPC contracts, 5% power sales from IPP segment, and 1% O&M services. The company's IPP portfolio stands at 48.5 MW including wind and solar projects. Management expects new orders by September and is targeting additional 20 MW IPP capacity in coming months. EPC margins range 15-18% while IPP margins are 65-75%. The O&M portfolio exceeds 595 MW capacity.",
            "Sentiment": "positive",
            "PublishDate": 1755013475566,
            "Source": "earnings"
        },
        {
            "Title": "K.P. Energy Limited Amends Corporate Documents to Include Electricity Trading and Removes Common Seal Clause",
            "Summary": "K.P. Energy Limited shareholders approved amendments to the company's Memorandum of Association and Articles of Association through postal ballot on August 9, 2025. The amendments include adding electricity trading to the company's main object clause to explore additional opportunities in the renewable energy sector. The changes expand the company's business scope to cover establishing, generating, storing, transmitting, distributing, and trading electricity from various sources including thermal, hydro, nuclear, solar, wind, and other renewable energy sources. Additionally, shareholders approved alterations to the Articles of Association by removing the clause related to common seal requirements.",
            "Sentiment": "positive",
            "PublishDate": 1755002725532,
            "Source": "corporate_action"
        },
        {
            "Title": "KP Energy Reports 40% Jump in Q1 Net Profit to Rs 254 Million",
            "Summary": "KP Energy reported consolidated net profit of Rs 254 million in Q1, up from Rs 182 million in the same period last year. The company's EBITDA increased significantly to Rs 485 million from Rs 224 million year-on-year. EBITDA margin improved to 22.1% compared to 17.6% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754370214632,
            "Source": "earnings"
        },
        {
            "Title": "K.P. Energy Divests Entire 51% Stake in Wind Power SPV for Rs 51,000",
            "Summary": "K.P. Energy Limited has sold its complete 51% equity shareholding in Evergreen Mahuva Windfarms Private Limited for Rs 51,000. The SPV was originally created for a 30MW Wind Power Project under a Power Purchase Agreement with Gujarat Urja Vikas Nigam Limited. However, the project was ultimately developed and commissioned directly by KPEL with approval from Gujarat Electricity Regulatory Commission, making the SPV structure unnecessary. The company transferred 5,100 equity shares at Rs 10 per share to an individual unrelated to the promoter group. Following the disinvestment, EMWPL is no longer a subsidiary of K.P. Energy Limited. The SPV had not commenced operations since its incorporation in January 2018.",
            "Sentiment": "neutral",
            "PublishDate": 1753797259144,
            "Source": "corporate_action"
        },
        {
            "Title": "K.P. Energy Sells 51% Stake in Evergreen Mahuva Windfarms",
            "Summary": "K.P. Energy has sold a 51% stake in Evergreen Mahuva Windfarms. The transaction involves the renewable energy company divesting its majority holding in the wind farm project.",
            "Sentiment": "neutral",
            "PublishDate": 1753796789476,
            "Source": "order&deals"
        },
        {
            "Title": "K.P. Energy Reports Strong Q4 Financial Results",
            "Summary": "K.P. Energy has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 704 million rupees from 306 million rupees in the previous year. The EBITDA margin also improved, rising to 17.56% from 14.75%. Additionally, K.P. Energy's consolidated net profit for Q4 grew to 458 million rupees, up from 249 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747199965000,
            "Source": "result"
        },
        {
            "Title": "K.P. Energy Orders 20 Senvion Wind Turbines",
            "Summary": "K.P. Energy has placed an order for 20 units of Senvion 4.2M160 wind turbines. This purchase indicates an expansion in K.P. Energy's renewable energy capacity and a significant investment in wind power technology.",
            "Sentiment": "positive",
            "PublishDate": 1746103571000,
            "Source": "default"
        },
        {
            "Title": "K.P. Energy Reports Strong Q2 EBITDA Growth",
            "Summary": "K.P. Energy has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased significantly to 403 million rupees, up from 158 million rupees in the same quarter last year. However, the EBITDA margin decreased slightly to 20.31% from 22.52% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730881567000,
            "Source": "result"
        },
        {
            "Title": "K.P. Energy Reports Significant Revenue Growth in Q2",
            "Summary": "K.P. Energy has announced its second quarter financial results, reporting a revenue of 2 billion rupees. This represents a substantial increase from the 702 million rupees reported in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1730881507000,
            "Source": "result"
        },
        {
            "Title": "K.P. Energy Reports Significant Profit Growth in Q2",
            "Summary": "K.P. Energy has announced its Q2 consolidated net profit of 249 million rupees, showing a substantial increase from 82 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730881478000,
            "Source": "result"
        },
        {
            "Title": "K.P. Energy Secures Massive Renewable Energy Project Orders",
            "Summary": "K.P. Energy has received new orders totaling 1003.7MW capacity for the development of renewable energy projects from KPI Green Energy. This significant order volume indicates a substantial expansion in the company's renewable energy portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1730785428000,
            "Source": "corporate_action"
        },
        {
            "Title": "KP Energy: Energy Stock Hits 5% Lower Circuit on Ex-Dividend Date",
            "Summary": "<p>KP Energy's stock hit a <span class='negative'>5% lower circuit</span> on October 7, 2024, its <b>ex-dividend date</b> for a final dividend of Rs 0.10 per share for FY24. The stock closed at Rs 450.40. This follows a <span class='positive'>2:1 bonus issue</span> in February 2024 and a <span class='positive'>1:2 stock split</span> in March 2023. The company's <span class='positive'>ROE stands at 33.84%</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728324474000,
            "Source": "corporate_action"
        }
    ]
}