{
    "Symbol": "KPIGREEN",
    "ISIN": "INE542W01025",
    "News": [
        {
            "Title": "KPI Green Energy Wins 300 MWac Solar Orders from Adani",
            "Summary": "KPI Green Energy secured orders for 300 MWac/405 MWdc project installation and commissioning work at Khavda, Gujarat from Adani Group entities, bringing total Khavda orders to 834 MWac/1,131 MWdc.",
            "Sentiment": "positive",
            "PublishDate": 1770700620221,
            "Source": "co_actions_results"
        },
        {
            "Title": "KPI Green Energy Q3 FY26 Results Show Strong Growth",
            "Summary": "KPI Green Energy delivers seventh consecutive quarter of record revenue with 45% YoY growth to INR676 crores, driven by robust execution across solar and hybrid portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1770132833565,
            "Source": "co_actions_results"
        },
        {
            "Title": "KPI Green Energy Gets Solar Project Certification",
            "Summary": "KPI Green Energy Ltd receives certification for 16.16 MWDC solar power project under PM-KUSUM scheme, marking the highest capacity project in DGVCL area to provide reliable daytime power for farmers.",
            "Sentiment": "positive",
            "PublishDate": 1770109673034,
            "Source": "stocks"
        },
        {
            "Title": "KPI Green Energy Starts 200 MW Solar Project Operations",
            "Summary": "KPI Green Energy Limited commences power generation from its 200 MW AC / 240 MW DC solar project at Khavda Solar Park under long-term PPA with GUVNL, marking a significant milestone in Gujarat's renewable energy expansion.",
            "Sentiment": "positive",
            "PublishDate": 1769679465838,
            "Source": "stocks"
        },
        {
            "Title": "KPI Green Energy Sets IPP Revenue Target at 25-30%",
            "Summary": "KPI Green Energy plans IPP revenue to reach 25-30% of total revenue by FY2030. Sun Drops IPO expected in H1 FY27 with 50-60% growth target and INR 500-600 crore turnover.",
            "Sentiment": "positive",
            "PublishDate": 1769660840733,
            "Source": "stocks"
        },
        {
            "Title": "KPI Green Energy Achieves Early Solar Project Milestone",
            "Summary": "KPI Green Energy successfully commissioned 24.2 MW AC / 34.4 MW DC capacity of its 250 MW AC / 350 MW DC GUVNL solar project, ahead of the October 2026 contractual schedule.",
            "Sentiment": "positive",
            "PublishDate": 1769142923170,
            "Source": "stocks"
        },
        {
            "Title": "KPI Green Energy Q3FY26 Earnings Call on Jan 28",
            "Summary": "KPI Green Energy has scheduled an earnings conference call on January 28, 2026, at 2:00 PM to discuss Q3FY26 financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769005571343,
            "Source": "co_actions_results"
        },
        {
            "Title": "KPI Green Energy Q3 Net Profit Surges 42% YoY",
            "Summary": "KPI Green Energy reported consolidated net profit of ₹1.20 billion in Q3, marking a significant 42% increase from ₹845 million in the same quarter last year, demonstrating strong financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1768969898390,
            "Source": "co_actions_results"
        },
        {
            "Title": "KPI Green Energy Board Meet on Jan 21 for Q3 Results",
            "Summary": "KPI Green Energy Limited has scheduled a board meeting for January 21, 2026, to consider Q3FY26 financial results and potential third interim dividend for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1768555229601,
            "Source": "co_actions_results"
        },
        {
            "Title": "KPI Green Energy Wins 534 MW Solar BoS Orders",
            "Summary": "KPI Green Energy Limited secured orders from Adani Green Energy entities for Balance of System package covering 534 MW solar power projects at Khavda, Gujarat, strengthening its position in utility-scale solar execution.",
            "Sentiment": "positive",
            "PublishDate": 1768552560322,
            "Source": "co_actions_results"
        },
        {
            "Title": "KPI Green Energy Wins 534 MW Solar Orders from Adani",
            "Summary": "KPI Green Energy secures major orders for goods and onsite services for 534 MW solar power projects in Khavda, Gujarat, from Adani Green Energy Ltd and Adani Green Energy Six Ltd, strengthening its position in renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1768552469072,
            "Source": "co_actions_results"
        },
        {
            "Title": "KPI Green Energy signs ₹4,000-cr Gujarat pact",
            "Summary": "KPI Green Energy entered into a ₹4,000-crore agreement with Gujarat government for renewable energy projects development during Vibrant Gujarat Regional Conference on January 12, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768229994050,
            "Source": "co_actions_results"
        },
        {
            "Title": "KPI Green Energy signs ₹4,000 cr Gujarat MoU",
            "Summary": "KPI Green Energy Limited has signed an MoU with Gujarat government for developing 855 MW renewable energy projects worth ₹4,000 crores across multiple locations including Devbhumi Dwarika and Kutch.",
            "Sentiment": "positive",
            "PublishDate": 1768228574157,
            "Source": "stocks"
        },
        {
            "Title": "KPI Green Energy Wins 445 MW BESS Project from GUVNL",
            "Summary": "KPI Green Energy's subsidiary receives Letter of Intent for 445 MW/890 MWh standalone Battery Energy Storage System projects from Gujarat Urja Vikas Nigam Limited, marking the company's first utility-scale BESS venture.",
            "Sentiment": "positive",
            "PublishDate": 1767462813073,
            "Source": "co_actions_results"
        },
        {
            "Title": "KPI Green Energy starts 92.15 MWp hybrid project early",
            "Summary": "KPI Green Energy Limited commenced power supply from its 92.15 MWp hybrid project awarded by GUVNL ahead of the July 2026 schedule, demonstrating strong execution capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1767360081832,
            "Source": "stocks"
        },
        {
            "Title": "KPI Green Energy Gets 32.40 MW Project Approval",
            "Summary": "KPI Green Energy receives charging approval for 32.40 MW solar and hybrid power projects under CPP segment, developed for clients including subsidiary Sun Drops Energia Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1767259804072,
            "Source": "stocks"
        },
        {
            "Title": "KPI Green Energy: Promoter Group Buys 1.6M Shares",
            "Summary": "Quyosh Energia Private Limited acquired 15,99,029 shares of KPI Green Energy through open market purchases from December 29-31, 2025, increasing its stake to 0.81% and demonstrating promoter confidence.",
            "Sentiment": "positive",
            "PublishDate": 1767160281905,
            "Source": "co_actions_results"
        },
        {
            "Title": "KPI Green Energy Surges 27% in Two Trading Sessions",
            "Summary": "KPI Green Energy shares rallied 8% to ₹513.60, extending gains to 27% over two days on strong volumes of 24.74 lakh shares, significantly above the two-week average of 4.11 lakh shares.",
            "Sentiment": "positive",
            "PublishDate": 1767157606415,
            "Source": "stocks"
        },
        {
            "Title": "KPI Green Energy Wins ₹128.49 Cr NTPC Project",
            "Summary": "KPI Green Energy secures award notification from NTPC for green hydrogen and waste-to-energy project worth ₹128.49 crores at Greater Noida facility using plasma gasification technology.",
            "Sentiment": "positive",
            "PublishDate": 1766564313895,
            "Source": "stocks"
        },
        {
            "Title": "KPI Green Energy Gets ISO 27001:2022 Certification",
            "Summary": "KPI Green Energy has received ISO/IEC 27001:2022 certification for its Information Security Management System, validating the company's cybersecurity standards and data protection methods.",
            "Sentiment": "positive",
            "PublishDate": 1766117617202,
            "Source": "stocks"
        },
        {
            "Title": "KPI Green Energy EGM Scheduled for January 16, 2026",
            "Summary": "KPI Green Energy has scheduled an Extra-Ordinary General Meeting on January 16, 2026 at 11:00 AM via video conference to approve the preferential issue of ₹475 crore warrants to promoter group entity.",
            "Sentiment": "neutral",
            "PublishDate": 1765951588797,
            "Source": "co_actions_results"
        },
        {
            "Title": "KPI Green Energy Board Meet on Dec 17 for Fundraising",
            "Summary": "KPI Green Energy has scheduled a board meeting for December 17, 2025, to discuss fundraising through equity or equity-linked securities to promoters via private placement or preferential issue.",
            "Sentiment": "neutral",
            "PublishDate": 1765513224520,
            "Source": "stocks"
        },
        {
            "Title": "KPI Green Energy Wins ₹489.17 Crore Floating Solar Project from GSECL",
            "Summary": "KPI Green Energy secured a 142 MW floating solar EPC contract worth ₹489.17 crore from GSECL with an 18-month completion timeline. The deal includes a 10-year operations and maintenance agreement, strengthening the company's renewable energy portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1764668305434,
            "Source": "stock"
        },
        {
            "Title": "KPI Green Energy and Inox Solar Sign MoU for 2.5 GW Solar Project Development",
            "Summary": "KPI Green Energy Limited has entered into a strategic partnership with Inox Solar Limited to jointly develop 2.5 GW of solar and hybrid renewable energy projects across multiple states in India. Under the agreement, KPI will handle project development, EPC works, and O&M services while Inox Solar will supply solar modules, combining their respective strengths to accelerate India's renewable energy growth.",
            "Sentiment": "positive",
            "PublishDate": 1763530300528,
            "Source": "order&deals"
        },
        {
            "Title": "KPI Green Energy Reports Strong Q2FY26 Results with 78% Revenue Growth",
            "Summary": "KPI Green Energy delivered record quarterly performance with revenue rising 78% year-on-year to INR 641.1 crores and PAT growing 67% to INR 117 crores in Q2FY26. The company secured major financing including INR 670 crores green bonds and INR 3,200 crores SBI term loan for its renewable energy projects, while expanding into emerging sectors like data centers and green hydrogen.",
            "Sentiment": "positive",
            "PublishDate": 1763477062269,
            "Source": "earnings"
        },
        {
            "Title": "KPI Green Energy Secures ₹696 Crore Solar Project Contract from SJVN in Gujarat",
            "Summary": "KPI Green Energy Ltd signed a ₹696.50 crore contract with SJVN Ltd to execute a 200 MW solar power project at GIPCL Renewable Energy Park, Khavda, Gujarat, covering supply, EPC, and three-year O&M services. This deal expands KPI Green's total footprint in Khavda to over 845 MWp, strengthening its position as a key EPC service provider in India's renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1763116863214,
            "Source": "order&deals"
        },
        {
            "Title": "KPI Green Energy Reports Record Q2 Results, Declares Second Interim Dividend",
            "Summary": "KPI Green Energy Limited reported record-breaking quarterly results for the quarter ended September 30, 2025, marking its sixth consecutive quarter of highest-ever revenue. Consolidated revenue increased 77.4% to Rs 641.1 crore compared to Rs 361.4 crore in the same quarter last year. Profit after tax rose 67% to Rs 116.6 crore from Rs 69.8 crore. For the half-year period, total revenue grew 76.5% to Rs 1,255.26 crore while profit after tax increased 67.7% to Rs 227.96 crore. The company declared a second interim dividend of 5% (Re 0.25 per equity share) for financial year 2025-26, with record date set as November 14, 2025. The company also issued India's first externally credit-enhanced green bond worth Rs 670 crore and secured a Rs 3,200 crore sanction from State Bank of India for solar and hybrid projects.",
            "Sentiment": "positive",
            "PublishDate": 1762499072884,
            "Source": "earnings"
        },
        {
            "Title": "KPI Green Reports 75% Revenue Growth in Q2 Results",
            "Summary": "KPI Green reported quarterly revenue of 6.3 billion rupees, up from 3.6 billion rupees in the same period last year. The company's EBITDA increased to 2.24 billion rupees from 1.3 billion rupees year-over-year, though EBITDA margin declined to 35.4% from 37.16%. Consolidated net profit rose to 1.1 billion rupees compared to 698 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762496868190,
            "Source": "earnings"
        },
        {
            "Title": "KPI Green Energy Signs 150 MW Wind Project PPA with GUVNL",
            "Summary": "KPI Green Energy has signed a Power Purchase Agreement (PPA) with Gujarat Urja Vikas Nigam Limited (GUVNL) for a 150 MW wind project.",
            "Sentiment": "positive",
            "PublishDate": 1762416808895,
            "Source": "stock"
        },
        {
            "Title": "KPI Green Energy Partners With F Plus Healthcare Technologies for Green Data Centers",
            "Summary": "KPI Green Energy has signed an agreement with F Plus Healthcare Technologies for a global partnership. The collaboration aims to create green modular data centers and high-tech facilities with a focus on renewable energy solutions and sustainable infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1761709758934,
            "Source": "order&deals"
        },
        {
            "Title": "KP Group Partners with Fabtech Group for Global Green Energy Infrastructure in Healthcare Sectors",
            "Summary": "KP Group has signed a Memorandum of Understanding with Fabtech Group to develop green energy powered life sciences projects globally. Under the partnership, KP Group will provide solar, wind, hybrid, Battery Energy Storage System (BESS) and green hydrogen-based power solutions for Fabtech Group's pharma, biotech and healthcare projects. The collaboration aims to create sustainable, low-carbon digital ecosystems worldwide. Both companies will jointly explore opportunities in India, the Middle East, and Africa, focusing on sustainability and renewable-powered infrastructure. KP Group, established in 1994, is a renewable energy conglomerate, while Fabtech Group provides turnkey solutions for life sciences and healthcare sectors with operations across MENA and GCC regions.",
            "Sentiment": "positive",
            "PublishDate": 1761638722119,
            "Source": "order&deals"
        },
        {
            "Title": "KPI Green Energy Receives Charging Approval for 40.96 MW Solar and Wind-Solar Hybrid Projects",
            "Summary": "KPI Green Energy Limited announced it has received charging/energization approval for 40.96 MW of Solar and Wind-Solar Hybrid power projects under its Captive Power Producer (CPP) business segment. The projects were developed for clients of KPI Green Energy Limited and its subsidiary Sun Drops Energia Private Limited. The charging approval was received in the name of the respective clients.",
            "Sentiment": "positive",
            "PublishDate": 1761623606456,
            "Source": "stock"
        },
        {
            "Title": "KPI Green Energy Wins ₹696.50 Crore Solar Project Contract from SJVN Limited",
            "Summary": "KPI Green Energy has been awarded a 200 MW solar project by SJVN Limited worth ₹696.50 crores. The project will be developed at GIPCL Renewable Energy Park located in Khavda, Gujarat.",
            "Sentiment": "positive",
            "PublishDate": 1760677215647,
            "Source": "order&deals"
        },
        {
            "Title": "KPI Green Energy Receives Category A Power Trading License From GERC",
            "Summary": "KPI Green Energy has obtained a Category A Power Trading License from the Gujarat Electricity Regulatory Commission (GERC). This license enables the company to participate directly in power markets, potentially increasing revenue through better alignment of sales with demand. The development supports India's transition toward clean energy.",
            "Sentiment": "positive",
            "PublishDate": 1760067741381,
            "Source": "stock"
        },
        {
            "Title": "KPI Green Energy Secures 100 MW Solar Project Contract",
            "Summary": "KPI Green Energy Ltd has been awarded a 100 MW solar project by Sun Drops Energia Pvt Ltd. The project is scheduled for completion by FY 2026-27.",
            "Sentiment": "positive",
            "PublishDate": 1759999096354,
            "Source": "order&deals"
        },
        {
            "Title": "KPI Green Energy Partners with South Korea's Jeonbuk Province for Green Hydrogen Initiative",
            "Summary": "KPI Green Energy's parent company KP Group has formed a partnership with Jeonbuk Province in South Korea to advance global green hydrogen efforts. The collaboration aims to boost green hydrogen development initiatives on an international scale.",
            "Sentiment": "positive",
            "PublishDate": 1759234849958,
            "Source": "stock"
        },
        {
            "Title": "KPI Green Energy Shareholders Approve Changes to Company's Main Business Objects",
            "Summary": "KPI Green Energy Limited shareholders approved alterations to the Main Object Clause of the company's Memorandum of Association at the 17th Annual General Meeting held on September 26, 2025. The amendment expands the company's business scope to include establishing, generating, storing, and distributing various forms of electricity and power from multiple sources including thermal, hydro, nuclear, solar, wind, hybrid, geo-thermal, tidal, and biomass. The revised clause also covers Battery Energy Storage Systems (BESS), energy storage technologies, and associated infrastructure operations. The company can now engage in manufacturing, trading, joint ventures, partnerships, and other allied activities related to both conventional and renewable energy sources in India and abroad.",
            "Sentiment": "positive",
            "PublishDate": 1758908991216,
            "Source": "corporate_action"
        },
        {
            "Title": "KPI Green Energy Secures INR 3,200 Crore Financing from State Bank of India for 1+ GWp Solar and Hybrid Projects",
            "Summary": "KPI Green Energy Limited has secured a sanction of INR 3,200 crore from State Bank of India for its Solar and Hybrid Independent Power Producer projects totaling over 1 GWp in Gujarat. The financing comprises both fund-based and non-fund based facilities to part-finance two projects: a 250 MW Solar Power Project and a 370 MW Hybrid Power Project comprising 557 MWp solar and 124.20 MW wind components. Both projects are secured by 25-year Power Purchase Agreements with Gujarat Urja Vikas Nigam Limited and are being developed in Bharuch and Surendranagar districts. The projects will be funded with a 75:25 debt-equity ratio. Upon commissioning, these projects will contribute to KP Group's 10 GW target by 2030 and are expected to eliminate over 1.5 million tonnes of CO₂ emissions annually.",
            "Sentiment": "positive",
            "PublishDate": 1758771412358,
            "Source": "stock"
        },
        {
            "Title": "KPI Green Energy Lists India's First Externally Credit-Enhanced Green Bond Worth ₹670 Crore",
            "Summary": "KPI Green Energy Limited has successfully listed its inaugural green bond worth ₹670 crore on the National Stock Exchange of India. The five-year bond carries an annual coupon rate of 8.50% with quarterly amortisation and is supported by a 65% partial guarantee from GuarantCo, which is rated AA− by Fitch and A1 by Moody's. This external credit enhancement enabled AA+(CE) ratings from both CRISIL and ICRA. The bond proceeds will expand KPI Green Energy's solar, wind, and hybrid project portfolio across India, expected to bring clean electricity to approximately 210,000 people and businesses annually while avoiding more than 344,000 tonnes of carbon emissions. The company has developed 1 GW of renewable capacity and targets 10 GW by 2030, with a pipeline exceeding 3 GW. Chairman and Managing Director Dr. Faruk G. Patel stated this milestone reinforces the company's commitment to sustainable energy while diversifying financing routes and supporting UN Sustainable Development Goals.",
            "Sentiment": "positive",
            "PublishDate": 1758167736935,
            "Source": "stock"
        },
        {
            "Title": "KPI Green Launches India's First Credit-Enhanced Green Bond Worth Rs 670 Crore",
            "Summary": "KPI Green Energy Limited launched India's first externally credit-enhanced green bond issue worth Rs 670 crore, listed on the National Stock Exchange. The five-year bond carries an 8.5% annual coupon and is rated AA+(CE) by CRISIL and ICRA, with a 65% guarantee from GuarantCo. The proceeds will fund solar, wind, and hybrid power projects in Gujarat, expected to provide clean power access to nearly 2.1 lakh people annually and reduce over 3.4 lakh tonnes of carbon emissions each year. The transaction is estimated to mobilize around $175 million in domestic capital. KPI Green has developed 1 GW of renewable capacity by FY26 with over 3 GW in the pipeline, targeting 10 GW by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1758004568452,
            "Source": "stock"
        },
        {
            "Title": "KPI Green Energy Raises INR 670 Crores Through Green Bonds with 8.50% Coupon Rate",
            "Summary": "KPI Green Energy Limited allotted 67,000 secured green bonds worth INR 670 crores through private placement. The bonds carry an 8.50% annual coupon rate with a 60-month tenure, maturing on September 11, 2030. The bonds are listed on the National Stock Exchange's Negotiated Trade Reporting Platform. The issue is secured by first ranking charges over the company's power projects totaling 110.7 MW, along with subsidiary projects of 24.7 MW from KPIG Energia Private Limited and 10 MW from KPARK Sunbeat Private Limited. Axis Trustee Services Limited acts as the security trustee. The bonds follow a quarterly repayment schedule with both interest and principal components over the 5-year period.",
            "Sentiment": "positive",
            "PublishDate": 1757592559282,
            "Source": "corporate_action"
        },
        {
            "Title": "KP Green Partners with AhES Co. Ltd. and GH2 Solar Ltd. for 100,000 TPA Green Ammonia Plant in India",
            "Summary": "KP Green has formed a partnership with AhES Co. Ltd. and GH2 Solar Ltd. to build a green ammonia plant in India with a capacity of 100,000 tonnes per annum (TPA). The collaboration involves three companies working together on this green energy infrastructure project.",
            "Sentiment": "positive",
            "PublishDate": 1756876276969,
            "Source": "order&deals"
        },
        {
            "Title": "KPI Green Energy Approves 670 Crore Rupees Private Placement of Secured Green Bonds",
            "Summary": "KPI Green Energy has approved a private placement of secured green bonds worth 670 crore rupees. The company's decision involves issuing these green bonds through private placement to raise capital.",
            "Sentiment": "positive",
            "PublishDate": 1756832313986,
            "Source": "corporate_action"
        },
        {
            "Title": "KPI Green Energy Reports 1.9+ GW Active Assets with 4 GW Pipeline in Development",
            "Summary": "KPI Green Energy, the green energy division of KP Group, has achieved over 1.9 GW in active assets with an additional 4 GW currently in progress. The company has also developed advanced technology capabilities including asset monitoring systems and solar cleaning robots.",
            "Sentiment": "positive",
            "PublishDate": 1756717575067,
            "Source": "stock"
        },
        {
            "Title": "India Considers GST Relief for Solar and Wind Sectors with Potential Grid Fee Waiver Extension",
            "Summary": "India is considering providing GST relief for the solar and wind energy sectors. The government is also exploring the possibility of extending the grid fee waiver for these renewable energy segments.",
            "Sentiment": "positive",
            "PublishDate": 1756370531958,
            "Source": "sectoral"
        },
        {
            "Title": "KPI Green Energy Reports 75% Revenue Growth to Rs 614 Crores in Q1 FY26",
            "Summary": "KPI Green Energy Limited reported strong quarterly results with total revenue of Rs 614 crores, marking 75% growth over Rs 350 crores in the same quarter last year. EBITDA increased 64% to Rs 217 crores, while profit after tax grew 68% to Rs 111 crores. The company achieved its fifth consecutive quarter of highest-ever revenue. KPI Green has three major IPP projects under execution worth Rs 5,000 crores total - a 250 MW solar project, 370 MW hybrid project, and 150 MW wind project, targeting completion by September 2026. The company's portfolio includes 1.7 GW of installed and upcoming IPP capacity and 2.3 GW of CPP capacity. Management maintains revenue growth guidance of 50-70% and expects PAT margins of 15-20%. The company signed strategic MOUs with Delta Electronics for battery energy storage systems, green hydrogen, and EV charging infrastructure. Orders in hand exceed 3 GW with presence across 108 project sites.",
            "Sentiment": "positive",
            "PublishDate": 1755012957653,
            "Source": "earnings"
        },
        {
            "Title": "KPI Green Energy Subsidiary Secures 96 MWp Solar Project Contract from Aditya Birla Renewables",
            "Summary": "KPIG Energia Private Limited, a wholly owned subsidiary of KPI Green Energy Limited, has received a Letter of Award from Aditya Birla Renewables Limited for a 64 MWac/96 MWp Solar Balance of System Power Plant project in Mahua, Gujarat. The project scope includes design, engineering, procurement, supply, transportation, insurance, erection, testing, synchronization, and commissioning. KPI Green Energy states this order aligns with their strategic roadmap toward achieving their long-term target of 10 GW by 2030. The contract represents continued trust in the company's execution capabilities for large-scale renewable infrastructure projects.",
            "Sentiment": "positive",
            "PublishDate": 1754472372354,
            "Source": "order&deals"
        },
        {
            "Title": "KPI Green Energy Receives Award Letter for 64 MWAC Solar Project from Aditya Birla Renewables",
            "Summary": "KPI Green Energy has received an award letter from Aditya Birla Renewables for a solar project with capacity of 64 MWAC / 96 MWP. This project award represents a business development for the renewable energy company.",
            "Sentiment": "positive",
            "PublishDate": 1754471513713,
            "Source": "stock"
        },
        {
            "Title": "KPI Green Energy Reports Record Q1 FY2026 Results, Declares Interim Dividend and Approves ₹700 Crore Green Bond Fundraise",
            "Summary": "KPI Green Energy Limited announced its Q1 FY2025-26 financial results, achieving record-breaking performance for the fifth consecutive quarter. Total revenue increased 75% to ₹614.12 crore from ₹349.85 crore year-over-year. EBITDA grew 64% to ₹216.90 crore from ₹132.45 crore, while Profit After Tax rose 68% to ₹111.32 crore from ₹66.11 crore. The Board declared a first interim dividend of Re. 0.20 per equity share (4% on face value of Rs. 5) and approved raising up to ₹700 crores through green bonds via private placement. Key developments included securing a 150 MW wind power project LOI from GUVNL, signing three MoUs with Delta Electronics India for battery storage, green hydrogen and solar inverter collaboration, and subsidiary Sun Drops Energia receiving a 100 MW solar project order from Avichal Power. The company was also featured in an IBM global case study for digital platform adoption across over 70 sites.",
            "Sentiment": "positive",
            "PublishDate": 1754366594333,
            "Source": "corporate_action"
        },
        {
            "Title": "KPI Green Reports 57% Jump in Q1 Net Profit, Board Approves Rs 7 Billion Fundraising",
            "Summary": "KPI Green reported consolidated net profit of Rs 1.04 billion for Q1, compared to Rs 661 million in the same period last year, marking a 57% increase. The company's revenue grew significantly to Rs 6.03 billion from Rs 3.5 billion year-over-year, representing a 72% rise. Additionally, the company's board has approved raising funds up to Rs 7 billion through the issuance of Non-Convertible Debentures (NCDs).",
            "Sentiment": "positive",
            "PublishDate": 1754366223408,
            "Source": "earnings"
        }
    ]
}