{
    "Symbol": "KPIL",
    "ISIN": "INE220B01022",
    "News": [
        {
            "Title": "Kalpataru Projects Q3 Net Profit Rises 7% YoY",
            "Summary": "Kalpataru Projects International reports consolidated net profit of 1.52 billion rupees in Q3, marking a 7% increase from 1.42 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1770203358714,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kalpataru Projects Board Meet Set for Feb 4, 2026",
            "Summary": "Kalpataru Projects International schedules board meeting on February 04, 2026 to approve Q3FY26 unaudited financial results. Trading window closed until 48 hours post-results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1769587843565,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kalpataru Projects Gets Tax Relief from ITAT",
            "Summary": "Income Tax Appellate Tribunal Mumbai deletes tax disallowances for Assessment Years 2018-19, 2019-20, and 2020-21, reducing company's tax demand to nil following favorable order.",
            "Sentiment": "positive",
            "PublishDate": 1769586284409,
            "Source": "stocks"
        },
        {
            "Title": "KPIL Faces ₹26.91 Lakh VAT Penalty in Dominica",
            "Summary": "Kalpataru Projects International receives penalty from Inland Revenue Division, Dominica for delayed VAT payments in April-May 2025. Company files objection against XCD 79,367 penalty.",
            "Sentiment": "negative",
            "PublishDate": 1769183134356,
            "Source": "stocks"
        },
        {
            "Title": "KPIL Completes Sale of Vindhyachal Expressway Stake",
            "Summary": "Kalpataru Projects International has successfully completed the sale of its 100% equity stake in Vindhyachal Expressway Private Limited to Actis for Rs. 775 crores enterprise value.",
            "Sentiment": "positive",
            "PublishDate": 1767797948373,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kalpataru Projects shares gain after ₹719 crore order win",
            "Summary": "Kalpataru Projects International shares rose 1% after winning ₹719 crore orders including Thane Metro rail project, strengthening urban infrastructure presence despite recent payment delays.",
            "Sentiment": "positive",
            "PublishDate": 1767237438428,
            "Source": "co_actions_results"
        },
        {
            "Title": "KPIL Faces ₹1.51 Cr GST Penalty Order",
            "Summary": "Kalpataru Projects International receives GST penalty order of ₹1.51 crores for alleged excess ITC availment and short tax payment during FY2019-23. Company plans to appeal the decision.",
            "Sentiment": "negative",
            "PublishDate": 1767101403609,
            "Source": "stocks"
        },
        {
            "Title": "Kalpataru Projects Pays ₹20.67 Lakh Penalty Fee",
            "Summary": "Kalpataru Projects International paid a penalty of ₹20.67 lakhs to Gujarat Industrial Development Corporation for building plan approval related to administrative construction observations.",
            "Sentiment": "neutral",
            "PublishDate": 1766564088083,
            "Source": "stocks"
        },
        {
            "Title": "Kalpataru Projects UAE Branch Fined AED 284,000",
            "Summary": "Kalpataru Projects International's UAE branch has been fined AED 284,000 by UAE authorities. The infrastructure company disclosed this regulatory penalty affecting its Middle East operations.",
            "Sentiment": "negative",
            "PublishDate": 1766490582347,
            "Source": "stocks"
        },
        {
            "Title": "Kalpataru Projects Promoter Creates ₹8.66 Cr Pledge",
            "Summary": "Sunita Choraria pledges 1.5 lakh equity shares worth ₹17.33 crores against loan facility of ₹40 crores from Tata Capital for general corporate purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1765446746584,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kalpataru Projects Gets ESG Rating of 60 from CFC",
            "Summary": "Kalpataru Projects International receives an ESG rating of 60 from SEBI-registered CFC Finlease Private Limited. The rating was assigned independently based on publicly available information without company engagement.",
            "Sentiment": "neutral",
            "PublishDate": 1765446120103,
            "Source": "stocks"
        },
        {
            "Title": "Kalpataru Projects Faces Tunisia Social Security Penalty",
            "Summary": "Kalpataru Projects International receives penalty of TND 134,446 (₹41.08 lakhs) from Tunisia's CNSS for additional social security contributions covering July 2022 to June 2025 period.",
            "Sentiment": "negative",
            "PublishDate": 1765385390320,
            "Source": "stocks"
        },
        {
            "Title": "Kalpataru Projects Wins ₹2,003 Cr Orders",
            "Summary": "Kalpataru Projects International secures new orders worth ₹2,003 crores for buildings, factories in India, and power transmission & distribution projects. Year-to-date order intake reaches ₹17,000 crores.",
            "Sentiment": "positive",
            "PublishDate": 1765375896693,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kalpataru Projects Secures ₹2,003 Crores in New Contracts Across Buildings, Factories, and Power Sectors",
            "Summary": "Kalpataru Projects International Limited has secured new contracts worth ₹2,003 crores focusing on buildings, factories, and power transmission & distribution segments. The company's year-to-date order intake has reached ₹17,000 crores, strengthening its project pipeline and revenue visibility.",
            "Sentiment": "positive",
            "PublishDate": 1765339568947,
            "Source": "order&deals"
        },
        {
            "Title": "Kalpataru Projects International Receives ESG Rating of 67 from NSE Sustainability",
            "Summary": "NSE Sustainability Ratings & Analytics Limited assigned an Environmental, Social, and Governance (ESG) rating of 67 to Kalpataru Projects International Limited for FY2025. The rating was assigned independently by NSE Sustainability based on publicly available information without the company's engagement.",
            "Sentiment": "neutral",
            "PublishDate": 1765291187495,
            "Source": "stock"
        },
        {
            "Title": "Kalpataru Projects International Eliminates INR 2.12 Crore GIDC Penalty Through Corrigendum Orders",
            "Summary": "Kalpataru Projects International has successfully reduced its aggregate penalty to nil after Gujarat Industrial Development Corporation issued a second corrigendum order, following earlier penalties of INR 2.12 crores plus GST for alleged non-fulfillment of ground coverage construction requirements. The company received the final corrigendum order on December 6, 2025, completely eliminating what was originally a substantial financial liability related to leased land plots in Gandhinagar.",
            "Sentiment": "positive",
            "PublishDate": 1765195504205,
            "Source": "stock"
        },
        {
            "Title": "Kalpataru Projects International Faces Tax Fine of ₹71.1 Million",
            "Summary": "Tax authorities have ordered Kalpataru Projects International to pay a fine of ₹71.1 million. The penalty affects the infrastructure company's financial obligations and regulatory compliance status.",
            "Sentiment": "negative",
            "PublishDate": 1764950016653,
            "Source": "stock"
        },
        {
            "Title": "Kalpataru Projects International Wins Appeal Against Customs Duty Demand",
            "Summary": "The Appellate Authority allowed Kalpataru Projects International's appeal and deleted majority of the customs duty demand of INR 83.40 lakhs along with interest and penalties that were imposed for alleged misclassification of imported goods for F.Y. 2016-17 to F.Y. 2019-20. Only a balance demand of INR 11 lakhs has been remanded back to the Original Adjudicating Authority for adjudication.",
            "Sentiment": "positive",
            "PublishDate": 1764230253199,
            "Source": "stock"
        },
        {
            "Title": "Kalpataru Projects International Fined AED 284,000 by UAE Authorities for Rule Violations",
            "Summary": "Kalpataru Projects International has been penalized with a fine of AED 284,000 by UAE authorities for not following rules. The specific nature of the rule violations has not been detailed.",
            "Sentiment": "negative",
            "PublishDate": 1762955069730,
            "Source": "stock"
        },
        {
            "Title": "Kalpataru Q2 Net Profit Drops 82% to 54M Rupees Despite 58% Revenue Growth",
            "Summary": "Kalpataru reported consolidated net profit of 54 million rupees in Q2, down from 301 million rupees in the same quarter last year. The company's revenue increased to 7.9 billion rupees compared to 5 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762789252492,
            "Source": "earnings"
        },
        {
            "Title": "Kalpataru Projects International Raises FY26 Revenue Growth Target to 25%",
            "Summary": "Kalpataru Projects International has increased its revenue growth prediction for FY26 to 25%, up from its previous guidance of 20%. The company is targeting ₹25,000 crore in order inflow by year-end.",
            "Sentiment": "positive",
            "PublishDate": 1761994649313,
            "Source": "stock"
        },
        {
            "Title": "Kalpataru Projects International Extends Bank Guarantee Period and Appoints New Senior Management Personnel",
            "Summary": "Kalpataru Projects International Limited's Board of Directors approved two key decisions. The company extended the validity period for providing Counter Bank Guarantees not exceeding USD 10 Million to lenders of its subsidiary Kalpataru IBN Omairah Company Limited until September 30, 2027. The guarantees are provided in favor of lenders including Saudi British Bank, which has provided bank guarantees to KIOCL's clients. Additionally, the Board appointed Mr. Sriram Pechiappan as President-Group Assurance and designated him as Senior Management Personnel, effective from October 31, 2025. Pechiappan holds degrees in Commerce and is a Chartered Accountant and Cost and Works Accountant with over 27 years of experience in Finance and Internal Audit across various leading organizations including Reliance Industries Limited, Asian Paints Limited, and PwC.",
            "Sentiment": "neutral",
            "PublishDate": 1761902824582,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kalpataru Projects International Reports Order Book of ₹64,682 Crores",
            "Summary": "Kalpataru Projects International announced an order book worth ₹64,682 crores as of September 30, 2025. The company described this order book as robust.",
            "Sentiment": "positive",
            "PublishDate": 1761902463288,
            "Source": "stock"
        },
        {
            "Title": "Kalpataru Projects International Reports 92% Jump in Q2 Net Profit to 2.4B Rupees",
            "Summary": "Kalpataru Projects International reported quarterly net profit of 2.4 billion rupees compared to 1.25 billion rupees in the same period last year. Revenue increased to 65.3 billion rupees from 49 billion rupees year-over-year. EBITDA rose to 5.61 billion rupees from 4.38 billion rupees, though EBITDA margin slightly declined to 8.60% from 8.88% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761901462301,
            "Source": "earnings"
        },
        {
            "Title": "Kalpataru Projects International Secures New Orders Worth ₹2,332 Crores",
            "Summary": "Kalpataru Projects International Limited (KPIL) and its international subsidiaries have secured new orders worth approximately ₹2,332 crores. The orders include Power Transmission & Distribution projects in overseas markets and Buildings and Factories business in India. MD & CEO Manish Mohnot stated that cumulative order inflows in FY26 are nearing ₹15,000 crores, representing approximately 25% year-on-year growth. The company highlighted that these order wins strengthen its leadership position in the international T&D market and expand its presence in India's civil construction market. KPIL is described as one of the largest specialized EPC companies operating across multiple sectors including power transmission, buildings, water supply, railways, and infrastructure, with operations in over 30 countries.",
            "Sentiment": "positive",
            "PublishDate": 1761193022593,
            "Source": "order&deals"
        },
        {
            "Title": "K C Holdings Creates Pledge on 25.6 Lakh Shares, Releases Pledge on 13.1 Lakh Shares of Kalpataru Projects",
            "Summary": "K C Holdings Private Limited has created a pledge over 25,55,555 shares and released a pledge over 13,11,111 shares of Kalpataru Projects International Limited. The pledge creation relates to a Rs. 125 crore facility availed by Abacus Real Estate Private Limited from Tata Capital Limited. The pledge release involves facilities from Tata Capital Limited that were fully repaid by Abacus Real Estate Private Limited (Rs. 65 crores) and Ardour Properties Private Limited (Rs. 50 crores). K C Holdings holds 5,72,43,787 shares representing 33.52% of Kalpataru Projects' total share capital. The encumbered shares represent 8.24% of total share capital. The borrowed amounts are being utilized for general corporate purposes including refinancing existing facilities and extending inter-corporate deposits to group companies.",
            "Sentiment": "neutral",
            "PublishDate": 1760763974406,
            "Source": "corporate_action"
        },
        {
            "Title": "Kalpataru Reports Strong Q2 FY26 Performance with 19% Pre-Sales Growth",
            "Summary": "Kalpataru reported pre-sales growth of 19% year-over-year for Q2 FY26. The company also achieved a 37% year-over-year increase in collections during the same period.",
            "Sentiment": "positive",
            "PublishDate": 1760613532094,
            "Source": "stock"
        },
        {
            "Title": "Kalpataru Projects' Subsidiary Settles Road Project Arbitration Dispute",
            "Summary": "Vindhyachal Expressway Private Limited, a wholly owned subsidiary of Kalpataru Projects International Limited, executed a Settlement Agreement to resolve disputes related to an arbitration award for a road project. The arbitration award was pronounced in favor of VEPL and covered other inter se disputes. The settlement was reached under Section 73 of the Arbitration and Conciliation Act, 1996. The company received intimation of the Settlement Agreement on September 24th, 2025 at approximately 7:50 PM.",
            "Sentiment": "positive",
            "PublishDate": 1758804961110,
            "Source": "stock"
        },
        {
            "Title": "K C Holdings Creates and Releases Pledges on 2 Lakh Kalpataru Projects Shares",
            "Summary": "K C Holdings Private Limited has created and released pledges over 2,00,000 equity shares each of Kalpataru Projects International Limited. The company maintains multiple pledge arrangements across various facilities totaling over Rs. 900 crores with different lenders including JM Financial Credit Solutions, Aditya Birla Capital, Tata Capital, and others. These pledges are primarily for general corporate purposes and refinancing existing group debts. The pledged shares are used as security for loans availed by various group companies including Kalpataru Constructions Private Limited, Kalpataru Land Private Limited, and other related entities. The facilities range from Rs. 12 crores to Rs. 144 crores across different borrowing arrangements.",
            "Sentiment": "neutral",
            "PublishDate": 1758694100955,
            "Source": "corporate_action"
        },
        {
            "Title": "Kalpataru Projects Receives Tax Relief as ITAT Cancels ₹81.53 Crore Demand",
            "Summary": "Kalpataru Projects secured a favorable ruling from the Income Tax Appellate Tribunal (ITAT) which cancelled a tax demand of ₹81.53 crore for Assessment Year 2019-20. The company is now eligible for a refund of ₹7.35 crore following this decision.",
            "Sentiment": "positive",
            "PublishDate": 1758281712657,
            "Source": "stock"
        },
        {
            "Title": "Kalpataru Projects International Faces Upheld GST Penalty of INR 3.72 Crores, Plans Higher Court Appeal",
            "Summary": "Kalpataru Projects International Limited received an unfavorable order from the Appellate Authority upholding a GST demand of INR 3.72 crores in penalties. The dispute stems from a mismatch in Input Tax Credit (ITC) availed in GSTR-3B and ITC available in GSTR-2A for F.Y. 2017-18. The GST Authority had originally demanded GST amount of INR 3.72 crores along with penalty of INR 3.72 crores, plus applicable interest. The company had initially filed an appeal against the GST Authority's order from December 2023, but the Appellate Authority upheld the original decision. The company received the Appellate Authority's order on September 11, 2025. Kalpataru Projects maintains it has strong grounds for defense, stating the order was issued without considering the company's reply and documentary evidence. The company plans to file a further appeal to a higher appellate authority within prescribed timelines. The company previously stated that the tax and penalty do not have significant impact on its operations.",
            "Sentiment": "negative",
            "PublishDate": 1757674482145,
            "Source": "stock"
        },
        {
            "Title": "Kalpataru Projects International Secures New Orders Worth ₹2,720 Crores",
            "Summary": "Kalpataru Projects International has announced new orders totaling ₹2,720 crores. The orders span across power transmission & distribution and buildings & factories sectors.",
            "Sentiment": "positive",
            "PublishDate": 1757561442520,
            "Source": "order&deals"
        },
        {
            "Title": "Kalpataru Projects International Sees Block Trade Worth Rs. 88.89 Crores on NSE",
            "Summary": "Kalpataru Projects International executed a block trade on the National Stock Exchange involving approximately 702,948 shares at a price of Rs. 1,264.50 per share. The total transaction value amounted to Rs. 88.89 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1757496796212,
            "Source": "order&deals"
        },
        {
            "Title": "Kalpataru Projects International Uploads Earnings Call Transcript for Quarter Ended June 30, 2025",
            "Summary": "Kalpataru Projects International Limited has uploaded the transcript of their earnings conference call held on August 8, 2025, discussing the unaudited financial results for the quarter ended June 30, 2025. The conference call was conducted at 09:00 a.m. (IST) and covered both consolidated and standalone financial results. The transcript has been made available on the company's website under the investors section. Company Secretary Shweta Girotra signed the notification to stock exchanges BSE and NSE on August 13, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755096040794,
            "Source": "earnings"
        },
        {
            "Title": "Kalpataru Projects Raises FY26 Revenue Growth Guidance to 25% from 20%",
            "Summary": "Kalpataru Projects International expects to increase its FY26 revenue growth guidance from 20% to 25%, driven by strong execution momentum. The company reported its best quarterly results with 35% revenue growth and maintains a healthy order book exceeding Rs 65,000 crore. Director Amit Uplenchwar highlighted the company's strong financial metrics, including net working capital days under 100 and debt-to-equity ratio below 0.47 on consolidated basis. The company targets improving profit before tax margin from last year's 4.5% to 5.5% by FY26. Quarterly consolidated revenue rose 35% to Rs 6,171 crore, EBITDA grew 39% to Rs 525 crore with 8.5% margin, and profit after tax surged 154% to Rs 214 crore. The stock gained 5.13% to close at Rs 1,170.",
            "Sentiment": "positive",
            "PublishDate": 1754794398901,
            "Source": "stock"
        },
        {
            "Title": "Kalpataru Projects Reports 35% Revenue Growth with ₹65,475 Crore Order Book",
            "Summary": "Kalpataru Projects has achieved a 35% year-over-year revenue increase and maintains an order book worth ₹65,475 crore. The company is pursuing global expansion plans and considering an IPO for its Swedish unit while targeting major infrastructure opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1754579173534,
            "Source": "stock"
        },
        {
            "Title": "Kalpataru Projects International Reports Strong Q1 Growth with Revenue Up 35% and Net Profit More Than Doubling",
            "Summary": "Kalpataru Projects International delivered strong quarterly results with revenue rising to 62 billion rupees from 45.87 billion rupees year-over-year. Net profit more than doubled to 2.14 billion rupees compared to 930 million rupees in the same period last year. EBITDA increased to 5.25 billion rupees from 3.78 billion rupees, while EBITDA margin improved to 8.51% from 8.24% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754563193004,
            "Source": "earnings"
        },
        {
            "Title": "Kalpataru Projects' Subsidiary Receives Termination Notice from NHAI Over Premium Payment Dispute",
            "Summary": "Wainganga Expressway Private Limited, a wholly owned subsidiary of Kalpataru Projects International Limited, received a Termination Notice from the National Highways Authority of India on August 1, 2025, alleging default in premium payment. The dispute stems from an ongoing contractual disagreement where both parties have issued termination notices to each other. WEPL had previously received a favorable arbitration award dated July 31, 2024, which addressed similar issues raised by NHAI. The company believes the demand for premium contradicts the principles established by this arbitration award. NHAI has also claimed INR 351.46 crores, which WEPL is disputing. The Concession Agreement was terminated effective July 15, 2025, following WEPL's termination notice to NHAI for various contractual defaults. Based on external legal advisers' views, the company maintains it has a favorable legal position and expects no significant financial implications.",
            "Sentiment": "neutral",
            "PublishDate": 1754312917902,
            "Source": "stock"
        },
        {
            "Title": "Kalpataru Projects International Receives Major Relief in Income Tax Appeals for Multiple Assessment Years",
            "Summary": "Kalpataru Projects International Limited received favorable orders from the Commissioner of Income Tax (Appeals) for multiple assessment years from 2013-14 to 2020-21. The CIT(A) deleted most additions made by the Deputy Commissioner of Income Tax and significantly reduced tax demands. For assessment years 2013-14 to 2015-16 and 2017-18, the tax demand was reduced by INR 1.57 crore with the company becoming eligible for a refund of INR 0.19 crore. For assessment years 2018-19 to 2020-21, most additions were deleted with significant demand reduction expected. Additionally, a rectification order reduced the demand for assessment year 2016-17 from INR 95.83 crores to nil. The company plans to appeal remaining matters to higher authorities and expects no significant financial impact based on legal advice. These developments follow initial re-assessment orders that had raised aggregate demands of INR 141.31 crores for assessment years 2013-14 to 2020-21, stemming from a search conducted in August 2023.",
            "Sentiment": "positive",
            "PublishDate": 1754048062677,
            "Source": "stock"
        },
        {
            "Title": "Kalpataru Projects International Receives 'Adequate' ESG Rating from Crisil",
            "Summary": "Kalpataru Projects International Limited received an ESG rating of 'Crisil ESG 55' with an 'Adequate' classification from Crisil ESG Ratings & Analytics Limited. The rating was assigned independently without the company's engagement, based on fiscal 2025 disclosures and publicly available data. The company was notified of the rating via email on July 25, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753458815234,
            "Source": "stock"
        },
        {
            "Title": "K C Holdings Submits Revised Disclosure for Share Pledge Creation Worth Rs 75 Crores",
            "Summary": "K C Holdings Private Limited submitted a revised disclosure to stock exchanges regarding the creation of pledge over 14,81,425 equity shares of Kalpataru Projects International Limited. The revision corrected formatting errors in the previous filing dated July 21, 2025, which had made certain details about encumbrance invisible. The pledge was created against a Rs 75 crores facility availed by Kalpataru Properties (Thane) Private Limited from Aditya Birla Capital Ltd, with the shares pledged on July 17, 2025. The disclosure also provides comprehensive details of multiple existing share pledges across various facilities ranging from Rs 30 crores to Rs 144 crores with different financial institutions including Bajaj Finance, Tata Capital, and others. The pledged shares represent 0.87% of total share capital and are valued at Rs 176.32 crores on the agreement date.",
            "Sentiment": "neutral",
            "PublishDate": 1753420826254,
            "Source": "corporate_action"
        },
        {
            "Title": "Kalpataru Projects Extends $15 Million Standby Letter of Credit for Subsidiary Until December 2025",
            "Summary": "Kalpataru Projects International Limited has extended the validity of a Standby Letter of Credit (SBLC) worth USD 15 million for its subsidiary, Kalpataru IBN Omairah Company Limited, until December 31, 2025. The SBLC is provided in favor of HSBC Bank Middle East Limited, which has extended credit facilities to the subsidiary. The company stated that promoter and group companies have no interest in this transaction, and the SBLC represents a contingent liability with no current impact on the company's operations.",
            "Sentiment": "neutral",
            "PublishDate": 1753368676854,
            "Source": "stock"
        },
        {
            "Title": "K C Holdings Creates Fresh Pledge of 14.81 Lakh KPIL Shares Worth Rs 176 Crore",
            "Summary": "K C Holdings Private Limited has pledged 14,81,425 equity shares of Kalpataru Projects International Limited valued at Rs 176.32 crore against a Rs 75 crore facility from Aditya Birla Capital Ltd. The pledge was created on July 17, 2025, for Kalpataru Properties (Thane) Private Limited's borrowing needs for general corporate purposes. The company disclosed details of 20 existing encumbrances on KPIL shares across multiple lenders including JM Financial, Tata Capital, Bajaj Finance, and others, with total facilities ranging from Rs 30 crore to Rs 144 crore. These pledges support various group entities' borrowing requirements for purposes including refinancing existing debts, working capital, real estate business, and general corporate needs. The pledged shares represent 0.87% of KPIL's total share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1753162140611,
            "Source": "corporate_action"
        },
        {
            "Title": "Kalpataru Projects International Ltd: Secures New Orders Worth ₹2,293 Crore",
            "Summary": "Kalpataru Projects International Ltd and its international subsidiaries have won new orders worth ₹2,293 crore in India and overseas markets. The company's order intake for FY26 has reached ₹9,443 crore. The stock was up 3.3% at ₹1,237 per share on July 17.",
            "Sentiment": "positive",
            "PublishDate": 1752726351000,
            "Source": "order&deals"
        },
        {
            "Title": "Kalpataru Projects International Limited: Secures Rs 989 Crore Overseas Power T&D Orders",
            "Summary": "Kalpataru Projects International Limited (KPIL) and its international subsidiaries have secured new orders and notifications of awards worth approximately Rs 989 crore in the overseas power transmission and distribution (T&D) segment.",
            "Sentiment": "positive",
            "PublishDate": 1751340793000,
            "Source": "order&deals"
        },
        {
            "Title": "Kalpataru Projects Secures ₹989 Crore T&D Orders in Overseas Markets",
            "Summary": "Kalpataru Projects has secured new Transmission & Distribution (T&D) orders worth ₹989 crore in overseas markets. The company did not provide specific details about the locations or nature of these projects.",
            "Sentiment": "positive",
            "PublishDate": 1751328360000,
            "Source": "default"
        },
        {
            "Title": "Kalpataru Projects International: Secures Rs 989 Crore in New Orders",
            "Summary": "Kalpataru Projects International Ltd. has won new orders worth Rs 989 crore in the power transmission and distribution and civil infrastructure sector from overseas markets. This brings the company's total order intake for FY2026 to Rs 7,150 crore.",
            "Sentiment": "positive",
            "PublishDate": 1751295457000,
            "Source": "order&deals"
        },
        {
            "Title": "Kalpataru Projects Secures ₹989 Crore T&D Contracts Internationally",
            "Summary": "Kalpataru Projects has secured new Transmission & Distribution (T&D) contracts worth ₹989 crore in international markets. The company has not provided specific details about the locations or nature of these contracts.",
            "Sentiment": "positive",
            "PublishDate": 1751288521000,
            "Source": "default"
        },
        {
            "Title": "NHAI Issues Termination Notice to Kalpataru Projects Subsidiary",
            "Summary": "The National Highways Authority of India (NHAI) has sent a termination notice to Wainganga Expressway Private Limited (WEPL), a subsidiary of Kalpataru Projects. The notice demands payment of ₹3.51 billion from WEPL.",
            "Sentiment": "negative",
            "PublishDate": 1751039119000,
            "Source": "default"
        },
        {
            "Title": "Kalpataru Projects International Targets Order Book Growth and Reports EBITDA Margin",
            "Summary": "Kalpataru Projects International has announced plans to achieve an order book range of ₹28,000-30,000 crores by FY26. The company also reports that its current EBITDA margin stands at 9.11%.",
            "Sentiment": "positive",
            "PublishDate": 1749446592000,
            "Source": "default"
        }
    ]
}