{
    "Symbol": "KPITTECH",
    "ISIN": "INE04I401011",
    "News": [
        {
            "Title": "KPIT Technologies announces postal ballot for director appointment",
            "Summary": "KPIT Technologies Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Parag Shah as an Independent Director for a three-year term from January 29, 2026 to January 28, 2029.",
            "Sentiment": "neutral",
            "PublishDate": 1769796500775,
            "Source": "stocks"
        },
        {
            "Title": "KPIT Technologies Q3FY26 Results & Rs 2.25 Dividend",
            "Summary": "KPIT Technologies announced Q3FY26 quarterly results and declared interim dividend of Rs 2.25 per share with record date February 4, 2026. Board also appointed Parag Shah as Independent Director.",
            "Sentiment": "positive",
            "PublishDate": 1769670033610,
            "Source": "co_actions_results"
        },
        {
            "Title": "KPIT & 6 Stocks to Gain from 2027 ADAS Mandate",
            "Summary": "India's 2027 mandate making ADAS and DDAWS compulsory in commercial vehicles creates opportunities for auto-tech companies like KPIT, Tata Elxsi, and Bosch in safety software and electronics.",
            "Sentiment": "positive",
            "PublishDate": 1768922459075,
            "Source": "stocks"
        },
        {
            "Title": "KPIT Technologies Independent Director B V R Subbu Steps Down",
            "Summary": "KPIT Technologies announces cessation of Independent Director Mr. B V R Subbu effective January 15, 2026, following completion of his second term as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1768483546479,
            "Source": "stocks"
        },
        {
            "Title": "KPIT Technologies Stock Falls 35% Amid Growth Slowdown",
            "Summary": "KPIT Technologies faces 35% stock decline due to revenue growth deceleration from 44.77% in FY24 to 19.93% in FY25, impacted by US-China tariff tensions and delayed client spending in automotive software sector.",
            "Sentiment": "negative",
            "PublishDate": 1767938128062,
            "Source": "stocks"
        },
        {
            "Title": "KPIT Technologies Promoter Ajay Bhagwat Sells Equity Shares in Open Market",
            "Summary": "Ajay Bhagwat, a promoter of KPIT Technologies Limited, disposed of 4,547 equity shares through open market sale on December 5, 2025. Following the transaction, Bhagwat's shareholding decreased to 22,60,037 shares, maintaining his 0.84% stake in the company's total voting capital.",
            "Sentiment": "neutral",
            "PublishDate": 1765253240617,
            "Source": "corporate_action"
        },
        {
            "Title": "KPIT Technologies Pays USD 40 Million as First Deferred Payment for Caresoft Acquisition",
            "Summary": "KPIT Technologies (UK) Limited has paid USD 40 million towards the First Deferred Consideration Payment for the Caresoft acquisition as per the Definitive Agreements. This follows the company's earlier acquisition of Caresoft entities for a total consideration of up to USD 157 million, with initial payments of USD 51 million and USD 6 million already completed.",
            "Sentiment": "positive",
            "PublishDate": 1763538858706,
            "Source": "order&deals"
        },
        {
            "Title": "KPIT Technologies Promoter Ajay Bhagwat Sells 41,000 Shares in Open Market",
            "Summary": "Ajay Bhagwat, a promoter of KPIT Technologies Limited, disposed of 41,000 equity shares representing 0.01% of the company's total voting capital through open market sale on November 17, 2025. Following the transaction, Bhagwat's shareholding decreased from 0.85% to 0.84% of the company's total equity share capital of 27,41,43,808 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763467366611,
            "Source": "corporate_action"
        },
        {
            "Title": "S.B. (Ravi) Pandit Acquires Additional Shares in KPIT Technologies",
            "Summary": "S.B. (Ravi) Pandit acquired 41,000 equity shares of KPIT Technologies Limited through open market transactions, increasing his shareholding from 9,89,306 shares (0.36%) to 10,30,306 shares (0.37%). The acquisition was disclosed under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1763462040985,
            "Source": "corporate_action"
        },
        {
            "Title": "KPIT Technologies Increases Stake in N-Dream AG to 90% for €2.82 Million",
            "Summary": "KPIT Technologies has increased its ownership stake in N-Dream AG to 90% through a €2.82 million investment. The acquisition aims to strengthen the company's position in automotive gaming and cockpit experience technologies.",
            "Sentiment": "neutral",
            "PublishDate": 1763431116542,
            "Source": "earnings"
        },
        {
            "Title": "KPIT Technologies Promoter Ajay Bhagwat Sells 49,000 Equity Shares",
            "Summary": "Ajay Bhagwat, a promoter of KPIT Technologies Limited, disposed of 49,000 equity shares through open market sale, reducing his shareholding from 0.86% to 0.85% of the company's total voting capital. The transaction affects the promoter group's stake in the IT company, with the sale completed and disclosed to stock exchanges BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1763106877847,
            "Source": "corporate_action"
        },
        {
            "Title": "KPIT Technologies Promoter Kishor Patil Acquires Additional 40,000 Equity Shares",
            "Summary": "Kishor Patil, promoter of KPIT Technologies Limited, purchased 40,000 equity shares through open market transactions, increasing his shareholding from 4.87% to 4.88%. The acquisition was disclosed under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1763102405237,
            "Source": "corporate_action"
        },
        {
            "Title": "KPIT Tech Forecasts Steady Growth for Q3 FY26, Significant Recovery Expected in Q4",
            "Summary": "KPIT Tech management expects steady to slight growth in Q3 FY26 while maintaining stable EBITDA margins despite rising costs. The company anticipates significant growth recovery in Q4 FY26, though not a sharp increase. Management has maintained its EBITDA guidance at 21% for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1762832755000,
            "Source": "stock"
        },
        {
            "Title": "KPIT Technologies Approves Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "KPIT Technologies' Board of Directors approved unaudited consolidated and standalone financial results for the quarter and half year ended September 30, 2025. The board meeting was held on November 10, 2025, from 9:15 AM to 12:30 PM IST. The company's statutory auditor issued an unqualified opinion on the financial results. The results, along with limited review reports and investor updates, have been submitted to BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1762786445571,
            "Source": "earnings"
        },
        {
            "Title": "KPIT Technologies Reports Mixed Q2 Results with Revenue Growth but Profit Below Estimates",
            "Summary": "KPIT Technologies reported quarterly revenue of 15.9 billion rupees, up from 15.4 billion rupees in the previous quarter and exceeding estimates of 15.6 billion rupees. The company's consolidated net profit remained flat at 1.7 billion rupees compared to the previous quarter, falling short of the estimated 2.08 billion rupees. EBIT increased to 2.46 billion rupees from 2.4 billion rupees quarter-over-quarter, though it missed the estimate of 2.65 billion rupees. The EBIT margin improved to 15.5% from 15% in the previous quarter but was below the estimated 16.99%.",
            "Sentiment": "neutral",
            "PublishDate": 1762759520828,
            "Source": "earnings"
        },
        {
            "Title": "KPIT Technologies Secures €20M and £20M Credit Lines for Strategic Acquisitions",
            "Summary": "KPIT Technologies has secured unsecured loan facilities totaling €20 million from HSBC and £20 million from SMBC to fund merger and acquisition activities. The financing will support the company's acquisition of CareSoft and investments in N-Dream AG and Helm.AI as part of its expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1761630790048,
            "Source": "order&deals"
        },
        {
            "Title": "KPIT Technologies Completes Acquisition of OXI SRL Italy for USD 6 Million",
            "Summary": "KPIT Technologies Limited has completed the acquisition of OXI SRL Italy for USD 6 million through its subsidiary KPIT Technologies (UK) Limited, acquiring 100% equity shares. This acquisition is part of KPIT's larger Caresoft entities acquisition, which was renegotiated from an initial consideration of USD 191 million to USD 157 million, including USD 15 million variable pay based on revenue and business synergy milestones. Previously, KPIT had paid USD 51 million for acquiring Caresoft subsidiaries in the USA, UK, and Mexico. The company had infused EURO 28 million and USD 28 million into its UK and USA subsidiaries respectively to facilitate these transactions.",
            "Sentiment": "positive",
            "PublishDate": 1760107955498,
            "Source": "order&deals"
        },
        {
            "Title": "KPIT Technologies Shares Rise 0.56% Despite Goldman Sachs Target Price Cut",
            "Summary": "KPIT Technologies shares traded at ₹1,159.70 on NSE, up 0.56% from the previous close of ₹1,153.20. The stock touched an intraday high of ₹1,160.60 and low of ₹1,142.00, with trading volume of 5.38 lakh shares worth ₹61.96 crore. The company clarified that recent stock price movements appear market-driven and management is not associated with these fluctuations. KPIT confirmed no changes to business strategy or medium-term outlook beyond communications from July 30 investor call and August 12 Annual General Meeting. The stock has declined 19.02% over three months. Goldman Sachs maintained a neutral rating while cutting the target price 10.56% to ₹1,100 from ₹1,230, citing weaker near-term revenue growth and slower new contract ramp-up. The brokerage expects quarterly organic revenue to decline approximately 2% in constant currency and revised downward earnings per share estimates for FY26, FY27, and FY28 by 9%, 15%, and 16% respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1759486075039,
            "Source": "stock"
        },
        {
            "Title": "KPIT Technologies Shares Plunge 8% in Worst Single-Day Fall in a Year",
            "Summary": "KPIT Technologies shares fell as much as 11% on Tuesday, marking the worst single-day decline in 12 months. The stock has declined in seven of the last eight trading sessions, correcting nearly 20% during this period. Trading volumes spiked significantly with 38 lakh shares changing hands compared to the 20-day average of 7.5 lakh shares. The stock has turned negative for September and declined for four consecutive months, delivering positive returns only in March and May this year. On a year-to-date basis, KPIT Tech is down 23%, making it the worst performing year since its 2019 listing. The stock has entered oversold territory with RSI declining to 29. Domestic mutual funds hold a 14% stake as of the June quarter, with major stakeholders including Motilal Oswal Nifty Midcap 100 ETF, Mirae Asset Large and Midcap Fund, and Canara Robeco MF. Insurance companies LIC, ICICI Prudential Life, and HDFC Life hold stakes between 1.25% to 1.7%, while MIT holds a 3.11% stake.",
            "Sentiment": "negative",
            "PublishDate": 1759233287294,
            "Source": "stock"
        },
        {
            "Title": "KPIT Technologies Block Trade Worth Rs. 51.85 Crores Executed on NSE",
            "Summary": "KPIT Technologies executed a block trade on the National Stock Exchange involving approximately 410,881 shares at Rs. 1,261.90 per share, totaling Rs. 51.85 crores. The transaction represents a significant institutional trading activity for the technology company.",
            "Sentiment": "neutral",
            "PublishDate": 1758600211615,
            "Source": "order&deals"
        },
        {
            "Title": "KPIT Technologies Engages with Global Investors at Goldman Sachs Asia Leaders Conference",
            "Summary": "KPIT Technologies participated in the Goldman Sachs Asia Leaders Conference held on September 3 & 4, 2025, in Hong Kong. The company conducted one-on-one meetings with investors including Schroders Plc, Marshall Wace Asia Ltd, William Blair, Point72 Hong Kong Ltd, JPMorgan Asset Management, BlackRock Investment Management Singapore, AllianceBernstein LP, and Neuberger Berman entities. Group meetings were held with Balyasny Asset Management, Caravel Group Ltd, HSBC Global Asset Management Ltd, INVESCO Asia Ltd, Ishana Capital Ltd, Man Group Partners LP, Syncicap Asset Management Ltd, and Zaaba Capital Ltd. During the conference, KPIT reiterated information previously shared during its earnings call held on July 30, 2025, and its 8th Annual General Meeting held on August 12, 2025. The company confirmed that no unpublished price sensitive information was disclosed to investors during these interactions.",
            "Sentiment": "neutral",
            "PublishDate": 1756993724010,
            "Source": "stock"
        },
        {
            "Title": "KPIT Technologies Completes $10 Million SAFE Investment in Helm.ai",
            "Summary": "KPIT Technologies has completed a $10 million SAFE (Simple Agreement for Future Equity) investment in Helm.ai. The investment represents KPIT's strategic move into the artificial intelligence sector through this funding arrangement.",
            "Sentiment": "positive",
            "PublishDate": 1756825907731,
            "Source": "stock"
        },
        {
            "Title": "KPIT Technologies Promoter Hemlata Shende Sells 5,000 Equity Shares",
            "Summary": "Hemlata Shende, a promoter of KPIT Technologies Limited, disposed of 5,000 equity shares through open market sale on August 12, 2025. The transaction reduced her shareholding from 15,000 shares (0.005472%) to 10,000 shares (0.003648%) of the company's total voting capital. The disposal represents 0.001824% of KPIT Technologies' total share capital of 27,41,43,808 shares of ₹10 each. Shende is part of a promoter group that includes S.B. Pandit, Nirmala Pandit, Chinmay Pandit, Kishor Patil, and several other individuals and entities.",
            "Sentiment": "neutral",
            "PublishDate": 1755493452485,
            "Source": "corporate_action"
        },
        {
            "Title": "KPIT Technologies Completes Caresoft Acquisition for Revised $157 Million",
            "Summary": "KPIT Technologies has completed its acquisition of Caresoft for a revised total consideration of up to $157 million, down from the originally announced $191 million. The company made an initial payment of $51 million to acquire 100% equity shares in Caresoft's entities across the US, UK, and Mexico. The revised deal includes $15 million in variable pay based on revenue and business synergy milestone achievements. Prior to completion, KPIT infused €28 million and $28 million into its UK and US subsidiaries respectively to facilitate the transaction. The acquisition was completed through KPIT's subsidiaries after satisfying all conditions precedent.",
            "Sentiment": "positive",
            "PublishDate": 1755281954614,
            "Source": "order&deals"
        },
        {
            "Title": "KPIT Technologies Shareholders Approve All Six Resolutions at Annual General Meeting",
            "Summary": "KPIT Technologies held its 8th Annual General Meeting on August 12, 2025, through video conferencing where shareholders passed six ordinary resolutions. The approved resolutions included adoption of audited standalone and consolidated financial statements for the financial year ended March 31, 2025, declaration of final dividend of Rs. 6 per equity share in addition to interim dividend of Rs. 2.50 per share already paid, reappointment of directors Mr. Anup Sable and Mr. Chinmay Pandit who retire by rotation, and appointment of Dr. K. R. Chandratre as Secretarial Auditor for five years from April 1, 2025 to March 31, 2030. All resolutions received requisite majority with voting percentages ranging from 90.81% to 99.999% in favor. The meeting was conducted with remote e-voting facility provided by NSDL, and Jayavant B. Bhave served as the appointed scrutinizer for the voting process.",
            "Sentiment": "positive",
            "PublishDate": 1755015670717,
            "Source": "corporate_action"
        },
        {
            "Title": "KPIT Technologies Restructures Growth Strategy Through Strategic Deals and Investments",
            "Summary": "KPIT Technologies has announced a comprehensive reshaping of its growth strategy through three key moves: a $157 million revision of its Caresoft deal, acquiring majority control in N-Dream, and making a $10 million strategic investment in Helm.ai. These initiatives are aimed at accelerating the company's capabilities in software-defined vehicles (SDV) and autonomous mobility innovations.",
            "Sentiment": "positive",
            "PublishDate": 1754652249774,
            "Source": "stock"
        },
        {
            "Title": "KPIT Technologies Reduces Caresoft Acquisition Price to $157M, Increases N-Dream Stake to 51%, Invests $10M in Helm.ai",
            "Summary": "KPIT Technologies has finalized the acquisition of Caresoft for a revised consideration of up to $157 million, down from the initially announced $191 million. The reduced amount includes $15 million in variable pay based on revenue and business synergy milestones, payable over 4 years. The acquisition will strengthen KPIT's Vehicle Engineering & Design and Truck, Off-Highway offerings by integrating downstream engineering and benchmarking services. The company is also increasing its stake in N-Dream AG from 26% to 51% for €6.5 million, making it a subsidiary, with plans to acquire up to 90% during the current financial year. Additionally, KPIT approved an investment of up to $10 million in Helm.ai, an AI software company for self-driving cars, through a SAFE instrument in preferred stock. Helm.ai reported revenues of $9.28 million, $7.29 million, and $4.36 million for the years ending December 31, 2024, 2023, and 2022 respectively.",
            "Sentiment": "positive",
            "PublishDate": 1754650833930,
            "Source": "order&deals"
        },
        {
            "Title": "KPIT Technologies Reports 12.8% Revenue Growth in Q1 FY26 Despite Market Uncertainties",
            "Summary": "KPIT Technologies delivered quarterly results showing year-on-year revenue growth of 12.8% in rupee terms and 7.8% in dollar terms. EBITDA grew 12.4% year-on-year, maintaining a strong margin of 21%, while EBIT stood at 17%. PAT was INR 1,719.1 million, with variance from the previous quarter attributed to one-time income from QUALCOMM's investment in Qorix and a negative currency impact of INR 272 million. The company secured deal wins worth $241 million during the quarter, with growth primarily in powertrain and connected areas across the US and Europe in the passenger car vertical. Fixed-price projects increased from 60% to 62.5% of revenue. The commercial vehicle segment experienced a decline due to client-specific ramp-down, expected to recover in the coming quarter. Headcount decreased to 12,545 from 12,873 in the previous quarter. Management expressed optimism about AI competency and solutions development, expecting H2 performance to exceed H1. The company announced a partnership with JSW Motors for India operations and sees growing pipeline opportunities in China and India markets. CEO Kishor Patil indicated that geopolitical uncertainties and tariff issues should stabilize within a quarter, leading to improved growth momentum.",
            "Sentiment": "positive",
            "PublishDate": 1754492181194,
            "Source": "earnings"
        },
        {
            "Title": "KPIT Tech Delays Next-Gen Vehicle Software Architecture by 1-2 Years, Maintains 21% EBITDA Margin Target",
            "Summary": "KPIT Technologies announced that its next-generation Software-Defined Vehicle (SDV) architecture, originally planned for 2028, will be delayed by 1-2 years. The company continues deploying first-generation SDV systems through next year. KPIT is developing AI-based validation solutions to help OEMs accelerate their validation processes. Management declined to provide guidance for the current fiscal year and future years, stating they will revisit guidance once market conditions stabilize. The company expects to maintain EBITDA margins at 21% in the foreseeable future, barring significant currency fluctuations.",
            "Sentiment": "neutral",
            "PublishDate": 1753932786670,
            "Source": "stock"
        },
        {
            "Title": "JSW Motors Partners with KPIT Technologies for New Energy Vehicle Software Development",
            "Summary": "JSW Motors and KPIT Technologies announced a strategic partnership to develop software and digital solutions for India's new energy mobility sector. JSW Motors, the automotive vertical of the JSW Group, is investing $3 billion over five years to develop electric, hybrid, and plug-in hybrid vehicles in India. The company's first New Energy Vehicle is scheduled to debut in the second half of FY2026. KPIT will provide expertise in electric propulsion systems, battery innovation, and Software Defined Vehicle architectures, leveraging its experience across over 2000 global vehicle production programs. JSW Motors is developing a 630-acre automotive hub in Bidkin, Maharashtra. KPIT will establish a dedicated center of excellence for JSW Motors as part of the collaboration.",
            "Sentiment": "positive",
            "PublishDate": 1753867259591,
            "Source": "order&deals"
        },
        {
            "Title": "KPIT Technologies Partners with JSW Motors to Accelerate New Energy Mobility in India",
            "Summary": "KPIT Technologies has partnered with JSW Motors to advance new energy mobility solutions in India. The collaboration aims to speed up developments in the electric and alternative energy vehicle sector within the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1753866807267,
            "Source": "order&deals"
        },
        {
            "Title": "KPIT Technologies Stock Jumps 5% Despite Mixed Quarterly Results",
            "Summary": "KPIT Technologies shares surged 5% following the company's quarterly results announcement. The company won deals worth $241 million during the June quarter, down from $280 million in the March quarter but higher than $202 million in the same quarter last year. US Dollar revenue grew 0.3% sequentially, below the expected 1.1%. EBIT declined 10.6% to ₹237 crore with margins narrowing to 15.4% from 17.3% previously. Net profit dropped 30% to ₹172 crore, missing the ₹200 crore estimate. Constant currency revenue fell 3.2% sequentially, marking the first decline after several quarters of growth. Management expressed confidence in strong growth momentum for the second half of the year, citing robust pipeline growth and transformative large engagements that will contribute to revenue growth in the second half of financial year 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1753866463972,
            "Source": "earnings"
        },
        {
            "Title": "KPIT Tech Co-MD Expresses Confidence in Second Half Growth Driven by T25 Clients",
            "Summary": "KPIT Tech's Co-Managing Director has expressed confidence about the company's growth prospects for the second half of the year. The anticipated growth is expected to be driven by T25 clients. The company expects to maintain continued growth momentum as they approach the year-end.",
            "Sentiment": "positive",
            "PublishDate": 1753866395199,
            "Source": "stock"
        },
        {
            "Title": "KPIT Technologies Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "KPIT Technologies reported Q1 revenue of 15.4 billion rupees, showing a slight increase from the previous quarter's 15.3 billion rupees. However, the company's profitability declined with EBIT falling to 2.4 billion rupees from 2.6 billion rupees quarter-on-quarter, while EBIT margin compressed to 15.4% from 17%. Consolidated net profit dropped significantly to 1.7 billion rupees compared to 2.5 billion rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1753865216295,
            "Source": "earnings"
        },
        {
            "Title": "KPIT Technologies Schedules Q1 FY2026 Earnings Conference Call for July 30, 2025",
            "Summary": "KPIT Technologies will announce its Q1 FY2026 results for the quarter ended June 30, 2025, on July 30, 2025. The company has scheduled a post-earnings conference call on the same day at 17:30 IST, hosted by Dolat Capital Market. Key executives participating in the call include CEO & MD Kishor Patil, President & Joint MD Sachin Tikekar, CFO Priya Hardikar, and other senior directors. The company has provided dial-in numbers for participants across multiple regions including India, USA, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1753446835157,
            "Source": "earnings"
        },
        {
            "Title": "SEBI Issues Adjudication Order on Front Running in KPIT Tech Scrip",
            "Summary": "The Securities and Exchange Board of India (SEBI) has issued an adjudication order regarding front running in the scrip of KPIT Tech. No further details about the order or the specific front running activities are provided in the given news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1752192447000,
            "Source": "default"
        },
        {
            "Title": "SEBI Issues Adjudication Order on Front Running in KPIT Tech Stocks",
            "Summary": "The Securities and Exchange Board of India (SEBI) has issued an adjudication order regarding front running in KPIT Tech stocks. Front running is an unethical practice where a broker or trader uses insider knowledge to trade ahead of large orders, potentially manipulating the market. This action by SEBI suggests potential regulatory concerns or violations related to trading activities in KPIT Tech's securities.",
            "Sentiment": "negative",
            "PublishDate": 1752142134000,
            "Source": "default"
        },
        {
            "Title": "KPIT Technologies: Goldman Sachs Cuts Target Price Amid Auto R&D Concerns",
            "Summary": "Goldman Sachs reduced KPIT Technologies' 12-month target price to Rs 1,230 from Rs 1,280. The brokerage expects negative other income due to hedging losses, subdued auto R&D spending, and delayed deal closures. Q1 revenue is expected to decline 2% quarter-on-quarter. FY26 to FY28 EPS estimates cut by up to 7% due to uncertainties in deal closures and global EV R&D spending recovery.",
            "Sentiment": "negative",
            "PublishDate": 1751427646000,
            "Source": "normal_news"
        },
        {
            "Title": "KPIT Tech Schedules Q1 Results Review",
            "Summary": "KPIT Tech has announced that it will review its first quarter results on July 30.",
            "Sentiment": "neutral",
            "PublishDate": 1751033849000,
            "Source": "default"
        },
        {
            "Title": "KPIT Technologies Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 746,245 shares of KPIT Technologies Ltd. occurred on the National Stock Exchange (NSE) for Rs. 94.87 crores. The trade was executed at a price of Rs. 1271.30 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1750921014000,
            "Source": "block_details"
        },
        {
            "Title": "KPIT Technologies: Share Price Drops 5% Following Mid-Quarter Update",
            "Summary": "KPIT Technologies' stock fell over 5% after releasing a mid-quarter update highlighting business uncertainties. The company reported a strong pipeline but slower conversions, with challenges in ramp-ups and revenue cannibalisation. Europe shows positive signs, while USA and Asia face uncertainties. The company doesn't expect one-time gains in Q1 FY26 and anticipates forex-related deficits.",
            "Sentiment": "negative",
            "PublishDate": 1750740156000,
            "Source": "normal_news"
        },
        {
            "Title": "KPIT Technologies: Caresoft Acquisition Approved Amid Uncertain Business Environment",
            "Summary": "KPIT Technologies' board approves 100% acquisition of Caresoft's Global Engineering Solutions business, expected to close by end of current quarter. The deal aims to strengthen KPIT's presence in Trucks and Off-highway segment and expand into China. However, the company warns of an uncertain business environment due to geopolitical tensions and tariff ambiguities, with slower pipeline conversion rates.",
            "Sentiment": "neutral",
            "PublishDate": 1750730648000,
            "Source": "corporate_action"
        },
        {
            "Title": "KPIT Technologies: Board Approves 100% Acquisition of Caresoft's Global Engineering Solutions",
            "Summary": "KPIT Technologies announced 100% acquisition of Caresoft's Global Engineering Solutions. The company's share price surged up to 1.4% in Tuesday's trading session following the news.",
            "Sentiment": "positive",
            "PublishDate": 1746508192000,
            "Source": "corporate_action"
        },
        {
            "Title": "KPIT Technologies Acquires Caresoft's Global Engineering Solutions Business",
            "Summary": "KPIT Technologies has approved the acquisition of Caresoft's Global Engineering Solutions business for USD 191 million. This strategic move aims to accelerate KPIT's expansion into China and enhance its value creation through full vehicle cost reduction solutions for passenger cars, trucks, and off-highway segments. The deal also includes providing manufacturing engineering solutions for the mobility segment.",
            "Sentiment": "positive",
            "PublishDate": 1746506547000,
            "Source": "default"
        },
        {
            "Title": "KPIT Technologies: Target Price Cuts After Q4 Results",
            "Summary": "Brokerage firms reduce target prices for KPIT Technologies following Q4FY25 results. Management's lack of FY26 revenue guidance due to uncertain demand and soft first half prompts analysts to cut earnings estimates. The company reported a 47.5% YoY increase in Q4 net profit and 16% YoY revenue growth. Slow deal ramp-ups and potential project cancellations expected to impact FY26 start. Kotak cuts target price to ₹1,000 from ₹1,170, maintaining 'sell' rating. ICICI Securities keeps 'reduce' rating with ₹1,100 target.",
            "Sentiment": "negative",
            "PublishDate": 1746078004000,
            "Source": "earnings"
        },
        {
            "Title": "KPIT Technologies: CEO Optimistic Despite Deferred FY26 Guidance",
            "Summary": "KPIT Technologies has deferred its fiscal 2026 guidance due to temporary market interruptions in the US. CEO Kishor Patil remains confident in sustained growth, citing strategic client engagements and a strong deal pipeline. The company reported a 31% QoQ increase in net profit to Rs 244.7 crore and a 3.4% revenue growth to Rs 1,528 crore in Q4. KPIT is expanding into new segments and markets, and has formed a significant partnership with Mercedes-Benz Research and Development India.",
            "Sentiment": "positive",
            "PublishDate": 1745979216000,
            "Source": "earnings"
        },
        {
            "Title": "KPIT Technologies: Strategic Collaboration with Mercedes-Benz for Software-Defined Vehicles",
            "Summary": "KPIT Technologies and Mercedes-Benz Research and Development India (MBRDI) announce a strategic partnership to accelerate the development of Software-Defined Vehicles. The collaboration aims to enhance innovation, reduce time-to-market, and improve efficiencies in vehicle technology. KPIT will provide cross-domain knowledge to support Mercedes-Benz's digital transformation journey.",
            "Sentiment": "positive",
            "PublishDate": 1745837864000,
            "Source": "corporate_action"
        },
        {
            "Title": "KPIT Technologies Collaborates with Mercedes-Benz R&D India",
            "Summary": "KPIT Technologies has announced a collaboration with Mercedes-Benz Research and Development India (MBRDI) to accelerate the development of software-defined vehicles. This partnership aims to combine KPIT's expertise in automotive software with Mercedes-Benz's innovation in vehicle technology.",
            "Sentiment": "positive",
            "PublishDate": 1745830425000,
            "Source": "default"
        },
        {
            "Title": "KPIT Tech Exceeds FY'23 Guidance, No FY'26 Forecast Given",
            "Summary": "KPIT Technologies reported strong performance for FY'23, surpassing its guidance. The company achieved 20% revenue growth against a projected 18-22%, and 21% EBITDA growth, meeting the guidance. However, KPIT Tech has not provided any revenue or margin guidance for FY'26.",
            "Sentiment": "positive",
            "PublishDate": 1745830066000,
            "Source": "default"
        },
        {
            "Title": "KPIT Tech Focuses on AI-Driven Productivity and Revenue Growth",
            "Summary": "KPIT Technologies is emphasizing productivity improvement through AI implementation, shifting revenue towards fixed-price models, and optimizing costs through pyramid optimization. The company reports strong pipeline growth and successful deal wins in recent quarters, including large transformative engagements expected to contribute to revenue growth in the second half of FY26.",
            "Sentiment": "positive",
            "PublishDate": 1745829652000,
            "Source": "default"
        }
    ]
}