{
    "Symbol": "KPRMILL",
    "ISIN": "INE930H01031",
    "News": [
        {
            "Title": "KPR Mill Q3FY26 Results: Revenue Up 6.8% YoY",
            "Summary": "KPR Mill reports Q3FY26 consolidated revenue of ₹1,50,092 lakhs, up 6.8% YoY. Net profit rises 3.1% to ₹20,860 lakhs. Board declares 250% interim dividend of ₹2.50 per share.",
            "Sentiment": "positive",
            "PublishDate": 1770644060136,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBI Mutual Fund reduces stake in KPR Mill to 5.74%",
            "Summary": "SBI Mutual Fund has reduced its shareholding in K.P.R. Mill Limited to 5.7371% from 7.7406% by selling 3,89,978 shares worth 0.1141% of paid-up capital as of February 03, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770352672365,
            "Source": "co_actions_results"
        },
        {
            "Title": "K.P.R. Mill Reports Mixed Quarterly Performance with Revenue Decline but Strong Profitability",
            "Summary": "K.P.R. Mill Limited announced its unaudited financial results for the quarter ended September 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 95,450 lakhs compared to Rs 1,00,304 lakhs in the same quarter last year, representing a decline. However, net profit increased to Rs 13,239 lakhs from Rs 21,047 lakhs in the previous year quarter. For the half-year period, standalone revenue reached Rs 2,01,381 lakhs versus Rs 2,03,712 lakhs last year, while net profit was Rs 29,420 lakhs compared to Rs 36,387 lakhs. On a consolidated basis, quarterly revenue was Rs 1,56,886 lakhs against Rs 1,42,769 lakhs last year, with net profit of Rs 21,803 lakhs versus Rs 20,500 lakhs. The company operates primarily in textile business along with sugar and other segments. The Board meeting was held on November 4, 2025, and the results were reviewed by the Audit Committee and approved by the Board of Directors.",
            "Sentiment": "neutral",
            "PublishDate": 1762254560290,
            "Source": "earnings"
        },
        {
            "Title": "KPR Mill Reports 7.3% Growth in Q2 Net Profit to 2.2 Billion Rupees",
            "Summary": "KPR Mill reported quarterly net profit of 2.2 billion rupees compared to 2.05 billion rupees in the same period last year. The company's EBITDA increased to 3.14 billion rupees from 2.96 billion rupees year-over-year, though EBITDA margin declined to 19.25% from 20%. Revenue grew to 15.7 billion rupees from 14.3 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762250443488,
            "Source": "earnings"
        },
        {
            "Title": "KPR Mill Reports 11.4% Revenue Growth to ₹1,802 Crores in Q1 FY26",
            "Summary": "KPR Mill Limited reported quarterly results with revenue of ₹1,802.25 crores, up 11.4% year-on-year. EBITDA increased 7.4% to ₹346.23 crores, while profit after tax grew 4.6% to ₹212.70 crores. However, EBITDA margin declined to 19.2% from 19.9% in the previous year. The garments segment showed strong performance with 14.4% volume growth and 20.8% value increase. Sugar and ethanol segments also performed well with volume growth of 26.1% and 27.2% respectively. The company maintains a net cash position of ₹114.8 crores and declared a dividend of ₹5.00 per share for FY25. KPR Mill operates as a vertically integrated textile manufacturer with 12 manufacturing facilities and exports to over 60 countries, with Europe accounting for 55.4% of revenue.",
            "Sentiment": "positive",
            "PublishDate": 1754909859865,
            "Source": "earnings"
        },
        {
            "Title": "KPR Mill Reports 10.4% Revenue Growth in Q1 Results",
            "Summary": "KPR Mill announced its Q1 financial results showing revenue of 17 billion rupees compared to 15.4 billion rupees in the same period last year. The company's consolidated net profit increased to 2.13 billion rupees from 2 billion rupees year-over-year. However, EBITDA declined slightly to 3.1 billion rupees from 3.14 billion rupees, while EBITDA margin compressed to 17.6% from 19.55% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754472501756,
            "Source": "earnings"
        },
        {
            "Title": "KPR Mill: Promoters' Block Deal Triggers 6% Share Price Drop",
            "Summary": "KPR Mill shares fell 6% after a block deal of 1.1 crore shares (3.2% equity) occurred. Promoters KP Ramasamy, KPD Sigamani, and P Nataraj were likely sellers, with an estimated offer size of ₹1,195.6 crore at a floor price of ₹1,107 per share. A 90-day lock-in period for sellers follows the transaction.",
            "Sentiment": "negative",
            "PublishDate": 1747801471000,
            "Source": "block_deals"
        },
        {
            "Title": "KPR Mills Promoters to Sell 3.2% Stake via Block Deals",
            "Summary": "Promoters of KPR Mills are set to sell a 3.2% stake through block deals. The floor price is set at 1107 per share, which represents a 10% discount to the current market price. The sale involves 1.08 crore shares worth 1200 crores. IIFL broker will handle the deal, according to sources cited by CNBC Awaaz.",
            "Sentiment": "neutral",
            "PublishDate": 1747760968000,
            "Source": "default"
        },
        {
            "Title": "KPR Mill: Promoters to Sell 3.2% Stake in ₹1,195.6 Crore Block Deal",
            "Summary": "KPR Mill promoters plan to sell up to 3.2% stake via block deals at a floor price of ₹1,107 per share, a 10% discount to current market price. The total offer size is ₹1,195.6 crore. Q4 results show 4% revenue growth to ₹1,769 crore, but net profit fell 4% to ₹204 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1747748959000,
            "Source": "block_deals"
        },
        {
            "Title": "K.P.R. Mill Reports Q4 Financial Results",
            "Summary": "K.P.R. Mill has released its Q4 financial results. The company's EBITDA slightly decreased to 3.32 billion rupees from 3.35 billion rupees year-over-year. The EBITDA margin also saw a minor decline to 19.6% from 19.75%. However, revenue increased to 17.1 billion rupees from 16.3 billion rupees compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1746784477000,
            "Source": "result"
        },
        {
            "Title": "K.P.R. Mill Reports Increase in Q4 Consolidated Net Profit",
            "Summary": "K.P.R. Mill has reported a consolidated net profit of 2.5 billion rupees for the fourth quarter, compared to 2.14 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1746784389000,
            "Source": "result"
        },
        {
            "Title": "KPR Mill Ltd: Stock Surges 23% Ahead of Q4 Results",
            "Summary": "KPR Mill's stock has risen 23% in three sessions, with a 5% gain on May 9, before Q4 results announcement. The surge follows India's Free Trade Agreement with the UK, eliminating duties on Indian textiles and apparel exports. Analysts are evenly split between 'buy' and 'hold' ratings.",
            "Sentiment": "positive",
            "PublishDate": 1746775059000,
            "Source": "result"
        },
        {
            "Title": "KPR Mill: Share Price Surges 7% Ahead of Dividend Decision",
            "Summary": "KPR Mill's share price rose over 7% intraday, reaching a high of ₹1216. The company's board meeting is scheduled for May 9, 2025, to consider final dividend for FY 2024-2025 and approve audited financial results.",
            "Sentiment": "positive",
            "PublishDate": 1746698416000,
            "Source": "corporate_action"
        },
        {
            "Title": "KPR Mill to Consider Q4 Results on May 9",
            "Summary": "KPR Mill has announced that it will consider its fourth quarter (Q4) financial results on May 9. This is a routine corporate announcement regarding the company's upcoming earnings release.",
            "Sentiment": "neutral",
            "PublishDate": 1745930631000,
            "Source": "default"
        },
        {
            "Title": "KPR Mill Reports Q3 Revenue Increase",
            "Summary": "KPR Mill has announced its third-quarter revenue, which stands at 14.6 billion rupees. This represents a significant increase from the previous year's figure of 11.8 billion rupees for the same quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738569518000,
            "Source": "earnings"
        },
        {
            "Title": "KPR Mill Reports 7% Increase in Q3 Consolidated Net Profit",
            "Summary": "KPR Mill, a textile manufacturing company, has announced its financial results for the third quarter. The company's consolidated net profit rose to 2 billion rupees, up from 1.87 billion rupees in the same period last year, representing a year-over-year increase of approximately 7%.",
            "Sentiment": "positive",
            "PublishDate": 1738569475000,
            "Source": "earnings"
        },
        {
            "Title": "K.P.R. Mill Reports Q2 Financial Results",
            "Summary": "K.P.R. Mill has released its Q2 financial results. The company's EBITDA for the quarter was 2.96 billion rupees, compared to 2.98 billion rupees in the same quarter last year. The EBITDA margin improved to 20.03% from 19.72% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730793043000,
            "Source": "result"
        },
        {
            "Title": "K.P.R. Mill Reports Slight Increase in Q2 Revenue",
            "Summary": "K.P.R. Mill, an Indian textile company, has reported its second-quarter revenue for the current fiscal year. The company's revenue reached 14.8 billion rupees, showing a marginal increase from 14.6 billion rupees in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1730793021000,
            "Source": "result"
        },
        {
            "Title": "K.P.R. Mill Reports Slight Increase in Q2 Consolidated Net Profit",
            "Summary": "K.P.R. Mill has announced its Q2 consolidated net profit of 2.05 billion rupees, showing a marginal increase from 2.01 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730792974000,
            "Source": "result"
        }
    ]
}