{
    "Symbol": "KRBL",
    "ISIN": "INE001B01026",
    "News": [
        {
            "Title": "KRBL Wins Appeal Against Customs Penalties",
            "Summary": "KRBL Limited successfully appealed customs penalties, with appellate authority setting aside Joint Commissioner orders from April and July 2025. Company to seek refund of pre-deposits made during proceedings.",
            "Sentiment": "positive",
            "PublishDate": 1769156244879,
            "Source": "stocks"
        },
        {
            "Title": "KRBL cuts Iran exposure amid US tariff threat",
            "Summary": "KRBL reduces Iran exposure to $8-10 million from $100 million in 2018 as US threatens 25% tariffs on countries trading with Iran, causing basmati prices to drop from ₹80 to ₹75 per kg.",
            "Sentiment": "negative",
            "PublishDate": 1768283476076,
            "Source": "stocks"
        },
        {
            "Title": "KRBL Shareholders Approve New Independent Director",
            "Summary": "KRBL Limited shareholders approved the appointment of Sudhir Garg as Independent Non-Executive Director through postal ballot with 99.98% votes in favour on January 12, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768227687672,
            "Source": "stocks"
        },
        {
            "Title": "KRBL Wins Best Mid-Day Meal Initiative Award 2025",
            "Summary": "KRBL Limited receives prestigious Best Mid-Day Meal Initiative of the Year-2025 award at Indian Social Impact Awards 2025, recognizing company's CSR efforts in social welfare and nation-building initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1766043422056,
            "Source": "stocks"
        },
        {
            "Title": "KRBL Limited Wins Excellence in Family Business Award",
            "Summary": "KRBL Limited has been honored at the Barclays Private Clients Hurun India Excellence in Family Business Awards 2025, recognizing contributions to economy, society, and industry innovation.",
            "Sentiment": "positive",
            "PublishDate": 1765546675003,
            "Source": "stocks"
        },
        {
            "Title": "KRBL Gets Credit Rating Reaffirmation from ICRA",
            "Summary": "KRBL Limited receives credit rating reaffirmation from ICRA for banking facilities worth ₹2,085.00 crores, maintaining ICRA [AA] (Stable) and ICRA [A1+] ratings across various instruments.",
            "Sentiment": "positive",
            "PublishDate": 1765546315175,
            "Source": "stocks"
        },
        {
            "Title": "KRBL Announces Postal Ballot for Director Appointment",
            "Summary": "KRBL Limited schedules postal ballot process to seek shareholder approval for appointment of Mr. Sudhir Garg as Independent Non-Executive Director for five-year term starting December 4, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765434441848,
            "Source": "stocks"
        },
        {
            "Title": "KRBL Limited Appoints Sudhir Garg as Independent Director for Five-Year Term",
            "Summary": "KRBL Limited's Board of Directors approved the appointment of Mr. Sudhir Garg, a retired civil servant from Indian Administrative Services with over three decades of experience, as Additional Independent Non-Executive Director effective December 04, 2025. The appointment is for a five-year term subject to shareholder approval, bringing governance expertise from his distinguished career in public administration across revenue, finance, agriculture, and industrial sectors.",
            "Sentiment": "positive",
            "PublishDate": 1764838732162,
            "Source": "corporate_governance"
        },
        {
            "Title": "KRBL Limited Wins Gold Award at LACP 2025 Spotlight Awards for Annual Report",
            "Summary": "KRBL Limited received the Gold Award for its Annual Report for Financial Year 2024-25 at the globally renowned LACP 2025 Spotlight Awards (Top 100 Worldwide). The LACP Spotlight Awards is a global competition platform for annual reports, sustainability reports, and related media attracting participants from various industries and countries.",
            "Sentiment": "positive",
            "PublishDate": 1763385275168,
            "Source": "stock"
        },
        {
            "Title": "KRBL Sets Growth Targets with Improved Margins and Export Guidance",
            "Summary": "KRBL management expects improved gross margins for FY2026 and targets 10% average growth rate for domestic business, while providing Q3 export guidance of around INR 400 crores. The company plans to expand its non-basmati rice business from current INR 200 crores to about INR 500 crores within 2-3 years, with Q4 export performance dependent on bulk pipeline developments.",
            "Sentiment": "positive",
            "PublishDate": 1763218565811,
            "Source": "stock"
        },
        {
            "Title": "KRBL Reports Strong Q2 Performance with 67% Jump in Net Profit",
            "Summary": "KRBL delivered robust quarterly results with consolidated net profit surging to 1.72 billion rupees from 1.03 billion rupees year-over-year, while revenue grew to 15.11 billion rupees from 12.7 billion rupees. The company's EBITDA more than doubled to 2.26 billion rupees with margin expansion to 14.99% from 9.64%, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1763074611508,
            "Source": "earnings"
        },
        {
            "Title": "KRBL Announces AZB & Partners Review in Progress, Board Presentation Scheduled for November 14",
            "Summary": "KRBL has announced that a review being conducted by AZB & Partners is currently in progress. The company stated that the results of this review will be presented to the board by November 14.",
            "Sentiment": "neutral",
            "PublishDate": 1761665355143,
            "Source": "stock"
        },
        {
            "Title": "KRBL Wins Property Bid in Panipat, Haryana for 4.03 Billion Rupees",
            "Summary": "KRBL has successfully won a bid for properties located in Panipat, Haryana. The company's final bid amount was 4.03 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1759456957534,
            "Source": "stock"
        },
        {
            "Title": "KRBL Acquires Properties in Panipat, Haryana for ₹4.03 Billion",
            "Summary": "KRBL has successfully acquired properties located in Panipat, Haryana through a bidding process. The company secured the properties with a final bid amount of ₹4.03 billion.",
            "Sentiment": "positive",
            "PublishDate": 1759324374128,
            "Source": "stock"
        },
        {
            "Title": "KRBL Limited Appoints Desh Raj Dogra as Independent Director for Five-Year Term",
            "Summary": "KRBL Limited appointed Mr. Desh Raj Dogra as Independent Non-Executive Director effective July 04, 2025, for a five-year term. The appointment was approved by shareholders at the 32nd Annual General Meeting held on September 24, 2025. Dogra brings over 40 years of financial sector experience, having retired as Managing Director and CEO of CARE Ratings Limited in 2016. During his tenure at CARE, he led the company's public listing in December 2012 and various strategic initiatives including acquisitions and international expansions. He holds degrees in Agriculture from Himachal Pradesh University and an MBA from University of Delhi, and serves as Independent Director on multiple corporate boards including IDFC First Bank and L&T Finance.",
            "Sentiment": "positive",
            "PublishDate": 1758736470196,
            "Source": "corporate_governance"
        },
        {
            "Title": "KRBL Limited Shareholders Approve Addition of Real Estate Development to Business Objects",
            "Summary": "KRBL Limited shareholders approved alterations to the Object Clause of the company's Memorandum of Association at the 32nd Annual General Meeting held on September 24, 2025. The key change includes inserting 'real-estate development and allied activities' as a new business object, allowing the company and its subsidiaries to acquire, develop, construct, lease, manage and monetise immovable property. This addition is intended to create a complementary growth engine alongside the established agri-foods business and enhance long-term shareholder returns. The company also realigned existing object clauses to comply with the Companies Act, 2013 format, including restructuring titles and adding new sub-clauses while deleting the existing 'Other objects' section.",
            "Sentiment": "positive",
            "PublishDate": 1758735739211,
            "Source": "corporate_action"
        },
        {
            "Title": "KRBL Limited Appoints AZB & Partners as Independent Law Firm for Board Committee Review",
            "Summary": "KRBL Limited has appointed AZB & Partners as an independent law firm to conduct a thorough review of observations and submit a report to the relevant Board Committee. This appointment follows up on a previous intimation dated September 15, 2025. The company made this disclosure under SEBI listing regulations through Company Secretary Piyush Asija.",
            "Sentiment": "neutral",
            "PublishDate": 1758690419878,
            "Source": "corporate_governance"
        },
        {
            "Title": "KRBL Limited Addresses Governance Concerns Following Independent Director's Resignation",
            "Summary": "KRBL Limited held an investor conference call to address events following the resignation of Independent Director Anil Kumar Chaudhary, who stepped down on September 8, 2025, after being appointed in August 2024. Chaudhary raised concerns about board processes in his resignation letter, though management stated no financial or legal compliance gaps were highlighted. The company disclosed a INR 58 crore export receivables write-off related to 2023 shipments to an African customer, with provisions recorded under accounting standards and bank authorization obtained. KRBL has INR 37 crores in unspent CSR funds from a total INR 40 crores spent over three years. The board approved appointing an independent third-party firm to conduct a thorough review within 30 days. Management emphasized that three other Independent Directors continue to support the company, with existing director Mr. Dogra joining the Audit Committee. The company plans to replace the resigned director within the three-month statutory timeframe.",
            "Sentiment": "negative",
            "PublishDate": 1758111489554,
            "Source": "corporate_governance"
        },
        {
            "Title": "KRBL CMD Denies Corporate Governance Allegations, Appoints External Auditor",
            "Summary": "KRBL Chairman and Managing Director Anil Kumar Mittal has dismissed allegations made by independent director Anil Kumar Chaudhary in his resignation letter as false. Chaudhary resigned citing corporate governance issues, leading to KRBL shares falling 12% on Monday to ₹400.7. The board has approved appointing an external auditor to review six or seven allegations made by Chaudhary, with results expected within 30 days. KRBL delayed making Chaudhary's resignation letter public due to the surprising language used, taking four to five extra days to respond. Trading volume surged to 1.1 crore shares, significantly above the 20-day average of 7 lakh shares.",
            "Sentiment": "negative",
            "PublishDate": 1757931885030,
            "Source": "corporate_governance"
        },
        {
            "Title": "KRBL Appoints Third-Party Firm to Review Governance Concerns After Independent Director's Resignation",
            "Summary": "KRBL Ltd. announced the appointment of an independent third-party firm to review observations made by independent director Anil Kumar Chaudhary, who resigned on September 8 citing corporate governance issues and professional ethical dilemmas. The company's board met on Monday to address Chaudhary's concerns and decided to conduct a thorough review within 30 days, with findings to be presented to board committees. KRBL shares fell as much as 12.83% to Rs 387.1 on the NSE, trading 10.52% lower at Rs 397.40 compared to a 0.10% decline in the Nifty 50. The company stated it continues to operate with transparency and integrity and will keep exchanges informed of updates.",
            "Sentiment": "negative",
            "PublishDate": 1757929634962,
            "Source": "corporate_governance"
        },
        {
            "Title": "KRBL Independent Director Anil Kumar Chaudhary Resigns Over Board Dynamics Issues",
            "Summary": "Anil Kumar Chaudhary has resigned from his position as Independent Director at KRBL, citing inconsistency in board dynamics as the reason for his departure.",
            "Sentiment": "negative",
            "PublishDate": 1757829710790,
            "Source": "corporate_governance"
        },
        {
            "Title": "KRBL Limited Faces Rs 6.1 Crore Penalty and Fine from Customs Authority Over Basmati Rice Export Standards",
            "Summary": "KRBL Limited received an order from the Joint Commissioner of Customs, Noida, imposing penalties totaling Rs 6.1 crore. The order includes a penalty of Rs 5.6 crore on both the company and its Chairperson and Managing Director under Section 114(i) of the Customs Act, 1962, plus a redemption fine of Rs 50 lakh on the company under Section 125. The action stems from a show cause notice dated May 9, 2012, related to alleged non-conformance to certain standards under the Basmati Rice (Export) Grading and Marking Rules, 1979. The company received the order dated July 31, 2025, on August 27, 2025, and plans to file an appeal with the appropriate authority. KRBL stated there is no significant impact on its financial, operational, or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1756300914498,
            "Source": "stock"
        },
        {
            "Title": "KRBL Shares Hit 52-Week High as Quarterly Profit Jumps 74%",
            "Summary": "KRBL shares surged over 18% in two trading sessions, reaching a 52-week high of Rs 440 on Monday. The basmati rice company reported strong quarterly results with profit after tax jumping 74% year-on-year to Rs 151 crore from Rs 87 crore. Revenue from operations rose 32% to Rs 1,584 crore, driven by strong demand in domestic and export markets. EBITDA increased 62% to Rs 225 crore with margin improving to 13.9% from 11.4%. The company holds significant market share across channels - 37.9% in general trade, 38.6% in modern trade, and 44% in e-commerce. Its flagship India Gate brand reaches 1.1 crore households and is consumed by one in every 10 Indian households excluding rural areas. KRBL's market cap stands at Rs 8,387 crore.",
            "Sentiment": "positive",
            "PublishDate": 1754892436829,
            "Source": "earnings"
        },
        {
            "Title": "KRBL Targets Long-Term Growth Through Global Exports and Premium Product Focus",
            "Summary": "KRBL has outlined its strategy for long-term growth, focusing on boosting global exports and emphasizing premium products while expanding its product lines. The company reports strong earnings with no debt burden. KRBL plans to leverage its India Gate brand strength to support profit growth.",
            "Sentiment": "positive",
            "PublishDate": 1754579937296,
            "Source": "stock"
        },
        {
            "Title": "KRBL Reports Strong Q1 Performance with 73% Jump in Net Profit",
            "Summary": "KRBL delivered robust quarterly results with consolidated net profit rising to 1.5 billion rupees from 866 million rupees year-over-year. Revenue increased significantly to 15.8 billion rupees compared to 11.99 billion rupees in the same period last year. The company's EBITDA grew to 1.9 billion rupees from 1.2 billion rupees, while EBITDA margin expanded to 12.16% from 9.78% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1754576667205,
            "Source": "earnings"
        },
        {
            "Title": "Indian Government Raises Broken Rice Prices for Ethanol Production",
            "Summary": "The Indian government has announced an increase in the prices of broken rice used for ethanol production. This price change will take effect from October 1st. The news is likely to impact KRBL, a company involved in rice production.",
            "Sentiment": "positive",
            "PublishDate": 1751254857000,
            "Source": "default"
        },
        {
            "Title": "KRBL Ltd: Targets Double-Digit Ebitda Margin in FY26",
            "Summary": "KRBL Ltd aims to achieve a double-digit Ebitda margin in FY26, similar to Q4 FY25's 16.2%. The company expects improved export numbers and rationalized inventory costs. KRBL is working to formalize its distribution network in Saudi Arabia and has a neutral to positive outlook for exports. The company has also ventured into the edible oils segment, projecting Rs 2-3 crore revenue within 2-3 years.",
            "Sentiment": "positive",
            "PublishDate": 1750133444000,
            "Source": "earnings"
        },
        {
            "Title": "KRBL Ltd: Q4 Profit Surges 35%, Dividend Declared",
            "Summary": "KRBL Ltd reported a 35.1% YoY increase in Q4FY25 consolidated net profit to ₹154 crore. Revenue rose 9.4% to ₹1,442.2 crore, while EBITDA grew 25.4% to ₹223.7 crore. The board recommended a final dividend of ₹3.50 per share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1747411042000,
            "Source": "earnings"
        },
        {
            "Title": "KRBL Reports Q4 Results and Recommends Dividend",
            "Summary": "KRBL has recommended a dividend of 3.5 rupees per equity share. The company's Q4 EBITDA increased to 2.2 billion rupees from 1.78 billion rupees year-over-year. The Q4 EBITDA margin improved to 15.51% from 13.53% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747408675000,
            "Source": "result"
        },
        {
            "Title": "KRBL Reports Q4 Financial Results",
            "Summary": "KRBL has announced its Q4 financial results. The company's consolidated net profit for the quarter is 1.54 billion rupees, compared to 1.14 billion rupees year-over-year and 1.3 billion rupees quarter-over-quarter. Q4 revenue stands at 14.4 billion rupees, up from 13.18 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747408600000,
            "Source": "result"
        },
        {
            "Title": "KRBL Reports Mixed Q3 Financial Results",
            "Summary": "KRBL, a leading rice producer, has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.95 billion rupees, up from 1.78 billion rupees in the same quarter last year. However, the EBITDA margin decreased to 11.58% from 12.38% year-over-year, indicating a slight decline in profitability despite higher earnings.",
            "Sentiment": "neutral",
            "PublishDate": 1738844465000,
            "Source": "earnings"
        },
        {
            "Title": "KRBL Reports Increase in Q3 Revenue and Profit",
            "Summary": "KRBL, a leading rice company, has announced its financial results for the third quarter. The company's consolidated net profit rose to 1.33 billion rupees, compared to 1.3 billion rupees in the same period last year. Revenue also saw a significant increase, reaching 16.8 billion rupees, up from 14.4 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738844459000,
            "Source": "earnings"
        },
        {
            "Title": "KRBL to Consider Q3 Results on February 6",
            "Summary": "KRBL Limited has announced that it will consider its third quarter (Q3) financial results on February 6. This suggests the company is preparing to release its quarterly earnings report, which is a standard practice for publicly traded companies.",
            "Sentiment": "neutral",
            "PublishDate": 1738242269000,
            "Source": "earnings"
        },
        {
            "Title": "KRBL: CFO Expects Margin Recovery Despite Q2 Slump",
            "Summary": "KRBL's CFO Ashish Jain anticipates margin recovery in upcoming quarters, citing operational efficiencies and lower paddy prices. Q2 saw Ebitda margin fall to 12.1% from 18.2% YoY. The company aims to boost export revenue and expand into non-Basmati products, targeting 10% of overall revenue from this segment in two years.",
            "Sentiment": "positive",
            "PublishDate": 1731807000000,
            "Source": "result"
        },
        {
            "Title": "KRBL Reports Q2 Financial Results",
            "Summary": "KRBL Limited announced its Q2 consolidated financial results. The company reported a net profit of 1.03 billion rupees, down from 1.53 billion rupees in the same quarter last year. However, revenue increased to 12.7 billion rupees from 12.1 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731491357000,
            "Source": "result"
        }
    ]
}