{
    "Symbol": "KREBSBIO",
    "ISIN": "INE268B01013",
    "News": [
        {
            "Title": "Krebs Biochemicals Reports Q3FY26 Loss of ₹312.65 Lacs",
            "Summary": "Krebs Biochemicals & Industries posted a net loss of ₹312.65 lacs for Q3FY26, with revenue declining 36.55% YoY to ₹727.42 lacs. Manufacturing operations remain closed due to pollution board orders.",
            "Sentiment": "negative",
            "PublishDate": 1770625047358,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krebs Biochemicals Reports Loss of Rs 1,146.73 Lacs for Half-Year Ended September 2025",
            "Summary": "Krebs Biochemicals Industries Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported a loss before tax of Rs 1,146.73 lacs for the half-year period, compared to a loss of Rs 2,093.20 lacs in the corresponding period last year. Revenue from operations stood at Rs 1,977.70 lacs for the half-year. The company's cash and cash equivalents decreased to Rs 12.71 lacs as of September 30, 2025, from Rs 14.16 lacs at the beginning of the year. Net cash flow from operating activities was negative at Rs 167.56 lacs. The Board of Directors approved these results in a meeting held on November 4, 2025. The company operates in a single business segment and has no subsidiaries, associates, or joint venture companies.",
            "Sentiment": "negative",
            "PublishDate": 1762246883943,
            "Source": "earnings"
        },
        {
            "Title": "Krebs Biochemicals Shareholders Approve All Nine Resolutions at 33rd AGM",
            "Summary": "Krebs Biochemicals & Industries Limited held its 33rd Annual General Meeting on September 26, 2025, where all nine resolutions were passed by the required majority. Key approvals included adoption of audited financial statements for the year ended March 31, 2025, re-appointment of directors Mr. Avinash Ravi and Mr. Pabitrakumar K Bhattacharyya who retired by rotation, and appointment of statutory auditors. Shareholders also approved the appointment of Mr. Manish Kumar Jain as Director and subsequently as Managing Director and CEO. Other resolutions covered related party transactions with Ipca Laboratories Limited, ratification of cost auditors' remuneration, and appointment of DSMR & Associates as secretarial auditors for five years starting from financial year 2025-26. The company has 9,111 shareholders on record date, with 31 shareholders attending the meeting either in person or through proxy.",
            "Sentiment": "positive",
            "PublishDate": 1758973893738,
            "Source": "corporate_governance"
        },
        {
            "Title": "Krebs Biochemicals Reports Rs 532.43 Lakh Loss for Quarter Ended June 30, 2025",
            "Summary": "Krebs Biochemicals and Industries Limited published its unaudited financial results for the quarter ended June 30, 2025. The company reported total income from operations of Rs 549.26 lakhs, down from Rs 643.85 lakhs in the previous quarter and Rs 1,292.25 lakhs in the same quarter last year. The company posted a net loss of Rs 532.43 lakhs for the quarter, compared to a loss of Rs 825.31 lakhs in the previous quarter and Rs 517.11 lakhs in the corresponding quarter of the previous year. Total comprehensive income showed a loss of Rs 532.43 lakhs. The company's equity share capital remained unchanged at Rs 2,156.06 lakhs. Basic and diluted earnings per share were negative at Rs 2.47 per share of Rs 10 each. The board approved these results on August 7, 2025, and they were published in newspapers on August 8, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1754636836211,
            "Source": "earnings"
        },
        {
            "Title": "Krebs Biochemicals Appoints New Managing Director & CEO, Announces Q1 Results",
            "Summary": "Krebs Biochemicals & Industries Ltd approved its unaudited financial results for the first quarter ended June 30, 2025. The company appointed Manish Kumar Jain as Additional Director and Managing Director & CEO effective August 7, 2025, for a five-year term until August 6, 2028, subject to shareholder approval. Jain is a Chartered Accountant with over 25 years of experience in Strategic Planning, Finance and Business Development. Simultaneously, Jitendra Shah resigned from his position as Managing Director & CEO effective August 7, 2025, citing personal reasons. The Board reconstituted its Audit Committee and Stakeholder Relationship Committee effective August 8, 2025, with both committees now including the new Managing Director alongside existing independent directors.",
            "Sentiment": "neutral",
            "PublishDate": 1754558945737,
            "Source": "corporate_action"
        },
        {
            "Title": "Krebs Biochemicals Appoints New Managing Director & CEO, Reports Q1 Results",
            "Summary": "Krebs Biochemicals & Industries Ltd announced its unaudited financial results for the first quarter ended June 30, 2025, alongside significant leadership changes. The company appointed Manish Kumar Jain as Additional Director and Managing Director & CEO effective August 7, 2025, for a five-year term until August 6, 2028, subject to shareholder approval. Jain is a Chartered Accountant with over 25 years of experience in Strategic Planning, Finance and Business Development. Simultaneously, Jitendra Shah resigned from his position as Managing Director & CEO effective August 7, 2025, citing personal reasons. The Board also reconstituted its committees effective August 8, 2025, with the Audit Committee chaired by P M Kathariya and the Stakeholder Relationship Committee chaired by Sumanth Karlapudi, both including the new Managing Director among their members.",
            "Sentiment": "neutral",
            "PublishDate": 1754557086753,
            "Source": "earnings"
        },
        {
            "Title": "Jitendra Shah Resigns as Managing Director & CEO of Krebs Biochemicals & Industries",
            "Summary": "Jitendra Shah has resigned from his position as Managing Director & CEO of Krebs Biochemicals & Industries Limited, effective August 7, 2025. Shah submitted his resignation letter on July 25, 2025, citing personal reasons and stating there are no other reasons for his departure. The resignation will take effect at the close of business hours on August 7, 2025. Shah also resigned from his position as Director of the company. In his resignation letter, he thanked the Board Members for their support and confidence during his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1753440715742,
            "Source": "corporate_governance"
        }
    ]
}