{
    "Symbol": "KRIDHANINF",
    "ISIN": "INE524L01026",
    "News": [
        {
            "Title": "Kridhan Infra Board Meet Set for Feb 14, 2026",
            "Summary": "Kridhan Infra Limited schedules board meeting on February 14, 2026 to consider Q3FY26 unaudited financial results. Trading window remains closed until February 16, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770639325689,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kridhan Infra Appoints New Company Secretary",
            "Summary": "Kridhan Infra Limited announces appointment of Ms. Dipti Jain as Company Secretary & Compliance Officer effective February 6, 2026, following board approval.",
            "Sentiment": "positive",
            "PublishDate": 1770366241056,
            "Source": "stocks"
        },
        {
            "Title": "Kridhan Infra incorporates media subsidiary",
            "Summary": "Kridhan Infra Limited announces incorporation of subsidiary Kridhan Mediatech Private Limited for media and entertainment business with ₹10.00 lakh authorized capital.",
            "Sentiment": "positive",
            "PublishDate": 1768303006535,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kridhan Infra Board Changes: Director Resignations",
            "Summary": "Kridhan Infra Limited announces resignation of Executive Director Mr. Rishiraj and completion of Independent Director Mr. Mahdav Deshpande's term, effective January 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767703896552,
            "Source": "stocks"
        },
        {
            "Title": "Kridhan Infra Allots Warrants Worth ₹11.50 Cr",
            "Summary": "Kridhan Infra Limited disclosed warrant allotment to promoter Anil Dhanpat Agrawal and promoter group entity Kridhan Petrochemicals on December 9, 2025, under SEBI insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765886147037,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kridhan Infra Allots 10.27 Crore Warrants at Rs 4.05 Each Under Preferential Issue",
            "Summary": "Kridhan Infra Limited has allotted 10.27 crore warrants convertible into equity shares at Rs 4.05 per warrant to 11 investors including Anil Dhanpat Agrawal and Kridhan Petrochemicals Private Limited. The allotment was completed under a preferential issue with investors paying 25% of the issue price upfront for subscription.",
            "Sentiment": "neutral",
            "PublishDate": 1765271566403,
            "Source": "corporate_action"
        },
        {
            "Title": "Kridhan Infra Approves Q2 FY26 Results After Auditor Change, Reports Revenue Recovery",
            "Summary": "Kridhan Infra Limited's board approved standalone and consolidated unaudited financial results for quarter and half year ended September 30, 2025, following appointment of new statutory auditor M/s. Jignesh Savla & Associates after previous auditor's demise. The company reported revenue from operations of Rs 125.00 lakhs in Q2 FY26 compared to nil in corresponding previous quarter, though auditors highlighted material uncertainty about going concern due to accumulated losses and fully eroded net worth.",
            "Sentiment": "neutral",
            "PublishDate": 1764250509635,
            "Source": "earnings"
        },
        {
            "Title": "Kridhan Infra Limited's Statutory Auditor Passes Away, Financial Results Delayed",
            "Summary": "Kridhan Infra Limited announced the death of CA Bakulesh R Kotecha, proprietor of B.R. Kotecha Co., who served as the company's statutory auditor. Kotecha died on November 5, 2025. Due to his sudden death and the proprietary nature of his firm, the company cannot obtain a Limited Review Report for the quarter and half-year ended September 30, 2025. The company will publish financial results for this period by November 14, 2025, without the statutory auditor's Limited Review Report. The Board of Directors will appoint a new statutory auditor to fill the casual vacancy. Kotecha's last submitted report was the Limited Review Report for the quarter ended June 30, 2025, filed on August 14, 2025. His scheduled term was set to expire on March 31, 2028.",
            "Sentiment": "negative",
            "PublishDate": 1762540290847,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kridhan Infra Limited's Statutory Auditor Passes Away, Financial Results Delayed",
            "Summary": "Kridhan Infra Limited announced the death of its statutory auditor CA Bakulesh R Kotecha, proprietor of M/s. B.R. Kotecha Co., on November 5, 2025. Due to the auditor's sudden death and limited time constraints, the company cannot obtain a Limited Review Report for its quarterly and half-year results ended September 30, 2025. The company will publish these financial results by November 14, 2025 without the statutory auditor's Limited Review Report. The Board of Directors will appoint a new statutory auditor to fill the casual vacancy at the earliest. The company informed BSE and NSE about this development under regulatory requirements.",
            "Sentiment": "negative",
            "PublishDate": 1762410075882,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kridhan Infra Limited Company Secretary Resigns Due to Personal and Health Reasons",
            "Summary": "Prasanta Kumar Mohanty resigned from his position as Company Secretary and Compliance Officer at Kridhan Infra Limited, effective from the close of business hours on October 29, 2025. The resignation was attributed to personal reasons and health issues that restrict his ability to travel to the office. The company has accepted his resignation and acknowledged his valuable contributions during his tenure. Kridhan Infra Limited has informed the BSE and NSE about this key managerial personnel change in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1761831507611,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kridhan Infra Limited Reports Quarterly Results Amid Going Concern Uncertainty",
            "Summary": "Kridhan Infra Limited released unaudited standalone and consolidated financial results for the quarter ended December 31, 2023. The company faces significant financial challenges with accumulated losses, fully eroded net worth, and defaults in working capital borrowing repayments. Bank borrowings remain under NPA classification, and the company has not provided for further interest liability on outstanding borrowings. Auditors highlighted material uncertainty about the company's ability to continue as a going concern, though financial results were prepared on a going concern basis. The consolidated results include wholly owned subsidiary Kridhan Infra Solutions Private Limited and associate Vijay Nirman Company Private Limited, but exclude subsidiary Readymade Steel Singapore Pte Limited. The Board of Directors approved the results at a meeting held on February 13, 2024.",
            "Sentiment": "negative",
            "PublishDate": 1761795490097,
            "Source": "earnings"
        },
        {
            "Title": "K Kridhan Infra Limited Reports Quarterly Financial Results for June 2025",
            "Summary": "K Kridhan Infra Limited submitted its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The Board of Directors approved the results at their meeting held on August 14, 2025. On a standalone basis, the company reported revenue from operations of Rs 154.25 lakhs and profit of Rs 123.06 lakhs for the quarter. The consolidated results showed similar revenue of Rs 154.25 lakhs with profit of Rs 123.14 lakhs. The company's statutory auditors B.R.Kotecha & Co. issued an unmodified opinion on both standalone and consolidated results. The auditors noted that the company has accumulated losses and fully eroded net worth, but management believes future business prospects and cost reduction measures will support continued operations. The company trades on BSE (533482) and NSE (KRIDHANINF) with paid-up equity share capital of Rs 1,895.58 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1755184385296,
            "Source": "earnings"
        }
    ]
}