{
    "Symbol": "KRISHANA",
    "ISIN": "INE506W01012",
    "News": [
        {
            "Title": "Krishana Phoschem Targets 14-16% EBITDA Despite Cost Rise",
            "Summary": "Krishana Phoschem aims for EBITDA margins of 14-15%, possibly 16%, while managing rising raw material costs. Company expects FY26 revenue to exceed quarterly average of ₹570 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768361341580,
            "Source": "stocks"
        },
        {
            "Title": "Krishana Phoschem Plans 50% Capacity Boost by March 2026",
            "Summary": "Krishana Phoschem announces significant expansion of DAP/NPK fertilizer manufacturing capacity with 50% increase targeted for completion by March 2026, production launch scheduled for April.",
            "Sentiment": "positive",
            "PublishDate": 1768360430648,
            "Source": "stocks"
        },
        {
            "Title": "Krishana Phoschem Shows Optimism for FY26 Close",
            "Summary": "Krishana Phoschem remains positive about the remaining quarters of FY26, driven by favorable agricultural sector trends and robust operational performance in the fertilizers segment.",
            "Sentiment": "positive",
            "PublishDate": 1768360410412,
            "Source": "stocks"
        },
        {
            "Title": "Krishana Phoschem Shares Fall Despite 117% Revenue Growth",
            "Summary": "Krishana Phoschem shares declined 3% despite reporting strong Q3 FY26 results with 117% YoY revenue growth to ₹659 crores and 62% profit increase to ₹33.30 crores, as muted sequential growth disappointed investors.",
            "Sentiment": "neutral",
            "PublishDate": 1768206417161,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krishana Phoschem Hits Record 113,155 Tonnes Output",
            "Summary": "Krishana Phoschem achieves record fertilizer production of 113,155 tonnes with NPK reaching highest levels and SSP operating above 100% capacity, marking significant operational milestone.",
            "Sentiment": "positive",
            "PublishDate": 1768202849176,
            "Source": "stocks"
        },
        {
            "Title": "Krishana Phoschem Q3 EBITDA Jumps 58.7% YoY",
            "Summary": "Krishana Phoschem reports strong Q3 EBITDA growth of 58.7% to ₹703 million, though margin compression observed at 10.64% versus 14.57% in previous year.",
            "Sentiment": "positive",
            "PublishDate": 1768196531189,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krishana Phoschem Q3 Revenue Surges 120% YoY to ₹6.60B",
            "Summary": "Krishana Phoschem reported exceptional Q3 revenue growth of 120% year-on-year, with revenue increasing from ₹3.00 billion to ₹6.60 billion, demonstrating strong operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1768196505190,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krishana Phoschem Q3 Net Profit Jumps 62% YoY",
            "Summary": "Krishana Phoschem reports strong Q3 performance with net profit rising to ₹33.30 crores from ₹20.50 crores in the previous year, marking a significant 62.44% year-on-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1768196483783,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krishana Phoschem Forecasts Consistent H2 Performance, Plans Gradual Capacity Ramp-Up",
            "Summary": "Krishana Phoschem expects similar performance in H2 FY26 compared to H1. The company anticipates steady manufacturing operations, though trading volumes may vary based on market conditions. For new capacity expansion, the company projects initial utilization of 50-55% in FY27, with plans to increase utilization to over 80% in subsequent years.",
            "Sentiment": "positive",
            "PublishDate": 1760499265138,
            "Source": "stock"
        },
        {
            "Title": "Krishana Phoschem Reports Strong Q2 Revenue Growth Despite Margin Compression",
            "Summary": "Krishana Phoschem delivered robust quarterly performance with revenue doubling to 6.1 billion rupees from 3 billion rupees year-over-year. EBITDA increased significantly to 732 million rupees compared to 403 million rupees in the same period last year. Net profit nearly doubled to 332 million rupees from 167 million rupees year-over-year. However, EBITDA margin contracted to 12.04% from 13.4% in the previous year period, indicating some pressure on profitability despite strong top-line growth.",
            "Sentiment": "positive",
            "PublishDate": 1760336481273,
            "Source": "earnings"
        },
        {
            "Title": "Krishana Phoschem Receives Approval to Raise ₹10 Billion in Funds",
            "Summary": "Krishana Phoschem has obtained approval to raise funds up to ₹10 billion. The approval allows the company to proceed with its fundraising initiative.",
            "Sentiment": "positive",
            "PublishDate": 1754666511583,
            "Source": "corporate_action"
        },
        {
            "Title": "Krishana Phoschem Reports Improved Q1 Financial Results",
            "Summary": "Krishana Phoschem has reported improved financial results for the first quarter. The company's EBITDA increased to 656 million rupees from 419 million rupees in the same period last year. The EBITDA margin also improved to 16.57% from 14.92% year-over-year. Additionally, the company's standalone net profit rose to 306 million rupees from 164 million rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1752734895000,
            "Source": "result"
        },
        {
            "Title": "Krishana Phoschem Approves New Fertilizer and Sulphuric Acid Facility",
            "Summary": "Krishana Phoschem Co has approved the establishment of a new production facility. The facility will have a capacity of 500 TPD (tons per day) for fertilizer production and 300 TPD for sulphuric acid production.",
            "Sentiment": "positive",
            "PublishDate": 1750309234000,
            "Source": "default"
        },
        {
            "Title": "Krishana Phoschem Reports Temporary Disruption at Jhabua Plant",
            "Summary": "Krishana Phoschem Limited has announced a temporary disruption of operations at its Jhabua plant due to a thunderstorm. The company has stated that this is a short-term issue caused by severe weather conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1746621728000,
            "Source": "default"
        },
        {
            "Title": "Krishana Phoschem Reports Decline in Q2 EBITDA and Margin",
            "Summary": "<p>Krishana Phoschem has reported its Q2 financial results. The company's <span class='neutral'>EBITDA</span> (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 was <span class='negative'>403 million rupees</span>, <b>down</b> from <span class='positive'>473 million rupees</span> in the same quarter last year. The <span class='neutral'>EBITDA margin</span> also <span class='negative'>decreased</span> to <span class='negative'>13.40%</span> from <span class='positive'>17.85%</span> year-over-year.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728996269000,
            "Source": "result"
        },
        {
            "Title": "Krishana Phoschem Reports Q2 Revenue Growth",
            "Summary": "<p><span class=\"neutral\">Krishana Phoschem</span> has announced its <span class=\"neutral\">Q2 financial results</span>. The company reported <b>revenue</b> of <span class=\"positive\">3 billion rupees</span>, showing an <span class=\"positive\">increase</span> from <span class=\"neutral\">2.65 billion rupees</span> year-over-year and <span class=\"neutral\">2.81 billion rupees</span> quarter-over-quarter.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728996254000,
            "Source": "result"
        },
        {
            "Title": "Krishana Phoschem Reports Q2 Net Profit Decline",
            "Summary": "<p>Krishana Phoschem reported a <span class='neutral'>net profit</span> of <span class='neutral'>167.4 million rupees</span> for the second quarter, <span class='negative'>down</span> from 193 million rupees in the same period last year. However, it shows a slight <span class='positive'>increase</span> from 164.11 million rupees in the previous quarter.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728996242000,
            "Source": "result"
        }
    ]
}