{
    "Symbol": "KRISHIVAL",
    "ISIN": "INE0GGO01015",
    "News": [
        {
            "Title": "Krishival Foods Q3FY26 Results Show Strong Growth",
            "Summary": "Krishival Foods reported consolidated revenue of ₹7,441.20 lakhs for Q3FY26, up from ₹5,470.34 lakhs in Q3FY25. Net profit surged to ₹641.24 lakhs compared to ₹5.43 lakhs in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770726195616,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krishival Foods Board Meet on Feb 10 for Q3FY26 Results",
            "Summary": "Krishival Foods Limited has scheduled a board meeting on February 10, 2026, to consider Q3FY26 unaudited financial results and ESOP grants under Regulation 29 compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1769776919754,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krishival Foods Completes ₹100 Cr Rights Issue",
            "Summary": "Krishival Foods Limited successfully completed its rights issue, raising ₹99.99 crore through allotment of 33,33,160 partly paid-up equity shares at ₹300 per share to strengthen capital base.",
            "Sentiment": "positive",
            "PublishDate": 1768406841458,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krishival Foods Allots 3.33L Partly Paid Shares",
            "Summary": "Krishival Foods Limited successfully allotted 3,33,160 partly paid-up equity shares through its rights issue, raising ₹1.17 crores in application money with balance payable by January 2027.",
            "Sentiment": "positive",
            "PublishDate": 1767888477172,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krishival Foods Schedules Board Meeting for Rights Issue Finalization",
            "Summary": "Krishival Foods Limited has scheduled a board meeting for December 11, 2025, to finalize details of its rights issue including share price, number of shares, entitlement ratio, and record date following receipt of in-principle approval from stock exchanges. The company had previously approved issuing partly paid-up equity shares worth up to ₹10,000 lakhs through rights issue to eligible shareholders in its November 26, 2025 board meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1765208832871,
            "Source": "corporate_action"
        },
        {
            "Title": "Krishival Foods Schedules Board Meeting to Finalize Rights Issue Details Worth Up to ₹10,000 Lakhs",
            "Summary": "Krishival Foods Limited has scheduled a board meeting for December 2, 2025, to determine key parameters including share price, number of shares, entitlement ratio, and record date for its previously approved rights issue of partly paid-up equity shares. The rights issue, approved on November 26, 2025, aims to raise funds not exceeding ₹10,000 lakhs and is subject to regulatory approvals from stock exchanges.",
            "Sentiment": "positive",
            "PublishDate": 1764249660022,
            "Source": "corporate_action"
        },
        {
            "Title": "Krishival Foods Reports 50% Revenue Growth in Q2 FY26, Plans Capacity Expansion",
            "Summary": "Krishival Foods delivered strong quarterly results with revenue rising 50% year-on-year to Rs. 66.67 crore in Q2 FY26, driven by growth in both nuts and ice cream segments. The company is expanding its nuts processing capacity from 10 to 40 metric tons per day over the next two years and targeting 100% utilization of its ice cream plant capacity by FY27-28.",
            "Sentiment": "positive",
            "PublishDate": 1763640464738,
            "Source": "earnings"
        },
        {
            "Title": "Krishival Foods Reports Strong Q2 FY26 Performance with 50% Revenue Growth",
            "Summary": "Krishival Foods Limited achieved consolidated revenue of INR 66.67 crores in Q2 FY26, marking 50% year-over-year growth, with EBITDA reaching INR 5.8 crores (18% YoY growth). The company operates dual brands - Krishival Nuts for premium dry fruits and Melt N Mellow for ice cream - and is expanding manufacturing capacity while strengthening distribution across Tier II/III markets.",
            "Sentiment": "positive",
            "PublishDate": 1763366643023,
            "Source": "earnings"
        },
        {
            "Title": "Krishival Foods Reports 60% Revenue Growth to ₹120.71 Crore in H1 FY2025-26",
            "Summary": "Krishival Foods Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The FMCG company reported total income of ₹120.71 crore, up 60% year-on-year from ₹75.45 crore in H1 FY2024-25. Net profit increased 23% to ₹10.20 crore compared to ₹8.29 crore in the previous year. The company operates through two brands: Krishival Nuts (nuts and dried fruits) and Melt N Mellow (ice cream). The nuts segment generated revenue of ₹86.94 crore, up 19% year-on-year, while the ice cream segment achieved ₹29.24 crore revenue, up 37% year-on-year. Krishival Nuts has presence in 102 Tier II and III cities through 10,000 retail touch points, while Melt N Mellow operates through 25,000 retail touch-points across Maharashtra, Karnataka, Goa, and Telangana. The company is developing a 5-acre integrated processing facility and recently acquired a food processing unit to strengthen production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1762877271435,
            "Source": "earnings"
        },
        {
            "Title": "Krishival Foods Acquires 8,000 Sq. Meters Land in Kolhapur for Business Expansion",
            "Summary": "Krishival Foods has acquired 8,000 square meters of land in the Halkarni Industrial Area, Kolhapur. The acquisition is intended to expand the company's nut and food processing business operations.",
            "Sentiment": "positive",
            "PublishDate": 1762163992633,
            "Source": "stock"
        },
        {
            "Title": "Krishival Foods Defers Rights Issue, Approves Authorized Capital Increase",
            "Summary": "Krishival Foods Limited's Board of Directors decided to defer its planned rights issue of partly paid-up equity shares worth up to Rs. 10,000 lakhs due to technical issues, which are expected to be resolved within a month. The Board approved increasing the company's authorized share capital from Rs. 24.5 crores to Rs. 30 crores, expanding the total equity shares from 2.45 crore to 3 crore shares of Rs. 10 each. The capital increase requires shareholder approval at an Extra-Ordinary General Meeting scheduled for November 21, 2025, to be conducted via video conferencing.",
            "Sentiment": "neutral",
            "PublishDate": 1761660442164,
            "Source": "corporate_action"
        },
        {
            "Title": "Krishival Foods Approves Rights Issue to Raise Up to ₹10,000 Lakhs",
            "Summary": "Krishival Foods Limited's Board of Directors approved a rights issue to raise funds up to ₹10,000 lakhs through partly paid-up equity shares with face value of ₹10 each. The rights issue will be offered to eligible equity shareholders subject to regulatory approvals. The Board or Rights Issue Committee will determine key terms including issue price, rights entitlement ratio, record date, and timing. The Board meeting was held on October 27, 2025, and also approved the Draft Letter of Offer.",
            "Sentiment": "positive",
            "PublishDate": 1761570300414,
            "Source": "corporate_action"
        },
        {
            "Title": "Krishival Foods Sets September 18, 2025 Record Date for Rs 0.24 Final Dividend",
            "Summary": "Krishival Foods Limited has set September 18, 2025 as the record date for its proposed final dividend of Rs 0.24 per equity share for the financial year ended March 31, 2025. The dividend recommendation was made by the Board of Directors on May 24, 2025, totaling Rs 53,50,833.84, and is subject to shareholder approval at the Annual General Meeting. The company migrated from NSE Emerge platform to the Main Board of NSE during financial year 2025-26 and was listed on BSE's Main Board effective June 20, 2025. The dividend payout follows the company's Dividend Distribution Policy under Regulation 43A of the Listing Regulations.",
            "Sentiment": "positive",
            "PublishDate": 1756357566526,
            "Source": "corporate_action"
        },
        {
            "Title": "Krishival Foods Board Approves Director Appointments, New Auditor Selection and AGM Schedule",
            "Summary": "Krishival Foods Limited's Board of Directors approved multiple key decisions during their August 25, 2025 meeting. The board regularized two director appointments: Mr. Sujit Sudhakar Bangar as Chairperson and Whole Time Director (effective July 12, 2025) and Mr. Hrushikesh Moreshwar Bahekar as Non-Executive Independent Director (effective July 16, 2025), both subject to shareholder approval. The company appointed DSM and Associates as new Secretarial Auditor for five years (FY 2025-26 to FY 2029-30) following the cessation of M/s MNB & Co., LLP due to pre-occupation. The board set September 18, 2025 as the record date for dividend and scheduled the 11th Annual General Meeting for September 25, 2025 via video conferencing. E-voting will be available from September 22-24, 2025, with results to be published by September 26, 2025. The board also approved related party transactions, Director's Report, Corporate Governance Report, and Management Discussion and Analysis for the year ended March 31, 2025. Trading window for designated persons will open from August 28, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1756125494681,
            "Source": "corporate_governance"
        },
        {
            "Title": "Krishival Foods Reports No Deviation in Rs 6,425 Crore Preferential Issue Fund Utilization",
            "Summary": "Krishival Foods Limited filed a statement with BSE and NSE regarding the utilization of funds raised through a preferential issue for the quarter ended June 30, 2025. The company raised Rs 6,425 lakhs through preferential allotment on August 23, 2023, for working capital and general corporate purposes. The statement indicates no deviation or variation in the use of funds raised, with all applicable fields marked as 'Not Applicable' or 'Nil'. The report was signed by Company Secretary Rahul Gawande and Managing Director Aparna Morale Bangar.",
            "Sentiment": "neutral",
            "PublishDate": 1755067380957,
            "Source": "corporate_action"
        },
        {
            "Title": "Krishival Foods Reports Q2 2025 Results, Appoints Investor Relations Advisor and Issues Corporate Guarantee",
            "Summary": "Krishival Foods Limited approved its unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue of Rs. 3,404.68 lakhs and profit after tax of Rs. 414.72 lakhs, while consolidated revenue reached Rs. 4,952.03 lakhs with profit after tax of Rs. 440.46 lakhs. The board appointed Adfactors PR Private Limited as Investor Relations Advisor effective August 12, 2025. The company approved issuing a corporate guarantee up to Rs. 20 crores for its material subsidiary Melt 'N' Mellow Foods Private Limited's working capital and term loan requirements. Krishival Foods also updated that its proposed investments in BVK Foods Private Limited and Hamma Foods Private Limited are expected to be completed later than initially planned, though discussions are progressing constructively. The company operates primarily in nuts and dry fruits processing, with its consolidated operations also including ice cream manufacturing through subsidiaries.",
            "Sentiment": "positive",
            "PublishDate": 1755005229629,
            "Source": "earnings"
        },
        {
            "Title": "Krishival Foods Limited: NSE SME Stock Surges on Mainboard BSE Listing Plan",
            "Summary": "Krishival Foods Limited's stock hit the upper circuit, gaining 5% on NSE after announcing plans to migrate from NSE EMERGE (SME Platform) to NSE Main Board and seek direct listing on BSE Main Board. The company will seek shareholder approval via postal ballot for these moves.",
            "Sentiment": "positive",
            "PublishDate": 1746519546000,
            "Source": "corporate_action"
        },
        {
            "Title": "Krishival Foods Expands Presence in Singapore",
            "Summary": "Krishival Foods has announced plans to expand its operations in Singapore, aiming to increase its store count to 300. The company reports that its monthly sales in Singapore have reached $100,000, indicating strong performance in the market.",
            "Sentiment": "positive",
            "PublishDate": 1742516420000,
            "Source": "corporate_action"
        },
        {
            "Title": "Krishival Foods Plans Expansion in Singapore",
            "Summary": "Krishival Foods has announced plans to expand its presence in Singapore to 300 stores. The company reports that its monthly sales in Singapore have reached $100,000.",
            "Sentiment": "positive",
            "PublishDate": 1742475393000,
            "Source": "corporate_action"
        }
    ]
}