{
    "Symbol": "KRITI",
    "ISIN": "INE479D01038",
    "News": [
        {
            "Title": "Kriti Industries Q3FY26 Earnings Call on Feb 10",
            "Summary": "Kriti Industries (India) Limited has scheduled its Q3FY26 earnings conference call for February 10, 2026 at 2:30 PM IST to discuss quarterly results under Regulation 30.",
            "Sentiment": "neutral",
            "PublishDate": 1770288143207,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kriti Industries Cancels Warrants Worth ₹25.24 Cr",
            "Summary": "Kriti Industries (India) cancelled 63,69,000 convertible warrants due to non-conversion, resulting in forfeiture of ₹25.24 crore upfront amount paid by warrant holders.",
            "Sentiment": "negative",
            "PublishDate": 1769492905697,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kriti Industries Targets FY26 H1 Revenue of ₹3,098Mn with 25,560MT Volume Guidance",
            "Summary": "Kriti Industries has provided guidance for continued expansion with projected revenue of ₹3,098 million and volumes of 25,560 metric tons for the first half of FY26. The agriculture segment contributes 78% of total sales, driven by strong pipe demand under the PMKSY scheme. The company expects growth in its industrial segment due to rising demand for FTTx and gas pipelines. Kriti Industries plans to expand its dealer network beyond 400 partners and aims to capture high-growth markets through its Kasta brand positioning.",
            "Sentiment": "positive",
            "PublishDate": 1762788136631,
            "Source": "stock"
        },
        {
            "Title": "Kriti Industries Reports 26% Volume Decline and Losses in Q2 FY26 Results",
            "Summary": "Kriti Industries (India) Limited reported consolidated revenue of INR 857 million in Q2 FY26, with total sales volumes declining 26% to 7,472 MT compared to the previous year. The company posted an EBITDA loss of INR 42 million with a negative margin of 4.90%, and net loss of INR 97 million. The Agriculture segment contributed 4,842 MT but declined 33% year-on-year due to delayed monsoons and cautious channel stocking. Building Products segment recorded 1,378 MT, down 33% as continuous rainfall disrupted construction activity. Industrial Solutions segment delivered 1,252 MT with 64% growth supported by institutional orders. For H1 FY26, the company reported revenue of INR 3,098 million, EBITDA of INR 110 million with 3.55% margin, and net loss of INR 24 million. The company attributed overall performance to seasonal factors, extended monsoon conditions, and subdued rural demand.",
            "Sentiment": "negative",
            "PublishDate": 1762783600933,
            "Source": "earnings"
        },
        {
            "Title": "Kriti Industries Approves Merger with Wholly Owned Subsidiary Kriti Auto Engineering Plastics",
            "Summary": "Kriti Industries (India) Limited's Board of Directors approved a scheme of amalgamation to merge its wholly owned subsidiary Kriti Auto Engineering Plastics Private Limited with itself. The merger was approved following audit committee recommendation and board meeting held on November 8, 2025. Kriti Industries manufactures polymer pipes including PVC and PE pipes for water supply, irrigation, and construction applications, with net worth of Rs 21,655.10 lacs and turnover of Rs 30,979.05 lacs as of September 30, 2025. The subsidiary Kriti Auto Engineering Plastics has discontinued business operations and has a net worth of Rs 965.19 lacs. The merger aims to consolidate group structure, achieve cost savings, avoid duplication of administrative costs, and simplify business processes. No cash consideration is involved as it involves a wholly owned subsidiary. The transaction is subject to necessary regulatory and statutory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1762605499304,
            "Source": "corporate_action"
        },
        {
            "Title": "Kriti Industries Reports Wider Net Loss and Revenue Decline in Q2",
            "Summary": "Kriti Industries (India) reported a net loss of 97 million rupees in Q2, compared to a loss of 37 million rupees in the same period last year. The company's revenue decreased to 857 million rupees from 1.17 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762604591803,
            "Source": "earnings"
        },
        {
            "Title": "Kriti Industries Schedules Q2/H1-FY26 Earnings Conference Call for November 11",
            "Summary": "Kriti Industries (India) Limited has announced an earnings conference call to discuss its Q2/H1-FY26 unaudited financial results for the quarter and half year ended September 30, 2025. The call is scheduled for Tuesday, November 11, 2025, at 11:30 AM IST. The company's management will be represented by Chairman and Managing Director Shiv Singh Mehta and Chief Financial Officer Rajesh Sisodia. Valorem Advisors Management Services is organizing the conference call, with multiple international dial-in numbers provided for participants from different regions including the USA, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1762480764473,
            "Source": "earnings"
        },
        {
            "Title": "Kriti Industries Plans Growth Through Value-Added Soy Products and Export Expansion",
            "Summary": "Kriti Industries is pursuing growth through the development of value-added soy products, penetration into export markets, and specialty ingredient development. The company is implementing capacity upgrades aimed at improving operational efficiency to support these growth initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1755102927691,
            "Source": "stock"
        },
        {
            "Title": "Kriti Industries Reports Strong Q1 Turnaround with 720% Profit Jump",
            "Summary": "Kriti Industries (India) Limited reported a significant turnaround in its quarterly results ended June 30, 2025. The company posted a standalone net profit of Rs 720.09 lakhs compared to a net loss of Rs 364.70 lakhs in the previous quarter. Revenue from operations increased to Rs 22,405.56 lakhs from Rs 13,750.65 lakhs in the prior quarter. On a consolidated basis, net profit reached Rs 725.84 lakhs versus a loss of Rs 365.60 lakhs in the previous quarter. The company's earnings per share improved to Rs 1.40 (basic) from a loss of Rs 0.71 per share in the prior quarter. During the quarter, the company allotted 15,92,480 equity shares to Kriti Nutrients Limited following warrant conversion, bringing the total paid-up equity share capital to 5,26,96,000 shares of Re 1 each.",
            "Sentiment": "positive",
            "PublishDate": 1754988833627,
            "Source": "earnings"
        },
        {
            "Title": "Kriti Industries Reports Decline in Q1 Profit and Revenue",
            "Summary": "Kriti Industries (India) reported Q1 net profit of 72 million rupees, down from 137 million rupees in the same period last year. The company's Q1 revenue was 2.2 billion rupees compared to 2.57 billion rupees year-over-year, representing a decline in both profitability and sales performance.",
            "Sentiment": "negative",
            "PublishDate": 1754988059662,
            "Source": "earnings"
        },
        {
            "Title": "Kriti Industries Schedules Q1FY26 Earnings Conference Call for August 14",
            "Summary": "Kriti Industries (India) Limited has announced an earnings conference call to discuss its unaudited financial results for the quarter ended June 30, 2025. The call is scheduled for August 14, 2025, at 1:00 PM IST and will be hosted by Arihant Capital Markets. The company will be represented by Chairman and MD Shiv Singh Mehta and CFO Rajesh Sisodia. The company has sent invitations to analysts and provided dial-in details for participation in the earnings discussion.",
            "Sentiment": "neutral",
            "PublishDate": 1754925027164,
            "Source": "earnings"
        },
        {
            "Title": "Kriti Industries Reports Q4 Net Loss of 36M Rupees",
            "Summary": "Kriti Industries (India) has reported its quarterly results. The company recorded a net loss of 36 million rupees in the latest quarter, compared to a profit of 35 million rupees in the same period last year. Revenue for the quarter decreased to 1.37 billion rupees from 1.95 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1747900520000,
            "Source": "result"
        },
        {
            "Title": "Kriti Industries Reports Q3 EBITDA Loss",
            "Summary": "Kriti Industries (India) has reported an EBITDA loss of 14 million rupees for the third quarter, compared to an EBITDA of 179 million rupees in the same quarter of the previous year. This represents a significant year-over-year decline in the company's operational performance.",
            "Sentiment": "negative",
            "PublishDate": 1739264066000,
            "Source": "earnings"
        },
        {
            "Title": "Kriti Industries Reports Q3 Net Loss of 108 Million Rupees",
            "Summary": "Kriti Industries (India) has reported a net loss of 108 million rupees for the third quarter, compared to a profit of 78 million rupees in the same period last year. This represents a significant year-over-year decline in the company's financial performance.",
            "Sentiment": "negative",
            "PublishDate": 1739264060000,
            "Source": "earnings"
        }
    ]
}