{
    "Symbol": "KRITINUT",
    "ISIN": "INE798K01010",
    "News": [
        {
            "Title": "Kriti Nutrients Q3FY26 Results Show Strong Growth",
            "Summary": "Kriti Nutrients Ltd reported robust Q3FY26 performance with revenue of ₹22,621.36 lacs and net profit of ₹921.27 lacs, marking significant improvement over previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770459542016,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kriti Nutrients Board Meet Set for Feb 5, 2026",
            "Summary": "Kriti Nutrients Limited has scheduled its board meeting for February 5, 2026, to consider and approve Q3FY26 unaudited standalone and consolidated financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769768850805,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kriti Nutrients Reports Financial Results and Declares Rs 3 Interim Dividend",
            "Summary": "Kriti Nutrients Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company declared an interim dividend of Rs 3.00 (300%) per equity share to celebrate 3 decades of Kriti Oil Brand. The record date for dividend payment is November 13, 2025. The Board also took on record the Limited Review Report by Statutory Auditors for the unaudited financial results. The company's investment in Kriti Industries (India) Limited constitutes 24% of share capital and is treated as an associate using the equity method due to significant influence through common management and directors.",
            "Sentiment": "positive",
            "PublishDate": 1762613788126,
            "Source": "earnings"
        },
        {
            "Title": "Kriti Nutrients Limited Approves Final Dividend of Rs. 0.30 Per Share for FY 2025-26",
            "Summary": "Kriti Nutrients Limited shareholders approved a final dividend of Rs. 0.30 per equity share (30%) for financial year 2025-26 at the company's 29th Annual General Meeting held on August 13, 2025. The dividend applies to 5,01,03,520 equity shares with a face value of Re. 1 each. Shareholders on record as of August 6, 2025 are eligible for the dividend payment. The company will begin distributing dividend warrants and direct bank credits to eligible shareholders on or after August 18, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755189312251,
            "Source": "corporate_action"
        },
        {
            "Title": "Kriti Nutrients Reports 84% Decline in Quarterly Net Profit to ₹920.84 Crore",
            "Summary": "Kriti Nutrients Limited reported net profit of ₹920.84 crore for the quarter ended June 30, 2025, compared to ₹1,427.26 crore in the same quarter last year, representing a significant decline. Revenue from operations increased to ₹22,904.04 crore from ₹18,781.56 crore year-over-year. Total expenses rose to ₹21,922.42 crore from ₹17,069.29 crore in the previous year quarter. The company's earnings per share decreased to ₹1.84 from ₹2.85 in the corresponding quarter. The board approved these unaudited standalone and consolidated financial results, which were reviewed by statutory auditors who provided an unmodified opinion.",
            "Sentiment": "negative",
            "PublishDate": 1755009162447,
            "Source": "earnings"
        },
        {
            "Title": "Kriti Nutrients Sets August 6, 2025 Record Date for Final Dividend Payment",
            "Summary": "Kriti Nutrients Limited has announced August 6, 2025 as the record date for determining shareholders eligible to receive the proposed final dividend of Rs. 0.30 per equity share for FY2024-25. The dividend represents 30% of the face value of Rs. 1 per share and is subject to approval at the company's 29th Annual General Meeting. The book closure period will run from August 7 to August 13, 2025. The dividend payment is subject to tax deduction as applicable.",
            "Sentiment": "positive",
            "PublishDate": 1753442733707,
            "Source": "corporate_action"
        },
        {
            "Title": "Kriti Nutrients Sets Book Closure for Annual Meeting and Dividend Approval",
            "Summary": "Kriti Nutrients Limited has announced book closure from August 7, 2025 to August 13, 2025 for its 29th Annual General Meeting. The company has proposed a dividend of Rs. 0.30 per equity share of Rs. 1 each, subject to shareholder approval at the meeting. The Annual General Meeting will be held on August 13, 2025 at 4:30 PM through video conferencing, with the company's corporate office in Indore deemed as the venue. The book closure will determine shareholder eligibility for the proposed dividend payment.",
            "Sentiment": "neutral",
            "PublishDate": 1753190734510,
            "Source": "corporate_action"
        },
        {
            "Title": "Kriti Nutrients Reports Revenue Growth of 7.74% to ₹742.10 Cr Despite Profit Decline in FY25",
            "Summary": "Kriti Nutrients Limited reported revenue growth of 7.74% to ₹742.10 crores in FY 2024-25 compared to ₹688.81 crores in the previous year. However, the company's profit after tax declined by 18.26% to ₹37.02 crores from ₹45.29 crores in FY 2023-24. EBITDA also decreased by 10.88% to ₹55.79 crores. The company faced challenges due to end product price volatility and higher raw material prices. Government reduced basic customs duty on crude palm, soybean, and sunflower oils from 20% to 10%, which increased imports and moderated domestic prices. The company continued investing in value-added products and new product development, particularly in protein-based segments. Kriti Nutrients operates primarily in soybean processing and branded refined oil manufacturing, with 90.79% of revenues from domestic sales and 9.21% from exports to 22 countries.",
            "Sentiment": "neutral",
            "PublishDate": 1753189587011,
            "Source": "corporate_action"
        },
        {
            "Title": "Kriti Nutrients Reports Q4 Financial Results",
            "Summary": "Kriti Nutrients has released its Q4 financial results. The company's EBITDA decreased to 60.9 million rupees from 128 million rupees year-over-year. The EBITDA margin fell to 3.04% from 7.43% in the same period. Revenue increased to 2 billion rupees from 1.72 billion rupees year-over-year. Net profit declined to 49.5 million rupees from 88 million rupees year-over-year and 82.5 million rupees quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747921935000,
            "Source": "result"
        },
        {
            "Title": "Kriti Nutrients Reports Decline in Q3 Net Profit",
            "Summary": "Kriti Nutrients has reported its financial results for the third quarter. The company's net profit decreased to 82 million rupees, down from 142 million rupees in the same period last year. Revenue slightly increased to 1.74 billion rupees from 1.7 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739320458000,
            "Source": "earnings"
        },
        {
            "Title": "Kriti Nutrients Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Kriti Nutrients has reported a significant decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 111 million rupees from 186 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin contracted to 6.36% from 11.15% year-over-year, indicating a substantial reduction in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1739280989000,
            "Source": "earnings"
        },
        {
            "Title": "Kriti Nutrients Reports Decline in Q3 Net Profit",
            "Summary": "Kriti Nutrients has reported its financial results for the third quarter. The company's net profit decreased to 82 million rupees from 142 million rupees in the same period last year. Revenue slightly increased to 1.74 billion rupees from 1.7 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739280985000,
            "Source": "earnings"
        }
    ]
}