{
    "Symbol": "KRN",
    "ISIN": "INE0Q3J01015",
    "News": [
        {
            "Title": "KRN Heat Exchanger Files Q3 FY26 Monitoring Report",
            "Summary": "KRN Heat Exchanger submits monitoring agency report for Q3 FY26, showing Rs 1,037.33 lakhs utilized during quarter with Rs 1,639.94 lakhs remaining unutilized from IPO proceeds.",
            "Sentiment": "neutral",
            "PublishDate": 1770456495021,
            "Source": "stocks"
        },
        {
            "Title": "KRN Heat Exchanger Q3&9M FY26 Earnings Call on Feb 9",
            "Summary": "KRN Heat Exchanger and Refrigeration Limited announces investor call on February 9, 2026 at 12:00 PM to discuss Q3&9M FY26 financial results under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770145425694,
            "Source": "co_actions_results"
        },
        {
            "Title": "KRN Heat Exchanger Wins ₹20 Crore Order",
            "Summary": "KRN Heat Exchanger and Refrigeration has secured a significant new order worth ₹20 crores, marking a notable business development for the engineering company.",
            "Sentiment": "positive",
            "PublishDate": 1768545841643,
            "Source": "co_actions_results"
        },
        {
            "Title": "KRN Heat Exchanger Board Approves Loan Modifications & ESOP",
            "Summary": "KRN Heat Exchanger and Refrigeration Limited's board approved loan agreement modifications worth ₹100 crores, new ₹10 crore loan facility, and Employee Stock Option Plan 2026 covering 6 lakh shares.",
            "Sentiment": "positive",
            "PublishDate": 1768225475099,
            "Source": "co_actions_results"
        },
        {
            "Title": "KRN Heat Exchanger Eyes Data Center Boom Opportunity",
            "Summary": "KRN Heat Exchanger positions itself to capitalize on India's ₹5 lakh crore data center investment boom, expanding capacity 6x and targeting 50% export revenue growth over three years.",
            "Sentiment": "positive",
            "PublishDate": 1767180954057,
            "Source": "stocks"
        },
        {
            "Title": "KRN Heat Exchanger Reports 126% Revenue Growth in Q2FY26, New Facility Ramps Up",
            "Summary": "KRN Heat Exchanger and Refrigeration Limited reported strong quarterly results with standalone revenue growing 126% year-on-year to INR 227.22 crores in Q2FY26 compared to INR 100.48 crores in the same quarter last year. Net profit nearly doubled to INR 23.66 crores from INR 12.11 crores, marking 95% growth. EBITDA increased 69% to INR 29.60 crores from INR 17.56 crores. The company's new manufacturing facility at Neemrana, commissioned on May 30, 2025, contributed approximately INR 33 crores to quarterly revenue and is currently operating at 20% capacity utilization. Management targets 50% utilization for the new facility next year. The company's subsidiary acquired the bus air-conditioning division of Spare Refrigeration Systems Private Limited to expand presence in the automotive HVAC segment. Export business showed continued strength from UAE, United States, Canada and Italy markets. The company received CRISIL A- rating with stable outlook for bank facilities and expects to benefit from PLI scheme and state government incentives from next year.",
            "Sentiment": "positive",
            "PublishDate": 1762789223428,
            "Source": "earnings"
        },
        {
            "Title": "KRN Heat Exchanger Management Declines Revenue Guidance, Projects 20% EBITDA Margins",
            "Summary": "KRN Heat Exchanger And Refrigeration management stated during a conference call that they cannot provide specific revenue guidance. The company expects EBITDA margins to remain near 20% with potential growth in profit after tax due to incentives and tax benefits. For their new facility, KRN anticipates 20% capacity utilization in FY26, increasing to 50% in FY27. The company projects 20-25% industry growth in commercial air conditioning over the next decade.",
            "Sentiment": "neutral",
            "PublishDate": 1762485592999,
            "Source": "stock"
        },
        {
            "Title": "KRN Heat Exchanger Q2 Net Profit Nearly Doubles on Strong Revenue Growth",
            "Summary": "KRN Heat Exchanger and Refrigeration Limited reported strong quarterly results with standalone net profit rising 95.38% to ₹23.66 crores and revenue increasing 126.13% to ₹227.22 crores. On a consolidated basis, total income grew 66.91% to ₹154.69 crores with net profit up 46.14% to ₹17.99 crores. For the half-year period, standalone revenue jumped 72.87% to ₹344.35 crores while net profit increased 65.74% to ₹39.32 crores. The company's wholly owned subsidiary KRN HVAC Products signed a Business Transfer Agreement to acquire the Bus Air-Conditioning division of Sphere Refrigeration Systems, including transfer of operations, assets, and employees. CRISIL assigned the company an A- rating with stable outlook for its bank facilities. Export revenue was led by UAE at 47.43%, USA at 20.01%, and Canada at 18.86%. Chairman Managing Director Santosh Kumar highlighted the automotive HVAC segment acquisition as strengthening their market presence and supporting future growth.",
            "Sentiment": "positive",
            "PublishDate": 1762342817440,
            "Source": "earnings"
        },
        {
            "Title": "KRN Heat Exchanger Reports 46% Jump in Q2 Net Profit to 180 Million Rupees",
            "Summary": "KRN Heat Exchanger reported consolidated net profit of 180 million rupees in Q2, compared to 123 million rupees in the same period last year. Revenue increased to 1.5 billion rupees from 911 million rupees year-over-year. EBITDA rose to 303 million rupees from 181 million rupees, while EBITDA margin remained stable at 19.90% versus 19.88% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762259016103,
            "Source": "earnings"
        },
        {
            "Title": "KRN Heat Exchanger Receives GST Show Cause Notice for Rs. 5.53 Crores Tax Demand",
            "Summary": "KRN Heat Exchanger and Refrigeration Limited received a show cause notice from GST authorities on October 31, 2025. The notice proposes a tax demand of Rs. 5.53 crores, including interest and penalty, related to Input Tax Credit availed and utilized in contravention of Section 16 of the GST Act for the period of August 2025. The show cause notice was issued under Section 74A(2) read with Section 74A(5)(i) of SGST Act, 2017 and Section 20 of the IGST Act, 2017. The company stated it will file an appropriate response to the notice within prescribed timelines before the Adjudicating Authority.",
            "Sentiment": "negative",
            "PublishDate": 1761998225465,
            "Source": "stock"
        },
        {
            "Title": "KRN Heat Exchanger's Subsidiary Commences Bus AC Production in Rajasthan",
            "Summary": "KRN HVAC Products Pvt. Ltd., a wholly-owned subsidiary of KRN Heat Exchanger and Refrigeration Limited, has commenced commercial production and operations of its Bus AC Division at its manufacturing plant in Neemrana, Rajasthan, effective October 15, 2025. The plant is engaged in manufacturing Heat Exchangers and HVAC Products. The company informed stock exchanges BSE and NSE about this development.",
            "Sentiment": "positive",
            "PublishDate": 1760525921515,
            "Source": "stock"
        },
        {
            "Title": "KRN Heat Exchanger Acquires Sphere's Bus Air-Conditioning Division",
            "Summary": "KRN Heat Exchanger and Refrigeration is acquiring the bus air-conditioning division of Sphere Refrigeration Systems through its wholly-owned subsidiary KRN HVAC Products. Under the Business Transfer Agreement, KRN HVAC will take over all operations, assets and employees of the bus air-conditioning business. The acquisition aims to expand KRN's product portfolio in the transport and mobility cooling segment, supporting its strategy to build a diversified HVAC business across industrial, commercial and mobility applications. Chairman and Managing Director Santosh Kumar stated the deal strengthens the company's presence in the automotive HVAC segment and supports its goal to become a complete solutions provider. The company's shares were trading down marginally at ₹838.",
            "Sentiment": "positive",
            "PublishDate": 1759911333805,
            "Source": "order&deals"
        },
        {
            "Title": "KRN Heat Exchanger Acquires Bus Air-Conditioning Division from Sphere Refrigeration Systems",
            "Summary": "KRN Heat Exchanger has acquired the bus air-conditioning division of Sphere Refrigeration Systems. The acquisition expands KRN Heat Exchanger's business operations into the bus air-conditioning segment.",
            "Sentiment": "positive",
            "PublishDate": 1759750427409,
            "Source": "order&deals"
        },
        {
            "Title": "KRN Heat Exchanger Reports Q1 FY26 Results with New Facility Operational",
            "Summary": "KRN Heat Exchanger and Refrigeration Limited reported Q1 FY26 consolidated revenue of INR 118.86 crores with EBITDA of INR 17.59 crores (15.26% margin) and net profit of INR 12.42 crores (10.45% margin). Standalone revenue grew 18.65% year-on-year to INR 117.14 crores with net profit increasing 34.85% to INR 15.69 crores. Export revenue surged 39.04% to INR 18.89 crores, representing 16.4% of total sales. The company commenced commercial operations at its new Neemrana manufacturing facility under subsidiary KRN HVAC Products in May 2025. The subsidiary secured PLI scheme approval for white goods with sanctioned incentive of INR 141.72 crores. Management expects the new facility to operate at 20-25% capacity utilization in the current year, ramping up production from Q3. The company targets achieving 50% export share within three years and expects to receive RIPS approval within the current quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754385879480,
            "Source": "earnings"
        },
        {
            "Title": "KRN Heat Exchanger Reports Mixed Q1 Results with Revenue Growth but Margin Decline",
            "Summary": "KRN Heat Exchanger and Refrigeration reported Q1 consolidated net profit of 124 million rupees, up from 120 million rupees in the same period last year. Revenue increased to 1.15 billion rupees from 958 million rupees year-over-year. However, EBITDA declined slightly to 176 million rupees from 177 million rupees, while EBITDA margin compressed to 15.26% from 18.48% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753960656399,
            "Source": "earnings"
        },
        {
            "Title": "KRN Heat Exchanger: Dolat Capital Initiates 'Buy' Rating on Growth Prospects",
            "Summary": "Dolat Capital initiates 'Buy' rating for KRN Heat Exchanger, citing inexpensive valuation and strong growth outlook. The company achieved 71% EPS CAGR over FY20-FY25, driven by double-digit growth in product sales, increased export revenue, and Ebitda margin expansion.",
            "Sentiment": "positive",
            "PublishDate": 1752034131000,
            "Source": "normal_news"
        },
        {
            "Title": "KRN Heat Exchanger: Rs 600 Crore Investment Plan for Rajasthan",
            "Summary": "KRN Heat Exchanger plans to invest Rs 600 crore in Rajasthan over the next four years, following a Rs 300 crore investment in a new heat exchanger plant. Commercial production at the Neemrana plant began in May, expanding capacity sixfold. The company expects 20% growth this year and projects 60-70% revenue increase in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1751418132000,
            "Source": "corporate_action"
        },
        {
            "Title": "KRN Heat Exchanger Receives ₹142 Crore Incentive Approval",
            "Summary": "KRN Heat Exchanger and Refrigeration has been granted approval for incentives amounting to ₹142 crore. This development suggests potential growth opportunities or support for the company's operations or expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1747293854000,
            "Source": "default"
        },
        {
            "Title": "KRN Heat Exchanger Reports Mixed Q4 Results",
            "Summary": "KRN Heat Exchanger has announced its Q4 financial results. The company's EBITDA increased to 189 million rupees from 176 million rupees year-over-year. However, the EBITDA margin decreased to 14.4% from 21.44% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747040840000,
            "Source": "result"
        },
        {
            "Title": "KRN Heat Exchanger Reports Strong Q4 Financial Results",
            "Summary": "KRN Heat Exchanger has announced its Q4 financial results, showing significant year-over-year growth. The company's revenue increased to 1.3 billion rupees, up from 820 million rupees in the same quarter last year. Additionally, the consolidated net profit rose to 149 million rupees, compared to 120 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747040616000,
            "Source": "result"
        },
        {
            "Title": "KRN Heat Exchanger's Subsidiary Approved as Vendor by Indian Railways",
            "Summary": "KRN Heat Exchanger and Refrigeration's subsidiary, KRN HVAC Products Pvt Ltd, has received approval and recognition as an approved vendor from the Ministry of Railway, Government of India.",
            "Sentiment": "positive",
            "PublishDate": 1742861450000,
            "Source": "corporate_action"
        },
        {
            "Title": "KRN HVAC Products Approved as Vendor by Indian Ministry of Railway",
            "Summary": "KRN HVAC Products Pvt Ltd, a unit of KRN Heat Exchanger and Refrigeration, has received approval and recognition as an approved vendor from the Ministry of Railway, Government of India.",
            "Sentiment": "positive",
            "PublishDate": 1742825350000,
            "Source": "corporate_action"
        },
        {
            "Title": "KRN Heat Exchanger: 6x Capacity Expansion Target by May 2025",
            "Summary": "KRN Heat Exchanger aims to expand capacity by six times by May 2025, with 80-85% utilization expected in three years. The company plans to invest Rs 30-40 crore over three years for line balancing and is open to inorganic growth opportunities. A Rs 1,000 crore MoU with Rajasthan government for a heat exchanger project is part of this expansion plan.",
            "Sentiment": "positive",
            "PublishDate": 1742226406000,
            "Source": "corporate_action"
        },
        {
            "Title": "KRN Heat Exchanger Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "KRN Heat Exchanger has announced its Q3 financial results, showing substantial year-over-year growth. The company's consolidated net profit increased to 137 million rupees, up from 79 million rupees in the same quarter last year, and 123 million rupees in the previous quarter. Revenue for Q3 reached 1.1 billion rupees, compared to 656 million rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1738023401000,
            "Source": "earnings"
        },
        {
            "Title": "KRN Heat Exchanger Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "KRN Heat Exchanger has announced its Q3 financial results, showing substantial year-over-year growth. The company's consolidated net profit increased to 137 million rupees, up from 79 million rupees in the same quarter last year. This also represents a quarter-on-quarter increase from 123 million rupees. Revenue for Q3 reached 1.1 billion rupees, a significant rise from 656 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737988961000,
            "Source": "earnings"
        },
        {
            "Title": "KRN Heat Exchanger And Refrigeration Ltd: Small-Cap Stock Hits 52-Week High Amid Market Decline",
            "Summary": "KRN Heat Exchanger And Refrigeration Ltd's stock rose over 8% to ₹899.50, reaching a 52-week high despite overall market decline. The company has scheduled a board meeting for January 27, 2025, to review Q3 FY2025 financial results.",
            "Sentiment": "positive",
            "PublishDate": 1737443961000,
            "Source": "corporate_action"
        },
        {
            "Title": "KRN Heat Exchanger to Consider Q3 Results",
            "Summary": "KRN Heat Exchanger has announced that it will consider its third quarter (Q3) financial results on January 27. This indicates that the company is preparing to review and potentially approve its quarterly financial performance report.",
            "Sentiment": "neutral",
            "PublishDate": 1737385775000,
            "Source": "earnings"
        },
        {
            "Title": "KRN Heat Selected for PLI Scheme in White Goods Sector",
            "Summary": "KRN Heat has been chosen under the Production Linked Incentive (PLI) Scheme for White Goods, specifically for air conditioners (ACs) and LED lights. The company has committed to an investment of Rs 141.72 crore as part of this selection.",
            "Sentiment": "positive",
            "PublishDate": 1737356500000,
            "Source": "corporate_action"
        },
        {
            "Title": "KRN Heat Exchangers: Mukul Agrawal Acquires 1.6% Stake, Stock Surges",
            "Summary": "Ace investor Mukul Agrawal has acquired a 1.61% stake (10 lakh shares) in KRN Heat Exchanger and Refrigeration. The company's stock rose nearly 6% to Rs 775.95 on BSE. KRN Heat Exchanger reported a 42.9% increase in Q2 FY25 net profit and a 27.9% growth in revenue.",
            "Sentiment": "positive",
            "PublishDate": 1737109243000,
            "Source": "block_deals"
        },
        {
            "Title": "Investor Mukul Mahavir Agrawal Acquires 1.6% Stake in KRN Heat Exchanger",
            "Summary": "Investor Mukul Mahavir Agrawal has emerged as a significant shareholder in KRN Heat Exchanger, holding a 1.6% stake as reported in the company's Q3 shareholding pattern. This development indicates a notable investment in the company by a prominent individual investor.",
            "Sentiment": "positive",
            "PublishDate": 1737097736000,
            "Source": "corporate_governance"
        },
        {
            "Title": "KRN Heat Exchanger: Expansion Plans and Government Incentives Boost Growth",
            "Summary": "KRN Heat Exchanger plans to increase capacity by six times over the next three quarters, aided by government incentives. The company will utilize ₹242 crore from its recent IPO for expansion in Neemrana, Rajasthan. The new subsidiary will benefit from a lower 15% tax rate. KRN's revenue grew 16.4% and net profit rose 24.6% in the first half of FY25. The stock has gained 76% since Q2 results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1736124409000,
            "Source": "corporate_action"
        },
        {
            "Title": "KRN Heat Exchanger: Capacity Expansion Drives Stock Surge",
            "Summary": "KRN Heat Exchanger's stock has gained 60% since Q2 results announcement, with plans to increase capacity six-fold over the next three quarters. The company is expanding its Neemrana facility to cater to new markets, including railway electric engines and refrigeration companies in Europe and the US. KRN's revenue grew 16.4% and net profit rose 24.6% in H1 FY25.",
            "Sentiment": "positive",
            "PublishDate": 1735567914000,
            "Source": "normal_news"
        },
        {
            "Title": "KRN Heat Exchanger Acquires Shares in KRN HVAC Products",
            "Summary": "KRN Heat Exchanger and Refrigeration has purchased shares of its subsidiary, KRN HVAC Products, worth 2.36 billion rupees. The acquired entity specializes in manufacturing condensers, evaporators, and other related products for the HVAC industry.",
            "Sentiment": "positive",
            "PublishDate": 1732581624000,
            "Source": "corporate_action"
        },
        {
            "Title": "KRN Heat Exchanger Acquires Shares in Subsidiary KRN HVAC Products",
            "Summary": "KRN Heat Exchanger and Refrigeration has purchased shares worth 2.36 billion rupees in its subsidiary, KRN HVAC Products. The acquired entity specializes in manufacturing condensers, evaporators, and other related products for the HVAC (Heating, Ventilation, and Air Conditioning) industry.",
            "Sentiment": "positive",
            "PublishDate": 1732543403000,
            "Source": "corporate_action"
        },
        {
            "Title": "KRN Heat Exchanger: 6x Capacity Expansion to Boost Exports",
            "Summary": "KRN Heat Exchanger is building a new facility with 6 times current capacity under subsidiary KRN HVAC Products Pvt. The Rs 240 crore expansion aims to increase exports, particularly to North America and Europe. Operations at the new facility are expected to begin in April 2025, with production starting in Q2 FY26. The company plans to set up a US warehouse next year and is targeting improved margins through increased exports and solar power integration.",
            "Sentiment": "positive",
            "PublishDate": 1731383916000,
            "Source": "corporate_action"
        },
        {
            "Title": "KRN Heat Exchanger: Shares Surge 40% Post Strong Q2 Results",
            "Summary": "KRN Heat Exchanger and Refrigeration shares jumped 40% in five days following Q2 FY2024-25 results. The company reported a 39% YoY revenue increase, crossing ₹100 crore in standalone revenues. Consolidated net profit grew 43% YoY to ₹12.37 crore, with improved EBITDA margins. The company's subsidiary plans a ₹1,000 crore investment in Rajasthan.",
            "Sentiment": "positive",
            "PublishDate": 1730973362000,
            "Source": "result"
        },
        {
            "Title": "KRN Heat Exchanger Reports Q2 EBITDA Growth",
            "Summary": "KRN Heat Exchanger and Refrigeration has reported improved financial performance for the second quarter. The company's EBITDA increased to 181 million rupees from 135 million rupees in the same period last year. Additionally, the EBITDA margin improved to 19.88% from 18.95% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730273908000,
            "Source": "result"
        },
        {
            "Title": "KRN Heat Exchanger and Refrigeration Reports Q2 Revenue Growth",
            "Summary": "KRN Heat Exchanger and Refrigeration has reported a revenue of 911 million rupees for the second quarter, compared to 712 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730273797000,
            "Source": "result"
        },
        {
            "Title": "KRN Heat Exchanger and Refrigeration Reports Q2 Profit Increase",
            "Summary": "KRN Heat Exchanger and Refrigeration has reported a consolidated net profit of 123 million rupees for the second quarter, up from 86 million rupees in the same period last year. This represents a significant year-over-year increase in profitability for the company.",
            "Sentiment": "positive",
            "PublishDate": 1730273764000,
            "Source": "result"
        },
        {
            "Title": "KRN Heat: ₹1,000 Crore MoU for Heat Exchanger Plant in Rajasthan",
            "Summary": "KRN HVAC Products Pvt. Ltd., a subsidiary of KRN Heat Exchanger and Refrigeration Ltd, signed an MoU with the Rajasthan government to invest ₹1,000 crore in a heat exchanger manufacturing project in Kotputli-Behror. The project, set to start operations in 2024, is expected to create 600 direct jobs.",
            "Sentiment": "positive",
            "PublishDate": 1729939524000,
            "Source": "corporate_action"
        }
    ]
}