{
    "Symbol": "KRONOX",
    "ISIN": "INE0ATZ01017",
    "News": [
        {
            "Title": "KRONOX Lab Sciences Board Meet Set for Feb 14",
            "Summary": "KRONOX Lab Sciences Limited has scheduled its Board of Directors meeting for February 14, 2026, to consider and approve Q3FY26 unaudited standalone financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770629132228,
            "Source": "co_actions_results"
        },
        {
            "Title": "KRONOX Lab Sciences Reports Strong Financial Performance with Revenue of Rs 4,981.97 Lakhs",
            "Summary": "KRONOX Lab Sciences Limited announced its quarterly and half-year financial results ended September 30, 2025. The company reported revenue from operations of Rs 2,553.32 lakhs for the quarter and Rs 4,981.97 lakhs for the half-year. Profit after tax reached Rs 1,129.96 lakhs for the quarter and Rs 2,546.70 lakhs for the half-year. The Board of Directors approved the standalone unaudited financial results during their meeting. The company operates in manufacturing of high purity specialty fine chemicals as its single reportable segment. KRONOX Lab Sciences had completed its IPO which was 100% Offer for Sale (OFS) and declared a final dividend of 5% for FY24-25 in September 2025. The results were reviewed by statutory auditors and recommended by the audit committee.",
            "Sentiment": "positive",
            "PublishDate": 1762902221766,
            "Source": "earnings"
        },
        {
            "Title": "Kronox Lab Science Reports Growth in Q2 Net Profit and Revenue",
            "Summary": "Kronox Lab Science reported net profit of 67 million rupees for Q2, compared to 65 million rupees in the same period last year. The company's Q2 revenue reached 255 million rupees, up from 248 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762863314606,
            "Source": "earnings"
        },
        {
            "Title": "Kronox Lab Sciences Receives Approval for Unit-IV Building Construction in Dahej",
            "Summary": "Kronox Lab Sciences has received approval for its Unit-IV building project in Dahej. The approval represents a regulatory clearance for the company's expansion plans at the location.",
            "Sentiment": "positive",
            "PublishDate": 1762778001363,
            "Source": "stock"
        },
        {
            "Title": "Kronox Lab Sciences Receives Environmental Clearance for Unit-IV Construction at Dahej",
            "Summary": "Kronox Lab Sciences Limited has received environmental clearance from the Central Government for construction of its Unit-IV at Dahej. The company had previously obtained various approvals from different authorities and the environmental clearance was the pending approval mentioned during the Annual General Meeting held on August 18, 2025. With this approval, the company has now completed all necessary statutory approvals required for the Unit-IV construction project.",
            "Sentiment": "positive",
            "PublishDate": 1758624217776,
            "Source": "stock"
        },
        {
            "Title": "KRONOX Lab Sciences Reports Mixed Q1 Results with Sequential Recovery but YoY Decline",
            "Summary": "KRONOX Lab Sciences Limited reported quarterly results with total income of ₹370.06 crore, showing a 2.3% quarter-on-quarter increase but a 5.2% year-on-year decline. Net profit after tax reached ₹4.75 crore, marking a significant 94.7% sequential improvement, though remaining 65.1% lower than the previous year. Earnings per share stood at ₹1.52, nearly doubling from the previous quarter but down 65.1% year-on-year. The company's paid-up equity share capital remained unchanged at ₹15.62 crore. While the results indicate sequential recovery in profitability, the company continues to face year-on-year pressures on both revenue and profits.",
            "Sentiment": "neutral",
            "PublishDate": 1755064242219,
            "Source": "earnings"
        },
        {
            "Title": "Kronox Lab Science Reports Flat Net Profit, Revenue Declines in Q1",
            "Summary": "Kronox Lab Science reported Q1 net profit of 63 million rupees, unchanged from the same period last year. The company's Q1 revenue was 243 million rupees compared to 261 million rupees in the previous year, representing a decline in top-line performance.",
            "Sentiment": "neutral",
            "PublishDate": 1754915011881,
            "Source": "earnings"
        },
        {
            "Title": "KRONOX Lab Sciences Reappoints Key Directors and Announces AGM Book Closure Dates",
            "Summary": "KRONOX Lab Sciences Limited has reappointed three key executives for three-year terms effective September 1, 2025. Ketan Ramani continues as Managing Director, bringing over three decades of chemical industry experience in finance, purchase and administration. Jogindersingh Jaswal and Pritesh Ramani have been reappointed as Whole Time Directors, with Jaswal handling production, quality control and HR activities, while Pritesh Ramani manages sales and marketing operations. The company announced its share register will close from August 9-18, 2025 for the 16th Annual General Meeting scheduled for August 18, 2025, which will consider approval of final dividend for financial year 2024-25. Additionally, the company has appointed new auditors including M/s. Devesh Pathak & Associates as Secretarial Auditor for five years, M/s. Jaimin & Associates as Internal Auditor, and M/s. Diwanji & Associates as Cost Auditor for 2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1753447286947,
            "Source": "corporate_governance"
        },
        {
            "Title": "KRONOX Lab Sciences Board Approves 16th AGM, Director Reappointments and Auditor Changes",
            "Summary": "KRONOX Lab Sciences Limited's Board of Directors approved convening the 16th Annual General Meeting on August 18, 2025. The board recommended reappointment of three key executives: Jogindersingh Jaswal as Chairman and Managing Director, and Ketan Ramani and Pritesh Ramani as Whole-time Directors, all for three-year terms effective September 1, 2025. The company set book closure dates from August 9-18, 2025 for AGM purposes and determining final dividend entitlement. The board recommended appointing M/s. Devesh Pathak & Associates as Secretarial Auditors for five years (2025-26 to 2029-30), reappointed M/s. Jaimin & Associates as Internal Auditors for 2025-26, and appointed M/s. Diwanji & Associates as Cost Auditors for 2025-26. The board also approved amendments to the company's Code of Practices for Fair Disclosure of Unpublished Price Sensitive Information.",
            "Sentiment": "neutral",
            "PublishDate": 1753446762454,
            "Source": "corporate_action"
        },
        {
            "Title": "Kronox Lab Sciences Reports Q4 Financial Results",
            "Summary": "Kronox Lab Sciences has released its Q4 financial results. The company's EBITDA for Q4 was 77 million rupees, compared to 79 million rupees in the same quarter last year. The EBITDA margin decreased to 29.62% from 35.44% year-over-year. Net profit for Q4 increased to 63 million rupees from 59 million rupees in the previous year and 65 million rupees in the previous quarter. Q4 revenue rose to 261 million rupees from 222 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747914286000,
            "Source": "result"
        },
        {
            "Title": "KRONOX LAB SCIENCE Reports Stable Q3 Net Profit, Slight Revenue Decline",
            "Summary": "KRONOX LAB SCIENCE has reported its Q3 financial results. The company's net profit remained steady at 65 million rupees, unchanged from the same period last year. However, revenue saw a slight decrease, dropping to 240 million rupees from 249 million rupees in the previous year's Q3.",
            "Sentiment": "neutral",
            "PublishDate": 1738326220000,
            "Source": "earnings"
        }
    ]
}