{
    "Symbol": "KROSS",
    "ISIN": "INE0O6601022",
    "News": [
        {
            "Title": "KROSS Limited Q3FY26 IPO Monitoring Report Filed",
            "Summary": "KROSS Limited submitted monitoring agency report for Q3FY26 showing ₹2,197.04 million utilized from IPO proceeds with no deviations from stated objects.",
            "Sentiment": "neutral",
            "PublishDate": 1769700726428,
            "Source": "stocks"
        },
        {
            "Title": "Kross Limited Q3FY26 Results Call on Jan 30",
            "Summary": "Kross Limited announces earnings conference call scheduled for January 30, 2026 at 12:00 PM IST to discuss Q3FY26 unaudited standalone financial results with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1769177971737,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kross Limited Rectifies Audit Committee Composition",
            "Summary": "Kross Limited corrected the designation of Kunal Rai from 'member' to 'Permanent Invitee' in its Audit Committee composition, following an inadvertent error in its November 2025 intimation to stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1768819693488,
            "Source": "stocks"
        },
        {
            "Title": "Kross Limited Launches Tipping Jacks for Trailers",
            "Summary": "Kross Limited introduces new 'Tipping Jacks' product in trailer segment, targeting 800 units monthly production capacity by FY 2027 for domestic and international markets.",
            "Sentiment": "positive",
            "PublishDate": 1766362661690,
            "Source": "stocks"
        },
        {
            "Title": "Kross Limited Launches Tipping Jacks for Trailers",
            "Summary": "Kross Limited announces the launch of Tipping Jacks in the trailer segment, targeting production capacity of 800 units per month by FY2027 for both domestic and international markets.",
            "Sentiment": "positive",
            "PublishDate": 1766143339981,
            "Source": "stocks"
        },
        {
            "Title": "Kross Limited's Credit Ratings Withdrawn After Company Surrenders Bank Facilities",
            "Summary": "CARE Ratings Limited withdrew all credit ratings assigned to Kross Limited's bank facilities with immediate effect on December 4, 2025, after the company surrendered these facilities with no outstanding amounts. The withdrawal was initiated following receipt of No Objection Certificates from respective banks whose facilities were previously rated by Care Edge.",
            "Sentiment": "neutral",
            "PublishDate": 1764931446358,
            "Source": "corporate_action"
        },
        {
            "Title": "Kross Limited Reports 6% Revenue Decline in Q2 FY26 Amid Commercial Vehicle Slowdown",
            "Summary": "Kross Limited posted quarterly revenues of INR 130.9 crores, down 6% year-on-year, with EBITDA at INR 14.8 crores and margins at 11.3%, as GST rate cut announcements led customers to postpone purchases impacting the CV business. The company is progressing with capacity expansion initiatives including extrusion plant trials and tipping jack production, while exports grew 24% year-on-year contributing 4.2% of H1 FY26 revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1763625551423,
            "Source": "earnings"
        },
        {
            "Title": "Kross Limited Reports 6% Revenue Decline in Q2FY26 Despite Strong Export Growth and Capacity Expansion",
            "Summary": "Kross Limited's quarterly results showed revenue of ₹130.9 crore, down 6% from Q2FY25, with EBITDA at ₹14.8 crore and margin of 11.3%, as GST rate cuts led customers to postpone purchases impacting the commercial vehicle business. The company is expanding capacity with extrusion plant trials underway and export business contributing 4.2% of H1FY26 revenue, up 24% year-on-year, while entering the tipping jack segment and targeting 5% export contribution for the full year.",
            "Sentiment": "neutral",
            "PublishDate": 1763206870701,
            "Source": "earnings"
        },
        {
            "Title": "Kross Limited Schedules Earnings Conference Call for Q2FY26 Results",
            "Summary": "Kross Limited will host an earnings conference call on November 17, 2025, at 10:00 AM IST to discuss its unaudited standalone financial results for the quarter and half-year ended September 30, 2025. The call will be attended by senior management including Chairman and Managing Director Sudhir Rai, Whole Time Director Sumeet Rai, and Whole Time Director and CFO Kunal Rai. The company has provided universal access numbers and international toll-free numbers for participants from various countries including Hong Kong, Singapore, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1762593087260,
            "Source": "earnings"
        },
        {
            "Title": "Kross Limited Promoter Sudhir Rai Acquires Additional 50,000 Shares Through Open Market Purchase",
            "Summary": "Sudhir Rai, Promoter and Chairman and Managing Director of Kross Limited, acquired 50,000 shares representing 0.08% of total paid-up shares through open market purchase on August 18, 2025. Following this acquisition, Rai's total shareholding increased from 2,45,36,733 shares (38.03%) to 2,45,86,733 shares (38.11%) in the company. Kross Limited is listed on BSE Limited and National Stock Exchange of India Limited. The company has an equity share capital of 6,45,09,422 shares with a face value of INR 5 each.",
            "Sentiment": "positive",
            "PublishDate": 1755596647974,
            "Source": "corporate_action"
        },
        {
            "Title": "Kross Limited Reports 40% PAT Growth Despite 5% Revenue Decline in Q1 FY26",
            "Summary": "Kross Limited reported profit after tax growth of approximately 40% to Rs. 10.7 crores for the quarter ended June 2025, with PAT margins improving to 7.7% from 5.2% in the same quarter last year. Revenue stood at Rs. 139.4 crores, reflecting a 5% decline compared to the previous year quarter. EBITDA margins improved to 11.6% from 11.3% in the prior year. The company attributed revenue softness to weak demand in the CV segment, partially offset by strong growth in agriculture and export segments. Export revenue contribution reached 4% in the quarter, keeping the company on track for its full-year export target of 5%. The company's new extrusion line machinery has been delivered with commercial production expected to commence from Q3 FY26, which will expand axle manufacturing capacity from 5,000 to 7,500 units per month. Construction of the seamless tube facility is on track for completion by December 2025, with production targeted to begin in Q4 FY27. The company launched tipping jack products scheduled for October 2025 and introduced car carrier axle and suspension products. Management expects the second half to perform better than the first half, projecting 10-12% top-line growth for the full year.",
            "Sentiment": "positive",
            "PublishDate": 1755175152916,
            "Source": "earnings"
        },
        {
            "Title": "Kross Limited Makes Earnings Call Audio Recording Available to Investors",
            "Summary": "Kross Limited held an earnings conference call on August 11, 2025, to discuss the company's performance for the quarter ended June 30, 2025. The call featured discussions by senior management and included an interactive question and answer session. The company has made an audio recording of the call available on its website at https://www.krosslimited.com/investor-meet for investors and analysts to access.",
            "Sentiment": "neutral",
            "PublishDate": 1754893315667,
            "Source": "earnings"
        },
        {
            "Title": "KROSS Reports Mixed Q1 Results with Higher Profit Despite Revenue Decline",
            "Summary": "KROSS reported quarterly results showing net profit increased to 107 million rupees from 76.6 million rupees year-over-year. However, revenue declined to 1.39 billion rupees from 1.46 billion rupees in the same period last year. EBITDA decreased slightly to 161 million rupees from 165.8 million rupees year-over-year, while EBITDA margin improved to 11.60% from 11.33%.",
            "Sentiment": "neutral",
            "PublishDate": 1754660683504,
            "Source": "earnings"
        },
        {
            "Title": "KROSS Reports Q4 Financial Results",
            "Summary": "KROSS has released its Q4 financial results. The company reported an EBITDA of 268 million rupees, compared to 267 million rupees in the same quarter last year. The EBITDA margin was 14.49%, down from 14.59% year-over-year. Net profit for Q4 stood at 171 million rupees, up from 156 million rupees year-over-year and 136 million rupees quarter-over-quarter. Revenue for Q4 was 1.85 billion rupees, compared to 1.8 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747404604000,
            "Source": "result"
        },
        {
            "Title": "Kross Reports Q3 Profit Growth and Announces New Tube Plant Investment",
            "Summary": "Kross has reported a net profit of 136 million rupees for Q3, showing year-over-year and quarter-over-quarter growth. The company's revenue for Q3 was 1.5 billion rupees, slightly up from the previous year. Additionally, Kross has announced plans to establish a seamless tube plant in Jharkhand with an investment of 1.67 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739146399000,
            "Source": "earnings"
        },
        {
            "Title": "KROSS to Invest 1.67 Billion Rupees in Seamless Tube Plant in Jharkhand",
            "Summary": "KROSS has announced plans to establish a seamless tube manufacturing plant in Jharkhand, India. The company will invest 1.67 billion rupees in this new facility. This investment represents a significant expansion of KROSS's production capabilities and marks a strategic move into the seamless tube market.",
            "Sentiment": "positive",
            "PublishDate": 1738938861000,
            "Source": "corporate_action"
        },
        {
            "Title": "KROSS Reports Decline in Q3 EBITDA and Margin",
            "Summary": "KROSS has reported its Q3 financial results, showing a decrease in both EBITDA and EBITDA margin compared to the same period last year. The company's EBITDA for Q3 was 198 million rupees, down from 209 million rupees in the previous year. The EBITDA margin also declined from 14.03% to 13.19% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738934788000,
            "Source": "earnings"
        },
        {
            "Title": "KROSS Reports Q3 Financial Results",
            "Summary": "KROSS has announced its financial results for the third quarter. The company reported a net profit of 136 million rupees, showing an increase from 117 million rupees year-over-year and 96 million rupees quarter-over-quarter. Revenue for Q3 stood at 1.5 billion rupees, slightly up from 1.48 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738934616000,
            "Source": "earnings"
        },
        {
            "Title": "KROSS Acquires Industrial Land in Jharkhand and Invests in Adityapur Electronic",
            "Summary": "KROSS has announced two significant corporate actions. Firstly, the company has acquired industrial land from Jharkhand Industrial Area Development Authority (JIADA) in Jharkhand. Secondly, KROSS plans to subscribe to shares of Adityapur Electronic for 49.3 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1733314335000,
            "Source": "corporate_action"
        },
        {
            "Title": "KROSS MD Optimistic About Second Half of FY25",
            "Summary": "The Managing Director of KROSS has expressed a positive outlook for the second half of fiscal year 2025. This optimism is based on the increasing momentum in the Medium and Heavy Commercial Vehicle (MHCV) and tractor industries, as well as strong order visibility in the company's pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1731469442000,
            "Source": "normal_news"
        },
        {
            "Title": "Kross: Share Price Surges 9.65% Amid Market Gains",
            "Summary": "Kross shares are trading at ₹209.05, up 9.65% from the previous close. The stock hit a high of ₹212.6 and a low of ₹190.85. Sensex is up 0.59% at ₹79943.11, while Nifty is up 0.39%. The stock is trading above its short and long-term moving averages.",
            "Sentiment": "positive",
            "PublishDate": 1730871274000,
            "Source": "normal_news"
        },
        {
            "Title": "Kross: Shares Down 2.09% Amid Market Decline",
            "Summary": "Kross shares are trading at ₹178, down 2.09% from the previous close. The stock has ranged between ₹185.2 and ₹176 today. Nifty and Sensex are also down by 1.57% and 1.59% respectively. Kross shows decreased MF and FII holdings compared to the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1730699112000,
            "Source": "normal_news"
        },
        {
            "Title": "Kross: Share Price Rises 1.25% Amid Mixed Market",
            "Summary": "Kross shares are trading at ₹173.95, up 1.25% from the previous close. The stock hit a high of ₹174.3 and a low of ₹167.35. Sensex is up 0.34% at ₹80,495.93. Kross has seen decreased MF and FII holdings in the September quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729662952000,
            "Source": "normal_news"
        },
        {
            "Title": "Kross: Share Price Dips 1.9% Amid Market Downturn",
            "Summary": "Kross shares are trading at ₹188.45, down 1.9% from the previous close. The stock has ranged between ₹187.75 and ₹193.95 today. Sensex is down 0.18% at ₹80,857.54, while Nifty is down 0.11%. Mutual fund holdings decreased from 0.61% to 0.33%, and FII holdings dropped from 6.83% to 5.93% in the latest quarter.",
            "Sentiment": "negative",
            "PublishDate": 1729230309000,
            "Source": "normal_news"
        },
        {
            "Title": "Kross: Shares Surge 4.28% Amid Positive Market Sentiment",
            "Summary": "<p>Kross shares are trading at <span class='positive'>₹201.1, up 4.28%</span> from the previous close. The stock hit a <span class='positive'>high of ₹202</span> and a <span class='neutral'>low of ₹195</span>. <b>Sensex is up 0.81% at ₹82,298.23</b>. <br/> Promoter holding is <span class='neutral'>67.70%</span>, with <span class='negative'>decreased MF and FII holdings</span> in the September quarter.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728453096000,
            "Source": "normal_news"
        },
        {
            "Title": "Kross: Shares Rise 1.6% Amid Positive Market Sentiment",
            "Summary": "<p><span class='neutral'>Kross</span> shares are trading at <span class='positive'>₹190.8, up 1.6%</span> from the previous close. The stock hit a <span class='positive'>high of ₹192.1</span> and a <span class='negative'>low of ₹183</span> during the day. <b>Nifty</b> and <b>Sensex</b> are also <span class='positive'>up by 0.49% and 0.39%</span> respectively.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728365536000,
            "Source": "normal_news"
        }
    ]
}