{
    "Symbol": "KRSNAA",
    "ISIN": "INE08LI01020",
    "News": [
        {
            "Title": "Krsnaa Diagnostics Q3FY26 Earnings Call Recording",
            "Summary": "Krsnaa Diagnostics releases audio recording of Q3FY26 earnings conference call held on February 06, 2026, covering quarter ended December 31, 2025 performance.",
            "Sentiment": "neutral",
            "PublishDate": 1770371706439,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krsnaa Diagnostics Q3FY26 Earnings Call on Feb 6",
            "Summary": "Krsnaa Diagnostics has scheduled its Q3FY26 earnings conference call for February 6, 2026, at 12:30 PM IST to discuss quarterly results with management and investor Q&A session.",
            "Sentiment": "neutral",
            "PublishDate": 1769756593594,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krsnaa Diagnostics CFO Pawan Daga Resigns",
            "Summary": "Krsnaa Diagnostics announces CFO Pawan Daga's resignation effective January 19, 2026, after five years of service, citing personal and professional priorities as the reason for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1768489629323,
            "Source": "stocks"
        },
        {
            "Title": "Krsnaa Diagnostics Board Approves ₹430 Cr NCD Issuance",
            "Summary": "Krsnaa Diagnostics board approves issuance of unlisted, secured NCDs worth ₹430 crores on private placement basis with 7-year tenure and half-yearly redemption schedule.",
            "Sentiment": "positive",
            "PublishDate": 1765524153024,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krsnaa Diagnostics Reports 11% Revenue Growth and 29% EBITDA Margin in Q2 FY26",
            "Summary": "Krsnaa Diagnostics achieved revenue of Rs. 206 crores with 11% year-on-year growth and EBITDA of Rs. 60 crores at 29% margin, driven by operational efficiency improvements and retail expansion. The company operates over 200 CT and MRI centers across 18 states and expects meaningful revenue acceleration from Q4 FY25 with Rajasthan PPP project implementation progressing on schedule.",
            "Sentiment": "positive",
            "PublishDate": 1763175243950,
            "Source": "earnings"
        },
        {
            "Title": "Krsnaa Diagnostics Reports 22% Jump in Quarterly Profit to INR 239 Million",
            "Summary": "Krsnaa Diagnostics achieved quarterly profit of INR 239 million, marking a 22% year-over-year increase from INR 196 million. Revenue grew 11% to INR 2,060 million while EBITDA rose 18% to INR 602 million with margins expanding to 29% from 27%. The company served 5.4 million patients and performed 16.4 million tests. Krsnaa operates across 18 states with 120 centers and maintains 57 NABL-accredited pathology labs and 36 NABH-accredited imaging centers. The diagnostic services provider offers testing at rates approximately 70% below market prices across radiology, pathology, and tele-radiology services through its public-private partnership model.",
            "Sentiment": "positive",
            "PublishDate": 1762765820587,
            "Source": "earnings"
        },
        {
            "Title": "Krsnaa Diagnostics Projects 20%+ Revenue Growth Through Center Expansion and AI Integration",
            "Summary": "Krsnaa Diagnostics projects revenue growth exceeding 20% driven by expansion of public-private partnerships and diagnostic centers across India. The company focuses on scaling its radiology and pathology verticals through automation and AI integration. Krsnaa plans to add over 200 centers in the next two years while strengthening business-to-government relationships for margin stability and pursuing an asset-light growth model.",
            "Sentiment": "positive",
            "PublishDate": 1762529715302,
            "Source": "stock"
        },
        {
            "Title": "Krsnaa Diagnostics Reports Strong Q2 Growth with 22% Revenue Increase",
            "Summary": "Krsnaa Diagnostics delivered robust quarterly performance with consolidated net profit rising to 240 million rupees from 196 million rupees year-over-year. Revenue grew to 2.06 billion rupees compared to 1.86 billion rupees in the same period last year. The company's EBITDA increased to 592 million rupees from 494 million rupees year-over-year, while EBITDA margin improved to 28.74% from 26.52% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762520567865,
            "Source": "earnings"
        },
        {
            "Title": "Krsnaa Diagnostics Scheduled to Meet Abakkus Asset Management",
            "Summary": "Krsnaa Diagnostics has scheduled a meeting with Abakkus Asset Management at 3:30 PM today.",
            "Sentiment": "neutral",
            "PublishDate": 1756971152637,
            "Source": "stock"
        },
        {
            "Title": "Krsnaa Diagnostics Reports 13% Revenue Growth in Q1 FY26, Wins Major Rajasthan PPP Contract",
            "Summary": "Krsnaa Diagnostics Limited reported revenue of INR 1,930 million for Q1 FY26, marking 13% year-over-year growth. The diagnostic services provider achieved EBITDA of INR 524 million with 27% margin and PAT of INR 205 million with 11% margin. EPS increased 14% to INR 6.25 from INR 5.46. The company served 5 million patients and processed 16 million tests during the quarter. Retail touchpoints expanded significantly from 362 to 2,414 year-over-year, now contributing 6% of group revenues. Krsnaa won a major Rajasthan PPP contract involving 42 mother labs, 135 satellite labs, and 1,300+ collection centers, expected to generate INR 300-350 crores in annualized revenue with full operations targeted by FY26. The company added 3 labs, 2 CT scanners and 3 MRI machines in Q1 FY26. Management expects retail business to reach EBITDA breakeven by end of FY26 and target 5-8% contribution to total revenue by FY26, aiming for 18-20% contribution within 2 years.",
            "Sentiment": "positive",
            "PublishDate": 1755612506763,
            "Source": "earnings"
        },
        {
            "Title": "Krsnaa Diagnostics Reports 18.26% Revenue Growth and 37.94% Profit Surge in Q1 Results",
            "Summary": "Krsnaa Diagnostics published its unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue of ₹307.82 crores, representing an 18.26% increase from ₹260.29 crores in the same quarter last year and a 4.37% rise from the previous quarter. Standalone profit after tax reached ₹41.62 crores, marking a significant 37.94% jump from ₹30.17 crores in Q1 FY2025. On a consolidated basis, revenue stood at ₹309.26 crores, up 18.26% year-on-year from ₹261.51 crores. The Board of Directors approved these results on August 11, 2025, and the company trades on NSE under symbol KRSNAA and BSE with scrip code 543328.",
            "Sentiment": "positive",
            "PublishDate": 1755061607986,
            "Source": "earnings"
        },
        {
            "Title": "Krsnaa Diagnostics Plans Major Expansion to 700+ Retail Centers by FY27",
            "Summary": "Krsnaa Diagnostics has announced expansion plans to establish over 700 retail centers and more than 5,000 collection points by FY27. The company aims to achieve double-digit revenue growth through its PPP leadership, low-cost operational model, and nationwide presence. The strategy includes integrating pathology and radiology services, expanding into genomics, and collaborating with hospitals to enhance profit margins and increase market share.",
            "Sentiment": "positive",
            "PublishDate": 1754929389157,
            "Source": "stock"
        },
        {
            "Title": "Krsnaa Diagnostics Reports Higher Q1 Profit and Revenue Growth",
            "Summary": "Krsnaa Diagnostics reported consolidated net profit of 205 million rupees in Q1, up from 179 million rupees in the same period last year. Revenue increased to 1.9 billion rupees from 1.7 billion rupees year-over-year. EBITDA rose to 513 million rupees compared to 427 million rupees previously, while EBITDA margin improved to 26.58% from 25.09% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754920842326,
            "Source": "earnings"
        },
        {
            "Title": "Krsnaa Diagnostics Partners with TCIL and National Health Mission in Rajasthan",
            "Summary": "Krsnaa Diagnostics has entered into a partnership with TCIL (Telecommunications Consultants India Limited) and the National Health Mission in Rajasthan. This collaboration appears to be focused on healthcare services delivery in the state.",
            "Sentiment": "positive",
            "PublishDate": 1754398542429,
            "Source": "stock"
        },
        {
            "Title": "Krsnaa Diagnostics Executes Agreement with Rajasthan Health Mission for Laboratory Services",
            "Summary": "Krsnaa Diagnostics Limited and consortium partner Telecommunications Consultants India Ltd. have executed an agreement with National Health Mission, Rajasthan to provide laboratory services under the Free Diagnostics Initiative using the HUB and SPOKE Model across Rajasthan state. The domestic contract involves providing laboratory services under the free diagnostic initiative, though the company states the contract size cannot be estimated as it is a new project. The agreement follows a previous intimation from July 2025 regarding the Rajasthan tender.",
            "Sentiment": "positive",
            "PublishDate": 1754398392632,
            "Source": "order&deals"
        },
        {
            "Title": "Krsnaa Diagnostics Awarded New License by Rajasthan Government",
            "Summary": "Krsnaa Diagnostics has been awarded a new license by the Rajasthan government to provide free laboratory services. This development comes following a court ruling. The license allows Krsnaa Diagnostics to operate and offer diagnostic services at no cost to patients in Rajasthan.",
            "Sentiment": "positive",
            "PublishDate": 1751898871000,
            "Source": "default"
        },
        {
            "Title": "Krsnaa Diagnostics Recommends Dividend",
            "Summary": "Krsnaa Diagnostics has recommended a dividend of 2.75 rupees per share to its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1747058714000,
            "Source": "result"
        },
        {
            "Title": "Krsnaa Diagnostics Reports Q4 Financial Results",
            "Summary": "Krsnaa Diagnostics announced its Q4 financial results. The company's EBITDA increased to 530 million rupees from 437 million rupees year-over-year. The EBITDA margin was 28.48% compared to 26.25% in the previous year. Consolidated net profit rose to 207 million rupees from 187 million rupees year-over-year and 194 million rupees quarter-over-quarter. Revenue for Q4 grew to 1.86 billion rupees from 1.66 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747058664000,
            "Source": "result"
        },
        {
            "Title": "Krsnaa Diagnostics to Consider Q4 Results on May 12",
            "Summary": "Krsnaa Diagnostics has announced that it will consider its fourth quarter (Q4) financial results on May 12. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746453929000,
            "Source": "default"
        },
        {
            "Title": "Krsnaa Diagnostics Reports Improved Q3 EBITDA and Margin",
            "Summary": "Krsnaa Diagnostics has reported a significant improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 451 million rupees, up from 374 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin expanded to 25.85% from 23.62% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739353962000,
            "Source": "earnings"
        },
        {
            "Title": "Krsnaa Diagnostics Reports Q3 Revenue Growth",
            "Summary": "Krsnaa Diagnostics has reported a revenue of 1.7 billion rupees for the third quarter, compared to 1.58 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739353944000,
            "Source": "earnings"
        },
        {
            "Title": "Krsnaa Diagnostics Reports 49% Increase in Q3 Net Profit",
            "Summary": "Krsnaa Diagnostics has announced its financial results for the third quarter, reporting a consolidated net profit of 194 million rupees. This represents a significant increase of approximately 49% compared to the same period last year when the company reported a net profit of 130 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739353901000,
            "Source": "earnings"
        },
        {
            "Title": "Krsnaa Diagnostics to Meet with Abakkus Asset Management",
            "Summary": "Krsnaa Diagnostics has scheduled a meeting with Abakkus Asset Management, an investment firm owned by Sunil Singhania, on December 13. This meeting suggests potential discussions regarding investment or strategic matters between the two entities.",
            "Sentiment": "neutral",
            "PublishDate": 1733907688000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Krsnaa Diagnostics Acquires 10% Stake in Apulki Healthcare SPV",
            "Summary": "Krsnaa Diagnostics has acquired a 10% stake in Apulki Healthcare SPV. This acquisition represents a strategic move by Krsnaa Diagnostics to expand its presence in the healthcare sector.",
            "Sentiment": "neutral",
            "PublishDate": 1733708042000,
            "Source": "corporate_action"
        },
        {
            "Title": "Krsnaa Diagnostics Reports Strong Q2 Financial Performance",
            "Summary": "Krsnaa Diagnostics has reported significant year-over-year improvements in its Q2 financial results. The company's EBITDA increased from 318 million rupees to 494 million rupees. Additionally, the EBITDA margin expanded from 20.46% to 26.52%.",
            "Sentiment": "positive",
            "PublishDate": 1729868839000,
            "Source": "result"
        },
        {
            "Title": "Krsnaa Diagnostics Reports Strong Q2 Financial Results",
            "Summary": "Krsnaa Diagnostics has announced its Q2 consolidated financial results. The company's net profit increased to 196 million rupees, up from 105 million rupees year-over-year and 179 million rupees quarter-over-quarter. Revenue also saw growth, reaching 1.86 billion rupees compared to 1.55 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1729868691000,
            "Source": "result"
        },
        {
            "Title": "Krsnaa Diagnostics: Expands Diagnostic Services in Ranchi Through PPP Agreements",
            "Summary": "<p><span class='positive'>Krsnaa Diagnostics</span> has secured two <span class='positive'>public-private partnership (PPP) agreements</span> in <b>Ranchi</b>. One with <span class='neutral'>RINPAS</span> for <span class='neutral'>radiology and pathology services</span>, and another with <span class='neutral'>Sadar Hospital</span> for <span class='neutral'>radiology services</span>. Both involve <span class='positive'>supplying, installing, and operating</span> <b>CT</b> and <b>MRI</b> equipment.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728572904000,
            "Source": "normal_news"
        },
        {
            "Title": "Krsnaa Diagnostics Secures Agreement for Radiology Services in Ranchi",
            "Summary": "<p><span class='positive'>Krsnaa Diagnostics</span> has received a <span class='positive'>signed agreement</span> from the Medical Superintendent in <b>Ranchi</b> to <span class='neutral'>commission, install, operate, and maintain</span> radiology services. This contract represents a <span class='positive'>significant business opportunity</span> for the company to <span class='positive'>expand</span> its diagnostic services in the Ranchi area.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728566541000,
            "Source": "corporate_action"
        }
    ]
}