{
    "Symbol": "KRYSTAL",
    "ISIN": "INE0QN801017",
    "News": [
        {
            "Title": "Krystal Integrated Services Seeks Shareholder Approval",
            "Summary": "Krystal Integrated Services Limited issues postal ballot notice for increasing authorized share capital from Rs. 15 crores to Rs. 19 crores and approval for Rs. 300 crores QIP fundraising through remote e-voting.",
            "Sentiment": "positive",
            "PublishDate": 1769748408327,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krystal Integrated Services Q3FY26 Results & QIP Plan",
            "Summary": "Krystal Integrated Services reports Q3FY26 consolidated revenue of ₹3,058.56 million with net profit of ₹158.99 million. Board approves ₹300 crore QIP and authorised capital increase to ₹19 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769081590537,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krystal Integrated Services Forms New Waste Management Unit",
            "Summary": "Krystal Integrated Services Limited incorporated wholly owned subsidiary Krystal Waste Work Prabhag F Private Limited on January 20, 2026, with ₹1.00 lakh capital for municipal waste management contract.",
            "Sentiment": "positive",
            "PublishDate": 1768973298682,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krystal Integrated Services Forms New Subsidiary",
            "Summary": "Krystal Integrated Services Limited incorporates wholly owned subsidiary Krystal Waste Work Prabhag G Private Limited with ₹1.00 lakh capital for waste management operations under Vasai Virar Municipal Corporation contract.",
            "Sentiment": "positive",
            "PublishDate": 1768913372109,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krystal Integrated Services Wins ₹275 Cr Waste Mgmt Deal",
            "Summary": "Krystal Integrated Services secured three municipal solid waste management contracts worth ₹275 crores from Vasai Virar City Municipal Corporation for five-year operations across three zones.",
            "Sentiment": "positive",
            "PublishDate": 1768241303346,
            "Source": "stocks"
        },
        {
            "Title": "Krystal bags ₹275-cr waste management contract",
            "Summary": "Krystal Integrated Services secures three municipal solid waste management contracts from Vasai-Virar City Municipal Corporation worth ₹275 crore over five years, covering comprehensive sanitation services.",
            "Sentiment": "positive",
            "PublishDate": 1768228454343,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krystal Wins ₹275 Cr Municipal Sanitation Contracts",
            "Summary": "Krystal Integrated Services secures three major municipal solid waste management contracts from Vasai-Virar City Municipal Corporation worth approximately ₹275.00 crores over five years.",
            "Sentiment": "positive",
            "PublishDate": 1768221120940,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krystal Integrated Services Wins ₹275 Cr Waste Contracts",
            "Summary": "Krystal Integrated Services secured three municipal solid waste management contracts worth ₹275 crore from Vasai Virar City Municipal Corporation for five-year terms across three prabhags.",
            "Sentiment": "positive",
            "PublishDate": 1768218844972,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krystal Integrated Services jumps 7% on ₹275 Cr orders",
            "Summary": "Krystal Integrated Services secured three 5-year waste management contracts worth ₹275 crores from Vasai Virar City Municipal Corporation, boosting stock 7% to ₹668 intraday high.",
            "Sentiment": "positive",
            "PublishDate": 1768217311214,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krystal Wins ₹81 Cr Waste Management Contract",
            "Summary": "Krystal Integrated Services secures 5-year municipal solid waste management contract worth ₹81 crores from Vasai Virar City Municipal Corporation for comprehensive waste collection and transportation services.",
            "Sentiment": "positive",
            "PublishDate": 1768201370224,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krystal Integrated Services Wins ₹81 Cr Contract",
            "Summary": "Krystal Integrated Services secures a significant 5-year solid waste management contract worth ₹81 crores from Vasai Virar City Municipal Corporation, strengthening its municipal services portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1768201247745,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krystal Integrated Services Wins ₹83 Cr Contract",
            "Summary": "Krystal Integrated Services secures significant 5-year waste management contract worth ₹83 crores from Vasai Virar City Municipal Corporation, strengthening municipal services portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1768201227911,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krystal Integrated Services Wins ₹111 Cr Contract",
            "Summary": "Krystal Integrated Services has secured a significant ₹111 crore waste management contract from Vasai Virar City Municipal Corporation spanning five years, marking a major business development for the company.",
            "Sentiment": "positive",
            "PublishDate": 1768201207042,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krystal Wins ₹111 Cr Waste Management Contract",
            "Summary": "Krystal Integrated Services secures 5-year municipal solid waste management contract from Vasai Virar City Municipal Corporation worth approximately ₹111 crores excluding taxes.",
            "Sentiment": "positive",
            "PublishDate": 1768201152041,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krystal Integrated Services Wins ₹83 Cr Waste Contract",
            "Summary": "Krystal Integrated Services Limited secured a 5-year municipal solid waste management contract worth approximately ₹83 crores from Vasai Virar City Municipal Corporation for comprehensive waste collection and street cleaning services.",
            "Sentiment": "positive",
            "PublishDate": 1768201124449,
            "Source": "co_actions_results"
        },
        {
            "Title": "Krystal Integrated Services Updates KMP Contact Details",
            "Summary": "Krystal Integrated Services Limited disclosed updated contact details for Key Managerial Personnel authorized for regulatory disclosures under SEBI Listing Regulations, effective January 03, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767345957141,
            "Source": "stocks"
        },
        {
            "Title": "Krystal Integrated Services Board Meeting Outcome",
            "Summary": "Krystal Integrated Services announced key managerial personnel changes and incorporation of three wholly owned subsidiaries following Board meeting on January 02, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767343453522,
            "Source": "stocks"
        },
        {
            "Title": "Krystal Integrated Services Secures Rs 9 Crore Sanitation Contract from Jindal Steel",
            "Summary": "Krystal Integrated Services Limited secured a 1-year contract worth approximately Rs 9 crore from Jindal Steel Limited for comprehensive cleaning and maintenance of plant toilets at Jindal Nagar in Orissa. The contract involves mechanised housekeeping services including cleaning of toilet premises, urinals, washbasins, shower areas, and maintenance of drainage lines with deployment of trained manpower and equipment.",
            "Sentiment": "positive",
            "PublishDate": 1765279155057,
            "Source": "order&deals"
        },
        {
            "Title": "Krystal Integrated Services Reports 6.5% Revenue Growth in Q2 FY26 Amid Documentation Delays",
            "Summary": "Krystal Integrated Services posted revenue of INR 283.40 crores in Q2 FY26, up 6.5% year-on-year, with EBITDA at INR 17.91 crores despite delays in government tender finalization due to documentation processes. The company secured major contracts worth over INR 800 crores including INR 157 crores from Delhi Education Directorate and INR 168 crores from Andhra Pradesh Medical Education, while maintaining an order book of INR 2,600+ crores.",
            "Sentiment": "neutral",
            "PublishDate": 1763197435684,
            "Source": "earnings"
        },
        {
            "Title": "Krystal Integrated Services Reports Full Utilization of IPO Proceeds in Q2 FY26",
            "Summary": "Krystal Integrated Services Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing complete utilization of its IPO net proceeds of Rs 1,633.69 million. The company had raised Rs 3,001.25 million through its IPO in March 2024, comprising fresh issue proceeds of Rs 1,750 million and offer for sale of Rs 1,251.25 million. CRISIL Ratings Limited, serving as the monitoring agency, confirmed that all funds were deployed according to the prospectus objectives: Rs 100 million for debt repayment (utilized in Q4 FY24), Rs 1,000 million for working capital requirements (utilized in Q1 FY26), Rs 100 million for new machinery purchase (Rs 90.98 million utilized with Rs 9.02 million remaining), and Rs 433.69 million for general corporate purposes (utilized in Q1 FY26). The report indicated no deviations from disclosed objects and confirmed that Rs 6.63 million remains in the public offer account for pending issue-related expenses out of the allocated Rs 199.47 million.",
            "Sentiment": "positive",
            "PublishDate": 1762845197523,
            "Source": "stock"
        },
        {
            "Title": "Krystal Integrated Services Targets 25% Revenue Growth in FY26",
            "Summary": "Krystal Integrated Services has set a target of 25% revenue growth for FY26. The company plans to focus on three key verticals: cleaning, facility management, and security services. The growth strategy includes expanding operations across airports, metro systems, and smart city projects. The company aims to improve margins through increased digital automation and enhanced workforce training programs. Additionally, Krystal is exploring inorganic growth opportunities specifically in high-margin business segments.",
            "Sentiment": "positive",
            "PublishDate": 1762527765767,
            "Source": "stock"
        },
        {
            "Title": "Krystal Integrated Services Reports 6.5% Revenue Growth in Q2 FY26 Despite Margin Pressures",
            "Summary": "Krystal Integrated Services Limited reported revenue of Rs. 2,834 million for the quarter ended September 30, 2025, representing a 6.5% year-over-year increase. However, the company faced profitability challenges with earnings per share declining 13% to Rs. 9.42 and profit after tax dropping 12.7% to Rs. 132 million. EBITDA remained relatively stable at Rs. 179 million with a margin of 6.32%. The company's corporate sector showed strong momentum with 53% revenue growth in H1 FY26, adding 92 new corporate clients during the period. Management attributed temporary moderation in government segment performance to procedural delays in tender finalization rather than demand issues. The integrated facility management services provider maintains operations across 3,317 customer locations through 33 branches and employs over 33,000 on-site workers. The company operates in diverse sectors including healthcare, education, airports, and waste management, with integrated facility management services contributing 42.05% of revenue mix.",
            "Sentiment": "neutral",
            "PublishDate": 1762520125982,
            "Source": "earnings"
        },
        {
            "Title": "Krystal Integrated Services Appoints Dr. Dhananjay Dave as President-Business Development",
            "Summary": "Krystal Integrated Services Limited has appointed Dr. Dhananjay Mayur Dave as President-Business Development. Dr. Dave brings over 35 years of global leadership experience across infrastructure, petrochemicals, clean energy, and facilities management sectors. He will lead business development initiatives, focusing on expanding strategic partnerships, strengthening market presence, and accelerating growth in India and overseas. Dr. Dave previously worked at Tata Consulting Engineers for 27 years, where he spearheaded international business development across 34 countries and helped establish TCE's Qatar subsidiary. He also served at BVG Group, a diversified enterprise with turnover exceeding ₹3,000 crore and workforce of over 100,000, driving global expansion across the US, Middle East, and Africa. CEO Sanjay Dighe stated that Dr. Dave's track record in building international partnerships brings strategic capability needed for the company's next expansion phase. Krystal Integrated Services, established in 2000 and headquartered in Mumbai, is a provider of integrated facility management services. Between FY21 and FY25, the company's customer base grew from 262 to 461, with operations expanding from 1,962 to 3,209 locations nationwide.",
            "Sentiment": "positive",
            "PublishDate": 1762517881296,
            "Source": "corporate_governance"
        },
        {
            "Title": "Krystal Integrated Services Schedules Conference Call to Discuss Q2 and H1 Financial Results",
            "Summary": "Krystal Integrated Services Limited will hold a conference call with analysts and investors on November 11, 2025 at 12:00 noon IST to discuss the operational and financial performance for the quarter and half year ended September 30, 2025. The company will announce its un-audited consolidated and standalone financial results on November 7, 2025. The conference call will feature CEO Sanjay Dighe and CFO Barun Dey as management participants. Dial-in details have been provided for participants from multiple regions including India, USA, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1762466705109,
            "Source": "earnings"
        },
        {
            "Title": "Krystal Integrated Secures Rs 157 Crore Contracts from Delhi Education Department",
            "Summary": "Krystal Integrated has won two mandates valued at approximately Rs 157 crore from the Directorate of Education, Delhi. The contracts represent significant business wins for the company.",
            "Sentiment": "positive",
            "PublishDate": 1759709614644,
            "Source": "stock"
        },
        {
            "Title": "Krystal Integrated Services Wins 83 Crore Cleaning Contract from Delhi Government",
            "Summary": "Krystal Integrated Services has secured a cleaning contract worth 83 crore rupees from the Delhi Government. The contract represents a significant business win for the integrated services company.",
            "Sentiment": "positive",
            "PublishDate": 1759569692958,
            "Source": "stock"
        },
        {
            "Title": "Krystal Integrated Services Secures ₹168 Crore Order",
            "Summary": "Krystal Integrated Services has secured a new order worth ₹168 crores. The company's market capitalization stands at ₹900 crores.",
            "Sentiment": "positive",
            "PublishDate": 1758001415319,
            "Source": "order&deals"
        },
        {
            "Title": "Krystal Integrated Services Incorporates Wholly-Owned Subsidiary for Port Operations",
            "Summary": "Krystal Integrated Services Limited has incorporated a wholly-owned subsidiary named Krystal Ports and Harbour Private Limited on September 6, 2025, in Maharashtra. The subsidiary has an authorized and paid-up share capital of Rs. 1 lakh, with Krystal Integrated Services subscribing to 10,000 equity shares of Rs. 10 each for 100% ownership. The new entity will focus on construction, operation, and maintenance of inland waterways, harbours, ports, jetties, docks, canals, and related marine infrastructure projects. The subsidiary will also undertake dredging, deepening, and maintenance of waterways for navigation, flood control, irrigation, and hydro-power purposes. Three whole-time directors of Krystal Integrated Services - Ms. Neeta Prasad Lad, Mr. Shubham Prasad Lad, and Ms. Saily Prasad Lad - have been appointed as the first directors of the subsidiary. The company stated this move aims to explore new business opportunities and expand its portfolio while reducing risks in existing business lines.",
            "Sentiment": "positive",
            "PublishDate": 1757222393555,
            "Source": "corporate_action"
        },
        {
            "Title": "Krystal Integrated Services Incorporates Wholly Owned Water Resources Subsidiary",
            "Summary": "Krystal Integrated Services Limited has incorporated a wholly owned subsidiary named Krystal Water Resources Private Limited on September 4, 2025, in Maharashtra. The new subsidiary operates in the water industry with an authorized and paid-up share capital of Rs. 1 lakh, comprising 10,000 equity shares of Rs. 10 each. The subsidiary's business focuses on planning, designing, developing, constructing, operating, and maintaining water resource projects including water supply systems, irrigation systems, water treatment plants, desalination plants, wastewater treatment facilities, and related infrastructure. The company aims to explore new business opportunities and expand its portfolio while reducing risks in existing business lines. Three whole-time directors of Krystal Integrated Services - Ms. Neeta Prasad Lad, Mr. Shubham Prasad Lad, and Ms. Saily Prasad Lad - serve as the first directors of the new subsidiary. The subsidiary has not yet commenced business operations.",
            "Sentiment": "positive",
            "PublishDate": 1756988542664,
            "Source": "corporate_action"
        },
        {
            "Title": "Krystal Integrated Services Establishes Waste Management Subsidiary",
            "Summary": "Krystal Integrated Services has formed a new subsidiary named Krystal Waste Works Private Limited with an authorized share capital of ₹1 lakh. The subsidiary will focus on providing waste management services.",
            "Sentiment": "positive",
            "PublishDate": 1756890011721,
            "Source": "stock"
        },
        {
            "Title": "Krystal Integrated Secures ₹370 Crore Order",
            "Summary": "Krystal Integrated has secured an order worth ₹370 crore. The company has a market capitalization of ₹900 crore.",
            "Sentiment": "positive",
            "PublishDate": 1756796303901,
            "Source": "order&deals"
        },
        {
            "Title": "Krystal Integrated Services Wins ₹65 Crore MSEDCL Contract for Power Substation Management",
            "Summary": "Krystal Integrated Services Limited has been awarded a three-year facility management contract worth approximately ₹65 crore by Maharashtra State Electricity Distribution Company Limited (MSEDCL). The contract covers facility management services and operation & maintenance of 33/11 kV, 33/22 kV, and 22/11 kV substations across Maharashtra. Under the agreement, Krystal will oversee substation operations, ensure system uptime, conduct preventive maintenance, and provide rapid emergency response. CEO Sanjay Dighe described the contract as an endorsement of the company's technical expertise and execution capabilities. The contract strengthens Krystal's presence in India's public utilities sector and adds to its expanding public sector portfolio. Krystal Integrated Services, established in 2000 and headquartered in Mumbai, provides integrated facility management services across healthcare, education, government, transportation, and retail sectors. The company's customer base grew from 262 to 461 between FY21 and FY25, with operations expanding from 1,962 to 3,209 locations nationwide.",
            "Sentiment": "positive",
            "PublishDate": 1754396072686,
            "Source": "stock"
        },
        {
            "Title": "Krystal Integrated Secures ₹65 Crore Order",
            "Summary": "Krystal Integrated has secured a new order worth ₹65 crore. The company announced this business development, which represents a significant contract win for the organization.",
            "Sentiment": "positive",
            "PublishDate": 1754379684806,
            "Source": "order&deals"
        },
        {
            "Title": "Krystal Integrated Services Resubmits Q1 FY26 Financial Results Due to Missing Auditor Report Page",
            "Summary": "Krystal Integrated Services Limited issued a corrigendum for its unaudited financial results for the quarter ended June 30, 2025, after inadvertently missing one page of the Consolidated Auditors Report in the original submission. The company resubmitted the complete set of consolidated and standalone financial results with no other changes to the actual financial data. For Q1 FY26, the company reported consolidated revenue from operations of Rs 3,230.81 million and profit after tax of Rs 164.36 million. Basic earnings per share stood at Rs 11.76. The company operates through three main segments: Manpower & Related Services, Information Technology Enabled Services, and Catering Services. The Board meeting was held on July 31, 2025, and the results were reviewed by the Audit Committee and approved by the Board of Directors on the same date.",
            "Sentiment": "neutral",
            "PublishDate": 1753974376730,
            "Source": "earnings"
        },
        {
            "Title": "Krystal Group Approves Q1 2025 Results, Sets Dividend Record Date, and Announces Four New Subsidiaries",
            "Summary": "Krystal Integrated Services Limited's Board approved unaudited financial results for Q1 2025, showing consolidated revenue of Rs 3,230.81 million and profit after tax of Rs 164.36 million. The company set September 2, 2025 as the record date for final dividend eligibility and scheduled its 24th Annual General Meeting for September 16, 2025 via video conferencing. Key management changes include Ms. Mrunalini Salian's designation as Senior Management Personnel and Mr. Milind Jadhav's resignation from President - Group Business Development position. The Board approved incorporation of four wholly-owned subsidiaries: Krystal Power Resources Private Limited, Krystal Ports and Harbour Private Limited, Krystal Waste Works Private Limited, and Krystal Water Resources Private Limited. Additionally, the company dissolved its IPO Committee and Committee of Independent Directors.",
            "Sentiment": "positive",
            "PublishDate": 1753967684938,
            "Source": "corporate_action"
        },
        {
            "Title": "Krystal Group Approves Q1 FY2026 Results, Sets Dividend Record Date, and Incorporates Four New Subsidiaries",
            "Summary": "Krystal Integrated Services Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing revenue from operations of Rs. 3,230.81 million and profit after tax of Rs. 163.33 million. The company set September 2, 2025 as the record date for final dividend eligibility and scheduled its 24th Annual General Meeting for September 16, 2025 via video conferencing. Key management changes include Ms. Mrunalini Salian's appointment as Senior Management Personnel and Mr. Milind Jadhav's resignation from President - Group Business Development due to personal reasons. The Board approved incorporation of four wholly-owned subsidiaries: Krystal Power Resources Private Limited, Krystal Ports and Harbour Private Limited, Krystal Waste Works Private Limited, and Krystal Water Resources Private Limited, each with Rs. 1 lakh authorized capital to explore opportunities in power, port services, waste management, and water resources sectors respectively. The company also dissolved its IPO Committee and Committee of Independent Directors.",
            "Sentiment": "positive",
            "PublishDate": 1753965668950,
            "Source": "earnings"
        },
        {
            "Title": "Krystal Integrated Reports Growth in Q1 Results with Higher Revenue and Profit",
            "Summary": "Krystal Integrated reported quarterly consolidated net profit of 115 million rupees compared to 107 million rupees in the same period last year. Revenue increased to 3.2 billion rupees from 2.57 billion rupees year-over-year. The company's EBITDA rose to 214 million rupees from 150 million rupees, while EBITDA margin improved to 6.62% from 5.83% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753965063420,
            "Source": "earnings"
        },
        {
            "Title": "Krystal Integrated Services Secures 32 Crore Order",
            "Summary": "Krystal Integrated Services has won an order valued at 32 crores. The news briefly mentions the company name and the value of the order secured, without providing additional details about the nature of the order or the client.",
            "Sentiment": "positive",
            "PublishDate": 1752219758000,
            "Source": "default"
        },
        {
            "Title": "Krystal Integrated Services: Secures ₹31.55 Crore Metro Contract in Mumbai",
            "Summary": "Krystal Integrated Services Limited has won a ₹31.55 crore contract from Maha Mumbai Metro Operation Corp. Ltd. for attendant manpower services across multiple metro lines in Mumbai. The three-year agreement covers Lines 2A, 2B, 7, 9, and upcoming lines. This follows a recent two-year housekeeping services contract for Lines 2A and 7.",
            "Sentiment": "positive",
            "PublishDate": 1752216403000,
            "Source": "order&deals"
        },
        {
            "Title": "Krystal Integrated Services Secures ₹20.26 Crore Facility Management Contract for Patna Airport",
            "Summary": "Krystal Integrated Services has been awarded a contract worth ₹20.26 crore for facility management services at the new terminal of Patna Airport. The contract involves managing facilities at the airport's new terminal building.",
            "Sentiment": "positive",
            "PublishDate": 1752141564000,
            "Source": "default"
        },
        {
            "Title": "Krystal Integrated Secures 32 Crore Rupees Order",
            "Summary": "Krystal Integrated has announced securing an order valued at 32 crore rupees. The news indicates a significant business development for the company, potentially boosting its project pipeline and financial outlook.",
            "Sentiment": "positive",
            "PublishDate": 1752052911000,
            "Source": "default"
        },
        {
            "Title": "Krystal Integrated Secures 32.38 Crore Rupee Order",
            "Summary": "Krystal Integrated has obtained an order valued at 32.38 crore rupees. The news briefly mentions the company's name and the order value without providing additional details about the nature of the order or its significance to the company's operations.",
            "Sentiment": "positive",
            "PublishDate": 1751529360000,
            "Source": "default"
        },
        {
            "Title": "Krystal Integrated Services Secures ₹13 Crore Order",
            "Summary": "Krystal Integrated Services has obtained a new order valued at ₹13 crore. No further details about the order or its nature were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750930928000,
            "Source": "default"
        },
        {
            "Title": "Krystal Integrated Services Secures 202.6 Million Rupee Contract",
            "Summary": "Krystal Integrated Services has been awarded a contract valued at approximately 202.6 million rupees. No further details about the nature of the contract or the client were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747656127000,
            "Source": "default"
        },
        {
            "Title": "Krystal Integrated Recommends Dividend of 1.5 Rupees per Share",
            "Summary": "Krystal Integrated has recommended a dividend of 1.5 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1746020139000,
            "Source": "result"
        },
        {
            "Title": "Krystal Integrated Reports Strong Q4 Financial Results",
            "Summary": "Krystal Integrated has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 269 million rupees from 188 million rupees in the previous year. The EBITDA margin slightly improved to 6.51% from 6.46%. Revenue saw a substantial rise to 4.1 billion rupees, up from 2.9 billion rupees. The consolidated net profit also increased to 119 million rupees from 110 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1746019971000,
            "Source": "result"
        },
        {
            "Title": "Krystal Integrated Secures 348 Crore Rupee Order",
            "Summary": "Krystal Integrated has won a significant order worth 348 crore rupees. The company's current market capitalization stands at 700 crore rupees, making this order a substantial win relative to its size.",
            "Sentiment": "positive",
            "PublishDate": 1744870786000,
            "Source": "default"
        },
        {
            "Title": "Krystal Integrated Secures 4.5 Crore Rupee Contract from SVC Co-operative Bank",
            "Summary": "Krystal Integrated has been awarded a contract worth 4.5 crore rupees by SVC Co-operative Bank. The contract involves providing security services at various offices and branches of the bank across India.",
            "Sentiment": "positive",
            "PublishDate": 1742887565000,
            "Source": "order&deals"
        },
        {
            "Title": "Krystal Integrated Services Terminates Service Agreement with Communicate India",
            "Summary": "Krystal Integrated Services has announced the termination of its service agreement with Communicate India, effective March 21, 2025. The company has stated that this termination will not impact its business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1742639797000,
            "Source": "corporate_action"
        },
        {
            "Title": "Krystal Integrated Secures 103.8 Million Rupee Contract from Maha Mumbai Metro",
            "Summary": "Krystal Integrated has been awarded a contract worth 103.8 million rupees from Maha Mumbai Metro. This development represents a significant business opportunity for the company in the infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1742532798000,
            "Source": "order&deals"
        }
    ]
}