{
    "Symbol": "KSB",
    "ISIN": "INE999A01023",
    "News": [
        {
            "Title": "KSB Limited Confirms Non-Large Corporate Status",
            "Summary": "KSB Limited disclosed to stock exchanges that it does not qualify as a Large Corporate under SEBI regulations, with long-term borrowings below INR 100 crores threshold.",
            "Sentiment": "neutral",
            "PublishDate": 1769763865363,
            "Source": "stocks"
        },
        {
            "Title": "KSB Limited Reports 5.4% Revenue Growth in Third Quarter with Major Contract Wins",
            "Summary": "KSB Limited, a manufacturer of pumps and valves, reported sales of INR 649.6 crores for the third quarter ended September 30, 2025, marking a 5.4% increase over the previous year. For the first nine months of 2025, sales reached INR 1,911.7 crores, up 5.8% compared to the same period last year. The company secured several significant contracts including a INR 5.33 crore power plant project, a INR 53.6 crore export order for a U.S. energy project, and a INR 34.4 crore order for solar pump installations. Other notable achievements include FM Approval for the Etanorm FXM pump, NORSOK Phase 1 certification for its foundry, and Great Place to Work certification with 89% positive employee feedback. The company also released its first Sustainability Report in October 2025 and is working towards reducing greenhouse gas emissions.",
            "Sentiment": "positive",
            "PublishDate": 1763025327466,
            "Source": "earnings"
        },
        {
            "Title": "KSB Limited Reports Quarterly Financial Results for September 2025",
            "Summary": "KSB Limited announced its unaudited financial results for the quarter ended September 30, 2025. On a standalone basis, the company reported total income of Rs 5,581 million and profit for the period of Rs 680 million, with earnings per share of Rs 3.91. On a consolidated basis, total income was Rs 6,541 million with profit of Rs 713 million and earnings per share of Rs 4.09. For the nine months ended September 30, 2025, consolidated revenue from operations reached Rs 19,417 million with profit of Rs 1,298 million. The company operates in two main segments - Pumps (Rs 5,331 million revenue) and Valves (Rs 1,179 million revenue) for the quarter. The results were reviewed by PriceWaterhouseChartered Accountants LLP and approved by the Board of Directors.",
            "Sentiment": "neutral",
            "PublishDate": 1762865356378,
            "Source": "earnings"
        },
        {
            "Title": "KSB Reports Mixed Q2 Results with Higher Profit but Lower EBITDA Margin",
            "Summary": "KSB reported quarterly net profit of 650 million rupees compared to 593 million rupees in the same period last year. Revenue increased to 6.5 billion rupees from 6.16 billion rupees year-over-year. However, EBITDA declined to 848 million rupees from 876 million rupees, while EBITDA margin compressed to 13.1% from 14.21% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762854395241,
            "Source": "earnings"
        },
        {
            "Title": "KSB Limited Presents Growth Strategy at Investors Meet, Targets Sustainable Expansion by 2030",
            "Summary": "KSB Limited held an investors meet on September 11, 2025, presenting its strategic outlook and growth plans. The company operates through three entities in India: KSB Limited (established 1960) with 6 manufacturing plants and 2,191 employees, KSB Tech Pvt Ltd (established 2005) with 332 employees, and KSB MIL Controls Ltd (acquired 1997) with 305 employees. KSB India represents 10% of KSB group's sales with 2,828 total employees. The company holds strong market positions as the 2nd largest pump manufacturer by revenue in India with 12% market share, 2nd largest in gate/globe/check valves with 12% market share, and top 3 in control valves with 9% market share. KSB serves multiple segments including Water/Wastewater (29% sales share), General Industry (23%), Energy (18%), Mining (21%), Petrochemicals & Chemicals (8%), and Building Services (1%). The company reported sales of 312 million euros and order intake of 306 million euros in 2024. KSB outlined strategic pillars focusing on Standard Business, SupremeServ, Solar Pumps, Valves, and Energy segments, with plans for capacity enhancement, supply chain strengthening, and digitization initiatives. The company targets achieving 105 million euros revenue from solar pumps by 2027, maintaining 12-13% return on sales, and achieving 20% gender diversity. ESG initiatives show renewable energy share increased from 20% in FY 2023 to 68% in Q2 FY 2025, with a 71.7% ESG rating from SES.",
            "Sentiment": "positive",
            "PublishDate": 1757591910825,
            "Source": "stock"
        },
        {
            "Title": "KSB Limited Reports Strong H1 Performance with ₹17,381 Million Revenue and Robust Nuclear Order Book",
            "Summary": "KSB Limited reported H1 CY2025 revenue of ₹17,381 million with a 16% CAGR over the last 3 years, and PAT of ₹1,607 million with 20% CAGR. The company maintains a strong order book of ₹26,969 million, split between nuclear (₹13,131 million) and non-nuclear (₹13,836 million) segments. Key highlights include the Shirwal plant receiving 3-Star MBK certification, breakthrough orders for Kudankulam light water reactor, and first export order for Safety Class 2 pumps. The solar business generated ₹134.3 crores in revenue with 13,227 cumulative systems ordered. KSB is investing ₹120-130 crores annually in capacity expansion and has a cash position of ₹316 crores. The company is positioned to benefit from government targets of 22.5 GW nuclear capacity by 2032 and ₹20,000 crore allocation for small modular reactors. Management expressed satisfaction with improved order intake across all quarters compared to the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1756383706281,
            "Source": "earnings"
        },
        {
            "Title": "KSB Limited Reports 6.04% Half-Year Sales Growth with Strong Order Intake Across Key Segments",
            "Summary": "KSB Limited, a leading pumps and valves manufacturer in India, recorded 6.04% growth in half-yearly sales for January to June 2025 compared to the same period in 2024. The company secured several significant orders including boiler feed pumps from L&T for NTPC supercritical power plants, solar pump orders worth ₹46.0 crore from Maharashtra State Electricity Distribution Company and ₹25.3 crore from Haryana Renewable Energy, and export orders for Middle East petrochemical projects. The Wastewater segment achieved 65% year-to-date growth driven by orders from Kolkata Municipal Corporation and newly launched Sewatec pumps. For Q2 2025, the company reported sales of ₹666.7 crore with operating profit margin of 13.7% and net profit of ₹72.7 crore. Half-year results showed sales of ₹1,190.2 crore with net profit of ₹111.7 crore. Vice President Prashant Kumar highlighted strong performance across Power, Solar, Waste Water, Nuclear, and Petrochemicals segments, with export business showing upward trends.",
            "Sentiment": "positive",
            "PublishDate": 1755025569355,
            "Source": "earnings"
        },
        {
            "Title": "KSB Limited Reports 6.04% Half-Year Sales Growth with Strong Order Intake Across Key Segments",
            "Summary": "KSB Limited, a leading pumps and valves manufacturer in India, reported 6.04% growth in half-yearly sales for January to June 2025 compared to the same period in 2024. The company achieved sales of ₹1,190.2 crores in H1 2025 versus ₹1,103.0 crores in H1 2024, with operating profit margin at 12.7% compared to 12.6% in the previous year. Net profit for H1 2025 reached ₹121.7 crores against ₹111.7 crores in H1 2024. Key highlights include securing prestigious orders for boiler feed pumps from L&T for NTPC supercritical power plants, solar pump orders worth ₹71.3 crores from Maharashtra and Haryana state companies, and export orders for Middle East petrochemical projects. The wastewater segment showed strong performance with 65% year-to-date growth driven by orders from Kolkata Municipal Corporation and newly launched Sewatec pumps. The company reported robust order intake across power, solar, wastewater, nuclear, and petrochemical segments.",
            "Sentiment": "positive",
            "PublishDate": 1754804076858,
            "Source": "earnings"
        },
        {
            "Title": "KSB Reports Mixed Q1 Results with Revenue and Profit Growth Despite Margin Decline",
            "Summary": "KSB reported quarterly results showing revenue growth to 6.66 billion rupees from 6.46 billion rupees year-over-year. Net profit increased to 727 million rupees compared to 686 million rupees in the same period last year. EBITDA rose to 914 million rupees from 906 million rupees year-over-year. However, EBITDA margin declined to 13.71% from 14.02% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754565840471,
            "Source": "earnings"
        },
        {
            "Title": "KSB Limited Submits Unaudited Financial Results for Quarter and Half Year Ended June 30, 2025",
            "Summary": "KSB Limited submitted its unaudited financial results and limited review report for the quarter and half year ended June 30, 2025. The results were accompanied by a limited review report issued by auditors Price Waterhouse Chartered Accountants, LLP, Pune. The board meeting was held from 2:00 p.m. to 4:00 p.m. IST on August 7, 2025. Company Secretary Shraddha Kavathekar signed and submitted the documents to BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1754565448069,
            "Source": "earnings"
        },
        {
            "Title": "KSB Ltd. Block Trade: 183,813 Shares Sold for Rs. 16.23 Crores",
            "Summary": "A block trade of approximately 183,813 shares of KSB Ltd. took place on the National Stock Exchange (NSE). The total value of the trade was Rs. 16.23 Crores, with each share priced at Rs. 882.85.",
            "Sentiment": "neutral",
            "PublishDate": 1752467461000,
            "Source": "block_details"
        },
        {
            "Title": "KSB Receives Letter of Award Worth 253.4 Million Rupees",
            "Summary": "KSB has been awarded a letter of award valued at 253.4 million rupees. No further details about the nature of the award or the project were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747401227000,
            "Source": "default"
        },
        {
            "Title": "KSB Receives Significant Order for Critical Pumps from Parent Company",
            "Summary": "KSB has announced the receipt of a significant order for critical pumps from its parent company, KSB SE & Co. KGaA, Germany. This order represents a notable business transaction between the subsidiary and its parent company, potentially indicating strong demand or a strategic move within the group.",
            "Sentiment": "positive",
            "PublishDate": 1746719965000,
            "Source": "default"
        },
        {
            "Title": "KSB Reports Strong Q4 Financial Results",
            "Summary": "KSB has announced its Q4 financial results, showing year-over-year improvements across key metrics. Revenue increased to 5.95 billion rupees from 5.4 billion. EBITDA rose to 678 million rupees from 609 million, with the EBITDA margin expanding to 11.39% from 11.2%. Net profit also grew to 490 million rupees from 431 million in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1746004361000,
            "Source": "result"
        },
        {
            "Title": "KSB Ltd: Q4 Profit Surges 33%, Announces ₹4 Final Dividend",
            "Summary": "KSB Ltd reported a 33% YoY increase in Q4 net profit to ₹73 crore. Revenue grew 20.5% YoY to ₹726.4 crore. EBITDA rose 26.5% YoY to ₹85 crore with margins expanding to 11.7%. The board recommended a final dividend of ₹4 per share for FY2024, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1740659065000,
            "Source": "earnings"
        },
        {
            "Title": "KSB Limited Declares Dividend of 4 Rupees per Share",
            "Summary": "KSB Limited has announced a dividend of 4 rupees per share for its shareholders. This corporate action represents a distribution of the company's profits to its investors.",
            "Sentiment": "positive",
            "PublishDate": 1740657416000,
            "Source": "corporate_action"
        },
        {
            "Title": "KSB Reports Improved Q3 EBITDA and Margin",
            "Summary": "KSB has announced its Q3 financial results, showing an increase in EBITDA from 809 million rupees to 984 million rupees year-over-year. The company's EBITDA margin also improved slightly from 13.43% to 13.55% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1740657364000,
            "Source": "earnings"
        },
        {
            "Title": "KSB Reports Strong Q3 Financial Performance",
            "Summary": "KSB has announced its Q3 financial results, showing significant year-over-year growth. The company's net profit increased to 699 million rupees, up from 528 million rupees in the same quarter last year. This also represents a quarter-over-quarter increase from 593 million rupees. Revenue for Q3 rose to 7.3 billion rupees, compared to 6 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1740657312000,
            "Source": "earnings"
        },
        {
            "Title": "KSB: Q3 Profit Soars 23%, Revenue Up 9% YoY",
            "Summary": "KSB reported Q3 2024 results with profit up 23.15% YoY to ₹61.7 crore and revenue rising 9.37% YoY to ₹616.5 crore. However, QoQ performance declined with revenue down 4.57% and profit falling 9.4%. Operating income increased 27.41% YoY despite a 4.4% QoQ decrease. EPS dropped 75.3% YoY to ₹3.55. Analysts maintain a Strong Buy rating.",
            "Sentiment": "positive",
            "PublishDate": 1731567530000,
            "Source": "result"
        },
        {
            "Title": "KSB Reports Improved Q2 EBITDA and Margin",
            "Summary": "KSB has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 703 million rupees to 876 million rupees. Additionally, KSB's EBITDA margin expanded from 12.47% to 14.21% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731502606000,
            "Source": "result"
        },
        {
            "Title": "KSB Reports 10% Revenue Growth in Q2",
            "Summary": "KSB, a company likely in the industrial or manufacturing sector, has reported its second quarter revenue. The company's revenue for Q2 stood at 6.16 billion rupees, compared to 5.6 billion rupees in the same quarter of the previous year, indicating a year-over-year growth of approximately 10%.",
            "Sentiment": "positive",
            "PublishDate": 1731502495000,
            "Source": "result"
        },
        {
            "Title": "KSB Reports Q2 Net Profit Increase",
            "Summary": "KSB has reported a net profit of 593 million rupees for the second quarter, showing a year-over-year increase from 481 million rupees. However, this represents a decrease from the previous quarter's profit of 686 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1731502447000,
            "Source": "result"
        }
    ]
}