{
    "Symbol": "KSCL",
    "ISIN": "INE455I01029",
    "News": [
        {
            "Title": "Kaveri Seed Shares Q3FY26 Management Commentary",
            "Summary": "Kaveri Seed Company Limited releases management commentary on unaudited financial results for quarter and nine months ended December 31, 2025, providing audio link for investor access.",
            "Sentiment": "neutral",
            "PublishDate": 1770723988957,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kaveri Seed Company Q3 FY26 Earnings Call on Feb 10",
            "Summary": "Kaveri Seed Company Limited announces earnings conference call scheduled for February 10, 2026 at 3:00 PM IST to discuss Q3 FY26 results with Executive Director Mr. C Mithun Chand.",
            "Sentiment": "neutral",
            "PublishDate": 1769768569657,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kaveri Seeds Plans Portfolio Diversification to Reduce Cotton Dependency",
            "Summary": "Kaveri Seeds is implementing a strategic shift to strengthen its non-cotton seed portfolio by focusing on maize, rice, and vegetable seeds. The company is expanding its research and development efforts to develop climate-resilient seed varieties and pursuing export market opportunities along with hybridization programs. This diversification strategy is designed to reduce the company's dependence on cotton seeds while targeting double-digit growth and margin recovery through its expanded product offerings.",
            "Sentiment": "positive",
            "PublishDate": 1762441161357,
            "Source": "stock"
        },
        {
            "Title": "Kaveri Seed Company Reports Q2 FY2025-26 Results with Double-Digit Revenue Growth",
            "Summary": "Kaveri Seed Company Limited announced its Q2 FY2025-26 results. The company achieved double-digit growth in revenues and EBITDA during H1 FY25. The board recommended a 250% dividend of Rs. 5 per equity share on a face value of Rs. 2 per equity share. Maize volumes increased by 29.7% with revenues growing 56.76%. Cotton sales were impacted by increased illegal cottonseed usage and higher production costs affected overall profit growth. Hybrid rice volumes grew 0.9% with revenues up 21.48%, though sales were affected by restrictions in Punjab. Selection rice volumes increased 2.60% with revenues up 11.07%. Vegetable seed revenues increased 31.06%. The contribution of new products to cotton volumes increased from 11% to 36%. Standalone revenue from operations reached Rs. 1041.91 crore in H1 FY26 compared to Rs. 889.85 crore in H1 FY25, representing 17.09% growth. Consolidated revenue from operations was Rs. 1077.43 crore in H1 FY26 versus Rs. 940.67 crore in H1 FY25, showing 14.54% growth.",
            "Sentiment": "positive",
            "PublishDate": 1762438889776,
            "Source": "earnings"
        },
        {
            "Title": "Kaveri Seed Co Reports Wider Q2 Losses Despite Revenue Growth",
            "Summary": "Kaveri Seed Co reported a consolidated net loss of 154 million rupees in Q2 compared to a loss of 7 million rupees in the same period last year. The company's EBITDA loss widened to 63 million rupees from 18.5 million rupees year-over-year. However, quarterly revenue increased to 2.2 billion rupees from 1.37 billion rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762417298593,
            "Source": "earnings"
        },
        {
            "Title": "Kaveri Seed Company Reports 17% Revenue Growth in Q1 FY26, Non-Cotton Segments Drive Performance",
            "Summary": "Kaveri Seed Company Limited reported revenue of Rs. 945.31 crores, up 16.98% year-over-year, with net profit rising 11.88% to Rs. 316.50 crores. The company's non-cotton segments showed strong performance with overall volumes up 8% and revenues up 31%. Maize led growth with 21% volume increase and 54% revenue growth, while vegetable seeds saw 28% volume growth and 41% revenue increase. Cotton segment faced challenges with 15% volume decline due to illegal seeds and higher production costs. EBITDA margin declined by approximately 1% due to lower cotton margins. The company expects 20% growth in non-cotton segments and overall company growth of 15-20% over the next 3-5 years. Management highlighted increased R&D investments of Rs. 60 crores annually and expects 30-40% export growth targeting markets in Bangladesh, Tanzania, Vietnam, and Philippines.",
            "Sentiment": "positive",
            "PublishDate": 1755516929131,
            "Source": "earnings"
        },
        {
            "Title": "Kaveri Seed Company Reports Q1 Results and Announces Key Board Changes",
            "Summary": "Kaveri Seed Company Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs. 94,510.78 lakhs and net profit after tax of Rs. 27,632.66 lakhs for the quarter. Consolidated revenue stood at Rs. 97,269.41 lakhs with net profit of Rs. 28,224.12 lakhs. The Board appointed three directors: Dr. Madhushree Gundavaram as Non-Executive and Non-Independent Director, Dr. Govinda Rajulu Chintala as Non-Executive Independent Director, and re-appointed Dr. Rayappa Ramappa Hanchinal as Independent Director for a second term. All appointments are for five-year terms and subject to shareholder approval. The company scheduled its 38th Annual General Meeting for September 23, 2025, via video conference. M/s. L.D. Reddy & Co was appointed as Secretarial Auditor for five years from FY 2025-26 to FY 2029-30.",
            "Sentiment": "positive",
            "PublishDate": 1755078554173,
            "Source": "earnings"
        },
        {
            "Title": "Kaveri Seed Company Reports Strong Q1 Growth with Net Profit Rising to 3.3 Billion Rupees",
            "Summary": "Kaveri Seed Company delivered robust quarterly performance with consolidated net profit increasing to 3.3 billion rupees from 2.9 billion rupees year-over-year. Revenue grew to 8.6 billion rupees compared to 8 billion rupees in the same period last year. The company's EBITDA rose to 3.38 billion rupees from 2.95 billion rupees, while EBITDA margin expanded to 39.4% from 36.76% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1755077702166,
            "Source": "earnings"
        },
        {
            "Title": "India's Agriculture District Development Plan Budget Set at ₹240 Billion Per Year",
            "Summary": "The Indian government has allocated an annual budget of ₹240 billion for the Agriculture District Development Plan. This significant investment is aimed at supporting and developing the agricultural sector across various districts in India. The news mentions Kaveri Seed in the context of this agricultural development initiative, though the specific role or impact on the company is not detailed in the provided information.",
            "Sentiment": "positive",
            "PublishDate": 1752656841000,
            "Source": "default"
        },
        {
            "Title": "Cabinet Expected to Approve PM Dhan Dhanaya Krishi Yojana for 100 Low-Productivity Districts",
            "Summary": "The Indian Cabinet is anticipated to approve the PM Dhan Dhanaya Krishi Yojana, a scheme targeting 100 low-productivity districts. This initiative aims to improve agricultural productivity in these areas. The news suggests potential positive implications for Kaveri Seeds, likely due to its involvement in the agricultural sector.",
            "Sentiment": "positive",
            "PublishDate": 1752643169000,
            "Source": "default"
        },
        {
            "Title": "Kaveri Seed Co Acquires Stake in Aditya Agritech and Reports Q4 EBITDA Loss",
            "Summary": "Kaveri Seed Co has acquired a 30% equity holding in Aditya Agritech Private Limited. Additionally, the company reported a Q4 EBITDA loss of 165 million rupees, compared to a loss of 119 million rupees in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1747647954000,
            "Source": "result"
        },
        {
            "Title": "Kaveri Seed Co Reports Q4 Financial Results",
            "Summary": "Kaveri Seed Co has reported its Q4 financial results. The company's revenue for the quarter was 903 million rupees, compared to 983 million rupees in the same quarter last year, representing a year-over-year decrease. The company also reported a consolidated net loss of 229 million rupees for Q4, compared to a loss of 2.7 million rupees in the same period last year, indicating a significant increase in losses.",
            "Sentiment": "negative",
            "PublishDate": 1747647879000,
            "Source": "result"
        },
        {
            "Title": "Kaveri Seed Co Reports Improved Q3 EBITDA and Margin",
            "Summary": "Kaveri Seed Co has reported a significant improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 141 million rupees, up from 86 million rupees in the same period last year. Additionally, the EBITDA margin improved to 8.10% from 6.02% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739351837000,
            "Source": "earnings"
        },
        {
            "Title": "Kaveri Seed Co Reports Increased Q3 Consolidated Net Profit",
            "Summary": "Kaveri Seed Co has reported a consolidated net profit of 154 million rupees for the third quarter, compared to 118 million rupees in the same period last year. This represents a year-over-year increase in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1739351828000,
            "Source": "earnings"
        },
        {
            "Title": "Kaveri Seed Co Reports Q3 Revenue Growth",
            "Summary": "Kaveri Seed Co has announced its third-quarter revenue results. The company reported revenue of 1.7 billion rupees, compared to 1.42 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739351785000,
            "Source": "earnings"
        },
        {
            "Title": "Kaveri Seed Co Reports 22.9% Increase in Q3 Consolidated Net Profit",
            "Summary": "Kaveri Seed Co has announced its financial results for the third quarter. The company's consolidated net profit rose to 145 million rupees, up from 118 million rupees in the same period last year, representing a year-over-year increase of 22.9%.",
            "Sentiment": "positive",
            "PublishDate": 1739351727000,
            "Source": "earnings"
        },
        {
            "Title": "Kaveri Seed Company Ltd: Shares Surge 12% on National Seed Mission Announcement",
            "Summary": "Kaveri Seed Company's shares jumped up to 12% following Finance Minister Nirmala Sitharaman's announcement of a National Mission on high yielding seeds and the launch of 100 climate resistant varieties during the Union Budget 2025 speech.",
            "Sentiment": "positive",
            "PublishDate": 1738389007000,
            "Source": "normal_news"
        },
        {
            "Title": "Kaveri Seed Co Reports Q2 EBITDA Loss",
            "Summary": "Kaveri Seed Co has reported an EBITDA loss of 18.5 million rupees in the second quarter, compared to a gain of 113 million rupees in the same period last year. This represents a significant year-over-year decline in the company's operational performance.",
            "Sentiment": "negative",
            "PublishDate": 1731489792000,
            "Source": "result"
        },
        {
            "Title": "Kaveri Seed Co Reports Q2 Revenue Decline",
            "Summary": "Kaveri Seed Co has reported a revenue of 1.37 billion rupees for the second quarter, compared to 1.7 billion rupees in the same period last year, indicating a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731489426000,
            "Source": "result"
        },
        {
            "Title": "Kaveri Seed Co Reports Q2 Net Loss",
            "Summary": "Kaveri Seed Co has reported a consolidated net loss of 7 million rupees for the second quarter, compared to a profit of 137 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731489381000,
            "Source": "result"
        }
    ]
}