{
    "Symbol": "KSL",
    "ISIN": "INE907A01026",
    "News": [
        {
            "Title": "Kalyani Steels Discloses Related Party Agreement Impact",
            "Summary": "Kalyani Steels Limited informed exchanges about a shareholders agreement executed by related party Bharat Forge Limited on February 2, 2026, which imposes non-compete restrictions on ferrous casting business in India.",
            "Sentiment": "neutral",
            "PublishDate": 1770138659275,
            "Source": "stocks"
        },
        {
            "Title": "Kalyani Steels Board Meet Set for Feb 3, 2026",
            "Summary": "Kalyani Steels Limited has scheduled a board meeting on February 3, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window reopens February 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769512580084,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kalyani Steels acquires remaining stake in DGM",
            "Summary": "Kalyani Steels Limited completes acquisition of remaining 10,000 equity shares in DGM Realities Private Limited for ₹1.72 million, making it a wholly owned subsidiary with 100% shareholding.",
            "Sentiment": "positive",
            "PublishDate": 1768301180282,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kalyani Steels Gets Credit Rating Reaffirmation",
            "Summary": "Care Ratings reaffirmed Kalyani Steels' credit ratings with CARE AA- Stable for long-term facilities, CARE A1+ for short-term facilities, and CARE A1+ for commercial paper.",
            "Sentiment": "positive",
            "PublishDate": 1766740150425,
            "Source": "stocks"
        },
        {
            "Title": "Kalyani Steels Completes 8.64% Clean Energy Acquisition",
            "Summary": "Kalyani Steels Ltd has completed its ₹51.9 crore acquisition of 1,857,223 equity shares in Clean Renewable Energy KK 1A Private Limited, securing 8.64% stake for captive renewable energy sourcing.",
            "Sentiment": "positive",
            "PublishDate": 1766726629736,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kalyani Steels Completes Final FCD Conversion, Increases Stake in DGM Realties to 99.92%",
            "Summary": "Kalyani Steels converted its fourth and final tranche of 1,600,000 Fully Convertible Debentures worth Rs. 160 million into equity shares of subsidiary DGM Realties Private Limited on November 30, 2025. The conversion increased Kalyani Steels' shareholding in the real estate subsidiary from 99.91% to 99.92%, completing the full conversion of all FCDs held since 2015.",
            "Sentiment": "neutral",
            "PublishDate": 1764478905592,
            "Source": "corporate_action"
        },
        {
            "Title": "Kalyani Steels Independent Director Sachin K. Mandlik Completes Second Term",
            "Summary": "Sachin K. Mandlik has ceased to be an Independent Director of Kalyani Steels Limited with effect from November 9, 2025, following the completion of his second term on November 8, 2025. Mandlik was re-appointed for a second term of 3 consecutive years from November 9, 2022 to November 8, 2025, which was approved by members at the Forty-Ninth Annual General Meeting held on August 1, 2022. The company has informed stock exchanges BSE and NSE about this board change.",
            "Sentiment": "neutral",
            "PublishDate": 1762749895866,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kalyani Steels Reports Decline in Q2 Financial Performance",
            "Summary": "Kalyani Steels reported Q2 revenue of 4.6 billion rupees, down from 4.9 billion rupees in the same period last year. The company's net profit decreased to 618 million rupees from 668 million rupees year-over-year. EBITDA fell to 854 million rupees compared to 961 million rupees in the previous year, with EBITDA margin declining to 18.73% from 19.53%.",
            "Sentiment": "negative",
            "PublishDate": 1762241097147,
            "Source": "earnings"
        },
        {
            "Title": "Kalyani Steels Re-appoints Key Directors and Managing Director for Five-Year Terms",
            "Summary": "Kalyani Steels Limited shareholders approved several key appointments at their 52nd Annual General Meeting held on August 22, 2025. The company re-appointed Mr. Amit B. Kalyani and Mrs. Sunita B. Kalyani as directors liable to retire by rotation, effective August 22, 2025. Mr. R.K. Goyal was re-appointed as Managing Director for a five-year term from January 17, 2026 to January 16, 2031. Additionally, M/s SVD & Associates were appointed as Secretarial Auditors for five years, from the conclusion of the 52nd AGM until the 57th AGM in 2030. Mr. Amit B. Kalyani serves as Vice-Chairman and Joint Managing Director of Bharat Forge Limited and is the son of Chairman Mr. B.N. Kalyani and Director Mrs. Sunita B. Kalyani. Mr. R.K. Goyal, an engineering graduate with over 42 years of specialty steel industry experience, has been with the company as Managing Director since 2011.",
            "Sentiment": "positive",
            "PublishDate": 1755869681293,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kalyani Steels Reports Mixed Q1 Results with Revenue Decline but Profit Growth",
            "Summary": "Kalyani Steels reported Q1 revenue of 4.43 billion rupees, down from 4.6 billion rupees in the same period last year. However, the company's net profit increased to 609 million rupees compared to 510 million rupees year-over-year. EBITDA rose to 853 million rupees from 792 million rupees, while EBITDA margin improved to 19.26% from 17.16% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753943851950,
            "Source": "earnings"
        },
        {
            "Title": "Kalyani Steels Schedules Board Meeting for July 31 to Approve Quarterly Financial Results",
            "Summary": "Kalyani Steels Limited has scheduled a Board of Directors meeting on July 31, 2025 to consider and approve the Unaudited Financial Results (Standalone & Consolidated) for the quarter ended June 30, 2025. The company also announced that the Trading Window for designated persons and their immediate relatives, which was closed from July 1, 2025, will reopen on August 3, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753339584423,
            "Source": "corporate_action"
        },
        {
            "Title": "Kalyani Steels: Steady Q1FY26 Expected Despite Global Uncertainties",
            "Summary": "Kalyani Steels anticipates Q1FY26 performance to be in line with Q4FY25, despite US tariff concerns. The company remains on track for its 1-million-tonne-per-annum goal by FY29. Q4FY25 saw revenue of ₹544 crore and net profit of ₹79 crore. The Odisha project details are expected in the first half of FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1746523400000,
            "Source": "earnings"
        },
        {
            "Title": "Kalyani Steels Ltd: Q4 Profit Jumps 27%, 200% Dividend Declared",
            "Summary": "Kalyani Steels reported a 27% increase in Q4 net profit to ₹79.2 crore, with revenue up 8% to ₹544.3 crore. EBITDA grew 27% to ₹114.25 crore, and EBITDA margin expanded by 300 basis points to 21%. The board approved a 200% interim dividend of ₹10 per share.",
            "Sentiment": "positive",
            "PublishDate": 1746435516000,
            "Source": "earnings"
        },
        {
            "Title": "Kalyani Steels Reports Q4 Results and Declares Dividend",
            "Summary": "Kalyani Steels announced its Q4 financial results. Revenue remained stable at 5B rupees year-over-year. EBITDA increased to 1.14B rupees from 902M, with EBITDA margin improving to 20.99% from 17.94%. The company also declared a dividend of 10 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1746433037000,
            "Source": "result"
        },
        {
            "Title": "Kalyani Steels Reports 26.9% Increase in Q4 Net Profit",
            "Summary": "Kalyani Steels has announced its financial results for the fourth quarter, reporting a net profit of 793 million rupees. This represents a significant increase of 26.9% compared to the same period last year when the company posted a net profit of 625 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1746432918000,
            "Source": "result"
        },
        {
            "Title": "Kalyani Steels: Steady Steel Prices Expected Despite Global Pressures",
            "Summary": "Kalyani Steels' Managing Director RK Goyal anticipates stable steel prices despite market pressures. Q3FY25 revenue was ₹484 crore with 17.2% margins. The company expects 20% margins in upcoming quarters, subject to global factors. An MoU with Odisha government for ₹11,750 crore investment is progressing positively. Current cash reserves exceed ₹600 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1738658293000,
            "Source": "earnings"
        },
        {
            "Title": "Kalyani Steels Reports Stable Q3 Revenue",
            "Summary": "Kalyani Steels has reported a third-quarter revenue of 4.8 billion rupees, which remains unchanged compared to the same period in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1738569306000,
            "Source": "earnings"
        },
        {
            "Title": "Kalyani Steels Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Kalyani Steels has reported a decrease in its third-quarter EBITDA, which fell to 833 million rupees from 956 million rupees in the same period last year. The company's EBITDA margin also declined, dropping to 17.21% from 19.92% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738569249000,
            "Source": "earnings"
        },
        {
            "Title": "Kalyani Steels Reports Decrease in Q3 Net Profit",
            "Summary": "Kalyani Steels has reported a net profit of 554 million rupees for the third quarter, compared to 653 million rupees in the same period last year, indicating a year-over-year decrease in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1738569211000,
            "Source": "earnings"
        },
        {
            "Title": "Kalyani Steels Reports Q2 EBITDA and Margin Growth",
            "Summary": "Kalyani Steels has announced its Q2 financial results. The company's EBITDA increased to 961 million rupees from 930 million rupees year-over-year. Additionally, the EBITDA margin improved to 19.53% from 19.39% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730102233000,
            "Source": "result"
        },
        {
            "Title": "Kalyani Steels Reports Slight Revenue Increase in Q2",
            "Summary": "Kalyani Steels has reported a quarterly revenue of 4.9 billion rupees for Q2, compared to 4.8 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "neutral",
            "PublishDate": 1730102198000,
            "Source": "result"
        },
        {
            "Title": "Kalyani Steels Reports Q2 Net Profit Increase",
            "Summary": "Kalyani Steels has announced its Q2 financial results, reporting a net profit of 668 million rupees, up from 583 million rupees in the same quarter last year. This represents a year-over-year increase in profitability for the company.",
            "Sentiment": "positive",
            "PublishDate": 1730102173000,
            "Source": "result"
        }
    ]
}