{
    "Symbol": "KTKBANK",
    "ISIN": "INE614B01018",
    "News": [
        {
            "Title": "Karnataka Bank Allots 17,501 Shares Under ESOS 2018",
            "Summary": "Karnataka Bank Limited has allotted 17,501 equity shares of face value Rs. 10 each to employees who exercised vested stock options under the KBL Employees Stock Option Scheme 2018 on February 9, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770645059097,
            "Source": "co_actions_results"
        },
        {
            "Title": "Karnataka Bank Q3FY26 Earnings Call on Feb 11",
            "Summary": "Karnataka Bank schedules analyst conference call for February 11, 2026 at 3:30 PM IST to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770202740990,
            "Source": "co_actions_results"
        },
        {
            "Title": "Karnataka Bank Re-appoints Two Independent Directors",
            "Summary": "Karnataka Bank's Board approved re-appointment of Dr. D S Ravindran and Mr. Balakrishna Alse S as Independent Directors for three years, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1769529333302,
            "Source": "stocks"
        },
        {
            "Title": "Karnataka Bank faces strike call on Jan 27, 2026",
            "Summary": "Bank unions AIKBEA and KBOO under UFBU banner call for one-day strike on 27.01.2026 demanding 5-day banking week and opposing disinvestment. Normal operations likely to be affected.",
            "Sentiment": "negative",
            "PublishDate": 1769363982815,
            "Source": "stocks"
        },
        {
            "Title": "Karnataka Bank shareholders approve new MD & CEO appointment",
            "Summary": "Karnataka Bank Limited shareholders approved the appointment of Mr. Raghavendra Srinivas Bhat as Managing Director & CEO through postal ballot e-voting with 89.28% votes in favour.",
            "Sentiment": "positive",
            "PublishDate": 1769096807781,
            "Source": "stocks"
        },
        {
            "Title": "DK Shivakumar Highlights Karnataka's Investment Appeal at WEF",
            "Summary": "Karnataka Deputy CM DK Shivakumar at WEF emphasizes Bengaluru as India's investment gateway, highlighting opportunities in technology, healthcare, and AI while noting state contributes 43% of national taxes.",
            "Sentiment": "positive",
            "PublishDate": 1769023456689,
            "Source": "stocks"
        },
        {
            "Title": "Karnataka Bank Wins Multiple IBA Banking Tech Awards",
            "Summary": "Karnataka Bank secured winner position in Best Fintech & DPI Adoption category and runner-up in Best Tech Talent at IBA Banking Technology Awards. Bank also received special mentions in three categories.",
            "Sentiment": "positive",
            "PublishDate": 1768385951498,
            "Source": "stocks"
        },
        {
            "Title": "Karnataka Bank Launches Online Payment for Khajane 2",
            "Summary": "Karnataka Bank introduces digital payment facility for Khajane 2 government receipts, enhancing convenience for citizens making government payments through online banking platform.",
            "Sentiment": "positive",
            "PublishDate": 1768316859188,
            "Source": "stocks"
        },
        {
            "Title": "Karnataka Bank Reconfirms Key Appointments",
            "Summary": "Karnataka Bank reconfirms Sham K as Company Secretary and Compliance Officer since February 2023, along with Integrated Registry Management Services as RTA under SEBI LODR compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1767680670356,
            "Source": "stocks"
        },
        {
            "Title": "Karnataka Bank Issues Postal Ballot for MD-CEO Appointment",
            "Summary": "Karnataka Bank completes dispatch of postal ballot notice seeking shareholder approval for Raghavendra Srinivas Bhat's appointment as MD-CEO with compensation up to ₹4.50 crores annually.",
            "Sentiment": "neutral",
            "PublishDate": 1765814845019,
            "Source": "stocks"
        },
        {
            "Title": "Karnataka Bank Appoints Raghavendra Bhat as MD & CEO for One Year",
            "Summary": "Karnataka Bank appointed Raghavendra S Bhat as Managing Director & CEO for one year effective November 16, 2025, following his three-month interim role since July 16, 2025. The appointment comes after resignations of former leadership and amid challenging quarterly results showing 5.06% decline in net profit to ₹319.22 crore and 18.15% stock decline year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1763217675628,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karnataka Bank Reports 9.1% Sequential Growth in Q2 PAT Despite Margin Pressures",
            "Summary": "Karnataka Bank posted PAT of INR 319.12 crores in Q2 FY26, up 9.1% quarter-on-quarter from INR 292.40 crores, while focusing on retail, agriculture and MSME segments amid strategic portfolio shift. The bank faced margin compression with NIM declining to 2.72% from 2.82% due to repo rate cuts impacting 77% of its EBLR-linked loan book, though asset quality improved with gross NPA reducing to 3.33% from 3.46%.",
            "Sentiment": "positive",
            "PublishDate": 1763209731147,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karnataka Bank Holds Investor Meetings at G200 Summit in Mumbai",
            "Summary": "Karnataka Bank representatives conducted physical group and one-on-one meetings with analysts and institutional investors at G200 Summit at Taj Santacruz, Mumbai on November 13, 2025, organized by Anand Rathi Institutional Equities. The bank shared publicly available information with participants including PGIM India Asset Management, Motilal Oswal Asset Management, Bugle Rock Capital Private Limited, and J Curve Capital.",
            "Sentiment": "neutral",
            "PublishDate": 1763045920111,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karnataka Bank Allots 33,500 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Karnataka Bank allotted 33,500 equity shares with a face value of Rs. 10 each to employees who exercised their vested stock options under the KBL Employees Stock Option Scheme 2018. The allotment was approved by the Managing Director CEO and completed on November 12, 2025. The bank informed both NSE and BSE about this allotment as part of its regulatory disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1762995976333,
            "Source": "corporate_action"
        },
        {
            "Title": "Karnataka Bank Reports Net Profit of Rs 319.12 Crore in Q2FY26, Up 9.1% Quarter-on-Quarter",
            "Summary": "Karnataka Bank posted a quarterly net profit of Rs 319.12 crore for the quarter ended September 2025, marking a 9.1% increase from Rs 292.40 crore in the previous quarter ended June 2025. For the half-year ended September 2025, net profit stood at Rs 611.52 crores, compared to Rs 736.40 crores in the same period last year. The bank's Net Interest Income for the quarter was Rs 728.12 crore. Asset quality improved with Gross NPAs reducing to 3.33% from 3.46% in June 2025, while Net NPAs decreased to 1.35% from 1.44%. The bank's aggregate business stood at Rs 1,76,461.34 crore compared to Rs 1,77,509.19 crore in Q1FY26. Deposits were Rs 1,02,817.19 crore versus Rs 1,03,242.17 crore in the previous quarter, while gross advances stood at Rs 73,644.15 crore compared to Rs 74,267.02 crore. The Credit-Deposit ratio was 71.63% and Capital Adequacy Ratio improved to 20.84% from 20.46% in June 2025. Managing Director CEO Raghavendra S. Bhat noted the bank witnessed marginal quarterly decline in topline performance but achieved improvement in asset quality, with continued focus on RAM segments and strengthening low-cost deposits.",
            "Sentiment": "positive",
            "PublishDate": 1762604087400,
            "Source": "earnings"
        },
        {
            "Title": "Karnataka Bank Reports Decline in Q2 Net Profit and Revenue",
            "Summary": "Karnataka Bank's Q2 net profit decreased to 3.19 billion rupees from 3.36 billion rupees year-over-year. Revenue also declined to 21.79 billion rupees compared to 22.34 billion rupees in the same period last year. The bank's provisions reduced significantly to 200.7 million rupees from 313.3 million rupees year-over-year. Asset quality showed improvement with gross NPA ratio decreasing to 3.33% from 3.46% quarter-over-quarter, and net NPA ratio falling to 1.35% from 1.44% quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762602000735,
            "Source": "earnings"
        },
        {
            "Title": "Karnataka Bank Schedules Q2 FY26 Earnings Conference Call for November 10, 2025",
            "Summary": "Karnataka Bank has scheduled an audio conference call with analysts and institutional investors for November 10, 2025, at 4:00 PM IST. The call follows the bank's board meeting to consider unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. The bank has provided dial-in details including universal and international toll-free numbers for participation. A presentation for analysts and institutional investors will be filed with stock exchanges and hosted on the bank's website after the financial results declaration. Audio recording and transcript of the meeting will also be made available on the stock exchanges and the bank's website.",
            "Sentiment": "neutral",
            "PublishDate": 1762249331141,
            "Source": "earnings"
        },
        {
            "Title": "Karnataka Bank Chief Product Officer Ramaswamy Subramanian Resigns",
            "Summary": "Karnataka Bank announced that Ramaswamy Subramanian has resigned from his position as Chief Product Officer. He was relieved from the bank's services effective October 31, 2025, following completion of internal formalities. Subramanian ceases to be a Senior Management Personnel of the bank from the close of business hours on October 31, 2025. The bank informed stock exchanges NSE and BSE about this development under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1761916657782,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karnataka Bank Assigns Additional Branch Banking Charge to Chief Human Resources Officer",
            "Summary": "Karnataka Bank has allocated additional charge of the Branch Banking Department to Mr. Niranjankumar R, who serves as Chief Human Resources Officer. The additional responsibility is effective from October 30, 2025, and will continue until further orders. Mr. Niranjankumar R originally joined Karnataka Bank as Chief Human Resources Officer on June 10, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1761852763743,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karnataka Bank's Head of Treasury Ramachandra K Gurumurthy Resigns",
            "Summary": "Karnataka Bank announced that Ramachandra K Gurumurthy, Head of Treasury, has been relieved from the bank's services effective October 23, 2025, following the completion of internal formalities. Gurumurthy ceases to be a Senior Management Personnel of the bank from the close of business hours on the same date. The bank informed stock exchanges NSE and BSE about this resignation under regulatory disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1761228834322,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karnataka Bank Promotes 12 Senior Executives, Restructures Management Roles",
            "Summary": "Karnataka Bank announced significant changes in its senior management structure effective October 13, 2025. Five Deputy General Managers were promoted to General Manager Cadre (Scale VII): Raghuram H S (Chief Risk Officer), Chandrashekara G (Credit Sanctions), Sunil Rao B (Treasury Operations), Sham K (Company Secretary), and Sreedhar S (Chennai Regional Head). Seven Assistant General Managers were promoted to Deputy General Manager Cadre (Scale VI), including Bhaskar A, Gayathri S, Ashok Shenoy U, Sudha K, Rama Seshu K, Vadiraja K, and Nagaraja H A. The bank also implemented role reallocations, with several executives moving to different departments and regional positions. Additionally, three General Managers received new functional responsibilities: Ravichandran S moved to Legal & Recovery Department, Nagaraja Upadhyaya B was assigned to Credit Sanctions Department, and Raghavendra C L was transferred to Credit Sanctions Department at Head Office.",
            "Sentiment": "positive",
            "PublishDate": 1760364173266,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karnataka Bank Head of Treasury Ramachandra K Gurumurthy Resigns Due to Personal Reasons",
            "Summary": "Karnataka Bank announced that Ramachandra K Gurumurthy has resigned from his position as Head of Treasury due to personal reasons. Gurumurthy submitted his resignation letter dated October 3, 2025, requesting immediate effect. The bank stated it will inform about management changes and the actual exit date after completing internal formalities. In his resignation letter, Gurumurthy described his tenure as challenging and fulfilling, thanking senior executives for opportunities and support provided during his time with the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1760111132001,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karnataka Bank Appoints Raghavendra Srinivas Bhat as Managing Director & CEO, Re-appoints Two Directors",
            "Summary": "Karnataka Bank shareholders approved key board appointments at their 101st Annual General Meeting held on September 23, 2025. Raghavendra Srinivas Bhat was appointed as Managing Director and CEO for three months starting July 16, 2025, or until a regular MD & CEO is appointed. Bhat brings 38 years of experience with Karnataka Bank, having started as a clerk in 1981 and rising to Chief Operating Officer before retiring in 2019. The bank also re-appointed B R Ashok as Non-Executive Director until August 26, 2027, and Uma Shankar as Non-Executive Independent Director for three years starting November 1, 2025. Ashok is a chartered accountant with over 40 years of experience, while Shankar is a former Executive Director of Reserve Bank of India with 37 years of RBI experience. All three directors have been confirmed as not debarred by SEBI or other authorities.",
            "Sentiment": "positive",
            "PublishDate": 1758633835960,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karnataka Bank Amends Articles of Association for Power of Attorney Appointments",
            "Summary": "Karnataka Bank approved amendments to its Articles of Association at its 101st Annual General Meeting held on September 23, 2025. The key change involves Article 51(e) regarding the appointment of power of attorney. The amendment modifies the authority structure from a combination of any two of three General Managers from specific departments (Branch Banking, HR & IR, or Legal and Recovery) to jointly by a combination of any two of three heads of the Human Resource Department. In both cases, the Managing Director & CEO retains sole authority in their absence. The changes were approved through special resolution by the bank's members.",
            "Sentiment": "neutral",
            "PublishDate": 1758633410746,
            "Source": "corporate_action"
        },
        {
            "Title": "Karnataka Bank Appoints Vijayakumar P H as New Chief Financial Officer",
            "Summary": "Karnataka Bank has appointed Vijayakumar P H as Chief Financial Officer effective September 15, 2025, replacing Abhishek Sankar Bagchi whose tenure ends September 14, 2025. Vijayakumar P H has been promoted to General Manager and joins as CFO after 25 years with the bank, starting as a Probationary Officer in May 2000. He holds qualifications including Bachelor of Commerce, Chartered Accountant, and CAIIB certification. His experience spans various roles in Treasury & Accounts, Inspection & Audit, and Finance departments. He was promoted to Deputy General Manager in March 2021 and has been handling Finance & Accounts portfolio since then. Both executives will transition their Key Managerial Personnel and Senior Management Personnel status accordingly.",
            "Sentiment": "neutral",
            "PublishDate": 1757694202826,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karnataka Bank Conducts Roadshow with Analysts and Institutional Investors",
            "Summary": "Karnataka Bank held a roadshow interaction with analysts and institutional investors on September 11, 2025. The event was arranged by Nuvama Institutional Equities and included both physical group meetings and one-on-one sessions from 10:00 AM to 5:00 PM IST. Participants included representatives from Axis Mutual Fund, Quant Mutual Fund, Ashmore Investment Advisors India, Bandhan Mutual Fund, 360 One WAM Limited, and Vallum Capital. The bank discussed publicly available information that was presented in a document accessible on their website. The bank confirmed that only information already in the public domain was shared with the analysts and institutional investors.",
            "Sentiment": "neutral",
            "PublishDate": 1757594704601,
            "Source": "stock"
        },
        {
            "Title": "Karnataka Bank Appoints Raja B S as Chief Operating Officer on Two-Year Contract",
            "Summary": "Karnataka Bank has appointed Raja B S as Chief Operating Officer (COO) in the rank of Chief General Manager for a two-year contract period starting September 4, 2025. Raja B S joined Karnataka Bank as a Probationary Officer in July 1990 and has held various positions including Branch Head, Chief Manager, Regional Head, and Department Head across multiple locations and departments. He was promoted to General Manager in March 2021 and handled portfolios including Branch Banking, HR, Credit Marketing, Legal and Recovery, and Operations departments. He opted for voluntary retirement on September 3, 2025, and assumed charge as COO the following day. He will serve as Senior Management Personnel of the bank.",
            "Sentiment": "positive",
            "PublishDate": 1756978819750,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karnataka Bank Sets September 16, 2025 as Record Date for Dividend Payment",
            "Summary": "Karnataka Bank Ltd has fixed September 16, 2025 as the record date for dividend payment. The bank will hold its 101st Annual General Meeting on September 23, 2025 at 11:30 AM via video conferencing. The dividend payment is subject to shareholder approval at the AGM and will be disbursed on or after September 29, 2025 if approved.",
            "Sentiment": "positive",
            "PublishDate": 1755874249486,
            "Source": "corporate_action"
        },
        {
            "Title": "Board Approves Re-appointment of Uma Shankar as Independent Director for Three Years",
            "Summary": "The Board of Directors approved the re-appointment of Mrs. Uma Shankar as a Non-Executive Independent Director for three years, effective from November 1, 2025. Her current tenure ends on October 31, 2025, and the new term will run until October 31, 2028. The re-appointment requires shareholder approval through a special resolution. Mrs. Uma Shankar is a former Executive Director of Reserve Bank of India with over 37 years of experience in financial sector supervision, currency management, and foreign exchange. She holds a Post-Graduate degree in English Literature, is a Certified Associate of the Indian Institute of Bankers, and completed Executive Education at Columbia Business School. She has served on the bank's board since November 1, 2020, and has been confirmed as not being debarred from holding directorship by SEBI or other authorities.",
            "Sentiment": "positive",
            "PublishDate": 1755873508954,
            "Source": "corporate_action"
        },
        {
            "Title": "Karnataka Bank Reports Decline in Q1 Profit and Rising NPAs",
            "Summary": "Karnataka Bank's Q1 net profit dropped to 2.9 billion rupees from 4 billion rupees year-over-year. Revenue decreased slightly to 22.6 billion rupees from 22.78 billion rupees compared to the same period last year. The bank's asset quality deteriorated with Gross Non-Performing Assets (GNPA) rising to 3.46% from 3.08% quarter-over-quarter, while Net Non-Performing Assets (NNPA) increased to 1.44% from 1.31% in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1755005849614,
            "Source": "earnings"
        },
        {
            "Title": "Karnataka Bank Reallocates Functional Responsibility for General Manager Raja B S",
            "Summary": "Karnataka Bank has announced a change in functional responsibility for a senior management executive. Mr. Raja B S, General Manager and Head of Branch Banking Department, has been given additional charge of the Operations Department. The reallocation is effective from August 5, 2025, and will continue until further orders. Mr. Raja B S joined the bank as a Probationary Officer in 1990 and has worked at various branches across India as Branch Head and in various back-office departments at the executive cadre.",
            "Sentiment": "neutral",
            "PublishDate": 1754403288703,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karnataka Bank Chief Product Officer Ramaswamy Subramanian Resigns",
            "Summary": "Karnataka Bank announced that Mr. Ramaswamy Subramanian has resigned from his position as Chief Product Officer. His resignation was accepted on August 1, 2025. The bank stated that details regarding the management change and the actual exit date will be communicated after completing internal formalities.",
            "Sentiment": "neutral",
            "PublishDate": 1754045721269,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karnataka Bank Announces Retirement of Two Senior Management Officials",
            "Summary": "Karnataka Bank announced the retirement of two senior management officials effective July 31, 2025, due to superannuation. Mrs. Sumana Ghate, General Manager and Head of Operations Department, and Mr. Nagaraja Aithal, Deputy General Manager of Credit Monitoring Department, retired from their positions. Mrs. Ghate also handled Credit Sanctions Department for exposures up to Rs. 15 crores. Both officials have ceased to be Senior Management Personnel of the Bank following their retirement.",
            "Sentiment": "neutral",
            "PublishDate": 1753967636199,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karnataka Bank Reallocates Senior Management Responsibilities for General Manager Sreenivas M",
            "Summary": "Karnataka Bank has announced a change in functional responsibilities for Mr. Sreenivas M, General Manager. He is transitioning from his role as Head of Retail Lending, SME, MSME & Agri Business to become the overall in-charge of the Credit Marketing Department. The reallocation took effect on July 29, 2025. Mr. Sreenivas M is described as a banking professional with over 23 years of diverse managerial expertise in secured and unsecured lending operations.",
            "Sentiment": "neutral",
            "PublishDate": 1753789137424,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karnataka Bank Head of Wholesale & Mid-Corporate Banking Resigns",
            "Summary": "Karnataka Bank announced that Giridhar Rajaram, Head of Wholesale & Mid-Corporate Banking, has resigned from his position. His resignation was accepted on July 18, 2025, and he was relieved from services on July 25, 2025, after completing internal formalities. With his departure, Rajaram ceased to be a Senior Management Personnel of the bank. The bank communicated this change to stock exchanges NSE and BSE as part of regulatory disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1753446229219,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karnataka Bank: COO Appointed as Interim MD & CEO",
            "Summary": "Karnataka Bank has appointed Raghavendra Srinivas Bhat, its COO, as interim MD & CEO for three months starting July 16, 2025. This follows the resignation of the previous MD and executive director due to a board conflict. Bhat will serve until a permanent replacement is found.",
            "Sentiment": "neutral",
            "PublishDate": 1752540291000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karnataka Bank: Management Exodus Triggers Downgrade",
            "Summary": "Emkay Global downgraded Karnataka Bank to 'Add' from 'Buy' and cut its price target by 15% to ₹220 following the resignation of the MD & CEO and Executive Director. The departures stem from Board-level differences over a ₹1.5 crore consultancy spend. A search committee has been formed to find replacements.",
            "Sentiment": "negative",
            "PublishDate": 1751335765000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karnataka Bank Reports Strong Capital Adequacy Ratio",
            "Summary": "Karnataka Bank has reported a capital adequacy ratio exceeding 19.85%, indicating that the bank is strongly capitalized.",
            "Sentiment": "positive",
            "PublishDate": 1751274497000,
            "Source": "default"
        },
        {
            "Title": "Karnataka Bank Refutes Recent News Report, Affirms Financial Strength",
            "Summary": "Karnataka Bank has issued a clarification regarding recent news, asserting its strength and resilience. The bank has labeled the report in question as malicious, suggesting it contains false or misleading information.",
            "Sentiment": "positive",
            "PublishDate": 1751274461000,
            "Source": "default"
        },
        {
            "Title": "Karnataka Bank's MD & CEO and Executive Director Resign",
            "Summary": "Karnataka Bank has announced that its Board of Directors has accepted the resignation of Srikrishnan Hari Hara Sarma from his position as Managing Director & CEO. Additionally, Executive Director Sekhar Rao has also resigned from his role. The bank has not provided any further details regarding the reasons for these resignations or any succession plans.",
            "Sentiment": "negative",
            "PublishDate": 1751251560000,
            "Source": "default"
        },
        {
            "Title": "Karnataka Bank: Top Executives Resign Citing Personal Reasons",
            "Summary": "Karnataka Bank's Managing Director & CEO Hari Hara Sarma and Executive Director Sekhar Rao have resigned, effective July 15 and July 31 respectively. The bank has formed a search committee to find replacements and appointed a new COO starting July 2.",
            "Sentiment": "neutral",
            "PublishDate": 1751245497000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karnataka Bank: Top Executives Resign Amid Audit Concerns",
            "Summary": "Karnataka Bank's MD Srikrishnan Hari Hara Sarma and ED Sekhar Rao have resigned following auditors flagging unauthorized expenses. The bank has formed a search committee for replacements and appointed Raghavendra Srinivas Bhat as COO from July 2. The bank claims the audit issues have been 'amicably resolved' and assures stakeholders of its sound financial position.",
            "Sentiment": "negative",
            "PublishDate": 1751221288000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karnataka Bank: CEO Srikrishnan Sarma Resigns Amid Spending Dispute",
            "Summary": "Karnataka Bank's CEO and MD Srikrishnan Sarma has reportedly resigned following a dispute with the bank's board over unauthorized expenditures identified in May. A formal announcement is expected after board approval.",
            "Sentiment": "negative",
            "PublishDate": 1751119800000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karnataka Bank: Q4 Profit Dips 8%, Declares ₹5 Dividend",
            "Summary": "Karnataka Bank reported an 8% YoY decrease in Q4 net profit to ₹252.4 crore. FY25 net profit fell 2.6% to ₹1,272.37 crore. NII dropped 6.4% to ₹780.7 crore. GNPA improved to 3.08%. Retail advances grew 15.44%. The bank declared a dividend of ₹5 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1747232036000,
            "Source": "earnings"
        },
        {
            "Title": "Karnataka Bank Reports Q4 NIM of 2.98%",
            "Summary": "Karnataka Bank has announced its Net Interest Margin (NIM) for the fourth quarter, which stands at 2.98%. NIM is a key profitability metric for banks, representing the difference between interest earned and interest paid out, relative to the bank's interest-earning assets.",
            "Sentiment": "neutral",
            "PublishDate": 1747231785000,
            "Source": "default"
        },
        {
            "Title": "Karnataka Bank Recommends Dividend and Reports Improved Asset Quality",
            "Summary": "Karnataka Bank has recommended a dividend of 5 rupees per equity share. The bank's Q4 Gross Non-Performing Assets (GNPA) improved to 3.08% from 3.11% quarter-on-quarter, while Net Non-Performing Assets (NNPA) decreased to 1.31% from 1.39% in the same period.",
            "Sentiment": "positive",
            "PublishDate": 1747230733000,
            "Source": "result"
        },
        {
            "Title": "Karnataka Bank Reports Q4 FY23 Financial Results",
            "Summary": "Karnataka Bank has announced its financial results for the fourth quarter of the fiscal year. The bank reported a net profit of 2.5 billion rupees, which is lower compared to 2.74 billion rupees in the same quarter last year (YoY) and 2.8 billion rupees in the previous quarter (QoQ). The bank's revenue for Q4 stood at 22.6 billion rupees, showing a slight increase from 22 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747230633000,
            "Source": "result"
        },
        {
            "Title": "Karnataka Bank: Forensic Audit Initiated for Suspicious Global UPI Transactions",
            "Summary": "Karnataka Bank has appointed Pipara & Co. to conduct a forensic review of suspicious global UPI transactions, following directions from the bank's board and the RBI. This audit is related to reconciliation deficiencies reported on Feb. 17. The bank previously reversed Rs 18.87 crore worth of suspicious cross-border UPI transactions to customers. The bank assures that this incident and audit do not impact its operations or customer service.",
            "Sentiment": "neutral",
            "PublishDate": 1744859534000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karnataka Bank Identifies Deficiencies in UPI Global Transaction Reconciliation",
            "Summary": "Karnataka Bank has reported the discovery of certain deficiencies in their reconciliation process during a review of suspicious UPI global transactions. This finding suggests potential issues in the bank's transaction monitoring and reconciliation systems, which are crucial for maintaining financial accuracy and security.",
            "Sentiment": "negative",
            "PublishDate": 1739838501000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Karnataka Bank Identifies Deficiencies in UPI Global Transaction Reconciliation",
            "Summary": "Karnataka Bank has reported the discovery of certain deficiencies in its reconciliation process during a review of suspicious UPI Global transactions. This finding suggests potential issues in the bank's transaction monitoring and reconciliation systems, which could have implications for the bank's operational efficiency and risk management practices.",
            "Sentiment": "negative",
            "PublishDate": 1739808067000,
            "Source": "corporate_governance"
        }
    ]
}