{
    "Symbol": "KUANTUM",
    "ISIN": "INE529I01021",
    "News": [
        {
            "Title": "Kuantum Papers seeks shareholder approval for director appointments",
            "Summary": "Kuantum Papers Limited announces postal ballot for special resolutions to approve re-designation of Munishwar Kumar as Independent Director and appointment of Jagdeep Hira as Whole Time Director.",
            "Sentiment": "neutral",
            "PublishDate": 1770825858470,
            "Source": "stocks"
        },
        {
            "Title": "Kuantum Papers Q3FY26 Earnings Call on Feb 9",
            "Summary": "Kuantum Papers Limited has scheduled an earnings conference call on February 9, 2026 at 12:00 hrs IST to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770025541067,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kuantum Papers Reports 25.5% Sequential Revenue Growth Despite Margin Pressure in Q2 FY26",
            "Summary": "Kuantum Papers Limited reported operational income of Rs. 280 crores for Q2 FY26, marking a 25.5% sequential growth driven by higher paper production following the upgradation of paper machine 4. The company achieved its highest ever monthly production of 8,303 metric tons in September and highest daily production of 360 tons in July 2025. However, EBITDA margins contracted to 12.3% from previous quarter due to Rs. 3,200 per ton decline in net sales realization and Rs. 1,300 per ton increase in production costs, largely attributed to higher agro and wood-based raw material prices due to floods in Punjab. The company faces challenges from GST rate changes creating inverted duty structure, with paper and boards rising from 12% to 18% while converted products reduced to 5%, and notebooks made nil-rated. Management expects EBITDA margins to improve to 18-20% once capacity expansion from current 450 tons per day to 650 tons per day is completed, targeting 30-40% volume growth in FY27. The company is strategically moving away from the notebook segment and focusing on higher value-added Maplitho grades and specialty papers.",
            "Sentiment": "neutral",
            "PublishDate": 1763020248828,
            "Source": "earnings"
        },
        {
            "Title": "Kuantum Papers Reports 67% Drop in Quarterly Profit to ₹5.77 Crore",
            "Summary": "Kuantum Papers Limited reported a net profit of ₹5.77 crore for the quarter ended September 30, 2025, compared to ₹17.20 crore in the previous quarter and ₹29.90 crore in the same quarter last year. Revenue from operations increased to ₹278.42 crore from ₹221.92 crore in the previous quarter but declined from ₹275.90 crore in the corresponding quarter of the previous year. For the half-year period, net profit dropped to ₹22.97 crore from ₹68.10 crore in the same period last year, while revenue decreased to ₹500.34 crore from ₹554.84 crore. The company's finance costs rose to ₹11.90 crore from ₹10.39 crore in the previous quarter. Earnings per share for the quarter stood at ₹0.66 compared to ₹3.43 in the same quarter last year. The company operates solely in paper manufacturing and has no subsidiaries, associates, or joint ventures.",
            "Sentiment": "negative",
            "PublishDate": 1762514402399,
            "Source": "earnings"
        },
        {
            "Title": "Kuantum Papers Withdraws Credit Ratings from CARE Ratings, Switches to India Ratings",
            "Summary": "Kuantum Papers Limited has withdrawn its credit ratings from CARE Ratings Limited after switching to India Ratings and Research in July 2025. CARE Ratings reaffirmed and withdrew the ratings of CARE A-: Stable/CARE A1 assigned to the company's bank facilities with immediate effect, following the company's request and no-objection certificates from banks. The rating agency also placed the fixed deposit rating of Rs. 33.22 crores on notice of withdrawal for one year. The company reported a 9% decline in total operating income to Rs. 1,107.04 crores in FY25, with operating margins contracting by 706 basis points to 21.91%. In Q1 FY26, operating income declined 21% to Rs. 222.92 crores due to a 35-day shutdown of its primary machine PM4 for rebuilding. The company is undertaking a Rs. 735 crore expansion project to enhance capacity from 450 TPD to 675 TPD by March 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1762411858881,
            "Source": "corporate_action"
        },
        {
            "Title": "Kuantum Papers Limited Submits Investor Presentation to Stock Exchanges",
            "Summary": "Kuantum Papers Limited has submitted an investor presentation to BSE and NSE stock exchanges dated September 5, 2025. The presentation highlights the company's operations as an agro and wood-based paper manufacturer that started in 1980 in Hoshiarpur, Punjab, and currently operates at 450 TPD capacity. The company reported operational revenue of INR 13,096 million in FY25 with EBITDA margins of 28.96%, compared to INR 12,113 million revenue and 27.49% EBITDA margins in FY24. Paper sales volume reached 1,60,845 MT in FY25. The company operates through a network of 100+ dealers across India and exports to 24 countries. Key clients include Macmillan Education India, McGraw Hill Education India, and Oxford University Press. The presentation covers the company's integrated manufacturing facility spread across 259 acres, product portfolio including maplitho and specialty papers, and Social Farm Forestry Program covering 13,870 acres with plans to expand to 50,700 acres by 2028-29. The document also details the company's leadership team, operational infrastructure including pulping facilities, paper machines, and co-generation power plant, along with financial performance metrics.",
            "Sentiment": "neutral",
            "PublishDate": 1757052996746,
            "Source": "stock"
        },
        {
            "Title": "Kuantum Papers Q1 FY26 Results: Revenue Drops 20.6% to Rs 223 Crores Due to Planned Machine Shutdown",
            "Summary": "Kuantum Papers Limited reported operational income of Rs 223 crores for Q1 FY26, declining 20.6% year-on-year and 19.6% quarter-on-quarter. EBITDA fell 43.6% to Rs 40 crores with margins at 18.1%, while net profit dropped 68.3% to Rs 12 crores. The decline was primarily attributed to a planned 25-day shutdown of Paper Machine 4 for upgrades, reducing production by 9,000 tons. The company successfully completed PM4 upgrades in June 2025, adding modern equipment to boost productivity. Management noted the domestic paper industry faces challenges from high wood pricing and competitive imports, though DGTR has initiated anti-dumping investigations into paperboard imports from Indonesia. The company operates with 20% specialty papers and 80% writing and printing grades, with plans to increase specialty paper production to 30% through a new coating plant. Total CAPEX of Rs 735 crores is underway, with Rs 400 crores already spent, expected completion by June 2026. Paper prices increased marginally in Q1 but declined 7-8% in July-August due to seasonal factors.",
            "Sentiment": "negative",
            "PublishDate": 1755086108934,
            "Source": "earnings"
        },
        {
            "Title": "Kuantum Papers Makes Earnings Call Audio Recording Available for Q1 FY26 Results",
            "Summary": "Kuantum Papers Limited conducted an earnings conference call on August 11, 2025, to discuss its unaudited financial results for the quarter ended June 30, 2025. The company has made the audio recording of the call available on its website for investors and analysts to access. The filing was made in compliance with SEBI listing regulations and serves as notification of the call's completion and recording availability. The company trades on BSE with scrip code 532937 and on NSE with trading symbol KUANTUM.",
            "Sentiment": "neutral",
            "PublishDate": 1754907492124,
            "Source": "earnings"
        },
        {
            "Title": "Kuantum Papers Reports 20.6% Revenue Decline in Q1-FY26 Due to Production Machine Shutdown",
            "Summary": "Kuantum Papers Limited reported operational income of INR 2,229 million for Q1-FY26, down 20.6% year-over-year from INR 2,807 million in Q1-FY25. The decline was primarily attributed to the shutdown of Paper Machine 4 (PM4) for upgradation, resulting in lower production by approximately 9,000 tonnes. EBITDA fell 43.6% to INR 404 million with margins contracting to 18.12% from 25.51% in the previous year. Net profit dropped 68.3% to INR 121 million, with PAT margins declining to 5.43% from 13.61%. Paper sales volume decreased to 31,730 MT compared to 41,163 MT in Q1-FY25. The company successfully completed the PM4 upgradation on June 30, 2025, installing modern equipment to boost productivity and enable product diversification. Both PM1 and PM2 achieved record monthly production levels during the quarter. The company expanded its Social Farm Forestry program by 1,396 acres, bringing total plantation to 13,870 acres.",
            "Sentiment": "negative",
            "PublishDate": 1754887694507,
            "Source": "earnings"
        },
        {
            "Title": "Kuantum Papers Reports Significant Decline in Q1 Financial Performance",
            "Summary": "Kuantum Papers reported Q1 revenue of 2.2 billion rupees, down from 2.8 billion rupees in the same period last year. The company's net profit fell to 120 million rupees compared to 380 million rupees year-over-year. EBITDA decreased to 404 million rupees from 716 million rupees, while EBITDA margin compressed to 18.12% from 25.59% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754639834823,
            "Source": "earnings"
        },
        {
            "Title": "Kuantum Papers Q4 Results and Dividend Announcement",
            "Summary": "Kuantum Papers has announced its Q4 results and dividend. The company recommended a dividend of 3 rupees per equity share. Q4 EBITDA was 598.7 million rupees, down from 636.2 million rupees year-over-year. EBITDA margin improved to 21.59% from 21.29% in the same period last year. Revenue decreased to 2.77 billion rupees from 3 billion rupees year-over-year. Net profit for Q4 was 261.2 million rupees, down from 338.9 million rupees year-over-year but up from 209.7 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747757217000,
            "Source": "result"
        },
        {
            "Title": "Kuantum Papers Reports Decline in Q3 Profit and Revenue",
            "Summary": "Kuantum Papers has reported a significant decrease in its third-quarter financial results. The company's net profit fell to 210 million rupees from 421 million rupees in the same quarter last year. Revenue also declined to 2.7 billion rupees from 3 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1739320574000,
            "Source": "earnings"
        },
        {
            "Title": "Kuantum Papers Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Kuantum Papers has reported a decrease in its third-quarter EBITDA, which fell to 504 million rupees from 794 million rupees in the same period last year. The company's EBITDA margin also declined, dropping to 18.66% from 26.32% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739271383000,
            "Source": "earnings"
        },
        {
            "Title": "Kuantum Papers Reports Decline in Q3 Profit and Revenue",
            "Summary": "Kuantum Papers has reported a significant decrease in its third-quarter financial results. The company's net profit for Q3 fell to 210 million rupees, down from 421 million rupees in the same period last year. Revenue also declined, dropping to 2.7 billion rupees from 3 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739271378000,
            "Source": "earnings"
        }
    ]
}