{
    "Symbol": "LAL",
    "ISIN": "INE740X01023",
    "News": [
        {
            "Title": "Lorenzini Apparels Board Meet Set for Feb 14, 2026",
            "Summary": "Lorenzini Apparels Limited has scheduled its Board of Directors meeting for February 14, 2026, to approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770214206780,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lorenzini Apparels Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "Lorenzini Apparels Limited's Board approved unaudited standalone financial statements for the quarter and half year ended September 30, 2025, with statutory auditors issuing an unmodified opinion on the results. The company reported revenue from operations of 1,634.20 lakhs for the six-month period and basic earnings per share of 0.70 for the same duration.",
            "Sentiment": "neutral",
            "PublishDate": 1763047243024,
            "Source": "earnings"
        },
        {
            "Title": "Lorenzini Apparels Opens New Retail Store in Janipur, Jammu",
            "Summary": "Lorenzini Apparels Limited announced the opening of a new retail store in Janipur, Jammu, which began operations on September 8, 2025. The company disclosed this information to BSE and NSE stock exchanges. Sandeep Jain, Managing Director and Chief Financial Officer, signed the disclosure notice.",
            "Sentiment": "positive",
            "PublishDate": 1757143301753,
            "Source": "stock"
        },
        {
            "Title": "Lorenzini Apparels Reports 96.40 Lakh Profit for Quarter Ended June 30, 2025",
            "Summary": "Lorenzini Apparels Limited's Board approved unaudited financial statements for the quarter ended June 30, 2025. The company reported a profit of 96.40 lakh compared to a loss of 656.73 lakh in the previous quarter and profit of 185.77 lakh in the same quarter last year. Revenue from operations was 919.08 lakh, down from 1,392.25 lakh in the previous quarter and 1,517.66 lakh in the corresponding quarter of 2024. Total income stood at 1,134.03 lakh while total expenses were 934.18 lakh. Basic and diluted earnings per share were 0.06 for the quarter. The company has issued 10,38,371 share warrants in October 2023, receiving proceeds of 2,100 lakh in multiple tranches, with 1,653.72 lakh utilized and 446.28 lakh remaining to be deployed. The statutory auditors Mittal & Associates issued an unmodified opinion on the financial results.",
            "Sentiment": "positive",
            "PublishDate": 1755005303892,
            "Source": "earnings"
        },
        {
            "Title": "Lorenzini Apparels: Board Defers Bonus Share Issuance",
            "Summary": "Lorenzini Apparels' board has postponed the decision on issuing bonus shares and increasing authorized share capital. The company's stock price declined 3% to ₹19.70 following the announcement. The board has appointed Sapna Khanna as an independent director.",
            "Sentiment": "negative",
            "PublishDate": 1735205440000,
            "Source": "corporate_action"
        },
        {
            "Title": "Lorenzini Apparels to Consider 1:1 Bonus Share Issue",
            "Summary": "Lorenzini Apparels has scheduled a board meeting on December 25 to consider issuing bonus shares in a 1:1 ratio. This means shareholders could potentially receive one additional share for each share they currently hold.",
            "Sentiment": "positive",
            "PublishDate": 1734912653000,
            "Source": "corporate_action"
        },
        {
            "Title": "Lorenzini Apparels to Consider 1:1 Bonus Share Issue",
            "Summary": "Lorenzini Apparels has announced a board meeting scheduled for December 25 to consider issuing bonus shares in a 1:1 ratio. This means shareholders could potentially receive one additional share for each share they currently hold.",
            "Sentiment": "positive",
            "PublishDate": 1734701105000,
            "Source": "corporate_action"
        },
        {
            "Title": "Lorenzini Apparels: Bonus Shares and Stock Split Boost Investor Returns",
            "Summary": "Lorenzini Apparels, a BSE SME stock, announced a 6:11 bonus share issue and a 1:10 stock split in March 2024. These corporate actions have significantly increased shareholder value, with an initial ₹1 lakh investment potentially growing to ₹25.93 lakh over seven years.",
            "Sentiment": "positive",
            "PublishDate": 1732961518000,
            "Source": "corporate_action"
        },
        {
            "Title": "Lorenzini Apparels: Penny Stock Soars 6,500% in Five Years",
            "Summary": "Lorenzini Apparels, once a penny stock, has seen a 6,518% increase in share price over the past five years, rising from Re 0.39 to ₹25.81. The company reported a significant increase in Q2 net profit to ₹12.2 crore, up from ₹1.86 crore year-over-year. Total income for Q2 rose 51% to ₹28 crore.",
            "Sentiment": "positive",
            "PublishDate": 1731478572000,
            "Source": "result"
        },
        {
            "Title": "Lorenzini Apparels: Small-Cap Stock Surges on Expansion and Strong Financials",
            "Summary": "<p><span class='positive'>Lorenzini Apparels'</span> stock hit the <span class='positive'>upper circuit</span>, <span class='positive'>rising 5%</span> to Rs 28.59. The company reported a <span class='positive'>21.05% increase</span> in Q1 FY25 revenue to Rs 17.25 crore and a <span class='positive'>151.35% YoY jump</span> in net profit to Rs 1.86 crore. The company is <span class='positive'>expanding</span> its retail presence with a <b>new franchise store</b> in Rajasthan. Earlier this year, the company implemented a <span class='neutral'>1:10 stock split</span> and issued <span class='positive'>bonus shares</span> to <span class='positive'>increase liquidity</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728456970000,
            "Source": "normal_news"
        }
    ]
}