{
    "Symbol": "LALPATHLAB",
    "ISIN": "INE600L01024",
    "News": [
        {
            "Title": "Dr Lal PathLabs Q3 Net Profit Drops 6.4% YoY",
            "Summary": "Dr Lal PathLabs reported consolidated net profit of ₹905 million in Q3, down from ₹967 million in the same quarter last year, reflecting a year-on-year decline of 6.4%.",
            "Sentiment": "negative",
            "PublishDate": 1769760740241,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dr. Lal PathLabs Board to Meet Jan 30 for Q3 Results",
            "Summary": "Dr. Lal PathLabs has scheduled a board meeting on January 30, 2026, to consider Q3FY26 financial results and potential 3rd interim dividend for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1769150788760,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dr. Lal PathLabs Launches SOVAAKA Wellness Centre",
            "Summary": "Dr. Lal PathLabs unveils SOVAAKA, a next-generation diagnostic experience centre in Gurugram, offering personalized wellness programs with advanced diagnostics, AI-supported imaging, and genetic testing.",
            "Sentiment": "positive",
            "PublishDate": 1767671052629,
            "Source": "stocks"
        },
        {
            "Title": "Dr. Lal PathLabs Earnings Call Set for Jan 30, 2026",
            "Summary": "Dr. Lal PathLabs schedules earnings conference call on January 30, 2026, at 4:00 PM IST to discuss Q3 & 9M FY26 financial and operating performance with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1766993718399,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dr. Lal PathLabs amends trust deed for RSU Plan 2025",
            "Summary": "Dr. Lal PathLabs Limited executed Fifth Supplementary Trust Deed on December 9, 2025, amending Employee Welfare Trust to incorporate new Restricted Stock Unit Plan 2025 under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765803852258,
            "Source": "co_actions_results"
        },
        {
            "Title": "Dr. Lal PathLabs Increases Authorized Share Capital to INR 200 Crore",
            "Summary": "Dr. Lal PathLabs shareholders approved through postal ballot on December 07, 2025, an increase in authorized share capital from INR 107.96 crore to INR 200 crore, comprising 20 crore equity shares of INR 10 each. The alteration to the Capital Clause of the Memorandum of Association provides the company with enhanced financial flexibility for future growth initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1765188674040,
            "Source": "corporate_action"
        },
        {
            "Title": "Dr. Lal PathLabs Launches India's First Comprehensive Complement Testing Laboratory",
            "Summary": "Dr. Lal PathLabs announced the launch of India's first dedicated Complement Testing Laboratory, offering several tests available in the country for the first time to strengthen autoimmune diagnosis capabilities. The advanced facility brings globally benchmarked complement assays to Indian patients, helping doctors diagnose autoimmune, kidney, and recurrent infection related conditions faster and more accurately at earlier stages.",
            "Sentiment": "positive",
            "PublishDate": 1764132200741,
            "Source": "stock"
        },
        {
            "Title": "Dr. Lal PathLabs Proposes New Employee Stock Plan and 1:1 Bonus Share Issue",
            "Summary": "Dr. Lal PathLabs has issued a postal ballot notice seeking shareholder approval for seven resolutions. The company proposes to introduce a new Employee Restricted Stock Unit Plan 2025 with up to 5,27,403 options, sourced from 3,19,023 fresh shares and 2,08,380 shares through secondary acquisition. The plan will be administered through the existing Dr. Lal PathLabs Employee Welfare Trust. Additionally, the company seeks approval to reduce the options reserve under its existing Employee Stock Option Plan 2022 from 12,50,278 to 7,22,875 options. The board has also recommended a 1:1 bonus share issue to celebrate ten years of listing, requiring an increase in authorized share capital from Rs 107.96 crore to Rs 200 crore. The bonus issue will be funded by capitalizing up to Rs 83.78 crore from the Securities Premium Account. The e-voting period runs from November 8, 2025, to December 7, 2025, with results to be announced by December 9, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762495835348,
            "Source": "corporate_action"
        },
        {
            "Title": "Dr. Lal PathLabs Reports 10.7% Revenue Growth, Declares 70% Interim Dividend and 1:1 Bonus Issue",
            "Summary": "Dr. Lal PathLabs reported revenue of Rs. 731 crore for the quarter, marking 10.7% year-over-year growth, with half-year revenue reaching Rs. 1,400 crore (11% growth). The company recorded sample volume growth of 10.3% to 25.4 million and patient volume increase of 5% to 8.2 million. PAT grew 16.4% to Rs. 152 crore with a margin of 20.8%. EBITDA stood at Rs. 224 crore with a 30.7% margin. The Board approved an interim dividend of 70% (Rs. 7 per share) and a 1:1 bonus share issue. Revenue per patient increased 5.4% to Rs. 889. The company's Swasthfit program contributed 26% to quarterly revenues. Management guided for revenue growth of 11-12% for the financial year and EBITDA margins between 27-28%. The company is expanding its network with 15-20 new labs and 600-800 collection centers planned for the year. Net cash position stands at Rs. 1,367 crore.",
            "Sentiment": "positive",
            "PublishDate": 1762443287101,
            "Source": "earnings"
        },
        {
            "Title": "Dr Lal PathLabs Plans Major Expansion and AI Integration by FY26",
            "Summary": "Dr Lal PathLabs announced expansion plans to open 15-20 new labs and 600-800 new collection centers by FY26. The company projects revenue growth of 11-12% for FY26 with EBITDA margin guidance of 27-28%. The expected margin reduction is now anticipated to be less severe than initially estimated. The company has become India's first lab to use AI for detecting cancer metastasis in lymph nodes and is developing its own AI algorithms for medical tests and operations.",
            "Sentiment": "positive",
            "PublishDate": 1762140535345,
            "Source": "stock"
        },
        {
            "Title": "Dr. Lal PathLabs Receives Income Tax Demand Notice of ₹2.43 Crore for FY2017-18",
            "Summary": "Dr. Lal PathLabs received an Assessment Order and Demand Notice from the Income Tax Department on October 31, 2025. The order pertains to FY2017-18 and includes additions/disallowances of ₹2.79 crore, resulting in an income tax demand of ₹2.43 crore. The company states there is no material impact on its financials, operations, or other activities beyond the mentioned amount. The company is examining the order and plans to take appropriate steps, including filing an appeal.",
            "Sentiment": "negative",
            "PublishDate": 1761969225056,
            "Source": "stock"
        },
        {
            "Title": "Dr. Lal Path Labs Declares Second Interim Dividend of Rs 7 Per Share",
            "Summary": "Dr. Lal Path Labs has declared a second interim dividend of Rs 7 per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1761900317282,
            "Source": "corporate_action"
        },
        {
            "Title": "Dr. Lal Path Labs Reports Q2 Revenue Growth and Announces 1:1 Bonus Share Issue",
            "Summary": "Dr. Lal Path Labs reported Q2 revenue of 7.3 billion rupees, up from 6.6 billion rupees year-over-year. The company's EBITDA increased to 2.24 billion rupees from 2.02 billion rupees, while maintaining an EBITDA margin of 30.7%. Consolidated net profit rose to 1.51 billion rupees compared to 1.3 billion rupees in the previous year. The company has approved a bonus share issue in the ratio of 1:1.",
            "Sentiment": "positive",
            "PublishDate": 1761899785960,
            "Source": "earnings"
        },
        {
            "Title": "Dr Lal Path Labs Board to Consider Bonus Share Issuance on October 31",
            "Summary": "Dr Lal Path Labs announced that its board will meet on October 31 to consider the issuance of bonus shares to shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1761523694255,
            "Source": "corporate_action"
        },
        {
            "Title": "Dr Lal PathLabs Board to Consider Bonus Shares and Second Interim Dividend",
            "Summary": "Dr Lal PathLabs announced that its Board of Directors will meet on October 31, 2025, to consider issuing bonus shares and declaring a second interim dividend for FY 2025-26, alongside reviewing quarterly financial results for the period ended September 30, 2025. The company reported strong quarterly performance with consolidated net profit rising 24% year-on-year to ₹132 crore, while revenue grew 11.3% to ₹670 crore. Sample volumes increased 10.7% to 23.4 million and patient visits rose 6% to 7.6 million. EBITDA reached ₹192.5 crore, up 13% from the previous year, with margins improving to 28.73%. The company maintains cash reserves of ₹1,229 crore and previously declared an interim dividend of ₹6 per equity share for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1761309804536,
            "Source": "corporate_action"
        },
        {
            "Title": "Dr Lal Path Labs Board to Consider Bonus Share Issue",
            "Summary": "Dr Lal Path Labs has announced that its board of directors will meet on October 31 to discuss the issuance of bonus shares to shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1761309493748,
            "Source": "corporate_action"
        },
        {
            "Title": "Dr. Lal PathLabs Approves ₹74.51 Crore Property Acquisition in New Delhi",
            "Summary": "Dr. Lal PathLabs Limited's Board of Directors approved the acquisition of immovable property in New Delhi for up to ₹74.51 crores. The property comprises four units on the first and second floors, a ground floor shop, basement space usage rights, and designated parking at Shalimar Palace, Shalimar Bagh. The acquisition involves multiple parties including The South Indian Bank Limited, Alternative Learning Systems Limited, several individual mortgagors, and builder Aggarwal Towers Private Limited. The transaction is subject to necessary approvals from concerned authorities and does not involve any related party transactions or shareholding arrangements with the counterparties.",
            "Sentiment": "neutral",
            "PublishDate": 1758690435237,
            "Source": "corporate_action"
        },
        {
            "Title": "Dr. Lal PathLabs Block Trade Worth Rs. 81.60 Crores Executed on NSE",
            "Summary": "Dr. Lal PathLabs Ltd. witnessed a block trade on the National Stock Exchange involving approximately 250,606 shares at a price of Rs. 3,256.30 per share, totaling Rs. 81.60 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1757055386539,
            "Source": "order&deals"
        },
        {
            "Title": "Dr. Lal Path Labs Leads AI Implementation for Cancer Diagnosis in India",
            "Summary": "Dr. Lal Path Labs is leading the adoption of artificial intelligence technology for cancer diagnosis in India. The company is utilizing AI tools to enhance its diagnostic capabilities in the oncology segment.",
            "Sentiment": "positive",
            "PublishDate": 1755666310889,
            "Source": "stock"
        },
        {
            "Title": "Dr. Lal PathLabs Reports Strong Q1 FY26 Results with 11.3% Revenue Growth and 24.3% PAT Increase",
            "Summary": "Dr. Lal PathLabs delivered robust quarterly results with revenue growing 11.3% to Rs. 670 crore compared to Rs. 602 crore in the same quarter last year. Profit after tax surged 24.3% to Rs. 134 crore from Rs. 108 crore, while EBITDA increased 13.1% to Rs. 192 crore with margins at 28.7%. Sample volumes grew 10.7% to 23.4 million and patient volumes rose 5.3% to 7.6 million. Revenue per patient increased 5.7% to Rs. 880, driven by favorable test mix, with tests per patient rising to 3.07 from 2.92. The SwasthFit portfolio contributed 27% of revenue, up from 25% last year. The company launched 58 new tests during the quarter and added capabilities in genomics and specialized testing. The board approved an interim dividend of Rs. 6 per share. Management maintains revenue growth guidance of 11-12% but indicated annual margins could be better than previously projected.",
            "Sentiment": "positive",
            "PublishDate": 1754400414173,
            "Source": "earnings"
        },
        {
            "Title": "Dr Lal PathLabs Reports 24% Profit Growth, Plans Southern India Expansion with ₹1,400 Crore Cash",
            "Summary": "Dr Lal PathLabs reported a 24% year-on-year increase in consolidated net profit to ₹132 crore for the April-June quarter, beating street estimates of ₹122.76 crore. The diagnostic services company is actively exploring acquisition opportunities to expand in southern India, where its current presence is low. CEO Shankha Banerjee stated the company has ₹1,400 crore in cash available for acquisitions, focusing on geographic fit rather than deal size. The company maintains revenue growth guidance of 11-12%, primarily driven by volumes rather than price increases. Swasthfit bundled portfolio contribution increased to 27% from 25% in the same quarter last year. The West region experienced slower growth due to IT infrastructure changes but is expected to recover in the second half. Management indicated they may revise their EBITDA margin guidance upward from the initial 27% target after strong first-quarter performance.",
            "Sentiment": "positive",
            "PublishDate": 1754026713963,
            "Source": "earnings"
        },
        {
            "Title": "Dr Lal PathLabs Projects 11-12% Revenue Growth for FY26, Warns of Margin Pressure",
            "Summary": "Dr Lal PathLabs expects revenue growth of 11-12% for FY26. The company's previous guidance indicated possible margin compression of up to 100 basis points. While the company hints that yearly profits may exceed initial estimates, it cautioned that the first quarter's strong 28.7% margins are not expected to reflect the entire year performance. Most investments are planned for the later quarters of the year.",
            "Sentiment": "neutral",
            "PublishDate": 1754019040758,
            "Source": "stock"
        },
        {
            "Title": "Dr. Lal Path Labs Declares ₹6 Per Share Interim Dividend",
            "Summary": "Dr. Lal Path Labs has announced an interim dividend of ₹6 for each share. This dividend payment will benefit the company's shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1753949260473,
            "Source": "corporate_action"
        },
        {
            "Title": "Dr. Lal Path Labs Reports 18% Growth in Q1 Net Profit to 1.3 Billion Rupees",
            "Summary": "Dr. Lal Path Labs reported consolidated net profit of 1.3 billion rupees in Q1, up from 1.1 billion rupees in the same period last year. Revenue increased to 6.7 billion rupees from 6 billion rupees year-over-year. EBITDA rose to 1.92 billion rupees compared to 1.7 billion rupees previously, with EBITDA margin improving to 28.7% from 28.24% in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1753948795971,
            "Source": "earnings"
        },
        {
            "Title": "Dr. Lal PathLabs Schedules Q1 FY26 Earnings Conference Call for July 31, 2025",
            "Summary": "Dr. Lal PathLabs Ltd. will host an earnings conference call on July 31, 2025, at 4:30 PM IST to discuss Q1 FY26 financial and operating performance. The call will be led by Executive Chairman (Hony) Brig. Dr. Arvind Lal, CEO Shankha Banerjee, and Group CFO Ved Prakash Goel. The session will begin with management discussion on quarterly results, followed by a Q&A segment for participants. The company operates 298 clinical labs, 6,607 Patient Service Centers, and 12,365 Pick-up Points as of March 31, 2025. In FY25, the diagnostic services provider processed approximately 86 million samples from 28.8 million patients.",
            "Sentiment": "neutral",
            "PublishDate": 1753336095343,
            "Source": "corporate_action"
        },
        {
            "Title": "Dr. Lal Path Labs Schedules Quarterly Results Review for July 31",
            "Summary": "Dr. Lal Path Labs has announced that it will review its quarterly results on July 31. The diagnostic services company has set this date for examining its financial performance for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1753334333614,
            "Source": "earnings"
        },
        {
            "Title": "Dr. Lal PathLabs Enhances Genomics Capabilities with Illumina's NovaSeq X Series",
            "Summary": "Dr. Lal PathLabs has acquired Illumina's NovaSeq X Series technology to boost its genomics capabilities. This addition is expected to enhance the company's ability to perform advanced genetic testing and analysis.",
            "Sentiment": "positive",
            "PublishDate": 1750830985000,
            "Source": "default"
        },
        {
            "Title": "Dr Lal PathLabs: Targets 27% Margin by FY26, Plans Expansion",
            "Summary": "Dr Lal PathLabs aims for 27% margins in FY26, plans to open 15-20 labs this fiscal year, expanding in southern and western states. Q4 revenue up 10.5% YoY, EBITDA up 17% YoY, net profit increased 81.2%. Board recommends Rs 6 per share final dividend for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1745891241000,
            "Source": "earnings"
        },
        {
            "Title": "Dr. Lal PathLabs: Q4 Profit Surges 83%, Exceeds Estimates",
            "Summary": "Dr. Lal PathLabs reported a Q4 FY25 net profit of Rs 154.80 crore, up 83% year-on-year and surpassing analyst estimates. Revenue increased 10.5% to Rs 602.60 crore, while EBITDA grew 17% to Rs 169 crore. EBITDA margin improved to 28% from 26.5% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1745571836000,
            "Source": "earnings"
        },
        {
            "Title": "Dr. Lal PathLabs Reports Strong Q4 Profit Growth",
            "Summary": "Dr. Lal PathLabs announced its Q4 consolidated net profit of 1.55 billion rupees, a significant increase from 845 million rupees in the same period last year. This result exceeded market estimates of 1 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1745570994000,
            "Source": "result"
        },
        {
            "Title": "Dr. Lal PathLabs Launches Advanced Amyloidosis Test",
            "Summary": "Dr. Lal PathLabs has become the first diagnostic chain in South Asia to introduce an advanced test for amyloidosis, a group of rare diseases characterized by abnormal protein buildup in organs. This launch represents a significant advancement in diagnostic capabilities for the region, potentially improving early detection and management of these complex disorders.",
            "Sentiment": "positive",
            "PublishDate": 1744693965000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dr. Lal Path Labs Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade of approximately 101,444 shares of Dr. Lal Path Labs Ltd. occurred on the National Stock Exchange (NSE) at a price of Rs. 2448.00 per share. The total value of the transaction amounted to Rs. 24.83 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1744004352000,
            "Source": "block_deals"
        },
        {
            "Title": "Dr. Lal PathLabs Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) involving Dr. Lal PathLabs Ltd. The transaction involved approximately 593,348 shares, traded at a price of Rs. 2406.50 per share. The total value of the block trade amounted to Rs. 142.79 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1743578412000,
            "Source": "block_deals"
        },
        {
            "Title": "Block Trade of Dr. Lal PathLabs Ltd. Shares on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) involving Dr. Lal PathLabs Ltd. shares. Approximately 227,175 shares were traded at a price of Rs. 2400.75 per share, resulting in a total transaction value of Rs. 54.54 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1741160367000,
            "Source": "block_deals"
        },
        {
            "Title": "Dr. Lal Path Labs Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade of approximately 116,643 shares of Dr. Lal Path Labs Ltd. occurred on the National Stock Exchange (NSE) for a total value of Rs. 27.26 crores. The average price per share in this transaction was Rs. 2336.95.",
            "Sentiment": "neutral",
            "PublishDate": 1740646137000,
            "Source": "block_deals"
        },
        {
            "Title": "Dr. Lal PathLabs Initiates Voluntary Liquidation of Suburban Diagnostics",
            "Summary": "Dr. Lal PathLabs has announced the voluntary liquidation of its unit, Suburban Diagnostics (India) Pvt Ltd. The liquidation process will involve consolidating Suburban's business into Dr. Lal PathLabs as a going concern, subject to compliance with relevant laws.",
            "Sentiment": "neutral",
            "PublishDate": 1738847600000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dr Lal PathLabs: Plans to Open 15-20 New Laboratories This Year",
            "Summary": "Dr Lal PathLabs announces expansion plans, aiming to open 15-20 new laboratories within the current year.",
            "Sentiment": "positive",
            "PublishDate": 1738302270000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dr. Lal PathLabs: Q3 Profit Rises 19%, Declares Dividend",
            "Summary": "Dr. Lal PathLabs reported a 19% increase in Q3 net profit to ₹98 crore. Revenue grew 11% to ₹596.7 crore. EBITDA rose 9.5% to ₹154 crore. The company approved a third interim dividend of ₹6 per share. Growth driven by market penetration and expansion in West and South regions.",
            "Sentiment": "positive",
            "PublishDate": 1738231925000,
            "Source": "result"
        },
        {
            "Title": "Dr. Lal PathLabs Reports Q3 Financial Results",
            "Summary": "Dr. Lal PathLabs announced its Q3 financial results. The company's EBITDA increased to 1.54 billion rupees from 1.4 billion rupees year-over-year. However, the EBITDA margin slightly decreased to 25.8% from 26.09% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738224651000,
            "Source": "earnings"
        },
        {
            "Title": "Dr. Lal PathLabs Reports Increased Q3 Profit and Revenue",
            "Summary": "Dr. Lal PathLabs, a prominent diagnostic company, has announced its financial results for the third quarter. The company's consolidated net profit rose to 967 million rupees, up from 813 million rupees in the same period last year. Additionally, the company's revenue increased to 6 billion rupees from 5.4 billion rupees year-over-year, indicating strong growth in its operations.",
            "Sentiment": "positive",
            "PublishDate": 1738224637000,
            "Source": "earnings"
        },
        {
            "Title": "Dr Lal PathLabs: Board Meeting Set for Q3 Results and Potential Dividend",
            "Summary": "Dr Lal PathLabs has scheduled a board meeting on January 30, 2025, to approve Q3 FY25 financial results and consider a third interim dividend. The company has already declared two interim dividends of ₹6 each for FY 2024-25.",
            "Sentiment": "neutral",
            "PublishDate": 1737621729000,
            "Source": "corporate_action"
        },
        {
            "Title": "Block Trade of DR LAL PATHLABS Shares on NSE",
            "Summary": "A block trade of approximately 239,701 shares of DR LAL PATHLABS occurred on the National Stock Exchange (NSE) for a total value of Rs 70.86 crore. The shares were traded at a price of Rs 2,956 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1735545137000,
            "Source": "block_deals"
        },
        {
            "Title": "Dr. Lal Pathlabs: Q2 Results In Line, Volume Growth Remains Slow",
            "Summary": "Dr. Lal Pathlabs' Q2 results were in line with expectations, but volume growth continues to be lackluster according to Yes Securities.",
            "Sentiment": "neutral",
            "PublishDate": 1729743668000,
            "Source": "result"
        },
        {
            "Title": "Dr Lal PathLabs Approves Interim Dividend",
            "Summary": "Dr Lal PathLabs has approved a second interim dividend of 6 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1729682412000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dr Lal PathLabs: Q2 Profit Surges 18%, Exceeds Estimates",
            "Summary": "Dr Lal PathLabs reported a 18% year-on-year increase in Q2 net profit to Rs 130.80 crore, surpassing analyst estimates. Revenue rose 9.8% to Rs 660.20 crore, while EBITDA grew 14% to Rs 202.50 crore. EBITDA margin improved to 30.7% from 29.6% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1729679158000,
            "Source": "result"
        },
        {
            "Title": "Dr. Lal PathLabs Schedules Q2 Results Board Meeting",
            "Summary": "Dr. Lal PathLabs has announced a board meeting scheduled for October 23 to consider and approve the company's financial results for the second quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1729055014000,
            "Source": "corporate_action"
        }
    ]
}