{
    "Symbol": "LAMBODHARA",
    "ISIN": "INE112F01022",
    "News": [
        {
            "Title": "Lambodhara Textiles Q3FY26 Net Profit Rises 58.3%",
            "Summary": "Lambodhara Textiles reported Q3FY26 net profit of ₹240.42 lakhs, up 58.3% YoY. Nine-month profit reached ₹787.55 lakhs, marking 19.2% growth despite revenue decline.",
            "Sentiment": "positive",
            "PublishDate": 1769865426707,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lambodhara Textiles Auditors Convert to LLP Structure",
            "Summary": "Lambodhara Textiles Limited announces that its statutory auditors Mohan & Venkataraman have converted from partnership firm to LLP effective January 15, 2026, with no change in audit engagement.",
            "Sentiment": "neutral",
            "PublishDate": 1769603024052,
            "Source": "stocks"
        },
        {
            "Title": "Lambodhara Textiles Board Meet Set for Jan 31",
            "Summary": "Lambodhara Textiles Limited has scheduled a board meeting on January 31, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769170034007,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lambodhara Textiles Reports Strong Q1 Results with 902% Jump in Net Profit, Sets AGM Date",
            "Summary": "Lambodhara Textiles announced its quarterly results with net profit surging to Rs 215.53 lakhs compared to Rs 21.51 lakhs in the previous quarter. Revenue from operations increased to Rs 5,910.07 lakhs from Rs 5,437.39 lakhs in the preceding quarter. The company's earnings per share improved significantly to Rs 2.08 from Rs 0.21 in the previous quarter. The textile segment contributed Rs 5,631.90 lakhs to total revenue, while power generation and real estate segments contributed Rs 430.12 lakhs and Rs 48.41 lakhs respectively. The company has scheduled its 31st Annual General Meeting for September 22, 2025, to be conducted through video conferencing. The board also approved a proposal for obtaining shareholder approval for material related party transactions. The register of members will remain closed from September 16-22, 2025, with September 15, 2025 as the record date for dividend eligibility.",
            "Sentiment": "positive",
            "PublishDate": 1754651914903,
            "Source": "earnings"
        }
    ]
}