{
    "Symbol": "LANCORHOL",
    "ISIN": "INE572G01025",
    "News": [
        {
            "Title": "Lancor Holdings Q3FY26 Results Show Mixed Performance",
            "Summary": "Lancor Holdings reported Q3FY26 standalone net profit of ₹11.84 lakhs vs ₹127.86 lakhs in Q3FY25, while revenue declined to ₹3,372.51 lakhs from ₹4,546.78 lakhs year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1770894452663,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lancor Holdings Wins Supreme Court Property Case",
            "Summary": "Supreme Court dismisses review petition on Menon Eternity property dispute, confirming Lancor Holdings' rightful ownership and ability to freely deal with the commercial property.",
            "Sentiment": "positive",
            "PublishDate": 1770297263272,
            "Source": "stocks"
        },
        {
            "Title": "Lancor Holdings Gets Commercial Property Back",
            "Summary": "Delhi High Court orders Official Liquidator to release commercial property possession to Lancor Holdings through Bank of India by February 15, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769509251339,
            "Source": "stocks"
        },
        {
            "Title": "Lancor Holdings Expands Portfolio with Senior Living and Premium Housing Projects",
            "Summary": "Lancor Holdings successfully launched its Harmonia Pavilion Senior Living Apartments project in Sriperumbudur, receiving extensive media coverage across multiple channels. The company is expanding its real estate portfolio to include senior living housing, premium urban homes, and strategic suburban growth projects while planning a turnaround with debt restructuring.",
            "Sentiment": "positive",
            "PublishDate": 1764669917437,
            "Source": "stock"
        },
        {
            "Title": "Lancor Holdings Launches Senior Living Project and Expands Real Estate Portfolio",
            "Summary": "Lancor Holdings launched Harmonia Pavilion Senior Living Apartments with 110 units in Sriperumbudur as part of a 90-acre gated community, targeting the growing senior living market projected to grow 300% by 2030. The company expanded its portfolio across premium urban homes and suburban developments, with gross revenue rising from Rs. 137.98 crores in FY2024 to Rs. 186.20 crores in FY2025 and projected at Rs. 333 crores by FY2027.",
            "Sentiment": "positive",
            "PublishDate": 1764241726593,
            "Source": "stock"
        },
        {
            "Title": "Lancor Holdings Reports Quarterly Loss, Wins Supreme Court Case for Rs 190 Crore Property",
            "Summary": "Lancor Holdings reported a net loss for the quarter ended September 30, 2025, while securing a favorable Supreme Court judgment that enables the company to lease or sell a property with current book value of Rs 28.34 crores. The property has an estimated market value of Rs 190 crores for sale or potential annual rental income of Rs 12 crores, and the company also raised Rs 15 crores through NCD allotment at 16.5% interest rate.",
            "Sentiment": "positive",
            "PublishDate": 1763147989685,
            "Source": "earnings"
        },
        {
            "Title": "Lancor Holdings Files NCLT Merger Petition Notice",
            "Summary": "Lancor Holdings Limited has informed stock exchanges about the publication of newspaper advertisements regarding a notice of hearing for a merger petition. The advertisements were published in The Indian Express (English), The New Indian Express (English), and Daily Thanthi (Tamil) as per NCLT order. The company filed this intimation under Regulation 30 of SEBI Listing Obligations and Disclosure Requirements Regulations, 2015.",
            "Sentiment": "neutral",
            "PublishDate": 1762002824518,
            "Source": "corporate_action"
        },
        {
            "Title": "Supreme Court Upholds Lancor Holdings' Commercial Property Sale Deed",
            "Summary": "The Supreme Court has ruled in favor of Lancor Holdings regarding a sale deed for commercial property. The court's decision enables the company to freely lease and conduct transactions related to the property without restrictions.",
            "Sentiment": "positive",
            "PublishDate": 1761904949564,
            "Source": "stock"
        },
        {
            "Title": "Lancor Holdings Approves Rs 150 Crore Non-Convertible Debenture Issuance",
            "Summary": "Lancor Holdings Limited's Board of Directors approved the issuance of Non-Convertible Debentures worth Rs 150 crore through private placement. The NCDs will have a face value of Rs 1 lakh each, totaling 1,500 securities to be issued in tranches over time. The debentures carry a 16.5% annual interest rate, compounded monthly and payable quarterly, with a maturity date of October 31, 2027. The instruments feature a 6-month moratorium period followed by 8 equal quarterly installments. The debentures are secured and will not be listed on stock exchanges. Redemption will be through proceeds from asset sales, with a 3% penalty for payment delays exceeding three months.",
            "Sentiment": "neutral",
            "PublishDate": 1761847363431,
            "Source": "corporate_action"
        },
        {
            "Title": "Lancor Holdings Approves Q1 FY2026 Results, Schedules 40th AGM, and Appoints New Secretarial Auditor",
            "Summary": "Lancor Holdings Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025, covering both standalone and consolidated statements. The company scheduled its 40th Annual General Meeting for September 23, 2025, at 11:30 AM through video conferencing. The Board fixed September 16, 2025, as the record date for final dividend payment for Financial Year 2024-25, subject to shareholder approval. The company appointed M/s. A. Mohan Kumar & Associates as secretarial auditors for five consecutive years from FY 2025-26 to 2029-30, pending member approval. The Chennai-based firm specializes in secretarial audit, mergers, acquisitions, and capital structuring, with founding partner Mohan Kumar bringing over 20 years of experience across listed and unlisted companies.",
            "Sentiment": "neutral",
            "PublishDate": 1755096376464,
            "Source": "earnings"
        },
        {
            "Title": "Lancor Holdings Signs Joint Development Agreement Worth ₹445 Crore",
            "Summary": "Lancor Holdings has entered into a joint development agreement valued at ₹445 crore. The company expects to realize a margin of ₹85 crore from this agreement.",
            "Sentiment": "positive",
            "PublishDate": 1743148522000,
            "Source": "corporate_action"
        },
        {
            "Title": "Lancor Holdings Approves Issue of Convertible Warrants",
            "Summary": "Lancor Holdings has approved the issuance of convertible warrants worth 100 million Indian rupees. This corporate action indicates the company is raising capital, potentially for expansion or debt reduction purposes.",
            "Sentiment": "positive",
            "PublishDate": 1743148341000,
            "Source": "corporate_action"
        }
    ]
}