{
    "Symbol": "LANDMARK",
    "ISIN": "INE559R01029",
    "News": [
        {
            "Title": "Landmark Cars Q3FY26 Earnings Call on Feb 11",
            "Summary": "Landmark Cars Limited has scheduled an earnings conference call on February 11, 2026 at 10:30 AM IST to discuss Q3FY26 unaudited financial results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1770380538934,
            "Source": "co_actions_results"
        },
        {
            "Title": "Landmark Cars jumps 10% despite Goldman Sachs exit",
            "Summary": "Small-cap auto retailer Landmark Cars surged 9.7% to ₹382.80 despite Goldman Sachs completely exiting its 5.014% stake. Nippon India Small Cap Fund acquired 3.8% additional stake worth ₹57.4 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1769500336311,
            "Source": "co_actions_results"
        },
        {
            "Title": "Landmark Cars Holds 17-20% Mercedes-Benz India Share",
            "Summary": "Landmark Cars maintains a significant 17-20% revenue share in Mercedes-Benz India's passenger car business, highlighting its strong position as a key dealer partner in the luxury automotive segment.",
            "Sentiment": "positive",
            "PublishDate": 1768378021950,
            "Source": "stocks"
        },
        {
            "Title": "Mercedes-Benz India Plans 12 New Models for 2026",
            "Summary": "Mercedes-Benz India announces ambitious expansion with 12 new vehicle models planned for launch in 2026, including electric vehicles as part of their growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1768377856370,
            "Source": "stocks"
        },
        {
            "Title": "Landmark Cars Plans ₹80 Cr Investment in Subsidiaries",
            "Summary": "Landmark Cars announces strategic ₹80 crores investment across three key subsidiaries - ACPL, LPCPL, and LMPL - to strengthen its automobile business operations and market position.",
            "Sentiment": "positive",
            "PublishDate": 1767195242321,
            "Source": "stocks"
        },
        {
            "Title": "Landmark Cars Invests ₹80 Cr in Subsidiaries",
            "Summary": "Landmark Cars Limited's board approved ₹80 crore investment in three wholly owned subsidiaries through preference shares subscription to reduce inter-company loans.",
            "Sentiment": "positive",
            "PublishDate": 1767190061091,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mercedes-Benz India Raises Prices by 2%",
            "Summary": "Mercedes-Benz India announces 2% price increase. Landmark Cars, which derives 42% of its total revenues from Mercedes-Benz car sales, may face business impact from this pricing adjustment.",
            "Sentiment": "neutral",
            "PublishDate": 1765527531204,
            "Source": "stocks"
        },
        {
            "Title": "Landmark Cars Expands BYD Partnership with New Pune Showroom and Workshop",
            "Summary": "Landmark Cars Limited received approval from BYD India to open a new showroom and workshop in Pune through its wholly owned subsidiary Watermark Cars Private Limited, strengthening its position as BYD's largest retail partner with 7 outlets. The expansion marks Landmark Cars' entry into Pune's promising luxury and premium electric vehicle market, leveraging BYD's 80% sales surge and strong performance in India's premium EV segment.",
            "Sentiment": "positive",
            "PublishDate": 1765015783617,
            "Source": "stock"
        },
        {
            "Title": "Landmark Cars Allots 40,000 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Landmark Cars Limited allotted 40,000 equity shares of face value Rs. 5 each to eligible employees under its Employee Stock Options Scheme, 2018, with exercise prices of Rs. 244.50 and Rs. 299.50 per share. The allotment increases the company's total issued share capital to Rs. 207,324,550 with 41,464,910 shares outstanding, with the new shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763810212298,
            "Source": "corporate_action"
        },
        {
            "Title": "Landmark Cars Q2 FY26 Results: GST Transition Impact Pressures Margins Despite 31% Revenue Growth",
            "Summary": "Landmark Cars reported 31% revenue growth to INR 1,657 crores in Q2 FY26 but gross margins compressed to 16.2% due to discounts and inventory liquidation during the GST rate transition period from August to September. The company guided for 100+ basis points margin improvement in the second half as GST-related disruptions normalize and demand momentum sustains across luxury and premium segments.",
            "Sentiment": "neutral",
            "PublishDate": 1763464389066,
            "Source": "earnings"
        },
        {
            "Title": "Landmark Cars Reports 45.02 Million Profit in Q2 FY2026, Revenue Rises to 13.15 Billion",
            "Summary": "Landmark Cars Limited announced consolidated quarterly results for the quarter ended September 30, 2025. The company reported a consolidated profit of 45.02 million compared to a loss of 10.24 million in the same quarter last year. Total income increased to 13.15 billion from 9.40 billion year-over-year. For the half-year period, profit reached 88.68 million versus 37.76 million in the previous year, with total income rising to 22.83 billion from 17.43 billion. On a standalone basis, the company posted a profit of 44.78 million for the quarter compared to a loss of 88.47 million last year. The Board approved both standalone and consolidated unaudited financial results. The company operates through multiple subsidiaries including Landmark Automobiles Limited, Landmark Cars (East) Private Limited, and others in the automotive dealership business.",
            "Sentiment": "positive",
            "PublishDate": 1762907375384,
            "Source": "earnings"
        },
        {
            "Title": "Landmark Cars Guides for Growth Amid GST 2.0 Transition, Expands Premium Brand Network",
            "Summary": "Landmark Cars has provided growth guidance despite the GST 2.0 transition period. The company is expanding its network across premium automotive brands including Mercedes, Volkswagen, Honda, MG, and BYD. The company's strategic focus areas include EV portfolio expansion, margin recovery, and scaling up after-sales services. Landmark Cars expects strong cash generation and anticipates demand revival following the GST reset.",
            "Sentiment": "positive",
            "PublishDate": 1762872021113,
            "Source": "stock"
        },
        {
            "Title": "Landmark Cars Reports Mixed Q2 Results with Revenue Growth but Lower Profitability",
            "Summary": "Landmark Cars reported quarterly results showing revenue growth to 12.1 billion rupees from 9.1 billion rupees year-over-year. The company posted a consolidated net profit of 12 million rupees compared to a loss of 0.24 million rupees in the same period last year. However, profit before tax declined significantly to 6 million rupees from 42 million rupees year-over-year. EBITDA increased to 543 million rupees from 520 million rupees, but EBITDA margin compressed to 4.48% from 5.73% year-over-year. The company had an exceptional item of 37 million rupees in the previous year's numbers.",
            "Sentiment": "neutral",
            "PublishDate": 1762868333624,
            "Source": "earnings"
        },
        {
            "Title": "Landmark Cars Schedules Q2 FY26 Earnings Conference Call",
            "Summary": "Landmark Cars Limited has scheduled an earnings conference call with analysts and investors for November 12, 2025, at 9:30 AM IST. The call will discuss the company's unaudited financial results for the quarter and half year ended September 30, 2025. The call will be represented by Mr. Sanjay Thakker (Promoter, Chairman and Executive Director), Mr. Aryaman Thakker (Executive Director), and Mr. Surendra Agarwal (Chief Financial Officer). ICICI Securities is coordinating the conference call, which will provide universal access numbers and toll-free numbers for various countries including Singapore, Hong Kong, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1762423193404,
            "Source": "earnings"
        },
        {
            "Title": "Landmark Cars Reports 30.52% Revenue Growth in Q2 FY26, Achieves Fastest Quarterly Growth Post-Listing",
            "Summary": "Landmark Cars Limited reported consolidated total revenue from operations of Rs. 1,655 crore for Q2 FY26, marking a 30.52% year-over-year increase. Vehicle sales, including agency and pre-owned vehicle sales, grew 35.03% to Rs. 1,403 crore, while after-sales service and spare parts revenue increased 10.04% to Rs. 252 crore. The company achieved its fastest quarterly growth post-listing, driven by outlet additions and strong demand during the Navratra period, despite some purchase deferrals due to GST rate reduction announcements. The company operationalized two KIA workshops in Hyderabad and Mercedes-Benz operations in Patna in July 2025, with an MG Select outlet in Kolkata becoming operational in October 2025. After-sales revenue reached its highest quarterly level. The company is strengthening its Mahindra partnership with a planned Hyderabad sales outlet and opening small KIA sales outlets in Hyderabad and Kolkata, all expected to be operational in November.",
            "Sentiment": "positive",
            "PublishDate": 1760354718253,
            "Source": "earnings"
        },
        {
            "Title": "Mercedes-Benz India Reports Record September Sales and Strongest Quarter Performance",
            "Summary": "Mercedes-Benz India achieved record sales in September and recorded its strongest quarterly performance. The luxury automaker reached these milestones through Landmark Cars, indicating strong demand for Mercedes-Benz vehicles in the Indian market during this period.",
            "Sentiment": "positive",
            "PublishDate": 1759806398437,
            "Source": "stock"
        },
        {
            "Title": "Landmark Cars to Acquire Remaining 17% Stake in East Division",
            "Summary": "Landmark Cars announced its plan to purchase the remaining 17% stake in Landmark Cars (East) Pvt. Ltd. This acquisition will make the East division a fully owned subsidiary of the company, giving Landmark Cars complete ownership and control over its eastern operations.",
            "Sentiment": "positive",
            "PublishDate": 1759755375669,
            "Source": "corporate_action"
        },
        {
            "Title": "Landmark Cars Reports 30% Jump in Footfall and Enquiries Following GST Cuts",
            "Summary": "Landmark Cars Ltd. experienced a 30% increase in enquiries and showroom footfalls since September 22, following government GST cuts. The premium auto retailer, which operates 141 outlets across India and primarily sells brands like Mercedes-Benz, reported that luxury cars registered three times the growth of ordinary passenger vehicles in the June quarter. Executive Director Aryaman Thakker expects the increased footfall to continue until Diwali and anticipates double-digit growth of 13-14% in the second half of FY26. The company has added 40 new outlets over the past two years and continues expansion in the premium auto segment.",
            "Sentiment": "positive",
            "PublishDate": 1759129018486,
            "Source": "stock"
        },
        {
            "Title": "Landmark Cars Executive Director Sells 700,000 Shares to Repay Property Loan",
            "Summary": "Mr. Aryaman Sanjay Thakker, Executive Director and Promoter Group member of Landmark Cars Limited, sold 700,000 equity shares on September 19, 2025 to repay a residential property loan. Following this transaction, the Promoter Group's total shareholding decreased to 49.82%. The company stated that the Promoters/Promoter Group does not intend to sell any further shares currently.",
            "Sentiment": "neutral",
            "PublishDate": 1758291805379,
            "Source": "stock"
        },
        {
            "Title": "Landmark Cars Expands Kolkata Presence with New KIA Showroom",
            "Summary": "Landmark Cars Limited received a Letter of Award (LOA) from KIA India to open a new showroom at B.T. Road in Kolkata. The dealership will be established through Landmark Premium Cars Private Limited, a wholly owned subsidiary. Landmark currently operates one KIA showroom and two KIA workshops in Kolkata. The new showroom is expected to improve Landmark's contribution to KIA sales in Kolkata, expand the car parc, and drive higher throughput for workshops. This expansion brings Landmark's total footprint in West Bengal to ten outlets across brands. Landmark Cars is a premium automotive retail network in India with dealerships for multiple brands including Mercedes-Benz, Honda, Jeep, Volkswagen, BYD, Renault, Mahindra & Mahindra, KIA, MG Motors and Citroën.",
            "Sentiment": "positive",
            "PublishDate": 1758110236825,
            "Source": "stock"
        },
        {
            "Title": "Mercedes Considers Price Increase Due to Rupee Weakness Against Euro",
            "Summary": "Landmark Cars announced that Mercedes is considering a price increase next year. The potential price hike is attributed to the weakening of the Indian rupee against the euro.",
            "Sentiment": "negative",
            "PublishDate": 1757993896598,
            "Source": "stock"
        },
        {
            "Title": "BYD Considers Launching ATTO 2 as Most Affordable EV in India Through Landmark Cars",
            "Summary": "Chinese electric vehicle manufacturer BYD is considering the launch of its ATTO 2 model in India, which would serve as the company's most affordable electric vehicle offering in the market. The potential launch would be facilitated through Landmark Cars.",
            "Sentiment": "positive",
            "PublishDate": 1757488509834,
            "Source": "stock"
        },
        {
            "Title": "Landmark Cars Subsidiary Receives Intent Letter From Stellantis Automobiles India",
            "Summary": "Landmark Cars announced that its subsidiary has received an intent letter from Stellantis Automobiles India. The automotive company disclosed this development, though specific details about the nature or terms of the intent letter were not provided.",
            "Sentiment": "neutral",
            "PublishDate": 1756806404382,
            "Source": "stock"
        },
        {
            "Title": "Landmark Cars Expands Hyderabad Operations and Strengthens Mahindra Partnership",
            "Summary": "Landmark Cars has expanded its presence in Hyderabad while strengthening its partnership with Mahindra & Mahindra. The move represents the company's growth strategy in the automotive retail sector.",
            "Sentiment": "positive",
            "PublishDate": 1756804071855,
            "Source": "stock"
        },
        {
            "Title": "Landmark Group to Invest Rs 400 Crore in Gurugram Housing Project",
            "Summary": "Landmark Group will invest Rs 400 crore to construct a new residential project called 'Landmark SKYVUE' in Gurugram's Sector 103 on Dwarka Expressway. The project will feature 240 apartments spread across 4 acres of land that the company has owned since 2009. Apartments will be priced between Rs 5-7 crore per unit with a launch price of Rs 17,500 per square foot. The construction will be funded through internal accruals, bank loans, and customer advances. Chairman Sandeep Chillar noted strong demand in the Gurugram market driven by infrastructure projects including the Dwarka Expressway opening. The company has previously delivered 15 housing and five commercial projects, primarily in Delhi-NCR.",
            "Sentiment": "positive",
            "PublishDate": 1755692279681,
            "Source": "stock"
        },
        {
            "Title": "Landmark Cars Limited Incorporates Wholly Owned Subsidiary for Luxury Retail Business",
            "Summary": "Landmark Cars Limited incorporated a new wholly owned subsidiary named 'Landmark Luxury Retail Private Limited' on August 14, 2025. The subsidiary will operate in the retail industry focusing on trading luxury items. Landmark Cars acquired 100% equity shareholding through subscription of 10,000 equity shares at Rs. 10 each, totaling Rs. 1,00,000. The newly incorporated entity is registered in Gujarat at Ahmedabad and has yet to commence business operations. The company stated that the subsidiary's business would contribute to the growth of Landmark Cars' financial status.",
            "Sentiment": "positive",
            "PublishDate": 1755194252368,
            "Source": "corporate_action"
        },
        {
            "Title": "Landmark Cars Uploads Audio Recording of Quarterly Earnings Conference Call",
            "Summary": "Landmark Cars Limited conducted an earnings conference call with analysts and investors on August 13, 2025, to discuss their unaudited financial results for the quarter ended June 30, 2025. The company has made the audio recording of the call available on their website and will submit the transcript later. The call was held at 09:30 AM IST and was communicated to BSE and NSE exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1755086289355,
            "Source": "earnings"
        },
        {
            "Title": "Landmark Cars Reports Revenue Decline But Improved Profitability in Q1 Results",
            "Summary": "Landmark Cars Limited reported total income of ₹2,877.58 crores for the quarter ended June 30, 2025, declining 10.3% from ₹3,208.22 crores in the same period last year. Despite the revenue drop, net profit after tax reached ₹79.41 crores compared to ₹87.25 crores previously, while earnings per share improved significantly to ₹2.53 from ₹(5.05) in the prior year quarter. The company transitioned its Mercedes-Benz dealership to an agency model, where customers place orders directly with Mercedes-Benz India through Landmark Cars, which earns commission on sales. Under this new model, Mercedes-Benz cars worth ₹2,525.25 crores were sold during the quarter. The shift represents a strategic change aimed at potentially improving margins and reducing inventory risks.",
            "Sentiment": "neutral",
            "PublishDate": 1755068750942,
            "Source": "earnings"
        },
        {
            "Title": "Landmark Cars Plans Growth Through Luxury Vehicle Demand and Service Expansion",
            "Summary": "Landmark Cars has outlined a long-term growth strategy focused on capitalizing on demand for luxury cars, premium partnerships, and aftermarket services. The company plans to enter the used car market and electric vehicle segment as part of efforts to diversify and boost revenue streams.",
            "Sentiment": "positive",
            "PublishDate": 1755015984195,
            "Source": "stock"
        },
        {
            "Title": "Landmark Cars Reports Strong Q1 Growth with Revenue Up 28% and Net Profit More Than Doubles",
            "Summary": "Landmark Cars delivered strong quarterly results with revenue rising to 10.6 billion rupees from 8.3 billion rupees year-over-year. The company's consolidated net profit more than doubled to 69 million rupees compared to 32 million rupees in the same period last year. EBITDA increased to 611 million rupees from 485 million rupees year-over-year, though EBITDA margin slightly declined to 5.75% from 5.83%.",
            "Sentiment": "positive",
            "PublishDate": 1755005804648,
            "Source": "earnings"
        },
        {
            "Title": "Landmark Cars Expands Partnerships and Reports Q1FY26 Revenue Growth",
            "Summary": "Landmark Cars has strengthened its partnership with Mahindra by opening a new sales outlet in Kolkata and small Kia sales outlets in Hyderabad. The company's MG Select aims to be a modern luxury brand, with positive reactions to the Cyberster and M9 EV models, with deliveries set to begin by the end of July. Additionally, Landmark Cars reported a 21.6% increase in Q1FY26 revenue, reaching ₹1,415 crore compared to ₹1,164 crore in Q1FY25.",
            "Sentiment": "positive",
            "PublishDate": 1752569085000,
            "Source": "default"
        },
        {
            "Title": "Landmark Cars Warns of Potential GST Rate Increase on Luxury Cars",
            "Summary": "Landmark Cars has issued a warning about a possible increase in GST rates on luxury cars. The company, which deals in luxury automobiles, has alerted stakeholders to this potential change in taxation. No specific details about the extent of the increase or its timing were provided in the available information.",
            "Sentiment": "negative",
            "PublishDate": 1751447790000,
            "Source": "default"
        },
        {
            "Title": "Landmark Cars Aims to Reduce Costs in Current Year",
            "Summary": "Landmark Cars has announced cost reduction targets for the current year. The company is guiding for a 10% reduction in other costs as a percentage of turnover. Additionally, they are aiming for a 10% reduction in manpower cost as a percentage of turnover. These updates were provided during a conference call.",
            "Sentiment": "positive",
            "PublishDate": 1748575773000,
            "Source": "default"
        },
        {
            "Title": "Landmark Cars Reports Q4 Financial Results",
            "Summary": "Landmark Cars has released its Q4 financial results. The company's EBITDA for Q4 was 546.7 million rupees, compared to 535.2 million rupees in the same quarter last year. The EBITDA margin decreased to 5.01% from 6.19% year-over-year. Revenue increased to 10.9 billion rupees from 8.64 billion rupees in the previous year. The consolidated net profit for Q4 was 14.22 million rupees, down from 106 million rupees year-over-year and 113.6 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748519153000,
            "Source": "result"
        },
        {
            "Title": "Landmark Cars to Acquire Kia Workshop in Hyderabad",
            "Summary": "Landmark Cars has announced plans to acquire a Kia workshop in Hyderabad. This acquisition is aimed at strengthening the company's presence in the region. No further details about the acquisition, such as the cost or specific location of the workshop, were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747492464000,
            "Source": "default"
        },
        {
            "Title": "Landmark Cars Exits Operations in Punjab",
            "Summary": "Landmark Cars has announced its exit from operations in Punjab. The company states that this decision is expected to have a negligible financial impact on their overall business.",
            "Sentiment": "neutral",
            "PublishDate": 1745885376000,
            "Source": "default"
        },
        {
            "Title": "Landmark Cars Exits Operations in Punjab",
            "Summary": "Landmark Cars has announced its exit from operations in Punjab. The company states that this move is expected to have a negligible financial impact on their overall business.",
            "Sentiment": "neutral",
            "PublishDate": 1745843069000,
            "Source": "default"
        },
        {
            "Title": "Landmark Cars: Q4 Revenue Surges 17.31% to ₹1,525 Crore",
            "Summary": "Landmark Cars reported Q4FY25 revenue of ₹1,525 crore, up 17.31% YoY. FY25 revenue grew 20.86% to ₹5,626 crore. Vehicle sales drove growth, increasing 21.10% in Q4 and 23.94% for FY25. After-sales service revenue rose 10.81% in Q4. The company opened 9 new workshops in FY25 and plans to operationalize new outlets in Q1FY26.",
            "Sentiment": "positive",
            "PublishDate": 1744780337000,
            "Source": "earnings"
        },
        {
            "Title": "Landmark Cars Reports 17.31% Revenue Growth in Q4FY25",
            "Summary": "Landmark Cars has announced a 17.31% year-over-year increase in total revenue from operations for the fourth quarter of fiscal year 2025. The company also stated that it is now focusing on stabilizing its new outlets following the expansion efforts in FY25.",
            "Sentiment": "positive",
            "PublishDate": 1744721564000,
            "Source": "default"
        },
        {
            "Title": "Landmark Cars Signs Agreement with Stellantis for Citroen Sales",
            "Summary": "Landmark Cars has entered into a bespoke agreement with a Stellantis Group company to sell and provide after-sales service for Citroen cars. This arrangement will utilize Landmark Cars' existing Jeep outlets in Mumbai to expand Citroen's presence in the market.",
            "Sentiment": "positive",
            "PublishDate": 1739512149000,
            "Source": "corporate_action"
        },
        {
            "Title": "Landmark Cars Reports Mixed Q3 Financial Results",
            "Summary": "Landmark Cars has released its Q3 financial results, showing a year-over-year decrease in consolidated net profit but an increase in revenue. The company's net profit fell to 113 million rupees from 182 million rupees in the same quarter last year. However, revenue grew to 11.9 billion rupees from 9.6 billion rupees, indicating strong top-line growth despite profit challenges.",
            "Sentiment": "neutral",
            "PublishDate": 1739405826000,
            "Source": "earnings"
        },
        {
            "Title": "Landmark Cars Reports Mixed Q3 Results",
            "Summary": "Landmark Cars, an automotive retail company, has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased slightly to 665 million rupees, compared to 653 million rupees in the same quarter last year. However, the EBITDA margin decreased from 6.81% to 5.56% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739368786000,
            "Source": "earnings"
        },
        {
            "Title": "Landmark Cars Reports Mixed Q3 Financial Results",
            "Summary": "Landmark Cars announced its Q3 financial results, showing a year-over-year decrease in consolidated net profit from 182 million rupees to 113 million rupees. However, the company's revenue increased from 9.6 billion rupees to 11.9 billion rupees compared to the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739368779000,
            "Source": "earnings"
        },
        {
            "Title": "Landmark Cars Receives LOI for New MG Dealerships",
            "Summary": "Landmark Cars has received a Letter of Intent (LOI) from JSW MG Motor India to open new MG Select dealerships in Ahmedabad and Kolkata. This development indicates an expansion of Landmark Cars' dealership network for MG vehicles in these two major Indian cities.",
            "Sentiment": "positive",
            "PublishDate": 1737418848000,
            "Source": "corporate_action"
        },
        {
            "Title": "Landmark Cars to Open New MG Select Dealerships in Ahmedabad and Kolkata",
            "Summary": "Landmark Cars has received a letter of intent from JSW MG Motor India (MGI) to establish new MG Select dealerships in Ahmedabad and Kolkata. This expansion indicates a strategic move to strengthen MG's presence in these key markets.",
            "Sentiment": "positive",
            "PublishDate": 1737377425000,
            "Source": "corporate_action"
        },
        {
            "Title": "Landmark Cars Reports 31% Revenue Growth in Q3",
            "Summary": "Landmark Cars has reported a significant year-over-year increase in its third-quarter revenue. The company's Q3 revenue reached 16.5 billion, up from 12.6 billion in the same quarter of the previous year, representing a 31% growth.",
            "Sentiment": "positive",
            "PublishDate": 1737101707000,
            "Source": "earnings"
        },
        {
            "Title": "Landmark Cars Acquires KIA Showroom in Hyderabad",
            "Summary": "Landmark Cars has executed an asset transfer agreement to acquire a KIA showroom in Hyderabad. This strategic move strengthens the company's presence in the Hyderabad market, expanding its portfolio of automotive dealerships.",
            "Sentiment": "positive",
            "PublishDate": 1733470296000,
            "Source": "corporate_action"
        },
        {
            "Title": "Landmark Cars Anticipates Growth in After-Sales Business",
            "Summary": "Landmark Cars expects its after-sales business to grow significantly in the coming quarters as new brands and locations stabilize. The company is also preparing to launch its first new-born electric car later this month.",
            "Sentiment": "positive",
            "PublishDate": 1731466842000,
            "Source": "corporate_action"
        },
        {
            "Title": "Landmark Cars Expects Improved Gross Margins and Maintains Manpower Guidance",
            "Summary": "Landmark Cars anticipates an increase in gross margins in upcoming quarters due to the improving ramp-up of newly opened facilities. The company is maintaining its guidance of 4% on manpower by exit, as stated in a recent concall update.",
            "Sentiment": "positive",
            "PublishDate": 1731466708000,
            "Source": "corporate_action"
        },
        {
            "Title": "Landmark Cars Reports Q2 EBITDA Decline",
            "Summary": "Landmark Cars reported a decrease in Q2 EBITDA to 520 million rupees from 545 million rupees year-over-year. The company's EBITDA margin also declined to 5.73% from 7.07% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731338466000,
            "Source": "result"
        }
    ]
}