{
    "Symbol": "LAOPALA",
    "ISIN": "INE059D01020",
    "News": [
        {
            "Title": "La Opala RG Board Meet Set for Feb 14 Q3FY26 Results",
            "Summary": "La Opala RG Limited announces board meeting on February 14, 2026 to consider Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025 under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770722429232,
            "Source": "co_actions_results"
        },
        {
            "Title": "La Opala RG Gets Credit Rating Reaffirmation",
            "Summary": "CARE Ratings reaffirmed La Opala RG's credit ratings with CARE AA; Stable for long-term facilities and CARE A1+ for short-term facilities, citing strong market position and healthy margins.",
            "Sentiment": "positive",
            "PublishDate": 1768290155309,
            "Source": "stocks"
        },
        {
            "Title": "La Opala RG Gets ESG Score of 64.0 from SES ESG Research",
            "Summary": "La Opala RG Limited receives voluntary ESG rating of 64.0 from SEBI-registered Category II ESG Rating Provider SES ESG Research based on FY25 disclosures and public information.",
            "Sentiment": "positive",
            "PublishDate": 1768217483770,
            "Source": "stocks"
        },
        {
            "Title": "LaOpala RG Reports 39% Revenue Growth in Q2 FY2026",
            "Summary": "LaOpala RG Limited reported revenue from operations of Rs 9,090.17 lakh for the quarter ended September 30, 2025, compared to Rs 6,526.54 lakh in the same quarter last year, marking a 39% increase. Net profit for the quarter stood at Rs 2,548.54 lakh versus Rs 2,206.04 lakh in the previous year. For the six-month period, revenue reached Rs 19,151.62 lakh compared to Rs 18,684.22 lakh in the corresponding period last year. The company's earnings per share for the quarter was Rs 2.41 compared to Rs 2.28 in the previous year. The Board of Directors approved these unaudited financial results in their meeting held on November 8, 2025. The company operates primarily in glass and glassware products as a single reportable segment.",
            "Sentiment": "positive",
            "PublishDate": 1762606400435,
            "Source": "earnings"
        },
        {
            "Title": "La Opala RG Reports Q1 Results with Revenue of ₹6,526.54 Lakh and Net Profit of ₹2,535.48 Lakh",
            "Summary": "La Opala RG Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of ₹6,526.54 lakh, down from ₹7,285.34 lakh in the same quarter last year. Net profit for the quarter stood at ₹2,535.48 lakh compared to ₹2,366.15 lakh in the previous year quarter. Total income including other income was ₹7,951.69 lakh versus ₹8,386.12 lakh year-over-year. The company's earnings per share was ₹2.28 for the quarter. Total comprehensive income reached ₹4,015.76 lakh, significantly higher than ₹2,993.06 lakh in the corresponding quarter last year, primarily due to other comprehensive income gains. The company operates primarily in glass and glassware products as a single reportable segment.",
            "Sentiment": "neutral",
            "PublishDate": 1755177850941,
            "Source": "earnings"
        },
        {
            "Title": "La Opala RG Limited Reports 24% Decline in Net Profit for FY 2024-25",
            "Summary": "La Opala RG Limited reported a net profit of Rs 96.59 crore for FY 2024-25, down 24.38% from Rs 127.72 crore in the previous year. Revenue from operations decreased 9.1% to Rs 331.86 crore from Rs 365.13 crore. The company's EBITDA margin declined to 33.41% from 37.50% in FY 2023-24. Despite the challenging performance, the Board recommended a dividend of Rs 7.50 per equity share. The company attributed the decline to muted consumer spending and challenging external environment, while maintaining a debt-free status with cash reserves of Rs 510.90 crore.",
            "Sentiment": "negative",
            "PublishDate": 1753100751774,
            "Source": "corporate_action"
        },
        {
            "Title": "La Opala RG Limited Reports 10.6% Revenue Decline in FY2025 Despite Strong Cash Position",
            "Summary": "La Opala RG Limited's revenue from operations decreased to Rs 331.86 crore in FY2025 from Rs 365.13 crore in FY2024, marking a 10.6% decline. Profit after tax fell 24.4% to Rs 96.59 crore from Rs 127.72 crore. The company faced challenges from muted consumer spending and distribution channel restructuring. Despite the revenue decline, La Opala maintained a strong financial position with Rs 510.90 crore in cash reserves and zero debt. The company operates three manufacturing facilities with a combined production capacity of 32,000 MTPA and has presence in over 40 countries. The Board recommended a dividend of Rs 7.50 per equity share for FY2025.",
            "Sentiment": "negative",
            "PublishDate": 1753098842000,
            "Source": "corporate_action"
        },
        {
            "Title": "La Opala RG Announces Q4 Results and Dividend",
            "Summary": "La Opala RG has declared a dividend of 7.5 rupees per share. For Q4, the company reported an EBITDA of 267 million rupees, up from 256 million rupees year-over-year. The EBITDA margin improved to 34.63% from 31.02% in the same period last year. Net profit for Q4 stood at 257 million rupees, compared to 236.6 million rupees year-over-year and 232 million rupees quarter-on-quarter. However, revenue decreased to 771 million rupees from 825.2 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748615922000,
            "Source": "result"
        },
        {
            "Title": "La Opala RG Reports Decline in Q3 Net Profit and Revenue",
            "Summary": "La Opala RG, a company in the glassware industry, has reported its financial results for the third quarter. The company's net profit decreased to 232 million rupees, down from 442 million rupees in the same quarter last year and 241 million rupees in the previous quarter. Revenue also declined to 913 million rupees from 1.07 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739751390000,
            "Source": "earnings"
        },
        {
            "Title": "La Opala RG Reports Decline in Q3 EBITDA and Margin",
            "Summary": "La Opala RG, a company in the tableware industry, has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 256 million rupees from 410 million rupees in the same quarter last year. Additionally, the EBITDA margin fell to 28.07% from 38.00% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739542199000,
            "Source": "earnings"
        },
        {
            "Title": "La Opala RG Reports Decline in Q3 Net Profit and Revenue",
            "Summary": "La Opala RG has reported its financial results for the third quarter. The company's net profit decreased to 232 million rupees, down from 442 million rupees year-over-year and 241 million rupees quarter-over-quarter. Revenue also declined to 913 million rupees from 1.07 billion rupees compared to the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1739542149000,
            "Source": "earnings"
        },
        {
            "Title": "La Opala RG Reports Q2 Financial Results",
            "Summary": "La Opala RG has announced its financial results for the second quarter. The company reported a net profit of 241 million rupees, which is lower compared to 312 million rupees in the same quarter last year (YoY) but slightly higher than 237 million rupees in the previous quarter (QoQ). Revenue for Q2 stood at 906 million rupees, showing a marginal increase from 892 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731592496000,
            "Source": "result"
        }
    ]
}