{
    "Symbol": "LASA",
    "ISIN": "INE670X01014",
    "News": [
        {
            "Title": "LASA Supergenerics Appoints New Executive Director",
            "Summary": "LASA Supergenerics Limited announces the appointment of Mr. Ganesh Suresh Potdar as Additional Director in Executive capacity and Occupier of all company units, effective January 02, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767351742264,
            "Source": "stocks"
        },
        {
            "Title": "Lasa Supergenerics Appoints New Company Secretary",
            "Summary": "Lasa Supergenerics Limited announces the appointment of Mrs. Mitti Jain as Company Secretary and Compliance Officer effective December 16, 2025, bringing 10 years of corporate law experience.",
            "Sentiment": "positive",
            "PublishDate": 1765798350842,
            "Source": "stocks"
        },
        {
            "Title": "Lasa Supergenerics Director Prathmesh Chalke Resigns",
            "Summary": "Lasa Supergenerics Limited announces resignation of Whole-time Director Mr. Prathmesh Chalke effective December 31, 2025, citing no material reasons beyond those in resignation letter.",
            "Sentiment": "neutral",
            "PublishDate": 1765456252276,
            "Source": "stocks"
        },
        {
            "Title": "Lasa Super Generics Reports Rs 2,821.93 Lakh Loss After Factory Fire Halts Operations",
            "Summary": "Lasa Super Generics Limited reported a net loss of Rs 2,821.93 lakhs for the quarter ended September 30, 2025, primarily due to a fire incident at its main manufacturing facility in May 2025 that destroyed inventories and equipment worth Rs 1,973.62 lakhs. The company has suspended all manufacturing operations across its facilities and is exploring contract manufacturing arrangements or facility leasing options to resume business.",
            "Sentiment": "negative",
            "PublishDate": 1763130156975,
            "Source": "earnings"
        },
        {
            "Title": "LASA Supergenerics Limited Company Secretary Resigns Due to Non-Operational Status",
            "Summary": "LASA Supergenerics Limited submitted a revised disclosure regarding the resignation of Mrs. Mitti Jain from her position as Company Secretary and Compliance Officer, effective from closing hours of Friday, August 29, 2025. The company had previously submitted a disclosure on the same date but inadvertently omitted the resignation letter. Mrs. Jain cited the company's non-operational status and absence of active business operations as reasons for her resignation, stating these factors limited her ability to contribute effectively in her role. The resignation was submitted via email on August 29, 2025, and the company has now provided the complete documentation including the resignation letter to stock exchanges.",
            "Sentiment": "negative",
            "PublishDate": 1758536901295,
            "Source": "corporate_governance"
        },
        {
            "Title": "LASA Supergenerics Reports Fire Incident at Manufacturing Facility, Operations Halted",
            "Summary": "LASA Supergenerics Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. A significant fire occurred on May 15, 2025, at the company's factory in Lote Parshuram Industrial area, Ratnagiri, Maharashtra, causing substantial damage to inventories, property, plant and equipment. The fire resulted in uninsured losses totaling Rs 20.57 lakhs, including inventories worth Rs 12.74 lakhs and property, plant & equipment worth Rs 7 lakhs. All production processes have halted as this was the central production unit, and other company units dependent on its output have also ceased operations. Management indicated inability to commence manufacturing activities due to pending statutory clearances and operational constraints, and is exploring contract manufacturing arrangements and facility leasing options subject to regulatory approvals. Bank accounts with Rs 7.99 lakhs balance and fixed deposits worth Rs 31.46 lakhs are in dormant status.",
            "Sentiment": "negative",
            "PublishDate": 1755089055039,
            "Source": "earnings"
        },
        {
            "Title": "LASA Supergenerics Appoints Four New Independent Directors to Board",
            "Summary": "LASA Supergenerics Limited appointed four new Additional Directors as Non-Executive Independent Directors to its Board for a 5-year term effective August 05, 2025. The appointments are subject to shareholder approval. The new directors are Mr. Ketan Bhau Songal (expertise in Agro-Veterinary Sciences), Mr. Pravin Gadalya Lachake (experience in commercial and rural poultry operations), Mr. Yogesh Hari Ughada (animal care experience), and Mrs. Rekha Hemant Wakh as Woman Director (specializing in Animal Nutrition). All appointees hold no directorships in other public companies and are not related to existing directors or key managerial personnel. The Board meeting was held from 3:00 P.M. to 4:30 P.M. on August 05, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754393808132,
            "Source": "corporate_governance"
        },
        {
            "Title": "LASA Supergenerics Seeks Shareholder Approval for Executive Director Appointment",
            "Summary": "LASA Supergenerics Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Prathamesh Chalke (DIN: 11119348) as Executive Director for a 5-year term from May 21, 2025 to May 20, 2030. The remote e-voting period runs from August 3, 2025 at 9:00 AM to September 2, 2025 at 5:00 PM. The cut-off date for voting eligibility is July 25, 2025. Mr. Chalke, born January 21, 1991, has extensive experience in the production department and has been associated with the company for several years in day-to-day production operations. He will also be appointed as Occupier for the company's factory units under the Factories Act, 1948. The scrutinizer for the postal ballot process is Mr. Shravan Gupta (ACS: 27484). Results will be announced by September 4, 2025. Mr. Chalke holds no shares in the company and is not related to any directors or key managerial personnel.",
            "Sentiment": "neutral",
            "PublishDate": 1754049567345,
            "Source": "corporate_action"
        }
    ]
}