{
    "Symbol": "LATENTVIEW",
    "ISIN": "INE0I7C01011",
    "News": [
        {
            "Title": "LatentView Analytics Reports 12th Consecutive Quarter Growth",
            "Summary": "LatentView Analytics achieved 5.7% sequential dollar revenue growth in Q3 FY26, driven by strong BFSI performance and Databricks partnerships, with full-year revenue guidance of $119-120 million.",
            "Sentiment": "positive",
            "PublishDate": 1770646816349,
            "Source": "co_actions_results"
        },
        {
            "Title": "Latent View Analytics Q3 FY26 Results Approved",
            "Summary": "Latent View Analytics board approved unaudited financial results for quarter and nine months ended December 31, 2025, along with amendments to insider trading code and risk management committee changes.",
            "Sentiment": "neutral",
            "PublishDate": 1769981274792,
            "Source": "co_actions_results"
        },
        {
            "Title": "Latent View Analytics Q3FY26 earnings call on Feb 2",
            "Summary": "Latent View Analytics has scheduled its Q3FY26 earnings conference call for February 2, 2026, at 7:30 PM IST to discuss financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768992915576,
            "Source": "co_actions_results"
        },
        {
            "Title": "Latent View CFO Withdraws Resignation, Continues Role",
            "Summary": "Latent View Analytics CFO Rajan Bala Venkatesan has withdrawn his resignation submitted in November 2025 and will continue serving as Chief Financial Officer without any break in service.",
            "Sentiment": "positive",
            "PublishDate": 1768373477711,
            "Source": "stocks"
        },
        {
            "Title": "Latent View Analytics CFO Withdraws Resignation",
            "Summary": "Rajan Bala Venkatesan reverses his resignation decision and continues as CFO of Latent View Analytics without service interruption, with board citing his valuable expertise.",
            "Sentiment": "positive",
            "PublishDate": 1768373099902,
            "Source": "stocks"
        },
        {
            "Title": "LatentView Analytics Gets 75.8 ESG Rating",
            "Summary": "LatentView Analytics Limited receives an ESG rating of 75.8 from SES ESG Research, based on publicly available data without company engagement.",
            "Sentiment": "neutral",
            "PublishDate": 1765881149992,
            "Source": "stocks"
        },
        {
            "Title": "LatentView Analytics Clarifies Recent Share Volume Surge to BSE",
            "Summary": "LatentView Analytics responded to BSE's inquiry about significant increase in trading volume of company shares, stating no pending announcements that could impact share price or volume behavior. The company attributed the volume surge to market conditions and confirmed compliance with disclosure requirements under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765269441155,
            "Source": "stock"
        },
        {
            "Title": "LatentView Analytics Allots 3.23 Lakh Equity Shares Under Employee Stock Option Plan",
            "Summary": "LatentView Analytics allotted 3,23,860 equity shares to eligible employees under its Employee Stock Option Plan 2016, with exercise prices ranging from INR 6.29 to INR 359 per share. The allotment increased the company's paid-up equity share capital from INR 20.66 crore to INR 20.69 crore, with the new shares ranking pari-passu with existing equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1764344328569,
            "Source": "corporate_action"
        },
        {
            "Title": "LatentView Analytics Appoints Venky Ramesh as Chief Client Officer for Consumer, MarketPlace and Retail",
            "Summary": "LatentView Analytics appointed Mr. Venky Ramesh as Chief Client Officer for Consumer, MarketPlace and Retail effective November 17, 2025, following Board approval based on Nomination and Remuneration Committee recommendations. Ramesh brings over two decades of experience in driving growth across consumer industries through data, digital, and analytics, with leadership experience at Infosys, Cognizant, Capgemini, and EPAM.",
            "Sentiment": "positive",
            "PublishDate": 1763397906658,
            "Source": "corporate_governance"
        },
        {
            "Title": "LatentView Analytics CFO Rajan Bala Venkatesan Resigns to Pursue New Career Opportunity",
            "Summary": "LatentView Analytics announced the resignation of Chief Financial Officer Rajan Bala Venkatesan, effective February 13, 2026. Venkatesan submitted his resignation via email on November 5, 2025, citing pursuit of a new professional opportunity that aligns with his long-term career aspirations. He confirmed there are no other reasons for his departure from the company. Venkatesan has served as CFO for four years and expressed commitment to ensuring a smooth transition of his responsibilities and financial operations. CEO Rajan Sethuraman acknowledged the resignation and confirmed the last working date, stating the company will work to ensure a smooth transition of roles and responsibilities.",
            "Sentiment": "neutral",
            "PublishDate": 1762363232113,
            "Source": "corporate_governance"
        },
        {
            "Title": "LatentView Analytics Reports 23.2% Revenue Growth, Raises FY Guidance to 19-20%",
            "Summary": "LatentView Analytics delivered quarterly results with total operating revenue of INR 257 crores, marking 9.1% quarter-on-quarter growth and 23.2% year-on-year growth. The company achieved its 11th consecutive quarter of sequential revenue growth and hit a INR 1,000 crore run rate. Financial services practice showed strong momentum with 94% year-on-year growth and 30% sequential growth, driven by new client wins in the last 12 months. The Databricks partnership generated $1.4 million in new wins this quarter, with the company expecting to exceed $19 million in Databricks-related revenue this year, up from $11 million last year. Management raised revenue growth guidance from 18-19% to 19-20% for the fiscal year. EBITDA margin came in at 21.8% on reported basis and 22.5% on adjusted basis. The technology vertical showed some sluggishness with expected growth of 7-8%, though the company aims to reach low double digits. Consumer goods practice, including the integrated DecisionPoint business, is expected to grow 28% year-on-year. The company is expanding its AI Center of Excellence and building capabilities in generative AI and agentic frameworks, having already generated $5.5 million in AI-related revenue with another $7 million in pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1762184621048,
            "Source": "earnings"
        },
        {
            "Title": "Latent View Raises Revenue Growth Forecast to 19-20% and Adjusts Financial Guidance",
            "Summary": "Latent View increased its annual revenue growth forecast from 18-19% to 19-20% during a conference call. The company maintained its 3-year revenue target of $200-220 million through FY28 but adjusted its EBITDA margin guidance for the year to 22-23% from the previous 23-24% due to ongoing growth investments. The company expects its tax rate to stabilize at 25-26% and operating expenses to remain between INR 30-33 crores quarterly.",
            "Sentiment": "positive",
            "PublishDate": 1761622490418,
            "Source": "stock"
        },
        {
            "Title": "LatentView CFO Highlights GenAI Revenue Growth and Stable Margins Amid Expansion",
            "Summary": "LatentView Analytics achieved its 10th consecutive quarter of growth, with strong performance in banking, financial services and consumer packaged goods retail verticals. CFO Rajan Venkatesan reported the financial services segment grew 30% sequentially and expects 70-80% year-on-year growth for FY25. Generative AI is contributing $8-10 million in annual revenue and serving as a key growth driver. The company maintains gross margins above 50% with no pricing pressure, though profitability dipped slightly due to one-time deferred tax income. LatentView expects steady-state PAT margins as the effective tax rate normalizes around 25%. The firm is expanding nearshore delivery centers in Canada and Mexico, targeting a workforce mix of 70% offshore, 20% onsite, and 10% nearshore. Strategic investments in GenAI and Databricks capabilities are aimed at sustaining double-digit growth.",
            "Sentiment": "positive",
            "PublishDate": 1761561314745,
            "Source": "stock"
        },
        {
            "Title": "LatentView Analytics Reports Strong Q2 Growth, Focuses on AI and Global Expansion",
            "Summary": "LatentView Analytics reported Q2 consolidated net profit of 444 million rupees compared to 399 million rupees year-over-year. Revenue increased to 2.6 billion rupees from 2.1 billion rupees year-over-year. EBITDA rose to 561 million rupees from 453 million rupees year-over-year, with EBITDA margin improving to 21.79% from 21.67%. The company is focusing on growth through generative AI solutions, data engineering powered by Databricks, expanding nearshore delivery centers in the US, Canada, and LATAM, and strengthening client mining strategy for profitable expansion.",
            "Sentiment": "positive",
            "PublishDate": 1761324654897,
            "Source": "stock"
        },
        {
            "Title": "LatentView Analytics Says U.S. H-1B Visa Fee Increase Won't Significantly Impact Operations",
            "Summary": "LatentView Analytics announced that the recent U.S. Executive Order increasing H-1B visa application fees is not expected to significantly impact their operations or financials. The company filed 135 new H-1B visa petitions in Financial Year 26, with 32 approvals from USCIS. LatentView is proactively evaluating opportunities to reduce H-1B visa dependence through in-market lateral and campus hiring, nearshoring, and increased offshoring. The company will continue monitoring developments and provide updates as appropriate.",
            "Sentiment": "neutral",
            "PublishDate": 1758625300426,
            "Source": "stock"
        },
        {
            "Title": "Latent View Analytics Appoints Dr. Anindya Ghose as Independent Director for Five-Year Term",
            "Summary": "Latent View Analytics Limited shareholders approved the appointment of Dr. Anindya Ghose as an Independent, Non-Executive Director for a five-year term starting May 02, 2025, during the 19th Annual General Meeting held on July 22, 2025. Dr. Ghose is the Heinz Riehl Chair Professor of Business at NYU's Stern School of Business and a globally recognized expert in AI transformation. He is the author of multiple books including 'TAP: Unlocking The Mobile Economy' and co-author of 'THRIVE: Maximizing Well-Being in the Age of AI.' His research focuses on economics of AI, digital platforms, mobile commerce, and data privacy. Dr. Ghose has served as an expert witness for major tech companies including Alibaba, Apple, Google, Meta, and others in various legal proceedings. He is not related to any existing directors of the company and is not debarred from holding directorial positions.",
            "Sentiment": "positive",
            "PublishDate": 1753350662549,
            "Source": "corporate_governance"
        },
        {
            "Title": "Latent View Analytics Reports Q1 FY26 Results with 32% Revenue Growth",
            "Summary": "Latent View Analytics announced its Q1 FY26 financial results for the quarter ended June 30, 2025. The company reported total revenue from operations of ₹2,360 million, representing a 31.9% year-over-year growth and 1.6% quarter-over-quarter growth. Adjusted EBITDA stood at ₹523 million with a margin of 22.2%, while reported PAT was ₹506 million, showing 30% year-over-year growth. The company reached a $100 million milestone in FY25 and has grown 1.93x since FY22. Revenue concentration shows 62% from top 5 clients and 75% from top 10 clients. The company serves 100 clients and has over 1,600 employees globally across North America, LATAM, APAC, UK, and EU. Financial Services vertical grew 48% year-over-year, while 77% of revenue comes from clients served for over 5 years.",
            "Sentiment": "positive",
            "PublishDate": 1753098037412,
            "Source": "earnings"
        },
        {
            "Title": "Latent View Analytics Reports Q1 FY2026 Results, Acquires Additional 10% Stake in Decision Point",
            "Summary": "Latent View Analytics Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025. The company transitioned to a new corporate tax regime during the quarter, resulting in a reduced tax rate and a deferred tax credit of INR 48.7 million in consolidated results. On June 2, 2025, the company acquired an additional 10% stake in Decision Point and its subsidiaries for INR 11.09 million as per the Share Purchase Agreement terms. The company also re-assessed employee salary structures to align with industry standards, resulting in an actuarial loss of INR 24.39 million under Other Comprehensive Income. The trading window for equity shares will open 48 hours after the financial results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1753095196917,
            "Source": "earnings"
        },
        {
            "Title": "Latent View Analytics Expects GenAI Revenue to Double, Reach 12-14% of Total Revenue by FY26",
            "Summary": "Latent View Analytics' Co-CEO reported growth in the company's Generative AI business segment. The GenAI work is projected to double and represent 12-14% of the company's total revenue by FY26.",
            "Sentiment": "positive",
            "PublishDate": 1753090995480,
            "Source": "stock"
        },
        {
            "Title": "Latent View Analytics Reports Strong Q1 Growth with Revenue Up 33% Year-over-Year",
            "Summary": "Latent View Analytics reported quarterly revenue of 2.4 billion rupees, representing a significant increase from 1.8 billion rupees in the same period last year. The company's consolidated net profit rose to 508 million rupees compared to 389 million rupees year-over-year. EBITDA increased to 504 million rupees from 383 million rupees, though the EBITDA margin remained relatively stable at 21.37% versus 21.39% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753089803862,
            "Source": "earnings"
        },
        {
            "Title": "Latent View Analytics: Q4 Profit Rises 18.4%, Revenue Surges 35.3%",
            "Summary": "Latent View Analytics reported Q4FY25 net profit of ₹53.5 crore, up 18.4% YoY. Revenue grew 35.3% to ₹232 crore. EBITDA increased 36% to ₹55 crore with margins at 23.6%. Stock rose 6.2% intraday on BSE following results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1746178188000,
            "Source": "earnings"
        },
        {
            "Title": "Latent View Analytics Reports Q4 Profit Increase",
            "Summary": "Latent View Analytics announced its Q4 consolidated net profit of 535 million rupees, up from 452.4 million rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1746174386000,
            "Source": "result"
        },
        {
            "Title": "Latent View Analytics Reports Improved Q3 EBITDA and Margin",
            "Summary": "Latent View Analytics has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 503 million rupees from 388 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 22.08% from 20.86% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738921193000,
            "Source": "earnings"
        },
        {
            "Title": "Latent View Analytics Reports Q3 Revenue Growth",
            "Summary": "Latent View Analytics has announced its Q3 revenue, which stands at 2.3 billion rupees. This represents a significant increase from the previous year's Q3 revenue of 1.66 billion rupees, indicating strong year-over-year growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1738921188000,
            "Source": "earnings"
        },
        {
            "Title": "Latent View Analytics Reports Q3 Net Profit Decline",
            "Summary": "Latent View Analytics has reported a consolidated net profit of 420 million rupees for the third quarter, down from 465 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1738921130000,
            "Source": "earnings"
        },
        {
            "Title": "Latent View Analytics Reports Q2 Revenue Growth",
            "Summary": "Latent View Analytics has announced its Q2 revenue of 2.1 billion rupees, showing a significant increase from 1.56 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731051495000,
            "Source": "result"
        },
        {
            "Title": "Latent View Analytics Reports Q2 Profit Increase",
            "Summary": "Latent View Analytics has reported a consolidated net profit of 399 million rupees for the second quarter, up from 340.3 million rupees in the same period last year. This represents a year-over-year increase in profitability for the company.",
            "Sentiment": "positive",
            "PublishDate": 1731051468000,
            "Source": "result"
        }
    ]
}