{
    "Symbol": "LAURUSLABS",
    "ISIN": "INE947Q01028",
    "News": [
        {
            "Title": "Laurus Labs Block Trade Worth Rs. 59.97 Crores",
            "Summary": "Laurus Labs witnessed a significant NSE block trade worth Rs. 59.97 crores involving approximately 593,935 shares at Rs. 1009.70 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769493740614,
            "Source": "co_actions_results"
        },
        {
            "Title": "Laurus Labs Targets Growth, 60% Margins in FY26",
            "Summary": "Laurus Labs aims for strong operational growth in FY26 while maintaining stable gross margins around 60% for the upcoming quarter and next financial year.",
            "Sentiment": "positive",
            "PublishDate": 1769485780591,
            "Source": "stocks"
        },
        {
            "Title": "High-PE Stocks Defy Market Correction with Strong Fundamentals",
            "Summary": "Laurus Labs, Jain Resource Recycling, and Syrma SGS Technology maintain elevated valuations despite market weakness, supported by robust growth strategies and improving margins across their respective sectors.",
            "Sentiment": "positive",
            "PublishDate": 1769327410873,
            "Source": "stocks"
        },
        {
            "Title": "Laurus Labs CDMO Revenue Jumps 42.7% in 9M FY26",
            "Summary": "Laurus Labs reports strong growth in its Contract Development and Manufacturing Organization (CDMO) segment, with revenue reaching ₹14.90 billion in the first nine months of FY26 compared to ₹10.44 billion in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1769162049032,
            "Source": "co_actions_results"
        },
        {
            "Title": "Laurus Labs Q3 Net Profit Surges 173% to ₹252 Crores",
            "Summary": "Laurus Labs reported consolidated net profit of ₹252 crores in Q3 compared to ₹92.30 crores in the same quarter last year, marking significant growth for the pharmaceutical company.",
            "Sentiment": "positive",
            "PublishDate": 1769160965798,
            "Source": "co_actions_results"
        },
        {
            "Title": "Laurus Labs Grants 4.23 Lakh Stock Options to Employees",
            "Summary": "Laurus Labs approved grant of 4,23,125 stock options at ₹754.50 per option across three ESOP schemes to 1,194 employees. Options vest over 2-5 years with effective date July 01, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1769147332660,
            "Source": "co_actions_results"
        },
        {
            "Title": "Laurus Labs Block Trade Worth ₹15.41 Crores on NSE",
            "Summary": "Laurus Labs witnessed a significant block trade on NSE involving 144,736 shares at ₹1,064.70 per share, totaling ₹15.41 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1768803038310,
            "Source": "co_actions_results"
        },
        {
            "Title": "Laurus Labs Block Trade Worth ₹55.00 Crores on NSE",
            "Summary": "Laurus Labs witnessed another block trade on NSE involving 517,109 shares worth ₹55.00 crores at ₹1,063.70 per share, showing continued institutional activity in the pharmaceutical stock.",
            "Sentiment": "neutral",
            "PublishDate": 1768798175782,
            "Source": "co_actions_results"
        },
        {
            "Title": "Laurus Labs to announce Q3 results on January 23",
            "Summary": "Laurus Labs has scheduled its third quarter financial results announcement for January 23, 2025, as the pharmaceutical company prepares to release its quarterly performance data.",
            "Sentiment": "neutral",
            "PublishDate": 1767939875875,
            "Source": "co_actions_results"
        },
        {
            "Title": "Laurus Labs Block Trade Worth ₹26.70 Crores on NSE",
            "Summary": "Laurus Labs witnessed a significant block trade on NSE involving 240,894 shares valued at ₹26.70 crores, executed at ₹1,108.30 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767240389536,
            "Source": "co_actions_results"
        },
        {
            "Title": "Laurus Labs Invests ₹349.99 Cr in Laurus Bio",
            "Summary": "Laurus Labs Limited invested ₹349.99 crores in subsidiary Laurus Bio through acquisition of 13,487 Series A3 preference shares, increasing shareholding to 75.61% on fully diluted basis.",
            "Sentiment": "positive",
            "PublishDate": 1766492907271,
            "Source": "stocks"
        },
        {
            "Title": "Laurus Labs Allots 31,683 Equity Shares to Employees Under ESOP Exercise",
            "Summary": "Laurus Labs allotted 31,683 equity shares of Rs. 2/- each to eligible employees on December 02, 2025, following exercise of stock options across multiple ESOP schemes from 2016, 2018, and 2021. The allotment increased the company's total paid-up capital to Rs. 1,07,97,13,164/- and total issued shares to 53,98,56,582, with diluted earnings per share at Rs. 7.05/-.",
            "Sentiment": "neutral",
            "PublishDate": 1764667470542,
            "Source": "corporate_action"
        },
        {
            "Title": "Laurus Labs Sees Rs. 53.85 Crore Block Trade on NSE",
            "Summary": "Laurus Labs executed a block trade worth Rs. 53.85 crores involving 550,942 shares at Rs. 977.40 per share on the NSE. The transaction represents a significant institutional or bulk investor activity in the pharmaceutical company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764141596395,
            "Source": "order&deals"
        },
        {
            "Title": "Laurus Labs Reports Strong Q2 FY26 Results with 35% Revenue Growth and Margin Expansion",
            "Summary": "Laurus Labs delivered robust quarterly results with revenue of INR 1,653 crores, marking 35% growth. The company achieved gross margins of approximately 60% and EBITDA margins of 26%, representing an 11 percentage point expansion. ARV business contributed INR 733 crores compared to INR 647 crores in the previous quarter. CDMO division recorded sales of INR 471 crores for the quarter and INR 964 crores for the first half with 88% growth, driven by mid-to-late phase program deliveries and commercial supplies. The company received allotment of 532 acres from Andhra Pradesh government in Vizag, where it plans to invest $600 million over 8 years for a pharmaceutical manufacturing complex. Laurus invested $2 million in an ADC technology platform company to enhance integrated ADC services. The company maintained its ARV sales guidance of INR 2,500 crores plus or minus INR 200 crores for the full year. Total capex for the current year is estimated at INR 1,000 crores, with the company planning continued investments in new modalities including fermentation, gene therapy, and ADC capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1761650401521,
            "Source": "earnings"
        },
        {
            "Title": "Laurus Labs Shares Drop Despite Strong Q2 Results as Analysts Remain Divided on Valuation",
            "Summary": "Laurus Labs shares declined 0.50% to ₹929.75 despite reporting better-than-expected quarterly results. The pharmaceutical company delivered a 35.1% year-on-year revenue growth to ₹16.5 billion, with EBITDA margin expanding 980 basis points to 24.4%. The synthesis business and formulation sales both grew 58% year-on-year, with formulations reaching ₹5.2 billion. Analyst opinions are sharply divided - domestic brokerages Motilal Oswal, DAM Capital, and CIE maintained Buy ratings with target prices between ₹1,083-₹1,110, citing earnings upcycle and CDMO scale-up. However, foreign brokerages remained cautious about premium valuations, with Goldman Sachs and Kotak Securities issuing Sell ratings with targets of ₹775 and ₹625 respectively. Jefferies maintained Underperform with a ₹700 target, expressing concerns about the company's announced $600 million capex over eight years for a new Vizag site.",
            "Sentiment": "neutral",
            "PublishDate": 1761310141439,
            "Source": "stock"
        },
        {
            "Title": "Laurus Labs Promises Better EBITDA Margins in FY27 vs FY26",
            "Summary": "Laurus Labs has committed to delivering improved EBITDA margins in FY27 compared to FY26. The pharmaceutical company's promise indicates expectations for enhanced profitability in the upcoming fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1761281097585,
            "Source": "stock"
        },
        {
            "Title": "Laurus Labs Raises Gross Margin Forecast to 60% and Announces Major Expansion Plans",
            "Summary": "Laurus Labs has revised its gross margin expectations upward to approximately 60%, an improvement from earlier forecasts of 55% and 50%. The company attributes this enhancement to business growth and stronger positions in antiretroviral (ARV) and oncology segments. The pharmaceutical company forecasts antiretroviral sales of around ₹2,500 crore with a margin of ₹200 crore and plans capital expenditure of ₹1,000 crore for FY26. Laurus Labs expects improved EBITDA margins through focus on small and large molecule CDMO operations and better asset utilization. The company announced a $600 million investment over 8 years for a new 530-acre manufacturing complex, separate from existing facilities. Management aims to increase asset turnover from 0.9 to 1.1.",
            "Sentiment": "positive",
            "PublishDate": 1761276869710,
            "Source": "stock"
        },
        {
            "Title": "Laurus Labs Reduces Net Debt Leverage to 1.3X EBITDA While Boosting Capital Expenditure by 85%",
            "Summary": "Laurus Labs reported a significant reduction in net debt leverage to 1.3X EBITDA over the past year. The pharmaceutical company maintained capital expenditure at 15% of sales while investing in manufacturing network expansion. The company achieved over 85% growth in capital expenditure for its API and CDMO portfolio, supported by an integrated drug product strategy.",
            "Sentiment": "positive",
            "PublishDate": 1761213754915,
            "Source": "stock"
        },
        {
            "Title": "Laurus Labs Approves Financial Results and Declares Rs 0.80 Interim Dividend",
            "Summary": "Laurus Labs' Board of Directors approved unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. The board also approved an interim dividend of Rs 0.80 per equity share (40%) for FY 2025-26. The record date for dividend eligibility is set as October 31, 2025, with payment scheduled on or after November 12, 2025. The financial results have been submitted to stock exchanges along with limited review reports from statutory auditors Deloitte Haskins & Sells LLP.",
            "Sentiment": "positive",
            "PublishDate": 1761212562093,
            "Source": "corporate_action"
        },
        {
            "Title": "Laurus Labs Reports Strong Q2 Performance with Revenue Up 35% and EBITDA Doubling",
            "Summary": "Laurus Labs delivered robust quarterly results with revenue rising to 16.5 billion rupees from 12.24 billion rupees year-over-year. The company's consolidated net profit surged to 1.95 billion rupees compared to 198 million rupees in the same period last year. EBITDA doubled to 4 billion rupees from 1.79 billion rupees, while EBITDA margin expanded significantly to 24.39% from 14.57% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761212150393,
            "Source": "earnings"
        },
        {
            "Title": "Laurus Labs Reports 65% Growth in September Quarter",
            "Summary": "Laurus Labs reported growth of 65% for the September quarter. The company also reported growth of 52% for the month of September.",
            "Sentiment": "positive",
            "PublishDate": 1760421840836,
            "Source": "earnings"
        },
        {
            "Title": "Laurus Labs Schedules Quarterly Results Review for October 23",
            "Summary": "Laurus Labs has announced it will review its second quarter results on October 23. The pharmaceutical company has set this date for the quarterly earnings review.",
            "Sentiment": "neutral",
            "PublishDate": 1760001797816,
            "Source": "earnings"
        },
        {
            "Title": "Laurus Labs Says US 100% Pharma Tariffs Won't Significantly Impact Business",
            "Summary": "Laurus Labs does not expect significant implications from the US 100% tariff on branded pharmaceutical products, according to CEO Satyanarayana Chava. The Trump administration will impose the tariff starting Oct. 1 on branded or patented drugs unless companies have or are building US manufacturing plants. Laurus Labs derives 40% of revenue from antiretroviral drugs, primarily sold to Africa, keeping this segment insulated. Non-ARV generics, representing 27% of revenue, remain exempt from US tariffs. The company's CDMO operations account for 33% of revenue, with only 5% of sales shipped to the US, where tariff costs would likely be passed to clients. Following the tariff announcement, Laurus Labs shares fell 8.2% to Rs 823.1. The stock has gained 81% over the past 12 months. Among 16 analysts covering the stock, seven recommend 'buy', three suggest 'hold', and six advise 'sell'.",
            "Sentiment": "neutral",
            "PublishDate": 1758878572839,
            "Source": "stock"
        },
        {
            "Title": "Laurus Lab Reports 94% Export Growth in August",
            "Summary": "Laurus Lab reported a 94% growth in exports during August. The pharmaceutical company saw significant expansion in its export business during the month.",
            "Sentiment": "positive",
            "PublishDate": 1757995203998,
            "Source": "stock"
        },
        {
            "Title": "Laurus Labs Reports Strong Q1 FY26 Performance with 31% Revenue Growth and Expanding CDMO Business",
            "Summary": "Laurus Labs delivered robust quarterly results with revenues of ₹1,570 crores, marking 31% year-over-year growth. EBITDA increased significantly to ₹389 crores with margins improving to 24.8%, up 1,050 basis points from the previous year. Net profit surged to ₹163 crores, representing 1,154% growth year-over-year. The company's CDMO business showed strong momentum, contributing 28% of total revenues with 32% CAGR growth over FY20-25. Gross margins remained healthy at 59.4%. The company operates 15 facilities with over 7,500 employees including 1,400+ scientists. Laurus has ongoing capacity expansion projects including new facilities for gene therapy, ADCs, and fermentation capabilities. The company maintains a diversified portfolio across small molecules, biotechnology, and cell & gene therapy segments, with declining dependence on ARV products.",
            "Sentiment": "positive",
            "PublishDate": 1757660353684,
            "Source": "stock"
        },
        {
            "Title": "Laurus Labs Plans Demerger and Merger of LSPL Operations Starting April 2026",
            "Summary": "Laurus Labs announced plans to demerge LSPL Unit-1 into Sriam Labs while merging the remaining LSPL business into the company. The restructuring is scheduled to begin on April 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1755768629715,
            "Source": "corporate_action"
        },
        {
            "Title": "Laurus Labs Reports Strong Q1 Performance with 31% Revenue Growth, CDMO Business Drives Margins",
            "Summary": "Laurus Labs delivered robust quarterly results with revenues of INR 1,570 crores, marking 31% year-on-year growth. The CDMO business showed strong performance with sales of INR 493 crores, driven by mid-to-late stage NCE deliveries and increased Big Pharma projects. The company maintains over 110 active CDMO projects across Human Health, Animal Health, and Crop Sciences. Gross margins expanded to 59%, while EBITDA margins improved by 10.5 percentage points to approximately 25%. The Generics division grew 12% to INR 1,048 crores, supported by volume expansion in ARV and developed market sales. Laurus Bio reported flat sales of INR 29 crores due to customer-specific scale-up challenges. The company announced three major capacity expansions including microbial fermentation facility at Vizag, gene therapy and ADC facility at Shameerpet, and formulation facility under Krka joint venture. Management expects CDMO contribution to potentially reach 50% of revenue in the medium term, up from current 30%. The company invested INR 265 crores in capex and maintains net debt of INR 2,388 crores with debt-to-EBITDA ratio of 1.8.",
            "Sentiment": "positive",
            "PublishDate": 1753782693720,
            "Source": "earnings"
        },
        {
            "Title": "Laurus Labs Targets 25% EBITDA Margins, CDMO Business to Exceed 30% Revenue Share",
            "Summary": "Laurus Labs expects gross margins to remain in the 55-60% range for the financial year ending in March, driven by higher contribution from non-antiretroviral products and growing CDMO business. The company is targeting 25% EBITDA margins for the year, up from 20% last year. CEO Satyanarayana Chava expects CDMO revenue contribution to exceed 30% this year, with the business targeting ₹2,000 crore in CDMO revenue annually. The company supplied three new chemical entities for commercial supply in the last two quarters. Laurus Labs sees minimal impact from the US biotech funding slowdown as most revenue comes from big pharma companies with strong pipelines rather than small biotech firms. The majority of CDMO revenues are from late-phase or commercial stage molecules rather than early-stage development.",
            "Sentiment": "positive",
            "PublishDate": 1753687079150,
            "Source": "stock"
        },
        {
            "Title": "Laurus Labs Sets Financial Targets with Gross Margins at 55-60% and CDMO Revenue Growth Plans",
            "Summary": "Laurus Labs has outlined its financial expectations, targeting gross margins to remain between 55-60%. The company plans to maintain net debt at no more than 50% of annual revenue and keep its debt/EBITDA ratio at 2-2.5x. Laurus Labs expects ARV revenue of approximately Rs 2,500 crore with a margin of Rs 200 crore. The pharmaceutical company anticipates its CDMO (Contract Development and Manufacturing Organization) contribution to increase from the current 30% to around 50% of total revenue in the medium term.",
            "Sentiment": "positive",
            "PublishDate": 1753674119635,
            "Source": "stock"
        },
        {
            "Title": "Laurus Labs Secures 531.77 Acres from Andhra Pradesh Government for Pharma Zone Development",
            "Summary": "Laurus Labs Limited has received an allotment of 531.77 acres of land in IP Rambilli Phase-II of Anakapalli District from the Government of Andhra Pradesh for establishing the Laurus Pharma Zone (LPZ). The land will be used to set up manufacturing units for pharmaceutical products. The company has projected an investment of ₹5,630 crores and plans to provide employment to 6,350 people across three phases over eight years. The government issued G.O.Ms.No.136 dated July 27, 2025 for the land allotment. This land acquisition secures an important component for the company's future business expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1753631149978,
            "Source": "stock"
        },
        {
            "Title": "Laurus Labs Shares Audio Recording of Q1 FY26 Results Conference Call",
            "Summary": "Laurus Labs Limited hosted its Q1 FY26 results conference call on July 25, 2025. The pharmaceutical company has made the audio recording of the conference call available through a web link. The communication was signed by G. Venkateswar Reddy, Company Secretary & Compliance Officer, and sent to both BSE Limited and National Stock Exchange of India.",
            "Sentiment": "neutral",
            "PublishDate": 1753452997005,
            "Source": "earnings"
        },
        {
            "Title": "Laurus Labs Reports Strong Q1 Results with Revenue Up 32% and Profit Surge",
            "Summary": "Laurus Labs delivered robust quarterly performance with revenue reaching 15.7 billion rupees, representing a significant increase from 11.9 billion rupees in the same period last year and exceeding estimates of 14.95 billion rupees. The company's consolidated net profit surged to 1.63 billion rupees compared to 125 million rupees year-over-year, substantially beating estimates of 1.23 billion rupees. EBITDA more than doubled to 3.82 billion rupees from 1.71 billion rupees, surpassing estimates of 3.24 billion rupees. The EBITDA margin expanded to 24.35% from 14.33% in the previous year, also exceeding the estimated 21.4%.",
            "Sentiment": "positive",
            "PublishDate": 1753436332837,
            "Source": "earnings"
        },
        {
            "Title": "Laurus Labs Stock Near 52-Week High Ahead of Quarterly Results",
            "Summary": "Laurus Labs shares traded 0.8% lower ahead of quarterly results announcement, despite reaching a 52-week high and gaining 25% over the past month. Market expectations include revenue growth of 27% to ₹1,514.2 crore and EBITDA jumping 89% to ₹324 crore. EBITDA margin is projected to expand to 21.4% from 14.3% in the previous year, potentially marking the third consecutive quarter above 20%. The formulations segment is expected to grow over 40%, driven by Non-Anti-Retro-Viral business growth of 25%. The contract manufacturing (CDMO) business may see over 100% growth year-over-year but could decline 5-6% sequentially. The company maintains a pipeline of over 110 active CDMO projects, with 90 in human health and 20 in animal health and crop protection. ARV sales are anticipated to remain at ₹2,500 crore, though their contribution to total revenue may decrease from 45% to 36% by next financial year.",
            "Sentiment": "positive",
            "PublishDate": 1753424512039,
            "Source": "earnings"
        },
        {
            "Title": "Laurus Labs: Shares Hit New All-Time High, Up 19% in 11 Days",
            "Summary": "Laurus Labs stock surged 19.35% in 11 days, reaching a new all-time high of Rs 799.4 on BSE. Analysts cite a breakout above Rs 720-725 range as key driver. Technical indicators suggest strong momentum, with potential targets of Rs 890 and Rs 945 in 6-12 months. Experts advise caution for new buyers at current levels.",
            "Sentiment": "positive",
            "PublishDate": 1752133760000,
            "Source": "normal_news"
        },
        {
            "Title": "Laurus Labs Reports Significant Increase in Exports",
            "Summary": "Laurus Labs has reported that its exports reached USD 106 million on June 25, marking a substantial increase of 221% compared to a previous period. This significant growth in exports indicates a positive development for the company's international business operations.",
            "Sentiment": "positive",
            "PublishDate": 1752120185000,
            "Source": "default"
        },
        {
            "Title": "Laurus Labs Reports Significant Export Growth in May 2025",
            "Summary": "Laurus Labs experienced a substantial increase in exports in May 2025, with a growth of 104% compared to May 2024. This represents more than doubling of their export figures year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1750051515000,
            "Source": "default"
        },
        {
            "Title": "Laurus Labs: Projecting 24% EBITDA Margin for FY26 After Strong Q4",
            "Summary": "Laurus Labs expects to achieve 24-24.5% EBITDA margins in FY26, driven by strong CDMO segment demand and asset leverage. Q4 FY25 saw revenue growth of 19% YoY to Rs 1,720 crore and net profit tripled to Rs 234 crore. The company anticipates better revenue growth in FY26 compared to FY25, with CDMO contribution expected to match generics in the next five years.",
            "Sentiment": "positive",
            "PublishDate": 1745643535000,
            "Source": "earnings"
        },
        {
            "Title": "Laurus Labs Provides Positive Business Outlook",
            "Summary": "Laurus Labs has provided guidance on its business prospects during a conference call. The company reports no halt in USAID spending and expects its ARV (antiretroviral) business to remain stable in FY26. Additionally, Laurus Labs anticipates topline growth with improved EBITDA margins and further strengthening of its CDMO (Contract Development and Manufacturing Organization) business, with ongoing discussions for key molecules.",
            "Sentiment": "positive",
            "PublishDate": 1745553360000,
            "Source": "default"
        },
        {
            "Title": "Laurus Labs: Q4 Profit Surges, Margins Exceed 20% for Second Quarter",
            "Summary": "Laurus Labs reported Q4 net profit of ₹233.6 crore, up from ₹75.6 crore last year, aided by tripled other income. EBITDA rose 74% YoY to ₹419 crore, with margins expanding to 24.5%. This marks the second consecutive quarter with margins above 20%.",
            "Sentiment": "positive",
            "PublishDate": 1745487592000,
            "Source": "earnings"
        },
        {
            "Title": "Laurus Labs Reports Strong Q4 Financial Results",
            "Summary": "Laurus Labs announced its Q4 financial results, showing significant year-over-year growth. Revenue increased to 17.2 billion rupees from 14.4 billion rupees, surpassing estimates of 16.46 billion. EBITDA rose to 4.20 billion rupees from 2.41 billion rupees, exceeding expectations of 3.98 billion. The EBITDA margin improved to 24.42% from 16.82%, slightly above the estimated 24%.",
            "Sentiment": "positive",
            "PublishDate": 1745487029000,
            "Source": "result"
        },
        {
            "Title": "Laurus Labs Reports Strong Q4 Profit Growth",
            "Summary": "Laurus Labs, an Indian pharmaceutical company, has reported a significant increase in its consolidated net profit for the fourth quarter. The company's net profit rose to 2.34 billion rupees, up from 756 million rupees in the same period last year. This performance exceeded market expectations, as the estimated profit was 1.85 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1745486784000,
            "Source": "result"
        },
        {
            "Title": "Laurus Labs Receives EIR from USFDA for API Manufacturing Facility Inspection",
            "Summary": "Laurus Labs has announced that the U.S. Food and Drug Administration (USFDA) conducted an inspection of their Active Pharmaceutical Ingredient (API) manufacturing facility located in Visakhapatnam, Andhra Pradesh. Following the inspection, the company has received the Establishment Inspection Report (EIR) from the USFDA, indicating the successful completion of the inspection process.",
            "Sentiment": "positive",
            "PublishDate": 1744698761000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Laurus Labs Receives EIR from USFDA for API Facility",
            "Summary": "Laurus Labs has received an Establishment Inspection Report (EIR) from the U.S. Food and Drug Administration (USFDA) for its Active Pharmaceutical Ingredient (API) Unit-4 facility located in Andhra Pradesh. This follows an inspection conducted in January 2025.",
            "Sentiment": "positive",
            "PublishDate": 1744698750000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Laurus Labs Reports Significant Increase in Exports",
            "Summary": "Laurus Labs, a CDMO pharma player in India, has reported a substantial increase in exports. The company's exports reached $53 million, marking an 18% year-over-year growth. Additionally, Q4 exports showed an impressive 60% year-over-year jump.",
            "Sentiment": "positive",
            "PublishDate": 1744354160000,
            "Source": "earnings"
        },
        {
            "Title": "Laurus Labs Invests ₹83 Crore in Krka Pharma Through Rights Issue",
            "Summary": "Laurus Labs has made an investment of ₹83 crore (approximately $10 million) in Krka Pharma through a rights issue. This corporate action indicates a significant financial commitment by Laurus Labs to support or expand its stake in Krka Pharma.",
            "Sentiment": "neutral",
            "PublishDate": 1742181277000,
            "Source": "corporate_action"
        },
        {
            "Title": "Laurus Labs: Board Approves Rs 83.3 Crore Investment in KRKA Pharma Joint Venture",
            "Summary": "Laurus Labs' board approved an investment of Rs 83.3 crore in KRKA Pharma Pvt Ltd, a joint venture. KRKA d.d., Novo Mesto will invest Rs 86.7 crore, maintaining the 51:49 shareholding ratio. The investment aims to acquire land and cover initial costs for a new manufacturing facility targeting new markets, including India.",
            "Sentiment": "positive",
            "PublishDate": 1741315809000,
            "Source": "corporate_action"
        },
        {
            "Title": "Laurus Labs Approves Investment in KRKA Pharma",
            "Summary": "Laurus Labs has approved an investment of 833 million rupees to acquire 83.3 million equity shares in KRKA Pharma. Additionally, KRKA D.D. will invest 867 million rupees in KRKA Pharma.",
            "Sentiment": "positive",
            "PublishDate": 1741263380000,
            "Source": "corporate_action"
        },
        {
            "Title": "USAID HIV Funds Not Released Despite Court Ruling for Laurus Labs",
            "Summary": "A court ruling in favor of Laurus Labs regarding USAID HIV funds has not resulted in the release of those funds, according to the New York Times. This situation may impact Laurus Labs' operations or financial expectations related to HIV drug production or distribution.",
            "Sentiment": "negative",
            "PublishDate": 1740124707000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Laurus Labs: US Approves Emergency Waiver for HIV Treatment, Shares Surge",
            "Summary": "Laurus Labs shares rose up to 6% after the US approved an emergency humanitarian waiver allowing continued access to HIV treatment across 55 countries. This follows a 15% drop on Monday due to concerns about PEPFAR funding stoppage. Laurus Labs clarified that any potential funding freeze would not significantly impact its business.",
            "Sentiment": "positive",
            "PublishDate": 1738210275000,
            "Source": "normal_news"
        },
        {
            "Title": "Laurus Labs Resumes PEPFAR Program Worth 7.5 Billion Rupees",
            "Summary": "Laurus Labs has announced the resumption of the PEPFAR program, which is valued at 7.5 billion rupees (approximately USD 90 million). PEPFAR, overseen by the U.S. State Department, is likely related to HIV/AIDS relief efforts. This development suggests a significant business opportunity for Laurus Labs in the pharmaceutical sector.",
            "Sentiment": "positive",
            "PublishDate": 1738209729000,
            "Source": "corporate_action"
        }
    ]
}