{
    "Symbol": "LAXMIINDIA",
    "ISIN": "INE06WU01026",
    "News": [
        {
            "Title": "Laxmi India Finance Q3FY26 Results Show Strong Growth",
            "Summary": "Laxmi India Finance reported robust Q3FY26 performance with net profit rising 63.58% YoY to ₹1,006.22 lakhs. Revenue from operations grew 28.85% to ₹7,883.23 lakhs, driven by higher interest income.",
            "Sentiment": "positive",
            "PublishDate": 1770810731009,
            "Source": "co_actions_results"
        },
        {
            "Title": "Laxmi India Finance submits Q3FY26 IPO monitoring report",
            "Summary": "Laxmi India Finance Limited submitted its quarterly monitoring agency report for Q3FY26, showing Rs. 164.12 crore utilization of IPO proceeds with Rs. 1.05 crore remaining unutilized.",
            "Sentiment": "neutral",
            "PublishDate": 1770789747581,
            "Source": "stocks"
        },
        {
            "Title": "Laxmi India Finance Q3FY26 Results Show Strong Growth",
            "Summary": "Laxmi India Finance reports 37.3% YoY growth in interest income to ₹7,198.63 lakhs and 63.6% jump in net profit to ₹1,006.22 lakhs for Q3FY26. Company also appoints new CTO.",
            "Sentiment": "positive",
            "PublishDate": 1770740482411,
            "Source": "co_actions_results"
        },
        {
            "Title": "Laxmi India Finance Gets Credit Rating Reaffirmation",
            "Summary": "Acuité Ratings reaffirms ACUITE A- rating with positive outlook for Laxmi India Finance's Non-Convertible Debentures worth Rs. 80.00 crore, maintaining strong credit profile.",
            "Sentiment": "positive",
            "PublishDate": 1770298517576,
            "Source": "stocks"
        },
        {
            "Title": "Laxmi India Finance Reports 24.75% AUM Growth, Completes IPO Raising ₹151.58 Crores",
            "Summary": "Laxmi India Finance achieved ₹1,386.49 crores AUM with 24.75% year-on-year growth and completed its IPO raising ₹151.58 crores, strengthening capital adequacy ratio to 31.90%. The company reported PAT of ₹19.06 crores for H1 FY26 despite facing asset quality pressure with GNPA rising to 1.59% due to floods in Rajasthan and Madhya Pradesh affecting rural operations.",
            "Sentiment": "neutral",
            "PublishDate": 1763960495335,
            "Source": "earnings"
        },
        {
            "Title": "Laxmi India Finance Reports Strong Q2FY26 Performance with 25.30% AUM Growth and Successful IPO",
            "Summary": "Laxmi India Finance achieved AUM of ₹1,386.49 crores with 25.30% growth and PAT of ₹19.06 crores despite IPO expenses of ₹2.67 crores in Q2FY26. The company expanded to 164 branches across five states, improved CRAR to 31.90%, reduced cost of borrowings to 11.10%, and maintained healthy asset quality with GNPA at 1.59%.",
            "Sentiment": "neutral",
            "PublishDate": 1763489089389,
            "Source": "corporate_action"
        },
        {
            "Title": "Laxmi India Finance Limited Schedules Q2 FY26 Earnings Call",
            "Summary": "Laxmi India Finance Limited will host an earnings call on November 19, 2025 at 12:00 PM IST to discuss its unaudited financial results for the quarter and half year ended September 30, 2025. The call will feature senior management including CEO Deepak Baid, CFO Gopal Krishan, and Managing Director Kuldeep Singh Sikarwar discussing the company's quarterly performance with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1763131356501,
            "Source": "earnings"
        },
        {
            "Title": "Laxmi India Finance Reports Monitoring Agency Update on IPO Proceeds Utilization",
            "Summary": "Laxmi India Finance Limited submitted a monitoring agency report from CARE Ratings showing utilization of Rs. 58.97 crore for capital augmentation and Rs. 8.92 crore for share issue expenses from its Rs. 165.17 crore IPO proceeds for the quarter ended September 30, 2025. The report indicates no deviation from stated objectives, with Rs. 97.22 crore remaining unutilized and deployed in fixed deposits and bank accounts.",
            "Sentiment": "positive",
            "PublishDate": 1763119416940,
            "Source": "earnings"
        },
        {
            "Title": "Laxmi India Finance Settles Income Tax Compounding Case for ₹3.33 Lakh",
            "Summary": "Laxmi India Finance Limited received an order from the Income Tax Department compounding an offence under Section 276B read with Section 278B of the Income Tax Act for Financial Year 2016-17. The company paid compounding charges of ₹3,32,550 as determined by the authorities. The Principal Chief Commissioner of Income Tax (PCCIT), Rajasthan has compounded the offence and directed the Assessing Officer and CIT (TDS), Jaipur to take necessary action. The company states there are no further financial implications and no penalty, restriction, or sanction has been imposed following the settlement.",
            "Sentiment": "neutral",
            "PublishDate": 1760708771914,
            "Source": "stock"
        },
        {
            "Title": "Laxmi India Finance CTO Siddharth Modi Resigns Due to Personal Reasons",
            "Summary": "Siddharth Modi has resigned from his position as Chief Technology Officer at Laxmi India Finance Limited, effective October 14, 2025. Modi cited personal reasons for his departure in his resignation letter dated August 18, 2025. The company disclosed the resignation to stock exchanges BSE and NSE under regulatory requirements. Modi thanked the management and Board of Directors for their support during his employment tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1760529986309,
            "Source": "corporate_governance"
        },
        {
            "Title": "Laxmi India Finance Reports Quarterly Results with NPA Increase and Growth Plans",
            "Summary": "Laxmi India Finance released its earnings call transcript for the quarter ended June 30, 2025. The company reported a decline in net interest income due to a 10-15 basis points increase in NPAs, though management expects recovery in coming quarters. The company focuses on MSME customers with an average ticket size of INR 6.5 lakhs, with recent NPA increases across commercial vehicles and MSME loans. Credit costs are expected to remain between 1.13-1.17% in FY26. The company plans to open 30-35 new branches and enter one new state in FY26, targeting 35-40% AUM growth annually with a goal to reach INR 5,000-6,000 crores AUM in 3-5 years. Collection efficiency stood at 94.92% in Q1 FY26. IPO proceeds of INR 165 crores provide 4-5 months of liquidity. The company maintains focus on secured lending, particularly property-backed MSME loans which comprise 76% of the portfolio, with lending rates of 21-21.5% on the secured book.",
            "Sentiment": "neutral",
            "PublishDate": 1755608662747,
            "Source": "earnings"
        },
        {
            "Title": "Laxmi India Finance Reports Strong Q1 FY26 Results with 46.78% AUM Growth",
            "Summary": "Laxmi India Finance Limited reported quarterly results showing Assets Under Management grew 46.78% to ₹1,346.05 crores compared to ₹917.52 crores in the previous year. Profit Before Tax increased 46.78% to ₹12.77 crores from ₹8.70 crores. Profit After Tax rose 45.77% to ₹9.65 crores from ₹6.62 crores. Net Interest Income grew 41.80% to ₹30.86 crores from ₹23.88 crores. The company's Net Worth increased 28.87% to ₹268.50 crores from ₹208.35 crores. Cost of Borrowing was 11.82% compared to 11.49% previously. The company maintains a Capital Adequacy Ratio of 20.28% with Tier I CRAR at 19.54%. Gross NPA stands at 1.28% and Net NPA at 0.67%. The company operates 159 branches across five states with an employee base of 1,520. External credit rating was upgraded to 'A-' with positive outlook by Acuite. The company has undrawn sanctions of ₹125 crores from various lenders.",
            "Sentiment": "positive",
            "PublishDate": 1755187240973,
            "Source": "earnings"
        },
        {
            "Title": "Laxmi India Finance Reports Q1 FY26 Results with 47% Profit Growth",
            "Summary": "Laxmi India Finance Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported a net profit of Rs. 977.50 lakhs compared to Rs. 662.69 lakhs in the same quarter last year. Total income increased to Rs. 7,008.07 lakhs from Rs. 5,125.49 lakhs year-on-year. Interest income rose to Rs. 6,709.78 lakhs from Rs. 4,794.33 lakhs. The company acquired retail business from another company for Rs. 5,169.35 lakhs during the quarter, resulting in a bargain purchase gain of Rs. 75.06 lakhs. The company completed its IPO of 16,092,195 equity shares and got listed on BSE and NSE on August 5, 2025. Key financial ratios include debt-equity ratio of 4.13, net profit margin of 13.77%, and CRAR of 20.28%. The company operates in the lending segment and is categorized under Middle Layer by RBI's scale-based regulation framework.",
            "Sentiment": "positive",
            "PublishDate": 1755103790389,
            "Source": "earnings"
        }
    ]
}