{
    "Symbol": "LAXMIDENTL",
    "ISIN": "INE0WO601020",
    "News": [
        {
            "Title": "Laxmi Dental clarifies volume surge to exchanges",
            "Summary": "Laxmi Dental Limited responds to NSE inquiry about trading volume increase, stating no unpublished price sensitive information exists and movement is market-driven.",
            "Sentiment": "neutral",
            "PublishDate": 1768921505828,
            "Source": "stocks"
        },
        {
            "Title": "Laxmi Dental Lock-in Ends: 7.1M Shares Eligible",
            "Summary": "Laxmi Dental's one-year shareholder lock-in period ends today, making 7.1 million shares worth ₹167 crores eligible for trading. Stock down 60% from 52-week high of ₹584.",
            "Sentiment": "negative",
            "PublishDate": 1768864665841,
            "Source": "stocks"
        },
        {
            "Title": "Laxmi Dental Appoints Suman Saha as Company Secretary",
            "Summary": "Laxmi Dental Limited has appointed Mr. Suman Saha as Company Secretary and Compliance Officer effective January 16, 2026, following board approval based on nomination committee recommendation.",
            "Sentiment": "positive",
            "PublishDate": 1768574155238,
            "Source": "stocks"
        },
        {
            "Title": "Laxmi Dental's Auditor Firm Converts to LLP Structure",
            "Summary": "Laxmi Dental Limited announces that its statutory auditor M S K A & Associates has converted from a partnership firm to Limited Liability Partnership effective January 13, 2026, with no change in audit engagement.",
            "Sentiment": "neutral",
            "PublishDate": 1768557563360,
            "Source": "stocks"
        },
        {
            "Title": "Laxmi Dental grants ₹50L loan to subsidiary",
            "Summary": "Laxmi Dental Limited enters loan agreement with subsidiary Signature Smiles Dental Clinic for ₹50 lakhs at 10.50% interest rate with 5-year tenor for general corporate purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1767002533737,
            "Source": "co_actions_results"
        },
        {
            "Title": "Laxmi Dental Reports Strong Q2FY26 Performance with 26.5% Revenue Growth",
            "Summary": "Laxmi Dental Limited achieved its strongest quarterly sales for the second consecutive time with revenue of Rs. 72 crores, representing 26.5% year-on-year growth, while maintaining healthy EBITDA margin of 15.3% and PAT margin of 11.8%. The company's dental lab business grew 29.9% excluding scanners, with domestic lab business up 23.2% to Rs. 22.5 crores and international lab business surging 39.2% to Rs. 18.5 crores, despite facing US tariff pressures that impacted margins by 90 basis points.",
            "Sentiment": "positive",
            "PublishDate": 1763475772686,
            "Source": "earnings"
        },
        {
            "Title": "Laxmi Dental Projects 20-25% Revenue Growth and 13-15% PAT Margins for FY26",
            "Summary": "Laxmi Dental expects revenue growth of 20-25% with PAT margins of 13-15% for FY26. The company reported PAT margins of 12.2% for H1 FY26 and anticipates H2 to perform better than H1. Management expressed confidence in maintaining strong growth and meeting full-year revenue guidance while preserving healthy margins, though subject to global uncertainties. The company has set a long-term EBITDA margin target of at least 20%.",
            "Sentiment": "positive",
            "PublishDate": 1763005500175,
            "Source": "stock"
        },
        {
            "Title": "Laxmi Dental Limited Files Corrigendum for Q2 FY2026 Financial Results",
            "Summary": "Laxmi Dental Limited filed a corrigendum for its unaudited standalone and consolidated financial results for the second quarter and half year ended September 30, 2025. The company inadvertently attached the standalone cash flow statement instead of the consolidated cash flow statement in its earlier submission. The corrigendum only corrects the cash flow statement attachment, with no changes to revenue, expenses, profit, or earnings per share figures. The consolidated results show revenue from operations of Rs. 728.05 million for Q2 and Rs. 1,394.07 million for H1, with profit after tax of Rs. 85.32 million and Rs. 168.62 million respectively. The standalone results reported revenue of Rs. 542.57 million for Q2 and Rs. 1,074.29 million for H1, with profit after tax of Rs. 65.70 million and Rs. 144.29 million respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1762925706332,
            "Source": "earnings"
        },
        {
            "Title": "Laxmi Dental Limited Reports No Material Deviation in IPO Proceeds Utilization for Quarter Ended September 2025",
            "Summary": "Laxmi Dental Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing utilization of IPO proceeds without material deviation from stated objectives. The company raised Rs. 138 crore through its IPO in January 2025, with proceeds allocated for debt repayment (Rs. 22.984 crore), subsidiary investments for debt repayment (Rs. 4.600 crore), capital expenditure for new machinery (Rs. 43.507 crore), subsidiary investment for machinery purchase (Rs. 25.004 crore), and general corporate purposes (Rs. 32.075 crore). As of September 30, 2025, the company utilized Rs. 73.814 crore, with Rs. 64.186 crore remaining unutilized. The unutilized funds are primarily invested in fixed deposits with ICICI Bank earning returns between 2.75% to 7.30%. ICRA Limited, the monitoring agency, confirmed no material deviation from the objects of the issue. The company completed debt repayment objectives on schedule, while capital expenditure and subsidiary investments are partially completed with expected deployment in the current fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1762914476933,
            "Source": "corporate_action"
        },
        {
            "Title": "Laxmi Dental Reports 26.5% Revenue Growth in Q2FY26 with Strong Scanner Sales Performance",
            "Summary": "Laxmi Dental achieved its strongest quarterly revenue of INR 723 million in Q2FY26, marking a 26.5% year-over-year growth and 10.2% quarter-over-quarter increase. Scanner sales surged 94.7% year-over-year, with units sold in the first half of FY26 already exceeding the entire FY25 volume. The company maintained EBITDA margin at 15.3% and PAT margin at 10.5% despite global uncertainties. The dental lab business grew 29.9% year-over-year driven by domestic and international market traction. Aligner solutions segment recorded 12.3% year-over-year growth, primarily driven by Taglus which grew 29.9%. Kids-E-Dental showed recovery with 21.4% quarter-over-quarter growth. The company continues to invest in automation, R&D, and brand building while focusing on digital dentistry and AI innovation.",
            "Sentiment": "positive",
            "PublishDate": 1762881073536,
            "Source": "earnings"
        },
        {
            "Title": "Laxmi Dental Reports Strong Q2 Performance with 44% Jump in Net Profit",
            "Summary": "Laxmi Dental delivered robust quarterly results with consolidated net profit rising to 85 million rupees from 59 million rupees year-over-year, marking a 44% increase. Revenue grew significantly to 710 million rupees compared to 566 million rupees in the same period last year, representing a 25% growth. EBITDA improved to 111 million rupees from 88 million rupees year-over-year, while EBITDA margin expanded slightly to 15.63% from 15.55%.",
            "Sentiment": "positive",
            "PublishDate": 1762874087230,
            "Source": "earnings"
        },
        {
            "Title": "Laxmi Dental Limited Schedules Q2 FY26 and H1 FY26 Earnings Conference Call",
            "Summary": "Laxmi Dental Limited has announced an earnings conference call scheduled for November 12, 2025, at 12:30 PM IST to discuss the company's unaudited financial results for the quarter and half-year ended September 30, 2025. The conference call will be hosted by Nuvama Wealth Management and will feature key management personnel including Chairperson and Whole-Time Director Rajesh Khakhar, Managing Director and CEO Sameer Merchant, and CFO Dharmesh Dattani. The company has provided dial-in details for participants from multiple countries including India, USA, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1762538623036,
            "Source": "earnings"
        },
        {
            "Title": "Laxmi Dental Limited Company Secretary Takes Maternity Leave, CFO Appointed as Designated Officer",
            "Summary": "Laxmi Dental Limited announced that Mrs. Nupur Joshi, Company Secretary & Compliance Officer, began maternity leave on October 18, 2025. The Board of Directors authorized Mr. Dharmesh Dattani, CFO, as the Designated Officer to handle corporate announcements and compliance matters during her absence. The decision was made through a circular resolution on October 17, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760976876864,
            "Source": "corporate_governance"
        },
        {
            "Title": "Laxmi Dental Limited Completes 49% Equity and 9% Preference Share Acquisition in IDBG AI Dent Global",
            "Summary": "Laxmi Dental Limited has completed its acquisition of stakes in IDBG AI Dent Global Private Limited. The company received 11,175 equity shares at ₹10 face value with a premium of ₹1,217.5 per share for ₹1.37 crore, securing a 49% equity stake. Additionally, it acquired 5,123 compulsorily convertible preference shares at the same pricing for ₹62.88 lakh, representing a 9% preference share stake. The transaction, originally announced in July 2025, is now complete following the receipt of share certificates from IDBG AI Dent Global Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1758286510227,
            "Source": "order&deals"
        },
        {
            "Title": "Laxmi Dental Reports Record Quarterly Revenue of Rs 65.6 Crores, Up 10% YoY",
            "Summary": "Laxmi Dental Limited achieved its highest ever quarterly revenue of Rs 65.6 crores in Q1 FY26, representing a 10% year-over-year increase from Rs 59.7 crores. The company reported EBITDA of Rs 11.9 crores with an 18.2% margin and PAT of Rs 8.3 crores with a 12.7% margin. The dental laboratory segment contributed 59% of revenue with 8% growth, while aligner solutions accounted for 28% of revenue with 18% growth. Scanner sales grew 26% year-over-year, with units sold increasing from 80+ in Q1 FY25 to over 200 units. The company has fully repaid its debt using IPO proceeds and made a strategic investment in AI-focused dental startup IDBG AI Dent Global. Management expects 20-25% revenue growth for FY26 and plans to deploy 1,000 scanners during the current financial year. The company faces challenges from 25% US tariffs on exports and pricing pressure in the B2B2C aligner business.",
            "Sentiment": "positive",
            "PublishDate": 1755599241642,
            "Source": "earnings"
        },
        {
            "Title": "Laxmi Dental Limited Makes Q1FY26 Earnings Call Audio Recording Available on Company Website",
            "Summary": "Laxmi Dental Limited has made the audio recording of their Q1FY26 Earnings Conference Call available on their company website. The call was held on August 13, 2025, at 12:00 Noon (IST) and was organized by Motilal Oswal Financial Services Limited. The company informed BSE Limited and National Stock Exchange of India Limited about the availability of the recording through a formal communication. The audio recording can be accessed through a direct link provided on the company's website. This disclosure was made in compliance with applicable listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1755088536188,
            "Source": "earnings"
        },
        {
            "Title": "Laxmi Dental Plans Global Expansion with Focus on Clear Aligners and Digital Dentistry",
            "Summary": "Laxmi Dental announced plans for worldwide expansion and enhancement of its premium product line. The company is focusing on clear aligners, digital dentistry, and exports as key growth areas. The company expects its strong order book, increased capacity, and OEM partnerships to drive revenue and margin growth for FY26-28.",
            "Sentiment": "positive",
            "PublishDate": 1755016978946,
            "Source": "stock"
        },
        {
            "Title": "Laxmi Dental Limited Approves Q1 FY25-26 Financial Results and Re-appoints Internal Auditor",
            "Summary": "Laxmi Dental Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025, during a meeting held on August 12, 2025. The company reported consolidated sales of Rs. 643.21 million and profit after tax of Rs. 83.30 million for the quarter. On a standalone basis, sales reached Rs. 496.24 million with profit after tax of Rs. 78.59 million. The Board also re-appointed M/s. S.H.B.A & Co. LLP as Internal Auditor for FY 2025-26. The firm has over 40 years of experience providing professional services. Basic earnings per share stood at Rs. 1.53 for consolidated results and Rs. 1.43 for standalone results. The company operates through three business segments: Laboratory business (Rs. 445.94 million revenue), Aligners business (Rs. 187.26 million revenue), and Other business (Rs. 26.17 million revenue).",
            "Sentiment": "positive",
            "PublishDate": 1755008367556,
            "Source": "earnings"
        },
        {
            "Title": "Laxmi Dental Limited Schedules Q1FY26 Earnings Conference Call for August 13, 2025",
            "Summary": "Laxmi Dental Limited has scheduled an earnings conference call for analysts and institutional investors on August 13, 2025, at 12:00 Noon IST. The call will discuss the company's unaudited financial results for the quarter ended June 30, 2025. The conference call is organized by Motilal Oswal Financial Services Limited and will feature key participants including Chairperson and Whole-Time Director Rajesh Khakhar, Managing Director and CEO Sameer Merchant, and CFO Dharmesh Dattani. The company has provided multiple access numbers for participants and requested pre-registration for the call.",
            "Sentiment": "neutral",
            "PublishDate": 1754569070756,
            "Source": "earnings"
        },
        {
            "Title": "Laxmi Dental Acquires 58% Stake in AI Dent Global for Rs 2.05 Crore",
            "Summary": "Laxmi Dental Limited has approved the acquisition of a 58% stake in IDBG AI Dent Global Private Limited for a total investment of up to Rs 2.05 crore. The acquisition involves purchasing 11,175 equity shares for Rs 1.37 crore and subscribing to 5,123 compulsorily convertible preference shares for Rs 62.88 lakh. Post-transaction, Laxmi Dental will hold 49% of equity share capital and 9% of CCPS. AI Dent is a startup recognized by DPIIT, engaged in artificial intelligence dental solutions including AI-powered dental image and X-ray analysis software. The company was incorporated on December 12, 2024, and has no turnover history. The transaction is expected to complete by September 30, 2025, and aims to enhance innovation and market expansion in dental healthcare. The board also reconstituted its Nomination and Remuneration Committee with three independent directors.",
            "Sentiment": "positive",
            "PublishDate": 1753714936377,
            "Source": "order&deals"
        },
        {
            "Title": "Laxmi Dental's Shareholder Lock-in Period Ends, Making 37% of Shares Eligible for Trading",
            "Summary": "Laxmi Dental's six-month shareholder lock-in period concluded, making 2.06 crore shares (37% of outstanding equity) eligible for trading. The company's shareholding structure shows promoters holding 41.7% stake, with mutual funds at 11.89% led by HSBC MF, HDFC MF and Invesco MF. Foreign institutions Abu Dhabi Investment Authority and Goldman Sachs hold 3.18% and 3.5% respectively, while retail shareholders own 4.5%. Motilal Oswal initiated coverage with a 'buy' recommendation, projecting 26% upside with a bull case target of ₹750 per share (75% upside). Following this report, shares rose 12% and traded above the IPO price of ₹428. The stock closed at ₹484, still 17% below its post-listing high of ₹584.",
            "Sentiment": "positive",
            "PublishDate": 1753059353273,
            "Source": "stock"
        },
        {
            "Title": "Laxmi Dental Reports Q4 Financial Results",
            "Summary": "Laxmi Dental has released its Q4 financial results. The company's consolidated net profit decreased to 43 million rupees from 75 million rupees year-over-year. Revenue increased to 604 million rupees from 546 million rupees in the same period last year. EBITDA decreased to 96 million rupees from 117 million rupees, with the EBITDA margin falling to 15.84% from 21.3% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748314640000,
            "Source": "result"
        },
        {
            "Title": "Laxmi Dental to Invest ₹40.91 Crores in Subsidiary",
            "Summary": "Laxmi Dental has announced plans to invest ₹40.91 crores in its wholly-owned subsidiary, Bizdent Devices. This significant investment demonstrates the company's commitment to expanding its operations and potentially strengthening its market position in the dental industry.",
            "Sentiment": "positive",
            "PublishDate": 1745853962000,
            "Source": "default"
        },
        {
            "Title": "Laxmi Dental to Acquire Additional Shares in US Subsidiary",
            "Summary": "Laxmi Dental has announced plans to acquire additional shares in its foreign material subsidiary, Laxmi Dental Lab USA Inc., for up to USD 1,000,000. This move indicates an expansion of the company's investment in its US operations.",
            "Sentiment": "positive",
            "PublishDate": 1744848320000,
            "Source": "default"
        },
        {
            "Title": "Laxmi Dental to Acquire Additional Shares in US Subsidiary",
            "Summary": "Laxmi Dental has announced plans to acquire additional shares in its foreign material subsidiary, Laxmi Dental Lab USA Inc. The company intends to invest up to USD 1,000,000 for this acquisition, which will increase its stake in the US-based subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1744819723000,
            "Source": "default"
        },
        {
            "Title": "Laxmi Dental Reports Significant Q3 EBITDA Growth",
            "Summary": "Laxmi Dental has announced its Q3 financial results, showing substantial year-over-year improvement. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased from 40 million rupees to 96 million rupees. Additionally, the EBITDA margin expanded from 8.4% to 15.9%, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739499075000,
            "Source": "earnings"
        },
        {
            "Title": "Laxmi Dental Reports Q3 Revenue Growth",
            "Summary": "Laxmi Dental has announced its Q3 revenue figures, showing significant year-over-year growth. The company reported revenue of 605 million rupees, compared to 473 million rupees in the same quarter of the previous year. This represents a substantial increase in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1739498935000,
            "Source": "earnings"
        },
        {
            "Title": "Laxmi Dental Reports Doubled Q3 Consolidated Net Profit",
            "Summary": "Laxmi Dental has announced its Q3 consolidated net profit, which stands at 48 million rupees. This represents a significant increase from 24 million rupees in the same period last year, indicating a 100% year-over-year growth in profits.",
            "Sentiment": "positive",
            "PublishDate": 1739498879000,
            "Source": "earnings"
        },
        {
            "Title": "Laxmi Dental: Shares Fall Below IPO Price for First Time",
            "Summary": "Laxmi Dental's stock dropped 5.5% to ₹441.15 on NSE, falling below its IPO price of ₹428 for the first time since its listing on January 20, 2025. The stock has been declining for six consecutive sessions, down 12% in this period. Currently trading at ₹435.15, the company's market valuation stands at ₹2386 crore.",
            "Sentiment": "negative",
            "PublishDate": 1739347198000,
            "Source": "normal_news"
        },
        {
            "Title": "Goldman Sachs Funds Acquire 13.9 Lakh Shares of Laxmi Dental in Bulk Deal",
            "Summary": "Goldman Sachs Funds have acquired 13.9 lakh shares of Laxmi Dental through a bulk deal transaction. The shares were purchased at a price of ₹545.66 per share.",
            "Sentiment": "positive",
            "PublishDate": 1737430954000,
            "Source": "block_deals"
        },
        {
            "Title": "Laxmi Dental: Shares List at 27% Premium on Market Debut",
            "Summary": "Laxmi Dental shares listed at ₹528 on BSE and ₹542 on NSE, representing a 23% and 26.64% premium respectively over the IPO price of ₹428. The ₹698-crore IPO was oversubscribed 114 times. Analysts recommend profit booking for short-term investors and holding for long-term investors due to growth potential in the dental solutions space.",
            "Sentiment": "positive",
            "PublishDate": 1737347179000,
            "Source": "normal_news"
        },
        {
            "Title": "Laxmi Dental Ltd: Shares List at 23% Premium on NSE and BSE",
            "Summary": "Laxmi Dental Ltd shares debuted on NSE at Rs 529 and BSE at Rs 528, marking a 23.6% and 23.4% premium respectively over the IPO price of Rs 428. The Rs 698.1-crore IPO was oversubscribed 114.42 times. The company plans to use the funds for debt repayment, machinery purchase, and subsidiary investments.",
            "Sentiment": "positive",
            "PublishDate": 1737346838000,
            "Source": "corporate_action"
        }
    ]
}