{
    "Symbol": "LCCINFOTEC",
    "ISIN": "INE938A01021",
    "News": [
        {
            "Title": "LCC Infotech EGM Passes All 8 Resolutions",
            "Summary": "LCC Infotech Limited shareholders approve all resolutions at EGM held on February 02, 2026, including object clause alteration, registered office shift from West Bengal to Gujarat, and preferential issue of shares.",
            "Sentiment": "positive",
            "PublishDate": 1770127843497,
            "Source": "co_actions_results"
        },
        {
            "Title": "LCC Infotech Board Meet on Feb 13 for Q3FY26 Results",
            "Summary": "LCC Infotech Limited has scheduled its Board meeting for February 13, 2026, to consider Q3FY26 unaudited financial results. Trading window closed until February 15, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769778018883,
            "Source": "co_actions_results"
        },
        {
            "Title": "LCC Infotech Open Offer by Kunjit Patel at ₹3.55/share",
            "Summary": "Kunjit Maheshbhai Patel announces mandatory open offer to acquire 26% stake in LCC Infotech Limited at ₹3.55 per share, following share purchase agreement with promoters for control acquisition.",
            "Sentiment": "neutral",
            "PublishDate": 1767959686751,
            "Source": "co_actions_results"
        },
        {
            "Title": "LCC Infotech Board Approves Major Corporate Changes",
            "Summary": "LCC Infotech board approves authorized capital increase to ₹80 crores, share purchase agreement with Kunjit Patel, preferential allotment of 4.2 crore shares, and EGM scheduled for February 02, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767439318381,
            "Source": "co_actions_results"
        },
        {
            "Title": "LCC Infotech Reports Quarterly Loss of Rs 45.76 Lakhs",
            "Summary": "LCC Infotech Limited announced unaudited financial results for the quarter and half year ended September 30, 2025, showing a net loss of Rs 45.76 lakhs for the quarter compared to Rs 14.54 lakhs loss in the previous quarter. The company's total income decreased to Rs 0.10 lakhs from Rs 2.93 lakhs in the previous quarter, while total expenditure rose to Rs 45.86 lakhs, affecting shareholders with negative earnings per share of Rs 0.0048.",
            "Sentiment": "negative",
            "PublishDate": 1763041280617,
            "Source": "earnings"
        },
        {
            "Title": "LCC Infotech Reports Net Loss of Rs 14.54 Lakhs in Q1 Results",
            "Summary": "LCC Infotech Limited reported a net loss of Rs 14.54 lakhs for the quarter ended June 30, 2025, compared to a net loss of Rs 27.38 lakhs in the same quarter last year. Revenue from operations declined significantly to Rs 2.93 lakhs from Rs 33.22 lakhs in the previous quarter and Rs 0.64 lakhs in the corresponding quarter last year. Total income for the quarter was Rs 2.93 lakhs versus Rs 43.64 lakhs in the previous quarter. The company's total expenditure was Rs 17.47 lakhs, with employee benefits expense of Rs 2.40 lakhs and other expenses of Rs 10.80 lakhs. Earnings per share improved to negative Rs 0.0115 from negative Rs 0.0216 in the same quarter last year. The company operates in one business segment and maintains a paid-up equity share capital of Rs 2,531.87 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1755172613303,
            "Source": "earnings"
        },
        {
            "Title": "LCC Infotech's Statutory Auditors Budhia & Co Resign Due to Other Work Commitments",
            "Summary": "LCC Infotech Limited announced that its statutory auditors, M/s Budhia & Co, Chartered Accountants, have resigned effective July 24, 2025. The auditors cited their inability to continue due to pre-occupation with other assignments and inability to devote sufficient time to the company's affairs. Budhia & Co was appointed on June 28, 2024, and their term was originally scheduled to expire on September 29, 2029. The auditors submitted their most recent audit report for 2024-25 on May 26, 2025, and will complete the limited review assignment for the first quarter ending June 2025. The auditing firm confirmed there are no other material reasons for their resignation beyond those stated.",
            "Sentiment": "neutral",
            "PublishDate": 1753344602751,
            "Source": "corporate_governance"
        },
        {
            "Title": "LCC Infotech: Sebi Fines Company and Officials for Financial Misrepresentation",
            "Summary": "Sebi imposed fines totaling Rs 12 lakh on LCC Infotech and six individuals, including promoters, for misrepresenting financial statements and failing to disclose related party transactions. The company did not make proper provisions for loans, debtors, and investments in FY 2021-22, and omitted disclosures in annual reports from FY 2019-20 to FY 2021-22.",
            "Sentiment": "negative",
            "PublishDate": 1731420388000,
            "Source": "normal_news"
        }
    ]
}