{
    "Symbol": "LEMONTREE",
    "ISIN": "INE970X01018",
    "News": [
        {
            "Title": "Lemon Tree Hotels Q3 FY26 Earnings Call Feb 10",
            "Summary": "Lemon Tree Hotels announces earnings conference call for February 10, 2026 at 4:00 PM IST to discuss Q3 & 9M FY26 results with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1770297745854,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lemon Tree Hotels Signs 28-Year Heritage Hotel Deal",
            "Summary": "Lemon Tree Hotels' subsidiary Fleur Hotels Limited signed a 28-year license deed for a heritage hotel in Varanasi, featuring 47 rooms under the Aurika brand.",
            "Sentiment": "positive",
            "PublishDate": 1769778245757,
            "Source": "stocks"
        },
        {
            "Title": "Lemon Tree Hotels Appoints Vivek Jhawar as SVP",
            "Summary": "Lemon Tree Hotels Limited has appointed Mr. Vivek Jhawar as Senior Vice President – Business Development and Senior Management Personnel effective January 23, 2026. Jhawar brings over 17 years of retail and business development experience.",
            "Sentiment": "positive",
            "PublishDate": 1769184355959,
            "Source": "stocks"
        },
        {
            "Title": "Lemon Tree Hotels Signs New Premier Property in MP",
            "Summary": "Lemon Tree Hotels announces signing of Lemon Tree Premier, Omkareshwar, featuring 85 rooms and comprehensive amenities in the sacred pilgrimage town of Madhya Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1769006483374,
            "Source": "stocks"
        },
        {
            "Title": "Lemon Tree Hotels Gets Buy Call with 38% Upside Target",
            "Summary": "ICICI Direct issues 'Buy' recommendation for Lemon Tree Hotels with ₹185 target price, citing restructuring benefits and strong sector fundamentals. Stock shows 38% upside potential from current levels.",
            "Sentiment": "positive",
            "PublishDate": 1768963782082,
            "Source": "stocks"
        },
        {
            "Title": "Lemon Tree Hotels Signs New Property in Chitrakoot",
            "Summary": "Lemon Tree Hotels Limited announced signing of Keys Select by Lemon Tree Hotels in Chitrakoot, Uttar Pradesh, featuring 48 rooms and comprehensive facilities for religious and leisure travelers.",
            "Sentiment": "positive",
            "PublishDate": 1768916527252,
            "Source": "stocks"
        },
        {
            "Title": "Lemon Tree Hotels Signs New Property in Uttarakhand",
            "Summary": "Lemon Tree Hotels announces signing of Keys Select by Lemon Tree Hotels, Khurpatal, Uttarakhand featuring 120 rooms and premium amenities including spa, swimming pool, and fitness centre.",
            "Sentiment": "positive",
            "PublishDate": 1768826755708,
            "Source": "stocks"
        },
        {
            "Title": "Lemon Tree Hotels Signs New Property in Uttarakhand",
            "Summary": "Lemon Tree Hotels announces the signing of a new property in Uttarakhand, marking another step in the company's expansion strategy across India's hospitality sector.",
            "Sentiment": "positive",
            "PublishDate": 1768826635809,
            "Source": "stocks"
        },
        {
            "Title": "Lemon Tree Hotels Announces Major Restructuring Deal",
            "Summary": "Lemon Tree Hotels splits into asset-light and asset-heavy platforms with Warburg Pincus acquiring 41% stake and committing ₹960 crore. Target price revised to ₹157 from ₹210.",
            "Sentiment": "neutral",
            "PublishDate": 1768569313949,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lemon Tree Hotels Holds Investor Call on Scheme",
            "Summary": "Lemon Tree Hotels conducted a conference call on January 15, 2026, to discuss its Composite Scheme of Arrangement with analysts and institutional investors.",
            "Sentiment": "neutral",
            "PublishDate": 1768490862135,
            "Source": "stocks"
        },
        {
            "Title": "Lemon Tree Hotels CIN Changed After Office Relocation",
            "Summary": "Lemon Tree Hotels announces CIN change from L74899DL1992PLC049022 to L74899HR1992PLC140546 following registered office relocation from Delhi to Haryana, effective January 14, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768403832267,
            "Source": "stocks"
        },
        {
            "Title": "Lemon Tree Hotels to Go Debt-Free via Warburg Deal",
            "Summary": "Lemon Tree Hotels announces major restructuring with Warburg Pincus investing ₹960 crore in subsidiary Fleur Hotels, which will list separately in 12-15 months, making parent company debt-free.",
            "Sentiment": "positive",
            "PublishDate": 1768302046154,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lemon Tree Hotels restructures for asset-light model",
            "Summary": "Lemon Tree Hotels restructures operations with Warburg Pincus investing ₹960 crore in Fleur Hotels. Asset-light management business targets premium valuations while owned properties transfer to Fleur.",
            "Sentiment": "neutral",
            "PublishDate": 1768290236688,
            "Source": "stocks"
        },
        {
            "Title": "Lemon Tree Hotels Schedules Investor Call Jan 15",
            "Summary": "Lemon Tree Hotels Limited has announced a conference call with investors and analysts on January 15, 2026, at 4:00 PM IST to discuss the Composite Scheme of Arrangement under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768224111093,
            "Source": "stocks"
        },
        {
            "Title": "Lemon Tree Hotels jumps 4% on restructuring plan",
            "Summary": "Lemon Tree Hotels shares surge 4.14% after announcing major restructuring including Fleur demerger and ₹960 crore Warburg Pincus investment. Brokerages issue buy calls with targets up to ₹187.",
            "Sentiment": "positive",
            "PublishDate": 1768214449448,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lemon Tree Hotels shares surge 4% on restructuring news",
            "Summary": "Lemon Tree Hotels shares jumped over 4% to ₹155.99 following board approval of business restructuring plan with Fleur Hotels expected to list within 12-15 months.",
            "Sentiment": "positive",
            "PublishDate": 1768197079241,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lemon Tree Hotels surges on Warburg restructuring",
            "Summary": "Lemon Tree Hotels shares rose 2% following announcement of major restructuring plan with Warburg Pincus acquiring 41.09% stake in Fleur Hotels for ₹960 crore, creating separate management and ownership platforms.",
            "Sentiment": "positive",
            "PublishDate": 1768194227335,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lemon Tree Hotels rallies 4% on Warburg Pincus deal",
            "Summary": "Lemon Tree Hotels shares surge 4% following strategic reorganisation and ₹960 crore investment from Warburg Pincus. Nuvama maintains Buy rating with ₹178 target price, seeing 19% upside potential.",
            "Sentiment": "positive",
            "PublishDate": 1768193476640,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lemon Tree Shares Rally On Warburg Pincus Deal",
            "Summary": "Lemon Tree Hotels shares rose 4% after announcing Warburg Pincus will acquire stake in hotel arm Fleur Hotels with ₹960 crore investment. Company to split into asset-light management and asset-heavy ownership entities.",
            "Sentiment": "positive",
            "PublishDate": 1768192456510,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lemon Tree Hotels Surges 4% on Warburg Deal",
            "Summary": "Lemon Tree Hotels shares jumped 4% after announcing restructuring plan with Warburg Pincus investment in new entity Fleur Hotels, creating asset-light management platform.",
            "Sentiment": "positive",
            "PublishDate": 1768190735388,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nuvama Issues Buy Call on Lemon Tree Hotels at ₹178",
            "Summary": "Nuvama Securities has issued a buy recommendation for Lemon Tree Hotels with a target price of ₹178, indicating positive outlook for the hospitality stock.",
            "Sentiment": "positive",
            "PublishDate": 1768189459103,
            "Source": "stocks"
        },
        {
            "Title": "Investec Maintains Buy Rating on Lemon Tree Hotels",
            "Summary": "Investec maintains its 'Buy' recommendation on Lemon Tree Hotels with a price target of ₹187.00, reflecting continued confidence in the hospitality company's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1768189285602,
            "Source": "stocks"
        },
        {
            "Title": "Lemon Tree Hotels restructures with Warburg Pincus",
            "Summary": "Lemon Tree Hotels announces major restructuring creating two entities - asset-light management platform and Fleur Hotels for ownership assets. Warburg Pincus invests ₹960 crore in Fleur.",
            "Sentiment": "positive",
            "PublishDate": 1768184350310,
            "Source": "co_actions_results"
        },
        {
            "Title": "Warburg Pincus invests ₹960 cr in Lemon Tree's Fleur",
            "Summary": "Warburg Pincus acquires 41.09% stake from APG in Fleur Hotels and commits ₹960 crore primary investment. Lemon Tree plans corporate restructuring to create asset-light model.",
            "Sentiment": "positive",
            "PublishDate": 1768052435043,
            "Source": "co_actions_results"
        },
        {
            "Title": "Warburg Pincus invests ₹960 cr in Lemon Tree Hotels",
            "Summary": "Warburg Pincus acquires 41.09% stake in Fleur Hotels subsidiary for ₹960 crore investment. Strategic reorganisation will create separate listed entity for hotel assets while Lemon Tree becomes asset-light platform.",
            "Sentiment": "positive",
            "PublishDate": 1768042442782,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lemon Tree Hotels announces major restructuring plan",
            "Summary": "Lemon Tree Hotels Limited announces composite scheme of arrangement involving merger and demerger of group companies, approved by board of directors on January 9, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768033904207,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lemon Tree Hotels Announces Major Reorganisation",
            "Summary": "Lemon Tree Hotels unveils group restructuring with Warburg Pincus acquiring stake in Fleur Hotels. Asset-light management business to be separated from hotel ownership arm, with Fleur to list separately within 12-15 months.",
            "Sentiment": "positive",
            "PublishDate": 1768025299669,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lemon Tree Hotels reorganises; Warburg invests ₹960 cr",
            "Summary": "Lemon Tree Hotels approves strategic reorganisation with Warburg Pincus investing ₹960 crore in subsidiary Fleur Hotels. Post-transaction, Fleur will list separately within 12-15 months.",
            "Sentiment": "positive",
            "PublishDate": 1768016730477,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lemon Tree Hotels Announces Major Corporate Restructuring",
            "Summary": "Lemon Tree Hotels Board approves composite scheme creating two platforms - asset-light Lemon Tree and asset-heavy Fleur Hotels, with Warburg Pincus investing up to ₹960 crores in strategic partnership.",
            "Sentiment": "positive",
            "PublishDate": 1767993389501,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lemon Tree Hotels Board Approves Major Restructuring",
            "Summary": "Lemon Tree Hotels' board approved a comprehensive scheme involving amalgamation of six subsidiaries, demerger of hotel assets to Fleur Hotels, and strategic agreements with Coastal Cedar Investments worth ₹960 crores.",
            "Sentiment": "positive",
            "PublishDate": 1767985038653,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lemon Tree Hotels Announces Strategic Reorganization",
            "Summary": "Lemon Tree Hotels announces major restructuring with Warburg Pincus investing up to ₹960 crore in Fleur Hotels, creating two focused platforms for enhanced growth and shareholder value.",
            "Sentiment": "positive",
            "PublishDate": 1767984202459,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lemon Tree Hotels Board Approves Major Restructuring",
            "Summary": "Lemon Tree Hotels' board approved a comprehensive scheme involving amalgamation of six subsidiaries, demerger of hotel assets to Fleur Hotels, and potential ₹960 crore investment from Coastal Cedar.",
            "Sentiment": "positive",
            "PublishDate": 1767984166514,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lemon Tree Hotels denies Warburg Pincus stake reports",
            "Summary": "Lemon Tree Hotels clarifies no negotiations with Warburg Pincus for stake acquisition are underway, despite media reports triggering 5% stock surge. Company announces new Tirupati hotel operation agreement.",
            "Sentiment": "neutral",
            "PublishDate": 1767844434566,
            "Source": "stocks"
        },
        {
            "Title": "Lemon Tree Hotels denies Warburg Pincus acquisition reports",
            "Summary": "Lemon Tree Hotels categorically denies media reports about Warburg Pincus acquisition, stating no negotiations or agreements are ongoing and calling the reports factually incorrect and misleading.",
            "Sentiment": "neutral",
            "PublishDate": 1767779518232,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lemon Tree Hotels Receives Regulatory Orders",
            "Summary": "Lemon Tree Hotels disclosed receiving orders from tax and municipal authorities totaling ₹16,736 for GST and waste management violations, with no material financial impact expected.",
            "Sentiment": "negative",
            "PublishDate": 1767194678587,
            "Source": "stocks"
        },
        {
            "Title": "Lemon Tree Hotels Expands in Andhra Pradesh",
            "Summary": "Lemon Tree Hotels strengthens its presence in Andhra Pradesh with the addition of a 228-key Lemon Tree Suites property in Tirupati under a management model arrangement.",
            "Sentiment": "positive",
            "PublishDate": 1767058880311,
            "Source": "stocks"
        },
        {
            "Title": "Lemon Tree Hotels Signs New 80-Room Property in Nepal",
            "Summary": "Lemon Tree Hotels signed agreement for 80-room property in Bandipur, Nepal, featuring restaurant, bar, banquet facilities, swimming pool, spa and fitness center, managed by subsidiary Carnation Hotels.",
            "Sentiment": "positive",
            "PublishDate": 1765808200457,
            "Source": "stocks"
        },
        {
            "Title": "Lemon Tree Hotels Expands with 11th Haryana Property",
            "Summary": "Lemon Tree Hotels opens Lemon Tree Suites in Gurugram, marking its 11th location in Haryana, while securing a new property in Punjab to strengthen its regional presence.",
            "Sentiment": "positive",
            "PublishDate": 1765561735693,
            "Source": "stocks"
        },
        {
            "Title": "Lemon Tree Hotels Opens 11th Haryana Property",
            "Summary": "Lemon Tree Hotels launches Lemon Tree Suites, Gurugram with 246 rooms in two phases. First phase opens with 151 rooms, restaurants, and recreational facilities in the NCR region.",
            "Sentiment": "positive",
            "PublishDate": 1765557367909,
            "Source": "stocks"
        },
        {
            "Title": "Lemon Tree Hotels Signs New Franchise in Punjab",
            "Summary": "Lemon Tree Hotels Limited announces signing of Keys Lite by Lemon Tree Hotels in Kartarpur, Punjab, featuring 47 rooms, restaurant, banquet hall and fitness center facilities.",
            "Sentiment": "positive",
            "PublishDate": 1765557039785,
            "Source": "stocks"
        },
        {
            "Title": "Lemon Tree Hotels Signs Two New Properties",
            "Summary": "Lemon Tree Hotels announces agreements for LemonTree Resort Bapatla (90 rooms) in Andhra Pradesh and LemonTree Hotel Bhilai (72 rooms) in Chhattisgarh, expanding hospitality presence.",
            "Sentiment": "positive",
            "PublishDate": 1765381782634,
            "Source": "stocks"
        },
        {
            "Title": "Lemon Tree Hotels Acquires New Property at Pacific Mall in Jaipur",
            "Summary": "Lemon Tree Hotels has announced the acquisition of a new property located at Pacific Mall in Jaipur, Rajasthan. This expansion move adds to the company's hospitality portfolio in the key tourist destination of Rajasthan.",
            "Sentiment": "positive",
            "PublishDate": 1764817743594,
            "Source": "stock"
        },
        {
            "Title": "Lemon Tree Hotels Subsidiary Receives Revised Tax Demand of Rs 42.92 Lakh",
            "Summary": "Berggruen Hotels Private Limited, a material subsidiary of Lemon Tree Hotels, received a revised tax demand of Rs 42.92 lakh from Commercial Tax Officer Bangalore under CGST/KGST Act for period 2018-19. The company considers the demand not maintainable and is evaluating options including filing an appeal against the order.",
            "Sentiment": "negative",
            "PublishDate": 1764516084904,
            "Source": "stock"
        },
        {
            "Title": "Lemon Tree Hotels Signs Two New Properties in Gujarat and Uttarakhand",
            "Summary": "Lemon Tree Hotels has signed agreements for two new properties, expanding its presence in Gujarat and Uttarakhand states. The expansion demonstrates the company's continued growth strategy in India's hospitality sector.",
            "Sentiment": "positive",
            "PublishDate": 1764295819278,
            "Source": "stock"
        },
        {
            "Title": "Lemon Tree Hotels Expands Portfolio with New Keys Select Property in Bhopal",
            "Summary": "Lemon Tree Hotels has signed a new property in Bhopal under the Keys Select brand, which will be managed by Carnation Hotels. This expansion adds to the company's hospitality portfolio in the central Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1763802488366,
            "Source": "stock"
        },
        {
            "Title": "Lemon Tree Hotels Reports Highest Q2 Revenue at Rs 308 Crore Despite Industry Headwinds",
            "Summary": "Lemon Tree Hotels achieved its highest Q2 revenue of Rs 308 crore with 8% growth, though EBITDA margins declined 306 bps to 43% due to renovation investments, technology upgrades, and ex-gratia payments. The company completed major renovations across 3,000 rooms and signed 15 new management contracts while reducing debt by Rs 212 crore and improving credit rating from A to A+.",
            "Sentiment": "neutral",
            "PublishDate": 1763572110466,
            "Source": "earnings"
        },
        {
            "Title": "Lemon Tree Hotels Signs New Property Deal in Uttar Pradesh",
            "Summary": "Lemon Tree Hotels has entered into a new property agreement in Uttar Pradesh, expanding its presence in the state. The deal represents the company's continued growth strategy in key Indian markets.",
            "Sentiment": "positive",
            "PublishDate": 1763205136922,
            "Source": "stock"
        },
        {
            "Title": "Lemon Tree Hotels Extends Trading Window Closure Due to Ongoing Corporate Reorganization Evaluation",
            "Summary": "Lemon Tree Hotels has extended the closure of its trading window for designated persons and their immediate relatives. The trading window was initially closed until 48 hours after the declaration of unaudited financial results for the quarter and half-year ending September 30, 2025, or until 48 hours after disclosure of board decisions on a potential corporate reorganization initiative. The company stated that the committee has not made any recommendations and the board has not taken any decisions regarding the potential corporate reorganization initiative. The trading window will remain closed until 48 hours after public disclosure of the committee's recommendations or board's decision on the reorganization initiative. All designated persons and their immediate relatives are prohibited from trading in the company's shares during this closure period.",
            "Sentiment": "neutral",
            "PublishDate": 1763004533312,
            "Source": "corporate_action"
        },
        {
            "Title": "Lemon Tree Hotels Reports Mixed Q2 Results with Higher Profit but Lower Margins",
            "Summary": "Lemon Tree Hotels reported quarterly consolidated net profit of 346 million rupees, up from 296 million rupees year-over-year. Revenue increased to 3.1 billion rupees from 2.84 billion rupees in the same period last year. However, EBITDA remained relatively flat at 1.31 billion rupees compared to 1.3 billion rupees year-over-year. The company's EBITDA margin declined to 42.68% from 45.9% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762965446120,
            "Source": "earnings"
        },
        {
            "Title": "Lemon Tree Hotels Announces New Premier Hotel in Thiruvananthapuram",
            "Summary": "Lemon Tree Hotels has announced the launch of a new Lemon Tree Premier Hotel in Thiruvananthapuram. The hotel will feature 80 rooms.",
            "Sentiment": "positive",
            "PublishDate": 1762523365017,
            "Source": "stock"
        }
    ]
}