{
    "Symbol": "LENSKART",
    "ISIN": "INE956O01016",
    "News": [
        {
            "Title": "Lenskart Board Approves Employee Stock Option Plans",
            "Summary": "Lenskart Solutions Limited's board approved ratification and amendment of ESOP plans covering 26,040,528 and 7,280,431 options respectively, and authorized loan-to-equity conversion in overseas subsidiaries.",
            "Sentiment": "positive",
            "PublishDate": 1770809727368,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lenskart Q3FY26 Revenue Jumps 38% to ₹23,077 Crores",
            "Summary": "Lenskart Solutions reported strong Q3FY26 results with consolidated revenue of ₹23,077.31 million, up 38% YoY. Net profit surged to ₹1,327.11 million from ₹18.52 million in Q3FY25, driven by robust performance across India and international markets.",
            "Sentiment": "positive",
            "PublishDate": 1770805847724,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lenskart Board Meet Set for Feb 11 for Q3FY26 Results",
            "Summary": "Lenskart Solutions Limited has scheduled its Board of Directors meeting for February 11, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770109973001,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lenskart shares drop 2% amid profit booking pressure",
            "Summary": "Lenskart Solutions shares declined 2.7% to ₹439 on profit booking despite Antique Stockbroking initiating coverage with 'hold' rating. Stock under pressure for two sessions, falling 4% during period.",
            "Sentiment": "negative",
            "PublishDate": 1768838870497,
            "Source": "stocks"
        },
        {
            "Title": "Emkay Initiates Lenskart Coverage with Buy Rating",
            "Summary": "Emkay Global initiates coverage on Lenskart with Buy rating and ₹525 target price, citing strong eyewear market growth, technology advantages, and potential 6x revenue growth over next decade.",
            "Sentiment": "positive",
            "PublishDate": 1768281395537,
            "Source": "stocks"
        },
        {
            "Title": "Lenskart deploys AI eye-testing across 500+ stores",
            "Summary": "Lenskart addresses optometrist shortage by implementing AI-enabled remote eye-testing technology across 500+ stores, conducting 9.3 million tests in H1 FY26 with 47% YoY growth.",
            "Sentiment": "positive",
            "PublishDate": 1768262569220,
            "Source": "stocks"
        },
        {
            "Title": "Lenskart Incorporates UK Subsidiary for Meller Brand",
            "Summary": "Lenskart Solutions Limited announces incorporation of Stellio Ventures UK Ltd as step-down subsidiary effective January 5, 2026, for marketing Meller brand eyewear products in the United Kingdom.",
            "Sentiment": "positive",
            "PublishDate": 1767693789319,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lenskart Can Grow 6x in Decade Despite High Valuations",
            "Summary": "Emkay Global maintains Buy rating on Lenskart with ₹525 target, projecting 6x revenue growth over next decade despite optically high valuations at 56x Dec-27E EBITDA multiple.",
            "Sentiment": "positive",
            "PublishDate": 1767064189987,
            "Source": "stocks"
        },
        {
            "Title": "Lenskart Solutions Receives Buy Rating with ₹525 Target",
            "Summary": "Analysts initiate coverage on Lenskart Solutions with Buy rating and target price of ₹525, citing strong market position in India's ₹9 billion eyewear industry and technology-driven growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1767008185478,
            "Source": "stocks"
        },
        {
            "Title": "Lenskart Unit Sets Up UK Subsidiary for Meller Brand",
            "Summary": "Lenskart's subsidiary Stellio Ventures has approved the establishment of a new UK step-down subsidiary to support the growth of the Meller brand in international markets.",
            "Sentiment": "positive",
            "PublishDate": 1766757893778,
            "Source": "stocks"
        },
        {
            "Title": "Lenskart Forms UK Subsidiary for Meller Brand Expansion",
            "Summary": "Lenskart Solutions Limited announces incorporation of step-down subsidiary Stellio Ventures UK LTD to establish retail stores in the United Kingdom for eyewear products under the Meller brand.",
            "Sentiment": "positive",
            "PublishDate": 1766755545750,
            "Source": "co_actions_results"
        },
        {
            "Title": "Avendus Initiates Lenskart Coverage With ₹490 Target",
            "Summary": "Avendus Spark initiates coverage on Lenskart with 'Add' rating and ₹490 target price, implying 10% upside. Stock up 12% from IPO price but down 10% from post-listing high.",
            "Sentiment": "neutral",
            "PublishDate": 1766718236336,
            "Source": "stocks"
        },
        {
            "Title": "Lenskart shares surge 4% on Korea acquisition update",
            "Summary": "Lenskart Solutions shares jumped 3.98% to ₹471.35 following disclosure of ₹18.60 crore investment in Korean optical startup iiNeer Corp. Trading volume reached 1.35 million shares worth ₹63.55 crore.",
            "Sentiment": "positive",
            "PublishDate": 1766597667218,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lenskart Acquires 50% Stake in Thai Eyewear Firm",
            "Summary": "Lenskart Solutions' Singapore subsidiary acquired 50% stake in Marco Optical (Thailand) for $5 million, forming a joint venture in the Thai eyewear manufacturing market.",
            "Sentiment": "positive",
            "PublishDate": 1766424278402,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lenskart Clarifies No Material Info Behind Volume Move",
            "Summary": "Lenskart Solutions confirms compliance with SEBI regulations and states no undisclosed material information exists that could explain recent volume movement in its shares.",
            "Sentiment": "neutral",
            "PublishDate": 1766391740416,
            "Source": "stocks"
        },
        {
            "Title": "Macquarie Initiates 'Outperform' on Lenskart at ₹530",
            "Summary": "Macquarie has initiated coverage on Lenskart Solutions with an 'Outperform' rating and set a price target of ₹530 per share for the eyewear retailer.",
            "Sentiment": "positive",
            "PublishDate": 1766115313488,
            "Source": "stocks"
        },
        {
            "Title": "Morgan Stanley Initiates Lenskart Coverage at ₹445",
            "Summary": "Morgan Stanley initiates coverage on Lenskart Solutions with equal-weight rating and price target of ₹445, marking the brokerage's entry into coverage of the eyewear retailer.",
            "Sentiment": "neutral",
            "PublishDate": 1765770139888,
            "Source": "stocks"
        },
        {
            "Title": "Lenskart Reports Strong Q2 FY26 Results with 24% Revenue Growth and 50% PAT Jump",
            "Summary": "Lenskart Solutions Limited delivered robust quarterly results with revenue of INR 21,486 million (up 24% YoY) and PAT of INR 1,130 million (up 50% YoY), driven by volume growth of 24% in eyewear units sold. The company expanded its retail footprint by adding 203 new stores in India during H1 FY26 and achieved 15% same-store growth, while maintaining strong margins with EBITDA at 19.8% compared to 18.3% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1764833191141,
            "Source": "earnings"
        },
        {
            "Title": "Lenskart Reports Strong Q2 Growth with 19% Revenue Jump and Improved Margins",
            "Summary": "Lenskart delivered robust quarterly performance with consolidated net profit rising to 1.02 billion rupees from 855 million rupees year-over-year, while revenue grew to 20.96 billion rupees from 17.36 billion rupees. The eyewear company's EBITDA increased significantly to 4.14 billion rupees from 2.87 billion rupees, with margins expanding to 19.8% from 16.5%, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1764547060822,
            "Source": "earnings"
        },
        {
            "Title": "Lenskart Solutions Announces Board Changes and Leadership Transition",
            "Summary": "Lenskart Solutions re-designated Mr. Anant Gupta from Nominee Director to Non-Executive Director following the termination of shareholder agreements post-listing on November 10, 2025. The company appointed Mr. Ashish Kumar Srivastava as new Company Secretary and Chief Compliance Officer, replacing Ms. Preeti Gupta who will take on different responsibilities within the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1764420758150,
            "Source": "corporate_governance"
        },
        {
            "Title": "Lenskart Reports Strong Q2 FY26 Results with 24% Revenue Growth and 50% PAT Surge",
            "Summary": "Lenskart delivered revenue of ₹21,466 Mn in Q2 FY26, up 23.9% YoY, with PAT jumping 49.6% to ₹1,130 Mn and EBITDA margin expanding to 19.8%. The eyewear retailer added 143 net new stores during the quarter, conducted 5.6 Mn eye tests (44% growth), and sold 8.3 Mn eyewear units while targeting 450+ store additions for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1764416729574,
            "Source": "earnings"
        },
        {
            "Title": "Lenskart Solutions Debuts Below Issue Price at ₹395",
            "Summary": "Lenskart Solutions commenced trading at ₹395 per share, which is ₹7 below its issue price of ₹402 per share.",
            "Sentiment": "negative",
            "PublishDate": 1762749077624,
            "Source": "stock"
        },
        {
            "Title": "Lenskart Stock Market Debut Set for Monday as Grey Market Premium Drops 94%",
            "Summary": "Lenskart Solutions will debut on the stock market on Monday following its Rs 7,278 crore IPO. The grey market premium has fallen 94% from Rs 108 to Rs 6.5 per share, indicating a modest 1.6% premium over the issue price of Rs 402. The IPO received overwhelming response with 28.3 times overall subscription, led by Qualified Institutional Buyers at 45 times subscription. The company is valued at 10.1x FY25 EV/Sales and 68.7x EV/EBITDA at the upper price band. Lenskart operates over 2,700 stores globally including 2,000 in India, with revenue growing 32% CAGR over two years to Rs 6,653 crore in FY25. The company turned profitable in FY25 with PAT of Rs 297 crore compared to a loss of Rs 64 crore two years earlier. EBITDA margins improved from 7% in FY23 to 14.7% in FY25. Analysts expect muted listing gains due to stretched valuations but remain optimistic about long-term prospects given the company's omnichannel model and position in India's eyewear market.",
            "Sentiment": "neutral",
            "PublishDate": 1762671640534,
            "Source": "stock"
        }
    ]
}