{
    "Symbol": "LFIC",
    "ISIN": "INE850E01012",
    "News": [
        {
            "Title": "LIC Gains Momentum on Strong Results and Low Ownership, Says Market Expert",
            "Summary": "LIC stock surged approximately 4% to trade around the 920 level, driven by robust quarterly numbers and positive management outlook. Anshul Saigal from Saigal Capital attributes the momentum to a combination of strong commentary, good results, and limited ownership over the past two to three years, creating room for new investors. The insurance sector overall has delivered strong numbers with positive guidance. Market conditions are becoming narrow as investors seek defensive stocks with limited downside and earnings growth certainty. Companies posting strong first quarter earnings without clear sustainability guidance are being penalized with 5-6% declines. In the travel and tourism sector, Saigal notes extremely strong performance after years of consolidation, with hotel rates only recently returning to 2008 levels after 15 years. However, he remains cautious on cinema stocks like PVR-Inox despite recent gains, citing structural challenges from OTT platforms and situational dependence on movie quality.",
            "Sentiment": "neutral",
            "PublishDate": 1754638748545,
            "Source": "stock"
        },
        {
            "Title": "Government Completes Appointment of Merchant Bankers and Legal Advisors for PSU Stake Sales",
            "Summary": "The government has completed the appointment of merchant bankers and legal advisors to manage minority stake sales in LIC and other public sector financial institutions. Department of Investment and Public Asset Management Secretary Arunish Chawla announced that the RFP process for LIC has been completed, with the appointed firms empanelled for three years with a possible one-year extension. The move addresses compliance with SEBI's minimum 25% public shareholding norm, with a deadline of August 1, 2026 for non-compliant entities. The government holds a 96.5% stake in LIC and needs to sell another 6.5% by May 16, 2027 to meet the 10% public shareholding requirement. Five PSU banks also remain non-compliant, with government stakes ranging from 86.5% to 98.3%. Other entities requiring compliance include IRFC (86.36% government stake), The New India Assurance (85.44%), and General Insurance Corp (82.40%). The government previously raised Rs 21,000 crore from LIC's IPO in May 2022.",
            "Sentiment": "neutral",
            "PublishDate": 1754065586588,
            "Source": "corporate_action"
        }
    ]
}