{
    "Symbol": "LGBBROSLTD",
    "ISIN": "INE337A01034",
    "News": [
        {
            "Title": "LG Balakrishnan Q3FY26 Results: Revenue Up 17.8%",
            "Summary": "LG Balakrishnan & Bros reported strong Q3FY26 performance with standalone revenue rising 17.8% to ₹73,413.57 lakhs and net profit growing 15.6% to ₹8,451.94 lakhs compared to Q3FY25.",
            "Sentiment": "positive",
            "PublishDate": 1770467880532,
            "Source": "co_actions_results"
        },
        {
            "Title": "Morgan Stanley Maintains Overweight on LG Balakrishnan",
            "Summary": "Morgan Stanley maintains Overweight rating on LG Balakrishnan & Bros with target price of ₹1,864, showing confidence in the auto ancillary company's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1765424505672,
            "Source": "stocks"
        },
        {
            "Title": "LG Balakrishnan & Bros Signs MoU with Tamil Nadu Government for Infrastructure Support",
            "Summary": "LG Balakrishnan & Bros has entered into a memorandum of understanding with the Government of Tamil Nadu. The MoU provides guidance for infrastructural and regulatory facilitation support for the company.",
            "Sentiment": "positive",
            "PublishDate": 1764202295517,
            "Source": "stock"
        },
        {
            "Title": "L.G. Balakrishnan Bros Appoints Suresh Sivalingam as Vice President for Strategic Business Development",
            "Summary": "L.G. Balakrishnan Bros Limited appointed Mr. Suresh Sivalingam as Vice President (Strategic Business Development - Metal Forming Division) effective from November 20, 2025, following board approval based on the Nomination and Remuneration Committee's recommendation. The appointment brings over 23 years of procurement and supply chain management experience from global organizations including Daimler, Toyota, Mahindra Renault and Caterpillar to strengthen the company's strategic business development capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1763058135863,
            "Source": "corporate_governance"
        },
        {
            "Title": "L.G. Balakrishnan & Bros Reports Strong Q2 Performance with Revenue Growth and Profit Increase",
            "Summary": "L.G. Balakrishnan & Bros Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. The company reported standalone revenue from operations of Rs. 71,442.44 lakhs for the quarter, compared to Rs. 59,246.04 lakhs in the previous quarter. Net profit for the quarter reached Rs. 8,399.13 lakhs versus Rs. 6,679.88 lakhs in the prior quarter. For the half-year period, revenue stood at Rs. 1,30,688.48 lakhs with net profit of Rs. 15,079.01 lakhs. The company operates in two main segments - Transmission and Metal Forming, with Transmission contributing Rs. 59,598.96 lakhs and Metal Forming Rs. 11,843.48 lakhs to quarterly revenue. Basic earnings per share for the quarter was Rs. 26.34 compared to Rs. 20.95 in the previous quarter. The Board meeting was held on October 31, 2025, where the audited financial results were reviewed by the Audit Committee and approved by the Board of Directors. The statutory auditors expressed an unmodified opinion on the financial results.",
            "Sentiment": "positive",
            "PublishDate": 1761920475475,
            "Source": "earnings"
        },
        {
            "Title": "L.G. Balakrishnan & Bros Reports Strong Q2 Growth with Revenue Up 19.7% and Net Profit Rising 20.8%",
            "Summary": "L.G. Balakrishnan & Bros delivered robust Q2 performance with consolidated net profit increasing to 936 million rupees from 775 million rupees year-over-year. Revenue grew to 7.9 billion rupees compared to 6.6 billion rupees in the same period last year. EBITDA rose to 1.37 billion rupees from 1.1 billion rupees, while EBITDA margin improved to 17.35% from 16.64% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761914118225,
            "Source": "earnings"
        },
        {
            "Title": "LG Balakrishnan Shares Surge Due to Investor Confusion with LG Electronics India IPO",
            "Summary": "Shares of LG Balakrishnan and Bros, a Coimbatore-based auto component maker, experienced unusual trading activity as investors mistakenly bought its stock while attempting to purchase shares of newly-listed LG Electronics India. The stock surged to ₹1,600, nearly 15% above its previous closing price of ₹1,390, before giving up gains to close 1.6% lower at ₹1,367.60. Trading volumes reached 684,105 shares compared to the typical two-week daily average of 31,400 shares. Brokers indicated that investors rushing to buy LG Electronics shares erroneously placed orders for LG Balakrishnan, which has a market value of ₹4,372 crore. Similar mistaken identity incidents have occurred with Tata Motors and its DVR shares, and globally with Zoom Technologies being confused for Zoom Video Communications during the pandemic.",
            "Sentiment": "neutral",
            "PublishDate": 1760487557274,
            "Source": "stock"
        },
        {
            "Title": "LG Balakrishnan Reports Cyberattack on IT Systems, Revenue Rises in Latest Quarter",
            "Summary": "LG Balakrishnan & Bros Ltd reported that select IT systems were hit by a malware attack but stated that immediate action was taken to contain the impact and secure systems. The company posted revenue of ₹486 crore for the quarter ended June 2025, up from ₹436 crore in the year-ago period, while EBITDA declined from ₹74 crore to ₹71 crore. CMD B Vijayakumar indicated that US market expansion for industrial chains may slow but won't hamper overall performance, with the company targeting 10-15% growth for FY26 and exploring operations in Vietnam or Cambodia. Shares closed at ₹1375.55, up ₹2.70 from the opening price.",
            "Sentiment": "neutral",
            "PublishDate": 1759238338056,
            "Source": "stock"
        },
        {
            "Title": "LG Balakrishnan & Bros Reports Malware Attack on IT Systems",
            "Summary": "LG Balakrishnan & Bros experienced a malware attack on its IT systems. The company has alerted relevant authorities about the cybersecurity incident and is monitoring the situation.",
            "Sentiment": "negative",
            "PublishDate": 1759233980049,
            "Source": "stock"
        },
        {
            "Title": "L.G.Balakrishnan & Bros Limited Publishes Audited Financial Results for Quarter Ended June 30, 2024",
            "Summary": "L.G.Balakrishnan & Bros Limited published its audited financial results for the quarter ended June 30, 2024 in Maalai Malar newspaper on August 1, 2024 and Financial Express on August 2, 2025. The publication was made in compliance with SEBI regulations under Regulation 47(3) of the Securities and Exchange Board of India Listing Obligations and Disclosure Requirements Regulations, 2015. The company's script codes are 500250 on BSE and LGBBROSLTD on NSE. The announcement was signed by M Lakshmi Kanthi Joshi, General Manager (Legal) & Company Secretary.",
            "Sentiment": "neutral",
            "PublishDate": 1754110941781,
            "Source": "earnings"
        },
        {
            "Title": "LGB Bros Reports Strong Q1 Results, Plans Mexico Manufacturing Facility",
            "Summary": "L.G.Balakrishnan & Bros Limited approved audited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs. 592.46 crores compared to Rs. 537.99 crores in the same quarter last year. Net profit after tax stood at Rs. 66.80 crores versus Rs. 67.27 crores in the previous year quarter. The Board approved setting up a new manufacturing facility in Mexico for transmission products and accessories for automotive and industrial applications, with an initial investment of $10 million to be funded through internal accruals. The project aims to acquire new customers and increase business volume with existing clients. Additionally, the Board authorized management to explore manufacturing plants in Vietnam or Thailand to serve Southeast Asian markets. The company operates in two segments - Transmission and Metal Forming, with consolidated revenue reaching Rs. 657.05 crores for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753965564565,
            "Source": "earnings"
        },
        {
            "Title": "L.G.Balakrishnan & Bros Reports 2.8% Growth in Q1 Net Profit to 670M Rupees",
            "Summary": "L.G.Balakrishnan & Bros posted a consolidated net profit of 670 million rupees in Q1, up from 652 million rupees in the same period last year. The company's revenue grew to 6.57 billion rupees compared to 5.7 billion rupees year-over-year. EBITDA increased to 971 million rupees from 892 million rupees, though the EBITDA margin declined to 14.78% from 15.61% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753965070111,
            "Source": "earnings"
        },
        {
            "Title": "LG Balakrishnan & Bros Approves $10M Investment for New Mexico Manufacturing Plant",
            "Summary": "LG Balakrishnan & Bros has approved a $10 million investment to establish a new manufacturing plant in Mexico. The company has given its approval for this expansion into the Mexican market through the new facility.",
            "Sentiment": "positive",
            "PublishDate": 1753964606344,
            "Source": "stock"
        },
        {
            "Title": "L.G. Balakrishnan & Bros Reports Strong Q4 Results and Dividend",
            "Summary": "L.G. Balakrishnan & Bros announced its Q4 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit increased to 840 million rupees, up from 678.6 million rupees year-over-year and 753 million rupees quarter-over-quarter. Revenue also saw growth, reaching 6.7 billion rupees compared to 6.1 billion rupees in the same quarter last year. Additionally, the company recommended a dividend of 20 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746144790000,
            "Source": "default"
        },
        {
            "Title": "L.G.Balakrishnan & Bros Reports Q4 Results and Dividend",
            "Summary": "L.G.Balakrishnan & Bros has announced its Q4 results and dividend recommendation. The company's EBITDA for Q4 is 1.02 billion rupees, up from 1 billion rupees year-over-year. However, the EBITDA margin decreased to 15.25% from 16.64% in the same period last year. The company has recommended a dividend of 20 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1746016135000,
            "Source": "result"
        },
        {
            "Title": "L.G. Balakrishnan & Bros Reports Increased Q4 Profit and Revenue",
            "Summary": "L.G. Balakrishnan & Bros announced its Q4 financial results. The company's consolidated net profit rose to 840 million rupees, up from 678.6 million rupees year-over-year and 753 million rupees quarter-over-quarter. Revenue also increased to 6.7 billion rupees from 6.1 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1746016028000,
            "Source": "result"
        },
        {
            "Title": "L.G. Balakrishnan & Bros Reports Q3 EBITDA Growth",
            "Summary": "L.G. Balakrishnan & Bros has reported its Q3 financial results. The company's EBITDA increased to 1.1 billion rupees from 1.07 billion rupees year-over-year. However, the EBITDA margin decreased to 16.47% from 17.74% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738325844000,
            "Source": "earnings"
        },
        {
            "Title": "L.G. Balakrishnan & Bros Reports Q3 Financial Results",
            "Summary": "L.G. Balakrishnan & Bros announced its Q3 consolidated net profit of 753 million rupees, showing a year-over-year increase from 725 million rupees and a quarter-over-quarter decrease from 775 million rupees. The company's Q3 revenue rose to 6.8 billion rupees from 6 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738325761000,
            "Source": "earnings"
        },
        {
            "Title": "L G Balakrishnan & Bros Plans ₹40 Crore Capacity Expansion at Oragadam Factory",
            "Summary": "L G Balakrishnan & Bros has announced plans to invest ₹40 crore in expanding the capacity of its Oragadam factory. This expansion project aims to increase the company's production capabilities, potentially boosting its market presence and operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1732291037000,
            "Source": "corporate_action"
        },
        {
            "Title": "L.G. Balakrishnan & Bros Reports Q2 Financial Results",
            "Summary": "L.G. Balakrishnan & Bros has announced its Q2 financial results. The company's EBITDA increased to 1.1 billion rupees from 1.04 billion rupees year-over-year. However, the EBITDA margin decreased to 16.64% from 17.28% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730115948000,
            "Source": "result"
        },
        {
            "Title": "L.G. Balakrishnan & Bros Reports Q2 Financial Results",
            "Summary": "L.G. Balakrishnan & Bros announced its Q2 consolidated net profit of 775 million rupees, showing a year-over-year increase from 755 million rupees and a quarter-over-quarter increase from 652 million rupees. The company's Q2 revenue rose to 6.6 billion rupees from 6 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730115879000,
            "Source": "result"
        }
    ]
}