{
    "Symbol": "LGEINDIA",
    "ISIN": "INE324D01010",
    "News": [
        {
            "Title": "LG Electronics India Q3FY26 Results Show Revenue Decline",
            "Summary": "LG Electronics India reported Q3FY26 revenue of ₹41.14 billion, down 6.4% YoY, with EBITDA margin at 4.8%. Company maintained market leadership across key categories despite soft demand post-festive season.",
            "Sentiment": "negative",
            "PublishDate": 1770820847218,
            "Source": "co_actions_results"
        },
        {
            "Title": "LG Electronics India schedules Q3FY26 earnings call",
            "Summary": "LG Electronics India Limited has scheduled an earnings conference call for February 12, 2026 at 4:00 PM IST to discuss Q3FY26 financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770193531939,
            "Source": "co_actions_results"
        },
        {
            "Title": "LG Electronics India faces Rs 27.40 crore customs duty demand",
            "Summary": "LG Electronics India receives customs order demanding Rs 27.40 crore differential duty after voluntary payments, plus Rs 15 crore redemption fine for digital signage imports.",
            "Sentiment": "negative",
            "PublishDate": 1769789397428,
            "Source": "stocks"
        },
        {
            "Title": "LG Electronics India Board Meet on Feb 11, 2026",
            "Summary": "LG Electronics India Limited has scheduled a board meeting for February 11, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769682825253,
            "Source": "co_actions_results"
        },
        {
            "Title": "LG Electronics Launches 2026 BEE Star Rated ACs",
            "Summary": "LG Electronics India becomes one of the first companies to introduce 2026 BEE Star rated air conditioners in the Indian market, demonstrating leadership in energy-efficient cooling solutions.",
            "Sentiment": "positive",
            "PublishDate": 1768986420443,
            "Source": "stocks"
        },
        {
            "Title": "LG Electronics India Shares Fall 21% from Listing",
            "Summary": "LG Electronics India trades 21% below listing highs as Morgan Stanley cuts target price to ₹1,623.00 from ₹1,864.00, citing growth moderation and margin pressures across key segments.",
            "Sentiment": "negative",
            "PublishDate": 1768982471265,
            "Source": "stocks"
        },
        {
            "Title": "JM Financial initiates 'Buy' on LG Electronics India",
            "Summary": "JM Financial starts coverage with ₹1,630 target, citing 25% market share across categories and 12.8% industry-leading margins. Company plans ₹5,000 crore third facility in Andhra Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1768884014634,
            "Source": "stocks"
        },
        {
            "Title": "LG Electronics clarifies no customs duty demand",
            "Summary": "LG Electronics India clarifies that no differential duty demand of ₹119.15 crores has been raised against the company, correcting earlier disclosure about customs order.",
            "Sentiment": "neutral",
            "PublishDate": 1768875726131,
            "Source": "stocks"
        },
        {
            "Title": "LG Electronics India Reappoints Director, Names CSO",
            "Summary": "LG Electronics India Limited's board reappointed Dongmyung Seo as Whole-Time Director for four years and appointed Jongha Hwang as Chief Strategy Officer, effective January 16, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768564920029,
            "Source": "stocks"
        },
        {
            "Title": "LG Electronics anchor lock-in ends, 1.5 cr shares free",
            "Summary": "LG Electronics India's three-month IPO anchor lock-in period concludes today, releasing nearly 1.5 crore shares for trading. Stock trades 28% above issue price despite Q2 profit decline.",
            "Sentiment": "neutral",
            "PublishDate": 1767848460837,
            "Source": "co_actions_results"
        },
        {
            "Title": "LG Electronics Hits Lowest Level Since Listing",
            "Summary": "LG Electronics India shares hit lowest level since listing, trading 1.68% lower at ₹1,432 as three-month shareholder lock-in period expires, freeing up 15.2 million shares for trading.",
            "Sentiment": "negative",
            "PublishDate": 1767828060138,
            "Source": "stocks"
        },
        {
            "Title": "LG Electronics India Concludes APA with Tax Authorities",
            "Summary": "LG Electronics India signed Advance Pricing Agreement with CBDT, eliminating ₹487.74 crore contingent liabilities while incurring ₹17.71 crore net tax expense and reporting Q2 profit decline of 27.3%.",
            "Sentiment": "neutral",
            "PublishDate": 1767625522702,
            "Source": "stocks"
        },
        {
            "Title": "LG Electronics India Gets AAA Credit Rating Reaffirmation",
            "Summary": "CRISIL reaffirms LG Electronics India's 'AAA/Stable/A1+' credit rating on ₹618.27 crore bank facilities, citing strong financial profile with nil debt and robust market position across consumer durables.",
            "Sentiment": "positive",
            "PublishDate": 1766816809713,
            "Source": "stocks"
        },
        {
            "Title": "LG Electronics India Gets First Sell Rating",
            "Summary": "Avendus Spark initiates coverage with 'reduce' rating and ₹1,536 price target, warning of market share erosion despite strong manufacturing capabilities and distribution network.",
            "Sentiment": "negative",
            "PublishDate": 1766586928890,
            "Source": "stocks"
        },
        {
            "Title": "AvendusSpark Initiates Coverage on LG Electronics",
            "Summary": "AvendusSpark Securities has initiated coverage on LG Electronics India with a 'Reduce' rating and set a target price of ₹1,536.00 per share for the consumer durables company.",
            "Sentiment": "negative",
            "PublishDate": 1766548068984,
            "Source": "stocks"
        },
        {
            "Title": "LG Electronics India Partners with K-pop Star JOSHUA",
            "Summary": "LG Electronics India announces collaboration with SEVENTEEN's JOSHUA as brand ambassador for Essential Series appliances, targeting Gen Z and millennial consumers through K-pop cultural appeal.",
            "Sentiment": "positive",
            "PublishDate": 1766468563406,
            "Source": "stocks"
        },
        {
            "Title": "LG Electronics India Announces Leadership Changes Following IPO",
            "Summary": "LG Electronics India has announced new leadership changes as part of its growth strategy following its initial public offering. The restructuring aims to strengthen the company's operations and drive business expansion in the Indian market.",
            "Sentiment": "neutral",
            "PublishDate": 1764248755127,
            "Source": "corporate_governance"
        },
        {
            "Title": "LG Electronics India Reports 1% Revenue Growth to ₹61.74 Billion in Q2 FY26 Amid Market Challenges",
            "Summary": "LG Electronics India delivered resilient quarterly results with revenue of ₹61.74 billion (1% YoY growth) and EBITDA margin of 8.9%, despite facing headwinds from cooler summer, early monsoon, currency volatility, and delayed GST rate cuts. The company strengthened market leadership across key categories including washing machines (33.4% share), refrigerators (29.9% share), and air conditioners (17.4% share), while launching new LG Essentials series and progressing construction of its third manufacturing facility in Sri City with planned investment of ₹5,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1763727790924,
            "Source": "global"
        },
        {
            "Title": "LG India Reports 1% Revenue Growth Despite GST Disruption, Achieves Record Market Share Gains",
            "Summary": "LG Electronics India posted 1% revenue growth and 8.9% EBITDA margin despite temporary sales freeze from GST restructuring that disrupted purchases for six weeks. The company achieved historic market share highs across TVs, refrigerators, washing machines, and air conditioners, with executives expecting stronger performance in H2 through localization and price increases.",
            "Sentiment": "negative",
            "PublishDate": 1763124000562,
            "Source": "earnings"
        },
        {
            "Title": "LG Electronics India Reports Strong Q2 Performance with 13.30 EPS for Half-Year",
            "Summary": "LG Electronics India Limited announced unaudited financial results for the quarter and half-year ended September 30, 2025, showing earnings per share of INR 5.74 for the quarter and INR 13.30 for the half-year. The company operates through two main segments - Home appliances and air solution division, and Home entertainment division - with results approved by the Board of Directors on November 13, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1763057405231,
            "Source": "earnings"
        },
        {
            "Title": "LG Electronics India Plans Multi-Year Growth Strategy Through Premiumisation and Localisation",
            "Summary": "LG Electronics India is targeting multi-year growth through premiumisation and component localisation while investing in R&D for smart home, EV charging and AIOT technologies. The company is expanding its Pune and Greater Noida manufacturing capacity to serve export markets and expects stable margins through cost optimisation and domestic sourcing initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1763052398362,
            "Source": "stock"
        },
        {
            "Title": "LG Electronics India Set to Report First Quarterly Results Since IPO Debut",
            "Summary": "LG Electronics India will announce its September quarter results, marking its first earnings report since going public with over 50% listing gains. The company reported strong FY25 performance with 14% revenue growth to Rs 24,631 crore and 46% profit increase to Rs 2,203 crore. Key financial metrics include 12.8% EBITDA margin, 9% PAT margin, 43% ROCE, and 37% ROE, while maintaining debt-free status. Brokerages have issued buy ratings with PL Capital setting a target price of Rs 1,780 and Emkay Global at Rs 2,050. The company holds leading market positions in washing machines, refrigerators, air conditioners, and televisions. Its home appliances segment contributes 75% of revenue with 14% annual growth, while the air conditioner category expanded 22.6%. LG India plans a Rs 5,000 crore manufacturing facility in Andhra Pradesh and expects growth from exports, commercial solutions, and maintenance contracts.",
            "Sentiment": "positive",
            "PublishDate": 1763008288353,
            "Source": "earnings"
        },
        {
            "Title": "LG Electronics India Schedules Earnings Call for Q2 FY26 Results",
            "Summary": "LG Electronics India Limited has announced a conference call with analysts and investors scheduled for November 14, 2025, at 4:00 PM IST to discuss financial results for the quarter and half-year ended September 30, 2025. The company will submit an investor presentation to stock exchanges before the call and make it available on their website. The discussion will be based on publicly available information with no unpublished price-sensitive information to be shared during the meeting. Participants can join via provided dial-in numbers and are advised to connect 5-10 minutes prior to the scheduled time.",
            "Sentiment": "neutral",
            "PublishDate": 1762543202576,
            "Source": "earnings"
        }
    ]
}