{
    "Symbol": "LIBERTSHOE",
    "ISIN": "INE557B01019",
    "News": [
        {
            "Title": "Liberty Shoes promoter sells 10,000 shares",
            "Summary": "Dinesh Kumar Gupta HUF sells 10,000 equity shares of Liberty Shoes through open market, reducing promoter group holding from 58.520% to 58.462% as disclosed under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769500002296,
            "Source": "co_actions_results"
        },
        {
            "Title": "Liberty Shoes Credit Rating Reaffirmed by CARE",
            "Summary": "CARE Ratings reaffirmed Liberty Shoes' credit ratings with CARE A2 for short-term and CARE BBB- with stable outlook for long-term bank facilities, reflecting stable financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1766214169467,
            "Source": "stocks"
        },
        {
            "Title": "Liberty Shoes Reports 5% Decline in Half-Year Profit Despite Revenue Growth",
            "Summary": "Liberty Shoes announced its unaudited financial results for the second quarter and half year ended September 30, 2025. The company reported revenue from operations of Rs 34,702.47 lakh for the half year, up from Rs 32,772.33 lakh in the corresponding period last year. However, net profit for the half year decreased to Rs 530.07 lakh compared to Rs 558.33 lakh in the previous year. For the second quarter alone, the company posted a profit of Rs 197.34 lakh versus Rs 92.12 lakh in the same quarter last year. Basic earnings per share for the half year stood at Rs 3.11 compared to Rs 3.28 in the previous year. The company's total assets increased to Rs 51,065.28 lakh as of September 30, 2025, from Rs 49,663.32 lakh as of March 31, 2025. Employee benefits expense rose to Rs 7,182.98 lakh for the half year from Rs 6,196.50 lakh in the corresponding previous period.",
            "Sentiment": "neutral",
            "PublishDate": 1760691711124,
            "Source": "earnings"
        },
        {
            "Title": "Liberty Shoes Reports 117% Jump in Q2 Net Profit with Steady Revenue Growth",
            "Summary": "Liberty Shoes reported quarterly net profit of 20 million rupees compared to 9.2 million rupees in the same period last year. Revenue increased to 1.74 billion rupees from 1.72 billion rupees year-over-year. EBITDA rose to 151 million rupees from 146 million rupees, while EBITDA margin improved to 8.69% from 8.49% in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1760691255953,
            "Source": "earnings"
        },
        {
            "Title": "Liberty Shoes Shareholders Approve Neeraj Kumar Jindal's Appointment as Independent Director",
            "Summary": "Liberty Shoes Limited successfully completed a postal ballot seeking shareholder approval for the appointment of Neeraj Kumar Jindal (DIN: 00054885) as an Independent Director. The e-voting period ran from July 9 to August 7, 2025, with the cut-off date set as July 4, 2025. Out of 21,426 total shareholders on record, 91 members participated in the voting process. The special resolution was passed with requisite majority, with 8,283,284 votes in favor and 3,853 votes against, representing 99.9535% and 0.0465% respectively of votes polled. The total votes polled were 8,287,137 shares, accounting for 48.6334% of the company's 17,040,000 outstanding shares. JVS & Associates served as the scrutinizer for the postal ballot process, while MUFG Intime India Private Limited provided the remote e-voting facility. The resolution is deemed passed as of August 7, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754574969163,
            "Source": "corporate_action"
        },
        {
            "Title": "Liberty Shoes Reports Q1 Results, Approves Executive Director Pay Increases",
            "Summary": "Liberty Shoes Limited announced its unaudited financial results for the first quarter ended June 30, 2025. The company reported revenue from operations of Rs. 17,279 lakh compared to Rs. 15,592.80 lakh in the corresponding quarter of the previous year. Net profit for the quarter stood at Rs. 332.73 lakh versus Rs. 466.21 lakh in the same period last year. Basic earnings per share was Rs. 1.95 compared to Rs. 2.74 in the previous year's quarter. The Board approved increased remuneration for three Executive Directors - Shammi Bansal, Adish Gupta, and Anupam Bansal - subject to shareholder approval at the upcoming Annual General Meeting. The company also appointed Rajesh Gupta as Internal Auditor for FY 2025-26 and scheduled its 39th AGM for September 24, 2025 via video conferencing.",
            "Sentiment": "neutral",
            "PublishDate": 1754477292478,
            "Source": "earnings"
        },
        {
            "Title": "Liberty Shoes Reports Q4 Financial Results",
            "Summary": "Liberty Shoes has released its Q4 financial results. The company reported an EBITDA of 251.3 million rupees, compared to 253.3 million rupees in the same quarter last year. The EBITDA margin decreased to 13.39% from 14.93% year-over-year. Revenue increased to 1.88 billion rupees from 1.7 billion rupees in the previous year. Net profit for Q4 was 56.1 million rupees, up from 49.8 million rupees year-over-year and 23.7 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748445948000,
            "Source": "result"
        },
        {
            "Title": "Liberty Shoes Reports Significant Profit Growth in Q3",
            "Summary": "Liberty Shoes has announced its financial results for the third quarter. The company's net profit increased substantially to 24 million rupees, compared to 2 million rupees in the same period last year. Revenue also saw growth, rising to 1.6 billion rupees from 1.52 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739405851000,
            "Source": "earnings"
        },
        {
            "Title": "Liberty Shoes Reports Improved Q3 EBITDA and Margin",
            "Summary": "Liberty Shoes has announced its Q3 financial results, showing an improvement in both EBITDA and EBITDA margin. The company's EBITDA increased to 134 million rupees from 107 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 8.37% from 7.01% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739363320000,
            "Source": "earnings"
        },
        {
            "Title": "Liberty Shoes Reports Significant Profit Increase in Q3",
            "Summary": "Liberty Shoes has announced its financial results for the third quarter. The company's net profit has substantially increased to 24 million rupees, up from 2 million rupees in the same period last year. Revenue also saw growth, reaching 1.6 billion rupees compared to 1.52 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739363313000,
            "Source": "earnings"
        },
        {
            "Title": "Liberty Shoes Reports Stable Q2 Revenue",
            "Summary": "Liberty Shoes has announced its second quarter revenue for the current fiscal year. The company reported revenue of 1.7 billion rupees, which is unchanged compared to the same period last year (year-over-year).",
            "Sentiment": "neutral",
            "PublishDate": 1731400959000,
            "Source": "result"
        },
        {
            "Title": "Liberty Shoes Reports Q2 EBITDA Decline",
            "Summary": "Liberty Shoes announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 146 million rupees from 155 million rupees year-over-year. The EBITDA margin also declined to 8.50% from 9.02% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731400915000,
            "Source": "result"
        },
        {
            "Title": "Liberty Shoes Reports Decline in Q2 Net Profit",
            "Summary": "Liberty Shoes has reported a net profit of 9 million rupees for the second quarter, down from 26.4 million rupees in the same period last year. This represents a significant year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1731400851000,
            "Source": "result"
        }
    ]
}