{
    "Symbol": "LICHSGFIN",
    "ISIN": "INE115A01026",
    "News": [
        {
            "Title": "LIC Housing Finance Opens Special Window for Physical Share Transfers",
            "Summary": "LIC Housing Finance Limited has opened a special one-year window from February 05, 2026 to February 04, 2027 for re-lodgement of transfer requests of physical shares sold or purchased prior to April 01, 2019, following SEBI circular guidelines.",
            "Sentiment": "neutral",
            "PublishDate": 1770640923703,
            "Source": "co_actions_results"
        },
        {
            "Title": "LIC Housing Finance Publishes Q3 FY26 Call Transcript",
            "Summary": "LIC Housing Finance has uploaded the conference call transcript for Q3 FY2025-26 results discussion held on February 2, 2026, making it available on the company website for investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1770209124595,
            "Source": "co_actions_results"
        },
        {
            "Title": "LIC Housing Finance Block Trade Worth Rs. 35.81 Crores",
            "Summary": "LIC Housing Finance witnessed a significant NSE block trade involving 720,125 shares valued at Rs. 35.81 crores, executed at Rs. 497.30 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770026505003,
            "Source": "co_actions_results"
        },
        {
            "Title": "LIC Housing Finance Re-appoints Independent Director",
            "Summary": "LIC Housing Finance Limited re-appointed Smt. Jagennath Jayanthi as Independent Director for a second five-year term from February 5, 2026 to February 4, 2031, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1769791111617,
            "Source": "stocks"
        },
        {
            "Title": "LIC Housing Finance Q3FY26 Earnings Call on Feb 2",
            "Summary": "LIC Housing Finance announces earnings call on February 2, 2026 at 11:30 AM IST to discuss Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769579169034,
            "Source": "co_actions_results"
        },
        {
            "Title": "LIC Housing Finance Appoints New Chairman via Postal Ballot",
            "Summary": "LIC Housing Finance shareholders approve appointment of Shri Doraiswamy Ramachandran as Non-Executive Director and Chairman through postal ballot with 85.26% votes in favour.",
            "Sentiment": "positive",
            "PublishDate": 1767944869504,
            "Source": "stocks"
        },
        {
            "Title": "LIC Housing Finance Appoints New Chairman via Postal Ballot",
            "Summary": "LIC Housing Finance shareholders approve appointment of Shri Doraiswamy Ramachandran as Non-Executive Director and Chairman through postal ballot with 85.26% votes in favour.",
            "Sentiment": "positive",
            "PublishDate": 1767944840827,
            "Source": "stocks"
        },
        {
            "Title": "LIC Housing Finance Block Trade Worth ₹16.06 Crores",
            "Summary": "LIC Housing Finance witnessed a significant NSE block trade involving 302,723 shares valued at ₹16.06 crores, executed at ₹530.50 per share on the exchange.",
            "Sentiment": "neutral",
            "PublishDate": 1767853420689,
            "Source": "co_actions_results"
        },
        {
            "Title": "LIC Housing Finance Gets CARE AAA Rating for ₹10,000 Cr",
            "Summary": "LIC Housing Finance Limited receives highest CARE AAA stable rating for Non-Convertible Debentures worth ₹10,000 crores, reflecting strong creditworthiness and financial stability of the housing finance company.",
            "Sentiment": "positive",
            "PublishDate": 1767635658037,
            "Source": "stocks"
        },
        {
            "Title": "LIC Housing Finance Receives GST Demand Notice",
            "Summary": "LIC Housing Finance receives GST demand of ₹43.65 lakh plus penalty of ₹48.40 lakh from Jharkhand authorities for FY 2018-19 to 2022-23. Company states no material impact on operations.",
            "Sentiment": "negative",
            "PublishDate": 1767012500457,
            "Source": "stocks"
        },
        {
            "Title": "LIC Housing Finance Seeks Shareholder Approval for New Chairman Appointment",
            "Summary": "LIC Housing Finance has initiated a postal ballot to appoint Shri Doraiswamy Ramachandran as Non-Executive Director and Chairman, following LIC of India's nomination after the previous Chairman's superannuation. The e-voting process runs from December 10, 2025 to January 8, 2026, with results to be declared by January 9, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1765277672259,
            "Source": "corporate_action"
        },
        {
            "Title": "ICICI Prudential Mutual Fund Crosses 5% Stake in LIC Housing Finance",
            "Summary": "ICICI Prudential Mutual Fund acquired 12,95,540 shares of LIC Housing Finance on December 02, 2025, increasing its holding from 4.98% to 5.22% of the company's paid-up capital. The acquisition was made for investment purposes without seeking controlling interest, triggering mandatory disclosure requirements under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764913282425,
            "Source": "corporate_action"
        },
        {
            "Title": "LIC Housing Finance Q2 Results: Growth Challenges Persist Despite Stable Asset Quality",
            "Summary": "LIC Housing Finance reported quarterly results with total revenue from operations at Rs. 7,163 crores, up 3% year-on-year. Outstanding loan portfolio stood at Rs. 3,11,816 crores, reflecting 6% growth, with individual housing loans comprising 85% of the total portfolio. Net interest income was Rs. 2,038 crores with net interest margins at 2.62%. Profit after tax grew 2% to Rs. 1,353.87 crores. The company faced significant balance transfer outflows of Rs. 4,014 crores during the quarter, double the normal run rate of Rs. 2,000 crores, impacting growth. Stage-3 exposure improved to 2.51% from 3.06% in the previous year, with provision coverage ratio increasing to 53%. Cost of funds declined to 7.42% from 7.73% year-on-year. Management reduced rewriting rates to lending rate plus 50 basis points to combat balance transfer pressures. The company is exploring co-lending arrangements and direct assignment to boost growth, while maintaining focus on margin protection over aggressive expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1762291439296,
            "Source": "earnings"
        },
        {
            "Title": "LIC Housing Finance Targets Double-Digit Loan Growth Despite Q2 Shortfall",
            "Summary": "LIC Housing Finance is targeting double-digit loan book growth for FY26, backed by expected retail disbursement improvements in Q3 and Q4. The company reported 6% AUM growth in Q2, falling short of its internal 8% expectation. MD and CEO Tribhuwan Adhikari attributed the slower growth to weak construction finance performance and balance transfer outflows caused by aggressive bank rate cuts. While banks quickly repriced loans following repo rate reductions, LIC Housing Finance's prime lending rate is not repo-linked, requiring board decisions for adjustments. The company cut lending rates by 25 basis points in April, but this wasn't sufficient to prevent outflows that reduced expected loan growth by 1.5%. Shares closed at Rs 572, down 3.61%.",
            "Sentiment": "neutral",
            "PublishDate": 1761881338314,
            "Source": "stock"
        },
        {
            "Title": "LIC Housing Finance Projects Loan Book Growth to ₹3.5 Lakh Crore by FY27",
            "Summary": "LIC Housing Finance projects its loan book will expand to ₹3.5 lakh crore by FY27, driven by 6% annual growth in individual home loans. The company expects improving asset quality with gross non-performing assets at 2.5% and maintains strong capital adequacy at 23%. Despite net interest margin narrowing to 2.6%, the company anticipates profit and margin stability supported by its robust capital position.",
            "Sentiment": "positive",
            "PublishDate": 1761755494265,
            "Source": "stock"
        },
        {
            "Title": "LIC Housing Finance Reports Higher Q2 Net Profit and Revenue",
            "Summary": "LIC Housing Finance reported a net profit of 13.5 billion rupees for Q2, compared to 13.3 billion rupees in the same period last year. The company's revenue for the quarter was 71.6 billion rupees, up from 69.3 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761748171064,
            "Source": "earnings"
        },
        {
            "Title": "LIC Housing Finance Appoints Doraiswamy Ramachandran as Chairman and Non-Executive Director",
            "Summary": "LIC Housing Finance has appointed Shri Doraiswamy Ramachandran as Additional Non-Executive (Nominee) Director and Chairman effective October 16, 2025. The appointment is subject to Reserve Bank of India approval and shareholder confirmation within three months. Ramachandran serves as CEO & Managing Director of Life Insurance Corporation of India and has over 39 years of experience in operations, marketing, technology and academics. He is a graduate in Mathematics from Madurai Kamaraj University and a Fellow Member of Insurance Institute of India. The Board approved the appointment through circulation with assent from all directors.",
            "Sentiment": "positive",
            "PublishDate": 1760612602918,
            "Source": "corporate_governance"
        },
        {
            "Title": "LIC Housing Finance Reports 4.6% Rise in Quarterly Profit to ₹1,360 Crore",
            "Summary": "LIC Housing Finance reported a profit after tax of ₹1,359.92 crore for the quarter ended June 30, 2025, compared to ₹1,300.21 crore in the same period last year, marking a 4.6% increase. Total revenue from operations grew to ₹7,233.13 crore from ₹6,783.67 crore year-on-year. Interest income, the company's primary revenue source, increased to ₹7,113.06 crore from ₹6,739.13 crore. Finance costs rose to ₹5,047.28 crore from ₹4,750.05 crore. The company's earnings per share stood at ₹24.72 compared to ₹23.64 in the previous year. Gross Non-Performing Assets improved to 2.62% from 3.29% year-on-year, while Net NPAs decreased to 1.30% from 1.68%. The company assigned receivables worth ₹1,112.05 crore under securitization during the quarter. LIC Housing Finance also issued non-convertible debentures worth ₹7,960 crore and commercial paper worth ₹1,500 crore during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754059958822,
            "Source": "earnings"
        },
        {
            "Title": "LIC Housing Finance Deregistered as NPS-Lite Swavalamban Scheme Aggregator",
            "Summary": "LIC Housing Finance is no longer registered as an aggregator under the NPS-Lite Swavalamban Scheme. This change in status affects the company's involvement with this particular pension scheme.",
            "Sentiment": "negative",
            "PublishDate": 1752840162000,
            "Source": "default"
        },
        {
            "Title": "LIC Housing Finance: Q4 Results Show Improved Margins, Nirmal Bang Maintains 'Buy'",
            "Summary": "LIC Housing Finance reported Q4 FY25 net interest margins of 2.86%, up 16bps QoQ. The company guides for double-digit AUM growth in FY26. Nirmal Bang maintains a 'Buy' rating but expects pressure on NIMs due to competition and volatile interest rates.",
            "Sentiment": "positive",
            "PublishDate": 1747629860000,
            "Source": "earnings"
        },
        {
            "Title": "LIC Housing Finance: Q4 Profit Surges 25% YoY on Lower Provisions",
            "Summary": "LIC Housing Finance reported a 25% YoY increase in Q4FY25 net profit to Rs 1,368 crore, driven by a sharp reduction in provisions. Total loan disbursements rose 5% YoY to Rs 19,156 crore, with individual home loans growing to Rs 15,383 crore. The company's outstanding loan book grew 7% to Rs 3,07,732 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747367891000,
            "Source": "earnings"
        },
        {
            "Title": "LIC Housing Finance Reports Q4 Profit and Revenue Growth, Declares Dividend",
            "Summary": "LIC Housing Finance announced its Q4 results, reporting a net profit of 13.7 billion rupees, up from 10.9 billion rupees year-over-year and 14.3 billion rupees quarter-over-quarter. The company's revenue for Q4 stood at 72.8 billion rupees, compared to 69.36 billion rupees in the same quarter last year. Additionally, the company has recommended a dividend of 10 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747354122000,
            "Source": "default"
        },
        {
            "Title": "LIC Housing Finance: Q4 Profit Rises 25%, Meets Estimates",
            "Summary": "LIC Housing Finance reported a 25% increase in Q4 net profit to Rs 1,368 crore, in line with estimates. Total income rose 5% to Rs 7,283 crore. The board recommended a dividend of Rs 10 per share.",
            "Sentiment": "positive",
            "PublishDate": 1747321184000,
            "Source": "earnings"
        },
        {
            "Title": "LIC Housing Finance Recommends Dividend",
            "Summary": "LIC Housing Finance has recommended a dividend of 10 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747318828000,
            "Source": "result"
        },
        {
            "Title": "LIC Housing Finance Reports Q4 Net Profit of 13.7B Rupees",
            "Summary": "LIC Housing Finance has reported its quarterly results. The company's net profit for Q4 is 13.7 billion rupees, compared to 10.9 billion rupees year-over-year and 14.3 billion rupees quarter-over-quarter. The Q4 revenue stands at 72.8 billion rupees, up from 69.36 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747317153000,
            "Source": "result"
        },
        {
            "Title": "LIC Housing Finance: India's First Listed Residential Mortgage-Backed Securities",
            "Summary": "LIC Housing Finance raised 10 billion rupees through 20-year residential mortgage-backed securities at 7.26% coupon, listed on NSE. National Housing Bank expects 100-200 billion rupees to be raised through such instruments this financial year.",
            "Sentiment": "positive",
            "PublishDate": 1746432926000,
            "Source": "corporate_action"
        },
        {
            "Title": "LIC Housing Finance: Home Loan Rates to Drop by 25 Basis Points",
            "Summary": "LIC Housing Finance will reduce its prime lending rate by 25 basis points, effective April 28, 2025. Home loan rates will start from 8%, applying to both new and existing borrowers. This follows the RBI's second repo rate cut, bringing it down to 6%.",
            "Sentiment": "positive",
            "PublishDate": 1745566891000,
            "Source": "corporate_action"
        },
        {
            "Title": "LIC Housing Finance Appoints Lokesh Mundhra as CFO",
            "Summary": "LIC Housing Finance has approved the appointment of Lokesh Mundhra as the company's new Chief Financial Officer (CFO).",
            "Sentiment": "neutral",
            "PublishDate": 1744895953000,
            "Source": "default"
        },
        {
            "Title": "LIC Housing Finance: New CFO Appointed, Effective April 2025",
            "Summary": "LIC Housing Finance Ltd. has appointed Lokesh Mundhra as its new Chief Financial Officer, effective April 17, 2025. Mundhra, a chartered accountant with 32 years of experience at LIC of India, replaces Sudipto Sil, who has been transferred to a marketing role. The appointment was approved by the board based on recommendations from relevant committees.",
            "Sentiment": "neutral",
            "PublishDate": 1744894873000,
            "Source": "corporate_governance"
        },
        {
            "Title": "LIC Housing Finance Approves Borrowing Budget for FY 2025-26",
            "Summary": "LIC Housing Finance has approved a borrowing budget of up to 1.23 trillion rupees for the fiscal year 2025-26. This decision indicates the company's financial planning and strategy for future operations.",
            "Sentiment": "positive",
            "PublishDate": 1741220806000,
            "Source": "corporate_action"
        },
        {
            "Title": "LIC Housing Finance Approves Borrowing Budget for FY 2025-26",
            "Summary": "LIC Housing Finance has approved a borrowing budget of up to 1.23 trillion rupees for the fiscal year 2025-26. This decision indicates the company's financial planning and strategy for future operations.",
            "Sentiment": "positive",
            "PublishDate": 1741179504000,
            "Source": "corporate_action"
        },
        {
            "Title": "LIC Housing Finance: Aims for 2.6% NPA by March Despite Q3 Challenges",
            "Summary": "LIC Housing Finance targets a gross NPA ratio of 2.6% by March 2025, despite Q3 collection tightness. Q3 saw profit rise 23% YoY to Rs 1,431.96 crore, but NII fell 5%. The company expects a strong Q4 but may miss its double-digit AUM growth target, now projecting 8.5% for the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1738669070000,
            "Source": "earnings"
        },
        {
            "Title": "LIC Housing Finance: Jefferies Cuts Target Price, Maintains Buy Rating",
            "Summary": "Jefferies reaffirms 'buy' rating on LIC Housing Finance but reduces target price to Rs 700 from Rs 795. Stock surges 3% to Rs 573.65. Brokerage notes stable margins, provision reversal, and forecasts 4% EPS CAGR and 13-14% ROE for FY25-27. Re-rating depends on growth pickup and improved NIM outlook.",
            "Sentiment": "neutral",
            "PublishDate": 1738645065000,
            "Source": "normal_news"
        },
        {
            "Title": "LIC Housing Finance: Share Price Rises on Bullish Brokerage Outlooks",
            "Summary": "LIC Housing Finance's share price increased by nearly 3% after HSBC and Citi provided favorable assessments. HSBC upgraded to 'hold' with a target price of Rs 600, while Citi maintained a 'buy' rating with a target of Rs 851. Q3 FY25 net profit rose 23.1% YoY to Rs 1,432 crore, despite a 4.8% drop in NII. The company faces market share and pricing challenges but is focusing on affordable housing to improve yields.",
            "Sentiment": "positive",
            "PublishDate": 1738642917000,
            "Source": "normal_news"
        },
        {
            "Title": "LIC Housing Finance: Q3 Profit Surges 23%, Beats Estimates",
            "Summary": "LIC Housing Finance reported a 23.1% year-on-year increase in Q3 FY25 net profit to ₹1,432 crore, surpassing analyst expectations. However, net interest income (NII) fell 4.8% to ₹1,997.1 crore, missing estimates. The company's shares closed 2.4% higher at ₹598.45 on BSE ahead of the results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1738329992000,
            "Source": "earnings"
        },
        {
            "Title": "LIC Housing Finance Reports Q3 Net Profit Increase",
            "Summary": "LIC Housing Finance has announced its financial results for the third quarter. The company reported a net profit of 14 billion rupees, showing an increase from 11.63 billion rupees year-over-year. The quarterly revenue stood at 69.5 billion rupees, up from 67.44 billion rupees in the same period last year. Additionally, the net profit also improved sequentially from 13.3 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738329737000,
            "Source": "earnings"
        },
        {
            "Title": "LIC Housing Finance: Q3FY25 Results to be Declared on January 31, 2025",
            "Summary": "LIC Housing Finance will hold its board meeting on January 31, 2025, to consider and declare Q3FY25 results. The trading window for company securities will be closed from January 1 to February 2, 2025, for designated officials and their relatives.",
            "Sentiment": "neutral",
            "PublishDate": 1737373481000,
            "Source": "corporate_action"
        },
        {
            "Title": "LIC Housing Finance: Q2 Profit Rises 12% on Strong Loan Growth",
            "Summary": "LIC Housing Finance reported a 12% YoY increase in Q2 FY2025 net profit to ₹1,328.89 crore. Total disbursements grew 12% to ₹16,476 crore, with project loans surging 223%. Individual home loan disbursements rose 4%. The loan portfolio expanded 6% to ₹2,94,588 crore. Asset quality improved with Stage 3 exposure decreasing to 3.06% from 4.33% last year.",
            "Sentiment": "positive",
            "PublishDate": 1730119789000,
            "Source": "result"
        },
        {
            "Title": "LIC Housing Finance Reports Q2 Revenue Increase",
            "Summary": "LIC Housing Finance has reported a revenue of 69.3 billion rupees for the second quarter, compared to 67.07 billion rupees in the same period last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730108676000,
            "Source": "result"
        },
        {
            "Title": "LIC Housing Finance Reports 11.95% Increase in Q2 Net Profit",
            "Summary": "LIC Housing Finance has announced its financial results for the second quarter. The company reported a net profit of 13.3 billion rupees, compared to 11.88 billion rupees in the same period last year, representing an 11.95% year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730108652000,
            "Source": "result"
        },
        {
            "Title": "LIC Housing Finance: Stock Declines for Fifth Consecutive Session",
            "Summary": "<p><span class='negative'>LIC Housing Finance Ltd's stock is down 0.19%</span> at Rs 635.4 on NSE, marking its <b>fifth straight session of decline</b>. The stock has <span class='negative'>eased around 10.18% in the last month</span>, despite a <span class='positive'>34.88% jump over the past year</span>.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728029100000,
            "Source": "normal_news"
        }
    ]
}