{
    "Symbol": "LICI",
    "ISIN": "INE0J1Y01017",
    "News": [
        {
            "Title": "LIC Invests Rs 5120 Crores in Bajaj Finance Debentures",
            "Summary": "Life Insurance Corporation of India has subscribed to 512,000 debentures worth Rs 5120 crores in Bajaj Finance Limited, with each debenture having a face value of Rs 100,000.",
            "Sentiment": "positive",
            "PublishDate": 1769517368165,
            "Source": "co_actions_results"
        },
        {
            "Title": "LIC Launches Jeevan Utsav Single Premium Plan January 12",
            "Summary": "LIC launches new Jeevan Utsav Single Premium whole life insurance plan from January 12, offering guaranteed returns and lifelong coverage with one-time payment.",
            "Sentiment": "positive",
            "PublishDate": 1767635193718,
            "Source": "stocks"
        },
        {
            "Title": "LIC Re-designates Neelam Kujur as Principal at Jamshedpur",
            "Summary": "Life Insurance Corporation of India announces re-designation of Smt. Neelam Kujur from Faculty Member to Principal at Zonal Training Centre, Jamshedpur, effective January 05, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767613280089,
            "Source": "stocks"
        },
        {
            "Title": "LIC's 2025: 64% stocks fall, 77 beat Nifty",
            "Summary": "LIC's portfolio shows mixed results in 2025 with 184 stocks declining while 104 gained. Two multibaggers emerged despite overall underperformance, with company shares falling 6%.",
            "Sentiment": "neutral",
            "PublishDate": 1767247078062,
            "Source": "stocks"
        },
        {
            "Title": "LIC Senior Management Personnel to Superannuate Dec 31",
            "Summary": "Life Insurance Corporation announces superannuation of four senior management personnel including Executive Directors and Training Centre heads effective December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767179445695,
            "Source": "stocks"
        },
        {
            "Title": "LIC Receives ₹1.84 Cr GST Demand from Karnataka",
            "Summary": "Life Insurance Corporation of India disclosed receiving a GST demand order of ₹1.84 crores from Karnataka authorities for alleged excess Input Tax Credit claims for FY 2021-22.",
            "Sentiment": "negative",
            "PublishDate": 1766990234624,
            "Source": "stocks"
        },
        {
            "Title": "LIC Receives ₹2,370 Cr GST Demand from Maharashtra",
            "Summary": "Life Insurance Corporation of India faces GST demand of ₹2,370.28 crores from Maharashtra tax authorities for alleged excess input tax credit claims during FY 2021-22 to 2023-24.",
            "Sentiment": "negative",
            "PublishDate": 1765378893518,
            "Source": "stocks"
        },
        {
            "Title": "LIC Receives GST Demand Order of ₹3.02 Crore Plus Interest and Penalty from Haryana Authorities",
            "Summary": "Life Insurance Corporation of India received a GST demand order from Haryana tax authorities for ₹3.02 crore GST amount plus interest and equal penalty amount for FY 2018-19 to FY 2022-23, related to alleged short-reversal of common Input Tax Credit. The company stated there is no material impact on its financial operations or other activities, and the order is appealable before the Commissioner (Appeals), Panchkula.",
            "Sentiment": "neutral",
            "PublishDate": 1765278542713,
            "Source": "stock"
        },
        {
            "Title": "LIC Reports 35% Jump in First-Year Premiums as Government Plans Stake Sale",
            "Summary": "LIC achieved first-year premiums of INR 158.70 billion in November, marking a 35% year-over-year increase, demonstrating strong business growth. The government simultaneously announced plans to sell a 1-2% stake in LIC through an offer for sale, affecting existing shareholders and potential investors.",
            "Sentiment": "positive",
            "PublishDate": 1765180617164,
            "Source": "stock"
        },
        {
            "Title": "LIC Appoints New Government Nominee Director",
            "Summary": "Life Insurance Corporation of India appointed Ms. Shalini Pandit as Government Nominee Director effective December 03, 2025, replacing Dr. Parshant Kumar Goyal who ceased to hold the position on the same date. The appointment was made by the Central Government through official notification, with Ms. Pandit serving as Joint Secretary in the Department of Financial Services, Ministry of Finance.",
            "Sentiment": "neutral",
            "PublishDate": 1764947982701,
            "Source": "corporate_governance"
        },
        {
            "Title": "LIC Re-designates Executive Director Arindam DasGupta as Chief Investment Officer",
            "Summary": "Life Insurance Corporation of India re-designated Shri Arindam DasGupta from Executive Director (Investment-Front Office) to Executive Director (Investment-Front Office) Chief Investment Officer effective December 05, 2025. The appointment designates DasGupta as Key Managerial Personnel of the corporation, representing a leadership restructuring in LIC's investment operations.",
            "Sentiment": "neutral",
            "PublishDate": 1764922026957,
            "Source": "corporate_governance"
        },
        {
            "Title": "LIC Appoints Arindam DasGupta as Executive Director (Investment-Front Office)",
            "Summary": "Life Insurance Corporation of India appointed Shri Arindam DasGupta as Executive Director (Investment-Front Office) and Senior Management Personnel effective December 04, 2025. DasGupta, who previously served as Director and CEO of LICHFL Asset Management Company Limited, brings extensive investment experience and will serve until superannuation or further orders.",
            "Sentiment": "positive",
            "PublishDate": 1764863879631,
            "Source": "corporate_governance"
        },
        {
            "Title": "LIC Launches Two New Insurance Products - Bima Kavach and Protection Plus",
            "Summary": "Life Insurance Corporation of India launched two new insurance products effective December 3, 2025 - LIC's Bima Kavach (a non-participating pure risk plan) and LIC's Protection Plus (a non-participating linked savings plan). Both products are designed for the domestic market and will expand LIC's insurance portfolio offerings to individual customers.",
            "Sentiment": "positive",
            "PublishDate": 1764666605733,
            "Source": "stock"
        },
        {
            "Title": "LIC Appoints Ramakrishnan Chander as Managing Director",
            "Summary": "Life Insurance Corporation of India appointed Ramakrishnan Chander as Managing Director with effect from December 01, 2025, in the pay scale of Rs. 2,05,400 to Rs. 2,24,400 until September 30, 2027 or further orders. Chander, who previously served as Executive Director (Investment-Front Office) Chief Investment Officer, brings 35 years of experience across marketing, administration, and international operations to lead India's largest insurer.",
            "Sentiment": "positive",
            "PublishDate": 1764605578578,
            "Source": "corporate_governance"
        },
        {
            "Title": "LIC Reports 16.36% Jump in Profit After Tax to Rs 21,040 Crores in H1 FY26",
            "Summary": "Life Insurance Corporation of India posted a profit after tax of Rs 21,040 crores for the six months ended September 30, 2025, marking a 16.36% growth from Rs 18,082 crores in the same period last year. The company's non-par share of individual APE business grew significantly to 36.31% from 26.31% in the previous year, while VNB margin improved by 140 basis points to 17.6% and solvency ratio strengthened to 2.13.",
            "Sentiment": "positive",
            "PublishDate": 1763060979684,
            "Source": "earnings"
        },
        {
            "Title": "LICI Reports 12% Growth in H1FY26 Premium to ₹3.1 Lakh Crore, Targets 15% CAGR Over Next 3 Years",
            "Summary": "Life Insurance Corporation of India (LICI) achieved total premium of ₹3.1 lakh crore in H1FY26, marking a 12% year-on-year increase. The company has set a target of 15% compound annual growth rate in premium over the next three years, focusing on non-participating and protection segments. LICI's Value of New Business (VNB) margin expanded to 17.2%. The insurer is strengthening its bancassurance and digital distribution channels while working to enhance persistency and cost efficiency. LICI plans to expand its market share in health and term assurance segments as part of its profitability drive.",
            "Sentiment": "positive",
            "PublishDate": 1762874936942,
            "Source": "earnings"
        },
        {
            "Title": "LIC Reports 12.5% Growth in First Year Premium to Rs 192.74 Billion in October",
            "Summary": "Life Insurance Corporation of India (LIC) reported first year premium collections of Rs 192.74 billion in October, marking a 12.5% increase compared to the same period in the previous year. This growth indicates strong performance in new policy sales for the insurance company.",
            "Sentiment": "positive",
            "PublishDate": 1762749484815,
            "Source": "stock"
        },
        {
            "Title": "LIC Reports 32% Jump in Net Profit to Rs 10,053 Crore in September Quarter",
            "Summary": "Life Insurance Corporation of India reported a 32% increase in net profit to Rs 10,053 crore for the September quarter, compared to Rs 7,621 crore in the same period last year. CEO R Doraiswamy attributed the strong performance to focused efforts on strengthening core business operations, improved investment returns, and tighter expense management. Total income rose to Rs 2,39,614 crore from Rs 2,29,620 crore year-on-year, while net premium income increased 5.5% to Rs 1.26 lakh crore. The company's solvency ratio improved to 2.13% from 1.98% in the previous year. LIC has passed the entire GST benefit to policyholders to make policies more affordable and expects this to drive topline growth in the second half. The insurer continues focusing on cost rationalization and new product launches to meet evolving customer expectations, particularly targeting the growing trend of individuals building retirement corpus.",
            "Sentiment": "positive",
            "PublishDate": 1762571227830,
            "Source": "earnings"
        },
        {
            "Title": "LIC Reports 16.36% Jump in Profit to Rs 21,040 Crore for H1 FY2026",
            "Summary": "Life Insurance Corporation of India reported a profit after tax of Rs 21,040 crore for the six months ended September 30, 2025, marking a 16.36% increase from Rs 18,082 crore in the same period last year. Total premium income grew 5.14% to Rs 2,45,680 crore. The company maintained its market leadership position with 59.41% overall market share, though this declined from 61.07% in the previous year. Individual business market share stood at 37.21% and group business at 72.74%. Value of New Business increased 12.30% to Rs 5,111 crore with VNB margin expanding by 140 basis points to 17.6%. Individual Non-Par APE surged 30.47% to Rs 6,234 crore, raising its share within individual business to 36.31% from 26.31% previously. Assets under management grew 3.31% to Rs 57.23 lakh crore. The overall expense ratio improved by 146 basis points to 11.28%. Solvency ratio strengthened to 2.13 from 1.98. However, individual new business premium income declined 3.54% to Rs 28,491 crore, and the number of individual policies sold dropped 20.83% to 72.6 lakh. CEO MD Shri R Doraiswamy expressed optimism about GST changes for the insurance industry and highlighted successful product and channel diversification strategies.",
            "Sentiment": "positive",
            "PublishDate": 1762450365355,
            "Source": "earnings"
        },
        {
            "Title": "LICI Outlines Strategy for Premium Growth and Market Share Expansion",
            "Summary": "Life Insurance Corporation of India has outlined its strategic guidance focusing on sustained premium growth and expanding Value of New Business margins through product mix optimization and growth in the non-participating segment. The company plans to strengthen its bancassurance, digital platforms, and cross-selling initiatives to boost market share. LICI is targeting embedded value growth and persistency improvement as part of its strategic objectives.",
            "Sentiment": "positive",
            "PublishDate": 1762439367782,
            "Source": "stock"
        },
        {
            "Title": "LIC Reports 31.9% Jump in Quarterly Net Profit to 100.5 Billion Rupees",
            "Summary": "LIC reported a net profit of 100.5 billion rupees for the quarter, marking a significant increase from 76.2 billion rupees in the same period last year. The company's revenue also grew to 1.26 trillion rupees compared to 1.2 trillion rupees year-over-year. The results show strong financial performance with both profit and revenue registering growth.",
            "Sentiment": "positive",
            "PublishDate": 1762431268981,
            "Source": "earnings"
        },
        {
            "Title": "LIC Schedules Earnings Call for Quarter and Half-Year Results Ended September 30, 2025",
            "Summary": "Life Insurance Corporation of India will host an earnings call with analysts and investors on November 6, 2025, at 7:00 p.m. IST to discuss financial results for the quarter and half-year ended September 30, 2025. The call will be represented by senior management including CEO MD R. Doraiswamy, Managing Directors, Executive Directors from various divisions including Actuarial, Investment, Finance, Marketing, and CRM departments, along with CFO Sunil Agrawal and Head of Investor Relations Sanjay Bajaj. The company has provided multiple dial-in options including universal dial-in numbers, India toll-free numbers, and international toll-free access for various countries, with participants advised to dial in 10 minutes prior to the scheduled time.",
            "Sentiment": "neutral",
            "PublishDate": 1761909222455,
            "Source": "earnings"
        },
        {
            "Title": "LIC Executive Director Aditya Gupta to Superannuate on October 31, 2025",
            "Summary": "Life Insurance Corporation of India announced that Shri Aditya Gupta, Executive Director (Corporate Communications) and Senior Management Personnel, will superannuate on October 31, 2025, at the close of office hours. The company disclosed this information to BSE and NSE under SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1761905333410,
            "Source": "corporate_governance"
        },
        {
            "Title": "LIC Re-designates Pradeep Shenoy as Additional Executive Director for Corporate Communications",
            "Summary": "Life Insurance Corporation of India has re-designated Pradeep Shenoy from General Manager (FGN), Fiji to Additional Executive Director (Corporate Communications) at Central Office, Mumbai, effective October 30, 2025. This change brings Shenoy under the definition of Senior Management Personnel. Shenoy joined LIC in 1991 as an Assistant Administrative Officer and is a Post Graduate in Science with a Bachelor of Education degree and Fellowship from Insurance Institute of India. During his three-decade career, he has worked in administrative and marketing roles across Western Zone and South Central Zone offices, serving as Senior Divisional Manager for Nasik and Secunderabad Divisions and as Faculty Member at Zonal Training Centre, Pune-Akurdi.",
            "Sentiment": "neutral",
            "PublishDate": 1761837099594,
            "Source": "corporate_governance"
        },
        {
            "Title": "India Government Plans $1-1.5 Billion Stake Sale in Life Insurance Corp",
            "Summary": "The Indian government aims to sell a stake worth $1-1.5 billion in Life Insurance Corp by year-end. The stake sale is intended to raise public ownership in the company to 10%.",
            "Sentiment": "neutral",
            "PublishDate": 1761706772968,
            "Source": "stock"
        },
        {
            "Title": "LIC Denies Washington Post Allegations on Adani Group Investment Influence",
            "Summary": "Life Insurance Corporation of India issued a clarification rejecting Washington Post allegations that its investment decisions in Adani Group are influenced by external factors. LIC stated the allegations are false and baseless, denying the existence of any document or plan creating a roadmap for infusing funds into Adani companies. The corporation emphasized that investment decisions are made independently by its Board of Directors following approved policies and detailed due diligence. LIC clarified that the Department of Financial Services has no role in such decisions and maintained that all investments comply with regulatory guidelines and stakeholder interests.",
            "Sentiment": "negative",
            "PublishDate": 1761404566156,
            "Source": "stock"
        },
        {
            "Title": "LIC Schedules Board Meeting on November 6, 2025 to Approve Q2 and H1 FY2025-26 Financial Results",
            "Summary": "Life Insurance Corporation of India has scheduled a Board of Directors meeting on November 6, 2025, to consider and approve unaudited financial results (standalone and consolidated) for the quarter and half-year ended September 30, 2025. The company has implemented a trading window closure for insiders from October 1, 2025, which will remain in effect until November 8, 2025 (48 hours after the board meeting). The announcement was made through a regulatory communication dated October 17, 2025, signed by Company Secretary & Compliance Officer Anshul Kumar Singh.",
            "Sentiment": "neutral",
            "PublishDate": 1760687397750,
            "Source": "corporate_action"
        },
        {
            "Title": "LIC Launches Two New Insurance Products - Jan Suraksha and Bima Lakshmi",
            "Summary": "Life Insurance Corporation of India launched two new insurance products available for sale from October 15, 2025. The products are LIC's Jan Suraksha, a Non-Par, Non-Linked, Individual, Savings, Life Micro Insurance Plan, and LIC's Bima Lakshmi, a Non-Par, Non-Linked, Life, Individual, Savings Plan. Both products cater to the domestic market.",
            "Sentiment": "positive",
            "PublishDate": 1760420545175,
            "Source": "stock"
        },
        {
            "Title": "LIC Reports 12.7% Growth in First-Year Premiums to INR 229.57 Billion in September",
            "Summary": "Life Insurance Corporation of India (LIC) achieved first-year premiums of INR 229.57 billion in September, marking a 12.7% increase compared to the same period in the previous year. This growth indicates strong performance in new policy acquisitions for the insurance giant.",
            "Sentiment": "positive",
            "PublishDate": 1760003784135,
            "Source": "stock"
        },
        {
            "Title": "Life Insurance Corporation of India Announces Retirement of Two Senior Management Personnel",
            "Summary": "Life Insurance Corporation of India disclosed that two senior management personnel will retire on September 30, 2025. Shri Sudhakar Ravindranath, Executive Director (Marketing/Product Development), and Shri Shrawan Kumar, Zonal Manager (in-charge) of Patna Zonal Office, will superannuate after close of office hours on that date. The company made this disclosure to stock exchanges BSE and NSE under regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1759237111916,
            "Source": "corporate_governance"
        },
        {
            "Title": "LIC Records ₹1,100 Crore Inflows on First Day of GST Exemption for Life Insurance",
            "Summary": "Life Insurance Corporation of India (LIC) reported inflows of ₹1,100 crore on the first day following the removal of GST on life insurance products. This significant influx indicates immediate market response to the tax exemption policy change.",
            "Sentiment": "positive",
            "PublishDate": 1758948807081,
            "Source": "stock"
        },
        {
            "Title": "LIC Re-designates Jaideep Chaudhuri as Principal at Jamshedpur Training Centre",
            "Summary": "Life Insurance Corporation of India has re-designated Shri Jaideep Chaudhuri from Vice Principal to Principal at the Zonal Training Centre in Jamshedpur. This change places him in a Senior Management Personnel position within the corporation. Chaudhuri, who joined LIC in 1988 as an Assistant Administrative Officer, has over three decades of experience across various administrative and marketing roles in different zones. He previously served as a Faculty Member at training centres in Kolkata and Jamshedpur before becoming Vice Principal. The re-designation took effect on September 17, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758102712389,
            "Source": "corporate_governance"
        },
        {
            "Title": "LICI Faces ₹92.48 Cr GST Demand Order Plus Equal Penalty for FY 2021-22",
            "Summary": "Life Insurance Corporation of India (LICI) has received a GST demand order of ₹92.48 crores along with an equal penalty amount for FY 2021-22. The company plans to appeal this order before the Commissioner (Appeals) in Jamshedpur.",
            "Sentiment": "negative",
            "PublishDate": 1757934884486,
            "Source": "stock"
        },
        {
            "Title": "LIC Shares Drop 15% in One Year as 70% of Portfolio Holdings Decline",
            "Summary": "Life Insurance Corporation of India (LIC) shares have fallen 15% over the past year, underperforming benchmark indices Nifty (-0.3%) and Sensex (-0.5%), and trailing the insurance sector's negative 7% return. The stock is currently down 20% from its 52-week high of Rs 1,048.90 reached in September 2024. Analysis of LIC's investment portfolio shows 186 out of 266 stocks (70%) are trading in negative territory over one year, with some declining as much as 74%. Notable portfolio declines include VL E-Governance & IT Solutions, Flexituff Ventures International, Easy Trip Planners, and Jaiprakash Associates falling over 50%. However, 76 stocks (29%) in LIC's portfolio showed positive returns, led by Tourism Finance Corporation of India with 99% gains. LIC reported quarterly consolidated net profit of Rs 10,957 crore, up 4% year-on-year, with revenue of Rs 2,25,451 crore, growing 6% year-on-year. Technical analysts see the stock in a sideways trend with support at Rs 850 and resistance at Rs 920.",
            "Sentiment": "negative",
            "PublishDate": 1757568748977,
            "Source": "stock"
        },
        {
            "Title": "LIC Reports 17% Decline in Premiums to ₹16,000 Crore",
            "Summary": "Life Insurance Corporation of India (LIC) reported a 17% decrease in premiums, with collections dropping to ₹16,000 crore from ₹19,300 crore. This represents a decline of ₹3,300 crore in premium collections for the insurance giant.",
            "Sentiment": "negative",
            "PublishDate": 1757403631284,
            "Source": "stock"
        },
        {
            "Title": "LICI Welcomes GST Exemption on Life Insurance Premiums",
            "Summary": "Life Insurance Corporation of India (LICI) has welcomed the GST exemption on life insurance premiums. The company expects this exemption to improve affordability for customers and support long-term growth in the life insurance sector.",
            "Sentiment": "positive",
            "PublishDate": 1757079058929,
            "Source": "stock"
        },
        {
            "Title": "LIC Launches Female Critical Illness Benefit Rider for Domestic Market",
            "Summary": "Life Insurance Corporation of India launched LIC's Female Critical Illness Benefit Rider, available for sale from August 26, 2025. The product is a non-linked, individual health rider specifically designed for women and targets the domestic market. LIC disclosed this product launch under regulatory requirements.",
            "Sentiment": "positive",
            "PublishDate": 1756114570352,
            "Source": "stock"
        },
        {
            "Title": "LIC to Maintain Bancassurance Partnership with IDBI Bank Despite Stake Sale",
            "Summary": "Life Insurance Corporation of India (LIC) will continue its bancassurance agreement with IDBI Bank even as it proceeds with selling its stake in the bank. The insurance giant plans to retain its distribution partnership through IDBI Bank's branch network regardless of the ownership changes.",
            "Sentiment": "neutral",
            "PublishDate": 1756104021605,
            "Source": "stock"
        },
        {
            "Title": "SEBI Approves LIC's Reclassification as Public Shareholder in IDBI Bank Disinvestment",
            "Summary": "SEBI has approved the reclassification of Life Insurance Corporation of India (LIC) as a public shareholder of IDBI Bank as part of the strategic disinvestment process approved by the Cabinet Committee on Economic Affairs on May 05, 2021. The approval comes with several conditions: LIC's voting rights cannot exceed 10% of total net effective voting rights, LIC cannot exercise control over IDBI Bank directly or indirectly, LIC cannot have special rights or board representation, and LIC must reduce its shareholding to 15% or below within two years of transaction completion as directed by the Reserve Bank of India. The reclassification is subject to obtaining other statutory and regulatory approvals and completion of the transaction. Non-compliance with any conditions will result in automatic withdrawal of the reclassification approval.",
            "Sentiment": "neutral",
            "PublishDate": 1756020700382,
            "Source": "corporate_action"
        },
        {
            "Title": "DIPAM Secretary Initiates RFP Process for LIC Stake Sale",
            "Summary": "The DIPAM Secretary has announced the commencement of the Request for Proposal (RFP) process for the sale of stake in Life Insurance Corporation of India (LIC). This marks the beginning of the formal procedure for divesting government ownership in the insurance giant.",
            "Sentiment": "neutral",
            "PublishDate": 1755768297839,
            "Source": "stock"
        },
        {
            "Title": "LIC to Participate in Centrum Broking's Orion IV Conference on August 22, 2025",
            "Summary": "Life Insurance Corporation of India will participate in the Orion IV Powering Through-India on the Global Stage conference organized by Centrum Broking Limited on August 22, 2025. The virtual event will include group and one-on-one meetings with investors and analysts. LIC reported quarterly results showing total group business premium of INR 1,19,200 crore, up 4.77% year-on-year. Individual new business premium reached INR 12,536 crore with a 5.42% increase. The company maintained a 63.51% market share in individual new business premium and 63.07% market share in policies. Profit after tax grew 5.02% to INR 10,986 crore. Assets under management increased 6.47% to INR 57,05,341 crore. The company's embedded value reached INR 7,76,876 crore as of March 2025, representing a 6.81% growth from the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755596996396,
            "Source": "stock"
        },
        {
            "Title": "LIC Reports 5% Profit Growth and 150 bps VNB Margin Improvement in Q1 FY26",
            "Summary": "Life Insurance Corporation of India reported a profit after tax of Rs.10,986 crore for the quarter ended June 30, 2025, marking a 5.02% year-on-year growth from Rs.10,461 crore. Total premium income increased 4.77% to Rs.1,19,200 crore. The company's VNB margin improved significantly by 150 basis points to 15.4% from 13.9% in the same period last year, while net VNB grew 20.75% to Rs.1,944 crore. Market share by first year premium income was 63.51% compared to 64.02% in the previous year. Individual new business premium income grew 5.42% to Rs.12,536 crore, with non-par share of individual APE increasing to 30.34% from 23.94%. The company's solvency ratio improved to 2.17 from 1.99. Assets under management grew 6.47% to Rs.57,05,341.44 crore. The overall expense ratio decreased by 140 basis points to 10.47%. Bancassurance and alternate channels showed strong growth of 98.23% in new business premium income to Rs.861.92 crore. The company sold 30,39,709 new policies, a decrease of 14.75%, though average ticket size increased by 23%.",
            "Sentiment": "positive",
            "PublishDate": 1755184651955,
            "Source": "earnings"
        },
        {
            "Title": "Government Plans to Sell 2.5-3% LIC Stake to Raise ₹14,000-17,000 Crores",
            "Summary": "The government plans to sell a 2.5-3% stake in LIC during the initial divestment phase. This stake sale is expected to raise between ₹14,000-17,000 crores for the government.",
            "Sentiment": "neutral",
            "PublishDate": 1755071224219,
            "Source": "corporate_action"
        },
        {
            "Title": "LIC Reports 5% Profit Growth, VNB Margin Rises 150 Basis Points to 15.4%",
            "Summary": "LIC reported quarterly results showing profit growth of 5% and VNB margin improvement of 150 basis points to 15.4%. The company has increased its non-PAR share in APE to 30%, up from 7% before listing, with individual APE jumping 32%. CEO R Doraiswamy indicated the company aims to reach a 40-60 or 45-55 proportion between non-PAR and PAR products. LIC has expanded its product portfolio to 51 products with substantial non-PAR offerings. Regarding health insurance expansion, the company is re-evaluating its timeline for acquiring stakes in standalone health insurers due to regulatory changes and market conditions. LIC maintains a neutral stance on composite licenses, preferring to focus on its core strength in life insurance and pension services while awaiting statutory changes before considering diversification.",
            "Sentiment": "positive",
            "PublishDate": 1754882815623,
            "Source": "stock"
        },
        {
            "Title": "LICI Plans Strategic Shift to High-Margin Products and Digital Expansion",
            "Summary": "Life Insurance Corporation of India (LICI) is planning its next growth phase through a strategic pivot toward high-margin non-participating products, digital expansion initiatives, and improvements in policy persistency rates. The company aims to drive long-term value creation through these strategic changes.",
            "Sentiment": "positive",
            "PublishDate": 1754578004848,
            "Source": "stock"
        },
        {
            "Title": "LIC Plans to Boost Participating Life Insurance Share for Better Portfolio Balance",
            "Summary": "LIC aims to increase its share of participating life insurance products to achieve better balance in its portfolio. The company's executive indicated that any decision regarding entry into general insurance will depend on regulatory approval for composite insurance firms.",
            "Sentiment": "neutral",
            "PublishDate": 1754573540177,
            "Source": "stock"
        },
        {
            "Title": "LIC Reports 5% Growth in Profit After Tax to Rs 10,986 Crore",
            "Summary": "Life Insurance Corporation of India reported a profit after tax of Rs 10,986 crore, representing a 5.02% increase from the previous year's Rs 10,461 crore. The company maintained its market leadership with a 63.51% overall market share by First Year Premium Income. Total premium income grew 4.77% to Rs 1,19,200 crore, while individual business premium increased 6.37% to Rs 71,474 crore. The Value of New Business rose 20.75% to Rs 1,944 crore, with VNB margin improving by 150 basis points to 15.4%. Non-participating products' share in individual business increased to 30.34% from 23.94%. The solvency ratio strengthened to 2.17 from 1.99, and the overall expense ratio improved by 140 basis points to 10.47%. Assets under management grew 6.47% to Rs 57.05 lakh crore. However, the number of individual policies sold declined 14.75% to 30.39 lakh policies.",
            "Sentiment": "positive",
            "PublishDate": 1754572115310,
            "Source": "earnings"
        },
        {
            "Title": "LIC Awaits Regulatory Changes for Health Insurance Joint Venture Decision, Plans Increased Bond Investment",
            "Summary": "LIC's co-executive announced the company is waiting for regulatory changes before finalizing decisions on a health insurance joint venture. The company is considering various options and plans to increase investment in bond forwards. The executive attributed lower profit growth to weak capital gains, citing unfavorable market conditions as the primary factor affecting performance.",
            "Sentiment": "negative",
            "PublishDate": 1754571503635,
            "Source": "stock"
        },
        {
            "Title": "LIC Reports VNB Margin of 15.4% in Q1",
            "Summary": "Life Insurance Corporation of India (LIC) achieved a Value of New Business (VNB) margin of 15.4% in the first quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754569632841,
            "Source": "earnings"
        },
        {
            "Title": "Life Insurance Corporation of India Approves Quarterly Financial Results",
            "Summary": "Life Insurance Corporation of India's Board of Directors approved the unaudited financial results for the quarter ended June 30, 2025, during a board meeting held on August 07, 2025. The board considered and approved both standalone and consolidated unaudited financial results, along with a limited review report. The board meeting commenced at 11:45 a.m. and concluded at 4:25 p.m. The results and review report have been made available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1754569257332,
            "Source": "earnings"
        }
    ]
}