{
    "Symbol": "LIKHITHA",
    "ISIN": "INE060901027",
    "News": [
        {
            "Title": "Likhitha Infrastructure Reports Strong Q2 Performance with Revenue Growth and Improved Profitability",
            "Summary": "Likhitha Infrastructure Limited announced unaudited financial results for the second quarter and half year ended September 30, 2025, showing revenue from operations of Rs. 10,223.79 lakhs for Q2 and Rs. 22,464.34 lakhs for H1. The company reported net profit of Rs. 1,152.98 lakhs for Q2 and Rs. 2,543.52 lakhs for the half year, with earnings per share of Rs. 2.92 for the quarter and Rs. 6.45 for the half year period.",
            "Sentiment": "positive",
            "PublishDate": 1763136119766,
            "Source": "earnings"
        },
        {
            "Title": "Likhitha Infrastructure Board Approves Expansion into Energy Sector Through Memorandum Amendment",
            "Summary": "Likhitha Infrastructure Limited's Board of Directors approved an alteration to the Object Clause of the company's Memorandum of Association during a meeting held on March 26, 2025. The amendment adds new clauses to expand the company's business scope into the energy sector, including power generation from renewable and non-renewable sources such as solar, thermal, wind, hydro, biomass, nuclear, and hydrogen. The new objectives encompass establishing and operating power plants, energy storage systems, transmission and distribution networks, smart grids, and providing EPC services. The company will also engage in carbon credit trading, renewable energy certificates, and develop emerging technologies like hydrogen energy, waste-to-energy, and electric vehicle charging infrastructure. The Board also approved a draft Postal Ballot notice for shareholders and appointed VCAN & Associates as scrutinizer for the e-voting process.",
            "Sentiment": "positive",
            "PublishDate": 1757130623563,
            "Source": "corporate_action"
        },
        {
            "Title": "Likhitha Infrastructure Q1 FY2026 Results Show Revenue Decline and Margin Pressure Despite Strong Order Book",
            "Summary": "Likhitha Infrastructure Limited reported Q1 FY2026 standalone revenue of Rs 122.41 crore, down 2.10% year-over-year from Rs 125.03 crore. Net profit declined 18.51% to Rs 13.91 crore compared to Rs 17.07 crore in the previous year quarter. EBITDA margin compressed to 16.60% from 20.18% in Q1 FY2025. The oil and gas pipeline infrastructure service provider, which operates across 20 states and 2 union territories, maintains an order book of approximately Rs 1,100 crore as of June 30, 2025. The company's full-year FY2025 performance showed revenue growth of 23.49% to Rs 521.22 crore, though EBITDA margin declined to 19.38% from 23.08% in FY2024. Likhitha has expanded internationally through a joint venture in Saudi Arabia and provides services across City Gas Distribution, Cross Country Pipeline projects, Operation & Maintenance, and Tankage Construction segments.",
            "Sentiment": "negative",
            "PublishDate": 1755609143705,
            "Source": "earnings"
        },
        {
            "Title": "Likhitha Infrastructure Reports Q1 FY2026 Financial Results with Profit Growth",
            "Summary": "Likhitha Infrastructure's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹12,240.55 lakhs compared to ₹12,502.78 lakhs in the same quarter last year. Profit for the period stood at ₹1,390.54 lakhs versus ₹1,707.17 lakhs in the previous year quarter. On a consolidated basis, profit reached ₹1,379.86 lakhs compared to ₹1,707.17 lakhs in the corresponding quarter. Basic earnings per share was ₹3.52 for standalone and ₹3.51 for consolidated results. The company operates primarily in gas pipeline laying and allied infrastructure development. The results include two subsidiaries: CPM-Likhitha Consortium in India and Likhitha HAK Arabia Contracting Company in Saudi Arabia.",
            "Sentiment": "neutral",
            "PublishDate": 1754740249217,
            "Source": "earnings"
        },
        {
            "Title": "Likhitha Infrastructure Reports Q4 Financial Results",
            "Summary": "Likhitha Infrastructure has released its Q4 financial results. The company's EBITDA for Q4 was 240 million rupees, down from 285 million rupees in the same quarter last year. The EBITDA margin decreased to 17.74% from 23.28% year-over-year. Revenue for Q4 increased to 1.35 billion rupees from 1.22 billion rupees in the previous year. The company's net profit for Q4 slightly decreased to 176 million rupees from 187 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747734145000,
            "Source": "result"
        },
        {
            "Title": "Likhitha Infrastructure Reports Q3 EBITDA and Margin Decline",
            "Summary": "Likhitha Infrastructure has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter stood at 232 million rupees, compared to 237 million rupees in the same quarter last year, showing a slight year-over-year decrease. The EBITDA margin also declined to 18.38% from 23.53% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1739017545000,
            "Source": "earnings"
        },
        {
            "Title": "Likhitha Infrastructure Reports Q3 FY24 Financial Results",
            "Summary": "Likhitha Infrastructure has announced its financial results for the third quarter. The company's net profit increased to 173 million rupees from 160 million rupees in the same quarter last year. Revenue also saw growth, rising to 1.27 billion rupees from 1 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739017540000,
            "Source": "earnings"
        },
        {
            "Title": "Likhitha Infrastructure Reports Q2 Financial Results",
            "Summary": "Likhitha Infrastructure announced its Q2 financial results. The company's EBITDA increased to 232 million rupees from 204 million rupees year-over-year. However, the EBITDA margin decreased to 18.49% from 20.39% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731399533000,
            "Source": "result"
        },
        {
            "Title": "Likhitha Infrastructure Reports Q2 Revenue Growth",
            "Summary": "Likhitha Infrastructure announced its Q2 revenue of 1.25 billion rupees, showing an increase from 999 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731399409000,
            "Source": "result"
        },
        {
            "Title": "Likhitha Infrastructure Reports Q2 Profit Increase",
            "Summary": "Likhitha Infrastructure has reported a net profit of 174 million rupees for the second quarter, compared to 154 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731399370000,
            "Source": "result"
        }
    ]
}