{
    "Symbol": "LINCOLN",
    "ISIN": "INE405C01035",
    "News": [
        {
            "Title": "Lincoln Pharma Q3FY26 Net Profit Surges 37.70% YoY",
            "Summary": "Lincoln Pharmaceuticals reports consolidated net profit of ₹28.60 crore in Q3FY26, up 37.70% YoY. Revenue from operations grows 13.49% to ₹166.32 crore with strong performance across therapeutic segments.",
            "Sentiment": "positive",
            "PublishDate": 1770876979138,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lincoln Pharmaceuticals Gets CRISIL A/Stable Rating",
            "Summary": "Lincoln Pharmaceuticals receives credit rating reaffirmation from CRISIL with long-term facilities at CRISIL A/Stable and short-term at CRISIL A1, reflecting strong financial profile.",
            "Sentiment": "positive",
            "PublishDate": 1768044365240,
            "Source": "stocks"
        },
        {
            "Title": "Lincoln Pharmaceuticals Reports 24% Drop in Q2 Net Profit Despite Revenue Stability",
            "Summary": "Lincoln Pharmaceuticals reported a consolidated net profit of Rs. 20.01 crore for Q2FY26, down 24.06% year-on-year, while total income remained stable at Rs. 170.60 crore with only a 0.34% decline. The company targets Rs. 1,000 crore revenue within three years and aims for 15-18% annual growth, driven by expansion in cardiac, diabetic, dermatology, and ENT segments.",
            "Sentiment": "negative",
            "PublishDate": 1763064274895,
            "Source": "earnings"
        },
        {
            "Title": "Lincoln Pharma Reports 17% Net Profit Growth in Q1 Results",
            "Summary": "Lincoln Pharmaceuticals reported net profit of Rs 27.70 crore for the April-June quarter, marking a 17% increase from Rs 23.69 crore in the same period last year. Total income grew 7.3% to Rs 169.34 crore compared to Rs 157.69 crore in the previous year. EBITDA rose 17.92% to Rs 39.08 crore from Rs 33.14 crore year-on-year. The company targets Rs 1,000 crore revenue within three years through business expansion into high-value product lines and new markets, aiming for 15-18% annual growth driven by cardiac, diabetic, dermatology, and ENT segments. During the quarter, the company launched its bulk drug manufacturing plant with Rs 4 crore investment from internal funds and received approvals for 10 products. Company shares surged 8.47% to close at Rs 576.90 on BSE.",
            "Sentiment": "positive",
            "PublishDate": 1754567983864,
            "Source": "earnings"
        },
        {
            "Title": "Lincoln Pharmaceuticals Re-appoints Four Key Directors for Five-Year Terms",
            "Summary": "Lincoln Pharmaceuticals Limited's Board of Directors approved the re-appointment of four senior executives for five-year terms, subject to shareholder approval at the upcoming Annual General Meeting. Mahendra G. Patel was re-appointed as Managing Director from October 1, 2025 to September 30, 2030. Three Whole Time Directors were also re-appointed: Hashmukh I. Patel for the same October 2025 to September 2030 period, while Ashish R. Patel and Munjal M. Patel will serve from November 14, 2025 to November 13, 2030. The appointments were recommended by the Nomination and Remuneration Committee. Mahendra G. Patel, a law graduate with over 45 years of pharmaceutical industry experience, has served as Managing Director since the company's incorporation and is a company promoter. Hashmukh I. Patel, a science graduate with three decades of pharma experience, manages domestic marketing and sales distribution. Ashish R. Patel holds an MBA in Marketing from the UK and handles marketing operations and sales strategies. Munjal M. Patel has a Master's degree in Finance from the USA with over 10 years of pharma experience and manages international trade and financial matters.",
            "Sentiment": "positive",
            "PublishDate": 1754553175522,
            "Source": "corporate_governance"
        },
        {
            "Title": "Lincoln Pharma Reports 18% Growth in Q1 EBITDA to 391 Million Rupees",
            "Summary": "Lincoln Pharma reported Q1 EBITDA of 391 million rupees, representing an increase from 331 million rupees in the same period last year. The company's EBITDA margin improved to 25.38% compared to 22.54% year-over-year, indicating enhanced profitability and operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1754551748263,
            "Source": "earnings"
        },
        {
            "Title": "Lincoln Pharmaceuticals' Khatraj Facility Completes Trial Run",
            "Summary": "Lincoln Pharmaceuticals has completed the trial run of its Khatraj facility. The company aims to begin commercial API production at this facility within the next 1-2 years, subject to obtaining necessary regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1751436621000,
            "Source": "default"
        },
        {
            "Title": "Lincoln Pharma Reports Q4 Results and Revenue Target",
            "Summary": "Lincoln Pharma announced its Q4 financial results. Revenue increased to 1.68 billion rupees from 1.4 billion rupees year-over-year. EBITDA rose to 267 million rupees from 184 million rupees, with EBITDA margin improving to 15.89% from 12.90%. However, net profit decreased to 116 million rupees from 186 million rupees. The company's MD stated that Lincoln Pharma is well-positioned to achieve a revenue target of 750 crore rupees by FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1747897532000,
            "Source": "result"
        },
        {
            "Title": "Lincoln Pharma Reports Q3 Revenue Growth",
            "Summary": "Lincoln Pharma has announced its financial results for the third quarter. The company reported revenue of 1.5 billion rupees, compared to 1.46 billion rupees in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1739429438000,
            "Source": "earnings"
        },
        {
            "Title": "Lincoln Pharma Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Lincoln Pharma has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter stood at 237 million rupees, down from 297 million rupees in the same quarter last year. The EBITDA margin also decreased to 16.14% from 20.25% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739429337000,
            "Source": "earnings"
        },
        {
            "Title": "Lincoln Pharmaceuticals Reports Q3 Net Profit of 208 Million Rupees",
            "Summary": "Lincoln Pharmaceuticals has announced its financial results for the third quarter. The company reported a net profit of 208 million rupees, which represents a decrease compared to the 280 million rupees reported in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1739429286000,
            "Source": "earnings"
        },
        {
            "Title": "Lincoln Pharmaceuticals: Stock Hits Lifetime High, Surges 30% in December",
            "Summary": "Lincoln Pharmaceuticals stock rose nearly 12% to reach a record high of ₹843.60 on BSE on December 4. The stock has gained 30% in December.",
            "Sentiment": "positive",
            "PublishDate": 1733286462000,
            "Source": "normal_news"
        },
        {
            "Title": "Lincoln Pharma Reports Q2 Revenue Growth",
            "Summary": "Lincoln Pharma announced its Q2 financial results, reporting revenue of 1.61 billion rupees, compared to 1.56 billion rupees in the same quarter last year. This represents a year-over-year increase in revenue for the pharmaceutical company.",
            "Sentiment": "positive",
            "PublishDate": 1731566961000,
            "Source": "result"
        },
        {
            "Title": "Lincoln Pharma Reports Q2 Financial Results",
            "Summary": "Lincoln Pharma announced its Q2 financial results. The company's EBITDA for Q2 was 284 million rupees, down from 311 million rupees in the same quarter last year. The EBITDA margin decreased to 17.60% from 19.96% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731566927000,
            "Source": "result"
        },
        {
            "Title": "Lincoln Pharma Reports Q2 Net Profit of 263M Rupees",
            "Summary": "Lincoln Pharma has announced its Q2 financial results. The company reported a net profit of 263 million rupees, compared to 276 million rupees in the same quarter last year, indicating a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1731566865000,
            "Source": "result"
        }
    ]
}