{
    "Symbol": "LINC",
    "ISIN": "INE802B01027",
    "News": [
        {
            "Title": "LINC Limited Q3 FY26 Results: Revenue Up 5.8% YoY",
            "Summary": "LINC Limited reports Q3 FY26 revenue of ₹12,929 lacs, up 5.8% YoY, but operating EBITDA declined 11.7% to ₹1,290 lacs. PAT dropped 22.3% to ₹677 lacs amid margin pressures and JV losses.",
            "Sentiment": "neutral",
            "PublishDate": 1770909857856,
            "Source": "co_actions_results"
        },
        {
            "Title": "LINC Limited Q3FY26 Earnings Call on Feb 12",
            "Summary": "LINC Limited announces investor conference call scheduled for February 12, 2026 at 15:30 IST to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769796063824,
            "Source": "co_actions_results"
        },
        {
            "Title": "Linc Limited: Promoter Group Raises Stake to 2%",
            "Summary": "Ajanta Sales Private Limited, part of Linc Limited's promoter group, acquired 21,300 equity shares through inter-se transfer on December 8, 2025, increasing its holding from 1.97% to 2.00%.",
            "Sentiment": "neutral",
            "PublishDate": 1765382710897,
            "Source": "co_actions_results"
        },
        {
            "Title": "Linc Limited Promoter Group Reduces Stake by 0.03%",
            "Summary": "Devanshi Jalan, part of Linc Limited's promoter group, sold 21,300 equity shares through inter-se transfer on December 7, 2025, reducing her shareholding from 2.87% to 2.84%.",
            "Sentiment": "neutral",
            "PublishDate": 1765382566886,
            "Source": "co_actions_results"
        },
        {
            "Title": "LIC Faces ₹11.26 Cr Tax Demand with Interest & Penalty",
            "Summary": "Life Insurance Corporation receives tax order demanding ₹1.38 crores with additional interest of ₹8.50 crores and penalty of ₹1.38 crores, totaling ₹11.26 crores in tax liabilities.",
            "Sentiment": "negative",
            "PublishDate": 1765377242611,
            "Source": "stocks"
        },
        {
            "Title": "Ajanta Sales Private Limited Increases Stake in Linc Limited to 2%",
            "Summary": "Ajanta Sales Private Limited, a promoter group entity, acquired 21,300 equity shares of Linc Limited through inter-se transfer on December 8, 2025. The acquisition increased Ajanta Sales' shareholding from 11,72,180 shares (1.97%) to 11,93,480 shares (2.00%) of Linc Limited's total equity capital.",
            "Sentiment": "neutral",
            "PublishDate": 1765359821964,
            "Source": "corporate_action"
        },
        {
            "Title": "Linc Limited Promoter Group Member Reduces Stake Through Inter-se Transfer",
            "Summary": "Devanshi Jalan, a promoter group member of Linc Limited, sold 21,300 equity shares through inter-se transfer, reducing her holding from 17,08,228 shares (2.87%) to 16,86,928 shares (2.84%). The transaction was disclosed under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1765359526405,
            "Source": "corporate_action"
        },
        {
            "Title": "Linc Limited Promoter Group Member Reduces Stake Through Inter-se Transfer",
            "Summary": "Devanshi Jalan, a promoter group member of Linc Limited, sold 73,000 equity shares through inter-se transfer, reducing her holding from 17,81,228 shares (2.99%) to 17,08,228 shares (2.87%). The transaction was disclosed under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1763725176815,
            "Source": "corporate_action"
        },
        {
            "Title": "Linc Limited Promoter Deepak Jalan Increases Stake Through Market Purchase",
            "Summary": "Deepak Jalan, a promoter of Linc Limited, acquired 73,000 equity shares through inter-se transfer, increasing his holding from 16,21,208 shares (2.73%) to 16,94,208 shares (2.85%). The acquisition was disclosed under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1763724566307,
            "Source": "corporate_action"
        },
        {
            "Title": "Linc Limited Reports Q2 FY26 Results with 1.3% Revenue Growth and 3.7% Profit Decline",
            "Summary": "Linc Limited achieved revenue growth of 1.3% year-on-year to INR 13,907 lakhs in Q2 FY26, while net profit declined 3.7% to INR 846 lakhs due to joint venture losses of INR 168 lakhs. The company launched new products including Swype markers and Pentonic mechanical pencils, and commenced operations with Mitsubishi Pencil Company Japan for a INR 20 MRP ball pen, targeting double-digit growth by year-end.",
            "Sentiment": "neutral",
            "PublishDate": 1763101455385,
            "Source": "earnings"
        },
        {
            "Title": "Linc Limited Promoter Group Entities Execute Inter-se Share Transfer",
            "Summary": "Ajanta Sales Private Limited acquired 60,000 equity shares of Linc Limited through inter-se transfer, increasing its stake from 1.87% to 1.97%, while Devanshi Jalan disposed of 60,000 shares, reducing her holding from 3.10% to 2.99%. The transaction occurred on November 12, 2025, representing an internal restructuring within the promoter group without affecting the company's total equity share capital of 5,94,89,164 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763098416700,
            "Source": "corporate_action"
        },
        {
            "Title": "Linc Limited Reports 1.3% Revenue Growth in Q2FY26 Despite Margin Decline and Joint Venture Losses",
            "Summary": "Linc Limited reported revenue growth of 1.3% year-on-year for Q2FY26, reaching ₹13,907 lacs. However, operating EBITDA margin declined by 3.8% due to higher employee costs from scheduled annual increments. Net profit dropped 3.7% primarily due to losses of ₹167.75 lacs from joint ventures, which the company views as transitional losses from early-stage investments. The company maintained steady underlying profitability with a PAT margin of 6.0%. Export revenue constituted 21.2% of total revenue, while Pentonic brand held 35.6% revenue share. The company launched new products including SWYPE marker range and Pentonic mechanical pencils. Joint venture operations with Mitsubishi Pencil commenced in October 2025 with a new ₹20 ball pen launch. The Bengal manufacturing facility remains on track for Q4FY26 operations. Net cash from operating activities stood at ₹2,625 lacs with net debt to equity at (0.23). Management expressed confidence that recent product launches and strategic initiatives will drive growth in coming quarters.",
            "Sentiment": "neutral",
            "PublishDate": 1762758627026,
            "Source": "earnings"
        },
        {
            "Title": "Linc Limited Reports 38.7% Jump in Q2 Profit to Rs 1,016 Lakhs",
            "Summary": "Linc Limited announced quarterly results for the quarter ended September 30, 2025, with profit after tax rising to Rs 1,016.39 lakhs compared to Rs 732.75 lakhs in the previous quarter. Revenue from operations increased to Rs 13,563.05 lakhs from Rs 13,464.37 lakhs. For the half-year period, profit reached Rs 1,749.14 lakhs versus Rs 1,714.75 lakhs in the corresponding period. Basic earnings per share stood at Rs 1.71 for the quarter. The company operates in the writing instruments and stationery segment. The Board of Directors approved the unaudited financial results at their meeting held on November 8, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762610014594,
            "Source": "earnings"
        },
        {
            "Title": "Linc Limited Modifies Joint Venture Agreement with Morris Co. Ltd",
            "Summary": "Linc Limited has revised its joint venture agreement with Morris Co. Ltd. for their joint venture company Morris Linc Private Limited through an addendum effective November 4, 2025. The key modifications include expanding the product portfolio to add Water colour, Permanent White Board Marker and other items alongside existing products like Anti-ink Dry Marker and Twist Colour Pencil. The board composition has been restructured with Linc and Morris now having rights to appoint 2 directors and 1 director respectively, compared to 2 directors each previously. Additionally, the Reserve Matters mentioned in the original agreement have been deleted.",
            "Sentiment": "neutral",
            "PublishDate": 1762252897250,
            "Source": "corporate_action"
        },
        {
            "Title": "Linc Limited Launches Joint Venture with Mitsubishi Pencil Co., Ltd. to Form UNI LINC INDIA",
            "Summary": "Linc Limited has commenced operations of its joint venture with Mitsubishi Pencil Co., Ltd., Japan, creating UNI LINC INDIA PRIVATE LIMITED. The joint venture combines Linc's distribution network and brand equity in India with Mitsubishi Pencil's innovation and product excellence under the Uni brand. Production began in September 2025, focusing on ballpoint pens designed for the Indian market. The facility was officially inaugurated on October 1st. The joint venture has a capital of 200 million INR and is located in Gujarat State. Mitsubishi Pencil holds 51% equity while Linc Limited holds 49%. The partnership aims to bring Japanese technology-based writing instruments at accessible prices to Indian consumers and expand the product portfolio over time.",
            "Sentiment": "positive",
            "PublishDate": 1759378131863,
            "Source": "order&deals"
        },
        {
            "Title": "LINC LIMITED Sets September 16, 2025 as Record Date for Dividend Subject to AGM Approval",
            "Summary": "LINC LIMITED has announced September 16, 2025 as the record date for dividend purposes, subject to declaration at the company's 31st Annual General Meeting scheduled for September 23, 2025. The company's share transfer books and register of members will be closed from September 17 to September 23, 2025 in connection with the AGM. The announcement was made by Company Secretary Dipankar De through notifications to the Calcutta Stock Exchange, National Stock Exchange of India, and BSE Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1756206254327,
            "Source": "corporate_action"
        },
        {
            "Title": "LINC LIMITED Reports Mixed Q1 FY26 Results with 5.3% Revenue Growth but 16.4% Profit Decline",
            "Summary": "LINC LIMITED reported revenue growth of 5.3% year-on-year to ₹13,698 lacs for the quarter ended June 30, 2025, but profit after tax declined 16.4% to ₹705 lacs. The company's operating EBITDA margin compressed to 9.6% from 11.0% in the previous year. Management attributed the bottom-line decline to operational factors and transitional costs, describing it as a one-off impact. The Pentonic brand maintained strong performance with 37.4% revenue share and sold 1,918 lacs pens during the quarter. Export revenue contributed 18.0% to total revenue. The company's joint venture with Mitsubishi Pencil Co. is now expected to commence operations by October 2025, delayed by 3-4 months from the original timeline. LINC launched new products including the SWYPE marker range and Pentonic mechanical pencil, which have received positive consumer response. The company maintains a strong balance sheet with net cash position of ₹2,121 lacs and negative net debt to equity ratio of (0.09).",
            "Sentiment": "neutral",
            "PublishDate": 1755064317780,
            "Source": "earnings"
        },
        {
            "Title": "LINC Targets Growth Through Premium Products and Global Expansion Strategy",
            "Summary": "LINC is pursuing a growth strategy centered on premium products, with its Pentonic division achieving 44% profit margins. The company's expansion plans include new joint ventures and global market penetration, focusing on increased exports and new product launches. LINC maintains low net debt levels as part of its value creation strategy.",
            "Sentiment": "positive",
            "PublishDate": 1754579108746,
            "Source": "stock"
        },
        {
            "Title": "Linc Limited Reports 5.1% Revenue Growth But 16.4% Decline in Net Profit for Q1 FY26",
            "Summary": "Linc Limited announced its Q1 FY26 results with total income rising 5.1% year-on-year to Rs 13,819 lakhs, while net profit declined 16.4% to Rs 705 lakhs. EBITDA fell 7.9% to Rs 1,435 lakhs with margin contracting to 10.4% from 11.9% in the previous year. The company attributed the profit decline to operational factors and transitional costs. Managing Director Deepak Jalan described it as an isolated quarter and expressed confidence in improved performance ahead. The company highlighted progress in new products including SWYPE marker range and Pentonic mechanical pencil. Joint venture with Mitsubishi Pencil Co. is expected to commence operations by October 2025, delayed by 3-4 months from original plan. The JV with Morris is linked to a new manufacturing facility in Bengal expected to be operational in Q4 FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1754492121015,
            "Source": "earnings"
        },
        {
            "Title": "LINC Reports Decline in Q1 Profitability Despite Stable Revenue",
            "Summary": "LINC reported quarterly EBITDA of 127 million rupees, down from 140 million rupees in the same period last year. The company's EBITDA margin compressed to 9.48% from 10.97% year-over-year. Net profit fell to 73 million rupees compared to 84 million rupees in the previous year. Revenue remained flat at 1.3 billion rupees, unchanged from the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1754490778869,
            "Source": "earnings"
        },
        {
            "Title": "LINC LIMITED Schedules Board Meeting to Approve Quarterly Financial Results",
            "Summary": "LINC LIMITED has scheduled a Board of Directors meeting for August 6, 2025, to consider and approve the unaudited financial results (standalone and consolidated) for the quarter ended June 30, 2025. The company has informed the Calcutta Stock Exchange, National Stock Exchange of India, and BSE Limited about this board meeting through a formal intimation signed by Company Secretary Dipankar De.",
            "Sentiment": "neutral",
            "PublishDate": 1753770853976,
            "Source": "corporate_action"
        },
        {
            "Title": "Linc Limited Shareholders Approve Key Board Appointments and Salary Increase Through Postal Ballot",
            "Summary": "Linc Limited shareholders approved six resolutions through a postal ballot process concluded on July 27, 2025. The company appointed Dr. Mamta Binani as Non-Executive Independent Director and re-appointed three existing directors: Deepak Jalan as Managing Director, Aloke Jalan as Whole Time Director, and Rohit Deepak Jalan as Whole Time Director for Sales & Marketing. Shareholders also approved a salary increase for Ms. Ekta Jalan, Senior Manager- Corporate & MISMAT, and material related party transactions. The voting was conducted through remote e-voting from June 28 to July 27, 2025, with 335 shareholders participating out of 20,149 total shareholders on record. All resolutions passed with requisite majority, with approval rates ranging from 98.62% to 99.94% across different resolutions. The scrutinizer's report was submitted by practicing company secretary Dhruba Charan Sahoo.",
            "Sentiment": "positive",
            "PublishDate": 1753704392565,
            "Source": "corporate_governance"
        },
        {
            "Title": "Linc Ltd Establishes Joint Venture for E-commerce",
            "Summary": "Linc Ltd has formed a joint venture company named Linc On Ecommerce Private Limited. This new entity appears to be focused on e-commerce operations, though specific details about the venture's purpose or ownership structure are not provided in the given information.",
            "Sentiment": "positive",
            "PublishDate": 1751977665000,
            "Source": "default"
        },
        {
            "Title": "LINC Reports Q4 Results and Recommends Dividend",
            "Summary": "LINC has announced its Q4 financial results and dividend recommendation. The company's Q4 revenue increased to 1.51 billion rupees from 1.38 billion rupees year-over-year. EBITDA rose to 189.3 million rupees from 165.8 million rupees, with the EBITDA margin improving to 12.53% from 11.97%. Additionally, LINC has recommended a dividend of 1.50 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746636315000,
            "Source": "result"
        },
        {
            "Title": "LINC Reports Q4 Net Profit Increase",
            "Summary": "LINC has reported a net profit of 126.6 million rupees for the fourth quarter, showing an increase from 114.5 million rupees year-over-year and 88.5 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1746636288000,
            "Source": "result"
        }
    ]
}