{
    "Symbol": "LINDEINDIA",
    "ISIN": "INE473A01011",
    "News": [
        {
            "Title": "Linde India Q3FY26 Results: Profit Surges 68% YoY",
            "Summary": "Linde India reports strong Q3FY26 performance with standalone profit rising 68% to ₹1,915.90 million. Revenue grows 15.7% YoY to ₹7,010.34 million while appointing new interim CFO.",
            "Sentiment": "positive",
            "PublishDate": 1770642637817,
            "Source": "co_actions_results"
        },
        {
            "Title": "Linde India Board Meet Set for Feb 9 to Review Q3 Results",
            "Summary": "Linde India has scheduled a board meeting on February 9, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770029928554,
            "Source": "co_actions_results"
        },
        {
            "Title": "Linde India Board Approves MD Transition on Dec 29",
            "Summary": "Linde India's board meeting on December 29, 2025, formally accepted Abhijit Banerjee's resignation as MD effective December 31, 2025, and appointed Milan Sadhukhan as new MD from January 1, 2026, subject to member approval via postal ballot.",
            "Sentiment": "neutral",
            "PublishDate": 1766994034937,
            "Source": "stocks"
        },
        {
            "Title": "Linde India Denies Link Between CFO Resignation and Securities Appeal Dismissal",
            "Summary": "Linde India has officially denied reports suggesting a connection between CFO Neeraj Kumar Jumrani's resignation and the dismissal of a securities appeal. The company clarified that media reports linking these two events are inaccurate.",
            "Sentiment": "negative",
            "PublishDate": 1765248478544,
            "Source": "corporate_governance"
        },
        {
            "Title": "Linde India CFO Neeraj Kumar Jumrani Resigns to Pursue Other Career Options",
            "Summary": "Neeraj Kumar Jumrani has resigned from his position as Chief Financial Officer and Key Managerial Personnel of Linde India Limited, with his resignation effective close of business hours on 15 February 2026. The resignation is attributed to pursuing other career opportunities, and he will also cease to be the authorized Key Managerial Personnel for determining materiality of events and making disclosures to stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1764940202604,
            "Source": "corporate_governance"
        },
        {
            "Title": "Linde India Reports 62% Jump in Quarterly Profit to Rs 1,690 Million",
            "Summary": "Linde India's Board approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported a standalone profit of Rs 1,690.12 million for the quarter, compared to Rs 1,043.86 million in the same period last year. Revenue from operations reached Rs 6,441.93 million versus Rs 6,344.15 million in the previous year quarter. For the six-month period, profit increased to Rs 2,740.85 million from Rs 2,159.23 million year-on-year. The company operates in two segments: Gases and Related Products Services, and Project Engineering. Earnings per share for the quarter stood at Rs 19.82 compared to Rs 12.24 in the corresponding quarter last year. The results include ongoing regulatory proceedings with SEBI regarding related party transactions and business allocation arrangements with Praxair India Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1762430694709,
            "Source": "earnings"
        },
        {
            "Title": "Linde India Clarifies Rs. 82 Crore Khordha Investment Remains Under Discussion",
            "Summary": "Linde India has issued a clarification regarding rumors about a Rs. 82 crore investment in Khordha, Odisha. The company stated that the investment is still under discussion and has not been finalized.",
            "Sentiment": "neutral",
            "PublishDate": 1758360621058,
            "Source": "stock"
        },
        {
            "Title": "Linde India Starts Commercial Production at New Gas Facility in Unnao, Lucknow",
            "Summary": "Linde India Limited has commenced commercial production at its new gas facility in Unnao, Lucknow. The facility is designed to enhance storage, handling, and distribution of bulk industrial and medical gases for critical hospital operations and industrial applications. The company has maintained a presence in Uttar Pradesh for over two decades, supplying medical gases to major government and private hospitals throughout the state.",
            "Sentiment": "positive",
            "PublishDate": 1757922202450,
            "Source": "stock"
        },
        {
            "Title": "Linde India Exits FP Solar Shakti with Rs 4.79 Crore Stake Transfer",
            "Summary": "Linde India Limited has transferred its entire 18.29% stake in FP Solar Shakti Private Limited to Fourth Partner Energy Private Limited for Rs 4.79 crore. The transfer involved 16,50,465 equity shares and occurred following the termination of the Power Purchase Agreement and Share Subscription and Shareholders' Agreement. The company had originally invested the same amount in FP Solar Shakti in March 2023.",
            "Sentiment": "neutral",
            "PublishDate": 1757481674207,
            "Source": "stock"
        },
        {
            "Title": "Linde India Reports Mixed Q1 Results with Higher EBITDA Margin Despite Revenue Decline",
            "Summary": "Linde India announced its Q1 financial results showing EBITDA of 1.97 billion rupees compared to 1.84 billion rupees in the previous year. The company's EBITDA margin improved significantly to 34.5% from 28.2% year-over-year. However, consolidated net profit declined to 1.07 billion rupees from 1.14 billion rupees, while revenue dropped to 5.71 billion rupees from 6.53 billion rupees compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1754566849119,
            "Source": "earnings"
        },
        {
            "Title": "Linde India: Bullish Reversal Signals 14% Potential Upside",
            "Summary": "Linde India's stock shows signs of a bullish reversal, breaking above its 200-day EMA at ₹6,600. Technical analysis suggests a potential upside to ₹8,600. The stock closed 7% higher at ₹7,540 on Monday, with a 17% rise in the last month.",
            "Sentiment": "positive",
            "PublishDate": 1748314504000,
            "Source": "normal_news"
        },
        {
            "Title": "Linde India Reports Q4 Results and Recommends Dividend",
            "Summary": "Linde India has announced its Q4 financial results and dividend recommendation. The company's Q4 EBITDA increased to 2.1 billion rupees from 1.8 billion rupees year-over-year, with EBITDA margin improving to 35.46% from 28.5%. Consolidated net profit for Q4 rose to 1.2 billion rupees from 1.05 billion rupees year-over-year and 1.16 billion rupees quarter-over-quarter. However, Q4 revenue decreased to 5.9 billion rupees from 6.3 billion rupees year-over-year. The company has recommended a dividend of 12 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748003549000,
            "Source": "result"
        },
        {
            "Title": "Linde India to Invest 4.25 Billion Rupees in Odisha Air Separation Unit",
            "Summary": "Linde India has announced plans to invest 4.25 billion rupees in establishing an air separation unit in Odisha. The new facility will have an annual production capacity of over 1.2 million metric tons. This investment decision has been made in collaboration with the Odisha State Government.",
            "Sentiment": "positive",
            "PublishDate": 1746403523000,
            "Source": "default"
        },
        {
            "Title": "Linde India to Invest 4.25 Billion Rupees in Odisha Air Separation Unit",
            "Summary": "Linde India has announced plans to invest 4.25 billion rupees in establishing an air separation unit in Odisha. The new facility will have an annual production capacity of over 1.2 million metric tons. This investment decision was shared by the Odisha state government, indicating a significant industrial development for the region.",
            "Sentiment": "positive",
            "PublishDate": 1746192402000,
            "Source": "default"
        },
        {
            "Title": "Linde India to Install Third Air Separation Unit for Asian Paints",
            "Summary": "Linde India has entered into a long-term contract with Asian Paints. As part of this agreement, Linde India plans to install its third Air Separation Unit (ASU) at Dahej. The new unit will have a capacity of 245 TPD (tons per day) of liquid and 100 TPD of gaseous oxygen.",
            "Sentiment": "positive",
            "PublishDate": 1741853712000,
            "Source": "corporate_action"
        },
        {
            "Title": "Linde India: Share Price Surges 9% Amid Volatile Market",
            "Summary": "Linde India's stock opened at ₹5,889 and reached an intraday high of ₹6,500 on NSE, showing a 9% increase. Analysts suggest the stock has bottomed out at ₹5,350-₹5,400 and predict it may reach ₹7,160 in the near term. A 'buy-on-dips' strategy is recommended with a stop loss at ₹5,900.",
            "Sentiment": "positive",
            "PublishDate": 1740029787000,
            "Source": "normal_news"
        },
        {
            "Title": "Linde India Reports Improved Q3 EBITDA and Margin",
            "Summary": "Linde India has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.9 billion rupees, up from 1.86 billion rupees in the same quarter last year. Additionally, Linde India's EBITDA margin improved significantly, rising to 31.72% from 26.35% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738930345000,
            "Source": "earnings"
        },
        {
            "Title": "Linde India Reports Q3 Financial Results",
            "Summary": "Linde India has announced its Q3 consolidated financial results. The company reported a net profit of 1.16 billion rupees, slightly down from 1.2 billion rupees year-over-year and up from 1.1 billion rupees quarter-over-quarter. Revenue for Q3 stood at 6.05 billion rupees, a decrease from 7.06 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738930190000,
            "Source": "earnings"
        },
        {
            "Title": "Linde India: Top Consistent Wealth Creator with 68% CAGR",
            "Summary": "Motilal Oswal's 29th Annual Wealth Creation Study names Linde India as the Most Consistent Wealth Creator for 2019-2024, with a 68% price CAGR. The company consistently outperformed the Nifty Total Return Index over the five-year period.",
            "Sentiment": "positive",
            "PublishDate": 1733835210000,
            "Source": "normal_news"
        },
        {
            "Title": "Linde India Reports Q2 EBITDA Growth and Margin Improvement",
            "Summary": "Linde India has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.78 billion rupees, up from 1.74 billion rupees in the same quarter last year. Additionally, the EBITDA margin improved to 28.17% from 24.42% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730971488000,
            "Source": "result"
        },
        {
            "Title": "Linde India Reports Q2 Revenue Decline",
            "Summary": "Linde India has reported a revenue of 6.3 billion rupees for the second quarter, down from 7.11 billion rupees in the same quarter last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1730971422000,
            "Source": "result"
        },
        {
            "Title": "Linde India Reports Q2 Net Profit of 1.06 Billion Rupees",
            "Summary": "Linde India has announced its financial results for the second quarter. The company reported a consolidated net profit of 1.06 billion rupees, which is slightly lower compared to 1.09 billion rupees in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1730971398000,
            "Source": "result"
        },
        {
            "Title": "Linde India to Supply Cryogenic Gases in Northern India",
            "Summary": "<p><span class=\"positive\">Linde India</span> has announced that it will be <span class=\"positive\">supplying cryogenic gases</span> to a <b>diverse range</b> of customers and industries across <span class=\"neutral\">Northern India</span>. This move indicates an <span class=\"positive\">expansion</span> of the company's operations and potential <span class=\"positive\">growth</span> in its customer base in the region.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728025597000,
            "Source": "corporate_action"
        },
        {
            "Title": "Linde India Starts New Air Separation Unit in Ludhiana",
            "Summary": "<p>Linde India has <span class='positive'>commenced</span> commercial production at its <span class='positive'>new</span> air separation unit in <b>Ludhiana, Punjab</b>. The facility has a <span class='positive'>capacity</span> of <b>250 metric tonnes per day</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728025529000,
            "Source": "corporate_action"
        }
    ]
}