{
    "Symbol": "LLOYDSME",
    "ISIN": "INE281B01032",
    "News": [
        {
            "Title": "Lloyds Metals clarifies volume surge as market-driven",
            "Summary": "Lloyds Metals and Energy Limited responds to BSE inquiry about increased trading volume, stating no pending material information and attributing movement to market conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1770903243477,
            "Source": "stocks"
        },
        {
            "Title": "Lloyds Metals Q3FY26 Results & Major Expansions",
            "Summary": "Lloyds Metals reports strong Q3FY26 performance with ₹888.55 crore net profit. Board approves major expansions including ₹8000 crore slurry pipeline project and pellet plant capacity increases.",
            "Sentiment": "positive",
            "PublishDate": 1770135214999,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Metals Acquires 95% Stake in Singapore Unit",
            "Summary": "Lloyds Metals and Energy board approves acquisition of up to 95% stake in Singapore-based Lloyds Asia Resources for USD 5 million to establish regional mining investment hub.",
            "Sentiment": "positive",
            "PublishDate": 1770134909939,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Metals Expands Konsari Pellet Plant Capacity",
            "Summary": "Lloyds Metals & Energy board approves expansion of Konsari pellet plants, increasing capacity from 4 MTPA to 5 MTPA each to strengthen steel value chain operations.",
            "Sentiment": "positive",
            "PublishDate": 1770134880030,
            "Source": "stocks"
        },
        {
            "Title": "Lloyds Metals Creates ₹252 Cr Maharashtra Subsidiary",
            "Summary": "Lloyds Metals and Energy announces formation of fully-owned subsidiary in Maharashtra with ₹252 crore investment focused on skills development, leadership training, and job-linked programs.",
            "Sentiment": "positive",
            "PublishDate": 1770134520312,
            "Source": "stocks"
        },
        {
            "Title": "Crosslink pledges 26 lakh shares of Lloyds Metals",
            "Summary": "Crosslink Food and Farms pledged additional 26,02,665 equity shares of Lloyds Metals and Energy to three lenders on January 23, 2026, following decline in market price of pledged securities.",
            "Sentiment": "neutral",
            "PublishDate": 1769775649717,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Metals Board Meet Set for Feb 3, 2026",
            "Summary": "Lloyds Metals and Energy Limited has scheduled a board meeting on February 03, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769694082162,
            "Source": "co_actions_results"
        },
        {
            "Title": "Thriveni Pledges Lloyds Metals Shares Worth ₹5.4L",
            "Summary": "Thriveni Earthmovers pledged 5,40,720 equity shares (0.10%) of Lloyds Metals and Energy to Aditya Birla Capital as security for Sky United LLP's term loan, effective January 23, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769683246213,
            "Source": "co_actions_results"
        },
        {
            "Title": "Thriveni Earthmovers pledges shares in Lloyds Metals",
            "Summary": "Thriveni Earthmovers Private Limited has pledged 5,40,720 equity shares (0.10% stake) in Lloyds Metals and Energy Limited to Bajaj Finance Limited as security for a term loan availed by Sky United LLP.",
            "Sentiment": "neutral",
            "PublishDate": 1769683098593,
            "Source": "co_actions_results"
        },
        {
            "Title": "Thriveni Earthmovers releases pledge on Lloyds shares",
            "Summary": "Thriveni Earthmovers Private Limited released pledge on 18,92,572 equity shares (0.35%) of Lloyds Metals and Energy Limited in favour of STCI Finance Limited effective January 20, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769613169469,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Metals Acquires 12.12% Stake in Hexa Energy W2",
            "Summary": "Lloyds Metals and Energy Limited acquired 12.12% equity stake in Hexa Energy W2 Private Limited for ₹4.16 crores, increasing total holding to 29.23% of the company's paid-up equity share capital.",
            "Sentiment": "positive",
            "PublishDate": 1769004302377,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Metals Acquires 50% Stake in Congo Copper Assets",
            "Summary": "Lloyds Global Resources, subsidiary of Lloyds Metals & Energy, finalizes $90.8 million acquisition of 50% stake in Nexus Holdco FZCO, expanding copper mining operations in DR Congo.",
            "Sentiment": "positive",
            "PublishDate": 1768575221784,
            "Source": "co_actions_results"
        },
        {
            "Title": "Crosslink Food Pledges 1.2% Stake in Lloyds Metals",
            "Summary": "Crosslink Food and Farms Private Limited pledged 63,62,744 equity shares (1.2% stake) in Lloyds Metals and Energy Limited to three lenders as security for term loan availed by Lloyds Enterprises Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1767350480492,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Metals Reports 50% Jump in Iron Ore Output",
            "Summary": "Lloyds Metals and Energy achieves remarkable operational growth with iron ore production rising 50% to 12.9 million tonnes, while DRI production increases 22% to 291,000 tonnes and pellet plant utilization exceeds 95%.",
            "Sentiment": "positive",
            "PublishDate": 1767260091448,
            "Source": "stocks"
        },
        {
            "Title": "Lloyds Metals Board Approves Major ESOP Allotment & Warrant Conversion",
            "Summary": "Lloyds Metals board approved allotment of 5.88 lakh equity shares under ESOP 2017, conversion of 1.53 crore warrants into equity shares worth ₹734.44 crores, and granted 1.60 lakh new stock options under ESOP 2024.",
            "Sentiment": "positive",
            "PublishDate": 1765385299947,
            "Source": "stocks"
        },
        {
            "Title": "Lloyds Metals Grants 1.05 Lakh Stock Options",
            "Summary": "Lloyds Metals and Energy Limited's Board approves grant of 1,05,000 employee stock options under ESOP-2017 plan with exercise price of ₹4 per option and minimum one-year vesting period.",
            "Sentiment": "positive",
            "PublishDate": 1765385190190,
            "Source": "stocks"
        },
        {
            "Title": "Lloyds Metals Completes USD 90.8M Congo Mining Deal",
            "Summary": "Lloyds Metals subsidiary LGRF completes acquisition of 50% stake in Nexus Holdco FZCO for USD 90.8 million, securing copper mining assets in Democratic Republic of Congo through signed agreement.",
            "Sentiment": "positive",
            "PublishDate": 1765377679785,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Metals Reports Record Q2FY26 Results with 75% Revenue Growth and Successful Pellet Plant Ramp-Up",
            "Summary": "Lloyds Metals achieved highest-ever quarterly revenue of INR 25,754 million (up 75% year-on-year) and EBITDA of INR 8,693 million (up 95% year-on-year) driven by higher iron ore dispatches, pellet sales commencement, and slurry pipeline efficiency. The company successfully ramped up its 4 million ton pellet plant to full capacity within 4 months, commissioned DRI expansion, and consolidated Thriveni operations, positioning for sustained growth in H2FY26.",
            "Sentiment": "positive",
            "PublishDate": 1763466024020,
            "Source": "earnings"
        },
        {
            "Title": "Thriveni Earthmovers Releases Pledge on 22 Lakh Shares of Lloyds Metals and Energy",
            "Summary": "Thriveni Earthmovers Private Limited, a promoter of Lloyds Metals and Energy Limited, released a pledge on 22,00,000 equity shares (0.42% of paid-up share capital) in favor of YES Bank Limited with effect from November 4, 2025. The pledge release was made under an Unattested Pledge Agreement dated March 27, 2025, between Thriveni Earthmovers as borrower and YES Bank as lender.",
            "Sentiment": "neutral",
            "PublishDate": 1763096124643,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Metals and Energy Grants Employee Stock Options and Reports Fund Utilization Progress",
            "Summary": "Lloyds Metals and Energy Limited's Nomination and Remuneration Committee approved the grant of 7,13,261 employee stock options under the ESOP-2024 scheme and 77,700 options under the ESOP-2017 plan. The company also allotted 96,580 equity shares to Lloyds Employees Welfare Trust at Rs. 4 per share, increasing the paid-up share capital to Rs. 52,85,02,270. The monitoring agency report for the quarter ended September 30, 2025, shows progress on fund utilization from QIP and preferential issue proceeds. For the 4 MTPA pellet plant at Konsari, Rs. 895.75 crores has been utilized out of Rs. 916.13 crores allocated, with Rs. 20.38 crores remaining unutilized. The DRI plant expansion at Ghugus has utilized Rs. 341.98 crores out of Rs. 714.74 crores allocated. The pellet capacity expansion project has utilized Rs. 427.66 crores out of Rs. 1,327.38 crores allocated. No deviations from stated objectives were reported by the monitoring agency.",
            "Sentiment": "neutral",
            "PublishDate": 1762994022228,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Metals and Energy Reports Strong Q2 Performance with Strategic Investments and Land Acquisition",
            "Summary": "Lloyds Metals and Energy Limited announced its quarterly results for the period ended September 30, 2025, during a board meeting held on November 12, 2025. The company approved several strategic initiatives including a 20% equity stake acquisition in LT Gondwana Skill Hub Private Limited for Rs. 25,000, aimed at promoting skill development and employment generation for the tribal community of Gadchiroli. The board also approved the purchase of approximately 290 acres of land in Gadchiroli District, Maharashtra, for up to Rs. 60 crores for future expansion and business purposes. Additionally, the company amended its Policy of Materiality of Events, authorizing key officials including the Managing Director, Chief Financial Officer, and Company Secretary to determine materiality of events and make timely disclosures. The financial results show the company operates in two main segments: Mining of Iron Ore and Steel and related value-added products. The statutory auditors conducted a limited review of the financial results and issued an unqualified report.",
            "Sentiment": "positive",
            "PublishDate": 1762988741561,
            "Source": "earnings"
        },
        {
            "Title": "Lloyds Metals Reports 75% Jump in Quarterly Revenue to INR 25,754 Million",
            "Summary": "Lloyds Metals and Energy Limited reported total income of INR 25,754 million for the quarter, marking a 75% year-over-year increase. The company achieved its highest ever quarterly income with EBITDA margins at 33.75%, up 349 basis points year-over-year. Iron ore production reached 3.42 million tonnes while sales volumes stood at 2.5 million tonnes, showing 77% and 10% growth respectively. The company commenced pellet sales with production of 0.78 million tonnes and started DRI expansion operations. Enhanced environmental clearance limits and the slurry pipeline enabled higher iron ore evacuation and dispatch. Pellet realisation per tonne was INR 9,916 with EBITDA per tonne at INR 5,039. The company incurred capex of INR 24,117 million during the half-year period. Lloyds also completed strategic acquisitions, taking a 19.40% stake in Mandovi River Pellets Private Limited for INR 165 million and acquiring 49.99% of Balasore River Pellets Limited. The consolidated entity Thriveni Earthmovers reported total income of INR 32,844 million for the half-year with EBITDA margins of 16.25%.",
            "Sentiment": "positive",
            "PublishDate": 1762979749082,
            "Source": "earnings"
        },
        {
            "Title": "Lloyds Metals And Energy Secures Land Acquisition Approval and Strategic Stake Purchase",
            "Summary": "Lloyds Metals And Energy received approval to purchase approximately 290 acres of land in Gadchiroli, Maharashtra, and to acquire a 20% stake in LT Gondwana Skill Hub Private Limited. The company is pursuing long-term growth through iron-ore mining expansion and steel value-chain integration. Lloyds has capital expenditure plans for pellet and sponge iron plants, aims to leverage rising domestic steel demand, and targets higher capacity utilization along with renewable power integration to strengthen profit margins.",
            "Sentiment": "positive",
            "PublishDate": 1762960463226,
            "Source": "stock"
        },
        {
            "Title": "Lloyds Metals and Energy Reports 89% Jump in Q2 Net Profit to 5.67 Billion Rupees",
            "Summary": "Lloyds Metals and Energy reported strong quarterly results with net profit rising to 5.67 billion rupees compared to 3 billion rupees in the same period last year. Revenue more than doubled to 35.4 billion rupees from 13.6 billion rupees year-over-year. EBITDA increased significantly to 10.43 billion rupees from 4.11 billion rupees previously. However, EBITDA margin declined slightly to 29.46% from 30.19% in the comparable period.",
            "Sentiment": "positive",
            "PublishDate": 1762953448657,
            "Source": "earnings"
        },
        {
            "Title": "Lloyds Metals and Energy Schedules Q2FY26 Earnings Conference Call for November 13, 2025",
            "Summary": "Lloyds Metals and Energy Limited has announced an earnings conference call for investors and analysts scheduled for Thursday, November 13, 2025, at 4:00 PM IST. The call will discuss the company's unaudited financial results for the quarter and half year ended September 30, 2025. The session will begin with a management discussion followed by an interactive Q&A session. Key management participants include Managing Director Rajesh Gupta, Chief Financial Officer Riyaz Shaikh, and Chief Investment Officer Chintan Mehta. Equirus Securities is hosting the conference call, with multiple dial-in numbers provided for domestic and international participants across Hong Kong, Singapore, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1762523335469,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Metals Allots 19.57 Lakh Shares to Acquire 49% Stake in Thriveni Pellets",
            "Summary": "Lloyds Metals and Energy Limited has allotted 19,57,458 equity shares at Rs. 1,460.50 per share on a preferential basis to Adler Industrial Services Private Limited, valued at Rs. 285.89 crore. The allotment was made in exchange for acquiring a 49% stake in Thriveni Pellets Private Limited (TPPL) from Adler Industrial Services, along with an additional 0.99% stake from Thriveni Earthmovers Private Limited. The company's paid-up equity capital increased from Rs. 52.64 crore to Rs. 52.84 crore following the allotment. Adler Industrial Services' shareholding in Lloyds Metals increased from 0.31% to 0.68% post-allotment. The transaction received in-principle approval from both BSE and NSE, and the company will apply for listing and trading approval for the newly allotted shares.",
            "Sentiment": "positive",
            "PublishDate": 1761053187699,
            "Source": "corporate_action"
        },
        {
            "Title": "CCI Approves Lloyds Metals' 49.99% Acquisition of Thriveni Pellets",
            "Summary": "The Competition Commission of India has approved Lloyds Metals' acquisition of a 49.99% stake in Thriveni Pellets. This regulatory approval allows the transaction to proceed, giving Lloyds Metals significant ownership in the pellets company.",
            "Sentiment": "positive",
            "PublishDate": 1759841505484,
            "Source": "order&deals"
        },
        {
            "Title": "Lloyds Metals & Energy Reports Strong Production Growth with Iron Ore Output Up 24%",
            "Summary": "Lloyds Metals & Energy reported iron ore production of 7.4 million tonnes, marking a 24% increase year-over-year. The company also achieved pellet production of 0.81 million tonnes, representing 79% utilization of its annual capacity.",
            "Sentiment": "positive",
            "PublishDate": 1759312533574,
            "Source": "stock"
        },
        {
            "Title": "Lloyds Metals and Energy Incorporates Wholly-Owned Subsidiary in Dubai",
            "Summary": "Lloyds Metals and Energy Limited has incorporated a wholly-owned subsidiary named Lloyds Global Resources FZCO in Dubai on September 25, 2025. The subsidiary was incorporated pursuant to an order from the Registrar of Companies of the Dubai Multi Commodities Centre Authority. The company received intimation of the incorporation on the same date and has informed the stock exchanges where it is listed under BSE scrip code 512455 and NSE symbol LLOYDSME.",
            "Sentiment": "positive",
            "PublishDate": 1758867550861,
            "Source": "stock"
        },
        {
            "Title": "Lloyds Metals and Energy Completes 19.40% Stake Acquisition in Mandovi River Pellets",
            "Summary": "Lloyds Metals and Energy Limited has completed its acquisition of a 19.40% equity stake in Mandovi River Pellets Private Limited. The company received 1,64,90,000 equity shares in its demat account on September 12, 2025, for a total consideration of Rs. 16.49 crore. This acquisition represents 19.40% of MRPPL's total issued, subscribed and paid-up equity share capital, following earlier disclosures made in August 2025 regarding the planned acquisition and subscription.",
            "Sentiment": "positive",
            "PublishDate": 1757684063223,
            "Source": "order&deals"
        },
        {
            "Title": "Lloyds Metals and Energy Limited Passes All 11 Resolutions at Extraordinary General Meeting",
            "Summary": "Lloyds Metals and Energy Limited held an Extraordinary General Meeting on September 11, 2025, through video conferencing where all 11 proposed resolutions were passed with requisite majority. Key approvals included appointment of two new independent directors - Mr. Sujit Kumar Varma and Dr. Anita Shantaram, change in designation of Mr. Shabbirhusein Shaikhadam Khandwala from independent to non-independent director, and authorization for loans and guarantees under Section 186 of Companies Act 2013. The company also secured approval for overall borrowing limits, creation of mortgage or charge on assets, and issuance of 19,57,458 equity shares on preferential basis for acquiring stake in Thriveni Pellets Private Limited through share swap. Additionally, shareholders approved material related party transactions with Thriveni Pellets Private Limited, Thriveni Earth Movers and Infra Private Limited, Brahmani River Pellets Limited, and a proposed subsidiary in Dubai. The meeting had 122,171 shareholders on record date with 58 shareholders attending through video conferencing. Remote e-voting was available from September 8-10, 2025, with scrutinizer Mitesh Shah & Co. overseeing the voting process.",
            "Sentiment": "positive",
            "PublishDate": 1757679067332,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Metals & Energy Wins Tandsi-III Coking Coal Mines Bid at 10.5% Premium",
            "Summary": "Lloyds Metals & Energy emerged as the successful bidder for Tandsi-III and Tandsi-III Extension coking coal mines, securing the block at a 10.5% premium. The mines contain 23 million metric tons (MMT) of reserves and are located on the Madhya Pradesh-Maharashtra border. The company plans to develop a production capacity of 0.30 million tons per annum (MTPA) over a 4-year development period.",
            "Sentiment": "positive",
            "PublishDate": 1755600005387,
            "Source": "stock"
        },
        {
            "Title": "Lloyd Metal and Energy Reports Strong Q1 FY26 Results with 99% Sequential Revenue Growth",
            "Summary": "Lloyd Metal and Energy Limited reported total income of INR 24,084 million for Q1 FY26, remaining flat year-on-year but showing 99% sequential growth. EBITDA increased 12% year-on-year to INR 8,087 million with margins expanding to 33.6%. Profit after tax grew 14% year-on-year to INR 6,346 million. The company successfully commissioned a 4 million ton pellet plant and pipeline at Konsari, received environmental clearance to expand mining capacity from 10 million tons to 55 million tons per annum, and completed acquisition of remaining MDO operations. Iron ore sales volume reached 3.45 million tons with average realization of INR 6,061 per ton. The company made strategic investments in two pellet plants - Mandovi River Pellets Private Limited (19.4% stake) and Brahmani River Pellets Limited (49% stake). Management expects to achieve 22 million tons iron ore production guidance for FY26 and projects pellet capacity to reach 13.5 million tons next year from current 9.5 million tons.",
            "Sentiment": "positive",
            "PublishDate": 1755524066912,
            "Source": "earnings"
        },
        {
            "Title": "Lloyds Metals Plans Expansion Through New Steel Plants and Iron Ore Mine Development",
            "Summary": "Lloyds Metals is targeting significant growth through new steel plant projects and expansion of iron ore mining operations. The company expects its strong financial position, low operational costs, and improved product quality to drive higher revenue and profits in the coming years.",
            "Sentiment": "positive",
            "PublishDate": 1755019574368,
            "Source": "stock"
        },
        {
            "Title": "Lloyds Metals and Energy Reports Higher Q1 Net Profit Despite Revenue Decline",
            "Summary": "Lloyds Metals and Energy reported Q1 net profit of 6.34 billion rupees, up from 5.57 billion rupees in the same period last year. However, revenue declined to 23.8 billion rupees from 24.2 billion rupees year-over-year. The company's EBITDA increased to 7.8 billion rupees from 7.2 billion rupees, while EBITDA margin improved to 32.81% from 29.73% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755016034471,
            "Source": "earnings"
        },
        {
            "Title": "Lloyds Metals Approves Major Acquisitions Worth ₹495 Crores and Board Restructuring",
            "Summary": "Lloyds Metals and Energy Limited's board approved multiple strategic initiatives including acquisition of 49.99% stake in Thriveni Pellets Private Limited for ₹495.70 crores through cash and share swap, 19.40% stake in Mandovi River Pellets Private Limited for ₹16.49 crores, and incorporation of a wholly owned subsidiary in Dubai with AED 250 million investment. The company also approved public issuance of Non-Convertible Debentures up to ₹2,500 crores, converted 31 lakh warrants into equity shares raising ₹149.11 crores, and appointed two new independent directors while restructuring senior management personnel. An Extraordinary General Meeting is scheduled for September 11, 2025, with record date of August 15, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755015801428,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Metals and Energy Revises Dates for Upcoming Investor Conferences in Mumbai",
            "Summary": "Lloyds Metals and Energy Limited issued a revised intimation correcting dates for scheduled investor and analyst meetings. The company will participate in two events in Mumbai: the JM Financial Promoter Conference on August 18, 2025, and the Equirus Annual India Conference 2025 on August 20, 2025. Both conferences will be conducted physically as group meetings. The company noted that meeting dates are subject to change due to exigencies and confirmed that no unpublished price sensitive information will be shared during these events.",
            "Sentiment": "neutral",
            "PublishDate": 1754918341926,
            "Source": "stock"
        },
        {
            "Title": "Lloyds Metals and Energy Receives AA Credit Ratings from India Ratings and Crisil for Rs 6,000 Crore Debt Instruments",
            "Summary": "Lloyds Metals and Energy Limited has received credit ratings from two agencies for various financial instruments totaling Rs 6,000 crore. India Ratings assigned IND AA/Stable ratings to the company's issuer rating (affirmed), proposed bonds worth Rs 2,500 crore, and term loans worth Rs 1,000 crore. Crisil Ratings assigned CRISIL AA/Stable ratings to non-convertible debentures worth Rs 2,500 crore and bank loan facilities worth Rs 1,000 crore. The term loans are from ICICI Bank (Rs 750 crore) and Axis Bank (Rs 250 crore), with one term loan maturing on February 10, 2027. Both rating agencies describe the AA rating as indicating high degree of safety regarding timely servicing of financial obligations with very low credit risk.",
            "Sentiment": "positive",
            "PublishDate": 1753172581025,
            "Source": "stock"
        },
        {
            "Title": "Lloyds Metals & Energy Ltd: Acquires 80% Stake in Thriveni Earthmovers for Rs 70 Crore",
            "Summary": "Lloyds Metals & Energy Ltd has acquired a 79.82% stake in Thriveni Earthmovers and Infra Pvt., a mining contractor, for Rs 70 crore. The acquisition is expected to reduce iron ore mining costs, enhance cost efficiency, and boost LMEL's consolidated financials. The deal was approved by the Competition Commission of India in May.",
            "Sentiment": "positive",
            "PublishDate": 1751440274000,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Metals & Energy Ltd: Environmental Clearance Boosts Iron Ore Mining Capacity",
            "Summary": "Lloyds Metals & Energy Ltd received environmental clearance to expand iron ore mining capacity to 55 MTPA, potentially becoming India's largest iron ore operator. The company plans to mine 26 MTPA of hematite initially, later ramping up to 55 MTPA including banded hematite quartzite. A beneficiation facility is being established in Hedri, with a pilot plant already operational.",
            "Sentiment": "positive",
            "PublishDate": 1750917722000,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Metals & Energy Receives Approval to Increase Iron Ore Mining Capacity",
            "Summary": "Lloyds Metals & Energy has received approval to increase its iron ore mining capacity to 55 MTPA (Million Tonnes Per Annum). The company aims to establish what it claims will be India's largest iron ore mine.",
            "Sentiment": "positive",
            "PublishDate": 1750901019000,
            "Source": "default"
        },
        {
            "Title": "Lloyds Metals And Energy: Q4 Profit and Revenue Decline",
            "Summary": "Lloyds Metals And Energy Ltd. reported a 27% drop in Q4 FY25 consolidated net profit to Rs 202 crore, with revenue falling 24% to Rs 1,183 crore. EBITDA decreased 44% and margin contracted to 21.2%. The company declared a final dividend of Rs 1 per share and approved fundraising up to Rs 5,000 crore.",
            "Sentiment": "negative",
            "PublishDate": 1745820601000,
            "Source": "earnings"
        },
        {
            "Title": "Lloyds Metals and Energy Ltd: Q4 Profit Drops 27%, Plans ₹5,000 Crore Fundraise",
            "Summary": "Lloyds Metals reported a 27% YoY decline in Q4 net profit to ₹202 crore. Revenue fell 23.2% to ₹1,193 crore. EBITDA margin narrowed to 21.9%. The company proposed a final dividend of ₹1 per share and seeks approval to raise up to ₹5,000 crore through various instruments.",
            "Sentiment": "negative",
            "PublishDate": 1745591937000,
            "Source": "earnings"
        },
        {
            "Title": "Lloyds Metals and Energy Ltd: Environmental Clearance Secured for Major Projects in Maharashtra",
            "Summary": "Lloyds Metals and Energy Ltd received environmental clearance from the Ministry of Environment, Forest, and Climate Change for a 1.2 MTPA wire rod project and a 4 MTPA pellet plant project in Ghugus, Chandrapur, Maharashtra on March 20, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1742479192000,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Metals And Energy Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 227,452 shares of Lloyds Metals And Energy Ltd. was executed on the National Stock Exchange (NSE) at a price of Rs. 1079.30 per share. The total value of the transaction amounted to Rs. 24.55 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1741250941000,
            "Source": "block_deals"
        },
        {
            "Title": "Lloyds Metals & Energy: Penny Stock Skyrockets 7,864% in Five Years",
            "Summary": "Lloyds Metals & Energy Ltd's stock price has surged from ₹4.60 to ₹1180 in five years, turning a ₹1 lakh investment into ₹2.56 crore. The company reported a 17% YoY increase in net profits for Q3FY25, despite a 12.4% decline in operational revenues. It achieved record iron ore production of 8.6 million tonnes in 9MFY25, up 5% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1740040387000,
            "Source": "normal_news"
        },
        {
            "Title": "Lloyds Metals and Energy Ltd: Mid-Cap Outperformer Despite Recent Cool-Off",
            "Summary": "Lloyds Metals and Energy Ltd. has emerged as the top performer among mid-cap stocks, with shares rising 40% since September 23, 2023, following a 105% rally in 2022. However, the stock has experienced a 10% decline from its January 10, 2024 peak.",
            "Sentiment": "positive",
            "PublishDate": 1738129319000,
            "Source": "normal_news"
        },
        {
            "Title": "Lloyds Metals and Energy Ltd: Q3 Profit Rises 18% Despite Revenue Dip",
            "Summary": "Lloyds Metals and Energy Ltd reported Q3 FY25 consolidated results with net profit up 17.5% YoY to Rs 389 crore, despite a 12.4% revenue decline to Rs 1,675 crore. EBITDA increased 19.37% to Rs 536 crore, with margin expanding to 32%. Mining revenue grew 4.24%, while other segments saw declines.",
            "Sentiment": "positive",
            "PublishDate": 1738057455000,
            "Source": "earnings"
        },
        {
            "Title": "Lloyds Metals and Energy Ltd.: DAM Capital Initiates 'Buy' Rating with 33% Upside",
            "Summary": "DAM Capital initiates coverage on Lloyds Metals with a 'buy' rating and a target price of Rs 1,905, implying 32.7% upside. The company plans to expand iron ore mining capacity to 25 million tonnes by 4QFY25 and set up integrated steel facilities. Analysts project 91% CAGR in EBITDA from FY25 to FY27.",
            "Sentiment": "positive",
            "PublishDate": 1736496382000,
            "Source": "normal_news"
        },
        {
            "Title": "Lloyds Metals & Energy Limited: Stock Hits 52-Week High on Strong Operational Performance",
            "Summary": "Lloyds Metals & Energy Limited's stock reached a 52-week high of ₹1,264 on January 1, 2025. The company reported a 22% YoY increase in DRI production to 238,000 tonnes and a 5% YoY rise in iron ore production to 8.6 million tonnes for the nine months ending December 2024. December saw the highest monthly DRI production with operations near full capacity.",
            "Sentiment": "positive",
            "PublishDate": 1735724756000,
            "Source": "normal_news"
        }
    ]
}