{
    "Symbol": "LLOYDSENGG",
    "ISIN": "INE093R01011",
    "News": [
        {
            "Title": "Lloyds Engineering Works Files Rights Issue Statement",
            "Summary": "Lloyds Engineering Works Limited filed statement of deviation/variation for proceeds of Rights Issue for quarter ended December 31, 2025 under Regulation 32, showing no deviation from original fund utilization plan.",
            "Sentiment": "neutral",
            "PublishDate": 1770216578004,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Engineering Works Allots 58.80 Lakh ESOPs",
            "Summary": "Lloyds Engineering Works Limited allotted 58.80 lakh employee stock options under ESOP 2021 plan at exercise prices of ₹7.50 and ₹9.50 per option to eligible employees on February 4, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770215661184,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Engineering Works Terminates Monitoring Agency",
            "Summary": "Lloyds Engineering Works Limited received termination notice from India Ratings and Research Private Limited for monitoring agency agreement dated November 13, 2024, due to commercial disagreements.",
            "Sentiment": "neutral",
            "PublishDate": 1770213376319,
            "Source": "stocks"
        },
        {
            "Title": "Lloyds Engineering Works Issues First & Final Call",
            "Summary": "Lloyds Engineering Works Limited announces first and final call payment notice for partly paid equity shares with record date January 28, 2026, following rights issue from April 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769793822026,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Engineering Works Board Meet on Feb 4, 2026",
            "Summary": "Lloyds Engineering Works Limited has scheduled a board meeting for February 04, 2026, to consider and approve Q3FY26 financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769765537624,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Engineering Works Rights Issue Committee Meet",
            "Summary": "Lloyds Engineering Works schedules Rights Issue Committee meeting for January 21, 2026, to consider First and Final Call on partly paid-up equity shares with trading window already closed.",
            "Sentiment": "neutral",
            "PublishDate": 1768479442648,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Engineering Gets International Authorization",
            "Summary": "Lloyds Engineering Works receives authorization to deploy eco pickled surface systems internationally, expanding its global operations in environmentally sustainable surface treatment solutions.",
            "Sentiment": "positive",
            "PublishDate": 1768349986864,
            "Source": "stocks"
        },
        {
            "Title": "Lloyds Engineering Gets Global Eco System Approval",
            "Summary": "Lloyds Engineering Works receives approval to use eco pickled surface systems worldwide, marking a significant milestone in sustainable manufacturing technology adoption.",
            "Sentiment": "positive",
            "PublishDate": 1768305158032,
            "Source": "stocks"
        },
        {
            "Title": "Lloyds Engineering Works Signs Material Acquisition Deal",
            "Summary": "Lloyds Engineering Works has entered into an agreement to acquire material works operations, marking a strategic business expansion move for the engineering company.",
            "Sentiment": "positive",
            "PublishDate": 1768300440155,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Engineering Expands Global EPS Technology Rights",
            "Summary": "Lloyds Engineering Works Limited enters expanded agreement with The Material Works Limited, USA, for global deployment of Eco Pickled Surface technology, transitioning from domestic to international markets.",
            "Sentiment": "positive",
            "PublishDate": 1768299722310,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Engineering Works Signs US Tech Deal",
            "Summary": "Lloyds Engineering Works enters purchase and licensing agreement with US-based The Material Works for eco-friendly EPS Gen 4 steel technology, marking strategic expansion into sustainable steel solutions.",
            "Sentiment": "positive",
            "PublishDate": 1768176557116,
            "Source": "stocks"
        },
        {
            "Title": "Lloyds Engineering signs US tech licensing deal",
            "Summary": "Lloyds Engineering Works enters purchase agreement with Delaware-based The Material Works for EPS Generation 4 technology, enabling global operations with eco-friendly steel surface cleaning solutions.",
            "Sentiment": "positive",
            "PublishDate": 1768044877837,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Engineering Works Partners with US Firm",
            "Summary": "Lloyds Engineering Works announces strategic partnership with US-based The Material Works to develop eco-friendly EPS Gen 4 steel technology, marking expansion into sustainable steel solutions.",
            "Sentiment": "positive",
            "PublishDate": 1768041913857,
            "Source": "stocks"
        },
        {
            "Title": "Lloyds Engineering completes strategic merger",
            "Summary": "Lloyds Engineering Works successfully merges three group companies creating unified engineering solutions provider with ₹6,150 crore order book, transforming into complete design-to-execution entity.",
            "Sentiment": "positive",
            "PublishDate": 1767017978853,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Engineering Works Grants 11.55 Lakh ESOPs",
            "Summary": "Lloyds Engineering Works' NRC approved grant of 11,55,074 employee stock options to employees of associate company Lloyds Infrastructure Construction under ESOP Plan-2021.",
            "Sentiment": "positive",
            "PublishDate": 1766735313031,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Engineering Works Approves ₹59 Cr Guarantee",
            "Summary": "Lloyds Engineering Works' board approved a corporate guarantee of ₹59 crores in favor of HDFC Bank for its subsidiary Techno Industries Private Limited on December 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766735282211,
            "Source": "stocks"
        },
        {
            "Title": "Lloyds Engineering Works Completes Techno Industries Buy",
            "Summary": "Lloyds Engineering Works Limited acquires remaining 12% stake in Techno Industries for ₹22.70 crores, making it wholly-owned subsidiary through amended Share Purchase Agreement.",
            "Sentiment": "positive",
            "PublishDate": 1766734651157,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Engineering Forms Defence Subsidiary",
            "Summary": "Lloyds Engineering Works establishes subsidiary 'Lloyds Advance Defence Systems Limited' to enter defence sector through strategic technology partnerships for enhanced solutions.",
            "Sentiment": "positive",
            "PublishDate": 1765509259673,
            "Source": "stocks"
        },
        {
            "Title": "Lloyds Enterprises Forms Step-Down Defence Subsidiary",
            "Summary": "Lloyds Enterprises Limited announces incorporation of step-down subsidiary Lloyds Advance Defence Systems Limited through material subsidiary Lloyds Engineering Works Limited on December 11, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765472914209,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Engineering Works Partners with Italian Firm Virtualabs for Radar Technology Development",
            "Summary": "Lloyds Engineering Works has entered into an agreement with Virtualabs S.r.l., an Italian company, to collaborate on radar technology development. The partnership focuses on creating radar solutions for both defense and civil applications.",
            "Sentiment": "positive",
            "PublishDate": 1764893241500,
            "Source": "stock"
        },
        {
            "Title": "Lloyds Engineering Works Secures Contracts Worth $163,900 and €310,000 with Polish Company",
            "Summary": "Lloyds Engineering Works signed two contracts with Kliver Polska Sp. ZO.O. for developing towed reels and a test stand, valued at $163,900 and €310,000 respectively. The contracts represent new business opportunities for the engineering company in the European market.",
            "Sentiment": "positive",
            "PublishDate": 1763629263674,
            "Source": "order&deals"
        },
        {
            "Title": "Lloyds Engineering Works Reports 20% Revenue Growth to ₹418 Crores with Strategic Expansion Plans",
            "Summary": "Lloyds Engineering Works achieved 20% year-on-year revenue growth to ₹418 crores in H1FY26, maintaining an 18% EBITDA margin. The company is expanding into defense and industrial automation through strategic partnerships with FlyFocus (Poland) and Cemi. Subsidiaries showed strong margin performance with Metalfab achieving 21.6% margins and Licl reaching 16.2%. The order book is diversifying across steel, infrastructure, and energy segments. The company is targeting margin growth and scaling up export operations.",
            "Sentiment": "positive",
            "PublishDate": 1762526782413,
            "Source": "earnings"
        },
        {
            "Title": "Lloyds Engineering Works Approves Joint Venture Draft with Techno Industries for Government Elevator Tenders",
            "Summary": "Lloyds Engineering Works has approved a joint venture agreement draft with Techno Industries. The partnership will focus on government elevator and escalator tenders.",
            "Sentiment": "positive",
            "PublishDate": 1762520554345,
            "Source": "order&deals"
        },
        {
            "Title": "Lloyds Engineering Works Reports Mixed Q2 Results with Revenue Growth and Margin Decline",
            "Summary": "Lloyds Engineering Works reported Q2 consolidated net profit of 518.4 million rupees, up from 301.8 million rupees in the previous quarter. Revenue increased to 3.17 billion rupees from 2.17 billion rupees quarter-on-quarter. However, EBITDA declined to 486.3 million rupees from 736.7 million rupees, while EBITDA margin compressed significantly to 15.36% from 33.95% in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762517983923,
            "Source": "earnings"
        },
        {
            "Title": "Lloyds Engineering Works Reports No Deviation in Rights Issue Fund Utilization for Quarter Ended September 30, 2025",
            "Summary": "Lloyds Engineering Works Limited filed its quarterly statement showing no deviation in the utilization of funds raised through its rights issue for the quarter ended September 30, 2025. The company had raised funds on June 5, 2025, through allotment of 30,85,17,476 partly paid-up equity shares at Rs. 32 per share. The original allocation was Rs. 493.62 crores, modified to Rs. 487.59 crores, with no funds utilized during the quarter. India Ratings Research Private Limited, serving as the monitoring agency, confirmed no deviation from stated objectives. The company's audit committee provided no comments on the fund utilization. The balance amount on the partly paid shares is payable in calls to be completed by March 31, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1762513065137,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Engineering Works Grants 4.25 Lakh Employee Stock Options Under ESOP Plan 2021",
            "Summary": "Lloyds Engineering Works Limited's Nomination and Remuneration Committee approved the grant and allotment of employee stock options on November 7, 2025. The company granted 3,20,000 ESOPs to employees of Techno Industries Private Limited, a subsidiary, and allotted 1,05,784 ESOPs to employees of Lloyds Infrastructure and Construction Limited, another subsidiary. Both grants are under the Lloyds Steels Industries Limited Employee Stock Option Plan-2021. The exercise price is set at Rs 9.50 per share for both allocations. Options will vest after 1 year but within 7 years from the grant date, subject to vesting conditions. Each option converts to one equity share upon exercise. The company has received in-principle approval from BSE Limited and National Stock Exchange of India Limited. The diluted earnings per share impact from these options is described as negligible.",
            "Sentiment": "positive",
            "PublishDate": 1762512636278,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Engineering Wins ₹613 Crore Order from SAIL for Pellet Plant Project",
            "Summary": "Lloyds Engineering Works Limited has been selected as a consortium partner alongside Primetals Technologies India Pvt. Ltd and Primetals Technologies Austria GmbH for a ₹613 crore order from SAIL-IISCO Steel Plant. The project involves design and execution of a 4.2 MTPA Pellet Plant Complex at SAIL's IISCO Steel Plant in Burnpur, West Bengal. The total consortium contract value is approximately ₹613 crore for the Indian portion and $18.26 million for the European portion, with completion scheduled within 39 months. Lloyds Engineering will handle detailed design and engineering while contributing to the supply of critical process equipment and systems. The company has established over 10 collaborations with domestic and international partners over the past two years. Wholetime Director Shreekrishna Gupta stated this order reflects industry confidence in the company's technical capabilities and collaborative approach.",
            "Sentiment": "positive",
            "PublishDate": 1762137321443,
            "Source": "order&deals"
        },
        {
            "Title": "Lloyds Engineering Partners with FlyFocus for Advanced FPV Drones in India's Defence Sector",
            "Summary": "Lloyds Engineering Works Limited signed a Memorandum of Understanding with Poland-based FlyFocus Sp. z o.o. to jointly introduce advanced First Person View (FPV) drones for India's defence and security sectors. The partnership builds on their existing Defender drone program collaboration and expands into agile, short-range UAV systems for high-mobility, close-quarter scenarios including real-time reconnaissance, training, urban security, and special operations. The agreement includes technology transfer with over 50% local content through component manufacturing and final assembly in India, exclusive India rights for LEWL to adapt and deploy FPV systems, and potential export opportunities. The FPV drones will complement existing Defender systems to provide end-to-end aerial intelligence capabilities. Director ShreeKrishna Gupta stated the MoU represents the next phase of collaboration with FlyFocus, aimed at providing Indian forces with enhanced tactical flexibility and real-time capability while localizing the technology.",
            "Sentiment": "positive",
            "PublishDate": 1760364534281,
            "Source": "order&deals"
        },
        {
            "Title": "Lloyds Engineering Works Partners with Flyfocus for UAV Development",
            "Summary": "Lloyds Engineering Works has signed a memorandum of understanding with Flyfocus for UAV development. The partnership will focus on joint development of Defender SIGINT drones and avionics systems designed for signals intelligence applications.",
            "Sentiment": "positive",
            "PublishDate": 1760020481623,
            "Source": "order&deals"
        },
        {
            "Title": "Lloyds Enterprises Sells 0.10% Stake in Material Subsidiary to Thriveni Earthmovers for Rs 10 Crores",
            "Summary": "Lloyds Enterprises Limited sold 14,20,000 equity shares (0.10% stake) of its material subsidiary Lloyds Engineering Works Limited to Thriveni Earthmovers Private Limited through a block deal. The transaction was executed at Rs 70.50 per share, totaling Rs 10,01,10,000. Following the sale, Lloyds Enterprises' holding in the subsidiary decreased from 33.30% to 33.20%. The transaction was completed through open market on August 5, 2025. Thriveni Earthmovers Private Limited is the investment arm of Mr. Balasubramanian Prabhakaran. The company submitted revised disclosure documents to BSE and NSE regarding this transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1758517409292,
            "Source": "order&deals"
        },
        {
            "Title": "Lloyds Engineering Partners with CEMI Process Optimization for Indian Market Representation",
            "Summary": "Lloyds Engineering Works Limited has entered into a strategic partnership agreement with CEMI Process Optimization Brazil and CEMI Process Optimization LLC to represent CEMI in the Indian market. Under the five-year agreement, Lloyds will promote and sell CEMI's products and services, including software solutions and specialized equipment for process optimization. CEMI specializes in advanced process control, dynamic simulation, and industrial vision systems for mining, cement, and steel sectors through platforms like OptProcess®, OptVision®, and OptGrade®. The partnership aims to provide end-to-end solutions combining Lloyds' project execution and engineering design capabilities with CEMI's digital process optimization tools. Executive Director Shreekrishna Gupta stated the partnership positions the company to bring AI-based technologies to India's mineral processing industries and create new high-margin revenue streams including recurring SaaS-based services. Either party may terminate the agreement with 60 days' written notice.",
            "Sentiment": "positive",
            "PublishDate": 1757955271013,
            "Source": "order&deals"
        },
        {
            "Title": "Lloyds Engineering Works Appoints Two Independent Directors for Five-Year Terms",
            "Summary": "Lloyds Engineering Works Limited appointed Mrs. Alka Upadhyay and Mr. Ashok Tandon as Independent Directors for five consecutive years. Mrs. Upadhyay's term runs from July 1, 2025 to September 30, 2029, while Mr. Tandon's term spans from July 2, 2025 to September 30, 2029. The appointments were recommended by the Nomination and Remuneration Committee, approved by the Board of Directors on July 1, 2025, and subsequently approved by shareholders at the 31st Annual General Meeting held on August 21, 2025. Mrs. Upadhyay, 54, brings nearly three decades of sustainability and ESG expertise, having worked with Ernst & Young India and the Tata Group for 24 years. Mr. Tandon, 66, is a mechanical engineer with over 40 years of experience in engineering, steel, oil & refinery, and capital equipment sectors, having worked with organizations including HPCL, Ispat Industries, and the Welspun Group. Both directors are not related to any other company directors and hold no directorships in other listed entities.",
            "Sentiment": "positive",
            "PublishDate": 1755887522662,
            "Source": "corporate_governance"
        },
        {
            "Title": "Lloyds Enterprises Sells 0.10% Stake in Material Subsidiary for Rs. 10.01 Crore",
            "Summary": "Lloyds Enterprises Limited sold 14,20,000 equity shares (0.10% of equity share capital) of its material subsidiary Lloyds Engineering Works Limited to Thriveni Earthmovers Private Limited for Rs. 10.01 crore through a block deal. The shares were sold at Rs. 70.50 each on August 5, 2025. Thriveni Earthmovers is the investment arm of Mr. Balasubramanian Prabhakaran. Following the transaction, Lloyds Enterprises' holding in Lloyds Engineering Works decreased from 33.30% to 33.20%. The subsidiary was formerly known as Lloyds Steels Industries Limited and is listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1754477262151,
            "Source": "order&deals"
        },
        {
            "Title": "Lloyds Engineering's Subsidiary Secures ₹19.58 Crore Railway Escalator Contract",
            "Summary": "Lloyds Engineering Works Limited announced that its 88%-owned subsidiary, Techno Industries Private Limited, has secured a ₹19.58 crore order from Mumbai Railway Vikas Corporation Limited. The contract covers design, manufacturing, supply, installation, testing, commissioning, and maintenance of escalators. With this new order, Techno Industries' confirmed order book now stands at ₹82.86 crore. The contract represents the subsidiary's strategic entry into the railway sector and expansion outside Gujarat, supporting the company's broader growth strategy of diversifying into tier-2/3 markets, industrial elevators, parking systems, and export markets.",
            "Sentiment": "positive",
            "PublishDate": 1754281990052,
            "Source": "order&deals"
        },
        {
            "Title": "Lloyds Engineering Subsidiary Secures Rs 163 Crore Railway Escalator Contract",
            "Summary": "Techno Industries Private Limited, a subsidiary of Lloyds Engineering Works Limited, signed an agreement with Mumbai Railway Vikas Corporation Limited on August 02, 2025. The contract involves procurement of escalators including design, manufacturing, supply, installation, testing, commissioning and maintenance during warranty period at various Western Railway locations. The agreement is valued at Rs 13.82 crore without GST and Rs 16.31 crore with 18% GST. Lloyds Engineering holds 88% shareholding in Techno Industries Private Limited, making it a material subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1754147103093,
            "Source": "order&deals"
        },
        {
            "Title": "Lloyds Engineering Subsidiary Secures Rs 231 Crore Railway Escalator Contract",
            "Summary": "Techno Industries Private Limited, a subsidiary of Lloyds Engineering Works Limited, entered into an agreement with Mumbai Railway Vikas Corporation Limited on August 1, 2025. The contract involves procurement of escalators including design, manufacturing, supply, installation, testing, commissioning and maintenance during warranty period at various Central Railway locations. The agreement is valued at Rs 19.58 crore excluding GST and Rs 23.11 crore including 18% GST. The project has a completion period of 24 months from the notice to proceed date. Lloyds Engineering holds 88% shareholding in Techno Industries Private Limited, which is classified as a material subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1754045696070,
            "Source": "order&deals"
        },
        {
            "Title": "Lloyds Engineering Targets Four-Fold Revenue Growth by FY26 with ₹1,337 Crore Order Book",
            "Summary": "Lloyds Engineering has set an ambitious target to achieve four times its FY25 revenue by FY26. The company plans to reach this growth through defense sector expansion, technology partnerships, EPC consolidation, and marine infrastructure development. The company expects EBITDA margins of 15-18% as its order book has grown to ₹1,337 crore.",
            "Sentiment": "positive",
            "PublishDate": 1753799732512,
            "Source": "stock"
        },
        {
            "Title": "Lloyds Engineering Works Reports 28.82% Revenue Growth in Q1FY26, Maintains Strong Order Book of Rs 1,337.57 Crore",
            "Summary": "Lloyds Engineering Works Limited reported quarterly results with revenue increasing 28.82% year-over-year to Rs 174.45 crore in Q1FY26 compared to Rs 135.42 crore in Q1FY25. EBITDA grew 22.07% to Rs 32.96 crore with margins at 18.89%. Profit before tax increased 24.77% to Rs 29.52 crore, while profit after tax was Rs 17.61 crore. The company maintains a strong order book of Rs 1,337.57 crore as of June 30, 2025. The Board approved audited financial results, monitoring agency report, and statement of deviation for its rights issue completed on June 5, 2025, which raised Rs 493.62 crore through allotment of 30.85 crore partly paid-up equity shares at Rs 32 per share. The company reported no deviation in use of funds raised through the rights issue. New orders worth Rs 205.71 crore were secured in Q1FY26.",
            "Sentiment": "positive",
            "PublishDate": 1753798302849,
            "Source": "earnings"
        },
        {
            "Title": "Lloyds Engineering Works Schedules Board Meeting for July 29 to Approve Quarterly Financial Results",
            "Summary": "Lloyds Engineering Works Limited has scheduled a Board of Directors meeting on July 29, 2025 to consider and approve the audited/unaudited financial results (standalone and consolidated) for the quarter ended June 30, 2025. The company has also informed that the trading window for designated persons and their immediate relatives will remain closed until 48 hours after the declaration of the financial results. The meeting will also address any other business matters with the permission of the Chair.",
            "Sentiment": "neutral",
            "PublishDate": 1753380987036,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Engineering Expands Strategic Partnership with Fincantieri to Include Marine Propulsion Systems",
            "Summary": "Lloyds Engineering Works Limited has strengthened its strategic technological partnership with Italy-based FINCANTIERI S.p.A by adding Controllable Pitch Propeller Systems and Shafting Systems to their collaboration. The partnership builds on an existing agreement for joint design and production of Advanced Steering Gear Systems, Fin Stabilizer Systems, Azimuthal Thrusters, and Transversal Tunnel Thrusters. Through this alliance, LEWL will develop and manufacture these advanced propulsion systems domestically, making it one of the first Indian companies to do so. The company reports strong growth in its defence engineering segment with an order book exceeding Rs 100 crores as of FY25. Executive Director Shreekrishna Gupta stated the partnership addresses a vital capability gap in India's naval ecosystem and enhances the company's position in defence manufacturing while supporting the Atmanirbhar Bharat initiative.",
            "Sentiment": "positive",
            "PublishDate": 1753374027207,
            "Source": "order&deals"
        },
        {
            "Title": "Lloyds Engineering Acquires 76% Stake in Metalfab Hightech",
            "Summary": "Lloyds Engineering has acquired a 76% stake in Metalfab Hightech for Rs 284 crore. This acquisition is aimed at enhancing Lloyds Engineering's heavy engineering capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1747717240000,
            "Source": "default"
        },
        {
            "Title": "Lloyds Engineering Works Secures Rs 15.39 Crore Order from Mumbai Cricket Association",
            "Summary": "Lloyds Engineering Works has received an order worth Rs 15.39 crore from the Mumbai Cricket Association (MCA). The project involves setting up the Sharad Pawar Museum and is to be completed within 3 months.",
            "Sentiment": "positive",
            "PublishDate": 1747630778000,
            "Source": "default"
        },
        {
            "Title": "Lloyds Engineering Works Q4 Financial Results",
            "Summary": "Lloyds Engineering Works reported its Q4 financial results. Revenue decreased to 1.78 billion rupees from 1.88 billion rupees year-over-year. EBITDA slightly increased to 268 million rupees from 267.7 million rupees, with EBITDA margin improving to 15% from 14.25%. However, net profit declined to 169 million rupees from 211.3 million rupees compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1746606187000,
            "Source": "result"
        },
        {
            "Title": "Lloyds Engineering Works to Consider Q4 Results on May 7",
            "Summary": "Lloyds Engineering Works has announced that it will consider its fourth quarter (Q4) financial results on May 7. This indicates the company is preparing to release its latest quarterly earnings report, which will provide insight into its financial performance for the most recent fiscal period.",
            "Sentiment": "neutral",
            "PublishDate": 1746192684000,
            "Source": "default"
        },
        {
            "Title": "LLOYDS ENGINEERING WORKS Reports Q3 Profit and Revenue Growth",
            "Summary": "LLOYDS ENGINEERING WORKS announced its Q3 financial results, showing significant year-over-year growth. The company's net profit increased to 367 million rupees from 271 million rupees in the same quarter last year. Revenue also saw an uptick, rising to 2.3 billion rupees from 2 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739432304000,
            "Source": "earnings"
        },
        {
            "Title": "Lloyds Engineering Works Signs MoU with Emco Ltd for Land Acquisition",
            "Summary": "Lloyds Engineering Works has entered into a Memorandum of Understanding (MoU) with Emco Ltd to acquire 25 hectares 48 ares (254,800 square meters) of land for industrial use. This strategic move aims to expand Lloyds Engineering Works' industrial capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1737678164000,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Engineering: Q2 Profit Surges 49% on Doubled Revenue",
            "Summary": "Lloyds Engineering Works Ltd. reported a 48.8% YoY increase in Q2 net profit to Rs 27.9 crore. Revenue nearly doubled to Rs 212 crore. EBITDA rose 32.9% to Rs 31.8 crore, though margin decreased to 15%. Order book as of Oct 1, 2024 stands at Rs 1,365.86 crore, 2.19 times FY24 revenue.",
            "Sentiment": "positive",
            "PublishDate": 1729346030000,
            "Source": "result"
        },
        {
            "Title": "Lloyds Engineering Works Approves MOU for Asset Acquisition",
            "Summary": "<p><span class=\"neutral\">Lloyds Engineering Works</span> has <span class=\"positive\">approved</span> a <b>Memorandum of Understanding (MOU)</b> with <span class=\"neutral\">Bhilai Engineering Corporation</span>. The agreement involves the <span class=\"positive\">acquisition</span> of <b>assets</b> from Bhilai Engineering Corporation's <b>Engineering Division</b> by Lloyds Engineering Works.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728542466000,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Engineering to Consider Asset Acquisition in Board Meeting",
            "Summary": "<p><span class='neutral'>Lloyds Engineering</span> has scheduled a <b>board meeting</b> for <span class='neutral'>October 10</span> to discuss and potentially <span class='positive'>approve</span> the <span class='neutral'>acquisition of assets</span> from an <span class='neutral'>engineering business</span>. The board will also consider other <span class='neutral'>agenda items</span> during this meeting.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728293880000,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Engineering: Secures ₹59 Crore in Eco-Friendly Tech Orders",
            "Summary": "<p><span class='positive'>Lloyds Engineering Works Limited (LEWL)</span> has received <b>orders worth ₹59 crore</b>, with <span class='positive'>₹50 crore for eco-pickling systems</span> and <span class='positive'>₹9.3 crore for marine loading arms</span>. These orders follow recent <span class='positive'>technology agreements</span> with <span class='neutral'>The Material Works, Ltd.</span> and <span class='neutral'>TB Global Technologies Ltd.</span></p>",
            "Sentiment": "positive",
            "PublishDate": 1727778483000,
            "Source": "normal_news"
        }
    ]
}