{
    "Symbol": "LLOYDSENT",
    "ISIN": "INE080I01025",
    "News": [
        {
            "Title": "Lloyds Enterprises Submits Q3 FY26 Rights Issue Report",
            "Summary": "Lloyds Enterprises Limited filed its monitoring agency report for Q3 FY26, confirming proper utilization of ₹49,612.94 lakhs raised through rights issue with no deviations from stated objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1770650886998,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Enterprises Board Meet on Feb 9 for Q3 Results",
            "Summary": "Lloyds Enterprises Limited has scheduled a board meeting on February 09, 2026, to consider Q3FY26 unaudited financial results and approve fund raising proposal of up to Rs. 500 crores through NCDs.",
            "Sentiment": "neutral",
            "PublishDate": 1770209832510,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Enterprises Postal Ballot Results Announced",
            "Summary": "Lloyds Enterprises Limited successfully passes all five resolutions through postal ballot e-voting, including material related party transactions and adoption of new articles of association.",
            "Sentiment": "positive",
            "PublishDate": 1768220459983,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Enterprises Completes Postal Ballot Voting",
            "Summary": "Lloyds Enterprises Limited successfully completed postal ballot voting on January 09, 2026, with all five resolutions including related party transactions and loan provisions passed with requisite majority.",
            "Sentiment": "positive",
            "PublishDate": 1768220226045,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Enterprises Sets January 16 Record Date",
            "Summary": "Lloyds Enterprises approves final call of ₹19.50 per partly paid-up equity share for its ongoing rights issue, with January 16 set as the record date for shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1767934636906,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Enterprises announces First and Final Call",
            "Summary": "Lloyds Enterprises Rights Issue Committee approves First and Final Call on partly paid shares at ₹19.50 per share with record date January 16, 2026 and payment period February 2-16, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766762332236,
            "Source": "stocks"
        },
        {
            "Title": "Lloyds Enterprises Plans Real Estate Restructuring",
            "Summary": "Lloyds Enterprises announces plans to consolidate real estate interests into separate entity Lloyds Realty, targeting over ₹7,000 crore future revenue generation.",
            "Sentiment": "positive",
            "PublishDate": 1766416991211,
            "Source": "stocks"
        },
        {
            "Title": "Lloyds Enterprises Board Approves Composite Scheme",
            "Summary": "Lloyds Enterprises Limited's board approved a composite scheme involving merger of two subsidiaries and demerger of real estate business into separate listed entity Lloyds Realty Limited with ₹7,000 crore revenue potential.",
            "Sentiment": "positive",
            "PublishDate": 1766415380005,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lloyds Enterprises Board Approves New Articles of Association and Postal Ballot for Shareholder Approval",
            "Summary": "Lloyds Enterprises Limited's Board approved adoption of new Articles of Association to align with Companies Act 2013, along with postal ballot notice for material related party transactions and loan guarantee approvals. The company will seek shareholder approval through postal ballot for these governance changes and regulatory compliance measures.",
            "Sentiment": "neutral",
            "PublishDate": 1765178973684,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Enterprises Reports Strong H1 Performance with 36% Revenue Growth and Strategic Gold Mine Investment",
            "Summary": "Lloyds Enterprises Limited reported significant growth in its latest results, with standalone income increasing 36% year-over-year to ₹490 crores and consolidated income rising 44% to ₹1,060 crores. Standalone profit after tax surged 1634% to ₹251 crores, while consolidated PAT increased 441% to ₹311 crores. The company made a strategic investment in Geomysore Services India Pvt Ltd, acquiring a 31.58% stake for ₹140 crores in India's first privately-operated gold mine since Independence. The Jonnagiri project is expected to produce up to 1,000 kilograms of refined gold annually for the next 15 years, with a resource base of up to 42.5 tonnes of gold. Subsidiary Lloyds Engineering Works continues strong performance with an order book exceeding ₹1,500 crores. Lloyds Realty Developers signed MoUs for over 270 acres across MMR growth corridors with revenue potential exceeding ₹5,000 crores, including warehouse development in Taloja and residential projects in Khopoli. The company trades at ₹62.49 per share with a market capitalization of ₹899.7 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762900575207,
            "Source": "earnings"
        },
        {
            "Title": "Lloyds Enterprises Reports Proper Utilization of Rights Issue Proceeds in Quarterly Monitoring Report",
            "Summary": "Lloyds Enterprises Limited submitted its monitoring agency report for the quarter ended September 30, 2025, confirming appropriate utilization of funds raised through its rights issue. The company raised INR 49,612.94 lakhs during the quarter from its rights issue of 25,44,25,324 equity shares at INR 19.50 per share. India Ratings Research Private Limited, the monitoring agency, reported no deviation from the stated objects. The company utilized INR 10,221.50 lakhs for subscription to secured non-convertible debentures of subsidiary Lloyds Realty Developers Limited and INR 9,990.00 lakhs for general corporate purposes. The subsidiary further deployed the NCD proceeds for real estate projects in Bandra and Goregaon, repayment of inter-corporate deposits, and land acquisitions. Unutilized proceeds of INR 26,086.95 lakhs are deployed in fixed deposits and monitoring accounts. The report was reviewed by the Audit Committee and approved by the Board of Directors.",
            "Sentiment": "positive",
            "PublishDate": 1762861852142,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Enterprises Reports 251% Jump in Half-Year Net Profit to ₹251 Crores",
            "Summary": "Lloyds Enterprises Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The company reported a standalone net profit of ₹251.32 crores for the half year, compared to ₹14.48 crores in the previous year, marking a significant increase. Revenue from operations for the half year stood at ₹189.83 crores versus ₹359.15 crores in the previous year. On a consolidated basis, the company posted a net profit of ₹310.51 crores for the half year against ₹57.40 crores in the previous year. Consolidated revenue from operations reached ₹737.47 crores compared to ₹735.87 crores in the previous year. The company completed a rights issue allotment of 25.44 crore partly paid-up equity shares at ₹39 per share, increasing its paid-up share capital to ₹139.93 crores. The company's subsidiary Lloyds Engineering Works acquired 76% stake in Metalfab Hightech Private Limited for ₹28.41 crores and an additional 11% stake in Techno Industries Private Limited for ₹25 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762854871608,
            "Source": "earnings"
        },
        {
            "Title": "Lloyds Enterprises Reports Mixed Q2 Results with Higher Profit but Lower EBITDA",
            "Summary": "Lloyds Enterprises reported quarterly consolidated profit after tax of 620 million rupees compared to 405 million rupees in the same period last year, representing a significant increase. However, the company's EBITDA declined to 237 million rupees from 292 million rupees year-over-year. The EBITDA margin also compressed to 5.83% from 7.59% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762852500104,
            "Source": "earnings"
        },
        {
            "Title": "Lloyds Realty Developers Signs MoUs for Over 170 Acres Development at Khopoli",
            "Summary": "Lloyds Realty Developers Limited, a subsidiary of Lloyds Enterprises Limited, has entered non-binding Memorandums of Understanding for joint development of over 170 acres of land at Khopoli. The developments will include residential plotted townships, premium housing, and community infrastructure. With these MoUs, the total land area under three projects including Taloja now exceeds 270 acres. The company plans to develop approximately 110 acres into plotted residential communities with total developable potential exceeding 13 million sq. ft. The Khopoli developments are expected to generate revenues exceeding ₹5,000 crores over the next five years. LRDL will retain majority ownership across both Khopoli projects. The company is also evaluating community infrastructure including a senior living enclave and boarding school. The Taloja project, covering 99 acres for industrial, warehousing, and logistics park development, has progressed with land acquisition and regulatory processes underway.",
            "Sentiment": "positive",
            "PublishDate": 1760790560510,
            "Source": "order&deals"
        },
        {
            "Title": "Lloyds Realty Developers Signs Non-Binding MoU with Zenith Steel for Maharashtra Land Development",
            "Summary": "Lloyds Realty Developers Limited, a subsidiary of Lloyds Enterprises Limited, has signed a non-binding Memorandum of Understanding with Zenith Steel Pipes & Industries Limited on October 18, 2025. The MoU outlines the proposed development of land located at Zenith compound in Khopoli, Maharashtra. The parties plan to develop the land through a Special Purpose Vehicle (SPV) to construct a plotting scheme and multi-purpose scheme. The agreement has no impact on management or control of the listed entity and does not involve any related party transactions. No shareholding exists between the parties, and the transaction will not affect the capital structure of Lloyds Enterprises Limited.",
            "Sentiment": "positive",
            "PublishDate": 1760789167915,
            "Source": "order&deals"
        },
        {
            "Title": "Geomysore Services Begins Pre-Commercial Production Trials at Jonnagiri Gold Mine",
            "Summary": "Geomysore Services has started pre-commercial production trials at the Jonnagiri Gold Mine. The company is targeting commercial production to begin by November 2025. Lloyds Enterprises holds a 31.58% stake in GMSI (Geomysore Services).",
            "Sentiment": "positive",
            "PublishDate": 1760069572832,
            "Source": "stock"
        },
        {
            "Title": "Blossom Trade & Interchange LLP Acquires 6.5 Crore Shares in Lloyds Enterprises Through Rights Issue",
            "Summary": "Blossom Trade & Interchange LLP acquired 65,00,000 equity shares of Lloyds Enterprises Limited through a rights issue. The acquisition was completed on September 10, 2025, when the allotment advice was received. Before the acquisition, Blossom Trade held 38,39,04,000 shares representing 30.18% of the total share capital. After the acquisition, their holding increased to 39,04,04,000 shares, representing 25.57% of the diluted share capital. The newly acquired shares are partly paid-up equity shares with a face value of Re. 1 each and paid-up value of Re. 0.50 each. Blossom Trade belongs to the promoter group of Lloyds Enterprises. The target company's equity share capital increased from Rs. 1,27,21,26,621 to Rs. 1,52,65,51,945 after the rights issue, which included 1,27,21,26,621 fully paid shares of Re. 1 each and 25,44,25,324 partly paid-up equity shares of Re. 0.50 each. Lloyds Enterprises is listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1757928423171,
            "Source": "corporate_action"
        },
        {
            "Title": "Crosslink Food and Farms Acquires 1.07 Crore Shares in Lloyds Enterprises Through Rights Issue",
            "Summary": "Crosslink Food and Farms Private Limited acquired 1,06,51,376 equity shares of Lloyds Enterprises Limited through a rights issue. The acquisition was completed on September 10, 2025, when Crosslink received the allotment advice. Following this transaction, Crosslink's shareholding in Lloyds Enterprises increased from 4,36,86,476 shares (3.43%) to 5,43,37,852 shares (3.56%). The acquired shares are partly paid-up equity shares with a face value of Re. 1 each and paid-up value of Re. 0.50 each. Crosslink belongs to the promoter group of Lloyds Enterprises. The target company's shares are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1757928038686,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Enterprises Extends Rights Issue Closing Date by One Day Due to Public Holiday",
            "Summary": "Lloyds Enterprises Limited has extended the closing date of its ongoing Rights Issue from September 8, 2025 to September 9, 2025. The extension was made due to a public holiday for Id-E-Milad falling on September 8, 2025, which was previously scheduled for September 5, 2025. The Rights Issue period originally ran from August 25, 2025 to September 8, 2025. The company made this decision in the interest of public shareholders and notified the National Stock Exchange of India Limited and BSE Limited of the change.",
            "Sentiment": "neutral",
            "PublishDate": 1756992038379,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Enterprises Reports Strong Q1 Growth, Declares 10% Interim Dividend",
            "Summary": "Lloyds Enterprises Limited reported consolidated income growth of 88% year-on-year for the quarter ended June 30, 2025, with total comprehensive income rising 241%. Standalone operations increased 109% year-on-year. The company declared an interim dividend of Re. 0.10 per equity share (10%) with a record date of September 5, 2025. Key subsidiary Lloyds Engineering Works continued strong performance with revenue and profit before tax growing 29% and 25% respectively, maintaining an order book of ₹1,338 crores. The company made strategic investments including a 31.58% stake in Geomysore Services India for ₹140 crores, India's first privately operated gold mine since Independence, and approved a rights issue to raise approximately ₹992 crores. Subsidiary Lloyds Realty entered into agreements for a warehousing project with potential revenue exceeding ₹1,250 crores over three to four years.",
            "Sentiment": "positive",
            "PublishDate": 1755154712876,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Enterprises Declares Interim Dividend of Re. 0.10 Per Share, Approves Q1 FY2026 Results",
            "Summary": "Lloyds Enterprises Limited approved its unaudited financial results for the quarter ended June 30, 2025, in a board meeting held on August 14, 2025. The board declared an interim dividend of Re. 0.10 per equity share of face value Re. 1 for financial year 2025-26. The dividend will be paid to eligible shareholders whose names appear in the register as on the record date of September 5, 2025, with disbursement by September 12, 2025. The financial results were reviewed by the Audit Committee and approved by the Board of Directors. The results have been uploaded on stock exchange websites and the company's website.",
            "Sentiment": "positive",
            "PublishDate": 1755152570163,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Enterprises Reports Significant Jump in Q1 Net Profit and Other Income",
            "Summary": "Lloyds Enterprises reported consolidated net profit of 2.3 billion rupees in Q1 compared to 60 million rupees in the same period last year. The company's other income surged to 2.8 billion rupees from 36 million rupees year-over-year. However, EBITDA declined to 223 million rupees from 228 million rupees, while EBITDA margin compressed to 6.74% from 7.06% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755152108557,
            "Source": "earnings"
        },
        {
            "Title": "Lloyds Enterprises Revises Record Date for Final Dividend Payment",
            "Summary": "Lloyds Enterprises Limited has revised the record date for payment of final dividend for the financial year ended March 31, 2025 to Monday, August 25, 2025. The final dividend of Re. 0.10 per equity share (10%) will be paid to eligible shareholders. The record date was previously set for Friday, August 22, 2025. The company's 39th Annual General Meeting is scheduled for Friday, August 29, 2025 at 11:00 A.M. through video conferencing. All other items and contents of the Annual Report including the AGM Notice remain unchanged except for the revised record date.",
            "Sentiment": "neutral",
            "PublishDate": 1754984560719,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Enterprises Announces ₹992 Crore Rights Issue at ₹39 Per Share",
            "Summary": "Lloyds Enterprises Limited has announced a rights issue of 25.44 crore equity shares at ₹39 per share, aiming to raise ₹992.26 crore. The rights issue offers 1 new share for every 5 existing shares held by eligible shareholders as of August 14, 2025. The issue opens on August 25, 2025, and closes on September 8, 2025. The company will use ₹700 crore of net proceeds to subscribe to non-convertible debentures of subsidiary Lloyds Realty Developers Limited for real estate projects, with the remaining ₹247.5 crore allocated for general corporate purposes. The shares will be issued on a partly paid-up basis, with ₹19.50 payable on application and the balance through subsequent calls by March 31, 2027.",
            "Sentiment": "neutral",
            "PublishDate": 1754912048683,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Enterprises Approves Rights Issue Terms to Raise Rs. 992.26 Crores",
            "Summary": "Lloyds Enterprises Limited's Rights Issue Committee approved the terms for issuing 25,44,25,324 partly paid-up equity shares at Rs. 39 per share when fully paid up, raising Rs. 992.26 crores. The rights entitlement ratio is 1:5, meaning eligible shareholders will receive one rights share for every five existing shares held. The issue price includes a premium of Rs. 38 per share, with payments to be made in installments - Rs. 19.50 on application and the remaining Rs. 19.50 through calls to be completed by March 31, 2027. The record date is August 14, 2025, with the rights issue opening on August 25, 2025, and closing on September 8, 2025. Post-issue, the company's outstanding equity shares will increase from 127.21 crores to 152.66 crores, assuming full subscription.",
            "Sentiment": "neutral",
            "PublishDate": 1754745536225,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Enterprises Reschedules Board Meeting to August 9 for Rights Issue Approval",
            "Summary": "Lloyds Enterprises Limited has rescheduled its Board of Directors and Rights Issue Committee meeting to August 9, 2025, to consider and approve terms of a proposed Rights Issue. The meeting will address key parameters including issue price, rights entitlement ratio, record date, issue schedule and other related terms and conditions. The original meeting was postponed due to pending in-principle approval from stock exchanges in connection with the proposed Rights Issue.",
            "Sentiment": "neutral",
            "PublishDate": 1754500825303,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Enterprises Sells Subsidiary Shares Worth Rs. 10.01 Crore to Thriveni Earthmovers",
            "Summary": "Lloyds Enterprises Limited sold 14,20,000 fully paid-up equity shares of its material subsidiary Lloyds Engineering Works Limited to Thriveni Earthmovers Private Limited for Rs. 10,01,10,000 through a block deal. The shares were sold at Rs. 70.50 each, representing 0.10% of the company's total holding. Thriveni Earthmovers Private Limited is identified as the investment arm of Mr. Balasubramanian Prabhakaran. The transaction was completed on August 6th, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754479680788,
            "Source": "order&deals"
        },
        {
            "Title": "Lloyds Enterprises Postpones Board Meeting as Rights Issue Approval Pending",
            "Summary": "Lloyds Enterprises Limited postponed its Board of Directors and Rights Issue Committee meeting scheduled for July 25, 2025, as the company awaits in-principle approvals from stock exchanges for its proposed rights issue. The company had previously approved a rights issue of partly paid-up equity shares worth up to Rs. 99,900 lakhs on July 21, 2025, and submitted applications for approval to BSE and NSE on July 22, 2025. The stock exchanges are currently reviewing the application and raising queries, which the company is addressing. The meeting was intended to finalize specific terms including rights issue price, entitlement ratio, record date, and timing. A new meeting date will be announced once the stock exchange approvals are received.",
            "Sentiment": "neutral",
            "PublishDate": 1753455759725,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Enterprises Board Approves ₹1000 Crore Rights Issue Fundraising Plan",
            "Summary": "Lloyds Enterprises' board has approved a fundraising plan worth ₹1000 crore through a rights issue. The company will raise capital by offering shares to existing shareholders at a predetermined price.",
            "Sentiment": "positive",
            "PublishDate": 1753079625314,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Enterprises to Review Fundraising Proposal",
            "Summary": "Lloyds Enterprises has announced that it will review a fundraising proposal on July 21. No further details about the nature or size of the fundraising were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1752496677000,
            "Source": "default"
        },
        {
            "Title": "Lloyds Enterprises Projects Revenue Exceeding Rs 1,250 Crore in 3-4 Years",
            "Summary": "Lloyds Enterprises has announced expectations for its project revenue to surpass Rs 1,250 Crore over the next 3 to 4 years. The company states that this projection is based on final land use and market demand.",
            "Sentiment": "positive",
            "PublishDate": 1752206112000,
            "Source": "default"
        },
        {
            "Title": "Lloyds Realty Developers Signs Agreement for Warehousing and Logistics Park",
            "Summary": "Lloyds Enterprises' subsidiary, Lloyds Realty Developers, has signed an agreement for a large warehousing and logistics park in Taloja. The news indicates expansion in the company's real estate development activities, particularly in the industrial and logistics sector.",
            "Sentiment": "positive",
            "PublishDate": 1752206016000,
            "Source": "default"
        },
        {
            "Title": "Lloyds Enterprises: Strategic Stake Acquisition in Gold Mining Company",
            "Summary": "Lloyds Enterprises to acquire 31.58% indirect stake in Geomysore Services India Pvt Ltd (GMSI) for ₹140 crore. GMSI holds mining lease for Jonnagiri Gold Project in Andhra Pradesh, with expected annual production of 1,000 kg refined gold. Project nearing commercial production with peak revenue estimate of ₹950 crore and EBITDA of ₹700 crore annually.",
            "Sentiment": "positive",
            "PublishDate": 1751625573000,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Enterprises Acquires 50% Stake in Prakar Estates",
            "Summary": "Lloyds Enterprises has acquired a 50% stake in Prakar Estates for 1.40 billion rupees. This acquisition represents a significant investment in the real estate sector.",
            "Sentiment": "positive",
            "PublishDate": 1751606013000,
            "Source": "default"
        },
        {
            "Title": "Lloyds Enterprises Ltd: Shares Hit Four-Month High Amid Stake Sale",
            "Summary": "Lloyds Enterprises Ltd shares rose 14% to a four-month high. The company sold a 2.30% stake in Lloyds Engineering Works Ltd for Rs 129 crore. Q4 net profit fell 55% YoY to Rs 9.4 crore, while revenue increased 46.6% YoY to Rs 489 crore. The board recommended a final dividend of Rs 0.10 per share for FY2025.",
            "Sentiment": "positive",
            "PublishDate": 1748241292000,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Enterprises Reports Significant Q4 EBITDA Growth",
            "Summary": "Lloyds Enterprises has announced its Q4 financial results, showing substantial year-over-year improvement. The company's EBITDA increased from 152.2 million rupees to 247.8 million rupees. Additionally, the EBITDA margin expanded from 4.56% to 5.06% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1746780163000,
            "Source": "result"
        },
        {
            "Title": "Lloyds Enterprises Reports Mixed Q4 Results",
            "Summary": "Lloyds Enterprises announced its Q4 financial results. The company's revenue increased significantly to 4.89 billion rupees from 3.34 billion rupees in the same quarter last year. However, consolidated net profit decreased to 94 million rupees from 210 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1746779828000,
            "Source": "result"
        },
        {
            "Title": "Lloyds Enterprises Reports Decline in Q3 Net Profit and Revenue",
            "Summary": "Lloyds Enterprises has reported a significant decrease in its Q3 consolidated net profit, which fell to 194 million rupees from 598 million rupees year-over-year. The company's revenue also declined to 2.9 billion rupees from 3.24 billion rupees in the same period last year. Compared to the previous quarter, net profit decreased from 221 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1739492218000,
            "Source": "earnings"
        },
        {
            "Title": "Lloyds Enterprises Reports Improved Q3 EBITDA and Margin",
            "Summary": "Lloyds Enterprises has announced its Q3 financial results, showing an increase in EBITDA from 396 million rupees to 414 million rupees year-over-year. The company's EBITDA margin also improved, rising from 11.60% to 14.25% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739456968000,
            "Source": "earnings"
        },
        {
            "Title": "LLOYDS ENTERPRISES Reports Decline in Q3 Financial Performance",
            "Summary": "LLOYDS ENTERPRISES has reported a significant decrease in its Q3 consolidated net profit, which fell to 194 million rupees from 598 million rupees year-over-year. The company's revenue also declined to 2.9 billion rupees from 3.24 billion rupees in the same period last year. Compared to the previous quarter, net profit decreased from 221 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1739456899000,
            "Source": "earnings"
        },
        {
            "Title": "Lloyds Enterprises Approves 12.25% Equity Investment in LICL",
            "Summary": "Lloyds Enterprises has approved a further investment of 12.25% equity stake in LICL. The cost of this acquisition is reported to be 142.1 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738066948000,
            "Source": "corporate_action"
        },
        {
            "Title": "Lloyds Enterprises Reports Q2 Financial Results",
            "Summary": "Lloyds Enterprises announced its Q2 financial results. The company's consolidated net profit decreased to 221 million rupees from 288 million rupees year-over-year. However, revenue significantly increased to 3.85 billion rupees from 1.49 billion rupees compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1729839338000,
            "Source": "result"
        }
    ]
}