{
    "Symbol": "LMW",
    "ISIN": "INE269B01029",
    "News": [
        {
            "Title": "LMW Reverts to Six-Day Work Week at Textile Division",
            "Summary": "LMW Limited announces return to six working days per week at all Textile Machinery Division facilities in Coimbatore, effective February 4, 2026, reversing earlier operational changes.",
            "Sentiment": "neutral",
            "PublishDate": 1770145940152,
            "Source": "stocks"
        },
        {
            "Title": "LMW Q3FY26 Results: Revenue Rises to ₹766.75 Crores",
            "Summary": "LMW Limited reported Q3FY26 revenue of ₹766.75 crores with net profit of ₹29.94 crores. Nine-month revenue reached ₹2,228.15 crores with profit of ₹99.55 crores.",
            "Sentiment": "positive",
            "PublishDate": 1769603611759,
            "Source": "co_actions_results"
        },
        {
            "Title": "LMW Gets Independent ESG Rating from NSE Analytics",
            "Summary": "LMW Limited receives ESG rating from NSE Sustainability Ratings & Analytics Limited based on publicly available data, disclosed under SEBI regulations on January 9, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767936810997,
            "Source": "stocks"
        },
        {
            "Title": "LMW Board Meeting Set for January 28, 2026",
            "Summary": "LMW Limited has scheduled a board meeting on January 28, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025. Trading window remains closed until January 30, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767757869880,
            "Source": "co_actions_results"
        },
        {
            "Title": "LMW Completes Sale of 9.77% Stake in Super Sales",
            "Summary": "LMW Limited has successfully completed the sale of 3,00,000 equity shares representing 9.77% stake in Super Sales India Limited, following board approval from December 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765777032735,
            "Source": "co_actions_results"
        },
        {
            "Title": "LMW Signs MOU with Tamil Nadu Government",
            "Summary": "LMW has entered into a Memorandum of Understanding with the Government of Tamil Nadu. The agreement establishes a formal partnership between the company and the state government.",
            "Sentiment": "neutral",
            "PublishDate": 1764115835253,
            "Source": "stock"
        },
        {
            "Title": "LMW Limited Reports 15% Revenue Growth in Q2 FY26 Despite Textile Machinery Challenges",
            "Summary": "LMW Limited reported quarterly revenue of Rs. 790 crores for the period ended September 2025, marking a 15% increase from Rs. 690 crores in the previous quarter. The company achieved H1 revenue of Rs. 1,480 crores compared to Rs. 1,412 crores in the corresponding previous period, representing a 5% increase. Profit before tax stood at Rs. 92 crores versus Rs. 56 crores in the previous period, which included a Rs. 15 crore profit from asset sales. The textile machinery division generated Rs. 461 crores in revenue, an 11% quarterly increase, though sales remained flat compared to September 2024. The division continues operating at 40-45% capacity utilization with a 5-day working schedule due to weak textile CapEx conditions. The company holds an order book of Rs. 2,700 crores with active orders of Rs. 1,400 crores. The machine tool division and foundry segment showed strong performance with Rs. 555 crores turnover for H1, operating at 70% utilization. LMW showcased new products at ITMA Asia Singapore, including the LC9S carding machine, LDF6 draw frame, and LRJ90 ring frame. Management noted early positive signs in export markets like Indonesia, Bangladesh, and Egypt following tariff clarity, while domestic textile mills maintain high utilization but delay CapEx decisions.",
            "Sentiment": "neutral",
            "PublishDate": 1762515852793,
            "Source": "earnings"
        },
        {
            "Title": "LMW Reports 57% Jump in Q2 Net Profit to 451.4 Million Rupees",
            "Summary": "LMW reported quarterly net profit of 451.4 million rupees compared to 287.5 million rupees in the same period last year. Revenue increased to 7.76 billion rupees from 7.51 billion rupees year-over-year. EBITDA rose to 485.2 million rupees versus 354 million rupees previously, with EBITDA margin improving to 6.25% from 4.72%.",
            "Sentiment": "positive",
            "PublishDate": 1762332887036,
            "Source": "earnings"
        },
        {
            "Title": "LMW Limited Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "LMW Limited announced its unaudited financial results for the quarter and period ended September 30, 2025. The Board of Directors approved both standalone and consolidated financial results at their meeting held on November 5, 2025. The consolidated results include financial performance of wholly owned subsidiary companies including LMW Holding Limited (UAE), LMW Aerospace Industries Limited (India), and step-down subsidiaries LMW Textile Machinery (Suzhou) Co. Ltd (China) and LMW Global FZE (UAE). The company operates through three main segments: Textile Machinery Division, Machine Tool & Foundry Division, and Advanced Technology Centre. The results were reviewed by the Audit Committee and audited by statutory auditors. The company has arranged to publish the results in Business Line (English) and Hindu-Tamil newspapers.",
            "Sentiment": "neutral",
            "PublishDate": 1762330007549,
            "Source": "earnings"
        },
        {
            "Title": "LMW Limited Reports 4% Revenue Growth to Rs 685 Crores in Q1 FY2025-26",
            "Summary": "LMW Limited achieved total revenue of Rs 685 crores in Q1 FY2025-26, representing a 4% increase from Rs 659 crores in the previous year quarter. The company's standalone PBT improved to Rs 32.5 crores from Rs 17.5 crores, while consolidated PBT reached Rs 20 crores versus Rs 16 crores previously. The Textile Machinery Division (TMD) experienced a 6% revenue decline to Rs 415 crores and posted a loss of Rs 11 crores. The division continues operating on 5 working days due to low capacity utilization and reduced order inflows over the last eight quarters. The Machine Tool and Foundry Division showed growth with revenue rising to Rs 251 crores from Rs 206 crores, generating profits of Rs 12 crores. The Aerospace division (ATC) recorded revenue of Rs 46 crores with profits of Rs 4 crores, with exports contributing 90% of turnover. The company maintains an order book of around Rs 2,800 crores with 50-55% being active orders. Management cited global tariff uncertainties and geopolitical situations as factors affecting machine demand.",
            "Sentiment": "neutral",
            "PublishDate": 1753101544863,
            "Source": "earnings"
        },
        {
            "Title": "LMW Reports Improved Q1 Financial Results",
            "Summary": "LMW has announced its Q1 financial results. The company's EBITDA increased to 256 million rupees from 133 million rupees year-over-year. The EBITDA margin improved to 3.75% from 2.02% in the same period last year. Net profit rose to 245 million rupees from 125 million rupees year-over-year. Revenue for Q1 was 6.8 billion rupees, up from 6.59 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1752742200000,
            "Source": "result"
        },
        {
            "Title": "LMW Completes Share Purchase in Fully-Owned Subsidiary",
            "Summary": "LMW has completed the process of purchasing additional shares in its fully-owned subsidiary. The company will maintain 100% ownership of the subsidiary following this transaction.",
            "Sentiment": "positive",
            "PublishDate": 1751465348000,
            "Source": "default"
        },
        {
            "Title": "LMW Reports Q4 Results and Announces Dividend",
            "Summary": "LMW has announced its Q4 financial results and a dividend recommendation. The company's Q4 net profit decreased to 491 million rupees from 651.5 million rupees year-over-year. Revenue also declined to 7.9 billion rupees from 9.52 billion rupees in the same period. EBITDA for Q4 was 570 million rupees, down from 717.5 million rupees, with EBITDA margin slightly decreasing to 7.22% from 7.54%. Despite the decline in financial performance, LMW has recommended a dividend of 30 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747225410000,
            "Source": "result"
        }
    ]
}