{
    "Symbol": "LODHA",
    "ISIN": "INE670K01029",
    "News": [
        {
            "Title": "Lodha Developers Allots 58,536 Shares Under ESOP",
            "Summary": "Lodha Developers Limited has allotted 58,536 equity shares of ₹10 each under its Employee Stock Option Plans on February 04, 2026, as part of its employee incentive programs.",
            "Sentiment": "neutral",
            "PublishDate": 1770224651497,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lodha Developers Achieves 70% of Annual Pre-Sales Target",
            "Summary": "Lodha Developers has achieved INR 146 billion in pre-sales during the first nine months, representing 70% of its full-year target of INR 210 billion. The company projects 33% EBITDA margin and 20% ROE.",
            "Sentiment": "positive",
            "PublishDate": 1769742952723,
            "Source": "stocks"
        },
        {
            "Title": "Lodha Developers Cuts Data Center Costs by 15%",
            "Summary": "Lodha Developers announces Green DC Park agreement that reduces client data center costs by 15%, bringing turnkey prices to $6 million per megawatt from global range of $8-12 million.",
            "Sentiment": "positive",
            "PublishDate": 1769742921057,
            "Source": "stocks"
        },
        {
            "Title": "Lodha Developers Reports Q3 FY26 Financial Results",
            "Summary": "Lodha Developers Limited announced its unaudited financial results for Q3 FY26 ended December 31, 2025. The Board approved consolidated and standalone results at its meeting held on January 28, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769610836200,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lodha's Bengaluru project faces legal setback",
            "Summary": "Karnataka tribunal orders de-registration of Lodha Mirabelle project after residents challenge plan changes. High court stays de-registration but restricts new construction without resident consent.",
            "Sentiment": "negative",
            "PublishDate": 1769437781298,
            "Source": "stocks"
        },
        {
            "Title": "Lodha Developers Allots 38,695 Shares Under ESOP",
            "Summary": "Lodha Developers Limited allotted 38,695 equity shares of ₹10 each on January 21, 2026, under its Employee Stock Option Scheme 2021-II, as announced to stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1768988739683,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lodha Signs ₹1L Cr Data Center Deal with Maharashtra",
            "Summary": "Lodha Developers enters agreement with Maharashtra government for additional ₹1 lakh crore data center investment, bringing total commitment to ₹1.3 lakh crores with plans to create over 16,000 jobs.",
            "Sentiment": "positive",
            "PublishDate": 1768881426509,
            "Source": "stocks"
        },
        {
            "Title": "Lodha Group Confident on FY26 Pre-Sales Target",
            "Summary": "Prashant Bindal of Lodha Group expresses confidence in achieving the company's FY26 pre-sales guidance, signaling positive outlook for the real estate developer's business prospects.",
            "Sentiment": "positive",
            "PublishDate": 1768367193246,
            "Source": "stocks"
        },
        {
            "Title": "Lodha Developers Acquires Land Worth ₹34,000 Cr",
            "Summary": "Lodha Developers acquired five strategic land parcels across Mumbai, Delhi, and Bengaluru in Q3 with combined estimated sales value of ₹34,000 crores, expanding presence in key metros.",
            "Sentiment": "positive",
            "PublishDate": 1768188589433,
            "Source": "stocks"
        },
        {
            "Title": "Lodha Developers Reports Record ₹5,620 Cr Q3 Pre-Sales",
            "Summary": "Lodha Developers achieved highest-ever quarterly pre-sales of ₹5,620 crores in Q3 FY26, marking 25% YoY and 23% QoQ growth. Jefferies sets ₹1,650 target with 48% upside potential.",
            "Sentiment": "positive",
            "PublishDate": 1767936371459,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lodha Developers Reports 25% YoY Q3 Pre-Sales Growth",
            "Summary": "Lodha Developers achieved strong performance with 25% year-over-year growth in Q3 pre-sales, demonstrating robust demand in the real estate sector and effective sales execution.",
            "Sentiment": "positive",
            "PublishDate": 1767700984688,
            "Source": "stocks"
        },
        {
            "Title": "Lodha Developers shares in focus after strong Q3FY26 results",
            "Summary": "Lodha Developers shares likely to remain in focus after reporting 25% YoY growth in Q3FY26 pre-sales to ₹56.20 billion. Stock closed 0.71% lower at ₹1,112.10 despite strong operational performance and business development activities.",
            "Sentiment": "positive",
            "PublishDate": 1767699439108,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lodha Unit G Corp Homes to Contest RERA Tribunal Ruling",
            "Summary": "G Corp Homes, a Lodha Developers subsidiary, plans to challenge Karnataka RERA Appellate Tribunal decision directing further compliance after acquiring 100% stake in June 2022.",
            "Sentiment": "neutral",
            "PublishDate": 1766592650467,
            "Source": "stocks"
        },
        {
            "Title": "Macrotech Developers Sees Rs. 62.94 Crore Block Trade on NSE",
            "Summary": "Macrotech Developers executed a block trade worth Rs. 62.94 crores involving 561,213 shares at Rs. 1,121.50 per share on NSE. The transaction represents a significant institutional or bulk investor activity in the real estate developer's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764649293307,
            "Source": "order&deals"
        },
        {
            "Title": "Supreme Court Orders ₹520.80 Crore Refund To Lodha Developers, Removes ED Lien",
            "Summary": "The Supreme Court has ordered a refund of ₹520.80 crore to Lodha Developers while affirming the company's status as a bona fide resolution applicant. The court also directed the removal of Enforcement Directorate lien on VHL properties, providing relief to the real estate developer.",
            "Sentiment": "positive",
            "PublishDate": 1764288460090,
            "Source": "stock"
        },
        {
            "Title": "Lodha Developers Allots 30,179 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Lodha Developers Limited allotted 30,179 equity shares of ₹10 each on November 19, 2025, under its Employee Stock Option Scheme 2021-II. The allotment affects employee shareholders and represents the company's ongoing equity compensation program for its workforce.",
            "Sentiment": "neutral",
            "PublishDate": 1763532655591,
            "Source": "corporate_action"
        },
        {
            "Title": "ED Seizes ₹59 Crore in Mumbai Searches Linked to Alleged Fraud at Lodha Developers",
            "Summary": "The Enforcement Directorate seized assets worth ₹59 crore during searches at 14 Mumbai locations as part of a money laundering probe against Rajendra Narpatmal Lodha and associates. The investigation relates to alleged unauthorized asset transfers and fund diversions that caused losses exceeding ₹100 crore to listed company Lodha Developers Ltd.",
            "Sentiment": "negative",
            "PublishDate": 1763128016563,
            "Source": "stock"
        },
        {
            "Title": "Lodha Developers Raises ₹250 Crore Through Non-Convertible Debentures",
            "Summary": "Lodha Developers Limited has allotted 25,000 non-convertible debentures worth ₹250 crore on a private placement basis. Each debenture has a face value of ₹1 lakh and will be listed on the Wholesale Debt Market segment of BSE Limited. The debentures carry an interest rate of 7.90% per annum, payable quarterly, linked to the 3-Month Treasury Bill rate plus a spread of 2.45%. The instruments have a tenure of 3 years, maturing on November 13, 2028, with the first interest payment due on December 31, 2025. The debentures are secured by a first ranking charge over certain company assets and include a default interest provision of 2% per annum above the applicable rate in case of payment delays exceeding 3 months.",
            "Sentiment": "positive",
            "PublishDate": 1763014194204,
            "Source": "corporate_action"
        },
        {
            "Title": "Macrotech Developers Block Trade Worth Rs. 152.96 Crores on NSE",
            "Summary": "Macrotech Developers executed a block trade on the National Stock Exchange involving approximately 1,237,220 shares at a price of Rs. 1,236.30 per share, totaling Rs. 152.96 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1762920758098,
            "Source": "order&deals"
        },
        {
            "Title": "Lodha Developers Allots 75,004 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Lodha Developers Limited allotted 75,004 equity shares of ₹10 each on November 6, 2025, under the Lodha Developers Limited - Employee Stock Option Scheme 2021-II. The company informed BSE and NSE about this allotment through a regulatory filing signed by Company Secretary Sanjyot Rangnekar.",
            "Sentiment": "neutral",
            "PublishDate": 1762439821489,
            "Source": "corporate_action"
        },
        {
            "Title": "Lodha Developers Reports Record Q2 Presales of INR 45.7 Billion, Explores Data Center Opportunities at Palava",
            "Summary": "Lodha Developers achieved its best-ever second quarter presales of INR 45.7 billion, up 7% year-on-year, with H1 sales at INR 90 billion representing 43% of full-year guidance of INR 210 billion. The company delivered embedded EBITDA margins of 32% despite JDA projects contributing just under 50% of presales. Revenue from operations reached INR 38 billion, up 45% year-on-year, while PAT grew 87% to just under INR 8 billion. The company added new business development worth INR 23 billion GDV in MMR, completing its full-year BD guidance of INR 250 billion in the first half itself. Net debt stood at INR 53.7 billion at 0.25x equity. Lodha entered an MOU with Maharashtra government for a data center park at Palava spanning 400 acres with 3 gigawatts power capacity, having secured anchor customers Amazon Web Services and STT. Land values at the data center park have increased to approximately INR 0.3 billion per acre. The Palava-Airoli-Mulund freeway is approaching completion and should be operational next quarter. The company plans to start pilot operations in NCR, likely focusing on Gurugram initially.",
            "Sentiment": "positive",
            "PublishDate": 1762250384541,
            "Source": "earnings"
        },
        {
            "Title": "Lodha Developers Projects 5% Average Price Growth for FY26",
            "Summary": "Lodha Developers announced expectations of approximately 5% average price growth for FY26. This projection was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1761897222984,
            "Source": "stock"
        },
        {
            "Title": "Lodha Developers Reports 87% Jump in Net Profit, Achieves Record Q2 Pre-Sales of Rs 4,570 Crore",
            "Summary": "Lodha Developers posted pre-sales of Rs 4,570 crore for the quarter ended September, up 7% year-on-year and marking its highest second-quarter performance. Net profit surged 87% to Rs 790 crore with profit margin expanding to 20.4% from 15.8%. Revenue from operations increased 45% to Rs 3,800 crore while collections grew 13% to Rs 3,480 crore. The company achieved its full-year business development target of Rs 25,000 crore in gross development value, adding one new project worth Rs 2,300 crore in Mumbai Metropolitan Region. MD & CEO Abhishek Lodha noted strong market momentum with non-launch weekly sales approaching Rs 300 crore per week and confirmed the company remains on track for full-year pre-sales guidance of Rs 21,000 crore. Lodha signed an MOU with Maharashtra government to establish a Green Data Centre Park at Palava with Amazon Web Services and STT as anchor operators. The company's net debt stood at Rs 5,370 crore with a net debt-to-equity ratio of 0.25 times, while average cost of debt declined to 8%.",
            "Sentiment": "positive",
            "PublishDate": 1761838135771,
            "Source": "earnings"
        },
        {
            "Title": "Lodha Developers Reports 8.0% Debt Exit Cost in Q2FY26, Down 30 Basis Points",
            "Summary": "Lodha Developers announced its debt exit cost for Q2FY26 at 8.0%, representing a decrease of 30 basis points from the previous quarter. The company states this is among the lowest debt exit costs in the industry.",
            "Sentiment": "positive",
            "PublishDate": 1761835723143,
            "Source": "earnings"
        },
        {
            "Title": "Lodha Developers Achieves Full-Year Business Development Target in First Half",
            "Summary": "Lodha Developers achieved its full-year business development target of INR 250 billion GDV in the first half of the fiscal year. The company added one new project worth INR 23 billion GDV in Q2 FY26. Weekly sales without new launches are approaching INR 3 billion.",
            "Sentiment": "positive",
            "PublishDate": 1761835220280,
            "Source": "stock"
        },
        {
            "Title": "Lodha Projects ₹210 Bn Pre-Sales and ₹77 Bn Operating Cash Flow for FY26",
            "Summary": "Lodha has announced ambitious financial projections for FY26, targeting ₹210 billion in pre-sales and ₹77 billion in operating cash flow with a 32% embedded EBITDA margin. The company plans to support these targets through ₹250 billion GDV new launches and expansion into the NCR market. Additionally, Lodha outlined a long-term vision for FY31 including 3 GW data-center development and ₹15 billion annual rental income. The company aims to maintain consistent 20% growth with ROE above 20% while keeping net debt below 0.5x.",
            "Sentiment": "positive",
            "PublishDate": 1761834691847,
            "Source": "stock"
        },
        {
            "Title": "Lodha Developers Reports Strong Q2 Performance with 88% Jump in Net Profit",
            "Summary": "Lodha Developers delivered robust quarterly results with consolidated net profit rising to 7.89 billion rupees from 4.2 billion rupees year-over-year. Revenue increased significantly to 37.99 billion rupees compared to 26.25 billion rupees in the same period last year. EBITDA grew to 11.01 billion rupees from 7.04 billion rupees, while EBITDA margin improved to 29.19% from 26.83% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761831628479,
            "Source": "earnings"
        },
        {
            "Title": "Lodha Developers Appoints Amandeep Singh as Regional CEO for NCR",
            "Summary": "Lodha Developers Limited appointed Amandeep Singh as Regional CEO for the NCR region, effective October 27, 2025. The appointment was approved by the Board of Directors based on the recommendation of the Nomination and Remuneration Committee. Singh brings over 22 years of real estate experience and holds an MBA from Xavier Institute of Management and a BE from Army Institute of Technology. He previously worked at DLF Ltd as Sr. ED (COO, Gurgaon & North), where he delivered launch readiness for projects valued at ₹25,000 crore across 14 million sq. ft. in Gurgaon and Chandigarh markets. He also served as CEO (East & West Zone) at Godrej Properties, managing P&L delivery across Pune, Kolkata, Ahmedabad & Nagpur markets while leading a team of 400+ employees.",
            "Sentiment": "positive",
            "PublishDate": 1760707632728,
            "Source": "corporate_governance"
        },
        {
            "Title": "Company Acquires 100% Stake in Chaitanya Bilva Private Limited for ₹499.61 Crore",
            "Summary": "A company has completed the acquisition of 100% equity stake in Chaitanya Bilva Private Limited (CBPL) for ₹499.61 crore in cash consideration on October 13, 2025. CBPL, incorporated on November 17, 2021, is engaged in real estate development and construction of residential projects. The target company owns approximately 8.37 acres of land in a prime Bengaluru location and has a net worth of ₹13.10 crore as of March 31, 2025, with no turnover recorded as it has not commenced business operations. The acquisition is part of the acquiring company's strategy for calibrated growth in Tier 1 cities through inorganic expansion. The transaction does not involve related party dealings and required no regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1760360750736,
            "Source": "order&deals"
        },
        {
            "Title": "Lodha Developers Reports 7% Growth in Q2 Sales Bookings to Rs 4,570 Crore",
            "Summary": "Lodha Developers reported sales bookings of Rs 4,570 crore in the second quarter, representing a 7% year-on-year increase from Rs 4,290 crore in the same period last year. The growth was attributed to better housing demand despite limited launches during the quarter. For the first six months of the fiscal year, the company's sales bookings rose 8% to Rs 9,020 crore compared to Rs 8,320 crore in the previous year. The company maintains its full-year pre-sales guidance of Rs 21,000 crore, with significant launches planned for the second half following Supreme Court approval of the Environmental Clearance process in late August. Lodha Developers operates primarily in Mumbai Metropolitan Region, Pune and Bengaluru, having delivered 110 million sq ft of real estate with over 130 million sq ft under development.",
            "Sentiment": "positive",
            "PublishDate": 1760158337581,
            "Source": "stock"
        },
        {
            "Title": "Lodha Developers Achieves Full Year Target of INR 250 Billion in First Half",
            "Summary": "Lodha Developers achieved its full year target of INR 250 billion in the first half of the year while maintaining a strong pipeline. The company reported Q2 pre-sales of INR 45.70 billion, representing a 7% year-over-year increase. Q2 collections reached INR 34.80 billion, showing a 13% year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1759841142548,
            "Source": "stock"
        },
        {
            "Title": "Macrotech Developers Sees Block Trade Worth Rs. 277.70 Crores on NSE",
            "Summary": "Macrotech Developers executed a block trade on the National Stock Exchange involving approximately 2,516,788 shares at a price of Rs. 1,103.40 per share. The total transaction value amounted to Rs. 277.70 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1759817917456,
            "Source": "order&deals"
        },
        {
            "Title": "Lodha Developers Raises ₹500 Crore Through Secured Debentures on BSE",
            "Summary": "Lodha Developers Ltd has issued 50,000 secured non-convertible debentures worth ₹500 crore. The debentures are listed on BSE and carry an interest rate of 8.10% per year, with quarterly interest payments.",
            "Sentiment": "neutral",
            "PublishDate": 1759232565019,
            "Source": "corporate_action"
        },
        {
            "Title": "Lodha Developers to Refer Rajendra Lodha Matter for Investigation",
            "Summary": "Lodha Developers announced it will refer a matter involving Rajendra Lodha to appropriate authorities for investigation.",
            "Sentiment": "neutral",
            "PublishDate": 1758154171446,
            "Source": "corporate_governance"
        },
        {
            "Title": "Macrotech Developers Raises ₹350 Crore Through Debenture Allotment",
            "Summary": "Macrotech Developers allotted 35,000 secured redeemable non-convertible debentures worth ₹350 crore. The debentures carry a tenure until September 15, 2029.",
            "Sentiment": "neutral",
            "PublishDate": 1757999283830,
            "Source": "corporate_action"
        },
        {
            "Title": "Lodha Developers Applies for Reclassification of Rajendra Lodha from Promoter to Public Category",
            "Summary": "Lodha Developers Limited has applied to BSE and NSE for reclassification of Mr Rajendra Lodha from 'Promoter and Promoter group' category to 'Public' category shareholder. The application was submitted on August 30, 2025, and the company informed the exchanges on September 15, 2025. The reclassification request is being processed in compliance with SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1757950891717,
            "Source": "corporate_governance"
        },
        {
            "Title": "Lodha Developers Signs ₹300 Billion MoU with Maharashtra Government for Green Data Centre Park",
            "Summary": "Lodha Developers has signed a Memorandum of Understanding worth ₹300 billion with the Maharashtra Government for the development of a Green Integrated Data Centre Park.",
            "Sentiment": "positive",
            "PublishDate": 1757895126620,
            "Source": "stock"
        },
        {
            "Title": "Maharashtra Signs ₹30,000 Crore MoU with Lodha Developers for Green Data Centre Park",
            "Summary": "Maharashtra government signed an MoU with Lodha Developers Ltd to develop a Green Integrated Data Centre Park in Palava with a proposed investment of ₹30,000 crore. The project will span 370 acres in the Mumbai Metropolitan Region with a planned capacity of 2 gigawatts, designed to host multiple international and domestic data centre operators. The initiative is expected to create nearly 6,000 direct and indirect jobs. The development follows Maharashtra's Green Integrated Data Centre Parks policy introduced in October 2024, which requires data centres to operate on renewable and alternative energy sources. Three such parks will be established across MMR to meet rising demand for digital infrastructure. Lodha Developers will serve as the master developer while various operators establish facilities within the park. Abhishek Lodha, MD & CEO of Lodha Developers, emphasized the company's commitment to green growth and net zero operations.",
            "Sentiment": "positive",
            "PublishDate": 1757598702941,
            "Source": "order&deals"
        },
        {
            "Title": "Lodha Developers Board Approves Reclassification of Rajendra Lodha from Promoter to Public Shareholder",
            "Summary": "Lodha Developers Limited's Board of Directors approved the reclassification of Rajendra Lodha from 'Promoter and Promoter group' category to 'Public' category shareholder on August 25, 2025. Rajendra Lodha resigned as Whole-time Director effective August 17, 2025, and conveyed he should no longer be considered a promoter. He holds only 400 equity shares in the company, does not exercise control over company affairs, has no special rights, and is not represented on the Board. The reclassification is subject to stock exchange approvals and does not require shareholder approval as his holding is less than one percent of total voting rights. The Board confirmed the company will remain compliant with minimum public shareholding requirements post-reclassification.",
            "Sentiment": "neutral",
            "PublishDate": 1756131581974,
            "Source": "corporate_governance"
        },
        {
            "Title": "Lodha Developers Modifies Merger Scheme, Excludes Sanathnagar Enterprises Limited",
            "Summary": "Lodha Developers Limited has modified its merger scheme by excluding Sanathnagar Enterprises Limited from the previously announced absorption plan. The company will proceed with merging only two subsidiaries - Roselabs Finance Limited and National Standard (India) Limited. The Board of Directors approved this modification following discussions with stakeholders. The exclusion does not impact shareholders or debenture holders, and the share exchange ratios for the remaining two entities remain unchanged as determined by registered valuer Bansi S. Mehta Valuers LLP and confirmed by Kotak Mahindra Capital Company Limited. The scheme still requires approvals from shareholders, creditors, the National Company Law Tribunal, stock exchanges, and other regulatory authorities.",
            "Sentiment": "neutral",
            "PublishDate": 1754924243100,
            "Source": "corporate_action"
        },
        {
            "Title": "Lodha Developers Raises NCD Limit to 50 Billion Rupees",
            "Summary": "Lodha Developers has increased its Non-Convertible Debenture (NCD) limit from 30 billion rupees to 50 billion rupees, representing a 20 billion rupee increase in its debt fundraising capacity.",
            "Sentiment": "positive",
            "PublishDate": 1754920933676,
            "Source": "corporate_action"
        },
        {
            "Title": "Lodha Developers Schedules Board Meeting to Consider Non-Convertible Debentures Fundraising",
            "Summary": "Lodha Developers Limited has scheduled a Board of Directors meeting for August 11, 2025, to consider a proposal for fundraising through the issuance of Non-Convertible Debentures on a private placement basis. The fundraising will be conducted in one or more tranches with the objective to diversify the pool of debt and enable continued reduction in the cost of funds on targeted debt capital. The company was formerly known as Macrotech Developers Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1754490475354,
            "Source": "corporate_action"
        },
        {
            "Title": "Lodha Developers Reports 2% Price Growth in Q1 FY26, Targets Higher Weekly Sales",
            "Summary": "Lodha Developers reported a 2% price increase in Q1 FY26 compared to the previous year and anticipates 5-6% price growth for the full year while aiming to keep prices below wage growth for better affordability. The company expects weekly sales to grow from ₹250 crore in FY25 to ₹300 crore by FY26 end. The company's Palava project is projected to achieve annual sales of ₹80 billion with EBITDA margins near 50% by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1753759871934,
            "Source": "stock"
        },
        {
            "Title": "Lodha Developers Targets ₹50 Billion Quarterly Pre-Sales Through FY26",
            "Summary": "Lodha Developers expressed confidence in achieving its pre-sales and cash flow targets despite facing environmental approval delays. The company aims for average quarterly pre-sales of ₹50 billion through FY26. Management expects the first half to contribute 40-45% of their annual operating plan, leaning toward 45%, while the second half is anticipated to be strengthened by major project launches.",
            "Sentiment": "positive",
            "PublishDate": 1753759409532,
            "Source": "stock"
        },
        {
            "Title": "Lodha Developers Targets Over ₹2,000 Crore Bengaluru Pre-Sales in FY26",
            "Summary": "Lodha Developers aims to more than double its Bengaluru pre-sales to over ₹2,000 crore in FY26, up from under ₹1,000 crore in the previous year. The company reported a 42% increase in consolidated net profit to ₹675.1 crore for the first quarter, with current market capitalization of ₹1,24,670.54 crore. Executive Director Sushil Kumar Modi confirmed the company has three active projects in Bengaluru and added three land parcels in the last financial year plus one more in the current quarter. The company remains confident about achieving its ₹21,000 crore pre-sales guidance for the full year, expecting 55-60% of business to come in the second half coinciding with festivities. Lodha plans to launch ₹17,000-18,000 crore worth of inventory in the remaining nine months after launching ₹8,000 crore in the first quarter. The company is evaluating NCR as its next market entry and targets ₹50,000 crore in sales by 2030, with 40%+ expected to come from outside Mumbai. Company shares have declined over 8% in the past year.",
            "Sentiment": "positive",
            "PublishDate": 1753690406097,
            "Source": "stock"
        },
        {
            "Title": "Lodha Developers Shares Drop to Three-Month Low Despite Strong Quarterly Results",
            "Summary": "Lodha Developers' share price fell to its lowest level in over three months, declining 6.94% to Rs 1,190.60, despite reporting strong quarterly results. The company posted revenue growth of 22.7% to Rs 3,492 crore, EBITDA increase of 30% to Rs 984 crore, and net profit surge of 42% to Rs 675 crore. Margins expanded to 28.2% from 26.6%. The stock extended losses for a fifth consecutive day and was the top loser on the NSE Nifty Realty index, which became the worst performing sector. Lodha maintained its guidance of 19% pre-sales growth for financial year 2026 and projected operating cash flow to rise 17% to Rs 7,700 crore. The stock has declined 9.16% over 12 months and 10.98% year-to-date. Of 18 analysts tracking the company, 13 maintain buy ratings, four recommend hold, and one suggests sell, with average price targets implying 18% upside potential.",
            "Sentiment": "negative",
            "PublishDate": 1753681916473,
            "Source": "stock"
        },
        {
            "Title": "Lodha Developers Reports 42% Jump in Quarterly Profit, Adds Rs 22,700 Crore Worth Projects",
            "Summary": "Lodha Developers reported a 42% year-on-year increase in profit after tax to Rs 680 crore for the first quarter, up from Rs 480 crore in the same period last year. The company achieved its best-ever first quarter pre-sales of Rs 4,450 crore, marking 10% growth. PAT margin expanded to 18.6% from 16.3%, while adjusted EBITDA margin reached 34.4%. The company added five new projects worth Rs 22,700 crore across Mumbai Metropolitan Region, Pune, and Bengaluru, bringing total project value since IPO to over Rs 1 trillion across 48 projects. Net debt stood at Rs 5,080 crore with a debt-to-equity ratio of 0.24x, below the company's 0.5x ceiling. Cost of debt decreased to 8.3%. The company achieved over 90% of its business development guidance in the first quarter and expects continued healthy demand in the mid-income segment. Shares closed 3.5% lower at Rs 1,279.30.",
            "Sentiment": "positive",
            "PublishDate": 1753674168921,
            "Source": "earnings"
        },
        {
            "Title": "Lodha Developers Plans Rs 17,000 Crore Housing Project Launches, Reports 42% Profit Growth",
            "Summary": "Lodha Developers plans to launch Rs 17,000 crore worth of residential projects by March to meet consumer demand. Executive Director Sushil Kumar Modi expressed confidence in achieving the Rs 21,000 crore pre-sales target for the current fiscal year, representing a 19% increase from the previous year. The company launched Rs 8,000 crore worth of projects in the first quarter and expects to launch the remaining Rs 17,000 crore in the next three quarters. With acquisition of five land parcels in the June quarter, the company has visibility for Rs 25,000 crore worth of launches for 2025-26. Sales bookings grew 10% to Rs 4,450 crore in the April-June period. The company reported a 42% increase in consolidated net profit to Rs 675.1 crore for the first quarter, up from Rs 475.9 crore in the previous year. Total income rose to Rs 3,624.7 crore from Rs 2,918.3 crore in the corresponding period. Modi cited post-Covid housing demand, economic growth, income tax relief, and reduced home loan interest rates as growth drivers.",
            "Sentiment": "positive",
            "PublishDate": 1753619234783,
            "Source": "stock"
        },
        {
            "Title": "Lodha Developers Reports 42% Jump in Quarterly Net Profit to ₹6,751 Million",
            "Summary": "Lodha Developers Limited announced its quarterly results for the quarter ended June 30, 2025. The company reported a consolidated net profit of ₹6,751 million, representing a 42% increase from ₹4,759 million in the same quarter last year. Revenue from operations reached ₹34,917 million compared to ₹28,465 million in the previous year quarter. On a standalone basis, net profit was ₹6,443 million versus ₹4,516 million in the prior year quarter, while standalone revenue was ₹33,493 million against ₹28,110 million. The company's basic earnings per share improved to ₹6.76 from ₹4.78 year-over-year. During the quarter, the company allotted 474,986 equity shares under its employee stock option schemes. The Board of Directors approved these unaudited financial results at their meeting held on July 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753538597594,
            "Source": "earnings"
        },
        {
            "Title": "Lodha Developers Schedules Analyst Call for Quarterly Results Discussion",
            "Summary": "Lodha Developers Limited has scheduled an analysts and investors conference call for July 28, 2025, at 2:00 PM IST to discuss results for the quarter ended June 30, 2025. The company has provided dial-in numbers for domestic participants (+91 22 6280 1197/ +91 22 7115 8098) and international toll-free numbers for Singapore, Hong Kong, USA, and UK. Pre-registration is available through a provided link, and the information is being uploaded on the company's website at www.lodhagroup.com.",
            "Sentiment": "neutral",
            "PublishDate": 1753272605706,
            "Source": "earnings"
        }
    ]
}