{
    "Symbol": "LOKESHMACH",
    "ISIN": "INE397H01017",
    "News": [
        {
            "Title": "Lokesh Machines Wins ₹22 Cr Defence Contract",
            "Summary": "Lokesh Machines secures ₹22.00 crore defence contract from Ministry of Defence for supplying 9X19mm machine pistol components, to be executed by March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767578060679,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lokesh Machines Seeks Fine Waiver from BSE, NSE",
            "Summary": "Lokesh Machines Limited requests waiver of ₹3.71 lakh penalties each from BSE and NSE for board composition non-compliance, citing mandatory MHA approval requirements for directorship changes.",
            "Sentiment": "neutral",
            "PublishDate": 1767011352484,
            "Source": "stocks"
        },
        {
            "Title": "Lokesh Machines Receives Exchange Fines for Board Composition Non-Compliance",
            "Summary": "Lokesh Machines Limited received fine notices of Rs.3,71,700 each from BSE and NSE for non-compliance with Regulation 17(1) regarding board composition during the quarter ended September 30, 2025, due to an independent director's resignation. The company has since appointed a new independent director on November 11, 2025, after obtaining Ministry of Home Affairs approval required for arms manufacturing companies, and plans to seek waiver of the penalties.",
            "Sentiment": "negative",
            "PublishDate": 1764402079829,
            "Source": "corporate_governance"
        },
        {
            "Title": "Lokesh Machines Secures Rs 7.97 Crore Order from Kirloskar Oil Engines",
            "Summary": "Lokesh Machines Limited received an order worth Rs 7,96,50,000 (inclusive of GST) from Kirloskar Oil Engines Limited for supply of fish liner boring deck face milling SPM Machine. The domestic supply order is to be executed before end of June 2026 and does not involve any related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1764221526638,
            "Source": "order&deals"
        },
        {
            "Title": "Lokesh Machines Credit Rating Downgraded Due to US Sanctions Impact",
            "Summary": "Acuite Ratings downgraded Lokesh Machines Limited's long-term rating to ACUITE BBB- from ACUITE BBB and short-term rating to ACUITE A3 from ACUITE A3+ on Rs. 208.42 Cr bank facilities. The downgrade reflects deteriorating operating performance since Q3 FY2025 continuing in H1 FY2026 due to the company's inclusion in the US Treasury's OFAC sanctions list, which disrupted supply of electronic components and impacted production.",
            "Sentiment": "negative",
            "PublishDate": 1763623947552,
            "Source": "corporate_action"
        },
        {
            "Title": "Lokesh Machines Limited Approves Quarterly Results and Appoints New Independent Director",
            "Summary": "Lokesh Machines Limited's Board of Directors approved un-audited financial results for the quarter and half year ended September 30, 2025. The company also appointed Mr. Kolkappadam Vadavatah Sanil Babu as an additional Non-Executive Independent Director. Sanil Babu is a Mechanical Engineer with comprehensive experience in Aerospace Defence, Operations, Production, and Sales Marketing. He has expertise in plant operations, production management, aviation maintenance, operational excellence, and strategic planning. The appointee is not related to any existing director of the company and has not been debarred from holding directorship by SEBI or any other authority.",
            "Sentiment": "neutral",
            "PublishDate": 1762871882704,
            "Source": "corporate_governance"
        },
        {
            "Title": "Lokesh Machines Reports Q2 FY26 Results with Revenue of Rs 5,064 Lakhs",
            "Summary": "Lokesh Machines Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported revenue from operations of Rs 6,048.03 lakhs and net profit of Rs 85.65 lakhs for the quarter. For the half-year period, revenue reached Rs 9,895.98 lakhs with net profit of Rs 161.24 lakhs. The company operates through two segments: Machinery Division (Rs 4,897.86 lakhs revenue) and Components Division (Rs 165.75 lakhs revenue). During the quarter, 2,43,398 warrants were converted into equity shares by promoters, with no warrants remaining pending for conversion. The company's name appeared on the US Treasury Department's sanctions list published on October 30, 2024, preventing foreign currency transactions. Management has filed an application through a US-based law firm for expedited removal from the sanctions list on January 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762855930808,
            "Source": "earnings"
        },
        {
            "Title": "Lokesh Machines Files for Expedited Removal from US OFAC Sanctions List",
            "Summary": "Lokesh Machines Limited has filed documents through its US-based lawyers with the Office of Foreign Assets Control (OFAC), U.S. Department of the Treasury, requesting expedited removal from the list of Specially Designated Nationals and Blocked Persons. The company informed stock exchanges that it is taking necessary steps for removal from the OFAC sanctions list and considers this filing a major step toward that goal. The company assured shareholders it will continue updating exchanges about future developments in this matter.",
            "Sentiment": "positive",
            "PublishDate": 1762433486841,
            "Source": "stock"
        },
        {
            "Title": "Lokesh Machines Secures Rs 7.84 Crore Order from Sundaram-Clayton Limited",
            "Summary": "Lokesh Machines Limited has received an order worth Rs 7,83,93,890 (inclusive of GST) from Sundaram-Clayton Limited for the supply of Special Line Boring Machine and Gauging Systems. The domestic supply order is to be executed before the end of January 2026 from the effective date of the contract. The company confirmed that promoters/promoter group/group companies have no interest in the entity that awarded the order, and the transaction does not fall within related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1760184981564,
            "Source": "order&deals"
        },
        {
            "Title": "Lokesh Machines Receives Additional Information Request from U.S. OFAC for Sanctions List Removal",
            "Summary": "Lokesh Machines Limited received communication from the U.S. Office of Foreign Assets Control (OFAC) requesting additional information regarding the company's submission for removal from the Specially Designated Nationals and Blocked Persons list. The request follows the company's August 20, 2025 submission made through U.S.-based lawyers. The company considers OFAC's swift response encouraging and plans to submit the requested information within the given timeline for expedited removal from the sanctions list. Management assured shareholders that all necessary steps are being taken for removal from the OFAC sanctions list.",
            "Sentiment": "positive",
            "PublishDate": 1758953523868,
            "Source": "stock"
        },
        {
            "Title": "Lokesh Machines Limited Announces Board Changes and Auditor Appointment at 41st AGM",
            "Summary": "Lokesh Machines Limited made several key appointments at its 41st Annual General Meeting held on September 26, 2025. Ms. Likhitha Mullapudi was re-appointed as director after retiring by rotation. She holds BE and ME degrees in Mechanical Engineering from PSG Institute and University of Hartford, with experience in mechanical engineering and manufacturing operations. Mr. K. Krishna Swamy was approved to continue as Non-Executive Director for 5 years from September 26, 2025 to September 25, 2030. Krishna Swamy brings 47 years of machine tools design experience, having worked at HMT from 1964 and served as Chief Engineer from 1978 to 1983. The company also appointed M/s. L.D. Reddy & Co. as Secretarial Auditor for five consecutive years. The AGM commenced at 11:00 A.M. and concluded at 12:04 P.M.",
            "Sentiment": "neutral",
            "PublishDate": 1758888856952,
            "Source": "corporate_governance"
        },
        {
            "Title": "Lokesh Machines Receives DGQA Registration Certificate for Defence Manufacturing",
            "Summary": "Lokesh Machines has received approval for a registration certificate from the Directorate General of Quality Assurance (DGQA) for defence manufacturing operations.",
            "Sentiment": "positive",
            "PublishDate": 1755846150742,
            "Source": "stock"
        },
        {
            "Title": "Lokesh Machines Requests Removal from U.S. OFAC Sanctions List",
            "Summary": "Lokesh Machines has submitted a request to the U.S. Office of Foreign Assets Control (OFAC) seeking removal from the sanctions list. The company is taking formal steps to address its current sanctions status with U.S. authorities.",
            "Sentiment": "neutral",
            "PublishDate": 1755760104002,
            "Source": "stock"
        },
        {
            "Title": "Lokesh Machines Reports Q1 FY2026 Results, Announces Leadership Changes and AGM Date",
            "Summary": "Lokesh Machines Limited reported quarterly results for the period ended June 30, 2025, with revenue from operations at Rs 4,804.71 lakhs compared to Rs 6,252.55 lakhs in the same quarter last year. Net profit decreased to Rs 45.55 lakhs from Rs 103.03 lakhs year-over-year. The company operates through two segments: Machinery Division generated Rs 4,636.43 lakhs in revenue while Components Division contributed Rs 195.94 lakhs. The board recommended continuation of K. Krishna Swamy as Non-executive Director for five years from September 27, 2025 to September 26, 2030. Gurprit Singh resigned as Company Secretary effective August 14, 2025, and Pusuluru Kodanda Rami Reddy was appointed as the new Company Secretary from August 15, 2025. The 41st Annual General Meeting is scheduled for September 26, 2025 via video conferencing. The company's name remains on the US Treasury sanctions list published October 30, 2024, preventing foreign currency transactions, though removal proceedings are underway through a US law firm.",
            "Sentiment": "negative",
            "PublishDate": 1755002021700,
            "Source": "earnings"
        },
        {
            "Title": "Lokesh Machines Secures ₹18 Crore Order for MMG Supply",
            "Summary": "Lokesh Machines has received an order worth ₹18 crore for supplying MMGs (Machine Made Goods). The order represents a significant business development for the company.",
            "Sentiment": "positive",
            "PublishDate": 1754472001674,
            "Source": "order&deals"
        },
        {
            "Title": "Lokesh Machines Receives Exchange Approval for Promoter Reclassification",
            "Summary": "Lokesh Machines Limited received approval from NSE and BSE for reclassifying Ms. Sudha Rani Ganne from the Promoter Group category to Public category. The approvals were granted through letters dated July 24, 2025, from both stock exchanges. This reclassification affects the company's shareholding structure by moving a promoter group member to public shareholder status.",
            "Sentiment": "neutral",
            "PublishDate": 1753420809396,
            "Source": "corporate_governance"
        },
        {
            "Title": "Lokesh Machines Reports Significant Drop in Q3 EBITDA",
            "Summary": "Lokesh Machines has reported a substantial decline in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 9.8 million rupees, compared to 129 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin decreased from 14.96% to 1.89% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739533325000,
            "Source": "earnings"
        },
        {
            "Title": "Lokesh Machines Reports Q3 Financial Results",
            "Summary": "Lokesh Machines has reported its Q3 financial results. The company's net loss decreased to 41 million rupees, compared to 51 million rupees year-over-year and 35 million rupees quarter-over-quarter. However, the company's revenue declined to 518 million rupees from 865 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1739533244000,
            "Source": "earnings"
        }
    ]
}