{
    "Symbol": "LORDSCHLO",
    "ISIN": "INE846D01012",
    "News": [
        {
            "Title": "Lords Chloro Alkali Q3FY26 Results & Warrant Conversion",
            "Summary": "Lords Chloro Alkali reported Q3FY26 revenue of ₹9,395.22 lakhs with net profit of ₹460.91 lakhs. Company converted 35,00,000 warrants into equity shares at ₹122 each, raising ₹42,70,00,000.",
            "Sentiment": "positive",
            "PublishDate": 1770644857864,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lords Chloro Alkali Reports 59% Revenue Growth, Announces ₹165 Crore Expansion Plan",
            "Summary": "Lords Chloro Alkali Limited reported total income of ₹201 crore for H1 FY26, marking 59% year-on-year growth with operating margins improving to 20.76%. The company announced a ₹165 crore capex plan to expand caustic soda capacity from 300 to 360 tons per day, add sulfuric acid production, and install 21 MW solar capacity to achieve 40-50% renewable energy mix.",
            "Sentiment": "positive",
            "PublishDate": 1763379545330,
            "Source": "earnings"
        },
        {
            "Title": "Lords Chloro Alkali Reports Strong Q2 FY26 Results, Announces Rs 165 Crore Expansion Plan",
            "Summary": "Lords Chloro Alkali Limited reported total income of Rs 201.24 crore for H1 FY26, representing 59.22% year-on-year growth. The company's EBITDA reached Rs 41.78 crore with a margin of 20.76%, while profit after tax stood at Rs 19.49 crore, showing 743.12% year-on-year growth. For the quarter ended September 30, 2025, total income was Rs 100.77 crore (65.59% YoY growth) with EBITDA of Rs 21.09 crore and profit of Rs 9.04 crore. The Board approved a strategic Rs 165 crore capex plan including expansion of caustic soda capacity by 100 TPD, establishment of a new 100 TPD sulphuric acid plant, and expansion of solar power capacity by 21 MW. The company attributed strong performance to higher volumes, better realizations in caustic soda lye and chlorinated paraffin wax, improved fixed cost absorption, and energy cost savings from its solar power plant. Energy costs per tonne decreased by 19% year-on-year during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762797271573,
            "Source": "earnings"
        },
        {
            "Title": "Lords Chloro Alkali Reports 62% Revenue Growth, Expands Green Energy Operations",
            "Summary": "Lords Chloro Alkali reported quarterly revenue of ₹98.3 crores, representing a 62% year-over-year increase. The company's EBITDA margin improved by 1,486 basis points to 21%. The company is transforming into a green chemical company and has commissioned a 16MW solar plant at Bikaner while entering a 10MW hybrid power agreement. Power costs as a percentage of production decreased from 51% to 39%. Lords Chloro Alkali has proposed a 21MW solar project plus 100TPD sulphuric acid facility. The company announced a strategic ₹355 crore capex plan through FY28 aimed at doubling capacity, expanding CPW operations, and strengthening renewable energy integration. The company targets margin stability, product diversification, and ESG-driven leadership in the chlor-alkali and derivatives sector.",
            "Sentiment": "positive",
            "PublishDate": 1762790062798,
            "Source": "earnings"
        },
        {
            "Title": "Lords Chloro Alkali Reports Strong Q2 Performance with Net Profit Surge to 90.4M Rupees",
            "Summary": "Lords Chloro Alkali delivered robust quarterly results with net profit jumping to 90.4 million rupees from 4 million rupees year-over-year. Revenue increased significantly to 983 million rupees compared to 606 million rupees in the same period last year. EBITDA rose substantially to 186.6 million rupees from 34.6 million rupees year-over-year. The company's EBITDA margin improved markedly to 18.98% from 5.71% in the previous year period.",
            "Sentiment": "positive",
            "PublishDate": 1762783698326,
            "Source": "earnings"
        },
        {
            "Title": "Lords Chloro Alkali Expands Production Capacity with New Chemical Plants",
            "Summary": "Lords Chloro Alkali has expanded its caustic soda plant capacity by 100 tonnes per day (TPD) and established a new sulphuric acid plant with a capacity of 100 TPD. The expansion increases the company's chemical production capabilities across both product lines.",
            "Sentiment": "positive",
            "PublishDate": 1762782810412,
            "Source": "stock"
        },
        {
            "Title": "Lords Chloro Alkali Terminates Lease Agreement with Related Party Due to Regulatory and Operational Issues",
            "Summary": "Lords Chloro Alkali Limited terminated its lease agreement with Varahalakshmi Infrastructure Private Limited (VIPL), a related party, for a 10.4-acre property in Village Salhawas, Rewari. The lease was executed on March 19, 2025, for a 9-year term to set up a manufacturing unit for Chlorinated Paraffin Wax (CPW) and other chemical activities. The company cited three key reasons for termination: the lessor's failure to obtain Change of Land Use (CLU) approval for industrial purposes due to unclear Manesar Bawal Investment Region (MBIR) plan 2031-2039, inability to apply for mandatory industrial approvals and licenses without valid CLU, and water quality deficiency as testing confirmed the available water supply is brackish and unfit for CPW operations. VIPL is considered a related party as Mr. Alok Dhir, a director in VIPL, is a relative of Mr. Madhav Dhir, Whole-Time Director of Lords Chloro Alkali.",
            "Sentiment": "negative",
            "PublishDate": 1762175247446,
            "Source": "corporate_action"
        },
        {
            "Title": "Lords Chloro Alkali Board Approves ₹300 Crore Fundraising Through QIP",
            "Summary": "Lords Chloro Alkali Limited's Board of Directors approved raising funds up to ₹300 crores through qualified institutional placement of equity shares. The fundraising will be conducted in one or more tranches, subject to necessary approvals including member approval and regulatory clearances. The board meeting was held on August 27, 2025, and concluded with the announcement that the company's 46th Annual General Meeting is scheduled for September 22, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1756293654618,
            "Source": "corporate_action"
        },
        {
            "Title": "Lords Chloro Alkali Board to Meet on August 27, 2025 for Fundraising Discussion",
            "Summary": "Lords Chloro Alkali has scheduled a board meeting for August 27, 2025, to consider a fundraising proposal. The company will evaluate potential funding options during this meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1755868575967,
            "Source": "corporate_action"
        },
        {
            "Title": "Lords Chloro Alkali Completes Acquisition of 95.2 Lakh Shares in CGE II Hybrid Energy",
            "Summary": "Lords Chloro Alkali Limited has completed the purchase of 95,20,202 equity shares of CGE II Hybrid Energy Private Limited in demat form on July 31, 2025. This acquisition was part of a previously announced Power Supply Agreement and Share Purchase Agreement that was executed on March 19, 2025. The company notified stock exchanges BSE and NSE about the completion of this share purchase transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1753977941059,
            "Source": "order&deals"
        },
        {
            "Title": "Lords Chloro Alkali Reports Strong Q1 Performance with 422% Jump in Net Profit",
            "Summary": "Lords Chloro Alkali delivered robust quarterly results with net profit surging to 104.5 million rupees from 20 million rupees in the same period last year. Revenue grew significantly to 1 billion rupees compared to 650 million rupees year-over-year. The company's EBITDA jumped to 204 million rupees from 45.4 million rupees, while EBITDA margin expanded substantially to 20.37% from 6.98% in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753103003116,
            "Source": "earnings"
        },
        {
            "Title": "Lords Chloro Alkali to Expand CPW Manufacturing Capacity",
            "Summary": "Lords Chloro Alkali has received approval to expand its CPW (Caustic Potash Wafer) manufacturing capacity. The company plans to invest ₹300 million to increase production capacity from 50 TPD (Tonnes Per Day) to 100 TPD.",
            "Sentiment": "positive",
            "PublishDate": 1750166205000,
            "Source": "default"
        },
        {
            "Title": "Lords Chloro Alkali Approves Power Supply and Share Purchase Agreement",
            "Summary": "Lords Chloro Alkali has approved a Power Supply and Share Purchase Agreement with CGE II Hybrid Energy. This agreement likely involves the company securing a power supply source and potentially acquiring shares in CGE II Hybrid Energy, which could impact the company's operations and financial structure.",
            "Sentiment": "positive",
            "PublishDate": 1742429132000,
            "Source": "corporate_action"
        },
        {
            "Title": "Lords Chloro Alkali Approves Power Supply and Share Purchase Agreement",
            "Summary": "Lords Chloro Alkali has approved a Power Supply and Share Purchase Agreement with CGE II Hybrid Energy. This decision suggests the company is taking steps to secure its energy supply, potentially through a renewable or hybrid energy source, which could impact its operational efficiency and costs.",
            "Sentiment": "positive",
            "PublishDate": 1742384137000,
            "Source": "corporate_action"
        },
        {
            "Title": "Lords Chloro Alkali Reports Significant EBITDA Improvement in Q3",
            "Summary": "Lords Chloro Alkali has reported a substantial improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) showed a gain of 61 million rupees, compared to a loss of 17 million rupees in the same period last year. Additionally, the Q3 EBITDA margin stood at 9.35%, indicating a positive trend in the company's operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739195192000,
            "Source": "earnings"
        },
        {
            "Title": "Lords Chloro Alkali Reports Profit in Q3 FY2024",
            "Summary": "Lords Chloro Alkali has reported a net profit of 13 million rupees in the third quarter, compared to a loss of 32 million rupees in the same period last year. The company's revenue increased to 648 million rupees from 582 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739195188000,
            "Source": "earnings"
        },
        {
            "Title": "Lords Chloro Alkali Expands Production Capacity to 300 TPD",
            "Summary": "Lords Chloro Alkali has successfully increased its production capacity to 300 tonnes per day (TPD) by operationalizing a 90 TPD capacity expansion. This significant increase in production capacity demonstrates the company's commitment to growth and meeting market demand.",
            "Sentiment": "positive",
            "PublishDate": 1735259053000,
            "Source": "corporate_action"
        },
        {
            "Title": "Lords Chloro Alkali Expands Production Capacity to 300 TPD",
            "Summary": "Lords Chloro Alkali has successfully increased its production capacity to 300 tonnes per day (TPD). The company has operationalized a 90 TPD capacity expansion, contributing to this significant growth in their manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1735229106000,
            "Source": "corporate_action"
        }
    ]
}