{
    "Symbol": "LOTUSDEV",
    "ISIN": "INE0V9Q01010",
    "News": [
        {
            "Title": "Sri Lotus Developers Wins Lokhandwala Project",
            "Summary": "Sri Lotus Developers and Realty Limited has been appointed as developer for a mixed-use redevelopment project in Lokhandwala, Andheri (W), featuring premium residential and commercial spaces.",
            "Sentiment": "positive",
            "PublishDate": 1770792028559,
            "Source": "stocks"
        },
        {
            "Title": "Sri Lotus Developers Grants 36.86 Lakh Stock Options",
            "Summary": "Sri Lotus Developers and Realty Limited's Nomination and Remuneration Committee approved the grant of 36,86,222 stock options to eligible employees under ESOP 2024 scheme on February 07, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770460822515,
            "Source": "stocks"
        },
        {
            "Title": "Sri Lotus Developers shares rise 4% on GIFT City project",
            "Summary": "Sri Lotus Developers shares gained over 4% after announcing a large-scale development project in GIFT City, Gujarat, marking its expansion outside Mumbai with Abhishek Bachchan partnership.",
            "Sentiment": "positive",
            "PublishDate": 1767778796037,
            "Source": "stocks"
        },
        {
            "Title": "Sri Lotus Signs Ultra-Luxury Redevelopment Project",
            "Summary": "Sri Lotus Developers & Realty signs redevelopment project in Lokhandwala, Andheri (W), aiming to create ultra-luxury development that will redefine premium living standards.",
            "Sentiment": "positive",
            "PublishDate": 1767595278069,
            "Source": "stocks"
        },
        {
            "Title": "Sri Lotus Developers Invests Rs 50 Lakh in Five Wholly Owned Subsidiaries",
            "Summary": "Sri Lotus Developers and Realty Limited made initial share subscriptions totaling Rs 50 lakh across five newly incorporated wholly owned subsidiaries on November 14, 2025. The subsidiaries - Asvi Projects, Sonnet Projects, Avion Realty, Arahan Projects, and Rise Root Projects - will expand the company's real estate development business for residential and commercial projects.",
            "Sentiment": "positive",
            "PublishDate": 1763210927695,
            "Source": "order&deals"
        },
        {
            "Title": "Sri Lotus Developers Reports 126% YoY Pre-Sales Growth in Q2, Launches Two New Projects",
            "Summary": "Sri Lotus Developers and Realty Limited reported pre-sales of Rs. 257 crores for the quarter ended September 2025, marking 126% year-on-year growth. Revenue stood at Rs. 176 crores, up 43% year-on-year. The company launched two projects in September 2025 - Arcadian at Juhu (Rs. 92 crores bookings in first week, estimated GDV Rs. 700 crores) and Amalfi at Versova (Rs. 38 crores bookings in first week, GDV potential Rs. 300 crores). Collections for the quarter were Rs. 106 crores, growing 16% year-on-year. EBITDA was Rs. 50 crores with margins at 28.6%. The company maintains guidance of pre-sales between Rs. 1,100-1,300 crores for FY26, revenue growth of 75-85% year-on-year, and profit after tax growth of 30-35% year-on-year. Four upcoming launches are planned for H2 FY26 with combined revenue potential of Rs. 3,500-3,700 crores. The company added six new projects during the year with estimated GDV of Rs. 5,000 crores. Net cash position stands at Rs. 851 crores.",
            "Sentiment": "positive",
            "PublishDate": 1763025286011,
            "Source": "earnings"
        },
        {
            "Title": "Sri Lotus Developers Reports IPO Proceeds Utilization for Q2 FY26",
            "Summary": "Sri Lotus Developers and Realty Limited submitted its monitoring agency report for the quarter ended September 30, 2025, regarding the utilization of proceeds from its ₹792 crore Initial Public Offer. The company utilized ₹95.27 crore during the quarter, with ₹143.71 crore invested in subsidiaries Richfeel Real Estate, Dhyan Projects, and Tryksha Real Estate for construction and development costs of ongoing projects Amalfi, The Arcadian, and Varun. Additionally, ₹5 crore was used for advance tax payments and ₹53.33 crore for issue-related expenses. The monitoring agency CARE Ratings Limited reported no deviation from stated objectives, with unutilized funds of ₹696.73 crore deployed in fixed deposits and current accounts. The company's IPO was conducted from July 30 to August 1, 2025, focusing on residential and commercial real estate projects.",
            "Sentiment": "neutral",
            "PublishDate": 1762854886447,
            "Source": "corporate_action"
        },
        {
            "Title": "Sri Lotus Developers Reports Strong Q2 Performance with 126% YoY Pre-Sales Growth",
            "Summary": "Sri Lotus Developers delivered robust quarterly results with pre-sales reaching INR 257 crores, growing 126% year-on-year, and collections of INR 106 crores. Revenue for the quarter stood at INR 176 crores, up 44% YoY, while profit for the period was INR 46 crores. The company launched two new projects - The Arcadian in Juhu and Amalfi in Versova - which generated bookings of INR 92 crores and INR 38 crores respectively within the first week. The company maintains its annual guidance of INR 1,100-1,300 crores in pre-sales, 75-85% YoY revenue growth, and 30-35% YoY profit growth. Sri Lotus added six new projects during the current year and holds a net cash position of INR 851 crores. The company plans to launch four new projects in the second half including Project Varun, Lotus Aquaria, Lotus Celestial, and Lotus Trident.",
            "Sentiment": "positive",
            "PublishDate": 1762818968012,
            "Source": "earnings"
        },
        {
            "Title": "Sri Lotus Developers Reports Strong Q2 Results, Approves Rs 3,000 Crore Investment Limit for Subsidiaries",
            "Summary": "Sri Lotus Developers and Realty Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company's board approved increasing investment limits for providing loans, guarantees, and securities to wholly owned subsidiaries under Section 186(3) of the Companies Act to Rs 3,000 crores. This enhancement aligns with the company's growth strategy to implement and expand projects while meeting ongoing business requirements and ensuring adequate financial flexibility for project-specific subsidiaries. The company operates solely in real estate development and completed its IPO in August 2025, raising Rs 7,920 million through fresh equity issue. Post-quarter end, the company incorporated five new wholly owned subsidiaries for real estate development business.",
            "Sentiment": "positive",
            "PublishDate": 1762818072251,
            "Source": "earnings"
        },
        {
            "Title": "Sri Lotus Developers Projects 75-85% Revenue Growth for FY26 with Strong Mumbai Pipeline",
            "Summary": "Sri Lotus Developers has provided guidance for robust growth with FY26 revenue expected to rise 75-85% year-on-year and profit after tax (PAT) projected to increase 30-35%. The company has a strong pipeline valued at ₹13,000-14,000 crore gross development value (GDV) across premium Mumbai micro-markets. Four new project launches are planned for the second half, including developments in Bandra and Prabhadevi. The company has set pre-sales guidance of ₹1,100-1,300 crore and maintains ₹851 crore in net cash. Sri Lotus operates with a rapid execution model that delivers projects 12-18 months ahead of schedule.",
            "Sentiment": "positive",
            "PublishDate": 1762787707312,
            "Source": "stock"
        },
        {
            "Title": "Sri Lotus Developers Reports 80% Jump in Q2 Net Profit to 461.5M Rupees",
            "Summary": "Sri Lotus Developers reported consolidated net profit of 461.5 million rupees in Q2, up from 256 million rupees in the same period last year. Revenue increased significantly to 1.76 billion rupees from 613 million rupees year-over-year. EBITDA rose to 504 million rupees compared to 294.5 million rupees previously. However, EBITDA margin declined to 28.63% from 48.04% in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1762782817030,
            "Source": "earnings"
        },
        {
            "Title": "Sri Lotus Developers Incorporates Wholly Owned Subsidiary Rise Root Projects",
            "Summary": "Sri Lotus Developers and Realty Limited has incorporated a wholly owned subsidiary company named Rise Root Projects Private Limited on November 07, 2025. The subsidiary has an authorized and paid-up capital of Rs. 10 lakh, consisting of 1 lakh equity shares of Rs. 10 each. Rise Root Projects will operate in the real estate sector, focusing on development and redevelopment of residential and commercial projects. The newly incorporated entity has not yet commenced business operations. The acquisition involves 100% cash consideration and does not fall under related party transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1762580865146,
            "Source": "corporate_action"
        },
        {
            "Title": "Sri Lotus Developers Incorporates Wholly Owned Subsidiary Yarahan Projects",
            "Summary": "Sri Lotus Developers and Realty Limited incorporated a wholly owned subsidiary named Yarahan Projects Private Limited on November 6, 2025. The new subsidiary operates in real estate development and redevelopment of residential and commercial projects. The company has an authorized and paid-up capital of Rs. 10 lakh, consisting of 1 lakh equity shares with a face value of Rs. 10 each. Sri Lotus Developers holds 100% shareholding through cash consideration of Rs. 10 lakh. The newly incorporated entity has not yet commenced business operations and has no turnover history.",
            "Sentiment": "neutral",
            "PublishDate": 1762495823021,
            "Source": "stock"
        },
        {
            "Title": "Sri Lotus Developers Incorporates Two Wholly Owned Subsidiaries for Real Estate Expansion",
            "Summary": "Sri Lotus Developers and Realty Limited has incorporated two wholly owned subsidiary companies in India. Sonnet Projects Private Limited was incorporated on November 3, 2025, and Avion Realty Private Limited on November 4, 2025. Both subsidiaries have an authorized capital of Rs. 10 lakh and paid-up capital of Rs. 10 lakh, comprising 1 lakh equity shares of Rs. 10 each. The subsidiaries will operate in real estate development for residential and commercial projects. Both companies are newly incorporated and have yet to commence business operations. The acquisition cost for each subsidiary is Rs. 10 lakh through 100% cash subscription to equity share capital.",
            "Sentiment": "positive",
            "PublishDate": 1762251505750,
            "Source": "corporate_action"
        },
        {
            "Title": "Sri Lotus Developers Creates New Subsidiary Asvi Projects for Real Estate Expansion",
            "Summary": "Sri Lotus Developers has established a new subsidiary called Asvi Projects Pvt. Ltd. The new entity is intended to support the company's growth in real estate and redevelopment activities.",
            "Sentiment": "positive",
            "PublishDate": 1761740304291,
            "Source": "stock"
        },
        {
            "Title": "Sri Lotus Developers And Realty Board Approves Five New Subsidiaries With ₹100 Crore Investment Plan Each",
            "Summary": "Sri Lotus Developers And Realty's board has approved the creation of five new subsidiaries. The company plans to invest up to ₹100 crore in each subsidiary as part of its growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1760012109729,
            "Source": "stock"
        },
        {
            "Title": "Sri Lotus Developers Launches Two Projects With ₹1.30 Billion In Bookings",
            "Summary": "Sri Lotus Developers And Realty has launched two real estate projects - Arcadian and Amalfi - generating ₹1.30 billion in bookings. The company estimates the Gross Development Value (GDV) of Arcadian project in Juhu at ₹700 crore and Amalfi project in Versova at ₹300 crore. The developer plans to launch another project called Varun in Q3 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1759244607553,
            "Source": "stock"
        },
        {
            "Title": "Sri Lotus Developers Appointed for Bandstand Redevelopment Project in Mumbai",
            "Summary": "Sri Lotus Developers and Realty Limited has been appointed as the developer for a redevelopment project at Bandstand, Bandra (West) in Mumbai. The company described this as adding to its portfolio of prestigious projects. Additional project details will be disclosed later.",
            "Sentiment": "positive",
            "PublishDate": 1759211905694,
            "Source": "stock"
        },
        {
            "Title": "Sri Lotus Developers Signs Ultra-Luxury Redevelopment Agreement in Mumbai's Bandra West",
            "Summary": "Sri Lotus Developers And Realty has signed an agreement for an ultra-luxury redevelopment project located in Bandra West, Mumbai. The project is planned to include premium design elements and high-end amenities.",
            "Sentiment": "positive",
            "PublishDate": 1758793774703,
            "Source": "stock"
        },
        {
            "Title": "Sri Lotus Developers Appointed for Ultra-Luxury Re-development Project in Mumbai's Bandra West",
            "Summary": "Sri Lotus Developers and Realty Limited has been appointed as the developer for a re-development project in Mumbai's Bandra West, near the Bandstand Promenade. The company aims to create an ultra-luxury development featuring world-class design, premium amenities, and an exclusive address that redefines premium living. The project is located in the heart of Bandra West. Additional project details will be disclosed later.",
            "Sentiment": "positive",
            "PublishDate": 1757422354899,
            "Source": "stock"
        },
        {
            "Title": "Sri Lotus Developers Uploads Q1 FY2026 Earnings Call Recording for Investor Access",
            "Summary": "Sri Lotus Developers and Realty Limited has uploaded the audio recording of their earnings call for the quarter ended June 30, 2025, to their website. The earnings call was held on August 28, 2025, at 11:00 A.M. IST. The Mumbai-based real estate development company made the recording available on their investor relations website to comply with SEBI regulations. The company, which was formerly known as AKP Holdings Limited, is listed on both BSE and NSE with scrip code 544469 and symbol LOTUSDEV.",
            "Sentiment": "neutral",
            "PublishDate": 1756369255042,
            "Source": "earnings"
        },
        {
            "Title": "Sri Lotus Developers Reports Q1 FY26 Results, Provides Strong Growth Guidance",
            "Summary": "Sri Lotus Developers and Realty Limited reported Q1 FY26 results with revenue of ₹61 crores and profit after tax of ₹26 crores. The company achieved pre-sales of ₹61 crores with collections of ₹70 crores during the quarter. The Board approved unaudited financial results and appointed M/s Vishal N Manseta as Secretarial Auditors for five years. The company has three significant project launches lined up by September 2025 - The Arcadian (Juhu), Amalfi (Versova), and Varun (Bandra) - with total saleable carpet area of 2.2 lakh sq. ft. and estimated gross development value of ₹1,400-1,500 crores. During the financial year, the company added four new projects through development agreements and developer appointments. For FY26, management provided guidance of pre-sales between ₹1,100-1,300 crores (125-165% year-on-year growth), revenue growth of 75-85%, and profit after tax growth of 30-35%. The company maintains a net debt-free status with net cash balance of ₹905 crores. Chairman Anand K Pandit highlighted the company's stock exchange listing on August 6, 2025, and expressed confidence in achieving targets through their redevelopment-focused business model in Mumbai's luxury real estate segment.",
            "Sentiment": "positive",
            "PublishDate": 1756218221623,
            "Source": "earnings"
        },
        {
            "Title": "Sri Lotus Developers Reports 36% Decline in Q1 Net Profit Despite Improved EBITDA Margin",
            "Summary": "Sri Lotus Developers reported Q1 consolidated net profit of 256 million rupees, down from 401 million rupees in the same period last year. Revenue fell to 613 million rupees from 1.21 billion rupees year-over-year. EBITDA decreased to 295 million rupees from 527 million rupees, though EBITDA margin improved to 48.04% from 43.71% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1756217767412,
            "Source": "earnings"
        }
    ]
}