{
    "Symbol": "LOTUSEYE",
    "ISIN": "INE947I01017",
    "News": [
        {
            "Title": "Lotus Eye Hospital Reports Q3FY26 Loss of ₹26.07 Lakhs",
            "Summary": "Lotus Eye Hospital posted a net loss of ₹26.07 lakhs in Q3FY26 despite 10.64% revenue growth to ₹1,354.96 lakhs. Nine-month performance remained positive with ₹39.99 lakhs profit.",
            "Sentiment": "negative",
            "PublishDate": 1770816332065,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lotus Eye Hospital CS M Achuth Menon Resigns",
            "Summary": "Lotus Eye Hospital announces resignation of Company Secretary & Compliance Officer M Achuth Menon due to personal reasons, effective February 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770811577877,
            "Source": "stocks"
        },
        {
            "Title": "Vramath Financial Services Acquires 10.02% Stake",
            "Summary": "Vramath Financial Services Private Limited acquired 20,84,835 equity shares (10.02%) in Lotus Eye Hospital and Institute Limited through open market transactions, increasing total holding to 10.03%.",
            "Sentiment": "neutral",
            "PublishDate": 1770355997843,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lotus Eye Hospital Board Meet Set for Feb 11, 2026",
            "Summary": "Lotus Eye Hospital And Institute Limited has scheduled a board meeting for February 11, 2026, to consider Q3FY26 unaudited financial results. Trading window will reopen from February 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769754730194,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lotus Eye Hospital Promoter Share Transfer Disclosed",
            "Summary": "Sangeetha Sundaramoorthy to acquire 14.29 lakh shares from fellow promoter Kavetha Sundaramoorthy at Rs 70 per share, increasing stake to 35.01% under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769505442661,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lotus Eye Hospital Postal Ballot Results Announced",
            "Summary": "All three director appointments approved with 99.07% majority in postal ballot voting. Dr S Natesan reappointed as Independent Director for second term, Dr KS Ramalingam appointments confirmed.",
            "Sentiment": "positive",
            "PublishDate": 1765888327598,
            "Source": "stocks"
        },
        {
            "Title": "Lotus Eye Hospital Fined Rs 2.95 Lakh Each by BSE and NSE for Regulatory Non-Compliance",
            "Summary": "Bombay Stock Exchange and National Stock Exchange imposed fines of Rs 2,95,000 each (inclusive of GST) on Lotus Eye Hospital and Institute Limited for non-compliance of Regulation 17(1A) of SEBI LODR 2015. The company stated there is no material impact on its financial operations from these penalties.",
            "Sentiment": "negative",
            "PublishDate": 1765172289069,
            "Source": "corporate_governance"
        },
        {
            "Title": "Lotus Eye Hospital Fined Rs 2.95 Lakh Each by BSE and NSE for Regulatory Non-Compliance",
            "Summary": "BSE and NSE imposed fines of Rs 2,95,000 each (inclusive of GST) on Lotus Eye Hospital and Institute Limited for non-compliance of Regulation 17(1A) of SEBI LODR 2015. The company stated there is no material impact on its financial operations from these penalties.",
            "Sentiment": "negative",
            "PublishDate": 1764659958861,
            "Source": "corporate_governance"
        },
        {
            "Title": "Lotus Eye Hospital Reports Quarterly Results for September 2025",
            "Summary": "Lotus Eye Hospital and Institute Limited announced its unaudited standalone results for the quarter ended September 30, 2025. The company reported revenue from operations of Rs 1,303.84 lakhs for the quarter, compared to Rs 1,351.69 lakhs in the previous quarter and Rs 1,291.24 lakhs in the same quarter last year. For the half-year period, revenue stood at Rs 2,655.53 lakhs versus Rs 2,580.31 lakhs in the previous year. The company's total assets increased to Rs 7,151.48 lakhs as of September 30, 2025, from Rs 6,957.37 lakhs as of March 31, 2025. Basic earnings per share for the quarter was Rs 0.06, while diluted earnings per share was also Rs 0.06. The Board of Directors approved these results at their meeting held on November 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762959910981,
            "Source": "earnings"
        },
        {
            "Title": "Lotus Eye Hospital Reports 28th AGM with Revenue Growth and New Center Launch",
            "Summary": "Lotus Eye Hospital and Institute Limited held its 28th Annual General Meeting chaired by Ms. Kavetha Sundaramoorthy. The company reported revenue growth from Rs 48.21 crores to Rs 49.56 crores in FY 2024-25, achieving a net profit of Rs 73.93 lakhs with a margin of 1.459%. The company opened its 9th center in Karur on July 12, 2024, and invested Rs 5.57 crores in capital assets during the year. Total expenses increased by Rs 3.99 crores, primarily due to the new branch opening and higher manpower costs. The meeting approved the re-appointment of Dr. Kavetha Sundaramoorthy as director, appointment of secretarial auditors for 5 years, and remuneration of Rs 1,00,000 for Non-Independent Non-Executive Director KS Ramalingam. The CFO indicated a robust outlook for 2025-26 with expectations of enhanced wealth creation for shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1758630015913,
            "Source": "corporate_action"
        },
        {
            "Title": "Mixed Financial Results: Rane Holdings Reports Strong Growth While Scoobee Day and Oswal Overseas Post Losses",
            "Summary": "Rane Holdings Limited reported strong quarterly results with total income rising to Rs 1,34,554 lakhs from Rs 83,744 lakhs year-over-year, and net profit after tax increasing to Rs 5,749 lakhs from Rs 1,950 lakhs. Earnings per share improved significantly to Rs 35.57 from Rs 9.19. In contrast, Scoobee Day Garments posted a net loss of Rs 240.90 lakhs for the quarter compared to Rs 209.92 lakhs loss in the previous year, with total income declining to Rs 61.45 lakhs from Rs 2,870.65 lakhs. Oswal Overseas Limited also reported a net loss of Rs 232.16 lakhs versus Rs 209.92 lakhs loss in the prior year period. All three companies announced their quarterly results following board meetings held on August 12, 2025.",
            "Sentiment": "mixed",
            "PublishDate": 1755074536932,
            "Source": "earnings"
        },
        {
            "Title": "Lotus Eye Hospital Reports Quarterly Results with Net Profit of Rs 54.48 Lakhs",
            "Summary": "Lotus Eye Hospital and Institute Limited's Board approved unaudited standalone results for the quarter and year ended June 30, 2025. The company reported revenue from operations of Rs 1,151.25 lakhs for the quarter, compared to Rs 1,289.07 lakhs in the previous year quarter. Net profit for the quarter stood at Rs 54.48 lakhs versus Rs 62.34 lakhs in the corresponding quarter last year. For the full year, revenue from operations was Rs 4,956.25 lakhs with net profit of Rs 73.93 lakhs. The company's paid-up equity share capital remains at Rs 2,079.63 lakhs with basic earnings per share of Rs 0.26 for the quarter. Total comprehensive income for the quarter was Rs 52.31 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1755005163083,
            "Source": "earnings"
        }
    ]
}