{
    "Symbol": "LOYALTEX",
    "ISIN": "INE970D01010",
    "News": [
        {
            "Title": "Loyal Textiles clarifies COO resignation disclosure",
            "Summary": "Loyal Textiles Limited provides clarification to BSE regarding delayed submission of resignation letter for former COO R.M. Shanmugam, citing difficulties in obtaining the document from separated employee.",
            "Sentiment": "neutral",
            "PublishDate": 1768204669748,
            "Source": "stocks"
        },
        {
            "Title": "Loyal Textile Mills Reports Narrowed Losses Despite Export Challenges in Q2 FY2025",
            "Summary": "Loyal Textile Mills Limited announced quarterly results for the period ended September 30, 2025. The company reported a standalone net loss of Rs 9.66 crores compared to Rs 25.14 crores in the previous quarter, showing improvement. Revenue from operations stood at Rs 10.65 crores versus Rs 13.54 crores in the prior quarter. The company recorded exceptional income of Rs 10.72 crores from sale of windmills and plant machinery, while making a provision of Rs 10.22 crores for export inventory affected by recent tariff developments on textile imports from India. Management highlighted progress in business realignment by exiting low-margin operations and focusing on high-value technical textiles and protective garments, with EBITDA turning positive during the quarter. The company continues asset monetization plans to strengthen liquidity and expects to achieve profitability in the coming year based on implemented measures and strong order book.",
            "Sentiment": "neutral",
            "PublishDate": 1762907967008,
            "Source": "earnings"
        },
        {
            "Title": "Loyal Textile Mills Reports Rs 25.19 Crore Loss in Q1, Approves Asset Sale and AGM Date",
            "Summary": "Loyal Textile Mills Limited reported a standalone net loss of Rs 25.19 crore for the quarter ended June 30, 2025, compared to a loss of Rs 19.02 crore in the same period last year. Revenue from operations declined to Rs 135.2 crore from Rs 196.08 crore year-on-year. The company's consolidated net loss was Rs 17.01 crore. The Board approved scheduling the 79th AGM for September 26, 2025, appointed Messrs. A.Mohan Kumar & Associates as Secretarial Auditors for five years, and approved the sale of manufacturing units at Menakur Village, Andhra Pradesh and Arasanur, Tamil Nadu, subject to shareholder approval. Management cited global demand slowdown, lower capacity utilization, and margin pressures as key challenges. The company is implementing a structured plan to exit low-margin operations, consolidate production, and focus on high-value technical textiles and protective garments.",
            "Sentiment": "negative",
            "PublishDate": 1755012468964,
            "Source": "earnings"
        }
    ]
}