{
    "Symbol": "LPDC",
    "ISIN": "INE197J01017",
    "News": [
        {
            "Title": "Landmark Property Q3FY26 Results Show Strong Recovery",
            "Summary": "Landmark Property Development reports ₹25.22 lacs net profit in Q3FY26 vs ₹13.44 lacs in Q3FY25, with revenue rising to ₹158.60 lacs from ₹46.49 lacs year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1769699257523,
            "Source": "co_actions_results"
        },
        {
            "Title": "Landmark Property Development Reports Net Loss of Rs 3.27 Lacs in Q2",
            "Summary": "Landmark Property Development Company Limited reported a net loss of Rs 3.27 lacs for the quarter ended September 30, 2025, compared to a net loss of Rs 387.50 lacs in the same quarter last year. The company's total income for the quarter was Rs 15.46 lacs, consisting entirely of other income with no revenue from operations. For the half-year period, the company recorded a net loss of Rs 3.98 lacs on total income of Rs 32.08 lacs. The company operates primarily in real estate development. The auditors highlighted concerns regarding recoverability of advances worth Rs 3,526.15 lacs from Ansal Landmark (Karnal) Township, against which the company has made provisions of Rs 1,600 lacs, leaving a net amount of Rs 1,926.15 lacs. The company's paid-up equity share capital stands at Rs 1,341.43 lacs with basic and diluted earnings per share of negative Rs 0.002 for the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762810653988,
            "Source": "earnings"
        },
        {
            "Title": "Landmark Property Development Reports Loss of Rs 0.68 Lacs in Q1 FY2026",
            "Summary": "Landmark Property Development Company Limited reported a net loss of Rs 0.68 lacs for the quarter ended June 30, 2025, compared to a profit of Rs 5.72 lacs in the same quarter last year. Total income decreased to Rs 16.62 lacs from Rs 32.00 lacs year-over-year. Revenue from operations fell to Rs 11.95 lacs from Rs 40.94 lacs in the previous quarter. The company operates primarily in real estate development. Earnings per share stood at negative Rs 0.001. The auditors highlighted concerns regarding recoverability of space booking advances of Rs 3,526.15 lacs from Ansal Landmark (Karnal) Township Pvt. Ltd, with provisions of Rs 1,600 lacs already made. The company faces ongoing legal disputes related to mining operations in Odisha involving demands totaling Rs 118.95 lacs.",
            "Sentiment": "negative",
            "PublishDate": 1754656514897,
            "Source": "earnings"
        }
    ]
}