{
    "Symbol": "LT",
    "ISIN": "INE018A01030",
    "News": [
        {
            "Title": "L&T Sets Up Offshore Wind Subsidiary in Netherlands",
            "Summary": "Larsen & Toubro incorporated wholly owned subsidiary L&T Energy Offshore Wind B.V. in Netherlands on February 10, 2026, with 1 EURO paid-up capital to engage in offshore wind EPCIC services.",
            "Sentiment": "positive",
            "PublishDate": 1770722068498,
            "Source": "stocks"
        },
        {
            "Title": "L&T Sees ₹50.96 Crore NSE Block Trade at ₹4050.20",
            "Summary": "Larsen & Toubro witnessed a significant block trade on NSE worth ₹50.96 crores involving 125,823 shares at ₹4050.20 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770360213654,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T CFO Expects 10% Government Capex Boost in FY27",
            "Summary": "Larsen & Toubro's CFO R Shankar Raman anticipates 10% increase in government capital expenditure for FY27, dismissing resource crowding concerns amid ample system liquidity.",
            "Sentiment": "positive",
            "PublishDate": 1769923848049,
            "Source": "stocks"
        },
        {
            "Title": "L&T Reports Record Q3 Order Inflow of ₹1.36 Lakh Crore",
            "Summary": "Larsen & Toubro achieved highest-ever quarterly order inflow of ₹135,581 crore with 17% growth, revenues of ₹71,450 crore up 10%, and recurring PAT of ₹4,406 crore rising 31% for Q3 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1769603879056,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Block Trade Worth Rs. 23.89 Crores on NSE",
            "Summary": "Larsen & Toubro witnessed a significant block trade on NSE involving 62,744 shares at Rs. 3,808.00 per share, totaling Rs. 23.89 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1769576336491,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Allots 30,657 Shares Under ESOP Schemes",
            "Summary": "Larsen & Toubro's Nomination & Remuneration Committee approved allotment of 30,657 equity shares to employees who exercised stock options under the company's Employee Stock Option Schemes.",
            "Sentiment": "neutral",
            "PublishDate": 1769573994932,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Wins Major Riyadh Metro Extension Contract",
            "Summary": "Larsen & Toubro's Heavy Civil Infrastructure business secures major contract from Royal Commission of Riyadh City for Red Line metro extension project worth ₹5,000-10,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769572651944,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Q3FY26 Preview: Strong Growth Expected",
            "Summary": "Larsen & Toubro anticipated to deliver robust Q3FY26 earnings driven by healthy execution momentum and improving margins, despite subdued order announcements during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1769420519244,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T shares decline 1.50% amid heavy trading volume",
            "Summary": "Larsen & Toubro shares fell 1.50% to ₹3,736.80 with over 14 lakh shares traded on NSE. The engineering giant reported revenue of ₹67,983.53 crores and net profit of ₹4,687.09 crores in Sep 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769163461888,
            "Source": "stocks"
        },
        {
            "Title": "L&T Pays ₹288 Cr Interest on Non-Convertible Debentures",
            "Summary": "Larsen & Toubro successfully completed interest payment of ₹288 crores on its non-convertible debentures on January 22, 2026, as per scheduled due date under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769074001976,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Completes Acquisition of Sapura Shipping Stake",
            "Summary": "Larsen & Toubro has completed the acquisition of 6,35,41,233 shares from Sapura Nautical Power Pte Ltd in L&T Sapura Shipping Private Limited, making it a wholly owned subsidiary effective January 21, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768991532944,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Shareholders Approve All 7 Resolutions in Postal Ballot",
            "Summary": "Larsen & Toubro shareholders overwhelmingly approved all seven resolutions through postal ballot, including appointment of two new independent directors and approval of material related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1768827418598,
            "Source": "stocks"
        },
        {
            "Title": "L&T Q3 FY26 Earnings Call Set for January 28, 2026",
            "Summary": "Larsen & Toubro has scheduled its Q3/9M FY26 earnings conference call for January 28, 2026, to be conducted virtually for analysts and institutional investors as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1768540447830,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T shares gain after second large order in three days",
            "Summary": "L&T shares rise 1.1% following Petronet LNG storage tank order worth ₹2,500-5,000 crores, marking second large order after Torrent Energy's 3,000 MW pumped storage project win on Wednesday.",
            "Sentiment": "positive",
            "PublishDate": 1768536609196,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Auditors M S K A & Associates Convert to LLP",
            "Summary": "Larsen & Toubro announces statutory auditors M S K A & Associates have converted to Limited Liability Partnership structure effective January 13, 2026, with no change in audit engagement.",
            "Sentiment": "neutral",
            "PublishDate": 1768483721310,
            "Source": "stocks"
        },
        {
            "Title": "L&T Records ₹19.43 Cr NSE Block Trade at Premium",
            "Summary": "Larsen & Toubro witnessed a significant block trade worth ₹19.43 crores on NSE, involving 50,060 shares at ₹3,881.20 per share, indicating institutional interest in the infrastructure major.",
            "Sentiment": "neutral",
            "PublishDate": 1768366690461,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Wins Large Order Amid Middle East Concerns",
            "Summary": "Larsen & Toubro secures major pumped storage project worth ₹2,500-5,000 crore while analysts cut estimates due to Kuwait order cancellation risks affecting future growth prospects.",
            "Sentiment": "neutral",
            "PublishDate": 1768364955781,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Wins Large Contract for 3000 MW Pumped Storage Project",
            "Summary": "Larsen & Toubro's Heavy Civil Infrastructure business secured a large contract from Torrent Energy Storage Solutions for India's biggest pumped storage project - the 3000 MW Saidongar-1 PSP in Maharashtra.",
            "Sentiment": "positive",
            "PublishDate": 1768363832145,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Faces Macro Headwinds Despite Strong Q3 Outlook",
            "Summary": "HSBC maintains hold rating on L&T with reduced target price of ₹3,900, citing decent Q3 performance expectations but flagging macro concerns affecting capex outlooks domestically and internationally.",
            "Sentiment": "neutral",
            "PublishDate": 1768362980963,
            "Source": "stocks"
        },
        {
            "Title": "L&T clarifies on $8.7bn Kuwait oil tender reports",
            "Summary": "Larsen & Toubro shares fell 3% after Kuwait oil tender cancellation reports, but company clarified projects not in its order book. Q2 FY26 showed strong performance with revenue up 10% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1768305708157,
            "Source": "stocks"
        },
        {
            "Title": "L&T clarifies Kuwait oil tender reports, stock drops 4%",
            "Summary": "Larsen & Toubro clarified that Kuwait's potential $8.7 billion oil project tender cancellations are not part of its order book. Stock fell 4% to one-month low following media reports.",
            "Sentiment": "negative",
            "PublishDate": 1768297708440,
            "Source": "stocks"
        },
        {
            "Title": "L&T clarifies Kuwait oil project tender reports",
            "Summary": "Larsen & Toubro clarifies that the Kuwait oil project tenders worth $8.7 billion discussed for potential cancellation were not part of the company's order book, responding to media reports.",
            "Sentiment": "neutral",
            "PublishDate": 1768296167042,
            "Source": "stocks"
        },
        {
            "Title": "L&T Clarifies Kuwait Oil Project Media Reports",
            "Summary": "Larsen & Toubro clarifies that $8.7 billion Kuwait oil project tenders reported in media are not part of company's order book and states it cannot comment on clients' commercial decisions.",
            "Sentiment": "neutral",
            "PublishDate": 1768295827486,
            "Source": "stocks"
        },
        {
            "Title": "L&T shares fall 3% on Kuwait oil project concerns",
            "Summary": "Larsen & Toubro shares dropped 3% to ₹3,885.50 after reports suggested Kuwait may cancel $8.7 billion oil project tenders. L&T was lowest bidder for contracts worth over $4.5 billion.",
            "Sentiment": "negative",
            "PublishDate": 1768295595576,
            "Source": "stocks"
        },
        {
            "Title": "L&T Wins ₹1,500-2,500 Cr Bridge Order in West Bengal",
            "Summary": "Larsen & Toubro secured major infrastructure order for cable-stayed bridge construction over Muri Ganga River, while stock faces pressure from Kuwait project concerns and trades down 2%.",
            "Sentiment": "neutral",
            "PublishDate": 1768284268526,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Shares Drop 3% on Kuwait Oil Project Concerns",
            "Summary": "Larsen & Toubro shares fell nearly 3% to ₹3,911 after reports of Kuwait discussing cancellation of $8.7 billion oil project tenders. L&T was reportedly lowest bidder for over $4.5 billion worth contracts.",
            "Sentiment": "negative",
            "PublishDate": 1768284106539,
            "Source": "stocks"
        },
        {
            "Title": "L&T Shares Fall 2.5% on Kuwait Oil Project Concerns",
            "Summary": "Larsen & Toubro shares declined 2.5% following reports of Kuwait potentially cancelling $8.7 billion oil project tenders where L&T was lowest bidder for $4.5 billion worth contracts. Company won significant bridge order in West Bengal.",
            "Sentiment": "negative",
            "PublishDate": 1768282453864,
            "Source": "stocks"
        },
        {
            "Title": "L&T Acquires Full Control of Shipping JV for ₹122 Cr",
            "Summary": "Larsen & Toubro announces acquisition of Sapura's 40% stake in L&T Sapura Shipping for ₹122.39 crores, making it a wholly owned subsidiary to strengthen offshore marine operations.",
            "Sentiment": "positive",
            "PublishDate": 1768210240479,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Acquires 40% Stake in Shipping JV for ₹1,224 Cr",
            "Summary": "Larsen & Toubro announces acquisition of 40% stake in L&T Sapura Shipping from Sapura Nautical Power for ₹1,223.90 crores at ₹19.26 per share, with deal completion expected by January 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768209923833,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Bags Army Order for Pinaka Rocket Systems Support",
            "Summary": "Larsen & Toubro partners with Indian Army's EME Corps for overhaul and upgrades of indigenous Pinaka Multi-Rocket Launcher Systems, supporting defence self-reliance initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1767934693498,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Partners with Indian Army on Pinaka Systems",
            "Summary": "Larsen & Toubro awarded supply order by Indian Army's Corps of EME for overhaul, upgrade and obsolescence management of indigenous Pinaka Multi-Rocket Launcher Systems in groundbreaking public-private partnership.",
            "Sentiment": "positive",
            "PublishDate": 1767847418278,
            "Source": "stocks"
        },
        {
            "Title": "L&T CFO Expects 10% Capex Growth in Budget 2026",
            "Summary": "Larsen & Toubro's CFO R Shankar Raman anticipates government will increase capital expenditure by 10% in upcoming FY27 budget, building on Rs 11 lakh crore FY26 allocation for infrastructure development.",
            "Sentiment": "positive",
            "PublishDate": 1767525749477,
            "Source": "stocks"
        },
        {
            "Title": "L&T wins orders worth up to ₹10,000 cr; stock hits high",
            "Summary": "Larsen & Toubro's Minerals & Metals business secured major orders from SAIL for EPC projects at IISCO and Bokaro Steel Plants, plus material handling equipment orders. Stock gained 11.8% in 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767331372552,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T promotes two officials to senior management roles",
            "Summary": "Larsen & Toubro announces promotion of Ms. Koneru Bhavani as Senior VP & Head, Heavy Civil Infrastructure Business and Mr. P Ramakrishnan as Senior VP, Corporate Accounts, Taxation and Investor Relations effective January 1, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767270264950,
            "Source": "stocks"
        },
        {
            "Title": "L&T bags three orders worth up to ₹15,000 crore in four days",
            "Summary": "Larsen & Toubro secured third significant order in four trading sessions, including Hyderabad Radial Road project. Stock gains 10.30% year-to-date, recovering from recent lows amid order momentum.",
            "Sentiment": "positive",
            "PublishDate": 1766985652937,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Secures Major Mumbai Metro Electrification Order",
            "Summary": "Larsen & Toubro wins significant order worth ₹1,000-2,500 crore from MMRDA for Line 4 electrification covering 24.72 km route with 22 stations, marking third successive contract in the corridor.",
            "Sentiment": "positive",
            "PublishDate": 1766588049056,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Wins Major Mumbai Metro Line 4 Electrification Order",
            "Summary": "Larsen & Toubro's Transportation Infrastructure business secures significant order from MMRDA for electrification of 24.72 km Mumbai Metro Line 4 corridor with 22 elevated stations.",
            "Sentiment": "positive",
            "PublishDate": 1766551906939,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Wins Major LLDPE/HDPE Project from BPCL",
            "Summary": "Larsen & Toubro's Hydrocarbon Onshore business secures major order from BPCL for engineering, procurement, construction and commissioning of India's largest LLDPE/HDPE Swing Unit at Bina, Madhya Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1766464010803,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Seeks Shareholder Nod for Director Appointments",
            "Summary": "Larsen & Toubro announces postal ballot for appointing two independent directors and re-appointing one, alongside approvals for material related party transactions worth ₹57,950 crores across four subsidiaries.",
            "Sentiment": "neutral",
            "PublishDate": 1766137197586,
            "Source": "stocks"
        },
        {
            "Title": "L&T Wins Multiple Large Orders for Buildings & Factories",
            "Summary": "Larsen & Toubro's Buildings & Factories business secures major orders including Acharya Shankar Museum Complex, RG Baruah Sports Complex redevelopment, and luxury residential towers in Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1765950041366,
            "Source": "co_actions_results"
        },
        {
            "Title": "Goldman Sachs Upgrades L&T to Buy, Target ₹5,000",
            "Summary": "Goldman Sachs upgrades Larsen & Toubro to buy rating with target price raised to ₹5,000 from ₹3,730, representing 34% upside potential for the infrastructure major.",
            "Sentiment": "positive",
            "PublishDate": 1765510570207,
            "Source": "stocks"
        },
        {
            "Title": "L&T Receives Approval to Transfer Entire Realty Business to L&T Realty Properties",
            "Summary": "L&T has obtained approval to move its complete realty business to L&T Realty Properties Ltd through a slump-sale transaction. The restructuring aims to create a unified and scalable realty platform to support future expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1765246187536,
            "Source": "corporate_action"
        },
        {
            "Title": "Larsen & Toubro Makes Rs 107.85 Crore Interest Payment on Non-Convertible Debentures",
            "Summary": "Larsen & Toubro paid Rs 107.85 crore as quarterly interest on its Rs 1,500 crore Non-Convertible Debentures issue with ISIN INE018A08BL4 on December 5, 2025. The payment was made on the scheduled due date, affecting debenture holders and maintaining the company's debt servicing obligations.",
            "Sentiment": "positive",
            "PublishDate": 1764915534204,
            "Source": "corporate_action"
        },
        {
            "Title": "Larsen & Toubro and BAE Systems Win Indian Army Contract for BvS10 Sindhu Vehicle Manufacturing",
            "Summary": "The Indian Army has awarded Larsen & Toubro and BAE Systems a contract to indigenously manufacture BvS10 Sindhu all-terrain vehicles at L&T's Hazira facility with comprehensive logistics support. The upgraded articulated vehicles are designed for India's diverse terrains including high altitude, desert, marshland, and amphibious environments, supporting the country's defence modernization under the Make in India initiative.",
            "Sentiment": "positive",
            "PublishDate": 1763545202599,
            "Source": "order&deals"
        },
        {
            "Title": "Larsen & Toubro Completes Interest Payment and Full Redemption of Rs. 2,000 Crore NCDs",
            "Summary": "Larsen & Toubro has completed both interest payment and full redemption of its Non-convertible Debentures worth Rs. 2,000 crore. The company paid Rs. 152.36 crore as interest and redeemed 2,00,000 NCDs at maturity. Both payments were made on November 7, 2025, ahead of the November 9, 2025 due date. The debentures carried ISIN INE018A08BK6 and the last interest payment was made on November 11, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1762525358655,
            "Source": "corporate_action"
        },
        {
            "Title": "Larsen & Toubro Gets ESG Rating Upgrade from MSCI to 'A' from 'BBB'",
            "Summary": "Larsen & Toubro announced that MSCI ESG Ratings has upgraded the company's ESG rating from BBB to A. The company disclosed this information to stock exchanges BSE and National Stock Exchange of India, with the rating rationale available on MSCI's ESG Ratings platform.",
            "Sentiment": "positive",
            "PublishDate": 1762522200836,
            "Source": "stock"
        },
        {
            "Title": "L&T Signs MoU with Holtec Asia for Heat Transfer Equipment Solutions",
            "Summary": "Larsen and Toubro's heavy engineering division signed a Memorandum of Understanding with Holtec International's Asia arm for design and build solutions for heat transfer equipment. The partnership builds on L&T's existing collaboration with Holtec for global deployment of small modular reactor (SMR)-300, supported by 810 Authorization from the US Department of Energy. The collaboration combines L&T's nuclear manufacturing capabilities with Holtec's design expertise to deliver solutions for nuclear and thermal power plants worldwide. The companies aim to develop technology that optimizes thermal regulation, maximizes cycle efficiency, and ensures reliable power plant operation. L&T also announced a separate partnership with General Atomics Aeronautical Systems to manufacture Medium Altitude Long Endurance remotely piloted aircraft systems in India for the Indian Armed Forces, with L&T as prime bidder for the ministry of defence's 87 MALE RPAS programme. L&T shares were trading 0.3% lower at ₹4,018.2, having gained 7.6% in the past month and 20.6% in the last six months.",
            "Sentiment": "positive",
            "PublishDate": 1762153245796,
            "Source": "stock"
        },
        {
            "Title": "L&T and Holtec Form Partnership for Nuclear Power Heat Transfer Solutions",
            "Summary": "L&T and Holtec have entered into a partnership to enhance heat transfer solutions specifically for the nuclear power industry. The collaboration aims to improve technological capabilities in the nuclear sector's heat management systems.",
            "Sentiment": "positive",
            "PublishDate": 1762149998388,
            "Source": "order&deals"
        },
        {
            "Title": "L&T Reports Strong Quarterly Results with 45% Order Growth, Analysts Maintain Buy Rating",
            "Summary": "Larsen and Toubro delivered steady performance in the September quarter with consolidated revenue rising 10.4% year-on-year to ₹67,983.5 crore and net profit growing 15.6% to ₹3,926.1 crore. Order inflow surged 45% to ₹1,158 billion, driven by strong Middle East demand, with international segment contributing 49% to total order book. The company is expanding into green hydrogen, semiconductors, and defence sectors while maintaining FY26 guidance of over 10% order growth, 15% revenue growth, and 8.5% margin for core E&C business. Operating margin decreased 30 basis points to 10% due to IT services portfolio compression. L&T reached agreement with Telangana government to divest Hyderabad Metro stake, with government taking ₹13,000 crore debt while L&T receives ₹2,000 crore equity. Multiple analysts maintained buy ratings with target prices ranging from ₹4,400 to ₹4,766, representing 9-18% upside from Friday's closing price of ₹4,031.2.",
            "Sentiment": "positive",
            "PublishDate": 1762131821031,
            "Source": "earnings"
        },
        {
            "Title": "L&T Partners with GA-ASI to Manufacture Military Drones in India",
            "Summary": "Larsen & Toubro (L&T) has entered into a strategic partnership with US-based General Atomics Aeronautical Systems Inc. (GA-ASI) to manufacture Medium Altitude Long Endurance (MALE) Remotely Piloted Aircraft Systems in India for the Indian armed forces. Under this collaboration, L&T will serve as the prime bidder in the Ministry of Defence's upcoming 87 MALE RPAS program, with GA-ASI as the technology partner. The partnership involves manufacturing GA-ASI's combat-proven MQ-series RPAS entirely in India, incorporating critical technology transfers and meeting indigenous content requirements aligned with the government's Atmanirbhar Bharat and Make in India initiatives. L&T Chairman & Managing Director S.N. Subrahmanyan stated the partnership offers India an opportunity to manufacture state-of-the-art unmanned platforms indigenously. GA-ASI's Dr. Vivek Lall highlighted the collaboration's role in supporting India's vision for self-reliance in aerospace manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1761884511195,
            "Source": "order&deals"
        }
    ]
}