{
    "Symbol": "LTF",
    "ISIN": "INE498L01015",
    "News": [
        {
            "Title": "L&T Finance allots 6.10 lakh equity shares under ESOP",
            "Summary": "L&T Finance Limited allotted 6,10,900 equity shares to employees under its 2013 ESOP scheme following approval by the ESOP Allotment Committee on February 01, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769959205738,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Reports Q3 Domestic Order Growth",
            "Summary": "L&T executive confirms growth in domestic orders during Q3, attributed to increased private sector demand across key business segments.",
            "Sentiment": "positive",
            "PublishDate": 1769613030527,
            "Source": "stocks"
        },
        {
            "Title": "L&T Kuwait Projects on Hold, No Order Book Impact",
            "Summary": "L&T executive confirms 4 out of 5 Kuwait projects temporarily halted but expects no impact on order book with optimistic restart outlook for current year.",
            "Sentiment": "neutral",
            "PublishDate": 1769612862105,
            "Source": "stocks"
        },
        {
            "Title": "L&T Executive Confident on FY26 Order Targets",
            "Summary": "L&T company executive expresses confidence in the firm's ability to exceed its order book targets for FY26, indicating strong business prospects and operational readiness.",
            "Sentiment": "positive",
            "PublishDate": 1769612717816,
            "Source": "stocks"
        },
        {
            "Title": "L&T Wins Major Contract Worth ₹50-100 Billion",
            "Summary": "L&T has secured a significant contract valued between ₹50 billion and ₹100 billion, marking a major business development for the engineering and construction conglomerate.",
            "Sentiment": "positive",
            "PublishDate": 1769572679096,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Finance Reports Record Q3FY26 PAT of ₹739 Cr",
            "Summary": "L&T Finance achieves highest ever quarterly core PAT of ₹760 Cr, up 21% YoY, with retail disbursements reaching record ₹22,701 Cr, up 49% YoY, driven by strong performance across all business segments.",
            "Sentiment": "positive",
            "PublishDate": 1769517080857,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Q3 Preview: Profit May Jump by a Third",
            "Summary": "L&T's Q3 FY26 profit expected to grow nearly 33% to ₹4,346 crore with revenue estimated at ₹74,875 crore. Focus on Middle East order sustainability and domestic private capex trends.",
            "Sentiment": "positive",
            "PublishDate": 1769509377105,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Plans ₹10,000 Cr Data Centre Expansion by 2030",
            "Summary": "L&T announces ambitious data centre expansion from 32MW to 200MW capacity by 2030 with ₹10,000 crore investment, leveraging in-house capabilities to compete with Tata, Adani, and Reliance in AI infrastructure space.",
            "Sentiment": "positive",
            "PublishDate": 1769013811284,
            "Source": "stocks"
        },
        {
            "Title": "L&T Finance Sets ROA Target of 2.8-3% by Q4 FY27",
            "Summary": "L&T Finance announces Lakshya 2026 strategic goals targeting 2.8-3% return on assets by Q4 FY27, while maintaining net interest margin plus fees between 10-10.5% to drive sustainable growth.",
            "Sentiment": "positive",
            "PublishDate": 1768880571209,
            "Source": "stocks"
        },
        {
            "Title": "L&T Finance Activates Cyclops System in Personal Loans",
            "Summary": "L&T Finance confirms Cyclops system is now active in personal loans business with full rollout expected by end of Q4 FY26, marking significant technological advancement in lending operations.",
            "Sentiment": "positive",
            "PublishDate": 1768802108397,
            "Source": "stocks"
        },
        {
            "Title": "L&T Finance Block Trade Worth ₹15.94 Crores on NSE",
            "Summary": "L&T Finance witnessed a significant block trade on NSE involving 549,592 shares at ₹290.00 per share, totaling ₹15.94 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1768798000850,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Finance disappoints on asset quality: IIFL",
            "Summary": "IIFL notes L&T Finance disappointed on asset quality with credit costs rising ~45bps QoQ to 2.9% despite strong Q3 profit growth of 18% YoY to ₹738.6 crore.",
            "Sentiment": "negative",
            "PublishDate": 1768571175010,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Finance Book Size Grows 11% YoY to ₹16,671 Crores",
            "Summary": "L&T Finance reports book size growth of 11% YoY and 5% QoQ to ₹16,671 crores. Positive GST collections and good monsoon conditions boost festival demand across key segments.",
            "Sentiment": "positive",
            "PublishDate": 1768570957848,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Wins Major Contract Worth ₹25-50 Billion",
            "Summary": "L&T has secured a significant contract valued between ₹25 billion to ₹50 billion, marking a major business development for the engineering and construction conglomerate.",
            "Sentiment": "positive",
            "PublishDate": 1768536272691,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Secures Major Contract Worth ₹25-50 Billion",
            "Summary": "Larsen & Toubro announces winning of large-scale contract with value ranging between ₹25 billion to ₹50 billion, marking significant business development for the engineering conglomerate.",
            "Sentiment": "positive",
            "PublishDate": 1768363803590,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Wins Major Contract Worth ₹10,000-25,000 Crores",
            "Summary": "L&T has secured a significant contract valued between ₹10,000 to ₹25,000 crores, marking another major business win for the engineering and construction conglomerate.",
            "Sentiment": "positive",
            "PublishDate": 1768277461390,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kuwait May Cancel $8.7B Oil Tenders, Plans Rebid",
            "Summary": "Kuwait is considering cancelling oil project tenders worth $8.7 billion and plans to initiate a rebidding process, according to CNBC TV18 reports.",
            "Sentiment": "neutral",
            "PublishDate": 1768277440284,
            "Source": "stocks"
        },
        {
            "Title": "Macquarie Sets L&T Target at ₹4,620 with Outperform Rating",
            "Summary": "Macquarie maintains Outperform rating on L&T with target price of ₹4,620, indicating positive outlook for the engineering and construction major.",
            "Sentiment": "positive",
            "PublishDate": 1768276014183,
            "Source": "stocks"
        },
        {
            "Title": "China Curbs Easing: Minimal L&T Impact, Transformers Hit",
            "Summary": "Analyst expects minimal impact on L&T from potential easing of China restrictions on government tenders, but sees negative implications for transformer companies amid supply shortages and pricing concerns.",
            "Sentiment": "neutral",
            "PublishDate": 1767941765279,
            "Source": "stocks"
        },
        {
            "Title": "L&T Finance schedules Q3FY26 investor call",
            "Summary": "L&T Finance Limited announces conference call on January 19, 2026 at 11:00 AM IST to discuss Q3FY2025-26 financial performance and strategy update with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1767879715141,
            "Source": "stocks"
        },
        {
            "Title": "L&T Finance Targets ₹1.12 Trillion Retail Loan Book",
            "Summary": "L&T Finance estimates its retail loan book will reach ₹1.12 trillion by the end of Q3 FY2025-26, reflecting the company's growth projections in the retail lending segment.",
            "Sentiment": "positive",
            "PublishDate": 1767609367162,
            "Source": "stocks"
        },
        {
            "Title": "L&T Finance Q3 retail disbursements surge 49% YoY",
            "Summary": "L&T Finance reports strong Q3FY26 performance with retail disbursements reaching ₹22,690 crores, marking 49% year-on-year growth. Stock surges 132% in 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767608969953,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Finance Block Trade Worth ₹16.05 Crores on NSE",
            "Summary": "L&T Finance witnessed a significant block trade on NSE involving 502,796 shares valued at ₹16.05 crores, executed at ₹319.20 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767593652841,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Wins Major Contract Worth ₹50-100 Billion",
            "Summary": "Larsen & Toubro secures significant contract valued between ₹50-100 billion, marking a major business development for the engineering and construction giant.",
            "Sentiment": "positive",
            "PublishDate": 1767331113854,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Finance Allots ₹50 Cr NCDs at 7.75% Coupon",
            "Summary": "L&T Finance Limited has completed allotment of 50 subordinated NCDs worth ₹50 crore on December 31, 2025, with 7.75% annual coupon rate and 10-year maturity.",
            "Sentiment": "positive",
            "PublishDate": 1767175688315,
            "Source": "co_actions_results"
        },
        {
            "Title": "Morgan Stanley Raises L&T Finance Target to ₹160",
            "Summary": "Morgan Stanley upgraded L&T Finance's price target to ₹160 from ₹143 citing improved earnings visibility, but retained 'Underweight' stance due to valuation concerns and return ratio issues.",
            "Sentiment": "neutral",
            "PublishDate": 1767151559646,
            "Source": "stocks"
        },
        {
            "Title": "L&T Wins Major Contract Worth ₹10-25 Billion",
            "Summary": "L&T has secured a significant new contract valued between ₹10 billion and ₹25 billion, marking another major business win for the engineering and construction conglomerate.",
            "Sentiment": "positive",
            "PublishDate": 1766985619792,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Wins Major Contract Worth ₹1,000-2,500 Crores",
            "Summary": "L&T has secured a significant contract valued between ₹1,000-2,500 crores, representing a major business development for the engineering and construction conglomerate.",
            "Sentiment": "positive",
            "PublishDate": 1766463973764,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Wins Major Contract Worth ₹25-50 Billion",
            "Summary": "L&T has secured a significant contract valued between ₹25 billion to ₹50 billion, marking a major business development for the engineering and construction conglomerate.",
            "Sentiment": "positive",
            "PublishDate": 1765949703603,
            "Source": "co_actions_results"
        },
        {
            "Title": "Citi Maintains Buy Rating on L&T Finance at ₹330",
            "Summary": "Citigroup maintains its Buy recommendation for L&T Finance with a target price of ₹330, reflecting continued confidence in the financial services company's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1765943367226,
            "Source": "stocks"
        },
        {
            "Title": "L&T Finance Receives ESG Score of 75 from NSE Unit",
            "Summary": "L&T Finance Limited has received an ESG score of 75 from NSE Sustainability Ratings Analytics Ltd, a SEBI-registered Category I ESG rating provider and subsidiary of NSE Indices Limited.",
            "Sentiment": "positive",
            "PublishDate": 1765539582476,
            "Source": "stocks"
        },
        {
            "Title": "LT Finance Allots 8.32 Lakh Equity Shares Under Employee Stock Option Scheme",
            "Summary": "LT Finance's ESOP Allotment Committee approved the allotment of 8,32,365 equity shares to option grantees who exercised their options under the LT Finance Employee Stock Option Scheme-2013. The newly allotted shares will rank pari-passu with existing equity shares and be entitled to dividends declared thereafter.",
            "Sentiment": "neutral",
            "PublishDate": 1764326839913,
            "Source": "corporate_action"
        },
        {
            "Title": "L&T Finance Unveils AI-Powered Credit Engine Project Cyclops, Reports 42% Jump in Rural Disbursements",
            "Summary": "L&T Finance showcased its proprietary AI-based underwriting engine Project Cyclops and portfolio management system Project Nostradamus at its Investor Digital Day, with rural business finance disbursements surging 42% year-on-year to Rs 2,160 crores in October. The company achieved record monthly disbursements crossing Rs 8,000 crores for the first time, driven by technology adoption across business lines and strong festival season demand in the wheels segment.",
            "Sentiment": "positive",
            "PublishDate": 1763058517172,
            "Source": "corporate_action"
        },
        {
            "Title": "L&T Finance Achieves 98% Retailization with 39% YoY Disbursement Growth Through Digital Strategy",
            "Summary": "L&T Finance has completed its retail-first transformation, reaching 98% retailization and recording 39% year-over-year disbursement growth through digital partnerships. The company is expanding into gold loans with plans to establish 200 branches by FY26. L&T Finance has deployed AI-based credit models named 'Cyclops' and 'Nostradamus' for risk analytics. The company targets maintaining a 2.4% Return on Assets (ROA) and aims for accelerated growth through technology-led scalability and organizational culture transformation.",
            "Sentiment": "positive",
            "PublishDate": 1762438946652,
            "Source": "stock"
        },
        {
            "Title": "L&T Finance Allots 6.15 Lakh Equity Shares Under Employee Stock Option Scheme",
            "Summary": "L&T Finance Limited has allotted 6,15,531 equity shares to option grantees who exercised their options under the L&TFL Employee Stock Option Scheme-2013. The ESOP Allotment Committee approved the allotment on October 31, 2025. The newly allotted equity shares will rank equally with existing equity shares and will be entitled to dividends declared thereafter.",
            "Sentiment": "neutral",
            "PublishDate": 1761908395996,
            "Source": "corporate_action"
        },
        {
            "Title": "L&T Finance Sees Block Trade Worth Rs. 172.94 Crores on NSE",
            "Summary": "L&T Finance Ltd. witnessed a block trade on the National Stock Exchange involving approximately 6,434,576 shares valued at Rs. 172.94 crores. The shares were traded at a price of Rs. 268.76 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1761646343539,
            "Source": "order&deals"
        },
        {
            "Title": "L&T Finance Reports 6% YoY Growth in Q2FY26 PAT, Retail Book Crosses Rs 1 Lakh Crore Milestone",
            "Summary": "L&T Finance achieved consolidated PAT of Rs 735 crore in Q2FY26, marking 6% YoY and 5% QoQ growth. The retail book reached Rs 1,04,607 crore (18% YoY growth), while consolidated book size grew 15% YoY to Rs 1,07,096 crore. The company recorded highest-ever quarterly disbursements of Rs 18,896 crore (25% YoY, 8% QoQ). Rural Business Finance disbursements normalized at Rs 6,316 crore (16% YoY, 12% QoQ). Personal loans disbursements surged 114% YoY to Rs 2,918 crore, driven by big tech partnerships including Amazon Pay, Cred, PhonePe, and Google Pay. The company's AI-powered Project Cyclops underwriting engine now powers 100% of underwriting in Two-Wheeler, Farm Equipment, and SME businesses, showing improved portfolio performance with reduced bounce rates. Credit costs (before macro prudential provisions) improved from 3.80% in Q4FY25 to 2.98% in Q2FY26. The company utilized Rs 150 crore from macro prudential provisions, leaving Rs 125 crore remaining. Pan-India collection efficiency in microfinance improved to 99.50% from 99.35% in the previous quarter. Gold loans business achieved Rs 983 crore quarterly disbursements with plans to expand to 330+ branches by end of FY26. RoA stood at 2.41% and RoE at 11.33%. The company targets 2% credit cost trajectory over medium term and maintains AUM growth guidance of 20-25%.",
            "Sentiment": "positive",
            "PublishDate": 1761564046984,
            "Source": "earnings"
        },
        {
            "Title": "L&T Finance Targets AUM Growth Through Digital Retail Lending Strategy",
            "Summary": "L&T Finance has outlined plans to accelerate assets under management (AUM) growth and enhance equity returns through retail digital lending initiatives and strategic risk management approaches.",
            "Sentiment": "positive",
            "PublishDate": 1760547082908,
            "Source": "stock"
        },
        {
            "Title": "L&T Finance Reports Record Retail Loans of ₹18,883 Crore in Q2 2025, Up 25% YoY",
            "Summary": "L&T Finance achieved record retail loans of ₹18,883 crore in Q2 2025, marking a 25% year-over-year increase. The company plans to expand its branch network by opening 200 more branches by FY26, targeting 330 gold loan branches. A company executive expressed optimism about accelerated growth in H2FY26, citing expected festive demand and support from GST 2.0 changes.",
            "Sentiment": "positive",
            "PublishDate": 1760542675233,
            "Source": "earnings"
        },
        {
            "Title": "L&T Finance Reports Marginal Changes in Asset Quality Metrics",
            "Summary": "L&T Finance's gross Stage 3 assets decreased slightly to 3.29% from 3.31% on a quarter-on-quarter basis. The company's net Stage 3 assets increased marginally to 1% from 0.99% quarter-on-quarter. These metrics indicate minimal changes in the company's non-performing asset ratios.",
            "Sentiment": "neutral",
            "PublishDate": 1760539192483,
            "Source": "earnings"
        },
        {
            "Title": "L&T Finance Reports Higher Q2 Profit and Revenue Growth",
            "Summary": "L&T Finance reported consolidated net profit of 7.34 billion rupees for Q2, compared to 6.96 billion rupees in the same period last year. The company's revenue increased to 43.35 billion rupees from 40.2 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1760538631722,
            "Source": "earnings"
        },
        {
            "Title": "L&T Finance Raises Rs 1,050 Crores Through Non-Convertible Debentures",
            "Summary": "L&T Finance Limited allotted 105,000 senior, secured, rated, listed, redeemable, non-convertible debentures with a face value of Rs 1,00,000 each, raising Rs 1,050 crores through private placement to an identified investor on October 10, 2025. The debentures carry a coupon rate of 7.2190% per annum with the first coupon payable on November 10, 2025, and annually thereafter. The instruments have an original tenor of 1,127 days and will mature on November 10, 2028. The debentures are secured by an exclusive first ranking charge through hypothecation over identified fixed deposits and standard receivables of the issuer, equivalent to 1 time the principal amount and coupon outstanding. The debentures are proposed to be listed on the National Stock Exchange of India Limited under the New Debt Market segment. In case of payment default, additional interest of 2% per annum over the coupon rate will be applicable for the defaulting period.",
            "Sentiment": "positive",
            "PublishDate": 1760094186669,
            "Source": "corporate_action"
        },
        {
            "Title": "L&T Finance Reports Strong Growth in Retail Business with 25% Jump in Disbursements",
            "Summary": "L&T Finance announced its retail disbursements reached approximately Rs. 18,850 crores in Q2FY2025-26, marking a 25% year-on-year growth. The company's retail loan book stood at around Rs. 1,04,500 crores at the end of the quarter, representing a 17% increase compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1759709563941,
            "Source": "earnings"
        },
        {
            "Title": "L&T Finance Projects 25% Growth in Retail Disbursements for Q2FY2025-26",
            "Summary": "L&T Finance has projected retail disbursements of approximately ₹18,850 crores for Q2FY2025-26, representing about 25% yearly growth. The company expects its retail loan book to reach around ₹1,04,500 crores by the end of Q2FY2025-26, indicating approximately 17% yearly growth.",
            "Sentiment": "positive",
            "PublishDate": 1759495797398,
            "Source": "stock"
        },
        {
            "Title": "L&T Finance Sees Block Trade Worth Rs. 54.21 Crores on NSE",
            "Summary": "L&T Finance Ltd. witnessed a block trade on the National Stock Exchange involving approximately 2,244,014 shares at a price of Rs. 241.56 per share. The total transaction value amounted to Rs. 54.21 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1758862851905,
            "Source": "order&deals"
        },
        {
            "Title": "L&T Finance Hits Record High in August, Analysts See Potential Rally Continuing",
            "Summary": "L&T Finance Ltd reached a fresh record high in August 2025, with technical analysts suggesting the rally may extend into September. The NBFC stock broke out from a Cup & Handle formation in June 2025 and has been trading above the pattern's neckline since then. Short-term traders are being advised to consider buying the stock with a target price of Rs 258 over the next couple of months.",
            "Sentiment": "positive",
            "PublishDate": 1756469061274,
            "Source": "stock"
        },
        {
            "Title": "L&T Finance Shares Worth Rs. 70.93 Crores Traded in NSE Block Deal",
            "Summary": "L&T Finance Ltd. witnessed a block trade on NSE involving approximately 3,243,635 shares valued at Rs. 70.93 crores. The shares were traded at Rs. 218.67 per share in this bulk transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1756443968933,
            "Source": "order&deals"
        },
        {
            "Title": "L&T Finance Partners with Google Pay to Offer Personal Loans Through Digital Platform",
            "Summary": "L&T Finance has partnered with Google Pay to offer personal loans directly through the payments platform, allowing eligible users to apply for and access loan products within the app. The partnership aims to strengthen L&T Finance's product diversification strategy and expand credit access through digital channels. This collaboration follows similar partnerships with PhonePe, CRED, and Amazon Pay. L&T Finance reported 41% year-on-year growth in its personal loan book to ₹9,383 crore in Q1FY26, with disbursements rising 65% to ₹1,942 crore. The company attributes this growth to partnerships, geographical expansion, and customer retention focus.",
            "Sentiment": "positive",
            "PublishDate": 1755783038123,
            "Source": "order&deals"
        },
        {
            "Title": "L&T Finance Limited Gets Credit Rating Upgrade with Long-Term and Short-Term Ratings Raised",
            "Summary": "L&T Finance Limited received a credit rating upgrade. The long-term rating was increased to BBB/Stable from BBB-/Positive, while the short-term rating was raised to A-2 from A-3. This represents an improvement in both the company's long-term and short-term creditworthiness assessments.",
            "Sentiment": "positive",
            "PublishDate": 1755243180622,
            "Source": "stock"
        },
        {
            "Title": "L&T Finance Raises Rs 250 Crores Through Non-Convertible Debentures",
            "Summary": "L&T Finance Limited allotted 25,000 Senior, Secured, Rated, Listed, Redeemable, Non-Convertible Debentures with a face value of Rs. 1,00,000 each, raising Rs. 250 crores through private placement on August 13, 2025. The debentures carry a coupon rate of 7.0826% with annual interest payments starting March 15, 2026. The instruments have a tenure of 945 days and will mature on March 15, 2028, when they will be redeemed at face value. The debentures are secured by first ranking charge on identified fixed deposits and standard receivables equivalent to 1 time the outstanding principal and coupon amount. The company had the option to raise up to Rs. 1,000 crores including a green shoe option of Rs. 750 crores. The debentures will be listed on the National Stock Exchange's New Debt Market platform.",
            "Sentiment": "neutral",
            "PublishDate": 1755088896802,
            "Source": "corporate_action"
        }
    ]
}