{
    "Symbol": "LTFOODS",
    "ISIN": "INE818H01020",
    "News": [
        {
            "Title": "LT Foods' Hungary Acquisition Bid Rejected by Ministry",
            "Summary": "The Ministry of National Economy in Hungary has denied LT Foods' bid to acquire Global Green Group, marking a setback for the Indian food company's international expansion plans.",
            "Sentiment": "negative",
            "PublishDate": 1769702751880,
            "Source": "co_actions_results"
        },
        {
            "Title": "LT Foods Reports Strong Q3FY26 Performance",
            "Summary": "LT Foods Limited announced Q3FY26 results with consolidated revenue of ₹2,80,920.11 lakhs and net profit of ₹15,735.21 lakhs. Board declared interim dividend of ₹1 per share.",
            "Sentiment": "positive",
            "PublishDate": 1769610590436,
            "Source": "co_actions_results"
        },
        {
            "Title": "LT Foods Launches DAAWAT I'm Organic Range with QR Code",
            "Summary": "LT Foods unveils DAAWAT I'm Organic range featuring Basmati and Sona Masoori rice with QR code traceability technology, allowing consumers to track their rice journey from cultivation to packaging.",
            "Sentiment": "positive",
            "PublishDate": 1769167880945,
            "Source": "stocks"
        },
        {
            "Title": "LT Foods Board Meeting Set for January 28, 2026",
            "Summary": "LT Foods Limited has scheduled a board meeting on January 28, 2026, to consider Q3FY26 unaudited financial results and declaration of second interim dividend for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1768997404030,
            "Source": "co_actions_results"
        },
        {
            "Title": "LT Foods Incorporates Dubai-Based Wholly Owned Subsidiary",
            "Summary": "LT Foods Limited announces incorporation of LTF Global Investments L.L.C. in Dubai with AED 3 million capital to provide strategic services to international operations across USA, UK, and Europe.",
            "Sentiment": "positive",
            "PublishDate": 1768996528720,
            "Source": "co_actions_results"
        },
        {
            "Title": "LT Foods, KRBL recover after US tariff concerns",
            "Summary": "LT Foods and KRBL shares dipped 3% and 2% respectively on US tariff announcement targeting Iran trade partners, but recovered later. Iran accounts for 12-20% of Indian basmati exports at 8.5 lakh tonnes in FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1768290737450,
            "Source": "stocks"
        },
        {
            "Title": "LT Foods, KRBL shares fall on Trump's Iran tariff threat",
            "Summary": "Basmati rice exporters LT Foods and KRBL declined 2-3% after Trump announced 25% tariffs on countries trading with Iran. India exports significant basmati rice volumes globally.",
            "Sentiment": "negative",
            "PublishDate": 1768270344650,
            "Source": "stocks"
        },
        {
            "Title": "Bandhan MF raises stake in LT Foods to 5.02%",
            "Summary": "Bandhan Mutual Fund increased its shareholding in LT Foods Limited to 5.0213% through acquisition of 93,006 equity shares worth 0.0268% via open market purchase on January 09, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768228278151,
            "Source": "co_actions_results"
        },
        {
            "Title": "LT Foods Sets Up New Rice Facility in Raichur",
            "Summary": "LT Foods establishes new manufacturing facility in Raichur with annual production capacity of 30,000 metric tonnes for regional rice varieties, involving capital expenditure of ₹60 million.",
            "Sentiment": "positive",
            "PublishDate": 1766714775816,
            "Source": "stocks"
        },
        {
            "Title": "LT Foods Sets Up New Rice Plant in Raichur",
            "Summary": "LT Foods establishes new manufacturing facility in Raichur with annual production capacity of 30,000 metric tonnes of rice through ₹60 million investment.",
            "Sentiment": "positive",
            "PublishDate": 1766575404488,
            "Source": "stocks"
        },
        {
            "Title": "LT Foods Plans New Rice Unit in Karnataka",
            "Summary": "LT Foods announces new manufacturing facility in Raichur, Karnataka with 30,000 MT annual capacity, ₹6 crore investment, and production start by February 2026.",
            "Sentiment": "positive",
            "PublishDate": 1766472007037,
            "Source": "stocks"
        },
        {
            "Title": "LT Foods Appoints Rohit Jaiswal as COO for Middle East",
            "Summary": "LT Foods has appointed Rohit Jaiswal as Chief Operating Officer for its Middle East division to drive regional growth. Jaiswal brings 27 years of FMCG experience from companies like Colgate Palmolive, Marico, and Dabur International.",
            "Sentiment": "positive",
            "PublishDate": 1765789543671,
            "Source": "stocks"
        },
        {
            "Title": "India Ratings Upgrades LT Foods' Bank Loan Facilities to IND AA/Stable",
            "Summary": "India Ratings upgraded LT Foods' bank loan facilities rating to IND AA/Stable from IND AA-/Stable, reflecting strengthened business profile with consolidated EBITDA rising above INR 10 billion in FY25 and improved margins to 12%. The upgrade acknowledges the company's consistent growth in basmati rice operations, strong market position with 55-60% share in US basmati market, and conservative financial profile with net leverage remaining below 1.0x despite ongoing US tariff headwinds.",
            "Sentiment": "positive",
            "PublishDate": 1764233044214,
            "Source": "corporate_action"
        },
        {
            "Title": "LT Foods Promoter Ashwani Kumar Arora to Acquire 11.54 Lakh Shares via Gift from Fellow Promoter",
            "Summary": "Ashwani Kumar Arora will acquire 11,54,405 equity shares (0.33% of share capital) of LT Foods Limited through an off-market gift transfer from promoter Surinder Kumar Arora without any consideration. The inter-se transfer between promoters is scheduled to occur on or after November 24, 2025, with the aggregate promoter group holding remaining unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1763452351152,
            "Source": "corporate_action"
        },
        {
            "Title": "LT Foods Establishes New Subsidiary in Hungary to Expand European Operations",
            "Summary": "LT Foods has launched a new subsidiary in Hungary as part of its strategy to strengthen its business presence in the European market. The move represents the company's expansion efforts to enhance its operational footprint and growth prospects in Europe.",
            "Sentiment": "neutral",
            "PublishDate": 1763383543642,
            "Source": "corporate_action"
        },
        {
            "Title": "LT Foods Reports Record Quarterly Revenue of Rs 2,772 Crores with 30% Growth in Q2 FY26",
            "Summary": "LT Foods achieved its highest ever quarterly revenue of Rs 2,772 crores in Q2 FY26, representing 30% growth (12% normalized growth excluding Golden Star and U.S. Tariff). EBITDA reached Rs 316 crores with 24% growth compared to Q2 FY25. For the first half of FY26, the company reported record revenue of Rs 5,273 crores with 25% year-on-year growth and EBITDA of Rs 619 crores with 20% growth. EBITDA margin stood at 11.4% for Q2 FY26, down 60 basis points from 12% in Q2 FY25, primarily due to increased brand investment and strategic digitalization initiatives. The company strategically expanded into the European processed food market through acquisition of Hungary-based Global Green Kft at an enterprise value of $25 million. North America accounts for 46% of revenue with 47% year-on-year growth, while India contributes 30% with 13% growth. The organic segment delivered 26% year-on-year growth in the first half. A public hearing was conducted regarding Countervailing Duty for Ecopure Specialities Ltd, with final determination expected by November 17, 2025. The company maintains CRISIL AA-/A1 credit rating with positive outlook.",
            "Sentiment": "positive",
            "PublishDate": 1762309452632,
            "Source": "earnings"
        },
        {
            "Title": "LT Foods Launches 'Rice Your Awareness' Initiative with Only Rice November Challenge",
            "Summary": "LT Foods launched a four-week nationwide initiative called 'Rice Your Awareness' under its flagship brand DAAWAT to promote conscious conversations around rice consumption. The campaign features 'Only Rice November,' a nationwide challenge encouraging mindful rice consumption through a dedicated online portal offering expert-curated meal plans by nutritionists. The initiative involves popular fitness experts and over 500 nutrition-focused influencers, with actor Neha Dhupia among early participants. The movement gained over 10,000 participants on its launch day. The company aims to highlight the nutritional benefits and versatility of Basmati rice while addressing myths around rice consumption. LT Foods is a global FMCG company in the consumer food space, operating in over 80 countries with flagship brands including DAAWAT and Royal, and reported consolidated revenue of around Rs. 8,770 crores in FY25.",
            "Sentiment": "positive",
            "PublishDate": 1762251471408,
            "Source": "stock"
        },
        {
            "Title": "LT Foods Projects 15% Revenue Growth in FY26, Targets Higher Margins and Global Expansion",
            "Summary": "LT Foods projects 15% normalized revenue growth in FY26, driven by its Global Green Europe acquisition which will add €40 million in turnover, rising basmati exports, and premiumisation in ready-to-heat and organic segments. The company has set targets of achieving EBITDA margins above 14% within four years and a return on capital employed (ROCE) of 22%. LT Foods plans sustained global expansion across 80+ countries, with a current market capitalization of ₹14,000 crores and an AA credit rating.",
            "Sentiment": "positive",
            "PublishDate": 1761838500197,
            "Source": "stock"
        },
        {
            "Title": "LT Foods Reports 25% Revenue Growth to Rs 5,273 Crores in H1FY26",
            "Summary": "LT Foods delivered strong financial performance in the first half of FY26, with total revenue increasing 25% year-on-year to Rs 5,273 crores and EBITDA growing 20% to Rs 619 crores. The company's Basmati and Other Specialty Rice business grew 24% (normalized growth of 11.4% excluding Golden Star and U.S. Tariffs), while the Organic segment expanded 26%. In India, flagship brand DAAWAT maintained a 26.1% market share. The U.S. brand Royal holds over 54% market share in its region. Europe and U.K. operations reported 31% growth. The company acquired Global Green Kft. for €25 million to enter the canned food business and strengthen its Ready-To-Heat and Ready-To-Eat segments. For Q2FY26 specifically, total revenue reached Rs 2,772 crores (up 30%), with profit after tax at Rs 164 crores (up 9%). The company's Ready-To-Heat and Ready-To-Cook segment generated Rs 95 crores in revenue during H1FY26.",
            "Sentiment": "positive",
            "PublishDate": 1761837164491,
            "Source": "earnings"
        },
        {
            "Title": "LT Foods Approves £5 Million Equity Infusion in UK Subsidiary",
            "Summary": "LT Foods' Board of Directors approved an additional equity infusion of £5 million in LT Foods UK Limited, its step-down subsidiary. The funding will be split with £2 million from LT Foods Limited and £3 million from LT Foods Americas Inc. LT Foods UK Limited operates in specialty rice and rice food manufacturing and distribution business, with a net worth of £5.4 million and turnover of £21 million as of March 31, 2025. The company was incorporated on July 17, 2023, and began production in July 2024. The equity infusion aims to improve financial ratios and expand the specialty rice business, with completion targeted by December 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761834000411,
            "Source": "corporate_action"
        },
        {
            "Title": "LT Foods Reports 10.8% Growth in Q2 Net Profit to 1.64 Billion Rupees",
            "Summary": "LT Foods reported quarterly net profit of 1.64 billion rupees compared to 1.48 billion rupees in the same period last year. Revenue increased to 27.66 billion rupees from 21 billion rupees year-over-year. EBITDA rose to 3.09 billion rupees from 2.29 billion rupees, while EBITDA margin improved to 11.19% from 10.89% in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761826339557,
            "Source": "earnings"
        },
        {
            "Title": "LT Foods Acquires European Food Processing Operations for EUR 7.8 Million",
            "Summary": "LT Foods Limited executed a Share Purchase Agreement to acquire 100% shareholding in Global Green Europe Kft., Greenhouse AGRAR Kft., and Global Green International (UK) Limited from Global Green International N.V. The acquisition will be undertaken through LT Foods Europe Holdings Limited for a total consideration of EUR 7.8 million - EUR 6 million payable at closing and EUR 1.8 million through earn-out mechanism based on future earnings. The acquired entities operate in shelf-stable fruits and vegetables business, with Hungarian operations serving over 30 countries across Europe. The companies produce sweet corns in cans and gherkins, silver skin onions, and sour cherries in jars through 2 manufacturing sites across 45 hectares in Hungary, with annual capacity of 117 million jars and cans and over 170 employees. The entities reported turnover of EUR 40.8 million in 2022, EUR 37.0 million in 2023, and EUR 40.3 million in 2024. The acquisition supports LT Foods' strategy to diversify into processed ambient fruits and vegetables business and is expected to complete in Q3 FY2025-26, subject to FDI clearance in Hungary.",
            "Sentiment": "positive",
            "PublishDate": 1760360324252,
            "Source": "order&deals"
        },
        {
            "Title": "LT Foods Launches Daawat Thai Green Curry Rice Meal Kit for Global Market",
            "Summary": "LT Foods has launched a new meal kit featuring Daawat Thai Green Curry Rice, targeting the global gourmet market. The product launch represents the company's expansion into the ready-to-eat meal segment under its Daawat brand.",
            "Sentiment": "positive",
            "PublishDate": 1755597179692,
            "Source": "stock"
        },
        {
            "Title": "LT Foods Reports Record Quarterly Revenue of ₹2,501 Crores, Up 20% YoY",
            "Summary": "LT Foods delivered its highest ever quarterly revenue of ₹2,501 crores and EBITDA of ₹302 crores for Q1 FY26, representing growth of 20% and 17% respectively compared to the same period last year. EBITDA margin stood at 12.1% versus 12.4% in the previous year, with the 30 basis points decline attributed to increased brand investments. The Basmati and Other Specialty Rice segment grew 18%, while the organic business reported 32% growth, largely driven by soya meal. North America contributed 43% of revenue with 32% growth (18% normalized excluding Golden Star acquisition), while European Continental operations grew 57% year-on-year. India contributed 31% of revenue with 10% growth. The company completed acquisition of the remaining 45% stake in Golden Star in May 2025, making it the number one Jasmine rice brand in the US. LT Foods' organic arm Nature Bio Foods launched a new facility in Rotterdam capable of handling 15,000 metric tons annually. The company maintains guidance of 12.5% to 13% EBITDA margin and expects to deliver ROCE of 21% plus. Starting Q2 FY26, the company will conduct earnings calls semiannually instead of quarterly.",
            "Sentiment": "positive",
            "PublishDate": 1754047128412,
            "Source": "earnings"
        },
        {
            "Title": "LT Foods Shares Audio Recording of Investor Call on Quarterly Results",
            "Summary": "LT Foods Limited has made available an audio recording of its investor and analyst call held on July 28, 2025, at 4:00 PM IST. The call discussed the company's un-audited financial results and operations for the quarter ended June 30, 2025. The company has provided a direct link to the audio recording and stated that a transcript of the call will be released within prescribed timelines. The communication was formally submitted to both the National Stock Exchange of India and BSE Limited by Company Secretary Monika Chawla Jaggia.",
            "Sentiment": "neutral",
            "PublishDate": 1753751838184,
            "Source": "earnings"
        },
        {
            "Title": "LT Foods Reports 20% Revenue Growth in Q1 FY2026 Results",
            "Summary": "LT Foods Limited reported revenue of ₹2,501 crores in Q1 FY2026, marking a 20% increase from ₹2,088 crores in Q1 FY2025. The company's gross profit rose 24% to ₹867 crores, while EBITDA grew 17% to ₹302 crores. PAT increased 9% to ₹216 crores. The Basmati & Other Specialty Rice segment, contributing 85% of revenue, grew 18% to ₹2,124 crores with 19% volume growth. The Organic Foods & Ingredients segment expanded 32% to ₹293 crores, while the Ready-to-Heat & Ready-to-Cook segment declined 16% to ₹47 crores due to discontinuation of 'Daawat Sehat' product line. The company maintained strong market positions including #1 Basmati brand in Canada, #1 Jasmine rice brand in the USA, and 25.2% market share in India. Working capital days improved to 195 from 202, and the company targets achieving 14%+ EBITDA margin within four years.",
            "Sentiment": "positive",
            "PublishDate": 1753348060082,
            "Source": "earnings"
        },
        {
            "Title": "LT Foods Declares Rs 1 Interim Dividend, Reports Mixed Q1 Performance",
            "Summary": "LT Foods' board has approved an interim dividend of Rs 1 per share. The company reported Q1 EBITDA of Rs 2.65 billion compared to Rs 2.41 billion in the same period last year, representing year-over-year growth. However, the EBITDA margin declined to 10.8% from 11.63% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1753346302454,
            "Source": "corporate_action"
        },
        {
            "Title": "LT Foods Reports Higher Q1 Profit and Revenue Growth",
            "Summary": "LT Foods reported consolidated net profit of 1.7 billion rupees for Q1, compared to 1.53 billion rupees in the same period last year. The company's revenue increased to 25 billion rupees from 20.7 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1753345809716,
            "Source": "earnings"
        },
        {
            "Title": "LT Foods Schedules Q1 FY26 Results Conference Call for July 28, 2025",
            "Summary": "LT Foods Limited will hold a conference call on July 28, 2025 at 4:00 PM IST to discuss financial performance for the quarter ended June 30, 2025. The call follows a board meeting scheduled for July 24, 2025 to approve unaudited financial results for Q1 FY26. The conference will be represented by Managing Director and CEO Ashwani Kumar Arora, CFO Sachin Gupta, and Chief Corporate Development Officer Monika Chawla Jaggia. Dial-in numbers are provided for India and international participants including Hong Kong, Singapore, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1753272491742,
            "Source": "earnings"
        },
        {
            "Title": "LT Foods Revises Record Date for Interim Dividend to August 1, 2025",
            "Summary": "LT Foods Limited has revised the record date for interim dividend payment to August 1, 2025, from the previously announced date of July 30, 2025. The board meeting scheduled for July 24, 2025 remains unchanged. Shareholders whose names appear in the Register of Members or as beneficial owners in the records of the Depositories as on August 1, 2025 will be eligible for the interim dividend, if declared by the board.",
            "Sentiment": "neutral",
            "PublishDate": 1753163542601,
            "Source": "corporate_action"
        },
        {
            "Title": "LT Foods: Q4 Profit Rises 7%, FY25 Revenue Surpasses $1 Billion",
            "Summary": "LT Foods reported a 6.83% increase in Q4 FY25 net profit to Rs 160.51 crore. FY25 revenue crossed the $1 billion mark, with total income rising to Rs 8,769.93 crore. The company's basmati and specialty rice business grew 10% YoY, while organic food segment saw 29% growth. A final dividend of Re 1 per share was recommended.",
            "Sentiment": "positive",
            "PublishDate": 1747313555000,
            "Source": "earnings"
        },
        {
            "Title": "LT Foods: Q3 Profit Dips Despite Revenue Surge, Share Price Falls",
            "Summary": "LT Foods reported a 17.2% increase in Q3 revenue to Rs 2,274.81 crore, but net profit declined 5% to Rs 143.26 crore. The company declared an interim dividend of Rs 0.50 per share. EBITDA rose 5% to Rs 249.83 crore. Share price fell over 7% following the results.",
            "Sentiment": "negative",
            "PublishDate": 1737970209000,
            "Source": "earnings"
        },
        {
            "Title": "LT Foods: Q2 Profit Dips 4%, Declares Interim Dividend",
            "Summary": "LT Foods reported a 4.3% YoY decline in Q2 net profit to ₹150.6 crore. Revenue increased 6.6% to ₹2,107.8 crore. EBITDA fell 4.7% to ₹229.3 crore. The company declared a third interim dividend of ₹0.50 per share for FY 2024-25, with November 4, 2024, set as the record date.",
            "Sentiment": "neutral",
            "PublishDate": 1729762880000,
            "Source": "result,corporate_action"
        }
    ]
}