{
    "Symbol": "LTIM",
    "ISIN": "INE214T01019",
    "News": [
        {
            "Title": "LTIMindtree Rebrands to LTM, Seeks Name Change Approval",
            "Summary": "LTIMindtree announces board approval for company name change to 'LTM Limited' and unveils new brand identity as 'Business Creativity Partner', subject to shareholder and regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1770802942646,
            "Source": "stocks"
        },
        {
            "Title": "LTIMindtree allots 4,076 equity shares under ESOP",
            "Summary": "LTIMindtree's Nomination & Remuneration Committee approved allotment of 4,076 equity shares under ESOP Scheme to Employee Welfare Trust on January 31, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769837463219,
            "Source": "co_actions_results"
        },
        {
            "Title": "CCD Founder's Role in L&T's Mindtree Takeover",
            "Summary": "V.G. Siddhartha's financial stress led to selling his 20.41% Mindtree stake to L&T for Rs. 3,269 crore, enabling India's first major hostile IT takeover and delivering him Rs. 2,858.74 crore profit.",
            "Sentiment": "neutral",
            "PublishDate": 1769442801763,
            "Source": "co_actions_results"
        },
        {
            "Title": "LTIMindtree Gets Hold Rating with ₹6,000 Target",
            "Summary": "Prabhudas Lilladher maintains Hold rating on LTIMindtree with target price of ₹6,000, citing revenue growth of 2.4% QoQ in constant currency and strong deal momentum despite muted growth in BFSI and CMT verticals.",
            "Sentiment": "neutral",
            "PublishDate": 1768895569962,
            "Source": "co_actions_results"
        },
        {
            "Title": "LTIMindtree Q3 Performance Drives Anand Rathi Buy Rating",
            "Summary": "Anand Rathi maintains BUY rating on LTIMindtree with revised target of ₹7,375, citing solid Q3FY26 performance with 2.4% q/q revenue growth and margin expansion despite furloughs.",
            "Sentiment": "positive",
            "PublishDate": 1768889399531,
            "Source": "co_actions_results"
        },
        {
            "Title": "CITI Downgrades LTIMindtree with Sell Rating",
            "Summary": "Citigroup issues sell recommendation for LTIMindtree shares with target price of ₹5,415.00, signaling bearish outlook on the IT services company's prospects.",
            "Sentiment": "negative",
            "PublishDate": 1768880847092,
            "Source": "stocks"
        },
        {
            "Title": "Nomura Sets Neutral Rating on LTIMindtree at ₹5,900",
            "Summary": "Nomura maintains neutral stance on LTIMindtree with target price of ₹5,900, reflecting measured outlook on the IT services company's prospects in current market conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1768880819081,
            "Source": "stocks"
        },
        {
            "Title": "Morgan Stanley Sets ₹6,300 Target for LTIMindtree",
            "Summary": "Morgan Stanley maintains Equal Weight rating on LTIMindtree with a target price of ₹6,300, reflecting the brokerage's assessment of the IT services company's current market position.",
            "Sentiment": "neutral",
            "PublishDate": 1768880795231,
            "Source": "stocks"
        },
        {
            "Title": "CLSA Sets ₹7,067 Target for LTIMindtree",
            "Summary": "CLSA maintains Outperform rating on LTIMindtree with target price of ₹7,067, reflecting positive outlook on the IT services company's prospects in current market conditions.",
            "Sentiment": "positive",
            "PublishDate": 1768880771568,
            "Source": "stocks"
        },
        {
            "Title": "Motilal Oswal Maintains Buy Rating on LTIMindtree",
            "Summary": "Motilal Oswal Securities continues to recommend LTIMindtree shares with a Buy rating and sets a target price of ₹7,900.00, indicating confidence in the IT services company's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1768880747702,
            "Source": "stocks"
        },
        {
            "Title": "Macquarie Maintains Outperform Rating on LTIMindtree",
            "Summary": "Macquarie continues its positive outlook on LTIMindtree with an 'Outperform' rating and sets a target price of ₹6,930.00, reflecting confidence in the IT services company's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1768880721043,
            "Source": "stocks"
        },
        {
            "Title": "LTIMindtree Plans Wage Hikes in Q4 FY26 & Q1 FY27",
            "Summary": "LTIMindtree CFO announces wage increases affecting 50% of employees in Q4 FY26 and continuing in Q1 FY27, with potential 1% cost impact per quarter to be offset through New Horizons program improvements.",
            "Sentiment": "neutral",
            "PublishDate": 1768879233413,
            "Source": "stocks"
        },
        {
            "Title": "LTIMindtree Declares ₹22 Per Share Dividend",
            "Summary": "LTIMindtree Limited has announced a dividend payment of ₹22.00 per share for its shareholders, reflecting the company's commitment to returning value to investors.",
            "Sentiment": "positive",
            "PublishDate": 1768822226768,
            "Source": "co_actions_results"
        },
        {
            "Title": "LTIMindtree Q3 Results: PAT Falls 11% YoY Despite Revenue Growth",
            "Summary": "LTIMindtree Q3FY26 PAT drops 11% YoY to ₹971 cr due to labour code impact, though revenue rises 12% YoY to ₹10,781 cr with strong operational performance across client metrics.",
            "Sentiment": "neutral",
            "PublishDate": 1768821082888,
            "Source": "co_actions_results"
        },
        {
            "Title": "LTIMindtree shares surge 4% on ₹3,000 cr CBDT order win",
            "Summary": "LTIMindtree shares gained over 4% after securing ₹3,000 crore Insight 2.0 project from CBDT for AI-powered tax analytics platform modernization with strong Q2 earnings backdrop.",
            "Sentiment": "positive",
            "PublishDate": 1768540800078,
            "Source": "co_actions_results"
        },
        {
            "Title": "LTIMindtree Board Meet Set for Jan 19 Q3FY26 Results",
            "Summary": "LTIMindtree announces board meeting on January 19, 2026 to consider Q3FY26 financial results with earnings call at 18:00 IST. Trading window closed from Jan 1-21, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767695727291,
            "Source": "co_actions_results"
        },
        {
            "Title": "LTIMindtree Q2 FY25: Strong Order Bookings Drive Growth",
            "Summary": "LTIMindtree reported $1.6 billion in new orders for Q2 FY25, marking fourth consecutive quarter above $1.5 billion. Revenue crossed ₹10,000 crore milestone with 5.6% sequential growth.",
            "Sentiment": "positive",
            "PublishDate": 1766633157861,
            "Source": "co_actions_results"
        },
        {
            "Title": "LTIMindtree Gets AAA Credit Rating Affirmation",
            "Summary": "India Ratings Research affirms LTIMindtree's credit ratings at IND AAA/Stable and IND AAA/Stable/IND A1, reflecting the IT services company's strong financial position.",
            "Sentiment": "positive",
            "PublishDate": 1765547128343,
            "Source": "stocks"
        },
        {
            "Title": "LTIMindtree Partners with Xage Security for Zero Trust Cybersecurity Solutions",
            "Summary": "LTIMindtree has formed a strategic partnership with Xage Security to deliver zero trust cybersecurity solutions for critical infrastructure. The collaboration aims to enhance cybersecurity capabilities for infrastructure protection through combined expertise and technology offerings.",
            "Sentiment": "positive",
            "PublishDate": 1765322880957,
            "Source": "stock"
        },
        {
            "Title": "LTIMindtree Receives ESG Rating of 75 Under 'Leader' Category",
            "Summary": "LTIMindtree has been assigned an ESG rating score of 75 under the 'Leader' category by NSE Sustainability Ratings Analytics Limited, a SEBI registered ESG Rating Provider. The rating reflects the company's environmental, social, and governance performance and enhances its sustainability credentials for stakeholders and investors.",
            "Sentiment": "positive",
            "PublishDate": 1765281411098,
            "Source": "stock"
        },
        {
            "Title": "LTIMindtree Wins Two AWS Partner Awards for Application Modernization and Travel & Hospitality Excellence",
            "Summary": "LTIMindtree received two AWS 2025 Partner Awards at AWS re:Invent, winning Application Modernization Consulting Partner of the Year (Global) and Industry Partner of the Year for Travel and Hospitality. The recognition highlights the company's successful modernization projects including migrating over 200 critical applications for a U.S. insurer and enabling a global travel leader to modernize data centers while improving operational agility.",
            "Sentiment": "positive",
            "PublishDate": 1764849771218,
            "Source": "stock"
        },
        {
            "Title": "LTIMindtree's Singapore Subsidiary Nielsen Partner Struck Off from Register",
            "Summary": "Nielsen Partner Pte. Ltd., a step-down wholly-owned subsidiary of LTIMindtree in Singapore, has been struck off from the register by Singapore's Accounting and Corporate Regulatory Authority effective November 28, 2025. The subsidiary has consequently ceased to be part of LTIMindtree's corporate structure following the regulatory action.",
            "Sentiment": "neutral",
            "PublishDate": 1764573299974,
            "Source": "corporate_action"
        },
        {
            "Title": "LTIMindtree Expands Microsoft Partnership to Drive Azure and AI Growth",
            "Summary": "LTIMindtree has expanded its partnership with Microsoft to accelerate Azure cloud adoption and advance AI innovations. The enhanced collaboration aims to strengthen both companies' positions in the cloud services and artificial intelligence market segments.",
            "Sentiment": "positive",
            "PublishDate": 1763518916543,
            "Source": "stock"
        },
        {
            "Title": "Convatec Partners with LTIMindtree for AI-Powered SAP S/4HANA Digital Transformation",
            "Summary": "Global medical products company Convatec has selected LTIMindtree as its strategic partner to implement SAP's Digital Core S/4HANA across its business operations, following a competitive selection process. The engagement will involve refreshing Convatec's SAP S/4HANA landscape with AI-powered digital operations to drive process standardization, operational efficiency, and support the company's strategic technology transformation goals.",
            "Sentiment": "positive",
            "PublishDate": 1763368488667,
            "Source": "stock"
        },
        {
            "Title": "LTIMindtree Reports Strong Q2 Performance, Revenue Crosses Rs 10,000 Crore for First Time",
            "Summary": "LTIMindtree delivered strong quarterly results, with consolidated revenue rising 5.6% sequentially to Rs 10,394 crore, crossing the Rs 10,000-crore milestone for the first time. EBIT jumped 17.2% to Rs 1,648 crore with margins expanding 160 basis points to 15.9%, driven by efficiency programs and non-recurrence of visa costs. Net profit increased 11.7% to Rs 1,401 crore. The company attributed growth to its 'Fit for Future' efficiency drive and AI adoption across operations, with CFO Vipul Chandra noting revenue additions without significant headcount increases due to automation and generative AI tools. LTIMindtree expects to reach or approach double-digit USD revenue growth in H2 FY26, supported by strong deal momentum and its proprietary BlueVerse AI platform. Brokerages maintained positive ratings, with Nuvama raising its target price to Rs 6,900 and Emkay retaining an 'Add' rating at Rs 6,200.",
            "Sentiment": "positive",
            "PublishDate": 1762770008329,
            "Source": "earnings"
        },
        {
            "Title": "LTIMindtree Partners with International Film Festival of India to Launch AI Film Festival and Hackathon",
            "Summary": "LTIMindtree has partnered with the International Film Festival of India (IFFI) and the National Film Development Corporation (NFDC) to launch India's first Artificial Intelligence Film Festival and Hackathon. The initiative will be held from November 20 to 28, 2025, during the 56th edition of IFFI in Goa. The collaboration between LTIMindtree BlueVerse Craft Studio and NFDC aims to create a platform exploring the intersection of cinema and emerging technologies. The festival will feature AI film showcases across fiction, documentary, animation, and experimental categories, a 48-hour hackathon for creators and developers, workshops and masterclasses on AI in film production, and global collaboration with international AI film festivals. LTIMindtree is a global technology consulting company with over 700 clients worldwide and more than 86,000 professionals across 40+ countries.",
            "Sentiment": "positive",
            "PublishDate": 1762199410133,
            "Source": "stock"
        },
        {
            "Title": "LTIM Launches Blueverse™ AI-Powered ITSM Platform with OGI Technology",
            "Summary": "LTIM has introduced Blueverse™, a new advanced IT Service Management (ITSM) platform developed alongside OGI. The platform utilizes artificial intelligence technology to enhance productivity and operational efficiency for users.",
            "Sentiment": "positive",
            "PublishDate": 1761820372492,
            "Source": "stock"
        },
        {
            "Title": "LTIMindTree Secures $100 Million Long-Term Contract with Global Chemicals Manufacturer",
            "Summary": "LTIMindTree has signed a $100 million long-term agreement with a leading global chemicals and polymers manufacturer. The deal represents a significant contract win for the IT services company in the chemicals sector.",
            "Sentiment": "positive",
            "PublishDate": 1761558454728,
            "Source": "order&deals"
        },
        {
            "Title": "LTIMindtree Reports Strong Q2 FY2026 Results with 2.4% Sequential Growth and Margin Expansion",
            "Summary": "LTIMindtree reported revenues of $1.18 billion for Q2 FY2026, reflecting sequential growth of 2.4% in constant currency terms. EBIT margins expanded significantly by 160 basis points from 14.3% to 15.9%, ahead of company plans. Order inflow stood at $1.59 billion, up 22% year-on-year, marking the fourth consecutive quarter of order inflow around $1.6 billion. The company secured large deals across all five verticals, including partnerships with global media, financial institutions, and chemical manufacturers. All verticals showed sequential growth for the second consecutive quarter, led by consumer business (9.1%) and healthcare, life sciences, and public services (10.2%). Headcount reached 86,447 with net addition of 2,558 employees including 2,604 freshers. Profit after tax grew 10.1% quarter-on-quarter to Rs 1,381 crores, with EPS at an all-time high of Rs 47.2. The Board approved an interim dividend of Rs 22 per equity share, a 10% increase from the previous year. Management expressed confidence in reaching near double-digit growth in the second half, while acknowledging productivity-related recalibrations in top client accounts due to AI implementation.",
            "Sentiment": "positive",
            "PublishDate": 1761220191269,
            "Source": "earnings"
        },
        {
            "Title": "LTIM: Nachiket Deshpande Resigns from Leadership Roles",
            "Summary": "Nachiket Deshpande has resigned from his positions as Whole-Time Director and President of LTIM.",
            "Sentiment": "negative",
            "PublishDate": 1761041635321,
            "Source": "corporate_governance"
        },
        {
            "Title": "LTIMindtree Targets Nearly Double-Digit USD Growth by H2 FY26",
            "Summary": "LTIMindtree has set a target to achieve nearly double-digit growth in USD terms by the second half of FY26. The company also plans to continue its margin expansion strategy during this period.",
            "Sentiment": "positive",
            "PublishDate": 1760671497764,
            "Source": "stock"
        },
        {
            "Title": "LTIMindtree Reports Strong Q2 FY26 Results with 10.2% Revenue Growth and Declares ₹22 Interim Dividend",
            "Summary": "LTIMindtree announced its quarterly results for the quarter ended September 30, 2025, showing revenue of ₹1,03,943 million, representing growth of 5.6% quarter-on-quarter and 10.2% year-on-year. The company reported net profit of ₹13,812 million, up 10.1% quarter-on-quarter and 10.4% year-on-year. EBIT margin expanded to 15.9% from 14.3% in the previous quarter. The company declared an interim dividend of ₹22 per equity share with a record date of October 24, 2025. LTIMindtree added 2,558 employees during the quarter, bringing total headcount to 86,447 professionals. The company secured several large deals including partnerships with global financial institutions, media companies, and government contracts. Revenue growth was broad-based across industry segments, with Banking, Financial Services & Insurance contributing 36.2% of total revenue.",
            "Sentiment": "positive",
            "PublishDate": 1760613456018,
            "Source": "earnings"
        },
        {
            "Title": "LTIMindtree Secures Multi-Year Strategic Deal with Global Entertainment Leader",
            "Summary": "LTIMindtree has secured a multi-year strategic deal with a global entertainment leader. The company announced this partnership agreement, though specific financial terms and details of the services to be provided were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1759750421705,
            "Source": "stock"
        },
        {
            "Title": "LTIMindtree Schedules Quarterly Results Review for October 16",
            "Summary": "LTIMindtree has announced it will review its quarterly results on October 16. The company has set this date for the earnings review process.",
            "Sentiment": "neutral",
            "PublishDate": 1759312170020,
            "Source": "earnings"
        },
        {
            "Title": "LTIMindtree Launches Blueverse™ RightAction™ Enterprise AI Solution",
            "Summary": "LTIMindtree has introduced Blueverse™ RightAction™, a new enterprise AI solution designed to provide faster, safer, and compliant artificial intelligence capabilities for businesses.",
            "Sentiment": "positive",
            "PublishDate": 1758788284178,
            "Source": "stock"
        },
        {
            "Title": "LTIMindtree Targets Double-Digit Revenue Growth in H2, Plans 100 Basis Points Margin Expansion",
            "Summary": "LTIMindtree aims to achieve close to double-digit year-on-year revenue growth in the second half of the financial year, according to Managing Director and CEO Venu Lambu. The company plans to expand margins by 100 basis points over the next two quarters after expanding margins in Q1. LTIMindtree's strategy focuses on winning large deals through vendor consolidation, with one large deal announced in Q1 and another expected soon. The company is capitalizing on AI investments and client modernization projects, with Lambu noting that AI has moved from experimental to core client investments. He emphasized that AI capabilities are essential for winning large deals and sees AI as an opportunity to accelerate growth despite potential revenue shrinkage in certain categories.",
            "Sentiment": "positive",
            "PublishDate": 1758352595308,
            "Source": "stock"
        },
        {
            "Title": "LTIMindtree Partners with Shopify to Launch AI Commerce Center of Excellence",
            "Summary": "LTIMindtree announced a partnership with Shopify to establish an AI-enabled Center of Excellence for Digital Commerce. The initiative will help global enterprises transform their digital commerce operations using AI technology. LTIMindtree Interactive, the company's AI-led agency unit, will drive enterprise digital commerce transformation for CMOs globally. The Center of Excellence will build advanced AI commerce capabilities, develop industry-focused accelerators for faster go-to-market, provide migration toolkits from legacy to modern platforms, design learning programs to upskill talent, and drive co-investments in new integrations. The partnership combines LTIMindtree's expertise with Shopify's AI-powered commerce platform to enable faster launches and smarter scaling for brands. LTIMindtree serves over 700 clients and employs 83,000+ professionals across 40+ countries as part of the Larsen & Toubro Group.",
            "Sentiment": "positive",
            "PublishDate": 1758101518967,
            "Source": "stock"
        },
        {
            "Title": "Nextera Partners with ServiceNow for Middle East Digital Transformation with LTIMindtree Support",
            "Summary": "Nextera has formed an alliance with ServiceNow to enhance digital transformation initiatives in the Middle East region. LTIMindtree is providing support for this partnership between the two companies.",
            "Sentiment": "positive",
            "PublishDate": 1757920902024,
            "Source": "stock"
        },
        {
            "Title": "LTIMindtree Renews Multi-Million Dollar Partnership with Nordic Fuel Company OKQ8",
            "Summary": "LTIMindtree announced the renewal of its strategic partnership with OKQ8, one of the largest fuel companies in the Nordic region, through a multi-million-dollar contract. The extended partnership will focus on optimizing OKQ8's technology landscape including Cloud and Infrastructure Management, Application Development and Maintenance, Data Analytics, CRM, and ERP services powered by Microsoft Dynamics. LTIMindtree will integrate AI-driven processes to streamline operations and enhance customer experiences. OKQ8's Chief Information Officer Clas Artvin highlighted the strong collaboration built over the years, while LTIMindtree's Executive Vice President Srinivas Rao emphasized their commitment to delivering tailored digital transformation solutions.",
            "Sentiment": "positive",
            "PublishDate": 1757406951527,
            "Source": "order&deals"
        },
        {
            "Title": "LTIMindtree Wins ₹792 Crore Government Contract for PAN 2.0 Digital Transformation Project",
            "Summary": "LTIMindtree has been awarded a ₹792 crore mandate by the Government of India's Central Board of Direct Taxes (CBDT) to transform India's PAN infrastructure. The PAN 2.0 project will consolidate all PAN and TAN services into a single digital platform as part of the Government to Citizen initiative. LTIMindtree will design, build, and operate the complete technology backbone, delivering an end-to-end digital AI ecosystem covering the entire PAN service lifecycle including application, validation, printing, and dispatch. The scope includes migrating existing PAN data with AI-led deduplication, secure integration with Aadhaar Data Vault, establishing data centers, disaster recovery sites, and operational facilities. The project rollout is planned over the next 18 months and aims to improve efficiency and transparency of tax identity services for millions of users across India.",
            "Sentiment": "positive",
            "PublishDate": 1754544899595,
            "Source": "order&deals"
        },
        {
            "Title": "LTIMindtree Wins ₹7.92 Billion PAN 2.0 Project Contract",
            "Summary": "LTIMindtree has secured the PAN 2.0 project contract valued at ₹7.92 billion. This represents a significant business win for the IT services company in the government technology sector.",
            "Sentiment": "positive",
            "PublishDate": 1754544494011,
            "Source": "stock"
        },
        {
            "Title": "LTIMindtree Receives PAN 2.0 Project from IT Department",
            "Summary": "LTIMindtree has been granted the PAN 2.0 project by the IT Department. The project represents a government technology initiative involving the company's services.",
            "Sentiment": "positive",
            "PublishDate": 1754293560540,
            "Source": "stock"
        },
        {
            "Title": "LTIM Partners With Adobe To Launch Blueverse CraftStudio",
            "Summary": "LTIM has entered into a partnership with Adobe to introduce Blueverse CraftStudio. The collaboration brings together the two companies to launch this new offering.",
            "Sentiment": "positive",
            "PublishDate": 1753874549464,
            "Source": "stock"
        },
        {
            "Title": "LTIMindtree Reports 2% Sequential Revenue Growth to $1.15B, Margin Expansion to 14.3% in Q1 FY2026",
            "Summary": "LTIMindtree reported quarterly revenues of $1.15 billion, reflecting 2% sequential growth in US dollar terms and 0.8% in constant currency. EBIT margins expanded 50 basis points to 14.3%. Order inflow stood at $1.63 billion, up 17% year-on-year, marking the third consecutive quarter exceeding $1.5 billion. The company won its largest ever deal with a global agribusiness leader for AI-driven application management and infrastructure services. Sequential growth was reported across all verticals: BFSI (1.6%), Technology Media Communication (0.8%), Manufacturing Resources (0.3%), Consumer (6.2%), and Healthcare Life Sciences (4.8%). Europe led geographically with 9.7% sequential growth. Headcount declined by 418 employees to 83,889, while utilization improved from 85.8% to 88.1%. The company onboarded 1,600+ freshers and launched BlueVerse, an Agentic AI ecosystem. The Fit4Future cost optimization program contributed approximately 1% margin improvement. Profit after tax increased 11.2% quarter-on-quarter to Rs.1,255 crores.",
            "Sentiment": "positive",
            "PublishDate": 1753193207800,
            "Source": "earnings"
        },
        {
            "Title": "LTIMindtree: Q1 Results Trigger Mixed Analyst Reactions",
            "Summary": "LTIMindtree shares fell 3% after Q1FY26 results, despite initial gains. Analysts maintain mixed views, with some raising price targets. HSBC and Nuvama reiterate 'Buy' ratings, while Morgan Stanley and Nomura remain cautious. The company's growth prospects and valuation are seen as favorable by some analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1752811890000,
            "Source": "earnings"
        },
        {
            "Title": "LTIMINDTREE Focuses on Short-Term Execution, Aiming for $10 Billion Revenue",
            "Summary": "LTIMINDTREE management is prioritizing immediate execution over long-term forecasts while working towards a $10 billion revenue goal. The company has decided not to provide a full-year forecast, instead concentrating on quarterly progress. They express confidence in continued growth for Q2 FY26, as mentioned in a concall update.",
            "Sentiment": "positive",
            "PublishDate": 1752808863000,
            "Source": "default"
        },
        {
            "Title": "LTIMindtree: Q1 Profit Rises 11% YoY, Revenue Up 8%",
            "Summary": "LTIMindtree reported Q1FY26 consolidated net profit of Rs 1,255 crore, up 11% YoY. Revenue increased 8% to Rs 9,841 crore. Dollar revenue grew 5.2% YoY to $1,153.3 million. EBIT margin expanded by 50 bps QoQ to 14.3%. CEO Venu Lambu expressed confidence despite challenging macroeconomic conditions.",
            "Sentiment": "positive",
            "PublishDate": 1752806956000,
            "Source": "earnings"
        },
        {
            "Title": "LTIMindtree Reports Q1 Financial Results",
            "Summary": "LTIMindtree announced its Q1 consolidated net profit of 12.54 billion rupees, compared to 11.29 billion rupees in the previous quarter. This exceeded the estimated 11.97 billion rupees. The company's Q1 revenue was 98.41 billion rupees, up from 97.72 billion rupees in the previous quarter, slightly above the estimated 98.36 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1752801183000,
            "Source": "default"
        },
        {
            "Title": "LTIM Reports Strong Start to FY26 with Profit Growth and AI-Driven Contracts",
            "Summary": "LTIMindtree (LTIM) has reported a strong start to their fiscal year 2026, characterized by significant profit growth and over $1.6 billion in new orders. The company is focusing on AI-driven contracts and a cloud-centered approach to facilitate large-scale digital transformations for their clients. This strategy appears to be yielding positive results in terms of business growth and technological advancement.",
            "Sentiment": "positive",
            "PublishDate": 1752768765000,
            "Source": "default"
        },
        {
            "Title": "LTIMindtree: Q1 Profit Rises 11%, Meets Estimates",
            "Summary": "LTIMindtree's Q1 net profit increased 11% YoY to Rs 1,254 crore, meeting analyst estimates. Revenue rose marginally to Rs 9,841 crore. EBIT grew 4.5% to Rs 1,407 crore, with margin expanding to 14.3%.",
            "Sentiment": "positive",
            "PublishDate": 1752751471000,
            "Source": "earnings"
        }
    ]
}