{
    "Symbol": "LTTS",
    "ISIN": "INE010V01017",
    "News": [
        {
            "Title": "L&T Technology Services CBO Steps Down",
            "Summary": "L&T Technology Services announces departure of Chief Business Officer Rajkumar Ravindranathan as he steps down to explore new opportunities in his career.",
            "Sentiment": "neutral",
            "PublishDate": 1769918287685,
            "Source": "stocks"
        },
        {
            "Title": "LTTS Wins Strategic Auto Engineering Deal",
            "Summary": "L&T Technology Services secures major engineering and R&D agreement from global automotive OEM, strengthening its position in the automotive technology sector.",
            "Sentiment": "positive",
            "PublishDate": 1769585675193,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Technology Services Independent Director Steps Down",
            "Summary": "L&T Technology Services announces cessation of Independent Director Mr. Sudip Banerjee after completing his second five-year term on January 20, 2026, as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1768990710628,
            "Source": "stocks"
        },
        {
            "Title": "L&T Tech Services ESOP Amendment Gets Shareholder Nod",
            "Summary": "L&T Technology Services shareholders approve amendment to Employee Stock Option Scheme 2016 with 92.82% votes in favor through postal ballot, creating new Sub-Plan 2025 for US employees.",
            "Sentiment": "positive",
            "PublishDate": 1768813293783,
            "Source": "co_actions_results"
        },
        {
            "Title": "LTTS Q3: Brokerages Cut Targets After Weak Results",
            "Summary": "L&T Technology Services reported disappointing Q3 results with 2.8% QoQ revenue decline and cut FY26 guidance to mid-single digits. HSBC, Nomura, JPMorgan reduced price targets citing weak growth outlook despite margin improvements.",
            "Sentiment": "negative",
            "PublishDate": 1768475210898,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Technology Services Senior Executive Retires",
            "Summary": "L&T Technology Services announces superannuation of Ms. Seema Ghanekar, Chief Segment Officer for Communications, Media, and Technology, effective December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767194765218,
            "Source": "stocks"
        },
        {
            "Title": "L&T Technology Services Q3FY26 Results on Jan 15",
            "Summary": "L&T Technology Services announces board meeting on January 15, 2026 to approve Q3FY26 financial results. Trading window closed from January 1-17, 2026. Earnings call scheduled at 7:00 PM IST.",
            "Sentiment": "neutral",
            "PublishDate": 1766488141009,
            "Source": "co_actions_results"
        },
        {
            "Title": "L&T Technology Services Opens Global Development Center in Pune with Palfinger",
            "Summary": "L&T Technology Services has established a Global Development Center in Pune focused on product development and digital transformation initiatives with Palfinger. The center aims to enhance technological capabilities and strengthen the partnership between the two companies in advancing digital solutions.",
            "Sentiment": "positive",
            "PublishDate": 1765338407325,
            "Source": "order&deals"
        },
        {
            "Title": "L&T Technology Services Receives ESG Rating Score of 71 from NSE Sustainability Ratings",
            "Summary": "L&T Technology Services has been assigned an ESG rating with a score of 71 by NSE Sustainability Ratings and Analytics Limited, a SEBI registered ESG Rating Provider. The rating reflects the company's performance on Environmental, Social and Governance parameters as independently assessed by the rating agency.",
            "Sentiment": "positive",
            "PublishDate": 1765279142933,
            "Source": "stock"
        },
        {
            "Title": "L&T Technology Services Allots 2,400 Equity Shares Under ESOP Scheme",
            "Summary": "L&T Technology Services' Nomination Remuneration Committee approved allotment of 2,400 equity shares of face value Rs. 2 each to employees who exercised vested stock options under the Employee Stock Option Scheme, 2016. The newly allotted shares will rank pari-passu with existing shares in all respects.",
            "Sentiment": "positive",
            "PublishDate": 1764681810028,
            "Source": "stock"
        },
        {
            "Title": "L&T Technology Services Clarifies Volume Surge to BSE",
            "Summary": "L&T Technology Services responded to BSE's inquiry about significant trading volume increase, stating management is unaware of specific reasons and believes the surge is market-driven. The company noted that the overall IT industry witnessed significant movement in their respective scrips, while confirming compliance with disclosure regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763628273316,
            "Source": "stock"
        },
        {
            "Title": "L&T Technology Services Partners with Autodesk to Drive Digital Transformation in Manufacturing",
            "Summary": "L&T Technology Services announced a partnership with Autodesk to drive AI-led digital transformation in process and manufacturing industries. As part of this collaboration in its Sustainability segment, LTTS will integrate Autodesk's digital engineering and cloud-based manufacturing solutions into its existing Center of Excellence in Vadodara, Gujarat. The CoE will serve as a regional hub for digital plant innovation, enabling enterprises across FMCG, chemicals, pharmaceuticals, automotive and food beverage sectors to adopt scalable, connected, and data-driven manufacturing solutions. By leveraging LTTS AI models using machine learning for asset health and scalability and Autodesk's advanced software, cloud and automation platforms, the CoE will help clients reduce project costs and timelines, improve asset performance, and scale Industry 4.0 capabilities. The LTTS-Autodesk CoE will showcase a complete BIM-to-operations lifecycle for plant engineering, including conceptual and detailed design, commissioning, digital twin deployment and asset performance management.",
            "Sentiment": "positive",
            "PublishDate": 1762919197254,
            "Source": "order&deals"
        },
        {
            "Title": "L&T Technology Services Reports Record $292 Million Deal Wins in Q2 FY26",
            "Summary": "L&T Technology Services achieved record quarterly deal wins of $292 million in Q2 FY26, including a $100 million deal in Sustainability and a $60 million deal in Tech segment. Revenue grew 1.3% sequentially and 10.4% annually in USD constant currency terms. EBIT margins improved to 13.4% from the previous quarter. The Sustainability segment delivered strong performance with 3.0% sequential and 12.6% annual growth, while the Mobility segment remained subdued due to automotive sector challenges. The company secured its first $50 million account in Plant Engineering and largest-ever $100 million deal in Industrial subsegment. Management expects H2 FY26 performance to be better than H1, with margins improving as strategic client support concluded in Q2. The company maintains its double-digit growth aspiration for FY26 and medium-term revenue target of $2 billion. Free cash flow was healthy at ₹445 crores, and the board approved an interim dividend of ₹18 per share.",
            "Sentiment": "positive",
            "PublishDate": 1761308959964,
            "Source": "earnings"
        },
        {
            "Title": "L&T Technology Services Receives Caterpillar Supplier Excellence Recognition for Second Consecutive Year",
            "Summary": "L&T Technology Services has been recertified at Caterpillar's 2025 Supplier Excellence Recognition event, marking the second consecutive year of recognition following its 2024 certification. The recognition highlights LTTS' consistent delivery, quality standards, and commitment to its strategic relationship in the Mobility segment. As a strategic supplier to Caterpillar Inc., LTTS provides advanced engineering services supporting Caterpillar's global supply chain and sustainability agenda. Caterpillar's Supplier Excellence Recognition is awarded to select suppliers meeting strict criteria in quality assurance, timely delivery, innovation, and alignment with Caterpillar's values. LTTS is a global leader in AI, Digital & ER&D Consulting Services and a subsidiary of Larsen & Toubro, serving 69 Fortune 500 companies with over 23,670 employees across 23 global design centers as of September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761190240167,
            "Source": "stock"
        },
        {
            "Title": "L&T Tech Projects Mid-16% EBIT Margins and $200M Deal Wins Target",
            "Summary": "L&T Tech expects EBIT margins to be in the mid-16% range for Q4 FY'27 to Q1 FY'28. The company is targeting at least $200 million in deal wins for Q3 FY'26, which would be lower than Q2's $300 million in deal wins.",
            "Sentiment": "neutral",
            "PublishDate": 1760930966607,
            "Source": "stock"
        },
        {
            "Title": "L&T Tech Projects USD 2 Billion Revenue Target for FY26",
            "Summary": "L&T Tech expects strong growth for FY26 with projected revenue of USD 2 billion.",
            "Sentiment": "positive",
            "PublishDate": 1760930595992,
            "Source": "stock"
        },
        {
            "Title": "LTTS Maintains $2 Billion Revenue Target Amid Record Deal Wins and AI Platform Growth",
            "Summary": "L&T Technology Services maintains its medium-term revenue target of $2 billion. The company achieved record deal wins worth $300 million and is advancing its engineering AI leadership through Gen-AI platforms and expanded global partnerships.",
            "Sentiment": "positive",
            "PublishDate": 1760715277307,
            "Source": "stock"
        },
        {
            "Title": "L&T Technology Services Appoints Three Executives as Senior Management Personnel",
            "Summary": "L&T Technology Services Limited designated three executives as Senior Management Personnel effective October 17, 2025. Atul Kapur was appointed as Chief Segment Officer for Media and Technology, bringing 3 decades of industry expertise in business strategy, P&L stewardship, and enterprise operations within technology and consulting domains. Aditya P Pathak was named Chief Segment Officer for Mobility, with over 25 years of experience in technology-led business and previous roles at Cognizant, Wipro, and Mindtree. Rupam Chaudhury was appointed as Global Business Unit Head for Medical & Life Sciences, bringing decades of experience in R&D, Product Development, Manufacturing Engineering, and the Connected Care ecosystem in the Medical Devices and Healthcare Industry.",
            "Sentiment": "positive",
            "PublishDate": 1760706466545,
            "Source": "corporate_governance"
        },
        {
            "Title": "L&T Technology Services Reports Q2 FY26 Results, Declares Rs 18 Interim Dividend",
            "Summary": "L&T Technology Services Limited announced its unaudited financial results for the quarter and six months ended September 30, 2025. On a consolidated basis, the company reported revenue from operations of Rs 29,795 million for the quarter, up from Rs 25,729 million in the same quarter last year. Net profit for the quarter stood at Rs 3,292 million compared to Rs 3,200 million in the previous year quarter. For the six-month period, consolidated revenue reached Rs 58,455 million versus Rs 50,348 million in the prior year, with net profit of Rs 6,453 million against Rs 6,339 million. The Board of Directors declared an interim dividend of Rs 18 per equity share with October 27, 2025 as the record date. The company operates through three segments: Mobility (Rs 8,651 million quarterly revenue), Sustainability (Rs 9,409 million), and Tech (Rs 11,735 million). Basic earnings per share for the quarter was Rs 31.02 compared to Rs 30.20 in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1760700315474,
            "Source": "corporate_action"
        },
        {
            "Title": "L&T Technology Services Secures $100 Million Multi-Year Contract from US Industrial Equipment Manufacturer",
            "Summary": "L&T Technology Services has won a $100 million multi-year agreement with a US-based industrial equipment manufacturer serving the semiconductor value chain. Under the contract, LTTS will support new product development, sustenance engineering, value engineering, and platform automation using AI, computer vision, and automation technologies. The company will establish a Center of Excellence to help the client accelerate innovation and transition to digital and AI-enabled operations. CEO Amit Chadha highlighted that this engagement demonstrates LTTS' expertise in AI-driven innovation for complex engineering challenges in high-growth industries. LTTS is a global leader in AI, Digital & ER&D Consulting Services with over 23,600 employees across 23 global design centers and serves 69 Fortune 500 companies.",
            "Sentiment": "positive",
            "PublishDate": 1759285637301,
            "Source": "order&deals"
        },
        {
            "Title": "L&T Technology Services Schedules Board Meeting for Q2 FY2026 Results and Interim Dividend Decision",
            "Summary": "L&T Technology Services has scheduled a Board of Directors meeting on October 17, 2025 to consider and approve unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The board will also decide on declaring an interim dividend. The company will hold an earnings conference call on the same day at 7:00 pm IST for investors and analysts. Trading window for directors, officers, key managerial personnel and designated persons will remain closed from October 1, 2025 until 48 hours after results declaration, ending October 19, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1759214257043,
            "Source": "corporate_action"
        },
        {
            "Title": "L&T Technology Services Partners with Siemens for AI-Led Manufacturing Transformation",
            "Summary": "L&T Technology Services announced an expanded partnership with Siemens Limited to advance Machine & Line Simulation and IIoT Technology within LTTS' Sustainability segment covering Process Engineering, Discrete Manufacturing and Industrial Products. The collaboration will utilize Siemens' digital technology portfolio including TIA Portal, Industrial Edge, and Tecnomatix platforms, combined with LTTS' AI-driven engineering expertise to deliver simulation-driven automation and IIoT-enabled solutions across Automotive & Transportation, Industrial Products, and Process & Plant Engineering sectors. The partnership builds on a decade of collaboration and aims to accelerate digital adoption, improve precision in system design, and enable faster decision-making across manufacturing ecosystems. LTTS will focus on Machine & Line Simulation and IIoT Technology solutions to help industries achieve greater agility and measurable business outcomes, while Siemens welcomes LTTS as a Solution Partner for co-creating scalable, future-ready innovations.",
            "Sentiment": "positive",
            "PublishDate": 1758857054253,
            "Source": "order&deals"
        },
        {
            "Title": "L&T Technology Services Partners with MIT Media Lab for AI Innovation Research",
            "Summary": "L&T Technology Services announced a multi-year membership agreement with MIT Media Lab as a consortium Lab Member to explore next-generation artificial intelligence advancements. The collaboration focuses on AI-led innovations in Mobility, Sustainability and Tech segments. LTTS will engage in discussions and information exchange within the Media Lab's cross-disciplinary ecosystem of researchers, innovators and industry leaders. The partnership aims to combine LTTS' AI and engineering expertise with MIT Media Lab's research approach to develop sustainable engineering solutions, including smarter mobility systems and greener infrastructure. LTTS will also host its Digital Engineering Awards and Advisory Council gatherings at the MIT Media Lab to support roadmap development and knowledge exchange for global R&D activities.",
            "Sentiment": "positive",
            "PublishDate": 1758252759241,
            "Source": "stock"
        },
        {
            "Title": "L&T Tech Partners with SiMa.ai for AI Solutions in Healthcare, Mobility, and Robotics",
            "Summary": "L&T Technology Services announced a partnership with Silicon Valley-based SiMa.ai to develop AI-driven solutions across mobility, healthcare, industrial automation, and robotics sectors. Under the agreement, SiMa.ai will provide AI hardware and software solutions while leveraging L&T Tech's engineering capabilities in areas including in-vehicle infotainment, AD/ADAS, industrial automation, robotics, and healthcare. The collaboration combines L&T Tech's engineering expertise with SiMa.ai's MLSoC ONE platform and software SDK. CEO Amit Chadha stated the partnership aims to help clients accelerate time-to-market, enhance operational efficiency, and deliver value through sustainable and scalable intelligent solutions. The companies plan to establish a scalable product support framework for global client deployment. L&T Tech shares traded up 0.1% at ₹4,215.1, though the stock has declined 26.7% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1756874578388,
            "Source": "stock"
        },
        {
            "Title": "L&T Technology Services Launches PLxAI Generative AI Framework for Product Development",
            "Summary": "L&T Technology Services launched PLxAI, a proprietary generative AI framework designed to accelerate product development cycles for global clients across mobility, sustainability, and technology sectors. The framework combines generative AI with conventional AI technologies to provide solutions across all product development lifecycle stages, from concept design to aftermarket services support. LTTS has deployed 36 use cases across various lifecycle stages, with 35 additional use cases in the design phase. The company serves 69 Fortune 500 companies and operates 23 global design centers with over 23,600 employees. LTTS shares were trading at ₹4,270.30, up ₹36.70 or 0.87% on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1755754895219,
            "Source": "stock"
        },
        {
            "Title": "L&T Technology Services Secures $60 Million Multi-Year Contract from US Telecom Provider",
            "Summary": "L&T Technology Services has secured a $60 million multi-year software engineering contract from a major US wireless telecommunications provider. The agreement builds on a decade-long partnership between LTTS and the client. Under the contract, LTTS will provide network software development, application engineering solutions, R&D lab integration, new product development, and functionality testing for the customer's network software automation platforms. The company will establish a delivery center in the United States to support project delivery. LTTS plans to expand services by integrating AI-powered test automation platforms for streamlined product development. CEO Amit Chadha stated the agreement reinforces their relationship and shared vision in next-generation communications, network automation, and AI.",
            "Sentiment": "positive",
            "PublishDate": 1753545753065,
            "Source": "order&deals"
        },
        {
            "Title": "L&T Technology Services Reports 13.6% YoY Growth in Q1 FY26 with Strong Large Deal Momentum",
            "Summary": "L&T Technology Services delivered revenue of ₹2,866 crores in Q1 FY26, marking 13.6% year-over-year growth in dollar terms, though declining 3.9% sequentially due to Smart World seasonality and mobility segment challenges. The company maintained EBIT margins at 13.3% despite headwinds. Key highlights include crossing the $100 million quarterly milestone in the Sustainability segment, which grew 16.4% YoY and 4.1% QoQ, making all three segments now at $400+ million annualized revenue. The company secured over $200 million in large deal wins for the third consecutive quarter, including one $50 million deal and multiple $10+ million deals. The Mobility segment faced challenges due to automotive industry flux, with delays and pauses in programs, while the Tech segment grew 29.4% YoY including Intelliswift acquisition benefits. Management expects H2 margins to improve compared to H1 and reaffirmed double-digit growth guidance for FY26, maintaining the medium-term target of $2 billion revenue. The company launched PLxAI, a proprietary AI framework, and opened a new design center in Plano, Texas. Free cash flow was negative ₹28 crores due to Smart World seasonality, while headcount stood at 23,626 with 14.8% attrition.",
            "Sentiment": "neutral",
            "PublishDate": 1753175093929,
            "Source": "earnings"
        },
        {
            "Title": "L&T Technology Services: Mixed Q1 Results Spark Divergent Analyst Views",
            "Summary": "L&T Technology Services reported Q1 FY24 earnings with revenue at $335 million, down 4.2% sequentially. Citi maintains 'sell' rating with target price of Rs 4,015, citing weak performance. Morgan Stanley holds 'equal-weight' rating, increasing target price to Rs 4,500, noting gradual recovery path. Company announced 10 large deals worth over $200 million, marking third consecutive quarter of strong deal wins.",
            "Sentiment": "neutral",
            "PublishDate": 1752721516000,
            "Source": "earnings"
        },
        {
            "Title": "L&T Tech Aims for $200 Million Quarterly Large Deal Wins and Improved EBIT Margins",
            "Summary": "L&T Tech is targeting $200 million in quarterly large deal wins, with potential for more, and has a strong pipeline in the sustainability sector. The company anticipates better EBIT margins in the second half of FY26 compared to the first half, aiming for mid-16% levels between Q4 FY27 and Q1 FY28. SG&A costs are projected to be between 10.5% and 11.5%.",
            "Sentiment": "positive",
            "PublishDate": 1752721025000,
            "Source": "default"
        },
        {
            "Title": "L&T Tech Aims for Double-Digit Growth and USD 2 Billion Revenue",
            "Summary": "L&T Tech anticipates double-digit growth by FY25 and is targeting USD 2 billion in revenue in the medium term. The company projects that the second half of FY26 will outperform the first half, based on insights from clients. This information was shared during a concall update.",
            "Sentiment": "positive",
            "PublishDate": 1752720814000,
            "Source": "default"
        },
        {
            "Title": "L&T Technology Services Reports Q1 Financial Results",
            "Summary": "L&T Technology Services has released its quarterly financial results. The company reported a consolidated net profit of 3.16 billion rupees, up from 3.11 billion rupees in the previous quarter. Revenue decreased to 28.66 billion rupees from 29.82 billion rupees quarter-over-quarter. EBIT (Earnings Before Interest and Taxes) was 3.81 billion rupees, down from 3.94 billion rupees in the previous quarter. The EBIT margin improved slightly to 13.3% from 13.21% quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1752711110000,
            "Source": "default"
        },
        {
            "Title": "L&T Tech Targets Double-Digit Growth and $2 Billion Revenue",
            "Summary": "L&T Tech Services is aiming for double-digit growth in FY26 and plans to reach $2 billion in revenue soon. The company also expects to improve its EBIT margins. No specific fiscal year or current revenue figures were mentioned in the provided news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752666820000,
            "Source": "default"
        },
        {
            "Title": "L&T Technology Services: Attrition Rate Rises, Headcount Drops in Q1",
            "Summary": "L&T Technology Services reported an attrition rate of 14.8% in Q1FY26, up from 14.3% in Q4FY25. The company's total employee headcount decreased by 630 to 23,626 employees.",
            "Sentiment": "neutral",
            "PublishDate": 1752665609000,
            "Source": "result"
        },
        {
            "Title": "L&T Technology Services Reports Q1 Financial Results",
            "Summary": "L&T Technology Services has reported its Q1 financial results. The company's consolidated net profit increased to 3.16 billion rupees from 3.11 billion rupees in the previous quarter. However, revenue decreased to 28.66 billion rupees from 29.82 billion rupees quarter-on-quarter. The EBIT (Earnings Before Interest and Taxes) for Q1 was 3.81 billion rupees, down from 3.94 billion rupees in the previous quarter. Despite the decrease in EBIT, the EBIT margin improved slightly to 13.3% from 13.21% in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1752665346000,
            "Source": "result"
        },
        {
            "Title": "L&T Technology Services: Q1 Revenue Dips, Profit Meets Estimates",
            "Summary": "L&T Technology Services reported a 3.9% QoQ revenue decline to Rs 2,866 crore in Q1 FY24, missing analyst estimates. Net profit rose 2% to Rs 316.10 crore, meeting expectations. EBIT fell 3% to Rs 381.30 crore, with EBIT margin slightly improving to 13.3%.",
            "Sentiment": "neutral",
            "PublishDate": 1752664634000,
            "Source": "earnings"
        },
        {
            "Title": "L&T Technology Services: Q1 Growth Expected to Decline Amid Weak Demand",
            "Summary": "L&T Technology Services is anticipated to face challenges in Q1FY26 results, with key metrics likely to decline due to persistent weakness in automobile and telecom industries. The company will report its results on July 16.",
            "Sentiment": "negative",
            "PublishDate": 1752581464000,
            "Source": "earnings"
        },
        {
            "Title": "L&T Technology Services: Q1 FY26 Results Announcement and Earnings Call Scheduled",
            "Summary": "L&T Technology Services will announce Q1 FY26 results on July 16, 2025. Board meeting and earnings call scheduled for the same day. Trading window closed from July 1 to July 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1752485156000,
            "Source": "corporate_action"
        },
        {
            "Title": "L&T Technology Services: Strategic Partnership with Traton Group for Global R&D Transformation",
            "Summary": "L&T Technology Services selected by Traton Group for multi-year collaboration to transform global R&D ecosystem. LTTS to provide end-to-end engineering services across Traton's development centers in multiple countries, focusing on advanced engineering domains like software-defined vehicle architectures, electrified powertrains, and autonomous systems.",
            "Sentiment": "positive",
            "PublishDate": 1751437055000,
            "Source": "order&deals"
        },
        {
            "Title": "L&T Technology Services Selected as Strategic Engineering Partner by Traton Group",
            "Summary": "L&T Technology Services has been chosen as a strategic engineering partner by Traton Group for a multi-year global R&D transformation project in mobility. The partnership will focus on platform synergies, electrification, and innovation.",
            "Sentiment": "positive",
            "PublishDate": 1751426840000,
            "Source": "default"
        },
        {
            "Title": "L&T Technology Services: Strategic Partnership with thyssenkrupp Steering for Offshore Engineering Centre",
            "Summary": "LTTS to establish and manage a software development centre in Pune for thyssenkrupp Steering, focusing on safety-critical software for advanced steering technologies. The centre will concentrate on embedded systems, functional safety, and cybersecurity development for intelligent and connected vehicle technologies.",
            "Sentiment": "positive",
            "PublishDate": 1751281293000,
            "Source": "corporate_action"
        },
        {
            "Title": "L&T Technology Services: JPMorgan Downgrades on Growth Concerns",
            "Summary": "JPMorgan downgraded L&T Technology Services to 'neutral' from 'overweight' and reduced the target price to Rs 4,100 from Rs 5,000. The downgrade is due to expected topline decline, particularly in the mobility segment. JPMorgan cut earnings estimates by 9-11% and reduced the target PE multiple from 32x to 28x. The mobility business faces challenges due to delays in deal ramp-ups from automotive OEMs, potentially dragging overall growth below 10% in FY2026.",
            "Sentiment": "negative",
            "PublishDate": 1750999838000,
            "Source": "normal_news"
        },
        {
            "Title": "L&T Technology Services Opens New Engineering Design Center in Texas",
            "Summary": "L&T Technology Services has opened a new Engineering Design Center in Plano, Texas. The center is focused on advancing progress in artificial intelligence, technology, and digital manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1750987487000,
            "Source": "default"
        },
        {
            "Title": "L&T Technology Services: Secures $50 Million Deal with Leading Energy Company",
            "Summary": "L&T Technology Services has been selected as the exclusive global engineering partner for enterprise data and digital services by a leading energy company. The five-year agreement is valued at over $50 million. The company's stock rose up to 1.5% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1750826798000,
            "Source": "order&deals"
        },
        {
            "Title": "L&T Technology Services Secures $50 Million Sustainability Contract",
            "Summary": "L&T Technology Services has been awarded a $50 million contract focused on sustainability from a global energy leader. The contract appears to be significant for the company, aligning with the growing emphasis on sustainable practices in the energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1750822165000,
            "Source": "default"
        },
        {
            "Title": "L&T Technology Services: Last Day to Buy Shares for Final Dividend Eligibility",
            "Summary": "June 5 is the last day to buy L&T Technology Services shares to qualify for the final dividend of Rs 38 per share for FY2025. The record date is set for June 6, with the total dividend payout amounting to Rs 402 crore. The company's Q4 FY2025 results showed a 3.4% decrease in net profit to Rs 311 crore, missing analyst estimates.",
            "Sentiment": "neutral",
            "PublishDate": 1749095709000,
            "Source": "corporate_action"
        },
        {
            "Title": "L&T Technology Services: Strategic Agreement with Tennant for Sustainable Product Development",
            "Summary": "L&T Technology Services has signed a strategic agreement with Tennant Company to establish an offshore development centre for advancing sustainable new product development. The centre will focus on product innovation, lifecycle management, and key business functions for Tennant's industrial cleaning portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1749012389000,
            "Source": "order&deals"
        },
        {
            "Title": "L&T Technology Services: Strategic Partnership with BITS Pilani for National Security Tech",
            "Summary": "L&T Technology Services partners with BITS Pilani and CRENS to advance research in national security technologies, focusing on cybersecurity, digital forensics, and emerging tech. The collaboration aims to drive R&D, skill development, startup incubation, and policy advisory services.",
            "Sentiment": "positive",
            "PublishDate": 1747815605000,
            "Source": "normal_news"
        },
        {
            "Title": "L&T Technology Services Partners with BITS Pilani and CRENS for National Security Research",
            "Summary": "L&T Technology Services has announced a collaboration with BITS Pilani and CRENS to drive research and development in national security. The partnership aims to bring together experts from defense, law enforcement, and cybersecurity domains to foster innovation in this field.",
            "Sentiment": "positive",
            "PublishDate": 1747798670000,
            "Source": "default"
        },
        {
            "Title": "L&T Technology Services: Record Date Set for ₹38 Final Dividend",
            "Summary": "L&T Technology Services has set June 6, 2025, as the record date for a proposed final dividend of ₹38 per equity share for FY 2024-25. If approved at the AGM, the dividend will be paid within 30 days.",
            "Sentiment": "positive",
            "PublishDate": 1747373518000,
            "Source": "corporate_action"
        },
        {
            "Title": "L&T Technology Services: Margin Improvement Goals Set for FY27-28",
            "Summary": "L&T Technology Services aims to achieve specific margin targets across mobility, sustainability, and tech segments. The company plans to increase offshore mix to 60% and improve overall margins to 16% by Q4 FY27 or Q1 FY28 through operational efficiency, synergy benefits, and improved contract structures.",
            "Sentiment": "positive",
            "PublishDate": 1745559288000,
            "Source": "earnings"
        }
    ]
}