{
    "Symbol": "LUMAXIND",
    "ISIN": "INE162B01018",
    "News": [
        {
            "Title": "Lumax Industries Q3 FY26 Earnings Call on Feb 13",
            "Summary": "Lumax Industries has scheduled its Q3 & 9M FY26 earnings call for February 13, 2026 at 11:00 AM IST to discuss operational and financial performance for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770294282844,
            "Source": "stocks"
        },
        {
            "Title": "Lumax Industries Reports 24% Revenue Growth in Q2 FY26, Announces New Bengaluru Plant",
            "Summary": "Lumax Industries delivered strong quarterly results with operating revenue of Rs. 1,009 crores (24.2% YoY growth) and EBITDA of Rs. 91 crores, while announcing a new Rs. 140 crore manufacturing facility in Bengaluru for Maruti Suzuki and Toyota orders. The company revised its full-year revenue growth guidance upward to 20-25% from 15-20% following GST rate cuts, with order book standing at over Rs. 1,800 crores providing strong revenue visibility.",
            "Sentiment": "positive",
            "PublishDate": 1763207830385,
            "Source": "earnings"
        },
        {
            "Title": "Lumax Industries Reports Strong Q2 Results, Announces Rs 140 Crore Bengaluru Plant Investment",
            "Summary": "Lumax Industries Limited reported its quarterly results for the quarter ended September 30, 2025. The Board approved three key decisions: submission of unaudited standalone and consolidated financial results, an investment of up to Rs 1.61 crores to acquire up to 26% stake in Power Pulse Trading Solutions Limited (PTSL) for captive renewable energy usage at manufacturing facilities in Haridwar, Pant Nagar and Sanand, and establishment of a new manufacturing plant in Bengaluru, Karnataka with a capital outlay of Rs 140 crores. The Bengaluru project will serve new orders from MSIL and Toyota, with expected peak annual turnover of Rs 450 crores post commissioning. The project is expected to be commissioned by Q4 FY2026-27 and will be funded through internal accruals. PTSL is a power trading arm of Adani Energy Solutions Limited, incorporated on February 13, 2024, with a turnover of Rs 11.99 crores from incorporation to March 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762500741253,
            "Source": "earnings"
        },
        {
            "Title": "Lumax Industries Reports Strong Q2 Growth with Revenue Rising to 10 Billion Rupees",
            "Summary": "Lumax Industries reported Q2 revenue of 10 billion rupees, up from 8.1 billion rupees in the same quarter last year. The company's EBITDA increased to 887 million rupees from 598 million rupees year-over-year, with EBITDA margin improving to 8.79% from 7.36%. Consolidated net profit rose to 356 million rupees compared to 283 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762497283124,
            "Source": "earnings"
        },
        {
            "Title": "Lumax Industries Reports 20.5% Revenue Growth in Q1 FY26, Order Book Reaches INR 2,000 Crores",
            "Summary": "Lumax Industries delivered strong quarterly results with consolidated revenue of INR 923 crores, marking 20.5% year-on-year growth. EBITDA increased to INR 84 crores from INR 70 crores, with margins improving to 9.2%. Profit after tax grew 6% to INR 36 crores. LED lighting now accounts for 61% of total revenue, up from 45% in the same quarter last year, with 84% of the current order book being LED-based. The company maintains a healthy order book of approximately INR 2,000 crores. Revenue mix shows 65% from passenger vehicles, 29% from 2-wheelers, and 6% from commercial vehicles. The company started production for Maruti's first EV model eVitara and launched lighting products for multiple vehicle models including Tata Altroz and Maruti Grand Vitara. Management expects 15-20% top line growth for the full year with EBITDA margins in double digits.",
            "Sentiment": "positive",
            "PublishDate": 1755515089360,
            "Source": "earnings"
        },
        {
            "Title": "Lumax Industries Reports Order Book Exceeding ₹1,900 Crore with Focus on LED and EV Segments",
            "Summary": "Lumax Industries has an order book valued at over ₹1,900 crore, with 84% comprising LED products and 18% from electric vehicle segments. The company is targeting growth through premium product offerings, increased LED usage per vehicle, and new product launches. The company has outlined technology plans for OLED, ADB, and ADAS lighting solutions.",
            "Sentiment": "positive",
            "PublishDate": 1754499773046,
            "Source": "stock"
        },
        {
            "Title": "Lumax Industries Reports Q1 FY2026 Financial Results with Statutory Auditor Review",
            "Summary": "Lumax Industries Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The board meeting was held on August 6, 2025, with results recommended by the Audit Committee. Statutory auditors M/s. S.R. Batliboi & Co. LLP provided Limited Review Reports. On a standalone basis, the company reported revenue from operations of Rs 92,252.13 lakhs, profit before tax of Rs 3,393.04 lakhs, and profit for the period of Rs 2,541.08 lakhs. Basic earnings per share stood at Rs 27.18. On a consolidated basis, revenue from operations was Rs 92,252.18 lakhs, profit before tax reached Rs 4,327.98 lakhs, and profit for the period was Rs 3,616.52 lakhs. The company operates in automotive components manufacturing and trading, with activities falling within a single primary operating segment. The statutory auditors issued an unmodified conclusion on both standalone and consolidated results.",
            "Sentiment": "neutral",
            "PublishDate": 1754477969140,
            "Source": "earnings"
        },
        {
            "Title": "Lumax Industries Reports Strong Q1 Growth with Revenue Up 19.9% and EBITDA Rising 41.5%",
            "Summary": "Lumax Industries delivered robust quarterly results with revenue increasing to 9.23 billion rupees from 7.7 billion rupees year-over-year. The company's EBITDA grew significantly to 818 million rupees compared to 578 million rupees in the same period last year. EBITDA margin expanded to 8.87% from 7.35% year-over-year. Consolidated net profit rose to 362 million rupees from 342 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754477374331,
            "Source": "earnings"
        },
        {
            "Title": "Lumax Industries Executive Vice President Makoto Kawamura Resigns Due to Transfer to Hungary",
            "Summary": "Lumax Industries Limited announced the resignation of Makoto Kawamura, Executive Vice President (Global Relationship), effective March 28, 2025. Kawamura, who served as a nominee of Stanley Electric Co. Ltd (the company's technical and financial collaborator), resigned due to his transfer to Hungary by Stanley. In his resignation letter dated February 25, 2025, Kawamura mentioned he had worked with Lumax Industries for 2 years and appreciated the professional development opportunities provided. The company acknowledged an inadvertent delay in reporting this resignation and committed to ensuring timely regulatory compliance going forward.",
            "Sentiment": "neutral",
            "PublishDate": 1753273602042,
            "Source": "corporate_governance"
        },
        {
            "Title": "Lumax Industries: Q4 Profit Surges 22%, ₹35 Dividend Proposed",
            "Summary": "Lumax Industries reported a 22.2% YoY increase in Q4 net profit to ₹44 crore, with revenue up 24.3% to ₹923.4 crore. EBITDA rose 20.3% to ₹79.3 crore. The board proposed a final dividend of ₹35 per share for FY25, with August 7, 2025, set as the record date.",
            "Sentiment": "positive",
            "PublishDate": 1748259445000,
            "Source": "earnings"
        },
        {
            "Title": "Lumax Industries Reports Q4 Results and Declares Dividend",
            "Summary": "Lumax Industries has announced its Q4 financial results and declared a dividend. The company's Q4 consolidated net profit increased to 440 million rupees from 361 million rupees year-over-year. Revenue rose to 9.2 billion rupees from 7.43 billion rupees. EBITDA grew to 793 million rupees from 659 million rupees, while the EBITDA margin slightly decreased to 8.59% from 8.87%. The company has declared a dividend of 35 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1748253398000,
            "Source": "result"
        },
        {
            "Title": "Lumax Industries Reports Strong Q3 Revenue Growth",
            "Summary": "Lumax Industries, an automotive lighting solutions provider, has announced its third-quarter financial results. The company reported revenue of 8.9 billion rupees, marking a significant increase from 6.32 billion rupees in the same quarter of the previous year. This represents a year-over-year growth of approximately 40.8%.",
            "Sentiment": "positive",
            "PublishDate": 1739179979000,
            "Source": "earnings"
        },
        {
            "Title": "Lumax Industries Reports Mixed Q3 Results",
            "Summary": "Lumax Industries has reported its Q3 financial results. The company's EBITDA increased to 699 million rupees, up from 582 million rupees in the same quarter last year. However, the EBITDA margin decreased to 7.88% from 9.22% year-over-year, indicating a decline in profitability despite higher earnings.",
            "Sentiment": "neutral",
            "PublishDate": 1739179960000,
            "Source": "earnings"
        },
        {
            "Title": "Lumax Industries Reports 30.8% Increase in Q3 Net Profit",
            "Summary": "Lumax Industries has announced its financial results for the third quarter. The company's consolidated net profit rose to 335 million rupees, up from 256 million rupees in the same period last year, representing a 30.8% year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739179911000,
            "Source": "earnings"
        }
    ]
}