{
    "Symbol": "LUMAXTECH",
    "ISIN": "INE872H01027",
    "News": [
        {
            "Title": "Lumax Auto Tech Schedules Non-Deal Roadshow Feb 19",
            "Summary": "Lumax Auto Technologies announces participation in Philip Capital-organized non-deal roadshow in Mumbai on February 19, 2026, featuring one-to-one meetings with analysts and institutional investors.",
            "Sentiment": "neutral",
            "PublishDate": 1770406831529,
            "Source": "stocks"
        },
        {
            "Title": "Lumax Auto Completes Subsidiary Amalgamation Scheme",
            "Summary": "Lumax Auto Technologies announces effectiveness of amalgamation scheme between subsidiaries Greenfuel Energy Solutions and Lumax Resources, with appointed date November 26, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1770131819033,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lumax Auto NCLT Order Reserved on Merger Scheme",
            "Summary": "NCLT New Delhi reserves order on merger scheme between IAC International Automotive India and Lumax Auto Technologies after hearing on December 10, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765803237541,
            "Source": "stocks"
        },
        {
            "Title": "Lumax Auto Technologies Seeks Shareholder Approval for Key Management Re-appointments",
            "Summary": "Lumax Auto Technologies has initiated a postal ballot seeking shareholder consent to re-appoint Executive Chairman D.K. Jain for 3 years and Managing Director Anmol Jain for 5 years from May 28, 2026. The e-voting period runs from November 27 to December 26, 2025, with results to be declared by December 29, 2025, involving remuneration packages including up to 5% commission on net profits for both positions.",
            "Sentiment": "neutral",
            "PublishDate": 1763986868774,
            "Source": "corporate_action"
        },
        {
            "Title": "Lumax Auto Technologies Reports 37% Revenue Growth in Q2 FY26, Revises Full-Year Guidance to 25%",
            "Summary": "Lumax Auto Technologies achieved record quarterly revenue of INR 1,156 crore in Q2 FY26 with 37% year-on-year growth, driven by strong demand, new product launches, and GST rate rationalization benefits. The company revised its full-year revenue growth guidance from 20% to 25% while maintaining EBITDA margins at 14.7% for the quarter, supported by a robust order book of INR 1,357 crore with visibility across the next 3 fiscal years.",
            "Sentiment": "positive",
            "PublishDate": 1763111343570,
            "Source": "earnings"
        },
        {
            "Title": "Lumax Auto Technologies Reports Strong Q2 Results, Approves Key Board Appointments and Strategic Investments",
            "Summary": "Lumax Auto Technologies Limited reported quarterly results for the period ended September 30, 2025, with revenue from operations of Rs. 43,600.19 lakhs and profit after tax of Rs. 1,869.09 lakhs. The Board approved re-appointment of Mr. Dhanesh Kumar Jain as Executive Chairman for 3 years and Mr. Anmol Jain as Managing Director for 5 years, both effective May 28, 2026, subject to shareholder approval. The company also approved a scheme for amalgamation of wholly-owned subsidiary IAC International Automotive India Private Limited, investment of up to Rs. 5 crores in OCRDs in Lumax Resources Private Limited, and acquisition of up to 26% stake in Power Pulse Trading Solutions Limited for Rs. 0.93 crores to qualify as captive user for renewable energy. Additionally, the Board approved corporate guarantee of up to Rs. 5 crores for Lumax Yokowo Technologies Private Limited and relocation of accessory business within Pant Nagar, Uttarakhand.",
            "Sentiment": "positive",
            "PublishDate": 1762597698870,
            "Source": "earnings"
        },
        {
            "Title": "Lumax Auto Tech Reports Strong Q2 Growth with 56% Jump in Net Profit",
            "Summary": "Lumax Auto Tech delivered robust Q2 performance with consolidated net profit rising to 668.5 million rupees from 428.7 million rupees year-over-year. Revenue grew significantly to 11.56 billion rupees compared to 8.42 billion rupees in the same period last year. EBITDA increased to 1.54 billion rupees from 1.02 billion rupees, while EBITDA margin improved to 13.36% from 12.14% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762597361899,
            "Source": "earnings"
        },
        {
            "Title": "Lumax Auto Technologies Schedules Earnings Call for Q2 and Half Year Results",
            "Summary": "Lumax Auto Technologies Limited has scheduled an earnings call for Monday, November 10, 2025 at 3:00 PM IST to discuss the company's operational and financial performance for the second quarter and half year ended September 30, 2025. The call is open to all investors and the general public, with participation available through direct dial-in or operator assistance. Management participants include Managing Director Anmol Jain, Group Chief Financial Officer Deepak Jain, Director Sanjay Mehta, CEO Vikas Marwah, and other senior executives. The earnings call information will also be available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1762258189449,
            "Source": "corporate_action"
        },
        {
            "Title": "Creditors Approve Amalgamation Scheme for Lumax Auto Technologies' Step-Down Subsidiary",
            "Summary": "Greenfuel Energy Solutions Private Limited, a step-down subsidiary of Lumax Auto Technologies Limited, received approval from secured and unsecured creditors for its amalgamation scheme with Lumax Resources Private Limited during NCLT-convened meetings held on September 15, 2025. The scheme was approved with requisite majority by creditors. Lumax Resources Private Limited is a wholly-owned subsidiary of Lumax Auto Technologies Limited. The amalgamation remains subject to final sanction by the NCLT Chandigarh Bench and other required approvals.",
            "Sentiment": "positive",
            "PublishDate": 1757942661295,
            "Source": "corporate_action"
        },
        {
            "Title": "Lumax Auto Technologies Reports 36% Revenue Growth in Q1 FY26, Announces INR 1,500 Crore Order Book",
            "Summary": "Lumax Auto Technologies Limited reported consolidated revenue of INR 1,026 crores for Q1 FY26, marking 36% year-on-year growth. EBITDA stood at INR 136 crores with margins at 13.2%, while profit after tax reached INR 54 crores, up 30% year-on-year. The company announced a robust order book of INR 1,500 crores with visibility across the next three fiscal years. Advanced Plastics division grew 25% to INR 525 crores, while Mechatronics segment nearly doubled from INR 28 crores to INR 54 crores. The aftermarket business delivered 16% growth. Mahindra & Mahindra revenue increased over 50% to INR 317 crores, driven by strong passenger vehicle segment performance and premiumization content. The company completed acquisition of remaining 25% stake in IAC India and incorporated two new subsidiaries. Management expects EBITDA margins between 14-15% for the current year and targets 16% margins by FY28. The company is establishing technology centers in China and Bangalore as part of its strategy to become a Tier 0.5 supplier.",
            "Sentiment": "positive",
            "PublishDate": 1755148735539,
            "Source": "earnings"
        },
        {
            "Title": "S.R. Batliboi & Co. LLP Resigns as Statutory Auditor of Lumax Auto Technologies' Material Subsidiary",
            "Summary": "S.R. Batliboi & Co. LLP resigned as statutory auditors of IAC International Automotive India Private Limited, a material subsidiary of Lumax Auto Technologies Limited, effective August 12, 2025. The auditing firm was appointed on September 18, 2024, for a four-year term scheduled to conclude at the Annual General Meeting in FY 2027-28. The resignation was driven by management's decision to align the subsidiary's auditors with the holding company's auditor, following S.R. Batliboi's completion of their tenure as statutory auditors of Lumax Auto Technologies Limited in September 2024. The auditor confirmed no material concerns or issues led to the resignation and had submitted their latest limited review report for the quarter ended June 30, 2025, on August 2, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755017627170,
            "Source": "corporate_governance"
        },
        {
            "Title": "Lumax Auto Targets ₹11,000 Crore Revenue By FY31 With 20% EBITDA Margins",
            "Summary": "Lumax Auto has set a revenue target of ₹11,000 crore by FY31 while aiming for 20% EBITDA margins. The company is focusing on three key areas: clean mobility, vehicle electronics, and premium OEMs to achieve these financial goals.",
            "Sentiment": "positive",
            "PublishDate": 1754586619734,
            "Source": "stock"
        },
        {
            "Title": "Lumax Auto Technologies Reports Strong Q1 Results, Expands Operations to China and Bengaluru",
            "Summary": "Lumax Auto Technologies Limited reported quarterly results for the period ended June 30, 2025. The company's standalone revenue from operations was Rs. 36,739.53 lakhs, with profit after tax of Rs. 4,034.23 lakhs and earnings per share of Rs. 5.92. On a consolidated basis, revenue from operations reached Rs. 1,02,637.29 lakhs with profit after tax of Rs. 5,399.59 lakhs and earnings per share of Rs. 6.08. The Board approved several strategic initiatives including setting up a branch office in China to explore new business prospects and strengthen technological capabilities, establishing a Technology Centre called SHIFT (Smart Hub for Innovation and Future Trends) in Bengaluru, and extending CEO Vikas Marwah's term for 5 years effective November 1, 2025. During the quarter, the company completed acquisition of the remaining 25% stake in subsidiary IAC International Automotive India Private Limited for Rs. 22,095.75 lakhs, making it a wholly owned subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1754559686154,
            "Source": "earnings"
        },
        {
            "Title": "Lumax Auto Tech Reports Strong Q1 Growth with Revenue Up 32% and Net Profit Rising 31%",
            "Summary": "Lumax Auto Tech delivered robust quarterly results with revenue increasing to 10 billion rupees from 7.55 billion rupees year-over-year. The company's consolidated net profit grew to 414 million rupees compared to 317 million rupees in the same period last year. EBITDA expanded to 1.24 billion rupees from 880 million rupees, while EBITDA margin improved to 12.17% from 11.65% year-over-year, indicating enhanced operational efficiency alongside revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1754559084336,
            "Source": "earnings"
        },
        {
            "Title": "NCLT Approves Dispensation of Shareholder and Creditor Meetings for Lumax Auto Technologies-Lumax Ancillary Merger",
            "Summary": "The National Company Law Tribunal (NCLT) has approved the dispensation of meetings for equity shareholders, secured creditors, and unsecured creditors for both Lumax Auto Technologies Limited and Lumax Ancillary Limited regarding their proposed merger scheme. The order was passed on July 28, 2025, allowing the companies to proceed without convening these meetings. Lumax Ancillary Limited, the transferor company, is a wholly-owned subsidiary of Lumax Auto Technologies Limited, the transferee company. The NCLT's decision was based on the fact that all shareholders of the transferor company provided consent affidavits, and over 90% of creditors by value approved the scheme. The merger aims to simplify corporate structure, reduce administrative costs, achieve operational synergies, and eliminate duplication of expenses. The companies will now file the Second Motion Application with NCLT within prescribed timelines to complete the amalgamation process. The appointed date for the scheme is April 1, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1753715325380,
            "Source": "corporate_action"
        },
        {
            "Title": "Lumax Auto Technologies Incorporates Wholly Owned Subsidiary with Rs 10 Lakh Capital",
            "Summary": "Lumax Auto Technologies Limited has incorporated a wholly owned subsidiary named Lumax Auto Solutions Private Limited in New Delhi on July 26, 2025. The new entity has an authorized, issued and paid-up share capital of Rs 10 lakh, divided into 1,00,000 equity shares of Rs 10 each. The subsidiary will operate in the automotive components sector, aligned with the company's vision to address growth opportunities in the automotive sector. Lumax Auto Technologies holds 100% shareholding in the new entity through cash consideration. The incorporation does not fall within the purview of Related Party Transaction for the company.",
            "Sentiment": "positive",
            "PublishDate": 1753528868440,
            "Source": "corporate_action"
        },
        {
            "Title": "Lumax Auto Technologies Incorporates Wholly Owned Subsidiary with Rs 10 Lakh Capital",
            "Summary": "Lumax Auto Technologies Limited incorporated a wholly owned subsidiary named LUMAX AUTOCOMP PRIVATE LIMITED in New Delhi on July 24, 2025. The new entity has an authorized capital of Rs 10 lakhs, divided into 1,00,000 equity shares of Rs 10 each. The subsidiary will operate in the automotive components industry to address growth opportunities in the automotive sector. Lumax Auto Technologies holds 100% shareholding in the new entity through cash consideration. The operations will align with the parent company's vision in the automotive components sector.",
            "Sentiment": "positive",
            "PublishDate": 1753362239565,
            "Source": "corporate_action"
        },
        {
            "Title": "Lumax Auto Tech Targets 20% Growth by FY2026, Plans ₹800-1,000 Crore from Greenfuel",
            "Summary": "Lumax Auto Tech has set a growth target of 20% for the fiscal year 2026. The company also plans to generate between ₹800 crore and ₹1,000 crore from its Greenfuel division over the next six years.",
            "Sentiment": "positive",
            "PublishDate": 1749364340000,
            "Source": "default"
        },
        {
            "Title": "Lumax Auto Technologies: Ambitious 20% Annual Growth Target Until 2030",
            "Summary": "Lumax Auto Technologies aims for 20% CAGR until 2030, driven by strong order book, increased wallet share, and recent joint ventures. The company targets Rs 10,000-11,000 crore revenue by FY31, with potential strategic acquisitions. Margin improvement expected through organic growth and acquisitions, aiming for 16% EBITDA margin by FY28.",
            "Sentiment": "positive",
            "PublishDate": 1748998563000,
            "Source": "normal_news"
        },
        {
            "Title": "Lumax Auto Targets 20% EBITDA Margin and 20% CAGR",
            "Summary": "Lumax Auto has announced its vision to achieve a 20% EBITDA margin in the next 7-8 years. The company is also aiming for a 20% Compound Annual Growth Rate (CAGR) going forward. Additionally, Lumax Auto expects to see another 80-100 basis points margin expansion in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1748927636000,
            "Source": "default"
        },
        {
            "Title": "Lumax Auto Tech Reports Q4 Results and Dividend Recommendation",
            "Summary": "Lumax Auto Tech has announced its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit increased to 583.8 million rupees, up from 442.1 million rupees year-over-year and 448.2 million rupees quarter-over-quarter. Q4 revenue rose to 11.33 billion rupees from 7.57 billion rupees year-over-year. EBITDA for Q4 grew to 1.57 billion rupees from 918.7 million rupees year-over-year, with EBITDA margin improving to 13.83% from 12.13%. The company has recommended a dividend of 5.50 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748538589000,
            "Source": "result"
        },
        {
            "Title": "Lumax Auto Technologies: Q4 Profit Jumps 32%, Revenue Surges 52%",
            "Summary": "Lumax Auto Technologies reported Q4 FY2025 net profit of ₹58.4 crore, up 32% YoY. Revenue increased 49.6% to ₹1,133 crore. EBITDA rose 70.6% to ₹156.7 crore with margins expanding 171 bps to 13.83%. The company announced a final dividend of ₹5.5 per share.",
            "Sentiment": "positive",
            "PublishDate": 1748519558000,
            "Source": "earnings"
        },
        {
            "Title": "Lumax Auto Technologies Inaugurates Two New Plants in Maharashtra",
            "Summary": "Lumax Auto Technologies has inaugurated two new plants at Chakan, Pune, in Maharashtra. These plants belong to IAC International Automotive India Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1748425103000,
            "Source": "default"
        },
        {
            "Title": "Lumax Auto Technologies to Acquire Remaining 25% Stake in IAC India",
            "Summary": "Lumax Auto Technologies has announced plans to purchase the remaining 25% stake in IAC India. This acquisition will give Lumax Auto Technologies full ownership of IAC India, increasing their stake from the current 75% to 100%.",
            "Sentiment": "positive",
            "PublishDate": 1747653871000,
            "Source": "default"
        },
        {
            "Title": "Lumax Auto Technologies: Full Acquisition of IAC India, Exclusive Supplier for Mahindra EVs",
            "Summary": "Lumax Auto Technologies Limited (LATL) is acquiring the remaining 25% stake in IAC India, making it a fully owned subsidiary. IAC India is the sole supplier of cockpits and door panels for Mahindra's BE6 and BE9e electric vehicles. The deal is expected to close by May 31, 2025, enhancing LATL's presence in the automotive plastics sector, particularly for EVs.",
            "Sentiment": "positive",
            "PublishDate": 1747556700000,
            "Source": "corporate_action"
        },
        {
            "Title": "Lumax Auto Technologies: Acquiring Remaining 25% Stake in IAC India",
            "Summary": "Lumax Auto Technologies Ltd. will acquire the remaining 25% stake in IAC International Automotive India Pvt. for Rs 221 crore, making it a wholly-owned subsidiary. The acquisition is expected to be completed by May 31, 2025. IAC India's operations and management will remain unchanged, with continued technology support from IAC Group.",
            "Sentiment": "positive",
            "PublishDate": 1747410863000,
            "Source": "corporate_action"
        },
        {
            "Title": "Lumax Auto Technologies to Acquire Remaining 25% Stake in IAC India",
            "Summary": "Lumax Auto Technologies has approved the acquisition of the remaining 25% interest in IAC India. The equity value for this 25% stake is reported to be 2.21 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1747401409000,
            "Source": "default"
        },
        {
            "Title": "Lumax Auto Forecasts Strong Revenue Growth",
            "Summary": "Lumax Auto has announced during a conference call that they expect their overall revenue to outperform the industry. The company estimates a top-line growth between 15% to 20%.",
            "Sentiment": "positive",
            "PublishDate": 1740043624000,
            "Source": "earnings"
        },
        {
            "Title": "Lumax Auto Technologies: Q3 Profit Jumps 23% to ₹44.82 Crore",
            "Summary": "Lumax Auto Technologies reported Q3 FY25 results with a 23% YoY increase in profit to ₹44.82 crore. Revenue rose 23.63% to ₹905.6 crore. EPS grew to ₹6.58, up 22.99% YoY. Operating income increased by 11.93% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1739653151000,
            "Source": "earnings"
        },
        {
            "Title": "Lumax Auto Technologies Reports Q3 FY24 Financial Results",
            "Summary": "Lumax Auto Technologies has released its Q3 financial results. The company's EBITDA increased to 1.18 billion rupees from 1.05 billion rupees year-over-year. However, the EBITDA margin decreased to 13.02% from 14.46% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739439174000,
            "Source": "earnings"
        },
        {
            "Title": "Lumax Auto Technologies Reports 23% Revenue Growth in Q3",
            "Summary": "Lumax Auto Technologies Limited has reported a significant increase in revenue for the third quarter. The company's revenue rose to 9 billion rupees, up from 7.32 billion rupees in the same period last year, representing a year-over-year growth of approximately 23%.",
            "Sentiment": "positive",
            "PublishDate": 1739439157000,
            "Source": "earnings"
        },
        {
            "Title": "Lumax Auto Technologies Reports 23% Increase in Q3 Net Profit",
            "Summary": "Lumax Auto Technologies has reported a consolidated net profit of 448 million rupees for the third quarter, representing a 23% increase from 364 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739439099000,
            "Source": "earnings"
        },
        {
            "Title": "Lumax Auto Technologies Acquires Majority Stake in GreenFuel Energy Solutions",
            "Summary": "Lumax Auto Technologies has acquired a 60% stake in GreenFuel Energy Solutions for 1.53 billion rupees. This strategic move allows Lumax to enter the green and alternate fuels segment, diversifying its portfolio in the automotive industry.",
            "Sentiment": "positive",
            "PublishDate": 1732666625000,
            "Source": "corporate_action"
        },
        {
            "Title": "Lumax Auto Technologies Acquires Majority Stake in Greenfuel Energy Solutions",
            "Summary": "Lumax Auto Technologies has acquired a 60% stake in Greenfuel Energy Solutions' alternate fuels business for 1.53 billion rupees. This strategic move marks Lumax's entry into the green and alternate fuels segment, positioning the company to capitalize on the growing demand for sustainable energy solutions in the automotive industry.",
            "Sentiment": "positive",
            "PublishDate": 1732622369000,
            "Source": "corporate_action"
        },
        {
            "Title": "Lumax Auto Tech Reports Q2 FY24 Financial Results",
            "Summary": "Lumax Auto Technologies Limited has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter increased to 1 billion rupees, up from 901 million rupees in the same quarter last year. However, the EBITDA margin decreased slightly to 12.14% from 12.87% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731506302000,
            "Source": "result"
        },
        {
            "Title": "Lumax Auto Tech Reports Q2 Revenue Growth",
            "Summary": "Lumax Auto Technologies Limited has reported a revenue of 8.4 billion rupees for the second quarter, compared to 7 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731506155000,
            "Source": "result"
        },
        {
            "Title": "Lumax Auto Tech Reports Strong Q2 Profit Growth",
            "Summary": "Lumax Auto Technologies Limited has reported a significant increase in consolidated net profit for the second quarter. The company's net profit rose to 428 million rupees, up from 274 million rupees in the same quarter last year, representing a year-over-year growth. The profit also increased quarter-over-quarter, from 316.9 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731506110000,
            "Source": "result"
        }
    ]
}