{
    "Symbol": "LUPIN",
    "ISIN": "INE326A01037",
    "News": [
        {
            "Title": "Lupin Reports Strong Q3 FY26 Results with 26.4% Growth",
            "Summary": "Lupin Limited delivered robust Q3 FY26 performance with sales of ₹71,005 Mn, up 26.4% YoY. EBITDA surged 68.6% to ₹23,766 Mn with margin expansion to 33.5%. US market led growth with 54% increase.",
            "Sentiment": "positive",
            "PublishDate": 1770916897892,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lupin settles patent dispute with Astellas for $90M",
            "Summary": "Lupin Limited resolves patent infringement litigation with Astellas Pharma regarding Mirabegron product through settlement agreement worth USD 90 million, allowing continued product sales.",
            "Sentiment": "positive",
            "PublishDate": 1770689953618,
            "Source": "stocks"
        },
        {
            "Title": "Lupin Launches Topiramate Capsules in U.S. Market",
            "Summary": "Lupin has launched Topiramate Extended-Release Capsules in the U.S. market, targeting an estimated annual sales opportunity of USD 164 million in this therapeutic segment.",
            "Sentiment": "positive",
            "PublishDate": 1770218683727,
            "Source": "stocks"
        },
        {
            "Title": "Lupin Launches Dasatinib Tablets in US Market",
            "Summary": "Lupin receives FDA approval and launches Dasatinib tablets in the US market across six dosage strengths, targeting expected annual sales of USD 930 million.",
            "Sentiment": "positive",
            "PublishDate": 1770010666093,
            "Source": "stocks"
        },
        {
            "Title": "Lupin Partners with TB Alliance for Tuberculosis Drug",
            "Summary": "Lupin forms strategic partnership with TB Alliance to develop Telacebec, a treatment for tuberculosis and other mycobacterial illnesses, providing manufacturing and regulatory support.",
            "Sentiment": "positive",
            "PublishDate": 1770007499461,
            "Source": "stocks"
        },
        {
            "Title": "DGTR Finds Dumping in Ethambutol Imports",
            "Summary": "India's trade regulator concludes preliminary dumping of Ethambutol Hydrochloride from China and Thailand, citing material injury to domestic pharmaceutical manufacturers including Lupin.",
            "Sentiment": "positive",
            "PublishDate": 1769917131984,
            "Source": "stocks"
        },
        {
            "Title": "Lupin Sees Rs. 19.17 Crore NSE Block Trade",
            "Summary": "Lupin Ltd. witnessed a significant block trade on NSE worth Rs. 19.17 crores involving approximately 90,749 shares at Rs. 2,112.70 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769660930130,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lupin Board Meeting Set for Feb 12 to Review Q3FY26",
            "Summary": "Lupin Limited has scheduled a board meeting on February 12, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769599194206,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lupin allots 169,140 equity shares under ESOP",
            "Summary": "Lupin Limited's Operations and Finance Committee allotted 169,140 equity shares of ₹ 2 each to employees under stock option plans, increasing paid-up capital to ₹ 91,39,35,892.",
            "Sentiment": "positive",
            "PublishDate": 1769512611233,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lupin Achieves Highest CDP ESG Rating for Climate & Water",
            "Summary": "Lupin Limited receives double 'A' leadership rating from CDP for Climate Change and Water Security, marking significant improvement from previous years and positioning among global sustainability leaders.",
            "Sentiment": "positive",
            "PublishDate": 1769151886886,
            "Source": "stocks"
        },
        {
            "Title": "Lupin partners with Galenicum for Semaglutide in 23 countries",
            "Summary": "Lupin Limited announces licensing and supply agreement with Galenicum Health for injectable Semaglutide across 23 countries including Canada, Europe, Southeast Asia and Latin America to expand diabetes care portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1768962459829,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lupin Gets ESG Rating of 67 in Strong Category",
            "Summary": "Lupin Limited receives an independent ESG rating of 67 from ESG Risk Assessments & Insights Limited, placing the pharmaceutical company in the Strong category based on publicly available data.",
            "Sentiment": "positive",
            "PublishDate": 1768820782354,
            "Source": "stocks"
        },
        {
            "Title": "Lupin Issues Postal Ballot Notice for Director Appointment",
            "Summary": "Lupin Limited issues postal ballot notice dated January 14, 2026, seeking shareholder approval for Mr. Anand Kripalu's appointment as Independent Director through remote e-voting from January 15 to February 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767714510191,
            "Source": "stocks"
        },
        {
            "Title": "Lupin signs exclusive GLP-1 drug deal with Chinese firm",
            "Summary": "Lupin Ltd. secured exclusive rights to commercialize Bofanglutide, a fortnightly injectable GLP-1 drug for diabetes and obesity management in India through partnership with Gan & Lee Pharmaceuticals.",
            "Sentiment": "positive",
            "PublishDate": 1767060827088,
            "Source": "stocks"
        },
        {
            "Title": "Lupin VISUfarma acquisition delayed to February 28",
            "Summary": "Lupin announces delay in VISUfarma BV acquisition completion to February 28, 2026, subject to closing conditions. Company also reaffirms GLP-1 drug licensing deal with Gan & Lee for Indian market.",
            "Sentiment": "neutral",
            "PublishDate": 1767013605094,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lupin Partners With Neopharmed For Plasil Drug License",
            "Summary": "Lupin announces exclusive licensing partnership with Neopharmed for gastroenterology drug Plasil in Philippines and Brazil markets, expanding international presence.",
            "Sentiment": "positive",
            "PublishDate": 1766058012340,
            "Source": "stocks"
        },
        {
            "Title": "Lupin Signs Licensing Deal with Neopharmed for Plasil",
            "Summary": "Lupin Limited announces exclusive licensing agreement with Italian pharmaceutical company Neopharmed for gastroenterology brand Plasil in Philippines and Brazil markets.",
            "Sentiment": "positive",
            "PublishDate": 1766053716681,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lupin Gets Positive CHMP Opinion for Biosimilar Drug",
            "Summary": "Lupin receives positive CHMP opinion for biosimilar ranibizumab (Ranluspec) in EU, based on 600-patient Phase III trial, with Sandoz to commercialize across European markets.",
            "Sentiment": "positive",
            "PublishDate": 1765952542939,
            "Source": "stocks"
        },
        {
            "Title": "Lupin Gets US FDA EIR Approval for Nagpur Plant",
            "Summary": "Lupin receives Establishment Inspection Report (EIR) from US FDA for its injectable manufacturing facility in Nagpur with satisfactory VAI classification following September inspection.",
            "Sentiment": "positive",
            "PublishDate": 1765898884131,
            "Source": "stocks"
        },
        {
            "Title": "Lupin Manufacturing Solutions Partners with PolyPeptide",
            "Summary": "Lupin Manufacturing Solutions announces strategic alliance with PolyPeptide Group AG to enhance global peptide supply chain resilience and accelerate readiness for expanding peptide therapeutics market.",
            "Sentiment": "positive",
            "PublishDate": 1765520640553,
            "Source": "stocks"
        },
        {
            "Title": "Lupin Allots 36,626 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Lupin's Operations and Finance Committee allotted 36,626 fully paid-up equity shares of ₹2 each to employees and subsidiary staff who exercised vested stock options. The allotment increased the company's issued and paid-up share capital to ₹91,35,97,612, comprising 45,67,98,806 equity shares of ₹2 each.",
            "Sentiment": "neutral",
            "PublishDate": 1765363837079,
            "Source": "corporate_action"
        },
        {
            "Title": "Lupin Receives Tentative FDA Approval for Siponimod Tablets Generic Version",
            "Summary": "Lupin Limited received tentative approval from the U.S. FDA for its generic version of Siponimod Tablets in 0.25mg, 1mg and 2mg strengths, bioequivalent to Novartis' Mayzent for treating relapsing forms of multiple sclerosis. The product will be manufactured at Lupin's Pithampur facility in India and targets a market with estimated annual sales of USD 195 million in the U.S.",
            "Sentiment": "positive",
            "PublishDate": 1764907772109,
            "Source": "stock"
        },
        {
            "Title": "Lupin Partners with Valorum for Exclusive U.S. Distribution of Biosimilar Armlupeg",
            "Summary": "Lupin Limited entered an exclusive licensing agreement with Valorum Biologics for commercialization and distribution of biosimilar Armlupeg (pegfilgrastim-unne) in the United States. Under the partnership, Lupin will handle manufacturing and supply while receiving upfront license fees and royalty payments, as Valorum leverages its specialty market expertise to capture significant market share in oncology supportive care.",
            "Sentiment": "positive",
            "PublishDate": 1764835053393,
            "Source": "order&deals"
        },
        {
            "Title": "Lupin and PE Firms TPG, EQT in Talks to Acquire UK Nutraceutical Leader Vitabiotics",
            "Summary": "Lupin along with several private equity firms including TPG and EQT are engaged in discussions to acquire Vitabiotics, the UK's largest nutraceutical company. The potential acquisition represents a significant consolidation move in the nutraceutical sector involving multiple high-profile bidders.",
            "Sentiment": "neutral",
            "PublishDate": 1764558823647,
            "Source": "order&deals"
        },
        {
            "Title": "Lupin Receives FDA Approval for Biosimilar Armlupeg in $1.3 Billion U.S. Market",
            "Summary": "Lupin has received U.S. FDA approval for its biosimilar Armlupeg (Pegfilgrastim-Unne), marking regulatory clearance for the pharmaceutical product. The approval positions Lupin to compete in a market with estimated annual sales of $1.295 billion in the U.S.",
            "Sentiment": "positive",
            "PublishDate": 1764556146359,
            "Source": "stock"
        },
        {
            "Title": "Lupin Foundation Receives CRISIL's Highest VO1A Rating for Social Responsibility Excellence",
            "Summary": "Lupin Human Welfare and Research Foundation, the CSR arm of Lupin Limited, has been awarded CRISIL's highest VO1A rating for Very Strong Delivery Capability and High Financial Proficiency in social responsibility. The Foundation has operated for over 37 years and impacted more than 2.02 million beneficiaries across 5,400 villages in 26 districts across eight states in India through sustainable livelihood and healthcare programs.",
            "Sentiment": "positive",
            "PublishDate": 1764310737894,
            "Source": "stock"
        },
        {
            "Title": "Lupin Receives FDA Form-483 with Seven Observations Following Goa Facility Inspection",
            "Summary": "The US FDA issued a Form-483 containing seven observations to Lupin following an inspection of the company's Goa manufacturing facility. This regulatory action affects Lupin's operations and indicates areas requiring corrective measures to maintain compliance with FDA standards.",
            "Sentiment": "negative",
            "PublishDate": 1763942798667,
            "Source": "stock"
        },
        {
            "Title": "Lupin Receives FDA Form-483 with Seven Observations After Goa Facility Inspection",
            "Summary": "The U.S. FDA conducted an inspection at Lupin's manufacturing facility in Goa from November 10 to November 21, 2025, which concluded with the issuance of a Form-483 containing seven observations. Lupin has committed to address these observations within the stipulated timeframe and maintain CGMP compliance across all facilities.",
            "Sentiment": "negative",
            "PublishDate": 1763745671447,
            "Source": "stock"
        },
        {
            "Title": "Lupin's Nagpur Unit-1 Passes FDA Inspection Without Issues",
            "Summary": "Lupin confirmed that the FDA inspection of its Nagpur Unit-1 manufacturing facility has been closed with no issues identified. The successful inspection closure indicates the facility meets FDA regulatory standards, which is positive for the pharmaceutical company's operations and compliance status.",
            "Sentiment": "positive",
            "PublishDate": 1763214412248,
            "Source": "stock"
        },
        {
            "Title": "Lupin Launches Risperidone Long-Acting Injectable in U.S. with 180-Day Exclusivity",
            "Summary": "Lupin unveiled its Risperidone Long-Acting Injectable in the U.S. market, securing 180-day CGT exclusivity for the antipsychotic medication. This represents the first commercial launch from the company's PrecisionSphere platform technology, marking a significant milestone for Lupin's specialized drug delivery capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1763090371479,
            "Source": "stock"
        },
        {
            "Title": "Lupin Achieves S&P Global ESG Score of 91, Surpassing Pharmaceutical Industry Average",
            "Summary": "Lupin Limited announced it achieved an S&P Global ESG Score of 91 for 2025, significantly above the pharmaceutical industry average of 28. This places Lupin in an exclusive group of companies worldwide that have surpassed the 90-point mark. The score represents a dramatic increase from 17 in 2021 and a 15-point jump from the previous year. Ramesh Swaminathan, Executive Director and Global CFO, described achieving above 90 as a rare global distinction that establishes Lupin as a leader in sustainable growth. The company made progress across Environmental, Social, and Governance pillars, including increased renewable energy use, reduced carbon emissions, water-positive operations, diversity and inclusion initiatives, community health programs, enhanced transparency, and strengthened corporate governance with board-level ESG oversight.",
            "Sentiment": "positive",
            "PublishDate": 1763018713660,
            "Source": "stock"
        },
        {
            "Title": "Lupin Reports Record Q2 Revenue of INR 7,048 Crores with 31.3% EBITDA Margin",
            "Summary": "Lupin Limited delivered record quarterly results with total revenue from operations reaching INR 7,048 crores, up 24% year-over-year, and EBITDA of INR 2,138 crores with margins at 31.3%. The US business grew 47% YoY to USD 315 million, driven by new product launches including Tolvaptan exclusivity and complex injectables approvals. India business grew 3.4% YoY with core domestic formulations up 8.8%. The company raised full-year EBITDA margin guidance to 25-26% from previous 24-25%. Lupin announced a planned acquisition of VISUfarma to expand European presence and specialty portfolio. The company received EIR from US FDA for its Aurangabad facility and continues investments in biosimilars and respiratory products.",
            "Sentiment": "positive",
            "PublishDate": 1762994219485,
            "Source": "earnings"
        },
        {
            "Title": "Lupin Manufacturing Solutions Launches Dedicated Oncology Block at Vizag Facility",
            "Summary": "Lupin Manufacturing Solutions, a wholly owned subsidiary of Lupin Limited, commissioned a dedicated Oncology Block at its Vizag facility in India. The 4,270 square meter facility features 20 reactors ranging from 250L to 2000L, over 20 isolators, and advanced containment systems with exposure levels of ≤0.05 ug/m³. The facility supports flexible scale-up capabilities with 1-35kg batch range and comprehensive environmental controls. It integrates a Process Development Laboratory with a dedicated Quality Control laboratory, enabling operations from preclinical research to commercial manufacturing. The facility enhances LMS's Contract Development and Manufacturing Organization capabilities for High Potent Active Pharmaceutical Ingredients, supporting global clients in oncology drug development and manufacturing. LMS operates as a 100% subsidiary of Lupin Limited and employs 2,504 scientists, offering integrated solutions across drug substances, complex chemistry, drug products, and advanced modalities including ADCs and peptides.",
            "Sentiment": "positive",
            "PublishDate": 1762935355798,
            "Source": "stock"
        },
        {
            "Title": "Lupin Shares Rise 3% as Jefferies Raises Target Price Following Strong Q2 Results",
            "Summary": "Lupin shares gained 3% to Rs 2,027 after Jefferies maintained its Buy rating and raised the target price following the company's quarterly earnings. The pharmaceutical company reported a 73.34% year-on-year increase in net profit to Rs 1,478 crore and revenue growth of 24.2% to Rs 7,047.5 crore. EBITDA rose 74.7% to Rs 2,341.7 crore with margins improving to 33.2% from 23.6% previously. The US business delivered $315 million in sales, the highest since Q3FY17, driven by new launches including Glucagon and Liraglutide. Lupin raised its EBITDA margin guidance by 1% to 25-26% range for FY26 and expects US revenue to exceed $1 billion. The company plans to file over 15 products in FY26 and targets 20 complex product launches by 2028. Jefferies raised FY26 and FY27 EPS estimates by 7% and 5% respectively.",
            "Sentiment": "positive",
            "PublishDate": 1762760041894,
            "Source": "stock"
        },
        {
            "Title": "Lupin Outlines Product Pipeline and Financial Targets in Strategic Update",
            "Summary": "Lupin plans to release Risperdal Consta soon and has recently introduced a generic version of Ravicti. The company aims to introduce over 80 new products in India, beginning with Semaglutide launches. Lupin anticipates a full year FY26 tax rate between 21-22% and targets having 5 biosimilar products in the market by FY30. The company expects its India Formulations business to outperform the Indian Pharmaceutical Market (IPM) by 1.2X to 1.3X.",
            "Sentiment": "positive",
            "PublishDate": 1762746540956,
            "Source": "stock"
        },
        {
            "Title": "Lupin Raises FY26 EBITDA Margin Guidance to 25-26%",
            "Summary": "Lupin has revised its EBITDA margin projections for FY26 upward to 25-26%, an increase from the previous estimate of 24-25%. The company expects FY27 EBITDA margins to remain at 24-25%. This guidance update was shared during a conference call.",
            "Sentiment": "positive",
            "PublishDate": 1762746137978,
            "Source": "stock"
        },
        {
            "Title": "Lupin Bioresearch Center Clears U.S. FDA Inspection with Zero Observations",
            "Summary": "Lupin's Bioresearch Center successfully completed a U.S. FDA inspection and assessment, receiving zero observations. This indicates the facility met all regulatory standards during the FDA's review process.",
            "Sentiment": "positive",
            "PublishDate": 1762584048523,
            "Source": "stock"
        },
        {
            "Title": "Lupin Reports Strong Q2FY26 Performance with 24% Sales Growth and Margin Expansion",
            "Summary": "Lupin Limited announced its quarterly results with sales reaching ₹68,314 million, representing 24% year-over-year growth. The company achieved an EBITDA of ₹21,376 million with improved margins, and net income of ₹14,779 million. Key business segments showed mixed performance: North America grew 46% YoY to ₹28,720 million, India business grew 3% YoY to ₹20,777 million, LATAM increased 81% YoY to ₹3,443 million, while APAC remained flat at ₹2,995 million and EMEA grew 68% YoY to ₹2,729 million. The company launched Liraglutide Injection and Risperidone Injection in the US market during the quarter. Lupin strengthened its global specialty ophthalmology business through VISUfarma acquisition and entered an out-licensing partnership with Sandoz for Ranibizumab Biosimilar. The company received regulatory approvals from Taiwan FDA for Pithampur Unit-I and from ANVISA for Dabhasa facility, while Mexico operations received no observations from Cofepris.",
            "Sentiment": "positive",
            "PublishDate": 1762479471792,
            "Source": "earnings"
        },
        {
            "Title": "Lupin Targets Mid-Teens Growth Through U.S. Generics and Biosimilar Expansion",
            "Summary": "Lupin has outlined its growth strategy targeting mid-teens growth driven by U.S. generic drug launches, India branded portfolio expansion, and biosimilar development. The pharmaceutical company is strengthening its respiratory and cardiovascular segments while expecting margin expansion through cost efficiency measures, complex product mix optimization, and increased API backward integration. The company's R&D efforts are focused on peptide and inhalation therapies.",
            "Sentiment": "positive",
            "PublishDate": 1762440738280,
            "Source": "stock"
        },
        {
            "Title": "Lupin Reports 73% Jump in Net Profit, Beats Analyst Estimates",
            "Summary": "Lupin Ltd reported a 73.34% year-on-year increase in net profit to ₹1,478 crore for the quarter ended September 2025, exceeding analyst estimates of ₹1,217.8 crore. Revenue from operations grew 24.2% to ₹7,047.5 crore, surpassing the poll estimate of ₹6,559.4 crore. EBITDA rose 74.7% to ₹2,341.7 crore with margins improving to 33.2% from 23.6% in the previous year. The company showed strong performance across all markets including the US, emerging markets, and India. Managing Director Nilesh Gupta described it as one of their strongest performances ever and expressed confidence in delivering a strong FY26. Despite the strong results, Lupin shares ended down 2.11% at ₹1,956.05 on the BSE.",
            "Sentiment": "positive",
            "PublishDate": 1762438996200,
            "Source": "earnings"
        },
        {
            "Title": "Lupin Reports Strong Q2 Performance with 76% Jump in Net Profit to ₹13,573 Million",
            "Summary": "Lupin Limited announced its quarterly results with net profit after tax increasing to ₹13,573 million compared to ₹8,078 million in the same quarter last year. Revenue from operations reached ₹40,683 million versus ₹41,062 million in the previous year quarter. The company transferred its Over the Counter (OTC) and API R&D business in India to wholly owned subsidiaries for ₹8,200 million and ₹180 million respectively, resulting in gains on divestment of ₹6,590 million and ₹37 million. However, the company provided for diminution in value of investment in a subsidiary of ₹700 million. For the six months period, net profit was ₹34,854 million on revenue of ₹97,769 million. The company paid a final dividend of ₹12 per equity share. On consolidated basis, the quarterly net profit was ₹14,848 million on revenue of ₹70,475 million.",
            "Sentiment": "positive",
            "PublishDate": 1762436593533,
            "Source": "earnings"
        },
        {
            "Title": "Lupin Receives EIR from U.S. FDA for Pithampur Unit-3 Facility",
            "Summary": "Lupin has received an Establishment Inspection Report (EIR) from the U.S. FDA for its Pithampur Unit-3 facility. An EIR is typically issued by the FDA following an inspection of pharmaceutical manufacturing facilities.",
            "Sentiment": "positive",
            "PublishDate": 1762346123442,
            "Source": "stock"
        },
        {
            "Title": "Lupin Launches AI-Driven Cardiometabolic Wellness Platform Vitalyfe™ for Indian Workforce",
            "Summary": "Lupin has introduced Vitalyfe™, an AI-driven cardiometabolic wellness platform designed to support India's workforce in improving heart health and integrating wellness into health benefits programs.",
            "Sentiment": "positive",
            "PublishDate": 1761812794594,
            "Source": "stock"
        },
        {
            "Title": "Lupin Inaugurates New Corporate Offices in Bridgewater, New Jersey and Allots 4,312 ESOP Shares",
            "Summary": "Lupin Limited inaugurated new corporate offices at 100 Somerset Corporate Blvd in Bridgewater, New Jersey. The approximately 18,000 square foot office will accommodate various corporate functions including commercial, HR, finance, legal, marketing, business development, and R&D. Governor Phil Murphy and Somerset County Commissioner Deputy Director Melonie Marano attended the ribbon-cutting ceremony alongside Lupin executives including CEO Vinita Gupta. The expansion increases Lupin's New Jersey workforce to over 300 employees, with plans for continued growth. Lupin first entered New Jersey in 2016 by acquiring a manufacturing facility in Somerset. Separately, Lupin's Operations and Finance Committee allotted 4,312 fully paid-up equity shares of ₹2 each under the company's Stock Option plans for employees. This increased the company's issued and paid-up share capital to ₹91,35,24,360 consisting of 45,67,62,180 equity shares of ₹2 each.",
            "Sentiment": "positive",
            "PublishDate": 1761648119906,
            "Source": "corporate_action"
        },
        {
            "Title": "Lupin Launches Authorized Generic Version of Ravicti Oral Liquid in U.S.",
            "Summary": "Lupin has introduced an authorized generic version of Ravicti Oral Liquid in the United States. The medication is used for managing chronic urea cycle disorders.",
            "Sentiment": "positive",
            "PublishDate": 1761278826021,
            "Source": "stock"
        },
        {
            "Title": "Lupin Schedules Quarterly Earnings Review for November 6",
            "Summary": "Lupin has announced that it will review its quarterly earnings on November 6. The pharmaceutical company has set this date for the earnings review process.",
            "Sentiment": "neutral",
            "PublishDate": 1761133050744,
            "Source": "earnings"
        },
        {
            "Title": "Lupin to Present Phase 1 Data for LNP3693 at ESMO Congress 2025",
            "Summary": "Lupin will present Phase 1 data for LNP3693 at the ESMO Congress 2025 on October 19, 2025. The presentation will focus on safety and anti-tumor effects of the drug candidate.",
            "Sentiment": "neutral",
            "PublishDate": 1760347204500,
            "Source": "stock"
        },
        {
            "Title": "Lupin's New Jersey Facility Passes FDA Pre-Approval Inspection with Single Observation",
            "Summary": "Lupin announced that the US FDA concluded a Pre-Approval Inspection at its Somerset, New Jersey manufacturing facility with one observation. The inspection ran from September 29 to October 10, 2025. The company stated it will address the observation and respond to the FDA within the required timeframe, emphasizing its commitment to CGMP standards compliance across all facilities. Separately, Lupin plans to invest $250 million over five years to establish a new pharmaceutical manufacturing facility in Coral Springs, Florida, focusing on respiratory medicines production. Lupin shares closed with minimal gains of 0.09% at ₹1,959 per share, while showing a 3.41% increase over the past three months.",
            "Sentiment": "positive",
            "PublishDate": 1760168932434,
            "Source": "stock"
        },
        {
            "Title": "Lupin's U.S. Manufacturing Facility Receives One FDA Observation During Pre-Approval Inspection",
            "Summary": "Lupin Limited disclosed that the U.S. FDA conducted a Pre-Approval Inspection at their Somerset, New Jersey manufacturing facility from September 29 to October 10, 2025. The inspection concluded with one observation. The pharmaceutical company stated it will address the observation and respond to the U.S. FDA within the stipulated timeframe, reaffirming its commitment to CGMP compliance across all facilities.",
            "Sentiment": "neutral",
            "PublishDate": 1760165378141,
            "Source": "stock"
        },
        {
            "Title": "Lupin Launches Partnership Program for PrecisionSphere Injectable Platform, Receives First US FDA Approval",
            "Summary": "Lupin Limited has launched a partnership program to expand its PrecisionSphere™ Long-Acting Injectable Platform. The company aims to create collaborations that will extend product lifecycles. The first product under this platform has received approval from the US FDA.",
            "Sentiment": "positive",
            "PublishDate": 1760002476021,
            "Source": "stock"
        }
    ]
}