{
    "Symbol": "LUXIND",
    "ISIN": "INE150G01020",
    "News": [
        {
            "Title": "Lux Industries clarifies volume surge to BSE",
            "Summary": "Lux Industries responds to BSE inquiry on trading volume increase, confirms no undisclosed price-sensitive information pending disclosure under regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1770707498739,
            "Source": "stocks"
        },
        {
            "Title": "Lux Industries Board Meet Set for Feb 14, 2026",
            "Summary": "Lux Industries has scheduled its Board of Directors meeting for February 14, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768466253813,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lux Industries Clarifies No Undisclosed Information Behind Recent Volume Surge",
            "Summary": "Lux Industries responded to BSE's inquiry about increased trading volume, stating the company has no undisclosed price-sensitive information or pending announcements that could explain the volume movement. The company confirmed compliance with all regulatory disclosure requirements and emphasized that no material information requiring disclosure to exchanges is pending.",
            "Sentiment": "neutral",
            "PublishDate": 1764318715057,
            "Source": "stock"
        },
        {
            "Title": "Lux Industries Reports 47.76 Crore Net Profit for Quarter Ended September 2025",
            "Summary": "Lux Industries Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported a standalone net profit of Rs. 47.76 crores for the quarter, with total income of Rs. 784.08 crores. For the half year period, net profit reached Rs. 166.09 crores on total income of Rs. 1,397.63 crores. The consolidated results showed quarterly net profit of Rs. 23.06 crores and half-yearly profit of Rs. 46.33 crores. The company operates through three business verticals covering brands like LuxCozi, LuxNitro, LuxVenus, and others. Basic earnings per share stood at Rs. 7.70 for the quarter on a standalone basis.",
            "Sentiment": "positive",
            "PublishDate": 1762594779314,
            "Source": "earnings"
        },
        {
            "Title": "Lux Industries Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Lux Industries reported quarterly results showing revenue growth to 7.75 billion rupees from 6.74 billion rupees year-over-year. However, consolidated net profit declined significantly to 234.5 million rupees from 511.8 million rupees in the same period last year. EBITDA decreased to 439 million rupees from 645.9 million rupees, while EBITDA margin compressed to 5.66% from 9.59% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762593450741,
            "Source": "earnings"
        },
        {
            "Title": "Lux Industries Sets Record Date for Final Dividend Payment",
            "Summary": "Lux Industries Limited has set September 15, 2025, as the record date for determining shareholder eligibility for the final dividend for the financial year ending March 31, 2025. The dividend payment is subject to approval at the Annual General Meeting scheduled for September 22, 2025. The record date determines which shareholders will be entitled to receive the dividend payment.",
            "Sentiment": "neutral",
            "PublishDate": 1755522402112,
            "Source": "corporate_action"
        },
        {
            "Title": "Lux Industries Plans Growth Through Premium Markets and E-Commerce Expansion",
            "Summary": "Lux Industries has outlined its growth strategy focusing on premium and athleisure market segments while boosting e-commerce operations and expanding exports. The company plans to implement cost savings measures, increase brand investments, and strengthen distribution networks. These strategic initiatives are expected to enhance profit margins and increase market share during the FY26 to FY28 period.",
            "Sentiment": "positive",
            "PublishDate": 1755016925926,
            "Source": "stock"
        },
        {
            "Title": "Lux Industries Releases Q1 FY26 Investor Presentation Highlighting 13% Revenue Growth",
            "Summary": "Lux Industries has released its investor presentation showing quarterly results with revenue growth of 13% and volume growth of 17%. The company launched new brands including 'Lux Nitro' in the mid-premium men's innerwear segment with Kartik Aaryan as brand ambassador, 'Lux Parker' in the economy segment with Sourav Ganguly, and 'Lux Cozi Pynk' women's outerwear range with Shraddha Kapoor. Export revenue grew 52% with presence in 46+ countries. The company increased solar power capacity from 1MW to 1.7MW and maintains a 15% share in the organized men's innerwear market. Revenue from operations reached ₹604 crores with EBITDA of ₹55 crores. The company operates through three verticals with manufacturing facilities across West Bengal, Punjab, Tamil Nadu and Uttar Pradesh, serving 2 lakh+ retailers through 1,170+ dealers.",
            "Sentiment": "positive",
            "PublishDate": 1755009557443,
            "Source": "stock"
        },
        {
            "Title": "Lux Industries Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "Lux Industries reported Q1 revenue of 6 billion rupees, up from 5.3 billion rupees in the same period last year. However, consolidated net profit declined to 230 million rupees from 340 million rupees year-over-year. EBITDA fell to 353 million rupees from 447 million rupees, while EBITDA margin compressed to 5.9% from 8.4% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754992104129,
            "Source": "earnings"
        },
        {
            "Title": "Lux Industries Schedules Board Meeting for August 12 to Approve Quarterly Financial Results",
            "Summary": "Lux Industries Limited has scheduled a Board of Directors meeting on August 12, 2025, to consider and approve the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The meeting will be held at the company's head office in Kolkata. The trading window for company shares will remain closed for designated persons and their immediate relatives until 48 hours after the financial results are disclosed to the stock exchanges. The company trades on BSE under scrip code 539542 and on NSE under symbol LUXIND.",
            "Sentiment": "neutral",
            "PublishDate": 1753453010910,
            "Source": "corporate_action"
        },
        {
            "Title": "Lux Industries Reports Q4 Results and Announces Dividend",
            "Summary": "Lux Industries has announced its Q4 financial results and recommended a dividend. The company's Q4 EBITDA was 770 million rupees, compared to 755.5 million rupees year-over-year. The EBITDA margin decreased to 9.42% from 10.55% in the same period last year. Consolidated net profit for Q4 was 481 million rupees, down from 555.4 million rupees year-over-year but up from 321 million rupees quarter-on-quarter. Q4 revenue increased to 8.2 billion rupees from 7.16 billion rupees year-over-year. The company has recommended a dividend of 2 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1748003856000,
            "Source": "result"
        },
        {
            "Title": "Lux Industries to Consider Q4 Results on May 23",
            "Summary": "Lux Industries has announced that it will consider and approve its financial results for the fourth quarter on May 23.",
            "Sentiment": "neutral",
            "PublishDate": 1745850394000,
            "Source": "default"
        },
        {
            "Title": "Lux Industries Reports Improved Q3 EBITDA and Margin",
            "Summary": "Lux Industries has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 500 million rupees from 345 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 9.06% from 7.75% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739438209000,
            "Source": "earnings"
        },
        {
            "Title": "Lux Industries Reports 23.6% Revenue Growth in Q3",
            "Summary": "Lux Industries, a textile company, has reported a significant increase in its third-quarter revenue. The company's revenue rose to 5.5 billion rupees, up from 4.45 billion rupees in the same quarter of the previous year, representing a year-over-year growth of approximately 23.6%.",
            "Sentiment": "positive",
            "PublishDate": 1739438074000,
            "Source": "earnings"
        },
        {
            "Title": "Lux Industries Reports 59% Increase in Q3 Net Profit",
            "Summary": "Lux Industries has announced its financial results for the third quarter, reporting a consolidated net profit of 321 million rupees. This represents a significant increase from the 202 million rupees reported in the same quarter of the previous year, marking a year-over-year growth of approximately 59%.",
            "Sentiment": "positive",
            "PublishDate": 1739438054000,
            "Source": "earnings"
        },
        {
            "Title": "Lux Industries Reports Improved Q2 Financial Performance",
            "Summary": "Lux Industries has announced its Q2 financial results, showing an increase in EBITDA to 650 million rupees from 550 million rupees year-over-year. The company's EBITDA margin also improved to 9.60% from 8.65% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731403348000,
            "Source": "result"
        },
        {
            "Title": "Lux Industries Reports Q2 Revenue Growth",
            "Summary": "Lux Industries has announced its second quarter revenue for the current fiscal year. The company reported revenue of 6.9 billion rupees, compared to 6.36 billion rupees in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731403297000,
            "Source": "result"
        },
        {
            "Title": "Lux Industries Reports Significant Profit Increase in Q2",
            "Summary": "Lux Industries has announced its Q2 consolidated net profit, which stands at 512 million rupees, compared to 371 million rupees in the same quarter last year. This represents a substantial year-over-year increase in the company's profitability.",
            "Sentiment": "positive",
            "PublishDate": 1731403242000,
            "Source": "result"
        },
        {
            "Title": "Mukul Mahavir Agrawal Increases Stake in Lux Industries",
            "Summary": "<p>Investor <span class='neutral'>Mukul Mahavir Agrawal</span> has <span class='positive'>increased</span> his <b>stake</b> in <span class='neutral'>Lux Industries</span> from <span class='neutral'>1.33%</span> to <span class='positive'>1.47%</span> during the <b>second quarter</b> of the financial year.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728978480000,
            "Source": "normal_news"
        }
    ]
}