{
    "Symbol": "LXCHEM",
    "ISIN": "INE576O01020",
    "News": [
        {
            "Title": "Laxmi Organic Reports No QIP Proceeds Deviation Q3 FY26",
            "Summary": "Laxmi Organic Industries confirms no deviation in QIP proceeds utilization for Q3 FY26, with monitoring agency report showing INR 217.82 million unutilized from INR 2,591.21 million issue.",
            "Sentiment": "neutral",
            "PublishDate": 1770207200326,
            "Source": "co_actions_results"
        },
        {
            "Title": "Laxmi Organic Industries Reports Zero IPO Deviation",
            "Summary": "Laxmi Organic Industries confirms no deviation in IPO proceeds utilization for Q3FY26, with Axis Bank monitoring report showing 0% deviation from stated objects in March 2021 prospectus.",
            "Sentiment": "positive",
            "PublishDate": 1769705681487,
            "Source": "co_actions_results"
        },
        {
            "Title": "Laxmi Organic Q3FY26 Results: Revenue Declines 7.9%",
            "Summary": "Laxmi Organic Industries reported Q3FY26 standalone revenue of ₹7,068.72 million, down 7.9% YoY. Net profit fell 28.7% to ₹198.31 million despite operational improvements.",
            "Sentiment": "negative",
            "PublishDate": 1769701811859,
            "Source": "co_actions_results"
        },
        {
            "Title": "Laxmi Organic Q3FY26 Earnings Call on Jan 30",
            "Summary": "Laxmi Organic Industries schedules earnings conference call for January 30, 2026, to discuss Q3FY26 operational and financial performance for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768901195496,
            "Source": "co_actions_results"
        },
        {
            "Title": "Laxmi Organic Clarifies Environmental Compliance",
            "Summary": "Laxmi Organic Industries addresses environmental compliance at its Lote facility and refutes misleading media comparisons regarding operational standards.",
            "Sentiment": "neutral",
            "PublishDate": 1766969440551,
            "Source": "stocks"
        },
        {
            "Title": "Laxmi Organic Faces Scrutiny Over Italian Plant Machinery",
            "Summary": "Laxmi Organic's Lote facility under political and regulatory scrutiny for using machinery from banned Italian chemical plant Miteni, amid PFAS production allegations and environmental concerns.",
            "Sentiment": "negative",
            "PublishDate": 1766756710611,
            "Source": "stocks"
        },
        {
            "Title": "Laxmi Organic Industries Shareholders Approve Independent Director Reappointment and QIP Variation",
            "Summary": "Laxmi Organic Industries announced that shareholders approved two special resolutions through postal ballot voting - the reappointment of Dr. Rajeev Vaidya as Independent Director for a second 3-year term and variation in objects of the Qualified Institutional Placement issue from October 2023. Both resolutions passed with requisite majority, with 424 members participating in the remote e-voting process that concluded on December 6, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765273472541,
            "Source": "corporate_action"
        },
        {
            "Title": "CRISIL Revises Laxmi Organic Industries' Outlook to Negative, Maintains AA Rating",
            "Summary": "CRISIL Ratings revised the outlook on Laxmi Organic Industries' long-term bank facilities to Negative from Stable while reaffirming the CRISIL AA rating. The rating agency also reaffirmed its CRISIL A1 rating on the company's short-term bank facilities and commercial paper.",
            "Sentiment": "negative",
            "PublishDate": 1763638132329,
            "Source": "stock"
        },
        {
            "Title": "Laxmi Organic Industries Seeks Shareholder Approval for Director Re-appointment and QIP Fund Reallocation",
            "Summary": "Laxmi Organic Industries has initiated a postal ballot seeking shareholder approval for two key matters. The company proposes to re-appoint Dr. Rajeev Vaidya as Independent Director for a second three-year term from November 25, 2025 to November 24, 2028. Dr. Vaidya brings 33 years of chemicals industry experience and previously served as Global President at DuPont Building Innovations. The company also seeks approval to reallocate ₹109.58 million of unutilized proceeds from its October 2023 QIP issue. These funds, originally allocated for the Mahape innovation center project, will be redirected to the Dahej manufacturing facility project due to cost savings achieved in the Mahape project. The revised timeline for utilizing Dahej project proceeds has been extended to June 30, 2026. The e-voting period runs from November 7, 2025 to December 6, 2025, with results to be announced by December 9, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762374866342,
            "Source": "corporate_action"
        },
        {
            "Title": "Laxmi Organic Industries Confirms No Deviation in QIP Fund Utilization",
            "Summary": "Laxmi Organic Industries Limited confirmed no deviation in the utilization of Qualified Institutional Placement (QIP) proceeds from the stated objectives in the placement document dated October 10, 2023. The monitoring agency report by India Ratings Research Private Limited for the quarter ended September 30, 2025, verified this compliance. The QIP raised funds for three main purposes: ₹360.01 million for setting up a new innovation center at Mahape MIDC, ₹1,619.66 million for establishing a new manufacturing facility at Dahej, Gujarat, and ₹500.97 million for general corporate purposes. As of the quarter end, ₹250.43 million has been utilized for the innovation center project, ₹1,383.38 million for the manufacturing facility, and the full amount for general corporate purposes. The actual QIP issue expenses were ₹105.49 million against the estimated ₹110.57 million, resulting in a surplus of ₹5.08 million that was allocated to general corporate purposes. Both projects experienced delays of more than 18 months due to workspace limitations and government approval delays respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1762364618931,
            "Source": "corporate_action"
        },
        {
            "Title": "Laxmi Organic Industries Reports 9% Revenue Decline in Q2 FY26, Specialty Chemicals Drop 20%",
            "Summary": "Laxmi Organic Industries reported a 9% decline in revenue for Q2 FY26, primarily driven by a 20% drop in specialty chemicals business. The specialty segment decline was attributed to three factors: 10% from anticipated phase-out of an agrochemical product, 7% from market price moderation, and the remainder from deferred orders to the second half. Essentials revenue declined 5% due to feedstock-linked pricing, though volumes remained in line with the previous year. EBITDA fell to INR 37 crores from INR 74 crores in the same quarter last year, with EBITDA margin dropping from 9.7% to 5.3%. The company received consent to operate from Gujarat Pollution Control Board for Phase 1 of its Dahej facility and has started supplying customers. The fluorination project is ramping up according to plan, targeting 40-50% of peak revenues for FY26. Laxmi signed a contract with Hitachi Energy for SF6-free gas production with a 60 metric tonne capacity and INR 75 crores capex, expected to be mechanically complete by Q2 of next financial year.",
            "Sentiment": "negative",
            "PublishDate": 1762235516057,
            "Source": "earnings"
        },
        {
            "Title": "Laxmi Organic Projects Rs. 80 Crore Fluorine Chemical Revenue by FY26",
            "Summary": "Laxmi Organic expects to generate approximately Rs. 80 crore in revenue from fluorine chemicals by FY26. The company plans to complete Rs. 800 crore in capitalization by the end of FY26, with the remaining amount to be completed in FY27.",
            "Sentiment": "positive",
            "PublishDate": 1761881821373,
            "Source": "stock"
        },
        {
            "Title": "Laxmi Organic Industries Reports 61% Drop in Q2 Net Profit",
            "Summary": "Laxmi Organic Industries reported a consolidated net profit of 110 million rupees for Q2, down from 280.9 million rupees in the same quarter last year, representing a 61% decline. The company's revenue also decreased to 6.99 billion rupees from 7.71 billion rupees year-over-year, marking a 9% drop in quarterly revenue.",
            "Sentiment": "negative",
            "PublishDate": 1761751408238,
            "Source": "earnings"
        },
        {
            "Title": "Laxmi Organic Industries Grants 429,799 Employee Stock Options Under ESOP-2024",
            "Summary": "Laxmi Organic Industries Limited's Nomination and Remuneration Committee approved the grant of 429,799 stock options to eligible employees under the Laxmi Employee Stock Option Plan 2024. Each stock option is convertible into one equity share with a face value of ₹2, priced at an exercise price of ₹146 per option. All 429,799 options are vested and can be exercised within 5 years. The scheme complies with SEBI regulations for share-based employee benefits.",
            "Sentiment": "positive",
            "PublishDate": 1761659253411,
            "Source": "corporate_action"
        },
        {
            "Title": "Laxmi Organic Receives Operating Consent for Dahej Manufacturing Facility",
            "Summary": "Laxmi Organic has received Consent to Operate (CTO) from the Gujarat Pollution Control Board for the first phase of its synthetic organic chemicals manufacturing facility located at Dahej. This regulatory approval allows the company to commence operations at the facility.",
            "Sentiment": "positive",
            "PublishDate": 1760918906033,
            "Source": "stock"
        },
        {
            "Title": "Laxmi Organic Industries Commences Commercial Operations at Dahej Manufacturing Facility",
            "Summary": "Laxmi Organic Industries Limited received Consent to Operate from Gujarat Pollution Control Board for the first phase of its Synthetic Organic Chemicals manufacturing facility in Dahej, Gujarat. The company successfully commissioned this phase and dispatched its first product shipment, marking the start of commercial operations at the site. The company plans to operationalize the entire Dahej facility in phases over the coming months while maintaining safety, efficiency, and quality standards.",
            "Sentiment": "positive",
            "PublishDate": 1760786716043,
            "Source": "stock"
        },
        {
            "Title": "Laxmi Organic Industries Wins Supreme Court Case Against MSEDCL on Electricity Dispute",
            "Summary": "The Supreme Court dismissed Maharashtra State Electricity Distribution Company Limited's (MSEDCL) Special Leave Petition on October 6, 2025, upholding the Appellate Tribunal for Electricity's order in favor of Laxmi Organic Industries Limited. The petition challenged APTEL's final order from October 24, 2024, in Appeal Nos. 245 of 2018 and 376 of 2018. With the dismissal, the APTEL order has attained finality regarding wheeling charges and losses. Laxmi Organic Industries received the Supreme Court's order copy on October 13, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760435807775,
            "Source": "stock"
        },
        {
            "Title": "Laxmi Organic Industries Wins Favorable Ruling from Maharashtra Electricity Regulatory Commission",
            "Summary": "Laxmi Organic Industries Limited received a favorable final order from the Maharashtra Electricity Regulatory Commission (MERC) in Case No. 137/2025 against Maharashtra State Electricity Distribution Company Limited (MSEDCL). The order exempts the company's Unit 2 from wheeling charges/losses and transmission charges/losses when using Open Access supply from its CPP at Unit 1. MSEDCL has been directed to withdraw disconnection notices dated May 29, 2025 and June 4, 2025, and set aside all bills raised on Unit 2 from June 2019 to May 2025 related to these charges. Additionally, MSEDCL must process the company's Open Access applications without requiring payment of disputed arrears. A separate Special Leave Petition (61237 of 2024) remains pending with no hearing date scheduled.",
            "Sentiment": "positive",
            "PublishDate": 1758200794065,
            "Source": "stock"
        },
        {
            "Title": "Bombay High Court Disposes of Writ Petitions Challenging CGST Rule 96(10), Laxmi Organic Reviews Impact",
            "Summary": "The Bombay High Court disposed of writ petitions filed by multiple companies, including Laxmi Organic Industries Limited, challenging Rule 96(10) of the CGST Rules, 2017. The rule created challenges for exporters using the Advance Authorisation Scheme, which allows importing raw materials without paying Integrated Goods and Services Tax, but barred them from claiming IGST refunds on final export products. The Court acknowledged the repeal of Rule 96(10) via notification dated October 8, 2024, and ruled that pending proceedings including undisposed show cause notices and orders not yet finalized will stand lapsed. The Court quashed and set aside the impugned show cause notices and orders. Laxmi Organic Industries is reviewing the judgment's implications on its operations and pending matters.",
            "Sentiment": "positive",
            "PublishDate": 1757685890348,
            "Source": "stock"
        },
        {
            "Title": "Laxmi Organic Industries Signs 5-Year Global Sourcing Deal with Hitachi Energy for ₹75 Crores",
            "Summary": "Laxmi Organic Industries Limited has entered into a Global Sourcing Agreement with Hitachi Energy Limited, Switzerland, dated September 9, 2025. The 5-year contract involves supplying eco-efficient gas used in Hitachi Energy's SF6-free high-voltage switchgear portfolio. Laxmi Organic Industries will make a capital expenditure commitment of approximately ₹75 crores under this agreement. The contract covers both domestic and international supply, though the overall contract size cannot be precisely determined at this stage. The agreement does not involve any promoter group interest or related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1757482578761,
            "Source": "order&deals"
        },
        {
            "Title": "Laxmi Organic Industries Redeems ₹50 Crore Commercial Paper on Schedule",
            "Summary": "Laxmi Organic Industries Limited successfully redeemed its Commercial Paper worth ₹50 crores on August 7, 2025. The Commercial Paper was originally issued on May 9, 2025, in favor of ICICI Bank Limited with a three-month maturity period. The company confirmed the timely payment of the redemption amount on the scheduled maturity date through a disclosure to stock exchanges.",
            "Sentiment": "positive",
            "PublishDate": 1754576176331,
            "Source": "corporate_action"
        },
        {
            "Title": "Laxmi Organic Industries Reports 4% Revenue Decline in Q1FY26 Despite 8% Volume Growth",
            "Summary": "Laxmi Organic Industries reported a 4% revenue decline to Rs 1,828 million in Q1FY26 despite achieving 8% volume growth. The Essentials segment grew 4% with 11% volume growth, offset by a 7% price decline due to falling acetic acid feedstock prices. The Specialties segment declined 18%, impacted by an anticipated phase-out of an agro AI product (9% of specialty sales) and deferred deliveries to global customers (4% of sales). EBITDA margins compressed with Essentials at 2% and Specialties at 16%. The company spent Rs 79 million on supply chain digitization and Rs 39 million on Lote operations. PAT stood at Rs 214 million (3.1% margin) compared to 4.8% in the previous year. Management announced leadership changes with Mr. Rajesh Naik replacing retiring manufacturing president Mr. Prashant, and Dr. Keshav Ruthiya joining as Head of Procurement. The Dahej project remains on track for mechanical completion by end of Q3/early Q4. Ethyl acetate spreads compressed to $120 range from the historical average of $220. The company signed an LOI with Hitachi Energy for SF6 replacement production, with contract finalization targeted for Q2FY26.",
            "Sentiment": "negative",
            "PublishDate": 1754143444510,
            "Source": "earnings"
        },
        {
            "Title": "Laxmi Organics Expects Q2 FY26 Performance to Match or Exceed Q1 Results",
            "Summary": "Laxmi Organics announced it will not provide full-year FY26 guidance but expects Q2 FY26 performance to match or exceed Q1 results. The company's specialty business anticipates a stronger second half of FY26 due to delayed deliveries. These updates were shared during a conference call.",
            "Sentiment": "positive",
            "PublishDate": 1753846763425,
            "Source": "earnings"
        },
        {
            "Title": "Laxmi Organic Industries Reports No Deviation in IPO and QIP Fund Utilization for Quarter Ended June 30, 2025",
            "Summary": "Laxmi Organic Industries Limited confirmed no deviation in the utilization of proceeds from both its IPO and Qualified Institutional Placement (QIP) for the quarter ended June 30, 2025. The company raised Rs. 4,843.78 million through its IPO conducted from March 15-17, 2021, with funds allocated for subsidiary investments, manufacturing facility expansion, working capital, plant and machinery purchases, debt repayment, and general corporate purposes. Additionally, the company raised Rs. 2,591.21 million through QIP on October 10, 2023, designated for setting up a new innovation centre at Mahape, a new manufacturing facility at Dahej, and general corporate purposes. Both fund utilizations are being monitored by Axis Bank Limited for IPO proceeds and India Ratings & Research for QIP proceeds. The company's compliance officer confirmed that all funds have been used according to their stated objectives without any deviation from the original prospectus dated March 18, 2021, and placement document dated October 10, 2023.",
            "Sentiment": "positive",
            "PublishDate": 1753723247657,
            "Source": "stock"
        },
        {
            "Title": "Laxmi Organic Industries Reports Decline in Q1 Financial Performance",
            "Summary": "Laxmi Organic Industries reported quarterly results showing a significant decline across key financial metrics. EBITDA dropped to 308 million rupees from 711 million rupees in the same period last year, while EBITDA margin compressed to 4.44% from 9.91%. Consolidated net profit fell to 214 million rupees compared to 344 million rupees year-over-year. Revenue also declined to 6.93 billion rupees from 7.2 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1753719597217,
            "Source": "earnings"
        },
        {
            "Title": "Laxmi Organic Industries Approves Quarterly Financial Results for June 2025",
            "Summary": "Laxmi Organic Industries Limited's Board of Directors approved the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The board meeting was held on July 28, 2025, commencing at 17:00 hours and concluding at 20:30 hours. The company has submitted the results along with limited review reports from statutory auditors to stock exchanges BSE and NSE. The results will be published in newspapers and made available on stock exchange websites and the company's website at www.laxmi.com.",
            "Sentiment": "neutral",
            "PublishDate": 1753717578124,
            "Source": "earnings"
        },
        {
            "Title": "Anti-Dumping Investigation on Methyl Acetoacetate Imports from Switzerland",
            "Summary": "The Indian government has initiated an anti-dumping investigation on imports of Methyl Acetoacetate from Switzerland. This investigation affects Laxmi Organics, a company mentioned in the news. Anti-dumping investigations are typically conducted to determine if foreign imports are being sold at unfairly low prices, potentially harming domestic industries.",
            "Sentiment": "neutral",
            "PublishDate": 1751253643000,
            "Source": "default"
        },
        {
            "Title": "Laxmi Organic Industries' Writ Petition Against MSEDCL Dismissed",
            "Summary": "The Bombay High Court has dismissed a writ petition filed by Laxmi Organic Industries against MSEDCL (Maharashtra State Electricity Distribution Company Limited). No further details about the nature of the petition or its implications are provided in the given news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1750118887000,
            "Source": "default"
        },
        {
            "Title": "Bombay High Court Dismisses Laxmi Organic Industries' Writ Petition Against MSEDCL",
            "Summary": "The Bombay High Court has dismissed a writ petition filed by Laxmi Organic Industries against MSEDCL (Maharashtra State Electricity Distribution Company Limited). No further details about the nature of the petition or its implications are provided in the given news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1750071500000,
            "Source": "default"
        },
        {
            "Title": "Laxmi Organic Industries Reports Q4 Financial Results",
            "Summary": "Laxmi Organic Industries has reported its Q4 financial results. The company's EBITDA for Q4 was 590 million rupees, down from 900 million rupees year-over-year. The EBITDA margin decreased to 8.31% from 11.36% in the same period last year. Q4 revenue was 7.1 billion rupees, compared to 7.92 billion rupees in the previous year. The consolidated net profit for Q4 was 217.6 million rupees, down from 443.1 million rupees year-over-year and 293 million rupees quarter-on-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747760078000,
            "Source": "result"
        },
        {
            "Title": "Laxmi Organics Industries Obtains New Factory License for Dahej Site",
            "Summary": "Laxmi Organics Industries has received a fresh factory license for its synthetic organic chemicals manufacturing facility located in Dahej, Gujarat. This license allows the company to operate and produce chemicals at this site.",
            "Sentiment": "positive",
            "PublishDate": 1746594406000,
            "Source": "default"
        },
        {
            "Title": "Laxmi Organic Plans Market Expansion and New Product Launch",
            "Summary": "Laxmi Organic Industries has announced plans to expand its market presence through increased wallet share in existing and new sectors. The company also intends to launch new products as part of its growth strategy, as revealed in an investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1737603633000,
            "Source": "corporate_action"
        },
        {
            "Title": "Laxmi Organic Announces Ambitious Growth Targets for FY28",
            "Summary": "Laxmi Organic Industries has unveiled its strategic growth plans in an investor presentation. The company aims to achieve a Return on Capital Employed (ROCE) of 20%, double its revenue, and increase its EBITDA by 2.7 times by the fiscal year 2028, on a consolidated basis.",
            "Sentiment": "positive",
            "PublishDate": 1737603576000,
            "Source": "corporate_action"
        },
        {
            "Title": "Laxmi Organic Industries Reports Q3 Financial Results",
            "Summary": "Laxmi Organic Industries has announced its Q3 consolidated financial results. The company reported a net profit of 293 million rupees, showing an increase from 272 million rupees year-over-year and 281 million rupees quarter-over-quarter. Revenue for Q3 stood at 7.86 billion rupees, up from 7 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1737591150000,
            "Source": "earnings"
        },
        {
            "Title": "Laxmi Organic Industries Reports Q3 Financial Results",
            "Summary": "Laxmi Organic Industries has announced its Q3 consolidated financial results. The company reported a net profit of 293 million rupees, showing an increase from 272 million rupees year-over-year and 281 million rupees quarter-over-quarter. The Q3 revenue stood at 7.86 billion rupees, up from 7 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1737559519000,
            "Source": "earnings"
        },
        {
            "Title": "Laxmi Organic Industries Approves Capital Expenditure for Two Plants",
            "Summary": "Laxmi Organic Industries has approved a capital expenditure of 1.82 billion rupees for two plants. This investment indicates the company's plans for expansion or upgrading of its production facilities.",
            "Sentiment": "positive",
            "PublishDate": 1730216356000,
            "Source": "corporate_action"
        },
        {
            "Title": "Laxmi Organic Industries Reports Strong Q2 EBITDA Growth",
            "Summary": "Laxmi Organic Industries has announced its Q2 financial results, showing significant improvement in EBITDA and EBITDA margin compared to the same period last year. The company's EBITDA increased to 746.9 million rupees from 398.3 million rupees year-over-year. Additionally, the EBITDA margin expanded to 9.68% from 5.97% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730216349000,
            "Source": "result"
        },
        {
            "Title": "Laxmi Organic Industries Reports Q2 Revenue Growth",
            "Summary": "Laxmi Organic Industries has announced its Q2 revenue, which stands at 7.71 billion rupees, compared to 6.52 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730216340000,
            "Source": "result"
        },
        {
            "Title": "Laxmi Organic Industries Reports Significant Profit Growth in Q2",
            "Summary": "Laxmi Organic Industries has reported a substantial increase in consolidated net profit for the second quarter. The company's net profit rose to 280.9 million rupees, up from 107.1 million rupees in the same quarter last year, representing a year-over-year growth. Additionally, the profit showed a quarter-over-quarter increase from 343.5 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730216329000,
            "Source": "result"
        },
        {
            "Title": "Laxmi Organic Industries Announces Scheduled Annual Turnaround at Speciality Chemicals Site",
            "Summary": "<p><span class='neutral'>Laxmi Organic Industries</span> has announced that its <span class='positive'>Speciality Chemicals</span> producing <b>Site 2</b>, located in <span class='neutral'>Mahad Industrial Area, MIDC, Raigad, Maharashtra</span>, will undergo a <span class='neutral'>scheduled annual turnaround</span> for <span class='neutral'>boiler inspection</span>. The <span class='positive'>maintenance</span> is set to continue until <b>October 16, 2024</b>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728395547000,
            "Source": "corporate_action"
        }
    ]
}