{
    "Symbol": "LYKALABS",
    "ISIN": "INE933A01014",
    "News": [
        {
            "Title": "Lyka Labs Q3FY26 Results: Revenue Drops 6.6% YoY",
            "Summary": "Lyka Labs reported Q3FY26 revenue of ₹3,072.79 lakhs, down 6.6% YoY. Standalone net profit fell to ₹27.99 lakhs from ₹269.85 lakhs in Q3FY25. Nine-month performance shows revenue decline of 10.9% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1769689634708,
            "Source": "co_actions_results"
        },
        {
            "Title": "NCLT Grants Final Opportunity to Income Tax Counsel in Lyka Labs Merger Case",
            "Summary": "The National Company Law Tribunal (NCLT) has given a final chance for Income Tax counsel to respond to Lyka Labs' merger application, with no opposition received from the Income Tax Department so far. The NCLT has reserved its order on the merger application while awaiting the final response from tax authorities.",
            "Sentiment": "positive",
            "PublishDate": 1764932645561,
            "Source": "corporate_action"
        },
        {
            "Title": "Lyka Labs Reports Net Loss of Rs 72.68 Lakhs in Q2 FY26, Defers Registered Office Relocation Decision",
            "Summary": "Lyka Labs Limited reported a net loss of Rs 72.68 lakhs for the quarter ended September 30, 2025, compared to a profit of Rs 7.20 lakhs in the same quarter last year. The pharmaceutical company's revenue declined to Rs 2,862.64 lakhs from Rs 3,013.83 lakhs year-on-year. The Board approved the quarterly financial results and decided to defer the decision on shifting the registered office. The company recognized an Expected Credit Loss provision of Rs 484.03 lakhs for international trade receivables during the quarter. Additionally, 1,08,570 preference shares worth Rs 108.57 lakhs were redeemed. The earnings per share stood at negative Rs 2.02 compared to positive Rs 0.69 in the previous year quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762992417535,
            "Source": "earnings"
        },
        {
            "Title": "Lyka Labs Receives NCLT Extension for Income Tax Department Response in Amalgamation Case",
            "Summary": "The National Company Law Tribunal, Ahmedabad Bench granted a final opportunity to the Income Tax Department to file their response within one week regarding the amalgamation scheme between Lyka Exports Limited and Lyka Labs Limited. The Income Tax Department had failed to comply with the previous order dated October 9, 2025, and did not submit their required reply. The NCLT has scheduled the matter for further consideration on December 4, 2025. Lyka Labs received a copy of the tribunal order on November 7, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762598745978,
            "Source": "corporate_action"
        },
        {
            "Title": "Kunal Gandhi Acquires Additional 13.5 Lakh Shares in Lyka Labs Through Transmission",
            "Summary": "Kunal Gandhi, a promoter of Lyka Labs Limited, acquired 13,50,000 equity shares (4.08% stake) through transmission from Narendra I. Gandhi (HUF). The transaction was completed on June 27, 2023. Following this acquisition, Gandhi's individual holding increased from 10,69,152 shares (3.23%) to 24,19,152 shares (7.31%). The total promoter group holding, including persons acting in concert such as Nehal N. Gandhi, Enai Trading and Investment Private Limited, and Lyka Generics Limited, remained unchanged at 56,97,161 shares (17.22%). The company's total equity share capital stands at 3,30,90,000 shares. Lyka Labs is listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1761796219694,
            "Source": "corporate_action"
        },
        {
            "Title": "Lyka Labs Gets 15-Day Extension for Income Tax Department Reply in Amalgamation Case",
            "Summary": "Lyka Labs Limited received an update on its Scheme of Amalgamation proceedings at the National Company Law Tribunal (NCLT), Ahmedabad Bench. The NCLT granted the Income Tax Department an extension of 15 days to submit their reply, extending from the previously allocated 7 days. The extension was requested by the lead counsel for the Income Tax Department due to a recent change in legal representation, with the new counsel replacing Ms. Maithili Mehta and requiring additional time to receive instructions from the department. The next hearing is scheduled for November 6, 2025. The company received a copy of the NCLT order on October 10, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760177807473,
            "Source": "corporate_action"
        },
        {
            "Title": "Lyka Labs Schedules Board Meeting for September 29, 2025 to Consider Preference Share Redemption and Company Secretary Appointment",
            "Summary": "Lyka Labs Limited has scheduled a Board of Directors meeting for September 29, 2025. The meeting will consider the redemption of 1,08,570 unlisted 10% Cumulative Redeemable Preference Shares valued at Rs.100 each, totaling approximately Rs.1.09 crore. The board will also discuss the appointment of a Company Secretary and Compliance Officer, along with other business matters. The company has notified both BSE and NSE about the meeting agenda.",
            "Sentiment": "neutral",
            "PublishDate": 1758725682292,
            "Source": "corporate_action"
        },
        {
            "Title": "Lyka Labs Amalgamation with Lyka Exports Faces Delay as NCLT Seeks Income Tax Department Report",
            "Summary": "Lyka Labs Limited provided an update on its amalgamation scheme with Lyka Exports Limited. The National Company Law Tribunal, Ahmedabad Bench has directed the Income Tax Department to submit its report within 7 days regarding the joint petition filed by both companies. The NCLT had previously reserved the matter for formal pronouncement stating 'no objection' in due course. The case is now scheduled for further consideration on October 9, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758196478122,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Reserves Order on Lyka Labs-Lyka Exports Merger with No Objection",
            "Summary": "The National Company Law Tribunal (NCLT) Ahmedabad Bench has reserved its order for formal pronouncement on the merger between Lyka Labs Limited and Lyka Exports Limited, stating 'no objection' to the scheme of amalgamation. The hearing took place on August 7, 2025, with Lyka Labs serving as the transferee company and Lyka Exports as the transferor company. The company will make necessary disclosures once the NCLT order is formally pronounced.",
            "Sentiment": "positive",
            "PublishDate": 1754656716810,
            "Source": "corporate_action"
        },
        {
            "Title": "Lyka Labs Reports Q1 Results, Company Secretary Resigns, Appoints New Internal Auditor",
            "Summary": "Lyka Labs Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company's Board of Directors accepted the resignation of Company Secretary Mr. Shekhar R Singh, effective from close of business hours on August 1, 2025. Singh cited pursuing alternative career opportunities outside the organization as the reason for his departure. He confirmed he would continue discharging responsibilities including those connected with the upcoming 46th Annual General Meeting and ensure a smooth handover. The Board also approved the appointment of Sudit K Parekh & Co. LLP, Chartered Accountants, as Internal Auditor for financial year 2025-26. The firm is based in Mumbai and offers various services with qualified partners and an experienced team.",
            "Sentiment": "neutral",
            "PublishDate": 1754040340096,
            "Source": "corporate_action"
        },
        {
            "Title": "Lyka Labs Approves Quarterly Results and Accepts Company Secretary Resignation",
            "Summary": "Lyka Labs' Board of Directors approved unaudited financial results for the quarter ended June 30, 2025, covering both standalone and consolidated statements. The Board accepted the resignation of Shekhar R Singh as Company Secretary and Compliance Officer, effective August 1, 2025. Singh cited pursuing alternative career opportunities as the reason for his departure and confirmed he would handle responsibilities for the upcoming 46th Annual General Meeting while ensuring a smooth handover. Additionally, the Board appointed Sudit K Parekh & Co. LLP as Internal Auditor for financial year 2025-26. The firm is a Mumbai-based chartered accountancy practice with experience in internal audit assignments.",
            "Sentiment": "neutral",
            "PublishDate": 1754033479527,
            "Source": "corporate_governance"
        },
        {
            "Title": "LYKA LABS Reports Improved Q4 EBITDA and Margin",
            "Summary": "LYKA LABS has reported its Q4 financial results. The company's EBITDA increased to 41 million rupees, up from 20 million rupees in the same quarter of the previous year. The EBITDA margin also improved, rising to 12.23% from 7.31% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748265933000,
            "Source": "result"
        },
        {
            "Title": "Lyka Labs Reports Profit in Q4, Revenue Increases",
            "Summary": "Lyka Labs has reported a consolidated net profit of 18 million rupees in the fourth quarter, compared to a loss of 21 million rupees in the same quarter last year. The company's profit also improved from the previous quarter, where it had reported a profit of 27 million rupees. Revenue for the fourth quarter stood at 334 million rupees, up from 278 million rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748265823000,
            "Source": "result"
        },
        {
            "Title": "Lyka Labs Granted Patent for Pregabalin Gel 8% in India",
            "Summary": "Lyka Labs has been awarded a patent by the Patent Office India for its proprietary product, Pregabalin Gel 8%. This patent recognition suggests potential exclusivity for the company's product in the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1744091618000,
            "Source": "corporate_action"
        },
        {
            "Title": "LYKA LABS Reports Decline in Q3 EBITDA and Margin",
            "Summary": "LYKA LABS has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 52 million rupees from 69 million rupees in the same quarter last year. The EBITDA margin also declined to 15.33% from 21.10% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738662035000,
            "Source": "earnings"
        },
        {
            "Title": "LYKA LABS Reports Increased Q3 Profit and Revenue",
            "Summary": "LYKA LABS has announced its Q3 financial results, showing improvements in both profit and revenue. The company's consolidated net profit rose to 27 million rupees, up from 18 million rupees in the same quarter last year. Revenue also increased to 338 million rupees from 326 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738661991000,
            "Source": "earnings"
        },
        {
            "Title": "Lyka Labs to Consider Q3 Results on February 4",
            "Summary": "Lyka Labs has announced that it will be considering its third quarter (Q3) financial results on February 4. This indicates that the company is preparing to review and potentially approve its financial performance for the latest quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1735547305000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Lyka Labs Reports Significant Revenue Growth in Q2",
            "Summary": "Lyka Labs has announced its Q2 revenue, which stands at 411 million rupees. This represents a substantial increase from the 280 million rupees reported in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731395961000,
            "Source": "result"
        },
        {
            "Title": "Lyka Labs Reports Profit in Q2 FY2024",
            "Summary": "Lyka Labs has announced a consolidated net profit of 21 million rupees for the second quarter, marking a significant turnaround from a loss of 4.86 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731395908000,
            "Source": "result"
        },
        {
            "Title": "Lyka Labs: Shares Rally 7% on Diabetic Pain Drug Approval",
            "Summary": "<p>Lyka Labs received <span class='positive'>CDSCO approval</span> for <b>Pregabalin Gel 8% w/w</b> to treat <span class='neutral'>Diabetic Neuropathic Pain</span>. The topical gel showed <span class='positive'>equal effectiveness</span> to oral capsules with <span class='positive'>fewer side effects</span> in a 210-patient study. <br/> Shares <span class='positive'>rose 6.78%</span> to Rs 159.70 intraday.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728966792000,
            "Source": "normal_news"
        },
        {
            "Title": "Lyka Labs Receives Approval for Pregabalin Gel Patent",
            "Summary": "<p><span class='positive'>Lyka Labs</span> has received <span class='positive'>approval</span> from the <b>Central Drugs Standard Control Organisation (CDSCO)</b> for its <span class='positive'>patent-pending</span> <b>Pregabalin Gel 8% w/w</b>, designed to treat <span class='negative'>diabetic neuropathic pain</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728908421000,
            "Source": "corporate_action"
        }
    ]
}