{
    "Symbol": "LYPSAGEMS",
    "ISIN": "INE142K01011",
    "News": [
        {
            "Title": "Lypsa Gems Board Approves Name Change to Aurus Gem Corp",
            "Summary": "Lypsa Gems & Jewellery board approved company name change to Aurus Gem Corporation Limited and land sale under Companies Act. Both decisions require shareholder approval through postal ballot.",
            "Sentiment": "neutral",
            "PublishDate": 1767175253416,
            "Source": "co_actions_results"
        },
        {
            "Title": "Lypsa Gems Jewellery Reports Strong Q2 Performance with 716.76 Lakh Revenue",
            "Summary": "Lypsa Gems Jewellery Limited posted revenue of 716.76 lakh for Q2 ended September 30, 2025, with profit after tax of 9.84 lakh and basic earnings per share of 0.03. The company's board approved the unaudited financial results on November 14, 2025, showing improved performance compared to the previous quarter's revenue of 275.93 lakh.",
            "Sentiment": "positive",
            "PublishDate": 1763141153355,
            "Source": "earnings"
        },
        {
            "Title": "Lypsa Gems & Jewellery Reports Profit Recovery in Q1 2025 After Previous Losses",
            "Summary": "Lypsa Gems & Jewellery Limited's Board of Directors approved unaudited financial results for the first quarter ended June 30, 2025. The company reported a profit after tax of ₹2.39 lakhs compared to a loss of ₹1,527.81 lakhs in the previous quarter and a profit of ₹7.42 lakhs in the same quarter last year. Revenue from operations declined to ₹115.04 lakhs from ₹657.74 lakhs in the previous quarter and ₹141.77 lakhs in the corresponding quarter of the previous year. Basic and diluted earnings per share stood at ₹0.01. The company operates in a single business segment and maintains a paid-up equity share capital of ₹2,948.40 lakhs with shares having a face value of ₹10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1755092371763,
            "Source": "earnings"
        }
    ]
}