{
    "Symbol": "M&M",
    "ISIN": "INE101A01026",
    "News": [
        {
            "Title": "Mahindra Launches UDO E-Auto at ₹3.84 Lakh",
            "Summary": "Mahindra Last Mile Mobility unveils the UDO e-auto with airplane-inspired design, 200 km range, and advanced features. Priced at ₹3,84,299 with limited-time offer at ₹3,58,999.",
            "Sentiment": "positive",
            "PublishDate": 1770907032513,
            "Source": "stocks"
        },
        {
            "Title": "Mahindra Q3FY26 Results: Revenue Jumps 24% to ₹51,580 Cr",
            "Summary": "Mahindra & Mahindra reported strong Q3FY26 results with revenue rising 24% YoY to ₹51,579.95 crores. Net profit surged 47% to ₹4,674.64 crores, while automotive segment led growth.",
            "Sentiment": "positive",
            "PublishDate": 1770792614655,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahindra & Mahindra Subsidiary Forms JV with Mitsui",
            "Summary": "Mahindra Lifespace Developers Limited executes joint venture agreements with Mitsui Fudosan (Asia) Pte. Limited, transferring 49% stake in subsidiary MBLDL for residential project development in Bengaluru.",
            "Sentiment": "positive",
            "PublishDate": 1770720130315,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahindra Plans ₹15,000 Cr Maharashtra Factory",
            "Summary": "Mahindra & Mahindra announces massive manufacturing facility in Maharashtra with ₹15,000 crore investment, spanning 1500 acres for vehicles and tractors production starting 2028.",
            "Sentiment": "positive",
            "PublishDate": 1770365536097,
            "Source": "stocks"
        },
        {
            "Title": "Mahindra Secures Record 35,000 LCV Export Order",
            "Summary": "Mahindra & Mahindra announces its largest ever export order of 35,000 Scorpio Pik Up units to Indonesian state enterprise Agrinas Pangan Nusantara for 2026 delivery, surpassing total FY25 exports.",
            "Sentiment": "positive",
            "PublishDate": 1770181718096,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahindra & Mahindra Block Trade Worth Rs. 22.57 Crores",
            "Summary": "Mahindra & Mahindra executed a significant NSE block trade involving 62,642 shares at Rs. 3602.30 per share, totaling Rs. 22.57 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1770093000217,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahindra Lifespace Sets INR 5,000-7,000 Cr Launch Target",
            "Summary": "Mahindra Lifespace targets INR 5,000-7,000 crores in FY27 launches through major projects in Bhandup and Mahalaxmi, with long-term goal of INR 10,000 crores across residential and industrial segments.",
            "Sentiment": "positive",
            "PublishDate": 1770089186847,
            "Source": "stocks"
        },
        {
            "Title": "Mahindra Lifespace Sets FY27 Pre-Sales Target",
            "Summary": "Mahindra Lifespace maintains its FY27 pre-sales target of INR 4,500-5,000 crores but provides no guidance for FY28, indicating strategic focus on near-term execution.",
            "Sentiment": "neutral",
            "PublishDate": 1770089157407,
            "Source": "stocks"
        },
        {
            "Title": "Mahindra Lifespace Q3 Profit Surges to ₹1.1B",
            "Summary": "Mahindra Lifespace Developers reports consolidated net profit of ₹1.1 billion in Q3, marking a significant turnaround from previous year's loss of ₹224.7 million.",
            "Sentiment": "positive",
            "PublishDate": 1770023581607,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahindra & Mahindra Expects Budget Boost for Rural Sector",
            "Summary": "Mahindra & Mahindra anticipates that government aid and increased funding for rural development in the upcoming budget will positively impact the company in coming months.",
            "Sentiment": "positive",
            "PublishDate": 1769923119104,
            "Source": "union_budget"
        },
        {
            "Title": "M&M Tractor Sales Jump 39.6% to 38,484 Units in January",
            "Summary": "Mahindra & Mahindra reported strong tractor sales of 38,484 units in January, significantly exceeding market estimates of 33,600 units and marking substantial growth from previous year.",
            "Sentiment": "positive",
            "PublishDate": 1769923017216,
            "Source": "stocks"
        },
        {
            "Title": "M&M Reports 21.99% YoY Growth in Auto Sales",
            "Summary": "Mahindra & Mahindra achieves significant year-over-year growth in automotive sales with 21.99% increase, demonstrating strong market performance and exceeding expectations.",
            "Sentiment": "positive",
            "PublishDate": 1769922985223,
            "Source": "co_actions_results"
        },
        {
            "Title": "SML Mahindra Reports 30% Sales Growth in January",
            "Summary": "SML Mahindra achieved total sales of 1,337 units in January, marking a significant 30% year-on-year increase from 1,025 units in the corresponding period last year.",
            "Sentiment": "positive",
            "PublishDate": 1769917644867,
            "Source": "stocks"
        },
        {
            "Title": "Mahindra & Mahindra Block Trade Worth Rs. 50.01 Crores",
            "Summary": "Mahindra & Mahindra executed a significant NSE block trade involving 149,741 shares at Rs. 3340.10 per share, totaling Rs. 50.01 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1769745256362,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahindra Logistics Reports Q3 Profit Turnaround",
            "Summary": "Mahindra Logistics achieved consolidated net profit of 33 million rupees in Q3, marking significant turnaround from 90 million rupees loss in same quarter previous year.",
            "Sentiment": "positive",
            "PublishDate": 1769515427317,
            "Source": "co_actions_results"
        },
        {
            "Title": "M&M shares drop 5% on India-EU trade deal concerns",
            "Summary": "Mahindra & Mahindra shares fell up to 5% on Tuesday following concerns over the India-EU Free Trade Agreement's impact on the automotive sector, with Goldman Sachs projecting a 1.9% profitability impact.",
            "Sentiment": "negative",
            "PublishDate": 1769487264292,
            "Source": "stocks"
        },
        {
            "Title": "Market returns may be 2-3% above nominal GDP growth",
            "Summary": "Mahindra Manulife's Anthony Heredia expects market returns 2-3% above nominal GDP growth in 2026, favors large-caps amid valuation concerns, recommends multi-asset allocation approach.",
            "Sentiment": "neutral",
            "PublishDate": 1769385876555,
            "Source": "mutualfunds"
        },
        {
            "Title": "Kotak AMC advises avoiding small-caps amid high valuations",
            "Summary": "Harsha Upadhyaya of Kotak AMC recommends large and mid-cap stocks over small-caps, citing stretched valuations 40-45% above long-term averages and weak earnings performance in the small-cap segment.",
            "Sentiment": "neutral",
            "PublishDate": 1769152569190,
            "Source": "mutualfunds"
        },
        {
            "Title": "FIIs to stay cautious until earnings match valuations",
            "Summary": "Kotak Life CIO Radhavi Deshpande expects foreign investors to remain subdued until domestic earnings growth catches up with elevated market valuations, while budget capex unlikely to see major jump.",
            "Sentiment": "neutral",
            "PublishDate": 1769132328214,
            "Source": "stocks"
        },
        {
            "Title": "Tech Mahindra Sees ₹54.05 Cr NSE Block Trade",
            "Summary": "Tech Mahindra witnessed a significant block trade on NSE worth ₹54.05 crores involving 316,080 shares at ₹1,710.00 per share, indicating substantial institutional activity in the stock.",
            "Sentiment": "neutral",
            "PublishDate": 1769058169748,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahindra Transfers 2,796 Shares via ESOP Trust",
            "Summary": "Mahindra & Mahindra's ESOP Trust transferred 2,796 equity shares to 10 employees on January 21, 2026, following stock option exercises under the company's employee stock option scheme.",
            "Sentiment": "neutral",
            "PublishDate": 1768999944793,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Securities Maintains Hold on Tech Mahindra at ₹1,600",
            "Summary": "ICICI Securities maintains HOLD rating on Tech Mahindra with target price of ₹1,600, citing strong Q3FY26 performance and improved growth trajectory under new CEO Mohit Joshi's leadership.",
            "Sentiment": "neutral",
            "PublishDate": 1768989603866,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tech Mahindra Gets Buy Rating with ₹2,350 Target",
            "Summary": "Motilal Oswal maintains BUY rating on Tech Mahindra with target price of ₹2,350, citing strong Q3FY26 performance with 1.7% QoQ revenue growth and improved EBIT margins at 13.1%.",
            "Sentiment": "positive",
            "PublishDate": 1768982444429,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tech Mahindra Hits Fresh 52-Week High After Breakout",
            "Summary": "Tech Mahindra breaks out from consolidation phase to reach new 52-week high. Stock gains 6% weekly and 16% monthly. Experts suggest ₹1,850 target for short-term traders in 1-2 months.",
            "Sentiment": "positive",
            "PublishDate": 1768952600673,
            "Source": "stocks"
        },
        {
            "Title": "Kotak Group Invests in 6 Stocks Worth ₹2,303 Crores",
            "Summary": "Kotak Mahindra Group made fresh investments across Park Medi World, Emmvee Photovoltaic, Bank of Maharashtra, Whirlpool India, Sagility, and Midwest during Q3 FY26, acquiring stakes ranging from 1.1% to 4.7%.",
            "Sentiment": "positive",
            "PublishDate": 1768927080175,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahindra Plans E3W Business IPO in 2027",
            "Summary": "Mahindra & Mahindra CEO Anish Shah announces plans to list electric three-wheeler business in 2027 at Davos, citing readiness for independent scaling and value unlocking.",
            "Sentiment": "positive",
            "PublishDate": 1768897081615,
            "Source": "stocks"
        },
        {
            "Title": "Tech Mahindra Gets Accumulate Rating, Target ₹1,860",
            "Summary": "Prabhudas Lilladher upgrades Tech Mahindra to Accumulate from Hold with target price of ₹1,860, citing strong revenue growth of 1.7% QoQ and encouraging deal momentum with TCV of $2.7 billion.",
            "Sentiment": "positive",
            "PublishDate": 1768893799923,
            "Source": "stocks"
        },
        {
            "Title": "Tech Mahindra Q3 Results: Revenue Up 8.3% YoY",
            "Summary": "Tech Mahindra reports strong Q3 performance with revenue of ₹1,43,932 million, up 8.3% YoY. EBIT margin improved to 13.1% despite one-time provision impacting PAT. Deven Choksey sets target at ₹1,805.",
            "Sentiment": "positive",
            "PublishDate": 1768889430131,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahindra EPC Irrigation Reports 1,411% QoQ Profit Growth",
            "Summary": "Mahindra EPC Irrigation Ltd delivered exceptional Q3FY26 results with 1,411% quarter-on-quarter net profit growth and 15% year-on-year revenue increase. The company's 9MFY26 profits have already surpassed FY25 levels by 10%.",
            "Sentiment": "positive",
            "PublishDate": 1768840386473,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Sets ₹1,964 Target for Tech Mahindra",
            "Summary": "Anand Rathi maintains BUY rating on Tech Mahindra with target price of ₹1,964, citing strong Q3FY26 performance with 1.7% quarterly revenue growth and margin expansion to 13.1%.",
            "Sentiment": "positive",
            "PublishDate": 1768838294737,
            "Source": "co_actions_results"
        },
        {
            "Title": "M&M Schedules Q3 FY26 Analyst Meet for Feb 11, 2026",
            "Summary": "Mahindra & Mahindra announces hybrid analyst meeting for Q3 FY26 results on February 11, 2026, from 3:30-4:30 PM IST in Mumbai with mandatory pre-registration required.",
            "Sentiment": "neutral",
            "PublishDate": 1768824894652,
            "Source": "stocks"
        },
        {
            "Title": "Tech Mahindra to Launch AI Pricing Metric Next Quarter",
            "Summary": "Tech Mahindra CEO Mohit Joshi announces plans to introduce transparent AI-specific metrics within next quarter to better reflect AI pricing in deals, while reporting strong Q3 performance with 1.7% sequential growth.",
            "Sentiment": "positive",
            "PublishDate": 1768816947284,
            "Source": "stocks"
        },
        {
            "Title": "Tech Mahindra Block Trade Worth ₹17.13 Crores",
            "Summary": "Tech Mahindra witnessed a significant NSE block trade involving 99,109 shares at ₹1,728.30 per share, totaling ₹17.13 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1768798086504,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tech Mahindra Signs New European Telecom Deal",
            "Summary": "Tech Mahindra has secured a new telecom agreement in Europe with delivery scheduled for the first half of next financial year. The contract is expected to contribute less than 1.6% to revenue.",
            "Sentiment": "positive",
            "PublishDate": 1768796866033,
            "Source": "stocks"
        },
        {
            "Title": "Tech Mahindra Sets Growth Targets for FY27",
            "Summary": "Tech Mahindra targets faster growth than peers by FY27 with 15% EBIT margin. Communications sector aims for 2027 growth while Europe transitions from stability to growth with major deal.",
            "Sentiment": "positive",
            "PublishDate": 1768796837759,
            "Source": "stocks"
        },
        {
            "Title": "Tech Mahindra shares rally 4% on Q3 results, JPMorgan upgrade",
            "Summary": "Tech Mahindra shares gained 4% after Q3 results showed strong margin expansion to 13.1% and record deal wins. JPMorgan upgraded to 'Overweight' with ₹2,100 target price.",
            "Sentiment": "positive",
            "PublishDate": 1768795494086,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tech Mahindra Plans Organic Growth Until FY27",
            "Summary": "Tech Mahindra executive confirms company will focus on organic growth strategy through FY27 with no major acquisitions planned, building on record deal performance and strong pipeline.",
            "Sentiment": "neutral",
            "PublishDate": 1768566057622,
            "Source": "stocks"
        },
        {
            "Title": "Tech Mahindra Q3: One-time charge impacts results",
            "Summary": "Tech Mahindra reports Q3 results with ₹2.72 billion one-time charge due to new Indian labor laws, while maintaining steady progress toward FY27 goals with strong deal wins and margin expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1768560571995,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tech Mahindra Q3 Preview: Profit Growth Expected",
            "Summary": "Tech Mahindra is expected to report 15.9% QoQ profit growth to ₹1,385 crore for Q3FY26, with EBIT margin improving to 12.7% from 12.1% in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1768492475881,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahindra SUVs Win Nomura Top Pick, Bajaj EV Neutral",
            "Summary": "Nomura backs Mahindra as top auto pick after XUV 7XO and XEV 9S clock 93,689 bookings on day one, while maintaining neutral stance on Bajaj Auto despite new affordable Chetak C25 launch.",
            "Sentiment": "positive",
            "PublishDate": 1768478750529,
            "Source": "stocks"
        },
        {
            "Title": "Tech Mahindra Q3 Preview: Profit Growth Expected",
            "Summary": "Tech Mahindra projected to report 40% YoY profit growth in Q3 despite labour code charges, with 7% revenue rise and margin expansion of 40-60 basis points driven by cost optimization.",
            "Sentiment": "positive",
            "PublishDate": 1768453822318,
            "Source": "co_actions_results"
        },
        {
            "Title": "M&M Employees Exercise 50,199 Stock Options",
            "Summary": "Mahindra & Mahindra's Employee Stock Option Trust transferred 50,199 equity shares to 50 employees on January 14, 2026, with Ruzbeh Irani receiving the largest allocation of 19,558 options.",
            "Sentiment": "neutral",
            "PublishDate": 1768403223313,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahindra XEV 9S & XUV 7XO Record 93,689 Bookings",
            "Summary": "Mahindra announces milestone achievement of 93,689 consolidated bookings for XEV 9S and XUV 7XO SUVs, translating to booking value exceeding ₹20,500 crore as of January 14, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768386399086,
            "Source": "stocks"
        },
        {
            "Title": "Mahindra Records 93,689 Bookings for XEV 9e & XUV 7XO",
            "Summary": "Mahindra & Mahindra achieves strong market response with 93,689 bookings for its XEV 9e and XUV 7XO models, demonstrating robust consumer demand for the company's latest vehicle offerings.",
            "Sentiment": "positive",
            "PublishDate": 1768385895828,
            "Source": "stocks"
        },
        {
            "Title": "Mahindra Lifespace Seeks KRERA Approval for Promoter Change",
            "Summary": "Mahindra Lifespace Developers announces plans to apply for KRERA approval to change project promoter, marking a significant corporate restructuring move in the real estate sector.",
            "Sentiment": "neutral",
            "PublishDate": 1768221486215,
            "Source": "stocks"
        },
        {
            "Title": "M&M Forms Joint Control Over Tech Mahindra Foundation",
            "Summary": "Mahindra & Mahindra and Tech Mahindra Limited executed agreement on January 9, 2026 to establish joint control over Tech Mahindra Foundation through equal board representation for aligned CSR strategy.",
            "Sentiment": "positive",
            "PublishDate": 1767961269341,
            "Source": "co_actions_results"
        },
        {
            "Title": "M&M December sales surge 27% YoY to 85,501 units",
            "Summary": "Mahindra & Mahindra reports strong December performance with 27% growth in total sales and 25.4% increase in production, while exports decline 9.3% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1767960622507,
            "Source": "stocks"
        },
        {
            "Title": "Mahindra & Mahindra Gets Strong ESG Rating of 69",
            "Summary": "Mahindra & Mahindra Limited receives highest-in-industry ESG rating of 69 (Strong) from SEBI-registered ESG Risk Assessments & Insights Limited in independent assessment.",
            "Sentiment": "positive",
            "PublishDate": 1767960283030,
            "Source": "stocks"
        },
        {
            "Title": "Mahindra Q3 Production, Sales Surge Over 20% on GST Benefits",
            "Summary": "Mahindra & Mahindra reported 25% production growth to 68,992 units and 27% sales jump to 85,501 units in Q3, driven by sustained demand from GST 2.0 rate reductions across SUV portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1767959803512,
            "Source": "co_actions_results"
        },
        {
            "Title": "Motilal Oswal Sets ₹4,521 Target for Mahindra & Mahindra",
            "Summary": "Brokerage firm maintains BUY rating on Mahindra & Mahindra with strong growth projections driven by new XUV7XO and XEV9S launches, expecting 14% UV volume CAGR over FY25-28E.",
            "Sentiment": "positive",
            "PublishDate": 1767942535744,
            "Source": "stocks"
        }
    ]
}