{
    "Symbol": "M&MFIN",
    "ISIN": "INE774D01024",
    "News": [
        {
            "Title": "M&M Financial Services Postal Ballot Results",
            "Summary": "Mahindra & Mahindra Financial Services Limited successfully passes all four resolutions through postal ballot including director appointments and ESOP plan implementation with strong shareholder support.",
            "Sentiment": "positive",
            "PublishDate": 1770633914526,
            "Source": "co_actions_results"
        },
        {
            "Title": "Olympic Management Reports Q3 FY26 Results",
            "Summary": "Olympic Management & Financial Services Limited announced Q3 FY26 results with revenue of 4.69 lacs and profit of 1.48 lacs for quarter ended 31st December, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770371407055,
            "Source": "co_actions_results"
        },
        {
            "Title": "India to Draft Banking Reforms Committee Terms",
            "Summary": "India's Financial Services Secretary will soon prepare terms of reference for a new banking reforms committee to address sector challenges and improvements.",
            "Sentiment": "neutral",
            "PublishDate": 1770098421956,
            "Source": "stocks"
        },
        {
            "Title": "M&M Financial Services Plans Portfolio Rebalancing",
            "Summary": "M&M Financial Services aims to reduce wheels business share from 88% to 70% by FY30, while expanding SME and mortgage segments from 12% to 30% to enhance growth and profit margins.",
            "Sentiment": "positive",
            "PublishDate": 1769660684232,
            "Source": "stocks"
        },
        {
            "Title": "M&M Financial Services Sets ROA Targets & Cost Outlook",
            "Summary": "M&M Financial Services aims for 2% Return on Assets initially, targeting 15% ROA overall. Management projects credit costs to remain between 1.5% and 1.7%, expressing confidence in maintaining this range.",
            "Sentiment": "positive",
            "PublishDate": 1769660628562,
            "Source": "stocks"
        },
        {
            "Title": "M&M Financial Services Appoints New Chief Business Officer",
            "Summary": "Mahindra & Mahindra Financial Services Limited has appointed Jaspreet Singh Chadha as Chief Business Officer - Mortgages effective February 1, 2026, bringing 24 years of industry experience.",
            "Sentiment": "positive",
            "PublishDate": 1769604576438,
            "Source": "stocks"
        },
        {
            "Title": "M&M Financial Services Board Approves Merger Evaluation",
            "Summary": "Mahindra & Mahindra Financial Services Limited's board has given in-principle approval to evaluate a merger proposal with its 98.43% subsidiary MRHFL, subject to further committee evaluation.",
            "Sentiment": "neutral",
            "PublishDate": 1769603934670,
            "Source": "co_actions_results"
        },
        {
            "Title": "M&M Financial Services Reports Q3FY26 Results",
            "Summary": "Mahindra & Mahindra Financial Services Limited announced Q3FY26 quarterly results with profit after tax of ₹810.44 crore for the quarter ended December 31, 2025, impacted by exceptional items related to new Labour Codes.",
            "Sentiment": "neutral",
            "PublishDate": 1769599113287,
            "Source": "co_actions_results"
        },
        {
            "Title": "GIFT City proposes algo trading ring-fencing rules",
            "Summary": "IFSCA introduces comprehensive measures requiring exchange permissions, algorithm audits, and financial penalties to regulate algorithmic trading and ensure market integrity in GIFT City.",
            "Sentiment": "neutral",
            "PublishDate": 1768968445636,
            "Source": "stocks"
        },
        {
            "Title": "Central govt unveils composite salary account package",
            "Summary": "Department of Financial Services launches comprehensive banking and insurance package for central government employees across all cadres, featuring zero-balance accounts, insurance up to ₹2.00 crore, and digital benefits.",
            "Sentiment": "positive",
            "PublishDate": 1768403166694,
            "Source": "stocks"
        },
        {
            "Title": "Public insurers directed to boost profits, go digital",
            "Summary": "DFS reviews public sector insurance companies' performance for FY25, emphasizing profitability, digital transformation, and targeting younger customers with 100% digital onboarding goal.",
            "Sentiment": "positive",
            "PublishDate": 1768321808392,
            "Source": "stocks"
        },
        {
            "Title": "M&M Financial Gets AAA Rating Reaffirmation",
            "Summary": "Mahindra & Mahindra Financial Services receives AAA credit rating reaffirmation from CRISIL and India Ratings across multiple debt instruments totaling over ₹1.5 lakh crores.",
            "Sentiment": "positive",
            "PublishDate": 1768285085980,
            "Source": "stocks"
        },
        {
            "Title": "Europe Finance Boards See Worst Gender Pay Gap in 6 Years",
            "Summary": "Female non-executive directors at European financial firms earned just 62% of male counterparts in 2024, down from 65% in 2023, marking the worst gender pay disparity since 2019 despite increased board representation.",
            "Sentiment": "negative",
            "PublishDate": 1768178075594,
            "Source": "global"
        },
        {
            "Title": "M&M Financial Services Postal Ballot for Directors & ESOP",
            "Summary": "Mahindra & Mahindra Financial Services Limited has issued a postal ballot notice for the appointment of two new directors and implementation of a subsidiary ESOP plan, with e-voting concluding on February 7, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767796186737,
            "Source": "stocks"
        },
        {
            "Title": "DFS seeks explanation from Insurance Councils on high commissions",
            "Summary": "Department of Financial Services writes to Life and General Insurance Councils questioning why higher commissions haven't translated into premium growth or new policy issuance.",
            "Sentiment": "negative",
            "PublishDate": 1767603477608,
            "Source": "stocks"
        },
        {
            "Title": "Dept Sends Notifications To Insurance Councils",
            "Summary": "Department of Financial Services has sent notifications to Life and General Insurance Councils, though specific details of the communications remain unclear.",
            "Sentiment": "neutral",
            "PublishDate": 1767603435769,
            "Source": "stocks"
        },
        {
            "Title": "Avanse Financial Services Raises ₹1,200 Crore",
            "Summary": "NBFC firm Avanse Financial Services secured ₹1,200 crore through rights issue from existing shareholders Warburg Pincus, Kedaara Capital, and Alpha Investment Company LLC to scale education loan operations.",
            "Sentiment": "positive",
            "PublishDate": 1767596310049,
            "Source": "stocks"
        },
        {
            "Title": "M&M Financial Services ESG Score Rises to 79.6",
            "Summary": "Mahindra & Mahindra Financial Services Limited receives upgraded ESG rating of 79.6 from 76.2 by SES ESG Research Private Limited, reflecting improved environmental, social and governance performance.",
            "Sentiment": "positive",
            "PublishDate": 1767445330635,
            "Source": "stocks"
        },
        {
            "Title": "M&M Financial Services Assets Grow 12% to ₹1.29L Cr",
            "Summary": "M&M Financial Services reports business assets growth of 12% reaching ₹1,29,000 crore in December 2024, while maintaining collection efficiency at 95% with stable year-over-year performance.",
            "Sentiment": "positive",
            "PublishDate": 1767430479425,
            "Source": "stocks"
        },
        {
            "Title": "M&M Financial Q3 Update: 7% Disbursement Growth",
            "Summary": "M&M Financial Services reports ₹17,600 crore disbursements in Q3FY26 with 7% YoY growth. Business assets grew 12% to ₹1,29,000 crore while maintaining 95% collection efficiency and improving asset quality.",
            "Sentiment": "positive",
            "PublishDate": 1767419604619,
            "Source": "co_actions_results"
        },
        {
            "Title": "Govt panel reviews foreign bank proposals for India entry",
            "Summary": "Inter-departmental committee led by DFS Secretary evaluates foreign bank applications for branches and subsidiaries in India, involving multiple ministries for comprehensive assessment.",
            "Sentiment": "neutral",
            "PublishDate": 1767350974200,
            "Source": "stocks"
        },
        {
            "Title": "M&M Financial Services CBO Bijoy Thaplial Resigns",
            "Summary": "Mahindra & Mahindra Financial Services announces resignation of Chief Business Officer Bijoy Thaplial effective December 31, 2025, citing personal reasons for departure from senior management role.",
            "Sentiment": "neutral",
            "PublishDate": 1767190883043,
            "Source": "stocks"
        },
        {
            "Title": "M&M Financial Services Transfers 21,022 ESOP Shares",
            "Summary": "Mahindra & Mahindra Financial Services Limited transferred 21,022 equity shares from its ESOP Trust to 10 eligible employees on December 29, 2025, under stock option schemes.",
            "Sentiment": "neutral",
            "PublishDate": 1767012469750,
            "Source": "co_actions_results"
        },
        {
            "Title": "Finance Ministry Directs Banks for Prompt Vigilance Reporting",
            "Summary": "Finance Ministry orders public sector banks and financial institutions to immediately report vigilance matters concerning board-level directors, following instances of delayed adverse information disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1766916457039,
            "Source": "stocks"
        },
        {
            "Title": "Mahindra Financial Services Appoints Parag Rao as Additional Non-Executive Director",
            "Summary": "Mahindra Mahindra Financial Services Limited's Board approved the appointment of Mr. Parag Rao as Additional Director (Non-Executive and Non-Independent) effective December 10, 2025, following the Nomination and Remuneration Committee's recommendation. The appointment is subject to shareholder approval within 3 months and affects the company's board composition with Rao bringing over 30 years of banking and FMCG experience, including leadership roles at HDFC Bank.",
            "Sentiment": "positive",
            "PublishDate": 1765174234659,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mahindra Financial Services Transfers 65,128 Equity Shares Under Employee Stock Option Plans",
            "Summary": "Mahindra Financial Services Limited Employee Stock Option Trust transferred 65,128 equity shares to eligible employees following the exercise of vested stock options under the company's 2010 Employee Stock Option Scheme and 2023 Restricted Stock Units Plan. The share transfer was executed on November 26, 2025, with the company informing stock exchanges BSE and NSE about the transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1764172566410,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra & Mahindra Financial Services Receives Credit Rating Reaffirmations from CRISIL and India Ratings",
            "Summary": "Mahindra & Mahindra Financial Services Limited received credit rating reaffirmations from two rating agencies on November 11, 2025. India Ratings & Research Private Limited assigned IND AAA/Outlook Stable ratings to retail non-convertible debentures worth INR 80 billion, private subordinated debt of INR 54.5 billion, and fixed deposits of INR 120,000 million, along with IND A1+ rating for commercial paper worth INR 150,000 million. CRISIL Ratings Limited reaffirmed CRISIL AAA/Stable ratings for non-convertible debentures of Rs. 32,875 crore, subordinated debt of Rs. 5,113.50 crore, and fixed deposits of Rs. 18,000 crore. The company informed BSE and NSE about these rating reaffirmations in compliance with SEBI listing regulations.",
            "Sentiment": "positive",
            "PublishDate": 1762915671295,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra Finance Reports Strong Q2 Performance with 25% PAT Growth and Improved Margins",
            "Summary": "Mahindra Finance Limited reported quarterly results with net interest margin expansion from 6.5% to 7% year-on-year, driven by cost of funds improvement and fee-based income growth. The company achieved 25% profit after tax growth for the half-year period reaching Rs. 1,100 crores. Asset quality remained stable with GS2 plus GS3 at 9.7%, lower than previous year's Q2 levels. Tractor business showed strong momentum with 41% growth, benefiting from positive rural economy conditions. The company maintained credit cost guidance of 1.7% for the full year. Trade advances increased to Rs. 6,800 crores during the festive season compared to around Rs. 4,000 crores in the previous quarter. Management expressed optimism about H2 performance, citing GST rate cuts and festive demand as positive drivers for passenger vehicle and tractor segments.",
            "Sentiment": "positive",
            "PublishDate": 1762205450706,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra & Mahindra Financial Services Appoints Padmaja Chunduru as Independent Director",
            "Summary": "Mahindra & Mahindra Financial Services Limited has appointed Ms. Padmaja Chunduru as an Additional Director (Independent and Non-Executive) on the company's board. The appointment is effective from November 10, 2025, for a term of 5 consecutive years until November 9, 2030. The appointment is subject to shareholder approval within 3 months. Chunduru brings over 37 years of banking and capital markets experience in India and USA, having served as MD & CEO of NSDL and Indian Bank, and as Deputy Managing Director of State Bank of India. She currently serves as an Independent Director on multiple company boards including Bajaj Life and General Insurance Companies, Atul Ltd, and Brigade Enterprises Ltd. She has received recognition as Best CEO (BFSI) for 2021 by Business Today and has been acknowledged as one of the Most Powerful Women in Business by Fortune India and Business Today for 2022 and 2023.",
            "Sentiment": "positive",
            "PublishDate": 1761660424062,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mahindra Financial Services Appoints New COO, Head of SME Resigns",
            "Summary": "Mahindra & Mahindra Financial Services Limited announced senior management changes. Ms. Aarti Nihalani has been appointed as Chief Operating Officer effective December 1, 2025. She brings 16 years of consulting experience in financial services and is currently Partner of Financial Services for Oliver Wyman India. She holds a PG Diploma from IIM Ahmedabad and received the IIM Ahmedabad Young Alumni Achiever Award for Corporate Leadership in 2024. Meanwhile, Mr. Shiv Kumar NV, Head of Small and Medium Enterprises, resigned effective October 28, 2025, to pursue external opportunities. The board meeting concluded on October 28, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761659282255,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mahindra Financial Services Updates Insider Trading Code to Align with SEBI Regulations",
            "Summary": "Mahindra & Mahindra Financial Services Limited's Board of Directors approved amendments to its Code of Practices and Procedure for Fair Disclosure of Unpublished Price Sensitive Information on October 28, 2025. The amendments align the code with recent changes in SEBI (Prohibition of Insider Trading) Regulations, 2015, specifically incorporating regulatory amendments related to changes in the definition of UPSI that became effective from June 10, 2025. The updated code includes certain 'material events' in accordance with Regulation 30 of SEBI Listing Regulations within the definition of UPSI. This represents the fourth version of the code since its initial implementation in May 2015.",
            "Sentiment": "neutral",
            "PublishDate": 1761657534376,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mahindra Financial Services Fully Utilizes Rs 2,996 Crore Rights Issue Proceeds",
            "Summary": "Mahindra & Mahindra Financial Services Ltd. has completely utilized the Rs 2,996.16 crore raised through its rights issue conducted from May 22 to June 6, 2025. The monitoring agency report by CARE Ratings Limited for the quarter ended September 30, 2025, confirms no deviation from the stated objects. The funds were deployed as planned: Rs 2,250 crore for augmenting long-term capital to meet funding requirements for business activities, Rs 738.17 crore for general corporate purposes including repaying liabilities and interest payments, and Rs 7.99 crore for issue-related expenses. The company utilized the proceeds in accordance with the Letter of Offer dated May 8, 2025, with no variations in fund utilization.",
            "Sentiment": "positive",
            "PublishDate": 1761656113350,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra Financial Services Reports Q2 FY26 Results with Net Profit of Rs 1,098.81 Crores",
            "Summary": "Mahindra & Mahindra Financial Services Limited announced its unaudited standalone and consolidated financial results for the second quarter and half year ended September 30, 2025. The Board of Directors approved these results at their meeting held on October 28, 2025. On a standalone basis, the company reported total revenue from operations of Rs 4,472.67 crores for Q2 FY26 and Rs 8,892.04 crores for the half year. Net profit after tax stood at Rs 569.31 crores for the quarter and Rs 1,098.81 crores for the half year. The company's total assets reached Rs 1,40,129.21 crores as of September 30, 2025. On a consolidated basis, total income was Rs 5,049.45 crores for Q2 and Rs 10,181.16 crores for the half year, with net profit of Rs 566.07 crores for the quarter and Rs 1,095.03 crores for the half year. The company completed a rights issue during the period, raising Rs 2,996.16 crores through the allotment of 15.44 crore equity shares at Rs 194 per share. The financial results received an unmodified review report from joint statutory auditors M M Nissim & Co. LLP and M. P. Chitale & Co.",
            "Sentiment": "positive",
            "PublishDate": 1761650203704,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra & Mahindra Financial Services Appoints Alka Srivastava as Head of Underwriting",
            "Summary": "Mahindra & Mahindra Financial Services Limited announced a senior management change with Ms. Alka Srivastava being appointed as Head-Underwriting effective October 15, 2025. Srivastava, who currently serves as Business Head for CVCE (Commercial Vehicle, Construction Equipment), will transition from her present role. She holds a Master of Finance and Control from Lucknow University and brings 24 years of experience in banking and financial services, including previous roles at HDFC Bank, Axis Bank, and CitiFinancial. Her expertise spans underwriting and risk management across retail loans including car loans, commercial vehicle loans, two-wheelers, and personal loans. She has been with Mahindra Financial Services for 3 years, heading the CVCE Business for the past year and previously serving as Head Underwriting and Policy for Vehicle Loans.",
            "Sentiment": "neutral",
            "PublishDate": 1760454221612,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mahindra Financial Services Reports ₹13,500 Crore Disbursement with 3% Annual Growth",
            "Summary": "Mahindra & Mahindra Financial Services reported disbursements of ₹13,500 crore, marking a 3% year-on-year growth. The company's business assets increased by approximately 13%.",
            "Sentiment": "positive",
            "PublishDate": 1759472942186,
            "Source": "stock"
        },
        {
            "Title": "M&M Financial Services Schedules Q2 Results Review for October 28",
            "Summary": "M&M Financial Services has announced that it will review its Q2 results on October 28. The company has set this date for examining its quarterly financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1759139932395,
            "Source": "earnings"
        },
        {
            "Title": "Credila Seeks $600M Foreign Loan After IPO Filing",
            "Summary": "Education loan provider Credila is in discussions to raise up to $600 million through external commercial borrowing from foreign lenders including DBS, MUFG, and Sumitomo Mitsui Banking Corp. The US dollar loan is being marketed at spreads of 135-150 basis points over SOFR, with an expected rate of 5.5-6%. The company filed draft IPO papers to raise ₹5,000 crore and has expanded its lending relationships to 29 from 19 two years earlier. Offshore borrowings now represent 18.4% of total debt, up from zero two years ago. HDFC Bank sold its stake to EQT's Kopvoorn BV and ChrysCapital entities, with Kopvoorn holding 63.96% as of March 2025. Average borrowings increased to ₹32,700 crore in FY25 from ₹20,067 crore the previous year, while average cost of debt rose to 8.85% from 8.63%.",
            "Sentiment": "neutral",
            "PublishDate": 1755562757072,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Finance Partners with ICICI Lombard for Motor Insurance Distribution",
            "Summary": "Mahindra & Mahindra Financial Services Limited has partnered with ICICI Lombard General Insurance to distribute motor insurance products to its customers. The collaboration combines Mahindra Finance's extensive rural and semi-urban reach with ICICI Lombard's motor insurance expertise to provide accessible insurance solutions. Through this partnership, Mahindra Finance customers will access ICICI Lombard's motor insurance portfolio, aiming to drive financial inclusion across the company's wider customer base. Mahindra Finance serves over 11 million customers through 1,352 offices across 516,000 villages and 8,000 towns. ICICI Lombard has issued over 37.6 million policies with a Gross Written Premium of ₹282.58 billion for the year ended March 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754899005805,
            "Source": "order&deals"
        },
        {
            "Title": "Rainmatter Acquires 5% Stake in Capitalmind Financial Services",
            "Summary": "Rainmatter, Zerodha's investment arm, has acquired approximately 5% stake in Capitalmind Financial Services, marking the company's first institutional funding round. Deepak Shenoy, MD & CEO of Capitalmind Asset Management, announced the investment. Nithin Kamath, Zerodha's founder and CEO, stated that Rainmatter backs innovative companies aligned with helping Indians manage money better. The stake is capped at 10% per regulations, with Rainmatter not taking a board seat to ensure Capitalmind's independence. The investment comes after Capitalmind's successful launch of its fund business and mutual fund operations. Kamath noted the relationship's history, mentioning that Shenoy was among the first people he discussed Zerodha's concept with and served as an early advisor.",
            "Sentiment": "positive",
            "PublishDate": 1754549004491,
            "Source": "order&deals"
        },
        {
            "Title": "HDB Financial Services Shares Fall Below IPO Price Following Weak Quarterly Results",
            "Summary": "HDB Financial Services shares dropped 1.4% below its IPO price of Rs 740, trading at Rs 738.25. The decline followed the company's quarterly results which showed deteriorating asset quality metrics. Gross NPA ratio increased to 2.56% from 2.26%, while Net NPA ratio rose to 1.11% from 0.99%. Credit costs also climbed to 2.5% from 2.4%. The stock has fallen 11% since its July 2 listing and declined nearly 12% since the quarterly results announcement. The company, which is HDFC Bank's wholly-owned lending subsidiary, had conducted India's fifth-largest IPO worth Rs 12,000 crore. Currently, only one analyst tracks the stock with a 'buy' rating and a 12-month price target suggesting 21.5% upside potential.",
            "Sentiment": "negative",
            "PublishDate": 1754297693520,
            "Source": "stock"
        },
        {
            "Title": "HDB Financial Shares Fall Below IPO Price for First Time, Hit 52-Week Low",
            "Summary": "HDB Financial Services shares dropped below their IPO issue price of Rs 740 for the first time, declining 1.4% to reach a new 52-week low of Rs 738.20. This marks a reversal from the company's strong market debut when shares opened at Rs 835 with a 12.84% premium. The company's Rs 12,500 crore IPO, comprising Rs 2,500 crore fresh issue and Rs 10,000 crore offer-for-sale, was subscribed 17.65 times overall with QIBs subscribing 31.73 times. The IPO attracted bids worth over Rs 1.61 lakh crore, making it the second-most subscribed large issue after Tata Technologies. HDB Financial was valued at a P/E ratio of 28.15x with an implied market cap of around Rs 61,253 crore. The company operates over 1,700 branches across India with a diversified loan book covering retail, SME, and asset finance segments.",
            "Sentiment": "negative",
            "PublishDate": 1754292383886,
            "Source": "stock"
        },
        {
            "Title": "Mahindra & Mahindra Financial Services Shareholders Approve Rs. 1,50,000 Crore Borrowing Limit and Director Re-appointment",
            "Summary": "Mahindra & Mahindra Financial Services Limited shareholders approved all resolutions at their 35th Annual General Meeting held on July 22, 2025. Key approvals include increasing borrowing limits under section 180(1)(c) of the Companies Act, 2013 to Rs. 1,50,000 crore. Shareholders also approved the re-appointment of Dr. Rebecca Nugent as Independent Director for a second term of 5 consecutive years from March 5, 2026 to March 4, 2031. Dr. Nugent is the Stephen E. and Joyce Fienberg Professor of Statistics & Data Science and Department Head for the Carnegie Mellon Statistics & Data Science Department with over 15 years of experience in university-level academia. Additionally, M/s. Makarand M. Joshi & Co., Company Secretaries were appointed as Secretarial Auditor for a 5-year term from FY 2025-26 to FY 2029-30, effective April 23, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753336103634,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra Financial Services Appoints New Chief Legal Officer in Senior Management Reshuffle",
            "Summary": "Mahindra & Mahindra Financial Services Limited announced a senior management change with Ms. Ketaki Suklikar being appointed as Chief Legal Officer effective November 1, 2025. She will replace Ms. Farida Balsara, who will transition back to Mahindra & Mahindra Limited. Ms. Suklikar brings over 20 years of legal experience and is currently the Legal Head of Mergers & Acquisitions at Mahindra Group. She will join as 'Chief Legal Officer – Designate' from September 1, 2025 to ensure smooth transition. The change is part of Mahindra Group's talent rotation practice. The company also announced the release of its unaudited standalone and consolidated financial results for the first quarter ended June 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753176802685,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mahindra Financial Services Reports Rise in Stage-3 Assets",
            "Summary": "Mahindra & Mahindra Financial Services reported quarterly results showing gross Stage-3 assets increased to 3.85% from 3.69% quarter-on-quarter. Net Stage-3 assets also rose to 1.91% from 1.84% quarter-on-quarter, indicating a deterioration in asset quality metrics.",
            "Sentiment": "negative",
            "PublishDate": 1753176043823,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra & Mahindra Financial Services Reports Revenue Growth to 44.2B Rupees",
            "Summary": "Mahindra & Mahindra Financial Services reported Q1 revenue of 44.2 billion rupees compared to 37.2 billion rupees in the same period last year. The company's standalone net profit reached 5.3 billion rupees versus 5.12 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1753175536886,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra and Mahindra Financial Services: Q1 Update Sparks Asset Quality Concerns",
            "Summary": "M&M Financial Services shares rose over 2% after Q1 business update. Morgan Stanley flagged concerns over asset quality and growth prospects, maintaining 'equal-weight' rating. Collection efficiency dropped to 95% from 97% in the previous quarter. The company's loan mix shift to better-quality segments may impact loan yields, ROA, and ROE.",
            "Sentiment": "neutral",
            "PublishDate": 1751517112000,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra & Mahindra Financial Services: Q1 Sees Steady Growth with Rising Assets",
            "Summary": "M&M Financial reported a 1% YoY increase in Q1 disbursements to ₹12,800 crore. Business assets grew 15% YoY to ₹1.22 lakh crore. Collection efficiency improved to 95%. Stage-3 assets slightly increased to 3.8-3.9%, while Stage-2 assets were at 5.8-5.9%. The company maintains a strong liquidity position with a buffer of over ₹9,600 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1751476808000,
            "Source": "earnings"
        },
        {
            "Title": "M&M Financial Reports Steady Q1 Performance",
            "Summary": "M&M Financial has reported steady performance for Q1, with loans disbursed amounting to ₹12,800 crore. The company also noted improved collection efforts, which were up 1% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1751472088000,
            "Source": "default"
        },
        {
            "Title": "Mahindra & Mahindra Financial Services to Review Q1 Results",
            "Summary": "Mahindra & Mahindra Financial Services has announced plans to review their first quarter (Q1) results on July 22.",
            "Sentiment": "neutral",
            "PublishDate": 1751001209000,
            "Source": "default"
        },
        {
            "Title": "M&M Increases Stake in M&M Financial Services Through Rights Issue",
            "Summary": "Mahindra & Mahindra (M&M) has increased its stake in its subsidiary, M&M Financial Services, by acquiring 8.52 crore equity shares at ₹194 each through a rights issue.",
            "Sentiment": "positive",
            "PublishDate": 1749486584000,
            "Source": "default"
        }
    ]
}