{
    "Symbol": "MAANALU",
    "ISIN": "INE215I01027",
    "News": [
        {
            "Title": "MAAN Aluminium Allots 59 Lakh Shares at ₹141",
            "Summary": "MAAN Aluminium Ltd completed preferential allotment of 59,00,000 equity shares at ₹141 per share to promoters and non-promoter investors, raising funds through SEBI ICDR regulations compliance.",
            "Sentiment": "positive",
            "PublishDate": 1768579343425,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maan Aluminium Shareholders Approve Articles Alteration and Preferential Share Issue",
            "Summary": "Maan Aluminium Limited's shareholders passed two special resolutions at an extraordinary general meeting held on November 29, 2025, approving alteration in the company's articles of association and issue of equity shares on preferential basis. Both resolutions received overwhelming support with 99.9998% votes in favor, indicating strong shareholder confidence in the proposed corporate restructuring measures.",
            "Sentiment": "positive",
            "PublishDate": 1764507471584,
            "Source": "corporate_action"
        },
        {
            "Title": "MAAN Aluminium Reports Q2 FY26 Results, Plans Rs. 110 Crore CAPEX for Value Addition",
            "Summary": "MAAN Aluminium Limited reported quarterly results with revenue of Rs. 191 crores and operating profit of Rs. 7.96 crores, while announcing plans to invest Rs. 110 crores in value addition capabilities including powder coating, anodizing, and machining facilities. The company has doubled its extrusion capacity from 12,000 tons to 24,000 tons per annum and expects to achieve 15%-18% EBITDA margins within 2-3 years through enhanced value-added services targeting defense, aerospace, and EV sectors.",
            "Sentiment": "positive",
            "PublishDate": 1764048239239,
            "Source": "earnings"
        },
        {
            "Title": "Maan Aluminium Reports Mixed Q2FY26 Results with 7% Revenue Decline Despite Capacity Expansion",
            "Summary": "Maan Aluminium Limited posted quarterly results for September 30, 2025, showing revenue decline of 7% to ₹191 crores in Q2FY26 compared to ₹205 crores in Q2FY25, though EBITDA improved to ₹11 crores with 6% margin. The company has expanded extrusion capacity from 10,000 TPA to 24,000 TPA through new Italian press installation and acquired a Dewas unit for ₹8.75 crores, positioning for future growth in high-value aluminum extrusion products.",
            "Sentiment": "neutral",
            "PublishDate": 1763174781722,
            "Source": "earnings"
        },
        {
            "Title": "Maan Aluminium Schedules Q2FY26 Earnings Conference Call for November 17",
            "Summary": "Maan Aluminium Limited will host an earnings conference call on November 17, 2025, at 4:00 PM IST to discuss its operational and financial performance for Q2FY26. The call follows the company's board meeting announcement for financial results for the quarter ended September 30, 2025. Key management participants include Chairman & Managing Director Ravinder Nath Jain, Executive Directors Ashish Jain and Priti Jain, CFO Umesh Chandra Pant, and Company Secretary Sandeep Kumar Agarwal. The company will provide dial-in numbers for investors and analysts, with audio/video recording and transcript to be made available later on the company website.",
            "Sentiment": "neutral",
            "PublishDate": 1762968354198,
            "Source": "earnings"
        },
        {
            "Title": "Maan Aluminium to Raise Rs 831.9 Crore Through Preferential Share Issue",
            "Summary": "Maan Aluminium Limited has called an Extraordinary General Meeting for November 29, 2025, to approve the issuance of 59 lakh equity shares at Rs 141 per share through preferential allotment. The company plans to raise Rs 831.9 crore from 39 allottees, including promoter Ravinder Nath Jain who will receive 12.26 lakh shares. The funds will be utilized for capital expenditure on aluminum extrusion projects (Rs 400 crore), working capital requirements (Rs 280 crore), and general corporate purposes (Rs 151.9 crore). The issue price of Rs 141 per share includes a premium of Rs 136, with the relevant date for pricing being October 30, 2025. Post-issue, promoter shareholding will decrease from 58.87% to 55.82%. The shares will be locked-in for 18 months for promoters and 6 months for public category allottees.",
            "Sentiment": "positive",
            "PublishDate": 1762567635560,
            "Source": "corporate_action"
        },
        {
            "Title": "Maan Aluminium Board Approves Preferential Issue of Up to 5.9 Million Equity Shares at Rs 141 Each",
            "Summary": "Maan Aluminium Limited's Board of Directors approved a preferential issue of up to 59,00,000 equity shares of Rs 5 each at an issue price of Rs 141 per share, including a premium of Rs 136 per share. The shares will be allotted to promoter and non-promoter public category investors, with the largest allocation of 12,26,500 shares going to Ravinder Nath Jain. The Board also approved amendments to the Articles of Association to incorporate provisions for private placement and preferential issue of securities. An Extra-Ordinary General Meeting has been scheduled for November 29, 2025, through video conferencing to seek member approval. The e-voting period will commence on November 26, 2025, at 9:00 AM and conclude on November 28, 2025, at 5:00 PM, with the cut-off date for voting eligibility set as November 22, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762267150452,
            "Source": "corporate_action"
        },
        {
            "Title": "Maan Aluminium Reports Q1 Results, CFO Transition, and AGM Date",
            "Summary": "Maan Aluminium Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 2,111.9 lakhs compared to Rs 1,767.8 lakhs in the same quarter last year. Net profit for the quarter was Rs 273 lakhs versus Rs 339 lakhs in the previous year quarter. Basic earnings per share stood at Rs 0.50 compared to Rs 0.63 in the corresponding quarter. The company announced the resignation of CFO Sandeep Kumar Agarwal effective August 12, 2025, and appointed Umesh Chandra Pant as the new CFO on the same date. Pant brings over 12 years of experience in corporate finance, treasury operations, and international business, holding CMA qualification and a Post Graduate Programme in Management from IMT-CDL. The company scheduled its 22nd Annual General Meeting for September 23, 2025, at 12:30 PM via video conference.",
            "Sentiment": "neutral",
            "PublishDate": 1754997642719,
            "Source": "earnings"
        },
        {
            "Title": "Maan Aluminium Reports Q4 Financial Results",
            "Summary": "Maan Aluminium has released its Q4 financial results. The company's EBITDA decreased to 77 million rupees from 92.7 million rupees year-over-year. The EBITDA margin fell to 3.13% from 3.9% in the same period. Revenue increased to 2.46 billion rupees from 2.37 billion rupees year-over-year. Net profit declined to 39.4 million rupees from 72.8 million rupees year-over-year and 30.5 million rupees quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1748347870000,
            "Source": "result"
        },
        {
            "Title": "Maan Aluminium Acquires Building and Leasehold Land for 87.5 Million Rupees",
            "Summary": "Maan Aluminium Limited has announced the acquisition of a building and leasehold land. The total expenditure for this acquisition amounts to 87.5 million Indian Rupees.",
            "Sentiment": "positive",
            "PublishDate": 1741248950000,
            "Source": "corporate_action"
        },
        {
            "Title": "Maan Aluminium Plans Expansion of Aluminium Extrusion Business",
            "Summary": "Maan Aluminium Limited has announced plans to expand its aluminium extrusion business. This strategic move indicates the company's intent to increase its production capacity and potentially capture a larger market share in the aluminium extrusion sector.",
            "Sentiment": "positive",
            "PublishDate": 1741248914000,
            "Source": "corporate_action"
        },
        {
            "Title": "Maan Aluminium Reports Significant Decline in Q3 EBITDA",
            "Summary": "Maan Aluminium has reported a substantial decrease in its Q3 EBITDA, which fell to 48 million rupees from 109 million rupees year-over-year. The company's EBITDA margin also contracted, dropping to 2.65% from 5.10% in the same period last year. This significant reduction in both EBITDA and EBITDA margin indicates a challenging quarter for the company's operational performance.",
            "Sentiment": "negative",
            "PublishDate": 1738665882000,
            "Source": "earnings"
        },
        {
            "Title": "Maan Aluminium Reports Decline in Q3 Profit and Revenue",
            "Summary": "Maan Aluminium has reported a significant decrease in both net profit and revenue for the third quarter. The company's net profit fell to 31 million rupees from 74 million rupees in the same period last year, marking a 58% decline. Revenue also decreased from 2.13 billion rupees to 1.8 billion rupees, representing a 15.5% reduction year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738665868000,
            "Source": "earnings"
        },
        {
            "Title": "Maan Aluminium Doubles Production Capacity with New Extrusion Line",
            "Summary": "Maan Aluminium has announced the installation of a new extrusion line that will cater to the market for 300 mm wider profiles. This expansion will increase the company's annual production capacity from 12,000 MT to 24,000 MT, effectively doubling their output.",
            "Sentiment": "positive",
            "PublishDate": 1735287853000,
            "Source": "corporate_action"
        },
        {
            "Title": "Maan Aluminium Doubles Production Capacity with New Press",
            "Summary": "Maan Aluminium has commenced commercial production of a new press, which will increase the company's annual production capacity from 12,000 MT to 24,000 MT. This expansion represents a significant boost to the company's manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1735287836000,
            "Source": "corporate_action"
        },
        {
            "Title": "Maan Aluminium Doubles Annual Production Capacity",
            "Summary": "Maan Aluminium Limited has increased its annual production capacity from 12,000 MT to 24,000 MT, effectively doubling its output potential.",
            "Sentiment": "positive",
            "PublishDate": 1732689256000,
            "Source": "corporate_action"
        },
        {
            "Title": "Maan Aluminium Begins Trial Run of New Extrusion Press",
            "Summary": "Maan Aluminium has initiated the trial run of a 30 MN short stroke back loading press. This new equipment enhances the company's extrusion capabilities, allowing for the production of 300 mm wider profiles and the ability to work with a broader range of aluminum alloys from the 1XXX to 7XXX series.",
            "Sentiment": "positive",
            "PublishDate": 1732689215000,
            "Source": "corporate_action"
        },
        {
            "Title": "Maan Aluminium Reports Q2 EBITDA Decline",
            "Summary": "Maan Aluminium's Q2 EBITDA decreased to 76 million rupees from 111 million rupees year-over-year. The company's Q2 EBITDA margin slightly declined to 3.70% from 3.75% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731590360000,
            "Source": "result"
        },
        {
            "Title": "Maan Aluminium Reports Q2 Financial Results",
            "Summary": "Maan Aluminium announced its Q2 financial results. The company's net profit decreased to 51 million rupees, down from 79 million rupees year-over-year and 34 million rupees quarter-over-quarter. Revenue for Q2 was 2.05 billion rupees, a decrease from 2.95 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1731590282000,
            "Source": "result"
        }
    ]
}