{
    "Symbol": "MADHAV",
    "ISIN": "INE925C01016",
    "News": [
        {
            "Title": "Madhav Marbles Q3FY26 Revenue ₹660.25 Lakhs",
            "Summary": "Madhav Marbles and Granites Limited reported Q3FY26 revenue of ₹660.25 lakhs with standalone net loss of ₹12.73 lakhs. Board approved subsidiary capital increase and wind generator sale proposal.",
            "Sentiment": "negative",
            "PublishDate": 1770802315247,
            "Source": "co_actions_results"
        },
        {
            "Title": "Madhav Marbles and Granites Shareholders Approve All Five Resolutions Including Dividend Declaration",
            "Summary": "Madhav Marbles and Granites Limited shareholders approved five resolutions through voting. The resolutions included adoption of audited standalone and consolidated financial statements for the year ended March 31, 2022, declaration of dividend on equity shares, re-appointment of Mrs. Riddhima Doshi as Director, appointment of M/s Nyati and Associates as Statutory Auditors, and approval of related party transactions. All resolutions passed with over 99% votes in favor. The company has 8,947,000 total shares, with promoter and promoter group holding 3,777,395 shares. Voting participation was 19.88% for financial statements and dividend resolutions, while director appointment and related party transaction resolutions saw 0.62% participation as promoter groups abstained from voting on matters where they had interest.",
            "Sentiment": "positive",
            "PublishDate": 1761796229339,
            "Source": "corporate_action"
        },
        {
            "Title": "Madhav Marbles Reports Q1 FY2026 Results and Approves Windmill Leasing Strategy",
            "Summary": "Madhav Marbles and Granites Limited approved its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 792.16 lakhs compared to Rs. 1060.49 lakhs in the same quarter last year. Net profit stood at Rs. 16.13 lakhs versus Rs. 44.72 lakhs in the previous year quarter. On a consolidated basis, the company posted a net loss of Rs. 17.66 lakhs compared to a loss of Rs. 3.36 lakhs in the corresponding quarter last year. The board approved a proposal to lease one of its three windmills to a newly formed entity where Madhav Marbles will hold a 74% stake, with the remaining 26% held by HT consumers. This strategic move aims to optimize power utilization and improve revenue through direct sales to high tension consumers, moving away from the current model of captive use and surplus banking with Tamil Nadu Electricity Board.",
            "Sentiment": "neutral",
            "PublishDate": 1755097758568,
            "Source": "earnings"
        }
    ]
}