{
    "Symbol": "MADHUCON",
    "ISIN": "INE378D01032",
    "News": [
        {
            "Title": "Madhucon Projects Q3FY26 Results Show Strong Turnaround",
            "Summary": "Madhucon Projects reported net profit of ₹539.22 lakhs in Q3FY26 versus loss of ₹295.60 lakhs in Q3FY25, with revenue rising 30.38% to ₹11,747.35 lakhs. Nine-month performance also improved significantly.",
            "Sentiment": "positive",
            "PublishDate": 1770463900767,
            "Source": "co_actions_results"
        },
        {
            "Title": "Madhucon Projects clarifies director resignation",
            "Summary": "Madhucon Projects Limited provides clarification on the resignation of Independent Director Mrs. Ch. Lakshmi Kumari, which was accepted by the board on November 8, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766577541952,
            "Source": "stocks"
        },
        {
            "Title": "Madhucon Projects Limited Completes Board Restructuring with Director Changes",
            "Summary": "Madhucon Projects Limited accepted the resignation of Independent Director P. Madhava Rao due to personal reasons and appointed two new directors - Sambasiva Rao Jasty as additional director and Turlapati Venkata Sundara Jawaharlal Nehru as Independent Director for a 5-year term. The board changes were approved on August 9, 2025, affecting the company's governance structure and requiring shareholder approval at the upcoming Annual General Meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1763638747498,
            "Source": "corporate_governance"
        },
        {
            "Title": "Madhucon Projects Reports Rs 469.40 Lakh Profit in Q2 Despite Auditor Concerns Over Subsidiary Investments",
            "Summary": "Madhucon Projects Limited reported a standalone profit of Rs 469.40 lakh for the quarter ended September 30, 2025, compared to a loss of Rs 240.13 lakh in the same period last year. Revenue from operations declined to Rs 10,765.01 lakh from Rs 16,280.56 lakh year-on-year. The company's Board accepted the resignation of Independent Director Mrs. Ch. Lakshmi Kumari effective November 8, 2025. Auditors raised significant concerns about the carrying value of equity investments worth Rs 53,408.43 lakh in subsidiaries, noting that some subsidiaries have eroded net worth and going concern issues. The company wrote off investments of Rs 7,637.67 lakh in subsidiary Madhucon Infra Limited and Rs 738.01 lakh in step-down subsidiary Madurai Tuticorin Expressways Limited during the quarter. Several step-down subsidiaries including Ranchi Expressways, Trichy-Thanjavur Expressways, and Barasat-Krishnagar Expressways are undergoing Corporate Insolvency Resolution Process. The Enforcement Directorate has provisionally attached properties worth Rs 176.86 crore belonging to the Madhucon Group in connection with a case against Ranchi Expressway Limited.",
            "Sentiment": "negative",
            "PublishDate": 1762611768365,
            "Source": "earnings"
        },
        {
            "Title": "Madhucon Projects Limited Reports Rs 31.44 Crore Principal Default on Bank Loans",
            "Summary": "Madhucon Projects Limited disclosed defaults on loan payments for the quarter ended September 30, 2025. The company reported a principal default amount of Rs 31.44 crore with no interest defaults. The total outstanding amount for fund-based loans stands at Rs 31.44 crore, representing a complete default on this amount. The company's total financial indebtedness including short-term and long-term debt amounts to Rs 185.25 crore. The default involves secured loans from OBC/Punjab National Bank. The disclosure was made on October 1, 2025, covering both fund and non-fund based obligations.",
            "Sentiment": "negative",
            "PublishDate": 1759310099429,
            "Source": "corporate_action"
        },
        {
            "Title": "Madhucon Projects Appoints Two New Directors Following Shareholder Approval",
            "Summary": "Madhucon Projects Limited appointed two new directors at its 35th Annual General Meeting held on September 26, 2025. Mr. Sambasiva Rao Jasty was appointed as Director-Finance & Accounts, bringing 24 years of experience in finance, accounts, and audit functions with expertise in operational efficiency and banking operations. Mr. Turlapati Venkata Sundara Jawaharlal Nehru was appointed as Independent Director for a five-year term until August 8, 2030, contributing 22 years of senior management experience in administration, business development, and production. Both appointments were initially approved by the Board of Directors on August 9, 2025, and subsequently ratified by shareholders. Neither director is related to existing company directors.",
            "Sentiment": "positive",
            "PublishDate": 1758983182148,
            "Source": "corporate_governance"
        },
        {
            "Title": "Madhucon Projects Reports Quarterly Profit, Appoints New Directors and Sets AGM Date",
            "Summary": "Madhucon Projects Limited's board approved quarterly results for the period ended June 30, 2025, showing a standalone profit of Rs. 14.02 lakhs compared to a loss of Rs. 512.12 lakhs in the same quarter last year. Revenue from operations decreased to Rs. 13,517.60 lakhs from Rs. 20,975.03 lakhs year-over-year. The board appointed Sambasiva Rao Jasty as additional director and Turlapati Venkata Sundara Jawaharlal Nehru as Non-Executive Independent Director for five years, while accepting the resignation of P. Madhava Rao. V. Madhumita & Associates was appointed as Secretarial Auditor for five years from 2025-26 to 2029-30. The 35th Annual General Meeting was scheduled for September 26, 2025, with book closure from September 20-26, 2025. The auditors issued a qualified review report citing concerns about investment valuations, loan defaults, ongoing legal proceedings, and corporate insolvency processes affecting several subsidiaries.",
            "Sentiment": "neutral",
            "PublishDate": 1754742940943,
            "Source": "earnings"
        }
    ]
}