{
    "Symbol": "MADRASFERT",
    "ISIN": "INE414A01015",
    "News": [
        {
            "Title": "Madras Fertilizers Reports Strong Q2 Net Profit Growth",
            "Summary": "Madras Fertilizers reported Q2 net profit of 130 million rupees compared to 16 million rupees in the same period last year. The company's EBITDA increased to 122 million rupees from 108 million rupees year-over-year. EBITDA margin improved to 2.4% from 2% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762852515409,
            "Source": "earnings"
        },
        {
            "Title": "Madras Fertilizers Reports Mixed Q1 Results with Higher Profit but Lower EBITDA",
            "Summary": "Madras Fertilizers reported quarterly net profit of 441 million rupees compared to 405 million rupees in the same period last year. Revenue increased to 6.7 billion rupees from 6.55 billion rupees year-over-year. However, EBITDA declined to 650 million rupees from 655 million rupees, while EBITDA margin compressed to 9.66% from 9.99% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754995689498,
            "Source": "earnings"
        },
        {
            "Title": "Madras Fertilizers Reports Q4 Financial Results",
            "Summary": "Madras Fertilizers has reported its Q4 financial results. The company experienced an EBITDA loss of 611.1 million rupees, compared to a profit of 922.4 million rupees in the same quarter last year. Revenue decreased to 5.55 billion rupees from 7.58 billion rupees year-over-year. The company also reported a standalone net loss of 524.4 million rupees, compared to a profit of 883 million rupees in the same quarter last year and a profit of 746.3 million rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1748434584000,
            "Source": "result"
        },
        {
            "Title": "Madras Fertilizers Reports Profitable Q3 with Significant Revenue Growth",
            "Summary": "Madras Fertilizers has announced its financial results for the third quarter. The company reported a net profit of 746 million rupees, marking a substantial turnaround from a loss of 517 million rupees in the same period last year. Additionally, the company's revenue increased to 7.99 billion rupees, up from 5.6 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1739320387000,
            "Source": "earnings"
        },
        {
            "Title": "Madras Fertilizers Reports Significant Increase in Q3 EBITDA",
            "Summary": "Madras Fertilizers has announced its Q3 financial results, showing a substantial improvement in its EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). The company's EBITDA for the quarter reached 1.1 billion rupees, compared to 134 million rupees in the same quarter of the previous year. This represents a significant year-over-year increase. Additionally, the EBITDA margin expanded to 13.39% from 2.41% in the corresponding quarter last year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739286109000,
            "Source": "earnings"
        },
        {
            "Title": "Madras Fertilizers Reports Profit in Q3 FY2024",
            "Summary": "Madras Fertilizers Limited has reported a significant turnaround in its financial performance for the third quarter. The company posted a net profit of 746 million rupees, compared to a loss of 517 million rupees in the same period last year. Revenue also saw a substantial increase, rising to 7.99 billion rupees from 5.6 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739286034000,
            "Source": "earnings"
        },
        {
            "Title": "Madras Fertilizers to Shut Down Due to Credit Issue with Oil Companies",
            "Summary": "Madras Fertilizers Limited is set to cease operations from February 1 due to oil companies' unwillingness to extend credit for naphtha sales beyond January 31. This development, reported by a newspaper, highlights the company's financial challenges and its dependence on credit-based raw material procurement.",
            "Sentiment": "negative",
            "PublishDate": 1738294865000,
            "Source": "corporate_action"
        },
        {
            "Title": "Madras Fertilizers Q2 EBITDA Slightly Down Year-on-Year",
            "Summary": "Madras Fertilizers reported Q2 EBITDA of 110.3 million rupees, compared to 116 million rupees in the same quarter last year. The company's EBITDA margin decreased from 3% to 2.07% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731519012000,
            "Source": "result"
        },
        {
            "Title": "Madras Fertilizers Reports Q2 Revenue Increase",
            "Summary": "Madras Fertilizers has announced its Q2 revenue figures. The company reported revenue of 5.32 billion rupees, compared to 3.85 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731519007000,
            "Source": "result"
        },
        {
            "Title": "Madras Fertilizers Reports Q2 Net Profit Decline",
            "Summary": "Madras Fertilizers Limited has reported a net profit of 15.8 million rupees for the second quarter, showing a year-over-year decrease from 34 million rupees. However, this represents a significant quarter-over-quarter increase from 404.8 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1731519000000,
            "Source": "result"
        }
    ]
}