{
    "Symbol": "MAGADSUGAR",
    "ISIN": "INE347W01011",
    "News": [
        {
            "Title": "Magadh Sugar Q3 Net Profit Rises 19% to ₹251M",
            "Summary": "Magadh Sugar & Energy reported a 19% year-on-year increase in Q3 net profit to ₹251 million rupees compared to ₹211 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1770368282466,
            "Source": "co_actions_results"
        },
        {
            "Title": "Magadh Sugar Board Meet Set for Feb 6, 2026",
            "Summary": "Magadh Sugar & Energy Limited has scheduled a board meeting on February 6, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769706724391,
            "Source": "co_actions_results"
        },
        {
            "Title": "Magadh Sugar Energy Seeks Shareholder Approval for Director Appointment via Postal Ballot",
            "Summary": "Magadh Sugar Energy Limited has issued a postal ballot notice seeking member approval for the appointment of Mrs. Shalini Nopany as Non-Executive Director, with e-voting scheduled from November 19 to December 18, 2025. The company appointed Mrs. Nopany, who holds an MBA from University of Pittsburgh and serves as Managing Director of SIL Investments Limited, as Additional Director subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1763465287503,
            "Source": "corporate_action"
        },
        {
            "Title": "Magadh Sugar & Energy Reports Wider Net Loss and Sharp EBITDA Decline in Q2",
            "Summary": "Magadh Sugar & Energy reported a net loss of 104 million rupees in Q2, compared to a loss of 54 million rupees in the same period last year. Revenue remained relatively flat at 3.24 billion rupees versus 3.23 billion rupees year-over-year. EBITDA dropped significantly to 18 million rupees from 209 million rupees in the previous year's corresponding quarter. The EBITDA margin contracted sharply to 0.55% from 6.44% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762875065023,
            "Source": "earnings"
        },
        {
            "Title": "Magadh Sugar & Energy Reports Q1 Results and CFO Transition",
            "Summary": "Magadh Sugar & Energy Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company underwent a leadership change with Mr. Manoj Prasad resigning as CFO effective August 5, 2025, to focus on operational financial matters of the Hasanpur unit where he will continue as Vice President (Finance). Mr. Aditya Baheti, a qualified Chartered Accountant with over 15 years of experience in accounting and finance functions, was appointed as the new CFO effective August 6, 2025. The board also updated the Key Managerial Personnel list, which now includes Mr. Pankaj Singh as Whole-time Director, Mr. Aditya Baheti as CFO, and Mr. S Subramanian as Company Secretary. These personnel have been authorized to determine materiality of events and make stock exchange disclosures.",
            "Sentiment": "neutral",
            "PublishDate": 1754382977946,
            "Source": "earnings"
        },
        {
            "Title": "Magadh Sugar & Energy Limited Appoints New CFO as Manoj Prasad Steps Down",
            "Summary": "Magadh Sugar & Energy Limited announced leadership changes in its finance team. Mr. Manoj Prasad resigned as Chief Financial Officer effective August 5, 2025, to focus on operational financial matters of the company's Hasanpur unit, where he will continue as Vice President (Finance). Mr. Aditya Baheti, a qualified Chartered Accountant with over 15 years of post-qualification experience in accounting and finance, was appointed as the new CFO starting August 6, 2025. The company also released its unaudited financial results for the quarter ended June 30, 2025. The revised Key Managerial Personnel list includes Mr. Pankaj Singh as Whole-time Director, Mr. Aditya Baheti as Chief Financial Officer, and Mr. S Subramanian as Company Secretary.",
            "Sentiment": "neutral",
            "PublishDate": 1754382338155,
            "Source": "corporate_governance"
        },
        {
            "Title": "Magadh Sugar & Energy Reports Sharp Decline in Q1 Net Profit",
            "Summary": "Magadh Sugar & Energy reported a net profit of 2.2 million rupees in Q1, significantly down from 114 million rupees in the same quarter last year. The company's revenue also declined to 3.3 billion rupees compared to 3.6 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754381829013,
            "Source": "earnings"
        },
        {
            "Title": "Magadh Sugar & Energy Issues Corrigendum for 11th AGM, Corrects Executive Director Appointment Resolution",
            "Summary": "Magadh Sugar & Energy Limited has issued a corrigendum to correct an error in the notice of its 11th Annual General Meeting. The correction pertains to Resolution Item No. 7 regarding the appointment of Mr. Pankaj Singh as Executive Director designated as Whole-time Director and Key Managerial Personnel. The error involved omission of references to Sections 2(51) and 203 of the Companies Act, 2013 and the words 'Key Managerial Personnel' and 'liable to retire by rotation, if required'. The AGM is scheduled for August 2, 2025 at 11:00 a.m. through video conferencing. The meeting will address ordinary business including adoption of audited financial statements for the year ended March 31, 2025, declaration of dividend of ₹12.50 per equity share, and appointment of directors. Special business items include appointment of secretarial auditor M/s. Vinod Kothari & Co. for 5 years, ratification of cost auditor remuneration of ₹1.37 lakh for M/s D Radhakrishnan & Co., and formal appointment of Mr. Pankaj Singh as Director and Executive Director with proposed remuneration including basic salary of ₹8 lakh per month.",
            "Sentiment": "neutral",
            "PublishDate": 1753287469278,
            "Source": "corporate_action"
        },
        {
            "Title": "Magadh Sugar & Energy Declares Dividend",
            "Summary": "Magadh Sugar & Energy has announced a dividend of ₹12.5 per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1747127615000,
            "Source": "result"
        },
        {
            "Title": "Magadh Sugar & Energy Reports Strong Q4 Financial Results",
            "Summary": "Magadh Sugar & Energy has announced its Q4 financial results, showing significant year-over-year improvements. The company's revenue increased to 3.55 billion rupees from 2.88 billion rupees. EBITDA rose to 1.15 billion rupees from 804.1 million rupees, with the EBITDA margin expanding to 32.49% from 27.91%. Net profit also saw a substantial increase, reaching 715 million rupees compared to 469 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747127448000,
            "Source": "result"
        },
        {
            "Title": "Magadh Sugar & Energy Reports Q3 Revenue Increase",
            "Summary": "Magadh Sugar & Energy has reported a significant increase in its third-quarter revenue. The company's revenue for Q3 stood at 2.8 billion rupees, compared to 2.18 billion rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1739264826000,
            "Source": "earnings"
        },
        {
            "Title": "Magadh Sugar & Energy Reports Decline in Q3 EBITDA",
            "Summary": "Magadh Sugar & Energy has reported a significant decrease in its Q3 EBITDA, which fell to 393 million rupees from 613 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 13.85% from 28.06% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739264785000,
            "Source": "earnings"
        },
        {
            "Title": "Magadh Sugar & Energy Reports Decline in Q3 Net Profit",
            "Summary": "Magadh Sugar & Energy has reported a net profit of 211 million rupees for the third quarter, down from 389 million rupees in the same period last year. This represents a significant year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1739264746000,
            "Source": "earnings"
        },
        {
            "Title": "Magadh Sugar & Energy Reports Q2 EBITDA Decline",
            "Summary": "Magadh Sugar & Energy reported a decrease in Q2 EBITDA to 209 million rupees, down from 332 million rupees in the same quarter last year. The company's EBITDA margin also declined to 6.44% from 11.47% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731334724000,
            "Source": "result"
        },
        {
            "Title": "Magadh Sugar & Energy Reports Q2 Financial Results",
            "Summary": "Magadh Sugar & Energy has reported its Q2 financial results. The company's net profit for the quarter stands at 54 million rupees, showing a decrease from 151 million rupees year-over-year and 114 million rupees quarter-over-quarter. However, the company's revenue has increased to 3.23 billion rupees from 2.89 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731334672000,
            "Source": "result"
        }
    ]
}