{
    "Symbol": "MAGNUM",
    "ISIN": "INE387I01016",
    "News": [
        {
            "Title": "Magnum Ventures Faces ₹1.43 Cr GST Demand Notice",
            "Summary": "Magnum Ventures Limited received a GST demand order of ₹1.43 crores under Section 73 of SGST Act for alleged improper input tax credit claims, though company expects no material operational impact.",
            "Sentiment": "negative",
            "PublishDate": 1765618958512,
            "Source": "stocks"
        },
        {
            "Title": "Magnum Ventures Partially Redeems INR 150 Crore NCDs Using Fresh TFCI Funding",
            "Summary": "Magnum Ventures Limited redeemed INR 150 crore worth of non-convertible debentures on December 4, 2025, using fresh debt funding of INR 150 crore raised from Tourism Finance Corporation of India Limited. The partial redemption reduces the company's outstanding debenture amount from INR 211.45 crore to INR 61.45 crore, while the new TFCI loan carries an interest rate of 13% per annum with repayment in 48 quarterly installments from April 2026 to January 2038.",
            "Sentiment": "positive",
            "PublishDate": 1764841607840,
            "Source": "corporate_action"
        },
        {
            "Title": "Magnum Ventures Redeems Rs 2 Crore Preference Shares",
            "Summary": "Magnum Ventures Limited's Board approved redemption of 2,00,000 unlisted zero percent coupon rate preference shares worth Rs 2 crore on November 14, 2025. The redemption will be funded from proceeds of the company's fresh issue and affects the company's capital structure.",
            "Sentiment": "neutral",
            "PublishDate": 1763142058984,
            "Source": "corporate_action"
        },
        {
            "Title": "Magnum Ventures Reports Mixed Q2 Results Amid Regulatory Challenges and New Funding",
            "Summary": "Magnum Ventures Limited posted a net loss of Rs. 103.52 lacs for the quarter ended September 30, 2025, compared to a profit of Rs. 386.34 lacs in the previous year, while revenue from operations declined to Rs. 5,860.20 lacs from Rs. 8,362.23 lacs. The company raised Rs. 50 crores through 18% non-convertible debentures and faces ongoing SEBI penalties totaling Rs. 66 lacs with market access restrictions, though it has appealed the decision.",
            "Sentiment": "positive",
            "PublishDate": 1763118655696,
            "Source": "earnings"
        },
        {
            "Title": "Magnum Ventures Allots 20 Lakh Equity Shares Worth Rs 6 Crore to NEO Special Credit Opportunities Fund",
            "Summary": "Magnum Ventures Limited's Allotment Committee approved the allotment of 20,00,000 equity shares at Rs 30 per share (face value Rs 10 plus premium of Rs 20) on a private placement basis, raising Rs 6,00,00,000. The entire allotment went to NEO Special Credit Opportunities Fund, which will hold 2.92% stake in the company post-allotment. The Board had previously approved this equity share issuance in September 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762857790738,
            "Source": "corporate_action"
        },
        {
            "Title": "Magnum Ventures Holds EGM to Approve Preferential Issue of 20 Lakh Equity Shares",
            "Summary": "Magnum Ventures Limited conducted an Extra-Ordinary General Meeting on October 14, 2025, at 12:30 p.m. in New Delhi to seek shareholder approval for offering, issuing, and allotting 20,00,000 equity shares on a preferential basis. The meeting was chaired by Mr. Shiv Pravesh Chaturvedi, with Ms. Aaina Gupta serving as Company Secretary cum Compliance Officer. Voting was conducted through both remote e-voting and ballot papers at the venue, with M/s. HD And Associates appointed as scrutinizer for the voting process. The meeting concluded at 1:00 p.m., and the voting results will be submitted after receipt of the scrutinizer report.",
            "Sentiment": "neutral",
            "PublishDate": 1760442075052,
            "Source": "corporate_action"
        },
        {
            "Title": "Magnum Ventures Approves Rs 60 Crore Preferential Allotment to NEO Special Credit Opportunities Fund",
            "Summary": "Magnum Ventures Ltd's board approved the issuance of 20,00,000 equity shares at Rs 30 per share to NEO Special Credit Opportunities Fund through preferential allotment, raising Rs 6,00,00,000. The shares carry a face value of Rs 10 each with a premium of Rs 20 per share. The allotment is subject to regulatory and shareholder approvals at an upcoming Extraordinary General Meeting. The board fixed September 14, 2025 as the relevant date for determining the floor price. Post-allotment, NEO Special Credit Opportunities Fund will hold 2.92% stake in the company. The equity shares will be subject to lock-in provisions as per SEBI regulations. M/s. HD and Associates has been appointed as scrutinizer for the voting process.",
            "Sentiment": "positive",
            "PublishDate": 1757938643300,
            "Source": "corporate_action"
        },
        {
            "Title": "Magnum Ventures Receives Letter of Intent from NEO Special Credit Opportunities Fund for Equity Investment",
            "Summary": "Magnum Ventures Limited announced it has received a Letter of Intent dated September 9, 2025, from NEO Special Credit Opportunities Fund. The fund has expressed its intention to subscribe to equity shares of Magnum Ventures on certain terms. The company disclosed this information through its Company Secretary Cum Compliance Officer, Aaina Gupta.",
            "Sentiment": "positive",
            "PublishDate": 1757423173353,
            "Source": "stock"
        },
        {
            "Title": "Magnum Ventures Reports Q1 Loss, Approves Office Relocation and Paper Business Demerger",
            "Summary": "Magnum Ventures Limited reported a net loss of Rs 1,815.89 lakhs for the quarter ended June 30, 2025, compared to a loss of Rs 1,303.59 lakhs in the same period last year. Revenue from operations increased to Rs 11,577.15 lakhs from Rs 9,007.60 lakhs year-over-year. The board approved shifting the registered office from Delhi to Uttar Pradesh, subject to member and regulatory approvals. Directors gave in-principle approval for demerging the company's paper business into a separate entity. The company faces ongoing regulatory challenges, including a SEBI penalty of Rs 12 lakhs and market access restrictions. Additionally, 1.03 crore convertible warrants worth 25% of their value were forfeited after warrant holders failed to exercise conversion options within the stipulated timeframe. The company operates in paper and hotel segments, with paper contributing Rs 9,528.10 lakhs and hotels Rs 2,075.68 lakhs to quarterly revenue.",
            "Sentiment": "negative",
            "PublishDate": 1755081474416,
            "Source": "corporate_action"
        },
        {
            "Title": "Magnum Ventures Raises Rs 50 Crores Through Non-Convertible Debentures",
            "Summary": "Magnum Ventures Limited has allotted 5,000 non-convertible debentures with a face value of Rs 1 lakh each, raising Rs 50 crores through private placement. The debentures carry an 18% annual coupon rate with monthly payments and mature on August 31, 2027. Neo Special Credit Opportunities Fund, managed by Neo Asset Management Pvt Ltd along with co-investors, subscribed to the entire issue. The debentures are secured by charges on company assets and personal guarantees from promoters including Pardeep Kumar Jain, Abhay Jain, and Parv Jain. The funds will be used for capital expenditure and working capital requirements. The debentures will be listed on NSE and BSE debt segments.",
            "Sentiment": "positive",
            "PublishDate": 1754996540475,
            "Source": "corporate_action"
        },
        {
            "Title": "Magnum Ventures Schedules Board Meeting to Review Q2 Results and Consider Company Restructuring",
            "Summary": "Magnum Ventures Limited has scheduled a Board of Directors meeting for August 13, 2025, at 2:00 PM to review and approve unaudited financial results for the quarter ended June 30, 2025. The board will also consider and approve the proposed restructuring of the company through demerger or other suitable methods. The trading window for designated persons and their immediate relatives will remain closed until 48 hours after the board meeting outcome, in compliance with insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1754658477194,
            "Source": "corporate_action"
        },
        {
            "Title": "Magnum Ventures Promoter Extends Share Pledge for Rs 50 Crore Debenture Security",
            "Summary": "Magnum Ventures Limited promoter Parv Jain has extended an existing pledge on 83,24,255 shares (12.5% of total share capital) to Catalyst Trusteeship Limited. The pledge serves as additional security for Rs 50 crores of 18% listed, secured, redeemable, non-convertible debentures issued by the company. The debentures carry a BB credit rating. Parv Jain holds 1,27,61,755 shares (19.22% of total share capital) in the company, with total promoter shareholding at 3,77,67,554 shares (56.8% of total share capital). The encumbered shares represent 22% of promoter shareholding. The funds raised will be used for repayment of outstanding borrowings to AARC, transaction expenses, and working capital requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1754542983246,
            "Source": "corporate_action"
        },
        {
            "Title": "Magnum Ventures Promoter Extends Share Pledge for Additional ₹50 Crore Debenture Funding",
            "Summary": "Magnum Ventures Limited announced that promoter group member Parv Jain has extended the pledge of 83,24,255 equity shares through a Second Amended & Restated Unattested Share pledge agreement dated August 5, 2025. The pledge extension is to secure an additional ₹50 crore in 18% Listed, Secured, Redeemable, Non-Convertible Debentures, complementing the existing ₹180 crore NCDs already secured. The lender is Neo Special Credit Opportunities Fund, with Catalyst Trusteeship Limited serving as the debenture trustee. Parv Jain holds 1,27,61,755 equity shares in Magnum Ventures Limited. The security package includes pari passu charges over company assets, personal guarantees from three promoters including Parv Jain, and cross-collateralization with existing debentures. The previous agreements for ₹150 crore and ₹30 crore were executed in February 2024 and January 2025 respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1754404005297,
            "Source": "corporate_action"
        },
        {
            "Title": "Magnum Ventures Approves INR 50 Crore NCD Issuance to Neo Special Credit Opportunities Fund",
            "Summary": "Magnum Ventures Limited's Debt Raise Committee has approved the issuance of up to 5,000 non-convertible debentures worth INR 50 crores through private placement to Neo Special Credit Opportunities Fund and co-investors. The 18% coupon rate NCDs have a face value of INR 1 lakh each and will mature on August 31, 2027. The debentures carry monthly interest payments and are secured by pari passu charges on company assets, personal guarantees from promoters including Pardeep Kumar Jain, Abhay Jain, and Parv Jain, and a pledge of 83.24 lakh equity shares. The NCDs will be listed on NSE and BSE debt segments, with proceeds intended for capital expenditure and working capital requirements. The redemption schedule spans from September 2025 to August 2027, with the bulk amount of INR 45.5 crores due at maturity.",
            "Sentiment": "neutral",
            "PublishDate": 1754398489376,
            "Source": "corporate_action"
        }
    ]
}