{
    "Symbol": "MAHABANK",
    "ISIN": "INE457A01014",
    "News": [
        {
            "Title": "Bank Union Strike to Disrupt Operations on Jan 27",
            "Summary": "United Forum of Bank Unions plans nationwide strike on January 27, 2026, potentially affecting Bank of Maharashtra branches and offices across the country.",
            "Sentiment": "negative",
            "PublishDate": 1769179194438,
            "Source": "stocks"
        },
        {
            "Title": "Bank of Maharashtra Gets Rating Reaffirmation",
            "Summary": "Brickwork Ratings reaffirms BWR AA+ (Stable) rating on Bank of Maharashtra's ₹2,000 crore Basel III Tier II bonds across four series, citing strong government support and improved financial metrics.",
            "Sentiment": "positive",
            "PublishDate": 1769095166592,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra, NLC India Go Ex-Dividend Today",
            "Summary": "Bank of Maharashtra and NLC India shares turn ex-dividend today with ₹4.60 total dividend payout. Shareholders who held shares before January 20, 2026 are eligible for dividend payments.",
            "Sentiment": "neutral",
            "PublishDate": 1768869903233,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra Q3FY26 profit surges to ₹1,779 cr",
            "Summary": "Bank of Maharashtra reported its highest quarterly profit of ₹1,779 crores in Q3FY26, with 9-month profit exceeding ₹5,000 crores. The bank maintained strong asset quality with gross NPA at 1.60%.",
            "Sentiment": "positive",
            "PublishDate": 1768563034791,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra Q3FY26 Results Published",
            "Summary": "Bank of Maharashtra publishes Q3FY26 financial results in newspapers as per regulatory requirements. Results show key metrics including RoA at 1.86%, NIM at 3.87%, and Gross NPA at 1.60%.",
            "Sentiment": "neutral",
            "PublishDate": 1768387803950,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank Of Maharashtra Q3 Net Profit Jumps 26.5% To ₹1,779 Cr",
            "Summary": "State-owned Bank of Maharashtra reported strong Q3 FY26 results with net profit rising 26.5% to ₹1,779 crore. The bank reduced gross NPAs to 1.60% and declared 10% interim dividend despite shares paring gains.",
            "Sentiment": "positive",
            "PublishDate": 1768367909837,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank Of Maharashtra Plans Strategic Branch Expansion",
            "Summary": "Bank Of Maharashtra announces expectations for strong double-digit growth over the next few years through strategic branch expansion initiatives to strengthen market presence.",
            "Sentiment": "positive",
            "PublishDate": 1768360185660,
            "Source": "stocks"
        },
        {
            "Title": "Bank Of Maharashtra Reports Strong Q3 Metrics",
            "Summary": "Bank Of Maharashtra achieves NIM of 3.87%, ROA of 1.86%, and ROE of 23.79%, surpassing estimates. Projects 14% deposit growth with targets to maintain NIM above 3.75% and CRAR over 16%.",
            "Sentiment": "positive",
            "PublishDate": 1768359936611,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank Of Maharashtra Reports Strong Asset Quality",
            "Summary": "Bank Of Maharashtra achieves improved asset quality with Gross NPA at 1.60% and Net NPA at 0.15%, both surpassing expected guidance targets.",
            "Sentiment": "positive",
            "PublishDate": 1768359910027,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank Of Maharashtra Q3 FY26 Business Growth At 17.24%",
            "Summary": "Bank Of Maharashtra reports strong Q3 FY26 performance with total business growing 17.24%, deposits rising 15.3%, and advances increasing 20%, exceeding guidance for first three quarters.",
            "Sentiment": "positive",
            "PublishDate": 1768359884890,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra Discloses RBI Trade Relief Data",
            "Summary": "Bank of Maharashtra reveals 66 eligible MSME borrowers under RBI Trade Relief Measures worth ₹671 crores, representing 1.31% of total MSME portfolio during Q3FY26 earnings call.",
            "Sentiment": "neutral",
            "PublishDate": 1768328980950,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra Q3FY26 Earnings Call Recording",
            "Summary": "Bank of Maharashtra has made available the recording of its Q3FY26 earnings conference call held on January 13, 2026, discussing financial performance for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768324517309,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra Q3 profit jumps 26% to ₹1,779 cr",
            "Summary": "Bank of Maharashtra reported 26% YoY profit growth to ₹1,779 crore in Q3, driven by 20% advances growth. The bank declared 10% interim dividend with improved asset quality and NIM at 3.86%.",
            "Sentiment": "positive",
            "PublishDate": 1768309952396,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra Q3 profit jumps 26.5% to ₹1,779 cr",
            "Summary": "Bank of Maharashtra reported strong Q3 FY26 results with net profit rising 26.51% YoY to ₹1,779 crore. NII grew 16.27% to ₹7,344 crore while asset quality improved with gross NPA declining to 1.60%.",
            "Sentiment": "positive",
            "PublishDate": 1768301266724,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra Q3 profit surges 27% to ₹1,779 cr",
            "Summary": "State-owned Bank of Maharashtra reported strong Q3 FY26 results with net profit jumping 27% year-on-year to ₹1,779.30 crore, demonstrating robust financial performance for the Pune-based lender.",
            "Sentiment": "positive",
            "PublishDate": 1768299885974,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra Sets Record Date for Interim Dividend",
            "Summary": "Bank of Maharashtra's Board approves 10% interim dividend of ₹1.00 per share for FY26, with record date set for January 20, 2026. Shareholders holding equity shares on this date will be eligible for the dividend payment.",
            "Sentiment": "positive",
            "PublishDate": 1768297381609,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra Sets Record Date for Interim Dividend",
            "Summary": "Bank of Maharashtra announces interim dividend of ₹1.00 per share for FY26, with record date set for January 20, 2026. Board approves 10% dividend on equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1768297358382,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra Q3FY26 Net Profit Surges 26.51%",
            "Summary": "Bank of Maharashtra reported strong Q3FY26 results with net profit rising 26.51% to ₹1,779 crore. Total business grew 17.24% while asset quality improved with gross NPA declining to 1.60%.",
            "Sentiment": "positive",
            "PublishDate": 1768296423664,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra Q3 profit surges 27% YoY",
            "Summary": "Bank of Maharashtra reported strong quarterly performance with net profit rising over 27% year-on-year in Q3. The public sector bank continues to show positive growth momentum in its financial results.",
            "Sentiment": "positive",
            "PublishDate": 1768296315285,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra Q3FY26 Results Show Strong Growth",
            "Summary": "Bank of Maharashtra reported robust financial performance for Q3FY26 with net profit rising 27% YoY to ₹1,779 crores, driven by strong credit growth and improved asset quality metrics.",
            "Sentiment": "positive",
            "PublishDate": 1768295777108,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra Reports Higher Fresh Slippages",
            "Summary": "Bank of Maharashtra's fresh slippages increased to ₹7.50 billion in the latest quarter, up from ₹7.10 billion in the previous quarter, representing a sequential rise of ₹0.40 billion.",
            "Sentiment": "negative",
            "PublishDate": 1768295407311,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra Q3 FY26 Results: Strong Performance",
            "Summary": "Bank of Maharashtra reports robust Q3 FY26 results with net profit of ₹1,779.33 crores, up 26.5% YoY. NPA ratios improved to 1.60% gross and 0.15% net. Board declares 10% interim dividend.",
            "Sentiment": "positive",
            "PublishDate": 1768295383038,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra Q3: 26.5% profit jump, NPAs fall",
            "Summary": "State-run Bank of Maharashtra reported 26.5% YoY net profit growth to ₹1,779 cr in Q3, with 16% core income rise and improved asset quality as GNPA ratio dropped to 1.60%.",
            "Sentiment": "positive",
            "PublishDate": 1768295118283,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra Q3 FY26 Results: Strong Performance",
            "Summary": "Bank of Maharashtra reports robust Q3 FY26 results with net profit of ₹1,779.33 crores, up 26.55% YoY. NPA ratios improve to 1.60% gross and 0.15% net. Board declares 10% interim dividend.",
            "Sentiment": "positive",
            "PublishDate": 1768294390351,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra Q3 Interest Income Jumps 16.11%",
            "Summary": "Bank of Maharashtra reported strong Q3 performance with interest income rising to ₹73.44 billion from ₹63.25 billion year-on-year, marking a significant 16.11% growth in core earnings.",
            "Sentiment": "positive",
            "PublishDate": 1768294160637,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra Reports Improved Asset Quality in Q3",
            "Summary": "Bank of Maharashtra shows sequential improvement in asset quality with GNPA declining to 1.60% from 1.72% and NNPA reducing to 0.15% from 0.18% quarter-on-quarter in Q3.",
            "Sentiment": "positive",
            "PublishDate": 1768294138171,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra Q3 Net Profit Surges 27.14%",
            "Summary": "Bank of Maharashtra reported a standalone net profit of ₹17.80 billion for Q3, marking a significant 27.14% year-on-year growth from ₹14.00 billion in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1768294116115,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra to Announce Q3 Results on Jan 13",
            "Summary": "Bank of Maharashtra has scheduled the announcement of its third quarter financial results for January 13, marking an important milestone for stakeholders and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1767774766799,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank Of Maharashtra Shares Hit 52-Week High On Q3 Update",
            "Summary": "Bank Of Maharashtra shares surged 3.2% to ₹65.97, hitting 52-week high after reporting 17.24% business growth and strong Q3 performance metrics across deposits and advances.",
            "Sentiment": "positive",
            "PublishDate": 1767585741413,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra Files SEBI Compliance Certificate",
            "Summary": "Bank of Maharashtra submits quarterly compliance certificate to stock exchanges confirming adherence to SEBI depositories regulations for Q3 FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767418682809,
            "Source": "stocks"
        },
        {
            "Title": "Bank of Maharashtra Appoints New Statutory Auditors",
            "Summary": "Bank of Maharashtra has appointed four chartered accountant firms as Statutory Central Auditors for FY2025-26, including two continuing firms and two new appointments following RBI approval.",
            "Sentiment": "neutral",
            "PublishDate": 1766742820991,
            "Source": "stocks"
        },
        {
            "Title": "AkzoNobel India: ICIL Exits with ₹1,296 Crore Block Deal",
            "Summary": "Imperial Chemical Industries Limited sold 40,97,025 shares (9% stake) for ₹1,296.09 crores through NSE block deal, marking complete exit from AkzoNobel India.",
            "Sentiment": "neutral",
            "PublishDate": 1766124084374,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra Pays ₹76.91 Cr Bond Interest",
            "Summary": "Bank of Maharashtra completed annual interest payment of ₹76.91 crores on December 26, 2025, for its Basel III Additional Tier-1 bonds worth ₹880 crores, fulfilling regulatory obligations under SEBI guidelines.",
            "Sentiment": "positive",
            "PublishDate": 1765796525778,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra Pays ₹15.55 Cr Bond Interest",
            "Summary": "Bank of Maharashtra successfully paid annual interest of ₹15.55 crores on its Basel III Tier-II bonds on December 15, 2025, complying with regulatory requirements under SEBI listing obligations.",
            "Sentiment": "neutral",
            "PublishDate": 1765796246012,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of Maharashtra Pays Rs 27.84 Crore Interest on Basel III Tier-II Bonds",
            "Summary": "Bank of Maharashtra paid annual interest of Rs 27.84 crore on its Basel III Compliant Tier-II Bonds (ISIN: INE457A08126) worth Rs 348 crore on December 8, 2025. The payment was made one day after the due date of December 7, 2025, as it was a bank holiday, demonstrating the bank's commitment to meeting its debt obligations.",
            "Sentiment": "positive",
            "PublishDate": 1765188939430,
            "Source": "corporate_action"
        },
        {
            "Title": "Bank of Maharashtra Promoters Disclose Equity Share Sale Transaction",
            "Summary": "Bank of Maharashtra has disclosed to BSE and NSE that its promoters have sold equity shares of the bank, as required under SEBI insider trading regulations. The bank submitted the mandatory disclosure in Form C to stock exchanges regarding the promoter share sale transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1764942780445,
            "Source": "corporate_action"
        },
        {
            "Title": "Bank Of Maharashtra Sets Floor Price At Rs 54 Per Share For Offer",
            "Summary": "Bank Of Maharashtra has established a floor price of Rs 54 per equity share for an upcoming offer. The pricing decision affects potential investors and shareholders participating in the bank's equity offering.",
            "Sentiment": "neutral",
            "PublishDate": 1764594715598,
            "Source": "corporate_action"
        },
        {
            "Title": "S&P Global Reaffirms BBB/A-2 Credit Rating for Bank of Maharashtra",
            "Summary": "S&P Global Ratings reaffirmed Bank of Maharashtra's BBB long-term and A-2 short-term issuer credit rating with stable outlook, citing strong capitalization and government support despite higher risk appetite. The rating reflects the bank's solid deposit base, expected return on assets of 1.5% and risk-adjusted capital ratio strengthening to 10.5%-11.0% over two years, though credit losses remain above industry average at 1.0%.",
            "Sentiment": "positive",
            "PublishDate": 1764252650774,
            "Source": "corporate_action"
        },
        {
            "Title": "Government Considers Privatization of Bank Of Maharashtra",
            "Summary": "The government is considering privatizing Bank Of Maharashtra, according to CNBC reports. This potential move would affect the public sector bank's ownership structure and could impact shareholders, employees, and the banking sector's competitive landscape.",
            "Sentiment": "neutral",
            "PublishDate": 1763545894540,
            "Source": "stock"
        },
        {
            "Title": "Bank of Maharashtra Gets CRISIL A1 Rating Reaffirmed for Rs 20,000 Crore Certificate of Deposits",
            "Summary": "CRISIL Ratings Limited has reaffirmed its CRISIL A1 rating on Bank of Maharashtra's Rs 20,000 crore Certificate of Deposits program. The rating reflects expected strong government support as a public sector bank, comfortable resource profile with 50.4% CASA deposits, and sustained improvement in asset quality with gross NPAs declining to 1.72%. The bank reported net profit of Rs 3,226 crore in the first half with improved return on assets at 1.74%. Key strengths include government backing, stable deposit base, and improving profitability metrics. Weaknesses cited are moderate scale of operations with Rs 2,54,118 crore gross advances and high regional concentration with 71.6% deposits and 51.7% advances in Maharashtra. The bank maintains strong liquidity with 118.12% liquidity coverage ratio and tier 1 capital ratio of 15.0%.",
            "Sentiment": "positive",
            "PublishDate": 1762446328846,
            "Source": "corporate_action"
        },
        {
            "Title": "Bank of Maharashtra Reduces MCLR Rates Across Multiple Tenors",
            "Summary": "Bank of Maharashtra has revised its Marginal Cost of Funds Based Lending Rate (MCLR) effective October 31, 2025. The bank reduced rates across several tenors, with the overnight rate decreasing from 8.20% to 7.95% and the one-month rate dropping from 8.40% to 8.30%. The three-month rate was cut to 8.55%, while six-month and one-year rates remained unchanged at 8.70% and 8.85% respectively. The rate revision was communicated to BSE and NSE stock exchanges by Company Secretary Vishal Sethia.",
            "Sentiment": "positive",
            "PublishDate": 1761858103498,
            "Source": "stock"
        },
        {
            "Title": "Bank Of Maharashtra Projects Over 20% Credit Growth Through Digital Lending and Retail Focus",
            "Summary": "Bank Of Maharashtra projects credit growth exceeding 20% driven by digital lending initiatives and strong momentum in retail, agriculture, and MSME segments. The bank is focusing on maintaining stable net interest margins, keeping gross non-performing assets low, and implementing technology-led efficiency measures to improve its return on equity trajectory through FY26.",
            "Sentiment": "positive",
            "PublishDate": 1761754782940,
            "Source": "stock"
        },
        {
            "Title": "Bank of Maharashtra Staff Seeks FM Clarification on SBI Merger Reports",
            "Summary": "The Bank of Maharashtra employees & officers federation has written to Finance Minister Nirmala Sitharaman regarding media reports suggesting a possible merger with State Bank of India. The reports, citing unnamed government sources, have created uncertainty among employees, customers, and investors. The federation emphasized the bank's outstanding performance in operational efficiency, credit growth, and financial inclusion, along with its vital role in Maharashtra's socio-economic fabric. They requested an official clarification refuting the merger reports to restore stakeholder confidence and allow the bank to continue its independent growth journey.",
            "Sentiment": "negative",
            "PublishDate": 1760718600098,
            "Source": "stock"
        },
        {
            "Title": "Bank of Maharashtra Reports 23% Jump in Net Profit, Announces Aggressive Branch Expansion Plan",
            "Summary": "Bank of Maharashtra reported strong quarterly results with net profit increasing 23% to Rs. 1,633 crore and operating profit growing 17% to Rs. 2,500 crore. Total business grew 14% to Rs. 5.63 lakh crore, with deposits up 12.13% and advances rising 17%. Asset quality improved significantly with gross NPAs declining to 1.72% and net NPAs to 0.18%. The bank maintained healthy metrics including NIM at 3.85%, ROA at 1.82%, and capital adequacy at 18.13%. The bank received a BBB- rating from S&P Global and launched its GIFT IBU operations with $100 million business. Management announced Project 321 to open 321 branches in 18 months as part of a five-year plan to add 1,000 branches, focusing on expansion outside Maharashtra. The bank has Board approval for Rs. 7,500 crore fundraising, including Rs. 5,000 crore equity, planned within the current fiscal year. FII holding increased from 0.39% in 2023 to 2.58% in September 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760717278729,
            "Source": "earnings"
        },
        {
            "Title": "Bank of Maharashtra Shares Rise 4% on Strong Q2 Results with 23% Profit Growth",
            "Summary": "Bank of Maharashtra shares gained 4.3% to Rs 57.40 after reporting a 23% year-on-year increase in net profit to Rs 1,633 crore for the September quarter. Net Interest Income grew 15.71% to Rs 3,248 crore, while operating profit increased 16.91% to Rs 2,574 crore. The bank's asset quality improved with gross NPAs declining to 1.72% from 1.84% and net NPAs reducing to 0.18% from 0.20%. Return on Assets improved to 1.82% and Return on Equity stood at 22.58%. Total business grew 14.20% to Rs 5,63,909 crore with total deposits increasing 12.13% to Rs 3,09,791 crore. For the half-year period, net profit rose to Rs 3,226 crore from Rs 2,620 crore, with the cost-to-income ratio improving to 37.34%. The stock has gained 24% over the last six months.",
            "Sentiment": "positive",
            "PublishDate": 1760505141477,
            "Source": "earnings"
        },
        {
            "Title": "Bank Of Maharashtra Sets Financial Targets Including 60-40 RAM Portfolio Ratio and 3.75% NIM",
            "Summary": "Bank Of Maharashtra outlined several financial targets during a conference call. The bank aims to maintain a RAM (Retail, Agriculture, and MSME) portfolio ratio of 60-40 with a flexibility of ±2%. The bank targets keeping credit costs under 1% and maintaining capital adequacy around 18%. Additionally, the bank aims for a CASA (Current Account Savings Account) ratio over 50% and expects Net Interest Margin (NIM) to reach 3.75%.",
            "Sentiment": "positive",
            "PublishDate": 1760499272192,
            "Source": "stock"
        },
        {
            "Title": "Bank of Maharashtra Reports Quarterly Results with Board Approval Despite Governance Challenges",
            "Summary": "Bank of Maharashtra's Board approved unaudited financial results for the quarter and half year ended September 30, 2025. Due to insufficient independent directors, the bank invoked Para 14A of Nationalised Banks Scheme, 1970 to place results directly before the Board without Audit Committee quorum. The bank continues holding COVID-19 related provisions of Rs. 1,200 crores as contingency. Results show net profit of Rs. 3,226 crores for the half year compared to Rs. 2,620 crores in the previous year. Gross NPAs stood at Rs. 4,185 crores with net NPAs at Rs. 432 crores. The bank maintains a provision coverage ratio of 98.34%. During the half year, 178 fraud cases were reported involving Rs. 155.08 crores with Rs. 133.73 crores loss, for which 100% provision was maintained.",
            "Sentiment": "neutral",
            "PublishDate": 1760435837290,
            "Source": "earnings"
        },
        {
            "Title": "Bank of Maharashtra Reports 23% Jump in Q2 Net Profit to 16.3 Billion Rupees",
            "Summary": "Bank of Maharashtra reported net profit of 16.3 billion rupees in Q2, up from 13.3 billion rupees year-over-year. Interest earned increased to 71.3 billion rupees from 60.2 billion rupees compared to the same period last year. The bank's asset quality showed marginal improvement with gross non-performing assets declining to 1.72% from 1.74% quarter-over-quarter, while net non-performing assets remained stable at 0.18%. Provisions for non-performing assets decreased to 5.83 billion rupees from 7.2 billion rupees on a quarterly basis.",
            "Sentiment": "positive",
            "PublishDate": 1760434301818,
            "Source": "earnings"
        },
        {
            "Title": "Bank of Maharashtra Reports Quarterly Results with Board Approval Despite Governance Challenges",
            "Summary": "Bank of Maharashtra's Board approved unaudited financial results for the quarter and half year ended September 30, 2025. Due to insufficient independent directors, the bank invoked provisions of the Nationalised Banks Scheme to place results directly before the Board without Audit Committee quorum. The bank continues to hold COVID-19 related provisions of Rs. 1,200 crores as contingency. Auditors issued an unmodified opinion on the limited review. The meeting also covered utilization of issue proceeds and security cover certificates, with results made available on the bank's website.",
            "Sentiment": "neutral",
            "PublishDate": 1760434282807,
            "Source": "earnings"
        },
        {
            "Title": "Bank of Maharashtra Stock Declines 1.7% Ahead of Q2 Earnings Release",
            "Summary": "Bank of Maharashtra shares fell 1.7% to ₹56.59 ahead of its quarterly earnings announcement. The bank reported strong business metrics for the September quarter, with total deposits rising 12.1% to ₹3.09 lakh crore and global business growing 14.2% to ₹5.63 lakh crore year-over-year. CASA deposits increased 14.55% to ₹1.55 lakh crore, pushing the CASA ratio to 50.35% from 49.29% in the previous year. Global advances grew 16.87% to ₹2.54 lakh crore. Investors will focus on asset quality, margin profile, and core income growth when the bank releases its full results. Despite the day's decline, the stock has gained 23.8% over the past six months.",
            "Sentiment": "neutral",
            "PublishDate": 1760420712922,
            "Source": "earnings"
        }
    ]
}