{
    "Symbol": "MAHAPEXLTD",
    "ISIN": "INE843B01013",
    "News": [
        {
            "Title": "Maharashtra Apex Corp Announces ₹15 Cr Rights Issue",
            "Summary": "Maharashtra Apex Corporation's board approved a rights issue to raise up to ₹15 crores through equity shares of ₹10 face value. The company also constituted a rights issue committee and appointed bankers.",
            "Sentiment": "positive",
            "PublishDate": 1766052135409,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maharashtra Apex Corp Clarifies Price Movement",
            "Summary": "Maharashtra Apex Corporation responds to BSE inquiry about recent share price movement, stating it's purely market-driven with no company-specific factors involved.",
            "Sentiment": "neutral",
            "PublishDate": 1765962389941,
            "Source": "stocks"
        },
        {
            "Title": "Maharashtra Apex Corporation Reports Quarterly Results with Auditor Qualifications on Interest Provisions",
            "Summary": "Maharashtra Apex Corporation Limited announced unaudited financial results for the quarter and half year ended September 30, 2025, with auditors qualifying their opinion due to unprovided delayed interest costs of Rs. 12.21 lakhs (quarterly) and Rs. 23.95 lakhs (half-yearly), with cumulative unpaid interest of Rs. 357.71 lakhs since October 2019. The company continues to face regulatory challenges including cancelled RBI registration as NBFC and outstanding public deposits of Rs. 1,367.81 lakhs despite depositing Rs. 1,395.75 lakhs with Karnataka High Court during 2023-24.",
            "Sentiment": "negative",
            "PublishDate": 1763114723789,
            "Source": "earnings"
        },
        {
            "Title": "Maha Rashtra Apex Corporation Approves Quarterly Results and Key Board Changes",
            "Summary": "Maha Rashtra Apex Corporation Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported a standalone profit of Rs. 597.18 lakhs compared to a loss of Rs. 11.05 lakhs in the same quarter last year. Consolidated profit after tax was Rs. 2240.34 lakhs versus Rs. 26.39 lakhs in the previous year. The Board re-appointed Ms. Nita J. Desai as Internal Auditor for FY 2025-26 and appointed Mr. Nagarajan Sivaramakrishnan as Non-Executive Independent Director, subject to shareholder approval. The company also approved shifting its corporate office from Syndicate House, Manipal to new premises at Chitrakala, Manipal. The auditors issued a qualified opinion noting the company has not provided for delayed period interest cost on deposits amounting to Rs. 11.75 lakhs for the quarter, with cumulative unprovided interest of Rs. 345.50 lakhs from October 2019 to June 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755081388028,
            "Source": "earnings"
        }
    ]
}