{
    "Symbol": "MAHEPC",
    "ISIN": "INE215D01010",
    "News": [
        {
            "Title": "Mahindra EPC Irrigation Q3FY26 Results Announced",
            "Summary": "Mahindra EPC Irrigation reported Q3FY26 net profit of ₹6.49 crores vs ₹6.35 crores YoY. Revenue grew 14.74% to ₹93.47 crores. Board also reappointed K N Vaidyanathan as Internal Auditor.",
            "Sentiment": "positive",
            "PublishDate": 1767020946341,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahindra EPC Irrigation Reports 17% Revenue Growth Despite Monsoon Challenges in H1 FY26",
            "Summary": "Mahindra EPC Irrigation achieved 17% revenue growth to Rs. 111.6 crores in H1 FY26 and turned profitable with Rs. 1.9 crores PBT versus Rs. 7.3 crores loss in H1 FY25, despite industry headwinds from excessive rainfall impacting micro-irrigation demand and installation. The company diversified its revenue mix with 37.8% contribution from non-subsidy business including irrigation projects, up from 3% in FY20, while maintaining focus on key opportunity states and improved commercial discipline.",
            "Sentiment": "positive",
            "PublishDate": 1764076544388,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra EPC Irrigation Wins Rs 1.79 Crore Contract for Micro Irrigation Systems",
            "Summary": "Mahindra EPC Irrigation Limited has been awarded a contract worth Rs 1.79 crores for construction of pressurized micro irrigation systems under Community Micro Irrigation Systems projects. The domestic contract has a twelve-month execution period and was received by the company on November 17, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763379061057,
            "Source": "order&deals"
        },
        {
            "Title": "Mahindra EPC Irrigation Secures ₹19.21 Crore Community Micro Irrigation Contract",
            "Summary": "Mahindra EPC Irrigation has secured a ₹19.21 crore contract for a community micro irrigation project. The project is scheduled to be completed within one year.",
            "Sentiment": "positive",
            "PublishDate": 1762773002455,
            "Source": "stock"
        },
        {
            "Title": "Mahindra EPC Irrigation Wins Rs 4.21 Crore Contract for Community Micro Irrigation Systems",
            "Summary": "Mahindra EPC Irrigation Limited has been awarded a contract worth Rs 4.21 crore for allied projects under Community Micro Irrigation Systems. The contract was awarded by the Office of the Assistant Engineer, Community Micro Irrigation Project, and involves allied activities required for implementation of Community Micro Irrigation Project. The domestic contract has a time period of six months. The company received the orders on November 4, 2025 at around 2:30 p.m.",
            "Sentiment": "positive",
            "PublishDate": 1762269581408,
            "Source": "order&deals"
        },
        {
            "Title": "Mahindra EPC Irrigation Corrects Financial Results Filing Due to Typographical Error",
            "Summary": "Mahindra EPC Irrigation Limited submitted revised unaudited consolidated financial results for the period ended September 30, 2025, correcting a typographical error in the column heading. The company's board approved the original results on October 17, 2025, but discovered that a column labeled 'Nine Months Ended' should have read 'Six Months Ended.' The company operates in precision farming products and services with a single operating segment. The statutory auditors BSR & Co. LLP provided an unmodified review conclusion on both standalone and consolidated financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1761290886146,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra EPC Irrigation Limited Announces Quarterly Financial Results for September 2025",
            "Summary": "Mahindra EPC Irrigation Limited announced its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The Board of Directors approved these results during a meeting held on October 17, 2025, which commenced at 3:15 p.m. and concluded at 4:30 p.m. The company has submitted the financial results along with limited review reports to stock exchanges NSE (symbol: MAHEPC) and BSE (scrip code: 523754). The consolidated results include the company's share of net loss after tax and total comprehensive loss from its joint venture, Mahindra Top Greenhouses Private Limited. The financial results and review reports have been uploaded on the company's website and prepared in accordance with Indian Accounting Standard 34.",
            "Sentiment": "neutral",
            "PublishDate": 1760700997389,
            "Source": "earnings"
        },
        {
            "Title": "Government Proposes GST Exemption on Essential Farm Equipment Including Irrigation and Sprinklers",
            "Summary": "The Central Government has suggested removing GST on essential farm equipment, specifically irrigation systems and sprinklers. This proposal could impact companies like Mahindra EPC that operate in the agricultural equipment sector.",
            "Sentiment": "positive",
            "PublishDate": 1755599412019,
            "Source": "sectoral"
        },
        {
            "Title": "Mahindra EPC Irrigation Seeks Shareholder Approval for Rajeev Goyal's Board Appointment",
            "Summary": "Mahindra EPC Irrigation Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Rajeev Goyal (DIN: 03139184) as a Non-Executive Non-Independent Director. The Board appointed Goyal as an Additional Director on July 19, 2025, based on the Nomination and Remuneration Committee's recommendation. The e-voting period runs from July 29 to August 28, 2025, with voting rights determined as of July 25, 2025. Goyal, a 59-year-old Chartered Accountant, serves as CFO of Mahindra Group's Auto & Farm Sectors with consolidated global revenue of Rs. 92,000 crores. He brings 35+ years of experience across diverse industries and has held various strategic positions at Mahindra & Mahindra for 19 years. The company has engaged KFIN Technologies Limited to provide remote e-voting facility, and Ms. Sujata Rajebahadur has been appointed as Scrutinizer for the postal ballot process. Results will be announced on or before August 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753712470607,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mahindra EPC Irrigation Reports Q1 Financial Results",
            "Summary": "Mahindra EPC Irrigation has released its Q1 financial results. The company's revenue increased to 620 million rupees from 453 million rupees year-over-year. EBITDA improved to a gain of 27 million rupees compared to a loss of 23 million rupees in the same period last year. The EBITDA margin was reported at 4.42%. The company's net profit for Q1 was 10 million rupees, a turnaround from a loss of 26 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1752828004000,
            "Source": "default"
        },
        {
            "Title": "Mahindra EPC Irrigation Secures ₹43.2 Million Contract",
            "Summary": "Mahindra EPC Irrigation has been awarded a contract worth ₹43.2 million for micro irrigation systems. The news highlights the company's success in securing a significant order in the agricultural technology sector.",
            "Sentiment": "positive",
            "PublishDate": 1749216285000,
            "Source": "default"
        },
        {
            "Title": "Mahindra EPC Irrigation Reports Significant Profit and Revenue Growth in Q4",
            "Summary": "Mahindra EPC Irrigation has reported a substantial increase in both net profit and revenue for the fourth quarter. The company's net profit rose to 63 million rupees, up from 15 million rupees year-over-year and 64 million rupees quarter-over-quarter. Revenue also saw a significant increase, reaching 959 million rupees compared to 712 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1745194904000,
            "Source": "default"
        },
        {
            "Title": "Mahindra EPC Irrigation Reports Strong Q4 FY2023 Results",
            "Summary": "Mahindra EPC Irrigation has reported a significant increase in both net profit and revenue for the fourth quarter of fiscal year 2023. The company's net profit rose to 63 million rupees, up from 15 million rupees year-over-year and 64 million rupees quarter-over-quarter. Revenue also saw substantial growth, reaching 959 million rupees compared to 712 million rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1744900732000,
            "Source": "result"
        },
        {
            "Title": "Mahindra EPC Irrigation Secures Order Worth ₹13.12 Crore",
            "Summary": "Mahindra EPC Irrigation has announced that it has won a new order valued at ₹13.12 crore. This order represents a significant business development for the company, potentially boosting its revenue and market position in the irrigation sector.",
            "Sentiment": "positive",
            "PublishDate": 1743068983000,
            "Source": "order&deals"
        },
        {
            "Title": "Mahindra EPC Irrigation to Consider Q4 Results on April 17",
            "Summary": "Mahindra EPC Irrigation Limited has announced that it will consider and approve its financial results for the fourth quarter on April 17. This is a routine quarterly financial reporting event for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1742999609000,
            "Source": "result"
        },
        {
            "Title": "Mahindra EPC Irrigation Secures Micro Irrigation Systems Contracts",
            "Summary": "Mahindra EPC Irrigation has been awarded contracts for micro irrigation systems. The total value of these contracts amounts to 117.9 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1740573956000,
            "Source": "order&deals"
        },
        {
            "Title": "Mahindra EPC Secures Contract Worth 111.1 Million Rupees",
            "Summary": "Mahindra EPC Irrigation Limited has been awarded a contract valued at 111.1 million rupees. The news briefly states the company's acquisition of this significant business deal.",
            "Sentiment": "positive",
            "PublishDate": 1740355757000,
            "Source": "order&deals"
        },
        {
            "Title": "Mahindra EPC Secures 111.1 Million Rupee Contract",
            "Summary": "Mahindra EPC Irrigation Limited has been awarded a contract worth 111.1 million rupees. The company, which specializes in micro-irrigation systems and agricultural equipment, has secured this significant order, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1740143090000,
            "Source": "order&deals"
        },
        {
            "Title": "Mahindra EPC Awarded Micro Irrigation Systems Contracts",
            "Summary": "Mahindra EPC has been awarded contracts to supply micro irrigation systems for approximately 97 hectares. This development indicates the company's continued involvement in agricultural technology and water management solutions.",
            "Sentiment": "positive",
            "PublishDate": 1739233165000,
            "Source": "order&deals"
        },
        {
            "Title": "Mahindra EPC Secures Micro Irrigation System Contracts",
            "Summary": "Mahindra EPC has been awarded contracts to supply micro irrigation systems for approximately 97 hectares. This development indicates the company's continued involvement in agricultural technology and water management solutions.",
            "Sentiment": "positive",
            "PublishDate": 1739194402000,
            "Source": "order&deals"
        },
        {
            "Title": "Mahindra EPC Secures 1.73 Billion Rupee Contract for Micro Irrigation Systems",
            "Summary": "Mahindra EPC Irrigation Limited has been awarded a significant contract valued at 1.73 billion rupees (approximately $21 million USD) for the supply of micro irrigation systems. This deal represents a major business opportunity for the company in the agricultural technology sector.",
            "Sentiment": "positive",
            "PublishDate": 1738197170000,
            "Source": "order&deals"
        },
        {
            "Title": "Mahindra EPC Secures 1.73 Billion Rupee Contract for Micro Irrigation Systems",
            "Summary": "Mahindra EPC has been awarded a contract valued at 1.73 billion rupees for the supply of micro irrigation systems. This significant order highlights the company's strong position in the agricultural technology sector and suggests potential growth in their irrigation business.",
            "Sentiment": "positive",
            "PublishDate": 1738149499000,
            "Source": "order&deals"
        }
    ]
}