{
    "Symbol": "MAHLIFE",
    "ISIN": "INE813A01018",
    "News": [
        {
            "Title": "Mahindra Lifespaces Board Approves Major Restructuring",
            "Summary": "Board approves transfer of Alembic Undertaking to subsidiary MBLDSL and joint venture with Mitsui Fudosan for residential project development in Bengaluru.",
            "Sentiment": "positive",
            "PublishDate": 1770641158260,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahindra Lifespaces Q3 FY26 Results Show Strong Recovery",
            "Summary": "Mahindra Lifespaces reported consolidated net profit of ₹108.88 crores in Q3 FY26, marking a significant turnaround from ₹22.47 crores loss in Q3 FY25, with total income rising to ₹469.08 crores.",
            "Sentiment": "positive",
            "PublishDate": 1770132777424,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahindra Lifespaces Gets IND A1+ Rating",
            "Summary": "Mahindra Lifespace Developers receives IND A1+ credit rating from India Ratings for Commercial Paper instruments worth INR 3,500 million, reflecting strong short-term creditworthiness.",
            "Sentiment": "positive",
            "PublishDate": 1769681944889,
            "Source": "stocks"
        },
        {
            "Title": "Mahindra Lifespace Q3 FY26 Earnings Call on Feb 2",
            "Summary": "Mahindra Lifespace Developers announces earnings conference call for Q3 FY26 results scheduled for February 2, 2026 at 5:00 PM IST via video conferencing with pre-registration required.",
            "Sentiment": "neutral",
            "PublishDate": 1769584350727,
            "Source": "stocks"
        },
        {
            "Title": "Mahindra & Mahindra Gains Step-Down Subsidiary",
            "Summary": "Mahindra & Mahindra Limited received intimation from its listed subsidiary Mahindra Lifespace Developers about incorporation of Mahindra Blossom Developers Limited, making it a step-down subsidiary of M&M.",
            "Sentiment": "positive",
            "PublishDate": 1767349966369,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahindra Lifespaces Gets ESG Rating of 72",
            "Summary": "Mahindra Lifespaces Developers receives an ESG rating of 72 from SES ESG Research Private Limited based on FY 2024-25 data. The rating was assigned independently without company engagement.",
            "Sentiment": "positive",
            "PublishDate": 1766771592818,
            "Source": "stocks"
        },
        {
            "Title": "Mahindra Lifespaces Launches ₹1,900 Cr Blossom Project",
            "Summary": "Mahindra Lifespaces launches premium Mahindra Blossom residential project in Whitefield, Bengaluru with potential GDV of ₹1,900 crores. Net Zero Waste certified development offers 2-4 BHK homes.",
            "Sentiment": "positive",
            "PublishDate": 1765991577715,
            "Source": "stocks"
        },
        {
            "Title": "Mahindra Lifespace Secures ₹1,010 Crore Redevelopment Project in Matunga",
            "Summary": "Mahindra Lifespace has secured a redevelopment project in Matunga valued at ₹1,010 crore. This project acquisition represents a significant business development for the real estate company's portfolio expansion.",
            "Sentiment": "positive",
            "PublishDate": 1764731590566,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Lifespace Completes Acquisition of Actis Stake in Mahindra Homes",
            "Summary": "Mahindra Lifespace Developers has completed the acquisition of Actis Mahi Holdings Singapore's entire stake in subsidiary Mahindra Homes Private Limited for Rs. 86.40 crores, following shareholder approval through postal ballot. The transaction converts Mahindra Homes from a 74.35:25.65 joint venture into a wholly owned subsidiary, consolidating control of the real estate company that operates residential projects in Bengaluru and Gurgaon.",
            "Sentiment": "positive",
            "PublishDate": 1764681019382,
            "Source": "order&deals"
        },
        {
            "Title": "Mahindra Lifespaces Receives Favorable Court Order Dismissing Litigation Against Subsidiary",
            "Summary": "Mahindra Lifespaces Developers received a favorable order dated September 9, 2025, dismissing litigation filed by Mr. Sanjay Chhabra against its subsidiary Mahindra World City (Jaipur) Limited at Metropolitan Magistrate Court, Jaipur. The dismissal resolves the legal matter that was originally disclosed in August 2023, providing closure to the pending litigation for the real estate developer and its subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1764679540510,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Lifespace to Acquire Actis' Complete Stake in Mahindra Homes",
            "Summary": "Mahindra Lifespace has announced its decision to purchase Actis' entire stake in Mahindra Homes through a share purchase agreement. Following the completion of this acquisition, Mahindra Homes Private Limited (MHPL) will become a subsidiary unit of Mahindra Lifespace.",
            "Sentiment": "positive",
            "PublishDate": 1764403891059,
            "Source": "order&deals"
        },
        {
            "Title": "Mahindra Lifespace Developers Faces Rs 32.96 Crore Arbitration Claim from Parekh Brothers",
            "Summary": "Mahindra Lifespace Developers received a Statement of Claim for Rs 32.96 crores from Parekh Brothers in an arbitration process, with Rs 22.22 crores claimed as delay compensation for sold and unsold flats. The company plans to contest the claim and file counter-claims, stating it does not expect any material financial impact on operations.",
            "Sentiment": "negative",
            "PublishDate": 1764244982751,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Lifespace's Subsidiary Appeals Rs. 6.17 Crore Tax Order at Madras High Court",
            "Summary": "Mahindra World City Developers Limited, a subsidiary of Mahindra Lifespace Developers, has successfully appealed to the Madras High Court against an Income Tax Appellate Tribunal order disallowing SEZ tax deductions for assessment years 2012-13 to 2014-15. The tax authorities have issued an order for Rs. 6.17 crores under Section 250 of the Income Tax Act, though the parent company expects no material financial impact on operations.",
            "Sentiment": "neutral",
            "PublishDate": 1763134988723,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Lifespace Developers Receives Credit Rating Updates from India Ratings",
            "Summary": "Mahindra Lifespace Developers Limited received credit rating updates from India Ratings and Research Pvt. Ltd. The company's bank loan facilities of INR 2,250 million (reduced from INR 7,500 million) received an affirmed rating of IND AA/Stable/IND A1+. Commercial paper facilities worth INR 2,500 million for 90 days also received an affirmed IND A1+ rating. Additionally, proposed commercial paper worth INR 1,000 million was assigned an IND A1+ rating. The credit rating was communicated to the company on November 10, 2025 at 12:18 pm.",
            "Sentiment": "neutral",
            "PublishDate": 1762778400129,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Lifespace Developers Approves Material Related Party Transaction Through Postal Ballot",
            "Summary": "Mahindra Lifespace Developers Limited shareholders approved a material related party transaction for the acquisition of stake held by Actis Mahi Holdings (Singapore) Private Limited in Mahindra Homes Private Limited, a subsidiary of the company. The resolution was passed through postal ballot via remote e-voting with requisite majority on November 5, 2025. The remote e-voting period concluded on November 5, 2025 at 5:00 p.m. IST. Out of the votes cast, 61,960,464 votes (93.44%) were in favor of the resolution while 350,385 votes (0.56%) were against it. The scrutinizer Martinho Ferrao submitted the voting results report to the company following the conclusion of the voting period.",
            "Sentiment": "positive",
            "PublishDate": 1762350995404,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra Lifespace Plans Rs 7,000 Crore Project Launches in H2 FY26",
            "Summary": "Mahindra Lifespace plans to introduce projects worth approximately Rs 7,000 crore in the second half of FY26, though the company may stagger these releases. The company has outlined a long-term growth strategy spanning FY25 to FY30, which focuses on reducing dependence on new launches over time. For FY27, Mahindra Lifespace expects pre-sales to reach between Rs 4,500-5,000 crore and aims to achieve annual industrial business earnings of Rs 400-500 crore.",
            "Sentiment": "positive",
            "PublishDate": 1762226707822,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Lifespace Developers Wins Legal Case as Court Dismisses Litigation Against Subsidiary",
            "Summary": "Mahindra Lifespace Developers Limited received a favorable court order dismissing litigation filed by Mr. Sanjay Chhabra against its subsidiary Mahindra World City (Jaipur) Limited and others at Metropolitan Magistrate Court, Jaipur. The company received the dismissal order dated September 9, 2025 on November 3, 2025. The company had previously informed stock exchanges about this litigation in August 2023. The matter has now been concluded with the court's dismissal.",
            "Sentiment": "positive",
            "PublishDate": 1762206707316,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Lifespace Developers Reports Proper Utilization of Rs 1,496.28 Crore Rights Issue Proceeds",
            "Summary": "Mahindra Lifespace Developers Limited submitted its monitoring agency report for the quarter ended September 30, 2025, regarding the utilization of funds raised through its rights issue. The company raised Rs 1,496.28 crore through the rights issue conducted from June 6-17, 2025. CARE Ratings Limited, serving as the monitoring agency, reported no deviation from the stated objectives. The funds were utilized for three main purposes: Rs 1,005 crore for repayment of borrowings (fully completed by July 2025), Rs 481.28 crore for funding acquisitions of future real estate projects and general corporate purposes (ongoing), and Rs 10 crore for issue-related expenses. During the quarter, Rs 246.94 crore was utilized, with Rs 26.70 crore remaining unutilized and kept in fixed deposits. The monitoring agency confirmed that proceeds were appropriately used according to the offer document objectives.",
            "Sentiment": "positive",
            "PublishDate": 1761930701214,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra Lifespaces Reports Strong H1 Performance with Rs 99 Crore PAT and Announces CFO Transition",
            "Summary": "Mahindra Lifespaces Developers Limited announced its financial results for the quarter ended September 30, 2025, reporting consolidated PAT of Rs 99 crore in H1 FY26 compared to a loss of Rs 1 crore in H1 FY25. The company achieved consolidated sales of Rs 1,419 crore from residential and industrial clusters business, with gross development value additions of Rs 5,200 crore in H1 FY26 versus Rs 2,050 crore in H1 FY25. Residential pre-sales reached Rs 1,200 crore with saleable area of 1.75 million sq ft. The company maintains a net debt to equity ratio of -0.17, indicating cash surplus position. Additionally, the Board approved the resignation of Avinash Bapat as CFO effective October 31, 2025, due to his transition to a new role within Mahindra Group, and appointed Sriram Kumar as the new CFO effective November 1, 2025. The company also allotted 36,055 new equity shares under ESOS-2012 scheme and completed a rights issue of 5,81,63,456 equity shares at Rs 257 per share, aggregating Rs 1,49,480 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1761926249467,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mahindra Lifespaces Appoints New CFO and Company Secretary",
            "Summary": "Mahindra Lifespaces Developers Limited announced key leadership changes effective November 1, 2025. Avinash Bapat resigned as Chief Financial Officer to transition to a new role within Mahindra Group as Group FP&A Leader at Mahindra and Mahindra Limited. Sriram Kumar, Vice President of Financial Planning Analysis, Costing and Investor Relations, was appointed as the new CFO. Kumar brings over 16 years of experience in Private Equity and M&A, having previously worked with Goldman Sachs Asset Management and joined Mahindra Group in March 2022. Additionally, Bijal Parmar was reappointed as Company Secretary and Compliance Officer after returning from maternity leave, replacing interim appointee Snehal Patil who served from April 25 to August 31, 2025. Both new appointees will serve as authorized officials for determining materiality and making disclosures to stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1761924317870,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mahindra Lifespace Developers Reports Strong Q2 Turnaround with 479M Rupees Net Profit",
            "Summary": "Mahindra Lifespace Developers posted a consolidated net profit of 479 million rupees in Q2, marking a significant turnaround from a loss of 140 million rupees in the same quarter last year. The company's revenue more than doubled to 176 million rupees compared to 76 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761919170596,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Lifespace Developers Receives IND A1 Credit Rating for Commercial Paper Program",
            "Summary": "Mahindra Lifespace Developers Limited received a credit rating of IND A1 from India Ratings and Research Pvt. Ltd. for its proposed commercial paper program worth INR 2,500 million. The credit rating was communicated to the company on October 30, 2025 at 1:26 pm. The company has disclosed this information in compliance with SEBI listing regulations.",
            "Sentiment": "positive",
            "PublishDate": 1761853251718,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra Lifespace Developers Schedules Q2 FY26 Earnings Conference Call",
            "Summary": "Mahindra Lifespace Developers Limited has announced an earnings conference call scheduled for November 3, 2025, at 11:00 AM IST. The call will be conducted via video conferencing from Mumbai, with pre-registration mandatory through a live webcast link. The session will be accessible on tablets, mobile devices, or PCs across Mac/iOS, Windows, and Android platforms through YouTube. Participants can post questions to senior management during the live webcast. The company stated that no unpublished price sensitive information will be shared during the meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1761658539280,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Lifespace Developers Acquires 13.46 Acres in Pune for INR 3,500 Crore Development Potential",
            "Summary": "Mahindra Lifespace Developers Limited acquired 13.46 acres of land in Nande-Mahalunge, Pune on October 10, 2025. The land has an estimated development potential of INR 3,500 crore. The acquisition was completed at 5:57 pm and involves a third-party seller with no related party transactions. According to Chief Business Officer Vimalendra Singh, the Mahalunge-Nande-Maan area represents one of Pune's most promising micro-markets with strong absorption in recent years. The site offers strategic connectivity through the proposed PMRDA Town Planning Scheme and upcoming Inner Ring Road, with proximity to Hinjewadi IT hub. The location provides access to educational institutions including Delhi Public School, Mahindra International School, and Symbiosis Center for Management, and is equidistant from Baner-Balewadi and Hinjewadi micro markets.",
            "Sentiment": "positive",
            "PublishDate": 1760116543452,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Lifespace Developers Wins Rs 800 Crore Redevelopment Project in Mumbai",
            "Summary": "Mahindra Lifespace Developers Limited has been selected as the preferred partner for redeveloping four residential societies in Malad (West), Mumbai. The project spans approximately 1.65 acres and offers an estimated development potential of Rs 800 crore. The site is located 2.6 km from the Western Express Highway, less than 1 km from Malad West Metro Station, and around 1.5 km from Malad Railway Station. The project is situated close to Mahindra Lifespaces' ongoing redevelopment project, Mahindra Codename64, strengthening the company's presence in the micro-market. The location provides proximity to business hubs including Mindspace, Malad and Bandra Kurla Complex.",
            "Sentiment": "positive",
            "PublishDate": 1760098949555,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Lifespace Board Approves Acquisition of Mahindra Homes for Up to ₹90 Crore",
            "Summary": "Mahindra Lifespace Developers' board has approved the complete acquisition of Mahindra Homes Private Limited from Actis Mahi Holdings. The transaction will make Mahindra Homes Private Limited a fully owned subsidiary of Mahindra Lifespace Developers. The acquisition cost will not exceed ₹90 crore and remains subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1758181848894,
            "Source": "order&deals"
        },
        {
            "Title": "Mahindra Lifespace Developers Wins Mumbai Redevelopment Project Worth Rs 1,700 Crores",
            "Summary": "Mahindra Lifespace Developers Limited has been selected as the partner for redeveloping two housing societies in Chembur, Mumbai. The project has an estimated combined Gross Development potential of approximately Rs 1,700 crores. The two societies span 2.6 acres and 1.8 acres respectively. The redevelopment will deliver well-planned homes with focus on sustainability, modern amenities, and connectivity. The project is located in the Diamond Garden area in Chembur, situated 1.5 kilometres from the Eastern Freeway with access to Thane, Navi Mumbai and other key parts of Mumbai. Connectivity will be enhanced by the Diamond Garden Metro Station on Line 2, along with nearby Monorail and Railway links. The location offers proximity to business hubs such as BKC and Powai.",
            "Sentiment": "positive",
            "PublishDate": 1758022060034,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Lifespace Developers Launches New Residential Project 'Codename64' in Mumbai",
            "Summary": "Mahindra Lifespace Developers Limited launched Mahindra 'Codename64', a residential project in Malad West, Mumbai on June 23, 2025. The project is registered with Maharashtra Real Estate Regulatory Authority and targets both domestic and international markets. The development offers 2 and 3 BHK residences with ~2.2 acres of landscaped recreational space, featuring amenities including a half Olympic-sized swimming pool, clubhouse with indoor gym, badminton court, and children's play areas. Located 500 metres from Malad Metro Station, the project provides access to schools, healthcare facilities, shopping malls, and business hubs. This launch marks Mahindra Lifespaces' entry into Mumbai's redevelopment space as part of their strategic expansion. The company has a development footprint spanning 41.11 million sq. ft. across seven Indian cities and over 5000 acres under development at four locations.",
            "Sentiment": "positive",
            "PublishDate": 1757139067319,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Lifespace Developers Appoints Parijat Dey as Chief Technology Officer",
            "Summary": "Mahindra Lifespace Developers Limited appointed Ms. Parijat Dey as Chief Technology Officer, effective September 1, 2025. The Board of Directors approved the appointment on August 28, 2025, based on the Nomination and Remuneration Committee's recommendation. Ms. Dey brings over 18 years of experience in digital transformation and enterprise technology across global organizations, including Fortune 500 companies. She holds a B.E. in Electrical Engineering from NIT Jamshedpur and an MBA in Marketing from ISB Hyderabad. She previously held leadership roles at Viacom18 Media, where she led enterprise technology initiatives and implemented 25+ enterprise applications. Since December 2020, she has been with PwC Acceleration Center India as Director – Head of AI, Technology, and Innovation, leading strategic AI initiatives across seven global locations.",
            "Sentiment": "positive",
            "PublishDate": 1756383752104,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mahindra World City Developers Leases 22.71-Acre Plot to Ashiana Housing in Tamil Nadu",
            "Summary": "Mahindra World City Developers Limited, a material subsidiary of Mahindra Lifespace Developers Limited, executed a lease deed with Ashiana Housing Limited on August 26, 2025. The agreement involves a 22.71-acre plot of land located in Paranur Village, Chengalpattu District, Tamil Nadu. The transaction is part of Mahindra's residential business scale-up strategy. The lease deed was signed at 11:30 am and was disclosed under SEBI listing regulations.",
            "Sentiment": "positive",
            "PublishDate": 1756193582568,
            "Source": "order&deals"
        },
        {
            "Title": "Mahindra Lifespaces Launches 166 High-End Homes at Lakewoods Project in Chennai",
            "Summary": "Mahindra Lifespaces has launched 166 high-end residential units at its Lakewoods project located in Mahindra World City, Chennai. The launch represents the company's continued expansion in the residential real estate segment in the Chennai market.",
            "Sentiment": "positive",
            "PublishDate": 1755162727184,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Lifespace Developers' Interim Company Secretary Snehal Patil Resigns",
            "Summary": "Snehal Patil has resigned from her position as Interim Company Secretary, Compliance Officer, and Key Managerial Personnel at Mahindra Lifespace Developers Limited. Her resignation becomes effective August 31, 2025, as she plans to pursue opportunities outside the company. The resignation was accepted on August 5, 2025. Patil will also cease to act as an authorized official for determining materiality of events and making disclosures to stock exchanges. The company is taking steps to identify a suitable replacement for the position. Other officials authorized for determining materiality and making disclosures will remain unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1754402567832,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mahindra Lifespaces Reports Q1 FY26 Results with Rs 3,500 Crores GDV Addition and Strong IC Business Growth",
            "Summary": "Mahindra Lifespace Developers reported quarterly results with residential presales of Rs 449 crores and IC revenues of Rs 120 crores, showing 16% growth over the previous year. The company added Rs 3,500 crores in GDV during the quarter through acquisitions including Lokhandwala 2, Mulund, and Navrat 2 projects, bringing total GDV to Rs 41,000 crores. The company completed a Rs 1,500 crores rights issue in June, with Rs 1,000 crores used for debt repayment, resulting in a negative net debt-to-equity ratio of -0.23. Management indicated plans to target Rs 4,500-5,000 crores in revenue for FY27, up from Rs 2,804 crores in FY25, representing 25-30% annual growth. The IC business leased 18.7 acres with improved realization per acre. However, project launches face delays due to Environmental Clearance issues affecting Mumbai developments, with multiple projects awaiting approvals including Hope Farm (Rs 2,000 crores), Bhandup Phase 1 (Rs 3,000 crores), and others totaling Rs 7,000-8,000 crores in potential launches.",
            "Sentiment": "positive",
            "PublishDate": 1754309252837,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Lifespaces Concludes Q1 FY26 Earnings Call with Analysts and Investors",
            "Summary": "Mahindra Lifespace Developers Limited completed its earnings call on July 28, 2025, discussing unaudited standalone and consolidated financial results for the first quarter ended June 30, 2025. The call ran from 5:30 p.m. to 6:42 p.m. IST and involved multiple analysts, institutional investors, and funds. Participants were briefed on the published financial results and received a general industry and business overview of the company. The company referenced an investor presentation that was previously filed with stock exchanges on July 25, 2025. The audio recording of the conference call has been made available on the company's website. The company confirmed that no unpublished price sensitive information was shared during the earnings call.",
            "Sentiment": "neutral",
            "PublishDate": 1753714152779,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Lifespace Targets ₹10,000 Crore Sales by FY27 with 3X Growth Plan",
            "Summary": "Mahindra Lifespace has set a target to achieve ₹10,000 crore in sales by FY27. The company plans to achieve this through luxury product launches, technology-driven execution, and expanding industrial clusters. This represents a planned 3X growth from the FY24 base.",
            "Sentiment": "positive",
            "PublishDate": 1753458830634,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Lifespace Developers Reports 303% Jump in Quarterly Net Profit",
            "Summary": "Mahindra Lifespace Developers reported a consolidated net profit of 512 million rupees for the first quarter, representing a significant increase from 127 million rupees in the same period last year. The real estate developer's quarterly earnings showed strong year-over-year growth of over 300%.",
            "Sentiment": "positive",
            "PublishDate": 1753433805187,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Lifespace Launches New Residential Tower in Pune",
            "Summary": "Mahindra Lifespace has launched a new residential tower at Mahindra Citadel in Pune. The project has a Gross Development Value (GDV) of ₹2500 crore.",
            "Sentiment": "positive",
            "PublishDate": 1751846890000,
            "Source": "default"
        },
        {
            "Title": "Mahindra Lifespace Developers: New Tower Launch in Pune's ₹2,500-Crore Project",
            "Summary": "Mahindra Lifespace Developers Limited has launched a new tower at Mahindra Citadel in Pimpri-Chinchwad, Pune, featuring premium 1BHK homes. The tower is part of a 9.66-acre development with a gross development value of nearly ₹2,500 crore. The launch responds to strong demand for earlier phases and targets young professionals and first-time homebuyers.",
            "Sentiment": "positive",
            "PublishDate": 1751640308000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra Lifespace Launches New Residential Tower in Pune",
            "Summary": "Mahindra Lifespace has launched a new residential tower at Mahindra Citadel in Pune. The project has a gross development value of ₹2500 crore.",
            "Sentiment": "positive",
            "PublishDate": 1751634996000,
            "Source": "default"
        },
        {
            "Title": "Mahindra Lifespace Developers to Discuss Q1 Results",
            "Summary": "Mahindra Lifespace Developers has announced that it will discuss its first quarter results on July 25.",
            "Sentiment": "neutral",
            "PublishDate": 1751286423000,
            "Source": "default"
        },
        {
            "Title": "Mahindra Lifespace Selected for St. Pius Ten CHS Redevelopment Project",
            "Summary": "Mahindra Lifespace has been chosen as the developer for the redevelopment of St. Pius Ten CHS in Mulund, Mumbai. The project has a gross development value of ₹1,250 crores.",
            "Sentiment": "positive",
            "PublishDate": 1750987684000,
            "Source": "default"
        },
        {
            "Title": "Mahindra Lifespace Developers: Wins ₹1,250 Crore Mumbai Redevelopment Project",
            "Summary": "Mahindra Lifespace Developers Ltd has been selected to redevelop St. Pius Ten CHS Ltd in Mulund, Mumbai. The project has an estimated gross development value of ₹1,250 crore and spans a 3.08-acre land parcel. The company received formal intimation on June 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1750967761000,
            "Source": "order&deals"
        },
        {
            "Title": "Mahindra Lifespaces Introduces 'Codename64' Project in Malad, Mumbai",
            "Summary": "Mahindra Lifespaces has announced the introduction of a new project called 'Codename64' in Malad (West), Mumbai. The project appears to be a real estate development, though specific details about its nature or scale are not provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750679060000,
            "Source": "default"
        },
        {
            "Title": "Mahindra Lifespace Developers Completes Rights Issue Allotment",
            "Summary": "Mahindra Lifespace Developers has successfully completed the allotment process for its rights issue. The company, which operates in the real estate sector, has finalized the distribution of new shares to existing shareholders who participated in the rights offering.",
            "Sentiment": "positive",
            "PublishDate": 1750260418000,
            "Source": "default"
        },
        {
            "Title": "Mahindra Lifespace Developers Ltd: Last Day to Buy Shares for Rights Issue Eligibility",
            "Summary": "May 22 is the last day to buy Mahindra Lifespace shares to be eligible for the Rs 1,500 crore rights issue. The record date is May 23, with a 3:8 ratio at Rs 257 per share. The issue runs from June 2 to June 17, aiming to raise Rs 1,496.28 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747902405000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra Lifespace Developers Ltd: ₹1,500 Crore Rights Issue Approved",
            "Summary": "Mahindra Lifespace Developers Ltd. has approved a rights issue to raise up to ₹1,500 crore at ₹257 per share. The record date is set for May 23, 2025, with a ratio of 3 rights shares for every 8 shares held.",
            "Sentiment": "positive",
            "PublishDate": 1747649157000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra Lifespace Developers Approves Rights Issue to Raise Funds",
            "Summary": "Mahindra Lifespace Developers has approved raising funds up to Rs 1,500 crore through a rights issue. The company will offer shares at a price of 257 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747644396000,
            "Source": "default"
        },
        {
            "Title": "Mahindra Lifespaces Developers Announces Rights Issue",
            "Summary": "Mahindra Lifespaces Developers has announced plans to raise up to Rs 1,500 crore through a rights issue of equity shares. This move indicates the company's intention to strengthen its capital base, potentially for expansion or debt reduction.",
            "Sentiment": "positive",
            "PublishDate": 1747141650000,
            "Source": "default"
        },
        {
            "Title": "Mahindra Lifespace to Consider Superseding Rights Issue Approval",
            "Summary": "Mahindra Lifespace Developers Limited is set to consider a proposal to supersede a previously approved rights issue. This corporate action suggests a potential change in the company's capital raising strategy or terms of the rights issue.",
            "Sentiment": "neutral",
            "PublishDate": 1746718529000,
            "Source": "default"
        },
        {
            "Title": "Mahindra Lifespace Developers Ltd: Q4 Bookings Dip, FY25 Sales Surge",
            "Summary": "Mahindra Lifespace Developers Ltd reported Q4 FY25 sale bookings of Rs 1,055 crore, down 3% YoY. However, FY25 total pre-sales increased 20% to Rs 2,804 crore. Q4 net profit rose 19% to Rs 85.09 crore, while FY25 net profit declined to Rs 60.94 crore. Total income for FY25 grew to Rs 463.87 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1745834031000,
            "Source": "earnings"
        }
    ]
}