{
    "Symbol": "MAHLOG",
    "ISIN": "INE766P01016",
    "News": [
        {
            "Title": "Mahindra Logistics Concludes Q3FY26 Earnings Call",
            "Summary": "Mahindra Logistics Limited successfully concluded its earnings conference call on January 28, 2026, discussing Q3FY26 financial results with analysts and institutional investors.",
            "Sentiment": "neutral",
            "PublishDate": 1769613430618,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahindra Logistics Gets 'Strong' ESG Rating of 63",
            "Summary": "Mahindra Logistics receives ESG score of 63 under 'Strong' category from SEBI-registered ESG Risk Assessments & Insights Limited, based on FY 2024-25 public data without company engagement.",
            "Sentiment": "positive",
            "PublishDate": 1769589380188,
            "Source": "stocks"
        },
        {
            "Title": "Mahindra Logistics Q3FY26 Rights Issue Fund Report",
            "Summary": "CARE Ratings confirms proper utilization of ₹749.27 crore rights issue proceeds with no deviations. Company deployed ₹93.16 crore during Q3FY26 for debt repayment and corporate purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1769516302423,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahindra Logistics Q3FY26 Results Show Strong Recovery",
            "Summary": "Mahindra Logistics reports consolidated revenue of ₹1,898.03 crores for Q3FY26, up 19.05% YoY, with net profit of ₹6.01 crores against loss of ₹7.26 crores in Q3FY25.",
            "Sentiment": "positive",
            "PublishDate": 1769514506050,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahindra Logistics Q3FY26 earnings call on Jan 28",
            "Summary": "Mahindra Logistics Limited has scheduled an earnings conference call for January 28, 2026, at 3:30 PM IST to discuss Q3FY26 financial results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1768567169249,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahindra Logistics Allots 41,712 Equity Shares",
            "Summary": "Mahindra Logistics Limited allotted 41,712 equity shares under RSU Plan 2018, increasing paid-up capital to ₹99.22 crores. Committee approved allotment on January 7, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767793997560,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahindra Logistics Receives GST Penalty of ₹2.04 Lakh",
            "Summary": "Mahindra Logistics Limited received a GST penalty order of ₹2,04,425.35 from State Tax Officer, Ranchi for alleged excess Input Tax Credit claimed during FY 2021-2022. Company expects favourable outcome at tribunal level.",
            "Sentiment": "negative",
            "PublishDate": 1767190663175,
            "Source": "stocks"
        },
        {
            "Title": "Mahindra Logistics Faces ₹44.81 Cr GST Demand",
            "Summary": "Mahindra Logistics receives GST order imposing tax demand of ₹22.40 crores and equal penalty for FY2018-24, related to vendor tagging errors under Reverse Charge Mechanism.",
            "Sentiment": "negative",
            "PublishDate": 1767167663778,
            "Source": "stocks"
        },
        {
            "Title": "Mahindra Logistics faces ₹10.95 cr GST penalty order",
            "Summary": "Mahindra Logistics received a GST penalty order of ₹10.95 crores from Mumbai East Commissionerate for alleged excess Input Tax Credit claims during FY2018-19 to FY2022-23. Company expects favourable outcome on appeal.",
            "Sentiment": "negative",
            "PublishDate": 1767078141193,
            "Source": "stocks"
        },
        {
            "Title": "Mahindra Logistics Gets ESG Rating of 78 from NSE",
            "Summary": "Mahindra Logistics Limited receives an ESG rating of 78 from NSE Sustainability Ratings Analytics Ltd, assigned independently based on FY2024-25 public data without company engagement.",
            "Sentiment": "positive",
            "PublishDate": 1765537881443,
            "Source": "stocks"
        },
        {
            "Title": "Mahindra Logistics Appoints Ankur Bansal as Head-Strategy Transformation",
            "Summary": "Mahindra Logistics' Board of Directors approved the appointment of Ankur Bansal as Head-Strategy Transformation and Senior Management Personnel, effective January 1, 2026. Bansal, currently Vice President-Group Strategy at Mahindra Group with over 13 years of experience, previously worked at Jio telecom and Boston Consulting Group.",
            "Sentiment": "positive",
            "PublishDate": 1764418973946,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mahindra Logistics Partners with L'Oréal India to Launch India's First All-Women Operated Warehouse in Indore",
            "Summary": "Mahindra Logistics Limited and L'Oréal India have launched India's first fully women-operated warehouse in Indore, Madhya Pradesh, with women managing end-to-end warehouse operations after extensive training in safety and leadership programs. The facility supports distribution across central India covering 18 key markets and strengthens L'Oréal's supply chain through Mahindra Logistics' warehouse management system for improved inventory control and service delivery.",
            "Sentiment": "positive",
            "PublishDate": 1763963058909,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Logistics Reaffirms Warehouse Efficiency Target, Express Business Profitability Timeline Unclear",
            "Summary": "Mahindra Logistics has reaffirmed its goal to reduce warehouse whitespaces by 95% by September 2026. The company's management did not provide a specific timeline for the express business to achieve EBITDA profitability, describing it as an upcoming goal. The company indicated that lease and depreciation costs have peaked and are expected to remain around INR 72 crores quarterly going forward.",
            "Sentiment": "neutral",
            "PublishDate": 1761708970650,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Logistics Targets ₹14,000 Crore Revenue by FY27 with Warehousing and EV Fleet Expansion",
            "Summary": "Mahindra Logistics has projected revenue of ₹14,000 crore and EBITDA margin of 8-9 percent by FY27. The company plans to expand its 3PL warehousing capacity to 30 million square feet, scale its EV fleet to 3,500 vehicles, and establish new multimodal hubs to achieve these targets.",
            "Sentiment": "positive",
            "PublishDate": 1761580609321,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Logistics Board Approves ₹50 Crore Investment in MLL Express Services",
            "Summary": "Mahindra Logistics' board has approved an investment of ₹50 crore in MLL Express Services. The decision represents a capital allocation by the logistics company into its express services division.",
            "Sentiment": "positive",
            "PublishDate": 1761566078199,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Logistics Reports Proper Utilization of ₹749.27 Crore Rights Issue Proceeds",
            "Summary": "Mahindra Logistics Limited received a monitoring agency report from CARE Ratings for the quarter ended September 30, 2025, confirming appropriate utilization of proceeds from its rights issue. The company raised ₹749.27 crore through a rights issue conducted from July 31 to August 14, 2025. Out of the total proceeds, ₹556.30 crore was allocated for debt repayment, ₹186.77 crore for general corporate purposes, and ₹6.20 crore for issue-related expenses. The company has fully utilized ₹559.80 crore, with ₹556.30 crore used for debt repayments across Mahindra Logistics and its subsidiaries, and ₹3.50 crore for issue-related expenses. The remaining ₹189.47 crore is deployed in fixed deposits with Kotak Mahindra Bank earning 6.25% returns and balance in allotment account. CARE Ratings reported no deviations from stated objectives and confirmed all utilization aligns with the rights issue objects.",
            "Sentiment": "positive",
            "PublishDate": 1761564720197,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra Logistics Reports Mixed Q2 Results with Standalone Profit but Consolidated Loss",
            "Summary": "Mahindra Logistics Limited announced its second quarter and half year results ended 30 September 2025. On a standalone basis, the company reported revenue from operations of Rs 1,366.91 crores for Q2 and Rs 2,712.73 crores for H1, with profit after tax of Rs 3.79 crores and Rs 10.23 crores respectively. However, on a consolidated basis, the company posted a net loss of Rs 10.35 crores for Q2 and Rs 21.15 crores for H1, despite consolidated revenue of Rs 1,685.27 crores for Q2 and Rs 3,309.86 crores for H1. The company successfully completed a rights issue of 2,70,49,301 equity shares at Rs 277 per share, raising Rs 749.27 crores for debt repayment and general corporate purposes. The shares were allotted on 18 August 2025. The company also paid a final dividend of Rs 2.50 per equity share, resulting in an outflow of Rs 18.03 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1761562944438,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Logistics Expands Eastern India Operations with 400,000 Sq. Ft. Warehouse",
            "Summary": "Mahindra Logistics has introduced 400,000 square feet of warehouse space aimed at enhancing connectivity in Eastern India. This expansion represents the company's efforts to strengthen its logistics infrastructure in the region.",
            "Sentiment": "positive",
            "PublishDate": 1759467938802,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Logistics Announces CFO Transition: Saurabh Taneja to Resign, Isha Dalal to Take Over",
            "Summary": "Mahindra Logistics announced leadership changes in its finance team following a board meeting on August 26, 2025. Saurabh Taneja will resign as Chief Financial Officer effective September 19, 2025, to pursue career opportunities outside the company. Isha Dalal will be appointed as the new CFO starting September 22, 2025. Dalal currently serves as SVP and Head of Group FP&A at Mahindra Group, responsible for financial planning, forecasting, budgeting and capital allocation. She previously worked at Hindustan Unilever leading FP&A and Supply Chain Finance, and has experience in private equity with Multiple Private Equity fund. Dalal brings over 15 years of experience across media, investment banking, private equity and corporate finance, and holds an MBA in Finance from Columbia University. The board approved these changes based on recommendations from the Nomination and Remuneration Committee and Audit Committee approval.",
            "Sentiment": "neutral",
            "PublishDate": 1756225214641,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mahindra & Mahindra Increases Stake in Mahindra Logistics to 59.60% Through Rights Issue Subscription",
            "Summary": "Mahindra & Mahindra Limited has increased its shareholding in Mahindra Logistics Limited from 57.97% to 59.60% by subscribing to a rights issue. M&M acquired 1,73,00,670 shares representing 1.63% additional stake through the rights issue allotment on August 18, 2025. The Rights Issue Committee of Mahindra Logistics approved the allotment of 2,70,49,301 fully paid-up equity shares of face value Rs. 10 each to eligible shareholders. Following the transaction, M&M now holds 5,91,12,927 shares in Mahindra Logistics. The total equity share capital of Mahindra Logistics increased from Rs. 72,13,14,700 divided into 7,21,31,470 shares to Rs. 99,18,07,710 divided into 9,91,80,771 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1755596602895,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra Logistics Launches Alyte for Premium B2C Transportation Services",
            "Summary": "Mahindra Logistics has introduced Alyte, a new service designed to transform high-end business-to-consumer transport operations in India. The launch represents the company's entry into the premium B2C logistics segment.",
            "Sentiment": "positive",
            "PublishDate": 1754886257361,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Logistics Reports 14% Revenue Growth to INR 1,625 Crores in Q1 FY26, Announces INR 750 Crore Rights Issue",
            "Summary": "Mahindra Logistics reported consolidated revenue of INR 1,625 crores for Q1 FY26, marking a 14% year-on-year increase. The warehousing segment showed strong growth of 18% to INR 306 crores. EBITDA rose to INR 76.3 crores from INR 66.3 crores in the previous year. The company posted a net loss of INR 10.8 crores for the quarter. The Express business crossed INR 100 crores in revenue for the first time but recorded a loss of INR 23.9 crores. New CEO Hemant Sikka emphasized reducing warehousing white space as a key priority and announced a rights issue of approximately INR 750 crores. The company plans to use INR 556.3 crores from the proceeds to repay debt, expecting annual interest savings of INR 40-45 crores. Revenue split showed 63% from auto sector and 37% from non-auto sectors, with Mahindra contributing 56% and non-Mahindra 44%. The company recorded 135% quarter-on-quarter growth in 3PL wins and went live with 10 new projects across manufacturing and e-commerce.",
            "Sentiment": "positive",
            "PublishDate": 1753450340135,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Logistics Issues Rights Offer Addendum with Q1 FY26 Results, AGM Resolutions Pass",
            "Summary": "Mahindra Logistics Limited issued an addendum to its rights issue letter of offer, incorporating unaudited consolidated financial results for the first quarter ended June 30, 2025. The company reported total revenue from operations of ₹1,624.59 crores compared to ₹1,420.02 crores in the same period last year. However, the company posted a net loss after tax of ₹9.44 crores versus ₹7.84 crores loss in the previous year, with basic earnings per share at negative ₹1.50. The rights issue offers up to 2,70,49,301 equity shares at ₹277 per share to raise up to ₹749.27 crores, with a ratio of 3 rights shares for every 8 existing shares held. The issue opens on July 31, 2025 and closes on August 14, 2025. Additionally, the company's 18th Annual General Meeting held on July 21, 2025 saw all resolutions except one pass with requisite majority. Resolution 6 regarding the re-appointment of Independent Director Dhananjay Mungale became infructuous as he requested not to be considered for re-appointment due to professional commitments.",
            "Sentiment": "neutral",
            "PublishDate": 1753158217841,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra Logistics Reports 14% Revenue Growth in Q1 FY26, Appoints New CEO",
            "Summary": "Mahindra Logistics Limited reported consolidated revenue of ₹1,625 crore for Q1 FY26, marking 14% year-on-year growth. The Express Business crossed ₹100 crore in revenue for the quarter. The company showed strong performance in Contract Logistics (18% growth to ₹1,289 crore), Last Mile Delivery (11% growth to ₹97 crore), and stable performance in Freight Forwarding. However, the company reported a consolidated PAT loss of ₹11 crore. Key leadership changes include the appointment of Hemant Sikka as Managing Director & CEO for a five-year term from May 2025 to May 2030, and re-appointment of Malvika Sinha as Independent Director. The company also approved a Performance Stock Unit Plan 2025 for up to 18 lakh stock units and appointed new secretarial auditors for a five-year term.",
            "Sentiment": "positive",
            "PublishDate": 1753156668228,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Logistics Reports ₹4,744 Crores Revenue, Announces ₹749 Crores Rights Issue at 18th AGM",
            "Summary": "Mahindra Logistics shared its business performance at the 18th Annual General Meeting held on July 21, 2025. The company reported total revenue of ₹4,744 crores across its business segments. Contract Logistics generated ₹358 crores revenue driven by new account wins and improved yields. B2B Express recorded ₹306 crores revenue with volume recovery in the second half and network optimization. Freight Forwarding achieved ₹381 crores revenue with 20% year-on-year growth through strategic expansion into UK, UAE, and South-East Asia routes. Last-Mile Delivery reported ₹316 crores revenue with exponential growth powered by eDel's EV-first fulfillment model. Mobility Services maintained stable revenues of ₹316 crores from structured commute programs and EV-based shuttle solutions. The company announced a rights issue of ₹749.27 crores at ₹277 per equity share with a 3:8 entitlement ratio. Strategic developments include new fulfillment centers in Eastern India, launch of Pro-Trucking long haul cargo solution, embedded AI/ML in warehousing, and expanded physical capacity to approximately 21 million square feet across India.",
            "Sentiment": "positive",
            "PublishDate": 1753096210816,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra Logistics Reports Mixed Q1 Results with Revenue Growth but Higher Losses",
            "Summary": "Mahindra Logistics reported quarterly revenue of 16 billion rupees, up from 14.2 billion rupees in the same period last year. EBITDA increased to 763 million rupees from 663 million rupees year-over-year, with EBITDA margin improving slightly to 4.69% from 4.67%. However, the company posted a consolidated net loss of 108 million rupees compared to a loss of 93 million rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753085937489,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Logistics Ltd: Rights Issue Details Announced, Stock Jumps 5%",
            "Summary": "Mahindra Logistics announced details of its ₹750 crore rights issue. The company will issue 2.70 crore shares at ₹277 each, a 29% discount to the current price. Shareholders will receive 3 rights shares for every 8 held. The record date is July 23, 2025, and the issue opens from July 31 to August 11, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1752730840000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra Logistics Approves Rights Issue Plan",
            "Summary": "Mahindra Logistics has approved a plan to issue shares through a rights offering. The company aims to raise ₹749 crores by issuing shares at ₹277 per share.",
            "Sentiment": "positive",
            "PublishDate": 1752727522000,
            "Source": "default"
        },
        {
            "Title": "Mahindra Logistics: Board Approves ₹750 Crore Rights Issue",
            "Summary": "Mahindra Logistics' board has approved a rights issue to raise up to ₹750 crore. Funds will be used for debt repayment and general corporate purposes. The company aims to support its growth strategy in India's expanding logistics sector.",
            "Sentiment": "positive",
            "PublishDate": 1752224102000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra Logistics Plans to Raise Up to Rs 750 Crore Through Share Issuance",
            "Summary": "Mahindra Logistics has announced plans to raise up to Rs 750 crore by issuing new shares. The company intends to increase its capital through this share issuance. No further details about the timing, purpose, or method of the share issuance were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1752218812000,
            "Source": "default"
        },
        {
            "Title": "Mahindra Logistics Opens New Warehouse for Cummins India in Phaltan",
            "Summary": "Mahindra Logistics has established a new warehousing facility in Phaltan, specifically for Cummins India. This development indicates an expansion of Mahindra Logistics' operations and a strategic partnership with Cummins India.",
            "Sentiment": "positive",
            "PublishDate": 1749621185000,
            "Source": "default"
        },
        {
            "Title": "Mahindra Logistics: Q4 Profit Surges 67%, Revenue Grows",
            "Summary": "Mahindra Logistics reported a 67% year-on-year increase in standalone PAT to ₹13.12 crore for Q4FY25. Standalone revenue rose to ₹1,293 crore. Consolidated net loss narrowed to ₹6.75 crore. The board recommended a final dividend of ₹2.5 per share. Hemant Sikka appointed as new MD and CEO.",
            "Sentiment": "positive",
            "PublishDate": 1745299438000,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Logistics: Q4 Revenue Growth Amid Express Business Challenges",
            "Summary": "Mahindra Logistics reported 8% YoY revenue growth in Q4 FY24, with 11% growth for FY24. Contract logistics grew 9% YoY, cross-border logistics 20% YoY, and last mile delivery 10% YoY. B2B express revenue declined 4% YoY, but volumes recovered QoQ. Warehousing expanded 15% YoY with major expansions in progress.",
            "Sentiment": "neutral",
            "PublishDate": 1745295034000,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Logistics Reports Q4 Results and Leadership Changes",
            "Summary": "Mahindra Logistics reported a consolidated net loss of 67.5 million rupees in Q4, an improvement from the 128.5 million rupees loss in the same quarter last year. Revenue increased to 15.7 billion rupees from 14.51 billion rupees year-over-year. The company recommended a dividend of 2.50 rupees per share. In leadership changes, Hemant Sikka was appointed as Managing Director & CEO (Designate), while Rampraveen Swaminathan resigned from the same position.",
            "Sentiment": "neutral",
            "PublishDate": 1745281623000,
            "Source": "default"
        },
        {
            "Title": "Mahindra Logistics Announces Leadership Change and Q4 Results",
            "Summary": "Mahindra Logistics has appointed Hemant Sikka as Managing Director & CEO (Designate), replacing Rampraveen Swaminathan who has resigned. The company recommended a dividend of 2.50 rupees per share. For Q4, Mahindra Logistics reported revenue of 15.7 billion rupees (up from 14.51 billion YoY), EBITDA of 777.2 million rupees (up from 566.1 million YoY), and an EBITDA margin of 4.95% (up from 3.9% YoY). However, the company posted a consolidated net loss of 67.5 million rupees, an improvement from the 128.5 million rupees loss in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1745239043000,
            "Source": "default"
        },
        {
            "Title": "Mahindra Logistics: Q4 Net Loss Narrows, Revenue Grows",
            "Summary": "Mahindra Logistics reported a narrower net loss of Rs 6.7 crore in Q4 FY2025, compared to Rs 12.9 crore loss in the same period last year. Revenue increased by 8.2% to Rs 1,570 crore. EBITDA rose 37.3% to Rs 77.7 crore, with margins improving to 5%.",
            "Sentiment": "positive",
            "PublishDate": 1745234997000,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Logistics Appoints Sandeep Kulkarni as Head of Fleet Businesses & Purchasing",
            "Summary": "Mahindra Logistics has appointed Sandeep Kulkarni as Senior Management Personnel (SMP) and Head of Fleet Businesses & Purchasing. Kulkarni previously served as the Chief Operating Officer (COO) at Allcargo Logistics.",
            "Sentiment": "positive",
            "PublishDate": 1744867265000,
            "Source": "default"
        },
        {
            "Title": "Mahindra Logistics Approves Investment in Subsidiary MESPL",
            "Summary": "Mahindra Logistics has approved an investment of up to 350 million rupees in its subsidiary MESPL (Mahindra E-commerce Services Private Limited). This decision indicates a significant financial commitment by the parent company to support and potentially expand the operations of its subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1741149050000,
            "Source": "corporate_action"
        },
        {
            "Title": "Asian Paints and Mahindra Logistics Form Strategic Partnership",
            "Summary": "Mahindra Logistics and Asian Paints have entered into a partnership to provide integrated transportation solutions. This collaboration aims to enhance logistics efficiency and potentially improve supply chain operations for both companies.",
            "Sentiment": "positive",
            "PublishDate": 1738841753000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra Logistics Reports Q3 Financial Results",
            "Summary": "Mahindra Logistics announced its Q3 consolidated financial results. The company reported a net loss of 90 million rupees, which is an improvement from the 174 million rupee loss in the same quarter last year. However, it's a slight increase in loss compared to the previous quarter's 108 million rupee loss. Revenue for Q3 increased to 15.9 billion rupees from 14 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738023407000,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Logistics Reports Improved Q3 EBITDA and Margin",
            "Summary": "Mahindra Logistics has reported a significant increase in its Q3 EBITDA, rising to 760 million rupees from 516 million rupees year-over-year. The company's EBITDA margin also improved, reaching 4.77% compared to 3.69% in the same period last year. This indicates a notable enhancement in the company's operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1737988814000,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Logistics Reports Q3 Financial Results",
            "Summary": "Mahindra Logistics announced its Q3 consolidated financial results. The company reported a net loss of 90 million rupees, which is an improvement from the 174 million rupees loss in the same quarter last year. However, it's a slight increase in loss compared to the previous quarter's 108 million rupees. Revenue for Q3 increased to 15.9 billion rupees from 14 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737988767000,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Logistics: Maintains Mid-Teen Volume Growth Target for Year",
            "Summary": "Mahindra Logistics has reaffirmed its mid-teen volume growth target for the current year.",
            "Sentiment": "positive",
            "PublishDate": 1736313392000,
            "Source": "normal_news"
        },
        {
            "Title": "Mahindra Logistics: Express Business Profitability on Horizon",
            "Summary": "Mahindra Group expects its express business to become profitable soon, focusing on increasing volumes for cost efficiency. The company reported a 33% decline in Q2 profit but saw reduced losses in the Express business. They aim to achieve EBITDA breakeven through volume growth and efficiency improvements, with profitability expected by year-end.",
            "Sentiment": "positive",
            "PublishDate": 1730996102000,
            "Source": "normal_news"
        },
        {
            "Title": "Mahindra Logistics: Q2 Recovery Slower Than Expected",
            "Summary": "ICICI Securities recommends 'Reduce' rating for Mahindra Logistics due to slower-than-anticipated recovery in the express business during Q2.",
            "Sentiment": "negative",
            "PublishDate": 1729668616000,
            "Source": "result"
        },
        {
            "Title": "Mahindra Logistics: Q2 Profit Plunges 54% Despite Revenue Growth",
            "Summary": "Mahindra Logistics reported a 54% decline in Q2 FY25 standalone PAT to Rs 8.5 crore, despite a 9% increase in revenue to Rs 1,236 crore. Overall revenue grew 11.5% year-on-year. The company expanded offerings in transportation and green logistics, with strong growth in 3PL contract logistics, cross-border, and last-mile delivery segments. Express business losses reduced by 32% YoY, while freight forwarding revenues surged 65% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1729523028000,
            "Source": "result"
        },
        {
            "Title": "Mahindra Logistics Reports Improved Q2 Financial Performance",
            "Summary": "Mahindra Logistics has announced its Q2 financial results, showing an increase in EBITDA to 665 million rupees from 536 million rupees year-over-year. The company's EBITDA margin also improved, rising to 4.37% from 3.93% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1729511028000,
            "Source": "result"
        },
        {
            "Title": "Mahindra Logistics Reports Q2 Revenue Growth",
            "Summary": "Mahindra Logistics has reported a revenue of 15.21 billion rupees for the second quarter, compared to 13.65 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729511017000,
            "Source": "result"
        },
        {
            "Title": "Mahindra Logistics Reports Q2 Financial Results",
            "Summary": "Mahindra Logistics has reported a consolidated net loss of 107 million rupees for the second quarter. This represents an improvement from the loss of 159 million rupees in the same quarter last year (YoY). However, it shows a slight increase in loss compared to the previous quarter's (QoQ) loss of 93.2 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1729511007000,
            "Source": "result"
        },
        {
            "Title": "Mahindra Logistics: New Brand Identity Unveiled",
            "Summary": "<p>Mahindra Logistics has introduced a new <span class='positive'>brand identity</span> featuring a <span class='positive'>bold icon</span> symbolizing <span class='positive'>growth</span> and <span class='positive'>innovation</span>. The <span class='neutral'>rebranding</span> aims to <b>unify all business segments</b>, emphasizing <span class='positive'>integrated logistics solutions</span>, <span class='positive'>technology focus</span>, and <span class='positive'>sustainability</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728877680000,
            "Source": "normal_news"
        }
    ]
}