{
    "Symbol": "MAHSCOOTER",
    "ISIN": "INE288A01013",
    "News": [
        {
            "Title": "Maharashtra Scooters Q3 profit drops 98% QoQ",
            "Summary": "Maharashtra Scooters reported Q3 FY26 net profit of ₹4.00 crores, down 98.5% QoQ from ₹267.00 crores in Q2 FY26, though up 21% YoY. Revenue fell 98% QoQ to ₹6.40 crores despite 10% YoY growth.",
            "Sentiment": "negative",
            "PublishDate": 1768220796478,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maharashtra Scooters Q3FY26 Results: Strong Growth",
            "Summary": "Maharashtra Scooters reported ₹412.00 lakh net profit for Q3FY26, up 24.85% YoY. Nine-month profit surged 88.37% to ₹30,655.00 lakh with EPS of ₹268.20.",
            "Sentiment": "positive",
            "PublishDate": 1768212394527,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maharashtra Scooters Q3FY26 Results Announced",
            "Summary": "Maharashtra Scooters Limited reported Q3FY26 results with revenue of ₹644 lakh and profit after tax of ₹412 lakh. Nine-month PAT reached ₹30,655 lakh with EPS of ₹268.20.",
            "Sentiment": "positive",
            "PublishDate": 1768211720510,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maharashtra Scooters Q3 Net Profit Rises 24% YoY",
            "Summary": "Maharashtra Scooters reported Q3 net profit of ₹41.00 million, up 24% from ₹33.00 million last year. Revenue grew 10% to ₹64.00 million compared to ₹58.00 million in the same period.",
            "Sentiment": "positive",
            "PublishDate": 1768211513716,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maharashtra Scooters Reports 80% Jump in Net Profit to 2.7 Billion Rupees",
            "Summary": "Maharashtra Scooters reported a net profit of 2.7 billion rupees in its quarterly results, representing an 80% increase from 1.5 billion rupees in the same period last year. The significant year-over-year growth demonstrates strong financial performance for the company.",
            "Sentiment": "positive",
            "PublishDate": 1762148175078,
            "Source": "earnings"
        },
        {
            "Title": "Maharashtra Scooters Declares Rs. 160 Interim Dividend, Appoints New Company Secretary",
            "Summary": "Maharashtra Scooters Limited declared an interim dividend of Rs. 160 per equity share for the financial year ending March 31, 2026. The record date for determining eligible shareholders is September 22, 2025, with dividend payment scheduled around October 13, 2025. The company also appointed Saurabh Erande as Company Secretary effective October 1, 2025. Erande is a qualified Company Secretary with over 16 years of corporate experience in governance, regulatory compliance, audits, and M&A integration.",
            "Sentiment": "positive",
            "PublishDate": 1757912403629,
            "Source": "corporate_action"
        },
        {
            "Title": "Maharashtra Scooters Schedules Board Meeting to Consider Interim Dividend Declaration",
            "Summary": "Maharashtra Scooters Limited has scheduled a Board of Directors meeting on September 15, 2025, to consider declaring an interim dividend for the financial year ending March 31, 2026. The company notified stock exchanges BSE and NSE about the board meeting through a regulatory communication signed by Joint Managing Director V Rajagopalan.",
            "Sentiment": "positive",
            "PublishDate": 1757497885886,
            "Source": "corporate_action"
        },
        {
            "Title": "Maharashtra Scooters Appoints Two Joint Managing Directors, Company Secretary Resigns",
            "Summary": "Maharashtra Scooters Limited appointed V Rajagopalan and S Ravikumar as Joint Managing Directors effective August 1, 2025. The company also announced the resignation of Sriram Subbramaniam from his position as Company Secretary, effective from close of business hours on July 25, 2025. Following these leadership changes, the company updated its list of authorized persons under SEBI regulations for determining materiality of events and making disclosures to stock exchanges. The authorized contacts now include Chairman Sanjiv Bajaj, the two new Joint Managing Directors, and CFO Anant Marathe.",
            "Sentiment": "neutral",
            "PublishDate": 1754111875537,
            "Source": "corporate_governance"
        },
        {
            "Title": "Maharashtra Scooters CEO Sanjay Uttekar Resigns Under Voluntary Separation Scheme",
            "Summary": "Sanjay Uttekar has resigned from his position as Chief Executive Officer of Maharashtra Scooters Limited, effective from the close of business hours on July 31, 2025. His resignation follows his acceptance of the company's Voluntary Separation Scheme (VSS). Uttekar submitted his resignation letter on July 11, 2025, and will relinquish all positions held within the company. In his resignation letter, he thanked the Board of Directors, Chairman and Senior Management of Bajaj Finserv Group for their support during his tenure as CEO.",
            "Sentiment": "neutral",
            "PublishDate": 1753977006336,
            "Source": "corporate_governance"
        },
        {
            "Title": "Maharashtra Scooters Company Secretary Sriram Subbramaniam Resigns to Pursue Career Opportunities",
            "Summary": "Sriram Subbramaniam has resigned from his position as Company Secretary and Deputy Nodal Officer of Maharashtra Scooters Limited, effective July 25, 2025. He submitted his resignation letter on April 30, 2025, citing his decision to pursue alternate career opportunities outside the organization. Subbramaniam expressed gratitude to the Board of Directors, CEO and Senior Management of Bajaj Finserv Group for their support during his tenure. Maharashtra Scooters Limited is currently in the process of identifying a suitable replacement for the position and will inform stock exchanges once the vacancy is filled.",
            "Sentiment": "neutral",
            "PublishDate": 1753447339258,
            "Source": "corporate_governance"
        },
        {
            "Title": "Maharashtra Scooters Appoints New Joint Managing Directors and Declares Rs. 60 Dividend at 50th AGM",
            "Summary": "Maharashtra Scooters Limited held its 50th Annual General Meeting on July 23, 2025, chaired by Sanjiv Bajaj with 99 members in attendance. The Board appointed V Rajagopalan and S Ravikumar as Joint Managing Directors effective August 1, 2025, subject to shareholder approval. The company declared a final dividend of Rs. 60 per equity share, including a special dividend of Rs. 30 per share, for the financial year ended March 31, 2025. The meeting approved the audited financial statements and appointed DVD & Associates as Secretarial Auditor for five consecutive years, replacing Shyamprasad Limaye who declined reappointment due to professional commitments. V Rajagopalan was also reappointed as director after retiring by rotation.",
            "Sentiment": "positive",
            "PublishDate": 1753284888473,
            "Source": "corporate_action"
        },
        {
            "Title": "Maharashtra Scooters Reports Mixed Q1 Results with Profit Surge and Revenue Decline",
            "Summary": "Maharashtra Scooters reported net profit of 354 million rupees in Q1, representing a significant increase from 83 million rupees in the same period last year. However, the company's revenue declined to 293 million rupees compared to 772 million rupees year-over-year, indicating a substantial drop in sales despite improved profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1753247541624,
            "Source": "earnings"
        },
        {
            "Title": "Maharashtra Scooters: Share Price Soars 500% in Five Years",
            "Summary": "Maharashtra Scooters Ltd., backed by Raamdeo Agrawal, has seen a 500% rally in share price over the last five years. The company reported a 7.5% increase in net profit for the past fiscal year, despite a revenue dip. A final and special dividend of Rs 30 per share each was recommended. The company also announced the closure of its Satara factory.",
            "Sentiment": "positive",
            "PublishDate": 1750656453000,
            "Source": "corporate_action"
        },
        {
            "Title": "Maharashtra Scooters: Declares ₹60 Dividend, Q4 Profit Soars",
            "Summary": "Maharashtra Scooters announced a final dividend of ₹60 per share for FY25, including a special dividend. Q4 net profit increased significantly to ₹51.63 crore from ₹10 lakh year-over-year. Revenue rose 28% to ₹6.65 crore. The dividend record date is set for June 27, 2025, with payment expected around July 27-28, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1745389059000,
            "Source": "result"
        },
        {
            "Title": "Maharashtra Scooters: Announces ₹60 Total Dividend, Sets Record Date",
            "Summary": "Maharashtra Scooters Ltd. has declared a final dividend of ₹30 per share and a special dividend of ₹30 per share for FY 2025. The record date is set for June 27, 2025, with dividend payment scheduled for July 28, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1745388269000,
            "Source": "corporate_action"
        },
        {
            "Title": "Maharashtra Scooters Reports Q4 Results with Exceptional Item",
            "Summary": "Maharashtra Scooters announced its Q4 financial results. The company reported a net profit before exceptional items of 44 million rupees, up from 2 million rupees in the same quarter last year. Revenue increased to 67 million rupees from 52 million rupees year-over-year. Additionally, the company reported an exceptional item of 577 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1745386870000,
            "Source": "result"
        },
        {
            "Title": "Maharashtra Scooters to Transfer Leasehold Rights and Machineries for 729 Million",
            "Summary": "Maharashtra Scooters has announced plans to transfer its leasehold rights and machineries. The total consideration for this sale is valued at 729 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1740120464000,
            "Source": "corporate_action"
        },
        {
            "Title": "Maharashtra Scooters Announces Closure of Satara Factory",
            "Summary": "Maharashtra Scooters has announced the closure of its factory in Satara due to the non-viability of manufacturing operations. This decision indicates significant challenges in the company's production capabilities and may have implications for its future business strategy.",
            "Sentiment": "negative",
            "PublishDate": 1740120390000,
            "Source": "corporate_action"
        },
        {
            "Title": "Maharashtra Scooters: Q3 Profit Soars 230% Despite Zero Revenue",
            "Summary": "Maharashtra Scooters reported Q3 FY25 results with profit rising 230% YoY to ₹3.3 crore, despite zero revenue. EPS increased to ₹2.9, up 229.55% YoY. SG&A expenses reduced by 88.24% YoY. Operating income slightly improved by 4.8% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1737093413000,
            "Source": "earnings"
        },
        {
            "Title": "Maharashtra Scooters Reports Q3 Revenue Decline",
            "Summary": "Maharashtra Scooters has reported a decrease in revenue for the third quarter. The company's revenue stood at 58 million rupees, down from 64 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1736926363000,
            "Source": "earnings"
        },
        {
            "Title": "Maharashtra Scooters Reports Significant EBITDA Growth in Q3",
            "Summary": "Maharashtra Scooters has reported a substantial increase in its Q3 EBITDA, which rose to 41 million rupees from 12 million rupees in the same quarter last year. The company's EBITDA margin also saw a remarkable improvement, jumping to 70.64% from 19% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1736926272000,
            "Source": "earnings"
        },
        {
            "Title": "Maharashtra Scooters Reports Significant Increase in Q3 Net Profit",
            "Summary": "Maharashtra Scooters has announced its financial results for the third quarter, reporting a net profit of 33 million rupees. This represents a substantial increase from the 10 million rupees net profit recorded in the same period of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1736926125000,
            "Source": "earnings"
        },
        {
            "Title": "Maharashtra Scooters Reports Q2 Revenue Decline",
            "Summary": "Maharashtra Scooters has reported a revenue of 1.6 billion rupees for the second quarter, compared to 2.06 billion rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1729489552000,
            "Source": "result"
        },
        {
            "Title": "Maharashtra Scooters Reports Q2 Net Profit Decline",
            "Summary": "Maharashtra Scooters has reported a net profit of 1.5 billion rupees for the second quarter, down from 1.98 billion rupees in the same period last year. This represents a year-over-year decrease in profits for the company.",
            "Sentiment": "negative",
            "PublishDate": 1729489524000,
            "Source": "result"
        },
        {
            "Title": "Maharashtra Scooters Schedules Board Meeting for Q2 Results",
            "Summary": "<p><span class=\"neutral\">Maharashtra Scooters</span> has announced a <b>board meeting</b> scheduled for <span class=\"neutral\">October 21</span> to <b>consider and approve</b> the company's <span class=\"neutral\">financial results</span> for the <span class=\"neutral\">second quarter</span> of the current fiscal year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728040428000,
            "Source": "result"
        }
    ]
}