{
    "Symbol": "MAHSEAMLES",
    "ISIN": "INE271B01025",
    "News": [
        {
            "Title": "Pfizer Q3FY26 Results Show Strong Growth Performance",
            "Summary": "Pfizer Limited reported Q3FY26 total income of ₹683.24 crore, marking 17.65% YoY growth. Net profit after tax surged 11.18% to ₹141.84 crore with earnings per share at ₹31.01.",
            "Sentiment": "positive",
            "PublishDate": 1770706236764,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maharashtra Seamless Q3 Net Profit Jumps 30.6% YoY",
            "Summary": "Maharashtra Seamless reported consolidated net profit of ₹2.43 billion in Q3, marking a significant 30.6% increase from ₹1.86 billion in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1769595361014,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maharashtra Seamless Q3FY26 Earnings Call on Jan 29",
            "Summary": "Maharashtra Seamless Limited announces Q3FY26 results conference call scheduled for January 29, 2026 at 4:00 PM IST, organized by ICICI Securities via virtual meeting platform.",
            "Sentiment": "neutral",
            "PublishDate": 1769428735270,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maharashtra Unveils $11B Innovation City at Davos 2026",
            "Summary": "Chief Minister Devendra Fadnavis announces Innovation City near Mumbai airport with $11 billion investments, targeting trillion-dollar economy through AI and data centres.",
            "Sentiment": "positive",
            "PublishDate": 1769085985590,
            "Source": "global"
        },
        {
            "Title": "Maharashtra Seamless Shuts Down Four Subsidiaries",
            "Summary": "Maharashtra Seamless has voluntarily decided to shut down four of its subsidiaries and associates as part of corporate restructuring activities.",
            "Sentiment": "neutral",
            "PublishDate": 1768570013559,
            "Source": "stocks"
        },
        {
            "Title": "Maharashtra Seamless Board Meet on Jan 28 for Q3FY26",
            "Summary": "Maharashtra Seamless Limited has scheduled its board meeting for January 28, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768477897887,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maharashtra Seamless Secures Rs 2.17 Billion Order from ONGC",
            "Summary": "Maharashtra Seamless has received an order worth Rs 2.17 billion from Oil and Natural Gas Corporation (ONGC). This significant contract award represents a substantial business win for the seamless pipe manufacturer from India's leading oil and gas exploration company.",
            "Sentiment": "positive",
            "PublishDate": 1764547002025,
            "Source": "order&deals"
        },
        {
            "Title": "Maharashtra Seamless Limited Secures Rs. 217 Crore Order from ONGC for Seamless Pipes",
            "Summary": "Maharashtra Seamless Limited received an order worth approximately Rs. 217 crores from ONGC Ltd. for supply of seamless pipes in the oil and gas sector. The order will be executed through gradual dispatches over the next few quarters as per customer requirements, representing a significant business win for the company.",
            "Sentiment": "positive",
            "PublishDate": 1764330443748,
            "Source": "order&deals"
        },
        {
            "Title": "Maharashtra Seamless's Jindal Explorer Rig Commences ONGC Operations Under 3-Year Charter",
            "Summary": "Maharashtra Seamless's Jindal Explorer drilling rig has begun operations for ONGC under a 3-year charter hire agreement. This operational commencement provides Maharashtra Seamless with a secured revenue stream from the state-owned oil and gas company for the contract duration.",
            "Sentiment": "positive",
            "PublishDate": 1763344528169,
            "Source": "order&deals"
        },
        {
            "Title": "Maharashtra Seamless Reports 27% EBITDA Decline in Q2 FY26 Due to Chinese Dumping and Oil Sector Slowdown",
            "Summary": "Maharashtra Seamless Limited reported a 27% decline in EBITDA to INR 123 crores and 44% drop in PAT to INR 130 crores for Q2 FY26. Revenue fell 5% to INR 1,234 crores. The company dispatched 103,000 tons of seamless pipes, maintaining volumes from the previous quarter. Management attributed margin pressure to three factors: slowdown in oil and gas sector expenditure, continuous Chinese dumping affecting the entire domestic industry, and notional inventory markdown due to IndAS requirements. Despite challenges, the order book improved 20% to INR 1,378 crores. The company maintains its highest credit rating of AA- in 11-12 years and treasury of INR 3,115 crores. Chinese imports account for 20-25% of total domestic industry size, impacting margins across all players. The Telangana finishing line project continues with INR 80 crores in purchase orders issued and INR 52 crores in payments made, expected to commence by end of financial year.",
            "Sentiment": "negative",
            "PublishDate": 1762993263011,
            "Source": "earnings"
        },
        {
            "Title": "Maharashtra Seamless Reports Q2 FY26 Results with Revenue of Rs 1,393 Crore",
            "Summary": "Maharashtra Seamless Limited announced its quarterly results for the period ended September 30, 2025. The company reported total revenue of Rs 1,393 crore with an EBITDA of Rs 123 crore, representing an EBITDA margin of 9%. The profit after tax stood at Rs 30 crore with a PAT margin of 2%. The company maintains a strong net cash position of Rs 3,105 crore as of September 30, 2025. Maharashtra Seamless holds a 55% market share in the seamless pipes segment and 18% in the API certified ERW pipes segment. The company has manufacturing facilities across Maharashtra and Telangana with a total seamless pipes capacity of 450,000 mt per annum and ERW pipes capacity of 325,000 mt per annum. The order book as of October 31, 2025 stands at Rs 4,002 crore. The company plans capital expenditure estimated at Rs 800 crore for capacity enhancement and facility upgrades, to be funded through internal accruals. Promoter holding increased to 69.05% during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762287773027,
            "Source": "earnings"
        },
        {
            "Title": "Maharashtra Seamless Reports ₹2,301 Crore H1FY26 Revenue, Maintains Market Leadership",
            "Summary": "Maharashtra Seamless reported revenue of ₹2,301 crore for H1FY26 while maintaining a 55% market share in seamless pipes. The company is expanding its ERW and coated pipe capacities and has an offshore rig contract scheduled for deployment in November 2025. The company is also diversifying into solar and wind energy sectors as part of its integrated growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1762268760052,
            "Source": "stock"
        },
        {
            "Title": "Maharashtra Seamless Reports 43% Decline in Q2 Net Profit to 1.25 Billion Rupees",
            "Summary": "Maharashtra Seamless reported consolidated net profit of 1.25 billion rupees for Q2, down from 2.2 billion rupees in the same quarter last year. Revenue declined to 11.6 billion rupees from 12.9 billion rupees year-over-year. EBITDA fell to 1.22 billion rupees compared to 2.31 billion rupees in the previous year, while EBITDA margin compressed to 10.56% from 17.88%.",
            "Sentiment": "negative",
            "PublishDate": 1762259551265,
            "Source": "earnings"
        },
        {
            "Title": "Maharashtra Seamless Secures ₹256 Crore Order for Oil and Gas Sector Pipes",
            "Summary": "Maharashtra Seamless has received a ₹256 crore order for seamless pipes in the oil and gas sector from a domestic entity. The order will be executed over two quarters.",
            "Sentiment": "positive",
            "PublishDate": 1758773828911,
            "Source": "order&deals"
        },
        {
            "Title": "Competition Commission of India Conducts Inquiry at Maharashtra Seamless Limited Offices",
            "Summary": "The Competition Commission of India conducted an inquiry at Maharashtra Seamless Limited's New Delhi and Gurgaon offices from September 15-16, 2025. The company cooperated fully with the authorities, providing necessary information, documentation and clarification during the inquiry process.",
            "Sentiment": "neutral",
            "PublishDate": 1758030080684,
            "Source": "stock"
        },
        {
            "Title": "Maharashtra Seamless Q1 FY26 Revenue Falls 11% to Rs 1,303 Crores Amid Order Booking Slowdown",
            "Summary": "Maharashtra Seamless Limited reported quarterly results showing revenue decline of 11% to Rs 1,303 crores compared to the previous quarter. EBITDA dropped significantly by 41% to Rs 165 crores, while PAT declined 4% to Rs 234 crores with EPS at Rs 17 per share. The company dispatched 1,03,000 tons of seamless pipes but faced a marked slowdown in order booking attributed to Chinese dumping and reduced oil and gas sector expenditure. Order book stands at Rs 1,149 crores, down Rs 400 crores quarter-on-quarter. Treasury position remains strong at Rs 2,919 crores as of June 30, 2025, with Rs 160 crores contributed to other income from treasury performance. The company maintains its AA+ credit rating and expects the September quarter to remain muted on the margin front. Two ongoing projects include a finishing line in Telangana with Rs 80 crores in purchase orders issued and cold drawn pipes project in Maharashtra with machine installations planned for August-September.",
            "Sentiment": "negative",
            "PublishDate": 1754290186949,
            "Source": "earnings"
        },
        {
            "Title": "Maharashtra Seamless Reports Strong Financial Position With ₹1,149 Crore Order Book",
            "Summary": "Maharashtra Seamless has reported multi-year growth supported by ₹852 crore in investments. The company maintains a robust order book of ₹1,149 crore and holds ₹2,914 crore in cash. The growth is attributed to increased government demand for pipes.",
            "Sentiment": "positive",
            "PublishDate": 1753888335939,
            "Source": "stock"
        },
        {
            "Title": "Maharashtra Seamless Reports Strong Q1 Results, Proposes New Independent Director and Secretarial Auditor",
            "Summary": "Maharashtra Seamless Limited's board approved unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs. 1,142.86 crores compared to Rs. 1,150.85 crores in the same quarter last year. Net profit after tax increased to Rs. 233.86 crores from Rs. 135.95 crores year-over-year. On a consolidated basis, revenue was Rs. 1,145.27 crores versus Rs. 1,150.98 crores in the previous year, with net profit rising to Rs. 230.30 crores from Rs. 128.84 crores. The board recommended appointing Mrs. Dipika Agarwal as Independent Director for five years starting September 28, 2025, and M/s Ajit Mishra & Associates as Secretarial Auditor for five consecutive years from FY 2025-26 to FY 2029-30, both subject to shareholder approval. The company operates in steel pipes & tubes, power-electricity, and rig segments.",
            "Sentiment": "positive",
            "PublishDate": 1753871303989,
            "Source": "earnings"
        },
        {
            "Title": "Maharashtra Seamless: Q4 Results Show Stable Margins, Limited Order Book Visibility",
            "Summary": "Maharashtra Seamless reported Q4 FY2025 results with revenue up 17% YoY to ₹1,417 crore and net profit up 11% to ₹242 crore. EBITDA margin narrowed to 20% from 22.66% YoY. The company's order book of ₹1,584 crore provides visibility for only one quarter. Cash reserves stand at ₹2,630 crore, representing 29% of market capitalization.",
            "Sentiment": "neutral",
            "PublishDate": 1748312159000,
            "Source": "earnings"
        },
        {
            "Title": "Maharashtra Seamless Reports Q4 Results and Dividend Recommendation",
            "Summary": "Maharashtra Seamless has announced its Q4 financial results. The company's consolidated net profit increased to 2.42 billion rupees, up from 2.18 billion rupees year-over-year. Revenue rose to 14.58 billion rupees from 12.59 billion rupees in the same period last year. EBITDA slightly increased to 2.85 billion rupees from 2.75 billion rupees, while the EBITDA margin decreased to 19.56% from 21.85% year-over-year. Additionally, the company has recommended a dividend of 10 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1748274636000,
            "Source": "result"
        },
        {
            "Title": "Maharashtra Seamless Limited: Secures ₹298 Crore Order for Seamless Pipes",
            "Summary": "Maharashtra Seamless Limited has received a ₹298 crore order for seamless pipes in the oil and gas sector from a domestic entity. The order will be executed over the next few quarters. The company expects 7-8% volume growth in FY25 for its seamless pipes business, aiming to dispatch around 435,000 tonnes this fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1742135839000,
            "Source": "order&deals"
        },
        {
            "Title": "Maharashtra Seamless Reports Q3 Financial Results",
            "Summary": "Maharashtra Seamless has announced its Q3 consolidated financial results. The company reported a net profit of 1.86 billion rupees, which is lower compared to 2.75 billion rupees in the same quarter last year and 2.2 billion rupees in the previous quarter. Revenue for Q3 stood at 14.1 billion rupees, slightly down from 14.3 billion rupees in the corresponding period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738023472000,
            "Source": "earnings"
        },
        {
            "Title": "Maharashtra Seamless: Q3 Profit Drops 33%, Revenue Dips 2%",
            "Summary": "Maharashtra Seamless reported a 32.6% YoY decline in Q3 net profit to ₹186.1 crore. Revenue fell 1.6% to ₹1,408.1 crore. EBITDA decreased 24.4% to ₹279.6 crore with margins contracting to 19.9%. The company appointed Arup Mandal as CFO and reappointed Saket Jindal as Managing Director for five years.",
            "Sentiment": "negative",
            "PublishDate": 1737982713000,
            "Source": "earnings"
        },
        {
            "Title": "Maharashtra Seamless Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Maharashtra Seamless has reported a decrease in its third-quarter EBITDA, which fell to 2.8 billion rupees from 3.7 billion rupees in the same period last year. The company's EBITDA margin also declined, dropping to 19.86% from 25.83% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1737978034000,
            "Source": "earnings"
        },
        {
            "Title": "Maharashtra Seamless Reports Q3 Revenue of 14.1 Billion Rupees",
            "Summary": "Maharashtra Seamless has announced its third quarter revenue results. The company reported revenue of 14.1 billion rupees, which represents a slight decrease compared to the 14.3 billion rupees reported in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1737978027000,
            "Source": "earnings"
        },
        {
            "Title": "Maharashtra Seamless Reports Decline in Q3 Consolidated Net Profit",
            "Summary": "Maharashtra Seamless Limited has reported a consolidated net profit of 1.86 billion rupees for the third quarter, showing a decrease from 2.75 billion rupees in the same period last year. The profit also declined sequentially from 2.2 billion rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1737978020000,
            "Source": "earnings"
        },
        {
            "Title": "Maharashtra Seamless to Consider Q3 Results on January 27",
            "Summary": "Maharashtra Seamless Limited has announced that it will consider its financial results for the third quarter on January 27. This indicates the company is preparing to disclose its performance for the most recent fiscal period to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1736855507000,
            "Source": "result"
        },
        {
            "Title": "Maharashtra Seamless Reports Q2 EBITDA Decline",
            "Summary": "Maharashtra Seamless experienced a decrease in Q2 EBITDA, dropping to 2.31 billion rupees from 3.32 billion rupees year-over-year. The company's EBITDA margin also declined, falling to 17.88% from 21.65% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730110631000,
            "Source": "result"
        },
        {
            "Title": "Maharashtra Seamless Reports Q2 Revenue Decline",
            "Summary": "Maharashtra Seamless, an Indian company, has reported its second quarter revenue for the current fiscal year. The company's revenue stood at 12.9 billion rupees, showing a decrease from 15.3 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1730110619000,
            "Source": "result"
        },
        {
            "Title": "Maharashtra Seamless Reports Q2 FY24 Financial Results",
            "Summary": "Maharashtra Seamless Limited has announced its consolidated net profit for the second quarter. The company reported a net profit of 2.2 billion rupees, which represents a year-over-year decrease from 2.5 billion rupees in the same quarter last year. However, it shows a quarter-over-quarter increase from 1.3 billion rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1730110609000,
            "Source": "result"
        }
    ]
}