{
    "Symbol": "MAITHANALL",
    "ISIN": "INE683C01011",
    "News": [
        {
            "Title": "Maithan Alloys Board Approves Promoter Reclassification",
            "Summary": "Maithan Alloys Limited board approves reclassification of four promoter group shareholders holding 5.11% stake to public category, subject to regulatory and shareholder approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1769860192775,
            "Source": "stocks"
        },
        {
            "Title": "Maithan Alloys Q3 Results: Revenue, Profit Decline",
            "Summary": "Maithan Alloys reports Q3 net profit of 865M rupees compared to 952M rupees year-on-year, while revenue drops to 5.2B rupees from 5.4B rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1769781423366,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maithan Alloys incorporates electronics subsidiary",
            "Summary": "Maithan Alloys Limited announces incorporation of subsidiary Maithan Electronics Private Limited for manufacturing electronics and electrical goods including wires and cables.",
            "Sentiment": "positive",
            "PublishDate": 1769520086345,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maithan Alloys Board Meet on Jan 30 for Q3FY26 Results",
            "Summary": "Maithan Alloys Limited has scheduled a board meeting on January 30, 2026, to consider and approve standalone and consolidated unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769059576390,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maithan Alloys Promoter Group Seeks Reclassification",
            "Summary": "Four promoter group members holding 5.11% stake request reclassification from promoter group to public category under SEBI regulations, with board to consider at next meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1768479807604,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maithan Alloys Acquires ₹25.04 Cr Bank of India Stake",
            "Summary": "Maithan Alloys Limited acquired 0.04% shareholding in Bank of India through stock exchange for ₹25.04 crores on January 6, 2026, comprising 16.48 lakh equity shares for investment benefits.",
            "Sentiment": "neutral",
            "PublishDate": 1767772992815,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maithan Alloys Acquires Bank of Baroda Shares Worth ₹35.05 Cr",
            "Summary": "Maithan Alloys Limited acquired 0.022% stake in Bank of Baroda through stock exchange purchase for ₹35.05 crores on January 5, 2026, comprising 1,138,000 shares for investment benefits.",
            "Sentiment": "neutral",
            "PublishDate": 1767695554904,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maithan Alloys Acquires Union Bank Shares for ₹42.85 Cr",
            "Summary": "Maithan Alloys Limited completed acquisition of 2,649,346 shares (0.03% stake) in Union Bank of India for ₹42.85 crores on January 5, 2026, as part of its investment strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1767695183422,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maithan Alloys Faces ₹1.61 Cr GST Demand Order",
            "Summary": "Maithan Alloys receives GST order demanding ₹97.51 lakh refund with ₹53.91 lakh interest and ₹9.75 lakh penalty for excess ITC compensation cess claim. Company evaluating options to contest.",
            "Sentiment": "negative",
            "PublishDate": 1765615925571,
            "Source": "stocks"
        },
        {
            "Title": "Maithan Alloys Gets CARE AA- Stable Rating Reaffirmed",
            "Summary": "CARE Ratings reaffirmed Maithan Alloys' long-term bank facilities rating at CARE AA- Stable and short-term facilities at CARE A1+ on December 10, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765438003588,
            "Source": "stocks"
        },
        {
            "Title": "Maithan Alloys General Manager Operations Resigns After 11 Years",
            "Summary": "B. Venugopal Rao, General Manager (Operations) at Maithan Alloys Limited, resigned effective November 15, 2025, to pursue new opportunities after serving the company for over 11 years. The resignation was tendered and accepted by management on November 13, 2025, representing a senior management change at the ferro alloys manufacturer.",
            "Sentiment": "neutral",
            "PublishDate": 1763063215602,
            "Source": "corporate_governance"
        },
        {
            "Title": "Maithan Alloys Makes Senior Management Changes and Authorizes NBFC Subsidiary Formation",
            "Summary": "Maithan Alloys appointed Mr. Sreejith Ariyanthari Thazhemadam as Senior Management Officer for Visakhapatnam Unit effective November 13, 2025, while accepting the resignation of Mr. Prasanna Kumar Mishra as Director (Operation) of Byrnihat Unit following the unit's sale. The Board also authorized Executive Directors to incorporate a subsidiary for Non-Banking Financial activities.",
            "Sentiment": "positive",
            "PublishDate": 1763061919015,
            "Source": "corporate_governance"
        },
        {
            "Title": "Maithan Alloys Reports ₹112 Crore Loss in Q2 FY26 Despite Strong Revenue Growth",
            "Summary": "Maithan Alloys Limited posted a standalone net loss of ₹112.07 crore for the quarter ended September 30, 2025, compared to a profit of ₹151.83 crore in the same period last year, despite revenue from operations increasing to ₹502.08 crore from ₹470.31 crore. The company also sold its Byrnihat Unit assets for ₹25.48 crore and received a customs duty refund of ₹30.54 crore during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1763050432973,
            "Source": "earnings"
        },
        {
            "Title": "Maithan Alloys' Subsidiary Restarts Ferro-Alloy Production After Two-Year Shutdown",
            "Summary": "Maithan Alloys Limited announced that its wholly owned subsidiary Impex Metal Ferro Alloys Limited has switched on one of its two furnaces for ferro-alloy manufacturing on November 11, 2025. The subsidiary had completely shut down production by the end of April 2023 for an indefinite period. Commercial production is expected to begin later this month, with the second furnace expected to restart within 5 to 7 days. The Board of Directors had approved a merger scheme between Impex and Maithan Alloys on May 28, 2025, which is awaiting approval from the National Company Law Tribunal.",
            "Sentiment": "positive",
            "PublishDate": 1762929369296,
            "Source": "stock"
        },
        {
            "Title": "Maithan Alloys Acquires 0.02% Stake in NBCC India for Rs 4.96 Crore",
            "Summary": "Maithan Alloys Limited acquired 442,400 shares representing 0.02% shareholding in NBCC (India) Limited through stock exchange transactions. The acquisition was completed on October 24, 2025, for a total consideration of Rs 4.96 crore in cash. The company stated the shares were acquired as part of its investment strategy to reap long-term and short-term investment benefits, with no intention to acquire control of NBCC's management. NBCC is a Government of India Navratna Enterprise specializing in project management consultancy, real estate development, and engineering procurement & construction activities. As of March 31, 2025, NBCC reported a turnover of Rs 8,725 crore, profit after tax of Rs 476 crore, and net worth of Rs 2,328 crore. The acquisition does not fall under related party transactions and required no governmental or regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1761371144109,
            "Source": "order&deals"
        },
        {
            "Title": "Maithan Alloys Acquires 0.04% Stake in NBCC India for Rs 12.27 Crore",
            "Summary": "Maithan Alloys Limited acquired 1,084,301 equity shares representing 0.04% shareholding in NBCC (India) Limited through stock exchange transactions for Rs 12.27 crore on October 20, 2025. The acquisition was made for long-term and short-term investment benefits, with Maithan Alloys stating it does not intend to acquire control of NBCC's management. NBCC is a Government of India Navratna Enterprise specializing in project management consultancy, civil construction, real estate, and engineering procurement activities. The company reported a turnover of Rs 8,725 crore, PAT of Rs 476 crore, and net worth of Rs 2,328 crore as of March 31, 2025. The transaction was conducted at arm's length with no related party involvement.",
            "Sentiment": "neutral",
            "PublishDate": 1761026641064,
            "Source": "order&deals"
        },
        {
            "Title": "Maithan Alloys Acquires 0.05% Stake in NBCC India for Rs 15 Crore",
            "Summary": "Maithan Alloys Limited acquired 1,340,400 equity shares representing 0.05% shareholding in NBCC (India) Limited through stock exchange transactions on October 17, 2025. The acquisition was completed at a total cost of Rs 15 crore as a cash consideration for investment purposes to generate long-term and short-term benefits. Maithan Alloys stated it does not intend to acquire control of NBCC's management. NBCC is a Government of India Navratna Enterprise specializing in project management consultancy, civil construction, real estate development, and engineering procurement activities. The company reported a turnover of Rs 8,725 crore and profit after tax of Rs 476 crore with a net worth of Rs 2,328 crore. The transaction was conducted at arm's length with no related party involvement or promoter interest in the target entity.",
            "Sentiment": "neutral",
            "PublishDate": 1760766350515,
            "Source": "order&deals"
        },
        {
            "Title": "Maithan Alloys Acquires 0.06% Stake in NBCC India for Rs 19.92 Crore",
            "Summary": "Maithan Alloys Limited acquired 1,750,000 equity shares representing 0.06% shareholding in NBCC (India) Limited through stock exchange transactions on October 16, 2025, for a total consideration of Rs 19.92 crore. The acquisition was made for long-term and short-term investment benefits, with Maithan Alloys stating it does not intend to acquire control of NBCC's management. NBCC is a Government of India Navratna Enterprise specializing in project management consultancy, civil construction, real estate development, and engineering procurement activities. The company reported a turnover of Rs 8,725 crore and profit after tax of Rs 476 crore. NBCC operates in India and four foreign countries including Maldives, Seychelles, Saudi Arabia, and Mauritius. The transaction does not constitute a related party transaction and no promoter group interest exists in the acquired entity.",
            "Sentiment": "neutral",
            "PublishDate": 1760684137304,
            "Source": "order&deals"
        },
        {
            "Title": "Maithan Alloys Acquires Stakes in NBCC India and State Bank of India Worth Rs 50.41 Crore",
            "Summary": "Maithan Alloys Limited acquired equity shares in two listed companies through stock exchange transactions on October 15, 2025. The company purchased 892,850 shares (0.03% stake) in NBCC (India) Limited for Rs 9.96 crore and 457,000 shares (0.005% stake) in State Bank of India for Rs 40.45 crore. Both acquisitions were made for investment purposes to generate long-term and short-term benefits, with Maithan Alloys stating it does not intend to acquire management control of either entity. NBCC is a government enterprise specializing in civil construction and project management consultancy, while SBI is a public sector bank providing banking and financial services. The transactions were conducted at arm's length with cash consideration and did not involve related party transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1760597247743,
            "Source": "order&deals"
        },
        {
            "Title": "Maithan Alloys Acquires Stakes in State Bank of India and NBCC for Rs 70.06 Crore",
            "Summary": "Maithan Alloys Limited acquired equity shares in two companies through stock exchange transactions on October 14, 2025. The company purchased 683,000 shares (0.007% stake) in State Bank of India for Rs 60.05 crore and 905,000 shares (0.03% stake) in NBCC (India) Limited for Rs 10.01 crore, totaling Rs 70.06 crore in cash consideration. Both acquisitions were made for long-term and short-term investment benefits, with Maithan Alloys stating it does not intend to acquire management control of either entity. The transactions were conducted at arm's length and do not involve related party transactions. State Bank of India reported a turnover of Rs 462,489 crore and PAT of Rs 70,901 crore, while NBCC reported a turnover of Rs 8,725 crore and PAT of Rs 476 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1760526717685,
            "Source": "order&deals"
        },
        {
            "Title": "Maithan Alloys Acquires 0.012% Stake in State Bank of India for Rs 98.84 Crore",
            "Summary": "Maithan Alloys Limited acquired 1,116,058 equity shares of State Bank of India through stock exchange transactions on October 13, 2025, representing a 0.012% shareholding. The acquisition cost Rs 98.84 crore and was made for long-term/short-term investment benefits. The transaction was conducted at arm's length with cash consideration and does not involve any related party transactions. Maithan Alloys stated it does not intend to acquire control of SBI's management. State Bank of India reported a turnover of Rs 462,489 crore and profit after tax of Rs 70,901 crore as of March 31, 2025. The acquisition triggered disclosure requirements under SEBI regulations due to threshold limits being reached.",
            "Sentiment": "neutral",
            "PublishDate": 1760427405772,
            "Source": "order&deals"
        },
        {
            "Title": "Maithan Alloys Completes Sale of Byrnihat Unit Capital Assets",
            "Summary": "Maithan Alloys has sold all capital assets of its Byrnihat unit located in Meghalaya. The sale was finalized on October 3, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1759738559483,
            "Source": "stock"
        },
        {
            "Title": "Maithan Alloys Authorizes Sale of Capital Assets from Closed Byrnihat Unit in Meghalaya",
            "Summary": "Maithan Alloys Limited's Board of Directors authorized the sale of capital assets from its Byrnihat Unit located in Ri-Bhoi District, Meghalaya, through a resolution passed on September 26, 2025. The decision follows the closure of production at this facility, which was previously communicated to exchanges in letters dated June 30, August 13, and September 22, 2025. The company's officers have been authorized to proceed with selling the capital assets from the closed unit.",
            "Sentiment": "negative",
            "PublishDate": 1758889439080,
            "Source": "corporate_action"
        },
        {
            "Title": "Maithan Alloys Suspends Production at Byrnihat Unit Due to Market Conditions and Rising Power Costs",
            "Summary": "Maithan Alloys Limited has fully suspended production at its Byrnihat Unit effective September 22, 2025, due to adverse market conditions and steep increase in power costs in Meghalaya. The closure, initially planned for September 30, was implemented earlier than anticipated. The suspension is for an indefinite period and affects the company's operations in the state of Meghalaya.",
            "Sentiment": "negative",
            "PublishDate": 1758528553778,
            "Source": "stock"
        },
        {
            "Title": "Maithan Alloys Sets Record Date for ₹16 Per Share Final Dividend with TDS Guidelines",
            "Summary": "Maithan Alloys Ltd announced a final dividend of ₹16 per equity share for financial year 2024-2025, with the record date set for September 19, 2025. The company's register of members and share transfer books will remain closed from September 20-27, 2025. The dividend will be subject to tax deduction at source (TDS) at varying rates depending on shareholder categories. Non-resident shareholders will face 20% TDS (plus surcharge and cess) or applicable Double Tax Avoidance Agreement rates, whichever is lower. Resident shareholders will have 10% TDS deducted, except individual shareholders receiving dividends below ₹10,000 annually who are exempt. Shareholders without valid PAN will face higher 20% TDS rates. The company requires specific documentation from shareholders to claim exemptions or beneficial treaty rates, with a deadline of September 30, 2025 for submission of relevant documents.",
            "Sentiment": "neutral",
            "PublishDate": 1758100440139,
            "Source": "corporate_action"
        },
        {
            "Title": "Maithan Alloys Sets Record Date for Rs. 6 Final Dividend for FY2024-25",
            "Summary": "Maithan Alloys Limited announced a final dividend of Rs. 6 per equity share of Rs. 10 each (60%) for financial year 2024-25. The record date is set for Friday, 19th September, 2025, with book closure from 20th to 27th September, 2025. The Board of Directors recommended this dividend at their meeting on 28th May, 2025. The dividend payment requires shareholder approval at the Annual General Meeting scheduled for Saturday, 27th September, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1757935669577,
            "Source": "corporate_action"
        },
        {
            "Title": "Maithan Alloys Declares Interim Dividend with Record Date Set for February 19, 2025",
            "Summary": "Maithan Alloys Limited has announced the declaration of an interim dividend for the financial year 2024-25. The company has set the record date as February 19, 2025, for determining shareholders eligible for the interim dividend payment. The dividend amount is Rs 3 per equity share (representing 30% of the face value of Rs 10 per share). The announcement was made through newspaper advertisements published in Financial Express (English) and Arthiklipi (Bengali) on February 12, 2025. The interim dividend will be paid to shareholders whose names appear in the company's records or are registered with depositories as beneficial owners on the record date.",
            "Sentiment": "positive",
            "PublishDate": 1757139042076,
            "Source": "corporate_action"
        },
        {
            "Title": "Maithan Alloys Extends Byrnihat Unit Closure Date to September 30, 2025",
            "Summary": "Maithan Alloys Limited has extended the closure date of its Byrnihat Unit from August 31, 2025 to September 30, 2025. The Board of Directors made this decision on August 13, 2025, citing pending orders as the reason for the extension. The closure was initially planned due to adverse market conditions and steep increase in power costs in Meghalaya. The production shutdown at the Byrnihat Unit will be for an indefinite period.",
            "Sentiment": "negative",
            "PublishDate": 1755092180659,
            "Source": "stock"
        },
        {
            "Title": "Maithan Alloys Reports Strong Q1 Growth with Net Profit Rising to 5.4 Billion Rupees",
            "Summary": "Maithan Alloys delivered robust quarterly performance with net profit increasing to 5.4 billion rupees from 4.59 billion rupees year-over-year. Revenue surged significantly to 6.5 billion rupees compared to 3.7 billion rupees in the same period last year. The company's EBITDA more than doubled to 505 million rupees from 227 million rupees year-over-year, while EBITDA margin improved to 7.72% from 6.12% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755086454421,
            "Source": "earnings"
        },
        {
            "Title": "Maithan Alloys Incorporates Wholly-Owned Subsidiary for Agriculture and Real Estate Business",
            "Summary": "Maithan Alloys Limited has incorporated a new wholly-owned subsidiary, Maithan Nutrition Private Limited, to explore opportunities in agricultural, food processing, and real estate business activities. The subsidiary was incorporated on July 25, 2025, with an authorized capital of 1.5 lakh equity shares at Rs. 10 each, totaling Rs. 0.15 crore. The company and its nominees have subscribed to 100% shareholding through cash consideration. The Board of Directors had previously authorized this incorporation at their meeting held on May 28, 2025. The newly incorporated subsidiary is yet to commence business operations and has no previous turnover history. This expansion represents Maithan Alloys' diversification beyond its main line of business into agricultural and real estate sectors.",
            "Sentiment": "positive",
            "PublishDate": 1753449198852,
            "Source": "corporate_action"
        },
        {
            "Title": "Maithan Alloys to Close Byrnihat Unit in Meghalaya",
            "Summary": "Maithan Alloys has announced the indefinite closure of its Byrnihat unit in Meghalaya, effective August 31, 2025. The company cites poor market conditions and increasing electricity costs as the reasons for this decision.",
            "Sentiment": "negative",
            "PublishDate": 1751268210000,
            "Source": "default"
        },
        {
            "Title": "Maithan Alloys Reports Q4 Net Loss of 662M Rupees",
            "Summary": "Maithan Alloys has reported its Q4 financial results. The company experienced a net loss of 662 million rupees, compared to a loss of 1.37 billion rupees in the same quarter last year and 952 million rupees in the previous quarter. Revenue for Q4 was 4.4 billion rupees, slightly up from 4.33 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748449017000,
            "Source": "result"
        },
        {
            "Title": "NSE Approves Maithan Alloys' Request for 100,000 Shares",
            "Summary": "Maithan Alloys has announced that the National Stock Exchange (NSE) has granted approval for their request and the company has received 100,000 NSE shares.",
            "Sentiment": "positive",
            "PublishDate": 1743120723000,
            "Source": "corporate_action"
        },
        {
            "Title": "Maithan Alloys Receives NSE Approval and 100,000 Shares",
            "Summary": "Maithan Alloys has announced that it has received approval from the National Stock Exchange (NSE) and has been granted 100,000 NSE shares.",
            "Sentiment": "positive",
            "PublishDate": 1743080219000,
            "Source": "corporate_action"
        },
        {
            "Title": "Maithan Alloys Resumes Operations at Byrnihat Unit",
            "Summary": "Maithan Alloys has announced the resumption of operations at its Byrnihat unit. This follows the revocation of a 'Notice of Closure' that was previously issued by the Meghalaya State Pollution Control Board. The lifting of this notice allows the company to restart production at the facility.",
            "Sentiment": "positive",
            "PublishDate": 1741739395000,
            "Source": "corporate_action"
        },
        {
            "Title": "Maithan Alloys Resumes Operations at Byrnihat Unit",
            "Summary": "Maithan Alloys has announced the resumption of operations at its Byrnihat unit. This follows the revocation of a 'Notice of Closure' that was previously issued by the Meghalaya State Pollution Control Board.",
            "Sentiment": "positive",
            "PublishDate": 1741706176000,
            "Source": "corporate_action"
        },
        {
            "Title": "Maithan Alloys Declares Interim Dividend",
            "Summary": "Maithan Alloys has announced an interim dividend of Rs 3 per share for its shareholders. This corporate action represents a distribution of profits to the company's investors.",
            "Sentiment": "positive",
            "PublishDate": 1739271355000,
            "Source": "corporate_action"
        },
        {
            "Title": "Maithan Alloys Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Maithan Alloys has reported a decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 310 million rupees from 352 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin decreased to 5.74% from 7.86% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739271350000,
            "Source": "earnings"
        },
        {
            "Title": "Maithan Alloys Reports Increased Q3 Profit and Revenue",
            "Summary": "Maithan Alloys has announced its financial results for the third quarter. The company's net profit rose to 952 million rupees, up from 874 million rupees in the same period last year. Revenue also increased, reaching 5.4 billion rupees compared to 4.47 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739271344000,
            "Source": "earnings"
        },
        {
            "Title": "Maithan Alloys Faces Closure Notice for Byrnihat Unit",
            "Summary": "Maithan Alloys has received a closure notice from the Meghalaya State Pollution Control Board (SPCB) for its Byrnihat unit. The notice was issued due to non-compliance with directions previously given by the SPCB. This regulatory action could potentially impact the company's operations in the region.",
            "Sentiment": "negative",
            "PublishDate": 1738847608000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Maithan Alloys Considers Land Acquisition Proposals",
            "Summary": "Maithan Alloys is evaluating various proposals for acquiring land, including the potential acquisition of companies or corporate entities that own land. The company is particularly interested in properties located in or around the National Capital Region (NCR) of Delhi.",
            "Sentiment": "neutral",
            "PublishDate": 1736900164000,
            "Source": "corporate_action"
        },
        {
            "Title": "Maithan Alloys to Consider Land Acquisition Proposals",
            "Summary": "Maithan Alloys is planning to evaluate various proposals for acquiring land, including the potential acquisition of companies or corporate entities that own land. The company is particularly interested in properties located in or around the National Capital Region (NCR) of Delhi.",
            "Sentiment": "neutral",
            "PublishDate": 1736855143000,
            "Source": "corporate_action"
        },
        {
            "Title": "Maithan Alloys Reports Improved Q2 Financial Performance",
            "Summary": "Maithan Alloys has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 325 million rupees to 492 million rupees. Additionally, the EBITDA margin expanded from 7.32% to 10.61%.",
            "Sentiment": "positive",
            "PublishDate": 1731327667000,
            "Source": "result"
        },
        {
            "Title": "Maithan Alloys Reports Q2 Revenue Growth",
            "Summary": "Maithan Alloys, a company in the alloys sector, has reported its second quarter revenue. The company's revenue for Q2 stands at 4.6 billion rupees, compared to 4.43 billion rupees in the same quarter last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731327482000,
            "Source": "result"
        },
        {
            "Title": "Maithan Alloys Reports Significant Profit Increase in Q2",
            "Summary": "Maithan Alloys has reported a substantial increase in consolidated net profit for the second quarter. The company's net profit rose to 1.4 billion rupees, up from 619 million rupees in the same quarter last year. This represents a year-over-year increase of approximately 126%. Additionally, the profit showed a significant quarter-over-quarter increase from 4.6 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731327431000,
            "Source": "result"
        },
        {
            "Title": "Maithan Alloys to Resume Production at Byrnihat Unit",
            "Summary": "Maithan Alloys has announced that production at their Byrnihat unit will resume within the next week. The company plans to gradually increase production levels at this facility.",
            "Sentiment": "positive",
            "PublishDate": 1729165851000,
            "Source": "corporate_action"
        }
    ]
}