{
    "Symbol": "MALLCOM",
    "ISIN": "INE389C01015",
    "News": [
        {
            "Title": "Mallcom India Sets EBITDA Margin Guidance at 13-15%",
            "Summary": "Mallcom India management provides forward guidance with EBITDA margins expected between 13-15% and PAT margins in the 8-9% range during recent conference call.",
            "Sentiment": "positive",
            "PublishDate": 1769134776722,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mallcom India Q3FY26 earnings call on Jan 22",
            "Summary": "Mallcom (India) Ltd has scheduled its Q3FY26 earnings conference call for January 22, 2026, at 4:00 PM IST to discuss quarterly financial performance with key management.",
            "Sentiment": "neutral",
            "PublishDate": 1768399492440,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mallcom India Q2FY26 Earnings: Revenue Grows 8% to INR 139 Crores, EBITDA Margin Drops to 7.1%",
            "Summary": "Mallcom India reported 8% year-on-year revenue growth to INR 139 crores in Q2FY26, but EBITDA margin contracted sharply by 513 basis points to 7.1% due to higher import costs and currency headwinds. The company's new Protech facility at Sanand, Gujarat commenced commercial production with INR 100 crores investment, while management expects margins to recover to 13-14% levels by Q4FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1763646518782,
            "Source": "earnings"
        },
        {
            "Title": "Mallcom India Plans Growth Through New Guwahati PPE Plant and International Expansion",
            "Summary": "Mallcom India is establishing a new PPE manufacturing plant in Guwahati while expanding operations into Europe and Latin America markets. The company is diversifying its product portfolio into industrial workwear and safety shoes, with a strong export order pipeline expected to enhance revenue visibility and margin stability.",
            "Sentiment": "positive",
            "PublishDate": 1763052362792,
            "Source": "stock"
        },
        {
            "Title": "Mallcom India Reports Q2 FY26 Results with Revenue of Rs 1,393 Mn and EBITDA Margin of 7.11%",
            "Summary": "Mallcom India Limited announced consolidated quarterly results for the quarter ended September 30, 2025, reporting revenue from operations of Rs 1,393 million with an EBITDA of Rs 99 million and net profit of Rs 37.4 million. The company's EBITDA margin decreased to 7.11% in Q2 FY26 compared to previous periods, while the half-year performance showed revenue of Rs 2,618 million with EBITDA margin of 10.50%.",
            "Sentiment": "negative",
            "PublishDate": 1763050348398,
            "Source": "earnings"
        },
        {
            "Title": "Mallcom India Submits September 2025 Investor Presentation Highlighting PPE Manufacturing Operations",
            "Summary": "Mallcom (India) Limited submitted its September 2025 investor presentation to stock exchanges. The company operates as one of India's largest Personal Protective Equipment (PPE) manufacturers, founded in 1983 by Ajay Mall. The company employs over 3,000 workers across 13 manufacturing facilities spanning over 1 million sq. ft in West Bengal, Uttarakhand, and Gujarat. Mallcom exports to 55+ countries across 6 continents with over 90% orders from repeat customers. For Q1-FY26, operational revenue reached INR 1,224 million with EBITDA margins of 14.38%. The company's product portfolio includes safety shoes (45% of revenue), garments (24%), and gloves (27%). Revenue mix shows Asia contributing 46%, Europe 36%, and Americas 17%. The global PPE market is valued at USD 58.64 billion in 2023 with expected CAGR of 7.3% through 2032, while the Indian PPE market is projected to grow at 10.20% CAGR from USD 841.4 million in 2023 to USD 1.5 billion by 2029.",
            "Sentiment": "positive",
            "PublishDate": 1758528109562,
            "Source": "stock"
        },
        {
            "Title": "Mallcom India Reports 19.5% Revenue Growth in Q1 FY26, Commences Operations at New Gujarat Facility",
            "Summary": "Mallcom (India) Limited reported consolidated revenue of Rs.122 crores for Q1 FY26, marking 19.5% year-on-year growth. EBITDA increased 23.1% to Rs.18 crores with margins improving to 14.38% from 13.96% in the previous year. Net profit stood at Rs.10 crores with PAT margin at 8.09%. The company commenced commercial operations at its new Pro-tech unit in Sanand, Gujarat from July 1, 2025, after investing Rs.95 crores in Phase-I. Management expects Rs.10-15 crores turnover from this facility in the current financial year. The second phase expansion of the Chandipur unit for industrial safety shoes is operational with expected turnover of Rs.25-30 crores. The company received Silver Category Award from FIEO for export excellence and established a UAE office to strengthen Middle East and Africa presence. Management targets maintaining 20-25% growth rate despite potential US tariff impacts, citing limited US exposure and growth opportunities in other markets including domestic, Middle East, and Europe.",
            "Sentiment": "positive",
            "PublishDate": 1754655098831,
            "Source": "earnings"
        },
        {
            "Title": "Mallcom (India) Sets Record Date for ₹3 Per Share Final Dividend",
            "Summary": "Mallcom (India) Ltd has set August 23, 2025, as the record date for determining shareholders eligible to receive a final dividend of ₹3 per equity share for financial year 2024-25. The dividend represents 30% of the face value of ₹10 per share and is subject to approval at the company's 41st Annual General Meeting. The Board of Directors recommended this dividend on May 19, 2025. If approved, the dividend will be paid within 30 days from the AGM approval date, subject to applicable tax deductions.",
            "Sentiment": "positive",
            "PublishDate": 1754578820321,
            "Source": "corporate_action"
        },
        {
            "Title": "Mallcom India Reports 19.5% Revenue Growth in Q1 with Margin Expansion",
            "Summary": "Mallcom (India) Ltd, a personal protective equipment manufacturer, reported operational revenue of INR 1,224 million for Q1, representing a 19.5% year-over-year increase from INR 1,024 million. The company's EBITDA margin improved to 14.38% from 13.96% in the previous quarter, with net profit rising 16.5% to INR 99 million. The company commenced commercial operations at its new Protec workwear unit in Sanand, Gujarat from July 1, 2025, with a projected turnover of INR 15 crore for the current financial year. Additionally, the second phase expansion at Chandipur, West Bengal for industrial safety shoes manufacturing is operational and expected to generate INR 25-30 crore turnover. Mallcom established an office in UAE to address Middle East and Africa markets and received a Silver category award from FIEO for export performance. The company exports to 55+ countries across 6 continents, with Q1 geographical revenue mix showing Asia at 46%, Europe at 36%, Americas at 17%, and Australia at 1%.",
            "Sentiment": "positive",
            "PublishDate": 1754323453950,
            "Source": "earnings"
        },
        {
            "Title": "MALLCOM Reports Strong Q1 Performance with Revenue Growth to 1.18B Rupees",
            "Summary": "MALLCOM delivered robust quarterly results with revenue increasing to 1.18 billion rupees from 992 million rupees year-over-year. The company's EBITDA rose to 167 million rupees compared to 138 million rupees in the same period last year, while EBITDA margin improved to 14.08% from 13.91%. Net profit grew to 97 million rupees versus 85.5 million rupees year-over-year, reflecting strong operational performance across key financial metrics.",
            "Sentiment": "positive",
            "PublishDate": 1754319220662,
            "Source": "earnings"
        },
        {
            "Title": "Mallcom India Approves Q1 FY2026 Results and Appoints New Auditors",
            "Summary": "Mallcom India Ltd's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of ₹13,328.38 lakhs compared to ₹11,843.53 lakhs in the previous quarter, with profit after tax of ₹855.17 lakhs versus ₹973.83 lakhs previously. Basic earnings per share stood at ₹13.70. The Board appointed M/s Agarwal Maheswari & Co. as statutory auditors for five years from the 41st to 46th Annual General Meeting, replacing M/s S.K. Singhania & Co. whose second term concludes at the upcoming AGM. Ms. Ankita Dalmia was appointed as secretarial auditor for financial years 2025-26 to 2029-30. Both appointments require shareholder approval at the Annual General Meeting. The company operates in industrial safety products with sales divided between India (₹5,368.51 lakhs) and outside India (₹6,475.02 lakhs) for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754319136183,
            "Source": "earnings"
        },
        {
            "Title": "Mallcom Reports Q4 Financial Results and Dividend Announcement",
            "Summary": "Mallcom has released its Q4 financial results. The company's net profit for Q4 is 307 million rupees, compared to 120.5 million rupees year-over-year and 94 million rupees quarter-over-quarter. Q4 revenue is reported at 1.3 billion rupees, up from 1.2 billion rupees year-over-year. Additionally, Mallcom has recommended a dividend of 3 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747700301000,
            "Source": "default"
        },
        {
            "Title": "Mallcom Recommends Dividend of 3 Rupees per Equity Share",
            "Summary": "Mallcom has recommended a dividend of 3 rupees per equity share. No additional details about the time period or fiscal year were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747666297000,
            "Source": "result"
        },
        {
            "Title": "MALLCOM Reports Q4 Financial Results",
            "Summary": "MALLCOM has released its Q4 financial results. The company's EBITDA for Q4 was 158 million rupees, compared to 160 million rupees in the same quarter last year. The EBITDA margin decreased to 11.82% from 13.47% year-over-year. Net profit for Q4 increased to 307 million rupees, up from 120.5 million rupees in the previous year and 94 million rupees in the previous quarter. Q4 revenue rose to 1.3 billion rupees from 1.2 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747666266000,
            "Source": "result"
        },
        {
            "Title": "Mallcom India Sells Kolkata Land for Rs. 27 Crore",
            "Summary": "Mallcom (India) has sold a piece of land in Kolkata to KJN Housing LLP for Rs. 27 crore. The company's current market capitalization is Rs. 720 crore.",
            "Sentiment": "positive",
            "PublishDate": 1741771123000,
            "Source": "corporate_action"
        },
        {
            "Title": "MALLCOM Reports Improved Q3 Financial Performance",
            "Summary": "MALLCOM has announced its Q3 financial results, showing significant improvement in key metrics. The company's EBITDA increased to 143 million rupees, up from 104 million rupees in the same quarter last year. Additionally, MALLCOM's EBITDA margin expanded to 12.56%, compared to 11.30% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738243045000,
            "Source": "earnings"
        },
        {
            "Title": "MALLCOM Reports Strong Q3 Financial Results",
            "Summary": "MALLCOM has announced its financial results for the third quarter. The company's net profit increased to 94 million rupees, up from 61 million rupees year-over-year and 99 million rupees quarter-over-quarter. Revenue for Q3 rose to 1.13 billion rupees, compared to 920 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738242990000,
            "Source": "earnings"
        }
    ]
}