{
    "Symbol": "MALUPAPER",
    "ISIN": "INE383H01017",
    "News": [
        {
            "Title": "Malu Paper Mills Reports Q3 FY26 Loss of ₹509.78 Lacs",
            "Summary": "Malu Paper Mills posted EBITDA loss of ₹309.20 lacs in Q3 FY26 due to challenging market conditions. Company secured Maharashtra State Board tender for Writing and Printing Paper supply.",
            "Sentiment": "negative",
            "PublishDate": 1770814308184,
            "Source": "co_actions_results"
        },
        {
            "Title": "Malu Paper Mills Reports Quarterly Loss of Rs 588.12 Lakhs",
            "Summary": "Malu Paper Mills Limited reported a net loss of Rs 588.12 lakhs for the quarter ended September 30, 2025, compared to Rs 1,174.28 lakhs loss in the previous period, with total income from operations at Rs 564.36 lakhs. The company's Unit-II remained shut for 61 days during the quarter due to weak market demand and challenging market conditions affecting operational performance.",
            "Sentiment": "negative",
            "PublishDate": 1763064154550,
            "Source": "earnings"
        },
        {
            "Title": "Malu Paper Mills Reports Quarterly Loss of ₹615.16 Lakhs Amid Rising Input Costs",
            "Summary": "Malu Paper Mills Limited released unaudited financial results for the quarter ended June 30, 2025. The company reported a net loss of ₹615.16 lakhs compared to ₹196.84 lakhs loss in the same quarter last year. Total income from operations increased to ₹9,443.63 lakhs from ₹5,765.83 lakhs year-over-year. The company posted an EBITDA loss of ₹476.86 lakhs and cash loss of ₹730.39 lakhs, driven by elevated input costs that adversely affected operational margins. Earnings per share stood at negative ₹3.61. Promoters have pledged further capital infusion as needed for the company's revival. The company is taking steps to monetize surplus land assets to strengthen the balance sheet and improve liquidity. Strategic direction includes a focused approach toward Writing and Printing Paper segment with planned expansion into Kraft Paper market for manufacturing paper bags and sacks.",
            "Sentiment": "negative",
            "PublishDate": 1754650668552,
            "Source": "earnings"
        },
        {
            "Title": "Malu Paper Mills Reports Rs 1,213 Crore Loss for FY2025, Negative Net Worth of Rs 572 Crore",
            "Summary": "Malu Paper Mills Limited reported a net loss of Rs 1,212.65 crore for the financial year ended March 31, 2025, compared to a net profit of Rs 92.71 crore in the previous year. The company's revenue increased marginally to Rs 27,788.82 crore from Rs 27,444.08 crore. The company now has a negative net worth of Rs 572.17 crore as of March 31, 2025, compared to a positive net worth of Rs 679.79 crore in the previous year. The adverse financial position is attributed to challenging economic and market conditions in the paper industry. The company produced 80,669 MT of paper in FY2025, slightly down from 82,442 MT in FY2024, with a strategic shift toward Kraft paper production which increased to 59,825 MT from 47,439 MT. Management has initiated strategic measures including product mix optimization and promoters have expressed intent to infuse additional funds to support the turnaround.",
            "Sentiment": "negative",
            "PublishDate": 1753790710959,
            "Source": "corporate_action"
        }
    ]
}