{
    "Symbol": "MAMATA",
    "ISIN": "INE0TO701015",
    "News": [
        {
            "Title": "Mamata Machinery Unveils Rectech at Plastindia 2026",
            "Summary": "Mamata Machinery introduces innovative recyclable packaging technology Rectech at Plastindia 2026, showcasing advancement in sustainable packaging solutions for the plastics industry.",
            "Sentiment": "positive",
            "PublishDate": 1770273509954,
            "Source": "stocks"
        },
        {
            "Title": "Mamata Machinery Gets European Patent for Cross Sealing Device",
            "Summary": "Mamata Machinery secures patent for Cross Sealing Device from European Patent Office, adding to earlier approvals from India and USA, strengthening its intellectual property portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1769751471030,
            "Source": "stocks"
        },
        {
            "Title": "Mamata Machinery Reports 25% Revenue Growth in Q2 FY26, Secures Advanced Co-Extrusion Orders",
            "Summary": "Mamata Machinery Limited delivered strong quarterly results with 25% year-on-year revenue growth in Q2 and 31% growth in H1 FY26, maintaining a 70:30 export-to-domestic sales ratio and securing three new orders for advanced 9-layer blown-film plants. The company holds an order book of INR 144 crores with US exposure of INR 15 crores, while developing recyclable packaging solutions and expanding its global presence in packaging machinery markets.",
            "Sentiment": "positive",
            "PublishDate": 1763200679346,
            "Source": "earnings"
        },
        {
            "Title": "Mamata Machinery Reports 31% Revenue Growth in H1 FY26 with Strong Export Orders",
            "Summary": "Mamata Machinery Limited announced its quarterly results with revenue of ₹5,337 lakhs in Q2 FY26, marking 25% year-on-year growth. For H1 FY26, revenue reached ₹9,203 lakhs, up 31% year-on-year. EBITDA for H1 FY26 grew 86% to ₹973 lakhs, while PAT increased 47% to ₹718 lakhs. The company secured three orders for 9-layer blown film plants, with two scheduled for delivery within the current financial year. Two orders are from export markets including UAE and Latin America, while one is domestic. The company participated in PACK EXPO Las Vegas 2025 and K 2025 in Düsseldorf, launching new products including HFSS Duplex packaging line. CEO Apurva Kane noted that Q2 FY26 profitability witnessed marginal decrease due to higher exhibition expenses. The company operates as a leading provider of flexible packaging machinery solutions with over 5,000 machine installations across 80 countries.",
            "Sentiment": "positive",
            "PublishDate": 1762568005894,
            "Source": "earnings"
        },
        {
            "Title": "Mamata Machinery Reports Mixed Q2 Results with Revenue Growth and Profit Decline",
            "Summary": "Mamata Machinery reported quarterly consolidated net profit of 45 million rupees compared to 47 million rupees in the same period last year, representing a decline. The company's quarterly revenue increased to 534 million rupees from 428 million rupees year-over-year, showing growth in the top line despite the profit decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1762519383356,
            "Source": "earnings"
        },
        {
            "Title": "Mamata Machinery Reschedules Earnings Conference Call to November 12",
            "Summary": "Mamata Machinery Limited has rescheduled its earnings conference call with investors from November 10, 2025 to November 12, 2025 at 3:30 p.m. IST. The call will discuss the company's Q2 and H1 FY26 performance. Management participants include CEO Apurva N. Kane and Company Secretary & Chief Financial Officer Madhuri Sharma. The audio and transcript of the call will be made available on the company's website at www.mamata.com following the session.",
            "Sentiment": "neutral",
            "PublishDate": 1762460356111,
            "Source": "corporate_action"
        },
        {
            "Title": "Mamata Machinery Secures Third Consecutive 9-Layer Blown Film Plant Order from UAE Customer",
            "Summary": "Mamata Machinery Limited announced securing its third consecutive order for a 9-layer blown film plant from a UAE-based customer. The order is valued at approximately USD 1.17 million and represents the company's second major export order in this product category. The plant will be commissioned for high-barrier film production with delivery scheduled for Q4FY26. This follows two earlier order wins from customers in India and Latin America, expanding the company's international presence in Co-Extrusion solutions. Mamata Machinery is a flexible packaging machinery provider with over 35 years of experience and more than 5,000 machine installations across 80 countries.",
            "Sentiment": "positive",
            "PublishDate": 1757418075832,
            "Source": "order&deals"
        },
        {
            "Title": "Mamata Machinery Secures Second Export Order Worth USD 1.17 Million for 9-Layer Blown Film Plant",
            "Summary": "Mamata Machinery Limited has secured its second export order for a 9-layer blown film plant valued at approximately USD 1.17 million. The order comes from an international entity whose name is withheld due to confidentiality obligations. The advanced plant will be used to manufacture high barrier films for critical applications under the company's Co-Extrusion product segment. The order is scheduled to be executed by the quarter ending March 31, 2026. The transaction does not involve any promoter group interest or related party arrangements.",
            "Sentiment": "positive",
            "PublishDate": 1757417619272,
            "Source": "order&deals"
        },
        {
            "Title": "Mamata Machinery Reports 38% Revenue Growth in Q1FY26 with Strong Converting Machinery Performance",
            "Summary": "Mamata Machinery Limited reported revenue of ₹382 million for the quarter ended June 30, 2025, marking a 38% year-over-year growth. EBITDA increased to ₹26 million (935% YoY growth) with a 7% margin, while PAT reached ₹26 million (1,112% YoY growth). The converting machinery segment drove performance with 73% YoY revenue growth to ₹608 million, while packaging revenue declined 4% to ₹155 million and co-extrusion grew 3% to ₹94 million. The company successfully booked most converting machinery orders in Q1, though some packaging and export orders were deferred to Q2. Mamata received its first orders for 9-layer blown film plants from domestic and Latin American clients. The company is expanding its packaging machinery reach in Africa, Middle East, Europe, Asia, and South & Central America, while monitoring US tariff policy developments. Management remains confident about growth momentum through packaging machine scaling and product innovation.",
            "Sentiment": "positive",
            "PublishDate": 1755024691512,
            "Source": "earnings"
        },
        {
            "Title": "Mamata Machinery Reports 38% Revenue Growth in Q1FY26 with Strong Converting Machinery Performance",
            "Summary": "Mamata Machinery Limited reported revenue of ₹382 million for the quarter ended June 30, 2025, representing 38% year-over-year growth. The company's EBITDA margin improved to 7% from -1% in the same quarter last year, while profit after tax reached ₹26 million compared to ₹2 million in Q1FY25. Converting machinery revenue showed strong performance with 73% YoY growth to ₹608 million, while co-extrusion revenue grew 3% to ₹94 million. Packaging machinery revenue declined 4% to ₹5 million. The company successfully booked bulk converting machinery orders in Q1, though some packaging and export orders are expected to be recorded in Q2. CEO Apurva Kane noted the company received its first orders for 9-layer blown film plants from domestic and Latin American customers. The company maintains a cautious outlook on US tariff policy changes while expanding focus on other export markets including Africa, Middle East, Europe, Asia, and South & Central America.",
            "Sentiment": "positive",
            "PublishDate": 1754816496135,
            "Source": "earnings"
        },
        {
            "Title": "Mamata Machinery Limited Approves Quarterly Results and Key Appointments",
            "Summary": "Mamata Machinery Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The board appointed Mr. Varun C. Patel as Additional Director (Non-executive) effective August 08, 2025, subject to shareholder approval at the Annual General Meeting. The company also appointed M/s. Chirag Shah & Associates as Secretarial Auditors for a five-year term from 2025-26 to 2029-30, M/s. C. B. Modh & Co. as Cost Auditors, and M/s. Desai & Desai as Internal Auditors. The appointments require shareholder approval or ratification at the upcoming Annual General Meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1754658233991,
            "Source": "corporate_action"
        },
        {
            "Title": "Mamata Machinery Reports Strong Q1 Turnaround with 26.4M Rupees Net Profit",
            "Summary": "Mamata Machinery delivered a significant improvement in its quarterly results. Net profit surged to 26.4 million rupees compared to 2.1 million rupees in the same period last year. Revenue grew substantially to 386 million rupees from 276 million rupees year-over-year. The company achieved a remarkable turnaround in profitability metrics, with EBITDA reaching 31 million rupees versus a loss of 31.5 million rupees in the previous year. EBITDA margin improved dramatically to 8.01% from negative 1.14% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754656799925,
            "Source": "earnings"
        },
        {
            "Title": "Mamata Machinery Secures First Export Order for 9-Layer Blown Film Plant",
            "Summary": "Mamata Machinery has secured its maiden export order for a 9-layer blown film plant from a customer in Latin America. This represents the company's first international order for this type of equipment.",
            "Sentiment": "positive",
            "PublishDate": 1754583815843,
            "Source": "stock"
        },
        {
            "Title": "Mamata Machinery Secures First Export Order Worth ₹8.5 Crore for 9-Layer Blown Film Plant",
            "Summary": "Mamata Machinery Limited has secured its first export order valued at approximately ₹8.5 crore for a state-of-the-art 9-layer blown film plant under its Co-Extrusion product segment. The order comes from an international entity whose name is withheld due to confidentiality obligations. The advanced plant will be used to produce high barrier films for critical food packaging applications that require enhanced product protection and extended shelf life. The order is scheduled to be executed by the quarter ending December 31, 2026. The work order was received on August 7, 2025. The transaction does not involve any promoter group interest or related party arrangements.",
            "Sentiment": "positive",
            "PublishDate": 1754581276757,
            "Source": "order&deals"
        },
        {
            "Title": "Mamata Machinery Secures ₹7.2 Crore Order for First 9-Layer Blown Film Plant",
            "Summary": "Mamata Machinery Limited received its first order for a 9-layer blown film plant valued at approximately ₹7.2 crore from Vijay Flexipack Private Limited, a long-standing domestic customer. The advanced plant will produce high barrier films for food packaging applications requiring enhanced product protection and extended shelf life. The order is scheduled for delivery by the end of the quarter ending March 31, 2026. This marks Mamata's entry into the advanced Co-Extrusion product segment, with the company positioning itself as a specialized solution provider for customized and high-end Co-Extrusion offerings. The repeat business from the valued client demonstrates the trust and recurring nature of relationships maintained by Mamata Machinery.",
            "Sentiment": "positive",
            "PublishDate": 1753985007487,
            "Source": "order&deals"
        },
        {
            "Title": "Mamata Machinery Reports Q4 Financial Results",
            "Summary": "Mamata Machinery has released its Q4 financial results. The company's EBITDA increased to 368 million rupees from 258 million rupees year-over-year. The EBITDA margin improved to 33.12% from 29.19% in the same period last year. Consolidated net profit rose to 271 million rupees from 210 million rupees year-over-year and 88 million rupees quarter-over-quarter. Revenue for Q4 reached 1.1 billion rupees, up from 884 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748441561000,
            "Source": "result"
        },
        {
            "Title": "Mamata Machinery Granted US Patent for Cross Sealing Device",
            "Summary": "Mamata Machinery has been awarded a patent by the United States Patent and Trademark Office for their invention titled 'Cross Sealing Device'. This patent grant represents a significant intellectual property achievement for the company in the field of machinery innovation.",
            "Sentiment": "positive",
            "PublishDate": 1742538953000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mamata Machinery Reports Increased Q3 Profit and Revenue",
            "Summary": "Mamata Machinery has announced its financial results for the third quarter. The company's consolidated net profit rose to 88 million rupees, up from 83 million rupees in the same period last year. Revenue also saw significant growth, increasing to 734 million rupees from 514 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739286334000,
            "Source": "earnings"
        },
        {
            "Title": "Mamata Machinery: Stellar Market Debut with 147% Premium",
            "Summary": "Mamata Machinery shares opened at ₹600 on both NSE and BSE, marking a 146.91% premium over the issue price of ₹243.",
            "Sentiment": "positive",
            "PublishDate": 1735273819000,
            "Source": "normal_news"
        },
        {
            "Title": "Mamata Machinery: Shares Soar 147% on Stock Market Debut",
            "Summary": "Mamata Machinery Ltd. shares listed on NSE and BSE at Rs 600, a 146.91% premium over the IPO price of Rs 243. The IPO was oversubscribed 194.95 times, raising Rs 179.4 crore through a pure offer for sale. The company manufactures packaging machinery for FMCG and food industries.",
            "Sentiment": "positive",
            "PublishDate": 1735273313000,
            "Source": "result"
        }
    ]
}