{
    "Symbol": "MANAKSTEEL",
    "ISIN": "INE824Q01011",
    "News": [
        {
            "Title": "Manaksia Steels Q3FY26 Results Show Strong Growth",
            "Summary": "Manaksia Steels reported robust Q3FY26 performance with standalone revenue of ₹29,834.00 lacs and net profit of ₹910.22 lacs, marking significant growth over previous periods.",
            "Sentiment": "positive",
            "PublishDate": 1769856736634,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manaksia Steels Clarifies Recent Price Movement",
            "Summary": "Manaksia Steels Limited responds to BSE surveillance query regarding recent price movements, confirming compliance with regulatory requirements and stating no undisclosed material information.",
            "Sentiment": "neutral",
            "PublishDate": 1766582501501,
            "Source": "stocks"
        },
        {
            "Title": "Manaksia Steels Reports Quarterly Financial Results for Q2 FY2026",
            "Summary": "Manaksia Steels Limited's Board approved unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025, following a board meeting held on November 13, 2025. The consolidated results include four entities: Manaksia Steels Limited, Federated Steel Mills Limited, Far East Steel Industries Limited, and Sumo Agrochem Limited, with auditors completing limited review procedures as required under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763055445198,
            "Source": "earnings"
        },
        {
            "Title": "Manaksia Steels Reports 184% Sales Volume Growth in Q2 FY26 Despite Industry Slowdown",
            "Summary": "Manaksia Steels achieved over 150% year-on-year sales growth and 184% increase in total sales volume for Q2 FY26, with production of galvanised coils growing 56% and pre-painted products up 150%. The company's Nigerian subsidiary delivered outstanding results with over 150% revenue growth, while the new Aluzinc-coated steel line reached 75% capacity utilisation and a new colour-coating line investment of ₹40 crore remains on track for Q4 FY26 commissioning.",
            "Sentiment": "positive",
            "PublishDate": 1763046679183,
            "Source": "earnings"
        },
        {
            "Title": "Manaksia Steels Shareholders Approve New Secretarial Auditors and Independent Director Re-appointment",
            "Summary": "Manaksia Steels Limited shareholders at their 24th Annual General Meeting approved two key appointments. M/s. MKB & Associates was appointed as Secretarial Auditors for a 5-year term from financial year 2025-26 to 2029-30. The firm is a peer-reviewed company secretaries practice based in Kolkata with presence across India, led by Managing Partner Manoj Kumar Banthia who has 27 years of experience in corporate laws. Additionally, shareholders approved the re-appointment of Mrs. Nidhi Baheti as an Independent Director for another 5-year term effective from June 16, 2026. Mrs. Baheti is a Chartered Accountant with over fifteen years of experience in financial management and taxation, currently serving as a partner at Sultania Sujit & Co.",
            "Sentiment": "neutral",
            "PublishDate": 1758716157211,
            "Source": "corporate_governance"
        },
        {
            "Title": "Manaksia Steels Reports Strong Q1 Results, Approves Rs 40 Crore Capacity Expansion",
            "Summary": "Manaksia Steels Limited's Board approved quarterly financial results for the quarter ended June 30, 2025, showing consolidated net profit of Rs 634.71 lacs compared to Rs 232.59 lacs in the same period last year. The company scheduled its 24th Annual General Meeting for September 23, 2025, and approved the re-appointment of Mrs. Nidhi Baheti as Independent Director for a five-year term starting June 16, 2026. The Board also approved a major capacity expansion plan to add a second Colour Coating Line at its Haldia facility, which will increase manufacturing capacity from 48,000 MT to 138,000 MT per annum. The expansion requires an investment of approximately Rs 40 crores to be funded through internal accruals and is expected to be completed by the fourth quarter of FY 2025-26. Additionally, the company appointed M/s MKB & Associates as Secretarial Auditors for five years and adopted a new company logo. The company successfully commissioned a new Aluzinc Coated Steel Line on June 10, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753793974269,
            "Source": "earnings"
        },
        {
            "Title": "Manaksia Steels Plans 400 Million Rupee Expansion at Haldia Unit",
            "Summary": "Manaksia Steels has announced plans to expand its color coating line capacity at its Haldia unit. The expansion project involves an investment of 400 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1753793019687,
            "Source": "stock"
        },
        {
            "Title": "Manaksia Steels Approves Quarterly Results, Manufacturing Expansion, and Key Appointments",
            "Summary": "Manaksia Steels Limited's Board approved quarterly financial results for the quarter ended June 30, 2025, showing consolidated revenue of Rs 20,097.78 lacs and net profit of Rs 634.71 lacs. The company set September 23, 2025 as the date for its 24th Annual General Meeting. Key decisions include re-appointing Mrs. Nidhi Baheti as Independent Director for five years from June 16, 2026, and appointing M/s MKB & Associates as Secretarial Auditors for five years. The Board approved expanding manufacturing capacity by adding a second Colour Coating Line at the Haldia facility, increasing total capacity from 48,000 MT to 138,000 MT per annum with an investment of approximately Rs 40 crores funded through internal accruals. The company also adopted a new logo and successfully commissioned a new Aluzinc Coated Steel Line on June 10, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753793002462,
            "Source": "corporate_action"
        }
    ]
}