{
    "Symbol": "MANAPPURAM",
    "ISIN": "INE522D01027",
    "News": [
        {
            "Title": "Manappuram Finance Announces Leadership Changes",
            "Summary": "Manappuram Finance Limited announces resignation of Company Secretary Manoj Kumar VR effective March 31, 2026, and appointment of Ms. Aparna Menon as his successor from April 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769695198765,
            "Source": "stocks"
        },
        {
            "Title": "Manappuram Finance declares Rs 0.50 interim dividend",
            "Summary": "Manappuram Finance Limited announced interim dividend of Rs 0.50 per share with record date February 6, 2026, alongside Q3FY26 financial results showing consolidated net profit of Rs 238.54 crores.",
            "Sentiment": "positive",
            "PublishDate": 1769685559310,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manappuram's Asirvad MFI Reports ₹156 Cr Loss in Q3",
            "Summary": "Morgan Stanley reports Asirvad MFI, subsidiary of Manappuram Finance, posted adjusted loss of ₹156 crore in Q3FY26 vs estimated ₹99 crore due to low PPOP and higher provisions.",
            "Sentiment": "negative",
            "PublishDate": 1769575077119,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manappuram Finance Board Meet on Jan 29 for Q3 Results",
            "Summary": "Manappuram Finance Limited has scheduled its board meeting for January 29, 2026, to consider Q3FY26 unaudited financial results and interim dividend declaration. Trading window remains closed until February 2, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769101475803,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manappuram Finance EGM Results: All Resolutions Pass",
            "Summary": "Manappuram Finance Limited's EGM on January 22, 2026 saw all three resolutions pass with strong support. Borrowing approval and mortgage creation resolutions received 98.95% votes in favor.",
            "Sentiment": "positive",
            "PublishDate": 1769085235026,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manappuram Finance rallies 4.5% on RBI deal clarity",
            "Summary": "Manappuram Finance shares surged 4.5% to ₹298.70 after the company denied media reports about RBI objections to Bain Capital deal, calling them factually incorrect and speculative.",
            "Sentiment": "positive",
            "PublishDate": 1768208526875,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manappuram Finance Rises 5% After Bain Deal Clarification",
            "Summary": "Manappuram Finance shares jumped 5% after the company denied media reports of delays in Bain Capital's acquisition deal, confirming RBI approvals are in place with final clearance awaited.",
            "Sentiment": "positive",
            "PublishDate": 1768199459952,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manappuram Finance rises 4% on Bain Capital deal clarity",
            "Summary": "Manappuram Finance shares surged 4% to ₹298.50 after the company clarified media reports about delays in its Bain Capital deal, confirming RBI approvals received and final approval awaited.",
            "Sentiment": "positive",
            "PublishDate": 1768196917420,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manappuram Finance shares rise after RBI deal clarity",
            "Summary": "Manappuram Finance shares recovered on Monday after the company denied media reports about RBI objections to Bain Capital's acquisition plans, calling them factually incorrect and speculative.",
            "Sentiment": "positive",
            "PublishDate": 1768190208175,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manappuram Finance Denies Bain Deal Delay Reports",
            "Summary": "Manappuram Finance has officially denied media reports claiming regulatory concerns have delayed its deal with Bain Capital, calling the reports factually incorrect and speculative.",
            "Sentiment": "neutral",
            "PublishDate": 1768176644734,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manappuram Finance denies Bain deal delay reports",
            "Summary": "Gold loan financier clarifies RBI approval pending for Bain Capital transaction, calls media reports factually incorrect. Stock falls 5.33% to ₹293.00 amid regulatory clarification.",
            "Sentiment": "neutral",
            "PublishDate": 1767983885508,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manappuram Finance Denies Bain Deal Delay Reports",
            "Summary": "Manappuram Finance officially denies media reports suggesting delays in Bain Capital deal due to regulatory issues, clarifying its position on the transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1767976163385,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manappuram Finance denies Bain deal delay reports",
            "Summary": "Manappuram Finance Limited has denied media reports claiming regulatory concerns are delaying its Bain Capital deal, calling them factually incorrect and speculative.",
            "Sentiment": "neutral",
            "PublishDate": 1767976088909,
            "Source": "stocks"
        },
        {
            "Title": "Manappuram Finance Shares Drop 10% on RBI Concerns",
            "Summary": "Manappuram Finance shares declined 9.9% to ₹278.45 following reports that RBI raised objections to Bain Capital's plan to acquire controlling stake in the gold loan NBFC.",
            "Sentiment": "negative",
            "PublishDate": 1767958108624,
            "Source": "stocks"
        },
        {
            "Title": "Manappuram Finance shares fall 10% on RBI concerns",
            "Summary": "Manappuram Finance shares dropped 10% following reports that RBI has raised objections to Bain Capital's plan to acquire controlling stake, citing concerns over Bain's existing stake in another Indian lender.",
            "Sentiment": "negative",
            "PublishDate": 1767955364018,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manappuram Finance drops 10% on RBI Bain deal concerns",
            "Summary": "Manappuram Finance shares fell 10% after RBI raised concerns over Bain Capital deal, citing discomfort with same investor controlling multiple lending institutions including banks and NBFCs.",
            "Sentiment": "negative",
            "PublishDate": 1767953495429,
            "Source": "stocks"
        },
        {
            "Title": "Bain's Manappuram Deal Faces RBI Regulatory Hurdles",
            "Summary": "RBI raises objections to Bain Capital's ₹4,400 crore acquisition of Manappuram Finance stake due to existing controlling interest in another Indian lender. Shares fall 10% on regulatory concerns.",
            "Sentiment": "negative",
            "PublishDate": 1767952524853,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manappuram shares drop 7% on Bain deal delay",
            "Summary": "Manappuram Finance shares fell 7% to ₹287.30 after RBI raised objections to Bain Capital's ₹4,400 crore stake acquisition plan. Regulatory concerns over multiple lender control may delay the deal.",
            "Sentiment": "negative",
            "PublishDate": 1767951692551,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manappuram Finance drops 10% on RBI-Bain deal concerns",
            "Summary": "Manappuram Finance shares fell 10% after Reuters reported RBI objections to Bain Capital's controlling stake acquisition plans. Stock recovered to 6.7% decline at ₹288.55.",
            "Sentiment": "negative",
            "PublishDate": 1767949485991,
            "Source": "co_actions_results"
        },
        {
            "Title": "RBI Raises Concerns Over Bain Capital's Manappuram Bid",
            "Summary": "The Reserve Bank of India has expressed concerns regarding Bain Capital's proposal to acquire a controlling stake in Manappuram Finance, according to Reuters reports.",
            "Sentiment": "negative",
            "PublishDate": 1767948851501,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bain Explores Tyger Capital Sale for Manappuram Deal",
            "Summary": "Bain Capital is considering selling part of Tyger Capital in India to address challenges with its Manappuram Finance deal, according to recent reports.",
            "Sentiment": "neutral",
            "PublishDate": 1767948831025,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manappuram Finance Block Trade Worth ₹18.99 Crores",
            "Summary": "Manappuram Finance witnessed a significant NSE block trade involving 607,117 shares at ₹312.85 per share, totaling ₹18.99 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1767765503557,
            "Source": "co_actions_results"
        },
        {
            "Title": "Morgan Stanley Raises Manappuram Finance Target to ₹300",
            "Summary": "Morgan Stanley upgraded Manappuram Finance's price target to ₹300 while maintaining Equal-weight rating, citing improved risk-reward profile supported by strong gold prices and better loan growth prospects.",
            "Sentiment": "neutral",
            "PublishDate": 1767156473886,
            "Source": "stocks"
        },
        {
            "Title": "Gold financiers outshine metal stocks in commodity rally",
            "Summary": "Sameer Dalal of Natverlal & Sons recommends Muthoot Finance and Manappuram Finance over metal stocks, citing elevated gold prices supporting 15-20% loan exposure growth for gold financiers.",
            "Sentiment": "positive",
            "PublishDate": 1766984308672,
            "Source": "stocks"
        },
        {
            "Title": "Manappuram Finance Hits Fresh Record Highs in December",
            "Summary": "Manappuram Finance breaks out from 3-month consolidation to reach new record highs in December 2025, with experts suggesting potential upside to ₹330 in coming weeks.",
            "Sentiment": "positive",
            "PublishDate": 1766966453681,
            "Source": "stocks"
        },
        {
            "Title": "Manappuram Finance appoints new Group CFO, invests ₹250cr",
            "Summary": "Manappuram Finance appoints Buvanesh Tharashankar as Group CFO and approves ₹250 crore investment in subsidiary Asirvad Micro Finance. Stock hits 52-week high of ₹318.90.",
            "Sentiment": "positive",
            "PublishDate": 1766736950654,
            "Source": "stocks"
        },
        {
            "Title": "Manappuram, Muthoot Finance surge up to 7% on gold rally",
            "Summary": "Gold loan companies hit fresh peaks as Manappuram Finance jumped 6.8% to ₹314.70 and Muthoot Finance rose 2.1% to ₹3,889, driven by record gold prices reaching ₹1,38,676 per 10 grams on MCX.",
            "Sentiment": "positive",
            "PublishDate": 1766588917958,
            "Source": "stocks"
        },
        {
            "Title": "Manappuram Finance Approves ₹500 Crore Secured Debenture Issue",
            "Summary": "Manappuram Finance has approved the issuance of secured debentures worth ₹500 crores through private placement, with each debenture having a face value of ₹1 lakh. The fundraising initiative will provide the company with additional capital for its business operations and growth requirements.",
            "Sentiment": "positive",
            "PublishDate": 1764913318351,
            "Source": "corporate_action"
        },
        {
            "Title": "Manappuram Finance Appoints Ashish N Chandak as Group Chief Compliance Officer",
            "Summary": "Manappuram Finance Limited appointed Ashish N Chandak as Group Chief Compliance Officer and Senior Management Personnel effective December 3, 2025. Chandak brings nearly three decades of BFSI experience, having previously served as Chief Compliance Officer at YES Bank and structured over 200 transactions exceeding 100 billion in financing.",
            "Sentiment": "positive",
            "PublishDate": 1764759281803,
            "Source": "corporate_governance"
        },
        {
            "Title": "Manappuram Finance Appoints Sanjay Gangadharan Nambiar as Group General Counsel",
            "Summary": "Manappuram Finance Limited appointed Sanjay Gangadharan Nambiar as Group General Counsel and Senior Management Personnel effective December 1, 2025. The appointment brings 31 years of legal experience including over 25 years in banking and financial services, with his most recent role being Group General Counsel at YES Bank where he led a team of over 80 legal professionals.",
            "Sentiment": "positive",
            "PublishDate": 1764594673844,
            "Source": "corporate_governance"
        },
        {
            "Title": "Manappuram Finance Plans to Raise Up to ₹5 Billion in Funding",
            "Summary": "Manappuram Finance is considering raising up to ₹5 billion in funds on December 5th. The fundraising initiative affects the company's capital structure and potentially its shareholders and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1764590845915,
            "Source": "corporate_action"
        },
        {
            "Title": "Manappuram Finance Plans to Reduce Gold Loan Yields by 100 Basis Points",
            "Summary": "Manappuram Finance announced that other business segments continue to negatively impact its consolidated financial performance. The company's management has outlined plans to reduce yields in its gold loan business by approximately 100 basis points.",
            "Sentiment": "neutral",
            "PublishDate": 1761884625153,
            "Source": "stock"
        },
        {
            "Title": "Manappuram Finance Reports 62% Drop in Quarterly Net Profit",
            "Summary": "Manappuram Finance reported consolidated net profit of 2.19 billion rupees for the second quarter, down from 5.71 billion rupees in the same period last year. The company's revenue also declined to 22.83 billion rupees compared to 26.33 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1761820757735,
            "Source": "earnings"
        },
        {
            "Title": "Cohesion MK Best Ideas Sub-Trust Acquires 1.07% Stake in Manappuram Finance",
            "Summary": "Cohesion MK Best Ideas Sub-Trust, associated with Madhu Kela, has acquired a 1.07% stake in Manappuram Finance during the second quarter. This represents a new shareholding position by the investment entity in the non-banking financial company.",
            "Sentiment": "neutral",
            "PublishDate": 1760419768003,
            "Source": "stock"
        },
        {
            "Title": "BC Asia Investments XXV Limited Receives SEBI Approval for 26% Open Offer in Manappuram Finance, Awaits RBI Clearance",
            "Summary": "BC Asia Investments XXV Limited, along with seven other entities acting in concert, has received SEBI's observation letter for their open offer to acquire up to 24.42 crore equity shares representing 26% of Manappuram Finance Limited's expanded voting share capital from public shareholders. The Letter of Offer will be dispatched to shareholders after receiving RBI approvals from the target company and its subsidiaries Asirvad Micro Finance Limited and Manappuram Home Finance Limited. The tendering period will commence within twelve working days of receiving the final RBI approval. Payment to successful shareholders will be completed within ten working days of the tendering period's end, with a 10% annual interest rate applicable for any delays as per SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1758602348985,
            "Source": "order&deals"
        },
        {
            "Title": "Manappuram Finance Receives RBI Approval for Management Change and Preferential Issue",
            "Summary": "Manappuram Finance Limited received RBI approval on September 16, 2025, for a change in management. The company is proceeding with a preferential issue involving BC Asia Investments XXV Limited and BC Asia Investments XIV Limited. The transaction includes issuance of 9.29 crore equity shares at INR 236 per share to BC Asia Investments XXV Limited, totaling INR 2,192.47 crores, and 9.29 crore warrants at the same price to BC Asia Investments XIV Limited. Upon completion, the investors will acquire control over the company and be classified as promoters alongside existing promoters V.P. Nandakumar and Sushama Nandakumar. A mandatory open offer to public shareholders is being undertaken in compliance with SEBI takeover regulations, with public announcement made on March 20, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758085779134,
            "Source": "corporate_action"
        },
        {
            "Title": "Manappuram Finance Receives RBI Approval for Management Changes in Subsidiaries",
            "Summary": "Manappuram Finance Limited has received approval from the Reserve Bank of India for changes in management of its subsidiaries, Manappuram Home Finance Limited and Asirvad Micro Finance Limited. The RBI approved the appointment of Ms. Radhika Subramanian, nominated by investors BC Asia Investments XXV Limited and BC Asia Investments XIV Limited, as Additional Director (Non-Executive and Non Independent Director) in both subsidiaries. This approval relates to a securities subscription agreement executed in March 2025, involving the issuance of 9.29 crore equity shares at INR 236 per share to BC Asia Investments XXV Limited for INR 2,192.47 crores, and 9.29 crore warrants at the same price to BC Asia Investments XIV Limited. Upon completion of these transactions, the investors will acquire control over Manappuram Finance and be classified as promoters alongside existing promoters V.P. Nandakumar and Sushama Nandakumar. A mandatory open offer to public shareholders is also being undertaken in compliance with takeover regulations.",
            "Sentiment": "positive",
            "PublishDate": 1756298295606,
            "Source": "corporate_governance"
        },
        {
            "Title": "Manappuram Finance Shareholders Approve All 7 Resolutions at 33rd AGM Including Employee Stock Option Scheme",
            "Summary": "Manappuram Finance Limited held its 33rd Annual General Meeting on August 14, 2025, where shareholders approved all seven business items with requisite majority. The company reported consolidated AUM of ₹43,034 crore (up 2.3% YoY) and consolidated net profit of ₹1,204 crore (down 45% from ₹2,197 crore). Key approvals included adoption of financial statements, director appointments, secretarial auditor appointment, remuneration revision for Dr. Sumitha Nandan, and the new Employee Stock Option Scheme 2025. The company highlighted that its gold loan business contributes 84% of consolidated revenue and remains stable, while the microfinance segment faced stress with Q4 loss of ₹626 crore due to elevated borrower defaults. Bain Capital's proposed acquisition of joint control stake is awaiting final statutory approvals. Deepak Reddy joined as CEO on August 1, 2025, and Dr. Shailesh J. Mehta stepped down as Chairman after completing his statutory term.",
            "Sentiment": "neutral",
            "PublishDate": 1755184149565,
            "Source": "corporate_governance"
        },
        {
            "Title": "Manappuram Finance Reports Q1 FY26 Results with Gold Loan Focus and New CEO Appointment",
            "Summary": "Manappuram Finance uploaded its Q1 FY26 earnings call transcript following results announced for the quarter. The company reported standalone revenue of INR 1,744.5 crores with PAT of INR 392.1 crores, compared to INR 414.4 crores in Q4 FY25. Consolidated revenue stood at INR 2,265 crores with PAT of INR 132.5 crores versus a loss of INR 203.2 crores in the previous quarter. The Board declared an interim dividend of INR 0.50. Deepak Reddy joined as new CEO, bringing over three decades of financial services experience. Gold loan portfolio grew to 65% of consolidated AUM from 59.5% in Q4, with the company targeting 75% gold loan share. Gold loan yields decreased from 22.2% to 20.7% as part of a strategy to match market rates over 4-6 quarters. The company added 3.58 lakh new customers, bringing total active customers to 25.9 lakhs. Asirvad Microfinance reported a loss of INR 267 crores, improved from INR 624 crores loss in Q4. The company plans to reduce microfinance exposure to 10% of total portfolio while increasing secured lending to 90%. Bain Capital transaction is progressing with CCI approval received and RBI approval expected within a month.",
            "Sentiment": "neutral",
            "PublishDate": 1755100212811,
            "Source": "earnings"
        },
        {
            "Title": "Manappuram Finance Vehicle Loan NPAs Jump to 9.2% in June Quarter",
            "Summary": "Manappuram Finance reported deteriorating asset quality in its vehicle finance segment with Gross NPA rising to 9.2% from 6.7% in the March quarter. The company's Assets Under Management fell 1.4% year-on-year against expected 2% growth, though gold loan AUMs increased 22%. Net Interest Income declined 10% year-on-year and 4.4% sequentially, while profitability dropped 75% from the previous year. Management expects gold loan yields to moderate to 18% from current 20.7% over the next four to six quarters, with gold loans to comprise 75% of portfolio from current 65%. The company anticipates approval for its Bain Capital deal from RBI next month and expects MFI credit costs to decline by up to 40 basis points. Shares closed 1.4% lower at ₹257.35 but have gained 35% year-to-date.",
            "Sentiment": "negative",
            "PublishDate": 1754869648092,
            "Source": "earnings"
        },
        {
            "Title": "Manappuram Finance Uploads Q1 FY 2026 Results Conference Call Audio Recording",
            "Summary": "Manappuram Finance Limited has made the audio recording of its Q1 FY 2026 results conference call available on its company website. The conference call was held on August 08, 2025, and the audio recording was uploaded to www.manappuram.com on August 09, 2025. The company filed this disclosure with BSE Limited, National Stock Exchange of India Limited, and India International Exchange (IFSC) Ltd under reference number SEC/SE/82/2025-26. The filing was signed by Company Secretary Manoj Kumar V R and references a previous intimation dated August 4, 2025. The audio recording provides investors and analysts access to discussions about the company's quarterly performance and business outlook.",
            "Sentiment": "neutral",
            "PublishDate": 1754724841071,
            "Source": "earnings"
        },
        {
            "Title": "Manappuram Finance Reports Q1 FY2026 Results and Declares Rs. 0.50 Interim Dividend",
            "Summary": "Manappuram Finance Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company declared an interim dividend of Rs. 0.50 per equity share with August 14, 2025 as the record date. Key leadership changes include V.P. Nandakumar's appointment as Chairman effective August 28, 2025, following Dr. Shailesh Jayantilal Mehta's retirement on August 27, 2025. The company also announced several changes in Senior Management Personnel, including resignations and new designations. During the quarter, Manappuram subscribed to 8,33,33,333 equity shares of subsidiary Asirvad Micro Finance Limited at Rs. 60 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1754649150394,
            "Source": "corporate_action"
        },
        {
            "Title": "Manappuram Finance Board Approves Interim Dividend of 50 Paise Per Share",
            "Summary": "Manappuram Finance's board has recommended an interim dividend of 50 paise per share for shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1754648637980,
            "Source": "corporate_action"
        },
        {
            "Title": "Manappuram Finance Reports Sharp Decline in Q1 Profitability",
            "Summary": "Manappuram Finance reported consolidated net profit of 1.38 billion rupees in Q1, down from 5.55 billion rupees in the same period last year. Revenue decreased to 22.62 billion rupees from 24.9 billion rupees year-over-year. EBITDA fell to 10.29 billion rupees compared to 16.42 billion rupees previously, while EBITDA margin compressed to 45.48% from 65.98% in the prior year period.",
            "Sentiment": "negative",
            "PublishDate": 1754648096660,
            "Source": "earnings"
        },
        {
            "Title": "Manappuram Finance Approves $2 Billion Global Medium Term Note Programme",
            "Summary": "Manappuram Finance Limited's financial and resources management committee approved the conversion of its existing euro medium term note programme into a global medium term note programme. The company plans to issue senior secured notes up to $2 billion under this programme, subject to market conditions and regulatory compliance. The committee also approved execution of definitive documents related to the programme, special consolidated financial statements for disclosure, and delegated authority to authorized officers for implementation. The notes will not be offered or sold in India, with a preliminary offering circular to be made available to prospective investors.",
            "Sentiment": "positive",
            "PublishDate": 1754462095627,
            "Source": "corporate_action"
        },
        {
            "Title": "Manappuram Finance Schedules Board Meeting to Convert Euro MTN Programme to Global MTN Programme Worth Up to $2 Billion",
            "Summary": "Manappuram Finance Limited has scheduled a board committee meeting on August 6, 2025, to consider converting their euro medium term note programme into a global medium term note programme. The meeting will address the issuance of senior secured notes under the global medium term note programme with a principal aggregate amount limit of up to US$2 billion. The committee will also consider approving definitive documents including offering documents, programme agreements, agency agreements, trust deeds, and subscription agreements related to the programme. Additionally, the meeting will review special consolidated financial statements that will be disclosed in connection with the notes and programme.",
            "Sentiment": "neutral",
            "PublishDate": 1754053484903,
            "Source": "corporate_action"
        },
        {
            "Title": "Manappuram Finance Appoints Deepak Reddy as New CEO, V P Nandakumar Continues as Managing Director",
            "Summary": "Deepak Reddy has assumed the role of CEO at Manappuram Finance Limited effective August 1, 2025. His appointment was previously announced on May 9, 2025. Following this leadership change, V P Nandakumar's designation was modified from Managing Director & CEO to Managing Director effective July 31, 2025. Nandakumar will continue in his Managing Director role, with the new CEO reporting to him.",
            "Sentiment": "neutral",
            "PublishDate": 1754020949719,
            "Source": "corporate_governance"
        },
        {
            "Title": "Manappuram Finance Withdraws FPI Investment Limit Proposal from AGM Agenda",
            "Summary": "Manappuram Finance Limited has withdrawn Agenda Item No. 6 from its 33rd Annual General Meeting notice, which proposed increasing the ceiling limit for Foreign Portfolio Investor (FPI) holdings to 74% of paid-up share capital. The withdrawal follows the company's discovery that existing regulatory provisions under Foreign Exchange Management Rules, 2019 and Consolidated FDI policy already allow 100% FPI investment in the NBFC sector, making the proposed resolution unnecessary. The AGM is scheduled for August 14, 2025, and remaining agenda items have been renumbered accordingly.",
            "Sentiment": "neutral",
            "PublishDate": 1753364396379,
            "Source": "corporate_action"
        },
        {
            "Title": "Manappuram Finance Block Trade: 1.98 Million Shares at Rs. 274.65",
            "Summary": "A block trade of approximately 1,979,324 shares of Manappuram Finance Ltd. occurred on the National Stock Exchange (NSE). The trade was valued at Rs. 54.36 crores, with shares priced at Rs. 274.65 each.",
            "Sentiment": "neutral",
            "PublishDate": 1751862172000,
            "Source": "block_details"
        },
        {
            "Title": "CCI Approves Bain Capital's Stake Acquisition in Manappuram Finance",
            "Summary": "The Competition Commission of India (CCI) has granted approval for Bain Capital's proposal to acquire a significant stake in Manappuram Finance.",
            "Sentiment": "positive",
            "PublishDate": 1750768181000,
            "Source": "default"
        }
    ]
}