{
    "Symbol": "MANALIPETC",
    "ISIN": "INE201A01024",
    "News": [
        {
            "Title": "Manali Petrochemicals Q3 Profit Surges 1190%",
            "Summary": "Manali Petrochemicals reports consolidated net profit of 684 million rupees in Q3, marking a significant jump from 53 million rupees year-over-year. Revenue also grew to 2.5 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1770028313495,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manali Petrochemicals Reinstates UK Subsidiary",
            "Summary": "Manali Petrochemicals announces reinstatement of step-down subsidiary Penn Print Solutions Limited, UK for limited purpose of receiving corporation tax refunds with no material financial impact.",
            "Sentiment": "neutral",
            "PublishDate": 1768224083357,
            "Source": "stocks"
        },
        {
            "Title": "Manali Petrochemicals Signs MoA with CPCL",
            "Summary": "Manali Petrochemicals Limited enters into Memorandum of Agreement with Chennai Petroleum Corporation Limited to provide loading facility services at its Plant-I in Manali, Chennai.",
            "Sentiment": "positive",
            "PublishDate": 1765973100211,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manali Petrochemicals Completes Sale of Subsidiary Notedome Limited for ₹2.47 Billion",
            "Summary": "Manali Petrochemicals has completed the divestiture of its step-down subsidiary Notedome Limited to Italian company C.O.I.M. S.p.A for a total consideration of ₹2.47 billion. The transaction represents a significant asset sale that will impact Manali Petrochemicals' portfolio structure and provide substantial cash proceeds to the company.",
            "Sentiment": "positive",
            "PublishDate": 1763507236492,
            "Source": "order&deals"
        },
        {
            "Title": "Manali Petrochemicals Shareholders Approve Independent Director Appointment and Subsidiary Sale",
            "Summary": "Manali Petrochemicals completed postal ballot voting with shareholders approving the appointment of Mr. Anand Raghavan as Independent Director and the sale of a wholly owned step-down material subsidiary. Both special resolutions passed with 100% valid votes in favor, with 72,458,756 votes cast for the director appointment and 72,458,856 votes for the subsidiary sale approval.",
            "Sentiment": "positive",
            "PublishDate": 1763358873898,
            "Source": "corporate_action"
        },
        {
            "Title": "Manali Petrochemicals Subsidiary Pennwhite India Gets Approval to Begin Defoamer Production",
            "Summary": "Pennwhite India, a subsidiary of Manali Petrochemicals, has received Consent to Operate (CTO) approval to commence defoamer production at its Oragadam plant. This regulatory clearance enables the subsidiary to start manufacturing operations at the facility, expanding the company's production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1763043824581,
            "Source": "stock"
        },
        {
            "Title": "Manali Petrochemicals Reinstates UK Subsidiary for Tax Refund Collection",
            "Summary": "Manali Petrochemicals Limited announced that its wholly owned subsidiary AMCHEM Speciality Chemicals Private Limited, Singapore has reinstated Penn-Globe Limited, UK, which was dissolved on April 23, 2024. The reinstatement is on a time-limited basis solely to enable an application for reinstating Penn White Print Solutions Limited to facilitate receipt and distribution of Corporation Tax refunds. The company confirmed no other business activities will be undertaken by Penn-Globe Limited and that AMCHEM Singapore will initiate a voluntary strike-off within stipulated timelines. Manali Petrochemicals stated there are no financial or material implications for the company due to this action.",
            "Sentiment": "neutral",
            "PublishDate": 1762790836879,
            "Source": "corporate_action"
        },
        {
            "Title": "Manali Petrochemical Reports Strong Q2 Performance with 90x Jump in Net Profit",
            "Summary": "Manali Petrochemical delivered robust Q2 results with consolidated net profit surging to 181.5 million rupees from 2 million rupees in the same quarter last year. Revenue grew to 2.48 billion rupees compared to 2.3 billion rupees year-over-year. EBITDA increased significantly to 203 million rupees from 38 million rupees, while EBITDA margin expanded to 8.18% from 1.66% in the corresponding period.",
            "Sentiment": "positive",
            "PublishDate": 1762776326090,
            "Source": "earnings"
        },
        {
            "Title": "Manali Petrochemicals Reports Mixed Results with Insurance Settlement and Lease Renewal Pending",
            "Summary": "Manali Petrochemicals Limited announced quarterly results for the period ended September 30, 2025. The company reported revenue from operations of Rs 18,015 lakhs for the quarter. The company settled insurance claims of Rs 816 lakhs related to flood damage from Cyclone Michaung in October 2025, resulting in an exceptional expense of Rs 98 lakhs for balance claims receivable. Property, plant and equipment claims totaling Rs 2,096 lakhs remain under insurer assessment. The company continues to await renewal of its leasehold land lease that expired in June 2017, with lease rent paid until June 2026. On the corporate front, subsidiary AMCHEM Speciality Chemicals entered into a share purchase agreement to sell Notedome Limited for a consideration of at least 8.6 times adjusted EBITDA of 2.12 million GBP, pending shareholder approval through postal ballot.",
            "Sentiment": "neutral",
            "PublishDate": 1762776296815,
            "Source": "earnings"
        },
        {
            "Title": "Manali Petrochemicals' Subsidiary AMCHEM Signs Share Purchase Agreement to Sell Entire Stake in UK Unit Notedome Limited",
            "Summary": "Manali Petrochemicals Limited announced that its wholly owned subsidiary AMCHEM, SG has entered into a Share Purchase Agreement with C.O.I.M. S.p.A. for the sale of its entire stake in Notedome Limited, UK. Notedome Limited is described as a material step-down subsidiary of Manali Petrochemicals. The agreement was signed on October 20th, 2025. The company stated it will keep stock exchanges informed as the transaction progresses and confirmed no other changes to earlier disclosures.",
            "Sentiment": "neutral",
            "PublishDate": 1760983537750,
            "Source": "order&deals"
        },
        {
            "Title": "Manali Petrochemicals Board Approves Sale of UK Subsidiary Notedome Limited to C.O.I.M. S.p.A.",
            "Summary": "Manali Petrochemicals Limited's board approved the sale of its entire stake in Notedome Limited, UK, a wholly owned material step-down subsidiary, to C.O.I.M. S.p.A. - Chimica Organica Industriale Milanese. The transaction will be executed through AMCHEM, SG, an overseas wholly owned material subsidiary of MPL. The buyer will acquire the business for at least 8.5 times the adjusted EBITDA of 2.12 million Pounds on a cash-free and debt-free basis. C.O.I.M. S.p.A. is a globally recognized leader in chemical specialties operating in over 90 countries and is not part of the promoter group. The transaction requires shareholder approval through postal ballot and is expected to complete by end of November 2025. Notedome Limited contributed 10.63% of consolidated income and 5.57% of net worth during FY 2024-25. Upon completion, Notedome Limited will cease to be a subsidiary of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1760520247663,
            "Source": "corporate_action"
        },
        {
            "Title": "Manali Petrochemicals Appoints New CFO and Independent Director",
            "Summary": "Manali Petrochemicals Limited announced leadership changes effective October 3, 2025. Ms. K Lalitha resigned from her Chief Financial Officer position and will continue with the company in a non-KMP finance role. Ms. Srishti M Bathija was appointed as the new Chief Financial Officer for MPL Group. Bathija is a Chartered Accountant and CFA Level I with over a decade of experience in strategic finance, M&A, and business transformation. She previously served as CFO and Director at TIMAC Agro India Private Limited and has worked with organizations including PricewaterhouseCoopers, Goldman Sachs, and Deloitte. Additionally, the company appointed Mr. Anand Raghavan as Non-executive Independent Director for five years, subject to shareholder approval through postal ballot. Raghavan is a chartered accountant with 39 years of financial sector experience and was previously a partner at Ernst & Young.",
            "Sentiment": "neutral",
            "PublishDate": 1759487103649,
            "Source": "corporate_governance"
        },
        {
            "Title": "Manali Petrochemicals Receives BIS Certification Marks for Polyether and Polyester Polyols",
            "Summary": "Manali Petrochemicals Limited has been granted Certification Marks Licences by the Bureau of Indian Standards for polyether polyols and polyester polyols, valid for one year. The company states this milestone reaffirms their commitment to quality standards, safety, and regulatory compliance while strengthening customer trust. The achievement also reinforces their commitment to the Make in India initiative and reflects adherence to Good Manufacturing Practices.",
            "Sentiment": "positive",
            "PublishDate": 1757940599989,
            "Source": "stock"
        },
        {
            "Title": "Manali Petrochemicals Revises Dividend Record Date to September 9, 2025",
            "Summary": "Manali Petrochemicals Limited has revised its record date for determining dividend entitlement from September 8 to September 9, 2025. The change was necessitated by the Reserve Bank of India declaring September 8, 2025 as a Clearing/Settlement Holiday through its circular dated September 4, 2025. The revised record date for dividend declaration for FY 2024-25 will be at closing hours of September 9, 2025, based on beneficial owner lists from NSDL and CDSL depositories. The company confirmed no other changes apart from the record date revision.",
            "Sentiment": "neutral",
            "PublishDate": 1757050695252,
            "Source": "corporate_action"
        },
        {
            "Title": "Manali Petrochemicals Sets September 8, 2025 as Record Date for FY 2024-25 Dividend",
            "Summary": "Manali Petrochemicals Limited has confirmed September 8, 2025 (Monday) at closing hours as the record date for dividend declaration for FY 2024-25. The record date will be determined based on the beneficial owners list provided by NSDL and CDSL depositories. This confirmation follows the company's earlier intimation dated August 11, 2025 regarding the board meeting outcome.",
            "Sentiment": "neutral",
            "PublishDate": 1755009100901,
            "Source": "corporate_action"
        },
        {
            "Title": "Manali Petrochemicals Reports 60% Drop in Standalone Profit, Announces Rs 0.50 Dividend",
            "Summary": "Manali Petrochemicals Limited reported a significant decline in standalone performance for the quarter ended June 30, 2025. Revenue from operations fell 8.2% to Rs 16,325 lakhs, while profit before tax dropped 60.3% to Rs 412 lakhs. Net profit declined 57.7% to Rs 302 lakhs, with earnings per share falling to Rs 0.18 from Rs 0.42 in the same quarter last year. However, consolidated results showed growth with revenue increasing 32% to Rs 23,467 lakhs and net profit rising 10.1% to Rs 1,434 lakhs. The company's manufacturing plants were affected by floods from Cyclone Michaung in December 2023, with insurance claims of Rs 2,183 lakhs still under assessment. The Board recommended a dividend of Rs 0.50 per equity share (10%) subject to shareholder approval at the 39th Annual General Meeting scheduled for September 16, 2025. Mr. Niranjhan Madras Srinivasan resigned as Independent Director due to increased professional and personal commitments. The company also appointed new Cost Auditor and Secretarial Auditors for upcoming periods.",
            "Sentiment": "negative",
            "PublishDate": 1754920222617,
            "Source": "earnings"
        },
        {
            "Title": "Manali Petrochemical Reports 10% Growth in Q1 Net Profit Despite Revenue Decline",
            "Summary": "Manali Petrochemical reported consolidated net profit of 143 million rupees in Q1, up from 130 million rupees in the same period last year, representing a 10% year-on-year increase. However, revenue declined to 2.35 billion rupees from 2.4 billion rupees year-on-year. The company's EBITDA improved to 228 million rupees from 208 million rupees, while EBITDA margin expanded to 9.73% from 8.63% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754917369200,
            "Source": "earnings"
        },
        {
            "Title": "Manali Petrochemicals Partners With Chennai Petroleum Corp To Enhance Innovation And Growth",
            "Summary": "Manali Petrochemicals has entered into a partnership with Chennai Petroleum Corporation (CPCL). The collaboration aims to enhance innovation and growth for both companies.",
            "Sentiment": "positive",
            "PublishDate": 1753783220725,
            "Source": "order&deals"
        },
        {
            "Title": "Manali Petrochemicals Receives Approval for Expanded Propylene Glycol Plant Operations",
            "Summary": "Manali Petrochemicals has obtained approval to operate its expanded propylene glycol manufacturing facility located in Manali. The approval enables the company to run the enhanced production capacity at this plant.",
            "Sentiment": "positive",
            "PublishDate": 1753689263330,
            "Source": "stock"
        },
        {
            "Title": "Manali Petrochemicals Forms Strategic Partnership Agreement With Chennai Petroleum",
            "Summary": "Manali Petrochemicals has entered into a non-binding agreement with Chennai Petroleum to establish a strategic partnership. The agreement is aimed at supporting growth and innovation for both companies.",
            "Sentiment": "positive",
            "PublishDate": 1753450969126,
            "Source": "order&deals"
        },
        {
            "Title": "Manali Petro Achieves 50,000 KTPA Production, Expects ₹500 Crore Annual Revenue",
            "Summary": "Manali Petro has reached a total production capacity of 50,000 KTPA. The company anticipates this will generate an expected revenue potential of ₹500 crore annually. This increase represents a significant growth, boosting the company's annual revenue by over 55%.",
            "Sentiment": "positive",
            "PublishDate": 1752660305000,
            "Source": "default"
        },
        {
            "Title": "Manali Petro Opens Expanded Propylene Glycol Facility in Chennai",
            "Summary": "Manali Petro has opened an expanded Propylene Glycol facility at their Plant II in Chennai. This expansion suggests an increase in production capacity for the company.",
            "Sentiment": "positive",
            "PublishDate": 1752659961000,
            "Source": "default"
        },
        {
            "Title": "Manali Petrochemical Reports Improved Q4 Financial Results",
            "Summary": "Manali Petrochemical has announced its Q4 financial results, showing significant improvements year-over-year. The company's EBITDA increased to 210 million rupees from 173.1 million rupees in the previous year, with EBITDA margin rising to 9.13% from 6.75%. Consolidated net profit surged to 108 million rupees from 13 million rupees year-over-year and 53 million rupees quarter-over-quarter. However, revenue decreased to 2.3 billion rupees from 2.56 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747140161000,
            "Source": "result"
        },
        {
            "Title": "Anti-Dumping Duty Review on Flexible Slabstock Polyol Imports from Saudi Arabia",
            "Summary": "The government has initiated a sunset review investigation of the anti-dumping duty on imports of 'Flexible Slabstock Polyol' originating from or exported by Saudi Arabia. This review could potentially impact Manali Petrochemicals, a company involved in the polyol industry.",
            "Sentiment": "neutral",
            "PublishDate": 1742441586000,
            "Source": "corporate_action"
        },
        {
            "Title": "Manali Petrochemicals Invests 88.2 Million Rupees in Amplus IRU",
            "Summary": "Manali Petrochemicals has made an additional equity investment of 88.2 million rupees in Amplus IRU. This investment represents a corporate action that could potentially impact the company's financial structure and future growth prospects.",
            "Sentiment": "neutral",
            "PublishDate": 1741778974000,
            "Source": "corporate_action"
        },
        {
            "Title": "Manali Petrochemicals Receives Final Transfer Order for Leased Premises from GIDC",
            "Summary": "Manali Petrochemicals has received the final transfer order from the Gujarat Industrial Development Corporation (GIDC) for their leased premises. This development suggests a formalization or completion of a property transfer process between the company and the state industrial development body.",
            "Sentiment": "positive",
            "PublishDate": 1738849493000,
            "Source": "corporate_action"
        },
        {
            "Title": "Manali Petrochemical Reports Significant Improvement in Q3 EBITDA",
            "Summary": "Manali Petrochemical has reported a substantial increase in its Q3 EBITDA, rising to 127 million rupees from 52 million rupees in the same quarter last year. The company's EBITDA margin also improved significantly, reaching 6.46% compared to 2.52% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738764309000,
            "Source": "earnings"
        },
        {
            "Title": "Manali Petrochemical Reports Increased Q3 Net Profit",
            "Summary": "Manali Petrochemical has reported a consolidated net profit of 53 million rupees for the third quarter, up from 29 million rupees in the same period last year. However, the company's revenue slightly decreased to 1.96 billion rupees from 2 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738764304000,
            "Source": "earnings"
        },
        {
            "Title": "Manali Petrochemicals Signs MOU with Fermenta Biotech for Premises Lease",
            "Summary": "Manali Petrochemicals has executed a Memorandum of Understanding (MOU) with Fermenta Biotech. The agreement involves lease rights for a premise, with the consideration set at 187 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1734525733000,
            "Source": "corporate_action"
        },
        {
            "Title": "Manali Petrochemical Reports Significant Decline in Q2 EBITDA",
            "Summary": "Manali Petrochemical's Q2 EBITDA has dropped to 38 million rupees from 145 million rupees year-over-year. The company's EBITDA margin also decreased to 1.66% from 5.39% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730724311000,
            "Source": "result"
        },
        {
            "Title": "Manali Petrochemical Reports Significant Drop in Q2 Profit",
            "Summary": "Manali Petrochemical's consolidated net profit for Q2 has fallen sharply to 2 million rupees, compared to 109 million rupees in the same quarter last year and 130 million rupees in the previous quarter. The company's revenue also declined to 2.3 billion rupees from 2.7 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730724259000,
            "Source": "result"
        }
    ]
}