{
    "Symbol": "MANAKCOAT",
    "ISIN": "INE830Q01018",
    "News": [
        {
            "Title": "Manaksia Coated Metals Q3FY26 Monitoring Report",
            "Summary": "CARE Ratings submits monitoring agency report for Manaksia Coated Metals' Rs. 134.55 crore preferential issue for Q3FY26, confirming proper fund utilization with Rs. 13.65 crore pending receipt.",
            "Sentiment": "neutral",
            "PublishDate": 1770032077760,
            "Source": "stocks"
        },
        {
            "Title": "Manaksia Coated Metals Reports Strong Q3 FY26 Results",
            "Summary": "Manaksia Coated Metals posted net profit of ₹741.10 lacs in Q3 FY26 vs ₹507.50 lacs in Q3 FY25, with revenue at ₹18,689.53 lacs. Nine-month profit surged to ₹3,553.56 lacs.",
            "Sentiment": "positive",
            "PublishDate": 1770029821085,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manaksia Coated Metals Board Meet on Feb 2, 2026",
            "Summary": "Manaksia Coated Metals & Industries Limited has scheduled its board meeting for February 2, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed until 48 hours post-declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1769061867055,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manaksia Coated Metals Upgrades Galvanizing Line",
            "Summary": "Manaksia Coated Metals undertakes technology upgrade and capacity expansion of its Continuous Galvanizing Line, converting to Aluminium-Zinc coating with 36% capacity increase to 180,000 MT per annum.",
            "Sentiment": "positive",
            "PublishDate": 1766581352518,
            "Source": "stocks"
        },
        {
            "Title": "Manaksia Coated Metals Sees 1.91% Share Transfer",
            "Summary": "Sumitra Devi Agarwalla acquires 20,20,827 equity shares representing 1.91% stake in Manaksia Coated Metals through inter-se transfer as gift from promoter group relatives on December 19, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766469077910,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manaksia Coated Metals Shareholders Approve Capital Increase and Fundraising Plan",
            "Summary": "Manaksia Coated Metals Industries Limited shareholders passed resolutions to increase authorized share capital from Rs. 12.5 crores to Rs. 16 crores and approved capital raising of up to Rs. 350 crores through equity shares and equity-linked securities. The postal ballot conducted on November 27, 2025, enables the company to raise funds through private offerings, qualified institutional placements, or other permitted methods to support business expansion.",
            "Sentiment": "positive",
            "PublishDate": 1764763984364,
            "Source": "corporate_action"
        },
        {
            "Title": "Manaksia Coated Metals Industries Increases Authorized Capital to Rs. 16 Crores",
            "Summary": "Manaksia Coated Metals Industries Limited shareholders approved via postal ballot the increase of authorized capital from Rs. 12.50 crores to Rs. 16 crores, divided into 16 crore equity shares of Rs. 1 each. The company altered its Memorandum of Association accordingly and made the amended document available on its website.",
            "Sentiment": "positive",
            "PublishDate": 1764595640191,
            "Source": "corporate_action"
        },
        {
            "Title": "Manaksia Coated Metals Industries Shareholders Approve Capital Expansion and Fundraising Plans",
            "Summary": "Manaksia Coated Metals Industries Limited shareholders approved two special resolutions through postal ballot voting - increasing authorized share capital with consequent changes to the company's memorandum, and approving capital raising through equity shares and/or equity linked securities via private offerings, qualified institutional placements or other permitted methods. Both resolutions passed with 99.997% votes in favor, enabling the company to expand its capital structure and pursue fundraising activities.",
            "Sentiment": "positive",
            "PublishDate": 1764409904684,
            "Source": "corporate_action"
        },
        {
            "Title": "Manaksia Coated Metals Industries Shareholders Approve Share Capital Increase and Capital Raising Plans",
            "Summary": "Manaksia Coated Metals Industries Limited shareholders approved two special resolutions through postal ballot voting - increasing authorized share capital with consequent alteration in memorandum of association, and approving capital raising through equity shares and/or equity linked securities via private offerings, qualified institutional placements or other permitted methods. Both resolutions passed with 99.997% votes in favor, affecting the company's capital structure and future fundraising capabilities for business expansion.",
            "Sentiment": "positive",
            "PublishDate": 1764266899542,
            "Source": "corporate_action"
        },
        {
            "Title": "Manaksia Coated Metals Plans 7 MWp Solar Plant in Gujarat to Reduce Power Costs",
            "Summary": "Manaksia Coated Metals & Industries announced plans to construct a 7 MWp solar power plant in Gujarat. The project aims to reduce the company's grid power consumption by 50-55% and lower power costs by up to 50%.",
            "Sentiment": "positive",
            "PublishDate": 1762755733663,
            "Source": "stock"
        },
        {
            "Title": "Manaksia Coated Metals Reports Strong Growth with 27% Revenue Rise and 113% EBITDA Jump",
            "Summary": "Manaksia Coated Metals Industries Limited reported consolidated total income growth of 27% year-on-year to Rs. 224 crores for the quarter ended September 30, 2025. EBITDA more than doubled with 113% growth to Rs. 29 crores, while EBITDA margin expanded by 534 basis points to 13%. Net profit surged 491% to Rs. 14 crores with earnings per share increasing 347% to Rs. 1.43. For the first half, total income rose 27% to Rs. 478 crores with net profit growing 423% to Rs. 28 crores. The company's balance sheet strengthened with debt declining 27% to Rs. 103.22 crores and debt-equity ratio improving to 1.19 from 1.81. Exports contributed 85% of total sales with export revenue up 151% year-on-year. The company raised Rs. 174.87 crores through preferential allotments and is progressing on capacity expansion projects including aluminum-zinc coating line conversion and a second color coating line expected by early FY27.",
            "Sentiment": "positive",
            "PublishDate": 1762384541547,
            "Source": "earnings"
        },
        {
            "Title": "Manaksia Coated Metals Signs ₹500 Cr MOU with European Clients for Steel Products",
            "Summary": "Manaksia Coated Metals Industries Limited has signed a Memorandum of Understanding with European clients worth ₹500 crores. Under the agreement, the company will supply up to 50,000 metric tonnes of pre-painted steel coils, Alu-Zinc coated coils, and galvanized steel products over the next 12 months. Export revenue contributed 70% of revenues from operations in H1FY26. The company is advancing a 7.0 MW renewable energy project and has received a credit rating upgrade from Acuite - long-term rating improved from A(-) to A, and short-term rating from A2 to A1. The company is expanding capacity to 180,000 MT with ALU-ZINC technology upgrade and adding a new Color Coating Line to reach total capacity of 236,000 MT. In FY25, the company reported consolidated total income of ₹789.66 crores, EBITDA of ₹63.01 crores and net profit of ₹15.39 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762148631489,
            "Source": "order&deals"
        },
        {
            "Title": "Manaksia Coated Metals Reports 491% Jump in Q2 Net Profit to ₹14 Crore",
            "Summary": "Manaksia Coated Metals & Industries Limited reported a 491% year-on-year increase in net profit to ₹13.96 crore for Q2 FY26. Revenue grew 26.66% to ₹223.68 crore, while EBITDA more than doubled with 112.95% growth to ₹29.45 crore. EBITDA margins expanded by 534 basis points to 13.17%. The company's export sales reached an all-time high of 85.06% of total sales, with export revenue increasing 151% year-on-year. Production volumes showed growth with Galvanized Steel production rising 7.91% to 26,572 MT and PPGI Steel production increasing 18.21% to 21,653 MT. Value-added products contributed 92% of total sales volume. The debt-to-equity ratio improved to 1.19x with total debt reducing by 27% since March 2025. The company received credit rating upgrades from Acuité Ratings, with long-term rating upgraded to A from A(-) and short-term rating to A1 from A2. Key projects include an Aluminium-Zinc Coating Line upgrade set for FY26, a new Colour Coating Line targeted for FY 2027 commissioning, and a 7 MWp Solar Power Plant project at Kutch.",
            "Sentiment": "positive",
            "PublishDate": 1761654448098,
            "Source": "earnings"
        },
        {
            "Title": "Manaksia Coated Metals Reports Strong Q2 Performance, Plans Rs 350 Crore Fundraise",
            "Summary": "Manaksia Coated Metals & Industries Limited reported unaudited financial results for the quarter ended September 30, 2025. The company's revenue from operations reached Rs 22,032.66 lakhs, with net profit of Rs 1,402.33 lakhs for the quarter. The Board approved a proposal to raise funds up to Rs 350 crores through various securities including equity shares, convertible debentures, or warrants via qualified institutional placements or other permissible methods. The company also approved increasing its authorized share capital from Rs 12.50 crores to Rs 16 crores, requiring shareholder approval through postal ballot. M/s. S.S. Reddy & Associates was appointed as scrutinizers for the postal ballot process. The company's earnings per share stood at Rs 2.11 for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761565383288,
            "Source": "earnings"
        },
        {
            "Title": "Manaksia Coated Metals Schedules Board Meeting to Discuss Quarterly Results and Fund-Raising Proposals",
            "Summary": "Manaksia Coated Metals & Industries Limited has scheduled a Board of Directors meeting on October 27, 2025. The board will consider unaudited financial results for the quarter and half year ended September 30, 2025. The meeting will also evaluate proposals for raising funds through various securities including equity shares, convertible debentures, warrants, or other eligible securities via methods such as private placement or preferential issue, subject to regulatory approvals. Additionally, the board will consider increasing the company's authorized capital and consequent amendment to the memorandum of association, and approve the draft notice for an Extraordinary General Meeting. The trading window for designated persons will remain closed from October 30, 2025 until further notice.",
            "Sentiment": "neutral",
            "PublishDate": 1761137369522,
            "Source": "corporate_action"
        },
        {
            "Title": "Manaksia Coated Metals & Industries Receives Credit Rating Upgrade from Acuité",
            "Summary": "Manaksia Coated Metals & Industries has been upgraded by credit rating agency Acuité. The company has announced plans for capacity expansion, a solar project, and the addition of a new color coating line as part of its growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1758545923226,
            "Source": "stock"
        },
        {
            "Title": "Manaksia Coated Metals Files Draft Merger Scheme with JPA Snacks Private Limited",
            "Summary": "Manaksia Coated Metals & Industries Limited has filed a draft scheme of merger with JPA Snacks Private Limited with stock exchanges. The scheme involves amalgamation of JPA Snacks Private Limited (transferor company) with Manaksia Coated Metals & Industries Limited (transferee company) under sections 230-232 of the Companies Act, 2013. JPA Snacks is a wholly-owned subsidiary of Manaksia Coated Metals, incorporated in 2017 with business in food products, snacks, and cosmetics. The merger aims to consolidate business under a single entity and achieve simplified corporate structure. No new shares will be issued as JPA Snacks is wholly-owned by Manaksia Coated Metals. The appointed date is April 1, 2025, and the scheme requires approval from NCLT. Post-merger, Manaksia's authorized share capital will increase to Rs. 12.55 crores from Rs. 12.50 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1754048990763,
            "Source": "corporate_action"
        },
        {
            "Title": "Manaksia Coated Metals Reports 360% Jump in Net Profit for Q1 FY26",
            "Summary": "Manaksia Coated Metals & Industries Limited reported strong quarterly results with consolidated total income growing 29.97% year-on-year to INR 253.94 crores. Net profit surged 359.70% to INR 14.01 crores, while EBITDA increased 93.36% to INR 28.62 crores with margins expanding 370 basis points to 11.27%. Export performance was exceptional, contributing a record 57% of total revenue with export volumes growing 166.14% year-on-year. The company raised INR 174.87 crores in equity through preferential warrants, with INR 161.22 crores already infused. Management announced upcoming capacity expansions including an Alu-zinc technology upgrade to 180,000 metric tons per annum by Q2 FY26 end, a second color coating line expected in Q4 FY26, and a 7-megawatt captive solar power plant. The company targets peak revenue of INR 1,600 crores with full capacity utilization and expects EBITDA margin expansion of 30% from the Alu-zinc upgrade.",
            "Sentiment": "positive",
            "PublishDate": 1753439787659,
            "Source": "earnings"
        },
        {
            "Title": "Manaksia Coated Metals Sets September 9, 2025 as Record Date for Final Dividend",
            "Summary": "Manaksia Coated Metals & Industries Limited has set September 9, 2025 as the record date for determining shareholders eligible to receive the final dividend. The dividend payment is subject to approval at the company's 15th Annual General Meeting. The board approved this record date to identify shareholders entitled to the final dividend distribution.",
            "Sentiment": "positive",
            "PublishDate": 1753276658556,
            "Source": "corporate_action"
        },
        {
            "Title": "Manaksia Coated Metals Publishes Quarterly Financial Results in Newspapers",
            "Summary": "Manaksia Coated Metals & Industries Limited published its unaudited financial results for the quarter ended June 30, 2025 in Business Standard (English) and Ekdin (Bengali) newspapers on July 23, 2025. The quarterly results were reviewed by the Audit Committee and approved by the Board of Directors in their meetings held on July 22, 2025. The consolidated financial results include the company along with its wholly owned subsidiary Manaksia International FZE and JPA Snacks Pvt Ltd. The company's statutory auditors conducted a limited review of these results. The detailed quarterly financial results are available on stock exchange websites NSE and BSE, as well as on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1753262518091,
            "Source": "earnings"
        },
        {
            "Title": "Manaksia Coated Metals Reports Strong Q1 Growth with 370% Jump in Net Profit",
            "Summary": "Manaksia Coated Metals & Industries reported significant growth in its Q1 results. Net profit surged to 141 million rupees compared to 30 million rupees in the same period last year. Revenue increased to 2.5 billion rupees from 1.94 billion rupees year-over-year. EBITDA rose to 227 million rupees versus 132 million rupees, while EBITDA margin improved to 9.09% from 6.81% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753187006715,
            "Source": "earnings"
        },
        {
            "Title": "Manaksia Coated Metals Approves Amalgamation with Subsidiary JPA Snacks, Announces Q1 Results",
            "Summary": "Manaksia Coated Metals & Industries Limited's board approved a scheme of amalgamation with its wholly owned subsidiary JPA Snacks Private Limited, subject to regulatory approvals. The company adopted unaudited financial results for the quarter ended June 30, 2025, and scheduled its 15th Annual General Meeting for September 16, 2025. The board appointed Audittech 360 Financial Services as internal auditor for 2025-26 and Anil Kumar Dubey as secretarial auditor for five years. The amalgamation aims to simplify group structure and reduce compliance costs, as JPA Snacks has no significant operations despite being engaged in snacks manufacturing. No new shares will be issued or cash payments made for the merger, and there will be no change in Manaksia's shareholding pattern.",
            "Sentiment": "neutral",
            "PublishDate": 1753186973981,
            "Source": "corporate_action"
        },
        {
            "Title": "Manaksia Coated Metals & Industries Q4 EBITDA Performance",
            "Summary": "Manaksia Coated Metals & Industries reported Q4 EBITDA of 152 million rupees, compared to 154 million rupees in the same quarter last year. The company's EBITDA margin decreased to 7.29% from 8.45% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747231740000,
            "Source": "result"
        },
        {
            "Title": "Manaksia Coated Metals & Industries Reports Q4 Financial Results",
            "Summary": "Manaksia Coated Metals & Industries has reported its Q4 financial results. The company's net profit for the quarter was 51 million rupees, compared to 53 million rupees in the same quarter last year (YoY) and 51 million rupees in the previous quarter (QoQ). Revenue for Q4 increased to 2.1 billion rupees from 1.83 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747231652000,
            "Source": "result"
        },
        {
            "Title": "Manaksia Coated Metals & Industries Reports Improved Q3 EBITDA and Margin",
            "Summary": "Manaksia Coated Metals & Industries has reported a significant improvement in its financial performance for the third quarter. The company's EBITDA increased to 145 million rupees, up from 109 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin expanded to 7.06% from 5.70% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739363610000,
            "Source": "earnings"
        },
        {
            "Title": "Manaksia Coated Metals & Industries Reports Q3 Financial Results",
            "Summary": "Manaksia Coated Metals & Industries has reported its Q3 financial results. The company's net profit increased to 51 million rupees, up from 41 million rupees year-over-year and 24 million rupees quarter-over-quarter. Revenue for Q3 rose to 2.05 billion rupees, compared to 1.9 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739363533000,
            "Source": "earnings"
        },
        {
            "Title": "Manaksia Coated Metals & Industries: Secures ₹134.55 Crore Fundraise via Preferential Shares",
            "Summary": "Manaksia Coated Metals & Industries Limited has received shareholder approval to raise ₹134.55 crore through a preferential issue of 2.07 crore equity warrants at ₹65 each. The funds will be used to reduce debt, enhance production capabilities, and implement new technology. The company plans to increase production capacity and expand into value-added products.",
            "Sentiment": "positive",
            "PublishDate": 1735370265000,
            "Source": "corporate_action"
        },
        {
            "Title": "Manaksia Coated Metals & Industries Approves Preferential Warrant Issue",
            "Summary": "Manaksia Coated Metals & Industries has approved a preferential warrant issue to raise 1.35 billion rupees. This corporate action involves issuing new securities to select investors, potentially diluting existing shareholdings but providing the company with additional capital for growth or other strategic purposes.",
            "Sentiment": "positive",
            "PublishDate": 1733184371000,
            "Source": "corporate_action"
        },
        {
            "Title": "Manaksia Coated Metals & Industries Approves Preferential Warrant Issue",
            "Summary": "Manaksia Coated Metals & Industries has approved a preferential warrant issue to raise 1.35 billion rupees. This corporate action will allow the company to secure additional funding through the issuance of warrants to select investors.",
            "Sentiment": "positive",
            "PublishDate": 1733144902000,
            "Source": "corporate_action"
        },
        {
            "Title": "Manaksia Coated Metals & Industries to Consider Fund Raising",
            "Summary": "The board of Manaksia Coated Metals & Industries is scheduled to meet on December 2 to discuss and potentially approve plans for raising funds.",
            "Sentiment": "neutral",
            "PublishDate": 1732753027000,
            "Source": "corporate_action"
        },
        {
            "Title": "Manaksia Coated Metals & Industries to Consider Fund Raising",
            "Summary": "Manaksia Coated Metals & Industries has announced a board meeting scheduled for December 2 to discuss potential fund raising options. This meeting suggests the company may be exploring ways to secure additional capital for its operations or future projects.",
            "Sentiment": "neutral",
            "PublishDate": 1732716099000,
            "Source": "corporate_action"
        },
        {
            "Title": "Manaksia Coated Metals: Secures €200 Crore European Contract",
            "Summary": "<p><span class='positive'>Manaksia Coated Metals & Industries Limited (MCMIL)</span> has <b>won</b> a <span class='positive'>€200 crore contract</span> with a European client to supply <b>20,000 metric tonnes</b> of steel products over <b>12 months</b>. The deal, announced on <b>September 30, 2024</b>, is expected to <span class='positive'>boost export revenue</span> and may become a <span class='positive'>recurring order</span>. MCMIL plans to use upcoming <span class='neutral'>CGL upgrades</span> to meet <span class='positive'>increased demand</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727676515000,
            "Source": "normal_news"
        }
    ]
}