{
    "Symbol": "MANAKSIA",
    "ISIN": "INE015D01022",
    "News": [
        {
            "Title": "Manaksia Limited Q3FY26 Results Show Strong Growth",
            "Summary": "Manaksia Limited reported robust Q3FY26 performance with standalone revenue rising to ₹4,527.99 lakhs and net profit surging to ₹532.76 lakhs, marking significant improvement over previous year.",
            "Sentiment": "positive",
            "PublishDate": 1769779402984,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manaksia Board Meet on Jan 30 for Q3FY26 Results",
            "Summary": "Manaksia Limited has scheduled its board meeting for January 30, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769076181610,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manaksia Shareholders Approve Scheme of Arrangement",
            "Summary": "Manaksia Limited shareholders overwhelmingly approved the proposed Scheme of Arrangement with Manaksia Ferro Industries Limited at a court-convened meeting on January 10, 2026, with 99.9998% votes in favour.",
            "Sentiment": "positive",
            "PublishDate": 1768205512711,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manaksia Limited Holds Shareholder Meeting for Scheme",
            "Summary": "Manaksia Limited conducted equity shareholders meeting on January 10, 2026 via video conference to approve Scheme of Arrangement with Manaksia Ferro Industries Limited as directed by NCLT Kolkata Bench.",
            "Sentiment": "neutral",
            "PublishDate": 1768028078624,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manaksia Successfully Commissions Alu-Zinc Tech Upgrade",
            "Summary": "Manaksia Coated Metals completes aluminium-zinc technology upgrade, expanding capacity from 132,000 to 180,000 MTPA. Company expects improved margins and operational efficiency from premium product segment.",
            "Sentiment": "positive",
            "PublishDate": 1767772080005,
            "Source": "stocks"
        },
        {
            "Title": "NCLT Approves Shareholder Meeting for Manaksia Limited's Metal Products Business Demerger",
            "Summary": "The National Company Law Tribunal Kolkata has directed Manaksia Limited to convene an equity shareholders meeting on January 10, 2026, to approve the demerger of its Metal Products Business to subsidiary Manaksia Ferro Industries Limited. The tribunal dispensed with meetings for secured creditors and Manaksia Ferro's shareholders after receiving 100% consent through affidavits, streamlining the corporate restructuring process.",
            "Sentiment": "positive",
            "PublishDate": 1763636470110,
            "Source": "corporate_action"
        },
        {
            "Title": "Manaksia Limited Reports Quarterly Financial Results for Quarter Ended September 30, 2025",
            "Summary": "Manaksia Limited's Board approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025, following a board meeting held on November 14, 2025. The results include comprehensive financial statements covering metal products, packaging products, and other business segments, with statutory auditors completing their limited review of the quarterly performance.",
            "Sentiment": "neutral",
            "PublishDate": 1763117310498,
            "Source": "earnings"
        },
        {
            "Title": "Manaksia Coated Metals Reports Strong Q2 Growth with Net Profit Surging to 140.2 Million Rupees",
            "Summary": "Manaksia Coated Metals & Industries reported significant growth in its Q2 financial results. Net profit increased substantially to 140.2 million rupees compared to 24 million rupees in the same period last year. Revenue grew to 2.2 billion rupees from 1.75 billion rupees year-over-year. EBITDA rose to 261 million rupees versus 109 million rupees previously, while EBITDA margin expanded to 11.84% from 6.25% in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1761610509666,
            "Source": "earnings"
        },
        {
            "Title": "Manaksia Limited Approves Q1 FY2026 Results, Sets AGM Date, and Appoints New Secretarial Auditors",
            "Summary": "Manaksia Limited's Board of Directors approved the company's unaudited financial results for the quarter ended June 30, 2025, during a meeting held on July 30, 2025. The board scheduled the 41st Annual General Meeting for September 23, 2025, to be conducted through video conferencing, with September 16, 2025 set as the cut-off date for shareholder voting eligibility. The company appointed MKB & Associates as Secretarial Auditors for five consecutive years from 2025-26 to 2029-30, subject to shareholder approval at the upcoming AGM. The consolidated financial results include subsidiaries and step-down subsidiaries across multiple jurisdictions including India, Ghana, and Nigeria. The board had previously approved a demerger scheme in March 2025 for transferring the Metal Product business to wholly-owned subsidiary Manaksia Ferro Industries Limited, which has received approvals from stock exchanges and SEBI but awaits NCLT approval.",
            "Sentiment": "neutral",
            "PublishDate": 1753868054759,
            "Source": "earnings"
        },
        {
            "Title": "Manaksia Limited Receives NSE No-Objection Letter for Scheme of Arrangement with Manaksia Ferro Industries",
            "Summary": "Manaksia Limited has received a 'No adverse observation/No objection' letter from the National Stock Exchange of India Limited for its proposed scheme of arrangement with Manaksia Ferro Industries Limited. The NSE issued its observation letter under Regulation 37 of the Listing Regulations, following a similar approval from BSE. The approval comes with multiple conditions including disclosure requirements for ongoing legal proceedings, compliance with SEBI circulars, and ensuring all scheme-related information is made available to shareholders. The company will now proceed to file the scheme with the National Company Law Tribunal, Kolkata. The NSE's observation letter is valid for six months and the listing of Manaksia Ferro Industries Limited remains subject to SEBI approval and meeting exchange criteria.",
            "Sentiment": "positive",
            "PublishDate": 1753797763051,
            "Source": "corporate_action"
        },
        {
            "Title": "Manaksia Steels Reports Strong Q1 Performance with Net Profit Rising to 65M Rupees",
            "Summary": "Manaksia Steels delivered robust quarterly results with consolidated net profit increasing significantly to 65 million rupees compared to 16 million rupees in the same period last year. Revenue grew to 2.17 billion rupees from 1.65 billion rupees year-over-year. The company's EBITDA improved substantially to 154 million rupees versus 63 million rupees previously, while EBITDA margin expanded to 7.08% from 3.79% in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1753793521595,
            "Source": "earnings"
        },
        {
            "Title": "Manaksia Limited Receives BSE Approval for Metal Products Business Demerger Scheme",
            "Summary": "Manaksia Limited has received a 'No adverse observation/No objection' letter from BSE Limited for its proposed Scheme of Arrangement with Manaksia Ferro Industries Limited. The scheme involves the demerger of Manaksia Limited's Metal Products Business undertaking to Manaksia Ferro Industries Limited. BSE issued its observation letter on July 28, 2025, with several conditions including disclosure requirements for ongoing legal proceedings, compliance with SEBI circulars, and specific financial disclosures. The company is awaiting a similar observation letter from NSE before filing the scheme with NCLT, Kolkata. The BSE approval is valid for six months from the date of issuance. Manaksia Ferro Industries Limited's listing will be subject to SEBI approval and additional compliance requirements including submission of an Information Memorandum and newspaper advertisements.",
            "Sentiment": "positive",
            "PublishDate": 1753791347701,
            "Source": "corporate_action"
        },
        {
            "Title": "Manaksia Coated Metals Reports Strong Q1 Performance with 370% Jump in Net Profit",
            "Summary": "Manaksia Coated Metals & Industries delivered robust quarterly results with net profit surging to 141 million rupees from 30 million rupees year-over-year. Revenue grew to 2.5 billion rupees compared to 1.94 billion rupees in the same period last year. EBITDA increased to 227 million rupees from 132 million rupees, while EBITDA margin improved to 9.09% from 6.81% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1753229354416,
            "Source": "earnings"
        },
        {
            "Title": "Manaksia Approves Scheme of Arrangement with Manaksia Ferro Industries",
            "Summary": "Manaksia has approved a scheme of arrangement between itself and Manaksia Ferro Industries. The scheme involves a demerger, resulting in both the demerged company and the resulting company having identical shareholding structures.",
            "Sentiment": "neutral",
            "PublishDate": 1742979711000,
            "Source": "corporate_action"
        },
        {
            "Title": "Manaksia Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Manaksia, an Indian company, has reported its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) has decreased to 253 million rupees from 409 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin has fallen to 13.45% from 26.89% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739367595000,
            "Source": "earnings"
        },
        {
            "Title": "Manaksia Reports Q3 Financial Results",
            "Summary": "Manaksia has announced its Q3 financial results. The company's consolidated net profit for the quarter stood at 130 million rupees, compared to 175 million rupees year-over-year and 150 million rupees quarter-over-quarter. Revenue for Q3 increased to 1.87 billion rupees from 1.5 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739367503000,
            "Source": "earnings"
        },
        {
            "Title": "Manaksia Reports Decline in Q2 Revenue",
            "Summary": "Manaksia, an Indian company, has reported its second quarter revenue for the current fiscal year. The company's revenue stood at 1.7 billion rupees, down from 1.99 billion rupees in the same quarter of the previous year, indicating a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1731489695000,
            "Source": "result"
        },
        {
            "Title": "Manaksia Reports Decline in Q2 Consolidated Net Profit",
            "Summary": "Manaksia, an Indian company, has reported a consolidated net profit of 150 million rupees for the second quarter, down from 240 million rupees in the same period last year. This represents a year-over-year decrease in profit.",
            "Sentiment": "negative",
            "PublishDate": 1731489669000,
            "Source": "result"
        }
    ]
}