{
    "Symbol": "MANAKALUCO",
    "ISIN": "INE859Q01017",
    "News": [
        {
            "Title": "Manaksia Aluminium Updates Key Personnel Authorization",
            "Summary": "Manaksia Aluminium Company Limited has authorized three Key Managerial Personnel for determining materiality of events and making stock exchange disclosures under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1767957010342,
            "Source": "stocks"
        },
        {
            "Title": "Manaksia Aluminium Appoints New Company Secretary",
            "Summary": "Manaksia Aluminium Company Limited has appointed Mr. Abhishek Chakraborty as Company Secretary and Compliance Officer with immediate effect following board approval on January 09, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767956825024,
            "Source": "stocks"
        },
        {
            "Title": "Manaksia Aluminium CS Vivek Jain Resigns",
            "Summary": "Manaksia Aluminium Company announces resignation of Company Secretary & Compliance Officer Vivek Jain effective December 12, 2025, to pursue alternate career opportunities outside the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1765522845057,
            "Source": "stocks"
        },
        {
            "Title": "Manaksia Aluminium CFO Ashok Agarwal Resigns Due to Personal Reasons",
            "Summary": "Ashok Agarwal has resigned from his position as Chief Financial Officer of Manaksia Aluminium Company Limited, with his resignation taking effect from November 30, 2025. The company is currently in the process of identifying and appointing a new CFO to fill the vacant position.",
            "Sentiment": "neutral",
            "PublishDate": 1764329651024,
            "Source": "corporate_governance"
        },
        {
            "Title": "Manaksia Aluminium Reports Mixed Q2 Performance with Revenue Decline and Profit Growth",
            "Summary": "Manaksia Aluminium Company Limited reported revenue from operations of Rs 13,120.93 lacs for the quarter ended September 30, 2025, compared to Rs 15,061.48 lacs in the same quarter last year, while net profit increased to Rs 141.14 lacs from Rs 168.68 lacs. The company has established two new wholly owned subsidiaries in the USA and UAE, though consolidated financials are not being prepared due to pending RBI ODI approvals for share capital deposits.",
            "Sentiment": "negative",
            "PublishDate": 1763134751570,
            "Source": "earnings"
        },
        {
            "Title": "Manaksia Aluminium Reports Q1 Results, Schedules AGM and Proposes Dividend",
            "Summary": "Manaksia Aluminium Company Limited's Board approved unaudited standalone financial results for the quarter ended June 30, 2025. The company reported revenue from operations of ₹13,441.44 lacs compared to ₹8,171.69 lacs in the same quarter last year. Net profit after tax stood at ₹155.77 lacs versus ₹71.29 lacs in the corresponding quarter. The Board scheduled the 15th Annual General Meeting for September 16, 2025, via video conferencing and proposed a final dividend of ₹0.07 per equity share (7% on face value of ₹1) for FY 2024-25, subject to shareholder approval. The company also approved re-appointment of Shuvendu Sekhar Mohanty as Non-Executive Independent Director for five years and Anirudha Agrawal as Whole-time Director for three years, both subject to shareholder approval. Additionally, the Board appointed Asit Kumar Labh as Secretarial Auditor for five years from FY 2025-26 to FY 2029-30.",
            "Sentiment": "positive",
            "PublishDate": 1754655054984,
            "Source": "corporate_action"
        },
        {
            "Title": "Manaksia Aluminium Incorporates Wholly Owned Subsidiary in Dubai for Metal Products Business",
            "Summary": "Manaksia Aluminium Company Limited has incorporated a wholly owned subsidiary named Metal Star Ceiling Panel Trading FZE in Dubai, UAE. The subsidiary is established in Jebel Ali Free Zone with a paid-up share capital of AED 1,00,000 and will focus on metal products business and related activities. Manaksia Aluminium will hold 100% shareholding through cash subscription at AED 25,000 per share. The subsidiary has not yet commenced business operations and will support the holding company's metal products business and clearing activities.",
            "Sentiment": "positive",
            "PublishDate": 1753160913606,
            "Source": "corporate_action"
        }
    ]
}