{
    "Symbol": "MANBA",
    "ISIN": "INE939X01013",
    "News": [
        {
            "Title": "Manba Finance Allots ₹50 Crore NCDs on Private Basis",
            "Summary": "Manba Finance Limited successfully allotted 50,000 non-convertible debentures worth ₹50 crores through private placement. The NCDs carry 10.65% annual interest with 26-month tenure.",
            "Sentiment": "positive",
            "PublishDate": 1769694347167,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manba Finance Q3 Net Profit Rises to ₹131M",
            "Summary": "Manba Finance reported a marginal increase in Q3 net profit to ₹131 million compared to ₹130 million in the same period last year, representing modest year-on-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1769671391865,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manba Finance Q3FY26 Earnings Call on Jan 30",
            "Summary": "Manba Finance Limited has scheduled its Q3FY26 earnings conference call for January 30, 2026, at 4:00 PM IST to discuss operations and financial performance for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769080788160,
            "Source": "stocks"
        },
        {
            "Title": "Manba Finance Sets Feb 6 Record Date for Interim Dividend",
            "Summary": "Manba Finance Limited announces February 06, 2026 as record date for second interim dividend for FY26, subject to board approval on January 29, 2026. Trading window remains closed until results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1767963647476,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manba Finance Partners with TVS Motor for 3-Wheeler Loans",
            "Summary": "Manba Finance Limited signs MoU with TVS Motor Company to provide customized financing solutions for three-wheeler vehicles, with emphasis on electric variants across India.",
            "Sentiment": "positive",
            "PublishDate": 1766569857986,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manba Finance Reaches 1 Million Customer Milestone After 29 Years of Operations",
            "Summary": "Manba Finance Limited announced reaching 1 million customers across India, marking a significant growth milestone for the NBFC established in 1996. The company operates across 7 states with 100 locations, 1300 dealership partners, and 1600 employees, offering vehicle financing, business loans, and personal loans.",
            "Sentiment": "positive",
            "PublishDate": 1763963611274,
            "Source": "stock"
        },
        {
            "Title": "Manba Finance Reports 26% PAT Growth in H1 FY26, Records Highest Monthly Disbursement of INR 175 Crores in October",
            "Summary": "Manba Finance Limited reported a 26% year-on-year growth in profit after tax to INR 21 crores for H1 FY26, with net interest income rising 21% to INR 68 crores and AUM growing 36% to INR 1,500 crores. The NBFC achieved record monthly disbursements of INR 175.40 crores in October following GST rate cuts on two-wheelers, with management maintaining guidance of 30-35% CAGR growth and targeting AUM of INR 1,700-1,750 crores by year-end.",
            "Sentiment": "positive",
            "PublishDate": 1763375840946,
            "Source": "earnings"
        },
        {
            "Title": "Manba Finance Reports 36% AUM Growth and 23% Rise in Net Interest Income for H1-FY26",
            "Summary": "Manba Finance Limited, an NBFC providing financial solutions for two-wheelers, three-wheelers, used cars, small business loans and personal loans, reported strong performance for H1-FY26. The company's Assets Under Management (AUM) grew 36% to INR 15,008 million compared to INR 11,069 million in H1-FY25. Net Interest Income increased 23% to INR 682 million from INR 555 million in the previous year. Disbursements rose 16% to INR 3,983 million. The company's dealer network expanded 24% to 1,393 dealers from 1,125 in H1-FY25. Profit After Tax for H1-FY26 stood at INR 211 million compared to INR 168 million in H1-FY25. Gross NPA was 3.52% and Net NPA was 2.68%. The company operates across 103 locations in 6 states with 1,726 employees. Manba Finance raised INR 170 crores through NCDs with a 74 basis points reduction in borrowing cost, supported by RBI rate cuts and a credit rating outlook upgrade from Stable to Positive. The company maintains a Capital Adequacy Ratio of 26.54% and has signed three business correspondence partnerships to enhance business reach.",
            "Sentiment": "positive",
            "PublishDate": 1762931225482,
            "Source": "earnings"
        },
        {
            "Title": "Manba Finance Reports Strong Growth with ₹227.39 Crore Net Profit and Declares ₹0.50 Interim Dividend",
            "Summary": "Manba Finance Limited announced quarterly results showing net profit of ₹227.39 crore for the quarter ended September 30, 2025, compared to ₹197.08 crore in the previous quarter. Revenue from operations increased to ₹752.21 crore from ₹670.07 crore quarter-on-quarter. The company's loan portfolio grew to ₹1,371.88 crore from ₹1,146.07 crore as of March 2025. The board declared a first interim dividend of ₹0.50 per equity share for financial year 2025-26, with record date set as November 21, 2025, and payment by December 5, 2025. Total comprehensive income for the half-year reached ₹454.47 crore versus ₹378.03 crore in the corresponding previous period. The company maintained asset cover requirements for its non-convertible debentures and confirmed no deviation in utilization of issue proceeds from stated objectives.",
            "Sentiment": "positive",
            "PublishDate": 1762851944834,
            "Source": "earnings"
        },
        {
            "Title": "Manba Finance Reports Mixed Q2 Results with Revenue Growth and Profit Decline",
            "Summary": "Manba Finance reported Q2 net profit of 114 million rupees, down from 116 million rupees in the same period last year. The company's Q2 revenue increased to 776 million rupees compared to 646 million rupees year-over-year, showing revenue growth despite the decline in profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1762849932751,
            "Source": "earnings"
        },
        {
            "Title": "Manba Finance Limited Schedules Q2FY26 Earnings Conference Call",
            "Summary": "Manba Finance Limited will conduct an earnings conference call on November 12, 2025, at 4:00 PM IST to discuss operational and financial performance for the half year and quarter ended September 30, 2025. The call will be represented by Managing Director Manish Shah and Executive Director & CFO Jay Mota. The company will publish audio recording and transcript on its website following the call. Conference dial-in numbers have been provided for various regions including India, Hong Kong, Singapore, USA, and UK.",
            "Sentiment": "neutral",
            "PublishDate": 1762446375830,
            "Source": "earnings"
        },
        {
            "Title": "Manba Finance Achieves Record Monthly Disbursement of ₹174.36 Crores in October 2025",
            "Summary": "Manba Finance Limited reported its highest-ever monthly disbursement of ₹174.36 crores in October 2025, serving 22,308 customers in a single month. The NBFC maintained a secured loan portfolio of approximately 97% and kept credit losses below 1%. Managing Director Manish Shah attributed the performance to strong growth sentiment in both rural and urban markets, with approximately 10% improvement in pricing driving higher volumes. The company, established in 1996, offers financing for 2-wheelers, 3-wheelers, electric vehicles, used cars, small businesses, and personal loans across India.",
            "Sentiment": "positive",
            "PublishDate": 1762142657571,
            "Source": "stock"
        },
        {
            "Title": "Manba Finance Allots ₹25 Crore NCDs Through Private Placement",
            "Summary": "Manba Finance Limited has allotted 2,500 secured, rated, listed, redeemable, taxable, non-convertible debentures (NCDs) of ₹1,00,000 each, totaling ₹25 crores on a private placement basis. The NCDs carry an interest rate of 10.95% per annum payable monthly, with a tenure of 24 months and 26 days. The allotment date is September 24, 2025, with maturity scheduled for October 20, 2027. The debentures are proposed to be listed and will be redeemed according to the Debenture Trust Deed executed between the issuer and the Debenture Trustee.",
            "Sentiment": "neutral",
            "PublishDate": 1758722524633,
            "Source": "corporate_action"
        },
        {
            "Title": "Manba Finance Board Approves INR 200 Crore Debt Securities Issuance",
            "Summary": "Manba Finance Limited's Board of Directors approved the issuance of debt securities worth up to INR 200 crores through private placement in one or more tranches. The approved instruments include Secured Non-Convertible Debentures, Perpetual Debt Instruments, and Unsecured Subordinated Non-Convertible Debentures. The board has authorized the finance committee to execute this debt issuance. The board meeting was held on September 22, 2025, lasting 30 minutes from 3:00 PM to 3:30 PM at the company's corporate office.",
            "Sentiment": "neutral",
            "PublishDate": 1758536508911,
            "Source": "corporate_action"
        },
        {
            "Title": "Manba Finance Reports 43% AUM Growth and 89% PAT Surge in Q1 FY26",
            "Summary": "Manba Finance Limited reported strong quarterly results with Assets Under Management reaching INR 1,415 crore, reflecting 43% year-on-year growth. The NBFC achieved record disbursements of INR 165 crore, up 27% from INR 130 crore in Q1 FY25. Net interest income grew 38% to INR 31 crore with net interest margin at 12.43%. Profit after tax surged 89% year-on-year to INR 10 crore. The company expanded its dealer network by 77% to 1,258 dealers and operates across 76 locations in 6 states. GNPA stood at 3.47% and NNPA at 2.64%, while capital adequacy ratio remained strong at 28.21%. Cost of borrowing increased to 11.05%. The company reduced loan-to-value ratios from January to tighten credit standards and introduced new collection app to improve efficiency. Management targets 30-35% AUM growth and aims for PAT of INR 85-100 crore by FY27. Two-wheeler loans comprise 82% of total AUM, with the company planning to diversify into EV financing, three-wheelers, and used cars while keeping unsecured loans below 10%.",
            "Sentiment": "positive",
            "PublishDate": 1754551218979,
            "Source": "earnings"
        },
        {
            "Title": "Manba Finance Reports Strong Q1 Growth with Revenue Up 37% and Net Profit Nearly Doubles",
            "Summary": "Manba Finance reported Q1 revenue of 670 million rupees compared to 490 million rupees in the same period last year, representing a year-over-year increase. The company's net profit reached 98 million rupees versus 51.8 million rupees in the prior year period, showing significant growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754299538258,
            "Source": "earnings"
        },
        {
            "Title": "Manba Finance Allocates ₹50 Crore for Secured Non-Convertible Debentures",
            "Summary": "Manba Finance has allocated ₹50 crore for secured non-convertible debentures through private placement.",
            "Sentiment": "positive",
            "PublishDate": 1751033333000,
            "Source": "default"
        },
        {
            "Title": "Manba Finance Approves ₹2 Billion NCD Issuance",
            "Summary": "The Board of Directors of Manba Finance has approved raising funds through the issuance of Non-Convertible Debentures (NCDs) worth ₹2 billion.",
            "Sentiment": "positive",
            "PublishDate": 1750490134000,
            "Source": "default"
        },
        {
            "Title": "Manba Finance Approves 2 Billion Rupee Debt Securities Issuance",
            "Summary": "Manba Finance has approved the issuance of debt securities totaling 2 billion rupees. No further details about the terms, purpose, or timeline of the issuance were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1750420255000,
            "Source": "default"
        },
        {
            "Title": "Manba Finance Board to Review Debt Securities Issuance",
            "Summary": "Manba Finance's board plans to review the issuance of debt securities worth up to 2 billion rupees. The company is considering this financial move, which could potentially impact its capital structure and funding capabilities.",
            "Sentiment": "neutral",
            "PublishDate": 1750168528000,
            "Source": "default"
        },
        {
            "Title": "Manba Finance Reports Q4 Financial Results",
            "Summary": "Manba Finance has reported its Q4 financial results. The company's net profit for the quarter was 80 million rupees, compared to 98 million rupees year-over-year and 130 million rupees quarter-over-quarter. Revenue for Q4 was 655 million rupees, up from 505 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747922724000,
            "Source": "result"
        },
        {
            "Title": "Manba Finance Collaborates with BGAUSS Auto and Fin Coopers Capital for Vehicle Financing",
            "Summary": "Manba Finance has entered into two strategic partnerships to expand its vehicle financing offerings. The company has collaborated with BGAUSS Auto to provide financing for electric vehicles, and with Fin Coopers Capital for general vehicle financing. These alliances aim to strengthen Manba Finance's position in the vehicle financing market and diversify its portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1742190235000,
            "Source": "corporate_action"
        },
        {
            "Title": "Manba Finance Forms Strategic Alliances to Promote Sustainable Mobility and Financial Empowerment",
            "Summary": "Manba Finance has established strategic partnerships with BGAUSS Auto, FIN Coopers Capital, and Prosparity. These alliances aim to promote sustainable mobility solutions and enhance financial empowerment initiatives in India. The collaborations are expected to contribute to the development of eco-friendly transportation options and improve access to financial services.",
            "Sentiment": "positive",
            "PublishDate": 1742190189000,
            "Source": "corporate_action"
        },
        {
            "Title": "Manba Finance Reports Significant Revenue Growth in Q3",
            "Summary": "Manba Finance has reported a substantial increase in its third-quarter revenue. The company's revenue for Q3 reached 644 million rupees, compared to 438 million rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1737963177000,
            "Source": "earnings"
        },
        {
            "Title": "Manba Finance Reports Significant Increase in Q3 Net Profit",
            "Summary": "Manba Finance has reported a substantial year-over-year increase in its third-quarter net profit. The company's net profit for Q3 rose to 130 million rupees, compared to 48 million rupees in the same period last year, representing a significant growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1737963129000,
            "Source": "earnings"
        },
        {
            "Title": "Manba Finance: AUM Surpasses ₹1,200 Crore Milestone",
            "Summary": "Manba Finance Ltd achieved its highest-ever Assets Under Management (AUM) of ₹1,200 crore, driven by strong performance in the recent festive season with ₹250 crore in auto loans disbursed. The company maintains a low credit loss of less than 1% and plans to expand its product offerings across its network of 71 locations in six states.",
            "Sentiment": "positive",
            "PublishDate": 1732864092000,
            "Source": "normal_news"
        },
        {
            "Title": "Manba Finance Achieves Record-Breaking Assets Under Management",
            "Summary": "Manba Finance has reported surpassing its highest ever Assets Under Management (AUM) of 1200 crore rupees. This milestone indicates significant growth and financial strength for the company.",
            "Sentiment": "positive",
            "PublishDate": 1732850633000,
            "Source": "corporate_action"
        },
        {
            "Title": "Manba Finance Approves Issuance of Non-Convertible Debentures",
            "Summary": "Manba Finance has approved the issuance of Non-Convertible Debentures (NCDs) for an aggregate amount of up to 200 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1732774993000,
            "Source": "corporate_action"
        },
        {
            "Title": "Manba Finance to Consider Fresh Issue of Securities",
            "Summary": "Manba Finance has scheduled a board meeting on November 28 to consider issuing new securities worth up to 2 billion rupees. The securities will be issued on a private placement basis and may be released in one or more tranches.",
            "Sentiment": "neutral",
            "PublishDate": 1732279150000,
            "Source": "corporate_action"
        },
        {
            "Title": "Manba Finance Partners with Piaggio for 3-Wheeler Financing",
            "Summary": "Manba Finance has signed a Memorandum of Understanding (MOU) with Piaggio Vehicles to provide customized financing solutions for three-wheeled vehicles. This partnership aims to enhance accessibility to financial services for potential buyers of Piaggio's three-wheeler range.",
            "Sentiment": "positive",
            "PublishDate": 1731922749000,
            "Source": "corporate_action"
        },
        {
            "Title": "Manba Finance Reports Q2 Revenue Growth",
            "Summary": "Manba Finance has reported a revenue of 646 million rupees for the second quarter, compared to 521 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729757477000,
            "Source": "result"
        },
        {
            "Title": "Manba Finance Reports Q2 Net Profit Decline",
            "Summary": "Manba Finance has reported a net profit of 116 million rupees for the second quarter, down from 139 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1729757419000,
            "Source": "result"
        },
        {
            "Title": "Manba Finance Reports Significant Profit Growth in Q1",
            "Summary": "Manba Finance has reported a substantial increase in net profit for Q1, rising to 51.8 million rupees from 26.8 million rupees year-over-year. This represents a 93.3% increase. However, there was a decrease from the previous quarter's 97.9 million rupees. Revenue also saw growth, reaching 456.2 million rupees compared to 340.8 million rupees in the same quarter last year, marking a 33.9% increase.",
            "Sentiment": "positive",
            "PublishDate": 1729265085000,
            "Source": "result"
        }
    ]
}