{
    "Symbol": "MANCREDIT",
    "ISIN": "INE545L01039",
    "News": [
        {
            "Title": "Mangal Credit Board Meet Set for Feb 9 for Q3 Results",
            "Summary": "Mangal Credit & Fincorp Limited has scheduled a board meeting on February 9, 2026, to consider and approve Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770223449684,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mangal Credit Opens New Branch in Chittorgarh",
            "Summary": "Mangal Credit & Fincorp Limited announces the inauguration of its new Chittorgarh branch in Rajasthan on January 16, 2026, expanding its geographical presence in the state.",
            "Sentiment": "positive",
            "PublishDate": 1768465371714,
            "Source": "stocks"
        },
        {
            "Title": "Mangal Credit Gets Enhanced Credit Rating",
            "Summary": "Mangal Credit and Fincorp Limited receives reaffirmed CRISIL BBB Stable rating with enhanced bank loan facilities from ₹200 crore to ₹400 crore on December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767184776606,
            "Source": "stocks"
        },
        {
            "Title": "Mangal Credit and Fincorp Allots ₹10 Crore Non-Convertible Debentures on Private Placement",
            "Summary": "Mangal Credit and Fincorp Limited allotted 1,000 secured, rated, redeemable non-convertible debentures worth ₹10 crore at 12.90% annual coupon rate with tenure of 1 year 10 months and 7 days. The NCDs are secured by first ranking charge on identified receivables and will be listed on BSE Limited with monthly interest payments and quarterly principal repayments starting from the 21st month.",
            "Sentiment": "positive",
            "PublishDate": 1764136481635,
            "Source": "corporate_action"
        },
        {
            "Title": "Mangal Credit and Fincorp Reports Strong Q2 Results and Proposes Rs 10 Crore NCD Issue",
            "Summary": "Mangal Credit and Fincorp Limited reported quarterly results for September 30, 2025, with profit after tax of Rs 299.45 lakhs and approved a proposal to raise up to Rs 10 crore through Non-Convertible Debentures on private placement basis. The company also completed conversion of 15.50 lakh equity warrants raising Rs 12.79 crore and issued 1,500 NCDs worth Rs 15 crore during the quarter, strengthening its capital base for lending operations.",
            "Sentiment": "positive",
            "PublishDate": 1763053845529,
            "Source": "earnings"
        },
        {
            "Title": "Mangal Credit Converts 15.5 Lakh Warrants to Equity, Raises ₹127.9 Crore",
            "Summary": "Mangal Credit has completed the conversion of 15.5 lakh warrants into equity shares at ₹110 per share. The conversion raised ₹127.9 crore from promoter Hardik Jain. Following this transaction, the company's equity capital has expanded to ₹21.1 crore, with promoter holding increasing to 11.26%.",
            "Sentiment": "positive",
            "PublishDate": 1755605006852,
            "Source": "corporate_action"
        },
        {
            "Title": "Mangal Credit and Fincorp Reports Q1 FY2026 Results, Approves Key Board Appointments",
            "Summary": "Mangal Credit and Fincorp Limited approved unaudited financial results for the quarter ended June 30, 2025. The company reported total revenue from operations of Rs 1,447.22 lakhs compared to Rs 1,187.17 lakhs in the same quarter last year. Net profit for the quarter stood at Rs 299.94 lakhs versus Rs 374.70 lakhs in the previous year quarter. The Board approved re-appointment of Mr. Sriram Sankaranarayanan as Independent Director for a second five-year term and appointed Vijay S. Tiwari & Associates as Secretarial Auditor for five years starting FY 2025-26. The company scheduled its 63rd Annual General Meeting for September 25, 2025, and fixed September 17, 2025 as the record date for dividend eligibility. During the quarter, the company issued 2,500 non-convertible debentures worth Rs 2,500 lakhs. The company operates as a Base Layer NBFC registered with Reserve Bank of India.",
            "Sentiment": "neutral",
            "PublishDate": 1754397298399,
            "Source": "earnings"
        }
    ]
}