{
    "Symbol": "MANGALAM",
    "ISIN": "INE584F01014",
    "News": [
        {
            "Title": "Mangalam Drugs Board Approves Key Leadership Changes",
            "Summary": "Mangalam Drugs & Organics accepts independent director resignation, appoints new CFO Jeevan M. Dalvi, and approves Dr. Praveen Saxena's re-appointment for second term.",
            "Sentiment": "neutral",
            "PublishDate": 1770371439706,
            "Source": "stocks"
        },
        {
            "Title": "Mangalam Drugs Reports Q3 FY26 Loss, Key Resignations",
            "Summary": "Mangalam Drugs & Organics posted consolidated net loss of ₹983.55 lakhs in Q3 FY26 vs profit of ₹128.68 lakhs in Q3 FY25. CFO and Company Secretary resigned citing health and career reasons.",
            "Sentiment": "negative",
            "PublishDate": 1768479712359,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mangalam Drugs Clarifies No Material Info on Price Move",
            "Summary": "Mangalam Drugs & Organics responds to BSE surveillance query, stating no material information pending disclosure and attributing price movements to market sentiment.",
            "Sentiment": "neutral",
            "PublishDate": 1767768535932,
            "Source": "stocks"
        },
        {
            "Title": "Mangalam Drugs CFO Ajay Samant Resigns",
            "Summary": "Mangalam Drugs & Organics announces CFO Ajay Samant's resignation effective March 31, 2025, due to attainment of retirement age as per company guidelines.",
            "Sentiment": "neutral",
            "PublishDate": 1766577700694,
            "Source": "stocks"
        },
        {
            "Title": "Mangalam Drugs And Organics Secures Rs 15 Crore Order",
            "Summary": "Mangalam Drugs And Organics has received an order worth Rs 15 crore. The order represents approximately 26% of the company's current market capitalization of Rs 57 crore.",
            "Sentiment": "positive",
            "PublishDate": 1764115879804,
            "Source": "stock"
        },
        {
            "Title": "Mangalam Drugs Reports Rs 2,097 Crore Loss as US-AID Funding Discontinuation Hits Operations",
            "Summary": "Mangalam Drugs and Organics posted a net loss of Rs 2,097.44 crores for the half-year ended September 2025, compared to a profit of Rs 537.07 crores in the same period last year. The pharmaceutical company's business, which relies heavily on funding for TB, HIV, and Malaria treatments, was severely impacted by the discontinuation of US-AID funding, leading to a sharp decline in treatment-related orders and prompting discussions with lenders for debt restructuring.",
            "Sentiment": "negative",
            "PublishDate": 1763650073708,
            "Source": "earnings"
        },
        {
            "Title": "Mangalam Drugs and Organics Defaults on Bank Loans Worth Rs 765 Lacs",
            "Summary": "Mangalam Drugs and Organics Limited has defaulted on loan obligations totaling Rs 765.19 lacs to Bank of Baroda and Bank of Maharashtra for over 30 days, with defaults starting from October 17 and October 20, 2025 respectively. The company attributes the financial stress to reduced funding from US Aid being discontinued by the US government and decreased orders for TB, HIV, and Malaria treatments, with only Global Fund providing reduced budget support.",
            "Sentiment": "negative",
            "PublishDate": 1763460720742,
            "Source": "stock"
        },
        {
            "Title": "Mangalam Drugs and Organics Postpones Board Meeting to November 20, 2025",
            "Summary": "Mangalam Drugs and Organics Limited has postponed its Board of Directors meeting from November 13, 2025 to November 20, 2025 due to unavoidable circumstances. The meeting agenda includes considering and approving un-audited financial results for the quarter ended September 30, 2025, taking note of CFO Mr. Ajay Avinash Samant's resignation, and other business items. The company's trading window for share dealings remains closed from October 1, 2025 until 48 hours after the announcement of quarterly financial results to stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1763029108915,
            "Source": "corporate_action"
        },
        {
            "Title": "Shree Kishoriyu Trading Pledges Additional Shares in Mangalam Drugs",
            "Summary": "Shree Kishoriyu Trading and Investments Private Limited has pledged 1,05,000 shares (0.66% of total share capital) of Mangalam Drugs and Organics Limited to M/s Badjate Stock Broking Private Ltd as security for debt. The pledge was created on November 8, 2025. Following this transaction, the promoter's total encumbered holding increased to 7,28,900 shares (4.61% of total share capital), while maintaining an overall holding of 10,98,557 shares (6.94% of total share capital) in the target company.",
            "Sentiment": "neutral",
            "PublishDate": 1762897257340,
            "Source": "corporate_action"
        },
        {
            "Title": "Mangalam Drugs and Organics Receives NCLT Approval for Merger Scheme, Final Hearing Set for December 2025",
            "Summary": "Mangalam Drugs and Organics Limited received a certified true copy of the order from the National Company Law Tribunal (NCLT) Mumbai Bench admitting the petition for a scheme of merger by absorption involving Mangalam Laboratories Private Limited and Shri JB Pharma Private Limited. The petition was presented before the NCLT on September 23, 2025, and was admitted by NCLT Bench-III comprising Ms. Lakshmi Gurung (Member Judicial) and Sh. Hariharan Neelakanta Iyer (Member Technical). The tribunal has scheduled the final hearing and disposal for December 16, 2025. The NCLT has directed notices to be issued to various statutory authorities including the Central Government, Income Tax Authorities, Reserve Bank of India, Securities and Exchange Board, and other relevant regulators for their representations within 30 days. The company has committed to keep the exchanges informed of further material developments in this matter.",
            "Sentiment": "positive",
            "PublishDate": 1760522893838,
            "Source": "corporate_action"
        },
        {
            "Title": "Manglam Group Enters Mumbai Redevelopment Market with ₹100 Crore Borivali Project",
            "Summary": "Manglam Group has launched its first Mumbai redevelopment project, Manglam Rajanigandha, in Borivali (West) with an investment of ₹100 crore. The project is expected to generate approximately ₹150 crore in revenues upon completion. Developed under Manglam & Karnani Ventures LLP, the project spans 80,000 sq. ft. and will deliver 80 two-bedroom apartments with RERA carpet areas ranging from 680 to 776 sq. ft. Half of the units will be allocated to existing tenants, with the remainder offered to new buyers. The project is scheduled for completion in June 2026. The development will include amenities such as landscaped green zones, fitness center, yoga deck, jogging track, and sun deck. All homeowners will receive lifetime membership at the Mandapeshwar Civic Federation Gymkhana. This marks Manglam Group's strategic expansion into Mumbai's redevelopment market, building on its portfolio of 87 completed projects and 32 ongoing developments across India.",
            "Sentiment": "positive",
            "PublishDate": 1759753210271,
            "Source": "stock"
        },
        {
            "Title": "Mangalam Drugs & Organics Unsecured Creditors Approve Merger Scheme with 98.46% Majority",
            "Summary": "Mangalam Drugs & Organics Limited held a Tribunal Convened Meeting of unsecured creditors on August 12, 2025, via video conferencing to vote on a merger resolution. The meeting approved the Scheme of Merger by Absorption of Mangalam Laboratories Private Limited and Shri JB Pharma Private Limited with Mangalam Drugs and Organics Limited. Out of 80 total unsecured creditors as of the December 31, 2024 cut-off date, 36 attended the meeting. The voting results showed 37 creditors with a value of ₹27.38 crore (98.46%) voted in favor, while 1 creditor with a value of ₹0.43 crore (1.54%) voted against the resolution. The e-voting facility was provided through remote voting and during the meeting. Venugopal Prasad Rao was appointed as scrutinizer by the NCLT Mumbai Bench. The resolution was declared passed with the requisite majority.",
            "Sentiment": "positive",
            "PublishDate": 1755158935517,
            "Source": "corporate_action"
        },
        {
            "Title": "Mangalam Drugs & Organics Holds Tribunal Meetings to Approve Merger Scheme",
            "Summary": "Mangalam Drugs & Organics Limited conducted two tribunal-convened meetings on August 12, 2025, to approve a merger scheme. The unsecured creditors meeting ran from 11:05 AM to 11:27 AM, while the equity shareholders meeting was held from 12:39 PM to 1:05 PM, both via video conferencing. The meetings sought approval for the merger by absorption of Mangalam Laboratories Private Limited and Shri JB Pharma Private Limited with Mangalam Drugs and Organics Limited. The meetings were held pursuant to an NCLT Mumbai order dated June 30, 2025. Remote e-voting facilities were provided through NSDL, with voting lines remaining open for 30 minutes post-meeting conclusion. Scrutinizer Venugopal Prasad Rao will submit consolidated voting results to stock exchanges within prescribed timelines.",
            "Sentiment": "neutral",
            "PublishDate": 1755012436260,
            "Source": "corporate_action"
        },
        {
            "Title": "Mangalam Drugs Reports Rs 1,372.80 Lakh Net Loss in Q1 2025",
            "Summary": "Mangalam Drugs & Organics Limited reported a net loss of Rs 1,372.80 lakh for the quarter ended June 30, 2025, compared to a net profit of Rs 268.47 lakh in the same quarter last year. Revenue from operations declined to Rs 5,734.87 lakh from Rs 7,653.62 lakh year-over-year. The company's earnings per share dropped to negative Rs 8.67 from positive Rs 1.70 in the previous year quarter. Total expenses increased to Rs 6,623.26 lakh. The company operates in manufacturing of bulk drugs segment. A merger scheme involving Mangalam Laboratories Private Limited and Shri JB Pharma Private Limited is pending approval from the National Company Law Tribunal, with creditor and shareholder meetings scheduled for August 12, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1754581256345,
            "Source": "earnings"
        }
    ]
}