{
    "Symbol": "MANGLMCEM",
    "ISIN": "INE347A01017",
    "News": [
        {
            "Title": "Mangalam Cement Board Meet Set for Feb 6, 2026",
            "Summary": "Mangalam Cement Limited has scheduled its board meeting for February 6, 2026, to consider and approve unaudited standalone financial results for Q3 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769248708272,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mangalam Cement's Bid for Limestone Block Rejected",
            "Summary": "Rajasthan government rejected Mangalam Cement's bid for Nimana Duniya Extension limestone block (408.30 hectares) on Dec 31, 2024, despite being preferred bidder since July 8, 2024 with 35.05% final price offer.",
            "Sentiment": "negative",
            "PublishDate": 1767431359664,
            "Source": "stocks"
        },
        {
            "Title": "Mangalam Cement Reports Promoter Share Transfer",
            "Summary": "Mangalam Cement Limited disclosed inter-se transfer of 11,017 equity shares between promoters under SEBI regulations, with Anshuman Vikram Jalan transferring shares to family members.",
            "Sentiment": "neutral",
            "PublishDate": 1766221496256,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mangalam Cement Promoter Disposes 5,508 Shares",
            "Summary": "Anshuman Vikram Jalan reduces stake in Mangalam Cement from 1.06% to 1.04% through inter-se transfer of 5,508 equity shares on December 17, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766142035161,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mangalam Cement Promoter Increases Stake via Gift Transfer",
            "Summary": "Vaishnaviajan acquired 5,508 shares through inter-se transfer among promoters, increasing holding from 0.18% to 0.20% in Mangalam Cement Ltd on December 17, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766141965091,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mangalam Cement Promoter Acquires Additional Shares",
            "Summary": "Avayaan Vikram Jalan acquired 5,509 shares of Mangalam Cement through inter-se transfer among promoters, increasing holding from 0.08% to 0.10% of total equity capital.",
            "Sentiment": "neutral",
            "PublishDate": 1765967662295,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anshuman Jalan Reduces Mangalam Cement Stake",
            "Summary": "Anshuman Vikram Jalan, a promoter of Mangalam Cement, disposed 5,509 shares through inter-se transfer, reducing his shareholding from 1.08% to 1.06% on December 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765967633783,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mangalam Cement Promoters Execute Inter-Se Transfer of 11,017 Equity Shares",
            "Summary": "Anshuman Vikram Jalan transferred 11,017 equity shares of Mangalam Cement Ltd. as gifts to promoters Vaishnavi Jalan (5,508 shares) and Avayaan Vikram Jalan (5,509 shares), representing 0.02% of total capital each. The inter-se transfer between promoter group members is scheduled after December 11, 2025, with no consideration involved and compliance with SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764912669268,
            "Source": "corporate_action"
        },
        {
            "Title": "Mangalam Cement Opens Dubai Branch Office for Raw Material Procurement",
            "Summary": "Mangalam Cement Limited's Board of Directors approved the establishment of a branch office in Dubai, UAE, for purchasing Pet Coke, Coal, and other materials. The decision was made during a board meeting held on November 8, 2025, and the company has informed stock exchanges NSE and BSE about this development.",
            "Sentiment": "positive",
            "PublishDate": 1762597249908,
            "Source": "stock"
        },
        {
            "Title": "Mangalam Cement Reports Strong Q2 Performance with 509% Jump in Net Profit",
            "Summary": "Mangalam Cement delivered robust quarterly results with net profit surging to 201 million rupees from 33 million rupees in the same period last year. Revenue grew to 3.94 billion rupees compared to 3.59 billion rupees year-over-year. EBITDA increased significantly to 427 million rupees from 301 million rupees, while EBITDA margin improved to 10.81% from 8.39% in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762594096199,
            "Source": "earnings"
        },
        {
            "Title": "Mangalam Cement Faces ₹1.14 Crore Financial Impact from Tax Authority Order on Input Tax Credit Violations",
            "Summary": "Mangalam Cement Limited received an adjudication order from the Additional Commissioner, CGST, Office of Principal Commissioner, Jaipur regarding inadmissible Input Tax Credit violations. The order confirms ₹56.86 lakh as inadmissible ITC to be recovered, along with interest and an equal penalty of ₹56.86 lakh, totaling ₹1.14 crore financial impact. The violations relate to wrongly availed irregular Input Tax Credit of ₹1.11 crore during July 2018 to November 2019, contravening multiple sections of CGST Rules 2017. The company disagrees with the findings and plans to file an appeal within three months. Additionally, ITC of ₹34.92 lakh claimed under IGST was dropped from proceedings.",
            "Sentiment": "negative",
            "PublishDate": 1760453891712,
            "Source": "stock"
        },
        {
            "Title": "Mangalam Cement Reports Non-Delivery of $5.4M Petroleum Coke Cargo, Files Insurance Claim",
            "Summary": "Mangalam Cement Limited disclosed a material event regarding a procurement agreement with AUM Commodities FZCO for 55,000 MT of Green Delayed Petroleum Coke from Venezuela at USD 99.90 per MT CIF. The company opened irrevocable letters of credit totaling USD 53,98,255 representing 90% of the cargo value. Despite cargo loading completion on May 23, 2024, the shipment has not been delivered to Kandla Port. The company filed an insurance claim with Liva Insurance B.S.C.(c) on June 19, 2025, seeking USD 5,371,263.92 plus interest and costs for the non-delivered cargo. The company has also issued legal demands through English solicitors against various parties including the contractual carrier Huanshan HK Limited, ship managers, charterers, and brokers to protect their rights under the bills of lading.",
            "Sentiment": "negative",
            "PublishDate": 1754646078253,
            "Source": "stock"
        },
        {
            "Title": "Mangalam Cement Reports 89% Jump in Net Profit, Discloses $5.4M Cargo Delivery Issue",
            "Summary": "Mangalam Cement Limited reported net profit of Rs 3,225.93 lakhs for the quarter ended June 30, 2025, compared to Rs 1,706.30 lakhs in the same quarter last year. Revenue from operations increased to Rs 45,174.26 lakhs from Rs 38,057.30 lakhs year-over-year. The company disclosed a material event involving non-delivery of petroleum coke cargo worth $5.4 million. Mangalam had entered into an arrangement with AUM Commodities FZCO in July 2024 to procure 55,000 MT of Green Delayed Petroleum Coke at $99.90 per MT. Despite payment through letters of credit totaling $53,98,255, the cargo loaded in May 2024 has not been delivered to Kandla Port. The company has filed an insurance claim with Liva Insurance for $5,371,263.92 and issued legal demands through solicitors against various parties including the contractual carrier. Basic and diluted earnings per share stood at Rs 11.73 compared to Rs 6.21 in the previous year quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754644465668,
            "Source": "earnings"
        },
        {
            "Title": "Mangalam Cement Reports Strong Q1 Performance with Revenue Up 18% to 4.5B Rupees",
            "Summary": "Mangalam Cement delivered robust quarterly results with revenue increasing to 4.5 billion rupees from 3.8 billion rupees year-over-year. The company's EBITDA surged to 752 million rupees compared to 297 million rupees in the same period last year, while EBITDA margin expanded significantly to 16.64% from 7.8%. Net profit also showed strong growth, rising to 322 million rupees from 171 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754643789279,
            "Source": "earnings"
        },
        {
            "Title": "Mangalam Cement Schedules Board Meeting to Approve Quarterly Financial Results",
            "Summary": "Mangalam Cement Limited has scheduled a Board of Directors meeting on August 8, 2025, to consider and approve the unaudited financial results for the quarter ended June 30, 2025. The company has implemented a trading window closure for designated persons from July 1 to August 10, 2025, in accordance with insider trading regulations. The board meeting notice will be available on the company's website and stock exchange platforms.",
            "Sentiment": "neutral",
            "PublishDate": 1753443636553,
            "Source": "corporate_action"
        },
        {
            "Title": "Mangalam Cement Named Top Bidder for Rajasthan Mining Block",
            "Summary": "Mangalam Cement has been named as the top bidder for the Nimana-Duniya mining block in Rajasthan. This development suggests the company is potentially expanding its mining operations in the region.",
            "Sentiment": "positive",
            "PublishDate": 1751948025000,
            "Source": "default"
        },
        {
            "Title": "Mangalam Cement Reports Q4 Results and Dividend Declaration",
            "Summary": "Mangalam Cement has declared a dividend of 1.5 rupees per share. The company's Q4 EBITDA increased to 542 million rupees from 456 million rupees year-over-year. The Q4 EBITDA margin also improved to 10.77% from 10.42% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1746874979000,
            "Source": "result"
        },
        {
            "Title": "Mangalam Cement Reports Q4 FY23 Financial Results",
            "Summary": "Mangalam Cement has announced its financial results for the fourth quarter of fiscal year 2023. The company reported a net profit of 169 million rupees, slightly down from 173 million rupees in the same quarter last year, but up from 78 million rupees in the previous quarter. Revenue for Q4 increased to 5.03 billion rupees, up from 4.4 billion rupees in the corresponding period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1746874633000,
            "Source": "result"
        },
        {
            "Title": "Mangalam Cement Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Mangalam Cement has reported a year-over-year decrease in its third quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 435 million rupees from 574 million rupees in the same quarter last year. Additionally, the EBITDA margin declined to 9.91% from 13.06% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738843715000,
            "Source": "earnings"
        },
        {
            "Title": "Mangalam Cement Reports Decline in Q3 Net Profit",
            "Summary": "Mangalam Cement has reported a significant decrease in its third-quarter net profit, which fell to 78 million rupees from 160 million rupees in the same period last year. The company's revenue remained relatively stable at 4.38 billion rupees, compared to 4.39 billion rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1738843710000,
            "Source": "earnings"
        },
        {
            "Title": "Mangalam Cement Reports Q2 Revenue Decline",
            "Summary": "Mangalam Cement has reported a revenue of 3.6 billion rupees for the second quarter, down from 4.3 billion rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731574816000,
            "Source": "result"
        },
        {
            "Title": "Mangalam Cement Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Mangalam Cement's Q2 EBITDA decreased to 301 million rupees from 481 million rupees year-over-year. The company's EBITDA margin also fell to 8.39% from 11.22% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731574774000,
            "Source": "result"
        },
        {
            "Title": "Mangalam Cement Reports Decline in Q2 Net Profit",
            "Summary": "Mangalam Cement has reported a net profit of 33 million rupees for the second quarter, down from 118 million rupees in the same period last year, representing a significant year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731574729000,
            "Source": "result"
        }
    ]
}