{
    "Symbol": "MANINDS",
    "ISIN": "INE993A01026",
    "News": [
        {
            "Title": "Man Industries EGM Approves Independent Director",
            "Summary": "Man Industries shareholders approve appointment of Mrs. Esha Padmanabhan Achan as Independent Director at EGM held February 10, 2026 with 99.99% votes in favour.",
            "Sentiment": "positive",
            "PublishDate": 1770823949088,
            "Source": "stocks"
        },
        {
            "Title": "Man Industries Q3FY26 Results: Revenue Up 10.00%",
            "Summary": "Man Industries reported Q3FY26 standalone revenue of ₹80,354 lakhs vs ₹73,083 lakhs YoY. Net profit surged 62.00% to ₹6,090 lakhs. Order book stands at ₹4,005 crores.",
            "Sentiment": "positive",
            "PublishDate": 1770622693548,
            "Source": "co_actions_results"
        },
        {
            "Title": "Man Industries Board Meet Set for Feb 9, 2026",
            "Summary": "Man Industries (India) Limited has scheduled a board meeting on February 9, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769855152285,
            "Source": "co_actions_results"
        },
        {
            "Title": "Man Industries Gains 7% on ₹550 Cr Order Win",
            "Summary": "Man Industries shares surged 7% to ₹375.55 after securing pipe supply orders worth ₹550 crore from domestic and international clients, boosting total order book to ₹4,600 crore.",
            "Sentiment": "positive",
            "PublishDate": 1768204188716,
            "Source": "co_actions_results"
        },
        {
            "Title": "Man Industries Secures ₹550 Cr Orders",
            "Summary": "Man Industries announces new orders worth approximately ₹550 crore with expected delivery timeline of six months, strengthening the company's order book position.",
            "Sentiment": "positive",
            "PublishDate": 1768188610907,
            "Source": "co_actions_results"
        },
        {
            "Title": "Man Industries Changes Foreign Subsidiary Name",
            "Summary": "Man Industries (India) Limited announces name change of Dubai-based subsidiary from Man Overseas Metal DMCC to Man Overseas Invest FZCO, maintaining same legal status and shareholding pattern.",
            "Sentiment": "neutral",
            "PublishDate": 1767094104851,
            "Source": "stocks"
        },
        {
            "Title": "Man Industries IT Investigation Concludes Dec 22",
            "Summary": "Man Industries (India) Limited announces completion of IT Department search on December 22, 2025, with full cooperation provided and no impact on business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1766405577281,
            "Source": "stocks"
        },
        {
            "Title": "Income Tax Raids Conducted on Man Industries",
            "Summary": "Income tax authorities have conducted raids on Man Industries since yesterday, according to reports. The steel sector company is currently under investigation by tax officials.",
            "Sentiment": "negative",
            "PublishDate": 1766116965278,
            "Source": "stocks"
        },
        {
            "Title": "MAN Industries Signs 5-Year MoU with Aramco Asia India for Saudi Arabia Manufacturing Expansion",
            "Summary": "MAN Industries (India) Limited signed a Memorandum of Understanding with Aramco Asia India Pvt. Ltd. on November 19, 2025, to explore long-term supply arrangements and potential establishment of a steel pipe manufacturing facility in Saudi Arabia. The five-year agreement aims to enhance local manufacturing capabilities and support energy infrastructure requirements across Saudi Arabia, GCC, and the broader Middle East region.",
            "Sentiment": "positive",
            "PublishDate": 1763625518691,
            "Source": "order&deals"
        },
        {
            "Title": "Man Industries Submits Monitoring Report for Rs 2,550 Crore Preferential Issue Fund Utilization",
            "Summary": "Man Industries (India) Limited submitted its monitoring agency report for the quarter ended September 30, 2025, detailing utilization of Rs 2,549,997,624 raised through preferential equity shares issue. The company utilized Rs 639.5 crore for business expansion as guarantee deposit for strategic acquisition and Rs 1,030 crore for working capital requirements including LC payments and vendor settlements.",
            "Sentiment": "positive",
            "PublishDate": 1763123491412,
            "Source": "earnings"
        },
        {
            "Title": "Ashish Kacholia Increases Stake in Man Industries to 3.04%",
            "Summary": "Investor Ashish Kacholia has increased his shareholding in Man Industries to 3.04% from 1.2% during Q2. The stake increase represents a significant rise in his investment in the company.",
            "Sentiment": "positive",
            "PublishDate": 1760941819899,
            "Source": "stock"
        },
        {
            "Title": "Man Industries Receives Stay Order from Securities Appellate Tribunal Against SEBI Debarment",
            "Summary": "Man Industries (India) Limited has obtained a stay order from the Securities Appellate Tribunal (SAT) regarding a SEBI order dated September 29, 2025, that imposed penalties and debarment against the company and three other parties. The SAT granted a stay on the market access restrictions while allowing the appeal to proceed. The tribunal directed Man Industries to deposit 50% of the Rs 1 crore penalty within two weeks, which will be kept in a fixed deposit with a lien marked to SEBI. The investigation period spans from 2014 to 2021, with a show cause notice issued in 2022. The next hearing is scheduled for January 20, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1760433484790,
            "Source": "corporate_governance"
        },
        {
            "Title": "Man Industries Receives Stay on SEBI Order, Required to Pay Half of Penalty",
            "Summary": "Man Industries (India) has been granted a stay on a SEBI order. As part of the stay arrangement, the company is required to pay half of the penalty amount imposed by SEBI.",
            "Sentiment": "neutral",
            "PublishDate": 1760083159525,
            "Source": "corporate_governance"
        },
        {
            "Title": "SEBI Imposes 2-Year Market Ban on Man Industries Over Fund Diversion Allegations",
            "Summary": "SEBI has banned Man Industries and its top executives from accessing the market for two years due to alleged fund diversion and compliance violations. The violations occurred between FY2015-FY2021 and included failure to consolidate subsidiary Merino Shelters Pvt. Ltd (MSPL), misreporting related-party transactions, and round-tripping of funds. Specific violations included converting a Rs 564.14 crore loan to MSPL into capital advance without audit committee approval, extending loans without proper approvals, and writing off Rs 400 crore in inter-corporate deposits without required disclosures. Man Industries stated the matter relates to legacy issues and that it has consolidated financials since FY2023-24. The company reported revenue of Rs 4,700 crore with improved margins and sold MSPL assets for Rs 70 crore, expecting Rs 650-700 crore over the next five to six years. The Rs 25-lakh penalty will not impact the company's financial position, and there are no restrictions on share trading by investors. Company shares fell 10% in the previous session but are up 30% over the last six months.",
            "Sentiment": "negative",
            "PublishDate": 1759290371412,
            "Source": "corporate_governance"
        },
        {
            "Title": "SEBI Bars Man Industries and Top Executives for Two Years Over Fund Diversion",
            "Summary": "SEBI has barred Man Industries and three top executives from securities markets for two years due to alleged fund diversion. The banned executives include chairman Ramesh Mansukhani, managing director Nikhil Mansukhani, and finance chief Ashok Gupta. The regulator found that the pipes and steel products maker failed to consolidate its unit Merino Shelters in financials between fiscal years 2015 and 2021, misrepresented related-party transactions, and engaged in round-tripping of funds to mask its financial position. SEBI will seek penalties of 2.5 million rupees ($28,186.48) each from the company and the three executives. A forensic auditor was appointed in November 2021 to examine the company's books during the investigation period.",
            "Sentiment": "negative",
            "PublishDate": 1759158940886,
            "Source": "corporate_governance"
        },
        {
            "Title": "Man Industries Secures Rs 1,700 Crore Order, Boosting Total Order Book to Rs 4,700 Crore",
            "Summary": "Man Industries has secured a new order worth Rs 1,700 crore. The company's total unexecuted order book now stands at approximately Rs 4,700 crore. This new order is expected to add around 50% to the company's annual revenue. Man Industries has a market capitalization of Rs 2,600 crore.",
            "Sentiment": "positive",
            "PublishDate": 1756872598868,
            "Source": "order&deals"
        },
        {
            "Title": "Man Industries Reports 45% Jump in Q1 FY2026 Net Profit Despite Revenue Decline",
            "Summary": "Man Industries (India) Limited reported mixed Q1 FY2026 results with consolidated revenue declining 0.9% to Rs 74,213 lakhs while net profit surged 45% to Rs 2,762 lakhs. Consolidated profit before tax increased 39.1% to Rs 3,826 lakhs. On standalone basis, revenue fell 2.6% to Rs 71,310 lakhs but net profit grew 20.7% to Rs 2,913 lakhs. The steel products manufacturing and trading segment generated Rs 74,213 lakhs revenue with segment results of Rs 3,770 lakhs, while the real estate segment reported no revenue and a loss of Rs 117 lakhs. The company maintains an order book of approximately Rs 3,200 crores for execution over 6-12 months. The Board restructured proceeds from a preferential equity issue, reducing general corporate purposes allocation from Rs 25.99 crores to Rs 20.99 crores due to non-participation of one allottee. Corporate governance updates include reappointment of an Independent Director and new auditor appointments.",
            "Sentiment": "positive",
            "PublishDate": 1754922459732,
            "Source": "earnings"
        },
        {
            "Title": "MAN Industries Reports 30% Jump in Q1 Net Profit Despite Flat Revenue",
            "Summary": "MAN Industries reported quarterly consolidated net profit of 276 million rupees compared to 191 million rupees in the same period last year. The company's EBITDA increased to 491 million rupees from 377 million rupees year-over-year, with EBITDA margin improving to 6.62% from 5.04%. Revenue remained relatively stable at 7.4 billion rupees versus 7.49 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754920897673,
            "Source": "earnings"
        },
        {
            "Title": "Man Industries Allots 12.2 Lakh Warrants to Promoter Group Entity",
            "Summary": "Man Industries (India) Limited has allotted 12,19,512 warrants convertible into equity shares to Man Finance Private Limited, a promoter group entity, on a preferential basis. The warrants are priced at Rs. 328 per warrant with a face value of Rs. 5 each. Each warrant can be converted into one equity share within 18 months from the allotment date. Upon conversion, the resulting equity shares will rank equally with existing shares. The allotment was approved by the company's Allotment Committee during a meeting held on August 2, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754134373921,
            "Source": "corporate_action"
        },
        {
            "Title": "Man Industries Raises 2.55 Billion Rupees Through Share Allotment to Ashish Kacholia",
            "Summary": "Man Industries (India) has raised 2.55 billion rupees through a special share allotment to investor Ashish Kacholia. Under this arrangement, Kacholia received 914,000 shares from the company.",
            "Sentiment": "positive",
            "PublishDate": 1753709923890,
            "Source": "order&deals"
        },
        {
            "Title": "Man Industries: Secures Rs 1,150 Crore International Pipe Supply Order",
            "Summary": "Man Industries (India) Ltd. secured an order worth Rs 1,150 crore for supplying various types of pipes to an international entity. The order will be completed in 6-12 months, bringing the total unexecuted order book to Rs 3,500 crore. The company's share price rose to a 10-month high following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1749108343000,
            "Source": "order&deals"
        },
        {
            "Title": "Man Industries Reports Unexecuted Order Book Exceeding Market Cap",
            "Summary": "Man Industries has reported an unexecuted order book totaling ₹3,500 crores, which is higher than its current market capitalization of ₹2,600 crores.",
            "Sentiment": "positive",
            "PublishDate": 1749106461000,
            "Source": "default"
        },
        {
            "Title": "Man Industries Secures ₹1150 Crore Project",
            "Summary": "Man Industries has secured a project worth ₹1150 crores. The news briefly mentions the company's acquisition of a significant contract, but provides no further details about the nature of the project, its duration, or any other specifics.",
            "Sentiment": "positive",
            "PublishDate": 1749106365000,
            "Source": "default"
        },
        {
            "Title": "MAN Industries Approves ₹300 Crore Fund Raising and Share Allotment",
            "Summary": "The board of MAN Industries has approved a fund raising of ₹300 crores through preferential allotment. Additionally, the company has allotted 9.1 lakh shares to investor Ashish Kacholia.",
            "Sentiment": "positive",
            "PublishDate": 1748875403000,
            "Source": "default"
        },
        {
            "Title": "MAN Industries (India): ₹300 Crore Fundraising via Preferential Issue",
            "Summary": "MAN Industries plans to raise ₹300 crore through preferential allotment of convertible warrants and equity shares. The funds will support expansion projects in Jammu and Saudi Arabia, enhance working capital, and strengthen the balance sheet. An EGM is scheduled for June 25, 2025, for shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1748875194000,
            "Source": "corporate_action"
        },
        {
            "Title": "MAN Industries (India) Ltd: Record Q4 and FY25 Performance",
            "Summary": "MAN Industries reported Q4FY25 PAT of ₹68.1 crore, up 182.4% YoY. Q4 revenue grew 50.3% to ₹1,218.5 crore. FY25 revenue increased 11.6% to ₹3,505.4 crore, with PAT up 45.7%. The company has a ₹2,500 crore order book and targets 20% revenue growth for FY26. Expansion projects in Saudi Arabia and Jammu are on track for Q3FY26 operations.",
            "Sentiment": "positive",
            "PublishDate": 1747047309000,
            "Source": "earnings"
        },
        {
            "Title": "MAN Industries Reports Significant Increase in Q4 Consolidated Net Profit",
            "Summary": "MAN Industries has reported a substantial year-over-year increase in its consolidated net profit for the fourth quarter. The company's net profit rose to 682 million rupees, up from 241 million rupees in the same period last year, marking a significant improvement in financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1747035037000,
            "Source": "result"
        },
        {
            "Title": "Man Industries: Saudi Facility to Complete in FY26, Expansion Plans Underway",
            "Summary": "Man Industries plans to complete its ₹650 crore pipe manufacturing facility in Damman, Saudi Arabia, in the current fiscal year. The company targets 30-35% revenue growth in FY26 and up to 40% in FY27. A ₹500 crore capex is planned for FY26 to complete plants, including a 22,000-tonne stainless steel seamless pipe plant in Jammu. Man Industries is also entering hydrogen-capable pipe manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1746192920000,
            "Source": "corporate_action"
        },
        {
            "Title": "MAN Industries (India) Limited: Approved as Supplier for Qatar Energy LNG",
            "Summary": "MAN Industries (India) Limited has been included in Qatar Energy LNG's approved vendor list for line pipes. This approval opens up new opportunities in the Middle East sour grade line pipe market.",
            "Sentiment": "positive",
            "PublishDate": 1743679809000,
            "Source": "normal_news"
        },
        {
            "Title": "MAN Industries Added to Qatar Energy LNG's Approved Vendor List",
            "Summary": "MAN Industries has been included in Qatar Energy LNG's approved vendor list. This inclusion suggests that the company has met the necessary qualifications and standards to potentially supply products or services to Qatar Energy's LNG operations.",
            "Sentiment": "positive",
            "PublishDate": 1743664480000,
            "Source": "corporate_action"
        },
        {
            "Title": "Man Industries Monetizes Navi Mumbai Land in Deal with Paradise Group",
            "Summary": "Man Industries has entered into a land monetization agreement with Paradise Group for its property in Navi Mumbai. The total value of the transaction is estimated to be between 720 to 770 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1743478161000,
            "Source": "corporate_action"
        },
        {
            "Title": "Man Industries: Ambitious Revenue Growth and Expansion Plans",
            "Summary": "Man Industries expects 30-35% revenue growth in FY26 from existing facilities, with potential 40% growth in FY27. The company is undertaking two major expansions in Saudi Arabia and Jammu & Kashmir, totaling Rs 1,100-1,150 crore in investments. Both facilities are expected to be operational by December, with the Saudi project addressing local demand and import duties, while the J&K expansion benefits from government incentives.",
            "Sentiment": "positive",
            "PublishDate": 1743219702000,
            "Source": "normal_news"
        },
        {
            "Title": "MAN Industries Expects Significant Growth in Saudi Arabia and India",
            "Summary": "MAN Industries anticipates Rs 1,500 crore in revenue from Saudi Arabia and aims to achieve Rs 1,000 crore in the current quarter. The company also projects a 25% growth in its Indian business for the next year, according to a recent conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1739504013000,
            "Source": "earnings"
        },
        {
            "Title": "MAN Industries Sets Ambitious Revenue Target for FY 2026-27",
            "Summary": "MAN Industries has announced a revenue target of over Rs 6,000 crore for the fiscal year 2026-27. The company also expects its subsidiary to contribute significantly, with an anticipated revenue of over Rs 2,000 crore in the same period. This information was shared during a company conference call.",
            "Sentiment": "positive",
            "PublishDate": 1739503789000,
            "Source": "earnings"
        },
        {
            "Title": "MAN Industries Projects 25% Growth for FY25-26",
            "Summary": "MAN Industries has announced ambitious growth projections during a recent conference call. The company anticipates a 25% growth in the upcoming fiscal year 2025-2026. They have set a target revenue of approximately Rs 4,000 crore for MAN Industries on a standalone basis.",
            "Sentiment": "positive",
            "PublishDate": 1739503698000,
            "Source": "earnings"
        },
        {
            "Title": "MAN Industries Reports Improved Q3 EBITDA and Margin",
            "Summary": "MAN Industries has reported a significant improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 787 million rupees, up from 647 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin expanded to 10.76% from 7.77% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739369959000,
            "Source": "earnings"
        },
        {
            "Title": "MAN Industries Reports Q3 FY24 Financial Results",
            "Summary": "MAN Industries has announced its Q3 financial results. The company's consolidated net profit increased to 341 million rupees from 306 million rupees year-over-year. However, revenue decreased to 7.32 billion rupees from 8.3 billion rupees compared to the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739369953000,
            "Source": "earnings"
        },
        {
            "Title": "Man Industries Secures Order Worth 250 Crore Rupees",
            "Summary": "Man Industries has won a new order valued at 250 crore rupees. The company, which has a market capitalization of 1700 crore rupees, has not provided further details about the nature or timeline of the order.",
            "Sentiment": "positive",
            "PublishDate": 1739352249000,
            "Source": "order&deals"
        },
        {
            "Title": "Man Industries: Board Approves Rs 300 Crore Fundraising Plan and New CFO Appointment",
            "Summary": "Man Industries' board has approved raising Rs 300 crore through various equity instruments. The company also appointed Sandeep Kumar as the new CFO, effective January 18, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1737213081000,
            "Source": "corporate_action"
        },
        {
            "Title": "Man Industries to Consider Proposal for Raising Funds Through Preferential Issue",
            "Summary": "Man Industries has announced that it will consider a proposal to raise funds by issuing securities on a preferential basis to one or more allottees. The company's board is scheduled to discuss this proposal on January 18.",
            "Sentiment": "neutral",
            "PublishDate": 1736993104000,
            "Source": "corporate_action"
        },
        {
            "Title": "MAN Industries Board to Consider Asset Sale",
            "Summary": "MAN Industries (India) has announced a board meeting scheduled for November 21 to consider the sale of an asset belonging to one of its units.",
            "Sentiment": "neutral",
            "PublishDate": 1732002382000,
            "Source": "corporate_action"
        },
        {
            "Title": "Man Industries: New Plants to Boost Revenue by $500 Million",
            "Summary": "Man Industries' MD Nikhil Mansukhani announces two new plants in Saudi Arabia and Jammu & Kashmir, expected to add $500 million in revenue. Saudi plant to be operational by August 2026, Jammu unit by Q3 2024. Company projects 15-20% growth this year with improved EBITDA margins.",
            "Sentiment": "positive",
            "PublishDate": 1731807000000,
            "Source": "normal_news"
        }
    ]
}