{
    "Symbol": "MANINFRA",
    "ISIN": "INE949H01023",
    "News": [
        {
            "Title": "Man Infraconstruction Q3FY26 Warrant Proceeds Report",
            "Summary": "Man Infraconstruction submits monitoring agency report for Q3FY26 showing utilization of INR 221.45 crore from preferential warrant issue proceeds of INR 512.64 crore, with INR 291.19 crore remaining unutilized.",
            "Sentiment": "neutral",
            "PublishDate": 1770801530652,
            "Source": "co_actions_results"
        },
        {
            "Title": "MICL Reports Q3 FY26 Results with Strong Project Pipeline",
            "Summary": "Man Infraconstruction Limited delivered Q3 FY26 revenue of ₹153.3 crores with real estate sales of ₹447 crores. Company launched Artek Park project in BKC with ₹850+ crores sales potential.",
            "Sentiment": "positive",
            "PublishDate": 1770797187741,
            "Source": "co_actions_results"
        },
        {
            "Title": "Man Infraconstruction Board Meet on Feb 11 for Q3FY25",
            "Summary": "Man Infraconstruction Limited has scheduled a board meeting on February 11, 2025, to consider and approve unaudited financial results for Q3FY25. Trading window remains closed until February 13, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770117793276,
            "Source": "co_actions_results"
        },
        {
            "Title": "Man Infraconstruction Dilutes US Subsidiary Stake",
            "Summary": "Man Infraconstruction Limited reduces its membership interest in MICL Tigertail LLC from 50% to 25%, receiving US $1.2 million consideration from the transaction completed on January 20, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768906562456,
            "Source": "co_actions_results"
        },
        {
            "Title": "Man Infraconstruction Promoter Parag K. Shah Acquires 50,000 Additional Shares",
            "Summary": "Parag K. Shah, promoter of Man Infraconstruction Limited, acquired 50,000 equity shares through open market transactions on November 28, 2025. The acquisition increased his shareholding from 29.56% to 29.57%, while the combined promoter group holding remains at 62.37% of the company's total equity capital.",
            "Sentiment": "neutral",
            "PublishDate": 1764575657754,
            "Source": "corporate_action"
        },
        {
            "Title": "Man Infraconstructure Promoter Parag K. Shah Acquires 60,000 Additional Shares",
            "Summary": "Parag K. Shah, promoter of Man Infraconstructruction Limited, acquired 60,000 equity shares through open market transactions on November 26, 2025. The acquisition increased his shareholding from 29.54% to 29.56%, while the combined promoter group holding remains at 62.36% of the company's total equity capital.",
            "Sentiment": "positive",
            "PublishDate": 1764308611790,
            "Source": "corporate_action"
        },
        {
            "Title": "Man Infraconstruction Promoter Parag K. Shah Acquires Additional 1 Lakh Shares",
            "Summary": "Parag K. Shah, promoter of Man Infraconstruction Limited, acquired 1,00,000 equity shares through open market purchase on November 24, 2025. The acquisition increased his shareholding from 29.50% to 29.52%, while the combined promoter group holding rose to 62.32% of the company's total share capital.",
            "Sentiment": "positive",
            "PublishDate": 1764045111529,
            "Source": "stock"
        },
        {
            "Title": "Man Infraconstruction Limited Declares Second Interim Dividend of Rs. 0.45 Per Share",
            "Summary": "Man Infraconstruction Limited's Board of Directors approved unaudited financial results for the quarter and half year ended September 30, 2025, and declared a second interim dividend of Rs. 0.45 per equity share (22.50%) on 40,36,66,505 equity shares with face value of Rs. 2 each for Financial Year 2025-26. The record date for dividend entitlement is November 18, 2025, with payment scheduled for December 2, 2025. The company's consolidated total income from operations was reported, along with segment-wise revenue breakdowns for engineering, procurement and contracting, and real estate businesses.",
            "Sentiment": "positive",
            "PublishDate": 1762982432341,
            "Source": "earnings"
        },
        {
            "Title": "Man Infra Construction Reports 24% YoY Growth in Q2 PAT, Launches Luxury Project Artek Park in Mumbai's BKC",
            "Summary": "Man Infra Construction Limited announced its quarterly results with consolidated PAT growing 24% year-on-year in Q2 FY26, achieving a PAT margin of 29.5%. The company's real estate sales doubled to ₹424 crores in Q2 FY26, with cumulative sales reaching ₹916 crores in H1 FY26. MICL sold 1.2 lakh sq.ft. of carpet area in Q2 and 2.6 lakh sq.ft. in H1 FY26, primarily from ongoing projects in Tardeo, Vile Parle (West) and Dahisar. The company launched Artek Park, a luxury residential project opposite Jio World Drive complex in Bandra-Kurla Complex, which has already achieved aggregate sales value of ₹32 crores since launch. The project offers approximately 1.6 lakh sq.ft. of carpet area with estimated sales potential exceeding ₹850 crores, where MICL holds a 34% stake. The company maintains consolidated liquidity of ₹693 crores and remains net-debt free at consolidated levels. MICL plans to launch new luxury projects in Pali Hill and Marine Lines during FY26. Additionally, MICL Global acquired a 7.7% membership interest in a Miami residential development project comprising 102 luxury condominium units.",
            "Sentiment": "positive",
            "PublishDate": 1762975769746,
            "Source": "earnings"
        },
        {
            "Title": "Man Infraconstruction Plans Real Estate and EPC Expansion with Mumbai Projects and Infrastructure Diversification",
            "Summary": "Man Infraconstruction has outlined growth plans for its real estate and EPC businesses. The company is launching large residential projects in the Mumbai region and diversifying into ports, warehousing, and infrastructure sectors. The company reports a record sales pipeline with improving realization and is focusing on debt reduction and margin expansion.",
            "Sentiment": "positive",
            "PublishDate": 1762960723593,
            "Source": "stock"
        },
        {
            "Title": "Man Infracon Reports No Deviation in Warrant Proceeds Utilization for September 2025 Quarter",
            "Summary": "Man Infracon Construction Limited submitted its monitoring agency report for the quarter ended September 30, 2025, regarding the utilization of proceeds from preferential issue of convertible warrants. ICRA Limited, the monitoring agency, reported no deviation from the stated objects of the issue. The net proceeds stood at INR 512.641 crore as of September 30, 2025, reduced from the original INR 543.215 crore due to forfeiture of 26,30,000 warrants whose conversion option was not exercised by holders. The company utilized INR 164.103 crore during the quarter across four main objectives: expanding EPC and real estate business (INR 46.910 crore utilized), working capital requirements (INR 100.970 crore utilized), and general corporate purposes (INR 16.223 crore utilized). No amount was utilized for purchase of fixed assets. The remaining unutilized funds of INR 348.538 crore were deployed in fixed deposits with Bank of Baroda and Union Bank, and mutual fund investments, earning returns ranging from 5.99% to 7.15%.",
            "Sentiment": "neutral",
            "PublishDate": 1762952715038,
            "Source": "corporate_action"
        },
        {
            "Title": "Man Infraconstruction Reports Mixed Q2 Results with Higher Profit Despite Revenue Decline",
            "Summary": "Man Infraconstruction reported quarterly consolidated net profit of 600 million rupees compared to 472 million rupees in the same period last year. However, revenue declined to 1.5 billion rupees from 2.3 billion rupees year-over-year. The company's EBITDA increased to 366 million rupees from 276 million rupees, while EBITDA margin significantly improved to 24.59% from 11.97% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762948324709,
            "Source": "earnings"
        },
        {
            "Title": "Man Infraconstruction Limited Receives Rating Reaffirmation from CARE Ratings",
            "Summary": "CARE Ratings Limited has reaffirmed the credit ratings for Man Infraconstruction Limited's bank facilities. The company's long-term bank facilities worth Rs. 32.50 crores received a CARE A4 Stable rating, while long-term/short-term bank facilities of Rs. 387.00 crores (reduced from Rs. 442.00 crores) were rated CARE A- Stable/CARE A1. The rating committee reviewed these ratings based on recent developments including operational and financial performance. The total rated facilities amount to Rs. 419.50 crores, comprising fund-based limits from Union Bank of India and Bank of Baroda, along with non-fund based limits from the same banks.",
            "Sentiment": "neutral",
            "PublishDate": 1762893370312,
            "Source": "corporate_action"
        },
        {
            "Title": "Man Infraconstruction Promoters Execute Share Transfer Between September 1-4, 2025",
            "Summary": "Promoters of Man Infraconstruction Limited completed equity share transactions in the open market between September 1-4, 2025. Parag K. Shah acquired 5,36,440 shares while Vatsal P. Shah disposed of an equal number of shares across three trading sessions. The transactions included 100 shares on September 1, 2,36,340 shares on September 3, and 3,00,000 shares on September 4. Following these transactions, Parag K. Shah's shareholding increased to 11,90,83,405 shares (29.50%), while Vatsal P. Shah's holding decreased to 3,49,97,069 shares (8.67%). The combined promoter group holding remained at 62.30% of the company's total equity capital of 40,36,66,505 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1757056154812,
            "Source": "corporate_action"
        },
        {
            "Title": "Man Infraconstruction Unit's Associate Invests $10 Million in US Real Estate Development Partnership",
            "Summary": "An associate of MICL Global, which is a unit of Man Infraconstruction, has acquired a 15.385% stake in 1250 JV LP, a US-based entity, through a $10 million investment. The investment is focused on real estate development activities in the United States.",
            "Sentiment": "neutral",
            "PublishDate": 1756457930630,
            "Source": "order&deals"
        },
        {
            "Title": "Man Infraconstruction's Subsidiary Acquires 50% Stake in US Real Estate Entity Admire 1250 LLC",
            "Summary": "MICL Global, INC, a wholly owned subsidiary of Man Infraconstruction Limited, acquired 50% membership interest in Admire 1250 LLC effective August 26, 2025. The acquisition involves a cash consideration of US $5 million as initial capital contribution. Admire 1250 LLC is a real estate development entity incorporated in Delaware, USA in August 2025, which has yet to commence business operations and currently has nil turnover. The entity will carry out real estate development and other lawful activities. This is not a related party transaction, though promoter group member Vatsal Shah will be appointed as manager of the entity. The promoter and promoter group have no other interest in the acquired entity.",
            "Sentiment": "neutral",
            "PublishDate": 1756204174390,
            "Source": "order&deals"
        },
        {
            "Title": "Man Infraconstruction Targets Growth Through Real Estate and EPC Expansion",
            "Summary": "Man Infraconstruction is targeting strong growth in both real estate and EPC (Engineering, Procurement, and Construction) segments. The company's strategy includes leveraging a large project pipeline, focusing on high-margin residential developments, and pursuing strategic land acquisitions. The company plans to use its cash flow strength to support this expansion across multiple business areas.",
            "Sentiment": "positive",
            "PublishDate": 1755102938579,
            "Source": "stock"
        },
        {
            "Title": "Man Infraconstruction Reports Strong Q1FY26 Performance with ₹512 Crore Fund Raise",
            "Summary": "Man Infraconstruction Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, and related party transactions subject to shareholder approval. The company recorded consolidated revenue of ₹182.9 crores and profit after tax of ₹55.6 crores for Q1FY26. Real estate sales reached ₹492 crores covering 1.5 lakh sq. ft. of carpet area, with collections of ₹234 crores. The company successfully raised ₹512 crores through conversion of 3.24 crore equity warrants at ₹155 each, strengthening consolidated liquidity to around ₹800 crores. MICL maintains a net cash positive balance sheet with zero secured debt and plans to launch new projects with estimated sales potential of ₹3,400 crores in FY26. The company submitted monitoring agency reports confirming no deviation in use of proceeds from the preferential warrant issue.",
            "Sentiment": "positive",
            "PublishDate": 1755096493160,
            "Source": "earnings"
        },
        {
            "Title": "Man Infraconstruction Reports Decline in Q1 Financial Performance",
            "Summary": "Man Infraconstruction reported quarterly results showing a significant decline across key financial metrics. Revenue dropped to 1.8 billion rupees from 3.4 billion rupees in the same period last year. Net profit decreased to 583 million rupees compared to 843 million rupees year-over-year. EBITDA fell to 406 million rupees from 835 million rupees, while EBITDA margin contracted to 22.19% from 24.45% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1755093164104,
            "Source": "earnings"
        },
        {
            "Title": "Man Infraconstruction Issues 29.66 Lakh Equity Shares",
            "Summary": "Man Infraconstruction has issued 29.66 lakh equity shares following the conversion of warrants. This action represents a corporate move that increases the company's outstanding shares.",
            "Sentiment": "neutral",
            "PublishDate": 1752237353000,
            "Source": "default"
        },
        {
            "Title": "Man Infra Converts 95.29 Lakh Warrants to Equity Shares",
            "Summary": "Man Infraconstruction Limited (Man Infra) has converted 95.29 lakh warrants into equity shares. The total value of this conversion is ₹110.78 crore.",
            "Sentiment": "positive",
            "PublishDate": 1750421167000,
            "Source": "default"
        },
        {
            "Title": "MAN Infra Acquires 36.07% Stake in Subsidiary MAN Realtors",
            "Summary": "MAN Infra has acquired 1.7 million equity shares, representing a 36.07% stake, in its subsidiary MAN Realtors and Holding Pvt Ltd. The acquisition was made at a price of ₹215 per share.",
            "Sentiment": "positive",
            "PublishDate": 1749569021000,
            "Source": "default"
        },
        {
            "Title": "MAN Infra Subsidiary Acquires Additional 25% Stake in MICL Tigertail LLC",
            "Summary": "A subsidiary of MAN Infra has acquired an additional 25% stake in MICL Tigertail LLC. No further details about the transaction or the companies involved were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1748409134000,
            "Source": "default"
        },
        {
            "Title": "Man Infraconstruction: Sales Skyrocket Threefold in FY25",
            "Summary": "Man Infraconstruction Limited reported a threefold increase in FY25 sales to ₹2,251 crore, exceeding guidance. Q4FY25 contributed ₹743 crore, with 90% YoY growth. The company plans to launch new projects in FY26 with ₹3,400 crore sales potential, including ultra-luxury developments in Mumbai's premium areas.",
            "Sentiment": "positive",
            "PublishDate": 1747821590000,
            "Source": "earnings"
        },
        {
            "Title": "MAN INFRACONSTRUCTION Reports Q4 Financial Results",
            "Summary": "MAN INFRACONSTRUCTION has reported its Q4 financial results. The company's EBITDA increased to 1.06 billion rupees from 496 million rupees year-over-year. The EBITDA margin improved to 36.24% from 16.72% in the same period last year. Revenue slightly decreased to 2.9 billion rupees from 2.97 billion rupees year-over-year. The consolidated net profit rose to 769 million rupees from 646.5 million rupees compared to the previous year's quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747728438000,
            "Source": "result"
        },
        {
            "Title": "Man Infraconstruction: Board to Meet for Q4 Results and Interim Dividend",
            "Summary": "Man Infraconstruction's board will meet on May 20 to declare Q4 financial results and consider interim dividend for FY25. The stock price increased by over 2% in Tuesday's trading session.",
            "Sentiment": "positive",
            "PublishDate": 1747114988000,
            "Source": "corporate_action"
        },
        {
            "Title": "Man Infraconstruction: Acquires 26.40% Stake in New Subsidiary",
            "Summary": "Man Infraconstruction Ltd has subscribed to 2,640 equity shares (26.40%) in newly incorporated subsidiary Trident Agro Terminals and Logistic Private Limited. The subsidiary will focus on port development, logistics, and agricultural commodity processing and storage facilities.",
            "Sentiment": "neutral",
            "PublishDate": 1740641817000,
            "Source": "corporate_action"
        },
        {
            "Title": "Man Infraconstruction: Promoters Increase Stake, Stock Rebounds",
            "Summary": "Man Infraconstruction promoters, led by Mansi P. Shah, acquired 1,03,939 additional shares from the open market, increasing their stake from 66.62% to 66.67%. The stock, which initially dipped to ₹160.30, rebounded to close at ₹164.50 on the BSE.",
            "Sentiment": "positive",
            "PublishDate": 1739874143000,
            "Source": "corporate_action"
        },
        {
            "Title": "Man Infraconstruction: Second Interim Dividend Declared for FY25",
            "Summary": "Man Infraconstruction has declared a second interim dividend of Rs. 0.45 per equity share for FY 2024-25. The record date is set for February 12, 2025, with payment scheduled for February 24, 2025. This dividend represents 22.5% of the face value of equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1738574581000,
            "Source": "corporate_action"
        },
        {
            "Title": "MAN INFRACONSTRUCTION Reports Q3 Financial Results",
            "Summary": "MAN INFRACONSTRUCTION has reported its Q3 consolidated financial results. The company's net profit for the quarter stands at 840 million rupees, compared to 865 million rupees in the same quarter last year. Revenue for Q3 remains stable at 2.4 billion rupees, unchanged from the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1738567564000,
            "Source": "earnings"
        },
        {
            "Title": "Man Infraconstruction: Q3 Results and Potential Dividend Announcement Upcoming",
            "Summary": "Man Infraconstruction will hold a board meeting on February 2025 to consider Q3FY25 financial results and a potential interim dividend declaration for FY2024-25. The company reported strong H1FY25 performance with sales of ₹900 crore, up 282% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1738058795000,
            "Source": "corporate_action"
        },
        {
            "Title": "Man Infraconstruction to Consider Q3 Results",
            "Summary": "Man Infraconstruction Limited has announced that it will consider its financial results for the third quarter on February 3.",
            "Sentiment": "neutral",
            "PublishDate": 1737978437000,
            "Source": "earnings"
        },
        {
            "Title": "MAN Infra Wins Agricultural Processing and Storage Project at J N Port",
            "Summary": "MAN Infra has been awarded an agricultural processing and storage project at Jawaharlal Nehru Port. The estimated cost of the project is approximately 284 crore rupees, as reported by ET Infra.",
            "Sentiment": "positive",
            "PublishDate": 1735792580000,
            "Source": "order&deals"
        },
        {
            "Title": "Man Infraconstruction: Stock Nears Breakout, Potential Buying Opportunity",
            "Summary": "Man Infraconstruction shares rose 1.45% to ₹247.90 on BSE, approaching a potential breakout above ₹248. The stock has gained 21% in one month and 22% in three months. H1FY25 sales increased 282% to ₹900 crore. Analysts suggest buying if the stock breaks above ₹248, with a target of ₹325.",
            "Sentiment": "positive",
            "PublishDate": 1735279282000,
            "Source": "normal_news"
        },
        {
            "Title": "Man Infraconstruction: Shares Surge 37% in 5 Weeks, 1300% in 5 Years",
            "Summary": "Man Infraconstruction's stock has risen 37% in the last 5 weeks following strong Q2 performance. The company reported a 282% YoY increase in H1FY25 sales to ₹900 crore. It received a credit rating upgrade to CARE A+, Stable. The company remains net debt-free with a cash balance of ₹520 crore and has a strong real estate project pipeline of 4.0 million square feet across Mumbai Metropolitan Region.",
            "Sentiment": "positive",
            "PublishDate": 1735022713000,
            "Source": "normal_news"
        },
        {
            "Title": "Man Infraconstruction Ltd: Realty Stock Surges Amid US Expansion and Strong Q1 Performance",
            "Summary": "Man Infraconstruction Ltd's stock rose 5.45% to Rs 191.85. The company acquired a 40% stake in a Miami real estate firm for $3 million, marking its entry into the US market. It reported strong Q1 FY25 results with sales of Rs 691 crore and improved PBT margin of 30.7%. The company remains debt-free with a cash balance of Rs 487 crore.",
            "Sentiment": "positive",
            "PublishDate": 1732521786000,
            "Source": "normal_news"
        },
        {
            "Title": "Man Infraconstruction: Shifts Focus to High-End Mumbai Real Estate",
            "Summary": "Man Infraconstruction Ltd. is realigning its development strategy to focus on luxury real estate projects in prime Mumbai locations. The company has divested from phase 3 of a Dahisar project to concentrate on high-end developments. This move aims to strengthen the MICL Group's brand image and improve profitability.",
            "Sentiment": "positive",
            "PublishDate": 1731761697000,
            "Source": "normal_news"
        },
        {
            "Title": "MICL Group Realigns Portfolio, Exits Dahisar Project Phase 3",
            "Summary": "MAN Infraconstruction's MICL Group has announced a strategic realignment of its portfolio, focusing on the luxury segment in Mumbai. As part of this strategy, the group has divested from Phase 3 of a project near Dahisar.",
            "Sentiment": "neutral",
            "PublishDate": 1731672456000,
            "Source": "corporate_action"
        },
        {
            "Title": "Man Infraconstruction Reports Q2 Financial Results",
            "Summary": "Man Infraconstruction has announced its Q2 consolidated financial results. The company reported a net profit of 472 million rupees, which is lower compared to 651 million rupees in the same quarter last year (YoY) and 844 million rupees in the previous quarter (QoQ). However, the company's revenue increased to 2.3 billion rupees from 2.16 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731456028000,
            "Source": "result"
        },
        {
            "Title": "Man Infraconstruction: US Real Estate Expansion and Strong Q1 Performance",
            "Summary": "Man Infraconstruction acquired 40% stake in a Miami-based real estate company for $3 million. The company reported strong Q1 FY25 results with sales value of Rs 691 crore, PBT margin increase to 30.7%, and total income of Rs 368.4 crores. ManInfra remains debt-free with Rs 487 crores cash balance and has invested over Rs 1000 crore in various projects.",
            "Sentiment": "positive",
            "PublishDate": 1730890804000,
            "Source": "normal_news"
        },
        {
            "Title": "MAN Infraconstruction Subsidiary Acquires 40% Stake in Real Estate Entity",
            "Summary": "A subsidiary of MAN Infraconstruction has acquired a 40% interest in Holding 752 & 758 NW 2 ST LLC, a company involved in real estate development.",
            "Sentiment": "neutral",
            "PublishDate": 1730805946000,
            "Source": "corporate_action"
        },
        {
            "Title": "Man Infraconstruction: Vile Parle Project Secures Commencement Certificate",
            "Summary": "<p>Man Infraconstruction Limited has received the <span class='positive'>Commencement Certificate</span> for its <span class='neutral'>Vile Parle project</span>, comprising <b>10 residential buildings</b> with <b>15 storeys</b> each. The project spans <b>3 acres</b>, offering over <b>3.5 lakh square feet</b> of carpet area and is expected to generate <span class='positive'>Rs 1,200 crores in sales</span>. MICL anticipates over <span class='positive'>Rs 200 crore in profit</span> before taxes from this development.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727847109000,
            "Source": "normal_news"
        }
    ]
}