{
    "Symbol": "MANKIND",
    "ISIN": "INE634S01028",
    "News": [
        {
            "Title": "Mankind Pharma subsidiary BSV faces GST inspection",
            "Summary": "Mankind Pharma disclosed that its subsidiary Bharat Serums and Vaccines Limited underwent a GST search and seizure operation by Mumbai tax authorities from February 03-08, 2026, with no material impact on operations.",
            "Sentiment": "neutral",
            "PublishDate": 1770630353229,
            "Source": "stocks"
        },
        {
            "Title": "Mankind Pharma Q3 Net Profit Rises to ₹4.1B",
            "Summary": "Mankind Pharma reported consolidated net profit of ₹4.10 billion for Q3, up from ₹3.80 billion year-on-year, though falling short of analyst estimates of ₹5.10 billion.",
            "Sentiment": "neutral",
            "PublishDate": 1770116874571,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mankind Pharma Q3 FY26 Earnings Call on Feb 3, 2026",
            "Summary": "Mankind Pharma announces investor conference call scheduled for February 3, 2026 at 6:00 PM IST to discuss Q3 & 9M FY26 financial results. Senior management including Vice Chairman Rajeev Juneja will participate.",
            "Sentiment": "neutral",
            "PublishDate": 1768558088047,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mankind Pharma Sees ₹22.27 Cr NSE Block Trade",
            "Summary": "Mankind Pharma witnessed a significant block trade on NSE worth ₹22.27 crores involving approximately 100,092 shares at ₹2,225.10 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768540403844,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mankind Pharma Sets Q3 Results Date for Feb 3",
            "Summary": "Mankind Pharma has announced that its board will convene on February 3 to consider and approve the company's third quarter financial results for the current fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1767942942557,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mankind Pharma Block Trade Worth ₹52.58 Crores",
            "Summary": "Mankind Pharma witnessed a significant block trade on NSE worth ₹52.58 crores involving 243,821 shares at ₹2,156.60 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1765518777141,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mankind Pharma Receives GST Order Worth ₹15.32 Cr",
            "Summary": "Mankind Pharma received a GST penalty order of ₹15.32 crores from Bihar GST Authority for FY2018-19 to FY2022-23. Company plans to appeal, expects no material impact on operations.",
            "Sentiment": "negative",
            "PublishDate": 1765380021006,
            "Source": "stocks"
        },
        {
            "Title": "Mankind Pharma Receives ESG Rating of 71 from NSE Sustainability",
            "Summary": "NSE Sustainability Ratings and Analytics Limited has independently assigned an Environmental, Social, and Governance (ESG) rating of 71 to Mankind Pharma for FY25 based on publicly available information. The company disclosed this rating to stock exchanges as required under SEBI listing regulations, noting they did not engage NSE Sustainability for this assessment.",
            "Sentiment": "neutral",
            "PublishDate": 1765354837868,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mankind Pharma Receives ESG Rating of 64.8 (Grade B) from SES ESG Research",
            "Summary": "SES ESG Research Private Limited independently assigned an Environmental, Social, and Governance (ESG) rating of 64.8 (Grade B) to Mankind Pharma for FY2024-25 based on publicly available information. The company disclosed this rating to stock exchanges as required under SEBI listing regulations, noting they did not engage SES for this assessment.",
            "Sentiment": "neutral",
            "PublishDate": 1764328540222,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mankind Pharma Allots 46,582 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Mankind Pharma allotted 46,582 equity shares with face value of ₹1 each to eligible employees who exercised their options under the ESOP Plan 2022 at an exercise price of ₹860 per share. The allotment increased the company's paid-up share capital from 41,27,58,490 equity shares to 41,28,05,072 equity shares, with the new shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764155548495,
            "Source": "corporate_action"
        },
        {
            "Title": "Mankind Pharma Sees Rs. 70.02 Crore Block Trade on NSE",
            "Summary": "Mankind Pharma witnessed a block trade worth Rs. 70.02 crores involving 314,302 shares executed at Rs. 2,227.90 per share on NSE. The transaction represents a significant institutional trading activity in the pharmaceutical company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1763707523651,
            "Source": "order&deals"
        },
        {
            "Title": "Mankind Pharma Receives GST Penalty Order of INR 22.16 Lakh for Merged Subsidiary",
            "Summary": "Mankind Pharma received a GST penalty order of INR 22,16,148 from Cuttack GST authorities for Financial Year 2018-19 and 2019-20, related to alleged ITC mismatch in returns of its merged subsidiary Lifestar Pharma Private Limited. The company considers the order arbitrary and unjustified, plans to file an appeal, and states there is no material impact on its financials or operations.",
            "Sentiment": "negative",
            "PublishDate": 1763286709888,
            "Source": "stock"
        },
        {
            "Title": "Mankind Pharma Withdraws Credit Rating for ₹3,500 Crore Commercial Paper",
            "Summary": "Mankind Pharma has withdrawn the credit rating for its ₹3,500 crore Commercial Paper instrument, which previously held an (ICRA)A1 rating, upon the company's request to ICRA Limited. The company maintains other outstanding ratings including ₹5,000 crore Non-Convertible Debentures rated (ICRA)AA/Stable and ₹1,500 crore Commercial Paper rated (ICRA)A1+.",
            "Sentiment": "neutral",
            "PublishDate": 1763057796028,
            "Source": "corporate_action"
        },
        {
            "Title": "Mankind Pharma Block Trade Worth Rs. 51.88 Crores Executed on NSE",
            "Summary": "A block trade involving Mankind Pharma shares was executed on the National Stock Exchange (NSE) for Rs. 51.88 crores. The transaction involved approximately 234,133 shares at a price of Rs. 2,215.90 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1762919722088,
            "Source": "order&deals"
        },
        {
            "Title": "Mankind Pharma Reports 21% Revenue Growth to ₹3,697 Crores in Q2 FY26",
            "Summary": "Mankind Pharma reported quarterly revenue growth of 21% year-on-year to ₹3,697 crores with EBITDA margin of 25%. For H1 FY26, revenue increased 23% to ₹7,268 crores with EBITDA margin of 24.4%. Domestic business grew 15% year-on-year to ₹3,184 crores, supported by BSV consolidation, though organic domestic growth was around 6%. The company faced supply chain disruption due to new GST rate rollout, with secondary sales increasing 6.3% compared to IPM growth of 7.2%. Export revenue surged 83% to ₹513 crores, primarily driven by BSV consolidation with organic export growth in mid-single digits. Chronic therapy share increased to 37.1% from 35.1% in the previous year. OTC business declined 3% to ₹226 crores due to GST disruption and uneven monsoon impact. R&D expenses increased to 2.9% of sales from 1.9% in the previous year. Management acknowledged underperformance versus expectations, citing transformation challenges including significant workforce changes across the organization. The company expects growth recovery in H2 and maintains BSV growth guidance of 18-20% for FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1762895847600,
            "Source": "earnings"
        },
        {
            "Title": "Mankind Pharma Reports Strong Q2 Performance with 15% Revenue Growth",
            "Summary": "Mankind Pharma Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of Rs. 2,608.78 crores for the quarter, compared to Rs. 2,261.43 crores in the previous year quarter, representing growth. Net profit for the quarter stood at Rs. 458.90 crores versus Rs. 362.68 crores in the corresponding period last year. For the six-month period, revenue reached Rs. 4,956.80 crores against Rs. 4,497.80 crores in the previous year. The company's earnings per share for the quarter was Rs. 11.10 compared to Rs. 10.00 in the prior year quarter. The Board of Directors approved these unaudited standalone and consolidated financial results at their meeting held on November 6, 2025. The company continues to face ongoing income tax proceedings initiated by the Income Tax Department under Section 132 of the Income Tax Act, 1961, with appeals currently pending with appellate tax authorities.",
            "Sentiment": "positive",
            "PublishDate": 1762458295413,
            "Source": "earnings"
        },
        {
            "Title": "Mankind Pharma Targets 20%+ Revenue Growth with Export Expansion and Specialty Portfolio Focus",
            "Summary": "Mankind Pharma has outlined growth guidance targeting sustained revenue growth of over 20%, driven by chronic therapy and BSV specialty portfolio expansion. The company reported strong export performance with 82% year-over-year growth. Management expects margin improvements from specialty and super-specialty products, along with a revival in consumer healthcare. The company aims to strengthen its OTC leadership position and double export contribution over the next three years.",
            "Sentiment": "positive",
            "PublishDate": 1762438371319,
            "Source": "stock"
        },
        {
            "Title": "Mankind Pharma Reports Mixed Q2 Results with Revenue Growth but Lower Profit",
            "Summary": "Mankind Pharma reported Q2 consolidated net profit of 5.11 billion rupees, down from 6.56 billion rupees in the same period last year. Revenue increased to 36.97 billion rupees compared to 30.61 billion rupees year-over-year. EBITDA rose to 9.21 billion rupees from 8.47 billion rupees, while EBITDA margin declined to 24.92% from 27.67% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762428611636,
            "Source": "earnings"
        },
        {
            "Title": "Mankind Pharma Receives ESG Rating 'B' from MSCI",
            "Summary": "Mankind Pharma has been assigned an ESG rating of 'B' by MSCI ESG Ratings and Research Private Limited. The company received the ESG report on November 4, 2025. MSCI issued the report independently without being engaged by Mankind Pharma for this assessment. The company has made this disclosure available on its website at www.mankindpharma.com.",
            "Sentiment": "neutral",
            "PublishDate": 1762298286537,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mankind Pharma Acquires Women's Health Portfolio for ₹797 Crore",
            "Summary": "Mankind Pharma has executed a business transfer agreement worth ₹797 crore with its wholly owned subsidiary Bharat Serums & Vaccines to acquire a women's health Rx branded generics portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1760314514830,
            "Source": "order&deals"
        },
        {
            "Title": "Mankind Pharma Acquires Women's Health Portfolio from BSV for ₹797 Crore",
            "Summary": "Mankind Pharma executed a Business Transfer Agreement to acquire BSV's Women Health Rx Portfolio for ₹797 crore through a slump sale. The payment will be made in two installments: 50% on closing date and remaining within 150 days. In quarterly results, the company reported an 18.1% decline in net profit to ₹444.6 crore despite revenue surging 24.5% to ₹3,570 crore. EBITDA increased 26% to ₹847.6 crore with margin improving to 23.7%. Domestic revenue grew 18.9% to ₹3,101 crore while export revenue jumped 81.1% to ₹469 crore. Market share increased from 4.8% to 4.9% and secondary sales grew 9.2% compared to IPM's 8.6%. Shares closed down 0.62% at ₹2,464.",
            "Sentiment": "neutral",
            "PublishDate": 1760096448956,
            "Source": "stock"
        },
        {
            "Title": "Mankind Pharma Acquires Women's Health Portfolio for ₹797 Crore",
            "Summary": "Mankind Pharma has executed a Business Transfer Agreement worth ₹797 crore with Bharat Serums & Vaccines to acquire a Women's Health Rx branded generics portfolio. Bharat Serums & Vaccines is a wholly owned subsidiary of Mankind Pharma.",
            "Sentiment": "positive",
            "PublishDate": 1760095267564,
            "Source": "order&deals"
        },
        {
            "Title": "Mankind Pharma Sees Rs. 51.37 Crore Block Trade on NSE",
            "Summary": "Mankind Pharma executed a block trade worth Rs. 51.37 crores on the National Stock Exchange. The transaction involved approximately 200,287 shares at a price of Rs. 2,564.60 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1756879851273,
            "Source": "order&deals"
        },
        {
            "Title": "Mankind Pharma Targets Zero-Debt Status by FY28, Eyes GLP-1 Obesity Market Entry",
            "Summary": "Mankind Pharma plans to eliminate its debt by FY28, with Managing Director Rajeev Juneja stating the company will be almost debt-free by FY27. The pharmaceutical company currently carries net debt of ₹5,200 crore and follows a conservative debt approach. Mankind expects to be among the first wave of GLP-1 launches in India, targeting the obesity treatment segment, which Juneja believes will see significant growth over the next 5-10 years. The company's consumer brand Gas-o-Fast is performing strongly, and it recently launched Nemulid after acquiring the brand from Panacea Biotech. Mankind has established a specialized OTC division to strengthen its consumer health business, which currently contributes 8-9% of revenue and is expected to grow in the high teens. Exports represent 13-14% of business including BSV, with the US contributing just 1%, though the company expects double-digit export growth ahead.",
            "Sentiment": "positive",
            "PublishDate": 1756724658714,
            "Source": "stock"
        },
        {
            "Title": "Mankind Pharma Sees Rs. 50.95 Crore Block Trade on NSE",
            "Summary": "Mankind Pharma Ltd. recorded a block trade worth Rs. 50.95 crores on the NSE. The transaction involved approximately 202,622 shares at a price of Rs. 2,514.70 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1755750881542,
            "Source": "order&deals"
        },
        {
            "Title": "Mankind Pharma Incorporates Wholly Owned Subsidiary in Russia",
            "Summary": "Mankind Pharma Limited has incorporated a wholly owned subsidiary named Mankind Pharma LLC in Russia on August 18, 2025, as part of its international expansion strategy. The company received intimation of the incorporation on August 19, 2025. This follows an earlier communication from April 14, 2025, where the company had disclosed its proposal to establish the subsidiary. The incorporation was announced to BSE Limited and National Stock Exchange of India Limited under regulatory disclosure requirements.",
            "Sentiment": "positive",
            "PublishDate": 1755599197311,
            "Source": "stock"
        },
        {
            "Title": "Mankind Pharma Expects Anti-Diabetic Portfolio to Remain Stable Despite GLP-1 Therapy Rise",
            "Summary": "Mankind Pharma expressed confidence that the growing popularity of GLP-1 therapies will not significantly impact its anti-diabetic drug portfolio. CEO Sheetal Arora stated that chronic therapies maintained momentum in the latest quarter, with both cardiology and anti-diabetes segments showing 1.5 times growth. The company expects to remain stable in the anti-diabetes market even if shifts occur within the segment, citing the strength of its mature brands and positioning across multiple therapy areas. Arora noted that traditional molecules typically don't disappear from the market when new treatments emerge. For the quarter, Mankind Pharma reported revenue growth of 24.5% to Rs 3,570 crore, though net profit declined 18.3% to Rs 438 crore. EBITDA increased 26.1% to Rs 847 crore with margins at 23.7%. The board approved an interim dividend of Re 1 per share.",
            "Sentiment": "positive",
            "PublishDate": 1754710460858,
            "Source": "earnings"
        },
        {
            "Title": "Mankind Pharma Reports 25% Revenue Growth to Rs 3,570 Crores in Q1 FY26",
            "Summary": "Mankind Pharma delivered strong quarterly results with total revenue growing 25% year-on-year to Rs 3,570 crores and EBITDA margin of 23.8%. Domestic revenue increased 19% driven by volume recovery and chronic therapy outperformance. The company maintained its 4th position by value with 4.9% market share and 2nd by volume with 6.2% share. International business surged 81% to Rs 469 crores, supported by BSV consolidation. OTC business grew 15% to Rs 237 crores with key brands showing strong performance - Gas-O-Fast up 36%, Manforce condoms up 18%. However, profit after tax declined 17.4% to Rs 445 crores due to higher finance costs and depreciation from BSV acquisition. The company announced an interim dividend of Rs 1 per share and maintains EBITDA guidance of 25-26% for the full year. BSV integration is progressing with expectations of 18-20% growth, while a new biological facility is being established with Rs 150-200 crores investment.",
            "Sentiment": "positive",
            "PublishDate": 1754503512158,
            "Source": "earnings"
        },
        {
            "Title": "Mankind Pharma Applies to Reclassify Ayushi and Poonam Estates LLP from Promoter to Public Category",
            "Summary": "Mankind Pharma Limited has submitted an application to BSE Limited and National Stock Exchange of India Limited to reclassify Ayushi and Poonam Estates LLP from the Promoter & Promoter Group category to the Public category. The application was submitted on August 3, 2025, following a Board Meeting outcome dated July 31, 2025. The reclassification request follows SEBI regulations under the Listing Obligations and Disclosure Requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1754241533780,
            "Source": "corporate_action"
        },
        {
            "Title": "Mankind Pharma Maintains FY26 Margin Targets, Expects Dydrogesterone Approvals by End-2025",
            "Summary": "Mankind Pharma management confirmed they remain on track to achieve EBITDA margin goals of 25-26% for FY26 and gross margins above 70% for the same period. The pharmaceutical company expects to receive dydrogesterone approvals from global markets by the end of 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754126307819,
            "Source": "stock"
        },
        {
            "Title": "Mankind Pharma Declares Rs. 1 Interim Dividend for FY 2025-26, Informs Shareholders on Tax Deduction",
            "Summary": "Mankind Pharma's Board of Directors declared an interim dividend of 100% (Rs. 1 per equity share) for FY 2025-26 on July 31, 2025. The dividend will be paid to shareholders whose names appear on records as of August 8, 2025, within 30 days of declaration. The company informed shareholders about tax deduction at source (TDS) requirements under the Income Tax Act. For resident shareholders, TDS will be deducted at 10% if valid PAN is provided, or 20% if PAN is invalid or not linked with Aadhaar. No tax will be deducted for resident individuals if total dividend for the year doesn't exceed Rs. 10,000. For non-resident shareholders, tax rates range from 10% to 30% depending on category and applicable tax treaties. Shareholders must submit required documents to the registrar KFin Technologies by August 7, 2025, to determine appropriate tax rates. The company will email TDS certificates to registered email addresses after dividend payment.",
            "Sentiment": "neutral",
            "PublishDate": 1753979852623,
            "Source": "corporate_action"
        },
        {
            "Title": "Mankind Pharma Reports Mixed Q1 Results with Revenue Growth and Profit Decline",
            "Summary": "Mankind Pharma reported quarterly consolidated net profit of 4.38 billion rupees, down from 5.32 billion rupees in the same period last year. However, the company's revenue increased to 35.7 billion rupees compared to 28.67 billion rupees year-over-year. The pharmaceutical company plans to raise short-term funds of up to 10 billion rupees through financial instruments. Additionally, Mankind Pharma received approval to acquire a women's health branded generic business.",
            "Sentiment": "neutral",
            "PublishDate": 1753962352415,
            "Source": "earnings"
        },
        {
            "Title": "Mankind Pharma Expected to Report Revenue Growth but Lower Net Profit in Q1 Results",
            "Summary": "Mankind Pharma is set to announce its April-June quarter financial results. Bloomberg estimates project consolidated revenue to rise to Rs 3,605.53 crore from Rs 2,893.42 crore year-on-year, while net profit is expected to decline to Rs 446.71 crore from Rs 536.49 crore. The revenue growth is attributed to the Bharat Serum Vaccine (BSV) acquisition, with BSV expected to contribute Rs 4.7 billion in revenue. EBITDA is projected to increase to Rs 900.11 crore from Rs 681.76 crore, with margins improving to 25% from 23.6%. IIFL Capital maintains a Buy rating with a target price of Rs 2,750, expecting 10% organic growth excluding BSV acquisition. Axis Capital projects 24% year-on-year consolidated sales growth and EBITDA margins at 24.5%, with India business expected to grow 8% on ex-BSV basis.",
            "Sentiment": "neutral",
            "PublishDate": 1753873679099,
            "Source": "earnings"
        },
        {
            "Title": "Mankind Pharma Establishes Fully Owned Subsidiary in Sri Lanka",
            "Summary": "Mankind Pharma has established a fully owned subsidiary in Sri Lanka. This represents the company's expansion into the Sri Lankan market through a direct subsidiary structure.",
            "Sentiment": "positive",
            "PublishDate": 1753360748330,
            "Source": "stock"
        },
        {
            "Title": "Mankind Pharma Incorporates Wholly Owned Subsidiary in Sri Lanka",
            "Summary": "Mankind Pharma Limited has incorporated a wholly owned subsidiary in Sri Lanka named Mankind Pharma Lanka (Private) Limited on July 23, 2025. The company notified stock exchanges BSE and NSE about the incorporation, with intimation received on July 24, 2025. This follows a previous communication from the company dated May 21, 2025, which had already provided detailed disclosures required under listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1753360625146,
            "Source": "corporate_action"
        },
        {
            "Title": "Mankind Pharma Receives Request to Reclassify Ayushi and Poonam Estates LLP from Promoter Group to Public Category",
            "Summary": "Mankind Pharma Limited received a request from Ayushi and Poonam Estates LLP to reclassify their shareholding from Promoter and Promoter Group category to Public category. The LLP was previously classified as Promoter Group because it was entirely owned by Mrs. Poonam Juneja and Mrs. Ayushi Juneja Sikri, both immediate relatives of Mankind's promoters. However, following a complete transfer of ownership through a deed of admission, the LLP is now owned and controlled by Chalet Hotels Limited and Sonmil Industries Private Limited through their respective nominees - Mr. Shwetank Singh and Ms. Karuna Nasta as designated partners. The LLP confirms it does not hold any shares in Mankind Pharma, does not exercise control over the company's affairs, has no representation on the board, and possesses no special rights. The request will be placed before Mankind Pharma's board of directors for consideration along with other necessary approvals as per SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1753191357928,
            "Source": "corporate_action"
        },
        {
            "Title": "Mankind Pharma: Jefferies Raises Target, Shares Gain",
            "Summary": "Jefferies increased its price target on Mankind Pharma from ₹2,870 to ₹3,000, maintaining a 'buy' rating. The stock gained nearly 6% on July 11. Jefferies expects Mankind's prescription drug growth to normalize in H2 and projects 1.5x IPM growth from FY27.",
            "Sentiment": "positive",
            "PublishDate": 1752217194000,
            "Source": "normal_news"
        },
        {
            "Title": "Mankind Pharma Incorporates Non-Profit Subsidiary 'Kindcare Foundation'",
            "Summary": "Mankind Pharma has established a new wholly owned subsidiary named 'Kindcare Foundation'. This entity is set up as a not-for-profit organization, demonstrating the company's dedication to social responsibility and community welfare.",
            "Sentiment": "positive",
            "PublishDate": 1748874480000,
            "Source": "default"
        },
        {
            "Title": "Mankind Pharma: Q4 Performance Miss, Target Price Cut",
            "Summary": "Mankind Pharma's Q4 FY25 domestic formulation revenues grew 18.4% YoY, driven by BSV consolidation and chronic therapies. Excluding BSV, growth was 10% YoY. Dolat Capital maintains 'Add' rating but reduces target price.",
            "Sentiment": "neutral",
            "PublishDate": 1747890484000,
            "Source": "earnings"
        },
        {
            "Title": "Mankind Pharma: Q4 Profit Drops, Revenue Surges 27% YoY",
            "Summary": "Mankind Pharma reported a 10.7% YoY drop in Q4 FY25 net profit to ₹420.8 crore, while revenue increased 27.1% to ₹3,079.4 crore. EBITDA rose 16.5%, but margins contracted. FY25 revenue grew 19% to ₹12,207 crore. The company cited strong growth in chronic therapies and consumer healthcare, along with successful integration of the acquired BSV business.",
            "Sentiment": "neutral",
            "PublishDate": 1747833440000,
            "Source": "earnings"
        },
        {
            "Title": "Mankind Pharma Reports Q4 Financial Results",
            "Summary": "Mankind Pharma has released its Q4 financial results. The company's EBITDA increased to 6.84 billion rupees from 5.91 billion rupees year-over-year. However, the EBITDA margin decreased to 22.22% from 24.21% year-over-year. The consolidated net profit for Q4 was 4.25 billion rupees, down from 4.7 billion rupees year-over-year but up from 3.7 billion rupees quarter-over-quarter. Q4 revenue rose to 30.8 billion rupees from 24.4 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747832488000,
            "Source": "result"
        },
        {
            "Title": "Mankind Pharma: Q4 Results Preview Highlights Growth Expectations and Margin Concerns",
            "Summary": "Mankind Pharma's Q4 results are expected to show 26.8% YoY revenue growth to Rs 3,095.7 crore, but net profit may fall 22.3%. Analysts focus on domestic business growth and Bharat Serum Vaccine's contribution. Concerns include potential margin pressure and tariff-related risks. Ebitda margin is expected to contract to 25.6% from 28% a year ago.",
            "Sentiment": "neutral",
            "PublishDate": 1747704747000,
            "Source": "earnings"
        },
        {
            "Title": "Mankind Pharma: Rs 342 Crore Additional Tax Demand Received",
            "Summary": "Mankind Pharma Ltd has received additional tax demands of Rs 341.86 crore from the Income Tax authority. The company plans to appeal against the orders, believing them to be untenable in law. Mankind Pharma does not expect any material impact on its financials or operations due to these orders.",
            "Sentiment": "neutral",
            "PublishDate": 1747238194000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mankind Pharma to Consider Q4 Results on May 21",
            "Summary": "Mankind Pharma has announced that it will consider its fourth quarter financial results on May 21. This indicates the company is preparing to release its earnings report for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1746709190000,
            "Source": "default"
        },
        {
            "Title": "Mankind Pharma Announces Strategic Corporate Actions",
            "Summary": "Mankind Pharma has announced three significant corporate actions: 1) Incorporation of a wholly owned subsidiary in Russia, 2) Incorporation of a wholly owned subsidiary for CSR activities, and 3) Formation of a committee to integrate Bharat Serums and Vaccines.",
            "Sentiment": "positive",
            "PublishDate": 1744677238000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mankind Pharma Announces Corporate Restructuring and Expansion Plans",
            "Summary": "Mankind Pharma has announced several strategic moves: 1) The company will incorporate a wholly owned subsidiary in Russia, indicating international expansion. 2) A new wholly owned subsidiary will be established for CSR activities, demonstrating a focus on corporate social responsibility. 3) The board has approved the formation of a committee to integrate Bharat Serums and Vaccines, suggesting potential merger or acquisition activities.",
            "Sentiment": "positive",
            "PublishDate": 1744632644000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mankind Pharma Faces Additional Tax Demand of 1.83 Billion Rupees",
            "Summary": "Mankind Pharma has announced that the tax authority has raised an additional tax demand of 1.83 billion rupees (approximately $22 million USD). This unexpected tax liability could potentially impact the company's financial position and may require attention from shareholders.",
            "Sentiment": "negative",
            "PublishDate": 1743466374000,
            "Source": "corporate_governance"
        },
        {
            "Title": "NCLT Approves Merger of BSV Pharma with Bharat Serums and Vaccines",
            "Summary": "Mankind Pharma has announced that the National Company Law Tribunal (NCLT) has approved the amalgamation of BSV Pharma with Bharat Serums and Vaccines. This merger represents a significant corporate action in the pharmaceutical sector.",
            "Sentiment": "positive",
            "PublishDate": 1743466338000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mankind Pharma: Completes Merger of Three Subsidiaries",
            "Summary": "Mankind Pharma has finalized the amalgamation of three subsidiaries—Shree Jee Laboratory, JPR Labs, and Jaspack Industries—effective March 29, 2025. The merger, approved by NCLT New Delhi, transfers all assets and liabilities to Mankind Pharma. The company's authorized share capital is now adjusted to ₹421.51 crore. Additionally, NCLT Mumbai approved the merger of BSV Pharma with Bharat Serums and Vaccines Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1743235346000,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Approves Merger of BSV Pharma with Bharat Serums and Vaccines",
            "Summary": "Mankind Pharma has announced that the National Company Law Tribunal (NCLT) has approved the amalgamation of BSV Pharma with Bharat Serums and Vaccines. This merger represents a significant corporate action in the pharmaceutical sector.",
            "Sentiment": "positive",
            "PublishDate": 1743172483000,
            "Source": "corporate_action"
        }
    ]
}