{
    "Symbol": "MANORG",
    "ISIN": "INE370D01013",
    "News": [
        {
            "Title": "Mangalam Organics Q3FY26 Results Show Mixed Performance",
            "Summary": "Mangalam Organics reported Q3FY26 standalone revenue of Rs 12,244.57 lakhs with net profit of Rs 110.65 lakhs. Nine-month performance showed strong growth with revenue rising to Rs 36,621.19 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1770895100153,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vijay Kedia sells Mangalam Drugs shares in bulk deal",
            "Summary": "Kedia Securities sold 1.38 lakh shares worth ₹48.35 lakh as multiple investors exited the microcap pharmaceutical stock through bulk deals on Wednesday.",
            "Sentiment": "neutral",
            "PublishDate": 1767802585473,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mangalam Drugs Zooms 10% After Vijay Kedia Investment",
            "Summary": "Mangalam Drugs hit upper circuit at ₹26.28 after Vijay Kedia's ₹33.27 lakh investment through bulk deal. Stock gained 10% in two days despite 77.77% yearly decline.",
            "Sentiment": "positive",
            "PublishDate": 1767023112890,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mangalam Organics Secures Rs 12 Crore Working Capital Loan from Axis Bank",
            "Summary": "Mangalam Organics Limited's board approved a Rs 12 crore ad-hoc working capital demand loan facility from Axis Bank Limited with 90-day tenure and 10.75% interest rate. The loan agreement was executed to meet ongoing working capital requirements and ensure uninterrupted operational liquidity, secured by 10% fixed deposit lien.",
            "Sentiment": "positive",
            "PublishDate": 1764413565782,
            "Source": "corporate_action"
        },
        {
            "Title": "Mangalam Organics Receives GST Investigation Summons from Maharashtra Tax Authorities",
            "Summary": "Mangalam Organics Limited received a summons dated November 21, 2025 from the Assistant Commissioner of State Tax for GST investigation under Section 67 of MGST/CGST Act, 2017, requiring attendance and verification of books of accounts. The company states there is no material financial impact at this stage and is fully cooperating with authorities to provide necessary information.",
            "Sentiment": "neutral",
            "PublishDate": 1763827565173,
            "Source": "stock"
        },
        {
            "Title": "Mangalam Organics Reports 14.30% Revenue Growth in Q2 FY26, Driven by B2B-to-B2C Transformation",
            "Summary": "Mangalam Organics Limited achieved quarterly revenue growth of 14.30% to Rs 158.10 crores in Q2 FY26 compared to Rs 138.32 crores in Q2 FY25, with improved profitability due to decreased input costs. The company is strategically transforming from a B2B pine chemicals manufacturer to include B2C operations through its CamPure brand of camphor-based home care products, expanding distribution across 14 states with 190 sales personnel.",
            "Sentiment": "positive",
            "PublishDate": 1763386654996,
            "Source": "stock"
        },
        {
            "Title": "Mangalam Organics Reports Q2 Results; Fire Incident Causes Rs 24.91 Crore Asset Loss",
            "Summary": "Mangalam Organics approved unaudited financial results for the quarter and half-year ended September 30, 2025, showing standalone revenue of Rs 13,013.90 lakhs and consolidated revenue of Rs 15,810.13 lakhs. A major fire incident at the company's camphor division on July 16, 2025 caused significant damage with fixed asset losses of Rs 24.91 crores and material-in-process losses of Rs 20.17 crores, leading to temporary shutdown of the division.",
            "Sentiment": "neutral",
            "PublishDate": 1763136350680,
            "Source": "earnings"
        },
        {
            "Title": "Mangalam Organics Secures INR 50 Crore Loan Facility with Yes Bank, Cancels NCD Issuance Plan",
            "Summary": "Mangalam Organics Limited has executed a binding loan facility agreement with Yes Bank Limited for INR 50 crore. The facility comprises working capital limits of INR 48 crore (including sublimits for L/C, WCDL & term loan facility) and an unsecured forward cover limit of INR 2 crore. The Board of Directors cancelled the previously approved proposal to issue secured, unlisted, unrated, senior non-convertible debentures worth up to INR 60 crore. The loan facility will be used for working capital and capital expenditure towards reinstatement of the camphor plant and general working capital needs. The agreement was executed on September 17, 2025, with security including hypothecation of plant, machinery, current assets, equitable mortgage of factory land, and personal guarantees. Yes Bank Limited has no shareholding in Mangalam Organics Limited and is not related to the promoters or promoter group. The transaction is not classified as a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1758114428777,
            "Source": "stock"
        },
        {
            "Title": "Mangalam Organics Schedules Board Meeting to Discuss Fundraising Proposal",
            "Summary": "Mangalam Organics will hold a board meeting on September 16 to consider a fundraising proposal. The company has announced this scheduled meeting to deliberate on potential fundraising activities.",
            "Sentiment": "neutral",
            "PublishDate": 1757679216274,
            "Source": "corporate_action"
        },
        {
            "Title": "Mangalam Organics Approves INR 60 Crore Non-Convertible Debenture Issuance",
            "Summary": "Mangalam Organics Limited's Board of Directors approved the issuance of secured, unlisted, unrated, senior non-convertible debentures worth up to INR 60 crores through private placement. The NCDs carry a 12.50% annual interest rate comprising 10% cash coupon and 2.50% redemption premium. The debentures have a 36-month tenure with monthly coupon payments at 10% annually, principal repayment starting after a 15-month moratorium in equal monthly installments, and PUT/CALL options available from month 18 onwards every six months. The debentures are secured by a first pari-passu charge with Saraswat Bank on fixed assets including land, building, plant and machinery, along with personal guarantees from Kamalkumar Dujodwala and Pannkaj Dujodwala.",
            "Sentiment": "neutral",
            "PublishDate": 1755513343538,
            "Source": "corporate_action"
        },
        {
            "Title": "Mangalam Organics Reports Strong Q1 Results with 632% PAT Growth and B2C Expansion",
            "Summary": "Mangalam Organics Limited, a pine chemistry manufacturer with 79 years of experience, reported significant financial improvement for the quarter ended June 30, 2025. Revenue increased 24.2% to Rs. 146.55 crores while PAT surged 632.30% to Rs. 12.23 crores. EBITDA margin expanded 554 basis points to 14.74% and PAT margin improved 693 basis points to 8.35%. The company operates two main segments: B2B operations (96% terpene products, 4% synthetic resins) and growing B2C operations featuring CamPure homecare products and Mangalam camphor tablets. The company is transforming from primarily B2B to include retail operations, expanding distribution across 14 states with 190 salespeople and strengthening e-commerce presence on platforms like Amazon and Flipkart. Manufacturing is based in Kumbhivali with over 100 products in portfolio. The company sources turpentine globally and exports to Europe, USA, Africa, Middle East and Southeast Asia. Strategic initiatives include product portfolio expansion, geographical reach extension, and exploring export opportunities in USA and UK markets.",
            "Sentiment": "positive",
            "PublishDate": 1754722357525,
            "Source": "stock"
        },
        {
            "Title": "Mangalam Organics Reports Strong Q1 Results, Announces Director Reappointments and Faces Fire Incident at Camphor Plant",
            "Summary": "Mangalam Organics Limited approved its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs. 11,362.72 lakhs and profit before tax of Rs. 824.12 lakhs. The Board approved reappointment of key directors including Managing Director Pannkaj Dujodwala and Chairman Kamalkumar Dujodwala for five-year terms. The company scheduled its 43rd Annual General Meeting for September 16, 2025, through video conferencing. New auditor appointments were approved, including Manoj Mhapadi as Internal Auditor and Naresh Jethwani as Cost Auditor for Financial Year 2025-26. However, the company disclosed a major fire incident at its Camphor Plant on July 16, 2025. A surveyor has been appointed to assess the loss, and the estimated financial impact is currently being evaluated. The company stated that fixed assets, plant machinery, and stocks are fully covered under insurance policy, and it also has a loss of profit policy.",
            "Sentiment": "neutral",
            "PublishDate": 1754653525378,
            "Source": "earnings"
        },
        {
            "Title": "Mangalam Organics Approves Q1 FY26 Results, Schedules 43rd AGM for September 16",
            "Summary": "Mangalam Organics Limited's Board approved unaudited standalone and consolidated financial statements for the quarter ended June 30, 2025. The company scheduled its 43rd Annual General Meeting for September 16, 2025, via video conferencing. The Board approved re-appointments of key directors for five-year terms: Pannkaj Dujodwala as Managing Director, Kamalkumar Dujodwala as Chairman and Executive Director, and Manisha Agarwal as Non-Executive Independent Woman Director. New auditor appointments were made including Manoj Mhapadi as Internal Auditor, Naresh Jethwani as Cost Auditor, and Yogesh Sharma & Co. as Secretarial Auditor. The company set September 9, 2025, as the cut-off date for voting eligibility and announced book closure from September 9-16, 2025. The Board also approved the draft Board's Report for FY2025 and updated the insider trading prevention policy.",
            "Sentiment": "neutral",
            "PublishDate": 1754652022819,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mangalam Organics' Credit Ratings Placed on 'Watch Developing' by CRISIL",
            "Summary": "CRISIL Ratings Limited has revised the credit ratings for Mangalam Organics Limited's bank facilities totaling Rs. 397 crore. The long-term bank facilities of Rs. 192 crore have been rated CRISIL BBB+ / Watch Developing, while short-term facilities of Rs. 205 crore received CRISIL A2 / Watch Developing ratings. The facilities are spread across multiple banks including HDFC Bank Limited, Axis Bank Limited, and The Saraswat Co-Operative Bank Limited, covering cash credit lines, letters of credit, and term loans. The 'Watch Developing' status indicates the ratings are under review for potential changes.",
            "Sentiment": "neutral",
            "PublishDate": 1753273183025,
            "Source": "stock"
        }
    ]
}