{
    "Symbol": "MANOMAY",
    "ISIN": "INE784W01015",
    "News": [
        {
            "Title": "Manomay Tex Q3FY26 Revenue Drops 4.98% to ₹17,663.84 Lakhs",
            "Summary": "Manomay Tex India reported Q3FY26 revenue of ₹17,663.84 lakhs, down from ₹18,588.84 lakhs in Q3FY25. Net profit declined to ₹462.55 lakhs from ₹602.50 lakhs year-on-year, with EPS at ₹2.56.",
            "Sentiment": "negative",
            "PublishDate": 1770190127311,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manomay Tex India Secures Rs. 60 Crore Export Orders for Spinning Yarn and Denim Fabric",
            "Summary": "Manomay Tex India Limited announced receiving new export orders worth approximately Rs. 60 crores from international clients in Latin America countries for manufacturing spinning yarn and denim cotton fabric. The orders represent a significant business development for the textile company, expanding its international presence in the Latin American market.",
            "Sentiment": "positive",
            "PublishDate": 1765352673556,
            "Source": "order&deals"
        },
        {
            "Title": "Manomay Tex India Posts Strong Q2 FY26 Profit Growth",
            "Summary": "Manomay Tex India Limited reported solid financial performance for Q2 FY26, achieving revenue of ₹166.15 crore and a net profit of ₹5.57 crore. Profitability improved by 25.2% compared to Q1 FY26. For the half year ending September 2025, the company recorded ₹330.09 crore in revenue and ₹10.02 crore in net profit.",
            "Sentiment": "negative",
            "PublishDate": 1763119636086,
            "Source": "earnings"
        },
        {
            "Title": "Manomay Tex India Reports Mixed Q1 Results with Revenue Growth but Declining Profitability",
            "Summary": "Manomay Tex India Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The textile company reported revenue growth of 5.5% year-over-year to ₹163.94 crores, but faced margin pressure with EBITDA declining 9.4% to ₹20.55 crores and profit after tax falling 12.9% to ₹4.45 crores. EBITDA margin compressed to 12.5% from 14.6% in the previous year, while net profit margin dropped to 2.7% from 3.3%. The Board approved re-appointments of key management personnel including Chairman Kailashchandra Hiralal Laddha, Managing Director Yogesh Laddha, and Whole-time Directors Kamlesh Kailashchandra Laddha and Pallavi Laddha for three years from January 16, 2026 to January 15, 2029. The company scheduled its 16th Annual General Meeting for September 17, 2025, with share transfer books closing from September 11-17, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1755069287386,
            "Source": "earnings"
        }
    ]
}