{
    "Symbol": "MANORAMA",
    "ISIN": "INE00VM01036",
    "News": [
        {
            "Title": "Manorama Industries Incorporates Subsidiary in Burkina Faso",
            "Summary": "Manorama Industries Limited has incorporated a wholly owned subsidiary TAANG KAAM INDUSTRIES SA in Burkina Faso with initial capital of CFA 10,000,000 for shea nuts and mango kernels processing business.",
            "Sentiment": "positive",
            "PublishDate": 1770798288532,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manorama Industries Schedules Investor Meet at MANTHAN",
            "Summary": "Manorama Industries Limited announces investor/analyst interaction at MANTHAN - Systematix India Annual Conference on February 09, 2026 in Mumbai under SEBI Regulation 30 compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1770231065024,
            "Source": "stocks"
        },
        {
            "Title": "Manorama Industries Q3 Net Profit Surges 131% YoY",
            "Summary": "Manorama Industries reports strong Q3 performance with net profit rising to 682 million rupees from 295 million rupees in the same quarter last year, marking significant growth momentum.",
            "Sentiment": "positive",
            "PublishDate": 1769597414182,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manorama Industries Q3 FY26 Earnings Call on Jan 28",
            "Summary": "Manorama Industries Limited announces Q3 & 9M FY26 earnings conference call scheduled for January 28, 2026 at 5:00 PM IST following quarterly results announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1769081445710,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manorama Industries Reports 86.4% Revenue Growth, Revises Annual Guidance Upward to INR 1,150 Crores",
            "Summary": "Manorama Industries disclosed strong quarterly results with consolidated revenue of INR 612.9 crores for H1 FY26, representing 86.4% year-on-year growth. EBITDA stood at INR 156.6 crores with a 27.2% margin, while profit after tax reached INR 105.5 crores (17.2% margin). For Q2 FY26, revenue was INR 323.3 crores with EBITDA of INR 87.7 crores (27.1% margin) and PAT of INR 54.9 crores (17% margin). The company revised its annual guidance upward from INR 1,050 crores to INR 1,150 crores plus. Value-added products contributed 70%-75% to sales, with plant utilization at 80%-85% of 40,000 tons capacity. Export sales accounted for 58% of revenue while domestic sales were 42%. The company plans capacity expansion from 40,000 to 52,000 metric tons annually through plant upgradation in Q3. Management announced INR 450 crores in capital expenditure for expansion projects, including backward integration facilities in West Africa and forward integration in Latin America. Top customers include Mondelez, Nestle, and Hershey's, with top 10 customers contributing around 40% of revenue. Working capital days improved from 151 to 97 days, with a target of 75 days over the next two years.",
            "Sentiment": "positive",
            "PublishDate": 1761138335808,
            "Source": "earnings"
        },
        {
            "Title": "Manorama Industries Reports Strong Q2 Performance with Net Profit Doubling Year-on-Year",
            "Summary": "Manorama Industries delivered robust quarterly results with net profit reaching 548.8 million rupees compared to 267 million rupees in the same period last year. Revenue grew significantly to 3.23 billion rupees from 1.95 billion rupees year-on-year. EBITDA increased to 877 million rupees versus 452 million rupees in the prior year period. The company's EBITDA margin improved to 27.12% from 23.13% year-on-year, indicating enhanced operational efficiency alongside revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1760919239219,
            "Source": "earnings"
        },
        {
            "Title": "Manorama Industries Raises FY26 Revenue Guidance to ₹1,150 Cr+",
            "Summary": "Manorama Industries has increased its FY26 revenue guidance to over ₹1,150 crores. The company attributes this upward revision to growing demand for specialty fats, global expansion initiatives, and capacity upgrades. These factors are expected to drive improvements in margins and return on capital employed (ROCE).",
            "Sentiment": "positive",
            "PublishDate": 1760715755257,
            "Source": "stock"
        },
        {
            "Title": "Manorama Industries Uploads Q2 & H1 FY26 Earnings Conference Call Recording",
            "Summary": "Manorama Industries Limited has made available the audio recording of its earnings conference call for Q2 & H1 FY26 on its website. The conference call was held on October 17, 2025, following the release of unaudited financial results for the quarter and half year ended September 30, 2025. The recording can be accessed through the company's website at manoramagroup.co.in under the Investors section.",
            "Sentiment": "neutral",
            "PublishDate": 1760714821389,
            "Source": "earnings"
        },
        {
            "Title": "Manorama Industries Reports Strong Q2 FY26 Results with 65% Revenue Growth",
            "Summary": "Manorama Industries Limited announced its quarterly results for the quarter and half year ended September 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 32,330.93 lacs for the quarter, representing a 65% increase from Rs. 19,541.66 lacs in the same quarter last year. Net profit after tax reached Rs. 5,488.25 lacs compared to Rs. 2,671.29 lacs in the previous year quarter. For the half year period, revenue grew to Rs. 61,286.01 lacs from Rs. 32,883.14 lacs, while net profit increased to Rs. 10,545.87 lacs from Rs. 4,025.27 lacs. Basic earnings per share for the quarter stood at Rs. 9.18 versus Rs. 4.48 in the prior year. The company operates in manufacturing of exotic seed based fats and butters including Cocoa Butter Equivalent. The results were approved by the Board of Directors and reviewed by statutory auditors Singhi & Co.",
            "Sentiment": "positive",
            "PublishDate": 1760698397649,
            "Source": "earnings"
        },
        {
            "Title": "Manorama Industries Signs MOU with Burkina Faso Government and Partners with DEKEL for Brazil Manufacturing",
            "Summary": "Manorama Industries Limited has signed a Memorandum of Understanding with the National Office for Major Projects of Burkina Faso to establish a new factory for processing Shea Nuts and Mango Kernels through its proposed wholly owned subsidiary, Manorama Burkina Industries SA. The company has also entered into a strategic partnership with DEKEL Agroindústria through its subsidiary Manorama Latin America LTDA to produce Cocoa Butter Equivalent (CBE) and specialty fats in Brazil, with production tentatively set to begin in November 2025. This collaboration makes Manorama the first global CBE producer to manufacture in Brazil. The partnership will utilize DEKEL's facility in Itápolis, São Paulo, with Manorama supplying specialty raw materials for CBE production. Chairman and Managing Director Ashish Saraf stated that the Burkina Faso initiative supports backward integration plans and will improve operational efficiencies in Africa, while the Brazil partnership aims to supply CBE and specialty fats to the broader Latin American chocolate market.",
            "Sentiment": "positive",
            "PublishDate": 1756368148810,
            "Source": "order&deals"
        },
        {
            "Title": "Manorama Industries Signs MOU with Burkina Faso Government to Establish Shea Nuts and Mango Kernels Processing Factory",
            "Summary": "Manorama Industries Limited has signed a Memorandum of Understanding with the National Office for Major Projects of Burkina Faso to establish a new factory for processing Shea Nuts and Mango Kernels. The business will be conducted through a wholly owned subsidiary with the proposed name Manorama Burkina Industries SA. The subsidiary will have an authorized and paid-up capital of CFA 1,60,00,00,000, with 100% subscription to be made in cash by Manorama Industries. The partnership leverages Manorama's two-decade expertise in manufacturing specialty fats and butters for Fortune 500 companies in chocolate, confectionery and cosmetic industries. The primary objective of the subsidiary will be buying, processing and selling of shea nuts/butter, mango kernels/butter and other raw materials. The investment will be made in one or more tranches as per business requirements.",
            "Sentiment": "positive",
            "PublishDate": 1756366606305,
            "Source": "order&deals"
        },
        {
            "Title": "Ashish Ramesh Saraf Acquires 4% Stake in Manorama Industries Through Gift Transfer",
            "Summary": "Ashish Ramesh Saraf, an immediate relative of the promoter group, acquired 23,84,562 equity shares (4% stake) in Manorama Industries Limited through an off-market gift transfer on August 5, 2025. The shares were gifted by Shrey Ashish Saraf and Agastya Saraf, with each transferring 11,92,281 shares. Following this transaction, Saraf's total holding increased from 42.25% to 46.25% of the company's voting rights. The transaction was conducted as an inter-family transfer within immediate relatives of the promoter group. Manorama Industries has a total equity share capital of 5,96,14,050 shares of Rs. 2 each, and the company's shares are listed on both BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1754647824801,
            "Source": "corporate_action"
        },
        {
            "Title": "Manorama Industries Sets August 21, 2025 as Record Date for Final Dividend",
            "Summary": "Manorama Industries Limited has announced Thursday, August 21, 2025 as the record date for determining shareholder eligibility for the final dividend. The dividend declaration is subject to approval at the company's 20th Annual General Meeting. The company has informed BSE and NSE about this record date announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1754468047461,
            "Source": "corporate_action"
        },
        {
            "Title": "Manorama Industries Submits Revised Quarterly Financial Results After Correcting Typographical Error",
            "Summary": "Manorama Industries Limited submitted revised unaudited financial results for the quarter ended June 30, 2025, correcting a typographical error in the original limited review report that incorrectly mentioned the year as 2024. The company reported standalone revenue from operations of Rs 28,955.08 lacs for the quarter, up from Rs 13,341.48 lacs in the same period last year. Net profit increased to Rs 5,057.62 lacs compared to Rs 1,353.98 lacs in the previous year quarter. On a consolidated basis, the company reported net profit of Rs 4,694.49 lacs. The results include eight subsidiary companies across Nigeria, UAE, Togo, Ivory Coast, Benin, Burkina Faso, Ghana, and Brazil. Basic earnings per share stood at Rs 8.48 for standalone results and Rs 7.87 for consolidated results. The company operates in manufacturing of exotic seed-based fats and butters including Cocoa Butter Equivalent.",
            "Sentiment": "positive",
            "PublishDate": 1754145085945,
            "Source": "earnings"
        },
        {
            "Title": "Manorama Industries Reports Strong Q1 Growth with Net Profit Surging to 506 Million Rupees",
            "Summary": "Manorama Industries delivered robust quarterly performance with net profit jumping to 506 million rupees compared to 135 million rupees in the same period last year. Revenue nearly doubled to 2.9 billion rupees from 1.3 billion rupees year-over-year. EBITDA increased significantly to 790 million rupees versus 268 million rupees previously, while EBITDA margin improved to 27.27% from 20.06% in the comparable period.",
            "Sentiment": "positive",
            "PublishDate": 1753662671920,
            "Source": "earnings"
        },
        {
            "Title": "Manorama Industries Targets ₹1,000 Crore Revenue by FY30 Through FMCG Expansion",
            "Summary": "Manorama Industries has set a revenue target of ₹1,000 crore by FY30. The company plans to achieve this through transitioning to FMCG operations, developing high-profit pharmaceutical butters, and expanding value-added cosmeceuticals. The company's Phase 2 expansion is expected to double its capacity by FY26.",
            "Sentiment": "positive",
            "PublishDate": 1753458391378,
            "Source": "stock"
        },
        {
            "Title": "Manorama Industries Reports 117% Revenue Growth to INR 289.6 Crores in Q1 FY26",
            "Summary": "Manorama Industries Limited submitted an investor presentation for Q1 FY26 results ended June 30, 2025. The company achieved revenue of INR 289.6 crores, marking 117% year-on-year growth from INR 133.4 crores in Q1 FY25. EBITDA surged 195% to INR 79 crores with margin expansion of 721 basis points to 27.3%. PAT increased 273.5% to INR 50.6 crores, with PAT margin improving 732 basis points to 17.5%. Diluted EPS rose 272.7% to INR 8.46. The company attributed strong performance to rising global demand for specialty butters and fats, enhanced fractionation capacity, and improved operational efficiency. Management highlighted recent capacity enhancement and plans for 30% expansion of Solvent Fractionation Capacity in H2 FY26. The company acquired 20 acres adjacent to Birkoni facility for future expansion, to be funded through internal accruals.",
            "Sentiment": "positive",
            "PublishDate": 1753454782003,
            "Source": "earnings"
        },
        {
            "Title": "Manorama Industries Reports Strong Q1 Growth with Revenue Doubling Year-on-Year",
            "Summary": "Manorama Industries delivered robust quarterly performance with revenue rising to 2.9 billion rupees from 1.3 billion rupees in the same period last year. The company's EBITDA increased significantly to 790 million rupees compared to 268 million rupees year-on-year, while EBITDA margin improved to 27.27% from 20.06%. Net profit surged to 506 million rupees from 135 million rupees in the corresponding quarter of the previous year, reflecting strong operational performance across key financial metrics.",
            "Sentiment": "positive",
            "PublishDate": 1753446855851,
            "Source": "earnings"
        },
        {
            "Title": "Manorama Industries Reports Strong Q1 Results, Re-appoints Whole-time Director and Sets AGM Date",
            "Summary": "Manorama Industries Limited's Board approved quarterly financial results for the quarter ended June 30, 2025, showing standalone revenue from operations of Rs. 28,955.08 lacs compared to Rs. 13,341.48 lacs in the same quarter last year. Net profit increased to Rs. 5,057.62 lacs from Rs. 1,353.98 lacs year-over-year. The Board re-appointed Ashok Jain as Whole-time Director for three years from November 15, 2025 to November 14, 2028. M/s. B. R. Agrawal & Associates were appointed as Secretarial Auditors for five years from Financial Year 2025-26 to 2029-30. The company scheduled its 20th Annual General Meeting for August 28, 2025 via video conferencing, with book closure dates from August 22-28, 2025 for dividend purposes.",
            "Sentiment": "positive",
            "PublishDate": 1753446828011,
            "Source": "corporate_action"
        },
        {
            "Title": "Manorama Industries: Q4 Profits Soar 238%, FY26 Revenue Forecast at Rs 1,050+ Crore",
            "Summary": "Manorama Industries reported an 80% YoY increase in Q4 FY25 revenue to Rs 232.80 crore. Q4 PAT surged 238% YoY to Rs 42.30 crore with an 18.2% margin. The company expects FY26 revenue to exceed Rs 1,050 crore. Share price rose 10.67% following the results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1745818771000,
            "Source": "earnings"
        },
        {
            "Title": "Manorama Industries to Consider Q4 Results on April 26",
            "Summary": "Manorama Industries has announced that it will consider its fourth quarter (Q4) financial results on April 26. This is a routine corporate event where the company will review and potentially approve its financial performance for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1744898718000,
            "Source": "default"
        },
        {
            "Title": "Manorama Industries Incorporates Wholly Owned Subsidiary in Brazil",
            "Summary": "Manorama Industries has announced the incorporation of a new wholly owned subsidiary in Brazil. This strategic move likely aims to expand the company's operations and presence in the South American market.",
            "Sentiment": "positive",
            "PublishDate": 1743034506000,
            "Source": "corporate_action"
        },
        {
            "Title": "Manorama Industries Incorporates Wholly Owned Subsidiary in Brazil",
            "Summary": "Manorama Industries has established a new wholly owned subsidiary in Brazil. This strategic move suggests the company is expanding its operations internationally, potentially to access new markets or resources in South America.",
            "Sentiment": "positive",
            "PublishDate": 1742988785000,
            "Source": "corporate_action"
        },
        {
            "Title": "Manorama Industries Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Manorama Industries has announced its financial results for the third quarter. The company's net profit increased substantially to 295 million rupees, compared to 74 million rupees in the same period last year. Revenue also saw significant growth, reaching 2.09 billion rupees, up from 984 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737505367000,
            "Source": "earnings"
        },
        {
            "Title": "Manorama Industries Reports Significant EBITDA Growth in Q3",
            "Summary": "Manorama Industries has reported a substantial increase in its Q3 EBITDA, rising to 552 million rupees from 156 million rupees year-over-year. The company's EBITDA margin also improved significantly, reaching 26.37% compared to 15.86% in the same period last year. This performance indicates a strong improvement in the company's operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1737456651000,
            "Source": "earnings"
        },
        {
            "Title": "Manorama Industries Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Manorama Industries has announced its financial results for the third quarter. The company's net profit increased substantially to 295 million rupees, compared to 74 million rupees in the same period last year. Revenue also saw a significant rise, reaching 2.09 billion rupees, up from 984 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737456647000,
            "Source": "earnings"
        },
        {
            "Title": "Manorama Industries: Promoters Sell Rs 200 Crore Stake, Mutual Funds Buy In",
            "Summary": "Manorama Industries promoters and a shareholder sold stake worth Rs 200 crore through open market transactions. LIC Mutual Fund, Bank of India Mutual Fund, and Aditya Birla Sun Life Mutual Fund acquired shares at Rs 1,100 per share. The stock closed 2.55% lower at Rs 1,090.",
            "Sentiment": "neutral",
            "PublishDate": 1735054627000,
            "Source": "block_deals"
        },
        {
            "Title": "Manorama Industries on Track to Exceed FY2025 Revenue Target",
            "Summary": "Manorama Industries is poised to surpass its revenue guidance of INR 750+ crores for the fiscal year 2025. The company attributes this positive outlook to strengthening its raw material sourcing capabilities, expanding its customer base across different geographical regions, and improving profitability through operating leverage.",
            "Sentiment": "positive",
            "PublishDate": 1729695607000,
            "Source": "corporate_action"
        },
        {
            "Title": "Manorama Industries Expands Global Presence with New Subsidiaries",
            "Summary": "Manorama Industries is strengthening its global operations through new African subsidiaries to enhance shea seed sourcing. The company's UAE subsidiary, Manorama MENA Trading LLC, aims to attract new customers in the Middle East and North Africa region. Additionally, Manorama plans to enter the South American market in the coming quarters, as revealed in their investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1729695512000,
            "Source": "corporate_action"
        },
        {
            "Title": "Manorama Industries Reports Strong Q2 Financial Performance",
            "Summary": "Manorama Industries has announced its Q2 financial results, showing significant improvement in key metrics. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 452 million rupees, up from 185 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 23.13% from 15.71% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729687645000,
            "Source": "result"
        },
        {
            "Title": "Manorama Industries Reports Significant Profit and Revenue Growth in Q2",
            "Summary": "Manorama Industries has announced its Q2 financial results, showing substantial year-over-year and quarter-over-quarter growth. The company's net profit increased to 267 million rupees, up from 86 million rupees in the same quarter last year and 135 million rupees in the previous quarter. Revenue also saw a significant rise, reaching 1.95 billion rupees compared to 1.18 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1729687562000,
            "Source": "result"
        },
        {
            "Title": "Manorama Industries Establishes Subsidiary in Burkina Faso",
            "Summary": "Manorama Industries has incorporated a wholly owned subsidiary named 'Manorama Burkina SARL' in Burkina Faso. The new subsidiary has been established with an authorized and paid-up capital of 20 lakh CFA francs.",
            "Sentiment": "positive",
            "PublishDate": 1729342416000,
            "Source": "corporate_action"
        }
    ]
}