{
    "Symbol": "MANUGRAPH",
    "ISIN": "INE867A01022",
    "News": [
        {
            "Title": "ManuGraph India Reports Strong Q3 FY26 Performance",
            "Summary": "ManuGraph India Limited posted a profit of ₹43.57 lakhs in Q3 FY26 compared to a loss of ₹455.35 lakhs in Q3 FY25, with revenue surging 176.09% to ₹1,768.52 lakhs. Nine-month revenue reached ₹6,355.07 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770742327001,
            "Source": "co_actions_results"
        },
        {
            "Title": "ManuGraph Board Meet Set for Feb 10 to Review Q3FY26",
            "Summary": "ManuGraph India Limited has scheduled a board meeting on February 10, 2026, to consider unaudited financial statements for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769689806329,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manugraph India Reports Loss of Rs 71.07 Lakhs in Q2 FY2026",
            "Summary": "Manugraph India Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported a net loss of Rs 71.07 lakhs for the quarter, compared to a loss of Rs 182.88 lakhs in the same quarter last year. For the half-year period, the company achieved a profit of Rs 575.05 lakhs versus a loss of Rs 2,098.74 lakhs in the previous year. Total income for the quarter was Rs 1,846.36 lakhs. The company recorded exceptional items including compensation to retired employees of Rs 35.39 lakhs and profit from disposal of non-current assets held for sale of Rs 218.75 lakhs during the half-year. Manugraph has classified two acres of factory land worth Rs 644.09 lakhs as non-current assets held for sale. The company operates in the engineering segment and has no subsidiaries.",
            "Sentiment": "neutral",
            "PublishDate": 1762789623160,
            "Source": "earnings"
        },
        {
            "Title": "Manugraph India Reports Quarterly Loss, Approves Land Sale Plan",
            "Summary": "Manugraph India Limited approved its unaudited financial results for the quarter ended June 30, 2025, reporting a net loss of ₹276.86 lakhs compared to a loss of ₹2,669.37 lakhs in the previous year. Revenue from operations decreased to ₹3,466.45 lakhs from ₹6,007.51 lakhs year-over-year. The company recognized ₹29.46 lakhs in employee compensation costs under consent terms with the Manugraph Employees Union for worker retirement, adding to a total liability of ₹1,179.31 lakhs to be paid before December 2025. The company gained ₹218.75 lakhs from disposing all moveable assets held for sale at its Kolhapur Unit II. The Board approved the potential sale of up to 7 acres of idle land within its factory premises in Kolhapur, subject to shareholder approval. Earnings per share improved to a loss of ₹0.91 from a loss of ₹8.78 in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754653494349,
            "Source": "earnings"
        }
    ]
}