{
    "Symbol": "MANYAVAR",
    "ISIN": "INE825V01034",
    "News": [
        {
            "Title": "Vedant Fashions Q3 FY26 Results & Investor Update",
            "Summary": "Vedant Fashions reports Q3 FY26 revenue of ₹4,917 mn vs ₹5,113 mn YoY. Company expands retail footprint to 1.79 mn sq ft across 664 EBOs globally with strong brand portfolio performance.",
            "Sentiment": "neutral",
            "PublishDate": 1770904529237,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vedant Fashions Board Meet Set for Feb 12, 2026",
            "Summary": "Vedant Fashions Limited has scheduled a board meeting on February 12, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770292480350,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vedant Fashions pays ₹50,000 compounding fee to resolve packaging compliance issue",
            "Summary": "Vedant Fashions Limited settled a Legal Metrology Department notice by paying ₹50,000 compounding fee for packaging labeling violations under Rule 9 of Legal Metrology Packaged Commodity Rules, 2011.",
            "Sentiment": "neutral",
            "PublishDate": 1768229158774,
            "Source": "stocks"
        },
        {
            "Title": "Vedant Fashions Receives GST Recovery Order for ₹1.73 Lakh Input Tax Credit Violation",
            "Summary": "Vedant Fashions Limited received a GST recovery order from Mumbai West CGST authorities for inappropriate Input Tax Credit of ₹1.73 lakh during FY2017-18 to FY2019-20, along with interest and penalties totaling ₹1 lakh. The company states no other financial impact and will review the order to take appropriate action within the specified timeline.",
            "Sentiment": "negative",
            "PublishDate": 1764600181448,
            "Source": "stock"
        },
        {
            "Title": "Vedant Fashions Allots 4,318 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Vedant Fashions Limited allotted 4,318 equity shares of ₹1 face value each to eligible employees who exercised stock options under the VFL Employee Stock Option Scheme 2018-Scheme Pratham. The allotment increased the company's paid-up share capital to ₹24,29,73,103 from ₹24,29,68,785, with the new shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763140872160,
            "Source": "corporate_action"
        },
        {
            "Title": "Vedant Fashions Appoints Aman Kumar Gupta as Chief Retail Officer",
            "Summary": "Vedant Fashions Limited has appointed Mr. Aman Kumar Gupta as Chief Retail Officer and designated him as Senior Managerial Personnel, effective November 13, 2025. The appointment was approved by the Board of Directors at their meeting held on November 12, 2025, based on recommendations from the Nomination and Remuneration Committee. In his role, Gupta will oversee retail operations and manage international business along with other strategic activities. The appointment is on a full-time employment basis.",
            "Sentiment": "positive",
            "PublishDate": 1762988014158,
            "Source": "corporate_governance"
        },
        {
            "Title": "Vedant Fashions Reports 4.6% Growth in Q2 FY26 Despite GST Transition Disruptions",
            "Summary": "Vedant Fashions achieved 4.6% growth in customer sales to INR 3,494 million for Q2 FY26, with reported revenue from operations at approximately INR 263 crores and profit after tax at around INR 56 crores. The quarter saw significant operational disruption following GST rate rationalization effective September 22, 2025, requiring comprehensive system realignments and barcode updates across over 1 million pieces, impacting dispatches for 15-20 days. For H1 FY26, the company reported revenue growth of 7.2% to around INR 544 crores, with customer sales growing 13.8% to INR 7,551 million and same-store growth of 8.2%. The company maintained industry-leading gross margins of around 66.1% and healthy EBITDA margins of around 43% during H1. Store footprint stands at 1.79 million square feet across 671 stores in 257 cities globally, with modest net addition of 3,500 square feet during the quarter. Management noted improved performance in AP and Telangana markets with north of 20% growth, while continuing strategic focus on enhancing customer experience and disciplined store expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1762445544201,
            "Source": "earnings"
        },
        {
            "Title": "Vedant Fashions Reports 7.2% Revenue Growth in H1 FY26, Retail Sales Up 13.8%",
            "Summary": "Vedant Fashions Limited reported revenue from operations growth of 7.2% in H1 FY26 compared to H1 FY25. The company's retail sales (sales to customers) grew by 13.8% in H1 FY26 and 4.6% in Q2 FY26. Same-store sales growth (SSSG) was 8.2% in H1 FY26, though Q2 FY26 recorded negative SSSG of 2.0%. The company maintained industry-leading gross margins of 65.2% in Q2 FY26 and 66.1% in H1 FY26. Vedant Fashions operates through multiple brands including Manyavar, Mohey, Twamev, and others, with a retail footprint of 1.79 million sq. ft. across 671 EBOs in 257 cities globally. The company launched new wedding campaigns and collections across its brand portfolio during the period.",
            "Sentiment": "positive",
            "PublishDate": 1761857233803,
            "Source": "corporate_action"
        },
        {
            "Title": "Vedant Fashions Targets 12-15% Revenue Growth Through FY27 With Store Expansion and E-Commerce Focus",
            "Summary": "Vedant Fashions has outlined its growth strategy targeting 12-15% revenue CAGR through FY27. The company plans to expand across tier-II and tier-III cities by adding 150+ new stores annually. The strategy includes scaling e-commerce operations to 15% of total sales and enhancing margins through premiumization and franchise efficiency improvements.",
            "Sentiment": "positive",
            "PublishDate": 1761835310901,
            "Source": "stock"
        },
        {
            "Title": "Vedant Fashion Reports Decline in Q2 Financial Performance",
            "Summary": "Vedant Fashion reported quarterly revenue of 2.6 billion rupees, down from 2.7 billion rupees in the same period last year. The company's EBITDA decreased to 1.1 billion rupees from 1.2 billion rupees year-over-year, with EBITDA margin falling to 42.10% from 45.54%. Consolidated net profit dropped to 560 million rupees compared to 669 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1761813816416,
            "Source": "earnings"
        },
        {
            "Title": "Vedant Fashions Allots 11,681 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Vedant Fashions Limited's Nomination & Remuneration Committee approved the allotment of 11,681 equity shares of face value Re. 1/- each to eligible employees who exercised stock options under the VFL Employee Stock Option Scheme 2018 - Scheme Pratham. The allotment increased the company's paid-up share capital to Rs. 24,29,68,785 divided into 24,29,68,785 equity shares from the previous Rs. 24,29,57,104 divided into 24,29,57,104 equity shares. All newly allotted shares rank pari-passu with existing equity shares in all aspects.",
            "Sentiment": "neutral",
            "PublishDate": 1761568470142,
            "Source": "corporate_action"
        },
        {
            "Title": "Vedant Fashions Pays ₹50,000 Compounding Fee for Product Labeling Violations",
            "Summary": "Vedant Fashions Limited paid a compounding fee of ₹50,000 to the Department of Legal Metrology in Uttar Pradesh for violations related to product labeling on a pocket square. The violations included insufficient space for quantity declaration and non-disclosure of size on the product label, which were identified during an inspection at one of the retail outlets. The company received a seizure receipt and show cause notice, then requested compounding of the offense with minimum applicable fee. The authority directed the company to deposit ₹50,000 as compounding fee, which was paid on September 25, 2025. The company stated there is no other impact on its financial or operational activities beyond the fee amount.",
            "Sentiment": "neutral",
            "PublishDate": 1758911508284,
            "Source": "stock"
        },
        {
            "Title": "Vedant Fashions Pays ₹50,000 Compounding Fee for Legal Metrology Act Violation",
            "Summary": "Vedant Fashions Limited received a Show Cause Notice dated September 01, 2025, from the Department of Legal Metrology in Agra, Uttar Pradesh for violating Section 18(1) of the Legal Metrology Act, 2009. The violation involved packaging non-compliance at one of their retail outlets, where a Kurta product's Net Quantity declaration lacked prescribed blank space and missing date of manufacturing/packing information. The company requested compounding of the offence on September 15, 2025, and the Authority directed payment of ₹50,000 as compounding fee. Vedant Fashions deposited the amount on September 22, 2025, and informed the Authority on September 23, 2025. The company stated there is no other financial or operational impact beyond the compounding fee amount.",
            "Sentiment": "neutral",
            "PublishDate": 1758654903888,
            "Source": "stock"
        },
        {
            "Title": "Vedant Fashions Pays ₹50,000 Compounding Fee for Legal Metrology Act Violation",
            "Summary": "Vedant Fashions Limited paid a compounding fee of ₹50,000 to the Department of Legal Metrology, Azamgarh, Uttar Pradesh for violating Section 18(1) of the Legal Metrology Act, 2009. The violation involved non-disclosure of product specifications on a tag for a Pocket Square at one of its retail outlets, where the size was mentioned in non-standard units. The company received a Show Cause Notice on May 15, 2025, submitted a compounding request on July 25, 2025, and paid the fee on August 25, 2025. The company stated there is no other financial or operational impact beyond the compounding fee amount.",
            "Sentiment": "negative",
            "PublishDate": 1756216598216,
            "Source": "stock"
        },
        {
            "Title": "Vedant Fashions Reports 17% Revenue Growth in Q1FY26 Driven by Wedding Season Rebound",
            "Summary": "Vedant Fashions reported revenue of Rs 281 crores for Q1FY26, marking 17.2% growth over the previous year. The company achieved strong same-store sales growth of 17.6% and customer sales growth of 23%, benefiting from a rebound in wedding calendar compared to the same quarter last year. The company maintained gross margins at 66.9% and EBITDA margins at 43.2%, while profit after tax stood at Rs 70 crores with 12.4% growth. Marketing expenses increased to 5.6% of revenue from 2.3% in Q1FY25, as the company had strategically reduced spending last year due to negligible wedding dates. The company's retail network stands at 1.78 million square feet globally. Andhra Pradesh and Telangana regions showed sharp recovery, leading the growth momentum. Management noted that consumer sentiment remains weak across the mid-premium industry, though they continue focusing on enhancing customer experience, retail training, and omni-channel integration.",
            "Sentiment": "positive",
            "PublishDate": 1754548592772,
            "Source": "earnings"
        },
        {
            "Title": "Vedant Fashions Reports 17.2% Revenue Growth in Q1 FY26 with Strong Retail Performance",
            "Summary": "Vedant Fashions Limited, the company behind Manyavar and other Indian wedding wear brands, reported revenue growth of 17.2% in Q1 FY26 compared to the same quarter last year. The company's retail sales grew by 23.2% and same-store sales growth reached 17.6%. Revenue from operations increased to INR 2,812 million from INR 2,398 million in Q1 FY25. The company maintained its gross margin at 66.9% and reported profit after tax growth of 12.4%, with PAT increasing to INR 703 million from INR 625 million. EBITDA grew by 5.9% to INR 1,214 million with an EBITDA margin of 43.2%. The company operates 684 exclusive brand outlets across 256 cities globally, including 14 international stores, with a total retail footprint of 1.78 million square feet. Vedant Fashions is positioned as the largest company in India's men's Indian wedding and celebration wear market by revenue, OPBDIT, and PAT.",
            "Sentiment": "positive",
            "PublishDate": 1753869559113,
            "Source": "earnings"
        },
        {
            "Title": "Vedant Fashion Reports 12.5% Growth in Q1 Net Profit to 703 Million Rupees",
            "Summary": "Vedant Fashion reported Q1 consolidated net profit of 703 million rupees, up from 624.8 million rupees in the same period last year. The company's EBITDA increased to 1.2 billion rupees from 1.13 billion rupees year-over-year. However, EBITDA margin declined to 42.9% compared to 47% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753861470690,
            "Source": "earnings"
        },
        {
            "Title": "Vedant Fashions Pays ₹50,000 Compounding Fee for Legal Metrology Violation",
            "Summary": "Vedant Fashions Limited received a compounding order from the Department of Legal Metrology, Bangalore for failing to disclose manufacturing, packaging, or importing dates on its products. The company paid a compounding fee of ₹50,000 under Section 48 of the Legal Metrology Act, 2009. The violation involved not marking the month and year of manufacturing/packaging/importing on products. The company states there is no other financial or operational impact beyond the penalty amount.",
            "Sentiment": "negative",
            "PublishDate": 1753369491673,
            "Source": "stock"
        },
        {
            "Title": "Vedant Fashions: Q4 Profit Drops 12.6%, Stock Tumbles 5%",
            "Summary": "Vedant Fashions reported a 12.6% YoY decline in Q4 net profit to ₹101 crore. Revenue was nearly flat at ₹367.4 crore. EBITDA fell 5.3% with margins contracting to 45%. The company proposed a final dividend of ₹8 per share. Stock fell over 5% following the results.",
            "Sentiment": "negative",
            "PublishDate": 1746520764000,
            "Source": "earnings"
        },
        {
            "Title": "Vedant Fashion Reports Q4 Revenue of 3.67B Rupees",
            "Summary": "Vedant Fashion has announced its Q4 revenue, which stands at 3.67 billion rupees. This represents a slight increase from the previous year's figure of 3.63 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1746519094000,
            "Source": "result"
        },
        {
            "Title": "Vedant Fashion Q4 Results and Dividend Declaration",
            "Summary": "Vedant Fashion reported Q4 EBITDA of 1.66B rupees, down from 1.75B year-over-year. EBITDA margin decreased to 45.13% from 48.21%. The company declared a dividend of 8 rupees per share. Q4 consolidated net profit was 1.01B rupees, down from 1.16B year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1746519016000,
            "Source": "result"
        },
        {
            "Title": "Vedant Fashion to Consider Q4 Results on May 6",
            "Summary": "Vedant Fashion has announced that it will consider its fourth quarter (Q4) financial results on May 6. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745938824000,
            "Source": "default"
        },
        {
            "Title": "Vedant Fashions Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for Vedant Fashions Ltd. The transaction involved approximately 549,507 shares, traded at a price of Rs. 962.10 per share. The total value of the block trade amounted to Rs. 52.87 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1738396050000,
            "Source": "block_deals"
        },
        {
            "Title": "Vedant Fashion Reports Q3 EBITDA and Margin Results",
            "Summary": "Vedant Fashion has released its Q3 financial results. The company's EBITDA remained stable at 2.42 billion rupees compared to the same period last year. However, the EBITDA margin decreased from 51.02% to 47.35% year-over-year, indicating a slight decline in profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1738222966000,
            "Source": "earnings"
        },
        {
            "Title": "Vedant Fashion Reports Stable Q3 Net Profit, Revenue Growth",
            "Summary": "Vedant Fashion announced its Q3 financial results. The company's consolidated net profit remained steady at 1.58 billion rupees, matching the previous year's figure. Revenue showed growth, increasing from 4.7 billion rupees to 5.1 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738222883000,
            "Source": "earnings"
        },
        {
            "Title": "Vedant Fashion Reports Strong Same-Store Sales Growth in Q2 FY25",
            "Summary": "Vedant Fashion has reported a 17.3% year-over-year increase in Same-Store Sales Growth (SSSG) for the second quarter of fiscal year 2025, compared to the same period in fiscal year 2024. This information was disclosed in the company's investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1730206320000,
            "Source": "result"
        },
        {
            "Title": "Vedant Fashion Reports Strong Q2 Financial Performance",
            "Summary": "Vedant Fashion has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.2 billion rupees, up from 928 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 45.54% from 42.50% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1730190435000,
            "Source": "result"
        },
        {
            "Title": "Vedant Fashion Reports Q2 Revenue Growth",
            "Summary": "Vedant Fashion has announced its Q2 revenue figures, showing an increase to 2.7 billion rupees from 2.2 billion rupees in the same quarter last year. This represents a year-over-year growth in revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1730190373000,
            "Source": "result"
        },
        {
            "Title": "Vedant Fashion Reports 37% Increase in Q2 Net Profit",
            "Summary": "Vedant Fashion has announced its Q2 consolidated net profit of 669 million rupees, showing a significant increase from 487 million rupees in the same quarter last year. This represents a year-over-year growth of approximately 37%.",
            "Sentiment": "positive",
            "PublishDate": 1730190351000,
            "Source": "result"
        },
        {
            "Title": "Vedant Fashions to Consider Q2 Results on October 29",
            "Summary": "Vedant Fashions has announced that it will consider its second quarter (Q2) financial results on October 29.",
            "Sentiment": "neutral",
            "PublishDate": 1729604675000,
            "Source": "result"
        },
        {
            "Title": "Vedant Fashions Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for Vedant Fashions Ltd. The transaction involved approximately 1,201,821 shares, traded at a price of Rs. 1,331.00 per share. The total value of the trade amounted to Rs. 159.96 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1729054338000,
            "Source": "block_deals"
        },
        {
            "Title": "Vedant Fashions Ltd: Large Block Trade on NSE",
            "Summary": "<p>A <span class='neutral'>significant</span> <span class='neutral'>block trade</span> occurred for <b>Vedant Fashions Ltd</b> on the <b>National Stock Exchange (NSE)</b>. Approximately <span class='neutral'>865,927 shares</span> were traded at a price of <span class='neutral'>Rs. 1293.70</span> per share, totaling <span class='neutral'>Rs. 112.02 crores</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728552949000,
            "Source": "block_deals"
        }
    ]
}