{
    "Symbol": "MAPMYINDIA",
    "ISIN": "INE0BV301023",
    "News": [
        {
            "Title": "CE Info Systems Board Meet on Feb 13 for Q3FY26 Results",
            "Summary": "CE Info Systems has scheduled a board meeting on February 13, 2026, to approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770462595227,
            "Source": "co_actions_results"
        },
        {
            "Title": "CE Info Systems Completes ₹2 Cr Iwayplus Acquisition",
            "Summary": "CE Info Systems Limited has completed its acquisition of 3,500 CCPS in Iwayplus Private Limited for approximately ₹2.00 crores, as disclosed under SEBI Regulation 30 requirements.",
            "Sentiment": "positive",
            "PublishDate": 1768482457455,
            "Source": "co_actions_results"
        },
        {
            "Title": "CE Info Systems invests ₹2 cr in indoor navigation startup",
            "Summary": "CE Info Systems Limited approved a strategic investment of ₹2.00 crore in Iwayplus Private Limited, an indoor navigation startup, to acquire 6.06% stake on fully diluted basis through CCPS.",
            "Sentiment": "positive",
            "PublishDate": 1768210872460,
            "Source": "co_actions_results"
        },
        {
            "Title": "C.E. Info Systems Invests ₹2 Cr in iWayPlus",
            "Summary": "C.E. Info Systems announces ₹2 crore investment in iWayPlus Private Limited to acquire 6.06% stake as part of strategy to support innovative technologies in the sector.",
            "Sentiment": "positive",
            "PublishDate": 1768210288369,
            "Source": "co_actions_results"
        },
        {
            "Title": "CE Info Systems Block Trade Worth ₹43.66 Crores",
            "Summary": "CE Info Systems witnessed a significant NSE block trade of ₹43.66 crores involving 280,215 shares at ₹1,558.20 per share, indicating substantial institutional activity in the stock.",
            "Sentiment": "neutral",
            "PublishDate": 1768198984632,
            "Source": "co_actions_results"
        },
        {
            "Title": "MapmyIndia Mappls Adds Multimodal Transport Routes",
            "Summary": "MapmyIndia Mappls expands Mappls App with multimodal public transport routes covering metro, rail, and bus services across 18 cities for over 40 million users.",
            "Sentiment": "positive",
            "PublishDate": 1767075811011,
            "Source": "stocks"
        },
        {
            "Title": "MapmyIndia Faces ₹27.31 Cr GST Demand on IPO Expenses",
            "Summary": "C.E. Info Systems receives GST demand order worth ₹27.31 crores plus penalties from Delhi tax authorities related to input tax credit claimed on IPO expenses during FY2021-22.",
            "Sentiment": "negative",
            "PublishDate": 1766145918374,
            "Source": "stocks"
        },
        {
            "Title": "MapMyIndia Seeks Shareholder Approval for Employee Stock Option Plan Modifications",
            "Summary": "C.E. Info Systems Limited (MapMyIndia) has issued a postal ballot notice seeking shareholder approval for three resolutions related to its Employee Stock Option Plan 2008, including modifications to termination clauses and extension of benefits to subsidiary/associate company employees. The e-voting period runs from December 5, 2025 to January 3, 2026, with the plan covering 1,06,947 stock options for eligible employees.",
            "Sentiment": "neutral",
            "PublishDate": 1764853493794,
            "Source": "corporate_action"
        },
        {
            "Title": "MapmyIndia Partners with Zoho CRM for Location Intelligence Integration",
            "Summary": "MapmyIndia Mappls has announced a collaboration with Zoho to integrate its Address Capture and Nearby Lead Finder features directly within Zoho CRM, enabling users to capture verified addresses, visualize customer locations, and discover potential leads. The partnership combines indigenous mapping technology with CRM capabilities to deliver location-aware business intelligence solutions for Indian businesses using homegrown technology platforms.",
            "Sentiment": "positive",
            "PublishDate": 1764130184775,
            "Source": "stock"
        },
        {
            "Title": "MapMyIndia Reports 14.7% Revenue Growth in H1 FY26, Secures Major Government Contracts",
            "Summary": "MapMyIndia achieved 14.7% revenue growth in H1 FY26 with EBITDA of INR 84 crores, securing a landmark INR 110 crore contract with IOCL over 5 years and another significant contract with Survey of India. The company's IoT-led business grew 50% to INR 74.5 crores while investing INR 10-15 crores in technical services for future government opportunities in road safety and traffic management.",
            "Sentiment": "positive",
            "PublishDate": 1763127596525,
            "Source": "earnings"
        },
        {
            "Title": "C.E. Info Systems (MapmyIndia) Publishes Quarterly Financial Results for September 30, 2025",
            "Summary": "C.E. Info Systems Limited, which operates MapmyIndia and MAPPLS, has published its standalone and consolidated unaudited financial results for the quarter and half-year ended September 30, 2025. The company submitted copies of these financial statements to BSE and NSE exchanges. The results were published in Financial Express (English edition) and Jansatta (Hindi edition) on November 12, 2025. The communication was signed by Company Secretary and Compliance Officer Saurabh Surendra Somani.",
            "Sentiment": "neutral",
            "PublishDate": 1763003169941,
            "Source": "earnings"
        },
        {
            "Title": "MapmyIndia Reports Strong Q2 Results and Secures Major ₹110 Crore IOCL Contract",
            "Summary": "C.E. Info Systems Limited (MapmyIndia) announced its quarterly results for the period ended September 30, 2025, alongside securing a significant new project worth ₹110.19 crore from Indian Oil Corporation Limited (IOCL). The IOCL contract involves comprehensive implementation and operation of a Central Vehicle Tracking and Management System, including pan-India provisioning and monitoring of IoT hardware, software and services with 24x7 command centre monitoring. The company also disclosed that its proposed secondary purchase of shares in Zepto Private Limited did not materialize, though business relationships continue. Additionally, MapmyIndia made an investment of ₹2,499.95 lakhs to acquire a further 20.02% shareholding in its subsidiary GTropy Systems Private Limited, increasing its total shareholding to 96%. The Board of Directors approved the unaudited standalone and consolidated financial results during their meeting held on November 10, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762819840941,
            "Source": "earnings"
        },
        {
            "Title": "CE Info Systems Targets 30% Revenue Growth Through AI-Powered Geospatial Platform and Strategic Partnerships",
            "Summary": "CE Info Systems has provided guidance for 30% revenue compound annual growth rate (CAGR) driven by automotive, logistics, and consumer technology integration. The company is expanding its AI-powered geospatial platform and IoT stack while targeting margin expansion through a Software-as-a-Service (SaaS) model and global licensing. Growth strategy includes strategic partnerships with automotive original equipment manufacturers (OEMs) and smart city programs.",
            "Sentiment": "positive",
            "PublishDate": 1762788091048,
            "Source": "stock"
        },
        {
            "Title": "C.E. Info Systems Wins ₹110.19 Crore Contract from Indian Oil Corporation",
            "Summary": "C.E. Info Systems has secured a contract worth ₹110.19 crore from Indian Oil Corporation Limited.",
            "Sentiment": "positive",
            "PublishDate": 1762786930494,
            "Source": "order&deals"
        },
        {
            "Title": "C.E. Info Systems Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "C.E. Info Systems reported quarterly results showing revenue growth to 1.1 billion rupees from 1.04 billion rupees year-over-year. However, consolidated net profit declined to 185 million rupees from 303 million rupees in the same period last year. EBITDA decreased to 281 million rupees from 371 million rupees year-over-year, while EBITDA margin compressed to 24.72% from 35.79% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762784628848,
            "Source": "earnings"
        },
        {
            "Title": "MapmyIndia Wins Contract to Build National Geo-Spatial Platform for Survey of India",
            "Summary": "MapmyIndia has secured a project from the Survey of India to develop a national geo-spatial platform. The platform is described as the first-of-its-kind for the country.",
            "Sentiment": "positive",
            "PublishDate": 1762349849830,
            "Source": "stock"
        },
        {
            "Title": "C.E. Info Systems (MapMyIndia) Schedules Q2 FY2026 Earnings Call for November 11, 2025",
            "Summary": "C.E. Info Systems Limited, which operates MapMyIndia and MAPPLS, has announced an earnings conference call scheduled for Tuesday, November 11, 2025, at 10:00 a.m. IST to discuss financial results for the quarter ended September 30, 2025. The call will be hosted by Anand Rathi and will feature key management personnel including Group Chairman MD Rakesh Kumar Verma, Non-Executive Director MD Rohan Verma, Group CFO Anuj Jain, and Company Secretary Saurabh Somani. Dial-in details have been provided for participants to join the earnings discussion.",
            "Sentiment": "neutral",
            "PublishDate": 1762289813206,
            "Source": "earnings"
        },
        {
            "Title": "DMRC Partners With Mappls MapmyIndia For Metro Data Integration",
            "Summary": "Delhi Metro Rail Corporation (DMRC) has entered into a partnership with CE Info Systems' Mappls MapmyIndia for metro data integration services.",
            "Sentiment": "positive",
            "PublishDate": 1761915297529,
            "Source": "stock"
        },
        {
            "Title": "CE Info Systems Shares Surge 10% on Potential MapMyIndia-Arattai Integration Hopes",
            "Summary": "CE Info Systems, parent company of MapMyIndia, saw shares jump 10% following social media discussions about potential integration between its Mappls app and Zoho's Arattai chat application. MapMyIndia Director Rohan Verma expressed willingness to integrate with Arattai through their APIs and SDKs. The surge was also attributed to endorsements from Railways and IT Minister Ashwini Vaishnaw, who featured MapMyIndia in presentations and praised Mappls as having 'good features' and being a 'must try' product. Shares traded 7.4% higher at ₹1,822.5, though still below the 52-week high of ₹2,204.",
            "Sentiment": "positive",
            "PublishDate": 1760330724948,
            "Source": "stock"
        },
        {
            "Title": "MapmyIndia Shares Surge 8% After Railway Minister Endorses Indigenous Navigation App",
            "Summary": "CE Info Systems shares, which operates MapmyIndia, jumped over 8% to Rs 1,847 on BSE following Railway Minister Ashwini Vaishnaw's endorsement of their Mappls navigation application. The minister tested the app in his car and praised its features including 3D junction views, real-time driving alerts for speed limits and accident-prone spots, and trip cost calculations based on vehicle and fuel type. Vaishnaw announced that Indian Railways will soon sign a memorandum of understanding with the Google Maps competitor. The company has urged the government to mandate pre-installation of Mappls on smartphones produced under the production-linked incentive scheme. MapmyIndia supports nearly 10 government departments including police departments and tax agencies, though government business represents less than 20% of the company's Rs 463 crore annual revenue.",
            "Sentiment": "positive",
            "PublishDate": 1760330317093,
            "Source": "stock"
        },
        {
            "Title": "C.E. Info Systems Launches Real-Time Traffic Signal Timer and NHAI Toll Pass Features in Mappls App",
            "Summary": "C.E. Info Systems Limited announced the launch of new features in its Mappls App, making it India's first navigation app to offer AI-powered live traffic signal timers and NHAI annual toll pass savings information. The company partnered with Bengaluru Traffic Police, NHAI, and Arcadis to integrate 125+ smart signals across Bengaluru, allowing users to view real-time signal countdowns up to 500 meters in advance. The app now displays potential toll cost savings using NHAI Annual Toll Pass before trip starts and shows total kilometers traveled on toll roads for better transparency. The features are currently live on iOS with Android rollout planned soon. The company plans to expand live traffic signal integration to other cities.",
            "Sentiment": "positive",
            "PublishDate": 1758774238175,
            "Source": "stock"
        },
        {
            "Title": "C.E. Info Systems Acquires 96% Stake in Gtropy Systems for ₹24.99 Crore",
            "Summary": "C.E. Info Systems has completed the acquisition of a 96% stake in Gtropy Systems Private Limited for ₹24.99 crore. The transaction represents a strategic expansion move by C.E. Info Systems through this majority stake purchase.",
            "Sentiment": "positive",
            "PublishDate": 1756820170671,
            "Source": "order&deals"
        },
        {
            "Title": "MapmyIndia Reports Strong Q1 Results with 19.8% Revenue Growth, Partners with Zepto",
            "Summary": "C.E. Info Systems Limited (MapmyIndia) shares traded at ₹1,776.40, up 1.40% on NSE. The digital mapping company reported quarterly revenue growth of 19.8% to ₹121.6 crore, driven by its map-led business segment. EBITDA increased 30.6% to ₹55.9 crore with margins expanding to 46.0% from 42.1%. Profit after tax rose 27.7% to ₹45.8 crore with PAT margin improving to 33.9%. The core map-led business grew 26% with EBITDA margins of 54.8%. Automotive & Mobility Tech segment expanded 24.4% while Consumer Tech & Enterprise Digital Transformation revenue grew 16.1%. The company formed a strategic partnership with Zepto and approved a ₹25 crore investment in the quick commerce platform. Chairman Rakesh Verma expressed confidence in achieving the ₹1,000 crore revenue target by FY2028. MapmyIndia increased its stake in IoT subsidiary Gtropy Systems to 96% and fully operationalized subsidiary Mappls DT for government and defence digital transformation. The company maintains cash reserves of ₹676.9 crore.",
            "Sentiment": "positive",
            "PublishDate": 1754638187103,
            "Source": "earnings"
        },
        {
            "Title": "CE Info Systems Targets ₹1,000 Crore Revenue By FY28 Through Map-Led Growth and Defense Digital Twin Initiatives",
            "Summary": "CE Info Systems has set a revenue target of ₹1,000 crore by FY28. The company plans to achieve this through map-led growth strategies, defense digital twin initiatives, and quick commerce integration. The company has made a ₹25 crore investment in Zepto as part of its quick commerce integration strategy. The IoT segment continues to perform well for the company.",
            "Sentiment": "positive",
            "PublishDate": 1754579140057,
            "Source": "stock"
        },
        {
            "Title": "C.E. Info Systems Makes Q1FY2026 Earnings Call Recording Available",
            "Summary": "C.E. Info Systems Limited has made the audio recording of its Q1FY2026 earnings call available on its website. The earnings call was held on August 07, 2025, and the recording can be accessed through a link provided on the company's website. The company submitted this information to BSE and NSE stock exchanges, with Company Secretary Saurabh Surendra Somani signing the notification.",
            "Sentiment": "neutral",
            "PublishDate": 1754576312543,
            "Source": "earnings"
        },
        {
            "Title": "CE Info Systems Approves ₹250 Million Investment in Zepto and GTropy Systems",
            "Summary": "CE Info Systems has approved an investment of ₹250 million in Zepto and GTropy Systems. The investment decision has been approved by the company.",
            "Sentiment": "positive",
            "PublishDate": 1754567879440,
            "Source": "order&deals"
        },
        {
            "Title": "C.E. Info Systems Reports Strong Q1 Growth with 29% Jump in Net Profit",
            "Summary": "C.E. Info Systems delivered robust quarterly results with consolidated net profit rising to 461 million rupees from 358 million rupees year-over-year. Revenue increased to 1.2 billion rupees compared to 1 billion rupees in the same period last year. The company's EBITDA grew to 559 million rupees from 428 million rupees, while EBITDA margin improved to 45.94% from 42.13% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754566825402,
            "Source": "earnings"
        },
        {
            "Title": "MapmyIndia: Collaborates with India Post for Digital Address System",
            "Summary": "MapmyIndia has integrated India Post's DIGIPIN system into its Mappls app, offering 'last mile digital address connectivity'. This collaboration allows users to generate unique digital pins for any location across India, enhancing precision in addressing. India Post has also integrated MapmyIndia's Map APIs into their systems.",
            "Sentiment": "positive",
            "PublishDate": 1751871407000,
            "Source": "corporate_action"
        },
        {
            "Title": "MapmyIndia Mappls App Partners with India Post's Digipin",
            "Summary": "C.E. Info Systems' MapmyIndia Mappls app has collaborated with India Post's Digipin service to enhance last-mile digital address services. This partnership aims to improve the accuracy and efficiency of digital addressing, potentially benefiting both consumers and businesses in India.",
            "Sentiment": "positive",
            "PublishDate": 1751856538000,
            "Source": "default"
        },
        {
            "Title": "MapmyIndia: Secures ₹233 Crore Map Data Licensing Deal",
            "Summary": "C.E. Info Systems Ltd (MapmyIndia) has secured a ₹233 crore map data licensing contract from an undisclosed international client. The domestic-use project will be executed over seven years. The company's shares rose 1.5% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1751363450000,
            "Source": "order&deals"
        },
        {
            "Title": "CE Info Systems: Shares Decline Over 8% Following Block Deals",
            "Summary": "CE Info Systems Ltd.'s shares fell more than 8% after block deals worth Rs 52.55 crore on the NSE. Approximately 5.3% of equity changed hands, with 27.94 lakh shares traded. The identities of buyers and sellers are unknown. Two promoters, Rakesh Kumar Verma and Rashmi Verma, hold significant stakes in the company.",
            "Sentiment": "negative",
            "PublishDate": 1749704905000,
            "Source": "block_deals"
        },
        {
            "Title": "C.E. Info Systems Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 130,691 shares of C.E. Info Systems Ltd. took place on the National Stock Exchange (NSE) for Rs. 23.70 Crores. The trade was executed at a price of Rs. 1813.70 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1749700010000,
            "Source": "block_details"
        },
        {
            "Title": "C.E. InfoSystem Aims to Increase Customer Opportunities by FY28",
            "Summary": "C.E. InfoSystem has announced plans to increase its customer opportunity count to 500 by the fiscal year 2028, according to their investor presentation. This information suggests a strategic growth plan for the company over the next few years.",
            "Sentiment": "positive",
            "PublishDate": 1748681691000,
            "Source": "default"
        },
        {
            "Title": "C.E. Info Systems Reports Strong Order Book Growth",
            "Summary": "C.E. Info Systems announced that their open order book has grown to Rs 1,500 crore at the end of FY25. The company executive expressed confidence in achieving their stated milestone of crossing Rs 1,000 crore revenue by FY28, based on their current order book achievements.",
            "Sentiment": "positive",
            "PublishDate": 1746857721000,
            "Source": "default"
        },
        {
            "Title": "C.E. Info Systems Reports Strong Q4 Results and Declares Dividend",
            "Summary": "C.E. Info Systems announced its Q4 financial results, showing significant year-over-year growth. The company's revenue increased to 1.44 billion rupees from 1.1 billion rupees in the previous year. EBITDA rose to 550.6 million rupees, up from 395 million rupees, with an improved EBITDA margin of 38.36%. Consolidated net profit reached 485.7 million rupees, compared to 380 million rupees year-over-year. Additionally, the company approved a final dividend of 3.50 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746809856000,
            "Source": "result"
        },
        {
            "Title": "ClarityX AI: MapmyIndia-Backed Firm Launches 'Places Pulse' Search Analytics Tool",
            "Summary": "ClarityX AI, backed by MapmyIndia founders, has introduced 'Places Pulse', a free search analytics tool providing location-based consumer insights across India. The tool analyzes 9 GB of daily logs and over 450 million monthly records, offering detailed insights for 12+ industries. Key findings include 49% of searches for religious places and 23% for hospitals and clinics.",
            "Sentiment": "positive",
            "PublishDate": 1742896949000,
            "Source": "normal_news"
        },
        {
            "Title": "ClarityX AI Launches 'Places Pulse' Analytics Tool",
            "Summary": "C.E. Info Systems' ClarityX AI has introduced 'Places Pulse', a new search analytics tool powered by Mappls MapmyIndia technology. This tool is designed to provide insights into location-based searches and trends, leveraging MapmyIndia's mapping capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1742880946000,
            "Source": "corporate_action"
        },
        {
            "Title": "C.E. Info Systems Reports Increased Q3 Net Profit and Revenue",
            "Summary": "C.E. Info Systems has announced its Q3 financial results. The company's consolidated net profit rose to 324 million rupees, up from 307 million rupees year-over-year and 303 million rupees quarter-over-quarter. Revenue for Q3 increased to 1.14 billion rupees, compared to 920 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738109846000,
            "Source": "earnings"
        },
        {
            "Title": "C.E. Info Systems Reports Q3 EBITDA Growth",
            "Summary": "C.E. Info Systems announced its Q3 financial results, showing an EBITDA of 417 million rupees, up from 360 million rupees in the same quarter last year. However, the EBITDA margin decreased to 36.36% from 39.13% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738067791000,
            "Source": "earnings"
        },
        {
            "Title": "C.E. Info Systems Reports Q3 Financial Results",
            "Summary": "C.E. Info Systems has announced its Q3 financial results. The company's consolidated net profit increased to 324 million rupees, up from 307 million rupees year-over-year and 303 million rupees quarter-over-quarter. Revenue for Q3 rose to 1.14 billion rupees, compared to 920 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738067677000,
            "Source": "earnings"
        },
        {
            "Title": "Qualcomm and C.E. Info Systems Collaborate on 'Make in India' Automotive Solutions",
            "Summary": "Qualcomm has entered into a strategic collaboration with C.E. Info Systems to accelerate 'Make in India' solutions for the automotive industry. This partnership aims to leverage both companies' expertise to develop innovative technologies for the Indian automotive market, aligning with the government's initiative to promote local manufacturing and technological advancement.",
            "Sentiment": "positive",
            "PublishDate": 1737088561000,
            "Source": "corporate_action"
        },
        {
            "Title": "MapMyIndia: Share Price Drops 5% After Previous Day's Surge",
            "Summary": "MapMyIndia (CE Info Systems Ltd) shares fell over 5% to ₹1,800.25 on BSE, following a 16% rally in the previous session. The earlier surge came after the company's board decided not to invest in the outgoing CEO Rohan Verma's new venture.",
            "Sentiment": "neutral",
            "PublishDate": 1733806473000,
            "Source": "normal_news"
        },
        {
            "Title": "CE Info Systems Reverses Decision on Investment in Proposed New Company",
            "Summary": "CE Info Systems has announced that its board has reversed its previous decision to make any equity or debt investment in a proposed new company. This change in strategy indicates a shift in the company's investment plans or corporate direction.",
            "Sentiment": "neutral",
            "PublishDate": 1733735858000,
            "Source": "corporate_governance"
        },
        {
            "Title": "CE Info Systems Reconsiders Stake Acquisition in New Company",
            "Summary": "CE Info Systems has announced that it is re-evaluating its decision to acquire a 10% stake in a new company that was to be formed by Rohan Verma. This indicates a potential change in the company's investment strategy or a reassessment of the proposed venture's viability.",
            "Sentiment": "neutral",
            "PublishDate": 1733735706000,
            "Source": "corporate_action"
        },
        {
            "Title": "CE Info Systems Ltd.: MapMyIndia Cancels Investment in CEO's New Venture",
            "Summary": "MapMyIndia's parent company, CE Info Systems Ltd., has decided not to invest Rs 35 crore in outgoing CEO Rohan Verma's new B2C venture. The company will maintain a 10% stake for Rs 10 lakh. Rohan Verma is stepping down as CEO but will remain a non-executive director. The decision aims to maintain MapMyIndia's focus on B2B and B2B2C operations without the potential margin drag from consumer business expenses.",
            "Sentiment": "neutral",
            "PublishDate": 1733284537000,
            "Source": "corporate_governance"
        },
        {
            "Title": "CE Info Systems: CEO Steps Down, New Venture Announced",
            "Summary": "MapMyIndia's parent company CE Info Systems shares fell 8% after CEO Rohan Verma announced his departure to start a new venture. MapMyIndia will hold a 10% stake worth ₹10 lakh in the new entity, with an option to invest ₹35 crore through CCDs. The new B2C business is expected to have an annual cash burn of ₹30 crore, funded by Verma's personal funds. CE Info Systems stock is now trading below its listing price.",
            "Sentiment": "negative",
            "PublishDate": 1733212392000,
            "Source": "corporate_governance"
        },
        {
            "Title": "MapmyIndia to Focus on Core Business and Acquire Stake in B2C Company",
            "Summary": "CE InfoSystem, operating as MapmyIndia, has announced its intention to maintain focus on its core B2B and B2B2C businesses. Additionally, the company plans to acquire a 10% stake in a B2C company established by Rohan Verma.",
            "Sentiment": "positive",
            "PublishDate": 1733061967000,
            "Source": "corporate_action"
        },
        {
            "Title": "CE Info Systems Approves B2C Business Separation and CEO Transition",
            "Summary": "CE Info Systems' board has approved a proposal to separate its B2C business into a distinct entity. Additionally, the company announced that Rohan Verma will step down from his role as CEO effective March 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1732894184000,
            "Source": "corporate_governance"
        },
        {
            "Title": "CE Info Systems Invests in Simdaas Autonomy and Kaiinos Geo Spatial Tech",
            "Summary": "CE Info Systems has announced two strategic investments. The company plans to invest 30 million rupees to acquire a 9.37% stake in Simdaas Autonomy. Additionally, CE Info Systems will invest 20 million rupees to purchase a 19.84% stake in Kaiinos Geo Spatial Tech.",
            "Sentiment": "positive",
            "PublishDate": 1732894178000,
            "Source": "corporate_action"
        },
        {
            "Title": "CE Info Systems Approves $0.5M Investment in US Subsidiary",
            "Summary": "CE Info Systems has approved a further investment of $0.5 million in its subsidiary C.E. International Inc., located in the USA. This decision represents a strategic move by the parent company to strengthen its international presence and support the growth of its US-based operations.",
            "Sentiment": "positive",
            "PublishDate": 1731065229000,
            "Source": "corporate_action"
        }
    ]
}