{
    "Symbol": "MARATHON",
    "ISIN": "INE182D01020",
    "News": [
        {
            "Title": "Marathon Nextgen Realty Board Meet on Feb 13, 2026",
            "Summary": "Marathon Nextgen Realty Limited has scheduled a board meeting on February 13, 2026, to consider Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770739792093,
            "Source": "co_actions_results"
        },
        {
            "Title": "Marathon Nextgen Reports Record Q2 Profit of INR 67 Crores, Announces Major Commercial Project",
            "Summary": "Marathon Nextgen Realty delivered its highest quarterly profit after tax of INR 67 crores in Q2 FY26, marking 35% year-on-year growth, while announcing Monte South Commercial project with estimated GDV of INR 3,400 crores in joint venture with Adani Realty. The company achieved area sales of 65,845 square feet (18% increase) and booking value of INR 166 crores (29% increase) for the quarter, supported by strong demand across residential and commercial segments in Mumbai micromarkets.",
            "Sentiment": "positive",
            "PublishDate": 1763382760347,
            "Source": "earnings"
        },
        {
            "Title": "Marathon Nextgen Realty Reports Strong Q2 FY26 Performance with ₹900 Crore QIP Completion",
            "Summary": "Marathon Nextgen Realty Limited shared its investor presentation for the second quarter and half year ended September 30, 2025. The company successfully raised ₹900 crores through a Qualified Institutional Placement (QIP) and achieved a net cash position post-QIP, significantly strengthening its balance sheet. For Q2 FY26, the company reported total revenues of ₹155 crores, EBITDA of ₹80 crores with a 52% margin, and profit after tax of ₹67 crores with a 43% margin. The company sold 65,845 sq.ft. of area generating booking value of ₹166 crores and collections of ₹191 crores during the quarter. Marathon has ongoing projects across key locations including Monte South in Byculla, Nexzone in Panvel, and Neo series projects in Bhandup. The company announced upcoming launches including Monte South Commercial (7.5 lakh sq.ft.), Nexzone Phase III (4.9 lakh sq.ft.), and Marathon Neo Series (15.82 lakh sq.ft.). A strategic board-approved amalgamation arrangement is designed to streamline corporate structure, with the merged entity having 418 acres of land and developable area potential of 4.2 crore sq.ft.",
            "Sentiment": "positive",
            "PublishDate": 1763013385686,
            "Source": "stock"
        },
        {
            "Title": "Marathon Nextgen Realty Launches ₹370 Crore Residential Development in Bhandup",
            "Summary": "Marathon Nextgen Realty Ltd. announced the launch of three new residential towers in Bhandup with a combined Gross Development Value of ₹370 crore. The launch includes a new residential project within the 6.5-acre NeoPark layout covering 5,100 sq.mt. of land with 1.2 lakh sq.ft. of saleable carpet area and estimated GDV of ₹200 crore. Additionally, the company is introducing the second tower of Neovalley Narmada and third tower of NeoPark Ashoka, adding 1 lakh sq.ft. of saleable carpet area with GDV of ₹170 crore. The total launch comprises approximately 2.2 lakh sq.ft. of residential space under the Neohomes category. Marathon has already delivered over 700 Neohomes in Bhandup, with Neosquare receiving its Occupancy Certificate. Director Kaivalya Shah stated the launch aligns with the area's growth story and strengthens their portfolio in the micro-market.",
            "Sentiment": "positive",
            "PublishDate": 1763009419051,
            "Source": "stock"
        },
        {
            "Title": "Marathon Nextgen Realty Launches ₹600 Crore Residential Development in Panvel",
            "Summary": "Marathon Nextgen Realty Limited announced the launch of Phase III of its flagship township, Marathon Nexzone, in Panvel called The Nirvana Collection. The project spans approximately 3 acres with an estimated RERA Carpet Area of around 4.90 lakh sq.ft. and an estimated Gross Development Value exceeding ₹600 crore. The development comprises four premium towers of 28 storeys each, offering 2BHK, 3BHK and select 4BHK homes, along with two retail floors, four parking levels, and a 70,000 sq.ft. amenity zone. Marathon Nexzone has already sold more than 3,500 homes and delivered over 2,500 homes with Occupation Certificate, with another 1,000 homes under development across 16 towers. The Nirvana Collection is proposed to be a Silver Rated Pre-Certified Green Building by the Indian Green Building Council. Director Samyag Shah stated that the project redefines modern living by creating a self-sufficient residential ecosystem with a focus on sustainability, positioning to benefit from Panvel's growth driven by the Atal Setu and Navi Mumbai Airport.",
            "Sentiment": "positive",
            "PublishDate": 1762927373900,
            "Source": "stock"
        },
        {
            "Title": "Marathon Nextgen Realty Reports No Deviation in QIP Fund Utilization for September Quarter",
            "Summary": "Marathon Nextgen Realty Limited submitted its monitoring agency report for the quarter ended September 30, 2025, regarding its Qualified Institutional Placement (QIP) fund utilization. The company raised funds through QIP involving 1,62,12,406 equity shares of face value Rs 5 each at Rs 555.13 per share. India Ratings Research Private Limited, the monitoring agency, reported no deviation from the stated objects of fund utilization. The company utilized Rs 45,973.30 lakhs during the quarter across various objectives including investment in subsidiaries (Rs 6,624.09 lakhs), repayment of borrowings by the company (Rs 21,113.87 lakhs), repayment of subsidiary borrowings (Rs 12,922.07 lakhs), land acquisition (Rs 300 lakhs), and general corporate purposes (Rs 4,292.15 lakhs). The unutilized amount of Rs 44,026.63 lakhs was deployed in various mutual funds and bank accounts, earning returns totaling Rs 311.83 lakhs. All statutory approvals required for the current project stage have been obtained according to management undertaking.",
            "Sentiment": "neutral",
            "PublishDate": 1762913796086,
            "Source": "corporate_action"
        },
        {
            "Title": "Marathon Nextgen Realty Reports 36% Jump in Q2 Net Profit Despite Revenue Decline",
            "Summary": "Marathon Nextgen Realty posted a consolidated net profit of 660 million rupees in Q2, up from 484 million rupees in the same quarter last year, representing a 36% year-over-year increase. However, the company's revenue declined to 1.17 billion rupees from 1.5 billion rupees in the corresponding quarter of the previous year, marking a 22% decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1762874055129,
            "Source": "earnings"
        },
        {
            "Title": "Marathon Nextgen Realty Partners with Adani Realty for ₹3,400 Crore Mumbai Commercial Project",
            "Summary": "Marathon Nextgen Realty announced a joint venture with Adani Realty to develop one of Mumbai's largest commercial projects. The development has a Gross Development Value (GDV) of ₹3,400 crore.",
            "Sentiment": "positive",
            "PublishDate": 1761179460664,
            "Source": "order&deals"
        },
        {
            "Title": "Marathon Nextgen Realty Partners with Adani Realty for ₹3,400 Crore Commercial Project in Mumbai",
            "Summary": "Marathon Nextgen Realty Limited announced a joint venture with Adani Realty to develop Monte South Commercial, a landmark office and retail project in Byculla. The development spans approximately 1.2 million sq.ft. with an estimated Gross Development Value of ₹3,400 crore. The project is part of the larger Monte South campus, which includes four residential towers rising over 64 storeys with total residential carpet area exceeding 1.6 million sq.ft. Tower A has received Occupation Certificate, Tower B has topped out in RCC, Tower C has reached the 12th slab, while Tower D is yet to be launched. The mixed-use development aims to create a live-work ecosystem in Mumbai's urban core. Monte South Commercial will feature Grade-A offices, premium retail zones, and world-class amenities with efficient floor plates, distinctive architecture, and sustainable design. Vice Chairman Mayur Shah stated the project will set a new benchmark for South Mumbai's business landscape, combining design excellence, efficiency, and long-term value.",
            "Sentiment": "positive",
            "PublishDate": 1760967500632,
            "Source": "order&deals"
        },
        {
            "Title": "Navi Mumbai Airport Expected to Generate 1 Lakh Jobs Upon Inauguration",
            "Summary": "Prime Minister Narendra Modi will inaugurate Phase 1 of Navi Mumbai International Airport (NMIA) on October 8. The airport, built at a cost of Rs 19,650 crore under a Public-Private Partnership, is expected to create nearly one lakh jobs according to Marathon Nextgen Managing Director Mayur Shah. The facility spans 1160 hectares and is designed to handle 90 million passengers annually and 3.25 million metric tonnes of cargo. NMIA will operate alongside Mumbai's existing airport to ease congestion and features sustainable infrastructure including 47 MW solar power generation, EV bus services, and will be India's first airport connected via Water Taxi. Shah anticipates the project will drive real estate development and commercial growth in the Panvel-Raigad region over the next decade.",
            "Sentiment": "positive",
            "PublishDate": 1759910920586,
            "Source": "stock"
        },
        {
            "Title": "Marathon Nextgen Realty Reports Strong Q1 FY2026 Results with 63% PAT Growth",
            "Summary": "Marathon Nextgen Realty delivered robust Q1 FY2026 performance with total income growing 10% year-on-year to INR 191 crores, while profit after tax surged 63% to INR 62 crores. EBITDA expanded 27% to INR 81 crores, and pre-sales value jumped 16% to INR 183 crores. The company completed a successful QIP fundraising of INR 900 crores, using INR 340 crores for debt repayment, achieving zero debt-to-equity ratio. This will result in quarterly interest savings of INR 10 crores. The company received occupation certificates for three towers at Nexzone Panvel and maintains leading positions across key micro-markets. Marathon has a strong upcoming pipeline of ~15 lakh sq ft launches with INR 4,500 crores GDV over the next 2-3 quarters, including Monte South commercial project with GDV of ~INR 3,500 crores. Management expressed confidence in continued strong performance, citing favorable demographics and improved infrastructure connectivity in the Mumbai Metropolitan region.",
            "Sentiment": "positive",
            "PublishDate": 1755607900348,
            "Source": "earnings"
        },
        {
            "Title": "Marathon Nextgen Realty Anticipates Multi-Year Revenue Growth from Project Pipeline and Land Monetization",
            "Summary": "Marathon Nextgen Realty expects a multi-year revenue upswing driven by large ongoing projects and land bank monetization. The company plans strategic launches with Mumbai-centric demand expected to boost cash flows.",
            "Sentiment": "positive",
            "PublishDate": 1755102916200,
            "Source": "stock"
        },
        {
            "Title": "Marathon Nextgen Realty Reports 63% PAT Growth, Raises ₹900 Crore via QIP",
            "Summary": "Marathon Nextgen Realty reported strong quarterly results with Profit After Tax growing 63% year-on-year to ₹62 crore for the quarter ended June 30, 2025. Revenue stood at ₹191 crore, while EBITDA increased 27% to ₹81 crore and Profit Before Tax grew 55% to ₹68 crore. The company completed a ₹900 crore Qualified Institutional Placement with participation from domestic and international institutional investors. ₹340 crore of the proceeds was used for debt repayment, bringing the company to a net cash positive position. ₹160 crore is being allocated toward construction acceleration and ₹300 crore for new asset-light development opportunities. Operationally, the company sold 77,759 sq. ft. of area (7% growth), achieved booking value of ₹183 crore (16% growth), and collections of ₹239 crore (28% growth). Marathon has active projects across Lower Parel, Byculla, Mulund and land banks in Bhandup, Dombivli, and Panvel.",
            "Sentiment": "positive",
            "PublishDate": 1755080355905,
            "Source": "earnings"
        },
        {
            "Title": "Marathon Nextgen Realty Submits QIP Monitoring Report for Quarter Ended June 2025",
            "Summary": "Marathon Nextgen Realty Limited submitted a Monitoring Agency Report for funds raised through Qualified Institutional Placement (QIP) for the quarter ended June 30, 2025. The report was filed on August 11, 2025, in compliance with SEBI regulations. Ratings & Research Private Limited served as the monitoring agency. The filing demonstrates the company's adherence to regulatory requirements for transparency and reporting of QIP fund utilization. Company Secretary and Compliance Officer Yogesh Patole submitted the report under SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 and SEBI (Issue of Capital and Disclosure Requirements) Regulations, 2018.",
            "Sentiment": "neutral",
            "PublishDate": 1754929251497,
            "Source": "corporate_action"
        },
        {
            "Title": "Marathon Nextgen Realty Reports Strong Q1 Results, Schedules AGM and Amends Merger Scheme",
            "Summary": "Marathon Nextgen Realty Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. On standalone basis, the company reported revenue from operations of ₹2,392.58 lakhs and net profit of ₹4,187.22 lakhs, with earnings per share of ₹8.18. On consolidated basis, revenue from operations was ₹14,081.47 lakhs with net profit of ₹6,157.33 lakhs and earnings per share of ₹11.69. The Board scheduled the 48th Annual General Meeting for September 24, 2025. The company amended its Composite Scheme of Amalgamation and Arrangement following the successful completion of a Qualified Institutional Placement that raised ₹89,999.99 lakhs through allotment of 1,62,12,406 equity shares at ₹555.13 per share. The amendment revised share exchange ratios while keeping the overall total number of shares to be issued under the scheme unchanged. Post-QIP, promoter shareholding decreased from 73.63% to 55.92%, while public shareholding increased from 26.37% to 44.08%.",
            "Sentiment": "positive",
            "PublishDate": 1754926364038,
            "Source": "earnings"
        },
        {
            "Title": "Marathon Nextgen Realty Reports Mixed Q1 Results with Higher Profit Despite Revenue Decline",
            "Summary": "Marathon Nextgen Realty reported quarterly results showing consolidated net profit increased to 526 million rupees from 327 million rupees year-over-year. However, revenue declined to 1.41 billion rupees from 1.62 billion rupees compared to the same period last year. EBITDA dropped to 309 million rupees from 529 million rupees year-over-year, while EBITDA margin compressed to 21.96% from 32.63% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754925182091,
            "Source": "earnings"
        },
        {
            "Title": "Marathon Realty Releases Non-Disposal Undertaking on 26.1 Million Shares After Loan Repayment",
            "Summary": "Marathon Realty Private Limited submitted a revised disclosure regarding the release of a non-disposal undertaking (NDU) covering 26,116,151 shares of Marathon Nextgen Realty Limited, representing 38.74% of the company's total share capital. The encumbrance was released following loan repayment to Piramal Capital and Housing Finance Limited, with Piramal Trusteeship Services Private Limited serving as trustee. Marathon Realty maintains a total holding of 34,482,646 shares (51.15% of share capital) in Marathon Nextgen Realty Limited. The release was effective July 23, 2025, and the disclosure was submitted to BSE Limited and NSE Limited where Marathon Nextgen Realty's shares are listed.",
            "Sentiment": "positive",
            "PublishDate": 1753955833856,
            "Source": "corporate_action"
        },
        {
            "Title": "Marathon Realty Releases Non-Disposal Undertaking on 38.74% Stake in Marathon Nextgen Realty",
            "Summary": "Marathon Realty Private Limited, a promoter of Marathon Nextgen Realty Limited, has released a non-disposal undertaking (NDU) on 26,116,151 shares representing 38.74% of total share capital on July 23, 2025. The shares were previously held under encumbrance with Piramal Capital and Housing Finance Limited as lender and Piramal Trusteeship Services Private Limited as trustee. Following the NDU release, Marathon Realty Private Limited now holds 34,482,646 shares (51.15% of total share capital) without any encumbrance. The company had previously clarified in March 2025 that it had given an NDU but had not pledged its shareholding in Marathon Nextgen Realty Limited.",
            "Sentiment": "positive",
            "PublishDate": 1753420337748,
            "Source": "corporate_action"
        },
        {
            "Title": "Marathon Nxtgen Realty: Nomura Sells 4.4 Lakh Shares in Bulk Deal",
            "Summary": "Nomura Singapore sold approximately 4.4 lakh shares of Marathon Nxtgen Realty at Rs 670.11 per share, totaling over Rs 29 crore. NECTA Bloom VCC - NECTA Bloom One also offloaded 3.6 lakh shares worth Rs 24 crore. The stock closed at Rs 691.80, up 3.57% for the day.",
            "Sentiment": "neutral",
            "PublishDate": 1751901342000,
            "Source": "block_deals"
        },
        {
            "Title": "Marathon NextGen Raises ₹900 Crore Through QIP",
            "Summary": "Marathon NextGen has successfully completed its Qualified Institutional Placement (QIP) issue, raising ₹900 crore. The company sold 1.62 crore shares at a price of ₹555.13 per share.",
            "Sentiment": "positive",
            "PublishDate": 1751338015000,
            "Source": "default"
        },
        {
            "Title": "Marathon Nextgen Realty Ltd: Launches ₹900 Crore QIP for Debt Repayment and Land Acquisition",
            "Summary": "Marathon Nextgen Realty Ltd launched a QIP to raise ₹900 crore, offering shares at ₹555.12 each, a 12% discount. Funds will be used for subsidiary investment (₹160 crore), debt repayment (₹340 crore), land acquisition (₹300 crore), and general purposes. The company set a floor price of ₹584.34 per share with a possible 5% discount.",
            "Sentiment": "positive",
            "PublishDate": 1750736425000,
            "Source": "corporate_action"
        },
        {
            "Title": "Marathon Nextgen Realty Reports Decline in Q3 Financial Performance",
            "Summary": "Marathon Nextgen Realty has reported its Q3 consolidated financial results. The company's net profit decreased to 479 million rupees from 501 million rupees in the same quarter last year. Revenue also saw a significant decline, dropping to 1.23 billion rupees from 2.1 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1736813602000,
            "Source": "earnings"
        },
        {
            "Title": "Marathon Nextgen Realty Reports Decline in Q3 EBITDA",
            "Summary": "Marathon Nextgen Realty has reported a significant decrease in its Q3 EBITDA, which fell to 364 million rupees from 763 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 29.51% from 36.26% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1736765209000,
            "Source": "earnings"
        },
        {
            "Title": "Marathon Nextgen Realty Reports Decline in Q3 Financial Results",
            "Summary": "Marathon Nextgen Realty has announced its Q3 financial results. The company's consolidated net profit decreased to 479 million rupees from 501 million rupees year-over-year. Revenue also saw a significant drop, falling to 1.23 billion rupees from 2.1 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1736765202000,
            "Source": "earnings"
        },
        {
            "Title": "Marathon Nextgen Realty Reports Q2 Profit Growth and Approves Fund Raising Increase",
            "Summary": "Marathon Nextgen Realty announced its Q2 consolidated net profit of 484 million rupees, up from 343 million rupees year-over-year and 369 million rupees quarter-over-quarter. Q2 revenue increased to 1.5 billion rupees from 1.29 billion rupees year-over-year. The company also approved enhancing its fund-raising limit via Qualified Institutional Placement (QIP) to 10 billion rupees from the previous 5 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1731371587000,
            "Source": "result"
        },
        {
            "Title": "Marathon NextGen Realty Increases QIP Fund Raising Limit",
            "Summary": "Marathon NextGen Realty has approved an increase in its fund-raising limit through Qualified Institutional Placement (QIP) from 5 billion rupees to 10 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1731323214000,
            "Source": "corporate_action"
        },
        {
            "Title": "Marathon NextGen Realty Reports Q2 Financial Results",
            "Summary": "Marathon NextGen Realty has released its Q2 financial results. The company's EBITDA for the quarter was 424 million rupees, down from 483 million rupees in the same quarter last year. The EBITDA margin decreased to 29.06% from 37.43% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731321398000,
            "Source": "result"
        },
        {
            "Title": "Marathon Nextgen Realty Reports Q2 Revenue Increase",
            "Summary": "Marathon Nextgen Realty has reported a revenue of 1.5 billion rupees for the second quarter, compared to 1.29 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731321223000,
            "Source": "result"
        },
        {
            "Title": "Marathon NextGen Realty Reports Q2 Profit Increase",
            "Summary": "Marathon NextGen Realty has reported a consolidated net profit of 484 million rupees for the second quarter, showing a year-over-year increase from 343 million rupees and a quarter-over-quarter increase from 369 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1731321165000,
            "Source": "result"
        },
        {
            "Title": "Marathon NextGen Realty to Consider Increasing Fundraising Limit",
            "Summary": "Marathon NextGen Realty has scheduled a board meeting on November 11 to discuss the possibility of increasing their fundraising limit beyond 5 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1730900707000,
            "Source": "corporate_action"
        }
    ]
}