{
    "Symbol": "MARALOVER",
    "ISIN": "INE882A01013",
    "News": [
        {
            "Title": "Maral Overseas Limited Seeks Shareholder Approval for Independent Director Appointment via Postal Ballot",
            "Summary": "Maral Overseas Limited has issued a postal ballot notice seeking member approval for the appointment of Shri Suman Jyoti Khaitan (DIN: 00023370) as an Independent Director for a five-year term from November 4, 2025 to November 3, 2030. The e-voting period runs from November 21, 2025 (9:00 AM IST) to December 20, 2025 (5:00 PM IST), with results to be announced by December 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763631153472,
            "Source": "corporate_governance"
        },
        {
            "Title": "Maral Overseas Independent Director Archana Capoor Completes Second Term",
            "Summary": "Archana Capoor has completed her second term as Independent Director of Maral Overseas Limited and ceased to be Independent Director and member of committees effective November 5, 2025. Her tenure as Independent Director spanned five consecutive years from November 6, 2020 to November 5, 2025. The Board of Directors and Management expressed gratitude for her contributions, guidance, commitment and stewardship during her tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1762342363999,
            "Source": "corporate_governance"
        },
        {
            "Title": "Maral Overseas Reports Loss, Appoints New Independent Director and Defers Capex Plans",
            "Summary": "Maral Overseas Limited reported a net loss of ₹278.46 lakh for the quarter ended September 30, 2025, compared to a loss of ₹695.44 lakh in the same period last year. Revenue from operations declined to ₹24,970.26 lakh from ₹27,104.13 lakh year-on-year. For the half-year period, the company posted a loss of ₹1,535.44 lakh against ₹1,340.37 lakh in the previous year. The Board appointed Shri Suman Jyoti Khaitan as Additional Director (Non-Executive Independent) for a five-year term starting November 4, 2025, subject to shareholder approval. Due to financial constraints and operational priorities, the company has deferred its capex plan for replacement/modernization initiatives in Spinning and Engineering divisions, as well as capacity addition in Yarn Dyeing and Dyehouse-process fabric. However, the company is leasing critical machinery to improve efficiency in Fabric and Yarn divisions without disrupting production.",
            "Sentiment": "negative",
            "PublishDate": 1762256301225,
            "Source": "earnings"
        },
        {
            "Title": "Maral Overseas Reports Net Loss of ₹24.20 Crore in FY25, Revenue Grows 9.06%",
            "Summary": "Maral Overseas Limited, a vertically integrated textile manufacturer, reported a net loss of ₹24.20 crore for FY25 compared to ₹9.77 crore loss in FY24. Revenue from operations increased 9.06% to ₹1,047.03 crore from ₹960.06 crore in the previous year. The company's EBITDA declined to ₹45.22 crore from ₹59.75 crore in FY24. The textile industry faced challenges including economic slowdown in key global markets, reduced demand, and margin pressures. The company operates across three segments: yarn (51.77% of revenue), fabric (25.84%), and garments (22.39%). Maral commissioned a melange yarn unit that reached break-even by year-end and announced plans for capacity expansion and modernization across all business verticals.",
            "Sentiment": "negative",
            "PublishDate": 1754519908386,
            "Source": "corporate_action"
        },
        {
            "Title": "Maral Overseas Reports Quarterly Loss, Plans Preference Share Issue and MOA Changes",
            "Summary": "Maral Overseas Ltd reported a net loss of Rs 1,256.98 lakh for the quarter ended June 30, 2025, compared to a loss of Rs 644.83 lakh in the same quarter last year. Revenue from operations declined to Rs 22,549.59 lakh from Rs 25,092.28 lakh year-on-year. The company's Board approved the issuance of up to 30 lakh redeemable non-convertible cumulative preference shares at 9.25% annual interest rate, with a face value and issue price of Rs 100 each, to be offered to promoters and promoter groups on a private placement basis. The proposal requires shareholder approval at the Annual General Meeting scheduled for August 29, 2025. Additionally, the Board approved alterations to the company's Memorandum of Association to include electricity generation for captive consumption as a main business object, as required by Madhya Pradesh Electricity Regulatory Commission regulations. The company operates in three segments: yarn, fabric, and garments, with the garment segment reporting the highest losses during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754048490120,
            "Source": "earnings"
        },
        {
            "Title": "Maral Overseas Reports Q1 2025 Loss, Approves Preference Share Issuance and MOA Changes",
            "Summary": "Maral Overseas Limited reported a net loss of Rs 1,256.98 lakh for the quarter ended June 30, 2025, compared to a loss of Rs 644.83 lakh in the same quarter last year. Revenue from operations declined to Rs 22,549.59 lakh from Rs 25,092.28 lakh year-on-year. The company's board approved the issuance of up to 30 lakh redeemable non-convertible cumulative preference shares at 9.25% interest rate, with a face value and issue price of Rs 100 each, to be offered to promoters on a private placement basis. The board also approved alterations to the company's Memorandum of Association to include electricity generation for captive consumption as a main object, as required by Madhya Pradesh Electricity Regulatory Commission regulations. Both the preference share issuance and MOA changes are subject to shareholder approval at the Annual General Meeting scheduled for August 29, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1754047607587,
            "Source": "corporate_action"
        },
        {
            "Title": "Maral Overseas Schedules Board Meeting to Approve Quarterly Results and Fund Raising Proposal",
            "Summary": "Maral Overseas Limited has scheduled a Board of Directors meeting on August 1, 2025 to consider and approve unaudited financial results for the quarter ended June 30, 2025. The board will also evaluate a proposal for raising funds through private placement of redeemable non-convertible preference shares to the Promoter/Promoter Group, subject to statutory and regulatory approvals including shareholder approval where required. The company's trading window for share dealings will remain closed until August 3, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753375826727,
            "Source": "corporate_action"
        },
        {
            "Title": "Maral Overseas Reports Increased Q2 Net Loss",
            "Summary": "Maral Overseas reported a net loss of 70 million rupees in Q2, compared to a loss of 23 million rupees in the same quarter last year. The loss also increased from 64.5 million rupees in the previous quarter. The company has approved a capital expenditure plan of 306.6 million rupees in principle.",
            "Sentiment": "negative",
            "PublishDate": 1730765220000,
            "Source": "result"
        },
        {
            "Title": "Maral Overseas Approves 306.6 Million Rupee Capital Expenditure Plan",
            "Summary": "Maral Overseas has announced that its board has given in-principle approval for a capital expenditure plan worth 306.6 million rupees. This decision indicates the company's intent to invest in its infrastructure or operations, potentially for expansion or modernization purposes.",
            "Sentiment": "positive",
            "PublishDate": 1730725180000,
            "Source": "corporate_action"
        },
        {
            "Title": "Maral Overseas Reports Q2 Revenue Increase",
            "Summary": "Maral Overseas announced its Q2 revenue of 2.7 billion rupees, showing an increase from 2.45 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730723194000,
            "Source": "result"
        },
        {
            "Title": "Maral Overseas Reports Increased Q2 Net Loss",
            "Summary": "Maral Overseas reported a net loss of 70 million rupees for the second quarter, compared to a loss of 23 million rupees in the same period last year. This represents a significant year-over-year increase in losses. The company also saw its losses widen compared to the previous quarter, where it reported a loss of 64.5 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1730723183000,
            "Source": "result"
        }
    ]
}