{
    "Symbol": "MARINE",
    "ISIN": "INE01JE01028",
    "News": [
        {
            "Title": "Marine Electricals Wins ₹284.39 Cr Orders",
            "Summary": "Marine Electricals (India) secures significant orders worth ₹284.39 crore for power distribution systems across data center and marine projects with delivery timelines of 1-8 months.",
            "Sentiment": "positive",
            "PublishDate": 1769499094709,
            "Source": "co_actions_results"
        },
        {
            "Title": "Marine Electricals Secures ₹75.71 Crore Orders for Power Distribution Systems",
            "Summary": "Marine Electricals (India) Limited secured orders worth ₹75.71 crore (excluding taxes) for power distribution systems from STT Global, Udupi Cochin Shipyard, Indian Navy, and Tata Projects. The orders are scheduled for delivery over a period of 3 to 24 months, strengthening the company's order book across defense and industrial sectors.",
            "Sentiment": "positive",
            "PublishDate": 1763113840903,
            "Source": "order&deals"
        },
        {
            "Title": "Marine Electricals India Reports 29.6% Growth in Q2 Net Profit to 164.9M Rupees",
            "Summary": "Marine Electricals India reported consolidated net profit of 164.9 million rupees in Q2, up from 127.2 million rupees in the same quarter last year. Revenue increased to 2.22 billion rupees from 1.84 billion rupees year-over-year. EBITDA rose to 258.8 million rupees compared to 241.3 million rupees in the previous year. EBITDA margin remained stable at 11.65% versus 11.64% in the prior year quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762172845322,
            "Source": "earnings"
        },
        {
            "Title": "Marine Electricals Wins ₹29.68 Crore Order from Equinix India",
            "Summary": "Marine Electricals (India) has secured a ₹29.68 crore order from Equinix India for a power distribution system. The delivery is expected to be completed within seven months.",
            "Sentiment": "positive",
            "PublishDate": 1759827362194,
            "Source": "order&deals"
        },
        {
            "Title": "Marine Electricals (India) Secures ₹16.55 Crore Orders for Distribution Systems",
            "Summary": "Marine Electricals (India) has received orders worth ₹16.55 crores excluding taxes for data distribution system and power distribution system projects.",
            "Sentiment": "positive",
            "PublishDate": 1757663975671,
            "Source": "order&deals"
        },
        {
            "Title": "Marine Electricals (India) Reports Strong Q1 Growth with 63% Jump in Net Profit",
            "Summary": "Marine Electricals (India) delivered robust quarterly performance with consolidated net profit rising to 116 million rupees from 71 million rupees year-over-year. Revenue grew to 1.7 billion rupees compared to 1.38 billion rupees in the same period last year. The company's EBITDA increased to 169 million rupees from 133 million rupees, while EBITDA margin improved to 10.14% from 9.63% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1755013726852,
            "Source": "earnings"
        },
        {
            "Title": "Marine Electricals (India) Secures ₹19.35 Crore Order",
            "Summary": "Marine Electricals (India) has received a new order worth ₹19.35 crore. The company announced this business development, though specific details about the nature of the order, client, or delivery timeline were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1754890890322,
            "Source": "order&deals"
        },
        {
            "Title": "Marine Electricals Secures ₹14.33 Crore Order from Multiple Companies",
            "Summary": "Marine Electricals has obtained an order worth ₹14.33 crores from three companies: GRSE, Afcons Infra, and Core Greentech LLP. The news article does not provide further details about the nature of the order or the specific contributions of each company.",
            "Sentiment": "positive",
            "PublishDate": 1751875367000,
            "Source": "default"
        },
        {
            "Title": "Marine Electricals (India) Secures Order from Indian Navy",
            "Summary": "Marine Electricals (India) has received an order worth ₹57.1 million from the Indian Navy. The order details and specific purpose were not provided in the given information.",
            "Sentiment": "positive",
            "PublishDate": 1750070357000,
            "Source": "default"
        },
        {
            "Title": "Marine Electricals (India) Secures 604 Million Rupee Order",
            "Summary": "Marine Electricals (India) has received an order worth 604 million rupees. No further details about the nature of the order or the client were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1749687243000,
            "Source": "default"
        },
        {
            "Title": "Marine Electricals (India) Secures 604 Million Rupee Order",
            "Summary": "Marine Electricals (India) has obtained an order valued at 604 million rupees. The news briefly mentions the company's name and the order value without providing additional details about the nature of the order or its significance to the company.",
            "Sentiment": "positive",
            "PublishDate": 1749636552000,
            "Source": "default"
        },
        {
            "Title": "Marine Electricals (India) Secures Orders Worth ₹77 Crore",
            "Summary": "Marine Electricals (India) has received orders valued at ₹77 crore. No further details about the nature of the orders or the timeframe were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1748239382000,
            "Source": "default"
        },
        {
            "Title": "Marine Electricals (India) Secures ₹247.4 Million Order",
            "Summary": "Marine Electricals (India) has received a new order valued at ₹247.4 million (approximately $3 million USD). This order represents a significant business development for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1747109307000,
            "Source": "default"
        },
        {
            "Title": "Marine Electricals Secures 30.5 Crore Rupee Order",
            "Summary": "Marine Electricals has won a new order valued at 30.5 crore rupees (approximately $3.7 million USD). This represents a significant business development for the company, potentially boosting its revenue and order book.",
            "Sentiment": "positive",
            "PublishDate": 1746168789000,
            "Source": "default"
        },
        {
            "Title": "Marine Electrical Collaboration to Boost India's Maritime Defense",
            "Summary": "A collaboration has been announced to accelerate marine electrification and strengthen India's maritime defense sector. This partnership aims to enhance the country's capabilities in naval technology and defense preparedness through the development and implementation of advanced marine electrical systems.",
            "Sentiment": "positive",
            "PublishDate": 1741079581000,
            "Source": "corporate_action"
        },
        {
            "Title": "Danfoss India and CO Partner to Electrify India's Maritime Industry",
            "Summary": "Danfoss India has partnered with CO to advance the electrification of India's maritime sector. This collaboration aims to develop and implement electric solutions for marine applications, potentially revolutionizing the country's maritime industry by improving efficiency and reducing environmental impact.",
            "Sentiment": "positive",
            "PublishDate": 1741079536000,
            "Source": "corporate_action"
        },
        {
            "Title": "Marine Electricals (India) Secures Rs. 16 Crore Order from Blue Star Ltd",
            "Summary": "Marine Electricals (India) has been awarded a contract worth Rs. 16 crore (excluding taxes) by Blue Star Ltd. The order is for the supply of power distribution systems, indicating a significant business deal for Marine Electricals in the electrical equipment sector.",
            "Sentiment": "positive",
            "PublishDate": 1738676406000,
            "Source": "order&deals"
        },
        {
            "Title": "Marine Electricals Secures 8.6 Crore Rupee Order",
            "Summary": "Marine Electricals has won a new order valued at 8.6 crore rupees (approximately $1.04 million USD). This order represents a significant business opportunity for the company, potentially boosting its revenue and market position in the marine electrical equipment sector.",
            "Sentiment": "positive",
            "PublishDate": 1734944576000,
            "Source": "order&deals"
        },
        {
            "Title": "Marine Electricals Secures 51.3 Million Rupee Order for Radar Systems",
            "Summary": "Marine Electricals has received an order valued at 51.3 million rupees for the supply of navigational radar and COTS (Commercial Off-The-Shelf) I-band radar systems. This order represents a significant business opportunity for the company in the marine electronics sector.",
            "Sentiment": "positive",
            "PublishDate": 1730685668000,
            "Source": "corporate_action"
        },
        {
            "Title": "Marine Electricals Secures 51.3M Rupee Order for Radar Systems",
            "Summary": "Marine Electricals has received an order valued at 51.3 million rupees for the supply of navigational radar and COTS (Commercial Off-The-Shelf) I-Band radar systems.",
            "Sentiment": "positive",
            "PublishDate": 1730376627000,
            "Source": "normal_news"
        },
        {
            "Title": "Marine Electricals Secures 11 Crore Rupee Order",
            "Summary": "Marine Electricals has won a new order valued at 11 crore rupees (approximately $1.32 million USD). This represents a significant business development for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1729746286000,
            "Source": "corporate_action"
        }
    ]
}