{
    "Symbol": "MARICO",
    "ISIN": "INE196A01026",
    "News": [
        {
            "Title": "Marico EVP Akash Banerji Resigns for Entrepreneurial Venture",
            "Summary": "Marico Limited announces resignation of EVP & Head Digital Transformation Akash Banerji, effective May 31, 2026, as he pursues entrepreneurial opportunities outside the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1770882937489,
            "Source": "stocks"
        },
        {
            "Title": "Marico acquires 75% stake in Vietnam's Skinetiq",
            "Summary": "Marico's subsidiary MSEA to acquire 75% stake in Vietnamese skincare company Skinetiq for up to VND 750 billion (INR 261.6 crores), expanding D2C footprint in Vietnam's growing beauty market.",
            "Sentiment": "positive",
            "PublishDate": 1770643582564,
            "Source": "co_actions_results"
        },
        {
            "Title": "Marico Acquires 60% Stake in Cosmix Wellness",
            "Summary": "Marico announces strategic investment to acquire 60% stake in Cosmix Wellness from founders for ₹2.26 billion, marking significant expansion into wellness segment.",
            "Sentiment": "positive",
            "PublishDate": 1770209243860,
            "Source": "co_actions_results"
        },
        {
            "Title": "Marico Allots 20,639 Equity Shares Under ESOP 2016",
            "Summary": "Marico Limited allotted 20,639 equity shares under ESOP 2016 on February 3, 2026, increasing paid-up share capital from Rs. 1,29,80,87,659 to Rs. 1,29,81,08,298.",
            "Sentiment": "neutral",
            "PublishDate": 1770142480152,
            "Source": "co_actions_results"
        },
        {
            "Title": "Marico Completes 93.27% Stake Acquisition in 4700BC",
            "Summary": "Marico Limited successfully completed acquisition of 93.27% stake in Zea Maize Private Limited, owner of 4700BC brand, from PVR INOX Limited on January 29, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769692030179,
            "Source": "co_actions_results"
        },
        {
            "Title": "Marico Eyes Growth in International & Foods Business",
            "Summary": "Marico's international business targets sustained growth momentum while foods portfolio expects double-digit organic growth in upcoming quarters.",
            "Sentiment": "positive",
            "PublishDate": 1769570771350,
            "Source": "stocks"
        },
        {
            "Title": "Marico Sets Ambitious Digital Growth Targets",
            "Summary": "Marico expects continuous double-digit growth in hair oils segment while targeting INR 1,000+ crores ARR for digital portfolio by FY26 and double-digit EBITDA by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1769570564085,
            "Source": "stocks"
        },
        {
            "Title": "Marico Expects Sustained Volume Growth in India",
            "Summary": "Marico anticipates maintaining volume growth in India while price growth may decelerate. Operating profit growth expected to improve gradually due to lower input costs and reduced margin pressure.",
            "Sentiment": "positive",
            "PublishDate": 1769570536648,
            "Source": "stocks"
        },
        {
            "Title": "Marico announces intra-group restructuring plan",
            "Summary": "Marico Limited discloses voluntary liquidation of wholly owned subsidiary Zed Lifestyle Private Limited operating the Beardo brand as part of digital transformation strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1769511175138,
            "Source": "co_actions_results"
        },
        {
            "Title": "Marico Q3FY26 Results: Revenue Jumps 27% to ₹3,537 Cr",
            "Summary": "Marico Limited reported strong Q3FY26 performance with consolidated revenue rising 27% YoY to ₹3,537 crores. Net profit grew 13% to ₹460 crores, while nine-month revenue increased 27% to ₹10,278 crores.",
            "Sentiment": "positive",
            "PublishDate": 1769509816739,
            "Source": "co_actions_results"
        },
        {
            "Title": "Marico Q3FY26 earnings call rescheduled to Jan 27",
            "Summary": "Marico Limited has rescheduled its Q3FY26 investor conference call to January 27, 2026 at 6:30 p.m. IST, following board approval of financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768465643372,
            "Source": "co_actions_results"
        },
        {
            "Title": "Marico Q3FY26 Earnings Call Set for January 27, 2026",
            "Summary": "Marico Limited has scheduled an investor conference call for January 27, 2026, at 6:00 PM IST to discuss Q3FY26 financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767962637396,
            "Source": "co_actions_results"
        },
        {
            "Title": "Marico Sees ₹19.58 Cr NSE Block Trade at ₹761.50",
            "Summary": "Marico Ltd. witnessed a significant block trade on NSE worth ₹19.58 crores involving approximately 257,158 shares at ₹761.50 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767938578290,
            "Source": "co_actions_results"
        },
        {
            "Title": "Marico Sees ₹23.25 Cr NSE Block Trade at ₹761.35",
            "Summary": "Marico Ltd. witnessed a significant block trade on NSE worth ₹23.25 crores involving approximately 305,343 shares at a price of ₹761.35 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767846346452,
            "Source": "co_actions_results"
        },
        {
            "Title": "Marico Block Trade: ₹19.91 Cr Deal on NSE",
            "Summary": "Marico Ltd. witnessed a block trade on NSE worth ₹19.91 crores involving approximately 257,030 shares at ₹774.50 per share, indicating continued institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767759821395,
            "Source": "co_actions_results"
        },
        {
            "Title": "Marico Board Meet Set for Jan 27 for Q3FY26 Results",
            "Summary": "Marico Limited announces board meeting on January 27, 2026, to approve Q3FY26 financial results for quarter ended December 31, 2025. Trading window closed till January 29.",
            "Sentiment": "neutral",
            "PublishDate": 1767699496983,
            "Source": "co_actions_results"
        },
        {
            "Title": "Marico Reports High Twenties Revenue Growth in Q3",
            "Summary": "Marico delivered strong consolidated revenue growth in high twenties for Q3, with India business volume growth in high single digits. Company expects double-digit operating profit growth and improved gross margins.",
            "Sentiment": "positive",
            "PublishDate": 1767576808497,
            "Source": "co_actions_results"
        },
        {
            "Title": "Marico Q3FY26: High 20s Revenue Growth, Robust Momentum",
            "Summary": "Marico reports high twenties consolidated revenue growth in Q3FY26 with India business showing high single-digit volume growth and international business maintaining early twenties constant currency growth.",
            "Sentiment": "positive",
            "PublishDate": 1767349207086,
            "Source": "co_actions_results"
        },
        {
            "Title": "Marico Extends Satiya Nutraceuticals Acquisition by 12 Months",
            "Summary": "Marico has amended its agreement to extend the timeline for acquiring the remaining 40% stake in Satiya Nutraceuticals by 12 months, with the right now exercisable during FY28 instead of FY27.",
            "Sentiment": "neutral",
            "PublishDate": 1765976223353,
            "Source": "co_actions_results"
        },
        {
            "Title": "Marico Receives ESG Rating of 78 from NSE Sustainability, Achieves 'Leader' Category",
            "Summary": "Marico received an ESG rating of 78 for FY2025 from NSE Sustainability Ratings Analytics Limited, placing the company in the 'Leader' category based on its Environment, Social and Governance performance. The rating was independently determined without any engagement from Marico, as communicated by the SEBI registered ESG Rating Provider on December 9, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765352952870,
            "Source": "stock"
        },
        {
            "Title": "Marico Allots 63,494 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Marico Limited allotted 63,494 equity shares of Re. 1 each to eligible employees under its Employee Stock Option Plan 2016 following exercise of stock options. The allotment increased the company's paid-up share capital from Rs. 1,29,79,89,742 to Rs. 1,29,80,53,236, though the company clarified this allotment is not material in nature.",
            "Sentiment": "neutral",
            "PublishDate": 1764679531837,
            "Source": "corporate_action"
        },
        {
            "Title": "Marico Reports 7% India Volume Growth Despite GST Disruption, Targets Double-Digit EBITDA Growth in H2",
            "Summary": "Marico delivered 7% volume growth in India business despite September GST transition disruptions and unprecedented 60% pricing growth in Parachute due to copra inflation, with revenue growth hitting multi-quarter highs. The company expects double-digit EBITDA growth in the second half as copra prices have declined 15% from July peaks and anticipates further correction by March, while maintaining its Rs. 20,000 crore revenue target by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1763720637869,
            "Source": "earnings"
        },
        {
            "Title": "Marico Allots 54,074 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Marico Limited allotted 54,074 equity shares of Re. 1 each to eligible employees under its Employee Stock Option Plan 2016 on November 20, 2025. The allotment increased the company's paid-up share capital from Rs. 1,29,79,35,668 to Rs. 1,29,79,89,742, with the company clarifying that this allotment is not material in nature.",
            "Sentiment": "neutral",
            "PublishDate": 1763626828731,
            "Source": "corporate_action"
        },
        {
            "Title": "Marico CEO Targets 25% Growth To Cross Rs 20,000 Crore Revenue Mark",
            "Summary": "Marico CEO Saugata Gupta outlined plans to achieve 25% year-on-year topline growth in the first year of a five-year cycle, aiming to cross Rs 20,000 crore revenue with subsequent 11-12% CAGR. The company expects improved volume growth in the second half driven by softer input costs, particularly with copra prices falling 15% from peak, while targeting 200 basis points margin expansion and double-digit Ebitda growth.",
            "Sentiment": "positive",
            "PublishDate": 1763373078685,
            "Source": "stock"
        },
        {
            "Title": "Marico Q2FY26 Results: Revenue Surges 31% to Rs 3,482 Crore Despite Marginal PAT Decline",
            "Summary": "Marico reported quarterly results with consolidated PAT declining 0.7% to Rs 420 crore while revenue from operations jumped 30.7% to Rs 3,482 crore, driven by 7% domestic volume growth and 20% international business growth. The FMCG company announced a 3-year expansion plan to increase direct distribution reach from 1 million outlets to 1.5 million by FY27, with stock trading 1% higher at Rs 729.55 following the results.",
            "Sentiment": "positive",
            "PublishDate": 1763110415292,
            "Source": "earnings"
        },
        {
            "Title": "Marico Reports 7% Growth in Domestic Sales Volume",
            "Summary": "Marico achieved a 7% increase in domestic sales volume in its latest results. The growth indicates improved performance in the company's home market operations.",
            "Sentiment": "neutral",
            "PublishDate": 1763105980376,
            "Source": "earnings"
        },
        {
            "Title": "Marico Appoints PHD India as New Integrated Media Agency Partner",
            "Summary": "Marico Limited has selected Omnicom Media Group's PHD India as its Agency of Record for integrated media mandate following a multi-agency pitch process. PHD India will handle end-to-end media strategy, planning, and buying for Marico's brand portfolio including Parachute, Parachute Advansed, Saffola, Nihar, Livon, SetWet, Beardo, JustHerbs, and TrueElements. The partnership aims to strengthen Marico's position as a digitally empowered consumer company while focusing on brand-building and consumer engagement across contemporary channels. Marico acknowledged Madison Media as their previous long-trusted partner. The appointment represents one of the largest FMCG mandates for PHD India's growing portfolio. Marico recorded a turnover of USD 1.3 billion and touches the lives of 1 out of every 3 Indians through its brand portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1762422334960,
            "Source": "stock"
        },
        {
            "Title": "Marico Chairman Reflects on Workplace Culture Evolution from 'Sir ji' to First-Name Basis",
            "Summary": "Marico Chairman Harsh Mariwala shared his observations on changing workplace culture in Indian offices through a LinkedIn post. He noted that when he started Marico, the workplace operated on a 'Sir ji' culture where questioning decisions was seen as defiance and employees simply listened and executed orders. Over time, newer generations brought confidence and openness, asking questions and addressing seniors by first names rather than formal titles. The 74-year-old chairman said he initially needed time to adjust but now welcomes this shift, viewing it as progress rather than disrespect. Mariwala emphasized that true leadership involves creating environments where people feel heard, valued, and trusted to challenge ideas. His social media post received significant engagement, with over 430 comments on LinkedIn and mixed reactions from users - some praising his mindset while others defended traditional Indian workplace customs. Mariwala founded Marico in 1990, which became a leading FMCG company with brands like Parachute, Saffola and Set Wet.",
            "Sentiment": "positive",
            "PublishDate": 1762002523590,
            "Source": "stock"
        },
        {
            "Title": "Marico Ltd. Sees Rs. 56.06 Crore Block Trade on NSE",
            "Summary": "Marico Ltd. witnessed a block trade worth Rs. 56.06 crores on the National Stock Exchange. The transaction involved approximately 778,392 shares executed at a price of Rs. 720.25 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1761636826166,
            "Source": "order&deals"
        },
        {
            "Title": "Marico to Acquire Remaining 46.02% Stake in HW Wellness Solutions",
            "Summary": "Marico plans to purchase the remaining 46.02% stake in HW Wellness Solutions. This acquisition will give Marico complete ownership of the wellness company.",
            "Sentiment": "positive",
            "PublishDate": 1760703092090,
            "Source": "order&deals"
        },
        {
            "Title": "Marico Completes Voluntary Liquidation of Bangladesh Subsidiary MBL Industries Limited",
            "Summary": "Marico Limited has completed the voluntary liquidation of MBL Industries Limited, its wholly-owned step-down subsidiary in Bangladesh. The liquidation became effective September 18, 2025, following a Winding Up Certificate issued by the Registrar of Joint Stock Companies and Firms, Bangladesh. MBL Industries had been dormant since 2009 and reported nil turnover as of February 15, 2025, with an income loss of BDT 1,658,191 and net worth of BDT 2,602,940. The subsidiary was wholly-owned by Marico Middle East FZE. Marico received the winding up order on October 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760352513313,
            "Source": "corporate_action"
        },
        {
            "Title": "Marico Reports Strong Q2 Revenue Growth in Thirties, Expects Festive Season Boost",
            "Summary": "Marico Ltd announced consolidated revenue growth in the thirties year-on-year for the September quarter, driven by resilient international performance and benefits from GST rate cuts affecting parts of its India business. The company projected modest operating profit growth on a year-on-year basis. Demand trends remained stable throughout most of the quarter, with the company expecting sentiment to improve during the festive season. Around 30% of Marico's India business benefited from GST rationalization, while its foods and premium personal care segments continued accelerated scale-up. The international business maintained robust momentum with constant currency growth in the twenties.",
            "Sentiment": "positive",
            "PublishDate": 1759489017857,
            "Source": "earnings"
        },
        {
            "Title": "Marico Completes Internal Restructuring Through Apco Naturals Voluntary Liquidation",
            "Summary": "Marico has completed an internal restructuring involving the voluntary liquidation of Apco Naturals. The business consolidation will become effective from October 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1759306930557,
            "Source": "corporate_action"
        },
        {
            "Title": "Marico Completes Income Tax Survey at Offices and Manufacturing Sites",
            "Summary": "Marico has completed an income tax survey conducted at its offices and manufacturing sites. The company stated that it fully cooperated with the survey process and indicated that no additional updates are needed regarding the matter.",
            "Sentiment": "neutral",
            "PublishDate": 1758776131547,
            "Source": "stock"
        },
        {
            "Title": "Marico Limited Shareholders Approve Bhaskar Bhat's Appointment as Independent Director",
            "Summary": "Marico Limited announced that shareholders have approved the appointment of Mr. Bhaskar Bhat (DIN: 00148778) as an Independent Director through a postal ballot conducted via remote e-voting. The special resolution was passed with overwhelming support, receiving 99.88% votes in favor from a total of 1,18,93,83,541 votes polled, representing 91.64% of outstanding shares. The remote e-voting process ran from August 24, 2025, to September 22, 2025. Mr. Bhat's appointment will be effective from October 1, 2025. The promoter and promoter group voted 100% in favor, while public institutions showed 99.67% support and public non-institutions recorded 94.60% approval. The scrutinizer's report confirmed no invalid or abstained votes were cast.",
            "Sentiment": "positive",
            "PublishDate": 1758635124756,
            "Source": "corporate_action"
        },
        {
            "Title": "Income Tax Officials Conduct Survey at Marico Offices",
            "Summary": "Income tax officials have conducted a survey at Marico's offices. The consumer goods company is subject to this tax department action.",
            "Sentiment": "negative",
            "PublishDate": 1758083449468,
            "Source": "stock"
        },
        {
            "Title": "Marico to Acquire Remaining 46% Stake in True Elements Owner for Rs 138 Crores",
            "Summary": "Marico Limited has entered into a definitive agreement to acquire the remaining 46.02% stake in HW Wellness Solutions Private Limited for up to Rs 138 crores in cash. HW Wellness owns the 'True Elements' brand and operates in the packaged foods industry as a digital-first brand in healthy breakfast and snacking categories. Marico previously acquired 53.98% of HW Wellness in May 2022, making it a subsidiary. The acquisition will increase Marico's stake from 53.98% to 100%, making HW Wellness a wholly-owned subsidiary. The transaction is expected to complete by September 30, 2025. HW Wellness, incorporated in 2013 and headquartered in Pune, reported turnover of Rs 164.38 crores in FY 2024-25, up from Rs 76.42 crores in FY 2023-24 and Rs 57.40 crores in FY 2022-23.",
            "Sentiment": "positive",
            "PublishDate": 1757594239125,
            "Source": "corporate_action"
        },
        {
            "Title": "Marico Launches Parachute Advanced Olive-Infused Coconut Hair Oil",
            "Summary": "Marico has introduced a new product called Parachute Advanced Olive-Infused Coconut Hair Oil. The product combines coconut hair oil with olive benefits for hair care purposes.",
            "Sentiment": "positive",
            "PublishDate": 1757398996314,
            "Source": "stock"
        },
        {
            "Title": "Marico Expects Food Business to Overtake Edible Oil Revenue Within Four Years",
            "Summary": "Marico's Managing Director Saugata Gupta announced that the company's food business, operating under the Saffola brand, is expected to surpass its edible oil vertical within three to four years. The food business crossed Rs 900 crore in fiscal 2025, contributing 11% to domestic business with 33% growth, while edible oils contributed 19% with low single-digit volume growth. Marico operates food brands including Saffola oats, honey, snacks, True Elements, and Plix. The company targets 25% growth in the food segment, focusing on expanding products like oats, masala oats, honey, muesli, and Saffola Crunchiez snacks. Marico's consolidated revenue exceeded Rs 10,000 crore in fiscal 2025, with standalone revenue at Rs 7,581 crore. The company aims to reach Rs 20,000 crore revenue by 2030 through a 13% compound annual growth rate, requiring core business to deliver high single digits, diversified business to grow 20% plus, and international business to achieve double-digit growth.",
            "Sentiment": "positive",
            "PublishDate": 1755283837861,
            "Source": "stock"
        },
        {
            "Title": "Marico Appoints Bhaskar Bhat as Independent Director for Five-Year Term",
            "Summary": "Marico Limited appointed Bhaskar Bhat as an Additional Director in the capacity of Independent Director for a five-year term from October 1, 2025 to September 30, 2030. The appointment was approved by the Board of Directors on August 13, 2025, based on the recommendation of the Nomination and Remuneration Committee. The appointment is subject to shareholder approval through a postal ballot process. Bhat has over four decades of corporate experience and was previously Managing Director of Titan Company Limited from April 2002 until his retirement in September 2019. Under his leadership, Titan expanded its portfolio to include eyewear, accessories, fragrances and sarees, with the company's market cap reaching $13 billion in 2019. Bhat is a graduate of IIT Madras in Mechanical Engineering and holds a PGDBM from IIM Ahmedabad. He currently serves as Independent Chairman of Kansai Nerolac Paints Limited and as Independent Director of Metro Brands Limited, Lucas TVS Limited and Orange County Resorts & Hotels Limited.",
            "Sentiment": "positive",
            "PublishDate": 1755092905484,
            "Source": "corporate_governance"
        },
        {
            "Title": "Marico Targets Double-Digit Growth in Next Two Quarters with 25% Annual Revenue Growth Plan",
            "Summary": "Marico has announced its growth targets, aiming for double-digit growth in the next two quarters. The company has planned a 25% revenue growth for the year.",
            "Sentiment": "positive",
            "PublishDate": 1754883522021,
            "Source": "stock"
        },
        {
            "Title": "Marico Limited Reports Strong Q1 FY26 Results with 19% Revenue Growth",
            "Summary": "Marico Limited published its consolidated financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 3,259 crore compared to Rs 2,730 crore in the same quarter last year, marking a 19.4% increase. Net profit attributable to owners increased to Rs 504 crore from Rs 343 crore year-on-year. Profit before tax rose to Rs 656 crore from Rs 441 crore in the corresponding quarter. Basic earnings per share improved to Rs 3.90 from Rs 2.65 in the previous year quarter. The Board of Directors approved these results on August 4, 2025, and they were published in newspapers including Financial Express, Free Press Journal, and Navshakti on August 5, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754392365123,
            "Source": "earnings"
        },
        {
            "Title": "Marico Reports 23% Revenue Growth in Q1 with Mixed Brokerage Reactions",
            "Summary": "Marico Ltd. reported revenue growth of 23.3% to Rs 3,259 crore in its quarterly results. The company's net profit reached Rs 343 crore during the January-March period, slightly above analyst estimates of Rs 336.7 crore, compared to Rs 318 crore in the year-ago period. Despite strong revenue performance, the company experienced margin contraction due to high-cost inflation in inputs. Brokerage firms showed mixed reactions: Jefferies maintained a Buy rating and raised target price to Rs 850 from Rs 800, citing industry-leading volume growth. Goldman Sachs also maintained Buy with target price increased to Rs 800 from Rs 780, highlighting strong volume growth acceleration to 9% and positive turnaround in VAHO business. However, Morgan Stanley remained cautious with an Equal-weight rating and Rs 674 target price due to margin miss and short-term margin challenges. The company achieved 9% volume growth, reported as the highest among FMCG peers, with management expressing confidence in demand outlook and growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1754364303841,
            "Source": "earnings"
        },
        {
            "Title": "Marico Sets Ambitious Growth Targets: Rs 20,000 Crore Revenue Goal in 5 Years",
            "Summary": "Marico has outlined aggressive growth targets during a conference call. The company aims to reach Rs 20,000 crores in revenue over the next 5 years. For FY26 specifically, Marico is targeting around 25% revenue growth and high single-digit volume growth as a base case, with potential for double-digit growth in some quarters. The company's digital-first portfolio is expected to achieve 2.5x of FY24 ARR by FY27, maintaining double-digit EBITDA margins. Marico expressed confidence in delivering double-digit profit CAGR over the next 2 years.",
            "Sentiment": "positive",
            "PublishDate": 1754364236545,
            "Source": "stock"
        },
        {
            "Title": "Marico Expects Consistent Growth and Double-Digit EBITDA Margin by FY27",
            "Summary": "Marico anticipates consistent growth in its main business areas despite rising input costs. The company expects a gradual uptick in overall demand patterns in the coming quarters, supported by easing inflation levels, favorable monsoon season, and continued policy support. Marico plans to achieve double-digit EBITDA margin by FY27 while maintaining continued volume and revenue growth throughout the year alongside profit growth despite higher input costs.",
            "Sentiment": "positive",
            "PublishDate": 1754297644409,
            "Source": "stock"
        },
        {
            "Title": "Marico Reports Mixed Q1 Results with Revenue Growth but Margin Decline",
            "Summary": "Marico reported Q1 consolidated net profit of 5.04 billion rupees, up from 4.6 billion rupees year-over-year, exceeding estimates of 4.95 billion rupees. Revenue increased to 32.6 billion rupees from 26.4 billion rupees year-over-year, slightly below estimates of 32.70 billion rupees. EBITDA rose to 6.56 billion rupees from 6.3 billion rupees year-over-year but fell short of estimates of 6.64 billion rupees. However, EBITDA margin compressed to 20.1% from 23.69% year-over-year, missing estimates of 20.30%.",
            "Sentiment": "neutral",
            "PublishDate": 1754296193350,
            "Source": "earnings"
        },
        {
            "Title": "Marico Q1 Results Preview: Analysts Expect 21% Revenue Growth Driven by Parachute and Saffola",
            "Summary": "Marico Ltd. is set to announce its quarterly financial results on Monday. Analysts remain optimistic about the company's performance, with Bloomberg estimates projecting revenue growth of 21% to Rs 3,198 crore and net profit increase of 3% to Rs 488 crore. EBITDA is expected to rise 4% to Rs 650.6 crore with margins at 20.3%. Multiple brokerages including Nuvama, HSBC, and Emkay Global maintain 'Buy' ratings with target prices ranging from Rs 810-820. Growth is expected to be driven by the hair oil and edible oil segments, particularly Parachute coconut oil and Saffola edible oils. Parachute oil sales are projected to grow 26% annually according to Nuvama, while Emkay expects 29% growth for Parachute with 33% price growth. However, margin pressure may persist due to elevated copra prices. The overall FMCG demand environment is showing signs of recovery, with Marico being a top pick among brokerages in the consumer sector.",
            "Sentiment": "positive",
            "PublishDate": 1754225346667,
            "Source": "earnings"
        },
        {
            "Title": "Marico Founder Harsh Mariwala Advocates for CEO Tenure Limits of 10-15 Years",
            "Summary": "Harsh Mariwala, founder of consumer goods company Marico, has expressed his belief that CEOs should change every 10-15 years. Mariwala, described as the 'man ahead of time' and a lifelong learner, has been known for challenging business conventions while leading the multinational consumer goods company. Marico operates marquee brands including Saffola and Parachute among others.",
            "Sentiment": "neutral",
            "PublishDate": 1753349954770,
            "Source": "stock"
        },
        {
            "Title": "Marico Targets Significant Growth in Digital-First Portfolio",
            "Summary": "Marico expects its digital-first portfolio to grow 2.5 times by FY27 compared to its FY24 exit run-rate. The company is focusing on expanding its digital presence and product offerings.",
            "Sentiment": "positive",
            "PublishDate": 1752241532000,
            "Source": "default"
        },
        {
            "Title": "Marico Targets 200 Billion Rupee Revenue by 2030",
            "Summary": "According to Marico's annual report, the company has set a revenue goal of 200 billion rupees to be achieved by 2030. This target represents a significant growth ambition for the company over the coming years.",
            "Sentiment": "positive",
            "PublishDate": 1752241283000,
            "Source": "default"
        }
    ]
}