{
    "Symbol": "MARKSANS",
    "ISIN": "INE750C01026",
    "News": [
        {
            "Title": "Marksans Pharma Q3 FY26 Revenue Hits All-Time High",
            "Summary": "Marksans Pharma reported record Q3 FY26 operating revenue of INR 754.4 crores, up 10.6% YoY, with EBITDA growing 23.2% to INR 160.7 crores and margins expanding to 21.3%.",
            "Sentiment": "positive",
            "PublishDate": 1770893220722,
            "Source": "co_actions_results"
        },
        {
            "Title": "Marksans Pharma Q3 Net Profit Rises 7.6% YoY",
            "Summary": "Marksans Pharma reported consolidated net profit of ₹1.13 billion in Q3, marking a 7.6% increase from ₹1.05 billion in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1770278931323,
            "Source": "co_actions_results"
        },
        {
            "Title": "Marksans Pharma Expands Global Footprint",
            "Summary": "Marksans Pharma establishes two fully owned subsidiaries in Ireland and Canada to strengthen its international pharmaceutical operations and market presence.",
            "Sentiment": "positive",
            "PublishDate": 1769504151125,
            "Source": "stocks"
        },
        {
            "Title": "Marksans Pharma Q3FY26 Earnings Call on Feb 6",
            "Summary": "Marksans Pharma has scheduled its Q3FY26 earnings conference call for February 6, 2026, at 4:00 PM IST to discuss unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769081116051,
            "Source": "co_actions_results"
        },
        {
            "Title": "Marksans Pharma Reports Strong Q2 Recovery with 16% Sequential Revenue Growth",
            "Summary": "Marksans Pharma delivered robust quarterly results with revenue growing 16% sequentially to Rs. 720.4 crores, driven by improved demand across key markets and new product launches in digestive health and pain management. The company's EBITDA and PAT surged 44% and 70% quarter-on-quarter respectively, while its Unit 2 facility successfully completed US FDA inspection with zero observations, strengthening its compliance standards.",
            "Sentiment": "positive",
            "PublishDate": 1763707832359,
            "Source": "stock"
        },
        {
            "Title": "Marksans Pharma Subsidiary Receives US FDA Approval for Anti-Diarrheal Medication",
            "Summary": "Marksans Pharma Limited's wholly owned subsidiary Marksans Pharma Inc. received final US FDA approval for Loperamide Hydrochloride Tablets USP, 2mg (OTC), an anti-diarrheal medication. The approved product is bioequivalent to Kenvue Brands LLC's reference listed drug Imodium A-D Tablets, 2mg, expanding the company's generic pharmaceutical portfolio in the US market.",
            "Sentiment": "positive",
            "PublishDate": 1763531736790,
            "Source": "stock"
        },
        {
            "Title": "Marksans Pharma's UK Subsidiary Receives MHRA Approval for Pain-Relief Tablets",
            "Summary": "Marksans Pharma's UK subsidiary Relonchem Limited received MHRA authorization to market Mefenamic Acid Film-Coated Tablets in 250mg and 500mg strengths for pain relief. The approval expands the Mumbai-based company's UK generics market presence, with shares climbing to ₹198.99 following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1763377898671,
            "Source": "stock"
        },
        {
            "Title": "Marksans Pharma Sets Ambitious Growth Targets with $300M US Order Book Goal",
            "Summary": "Marksans Pharma management outlined strategic growth targets including a $300 million order book for the US market within the next couple of years and revenue goals of INR 5,000 crores over 5-7 years. The company expects EBITDA margins for FY26 to reach 19-20% or higher, with UK business performance anticipated to improve in Q3 FY26 compared to Q2 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1763217342570,
            "Source": "stock"
        },
        {
            "Title": "Marksans Pharma Reports Strong Q2FY26 Performance with 16% Sequential Revenue Growth",
            "Summary": "Marksans Pharma achieved revenue of ₹720.4 crores in Q2FY26, growing 16% quarter-on-quarter and 12% year-on-year, driven by robust demand across US, UK, and Australia markets with strong traction from new product launches. The company's EBITDA grew 44% sequentially to ₹144.5 crores with improved margins at 20.1%, while net profit surged 70% quarter-on-quarter to ₹99.1 crores, reflecting operational leverage benefits and strong market momentum.",
            "Sentiment": "neutral",
            "PublishDate": 1763069291590,
            "Source": "earnings"
        },
        {
            "Title": "Marksans Pharma Outlines Multi-Year Growth Strategy with Facility Expansion and R&D Focus",
            "Summary": "Marksans Pharma has outlined a multi-year growth strategy driven by U.S. and EU generics, including expansion of Goa and UK facilities for oral solid dosage and integration of Teva's Goa unit to strengthen manufacturing scale. The company plans R&D investments to launch 20+ products over 2 years while focusing on margin expansion through backward integration.",
            "Sentiment": "positive",
            "PublishDate": 1763052203616,
            "Source": "stock"
        },
        {
            "Title": "Marksans Pharma's Goa Facility Clears FDA Inspection Without Form 483 Issues",
            "Summary": "Marksans Pharma's Goa manufacturing facility successfully completed an FDA inspection with no Form 483 issues identified. The clean inspection outcome demonstrates the company's adherence to quality standards and regulatory compliance requirements.",
            "Sentiment": "positive",
            "PublishDate": 1762757043933,
            "Source": "stock"
        },
        {
            "Title": "Marksans Pharma's UK Subsidiary Receives Marketing Authorization for Exemestane Tablets",
            "Summary": "Marksans Pharma Limited announced that its wholly owned subsidiary Relonchem Limited in the UK has received Marketing Authorization for its product Exemestane 25mg film-coated tablets from UK MHRA. Marksans Pharma is a Mumbai-based company engaged in research, manufacturing and marketing of generic pharmaceutical formulations in global markets. The company has manufacturing facilities in India, USA and UK that are approved by regulatory agencies including US FDA, UK MHRA and Australian TGA. Its product portfolio covers major therapeutic segments including CVS, CNS, Anti-diabetic, Pain Management, Gastroenterological and Anti-allergies.",
            "Sentiment": "positive",
            "PublishDate": 1762314379353,
            "Source": "stock"
        },
        {
            "Title": "Marksans Pharma Subsidiary Secures UK Regulatory Approval for Clonidine Tablets",
            "Summary": "Marksans Pharma announced that its subsidiary has received approval from UK regulatory authorities for Clonidine tablets. This approval allows the subsidiary to market and distribute the pharmaceutical product in the UK market.",
            "Sentiment": "positive",
            "PublishDate": 1760516865940,
            "Source": "stock"
        },
        {
            "Title": "Marksans Pharma's UK Subsidiary Receives Approval for Moxonidine Tablets",
            "Summary": "Marksans Pharma's UK subsidiary, Relonchem Limited, has received approval for its Moxonidine tablets in 200 and 400 microgram dosages. This regulatory approval allows the subsidiary to market these pharmaceutical products in the UK market.",
            "Sentiment": "positive",
            "PublishDate": 1758617066388,
            "Source": "stock"
        },
        {
            "Title": "Marksans Pharma Reports 5% Revenue Growth Amid Mixed Regional Performance",
            "Summary": "Marksans Pharma reported revenue growth of 5% year-over-year to INR 620 crores in their quarterly results. The U.S. market showed strong performance with 30.6% growth, while the U.K. market declined 20% due to significant pricing pressure, particularly in the Rx segment. Gross margins expanded by 209 basis points to 57.8% due to lower input costs, but EBITDA margins declined to 16.1% due to higher employee costs and one-time provisions. The company has a U.S. order book of $220 million, with $45-50 million to be executed starting October. Capacity utilization at the Teva facility improved from INR 400 crores to INR 500 crores. Management expects Q2 to perform better than Q1 and anticipates being close to but possibly short of their INR 3,000 crore revenue target for the fiscal year. The company is exploring organic expansion into Germany and other European markets, as well as potentially entering the Indian market.",
            "Sentiment": "neutral",
            "PublishDate": 1755596488243,
            "Source": "earnings"
        },
        {
            "Title": "Marksans Pharma's UK Unit Relonchem Limited Receives Product Approval",
            "Summary": "Marksans Pharma announced that its UK subsidiary, Relonchem Limited, has received approval for its products. The approval represents a regulatory milestone for the pharmaceutical company's international operations.",
            "Sentiment": "positive",
            "PublishDate": 1755499812751,
            "Source": "stock"
        },
        {
            "Title": "Marksans Pharma Expects to Fall Short of FY26 Revenue Target, Maintains Strong US Order Book",
            "Summary": "Marksans Pharma management indicated they will likely fall slightly short of their Rs 3,000 crores revenue target for FY26. The company expects UK market revenue to remain flat and margins for the current year to be between last year's levels and 17%. The company holds a US order book valued at USD 220 million, with USD 45-50 million in orders scheduled for execution between October and December, pending artwork and approvals. During Q1 FY26, Marksans received 3 regulatory approvals from US FDA and UK MHRA and launched 4 high-margin liquid products in the UK. Management declined to provide guidance for FY27.",
            "Sentiment": "neutral",
            "PublishDate": 1755142775045,
            "Source": "stock"
        },
        {
            "Title": "Marksans Pharma Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "Marksans Pharma announced its Q1 financial results showing revenue growth to 6.2 billion rupees from 5.9 billion rupees year-over-year. However, the company's consolidated net profit declined to 583 million rupees compared to 888 million rupees in the same period last year. EBITDA decreased to 1 billion rupees from 1.3 billion rupees year-over-year, with EBITDA margin compressing to 16.15% from 21.72% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754985291560,
            "Source": "earnings"
        },
        {
            "Title": "Marksans Pharma Subsidiary Receives USFDA Approval for Omeprazole Tablets",
            "Summary": "Marksans Pharma announced that its subsidiary has received USFDA approval for 20 MG Omeprazole Delayed-Release Tablets. This regulatory approval allows the subsidiary to manufacture and market this pharmaceutical product in the US market.",
            "Sentiment": "positive",
            "PublishDate": 1754629929919,
            "Source": "stock"
        },
        {
            "Title": "Marksans Pharma Re-appoints Mark Saldanha as Managing Director for Five-Year Term",
            "Summary": "Marksans Pharma Limited's Board of Directors has re-appointed Mark Saldanha as Managing Director for a five-year term beginning October 6, 2025. The appointment is subject to shareholder approval at the upcoming Annual General Meeting. Saldanha, who has over 24 years of experience in production, marketing and finance, is described as the principal architect of the company's success and progress. He is related to Mrs. Sandra Saldanha and his position will not be subject to retirement by rotation.",
            "Sentiment": "positive",
            "PublishDate": 1753446242160,
            "Source": "corporate_governance"
        },
        {
            "Title": "Marksans Pharma: Subsidiary Receives EIR from USFDA for New York Facility",
            "Summary": "Marksans Pharma's subsidiary, Time-Cap Laboratories, received an Establishment Inspection Report from USFDA for its New York facility following a GMP inspection in April 2025. The company's shares gained 4.5% on June 30.",
            "Sentiment": "positive",
            "PublishDate": 1751272403000,
            "Source": "normal_news"
        },
        {
            "Title": "Marksans Pharma Receives EIR from USFDA for Time-Cap Laboratories Facility",
            "Summary": "Marksans Pharma has received an Establishment Inspection Report (EIR) from the U.S. Food and Drug Administration (USFDA) following an inspection of the manufacturing facility at Time-Cap Laboratories, Inc. The EIR indicates the completion of the FDA inspection process.",
            "Sentiment": "positive",
            "PublishDate": 1751266703000,
            "Source": "default"
        },
        {
            "Title": "Marksans Pharma: UK Subsidiary Gains Approval for Overactive Bladder Drug",
            "Summary": "Marksans Pharma's UK subsidiary, Relonchem Ltd, received marketing authorization from the UK Medicines and Healthcare Products Regulatory Agency for Oxybutynin hydrochloride oral solution (2.5mg/5ml), used to treat overactive bladder symptoms.",
            "Sentiment": "positive",
            "PublishDate": 1750325732000,
            "Source": "normal_news"
        },
        {
            "Title": "Marksans Pharma's Unit Receives UK Approval for Oxybutynin Hydrochloride Oral Solution",
            "Summary": "Marksans Pharma has announced that its unit has obtained approval from the UK regulatory authority for Oxybutynin Hydrochloride Oral Solution. This medication is used to treat certain bladder and urinary conditions. The approval allows the company to market and distribute this pharmaceutical product in the United Kingdom.",
            "Sentiment": "positive",
            "PublishDate": 1750304634000,
            "Source": "default"
        },
        {
            "Title": "Marksans Pharma: Block Deals Worth ₹257 Crore Executed",
            "Summary": "Block deals involving 1.02 crore shares of Marksans Pharma Ltd. were executed at an average price of ₹250 per share, totaling ₹257 crore. OrbiMed Asia IV Mauritius FVCI Ltd reportedly intended to sell a 2.27% stake in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1749612698000,
            "Source": "block_deals"
        },
        {
            "Title": "Marksans Pharma: OrbiMed to Sell 2.27% Stake in Block Deal",
            "Summary": "OrbiMed Asia IV Mauritius FVCI Ltd is launching a block deal to sell 2.27% stake in Marksans Pharma Ltd for ₹256.8 crore. The floor price is set at ₹249.95 per share. This comes after Marksans Pharma's subsidiary recently secured UK regulatory approval for a diabetes treatment drug.",
            "Sentiment": "neutral",
            "PublishDate": 1749582812000,
            "Source": "block_deals"
        },
        {
            "Title": "Marksans Pharma: UK Regulator Approves Subsidiary's Diabetes Medication",
            "Summary": "Marksans Pharma's subsidiary Relonchem Ltd received marketing authorization from UK MHRA for Metformin Hydrochloride oral solution (500 mg/5 ml) to treat high blood sugar levels. This approval expands Marksans Pharma's presence in the UK anti-diabetic market.",
            "Sentiment": "positive",
            "PublishDate": 1748585686000,
            "Source": "corporate_action"
        },
        {
            "Title": "Marksans Pharma's UK Unit Receives Marketing Authorization for Metformin Solution",
            "Summary": "Relonchem Limited, a UK-based unit of Marksans Pharma, has received marketing authorization for Metformin Hydrochloride 500 mg/5ml Oral Solution. This approval allows the company to market and sell this specific formulation of the diabetes medication in the UK.",
            "Sentiment": "positive",
            "PublishDate": 1748576610000,
            "Source": "default"
        },
        {
            "Title": "Marksans Pharma Reports Q4 Financial Results",
            "Summary": "Marksans Pharma announced its Q4 financial results. The company's EBITDA increased to 1.26 billion rupees from 1.09 billion rupees year-over-year. However, the EBITDA margin decreased to 17.74% from 19.58% compared to the same period last year. The consolidated net profit rose to 906 million rupees from 783 million rupees year-over-year, and from 1.05 billion rupees quarter-over-quarter. Revenue for Q4 increased to 7.1 billion rupees from 5.6 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747665747000,
            "Source": "result"
        },
        {
            "Title": "Marksans Pharma: UK Subsidiary Receives Approval for Sennosides Tablets",
            "Summary": "Marksans Pharma's UK subsidiary, Relonchem Limited, received market authorization for Sennosides 7.5 mg tablets from the UK Medicines and Healthcare Products Regulatory Agency. The company's shares gained over 6% following the news. Relonchem also recently received approval for Gabapentin oral solution.",
            "Sentiment": "positive",
            "PublishDate": 1747645003000,
            "Source": "corporate_action"
        },
        {
            "Title": "Marksans Pharma Unit Receives UK Marketing Authorization for Sennosides Tablets",
            "Summary": "Marksans Pharma announced that its unit has received marketing authorization from the UK Medicines & Healthcare Products Regulatory Agency for Sennosides 7.5 mg Tablets.",
            "Sentiment": "positive",
            "PublishDate": 1747641224000,
            "Source": "default"
        },
        {
            "Title": "Marksans Pharma: UK Subsidiary Gains Approval for Epilepsy Drug",
            "Summary": "Marksans Pharma's UK subsidiary Relonchem Ltd received marketing authorization from UKMHRA for Gabapentin oral solution, used to treat nerve pain and epilepsy. This expands the company's CNS product portfolio in UK and European markets.",
            "Sentiment": "positive",
            "PublishDate": 1747301021000,
            "Source": "corporate_action"
        },
        {
            "Title": "Marksans Pharma Unit Receives Marketing Authorization for Gabapentin Oral Solution",
            "Summary": "Marksans Pharma announced that its unit has received marketing authorization for Gabapentin 50 mg/ml oral solution. This approval allows the company to market and sell this pharmaceutical product, potentially expanding its product portfolio and market presence.",
            "Sentiment": "positive",
            "PublishDate": 1747280612000,
            "Source": "default"
        },
        {
            "Title": "USFDA Inspection Completed at Marksans Pharma Facility",
            "Summary": "Marksans Pharma has announced that the United States Food and Drug Administration (USFDA) inspection at their facility has been completed. The company received one inspectional observation during the process.",
            "Sentiment": "neutral",
            "PublishDate": 1745818314000,
            "Source": "default"
        },
        {
            "Title": "Marksans Pharma's Goa Facility Approved by Australian TGA",
            "Summary": "Marksans Pharma has announced that its manufacturing facility in Goa has received approval from the Australian Therapeutic Goods Administration (TGA) for the production of pharmaceutical formulations intended for Australian markets. This approval opens up opportunities for the company to expand its presence in the Australian pharmaceutical market.",
            "Sentiment": "positive",
            "PublishDate": 1742449547000,
            "Source": "corporate_action"
        },
        {
            "Title": "Marksans Pharma's UK Subsidiary Receives MHRA Approval for Baclofen Tablets",
            "Summary": "Relonchem, the UK subsidiary of Marksans Pharma, has obtained approval from the Medicines and Healthcare products Regulatory Agency (MHRA) for Baclofen 10mg tablets. This approval allows the company to market and distribute the medication in the United Kingdom.",
            "Sentiment": "positive",
            "PublishDate": 1742366848000,
            "Source": "corporate_action"
        },
        {
            "Title": "Marksans Pharma's UK Subsidiary Receives Marketing Authorization for Ibuprofen and Paracetamol Tablets",
            "Summary": "Marksans Pharma announced that its UK subsidiary, Relonchem Limited, has received marketing authorization for Ibuprofen and Paracetamol 200 mg/500 mg film-coated tablets. This approval allows the company to market and sell this combination pain relief medication in the UK.",
            "Sentiment": "positive",
            "PublishDate": 1740465541000,
            "Source": "corporate_action"
        },
        {
            "Title": "Marksans Pharma Reports Strong Q3 Financial Results",
            "Summary": "Marksans Pharma has announced its Q3 consolidated financial results. The company's net profit increased to 1.05 billion rupees, up from 832 million rupees year-over-year and 967 million rupees quarter-over-quarter. Revenue for Q3 also saw growth, reaching 6.8 billion rupees compared to 5.86 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739320376000,
            "Source": "earnings"
        },
        {
            "Title": "Marksans Pharma Reports Q3 EBITDA and Margin Results",
            "Summary": "Marksans Pharma announced its Q3 financial results. The company's EBITDA increased to 1.39 billion rupees from 1.33 billion rupees in the same quarter last year. However, the EBITDA margin decreased to 20.35% from 22.69% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739286787000,
            "Source": "earnings"
        },
        {
            "Title": "Marksans Pharma Reports Strong Q3 Financial Results",
            "Summary": "Marksans Pharma has announced its Q3 consolidated financial results. The company's net profit increased to 1.05 billion rupees, up from 832 million rupees year-over-year and 967 million rupees quarter-over-quarter. Revenue also saw growth, reaching 6.8 billion rupees compared to 5.86 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739286732000,
            "Source": "earnings"
        },
        {
            "Title": "Marksans Pharma Limited: USFDA Approves Generic Allergy Drug",
            "Summary": "Marksans Pharma Limited received final USFDA approval for its ANDA for Loratadine Tablets USP 10 mg, a generic version of Bayer Healthcare's Claritin. The over-the-counter antihistamine will treat allergic rhinitis symptoms. This approval expands Marksans Pharma's generic pharmaceutical portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1732261998000,
            "Source": "order&deals"
        },
        {
            "Title": "Marksans Pharma Receives USFDA Approval for Loratadine Tablets",
            "Summary": "Marksans Pharma has obtained approval from the United States Food and Drug Administration (USFDA) for Loratadine Tablets. Loratadine is an antihistamine medication used to treat allergy symptoms. This approval allows Marksans Pharma to manufacture and market the generic version of this drug in the United States.",
            "Sentiment": "positive",
            "PublishDate": 1732257263000,
            "Source": "corporate_action"
        },
        {
            "Title": "Marksans Pharma Seeks Growth Through M&As and Capacity Expansion",
            "Summary": "Marksans Pharma is actively pursuing value-accretive mergers and acquisitions (M&As) as part of its growth strategy. The company is also working on projects to enhance its capacity, which may include greenfield investments or further M&As. Additionally, Marksans is exploring expansion options such as new facilities, new blocks, or new capital expenditures.",
            "Sentiment": "positive",
            "PublishDate": 1731555625000,
            "Source": "corporate_action"
        },
        {
            "Title": "Marksans Pharma Aims to Double Revenue in US and North America",
            "Summary": "Marksans Pharma has announced its strategic focus on doubling its revenue in the United States and North American markets. This indicates a significant expansion plan for the pharmaceutical company in these key regions.",
            "Sentiment": "positive",
            "PublishDate": 1731397044000,
            "Source": "corporate_action"
        },
        {
            "Title": "Marksans Pharma Targets Significant Revenue Growth",
            "Summary": "Marksans Pharma has announced strong growth in both revenues and margins. The company has set an ambitious goal to achieve a revenue of Rs 3,000 crore within the next two years.",
            "Sentiment": "positive",
            "PublishDate": 1731397005000,
            "Source": "corporate_action"
        },
        {
            "Title": "Marksans Pharma Anticipates Stronger Performance in Coming Quarters",
            "Summary": "The Managing Director of Marksans Pharma has expressed optimism about the company's future performance. The company expects stronger results in the upcoming quarters due to three main factors: new product launches, the start of the winter season, and the scaling up of operations at the Teva facility.",
            "Sentiment": "positive",
            "PublishDate": 1731396938000,
            "Source": "normal_news"
        },
        {
            "Title": "Marksans Pharma Reports Q2 EBITDA Growth",
            "Summary": "Marksans Pharma announced its Q2 financial results. The company's EBITDA increased to 1.3 billion rupees from 1.1 billion rupees year-over-year. However, the EBITDA margin slightly decreased to 21.12% from 21.46% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731396566000,
            "Source": "result"
        },
        {
            "Title": "Marksans Pharma Reports Q2 Revenue Growth",
            "Summary": "Marksans Pharma has announced its Q2 revenue of 6.4 billion rupees, compared to 5.3 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731396535000,
            "Source": "result"
        },
        {
            "Title": "Marksans Pharma Reports Q2 Profit Increase",
            "Summary": "Marksans Pharma has reported a consolidated net profit of 967 million rupees for the second quarter, up from 835 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731396513000,
            "Source": "result"
        }
    ]
}