{
    "Symbol": "MARKOLINES",
    "ISIN": "INE0FW001016",
    "News": [
        {
            "Title": "Markolines Converts 22,800 Warrants to Equity Shares",
            "Summary": "Markolines Pavement Technologies Limited successfully converted 22,800 convertible warrants into equity shares at Rs.165 per share, raising Rs.28,21,500 from non-promoter investor Shilpa Ojha.",
            "Sentiment": "positive",
            "PublishDate": 1769757929653,
            "Source": "co_actions_results"
        },
        {
            "Title": "Markolines Secures ₹12.32 Cr Orders",
            "Summary": "Markolines Pavement Technologies receives work orders worth ₹12.32 crores from five major infrastructure clients with completion deadlines between January-April 2026. Order book now exceeds ₹365 crores.",
            "Sentiment": "positive",
            "PublishDate": 1767692503724,
            "Source": "co_actions_results"
        },
        {
            "Title": "Markolines Secures ₹12.32 Cr Orders",
            "Summary": "Markolines Pavement Technologies secured work orders worth ₹12.32 crores from five clients including Thrissur Expressway Ltd and NI Road Infra, with completion scheduled between January-April 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767606088567,
            "Source": "co_actions_results"
        },
        {
            "Title": "Markolines Pavement Technologies Reports 39% Revenue Growth in Q2 FY26",
            "Summary": "Markolines Pavement Technologies Limited reported quarterly revenue of INR 77.67 crores, marking 39% growth year-over-year, with PAT increasing 69% to INR 4.08 crores and EPS rising 73% to INR 1.70. The highway maintenance company holds an unexecuted order book of INR 396 crores and expects 30% annual growth, targeting over 100% growth in the next 3 years driven by India's expanding road infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1763642294783,
            "Source": "earnings"
        },
        {
            "Title": "Markolines Pavement Technologies Reports Strong Q2 Growth with 39.95% Revenue Jump",
            "Summary": "Markolines Pavement Technologies delivered robust quarterly results with revenue from operations rising 39.95% YoY to Rs. 77.67 crore and profit after tax surging 69.29% to Rs. 4.08 crore. The highway maintenance solutions company maintains a strong unexecuted order book of Rs. 3,964 crore with Rs. 6,004 crore orders in pipeline, providing clear revenue visibility for the next 12-24 months.",
            "Sentiment": "positive",
            "PublishDate": 1763471830736,
            "Source": "earnings"
        },
        {
            "Title": "Markolines Pavement Technologies Shares Audio Recording of Q2 Earnings Call",
            "Summary": "Markolines Pavement Technologies Limited disclosed the audio recording link of its earnings conference call held on November 18, 2025, to discuss unaudited financial results for the quarter ended September 30, 2025. The company provided the recording link to stock exchanges BSE and NSE as per regulatory requirements, with the recording also available on the company's website.",
            "Sentiment": "positive",
            "PublishDate": 1763462290555,
            "Source": "earnings"
        },
        {
            "Title": "Markolines Pavement Technologies' Bank Loan Facilities Remain on Rating Watch with Developing Implications",
            "Summary": "India Ratings and Research has maintained Markolines Pavement Technologies Limited's bank loan facilities on Rating Watch with Developing Implications. The total bank loan facilities are rated at Rs. 109.37 crores, reduced from Rs. 112.65 crores, with ratings of IND BBB-/Rating Watch with Developing Implications and IND A3/Rating Watch with Developing Implications. The facilities include fund-based and non-fund-based working capital limits, term loans, and working capital demand loans with HDFC Bank Limited and Yes Bank Ltd. The company disclosed this rating action to BSE and NSE exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1762427182675,
            "Source": "stock"
        },
        {
            "Title": "Markolines Pavement Technologies Lists on NSE Mainboard Following Strong Q1 Performance",
            "Summary": "Markolines Pavement Technologies Limited has listed on the National Stock Exchange Mainboard effective October 14, 2025. The highway maintenance and specialized construction services company previously migrated from BSE SME Platform to BSE Main Board in June 2025. The company reported Q1 FY26 revenue of ₹72.72 crore, reflecting 44.39% year-on-year growth. EBITDA increased 36.81% to ₹7.51 crore, while profit after tax surged 119.37% to ₹3.79 crore. The company maintains an unexecuted order book of ₹400 crores and has secured new orders worth ₹200.98 crore in FY26. The Board has approved a merger with Markolines Infra Limited, pending regulatory approvals, aimed at streamlining operations and unlocking synergies.",
            "Sentiment": "positive",
            "PublishDate": 1760418438814,
            "Source": "stock"
        },
        {
            "Title": "Markolines Pavement Technologies Receives NSE Approval for Mainboard Listing",
            "Summary": "Markolines Pavement Technologies has received approval from the National Stock Exchange (NSE) to list and trade its shares on the mainboard. The trading is scheduled to commence on October 14, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1759739277677,
            "Source": "stock"
        },
        {
            "Title": "Markolines Pavement Technologies Shareholders Approve All Resolutions at 23rd AGM",
            "Summary": "Markolines Pavement Technologies Limited held its 23rd Annual General Meeting on September 30, 2025, where shareholders approved all eight resolutions through e-voting. Key approvals included adoption of audited financial statements for the year ended March 31, 2025, declaration of a final dividend of Rs. 1.5 per share (15% on face value of Rs. 10), and re-appointment of Ms. Kirtinandini Patil as Non-Executive Director. Shareholders also approved the re-appointment of M/s. Jay Gupta & Associates as Statutory Auditor and appointed M/s. DSM & Associates as Secretarial Auditors for a five-year term from 2025-26 to 2029-30. Special resolutions passed include increasing overall borrowing limits under section 180(1)(c) of the Companies Act 2013, enhancing limits for securitization and asset charge creation, and amending the Articles of Association. All resolutions received 100% approval from voting shareholders, with overall voter participation at 59.69% of total outstanding shares.",
            "Sentiment": "positive",
            "PublishDate": 1759329040440,
            "Source": "corporate_action"
        },
        {
            "Title": "Markolines Pavement Technologies' Merger Application Returned by BSE Due to Technical Issues",
            "Summary": "BSE returned the draft scheme of amalgamation between Markolines Pavement Technologies Limited and Markolines Infra Limited due to technical issues. The merger proposal, originally submitted on May 7, 2025, was returned on September 23, 2025. Under the scheme, Markolines Infra Limited would merge into Markolines Pavement Technologies Limited. The company is currently preparing to resubmit the merger application to BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1758799601101,
            "Source": "corporate_action"
        },
        {
            "Title": "Markolines Pavement Technologies Secures ₹3.51 Crore Order from NCC Limited",
            "Summary": "Markolines Pavement Technologies Limited has secured a ₹3.51 crore order from NCC Limited for earth piling works at Malad in Mumbai. The contract adds to the company's unexecuted order book of over ₹400 crores. The highway maintenance solutions provider reported strong quarterly results with profit after tax increasing 119.4% year-on-year to ₹3.79 crores and operating income growing 44.4% to ₹72.72 crores. EBITDA margins stood at 10.3%. The company has secured multiple recent contracts including a ₹100 crore order from Trans Metalite India Limited and orders worth ₹97.47 crores from Varanasi Aurangabad NH-2 Tollway Private Limited. Established in 2002, Markolines has executed over 4,930 lane kilometres of highway maintenance work. The company migrated to BSE Mainboard trading and has applied for NSE Mainboard listing. The board approved a merger with Markolines Infra Limited, subject to regulatory approvals. Markolines shares closed at ₹170.85 on BSE while NCC Limited shares ended at ₹215.75.",
            "Sentiment": "positive",
            "PublishDate": 1758213294235,
            "Source": "order&deals"
        },
        {
            "Title": "Markolines Secures ₹3.5 Crore Order",
            "Summary": "Markolines has secured an order worth ₹3.5 crore. The company's market capitalization stands at ₹327 crore.",
            "Sentiment": "positive",
            "PublishDate": 1758091645390,
            "Source": "order&deals"
        },
        {
            "Title": "Markolines Pavement Technologies Board Approves 23rd AGM and Key Appointments",
            "Summary": "Markolines Pavement Technologies Limited's Board of Directors approved convening the 23rd Annual General Meeting on September 30, 2025, through video conferencing. The board recommended the appointment of Mrs. Kirtinandini Patil as Non-Executive Director and reappointment of M/s. Jay Gupta & Associates as statutory auditor and M/s. DSM & Associates as secretarial auditor for five-year terms until the 28th AGM in financial year 2029-30. The board approved the Directors' Report and Secretarial Audit Report for the financial year ended March 31, 2025. September 19, 2025 was set as the record date for final dividend entitlement. The board also recommended increases in borrowing limits and securitization limits, along with alterations to Articles of Association for ESOP provisions. Remote e-voting will be conducted from September 27-29, 2025, with Bigshare Services Private Limited facilitating the e-voting services.",
            "Sentiment": "neutral",
            "PublishDate": 1757336468012,
            "Source": "corporate_action"
        },
        {
            "Title": "Markolines Pavement Technologies Reports 119% PAT Growth in Q1 FY2026 Earnings",
            "Summary": "Markolines Pavement Technologies Limited, a leading highway operations and maintenance provider in India, reported strong quarterly results with revenue of Rs. 72 crores (44% YoY growth), EBITDA of Rs. 7.51 crores (36% YoY growth), and PAT of Rs. 3.79 crores (119% YoY growth). The company achieved this performance despite early monsoons affecting operations. MPTL maintains an unexecuted order book of Rs. 400 crores and a pipeline of Rs. 600 crores, adding Rs. 30+ crores of new orders during the quarter including a Rs. 100 crore order spread over 5 years. The company migrated from SME platform to BSE main board and has applied for NSE main board listing. Management expects 25-30% revenue growth for FY2026, focusing on larger ticket size projects and specialized services including microsurfacing, tunneling, and soil stabilization which offer higher margins than conventional highway maintenance.",
            "Sentiment": "positive",
            "PublishDate": 1756385430387,
            "Source": "earnings"
        },
        {
            "Title": "Markolines Pavement Technologies Reports Strong Q1 Results with 44% Revenue Growth and 119% PAT Surge",
            "Summary": "Markolines Pavement Technologies Limited, India's largest highway maintenance company, delivered robust quarterly results with revenue rising 44.39% to Rs. 72.72 crore and profit after tax surging 119.37% to Rs. 3.79 crore. EBITDA grew 36.81% to Rs. 7.51 crore while earnings per share increased 91.1% to Rs. 1.72. The company maintains an unexecuted order book of Rs. 400 crore with an additional Rs. 600+ crore in pipeline orders. Recent contract wins include Rs. 18.87 crore for periodic maintenance at Varanasi Aurangabad NH-2 Tollway and Rs. 16.76 crore from Vadodara Kim Expressway for restoration works. The company has migrated to BSE Mainboard and applied for NSE Mainboard listing. Over the past three years, Markolines achieved revenue CAGR of 18%, EBITDA CAGR of 25%, and PAT CAGR of 31%. The company operates India's only Technology Centre for pavement preservation and maintains PAN India presence in highway operations and specialized road construction.",
            "Sentiment": "positive",
            "PublishDate": 1756124691330,
            "Source": "earnings"
        },
        {
            "Title": "Markolines Pavement Technologies Secures Rs 100 Crore Contract from Trans Metalite India",
            "Summary": "Markolines Pavement Technologies Limited received a Letter of Acceptance from Trans Metalite India Ltd. for a contract worth approximately Rs 100 crores. The project involves operation and production of patch repair work in Andhra Pradesh with a completion timeline of 5 years. The company's total unexecuted order book stands at Rs 400 crores. The contract is with a domestic entity and does not involve any related party transactions or promoter group interests.",
            "Sentiment": "positive",
            "PublishDate": 1756098985711,
            "Source": "order&deals"
        },
        {
            "Title": "Markolines Pavement Technologies Reports Strong Q1FY26 Results with 44% Revenue Growth",
            "Summary": "Markolines Pavement Technologies Limited reported robust Q1FY26 financial results with operating income rising 44.4% year-on-year to Rs. 72.72 crore from Rs. 50.36 crore. The integrated highway maintenance solution company posted profit after tax of Rs. 3.79 crore, up 119.4% from Rs. 1.73 crore in Q1FY25. EBITDA grew 37.8% to Rs. 7.51 crore with margins at 10.3%. PAT margin improved to 5.2% from 3.4%, while earnings per share surged 91.1% to Rs. 1.72. The company won orders worth Rs. 40 crore during the quarter, maintaining an unexecuted order book of Rs. 400 crore as of June 30, 2025, expected to convert to revenues within 12-24 months. Management attributed the strong performance to diverse execution capabilities and improved resource utilization despite the monsoon season typically being a lean quarter for the infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1755599274094,
            "Source": "earnings"
        },
        {
            "Title": "Markolines Pavement Technologies Reports Stable Q1 FY2026 Results with Improved Profitability",
            "Summary": "Markolines Pavement Technologies Limited published its unaudited financial results for the quarter ended June 30, 2025. The company reported total income from operations of Rs. 67.66 crores on standalone basis and Rs. 67.61 crores on consolidated basis. Net profit increased to Rs. 2.30 crores (standalone) and Rs. 2.35 crores (consolidated) compared to Rs. 1.72-1.75 crores in the previous quarter. The company maintained stable revenue levels around Rs. 67-68 crores while achieving marginal improvement in profitability. Equity share capital stands at Rs. 35.75 crores with reserves of Rs. 42.04 crores excluding revaluation reserve.",
            "Sentiment": "positive",
            "PublishDate": 1755327332942,
            "Source": "earnings"
        },
        {
            "Title": "Markolines Pavement Technologies Reports 379.05 Lacs Net Profit for Quarter Ended June 30, 2025",
            "Summary": "Markolines Pavement Technologies Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone net profit of Rs. 379.05 lacs compared to Rs. 172.79 lacs in the same quarter last year. Total income from operations was Rs. 7,415.46 lacs versus Rs. 5,100.50 lacs in the previous year quarter. Basic earnings per share stood at Rs. 1.72 compared to Rs. 0.90 in the corresponding quarter. The company operates in two main segments: Major Maintenance (MMR) generating Rs. 5,061.84 lacs revenue and Specialised Construction contributing Rs. 2,209.82 lacs. On consolidated basis, net profit was Rs. 379.05 lacs with total income of Rs. 7,420.23 lacs. The results include contributions from associate Uniqueuhpc Markolines LLP and joint venture Markolines Evrascon JV. Trading window remains closed for 48 hours following the board meeting conclusion.",
            "Sentiment": "positive",
            "PublishDate": 1755155312646,
            "Source": "earnings"
        },
        {
            "Title": "Markolines Pavement Technologies Board Approves NSE Mainboard Listing",
            "Summary": "Markolines Pavement Technologies Limited's Board of Directors approved the listing of the company's equity shares on the Mainboard of the National Stock Exchange of India Limited (NSE). The board meeting was held on August 1, 2025, commencing at 10:30 a.m. and concluding at 11:15 a.m. The Board believes the proposed NSE listing will enhance the company's visibility, provide liquidity to shareholders, and facilitate access to a wider pool of investors. The company will proceed with making a listing application to NSE subject to completion of necessary formalities. The company is currently listed on BSE with scrip code 543364.",
            "Sentiment": "positive",
            "PublishDate": 1754029260868,
            "Source": "corporate_action"
        },
        {
            "Title": "Markolines Pavement Board Approves NSE Mainboard Listing",
            "Summary": "Markolines Pavement's board has approved the company's share listing on the NSE Mainboard. The decision represents a step toward public trading for the company on India's National Stock Exchange main board segment.",
            "Sentiment": "positive",
            "PublishDate": 1754028541996,
            "Source": "stock"
        },
        {
            "Title": "Markolines Pavement Technologies Secures Work Orders Worth Rs. 30.39 Crores",
            "Summary": "Markolines Pavement Technologies Limited has received four work orders totaling Rs. 30,38,65,274.34 from multiple clients. The orders include: Rs. 3.41 crores from Athaang Dichpally Tollway for rectification works on NH-44 in Telangana (3-month completion excluding monsoon); Rs. 7.14 crores each from Pune Municipal Corporation for two separate preventive maintenance packages for Pune City roads (completion by May 2026); and Rs. 12.69 crores from NCC Limited for piling works at the Malad WwTF Project (3-month completion excluding monsoon). The company's total unexecuted order book stands at over Rs. 400 crores. All contracts are with domestic entities and do not involve related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1753854751014,
            "Source": "order&deals"
        },
        {
            "Title": "Markolines Pavement Technologies Schedules Board Meeting to Consider NSE Direct Listing",
            "Summary": "Markolines Pavement Technologies Limited has scheduled a Board of Directors meeting for August 1, 2025, to consider and approve the direct listing of the company's equity shares on the National Stock Exchange of India Limited. The meeting will also address other business items with the Chairman's permission. The company is currently listed on BSE with scrip code MARKOLINES.",
            "Sentiment": "positive",
            "PublishDate": 1753786476659,
            "Source": "corporate_action"
        },
        {
            "Title": "Markolines Pavement Technologies Secures ₹19 Crore Order",
            "Summary": "Markolines Pavement Technologies has received a new order worth approximately ₹19 crores. The company's unexecuted orders now exceed ₹400 crores. The current market capitalization of the company stands at ₹320 crores.",
            "Sentiment": "positive",
            "PublishDate": 1750308192000,
            "Source": "default"
        },
        {
            "Title": "Markolines Pavement Technologies Secures ₹16 Crore Order",
            "Summary": "Markolines Pavement Technologies has received an order worth ₹16 crore. The company's market capitalization is reported to be ₹280 crore. No additional details about the order or the company's financials were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1749530866000,
            "Source": "default"
        },
        {
            "Title": "Markolines Pavement Technologies Receives Approval for BSE Mainboard Listing",
            "Summary": "Markolines Pavement Technologies has received in-principle approval from BSE Limited to transition its equity shares listing from the BSE SME Board to the BSE Mainboard.",
            "Sentiment": "positive",
            "PublishDate": 1748228667000,
            "Source": "default"
        },
        {
            "Title": "Markolines Pavement Approves Amalgamation with Markolines Infra",
            "Summary": "Markolines Pavement Technologies Limited has approved the amalgamation of Markolines Infra into the company. This corporate action suggests a strategic restructuring or consolidation within the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1745308207000,
            "Source": "default"
        },
        {
            "Title": "Markolines Pavement Secures 6 Crore Rupee Order",
            "Summary": "Markolines Pavement Technologies Limited has won a new order worth 6 crore rupees. The company, which has a market capitalization of 263 crore rupees, is classified as a Small and Medium Enterprise (SME).",
            "Sentiment": "positive",
            "PublishDate": 1741682621000,
            "Source": "order&deals"
        },
        {
            "Title": "Markolines Pavement Approves Migration to BSE Main Board",
            "Summary": "The Board of Directors of Markolines Pavement Technologies Limited has approved the migration of the company's equity shares from the SME Platform of BSE Limited to the Main Board of BSE. This move signifies a potential upgrade in the company's listing status, which could lead to increased visibility and trading opportunities for the stock.",
            "Sentiment": "positive",
            "PublishDate": 1740125957000,
            "Source": "corporate_action"
        },
        {
            "Title": "Markolines Pavement Technologies Secures 73 Crore Rupee Order",
            "Summary": "Markolines Pavement Technologies has won a new order worth 73 crore rupees, as reported by SME Update. This represents a significant business development for the company, potentially boosting its project pipeline and financial outlook.",
            "Sentiment": "positive",
            "PublishDate": 1732523578000,
            "Source": "order&deals"
        },
        {
            "Title": "Markolines Pavement Tech Receives Work Order from BMC for Express Highways",
            "Summary": "<p>Markolines Pavement Technologies Limited has been <span class='positive'>notified</span> to <span class='positive'>commence work</span> on the <b>Eastern Express Highway</b> and <b>Western Express Highway</b> by the <b>Brihanmumbai Municipal Corporation (BMC)</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728551345000,
            "Source": "corporate_action"
        },
        {
            "Title": "Markolines Pavement Tech Secures 50.8 Crore Rupee Order",
            "Summary": "<p>Markolines Pavement Technologies Limited has <span class='positive'>won</span> a <span class='positive'>new order</span> valued at <b>50.8 crore rupees</b>. This represents a <span class='positive'>significant business development</span> for the company, potentially <span class='positive'>boosting</span> its revenue and market position in the pavement technology sector.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728550806000,
            "Source": "corporate_action"
        }
    ]
}