{
    "Symbol": "MARUTI",
    "ISIN": "INE585B01010",
    "News": [
        {
            "Title": "Maruti Suzuki Faces Production Challenges",
            "Summary": "Maruti Suzuki executive acknowledges production issues impacting the company's ability to meet customer demand, highlighting operational challenges in manufacturing operations.",
            "Sentiment": "negative",
            "PublishDate": 1770007737784,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Reports 170,000 Units in Pending Orders",
            "Summary": "Maruti Suzuki executive reveals significant order backlog of approximately 170,000 units, indicating strong customer demand for the automaker's vehicle portfolio across various segments.",
            "Sentiment": "positive",
            "PublishDate": 1770007285244,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki achieves record monthly sales",
            "Summary": "Maruti Suzuki India Limited reported its highest ever monthly sales of 236,963 units in January 2026, driven by strong domestic performance and record export volumes of 51,020 units.",
            "Sentiment": "positive",
            "PublishDate": 1770005518951,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Block Trade Worth Rs. 31.40 Crores",
            "Summary": "Maruti Suzuki India witnessed a significant block trade on NSE involving 21,891 shares valued at Rs. 31.40 crores, executed at Rs. 14,344.00 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769754063908,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maruti Suzuki Block Trade Worth Rs. 73.77 Crores",
            "Summary": "Maruti Suzuki India witnessed a significant NSE block trade involving 50,842 shares at Rs. 14,509 per share, totaling Rs. 73.77 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1769745227130,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maruti Suzuki Reports Strong Demand Pipeline",
            "Summary": "Maruti Suzuki India Limited indicates robust demand outlook ahead, signaling positive market conditions for the country's largest automaker in upcoming periods.",
            "Sentiment": "positive",
            "PublishDate": 1769665233145,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Discusses EBIT Margin Factors",
            "Summary": "Maruti Suzuki highlights operating leverage, lower discounts, and better product mix as positive factors while noting challenges from raw material costs and currency exchange rates.",
            "Sentiment": "neutral",
            "PublishDate": 1769660410681,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Reviews Growth Forecast Amid GST Changes",
            "Summary": "Maruti Suzuki plans to review its 7% volume growth forecast due to potential demand changes from GST reform, while maintaining its export target of 400,000 units by 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769660364986,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Exports 13,000 E Vitara EVs Globally",
            "Summary": "Maruti Suzuki has exported 13,000 units of its E Vitara electric vehicles to 28 countries worldwide, with the UK emerging as the largest market by volume for the company's EV exports.",
            "Sentiment": "positive",
            "PublishDate": 1769603510657,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Imports Parts with Rare Earth Magnets",
            "Summary": "Maruti Suzuki executive reveals company is compelled to import automotive parts containing rare earth magnets as minor components, highlighting supply chain dependencies in automotive manufacturing.",
            "Sentiment": "neutral",
            "PublishDate": 1769603306530,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Q3 Net Profit Rises to ₹38B",
            "Summary": "Maruti Suzuki reported Q3 standalone net profit of ₹38.00 billion, up from ₹35.30 billion year-on-year, though below analyst estimates of ₹42.40 billion.",
            "Sentiment": "neutral",
            "PublishDate": 1769590102404,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maruti Suzuki shares decline 2.12% amid trading",
            "Summary": "Maruti Suzuki India shares fell 2.12% to Rs 15,141 in Tuesday's session with over 4.01 lakh shares traded. The company reported Q2 FY26 revenue of Rs 42,344 crore, up from Rs 37,449 crore in Q2 FY25.",
            "Sentiment": "negative",
            "PublishDate": 1769506983721,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Q3 Preview: PAT seen rising up to 35% YoY",
            "Summary": "Brokerages expect Maruti Suzuki to report strong Q3 FY25 results with PAT rising 24-35% YoY to Rs 4,540-5,696 crore, driven by robust volume growth and improved product mix.",
            "Sentiment": "positive",
            "PublishDate": 1769496992856,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maruti Suzuki Gets Rs 11,825 Million IT Demand",
            "Summary": "Maruti Suzuki India Limited received Final Assessment Order from Income Tax Authority for FY 2021-22 with total demand of Rs. 11,825 million including interest. Company to file appeal before Income Tax Appellate Tribunal.",
            "Sentiment": "negative",
            "PublishDate": 1769185122750,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki shares fall 1.76% despite strong growth",
            "Summary": "Maruti Suzuki India shares declined 1.76% to ₹15,488.00 despite touching day's high of ₹15,846.00. Company reported strong FY25 performance with revenue rising 7.79% to ₹152,913.00 crores and net profit up 7.72%.",
            "Sentiment": "neutral",
            "PublishDate": 1769160623755,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Q3FY26 Earnings Call Set for Jan 28",
            "Summary": "Maruti Suzuki India Limited announces earnings conference call for Q3 FY2025-26 results scheduled for January 28, 2026 at 4:30 PM for analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1768990980833,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maruti Suzuki Sees ₹16.56 Cr NSE Block Trade",
            "Summary": "Maruti Suzuki India witnessed a significant block trade on NSE worth ₹16.56 crores involving approximately 10,322 shares at ₹16,048.00 per share, indicating institutional interest in the auto major.",
            "Sentiment": "neutral",
            "PublishDate": 1768803611920,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maruti Suzuki announces ₹35,000 cr Gujarat plant",
            "Summary": "Maruti Suzuki commits ₹35,000 crore investment for new Gujarat manufacturing facility with 10 lakh units annual capacity, generating 12,000 jobs as part of expansion to 4 million units production.",
            "Sentiment": "positive",
            "PublishDate": 1768796359312,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki starts exporting Victoris as 'Across'",
            "Summary": "Maruti Suzuki shipped over 450 Victoris SUVs from Mundra and Pipavav ports for international markets, where the vehicle will be sold as 'Across'. The company exported 3.90 lakh vehicles in 2025.",
            "Sentiment": "positive",
            "PublishDate": 1768555830479,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Exports 450 'Across' SUV Units Globally",
            "Summary": "Maruti Suzuki begins exporting premium 'Across' SUV to over 100 countries with initial shipment of 450 units. The SUV has earned 5-star safety ratings from both Global NCAP and Bharat NCAP.",
            "Sentiment": "positive",
            "PublishDate": 1768555650039,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Plans ₹5,000cr Investment for Gujarat Plant",
            "Summary": "Maruti Suzuki announces significant investment of nearly ₹5,000 crores for establishing second manufacturing facility in Gujarat state.",
            "Sentiment": "positive",
            "PublishDate": 1768269883075,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Partners with IOCL for Service Network",
            "Summary": "Maruti Suzuki and Indian Oil Corporation sign MoU to establish vehicle service facilities at select IOCL fuel stations, expanding after-sales service reach across India's 41,000+ fuel station network.",
            "Sentiment": "positive",
            "PublishDate": 1768215813657,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Partners with Indian Oil for Service",
            "Summary": "Maruti Suzuki India collaborates with Indian Oil Corporation to establish vehicle service facilities at fuel retail outlets across the country, creating one-stop solutions for customers.",
            "Sentiment": "positive",
            "PublishDate": 1768211855985,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Invests ₹4,960 Cr for Gujarat Expansion",
            "Summary": "Maruti Suzuki board approves ₹4,960-crore land acquisition for expanding manufacturing capacity by up to 10 lakh units at Khoraj Industrial Estate in Gujarat.",
            "Sentiment": "positive",
            "PublishDate": 1768206986141,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Partners With IOC For Service Points",
            "Summary": "Maruti Suzuki India announces strategic partnership with Indian Oil Corporation to establish vehicle service points at IOCL fuel stations, expanding customer service network across the country.",
            "Sentiment": "positive",
            "PublishDate": 1768205058906,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Partners with IOCL for Service Expansion",
            "Summary": "Maruti Suzuki India Limited signs MoU with Indian Oil Corporation Limited to establish vehicle service facilities at IOCL fuel retail outlets nationwide, expanding service network beyond 5,780 touchpoints.",
            "Sentiment": "positive",
            "PublishDate": 1768204957348,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki approves ₹4,960 cr land buy for expansion",
            "Summary": "Maruti Suzuki India's board approves land acquisition worth ₹4,960 crore in Gujarat for capacity expansion of up to 1 million units. Stock trades 1% lower despite 42% annual gains.",
            "Sentiment": "positive",
            "PublishDate": 1768197588334,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Approves ₹4,960-Cr Gujarat Land Deal",
            "Summary": "Maruti Suzuki's board approves ₹4,960-crore land acquisition at Khoraj Industrial Estate for expanding production capacity by up to 10 lakh units annually in Gujarat.",
            "Sentiment": "positive",
            "PublishDate": 1768197472296,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Approves ₹4,960 Cr Expansion Plan",
            "Summary": "Maruti Suzuki's board has approved a significant expansion project at Khoraj Industrial Estate with a total investment of ₹4,960 crores, to be funded through internal funds and external loans.",
            "Sentiment": "positive",
            "PublishDate": 1768192724800,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Board Approves ₹4,960 Cr Land Deal",
            "Summary": "Maruti Suzuki's board approves land acquisition at Khoraj Industrial Estate for ₹4,960 crores to add 1 million units capacity, citing growth in market demand and exports.",
            "Sentiment": "positive",
            "PublishDate": 1768192657853,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Shares Drop 4% Despite Strong Sales",
            "Summary": "Maruti Suzuki shares fell 3.7% to ₹16,654, ending a six-day winning streak despite December sales of 2.17 lakh units beating estimates. HSBC maintains buy rating with ₹18,500 target but warns margins critical.",
            "Sentiment": "neutral",
            "PublishDate": 1767773351847,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki December 2025 Production Jumps 34.4%",
            "Summary": "Maruti Suzuki India Limited reported total production of 211,939 units in December 2025, marking a significant 34.4% increase from 157,654 units in December 2024, driven by strong growth across passenger vehicles and utility segments.",
            "Sentiment": "positive",
            "PublishDate": 1767281758206,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Reports 175,000 Units Pending Bookings",
            "Summary": "Maruti Suzuki executive reveals significant pending order book of 175,000 units, indicating strong consumer demand for the automaker's vehicle portfolio across various segments.",
            "Sentiment": "positive",
            "PublishDate": 1767268630309,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Records Highest-Ever Annual Exports",
            "Summary": "Maruti Suzuki achieved record exports of 3.95 lakh vehicles in 2025, up 21% YoY, while total sales reached 23.51 lakh units. Dzire emerged as industry's top-selling model with strong CNG penetration at 37%.",
            "Sentiment": "positive",
            "PublishDate": 1767265345468,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Sales Up 22% At 2.18 Lakh Units In December",
            "Summary": "Maruti Suzuki India reported 22.21% growth in total sales at 2,17,854 units in December 2025, driven by strong domestic passenger vehicle demand across all segments, though exports declined.",
            "Sentiment": "positive",
            "PublishDate": 1767251031336,
            "Source": "co_actions_results"
        },
        {
            "Title": "Suzuki halts Fronx sales in New Zealand after crash test",
            "Summary": "Suzuki stops Fronx sales in New Zealand following one-star ANCAP safety rating due to rear seatbelt failure during crash testing. Recall issued for 1,115 vehicles with advisory against rear seat usage.",
            "Sentiment": "negative",
            "PublishDate": 1766589592379,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Receives GST Adjudication Order",
            "Summary": "Maruti Suzuki India Limited receives GST adjudication order from West Bengal GST Authority with tax demand of ₹11.70 million and penalty of ₹11.70 million for period April 2018 to March 2023.",
            "Sentiment": "negative",
            "PublishDate": 1766496586373,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki ₹50 Cr NSE Block Trade Executed",
            "Summary": "Maruti Suzuki India witnessed a significant block trade on NSE worth ₹50.00 crores involving approximately 30,105 shares at ₹16,607.00 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1766468119707,
            "Source": "co_actions_results"
        },
        {
            "Title": "NCLAT Sets Hearing Date for Maruti Suzuki Case",
            "Summary": "The National Company Law Appellate Tribunal has scheduled a hearing for Maruti Suzuki on January 27, 2026, marking a significant development in the ongoing legal proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1766063839713,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Receives GST Adjudication Order",
            "Summary": "Maruti Suzuki India Limited receives GST adjudication order from West Bengal GST Authority with tax demand of ₹4.33 million and penalty of ₹4.33 million for period April 2018 to March 2023.",
            "Sentiment": "negative",
            "PublishDate": 1766062315171,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Sees ₹51.10 Cr NSE Block Trade",
            "Summary": "Maruti Suzuki India witnessed a significant block trade on NSE worth ₹51.10 crores involving 31,158 shares at ₹16,399.00 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1766045428412,
            "Source": "co_actions_results"
        },
        {
            "Title": "Maruti Exports Over 10,000 EVs, Eyes 100+ Countries",
            "Summary": "Maruti Suzuki has successfully exported over 10,000 electric vehicles and is targeting sales expansion to more than 100 countries as part of its global growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1766043894475,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki NCLAT Hearing Postponed",
            "Summary": "The National Company Law Appellate Tribunal has postponed Maruti Suzuki's hearing with the next date to be announced later.",
            "Sentiment": "neutral",
            "PublishDate": 1765973921704,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki Launches WagonR Swivel Seat for Inclusive Mobility",
            "Summary": "Maruti Suzuki introduces innovative swivel seat option for WagonR to enhance accessibility for senior citizens and persons with disabilities. Pilot project launched across 11 cities with 200+ dealerships.",
            "Sentiment": "positive",
            "PublishDate": 1765960906638,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Clarifies No Mexico Exports, Unaffected by Tariffs",
            "Summary": "Maruti Suzuki clarifies it does not export vehicles to Mexico and remains unaffected by the country's tariff increases on India-made cars, contrary to earlier market concerns.",
            "Sentiment": "positive",
            "PublishDate": 1765442712058,
            "Source": "stocks"
        },
        {
            "Title": "Maruti Suzuki's ESG Rating Upgraded to 73 by NSE Sustainability Ratings",
            "Summary": "NSE Sustainability Ratings and Analytics Limited independently upgraded Maruti Suzuki India Limited's ESG rating to 73 (leadership category) in FY2025 from 71 in FY2024. The rating was prepared without company engagement, based solely on publicly available data.",
            "Sentiment": "positive",
            "PublishDate": 1765355582398,
            "Source": "stock"
        },
        {
            "Title": "Maruti Suzuki Partners With 13 Charging Operators For 100,000 EV Charging Stations By 2030",
            "Summary": "Maruti Suzuki has signed agreements with 13 charging point operators to establish over 100,000 charging stations by 2030. This strategic move positions the automaker to support electric vehicle infrastructure expansion and potentially strengthen its presence in the EV market.",
            "Sentiment": "positive",
            "PublishDate": 1764692898490,
            "Source": "stock"
        },
        {
            "Title": "Maruti Suzuki Reports November 2025 Production Figures",
            "Summary": "Maruti Suzuki India Limited produced 198,322 vehicles in November 2025, including 107,641 passenger cars, 86,867 utility vehicles, and 3,814 light commercial vehicles. The production data includes figures from Suzuki Motor Gujarat Private Limited and covers various models across compact, mini, utility vehicle segments.",
            "Sentiment": "neutral",
            "PublishDate": 1764592051753,
            "Source": "stock"
        },
        {
            "Title": "Maruti Suzuki Achieves Record Monthly Sales of 229,021 Units in November 2025",
            "Summary": "Maruti Suzuki India Limited reported its highest-ever monthly sales volume of 229,021 units in November 2025, comprising 174,593 domestic sales, 8,371 OEM sales, and 46,057 exports. The company also achieved an all-time monthly high in exports, demonstrating strong performance across both domestic and international markets.",
            "Sentiment": "neutral",
            "PublishDate": 1764578928321,
            "Source": "stock"
        },
        {
            "Title": "Maruti Suzuki Completes Amalgamation with Subsidiary SMG, Increases Authorized Share Capital",
            "Summary": "Maruti Suzuki India Limited has completed the amalgamation of its wholly owned subsidiary Suzuki Motor Gujarat Private Limited, with the scheme becoming effective from December 1, 2025. The company has increased its authorized share capital by INR 150 billion to INR 168.755 billion and added technical support services to its business objectives.",
            "Sentiment": "positive",
            "PublishDate": 1764529090369,
            "Source": "corporate_action"
        }
    ]
}