{
    "Symbol": "MASFIN",
    "ISIN": "INE348L01012",
    "News": [
        {
            "Title": "MAS Financial Services Schedules Investor Day",
            "Summary": "MAS Financial Services announces Investor & Analyst Day on February 16, 2026 at Jio World Convention Centre, Mumbai starting 4:00 PM onwards as per regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1770741434515,
            "Source": "stocks"
        },
        {
            "Title": "MAS Financial Services Q3FY26 earnings call recording",
            "Summary": "MAS Financial Services makes earnings call recording available for Q3FY26 results discussion held on January 29, 2026, covering unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769700546600,
            "Source": "co_actions_results"
        },
        {
            "Title": "MAS Financial Board Meet on Jan 28 for Q3 Results",
            "Summary": "MAS Financial Services has scheduled its board meeting for January 28, 2026, to approve Q3FY26 financial results, consider interim dividend, and discuss re-appointment of independent director.",
            "Sentiment": "neutral",
            "PublishDate": 1769001951682,
            "Source": "co_actions_results"
        },
        {
            "Title": "India Business Excellence Fund III Reduces Stake in MAS Financial",
            "Summary": "India Business Excellence Fund III disposed of 37.50 lakh equity shares of MAS Financial Services through open market transactions between July 2025 and January 2026, reducing its holding from 6.69% to 4.62%.",
            "Sentiment": "neutral",
            "PublishDate": 1767959619821,
            "Source": "co_actions_results"
        },
        {
            "Title": "MAS Financial Allots ₹100 Cr NCDs at 8.75% Interest",
            "Summary": "MAS Financial Services successfully allotted 10,000 non-convertible debentures worth ₹100 crores on private placement basis with 8.75% annual interest rate and 36-month tenure.",
            "Sentiment": "positive",
            "PublishDate": 1767070597072,
            "Source": "co_actions_results"
        },
        {
            "Title": "MAS Financial Services Gets ESG Rating Upgrade",
            "Summary": "MAS Financial Services receives upgraded ESG rating score of 65.6 from CareEdge, improving from previous 61.4, with CareEdge-ESG 2 rating indicating strong ESG risk management position.",
            "Sentiment": "positive",
            "PublishDate": 1767006786452,
            "Source": "stocks"
        },
        {
            "Title": "MAS Financial Services Allots INR 1,500 Crore Non-Convertible Debentures",
            "Summary": "MAS Financial Services Limited allotted 1,50,000 non-convertible debentures worth INR 1,500 crore on private placement basis with 8.90% annual interest rate and 24-month tenure. The debentures are rated CARE AA-/Stable and will be listed on BSE's Wholesale Debt Market segment, secured by first ranking charge over company's book debts and receivables.",
            "Sentiment": "positive",
            "PublishDate": 1764308973437,
            "Source": "corporate_action"
        },
        {
            "Title": "MAS Financial Services Reports 18.3% AUM Growth to INR 13,821 Crores in Q2 FY26",
            "Summary": "MAS Financial Services Limited reported consolidated AUM of INR 13,821 crores and profit after tax of INR 91.43 crores for the quarter ended September 30, 2025, representing growth of 18.32% in AUM and 17.79% in PAT compared to the same period last year. On standalone basis, AUM reached INR 12,999 crores with PAT of INR 89.70 crores, showing 18% and 17.15% growth respectively. Total income grew 25.09% to INR 458.61 crores. The company maintained asset quality with net Stage 3 assets at 1.69% and carries a management overlay of INR 17.60 crores. Capital adequacy ratio stands strong at 24.57% with Tier 1 capital at 22.7%. The company has established presence across 15,000 pin codes and works with around 200 partner NBFCs. Chairman Kamlesh Gandhi outlined the company's medium-term vision of reaching INR 1 lakh crore AUM within a decade. MAS Financial received final approval from IRDAI for insurance broking business through subsidiary MAS FinInsurance Broking. The housing finance subsidiary reported AUM of INR 821.70 crores with 23.65% growth and maintained Stage 3 assets at 0.66%.",
            "Sentiment": "positive",
            "PublishDate": 1763014979452,
            "Source": "earnings"
        },
        {
            "Title": "MAS Financial Services Reports 18% AUM Growth and 17% PAT Increase in Q2 FY26",
            "Summary": "MAS Financial Services Limited announced its quarterly results with consolidated Assets Under Management (AUM) reaching Rs 13,821.14 crores, representing an 18.32% year-on-year growth. The company reported consolidated Profit After Tax (PAT) of Rs 91.43 crores for the quarter ended September 30, 2025, marking a 17.79% increase from Rs 77.62 crores in the corresponding quarter of the previous year. On a standalone basis, the company achieved AUM of Rs 12,999.44 crores (18% growth) and PAT of Rs 89.70 crores (17.15% growth). The company maintained strong portfolio quality with gross stage 3 assets at 2.53% and net stage 3 assets at 1.69% of AUM. Capital Adequacy Ratio remained robust at 24.57% including Tier II capital. The company's subsidiary MAS Rural Housing and Mortgage Finance Limited reported AUM of Rs 821.70 crores with 23.65% growth and PAT of Rs 2.99 crores. The board also appointed Mr. Pranay Modi as Chief Information Security Officer and approved unaudited financial results for the quarter and half year ended September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762375255698,
            "Source": "earnings"
        },
        {
            "Title": "MAS Financial Services Reports 18% Growth in Q2 Net Profit to 903.4M Rupees",
            "Summary": "MAS Financial Services reported consolidated net profit of 903.4 million rupees for Q2, representing an increase from 767.2 million rupees in the same period last year. The company's revenue grew to 4.8 billion rupees compared to 3.84 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762341943860,
            "Source": "earnings"
        },
        {
            "Title": "MAS Financial Stock Drops 10% Despite Growth Expectations and Analyst Buy Ratings",
            "Summary": "MAS Financial Services stock declined 10% over two months following its June quarter results, underperforming the ET NBFC index which fell 2%. The MSME lender reported net interest income growth of 35.7% to ₹237.6 crore and net profit increase of 19.1% to ₹83.9 crore, though profit growth was slower due to higher operating expenses. Asset quality showed some deterioration with GNPA ratio rising to 2.5% from 2.3% year-on-year, while zero DPD proportion fell to 93.4% from 94.6%. The company operates 206 branches across 13 states with AUM of ₹12,504.6 crore, where MSME segment comprises 76% of total AUM. MAS Financial expects AUM growth of 20-25% for the year and anticipates improved disbursements in the second half through branch expansion. Analysts maintain buy ratings with Motilal Oswal setting a target price of ₹400, representing 33% upside from the current trading price of ₹300.4.",
            "Sentiment": "neutral",
            "PublishDate": 1759192615818,
            "Source": "stock"
        },
        {
            "Title": "MAS Financial Services Increases Stake in Subsidiary to 62.54% Through Share Conversion",
            "Summary": "MAS Financial Services Limited acquired 333,333 equity shares of its subsidiary MAS Rural Housing and Mortgage Finance Limited through conversion of optionally convertible preference shares. The conversion increased MFSL's stake from 62.02% to 62.54%. The Finance Committee of MRHMFL approved the allotment of equity shares at Rs. 100 per share. MRHMFL is a housing finance company focused on serving middle income segments, with turnover of Rs. 23 crores and net profit of Rs. 2.76 crores as of June 30, 2025. The subsidiary has shown consistent growth with turnover increasing from Rs. 43.75 crores in 2022-23 to Rs. 81.08 crores in 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1757672331309,
            "Source": "corporate_action"
        },
        {
            "Title": "MAS Financial Services Raises INR 200 Crore Through Non-Convertible Debentures",
            "Summary": "MAS Financial Services Limited has allotted 20,000 non-convertible debentures worth INR 200 crore through private placement. The debentures carry a face value of INR 1,00,000 each and offer an interest rate of 9.75% per annum payable annually. The instruments are rated 'CARE AA-; Stable' by CARE Ratings Limited and have a tenure of 1 year, 10 months and 16 days, maturing on June 15, 2027. The debentures are secured by a first ranking charge over the company's book debts and loan receivables, with security coverage of at least 1.10 times the outstanding amount. Investors include HDFC Credit Risk Debt Fund, HDFC Medium Term Debt Fund, HSBC Credit Risk Fund, HSBC Low Duration Fund, and HSBC Medium Duration Fund. The debentures will be listed on the Wholesale Debt Market segment of BSE Limited.",
            "Sentiment": "positive",
            "PublishDate": 1753852789962,
            "Source": "corporate_action"
        },
        {
            "Title": "MAS Financial Services Reports 21% AUM Growth and 20% Profit Rise in Q1 FY26",
            "Summary": "MAS Financial Services reported consolidated AUM growth of approximately 21% and profitability growth of close to 20% for Q1 FY26. The company's AUM reached INR12,505 crores compared to INR10,384 crores in the previous year. Total income grew 28% from INR347 crores to INR444 crores, while profit after tax increased 19% from INR70 crores to INR84 crores. The company maintained asset quality with Net Stage 3 Assets at 1.63% and Gross Stage 3 at 2.49%. MSME segment contributes 75% of assets, with the remaining 25% from Wheels and Personal Loan businesses. The company operates through 206 branches across 14,500+ pin codes, with 65-66% business through retail distribution and the rest through NBFC partnerships. ROA was maintained at 2.84% and ROE at 14% on expanded capital base. The housing finance subsidiary reached INR794 crores AUM with 27% growth. Management expects 20-25% growth guidance and anticipates 25-35 basis points reduction in borrowing costs during the year.",
            "Sentiment": "positive",
            "PublishDate": 1753795672353,
            "Source": "earnings"
        },
        {
            "Title": "MAS Financial Services Makes Q1 2025 Earnings Call Recording Available Online",
            "Summary": "MAS Financial Services Limited has made the audio/video recording of its earnings call available on its website. The earnings call with analysts and investors was held on July 24, 2025, discussing the company's unaudited financial results for the quarter ended June 30, 2025. The call concluded at 04:25 P.M. and the recording can be accessed at https://mas.co.in/Conference-Call-Transcripts.aspx. The company has notified both NSE and BSE about the availability of this recording.",
            "Sentiment": "neutral",
            "PublishDate": 1753364269562,
            "Source": "earnings"
        },
        {
            "Title": "MAS Financial Services Announces Book Closure and Dividend Declaration for Annual General Meeting",
            "Summary": "MAS Financial Services Limited has announced a book closure period from August 28, 2025 to September 3, 2025 for dividend declaration and the 30th Annual General Meeting. The company will hold its Annual General Meeting on September 3, 2025, where shareholders will vote on a proposed final dividend of Rs. 0.70 per equity share. August 27, 2025 has been set as the cut-off date for determining shareholder eligibility for remote e-voting and e-voting at the meeting. During the book closure period, the company's register of members and share transfer books will remain closed to determine eligible shareholders for the dividend payment and meeting participation.",
            "Sentiment": "neutral",
            "PublishDate": 1753341649946,
            "Source": "corporate_action"
        },
        {
            "Title": "MAS Financial Targets AUM Doubling in 3-4 Years Through Rural Expansion and Tech Strategy",
            "Summary": "MAS Financial has outlined plans to double its assets under management (AUM) over the next 3-4 years. The company's growth strategy focuses on five key areas: expanding deeper into rural markets, scaling up co-lending operations, forming partnerships with non-banking financial companies (NBFCs), implementing technology-driven underwriting processes, and maintaining superior asset quality standards.",
            "Sentiment": "positive",
            "PublishDate": 1753284524176,
            "Source": "stock"
        },
        {
            "Title": "MAS Financial Services Reports 20.82% AUM Growth and 19.34% PAT Growth in Q1 FY26",
            "Summary": "MAS Financial Services Limited reported consolidated Assets under Management (AUM) of ₹13,298.50 crores and Profit after Tax (PAT) of ₹86.59 crores for Q1 FY26, representing growth of 20.82% in AUM and 19.34% in PAT year-over-year. On standalone basis, the company achieved AUM of ₹12,504.60 crores and PAT of ₹83.90 crores, with growth of 20.43% and 19.13% respectively. The company maintained strong capital adequacy ratio of 25.22% and portfolio quality with 2.49% gross stage 3 assets. The subsidiary MASFin Insurance Broking Private Limited received in-principle approval from IRDAI to operate as a Direct Insurance Broker. The board proposed a final dividend of ₹0.70 per equity share and announced book closure from August 28 to September 3, 2025 for the 30th Annual General Meeting scheduled for September 3, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753265312890,
            "Source": "earnings"
        },
        {
            "Title": "MAS Financial Services Reports Strong Q1 FY26 Results with 20.82% AUM Growth",
            "Summary": "MAS Financial Services Limited reported robust quarterly results for the quarter ended June 30, 2025. The company's consolidated Assets Under Management (AUM) grew 20.82% to Rs 13,298.50 crores, while Profit After Tax increased 19.34% to Rs 86.59 crores compared to the same quarter last year. On a standalone basis, AUM reached Rs 12,504.60 crores (up 20.43%) with PAT of Rs 83.90 crores (up 19.13%). The company maintained strong asset quality with gross stage 3 assets at 2.49% and net stage 3 assets at 1.63%. Capital Adequacy Ratio remained robust at 25.22% including Tier II capital. The Board approved quarterly financial results, recommended director re-appointment, appointed new secretarial auditor for 5 years, and approved related party investment of up to Rs 35 lakh in subsidiary MASFin Insurance Broking Private Limited. The company's 30th Annual General Meeting is scheduled for September 3, 2025. Additionally, MASFin Insurance Broking Private Limited received in-principle approval from IRDAI to operate as a Direct Insurance Broker.",
            "Sentiment": "positive",
            "PublishDate": 1753262943508,
            "Source": "corporate_action"
        },
        {
            "Title": "MAS Financial Services Reports Strong Q1 Performance with 20.82% AUM Growth",
            "Summary": "MAS Financial Services reported consolidated assets under management (AUM) of ₹13,298.50 crores, representing a growth of 20.82%. The company's Q1 consolidated net profit increased to ₹855 million compared to ₹717.2 million in the same period last year. Q1 revenue also grew to ₹4.65 billion from ₹3.64 billion year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1753262143179,
            "Source": "stock"
        },
        {
            "Title": "MAS Financial Services: 20 Lakh Shares Worth ₹61 Crore Change Hands in Block Deal",
            "Summary": "A block deal involving 20 lakh shares of MAS Financial Services Ltd., valued at ₹61 crore, occurred before market opening on July 15. Buyers and sellers are currently unknown. The company's Q4 FY2025 net profit was ₹80.8 crore, up 18.7% year-over-year, with net interest income rising 33.8% to ₹224.5 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1752550748000,
            "Source": "block_deals"
        },
        {
            "Title": "Mas Financial Services Reports Q4 Results and Approves Borrowing Funds",
            "Summary": "Mas Financial Services announced its Q4 consolidated net profit of 824.7 million rupees, up from 693.6 million rupees year-over-year and 794.7 million rupees quarter-over-quarter. Q4 revenue increased to 4.38 billion rupees from 3.47 billion rupees year-over-year. The company approved borrowing funds through the issuance of Non-Convertible Debentures (NCDs) up to 30 billion rupees and commercial papers up to 10 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1746144800000,
            "Source": "default"
        },
        {
            "Title": "MAS Financial Services Announces Growth Strategies and AUM Targets",
            "Summary": "MAS Financial Services has outlined its key growth strategies after reaching Rs. 100 billion in Assets Under Management (AUM). The company aims to grow its AUM by 20% to 25% over the medium to long-term, signaling a new phase of expansion.",
            "Sentiment": "positive",
            "PublishDate": 1746023090000,
            "Source": "default"
        },
        {
            "Title": "MAS Financial Services Approves Borrowing Funds and Reports Q4 Revenue",
            "Summary": "MAS Financial Services has approved borrowing funds through the issuance of Non-Convertible Debentures (NCDs) up to 30 billion rupees and Commercial Papers up to 10 billion rupees. The company also reported Q4 revenue of 4.38 billion rupees, compared to 3.47 billion rupees in the same quarter last year, showing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1746017781000,
            "Source": "default"
        },
        {
            "Title": "MAS Financial Services Reports Q4 Profit Growth",
            "Summary": "MAS Financial Services has reported a consolidated net profit of 824.7 million rupees for the fourth quarter, showing an increase from 693.6 million rupees year-over-year and 794.7 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1746017766000,
            "Source": "result"
        },
        {
            "Title": "MAS Financial Services: Targeting 25% Annual Growth Over Next Five Years",
            "Summary": "MAS Financial Services aims for 20-25% annual growth over the next 3-5 years, focusing on sustainable growth and maintaining ROAs between 2.75-3%. The company plans to keep salaried personal loans below 10% of AUM, currently at 6-7%. Despite industry challenges, MAS reports a GNPA of 2.41%, which it considers strong relative to the sector.",
            "Sentiment": "positive",
            "PublishDate": 1742364673000,
            "Source": "normal_news"
        },
        {
            "Title": "MAS Financial Services Reports Strong Growth in MSME Segment",
            "Summary": "MAS Financial Services has reported that its MSME (Micro, Small, and Medium Enterprises) segment contributed significantly to the company's year-over-year Assets Under Management (AUM) growth. The MSME segment accounted for 60% of the total AUM growth, highlighting the company's strong performance in this sector.",
            "Sentiment": "positive",
            "PublishDate": 1738139224000,
            "Source": "earnings"
        },
        {
            "Title": "MAS Financial Services Reports Strong Growth in AUM and PAT",
            "Summary": "MAS Financial Services has announced significant growth in its Assets Under Management (AUM) and Profit After Tax (PAT). The company reported a 21.17% increase in AUM and a 24.83% rise in PAT, indicating robust financial performance and business expansion.",
            "Sentiment": "positive",
            "PublishDate": 1738139158000,
            "Source": "earnings"
        },
        {
            "Title": "MAS Financial Services Reports Q3 Revenue Growth",
            "Summary": "MAS Financial Services has announced its third-quarter revenue results. The company reported revenue of 4.1 billion rupees, compared to 3.4 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738139066000,
            "Source": "earnings"
        },
        {
            "Title": "MAS Financial Services Reports 25% Increase in Q3 Consolidated Net Profit",
            "Summary": "MAS Financial Services has announced its third-quarter consolidated net profit of 795 million rupees, showing a significant increase from 636 million rupees in the same period last year. This represents a year-over-year growth of approximately 25% in the company's net profit.",
            "Sentiment": "positive",
            "PublishDate": 1738139041000,
            "Source": "earnings"
        },
        {
            "Title": "MAS Financial to Consider Q3 Results",
            "Summary": "MAS Financial Services Limited has announced that it will consider its third quarter (Q3) financial results on January 29. This indicates the company is preparing to disclose its performance for the latest fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737554471000,
            "Source": "earnings"
        },
        {
            "Title": "MAS Financial Services: Microfinance Bad Loans to Persist for Two More Quarters",
            "Summary": "MAS Financial Services' Chairman Kamlesh Gandhi expects microfinance industry stress to continue for two more quarters. The company's GNPA is projected to stay between 2.25% to 2.5%. Gandhi attributes the stress to aggressive lending and borrower overleverage, emphasizing the need for cautious credit extension.",
            "Sentiment": "neutral",
            "PublishDate": 1732676237000,
            "Source": "normal_news"
        },
        {
            "Title": "MAS Financial Targets 20-25% AUM Growth in Medium to Long-Term",
            "Summary": "MAS Financial Services has announced its aim to grow its Assets Under Management (AUM) by 20% to 25% over the medium to long-term, according to an investor presentation. This growth target indicates the company's ambitious expansion plans and confidence in its business model.",
            "Sentiment": "positive",
            "PublishDate": 1729694779000,
            "Source": "corporate_action"
        },
        {
            "Title": "MAS Financial Services Reports Slight Increase in Q2 NPAs",
            "Summary": "MAS Financial Services has reported its Q2 financial results. The Gross Non-Performing Assets (GNPA) increased to 2.36% from 2.29% in the previous quarter. Similarly, the Net Non-Performing Assets (NNPA) rose to 1.57% from 1.52% quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1729680318000,
            "Source": "result"
        },
        {
            "Title": "MAS Financial Services Reports Q2 Revenue Growth",
            "Summary": "MAS Financial Services has announced its second quarter revenue for the current fiscal year. The company reported revenue of 3.84 billion rupees, compared to 3.1 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729680024000,
            "Source": "result"
        },
        {
            "Title": "MAS Financial Services Reports Q2 Profit Growth",
            "Summary": "MAS Financial Services has reported a consolidated net profit of 678 million rupees for the second quarter, showing year-over-year growth from 612 million rupees. The profit also increased quarter-over-quarter from 717 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1729680013000,
            "Source": "result"
        },
        {
            "Title": "MAS Financial Services Partners with UCO Bank for MSME Lending",
            "Summary": "MAS Financial Services has entered into a strategic co-lending partnership with UCO Bank. This collaboration aims to provide lending services to Micro, Small and Medium Enterprises (MSME).",
            "Sentiment": "positive",
            "PublishDate": 1729520545000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mas Financial: Plans for ₹500 Crore Fundraise",
            "Summary": "<p><span class='neutral'>Mas Financial Services</span> plans to raise <span class='positive'>₹500 crore</span> through a <b>rights issue</b>. The funds will be used to <span class='positive'>expand</span> the company's <b>loan portfolio</b>, particularly in the <span class='neutral'>micro-enterprise</span> and <span class='neutral'>SME segments</span>. This move aims to support the company's <span class='positive'>growth strategy</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1726576184000,
            "Source": "corporate_action"
        }
    ]
}