{
    "Symbol": "MASTEK",
    "ISIN": "INE759A01021",
    "News": [
        {
            "Title": "Mastek Expands Leeds Office with 100-Seat Facility",
            "Summary": "Mastek announces expansion of its Leeds office with a 100-seat facility, reinforcing its commitment to AI-led innovation and long-term investment in the UK market.",
            "Sentiment": "positive",
            "PublishDate": 1770810625222,
            "Source": "stocks"
        },
        {
            "Title": "Zensar Tech to Acquire 18-20% Stake in Mastek",
            "Summary": "Zensar Technologies plans strategic acquisition of 18-20% stake in Mastek for approximately $200 million, with potential expansion to $400 million investment.",
            "Sentiment": "positive",
            "PublishDate": 1770093558451,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mastek Expects Steady Bottom-Line Performance Growth",
            "Summary": "Mastek management provides positive guidance on maintaining steady bottom-line performance with continued improvements expected in upcoming periods during recent concall.",
            "Sentiment": "positive",
            "PublishDate": 1769051997214,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mastek declares ₹8 interim dividend, Q3FY26 results",
            "Summary": "Mastek Limited declared interim dividend of ₹8 per share with record date January 30, 2026, and approved Q3FY26 unaudited financial results showing consolidated revenue of ₹90,568 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1768939187203,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mastek Allots 1,722 Equity Shares Under ESOP Plan",
            "Summary": "Mastek Limited allotted 1,722 equity shares to employees under ESOP Plan VII on January 16, 2026. The allotment increased the company's paid-up share capital to ₹15.50 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1768574020608,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mastek Board to Consider Interim Dividend on Jan 20",
            "Summary": "Mastek Limited has scheduled a board meeting for January 20, 2026, to consider declaring an interim dividend for FY26, following their earlier disclosure dated January 9, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768463218260,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mastek winds up Malaysian step-down subsidiary",
            "Summary": "Mastek Limited announces voluntary winding up of step-down subsidiary Mastek Systems (Malaysia) Sdn. Bhd., which contributed 0.27% to consolidated turnover. Company states the closure will not impact overall business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1767967722555,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mastek Malaysia Unit Begins Voluntary Winding Up",
            "Summary": "Mastek's Malaysian subsidiary has initiated voluntary winding up proceedings, marking a strategic restructuring move by the IT services company in the Southeast Asian market.",
            "Sentiment": "neutral",
            "PublishDate": 1767967408839,
            "Source": "stocks"
        },
        {
            "Title": "Mastek Q3FY26 Results & Earnings Call on Jan 20-21",
            "Summary": "Mastek Limited announces board meeting on January 20, 2026 to approve Q3FY26 financial results, followed by earnings conference call on January 21, 2026 at 6:30 PM IST for investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1767961897304,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mastek Sees ₹36.48 Cr NSE Block Trade at ₹2049/Share",
            "Summary": "Mastek Ltd. witnessed a significant block trade on NSE worth ₹36.48 crores involving approximately 178,036 shares at ₹2049.00 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767939680447,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mastek Sees ₹20.51 Cr NSE Block Trade at ₹2,081.10",
            "Summary": "Mastek Ltd. witnessed a significant block trade on NSE worth ₹20.51 crores involving approximately 98,565 shares at ₹2,081.10 per share, indicating substantial institutional interest in the IT software company.",
            "Sentiment": "neutral",
            "PublishDate": 1767855266554,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mastek Appoints Google CIO Marc Berson to Board",
            "Summary": "Mastek Limited announces appointment of Marc Berson, Head of Google Internal Systems (CIO), to board of directors effective January 1, 2026, strengthening North American presence and AI strategy.",
            "Sentiment": "positive",
            "PublishDate": 1767070123146,
            "Source": "stocks"
        },
        {
            "Title": "Mastek Allots 5,990 Equity Shares Under Employee Stock Option Plans",
            "Summary": "Mastek's Stakeholders Relationship Committee approved the allotment of 5,990 equity shares of Rs. 5 each to eligible employees who exercised their vested options under ESOP Plans VI and VII. The allotment increased the company's paid-up share capital from Rs. 15,49,03,245 to Rs. 15,49,33,195, with the new shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764654586543,
            "Source": "corporate_action"
        },
        {
            "Title": "Mastek Appoints Deepak Kedia As New CFO",
            "Summary": "Mastek has appointed Deepak Kedia as the company's new Chief Financial Officer.",
            "Sentiment": "neutral",
            "PublishDate": 1762873774538,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mastek Wins Best Enterprise-Wide AI Transformation Award at ET Making AI Work Awards 2025",
            "Summary": "Mastek has been recognized with the Best Enterprise-Wide AI Transformation (Mid-sized Co.) award at The Economic Times Making AI Work Awards 2025. The company implemented its ADOPT AI framework across core operations, equipping over 3,600 employees with AI skills. Mastek's AI initiatives include platforms like AI Amigo and ITSM Agents, delivering up to 30% efficiency gains in software delivery and 20% faster requirement-to-deployment cycles. Resolution.AI reduced incident resolution time from 8 hours to 4 hours, while Response.AI ensures 100% SLA compliance. Over 60% of internal workflows including recruitment, sales, and IT operations are now AI-enabled through tools such as SalesCopilot, TalentGenius, and PolicyHelper. CEO Umang Nahata stated that AI is something the company lives by, emphasizing their Lead with AI approach to make AI purposeful, responsible, ethical, and outcome-driven.",
            "Sentiment": "positive",
            "PublishDate": 1762243288900,
            "Source": "stock"
        },
        {
            "Title": "Mastek Partners with KarbonWise to Enhance Sustainability and ESG Capabilities",
            "Summary": "Mastek announced a strategic partnership with KarbonWise, an AI-powered sustainability solutions provider, to accelerate their sustainability and ESG vision. The collaboration will embed enhanced carbon accounting capabilities and life-cycle emissions assessments, focusing on Scope 3 emissions across the value chain to identify carbon-intensive hotspots and progress toward net zero. Mastek will leverage KarbonWise's AI-driven platform and advisory services to translate sustainability commitments into verifiable action, including responsible ESG disclosures and embedding sustainability practices across clients, partners, and internal operations. KarbonWise brings expertise in carbon management, life-cycle analysis, and ESG reporting, with its platform integrating Life Cycle Assessments and Product Carbon Footprints. The partnership enables enterprises to unlock sustainability opportunities within their value chains using AI-enabled insights to improve agility, reduce carbon intensity, and achieve measurable ESG outcomes.",
            "Sentiment": "positive",
            "PublishDate": 1761893305282,
            "Source": "stock"
        },
        {
            "Title": "Mastek Reports AI-Led Growth Strategy with 25+ New Deals and 13% Backlog Increase",
            "Summary": "Mastek has secured over 25 new deals and reported a 13% year-over-year increase in backlog. The company is experiencing expanding momentum in the UK and Europe markets. Mastek projects sustainable growth driven by artificial intelligence initiatives and expects margin expansion through improved delivery efficiencies and GenAI transformation capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1760639442554,
            "Source": "stock"
        },
        {
            "Title": "Mastek Limited Reports Q2 FY2026 Financial Results with Revenue Growth",
            "Summary": "Mastek Limited's Board approved unaudited consolidated and standalone financial results for the quarter and six months ended September 30, 2025. Consolidated revenue from operations increased to Rs. 94,037 lakhs in Q2 FY2026 from Rs. 86,739 lakhs in Q2 FY2025. Net profit for the quarter was Rs. 9,745 lakhs compared to Rs. 12,865 lakhs in the previous year quarter. For the six-month period, revenue grew to Rs. 185,507 lakhs from Rs. 168,028 lakhs, while net profit decreased to Rs. 18,950 lakhs from Rs. 20,015 lakhs. The company reported basic earnings per share of Rs. 31.48 for the quarter and Rs. 61.23 for the six-month period. UK & Europe operations contributed Rs. 60,622 lakhs in quarterly revenue, North America operations Rs. 21,275 lakhs, and AMEA region Rs. 12,140 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1760600614985,
            "Source": "earnings"
        },
        {
            "Title": "Mastek Enhances Harmony Australasia's HR System with AI-Driven Oracle HCM Cloud",
            "Summary": "Mastek has enhanced Harmony Australasia's HR system by implementing AI-driven Oracle HCM Cloud technology along with Redwood UX/UI interface. The upgrade represents a technology modernization initiative for Harmony Australasia's human resources operations.",
            "Sentiment": "positive",
            "PublishDate": 1759129884033,
            "Source": "stock"
        },
        {
            "Title": "Mastek Announces Leadership Change in HR Department",
            "Summary": "Mastek has announced the resignation of Global Chief Human Resources Officer Arvind Jonnalagadda and the appointment of Vimal Dangri as the new Chief Human Resources Officer.",
            "Sentiment": "neutral",
            "PublishDate": 1758730770731,
            "Source": "corporate_governance"
        },
        {
            "Title": "Grant Thornton UK LLP Resigns as Auditor of Mastek's UK Subsidiary",
            "Summary": "Grant Thornton UK LLP resigned as statutory auditor of Mastek (UK) Limited, a material subsidiary of Mastek Limited, effective September 17, 2025. The auditing firm was not reappointed following an audit tender process. Grant Thornton confirmed there are no matters connected with their resignation that should be brought to the attention of members or creditors. The firm had been serving as auditor since FY 2020 on a yearly re-appointment basis, with their latest audit report for the financial year ended March 31, 2024, signed on March 31, 2025. Mastek Limited disclosed this information to stock exchanges BSE and NSE under regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1758195173962,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mastek Wins 'Voice of the Customer Honor – Value Excellence' Award at Everest Group Elevate Honors 2025",
            "Summary": "Mastek Limited received the 'Voice of the Customer Honor – Value Excellence' Award at Everest Group Elevate Honors 2025. The recognition was based on feedback from over 400 customers, with Mastek scoring in the top percentile for customer service excellence, client management, ease of doing business, and proactive engagement. Everest Group is a leading global research firm that launched this inaugural recognition program at Elevate in Dallas in September 2025. CEO Umang Nahata stated the award reflects customer trust and validates their approach of delivering meaningful business outcomes. He mentioned Mastek has over 3,500 trained AI professionals and is positioned to lead with AI capabilities. Mastek operates in 40+ countries with nearly 5,000 employees, serving 400+ active customers across sectors including Public Sector, Healthcare, Retail, Manufacturing, Higher Education, and Financial Services through partnerships with Oracle, AWS, Microsoft, Snowflake, and Salesforce.",
            "Sentiment": "positive",
            "PublishDate": 1758007952982,
            "Source": "stock"
        },
        {
            "Title": "Hi5 Youth Foundation to Acquire 1.62% Stake in Mastek Limited Through Gift from Promoter",
            "Summary": "Hi5 Youth Foundation plans to acquire 500,000 equity shares representing 1.62% of Mastek Limited through a gift from promoter Sundar Radhakrishnan. The proposed transaction is scheduled for September 19, 2025, with no monetary consideration involved. Sundar Radhakrishnan owns 60% in Hi5 Youth Foundation and is a promoter of Mastek Limited. Following the transaction, Hi5 Youth Foundation will be classified as part of Mastek's promoter and promoter group. The acquisition falls under inter-se transfer among qualifying persons and is exempt from open offer requirements. The 60-day volume weighted average market price for Mastek shares was Rs. 2,507.11 on the National Stock Exchange. Post-transaction, Sundar Radhakrishnan's holding will decrease from 4.22% to 2.60%, while the total promoter and promoter group shareholding will remain at 35.79%.",
            "Sentiment": "neutral",
            "PublishDate": 1757919086741,
            "Source": "corporate_action"
        },
        {
            "Title": "Mastek Appoints Raghavendra Jha as Chief Financial Officer",
            "Summary": "Mastek announced the appointment of Raghavendra Jha as Chief Financial Officer, effective May 19, 2025. Jha brings over two decades of cross-sectoral experience in IT, manufacturing, metals, and retail. He previously served as CFO at Tessolve and Inspira Enterprise, and held strategic finance leadership roles at Wipro, Landmark Group, and Tata Steel. At Wipro, he led Finance Shared Services for the Middle East and served as CFO for various Strategic Business Units. A Chartered Accountant with expertise in cross-border transactions, IPO and M&A processes, Jha will support Mastek's global expansion and growth strategy. CEO Umang Nahata stated that Jha's leadership will be pivotal as the company evolves its global footprint and drives stakeholder value.",
            "Sentiment": "positive",
            "PublishDate": 1757130774389,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mastek UK Named Supplier on NHS London's Digital Transformation Framework",
            "Summary": "Mastek UK has been selected as a supplier on the NHS London Procurement Partnership's DTCS (Digital Transformation for Clinical Services) Framework. This appointment positions the company to participate in driving clinical digital transformation initiatives within the NHS London network.",
            "Sentiment": "positive",
            "PublishDate": 1757070234944,
            "Source": "stock"
        },
        {
            "Title": "Mastek Celebrates 30 Years of NSE Listing, Reports Strong Financial Performance",
            "Summary": "Mastek marked 30 years since its listing on the National Stock Exchange, having originally listed on BSE in 1993 and NSE in 1995. The AI-first digital engineering and cloud transformation company operates across 40+ countries with over 5,000 professionals. The company underwent a strategic shift with the demerger of Majesco in 2014 and expanded through acquisitions including TAISTech (2016), Evosys (2020), MST Solutions (2022), and BizAnalytica (2023). Mastek reported revenue of ₹905.4 crore in Q4 FY25, representing a 16.1% year-over-year increase, with EBITDA at ₹138.8 crore. In Q1 FY26, net profit rose nearly 29% year-over-year while the stock gained 13%. The company launched its ADOPT.AI suite featuring 80+ AI Agent assets and 100+ use cases, and has trained 3,600+ professionals in GenAI through its AI Academy. CEO Umang Nahata emphasized the company's focus on AI-powered solutions and sustainable growth.",
            "Sentiment": "positive",
            "PublishDate": 1753959239687,
            "Source": "stock"
        },
        {
            "Title": "Mastek Achieves Great Place to Work Certification Across Five Countries",
            "Summary": "Mastek has been certified as a Great Place to Work in India, UK, USA, KSA, and UAE. The company achieved a 76% score in the GPTW survey, significantly higher than regional averages of 57% in the U.S., 52% in Europe, and 53% in U.S. & Canada. Key performance metrics include 85% of employees believing management promotes inclusive behavior, 81% feeling they can be themselves at work, and 80% viewing Mastek's corporate image positively. This marks the first GPTW recognition for Mastek's UAE team. CEO Umang Nahata emphasized that the recognition reflects the company's culture of integrity, dignity, and trust, while highlighting their AI Academy and ADOPT.AI initiatives. Mastek operates in over 40 countries with close to 5,000 employees and serves 400+ active customers across sectors including Public Sector, Healthcare, Retail, Manufacturing, Higher Education, and Financial Services.",
            "Sentiment": "positive",
            "PublishDate": 1753776395861,
            "Source": "stock"
        },
        {
            "Title": "Mastek Reports 13.2% Revenue Growth in Q1 FY26 Driven by Strong UK Performance",
            "Summary": "Mastek Limited reported total income growth of 13.2% year-on-year and net profit growth of 28.7% for the quarter ended June 30, 2025. Revenue reached INR 915 crores with sequential growth of 1%. The UK & Europe business drove growth with 27% year-on-year increase, benefiting from expansion in healthcare, government, and enterprise sectors including a significant BFSI deal worth over $15 million. The US market faced headwinds from reduced client spending in retail and healthcare sectors, resulting in flat year-on-year performance and 8.5% quarter-on-quarter decline. Operating EBITDA margins stood at 15%, impacted by discount offered to largest client and continued investments in AI capabilities. The company is working on AI initiatives across more than 10 accounts in the US and secured AI-led testing automation deals. Order backlog grew to $274 million with 3.5% quarter-on-quarter growth. Cash position decreased to INR 549 crores from INR 622 crores due to variable payouts and debt repayment. Management is in advanced stages of hiring a US President and CFO.",
            "Sentiment": "positive",
            "PublishDate": 1753440812370,
            "Source": "earnings"
        },
        {
            "Title": "Mastek Shares Surge 13% Following Strong Quarterly Profit Growth",
            "Summary": "Mastek shares jumped 13.08% to reach an intraday high of Rs 2,755 on BSE after reporting strong quarterly results. The company posted a 28.7% year-on-year increase in net profit to Rs 92 crore, compared to Rs 71.5 crore in the same quarter last year. Operating EBITDA grew 10.8% year-on-year, though margins declined slightly to 15% due to investments in talent and capabilities. The stock is trading above all moving averages from 5-day to 200-day, indicating strong upward momentum. Analysis shows the company's trailing twelve-month PE ratio is below its historical averages, suggesting attractive valuation. Mastek demonstrates consistent profit growth with improving margins, maintains low debt levels, and has zero promoter pledge, contributing to increased market confidence.",
            "Sentiment": "positive",
            "PublishDate": 1753081598466,
            "Source": "earnings"
        },
        {
            "Title": "Mastek Shares Surge 12% Despite Weak Quarterly Performance on Strong UK Growth and Profit Jump",
            "Summary": "Mastek shares jumped 12% despite mixed quarterly results. The company's constant currency revenue declined 1.1% sequentially after four quarters of growth, and margins fell to 15% from 15.3% in the previous quarter. However, net profit increased 13.5% sequentially, aided by higher other income. Key positive factors include the company's healthy cash position of ₹549 crore, strong 9.6% sequential growth in its core UK geography (which contributes 64% of revenue), and healthy order wins up 2.5% quarterly and 8.3% year-over-year. The stock traded at ₹2,782, approaching its 52-week high of ₹3,375, though remains down 8% year-to-date. An India-UK Free Trade Agreement signing was also mentioned as relevant news.",
            "Sentiment": "positive",
            "PublishDate": 1753075572086,
            "Source": "stock"
        },
        {
            "Title": "Mastek Reports 29% Profit Growth and 12.5% Revenue Increase in Q1 Results",
            "Summary": "Mastek Ltd delivered strong quarterly results with net profit rising 28.7% to ₹92 crore compared to ₹71.5 crore in the same quarter last year. Revenue grew 12.5% to ₹914.7 crore from ₹812.9 crore previously. EBITDA increased 10.8% to ₹137.3 crore versus ₹123.8 crore year-on-year. Operating margin remained stable at 15.1%, slightly down from 15.2% in the corresponding quarter, reflecting controlled costs despite growth-related expenses. Mastek shares closed 1.56% lower at ₹2,499.80 on the NSE ahead of the results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1752847021497,
            "Source": "earnings"
        },
        {
            "Title": "Mastek Reports Q1 Financial Results",
            "Summary": "Mastek has released its Q1 financial results. The company reported an EBIT of 1.2 billion rupees, unchanged from the previous quarter. The EBIT margin slightly decreased to 13% from 13.26% in the previous quarter. Consolidated net profit increased to 921 million rupees from 811 million rupees in the previous quarter. Revenue also saw a slight increase to 9.15 billion rupees from 9.05 billion rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1752843753000,
            "Source": "result"
        },
        {
            "Title": "Mastek Introduces 'Adopt.AI' Solution Package",
            "Summary": "Mastek has launched 'Adopt.AI', a comprehensive AI solutions package designed to accelerate innovation and facilitate scalable AI adoption in businesses. The package aims to help companies integrate AI technologies more effectively into their operations.",
            "Sentiment": "positive",
            "PublishDate": 1750330488000,
            "Source": "default"
        },
        {
            "Title": "Mastek Awarded NHS England Cybersecurity Training Contract",
            "Summary": "Mastek has been awarded a contract by NHS England to provide Board and SIRO (Senior Information Risk Owner) cybersecurity training. This contract involves delivering cybersecurity education to key personnel within the National Health Service in England.",
            "Sentiment": "positive",
            "PublishDate": 1750118879000,
            "Source": "default"
        },
        {
            "Title": "Mastek Secures NHS England Cybersecurity Training Contract",
            "Summary": "Mastek has been awarded a contract by NHS England to provide cybersecurity training for board members and Senior Information Risk Officers (SIRO). The training will focus on enhancing cybersecurity knowledge and practices within the NHS.",
            "Sentiment": "positive",
            "PublishDate": 1750074469000,
            "Source": "default"
        },
        {
            "Title": "Mastek Deploys Oracle Cloud for Air Niugini's Digital Transformation",
            "Summary": "Mastek has successfully implemented Oracle Cloud solutions for Air Niugini, Papua New Guinea's national airline. This deployment is part of Air Niugini's digital transformation initiative, aimed at enhancing operational efficiency and customer experience. The implementation includes Oracle Cloud Enterprise Resource Planning (ERP) and Oracle Cloud Enterprise Performance Management (EPM) solutions.",
            "Sentiment": "positive",
            "PublishDate": 1748243529000,
            "Source": "default"
        },
        {
            "Title": "Mastek Partners with Zulekha Healthcare for Digital Transformation",
            "Summary": "Mastek has formed a partnership with Zulekha Healthcare Group to implement Oracle Fusion Cloud for digital transformation purposes. This collaboration aims to enhance Zulekha's healthcare operations through advanced cloud technology.",
            "Sentiment": "positive",
            "PublishDate": 1746689038000,
            "Source": "default"
        },
        {
            "Title": "Mastek Ltd Reports Q4 Financial Results",
            "Summary": "Mastek Ltd announced its Q4 consolidated net profit of 810 million rupees, compared to 944 million rupees year-over-year and 947 million rupees quarter-over-quarter. The company's Q4 revenue increased to 9 billion rupees from 7.8 billion rupees year-over-year and 8.7 billion rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745194841000,
            "Source": "default"
        },
        {
            "Title": "Mastek Reports Q4 Financial Results and Announces Dividend",
            "Summary": "Mastek has released its Q4 financial results, showing a mixed performance. The company's EBIT decreased slightly to 1.2B rupees from 1.24B rupees in the previous quarter, with EBIT margin dropping to 13.26% from 14.27%. Consolidated net profit declined to 811M rupees from 947M rupees quarter-on-quarter. However, revenue increased to 9.05B rupees from 8.7B rupees. Additionally, Mastek has recommended a final dividend of Rs 16 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1745064015000,
            "Source": "result"
        },
        {
            "Title": "Mastek: Q4 Profit Dips 14% YoY, Revenue Grows 12%, Declares Rs 16 Dividend",
            "Summary": "Mastek's Q4FY25 net profit declined 14.1% YoY to Rs 81.1 crore, while revenue grew 16.6% YoY to Rs 905.4 crore. The company's board proposed a final dividend of Rs 16 per share. Operating EBITDA increased 10.9% YoY, but margins contracted to 15.3%.",
            "Sentiment": "neutral",
            "PublishDate": 1745037894000,
            "Source": "earnings"
        },
        {
            "Title": "HDFC Institutional Equities Reports on Mastek's Revenue Sources",
            "Summary": "HDFC Institutional Equities has reported that NHS England is a significant client for Mastek, contributing approximately 22% of its revenue. Additionally, the UK government and healthcare verticals together account for about 60% of Mastek's total revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1742805260000,
            "Source": "normal_news"
        },
        {
            "Title": "HDFC Institutional Equities Reports on Mastek's Dependency on NHS England",
            "Summary": "HDFC Institutional Equities has reported that NHS England is a major client for Mastek, contributing 22% of the company's revenue. The report also mentions potential short-term uncertainty and delays due to ongoing merger activities.",
            "Sentiment": "neutral",
            "PublishDate": 1742805255000,
            "Source": "normal_news"
        },
        {
            "Title": "Mastek Ltd: Shares Surge 13% Amid Midcap IT Rebound",
            "Summary": "Mastek Ltd shares jumped 13% on March 18, breaking a five-day losing streak. The stock is the top gainer on the Nifty 500 index. Analysts have price targets above ₹3,000, with the highest at ₹3,500. Trading volume has significantly increased, with 17 lakh shares traded compared to 2 lakh the previous day.",
            "Sentiment": "positive",
            "PublishDate": 1742276991000,
            "Source": "normal_news"
        },
        {
            "Title": "Mastek Ltd: Secures Spot on UK's Digital Health Framework",
            "Summary": "Mastek Ltd has been named a supplier on the UK Crown Commercial Service's RM6345 Digital Capability for Health 2 (DCfH 2) framework. The three-year agreement, with a possible one-year extension, allows Health and Social Care organizations to access Mastek's digital transformation services. The framework covers DevOps, digital definition, build and transition, end-to-end development, and data management services.",
            "Sentiment": "positive",
            "PublishDate": 1741256490000,
            "Source": "order&deals"
        },
        {
            "Title": "Mastek Named Supplier on UK Crown Commercial Service's Digital Health Framework",
            "Summary": "Mastek has been selected as a supplier on the UK Crown Commercial Service's Digital Capability for Health 2 (DCFH 2) Framework. This framework is likely designed to provide digital services and solutions to the UK's health sector.",
            "Sentiment": "positive",
            "PublishDate": 1741252728000,
            "Source": "corporate_action"
        },
        {
            "Title": "SEBI Issues Administrative Warning to Mastek's Compliance Officer",
            "Summary": "Mastek has received an administrative warning letter from the Securities and Exchange Board of India (SEBI) addressed to the company's Compliance Officer. The warning pertains to the identification of certain information as Unpublished Price Sensitive Information (UPSI).",
            "Sentiment": "negative",
            "PublishDate": 1740742825000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mastek Secures $85 Million in UK Public Service Contracts",
            "Summary": "Mastek has secured multi-year contracts worth $85 million over a two-year period from the UK Public Service Department. These contracts represent significant business growth for the company in the public sector market.",
            "Sentiment": "positive",
            "PublishDate": 1740615332000,
            "Source": "order&deals"
        },
        {
            "Title": "Mastek Secures $85 Million in Contracts from UK Public Service Department",
            "Summary": "Mastek has announced securing multi-year, multi-million dollar contracts from the UK Public Service Department. The total value of these contracts is reported to be $85 million over a two-year period. This represents a significant business win for the company in the public sector domain.",
            "Sentiment": "positive",
            "PublishDate": 1740577478000,
            "Source": "order&deals"
        },
        {
            "Title": "Mastek Partners with OpenAna to Accelerate AI-Driven Innovation",
            "Summary": "Mastek, a technology company, has entered into a partnership with OpenAna to enhance their AI-driven innovation capabilities. This collaboration aims to accelerate the development and implementation of artificial intelligence solutions, potentially improving Mastek's service offerings and technological competitiveness.",
            "Sentiment": "positive",
            "PublishDate": 1739169905000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mastek Ltd.: CEO Targets 17% Operating Margins by H1 FY26",
            "Summary": "Mastek's new CEO, Umang Nahata, is confident of improving operating margins to over 17% in the next 2-3 quarters. The company reported a 16.2% margin in Q3, down 85 basis points YoY. Nahata expects steady topline growth, citing a strong UK business order backlog. Mastek closed Q3 with a $250 million order backlog and recently secured an additional $40 million deal.",
            "Sentiment": "positive",
            "PublishDate": 1737257491000,
            "Source": "earnings"
        }
    ]
}