{
    "Symbol": "MASTERTR",
    "ISIN": "INE677D01037",
    "News": [
        {
            "Title": "Master Trust's Subsidiary Receives SEBI In-Principle Approval for Mutual Fund Sponsorship",
            "Summary": "Master Trust Limited announced that its wholly owned subsidiary, Master Capital Services Limited, has received in-principle approval from SEBI to sponsor and set up a mutual fund. The approval was granted via SEBI's letter dated November 11, 2025. Master Capital Services will now establish an Asset Management Company and a Trustee Company in accordance with SEBI Mutual Funds Regulations, 1996. The subsidiary will be able to launch mutual fund schemes including Specialized Investment Fund category. Final approval for mutual fund registration remains subject to fulfilling requirements stipulated by SEBI.",
            "Sentiment": "positive",
            "PublishDate": 1763023658792,
            "Source": "mutualfunds"
        },
        {
            "Title": "Master Trust Limited Reports Quarterly Financial Results for September 2025",
            "Summary": "Master Trust Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. On a standalone basis, the company reported total revenue from operations of Rs. 61.6 million for the quarter, compared to Rs. 49.3 million in the same period last year. Interest income increased to Rs. 51.7 million from Rs. 44.1 million year-over-year. Total expenses for the quarter were Rs. 16.6 million versus Rs. 23.5 million in the previous year. On a consolidated basis, total revenue from operations reached Rs. 1,268.6 million for the quarter, down from Rs. 1,537.2 million in the corresponding quarter of the previous year. The consolidated results include six subsidiary companies: Master Capital Services Limited, Master Infrastructure and Real Estate Developers Limited, Master Insurance Brokers Limited, and three step-down subsidiaries. The company operates as a registered NBFC with RBI and has multiple business segments including broking, interest income, portfolio management services, and insurance broking.",
            "Sentiment": "neutral",
            "PublishDate": 1762431194442,
            "Source": "earnings"
        },
        {
            "Title": "Master Trust Reports Q1 EBITDA Drop to 518M Rupees with Improved Margin",
            "Summary": "Master Trust reported Q1 EBITDA of 518 million rupees, down from 619 million rupees in the same quarter last year. Despite the decline in absolute EBITDA, the company's EBITDA margin improved to 39.35% compared to 38.61% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753806480760,
            "Source": "earnings"
        },
        {
            "Title": "Master Trust Limited Reports Financial Performance for Quarter Ended June 30, 2025",
            "Summary": "Master Trust Limited, a financial services company with 40+ years of legacy, reported its quarterly results. The company recorded total income of Rs 1,316.6 million, EBITDA of Rs 518.1 million, and profit after tax of Rs 271.1 million for the quarter ended June 30, 2025. Earnings per share stood at Rs 2.4. The company operates through 56 branches across 22 states in India, serving over 4,21,000 registered customers with 1,230+ employees. Master Trust offers trading and investment solutions including equities, derivatives, currencies, commodities, mutual funds, insurance, and portfolio management services. The company was listed on NSE on November 12, 2024, and has applied to SEBI for setting up a Mutual Fund Asset Management Company. The company has signed 2 merchant banking mandates and continues its StreetXperts educational initiative with webinars on financial topics.",
            "Sentiment": "neutral",
            "PublishDate": 1753790679428,
            "Source": "stock"
        },
        {
            "Title": "Master Trust Limited Reports Q1 Results, Receives Workplace Recognition and Advances Mutual Fund AMC Plans",
            "Summary": "Master Trust Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported total revenue of Rs. 49.4 million and profit after tax of Rs. 20.0 million, with earnings per share of Rs. 0.2. Consolidated results showed total revenue of Rs. 1,316.6 million and profit after tax of Rs. 271.1 million, with earnings per share of Rs. 2.4. The company received recognition from ET Now as one of the Best Organizations to work in 2025. Master Trust Group is launching a Mutual Fund AMC and has filed an application with SEBI. The company operates as a registered NBFC with RBI and has six subsidiaries including Master Capital Services Limited, Master Infrastructure & Real Estate Developers Limited, and Master Insurance Brokers Limited.",
            "Sentiment": "positive",
            "PublishDate": 1753787965110,
            "Source": "earnings"
        },
        {
            "Title": "Master Trust: Applies for Mutual Fund Business License",
            "Summary": "Master Trust has applied to SEBI for a mutual fund business license through its flagship company, Master Capital Services Limited. The firm plans to offer equity mutual fund schemes across market capitalizations and a multi-asset scheme, focusing on retail and institutional investors. Master Trust currently serves over 4.2 lakh investors and aims to leverage its digital infrastructure and experience in the financial services sector.",
            "Sentiment": "positive",
            "PublishDate": 1751513740000,
            "Source": "corporate_action"
        },
        {
            "Title": "Master Trust Subsidiary Applies for Mutual Fund License",
            "Summary": "A subsidiary of Master Trust has submitted an application to the Securities and Exchange Board of India (SEBI) for a mutual fund license. This move indicates the company's intention to enter the mutual fund industry.",
            "Sentiment": "positive",
            "PublishDate": 1751369668000,
            "Source": "default"
        },
        {
            "Title": "Master Trust Reports Q4 Financial Results",
            "Summary": "Master Trust has announced its Q4 consolidated financial results. The company's net profit for the quarter stands at 245.5 million rupees, compared to 378.7 million rupees year-over-year and 351.5 million rupees quarter-over-quarter. The Q4 revenue is reported at 1.22 billion rupees, down from 1.64 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1748529715000,
            "Source": "result"
        }
    ]
}