{
    "Symbol": "MATRIMONY",
    "ISIN": "INE866R01028",
    "News": [
        {
            "Title": "Matrimony.com Q3 FY26 Results Call on Feb 12",
            "Summary": "Matrimony.com Limited has scheduled an investor conference call on February 12, 2026 at 16:00 hours IST to discuss Q3/9M FY26 financial results, hosted by ICICI Securities.",
            "Sentiment": "neutral",
            "PublishDate": 1770392392917,
            "Source": "co_actions_results"
        },
        {
            "Title": "Matrimony Q3 PAT May Drop 21.8% YoY: ICICI Securities",
            "Summary": "ICICI Securities forecasts Matrimony's Q3 FY27 net profit to decline 21.8% YoY to ₹7.80 crores, with revenue expected to drop 1% YoY to ₹110.30 crores amid challenging market conditions.",
            "Sentiment": "negative",
            "PublishDate": 1769152517877,
            "Source": "co_actions_results"
        },
        {
            "Title": "Matrimony.com announces ₹58.50 cr share buyback",
            "Summary": "Matrimony.com Limited approves share buyback worth ₹58.50 crores at ₹655 per share, targeting 8.93 lakh shares representing 4.14% of equity capital with record date January 30, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768886798467,
            "Source": "co_actions_results"
        },
        {
            "Title": "Matrimony.com Shareholders Approve Buyback & Leadership",
            "Summary": "Matrimony.com Limited shareholders approved equity buyback and key leadership appointments through postal ballot voting concluded January 18, 2026, with all four resolutions passing decisively.",
            "Sentiment": "positive",
            "PublishDate": 1768886220031,
            "Source": "co_actions_results"
        },
        {
            "Title": "Matrimony.com Postal Ballot for Buyback & Board Changes",
            "Summary": "Company dispatches postal ballot notice for ₹58.5 cr share buyback at ₹655 per share, Managing Director reappointment for 2026-29, and Independent Director renewal with e-voting from Dec 20, 2025 to Jan 18, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1765777783130,
            "Source": "co_actions_results"
        },
        {
            "Title": "Matrimony.com Grants 7,000 Stock Options to Employees",
            "Summary": "Matrimony.com's board committee approved granting 7,000 stock options under ESOS 2014 to employees at an exercise price of ₹546 per share on December 15, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765776197741,
            "Source": "co_actions_results"
        },
        {
            "Title": "Matrimony.com Board to Consider Share Buyback Proposal",
            "Summary": "Matrimony.com Limited has scheduled a Board of Directors meeting on December 15, 2025, to consider and approve a proposal for buyback of its fully paid-up equity shares. The buyback proposal will be evaluated in accordance with applicable provisions of the Companies Act, 2013, SEBI Buyback Regulations, 2018, and other relevant laws.",
            "Sentiment": "neutral",
            "PublishDate": 1765164658193,
            "Source": "corporate_action"
        },
        {
            "Title": "Matrimony.com Reports 7% Billing Growth in Q2 FY26, Expects Double-Digit Growth in Q3",
            "Summary": "Matrimony.com achieved 7% billing growth year-on-year to INR 184 crores in Q2 FY26, though revenue declined 0.8% to INR 114.6 crores due to introduction of long-term packages creating a billing-revenue gap. The company expects double-digit billing growth in Q3 and anticipates profit improvements from Q4 onwards as the revenue recognition from longer-term packages flows through.",
            "Sentiment": "neutral",
            "PublishDate": 1763623342389,
            "Source": "earnings"
        },
        {
            "Title": "Matrimony.com Reports Mixed Q2 Results with 7% Billing Growth but 41% Profit Decline",
            "Summary": "Matrimony.com reported billings growth of 6.7% year-on-year to Rs 118.4 crores for the quarter ended September 30, 2025, while revenue declined 0.8% to Rs 114.6 crores. The company's profit after tax dropped significantly by 41.1% to Rs 7.8 crores, though management expects billing growth to improve in coming quarters due to business improvements and new monetization initiatives including ManyJobs and strategic investment in astrology platform BharatEkKhoj.",
            "Sentiment": "negative",
            "PublishDate": 1763060180970,
            "Source": "earnings"
        },
        {
            "Title": "Matrimony.com Expands Local Platform Focus and AI Integration for Growth",
            "Summary": "Matrimony.com is focusing on local platforms to capitalize on growing internet usage in smaller cities. The company is monetizing premium features and implementing AI tools to enhance user engagement and improve conversion rates.",
            "Sentiment": "positive",
            "PublishDate": 1755103947666,
            "Source": "stock"
        },
        {
            "Title": "Matrimony.com Reports Q1 FY2026 Financial Results with Revenue of Rs 11,533 Lakhs",
            "Summary": "Matrimony.com Limited announced its quarterly financial results for the period ended June 30, 2025. The company reported consolidated revenue from operations of Rs 11,533 lakhs, up from Rs 10,832 lakhs in the previous quarter. Net profit for the quarter stood at Rs 840 lakhs compared to Rs 818 lakhs in the prior quarter. The matchmaking services segment generated Rs 11,406 lakhs in revenue while marriage services & others contributed Rs 127 lakhs. On a standalone basis, the company recorded revenue of Rs 11,336 lakhs and net profit of Rs 817 lakhs. Basic earnings per share was Rs 3.89 for the quarter. The company's board approved both consolidated and standalone results, which were reviewed by statutory auditors BS R & Co. LLP.",
            "Sentiment": "positive",
            "PublishDate": 1755071754984,
            "Source": "earnings"
        },
        {
            "Title": "Matrimony Reports Decline in Q1 Financial Performance",
            "Summary": "Matrimony reported quarterly EBITDA of 189 million rupees compared to 269 million rupees in the previous year, representing a year-over-year decline. The company's EBITDA margin decreased to 15.6% from 21.16% in the same period last year. Consolidated net profit fell to 84 million rupees from 140 million rupees year-over-year. Revenue declined to 1.1 billion rupees compared to 1.2 billion rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1755071218329,
            "Source": "earnings"
        },
        {
            "Title": "Matrimony.com Declares Special Interim Dividend",
            "Summary": "Matrimony.com has announced a special interim dividend of 5 Rupees per share to celebrate the company's 25th anniversary (Silver Jubilee year). This corporate action demonstrates the company's commitment to rewarding shareholders as it marks a significant milestone.",
            "Sentiment": "positive",
            "PublishDate": 1742861286000,
            "Source": "corporate_action"
        },
        {
            "Title": "Matrimony.com Announces Special Interim Dividend",
            "Summary": "Matrimony.com has declared a special interim dividend of 5 rupees per share to celebrate the company's 25th anniversary (silver jubilee year).",
            "Sentiment": "positive",
            "PublishDate": 1742835843000,
            "Source": "corporate_action"
        },
        {
            "Title": "Matrimony.com Reports Q3 EBITDA Decline",
            "Summary": "Matrimony.com has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 206.3 million rupees, down from 228 million rupees in the same quarter last year. The EBITDA margin also decreased to 18.51% from 19.43% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738770598000,
            "Source": "earnings"
        },
        {
            "Title": "Matrimony.com Reports Decline in Q3 Revenue",
            "Summary": "Matrimony.com, a leading online matrimony service provider, has reported a decrease in its third-quarter revenue. The company's revenue for Q3 stood at 1.11 billion rupees, down from 1.17 billion rupees in the same quarter of the previous year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1738770588000,
            "Source": "earnings"
        },
        {
            "Title": "Matrimony.com Reports Q3 Financial Results",
            "Summary": "Matrimony.com has announced its consolidated net profit for the third quarter. The company reported a net profit of 99.7 million rupees, which is lower compared to both the previous year (111 million rupees) and the previous quarter (131.6 million rupees).",
            "Sentiment": "negative",
            "PublishDate": 1738770581000,
            "Source": "earnings"
        },
        {
            "Title": "Matrimony.com: Launches Entry-Level Job Portal Manyjobs.com",
            "Summary": "Matrimony.com has entered the job-search market with Manyjobs.com, targeting entry-level and frontline jobs. The portal focuses on sectors like BPO, customer service, retail, sales, and healthcare. Initially launching in Tamil Nadu, it aims for 1 million job-seekers, 100,000 job postings, and 25,000 companies in the next year. The company plans to monetize after two quarters.",
            "Sentiment": "positive",
            "PublishDate": 1732292141000,
            "Source": "corporate_action"
        },
        {
            "Title": "Matrimony.com Clarifies Role in Wedding Loans",
            "Summary": "Matrimony.com has issued a clarification regarding its involvement in wedding loans through WeddingLoan.com. The company states that it will only act as a facilitator for customers seeking loans and will not be directly involved in any lending activities.",
            "Sentiment": "neutral",
            "PublishDate": 1731933019000,
            "Source": "corporate_action"
        },
        {
            "Title": "Matrimony.com Reports Improved Q2 EBITDA and Margin",
            "Summary": "Matrimony.com has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 257.6 million rupees, up from 244 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 22.30% from 20.07% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730965337000,
            "Source": "result"
        },
        {
            "Title": "Matrimony.com Reports Q2 Revenue Decline",
            "Summary": "Matrimony.com, a company in the online matchmaking services sector, has reported its second quarter revenue. The company's revenue for Q2 stood at 1.15 billion rupees, showing a decrease from 1.22 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1730965286000,
            "Source": "result"
        },
        {
            "Title": "Matrimony.com Reports Increase in Q2 Net Profit",
            "Summary": "Matrimony.com, a leading online matrimony service provider, has reported a consolidated net profit of 132 million rupees for the second quarter, compared to 125 million rupees in the same period last year. This represents a year-over-year increase in profitability for the company.",
            "Sentiment": "positive",
            "PublishDate": 1730965264000,
            "Source": "result"
        },
        {
            "Title": "Matrimony.com: Rs 72 Crore Share Buyback Opens",
            "Summary": "Matrimony.com's Rs 72 crore share buyback offer opened on October 30 and will close on November 6. Eligible shareholders as of October 25 can participate. The last date for settlement is November 12. This is the company's second buyback, following one in July 2022.",
            "Sentiment": "neutral",
            "PublishDate": 1730368086000,
            "Source": "corporate_action"
        }
    ]
}