{
    "Symbol": "MAWANASUG",
    "ISIN": "INE636A01039",
    "News": [
        {
            "Title": "Mawana Sugars Gets Relief from ₹9.54 Cr IT Demand",
            "Summary": "Mawana Sugars Limited successfully challenged an Income Tax demand of ₹9.54 crores through rectification application under Section 154, with the IT Department dropping the entire demand after accepting the company's contentions.",
            "Sentiment": "positive",
            "PublishDate": 1769168457765,
            "Source": "stocks"
        },
        {
            "Title": "NCLT Approves Mawana Sugars-Mawana Foods Merger Motion",
            "Summary": "The National Company Law Tribunal has accepted the initial motion for the merger of Mawana Sugars Ltd and Mawana Foods. Shareholder and creditor meetings will be scheduled to proceed with the consolidation process.",
            "Sentiment": "positive",
            "PublishDate": 1766141146089,
            "Source": "co_actions_results"
        },
        {
            "Title": "SEBI Drops Case Against Mawana Sugars Executive",
            "Summary": "SEBI has discontinued adjudication proceedings against former executives of Mawana Sugars without imposing any financial penalty, marking the end of regulatory action in this matter.",
            "Sentiment": "positive",
            "PublishDate": 1765972205573,
            "Source": "stocks"
        },
        {
            "Title": "Mawana Sugars Receives ₹1.57 Crore Tax Demand Notice from Municipal Authority",
            "Summary": "Mawana Sugars Limited received a demand notice of ₹1,56,57,180 from Nagar Palika Parishad, Mawana for differential house tax and water tax covering financial years 2018-19 to 2024-25. The company must pay the balance amount by March 2026 to avoid a 20% surcharge, with the company seeking applicable rebate for timely payment.",
            "Sentiment": "negative",
            "PublishDate": 1765277013995,
            "Source": "stock"
        },
        {
            "Title": "Mawana Sugars Gets Exchange Approval for Promoter Group Reclassification",
            "Summary": "Mawana Sugars Limited received approval from NSE and BSE to reclassify promoter group entity Siel Infrastructure Estate Developers Private Limited as a public shareholder. The reclassification was approved under Regulation 31A of SEBI LODR Regulations, affecting the company's shareholding structure and governance framework.",
            "Sentiment": "neutral",
            "PublishDate": 1765195521276,
            "Source": "corporate_action"
        },
        {
            "Title": "Mawana Sugars Awaits NCLT Order on Amalgamation Scheme with Subsidiary",
            "Summary": "Mawana Sugars Limited has informed stock exchanges that the National Company Law Tribunal (NCLT) Delhi has reserved its order regarding the first motion application for the scheme of amalgamation of Mawana Foods Private Limited with Mawana Sugars Limited. The hearing was held on November 12, 2025, and the company is awaiting the tribunal's decision. The company will inform exchanges once the order is pronounced and uploaded on the NCLT website.",
            "Sentiment": "neutral",
            "PublishDate": 1762993206771,
            "Source": "corporate_action"
        },
        {
            "Title": "Mawana Sugars Applies for Reclassification of Siel Infrastructure Estate Developers from Promoter to Public Shareholder",
            "Summary": "Mawana Sugars Limited has submitted applications to BSE and NSE seeking approval to reclassify the shareholding of Siel Infrastructure Estate Developers Pvt. Ltd. (Siel IED) from Promoter/Promoters Group category to Public Shareholder category under SEBI (LODR) Regulations, 2015. The company informed the exchanges about this reclassification application through a formal communication signed by Company Secretary Ashok Kumar Shukla.",
            "Sentiment": "neutral",
            "PublishDate": 1762930775535,
            "Source": "corporate_action"
        },
        {
            "Title": "Mawana Sugars Reports Quarterly Loss, Approves Property Purchase and Shareholding Reclassification",
            "Summary": "Mawana Sugars Limited reported a net loss of Rs. 16.37 crores for the quarter ended September 30, 2025, compared to a loss of Rs. 13.66 crores in the previous quarter. Revenue from operations declined to Rs. 422.00 crores from Rs. 563.85 crores in the prior quarter. The Board approved the purchase of commercial property at Plot No. 3, Institutional Area, Sector 32, Gurugram for Rs. 28 crores from related party Usha International Limited, subject to regulatory approval. The company also approved reclassification of Siel Infrastructure Estate Developers Pvt. Ltd.'s shareholding from promoter group to public category. The sugar and power business segments continue to face seasonal challenges, with the company recognizing differential power revenue of Rs. 5.05 crores due to new tariff structure implementation.",
            "Sentiment": "negative",
            "PublishDate": 1762591299433,
            "Source": "earnings"
        },
        {
            "Title": "Mawana Sugars Commences Cane Crushing Operations for 2025-26 Season",
            "Summary": "Mawana Sugars Limited has started cane crushing operations for the 2025-26 crushing season at two of its units: Mawana Sugars Works in Mawana, Meerut and Nanglamal Sugar Complex in Nanglamal, Meerut. The operations commenced on October 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761901386930,
            "Source": "stock"
        },
        {
            "Title": "Mawana Sugars Receives Tax Notice for ₹1.22 Lakh Over Alleged Double E-way Bill Generation",
            "Summary": "Mawana Sugars Limited received a notice from the Office-Joint Commissioner S.G.S.T. Office, Meerut, alleging double e-way bill generation on invoices in three instances at its Nanglamal Sugar Complex unit. The tax authority imposed a liability of ₹1,22,415 under Section 74(5) of the CGST Act, 2017, comprising ₹54,225 in tax liability, ₹60,056 in interest, and ₹8,134 as penalty. The company has until September 26, 2025, to respond to the notice. Mawana Sugars stated the notice is factually incorrect and plans to file a reply within the stipulated timeframe. The company expects no financial impact beyond the imposed amount.",
            "Sentiment": "negative",
            "PublishDate": 1756291844477,
            "Source": "stock"
        },
        {
            "Title": "Mawana Sugars Reports Financial Results and Multiple Companies Announce AGM Dates",
            "Summary": "Mawana Sugars Limited published its unaudited financial results for the quarter ended June 30, 2025 in Business Standard newspaper in Hindi and English editions on August 4, 2025. The company reported a standalone net loss of Rs 13.66 crore for the quarter compared to a loss of Rs 3.70 crore in the same period last year. Total income from operations was Rs 399.52 crore versus Rs 387.70 crore in the previous year quarter. Several other companies also announced their Annual General Meeting schedules - HB Leasing and Finance Company Limited will hold its 42nd AGM on September 6, 2025, Northern Arc Capital Limited scheduled its 17th AGM for August 25, 2025, and Belstar Microfinance Limited announced financial results with total income from operations of Rs 4,143.44 million for the quarter. Philips India Limited issued a notice regarding transfer of equity shares to the Investor Education and Protection Fund Authority for unclaimed dividends.",
            "Sentiment": "neutral",
            "PublishDate": 1754304344241,
            "Source": "earnings"
        },
        {
            "Title": "Mawana Sugars Reports Q1 FY26 Loss of Rs 13.66 Crore, Plans Subsidiary Merger",
            "Summary": "Mawana Sugars Limited reported a net loss of Rs 13.66 crore for the quarter ended June 30, 2025, compared to a loss of Rs 3.70 crore in the same period last year. Revenue from operations increased to Rs 399.07 crore from Rs 386.69 crore year-on-year. The company's sugar segment generated revenue of Rs 409.17 crore, power segment Rs 35.77 crore, and distillery segment Rs 52.44 crore. The Board of Directors approved a scheme of arrangement for merging wholly-owned subsidiary Mawana Foods Private Limited with the company, subject to regulatory approvals. The company declared a final dividend of 10% (Rs 1.00 per share) for FY2025, amounting to Rs 3.91 crore. Mawana Sugars also received a demand of Rs 9.50 crore from excise authorities for export pass fees, which the company is contesting based on legal opinion.",
            "Sentiment": "negative",
            "PublishDate": 1754123539925,
            "Source": "earnings"
        },
        {
            "Title": "Mawana Sugars Schedules Board Meeting for Q2 Results and Merger Approval",
            "Summary": "Mawana Sugars Limited has scheduled a Board of Directors meeting for August 2, 2025, to review unaudited financial results for the quarter ended June 30, 2025, and approve a scheme of amalgamation with Mawana Foods Pvt. Ltd. The company will close its trading window for securities until August 4, 2025, following the declaration of results.",
            "Sentiment": "neutral",
            "PublishDate": 1753354059187,
            "Source": "corporate_action"
        },
        {
            "Title": "Mawana Sugars Reports Decline in Q3 Profit",
            "Summary": "Mawana Sugars has reported a profit before tax (PBT) of 219 million rupees for the third quarter, compared to 292 million rupees in the same period last year, representing a year-over-year decline. The company also disclosed an exceptional item of 613 million rupees, which could significantly impact its financial results.",
            "Sentiment": "negative",
            "PublishDate": 1739011138000,
            "Source": "earnings"
        },
        {
            "Title": "Mawana Sugars Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Mawana Sugars has reported a decrease in its third-quarter EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) to 294 million rupees, down from 407 million rupees in the same quarter of the previous year. The company's EBITDA margin also declined to 8.80% from 12.49% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739011133000,
            "Source": "earnings"
        },
        {
            "Title": "Mawana Sugars Reports Significant Profit Growth in Q3",
            "Summary": "Mawana Sugars has reported a substantial increase in consolidated net profit for the third quarter, rising to 725 million rupees from 176 million rupees in the same period last year. The company's revenue also saw a modest increase, reaching 3.34 billion rupees compared to 3.26 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1739011128000,
            "Source": "earnings"
        },
        {
            "Title": "Mawana Sugars Units Receive Notices from Delhi Anti-Corruption Branch",
            "Summary": "Units of Mawana Sugars have received notices from the Anti Corruption Branch of the Government of National Capital Territory of Delhi. The notices seek information regarding transactions conducted by an agent of the company in the purchase of sugar.",
            "Sentiment": "negative",
            "PublishDate": 1734348158000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mawana Sugars Sells Shares in Subsidiaries for ₹117 Crore",
            "Summary": "<p>Mawana Sugars has <span class='positive'>completed</span> the <span class='positive'>sale</span> of its <b>equity and preference shares</b> in two subsidiaries, <b>SIEL IE</b> and <b>SIEL IED</b>, for a total of <span class='positive'>117 crore rupees</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728628363000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mawana Sugar Completes Sale of Shares in Subsidiaries",
            "Summary": "<p>Mawana Sugar has <span class='positive'>completed</span> the <span class='positive'>sale</span> of its <b>equity</b> and <b>preference shares</b> in <b>SIEL IE</b> and <b>SIEL IED</b> for a total of <span class='positive'>117 crore rupees</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728628350000,
            "Source": "corporate_action"
        }
    ]
}