{
    "Symbol": "MAXESTATES",
    "ISIN": "INE03EI01018",
    "News": [
        {
            "Title": "Max Estates Reports INR 1,900+ Cr Pre-Sales in Q3 FY26",
            "Summary": "Max Estates achieves INR 1,900+ crores pre-sales in Gurugram with Estate 361 launch at INR 22,000 per sq ft premium. Secured INR 270+ crore commercial pre-leasing deal at 35% market premium.",
            "Sentiment": "positive",
            "PublishDate": 1770720856930,
            "Source": "co_actions_results"
        },
        {
            "Title": "Max Estates Appoints New Alternate Director & CIO",
            "Summary": "Max Estates Limited announces key leadership appointments including Ms. Jillian Leigh Moo-Young as Alternate Director and Mr. Arihant Kothari as Chief Investment Officer - Capital Strategy.",
            "Sentiment": "positive",
            "PublishDate": 1770407139213,
            "Source": "stocks"
        },
        {
            "Title": "Max Estates submits Q3FY26 monitoring agency reports",
            "Summary": "Max Estates disclosed monitoring agency reports for Q3FY26 covering QIP proceeds utilization of ₹773.44 crore and preferential issue proceeds of ₹83.73 crore, with CARE Ratings confirming compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1770388331237,
            "Source": "stocks"
        },
        {
            "Title": "Max Estates Q3 FY26 Earnings Call on Feb 10",
            "Summary": "Max Estates Limited announces Q3 FY26 earnings conference call scheduled for February 10, 2026 at 10:00 AM IST with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1770307498694,
            "Source": "co_actions_results"
        },
        {
            "Title": "Max Estates Issues ₹50 Crore Additional Guarantee",
            "Summary": "Max Estates Limited provides additional corporate guarantee of ₹50 crores to Catalyst Trusteeship Limited, bringing total guarantee obligation to ₹250 crores for subsidiary Max Square Limited's loan facilities.",
            "Sentiment": "neutral",
            "PublishDate": 1770230592064,
            "Source": "co_actions_results"
        },
        {
            "Title": "Max Estates ESG Rating Improves to 68 for FY25",
            "Summary": "Max Estates Limited receives upgraded ESG rating from 65.3 to 68.00 for FY2024-25 by SES ESG Research Private Limited, marking improvement in environmental, social and governance performance.",
            "Sentiment": "positive",
            "PublishDate": 1768237475419,
            "Source": "stocks"
        },
        {
            "Title": "Max Estates Raises ₹134.10 Cr via Debentures",
            "Summary": "Max Estates and New York Life Insurance Company subscribe to additional convertible debentures worth ₹134.10 crores in subsidiary MENPL on January 9, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767984711752,
            "Source": "co_actions_results"
        },
        {
            "Title": "Max Estates Allots 11.42L Shares via Warrant Conversion",
            "Summary": "Max Estates Limited allotted 11,41,552 equity shares to promoter Max Ventures Investment Holdings for ₹56.25 crores through warrant conversion, increasing promoter holding to 45.28%.",
            "Sentiment": "positive",
            "PublishDate": 1767715059239,
            "Source": "co_actions_results"
        },
        {
            "Title": "Max Estates Subsidiary Faces ₹35.48L Tax Penalty",
            "Summary": "Max Square Limited, subsidiary of Max Estates, receives penalty order under Section 270A for alleged under-reporting of ₹63.78L interest income for AY 2021-22.",
            "Sentiment": "negative",
            "PublishDate": 1767284977823,
            "Source": "stocks"
        },
        {
            "Title": "Max Estates Completes Base Buildwell Acquisition",
            "Summary": "Max Estates Limited has completed the acquisition of Base Buildwell Private Limited, acquiring 100% equity shares and CCDs to make it a wholly-owned subsidiary effective December 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766757250386,
            "Source": "co_actions_results"
        },
        {
            "Title": "Max Estates Grants 10.05 Lakh Stock Options",
            "Summary": "Max Estates Limited's Nomination and Remuneration Committee approved the grant of 10,04,512 stock options under its ESOP Plan 2023 with an exercise price of ₹230 per option and 4-year vesting schedule.",
            "Sentiment": "positive",
            "PublishDate": 1765630459776,
            "Source": "stocks"
        },
        {
            "Title": "Max Estates Launches Estate 361 Residential Project in Gurugram",
            "Summary": "Max Estates has introduced Estate 361, a nature-inspired residential community in Gurugram spanning 18.23 acres with 250,000 sq. ft. of forest greens and IGBC Platinum pre-certification. The project includes senior living residences managed by Antara Senior Living, expanding Max Estates' residential portfolio with an environmentally focused development.",
            "Sentiment": "positive",
            "PublishDate": 1764733418137,
            "Source": "stock"
        },
        {
            "Title": "Max Estates Reports 24% Revenue Growth, Plans Three Major Project Launches Worth INR 9,500 Crores",
            "Summary": "Max Estates Limited reported consolidated revenue of INR 100 crores for the first half of FY26, marking 24% year-on-year growth. The company achieved 100% occupancy across all operational commercial assets with lease rental income growing 41% to INR 76 crores. Max Estates has recorded cumulative presales of over INR 7,500 crores to date, with Estate 128 generating INR 2,700 crores and Estate 360 achieving INR 4,800 crores in presales. The company plans to launch three projects in the second half with combined GDV of INR 9,500 crores: Estate 361 in Gurgaon (INR 4,500 crores), Sector 105 in Noida (INR 3,000 crores), and Max One/Delhi One (INR 2,000 crores). Management expects presales of INR 6,000-6,500 crores in FY26, representing 15-20% growth. The company recently acquired development rights for a 7.25-acre parcel in Sector 59 Golf Course Extension Road, Gurgaon, with anticipated GDV exceeding INR 3,000 crores. Max Estates achieved dual 5-star GRESB rating and maintains cash and cash equivalents of INR 1,900 crores with net cash balance of INR 350 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762541330478,
            "Source": "earnings"
        },
        {
            "Title": "Max Estates Targets ₹9,500 Crore Project Launches for FY26",
            "Summary": "Max Estates has set ambitious targets for its upcoming financial years. The company aims to launch projects worth ₹9,500 crore in FY26, supported by accelerated acquisition plans. The real estate developer expects residential pre-sales to reach ₹6,000-₹6,500 crore in FY26 and further grow to ₹14,500-₹15,000 crore by FY28.",
            "Sentiment": "positive",
            "PublishDate": 1762225260043,
            "Source": "stock"
        },
        {
            "Title": "Max Estates Reports Monitoring Agency Reports for QIP and Preferential Issue Proceeds Utilization",
            "Summary": "Max Estates Limited disclosed monitoring agency reports from CARE Ratings Limited for proceeds utilization from its Qualified Institutional Placement (QIP) of Rs. 800 crore and Preferential Issue of Rs. 150 crore for the quarter ended September 30, 2025. The QIP proceeds were primarily utilized for land acquisition, with Rs. 87.86 crore deployed during the quarter towards land acquisition in Sector 105, Noida, and settlement of liabilities for the Delhi One project. The company reported no deviation from stated objects for both issues. From the preferential issue, Rs. 27.47 crore was utilized for land acquisition through subsidiary Max Estates Noida Private Limited. The company's Board also approved quarterly results showing total income of Rs. 5,561.95 lakhs and profit after tax of Rs. 1,932 lakhs for the quarter. The monitoring reports indicate delays in implementation timelines but confirm funds are being used for stated purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1762204514175,
            "Source": "corporate_action"
        },
        {
            "Title": "Max Estates Reports Quarterly Results with Rs 2,046.53 Lakh Profit Before Tax",
            "Summary": "Max Estates Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. The company reported a profit before tax of Rs 2,046.53 lakhs for the half-year period. The Board of Directors approved the unaudited standalone and consolidated financial results during a meeting held on November 3, 2025. The company completed the acquisition of Boulevard Projects Private Limited on April 23, 2025, making it a wholly-owned subsidiary. During the quarter, New York Life Insurance Company and Max Estates subscribed to compulsory convertible debentures in both Boulevard Projects Private Limited and Max Estates Noida Private Limited for aggregate considerations totaling Rs 97,480 lakhs. The company also executed a Securities Purchase Agreement for acquiring 100% shareholding in Base Buildwell Private Limited, which holds development rights over a 7.25-acre land parcel in Sector 59, Gurugram. Total assets stood at Rs 10,78,998.99 lakhs as of September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762203944776,
            "Source": "earnings"
        },
        {
            "Title": "Max Estates Reports 238% Jump in Q2 Net Profit to 72.6 Million Rupees",
            "Summary": "Max Estates reported quarterly net profit of 72.6 million rupees compared to 21.5 million rupees in the same period last year, marking a significant increase. Revenue grew to 487.7 million rupees from 402 million rupees year-over-year. EBITDA rose to 100.8 million rupees from 85.4 million rupees, though EBITDA margin declined slightly to 20.68% from 21.26% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762183791944,
            "Source": "earnings"
        },
        {
            "Title": "Max Estates Appoints Dharmender Kumar as Director Chief Corporate Affairs Officer",
            "Summary": "Max Estates Limited announced the appointment of Dharmender Kumar as Director Chief Corporate Affairs Officer, effective November 1, 2025. The Board of Directors approved the appointment on October 30, 2025, through a circular resolution. Kumar will be part of the Senior Management Personnel. He previously served as Director Chief Corporate Affairs Officer at Max Group, leading policy advocacy, government relations, and stakeholder engagement at Group Level while serving in Max India Limited. Kumar joined Max India in 2007 and rose to Director Group Chief Corporate Affairs Officer. He holds a Post Doctorate and PhD in Public Policy from Ecole Supérieure Robert de Sorbon, France, a PG Diploma in Personnel Management and Industrial Relations from Bhartiya Vidya Bhavan, and a BA in Humanities from Shaheed Bhagat Singh College.",
            "Sentiment": "positive",
            "PublishDate": 1761853885813,
            "Source": "corporate_governance"
        },
        {
            "Title": "Max Estates Schedules Q2FY26 Earnings Conference Call for November 4",
            "Summary": "Max Estates Limited has announced its Q2FY26 earnings conference call scheduled for November 4, 2025, at 11:30 AM IST. The call will be led by Vice-Chairman Managing Director Sahil Vachani and Chief Financial Officer Nitin Kansal, along with the senior management team, to discuss the company's quarterly results performance. The conference call will accommodate participants from multiple time zones including Hong Kong, Singapore, UK, and USA, with dedicated dial-in numbers provided for each region. Strategic Growth Advisors Pvt. Ltd. is coordinating the event.",
            "Sentiment": "neutral",
            "PublishDate": 1761837614808,
            "Source": "corporate_action"
        },
        {
            "Title": "Max Estate Acquires 7.25-Acre Land in Gurugram for Housing Development",
            "Summary": "Max Estate has acquired a 7.25-acre land parcel in Gurugram for developing a housing project.",
            "Sentiment": "positive",
            "PublishDate": 1757296097225,
            "Source": "stock"
        },
        {
            "Title": "Max Estates Acquires Base Buildwell for INR 534 Crore to Develop 7.25-Acre Gurugram Project",
            "Summary": "Max Estates Limited has approved the acquisition of Base Buildwell Private Limited, a project SPV holding development rights for a 7.25-acre land parcel in Gurugram, which will become a wholly-owned subsidiary upon completion of the transaction. The deal involves purchasing 100% shareholding in Base Buildwell for an expected outlay of INR 534 crore through cash consideration. The acquired land is strategically located in Sector 59 on Golf Course Extension Road and has development potential of approximately 1.3 million square feet with projected booking value exceeding INR 3,000 crore. This acquisition expands Max Estates' GDV pipeline from INR 14,000 crore to over INR 17,000 crore, strengthening its position in Gurugram's luxury residential market alongside its existing Noida portfolio of 9 million square feet. The transaction is subject to regulatory approvals and closing conditions, with Base Buildwell being incorporated in December 2012 and having nil turnover in the last three years.",
            "Sentiment": "positive",
            "PublishDate": 1757124090519,
            "Source": "order&deals"
        },
        {
            "Title": "Max Estates Reports 27% Revenue Growth in Q1 FY26, Plans Rs 9,500 Crore Project Launches",
            "Summary": "Max Estates Limited reported consolidated revenues of Rs 52 crores in Q1 FY26, marking 27% year-on-year growth. The company achieved consolidated EBITDA of Rs 14 crores, PBT of Rs 17 crores, and PAT of Rs 12 crores. The company has recorded cumulative pre-sales of over Rs 7,300 crores across projects under implementation, with collections of Rs 1,800 crores at 96% efficiency. Max Estates plans to launch Rs 9,500 crores worth of new projects in H2 FY26 across three developments in Gurgaon and Noida, targeting pre-sales of Rs 6,000 crores for FY26. The residential portfolio includes Estate 128 Noida (100% sold with Rs 2,700 crores pre-sales) and Estate 360 Gurgaon (98% sold with Rs 4,600 crores pre-sales). Commercial portfolio maintains 100% occupancy across Max House properties, with rental income growing 33% year-on-year. The company holds net cash of Rs 172 crores with gross debt of Rs 1,406 crores. Max Estates targets cumulative pre-sales of Rs 21,000 crores by FY28 and annuity rental income potential exceeding Rs 700 crores over five years.",
            "Sentiment": "positive",
            "PublishDate": 1755184894290,
            "Source": "earnings"
        },
        {
            "Title": "Max Estates Reports 80% Revenue Decline and Swings to Loss in Q1 Results",
            "Summary": "Max Estates Limited reported total income of ₹22.75 crores for Q1 FY2026, representing an 80% decline from ₹113.75 crores in Q1 FY2025. The real estate development company swung to a net loss of ₹25.57 crores compared to a net profit of ₹28.47 crores in the same quarter last year. Earnings per share turned negative at ₹0.12. EBITDA also turned negative at ₹2.65 crores versus positive ₹167.07 crores in Q1 FY2025. The company, which focuses on commercial and residential projects in North India and is part of the Max Group, published these unaudited results in newspaper advertisements and submitted copies to stock exchanges.",
            "Sentiment": "negative",
            "PublishDate": 1754893334731,
            "Source": "earnings"
        },
        {
            "Title": "Max Estates Releases Investor Presentation Following Earnings Conference Call Schedule",
            "Summary": "Max Estates Limited has released an investor presentation that is now available on the company's website. The presentation provides an overview of the company's journey and includes key business highlights. The company reported total GDV acquired and yet to be launched of Rs. 14,000 Cr, with total GDV sold and projects under implementation at Rs. 7,379 Cr. Max Estates plans Rs. 9,500 Cr launches in H2FY26 and aims to acquire Rs. 7,000 Cr GDV in the next 3 years to achieve Rs. 21,000 Cr target. The company collected Rs. 360 Cr in Q1FY26 with 95%+ efficiency. Max Square is 100% leased out with 23% area leased to Adobe. The company acquired Sector 105, Noida for Rs. 711 Cr cost with GDV of Rs. 3,000+ Cr and Delhi One, Noida for Rs. 1,400 Cr capital commitment with GDV of Rs. 2,000+ Cr. Max Estates completed a transaction with New York Life Insurance Co. for Delhi One and Sector 105 projects with total commitment of Rs. 500 Cr+ for the two projects. The company maintains total cash balance of Rs. 1,578 Cr and external debt of Rs. 1,406 Cr.",
            "Sentiment": "positive",
            "PublishDate": 1754668228519,
            "Source": "stock"
        },
        {
            "Title": "Max Estates Plans Major Expansion with ₹9,000 Crore Project Pipeline",
            "Summary": "Max Estates has outlined plans for significant growth through a ₹9,000 crore project pipeline. The company is experiencing strong pre-lease activity in its Grade-A office spaces and is launching new luxury residential projects. Max Estates is leveraging its REIT platform, prime locations, and strong financial position to enhance profits and cash flow generation.",
            "Sentiment": "positive",
            "PublishDate": 1754667752216,
            "Source": "stock"
        },
        {
            "Title": "Max Estates Approves New Subsidiary Formation and Reports QIP Fund Utilization Progress",
            "Summary": "Max Estates Limited's Board approved the incorporation of a wholly-owned subsidiary in the real estate sector with an authorized share capital of INR 10 lakh and paid-up capital of INR 1 lakh. The company also reviewed monitoring reports for its Rs 800 crore Qualified Institutional Placement (QIP) and Rs 150 crore Preferential Issue of Convertible Warrants for the quarter ended June 30, 2025. From the QIP proceeds, Rs 658.50 crore has been utilized, with Rs 511.98 crore deployed for land acquisition and development rights, primarily through subsidiaries including Rs 179.56 crore for settling liabilities of Boulevard Projects Private Limited's Delhi One project acquired from NCLT. The remaining Rs 141.50 crore is invested in fixed deposits and mutual funds. The Preferential Issue shows minimal utilization of Rs 0.003 crore from the Rs 37.50 crore received, with funds primarily invested in mutual funds. The monitoring agency noted that the company's share price is below the warrant exercise price, potentially affecting future fund receipt.",
            "Sentiment": "neutral",
            "PublishDate": 1754667648228,
            "Source": "corporate_action"
        },
        {
            "Title": "Max Estates Reports Strong Q1 FY26 Results with Consolidated Profit Rising to ₹1,193 Crores",
            "Summary": "Max Estates Limited announced its quarterly results for the quarter ended June 30, 2025. On a consolidated basis, the company reported total income of ₹8,012.90 lakhs compared to ₹4,770.03 lakhs in the same quarter last year. Revenue from operations increased to ₹5,147.38 lakhs from ₹4,048.62 lakhs year-over-year. The company posted a consolidated profit after tax of ₹1,193.32 lakhs, significantly higher than the loss of ₹199.56 lakhs in the corresponding quarter of the previous year. On a standalone basis, Max Estates recorded total income of ₹5,727.44 lakhs and profit after tax of ₹2,925.18 lakhs for the quarter. The company's basic earnings per share on a consolidated basis stood at ₹0.74 for the quarter. During the quarter, the company completed acquisition of a mixed-use land parcel in Sector 105 on the Noida-Greater Noida Expressway for ₹71,112.99 lakhs through its subsidiary. The Board meeting was held on August 8, 2025, where these results were approved.",
            "Sentiment": "positive",
            "PublishDate": 1754666401750,
            "Source": "earnings"
        },
        {
            "Title": "Max Estates COO Rishi Raj Resigns to Pursue Growth Opportunities",
            "Summary": "Max Estates Limited announced the resignation of Rishi Raj, Chief Operating Officer, effective September 30, 2025. Raj submitted his resignation letter on July 31, 2025, citing his decision to pursue alternate growth opportunities that better align with his professional aspirations. The company acknowledged his contributions and expressed appreciation for his services during his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1754382343576,
            "Source": "corporate_governance"
        },
        {
            "Title": "Max Estates Appoints Vachan Singh as Chief Operating Officer - Projects",
            "Summary": "Max Estates Limited appointed Vachan Singh as Chief Operating Officer - Projects, effective from August 4, 2025. The Board of Directors approved the appointment on August 2, 2025. Singh brings over 35 years of experience in project management, design management, operations, and business strategy across residential, commercial, and infrastructure developments. He joins from Adani Realty where he served as COO & Business Head for Mumbai Urban Cluster, managing over 35 million square feet of real estate development portfolio. Singh has previously held senior leadership positions at Oberoi Realty, L&T Realty, Mahagun, Tata Housing, and DLF. He holds a B.E. in Civil Engineering from BITS Pilani and completed an Executive Leadership Program from Ross School of Business, Michigan.",
            "Sentiment": "positive",
            "PublishDate": 1754196431076,
            "Source": "corporate_governance"
        },
        {
            "Title": "NSE Rejects Reclassification of MAX ESTATES Promoter to Public Shareholder",
            "Summary": "MAX ESTATES has announced that the National Stock Exchange (NSE) has rejected the reclassification of promoter Neelu Analjit Singh to public shareholder status.",
            "Sentiment": "negative",
            "PublishDate": 1748002088000,
            "Source": "default"
        },
        {
            "Title": "Max Estates Announces FY26 Guidance",
            "Summary": "Max Estates has provided guidance for fiscal year 2026. The company expects launches of ₹9,500 crore in FY26, compared to ₹5,723 crore in FY25. Pre-sales guidance for FY26 is set at ₹6,000-6,500 crore, versus ₹5,321 crore in FY25.",
            "Sentiment": "positive",
            "PublishDate": 1747970187000,
            "Source": "default"
        },
        {
            "Title": "Max Estates Reports Q4 Revenue and Profit Growth",
            "Summary": "Max Estates has reported its Q4 financial results. The company's revenue increased to 108.2 million rupees from 59.4 million rupees in the same quarter last year. Net profit for Q4 rose to 151.7 million rupees, up from 41 million rupees year-over-year and 168.1 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747933893000,
            "Source": "result"
        },
        {
            "Title": "Max Estates: Acquires Boulevard Projects to Revive Delhi One Project",
            "Summary": "Max Estates Ltd. acquired Boulevard Projects Pvt. for Rs 3.4 lakh to revive the Delhi One project in Noida. The total capital commitment is estimated at Rs 1,400 crore. The project spans 2.5 million square feet on a 10-acre land parcel. The acquisition was approved by NCLT and NCLAT in February 2023 and October 2024, respectively.",
            "Sentiment": "positive",
            "PublishDate": 1745477548000,
            "Source": "corporate_action"
        },
        {
            "Title": "Max Estates Acquires Delhi One Project in Noida",
            "Summary": "Max Estates has taken over the Delhi One project in Noida through the Insolvency and Bankruptcy Code (IBC) process. This acquisition adds a sales potential of ₹2,000 crore and an annuity rental of ₹120 crore to the company's portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1745463261000,
            "Source": "default"
        },
        {
            "Title": "Max Estates: GST Department Issues Show Cause Notice for Rs 2.25 Crore Tax Credit",
            "Summary": "Max Estates received a show cause notice from the GST department for recovery of approximately Rs 2.25 crore related to inadmissible input tax credit. The credit was claimed for legal expenses incurred during business acquisitions and investments in companies under NCLT dispute. The company believes it has strong legal grounds to contest the notice.",
            "Sentiment": "neutral",
            "PublishDate": 1743859190000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Max Estates Surpasses Annual Pre-Sales Target in Nine Months",
            "Summary": "Max Estates has exceeded its full year's pre-sales guidance within the first nine months of the fiscal year, achieving approximately Rs 5,200 crore in pre-sales. The company has set an ambitious target to achieve cumulative pre-sales bookings of INR 21,000 crore over the next three years, as revealed during a conference call.",
            "Sentiment": "positive",
            "PublishDate": 1739244996000,
            "Source": "earnings"
        },
        {
            "Title": "Max Estates Reports Significant Growth in Q3 EBITDA",
            "Summary": "Max Estates has announced its Q3 financial results, showing substantial year-over-year improvement. The company's EBITDA increased to 115.7 million rupees, up from 62.7 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 28.9% from 25.92% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738946721000,
            "Source": "earnings"
        },
        {
            "Title": "Max Estates Reports 65% Year-over-Year Revenue Growth in Q3",
            "Summary": "Max Estates, a real estate company, has announced its financial results for the third quarter. The company reported revenue of 400.4 million rupees, compared to 242 million rupees in the same quarter of the previous year, representing a significant year-over-year growth of approximately 65%.",
            "Sentiment": "positive",
            "PublishDate": 1738946713000,
            "Source": "earnings"
        },
        {
            "Title": "Max Estates Reports Profitable Q3 with Significant Year-over-Year Improvement",
            "Summary": "Max Estates has announced its Q3 consolidated net profit of 197.5 million rupees, marking a substantial turnaround from a loss of 31.4 million rupees in the same quarter of the previous year. The company also showed quarter-over-quarter growth, with profits increasing from 21.5 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738946706000,
            "Source": "earnings"
        },
        {
            "Title": "Max Estates Announces Significant Launch Pipeline",
            "Summary": "Max Estates has revealed a substantial launch pipeline of over 7 million square feet, with a Gross Development Value (GDV) potential exceeding ₹14,000 crore. This pipeline is scheduled for delivery in fiscal years 2026 and 2027. The company's current market capitalization stands at ₹8,500 crore.",
            "Sentiment": "positive",
            "PublishDate": 1737701640000,
            "Source": "corporate_action"
        },
        {
            "Title": "Max Estates Reports Successful Residential Project Launches",
            "Summary": "Max Estates has announced successful launches of two residential projects, Estate 128 and Estate 360, with a combined booking value of Rs. 7,500 crore. This indicates strong performance in the company's residential real estate segment.",
            "Sentiment": "positive",
            "PublishDate": 1737701555000,
            "Source": "corporate_action"
        },
        {
            "Title": "Max Estates Announces High-Value Real Estate Project",
            "Summary": "Max Estates has unveiled a new real estate project with significant financial potential. The project boasts a Gross Development Value (GDV) potential exceeding ₹3,000 crore and an expected annuity rental income of over ₹140 crore. This announcement suggests a major expansion in Max Estates' real estate portfolio and indicates potential for substantial revenue generation from both development and rental streams.",
            "Sentiment": "positive",
            "PublishDate": 1737701451000,
            "Source": "corporate_action"
        },
        {
            "Title": "Max Estates Acquires Prime Land in Noida for Mixed-Use Development",
            "Summary": "Max Estates has secured 10.33 acres of prime land in Noida for ₹711 crore. The acquisition offers potential for approximately 2.6 million square feet of mixed-use development.",
            "Sentiment": "positive",
            "PublishDate": 1737701396000,
            "Source": "corporate_action"
        },
        {
            "Title": "Max Estates: Estate 128 Phase II Pre-Sales Exceed Target, Reaching Rs 845 Crore",
            "Summary": "Max Estates Ltd.'s subsidiary, Max Estates 128 Pvt., secured Rs 845 crore in pre-sales bookings for Phase II of Estate 128 in Noida within the first week of launch, surpassing the Rs 800 crore target. Total booking value for Estate 128 now stands at Rs 2,700 crore. The company's booking value for the first nine months of FY2025 has reached Rs 5,000 crore, aligning with full-year guidance of Rs 4,800-5,200 crore.",
            "Sentiment": "positive",
            "PublishDate": 1735292961000,
            "Source": "normal_news"
        },
        {
            "Title": "Max Estates Reports Performance Within Full-Year Guidance",
            "Summary": "Max Estates has announced that its current performance is within the company's full-year guidance range of INR 4,800–5,200 crores. This statement suggests that the company is on track to meet its financial targets for the year.",
            "Sentiment": "positive",
            "PublishDate": 1735289792000,
            "Source": "earnings"
        },
        {
            "Title": "Max Estates Achieves INR 5000 Crore Booking Value in First 9 Months of FY25",
            "Summary": "Max Estates has announced that it has delivered a booking value of INR 5000 crores in the first nine months of the fiscal year 2025. This achievement comes with the company's latest launch, indicating strong performance in the real estate sector.",
            "Sentiment": "positive",
            "PublishDate": 1735289740000,
            "Source": "corporate_action"
        },
        {
            "Title": "Max Estates Achieves INR 845 Crore Pre-Sales for Estate 128 Phase II in Noida",
            "Summary": "Max Estates has reported a significant achievement in pre-sales bookings for the second phase of its Estate 128 project in Noida. Within just one week of launching Phase II, the company secured pre-sales bookings valued at INR 845 crores. This rapid success indicates strong demand for the project and potentially reflects positively on the company's performance in the real estate sector.",
            "Sentiment": "positive",
            "PublishDate": 1735289696000,
            "Source": "corporate_action"
        },
        {
            "Title": "Max Estates: Robust H1 FY25 Performance and Strategic Expansion",
            "Summary": "Max Estates reported strong H1 FY25 results with 96% YoY growth in lease rental income to ₹53 crore. The company secured 7 million sq ft of development opportunities, launched successful residential projects, and raised ₹1,300 crore capital. NCLAT approval received for 'Delhi One' project in Noida. FY25 booking value guidance revised upward to ₹4,800-5,200 crore.",
            "Sentiment": "positive",
            "PublishDate": 1730094891000,
            "Source": "result"
        },
        {
            "Title": "Max Estates Reports Significant Profit Increase in Q2",
            "Summary": "Max Estates has reported a substantial increase in net profit for the second quarter, rising to 2.4 billion rupees from 56.5 million rupees year-over-year. This represents a significant growth compared to the previous quarter's 74 million rupees. However, the company's revenue for Q2 decreased to 75 million rupees from 95 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1729871251000,
            "Source": "result"
        },
        {
            "Title": "Ambit Raises Target Price for Max Estates on Strong Project Pipeline",
            "Summary": "<p>Ambit, a financial services firm, has <span class='positive'>increased</span> its target price for Max Estates to ₹700. The company has a <span class='positive'>visible pipeline</span> of over 4 million square feet with a <span class='positive'>Gross Development Value (GDV)</span> of ₹100 billion, split between <b>Gurugram</b> (₹90 billion) and <b>Noida</b> (₹9 billion).</p>",
            "Sentiment": "positive",
            "PublishDate": 1728020822000,
            "Source": "normal_news"
        }
    ]
}