{
    "Symbol": "MAXHEALTH",
    "ISIN": "INE027H01010",
    "News": [
        {
            "Title": "Max Healthcare announces investor presentations for Feb 2026",
            "Summary": "Max Healthcare Institute Limited will participate in Nuvama India Conference 2026 on February 9 and 17th Kotak Chasing Growth Conference 2026 on February 23, 2026 under Regulation 30.",
            "Sentiment": "neutral",
            "PublishDate": 1770485375416,
            "Source": "stocks"
        },
        {
            "Title": "Max Healthcare Secures Annual Price Revision Deals",
            "Summary": "Max Healthcare management confirms agreements with insurance companies for annual price revisions during recent conference call, indicating structured pricing mechanisms for healthcare services.",
            "Sentiment": "positive",
            "PublishDate": 1770359340931,
            "Source": "stocks"
        },
        {
            "Title": "Max Healthcare Q3 Net Profit Rises 25% to ₹3B",
            "Summary": "Max Healthcare Institute reported Q3 consolidated net profit of ₹3.00 billion, up from ₹2.40 billion year-on-year, though falling short of analyst estimates of ₹3.90 billion.",
            "Sentiment": "neutral",
            "PublishDate": 1770279152542,
            "Source": "co_actions_results"
        },
        {
            "Title": "Max Healthcare Grants 2,84,520 Stock Options to Staff",
            "Summary": "Max Healthcare Institute's NRC approved grant of 2,84,520 stock options under ESOP 2022 to eligible employees on February 4, 2026, with exercise prices of ₹900 and ₹800 per option.",
            "Sentiment": "positive",
            "PublishDate": 1770201767078,
            "Source": "co_actions_results"
        },
        {
            "Title": "Max Healthcare initiates voluntary liquidation of Nigeria unit",
            "Summary": "Max Healthcare Institute Limited announced the voluntary liquidation of its wholly-owned subsidiary MHC Global Healthcare (Nigeria) Limited, which had negative networth of ₹70,89,724 as of March 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769705388212,
            "Source": "stocks"
        },
        {
            "Title": "Max Healthcare Board Meet on Feb 5 for Q3FY26 Results",
            "Summary": "Max Healthcare Institute has scheduled its board meeting for February 5, 2026, to approve Q3FY26 financial results. Trading window remains closed for designated persons until 48 hours post-declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1769611837334,
            "Source": "co_actions_results"
        },
        {
            "Title": "Max Healthcare Block Trade Worth ₹64.66 Crores",
            "Summary": "Max Healthcare Institute executed a significant block trade on NSE involving 645,871 shares at ₹1,001.10 per share, totaling ₹64.66 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1768900683061,
            "Source": "co_actions_results"
        },
        {
            "Title": "Macquarie Raises Max Health Target to ₹825",
            "Summary": "Macquarie maintains Underperform rating on Max Healthcare Institute while significantly raising target price to ₹825 from ₹615, representing a 34% increase in valuation despite cautious outlook.",
            "Sentiment": "neutral",
            "PublishDate": 1767931007097,
            "Source": "stocks"
        },
        {
            "Title": "Max Healthcare Block Trade Worth ₹15.59 Crores",
            "Summary": "Max Healthcare Institute executed a significant NSE block trade involving 151,175 shares at ₹1,031.40 per share, totaling ₹15.59 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1767778833911,
            "Source": "co_actions_results"
        },
        {
            "Title": "Max Healthcare Faces ₹55.20 Cr GST Claim",
            "Summary": "Max Healthcare Institute receives GST claim of ₹55.20 crores for possible excess input tax credit and initiates rectification and appeal procedures to address the matter.",
            "Sentiment": "negative",
            "PublishDate": 1767149043456,
            "Source": "stocks"
        },
        {
            "Title": "Max Healthcare faces ₹55 cr GST demand from Delhi",
            "Summary": "Max Healthcare Institute receives GST demand of ₹55.20 crore from Delhi authorities for alleged excess Input Tax Credit availment, while Q2 results show strong growth with 74% jump in net profit.",
            "Sentiment": "neutral",
            "PublishDate": 1767119381492,
            "Source": "co_actions_results"
        },
        {
            "Title": "Max Healthcare Faces ₹55.2 Cr GST Demand in New Order",
            "Summary": "Max Healthcare Institute receives fresh GST demand of ₹33.66 crores with ₹18.18 crores interest and ₹3.37 crores penalty from Delhi tax authorities for alleged excess Input Tax Credit availment.",
            "Sentiment": "negative",
            "PublishDate": 1766164295795,
            "Source": "stocks"
        },
        {
            "Title": "Goldman Sachs Issues Buy Rating on Max Healthcare",
            "Summary": "Goldman Sachs maintains a Buy recommendation for Max Healthcare Institute with a target price of ₹1,325.00, indicating positive outlook for the healthcare provider's stock performance.",
            "Sentiment": "positive",
            "PublishDate": 1766115580533,
            "Source": "stocks"
        },
        {
            "Title": "Max Healthcare Plans ₹1,000 Cr Pune Hospital Investment",
            "Summary": "Max Healthcare Institute announces major expansion with investment of over ₹1,000 crores for new hospital facility in Pune, marking significant growth in Maharashtra healthcare infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1766058036274,
            "Source": "stocks"
        },
        {
            "Title": "Max Healthcare Board Approves Yerawada Properties Deal",
            "Summary": "Max Healthcare Institute board approves share purchase agreement for 100% acquisition of Yerawada Properties Private Limited on December 18, 2025, to develop 450-bed super specialty hospital in Pune with ₹1,020 crore investment.",
            "Sentiment": "positive",
            "PublishDate": 1766036148521,
            "Source": "co_actions_results"
        },
        {
            "Title": "Max Healthcare Receives Improved ESG Rating of 66 for FY2024-25",
            "Summary": "Max Healthcare Institute Limited received an ESG rating of 66 for financial year 2024-25 from NSE Sustainability Ratings and Analytics Limited, showing improvement from the previous year's rating of 62. The rating was assigned independently by NSE Sustainability based on the company's public disclosures without any engagement from Max Healthcare.",
            "Sentiment": "positive",
            "PublishDate": 1765296825169,
            "Source": "stock"
        },
        {
            "Title": "Max Healthcare Allots 3.16 Lakh Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Max Healthcare Institute's Nomination Remuneration Committee approved allotment of 3,16,839 equity shares with face value of ₹10 each to eligible employees under its Employee Stock Option Scheme 2022. The allotment increased the company's paid-up equity capital from ₹972.45 crore to ₹972.77 crore, with total equity shares rising to 97.28 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1764761207162,
            "Source": "corporate_action"
        },
        {
            "Title": "Max Healthcare Reports 21% Revenue Growth in Q2 FY26, Maintains Strong Expansion Momentum",
            "Summary": "Max Healthcare Institute delivered robust quarterly results with revenue growing 21% year-on-year to INR 2,692 crore and operating EBITDA increasing 23% to INR 694 crore, extending its track record to 20 consecutive quarters of consistent growth. The company commissioned new brownfield expansions including a 160-bed tower at Max Mohali and expects CGHS price revisions to provide favorable impact of over INR 200 crore once fully implemented.",
            "Sentiment": "positive",
            "PublishDate": 1763743522338,
            "Source": "earnings"
        },
        {
            "Title": "Max Healthcare Plans Major Expansion With Over 8,300 Additional Beds",
            "Summary": "Max Healthcare announced plans to significantly expand its capacity by adding over 8,300 beds, with approximately 4,800 beds to be added within the next 3-4 years. This expansion represents a substantial growth initiative for the healthcare provider, indicating aggressive capacity building in the healthcare sector.",
            "Sentiment": "positive",
            "PublishDate": 1763554895305,
            "Source": "stock"
        },
        {
            "Title": "Max Healthcare Sees Rs. 92.97 Crore Block Trade on NSE",
            "Summary": "Max Healthcare Institute executed a block trade worth Rs. 92.97 crores involving 832,909 shares at Rs. 1,116.20 per share on the NSE. The transaction represents a significant institutional or bulk investor activity in the healthcare company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1763458830537,
            "Source": "order&deals"
        },
        {
            "Title": "Max Healthcare Expects Rs 200 Crore Benefit from Revised CGS Norms",
            "Summary": "Max Healthcare management announced during a conference call that the company anticipates a favorable financial impact of Rs 200 crore from upcoming revised CGS (Cash Generating Schemes) norms. The expected benefit represents a significant positive development for the healthcare company's financial outlook once the new norms are implemented.",
            "Sentiment": "positive",
            "PublishDate": 1763359996215,
            "Source": "stock"
        },
        {
            "Title": "Max Healthcare Institute Reports Strong Q2 Performance with 74% Jump in Net Profit",
            "Summary": "Max Healthcare Institute delivered robust quarterly results with net profit surging to 4.9 billion rupees from 2.82 billion rupees year-over-year, while revenue grew to 21.35 billion rupees from 17.07 billion rupees. The healthcare company maintained strong operational efficiency with EBITDA rising to 5.75 billion rupees and margins improving to 26.93% from 26.39% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1763337227909,
            "Source": "earnings"
        },
        {
            "Title": "Max Healthcare Allots 2.16 Lakh Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Max Healthcare Institute Limited's Nomination Remuneration Committee approved allotment of 2,16,084 equity shares with face value of ₹10 each to eligible employees under its Employee Stock Option Scheme 2022. The allotment increased the company's paid-up equity capital from ₹972.24 crore to ₹972.45 crore, with exercise prices of ₹350 and ₹700 per share for different tranches.",
            "Sentiment": "positive",
            "PublishDate": 1763133903229,
            "Source": "corporate_action"
        },
        {
            "Title": "Max Healthcare Schedules Earnings Call for Q2 H1 FY26 Results on November 17, 2025",
            "Summary": "Max Healthcare Institute Limited has announced an earnings call for investors and analysts scheduled for November 17, 2025, at 11:30 AM IST. The call will discuss the company's financial results for the quarter and half-year ended September 30, 2025, which will be declared on November 14, 2025. The conference call will feature the senior management team and include a management discussion followed by a Q&A session. Max Healthcare operates 21 healthcare facilities with 5,200 beds, primarily in North India, including hospitals in Delhi NCR, Lucknow, Mumbai, Nagpur, Mohali, Bathinda, and Dehradun. The company also operates home care services under Max@Home and diagnostic services through MaxLabs.",
            "Sentiment": "neutral",
            "PublishDate": 1762792060859,
            "Source": "earnings"
        },
        {
            "Title": "Max Healthcare Receives Improved ESG Score of 75.1 for FY2024-25",
            "Summary": "Max Healthcare Institute Limited received an ESG score of 75.1 for financial year 2024-25 from SESES G Research Private Limited, a SEBI registered ESG Rating Provider. This represents an improvement from the previous score of 73.7 for financial year 2023-24. The company did not engage SES for ESG ratings, as SES independently assigned the rating based on the company's public disclosures. The notification was received on November 6, 2025 at 7:15 pm IST.",
            "Sentiment": "positive",
            "PublishDate": 1762512111494,
            "Source": "stock"
        },
        {
            "Title": "Max Healthcare Institute Sees Rs. 59.23 Crore Block Trade on NSE",
            "Summary": "Max Healthcare Institute Ltd. executed a block trade worth Rs. 59.23 crores on the National Stock Exchange. The transaction involved approximately 513,125 shares at a price of Rs. 1154.30 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1761886842153,
            "Source": "order&deals"
        },
        {
            "Title": "Max Healthcare Institute Sees ₹129.13 Crore Block Trade on NSE",
            "Summary": "Max Healthcare Institute Ltd. recorded a block trade worth ₹129.13 crores on the National Stock Exchange. The transaction involved approximately 1,158,151 shares traded at ₹1,115.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1759291027550,
            "Source": "order&deals"
        },
        {
            "Title": "Max Healthcare Institute Sees Rs. 131.16 Crore Block Trade on NSE",
            "Summary": "Max Healthcare Institute Ltd. recorded a block trade worth Rs. 131.16 crores on the NSE. The transaction involved approximately 1,151,919 shares at a price of Rs. 1,138.60 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1758792902226,
            "Source": "order&deals"
        },
        {
            "Title": "Max Healthcare Institute Completes Rs. 85.40 Crore Block Trade on NSE",
            "Summary": "Max Healthcare Institute executed a block trade worth Rs. 85.40 crores on the National Stock Exchange. The transaction involved approximately 740,138 shares at a price of Rs. 1,153.80 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1758616375415,
            "Source": "order&deals"
        },
        {
            "Title": "Max Healthcare Institute Sees Rs. 119.33 Crore Block Trade on NSE",
            "Summary": "Max Healthcare Institute Ltd. recorded a block trade worth Rs. 119.33 crores on the National Stock Exchange. The transaction involved approximately 1,030,669 shares at a price of Rs. 1,157.80 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1758605562011,
            "Source": "order&deals"
        },
        {
            "Title": "GIC Private Limited Reduces Stake in Max Healthcare to 5.813% Through Open Market Sale",
            "Summary": "GIC Private Limited, acting on behalf of the Government of Singapore and Monetary Authority of Singapore, sold 960,808 equity shares of Max Healthcare Institute Ltd through open market transactions on September 18, 2025. The sale reduced their combined holding from 57,476,494 shares (5.912%) to 56,515,686 shares (5.813%). Government of Singapore's holding decreased from 4.589% to 4.508%, while Monetary Authority of Singapore's stake fell from 1.323% to 1.305%. GIC noted that since their last disclosure in August 2022 when they held 7.85% of the company, they have been selling shares in multiple non-reportable tranches, with this transaction triggering the disclosure requirement under takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1758520174843,
            "Source": "stock"
        },
        {
            "Title": "Max Healthcare Institute Executes Rs. 15.96 Crore Block Trade on NSE",
            "Summary": "Max Healthcare Institute Ltd. completed a block trade on the National Stock Exchange worth Rs. 15.96 crores. The transaction involved approximately 136,504 shares at a price of Rs. 1,169.30 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1757488464090,
            "Source": "order&deals"
        },
        {
            "Title": "Max Healthcare Institute Sees Block Trade Worth Rs. 101.05 Crores on NSE",
            "Summary": "Max Healthcare Institute Ltd. witnessed a block trade on the National Stock Exchange (NSE) valued at Rs. 101.05 crores. The transaction involved approximately 827,282 shares traded at Rs. 1,221.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1755155362428,
            "Source": "order&deals"
        },
        {
            "Title": "Max Healthcare Expects 25-30% Growth in International Patient Revenue to Continue",
            "Summary": "Max Healthcare anticipates its international patient revenue will continue growing at 25-30% in upcoming quarters, maintaining the growth rate achieved in recent periods. International patients currently represent 9% of the company's total revenue. The hospital chain is expanding capacity by 30% over the next six months, having already added over 30% capacity in the last 15 months through opening a hospital in Dwarka and acquiring Jaypee Hospital in Noida. Max Healthcare reported quarterly revenue of ₹2,460 crore, margins of 24.9%, and profit of ₹345 crore. The company's diagnostic businesses, including Max@Home and Max Lab, have been growing over 20% for multiple quarters. Management expects lab business margins to improve from 17% to around 20%, while the home care business already delivers over 20% margins. Max Healthcare's market capitalization stands at ₹1,19,865 crore, with shares trading at ₹1,233.40, up 41% over the past year.",
            "Sentiment": "positive",
            "PublishDate": 1755149538633,
            "Source": "stock"
        },
        {
            "Title": "Max Healthcare Approves New Hospital Lease and Reports Strong Q1 Financial Performance",
            "Summary": "Max Healthcare's board approved a lease agreement with Goyal Agrim Infra Realty for a new 130-bed hospital in Dehradun, Uttarakhand. The company reported Q1 revenue of 20.2 billion rupees compared to 15.4 billion rupees year-over-year. Consolidated net profit increased to 3.1 billion rupees from 2.4 billion rupees year-over-year. EBITDA rose to 5.23 billion rupees from 3.87 billion rupees year-over-year, with EBITDA margin improving to 25.79% from 25.11% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1755067967855,
            "Source": "stock"
        },
        {
            "Title": "Max Healthcare Institute Sees Rs. 50.66 Crore Block Trade on NSE",
            "Summary": "Max Healthcare Institute Ltd. witnessed a block trade worth Rs. 50.66 crores on the National Stock Exchange. The transaction involved approximately 403,231 shares at a price of Rs. 1,256.30 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1754541068683,
            "Source": "order&deals"
        },
        {
            "Title": "Max Health Discusses Unified Treatment Rates Nationwide",
            "Summary": "Max Health is involved in discussions about implementing unified treatment rates across the country. The news suggests a potential standardization of healthcare costs on a national level.",
            "Sentiment": "neutral",
            "PublishDate": 1752652390000,
            "Source": "default"
        },
        {
            "Title": "Max Healthcare Sells Stake in Sandhya Hydro Power Project",
            "Summary": "Max Healthcare has sold its stake in the Sandhya Hydro Power Project by transferring 12.84 lakh shares to Skyzen Infrabuild. This action follows the termination of a power agreement between the parties.",
            "Sentiment": "neutral",
            "PublishDate": 1752303198000,
            "Source": "default"
        },
        {
            "Title": "Block Trade of Max Healthcare Institute Ltd. Shares on NSE",
            "Summary": "A block trade of approximately 485,998 shares of Max Healthcare Institute Ltd. occurred on the National Stock Exchange (NSE) at a price of Rs. 1137.00 per share. The total value of the transaction was Rs. 55.26 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1748586133000,
            "Source": "block_details"
        },
        {
            "Title": "Max Healthcare Institute: Ambitious Expansion Plan to Add 1,500 Beds in FY26",
            "Summary": "Max Healthcare aims to add 1,500 beds in FY26, increasing capacity by 30%. The company plans to reach 6,500 beds by next year and 9,000 beds by 2028. Expansion will be primarily through brownfield projects, with Rs 5,000 crore allocated for capex from FY26 to FY28. The company is open to acquisitions and expects continued revenue growth per bed.",
            "Sentiment": "positive",
            "PublishDate": 1747884074000,
            "Source": "corporate_action"
        },
        {
            "Title": "Max Healthcare Institute: Q4 Profit Surges 21%, Dividend Announced",
            "Summary": "Max Healthcare Institute reported a 21% increase in Q4 FY25 profit after tax to ₹376 crore. Network gross revenue grew 29% to ₹2,429 crore. The company announced a final dividend of ₹1.5 per share. Strategic expansions include land acquisition for hospital expansion and upcoming operations in three new brownfield towers.",
            "Sentiment": "positive",
            "PublishDate": 1747752088000,
            "Source": "earnings"
        },
        {
            "Title": "Max Healthcare Institute: Q4 Profit Surges 27% But Misses Estimates",
            "Summary": "Max Healthcare Institute reported a 27% increase in Q4 FY25 net profit to Rs 319 crore, falling short of analysts' estimates. Revenue rose 34% to Rs 1,910 crore. EBITDA grew 34%, with margin remaining flat at 26.8%. Bed occupancy reached 75%, and international patient revenue grew 28%.",
            "Sentiment": "neutral",
            "PublishDate": 1747735729000,
            "Source": "earnings"
        },
        {
            "Title": "Max Healthcare Institute Reports Q4 Results and Approves Bed Expansion",
            "Summary": "Max Healthcare Institute announced its Q4 financial results and a board decision to expand capacity. The company reported Q4 revenue of 19.1 billion rupees, up from 14.2 billion year-over-year. EBITDA increased to 5.1 billion rupees from 3.8 billion, with a slight decrease in EBITDA margin to 26.79% from 26.89%. Consolidated net profit rose to 3.2 billion rupees from 2.52 billion. Additionally, the board approved adding 100 beds to the existing 186 beds at Max Super Speciality Hospital in Nagpur.",
            "Sentiment": "positive",
            "PublishDate": 1747732553000,
            "Source": "result"
        },
        {
            "Title": "Max Healthcare Institute Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 449,617 shares of Max Healthcare Institute Ltd. was executed on the National Stock Exchange (NSE) at a price of Rs. 1197.00 per share, totaling Rs. 53.82 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1747284829000,
            "Source": "block_details"
        },
        {
            "Title": "Max Healthcare Denies Bidding for Sahyadri Hospital",
            "Summary": "Max Healthcare Institute has issued a clarification regarding a news article in the media. The company explicitly denies reports of bidding for the acquisition of Sahyadri Hospital. Max Healthcare states that it is not participating in any bidding process for the acquisition of Sahyadri Hospital.",
            "Sentiment": "neutral",
            "PublishDate": 1746576756000,
            "Source": "default"
        },
        {
            "Title": "Max Healthcare Denies Bidding for Sahyadri Hospital",
            "Summary": "Max Healthcare Institute has issued a clarification regarding a news article in the media. The company explicitly denies reports of bidding for the acquisition of Sahyadri Hospital. Max Healthcare states that it is not participating in any bidding process for the acquisition of Sahyadri Hospital.",
            "Sentiment": "neutral",
            "PublishDate": 1746533537000,
            "Source": "default"
        },
        {
            "Title": "Max Healthcare Institute Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 207,749 shares of Max Healthcare Institute Ltd. was executed on the National Stock Exchange (NSE) for Rs. 24.22 crores. The trade was conducted at a price of Rs. 1165.80 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1746513011000,
            "Source": "block_details"
        },
        {
            "Title": "Max Healthcare Institute: Rs 6,000 Crore Investment for 3,700 New Beds by 2028",
            "Summary": "Max Healthcare Institute plans to invest Rs 6,000 crore by 2028 to add 3,700 beds across India. The company aims to expand from 22 to around 30 hospitals, including new facilities in Dwarka, Mohali, Mumbai, and Saket. The expansion will be funded internally through profit reinvestment.",
            "Sentiment": "positive",
            "PublishDate": 1745921895000,
            "Source": "corporate_action"
        },
        {
            "Title": "Max Healthcare Institute: Large Block Trade on NSE",
            "Summary": "A significant block trade of approximately 1,002,923 shares of Max Healthcare Institute Ltd. occurred on the National Stock Exchange (NSE) for Rs. 109.19 crores. The trade was executed at a price of Rs. 1088.70 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1745556062000,
            "Source": "block_details"
        },
        {
            "Title": "Max Healthcare Institute Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 187,046 shares of Max Healthcare Institute Ltd. was executed on the National Stock Exchange (NSE) for Rs. 20.78 crores. The trade was carried out at a price of Rs. 1111.20 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1745297334000,
            "Source": "block_details"
        }
    ]
}