{
    "Symbol": "MAXIND",
    "ISIN": "INE0CG601016",
    "News": [
        {
            "Title": "Max India Board Approves Office Shift, Director Resigns",
            "Summary": "Max India Limited's board approved shifting registered office from Mumbai to Delhi effective February 15, 2026, while Mrs. Sharmila Tagore resigned as Independent Director due to personal commitments.",
            "Sentiment": "neutral",
            "PublishDate": 1770724991514,
            "Source": "stocks"
        },
        {
            "Title": "Max India submits Q3FY26 monitoring report",
            "Summary": "Max India Limited filed monitoring agency report for Q3FY26 showing Rs. 23.03 crore utilization from Rs. 124.23 crore rights issue proceeds with no deviations reported.",
            "Sentiment": "neutral",
            "PublishDate": 1770723702517,
            "Source": "co_actions_results"
        },
        {
            "Title": "Max India Reports Q3 FY26 Loss of ₹42.85 Crores",
            "Summary": "Max India Limited posted a consolidated net loss of ₹42.85 crores for Q3 FY26, compared to ₹44.60 crores loss in Q3 FY25. Revenue from operations grew 24.07% to ₹43.10 crores.",
            "Sentiment": "negative",
            "PublishDate": 1770723631186,
            "Source": "co_actions_results"
        },
        {
            "Title": "Antara Opens Second Senior Care Home in Chennai",
            "Summary": "Max India's subsidiary Antara Assisted Care Services launched its second 72-bed senior care facility in Chennai's OMR corridor, expanding assisted living services in Tamil Nadu where 14% of population is aged 60+.",
            "Sentiment": "positive",
            "PublishDate": 1770655874827,
            "Source": "stocks"
        },
        {
            "Title": "Max India Allots 60,000 Shares Under ESOP Plan",
            "Summary": "Max India Limited allotted 60,000 equity shares to employees under its ESOP Plan 2020, increasing paid-up capital from Rs. 52,46,28,620 to Rs. 52,52,28,620 on February 9, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770631066447,
            "Source": "co_actions_results"
        },
        {
            "Title": "Max India Board Meeting Set for February 10, 2026",
            "Summary": "Max India Limited announces board meeting on February 10, 2026 to consider Q3FY26 unaudited financial results. Trading window closed until February 12, 2026 for designated persons.",
            "Sentiment": "neutral",
            "PublishDate": 1770118721654,
            "Source": "co_actions_results"
        },
        {
            "Title": "Max India's AGEasy Launches Senior-Specific Gut Care Range",
            "Summary": "Max India's subsidiary Antara launches AGEasy Gut Care Range with Wellbeing Nutrition, featuring four targeted formulations addressing digestive concerns for seniors with science-backed ingredients.",
            "Sentiment": "positive",
            "PublishDate": 1765778722353,
            "Source": "stocks"
        },
        {
            "Title": "Max India allots 20,000 equity shares under ESOP",
            "Summary": "Max India Limited's Nomination and Remuneration Committee approved allotment of 20,000 equity shares to eligible employees under ESOP Plan 2020, increasing paid-up capital to ₹52.45 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1765518489748,
            "Source": "co_actions_results"
        },
        {
            "Title": "Antara Senior Living Partners with Max Estates for Second Senior Care Project at Estate 361",
            "Summary": "Antara Senior Living Limited, a wholly owned subsidiary of Max India Limited, will exclusively manage 360 senior living units and wellness amenities at Max Estates' Estate 361 development in Gurugram along the Dwarka Expressway. This marks their second collaboration after Estate 360's success where 292 senior residences sold out in 11 months, as India's senior population is projected to rise from 147 million in 2024 to nearly 350 million by 2050.",
            "Sentiment": "positive",
            "PublishDate": 1765174823918,
            "Source": "stock"
        },
        {
            "Title": "Max India Presents Antara Senior Care Growth Strategy with Pan-India Expansion Plans",
            "Summary": "Max India Limited presented its investor presentation for Antara Senior Care, showcasing quarterly results with revenue of Rs 50.2 crores (up 21% sequentially) and outlining expansion plans across senior living residences, care homes, and wellness products. The company aims to establish 8-10 residential communities with 8,000-10,000 residents and 2,000 care home beds across multiple clusters in India over the next 4-5 years, targeting the projected USD 33 billion senior care market by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1765169895317,
            "Source": "stock"
        },
        {
            "Title": "Max India Limited Grants 2.7 Lakh Employee Stock Options Under ESOP Plan 2020",
            "Summary": "Max India Limited's Nomination and Remuneration Committee approved the grant of 2,70,683 employee stock options to eligible employees at INR 99.98 per option, representing 50% of the average market price. The options follow a 4-year vesting schedule starting December 1, 2026, with exercise period of 5 years from respective vesting dates.",
            "Sentiment": "positive",
            "PublishDate": 1764606559448,
            "Source": "corporate_action"
        },
        {
            "Title": "Antara Senior Care Opens New 80-Bed Facility in Bengaluru's Whitefield",
            "Summary": "Antara Senior Care, part of the $7-billion Max Group, launched its second care home in Bengaluru with an 80-bed facility in Whitefield, bringing the city's total capacity to 163 beds and national operational capacity to 500 beds. The expansion addresses growing demand for senior care services in Bengaluru, where 11% of residents are now over 60, offering assisted living and transition care services through geriatric-trained teams.",
            "Sentiment": "positive",
            "PublishDate": 1764050223566,
            "Source": "stock"
        },
        {
            "Title": "Max India Reports 15% Revenue Growth in H1 FY26, Raises INR 204 Crores Through Rights and Preferential Issues",
            "Summary": "Max India Limited achieved consolidated revenue of INR 91.5 crores in H1 FY26, marking 15% YoY growth, driven by expansion across its senior care verticals including Care Homes, Care at Home, and AGEasy products. The company successfully raised INR 124.23 crores through rights issue and INR 80 crores via preferential warrants to fund growth initiatives, while Care Homes occupancy improved from 20% to 25% and AGEasy reached monthly run rate of INR 7-8 crores.",
            "Sentiment": "positive",
            "PublishDate": 1763634170529,
            "Source": "earnings"
        },
        {
            "Title": "Max India Limited Uploads Audio Recording of Q2 H1 FY26 Earnings Conference Call",
            "Summary": "Max India Limited hosted an earnings conference call on November 14, 2025, where senior management discussed performance for Q2 H1 FY26 ended September 30, 2025. The company has uploaded the audio recording on its website and informed stock exchanges BSE and NSE as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1763124828434,
            "Source": "earnings"
        },
        {
            "Title": "Max India Targets 20% Revenue Growth Through Senior Living and Healthcare Expansion",
            "Summary": "Max India announced diversified expansion plans across senior living and healthcare sectors, with Antara Senior Care rapidly scaling operations through new facilities in Gurugram and Bengaluru. The company strengthened cash flows through operational real-estate monetization and set a target of achieving sustainable 20% revenue CAGR.",
            "Sentiment": "positive",
            "PublishDate": 1763051996889,
            "Source": "stock"
        },
        {
            "Title": "Max India Limited Reports Rights Issue Proceeds Utilization for Quarter Ended September 2025",
            "Summary": "Max India Limited utilized Rs. 29.15 crores from its Rs. 124.23 crore rights issue during the quarter ended September 30, 2025, with Rs. 9.91 crores spent on branding and marketing activities and Rs. 18.72 crores on working capital requirements. CARE Ratings Limited, serving as monitoring agency, reported no deviation from stated objectives, while the company recorded consolidated losses of Rs. 140.39 crores in FY25 and Rs. 25.64 crores in Q1 FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1763046444380,
            "Source": "corporate_action"
        },
        {
            "Title": "Max India's Antara Senior Care Partners with Cloudphysician for AI-Enabled Patient Management System",
            "Summary": "Max India's subsidiary Antara Senior Care has partnered with Cloudphysician to launch an AI-enabled patient management system. The system is designed to enhance transition care results for patients.",
            "Sentiment": "positive",
            "PublishDate": 1762923180714,
            "Source": "stock"
        },
        {
            "Title": "Max India Limited Schedules Q2 H1 FY26 Earnings Conference Call for November 14, 2025",
            "Summary": "Max India Limited has announced an earnings conference call scheduled for Friday, November 14, 2025, at 11:00 AM IST to discuss Q2 H1 FY26 financial results. The virtual conference call will be open to all investors and the general public. Senior management teams from Max India and Antara will participate in the call. Max India Limited serves as the holding company for Max Group's Senior Care business, including Antara Senior Living Limited and Antara Assisted Care Services Limited. The Max Group recorded consolidated revenues of Rs. 46,911 crores in FY2025 and has a customer base of 4 million with around 26,000 employees. Antara operates senior living communities and assisted care services, with plans to develop 8-10 residential communities for seniors and build a bed capacity of 2,000 beds in Care Homes over the next 5 years.",
            "Sentiment": "neutral",
            "PublishDate": 1762471386914,
            "Source": "earnings"
        },
        {
            "Title": "Max India Limited Allots 36.2 Lakh Convertible Warrants, Raises Rs. 80.35 Crores",
            "Summary": "Max India Limited's Board approved the allotment of 36,19,594 fully convertible warrants at Rs. 222 per warrant, raising Rs. 80.35 crores through a preferential issue. The allotment includes both promoter and non-promoter entities, with Max Ventures Investment Holdings Private Limited receiving 9,91,162 warrants as the promoter entity. Major non-promoter allottees include Singularity Equity Fund I with 22,53,085 warrants and P&Y Capital Trust with 1,79,855 warrants. Each warrant converts into one fully paid-up equity share of Rs. 10 upon payment of the remaining 50% consideration. The allotted securities are subject to lock-in restrictions as per SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1758709490006,
            "Source": "corporate_action"
        },
        {
            "Title": "Max India Limited Seeks Public Objections for Registered Office Relocation from Maharashtra to Delhi",
            "Summary": "Max India Limited has announced plans to shift its registered office from Maharashtra to the National Capital Territory of Delhi. The company published newspaper advertisements in Business Standard (English) and Navakal (Marathi) seeking public objections to this proposed change. The relocation requires amendments to the company's Memorandum of Association. A special resolution was passed at the Annual General Meeting held on September 03, 2025 to enable this office change. Any person whose interest may be affected by the proposed change can file objections through the MCA-21 portal or send them by registered post to the Regional Director within fourteen days of the notice publication.",
            "Sentiment": "neutral",
            "PublishDate": 1758275043026,
            "Source": "corporate_action"
        },
        {
            "Title": "Antara Senior Care Launches Digital Campaign with Hiten Tejwani to Promote Senior Care Awareness",
            "Summary": "Antara Senior Care, a wholly owned subsidiary of Max India Limited, launched a five-part digital campaign featuring television actor Hiten Tejwani. The 'Expert Senior Care, Apno Jaisi' campaign aims to raise awareness about dignified care solutions for India's aging population. The campaign addresses challenges of caregiving as families become geographically dispersed, highlighting services including stroke recovery, post-surgical rehabilitation, and dementia care. According to the JLL-ASLI Senior Housing Report, India's senior population is projected to grow from 156.7 million in 2024 to 346 million by 2050. Antara operates Care Homes and Memory Care Homes in Noida, Gurugram, Bengaluru, and Chennai, offering residential care, rehabilitation services, and 24x7 medical support. The company is part of the $5-billion Max Group and operates senior residential communities in Dehradun and upcoming facilities in Noida and Gurugram.",
            "Sentiment": "positive",
            "PublishDate": 1758088328805,
            "Source": "stock"
        },
        {
            "Title": "Max India Reports Q1 FY26 Results with 2.2x Growth in Antara Assisted Care and AGEasy Revenues",
            "Summary": "Max India Limited reported quarterly results with net revenue of INR41.3 crores, down 9% from previous quarter due to lower management fees. The company's Antara Assisted Care segment achieved net revenue of INR22.06 crores, representing 2.2x year-on-year growth. AGEasy business recorded INR14.2 crores revenue with 2.2x growth. The company completed a rights issue oversubscribed by 1.45x and sold 100% inventory of Estate 360 project within 10-11 months, collecting INR273 crores with 99% efficiency. Care Home occupancy improved from 14% in April to 23% in June. The company added 45 new beds and expects 500 total beds by end of current quarter. AGEasy expanded to 85 products and 180 SKUs, filing 3 patents for innovative products. Consolidated EBITDA was INR23.3 crores versus INR36.9 crores in previous quarter. The company maintains INR320 crores in treasury and other assets with consolidated net worth of INR460 crores. Management expects INR90 crores cash burn in Assisted Care segment for FY26 and projects AGEasy breakeven by FY27-28.",
            "Sentiment": "positive",
            "PublishDate": 1755000372156,
            "Source": "earnings"
        },
        {
            "Title": "Max India Plans FY26 Scale-Up with Rs 320 Cr Liquidity and Margin Expansion",
            "Summary": "Max India is planning long-term growth across its senior living, assisted care, and health products segments, driven by strong demand. The company is targeting a scale-up by FY26, supported by Rs 320 crore in liquidity, a new project pipeline, and planned margin expansion across its business verticals.",
            "Sentiment": "positive",
            "PublishDate": 1754406026187,
            "Source": "stock"
        },
        {
            "Title": "Max India Reports Q1 FY26 Results with 29% Revenue Growth Despite Sequential Decline",
            "Summary": "Max India Limited reported consolidated revenue of Rs 41.3 crore for Q1 FY26, representing a 29% increase year-over-year but a 9% decline from the previous quarter. The company's EBITDA loss narrowed to Rs 23.3 crore compared to Rs 36.9 crore in Q4 FY25. The business operates across four verticals: Residences for Seniors, Care Homes, Care at Home services, and AGEasy products. Key highlights include Care Homes revenue growing 2.2x year-over-year to Rs 2.94 crore with 334 bed capacity across multiple cities, and AGEasy achieving Rs 14.2 crore revenue with 2.2x growth. The company successfully raised Rs 124.23 crore through an oversubscribed rights issue in May 2025, bringing liquidity position to approximately Rs 320 crore. Consolidated net worth stands at Rs 460.2 crore as of June 2025. The Doon residence project continues to be profitable with Rs 85 crore cash surplus, while the Noida project faces regulatory challenges with occupancy certificate approval pending.",
            "Sentiment": "neutral",
            "PublishDate": 1754405281425,
            "Source": "earnings"
        },
        {
            "Title": "Max India Plans to Raise 803.5 Million Rupees Through Convertible Warrants",
            "Summary": "Max India has announced plans to raise up to 803.5 million rupees through the issuance of convertible warrants. This fundraising initiative will provide the company with additional capital through these financial instruments that can be converted into equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1754400659146,
            "Source": "stock"
        },
        {
            "Title": "Max India Board Approves ₹80.35 Crore Fund Raise and Registered Office Shift to Delhi",
            "Summary": "Max India Limited's Board approved raising funds up to ₹80.35 crores through preferential issue of 37,03,000 convertible warrants at ₹217 per warrant to promoters and non-promoter public investors. The warrants are convertible into equity shares within 9 months from allotment date. The Board also approved shifting the company's registered office from Mumbai to Delhi and a material related party transaction involving wholly owned subsidiary Antara Senior Living Limited with Senior Living Limited and Contend Builders Private Limited. All decisions are subject to shareholder and regulatory approvals. Post-conversion, promoter Max Ventures Investment Holdings' shareholding would decrease from 41.15% to 40.24%.",
            "Sentiment": "positive",
            "PublishDate": 1754399181709,
            "Source": "corporate_action"
        },
        {
            "Title": "Max India Reports Quarterly Profit of Rs 5.71 Crores, Completes Property Sale",
            "Summary": "Max India Limited reported a standalone profit of Rs 5.71 crores for the quarter ended June 30, 2025, compared to a loss of Rs 3.39 crores in the previous quarter. Revenue from operations declined to Rs 2.85 crores from Rs 3.30 crores in the prior quarter. The company recorded exceptional gains of Rs 7.88 crores, primarily from the sale of three floors at Max Towers, Noida to Max Towers Private Limited for Rs 105.08 crores, generating a profit of Rs 9.53 crores. On a consolidated basis, the company reported a loss of Rs 25.64 crores. The company completed a rights issue during the quarter, raising Rs 124.23 crores through allotment of 82.81 lakh equity shares at Rs 150 per share. Max India also allotted 3.00 lakh equity shares to employees under its ESOP plan. The trading window for the company's securities will remain closed until August 7, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754398257071,
            "Source": "earnings"
        },
        {
            "Title": "Max India Schedules Board Meeting to Discuss Potential Fund Raising",
            "Summary": "Max India has announced plans to hold a board meeting on August 5th to discuss a possible fund raising initiative. The company will evaluate fundraising options during this scheduled meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1753966437319,
            "Source": "stock"
        },
        {
            "Title": "Antara Senior Care Enhances Services with Cashless Insurance Coverage",
            "Summary": "Max India reports that Antara Senior Care has improved access to transition care for seniors by introducing cashless insurance coverage in their care homes. This new offering aims to provide better financial support and care options for elderly residents.",
            "Sentiment": "positive",
            "PublishDate": 1751346133000,
            "Source": "default"
        },
        {
            "Title": "Max India Sells Three Floors at Max Towers for 1.05 Billion Rupees",
            "Summary": "Max India has announced the sale of three floors at Max Towers, located in Noida, to Max Estates for a total of 1.05 billion rupees. This transaction represents a significant real estate deal within the Max Group of companies.",
            "Sentiment": "positive",
            "PublishDate": 1746794254000,
            "Source": "default"
        },
        {
            "Title": "Max India Ltd: Rights Issue to Raise ₹124.23 Crore Approved",
            "Summary": "Max India's board approves rights issue of 82,81,973 shares at ₹150 per share, aiming to raise ₹124.23 crore. Issue ratio is 19:100, with record date set for April 29, 2025. Issue period: May 7-22, 2025, extendable up to 30 days.",
            "Sentiment": "positive",
            "PublishDate": 1745437873000,
            "Source": "corporate_action"
        },
        {
            "Title": "Max India Announces Rights Issue Price",
            "Summary": "Max India has set the price for its rights issue at 150 rupees per share. This corporate action allows existing shareholders to purchase additional shares at a specified price, often at a discount to the market price.",
            "Sentiment": "neutral",
            "PublishDate": 1745422642000,
            "Source": "default"
        },
        {
            "Title": "Max India: Plans Rs 125 Crore Rights Issue",
            "Summary": "Max India Ltd. announces plans to raise up to Rs 125 crore through a rights issue of equity shares with a face value of Rs 10 each. The company will determine the record date and finalize detailed terms including issue price, entitlement ratio, and timing in accordance with applicable laws.",
            "Sentiment": "positive",
            "PublishDate": 1744735733000,
            "Source": "corporate_action"
        },
        {
            "Title": "Max India Announces Rights Issue to Raise Up to 1.25 Billion Rupees",
            "Summary": "Max India has announced a rights issue to raise up to 1.25 billion rupees (approximately $15 million USD). A rights issue is a type of corporate action where existing shareholders are given the right to purchase additional shares at a discounted price. This move is likely aimed at raising capital for the company's operations or expansion plans.",
            "Sentiment": "neutral",
            "PublishDate": 1744727706000,
            "Source": "default"
        },
        {
            "Title": "Max India to Consider Fund Raising Through Rights Issue",
            "Summary": "Max India has announced that it will consider a proposal for fund raising on April 15. The company is exploring options including issuing equity shares or other securities through a rights issue or any other permissible mode.",
            "Sentiment": "neutral",
            "PublishDate": 1744124252000,
            "Source": "corporate_action"
        },
        {
            "Title": "Max India Announces Global Settlement Between Analjit Singh and Neelu Singh",
            "Summary": "Max India has reported that a global settlement has been reached between Analjit Singh, the Founder and Chairman of Max Group, and Neelu Singh. This settlement likely resolves any outstanding disputes or legal issues between the two parties, though specific details of the agreement were not provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1739405724000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Max India Announces Global Settlement Between Analjit Singh and Neelu Singh",
            "Summary": "Max India has reported that a global settlement has been reached between Analjit Singh, the founder and chairman of Max Group, and Neelu Singh. This settlement likely resolves any outstanding disputes or legal issues between the two parties, potentially impacting the company's operations or governance structure.",
            "Sentiment": "neutral",
            "PublishDate": 1739361240000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Max India Reports Q3 Loss and Approves Capital Infusion",
            "Summary": "Max India reported a consolidated net loss of 446 million rupees in Q3, compared to a loss of 179 million rupees in the same period last year. The company's revenue decreased to 347 million rupees from 407 million rupees year-over-year. Additionally, Max India approved an infusion of up to 2.19 billion rupees into its wholly owned subsidiaries.",
            "Sentiment": "negative",
            "PublishDate": 1738885591000,
            "Source": "result"
        },
        {
            "Title": "Max India Reports Increased Q3 Net Loss and Decreased Revenue",
            "Summary": "Max India has reported a consolidated net loss of 446 million rupees for the third quarter, which is a significant increase from the 179 million rupee loss in the same period last year. The company's revenue also declined to 347 million rupees from 407 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738846887000,
            "Source": "earnings"
        },
        {
            "Title": "Max India Approves Capital Infusion of Up to 2.19 Billion Rupees in Subsidiaries",
            "Summary": "Max India has approved a capital infusion of up to 2.19 billion rupees into its wholly owned subsidiaries. This decision represents a significant financial commitment by the parent company to support and potentially expand the operations of its subsidiary businesses.",
            "Sentiment": "positive",
            "PublishDate": 1738842751000,
            "Source": "corporate_action"
        },
        {
            "Title": "Max India Approves 2.19 Billion Rupee Investment in Subsidiaries",
            "Summary": "Max India has approved an infusion of up to 2.19 billion rupees into its wholly owned subsidiaries. This significant financial commitment demonstrates the company's strategy to strengthen its subsidiary operations and potentially fuel growth or expansion plans within the group.",
            "Sentiment": "positive",
            "PublishDate": 1738842725000,
            "Source": "corporate_action"
        },
        {
            "Title": "boAt Partners with Antara Senior Care for Innovative Senior Care Solutions",
            "Summary": "boAt, a consumer electronics brand, has formed a partnership with Antara Senior Care to develop innovative technology solutions for senior care. This collaboration aims to revolutionize the senior care industry by integrating boAt's expertise in consumer electronics with Antara's experience in senior care services. The partnership is expected to result in new products and services designed to enhance the quality of life for seniors.",
            "Sentiment": "positive",
            "PublishDate": 1738648280000,
            "Source": "corporate_action"
        },
        {
            "Title": "Max India Consortium Awarded Bid for 10.33 Acre Land in Noida",
            "Summary": "Max India has announced that a consortium including one of its units has been awarded a bid for a 10.33-acre land parcel in Noida. This acquisition represents a significant real estate investment for the company and its partners, potentially opening up opportunities for development or strategic asset holding in the rapidly growing Noida region.",
            "Sentiment": "positive",
            "PublishDate": 1737724291000,
            "Source": "corporate_action"
        },
        {
            "Title": "Max India Subsidiary Participates in Successful Land Bid in Noida",
            "Summary": "A subsidiary of Max India has participated in a successful bid for a 10.33-acre land parcel in Noida. The bid was awarded to a lead consortium that includes ASLL (presumably Antara Senior Living Limited, a Max Group company). This suggests Max India is expanding its real estate portfolio or potentially developing new projects in the Noida area.",
            "Sentiment": "positive",
            "PublishDate": 1737724220000,
            "Source": "corporate_action"
        },
        {
            "Title": "Max India Sells Three Floors in Max Towers for 1.05 Billion Rupees",
            "Summary": "Max India has announced the sale of three floors in its Max Towers property. The company stated that the aggregate consideration for this sale amounts to 1.05 billion Indian rupees.",
            "Sentiment": "positive",
            "PublishDate": 1735052979000,
            "Source": "corporate_action"
        },
        {
            "Title": "Max India's Subsidiary Announces Strategic Collaboration with Dr. Lal PathLabs",
            "Summary": "Max India Limited's subsidiary has entered into a strategic collaboration with Dr. Lal PathLabs, a leading diagnostic chain in India. This partnership aims to enhance healthcare services and expand the reach of diagnostic capabilities. The collaboration is expected to leverage the strengths of both companies to provide improved healthcare solutions to patients.",
            "Sentiment": "positive",
            "PublishDate": 1734600261000,
            "Source": "corporate_action"
        },
        {
            "Title": "Max India Reports Increased Q2 Net Loss",
            "Summary": "Max India has reported a consolidated net loss of 227 million rupees for the second quarter, compared to a loss of 47 million rupees in the same period last year. The company's revenue decreased to 430 million rupees from 490 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1729761313000,
            "Source": "result"
        },
        {
            "Title": "Max India Schedules Board Meeting to Discuss Fund Raising",
            "Summary": "Max India has announced a board meeting to be held on October 24 to consider fund raising options for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1729520251000,
            "Source": "corporate_action"
        },
        {
            "Title": "Max India: Antara to Manage Senior Living at Estate 360, Eyes ₹140 Crore Revenue",
            "Summary": "<p>Antara Senior Living, a <span class='neutral'>Max India subsidiary</span>, partners with <span class='neutral'>Max Estates</span> to <span class='positive'>manage senior living residences</span> at <b>Estate 360</b> in Gurgaon. The project received <span class='positive'>₹1,100 crore in pre-sale bookings</span> for senior living out of <span class='positive'>₹4,100 crore total</span>. Antara aims to <span class='positive'>earn ₹140 crore</span> over the project's lifecycle, managing two of six residences. Max Estates <span class='neutral'>revises</span> Estate 360's <span class='positive'>gross development value to ₹4,800 crore</span>, expected to be booked in FY25.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727680152000,
            "Source": "normal_news"
        }
    ]
}