{
    "Symbol": "MAYURUNIQ",
    "ISIN": "INE040D01038",
    "News": [
        {
            "Title": "Mayur Uniquoters Plans ₹200-300 Crore PVC Plant",
            "Summary": "Mayur Uniquoters evaluates two capital expenditure options for PVC plant expansion - ₹200 crore facility in South India or ₹300 crore larger global facility with significant production capacity.",
            "Sentiment": "positive",
            "PublishDate": 1770090478181,
            "Source": "stocks"
        },
        {
            "Title": "Mayur Uniquoters Targets 15% Revenue Growth",
            "Summary": "Mayur Uniquoters aims for 15% revenue growth over next two years with EBITDA margins expected to remain steady or improve through higher-margin export business expansion.",
            "Sentiment": "positive",
            "PublishDate": 1770090445834,
            "Source": "stocks"
        },
        {
            "Title": "Mayur Uniquoters Q3FY26 Net Profit Surges 77.4%",
            "Summary": "Mayur Uniquoters reported strong Q3FY26 results with net profit rising 77.4% to ₹5,293.51 lakhs and revenue growing 21.6% to ₹23,698.82 lakhs compared to Q3FY25.",
            "Sentiment": "positive",
            "PublishDate": 1769777985920,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mayur Uniquoters Board Meet Set for Jan 30, 2026",
            "Summary": "Mayur Uniquoters Limited has scheduled its board meeting for January 30, 2026, to consider and approve Q3FY26 financial results. Trading window remains closed until 48 hours post-results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1769084903491,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mayur Uniquoters General Manager Production Head Resigns",
            "Summary": "Mr. Babu Pathanjali, General Manager-Production Head for Jaitpura Plant at Mayur Uniquoters Limited, resigned from his position to pursue new career opportunities and challenges. His resignation was accepted by the company and became effective from the close of business hours on December 06, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765192456792,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mayur Uniquoters Receives Credit Rating Reaffirmation from CARE Ratings",
            "Summary": "CARE Ratings Agency reaffirmed Mayur Uniquoters Limited's credit ratings with CARE AA+ Stable for long-term bank facilities of Rs 5.90 crores (reduced from Rs 10.80 crores) and CARE A1+ for short-term facilities of Rs 20.00 crores. The artificial leather and PVC vinyl manufacturer also received reaffirmed ratings for long-term/short-term bank facilities of Rs 65.00 crores, reduced from Rs 67.00 crores.",
            "Sentiment": "positive",
            "PublishDate": 1763620760353,
            "Source": "stock"
        },
        {
            "Title": "Mayur Uniquoters Reports Strong Q2 FY26 Results with 15% Standalone Revenue Growth",
            "Summary": "Mayur Uniquoters achieved standalone revenue of INR 237.76 crores with 15% growth and PAT of INR 48.10 crores with 17% growth in Q2 FY26, driven by increased export orders from U.S. OEMs. The company maintains its guidance of 12-15% revenue growth and 15-20% profit growth for FY26, with export business expected to grow faster than domestic operations.",
            "Sentiment": "positive",
            "PublishDate": 1763184781071,
            "Source": "earnings"
        },
        {
            "Title": "Mayur Uniquoters Reports Strong Q2 Performance with 16% Revenue Growth",
            "Summary": "Mayur Uniquoters delivered robust quarterly results with net profit rising to 481 million rupees from 414 million rupees year-over-year. Revenue increased to 2.38 billion rupees compared to 2.16 billion rupees in the same period last year. EBITDA grew to 591.4 million rupees from 479.5 million rupees, while EBITDA margin expanded to 24.87% from 22.16% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1762864809862,
            "Source": "earnings"
        },
        {
            "Title": "Mayur Uniquoters Reports Steady Q1 Growth with Strong Export Performance",
            "Summary": "Mayur Uniquoters delivered mixed quarterly results with consolidated revenue growing 1% to Rs. 215.88 crores and consolidated PAT increasing 2% to Rs. 40.73 crores. Standalone performance was stronger, with revenue rising 6% to Rs. 206.41 crores and PAT jumping 19% to Rs. 41.23 crores. Export business contributed 40% of total revenue at Rs. 80.05 crores, driven by good orders from US and OEM supplies. The company received strong export orders and expects increased momentum for the next 2-3 years. Domestic market faced some headwinds in Q1 but management expects improvement in Q2 due to festive season. The company is expanding its retail distribution network to around 1000 dealers and entering new segments including garments. Management maintains FY2026 guidance of 12-15% revenue growth and expects 15-20% profit growth, while postponing Mexico plant expansion due to uncertainties. The company is focusing on high-quality, high-price products and targeting multinational brands to improve profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754915600310,
            "Source": "earnings"
        },
        {
            "Title": "Mayur Uniquoters Projects 10-15% Revenue Growth and 15-20% Profit Rise for FY2026",
            "Summary": "Mayur Uniquoters announced its growth projections for fiscal year 2026, expecting revenue to increase by 10-15% and profit to rise by 15-20%. The company reaffirmed its commitment to achieving these financial targets during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1754623943411,
            "Source": "stock"
        },
        {
            "Title": "Mayur Uniquoters Sets August 22 Record Date for Dividend and AGM Participation",
            "Summary": "Mayur Uniquoters Limited has set August 22, 2025 as the record date for determining shareholder eligibility for dividend payment for the financial year ended March 31, 2025, and participation in the 32nd Annual General Meeting scheduled for September 17, 2025. The dividend requires approval at the AGM and will be paid within 30 days of the meeting date, subject to tax deduction at source. Shareholders whose names appear in the beneficial owners list from NSDL and CDSL or in the company's register of members as of the record date will be eligible.",
            "Sentiment": "neutral",
            "PublishDate": 1753885617992,
            "Source": "corporate_action"
        },
        {
            "Title": "Mayur Uniquoters Reports Q1 FY2026 Results; Senior HR Manager Resigns",
            "Summary": "Mayur Uniquoters Limited approved its unaudited standalone and consolidated financial results for Q1 FY2026 ended June 30, 2025. The company reported standalone revenue from operations of Rs 21,418.09 lakhs compared to Rs 19,474.17 lakhs in the previous quarter, with net profit of Rs 4,122.70 lakhs versus Rs 3,501.52 lakhs. On a consolidated basis, revenue reached Rs 21,587.65 lakhs against Rs 25,055.80 lakhs in the prior quarter, with net profit of Rs 4,072.91 lakhs compared to Rs 4,150.23 lakhs. The company scheduled its 32nd Annual General Meeting for September 17, 2025, via video conferencing and fixed August 22, 2025 as the record date for final dividend entitlement. Additionally, Mr. Ravi Pant resigned from his position as Senior General Manager - HR and Administration, effective August 8, 2025, citing personal reasons.",
            "Sentiment": "neutral",
            "PublishDate": 1753868511541,
            "Source": "earnings"
        },
        {
            "Title": "Mayur Uniquoters Reports 18.6% Growth in Q1 Net Profit to 412 Million Rupees",
            "Summary": "Mayur Uniquoters reported Q1 net profit of 412 million rupees compared to 347.3 million rupees in the same period last year, representing an 18.6% year-over-year increase. The company's EBITDA grew to 434 million rupees from 426 million rupees year-over-year. However, EBITDA margin declined slightly to 21% from 21.86% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753867643066,
            "Source": "earnings"
        },
        {
            "Title": "Mayur Uniquoters: Stock Surges 12% on Q4 Results and Dividend Announcement",
            "Summary": "Mayur Uniquoters' stock jumped over 12% in morning trading following the release of Q4 results and a dividend declaration after market hours on Thursday.",
            "Sentiment": "positive",
            "PublishDate": 1746763948000,
            "Source": "result"
        },
        {
            "Title": "Mayur Uniquoters Q4 Results: Revenue Dips, Profit Rises, Dividend Declared",
            "Summary": "Mayur Uniquoters reported Q4 results with a slight decrease in revenue to 2.14B rupees from 2.16B YoY. However, net profit increased to 350.2M rupees from 319.8M YoY. EBITDA rose to 447.4M rupees with an improved margin of 20.89%. The company recommended a final dividend of 5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746703464000,
            "Source": "result"
        },
        {
            "Title": "Mayur Uniquoters Reports Improved Q3 EBITDA and Margin",
            "Summary": "Mayur Uniquoters has reported a significant increase in its Q3 EBITDA, rising to 455.1 million rupees from 378 million rupees in the same quarter last year. The company's EBITDA margin also improved, reaching 23.35% compared to 21.63% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738324295000,
            "Source": "earnings"
        },
        {
            "Title": "Mayur Uniquoters Reports Q3 Revenue Growth",
            "Summary": "Mayur Uniquoters has announced its third quarter financial results, reporting revenue of 1.95 billion rupees. This represents an increase from the 1.75 billion rupees reported in the same quarter of the previous year, indicating year-over-year growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1738324289000,
            "Source": "earnings"
        },
        {
            "Title": "Mayur Uniquoters Reports Q3 Net Profit of 298.4 Million Rupees",
            "Summary": "Mayur Uniquoters has announced its financial results for the third quarter. The company reported a net profit of 298.4 million rupees, showing a slight increase from 292 million rupees in the same quarter last year. However, there was a decrease from the previous quarter's net profit of 414.3 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1738324282000,
            "Source": "earnings"
        },
        {
            "Title": "Mayur Uniquoters Reports Improved Q2 Financial Performance",
            "Summary": "Mayur Uniquoters has announced its Q2 financial results, showing significant improvements in key metrics. The company's EBITDA increased to 479.5 million rupees, up from 376 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 22.16% from 20.72% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731061896000,
            "Source": "result"
        },
        {
            "Title": "Mayur Uniquoters Reports Q2 Revenue Growth",
            "Summary": "Mayur Uniquoters has announced its second quarter revenue, which stands at 2.2 billion rupees. This represents an increase from 1.81 billion rupees in the same quarter of the previous year, indicating year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731061884000,
            "Source": "result"
        },
        {
            "Title": "Mayur Uniquoters Reports Significant Profit Growth in Q2",
            "Summary": "Mayur Uniquoters has announced its Q2 financial results, reporting a net profit of 414 million rupees. This represents a substantial year-over-year increase from 284 million rupees in the same quarter last year. The company also showed quarter-over-quarter growth, up from 347.3 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731061873000,
            "Source": "result"
        }
    ]
}