{
    "Symbol": "MAZDA",
    "ISIN": "INE885E01042",
    "News": [
        {
            "Title": "Mazda Secures ₹28.75 Cr Order for Waste Management",
            "Summary": "Mazda Ltd wins major order for multi effect evaporator system and agitated thin film dryer from waste management firm. Project completion timeline set at 8 months with significant revenue impact expected.",
            "Sentiment": "positive",
            "PublishDate": 1767165856472,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mazda Limited Secures Rs. 24.50 Crore Order for Condensers Supply",
            "Summary": "Mazda Limited received an order worth Rs. 24.50 crore (excluding tax) from a leading EPC consultant in Mumbai for manufacturing and supply of condensers. The domestic contract is to be executed within 11 months from the date of approval of technical drawings and documents, with no related party transactions involved.",
            "Sentiment": "positive",
            "PublishDate": 1764664324423,
            "Source": "order&deals"
        },
        {
            "Title": "Mazda Limited Reports Quarterly Results for Second Quarter and Half Year Ended September 2025",
            "Summary": "Mazda Limited announced its unaudited financial results for the second quarter and half year ended September 30, 2025. The company operates through two segments: Engineering Division and Food Division. Revenue from operations for the quarter was Rs. 5,083.87 lacs compared to Rs. 4,963.12 lacs in the previous quarter. For the half year, revenue reached Rs. 10,046.99 lacs versus Rs. 9,296.47 lacs in the corresponding previous period. The company's total assets stood at Rs. 28,721.41 lacs as of September 30, 2025, compared to Rs. 26,469.17 lacs as of March 31, 2025. Cash and cash equivalents decreased to Rs. 796.52 lacs from Rs. 944.22 lacs. The company paid dividends of Rs. 720.90 lacs during the half year period. The results were approved by the Board of Directors and reviewed by statutory auditors Mayank Shah Associates.",
            "Sentiment": "neutral",
            "PublishDate": 1762994150669,
            "Source": "earnings"
        },
        {
            "Title": "Mazda Reports Mixed Q2 Results with Higher EBITDA Margin Despite Revenue Decline",
            "Summary": "Mazda reported quarterly results showing EBITDA of 105 million rupees compared to 90 million rupees in the same period last year. The EBITDA margin improved to 20.59% from 15.83% year-over-year. However, net profit declined to 76 million rupees from 90 million rupees, while revenue dropped to 508 million rupees from 568 million rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762963301028,
            "Source": "earnings"
        },
        {
            "Title": "Mazda Limited Sets Book Closure Dates and Record Date for Final Dividend FY2024-25",
            "Summary": "Mazda Limited has announced book closure dates and record date for determining shareholder eligibility for final dividend for the financial year 2024-25. The register of members will be closed from September 5-12, 2025, with September 4, 2025 set as the record date. If approved at the AGM on September 18, 2025, the dividend will be paid after September 29, 2025, subject to tax deductions.",
            "Sentiment": "neutral",
            "PublishDate": 1754569386099,
            "Source": "corporate_action"
        },
        {
            "Title": "MAZDA Reports Strong Q1 Performance with 88% Jump in EBITDA and 69% Revenue Growth",
            "Summary": "MAZDA delivered robust quarterly results with EBITDA rising to 32 million rupees from 17 million rupees year-over-year, representing an 88% increase. The company's EBITDA margin improved to 6.5% from 4.75% in the same period last year. Net profit surged 69% to 49 million rupees compared to 29 million rupees year-over-year. Revenue grew significantly to 496 million rupees from 362 million rupees, marking a 37% year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1754411039944,
            "Source": "earnings"
        },
        {
            "Title": "Mazda Ltd Approves Q1 2025 Financial Results and Appoints New Auditors",
            "Summary": "Mazda Ltd's Board of Directors approved the unaudited financial results for the first quarter ended June 30, 2025, along with the Limited Review Report from statutory auditors Mayank Shah & Associates. The company scheduled its 35th Annual General Meeting for September 18, 2025, at 12:00 P.M. through video conferencing. The Board appointed M/s. Rutul Shukla & Associates as Secretarial Auditor for a five-year term from financial year 2025-26 to 2029-30, subject to shareholder approval at the AGM. Additionally, M/s. D A K & Associates was appointed as Internal Auditors for financial year 2025-26. The Board meeting was held on August 5, 2025, lasting from 7:00 P.M. to 8:25 P.M.",
            "Sentiment": "neutral",
            "PublishDate": 1754409911231,
            "Source": "earnings"
        },
        {
            "Title": "Mazda Reports Q4 Results and Dividend Recommendation",
            "Summary": "Mazda has announced its Q4 financial results and dividend recommendation. The company's Q4 EBITDA decreased to 79 million rupees from 121 million rupees year-over-year, with EBITDA margin falling to 14.72% from 20.99%. Q4 net profit declined to 56 million rupees from 93.7 million rupees year-over-year and 74 million rupees quarter-on-quarter. Revenue for Q4 was 535 million rupees, down from 575.5 million rupees in the previous year. The company has recommended a dividend of 3.6 rupees per equity share.",
            "Sentiment": "negative",
            "PublishDate": 1748532094000,
            "Source": "result"
        },
        {
            "Title": "Mazda Reports Decline in Q3 Profit and Revenue",
            "Summary": "Mazda has reported its financial results for the third quarter. The company's net profit decreased to 74 million rupees from 83 million rupees in the same period last year. Revenue also declined to 468 million rupees from 540 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739372430000,
            "Source": "earnings"
        }
    ]
}