{
    "Symbol": "MBAPL",
    "ISIN": "INE900L01010",
    "News": [
        {
            "Title": "Madhya Bharat Agro Reports 116% Q3 Sales Growth",
            "Summary": "Madhya Bharat Agro Products delivered exceptional Q3 FY26 performance with 116% YoY revenue growth to ₹612.39 crores and 77% net profit increase. Company announces ₹450 crore capacity expansion.",
            "Sentiment": "positive",
            "PublishDate": 1767934893688,
            "Source": "co_actions_results"
        },
        {
            "Title": "Madhya Bharat Agro Expands Fertilizer Capacity",
            "Summary": "Madhya Bharat Agro Products approves major expansion at Dhule facility, adding 3,30,000 TPY DAP/NPK plant capacity along with phosphoric acid and sulphuric acid production units.",
            "Sentiment": "positive",
            "PublishDate": 1767852017667,
            "Source": "stocks"
        },
        {
            "Title": "Madhya Bharat Agro Q3 EBITDA Rises 68.5% to ₹66.40 Cr",
            "Summary": "Madhya Bharat Agro Products reports Q3 EBITDA growth to ₹66.40 crores from ₹39.40 crores YoY, though EBITDA margin compressed to 10.8% from 14% in fertilizers sector.",
            "Sentiment": "neutral",
            "PublishDate": 1767851561072,
            "Source": "co_actions_results"
        },
        {
            "Title": "Madhya Bharat Agro Products Plans 90,000 MT Capacity Expansion in Banda",
            "Summary": "Madhya Bharat Agro Products announced plans to increase its DAP/NPK production capacity by 90,000 metric tons per year at its facility in Banda, Madhya Pradesh. The company is developing financial and other strategies to support this capacity expansion initiative.",
            "Sentiment": "positive",
            "PublishDate": 1759998754300,
            "Source": "stock"
        },
        {
            "Title": "Madhya Bharat Agro Reports Strong Q2 Performance with Net Profit Doubling",
            "Summary": "Madhya Bharat Agro delivered strong quarterly results with net profit surging to 305 million rupees compared to 138 million rupees in the same period last year. The company's EBITDA increased to 618 million rupees from 362 million rupees year-over-year. EBITDA margin improved to 13.74% versus 13.02% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1759905944625,
            "Source": "earnings"
        },
        {
            "Title": "Madhya Bharat Agro Announces Major Capacity Expansion Plans",
            "Summary": "Madhya Bharat Agro has announced significant expansion plans for its production facilities. The company intends to increase capacities for NPK/DAP to 330,000 MT/year, Phosphoric Acid to 99,000 MT/year, and Sulfuric Acid to 198,000 MT/year. Additionally, they plan to add a new SSP plant with a capacity of 330,000 MT/year. The expansion will take place in Dhule, Maharashtra, with a total investment of Rs 600-650 crore.",
            "Sentiment": "positive",
            "PublishDate": 1752723496000,
            "Source": "default"
        },
        {
            "Title": "Madhya Bharat Agro Shares Projections for New Dhule Facility",
            "Summary": "Madhya Bharat Agro provided updates on its new Dhule facility during a conference call. The company anticipates an asset turnover ratio close to 1:1 in the first year of operation. Management expects PBT margins of approximately 8-10%. The new plant is projected to operate at 50% capacity in FY27 and 70% in FY28, with operations set to begin in September 2026.",
            "Sentiment": "positive",
            "PublishDate": 1752723368000,
            "Source": "default"
        },
        {
            "Title": "Madhya Bharat Agro Products Reports Q1 Financial Results",
            "Summary": "Madhya Bharat Agro Products has released its Q1 financial results. The company's revenue increased to 4.12 billion rupees from 2.01 billion rupees year-over-year. EBITDA rose to 570 million rupees from 337 million rupees, while the EBITDA margin decreased to 13.9% from 16.8%. Net profit for Q1 grew to 282 million rupees from 115 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1752214335000,
            "Source": "result"
        },
        {
            "Title": "Madhya Bharat Agro Products Secures Rs. 633 Crore Financing Agreement with SBI Consortium",
            "Summary": "Madhya Bharat Agro Products has executed agreements worth Rs. 633 crores with a State Bank of India-led consortium. The financing is intended to support both existing and proposed facilities of the company.",
            "Sentiment": "positive",
            "PublishDate": 1743120702000,
            "Source": "corporate_action"
        },
        {
            "Title": "Madhya Bharat Agro Products Secures Rs. 633 Crore Loan Agreement with SBI Consortium",
            "Summary": "Madhya Bharat Agro Products has announced the execution of loan agreements totaling Rs. 633 crores with a consortium led by the State Bank of India. These agreements cover both existing and proposed facilities, indicating a significant financial arrangement for the company's operations and potential expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1743082149000,
            "Source": "corporate_action"
        },
        {
            "Title": "Madhya Bharat Agro Approves 200 Crore Rupee Fund Raise",
            "Summary": "Madhya Bharat Agro has approved a fund raise of 200 crore rupees. This decision indicates a significant financial move for the company, potentially aimed at expansion, debt reduction, or other strategic initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1736925400000,
            "Source": "corporate_action"
        },
        {
            "Title": "Madhya Bharat Agro Reports Significant Increase in Q3 EBITDA and Margin",
            "Summary": "Madhya Bharat Agro has announced its Q3 financial results, showing a substantial improvement in performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) rose to 394.3 million rupees, compared to 179.8 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin expanded significantly to 13.90% from 0.74% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1736925054000,
            "Source": "earnings"
        },
        {
            "Title": "Madhya Bharat Agro Products Reports Q3 Revenue Increase",
            "Summary": "Madhya Bharat Agro Products has reported a revenue of 2.8 billion rupees for the third quarter, compared to 2.4 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1736925053000,
            "Source": "earnings"
        },
        {
            "Title": "Madhya Bharat Agro Reports Significant Increase in Q3 Net Profit",
            "Summary": "Madhya Bharat Agro has reported a substantial increase in its third-quarter net profit. The company's net profit for Q3 reached 179 million rupees, compared to 13 million rupees in the same period last year, representing a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1736924996000,
            "Source": "earnings"
        },
        {
            "Title": "Madhya Bharat Agro Products Reports Q2 Financial Results",
            "Summary": "<p>Madhya Bharat Agro Products has reported its Q2 financial results. The company's <span class='neutral'>EBITDA</span> for Q2 was <b>363 million rupees</b>, compared to <b>404.4 million rupees</b> in the same quarter last year, showing a <span class='negative'>year-over-year decrease</span>. The <span class='neutral'>EBITDA margin</span> for Q2 was <b>13.04%</b>, down from <b>14.52%</b> in the previous year's corresponding quarter.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728992844000,
            "Source": "result"
        },
        {
            "Title": "Madhya Bharat Agro Products Reports Q2 Revenue",
            "Summary": "<p>Madhya Bharat Agro Products has reported its <b>second quarter revenue</b> as <span class='neutral'>2.8 billion rupees</span>. This figure remains <span class='neutral'>unchanged</span> compared to the same period last year (year-over-year). However, it shows an <span class='positive'>increase</span> from <span class='neutral'>2 billion rupees</span> in the previous quarter (quarter-over-quarter).</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728992829000,
            "Source": "result"
        },
        {
            "Title": "Madhya Bharat Agro Products Reports Q2 Financial Results",
            "Summary": "<p>Madhya Bharat Agro Products has reported its Q2 <span class='neutral'>net profit</span> at <span class='neutral'>138.4 million rupees</span>, compared to <span class='positive'>149.3 million rupees</span> in the same quarter last year (<b>year-over-year</b>) and <span class='negative'>115 million rupees</span> in the previous quarter (<b>quarter-over-quarter</b>).</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728992816000,
            "Source": "result"
        }
    ]
}