{
    "Symbol": "MBEL",
    "ISIN": "INE08N601015",
    "News": [
        {
            "Title": "M & B Engineering Q3 FY26 IPO Proceeds Report Filed",
            "Summary": "M & B Engineering submitted its Q3 FY26 monitoring agency report showing Rs 27.68 million utilization during the quarter, with Rs 1,320.96 million remaining unutilized from the Rs 2,750.00 million IPO proceeds.",
            "Sentiment": "neutral",
            "PublishDate": 1770803541111,
            "Source": "co_actions_results"
        },
        {
            "Title": "M&B Engineering Board Meet Set for Feb 9 for Q3 Results",
            "Summary": "M&B Engineering Limited has scheduled a board meeting on February 9, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770091657864,
            "Source": "co_actions_results"
        },
        {
            "Title": "M & B Engineering Wins ₹47.66 Cr PEB Order",
            "Summary": "M & B Engineering secures significant order worth ₹47.66 crores for design and supply of pre-engineered buildings with 5-month completion timeline.",
            "Sentiment": "positive",
            "PublishDate": 1769152071278,
            "Source": "co_actions_results"
        },
        {
            "Title": "M&B Engineering Gains 3% on ₹63.50 Cr Order Win",
            "Summary": "M&B Engineering secured a domestic order worth ₹63.50 crore for pre-engineered buildings and structural steel, to be executed over 8.5 months. Stock jumped 2.94% to ₹354.95.",
            "Sentiment": "positive",
            "PublishDate": 1768287757418,
            "Source": "co_actions_results"
        },
        {
            "Title": "M & B Engineering Secures Rs 67 Crore US Contract for Pre-engineered Building",
            "Summary": "M & B Engineering has secured a contract worth Rs 67 crore for a pre-engineered building project in the USA. This international order represents a significant business win for the company, expanding its operations into the US market.",
            "Sentiment": "positive",
            "PublishDate": 1764202305479,
            "Source": "order&deals"
        },
        {
            "Title": "MB Engineering Reports 49% Revenue Growth in Q2 FY26 Despite Margin Pressures from US Tariffs",
            "Summary": "MB Engineering achieved consolidated revenue of Rs. 306.85 crores in Q2 FY26, marking 49% year-on-year growth, with strong performance across both Proflex roofing and Phenix pre-engineered building divisions. The company faced margin pressure due to Rs. 2.85 crores impact from 50% US tariffs on steel imports and Rs. 2.15 crores foreign exchange losses, but maintains 13% EBITDA guidance for the full year with a healthy order book of Rs. 930.56 crores.",
            "Sentiment": "positive",
            "PublishDate": 1763359225612,
            "Source": "earnings"
        },
        {
            "Title": "MB Engineering Reports 49% Revenue Growth in Q2 FY2026 with Strong Order Book of Rs. 930 Crores",
            "Summary": "MB Engineering Limited reported consolidated revenue growth of 49% in Q2 FY2026 and 57% in H1 FY2026 on a year-over-year basis. The Proflex Division revenues grew 57% in Q2 FY2026 and 45% in H1 FY2026, while the Phenix (PEB) Division revenues increased 47% in Q2 FY2026 and 61% in H1 FY2026. The company's unexecuted order book as of October 1, 2025 stood at Rs. 930.56 crores, comprising Phenix order book of Rs. 703 crores and Proflex order book of Rs. 227 crores. Export revenue in the Phenix Division reached Rs. 53.79 crores in Q2 FY2026 compared to Rs. 2.99 crores in Q1 FY2026. The company faced foreign exchange losses of around Rs. 2.15 crores and additional tariff costs of Rs. 2.85 crores on export orders. MB Engineering has placed orders for 3 mobile manufacturing units for the Proflex Division and is progressing with its brownfield PEB expansion project at Sanand involving additional capacity of 20,000 TPA, expected to be commissioned by Q1 FY2027.",
            "Sentiment": "positive",
            "PublishDate": 1762849373367,
            "Source": "earnings"
        },
        {
            "Title": "M & B Engineering Reports Mixed Q2 Results with Revenue Growth and Margin Decline",
            "Summary": "M & B Engineering reported Q2 consolidated net profit of 222 million rupees compared to 239 million rupees in the previous year. The company's revenue increased to 3.1 billion rupees from 2.1 billion rupees year-over-year. However, EBITDA declined to 345 million rupees from 389 million rupees, while EBITDA margin compressed significantly to 11.24% from 18.9% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1762847235861,
            "Source": "earnings"
        },
        {
            "Title": "M & B Engineering Secures $24.14 Million Export Order from USA",
            "Summary": "M & B Engineering Limited has won a $24.14 million export order for pre-engineered building and structural steel from the USA. The project is scheduled to run for 39 weeks and includes a 10% advance payment.",
            "Sentiment": "positive",
            "PublishDate": 1760673531043,
            "Source": "order&deals"
        },
        {
            "Title": "M & B Engineering Sees New Stakeholder Entries During Q2",
            "Summary": "M & B Engineering reported new stakeholder positions during Q2. Abakkus Growth acquired a 2.03% stake in the company, while Bengal Finance And Investment holds a 1.27% stake during the same period.",
            "Sentiment": "neutral",
            "PublishDate": 1760593451482,
            "Source": "stock"
        },
        {
            "Title": "M & B Engineering Secures ₹98 Crore Domestic Order for Pre-Engineered Steel Building Project",
            "Summary": "M & B Engineering has received a domestic order worth ₹98 crores for manufacturing, supplying, and erecting a pre-engineered steel building. The project is scheduled to be completed within 6 months, with 15% of the contract value to be paid upfront.",
            "Sentiment": "positive",
            "PublishDate": 1760069563013,
            "Source": "order&deals"
        },
        {
            "Title": "19.2 Million Shares Worth ₹1,265 Crore Set to Unlock for Trading",
            "Summary": "Three companies will see their shareholder lock-in periods end, making 19.2 million shares worth ₹1,265 crore eligible for trading. NSDL will have 7.5 million shares (4% of outstanding equity) valued at ₹958 crore unlock from its one-month lock-in period, with another 8 million shares set to unlock in November. Sri Lotus Developers and Realty will see 7.9 million shares (2% of outstanding equity) worth ₹141.7 crore become tradeable. M & B Engineering will have 3.8 million shares valued at ₹164.9 crore unlock. The end of lock-in periods makes shares eligible for trading but does not guarantee they will be sold in the open market.",
            "Sentiment": "neutral",
            "PublishDate": 1756870179427,
            "Source": "corporate_action"
        },
        {
            "Title": "M & B Engineering Explores Ways To Boost Proflex Production Capacity",
            "Summary": "M & B Engineering is exploring methods to increase its Proflex production capacity. The company is examining various approaches to enhance manufacturing capabilities for this product line.",
            "Sentiment": "positive",
            "PublishDate": 1756112809604,
            "Source": "stock"
        },
        {
            "Title": "M&B Engineering Reports Strong Q1 Results with 60% Revenue Growth and Successful IPO Completion",
            "Summary": "M&B Engineering Limited reported robust financial performance for the quarter ended June 30, 2025. Revenue grew 60.4% year-over-year to Rs 228.33 crore, driven by strong demand for pre-engineered buildings. EBITDA increased 75.8% to Rs 29.46 crore with margin expansion to 12.8% from 11.7% in the previous year. Profit after tax surged 106.9% to Rs 15.26 crore, with PAT margin improving to 6.7%. The company completed its IPO in August 2025, raising Rs 275.2 crore in fresh capital, which strengthened its balance sheet with net worth reaching Rs 314.43 crore. The company operates in pre-engineered buildings, structure steels, steel roofing and components segment. Management expressed confidence in maintaining growth momentum backed by robust demand and expanded capacity following the IPO.",
            "Sentiment": "positive",
            "PublishDate": 1756102784284,
            "Source": "earnings"
        }
    ]
}