{
    "Symbol": "MBLINFRA",
    "ISIN": "INE912H01013",
    "News": [
        {
            "Title": "MBL Infrastructure Wins ₹18.79 Cr Arbitration Award",
            "Summary": "Supreme Court upholds arbitration award worth ₹18.79 crores against TCIL for completed housing project in Haryana with 12% annual interest accruing monthly. Company reports improved financial position.",
            "Sentiment": "positive",
            "PublishDate": 1765443123713,
            "Source": "stocks"
        },
        {
            "Title": "MBL Infrastructure's Subsidiary Faces Insolvency Proceedings Initiated by SBI",
            "Summary": "NCLT Kolkata has initiated Corporate Insolvency Resolution Process against Suratgarh Bikaner Toll Road Company Private Ltd, a wholly-owned subsidiary of MBL Infrastructure, following an application by State Bank of India under Section 7 of the Insolvency & Bankruptcy Code. The proceedings stem from disputes between the consortium of lenders and the subsidiary regarding loan recovery and project completion delays, with the subsidiary having invoked arbitration under the Escrow Agreement.",
            "Sentiment": "negative",
            "PublishDate": 1764746804264,
            "Source": "corporate_action"
        },
        {
            "Title": "MBL Infrastructure Shares Corporate Presentation Highlighting Growth Strategy and Financial Recovery",
            "Summary": "MBL Infrastructure Limited submitted its corporate presentation to BSE and NSE, showcasing the company's infrastructure project portfolio, recent contract wins worth ₹31.28 crores, and successful implementation of its Resolution Plan under IBC 2016. The presentation details the company's operations across roads, highways, building, housing, railways and metro infrastructure segments, with promoter holding increased to 74.01% and bank facilities of ₹303.63 crores available for new projects.",
            "Sentiment": "positive",
            "PublishDate": 1764421489164,
            "Source": "stock"
        },
        {
            "Title": "MBL Infrastructure Reports ₹3.32 Crore Standalone Profit in Q2 FY26, Bank Accounts Restored to Standard Status",
            "Summary": "MBL Infrastructure posted standalone net profit of ₹3.32 crores in Q2 FY26 versus ₹2.96 crores in Q1, with consolidated profit of ₹7.65 crores including exceptional gains, while bank accounts were restored to standard status with ₹303.63 crores working capital limits available. The company implemented resolution plan for subsidiary MPRTCL making it debt-free, submitted bids for projects worth ₹854.21 crores, and targets new orders of ₹1,000 crores in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1763141371354,
            "Source": "earnings"
        },
        {
            "Title": "MBL Infrastructure Gets Approval for Resolution Plan of Subsidiary MBL (MP) Toll Road Company",
            "Summary": "The Adjudicating Authority approved MBL Infrastructure Ltd's resolution plan for its wholly owned subsidiary MBL (MP) Toll Road Company Ltd (MPTRCL) on September 12, 2025. Under the plan, MBL will infuse Rs 9.11 crores as equity in MPTRCL, which includes Rs 2 crores already deposited as EMD and Performance Security. This amount, along with cash balances and liquid assets as of June 30, 2025, will be paid to Punjab National Bank (International) Ltd as full settlement within 30 days. Following the payment, all liabilities of MPTRCL will be extinguished, making it a debt-free company. MPTRCL operates the Waraseoni-Lalbarra Road project in Madhya Pradesh under a BOT concession agreement from 2011 and receives semi-annual payments of Rs 3.26 crores plus toll revenues. Management control of MPTRCL now returns to its Board of Directors.",
            "Sentiment": "positive",
            "PublishDate": 1758018423810,
            "Source": "corporate_action"
        },
        {
            "Title": "MBL Infrastructure's Resolution Plan for Subsidiary MPTRCL Approved Under Insolvency Code",
            "Summary": "The Adjudicating Authority approved MBL Infrastructure Ltd's resolution plan for its wholly owned subsidiary MBL(MP) Toll Road Company Ltd (MPTRCL) under the Insolvency and Bankruptcy Code, 2016. Under the plan, MBL will infuse Rs 9.11 crores as equity in MPTRCL, which includes Rs 2 crores already deposited as EMD and Performance Security. This amount, along with cash balances and liquid assets, will be paid to Punjab National Bank (International) Ltd as full and final settlement within 30 days. Following the payment, all liabilities of MPTRCL will be extinguished, making it a debt-free company. The Board of Directors' powers for MPTRCL have been restored, and management control will vest with the Board. Future surplus from toll fees and receivables will be available to MBL.",
            "Sentiment": "positive",
            "PublishDate": 1757686355778,
            "Source": "corporate_action"
        },
        {
            "Title": "MBL Infrastructure Secures Rs 11.06 Crore Order, Targets Rs 1000 Crore New Orders for FY2025-26",
            "Summary": "MBL Infrastructure Ltd has been awarded a Rs 11.06 crore Change of Scope order for construction work on the Bikaner-Suratgarh Section of NH-62 in Rajasthan. The work involves construction of junction, reconstruction/strengthening of service road and construction of two culverts. The project is executed by Suratgarh Bikaner Toll Road Company Pvt Ltd, a wholly owned subsidiary of MBL, which is already collecting toll on 170.266 kms of National Highway. Another Change of Scope work worth Rs 20.22 crores for construction of a new bridge across IGNP main canal is under progress. All bank accounts of the company have been classified as 'Standard' by working capital consortium banks and transferred to Corporate Client Group Vertical. With availability of non-fund based working capital facilities of Rs 303.63 crores, the company has started bidding for new projects. MBL has already bid for projects worth Rs 889.54 crores and targets procurement of new orders worth Rs 1000 crores during financial year 2025-26.",
            "Sentiment": "positive",
            "PublishDate": 1757410556776,
            "Source": "order&deals"
        },
        {
            "Title": "MBL Infrastructure Submits Corporate Presentation Following Resolution Plan Implementation",
            "Summary": "MBL Infrastructure Limited submitted a corporate presentation to stock exchanges detailing its business operations and financial performance. The infrastructure company operates across roads & highways, building construction, and railways/metro segments with a pan-India presence. Revenue declined from ₹300.95 crore in FY23 to ₹248.35 crore in FY25, while PAT margin improved significantly to 68.25% in FY25 due to exceptional item income. The company implemented a Resolution Plan under IBC on September 04, 2024, featuring a 10-year duration with ₹303.63 crore non-fund based facilities and NCDs worth ₹836.74 crore issued to banks. Promoter holding increased to 74.01% with ₹128.19 crore equity infusion planned over three years. Current ongoing projects include the Bikaner-Suratgarh highway section worth ₹648.35 crore and maintenance contracts. The company highlighted government infrastructure initiatives including ₹2.87 lakh crore allocation to MoRTH and Vision 2047 plan to add 200,000 km of national highways as growth opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1757336485396,
            "Source": "stock"
        },
        {
            "Title": "MBL Infrastructure Reconstitutes Stakeholders' Relationship Committee with New Leadership",
            "Summary": "MBL Infrastructure Ltd has reconstituted its Stakeholders' Relationship Committee, appointing Mr. Ram Dayal Modi as Chairman, and Mr. Mukesh Kumar Jain and Ms. Megha Singh as members, all of whom are Independent Directors. The Board of Directors approved this reconstitution on August 18, 2025. The company has informed BSE Limited and National Stock Exchange of India Limited about this governance change in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1755515060594,
            "Source": "corporate_governance"
        },
        {
            "Title": "MBL Infrastructure Reports Quarterly Results, Issues New Shares and Schedules AGM",
            "Summary": "MBL Infrastructure's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs. 1,857 lakhs and profit of Rs. 296 lakhs for the quarter. The company issued 3 crore equity shares of Rs. 10 each to promoter group entities, increasing paid-up capital from Rs. 12,253 lakhs to Rs. 15,253 lakhs. The Board scheduled the 30th Annual General Meeting for September 20, 2025 via video conferencing. Additionally, the Board noted approval of a resolution plan for subsidiary MBL (MP) Toll Road Company Limited under IBC 2016, pending adjudicating authority approval. Working capital consortium banks have standardized the company's account and migrated it to Commercial Clients Group vertical. The Board also reconstituted the Nomination & Remuneration Committee with three independent directors.",
            "Sentiment": "neutral",
            "PublishDate": 1755161181347,
            "Source": "earnings"
        },
        {
            "Title": "MBL Infra Reports Q1 Net Loss of 125M Rupees Against Previous Year's Profit of 2.2B Rupees",
            "Summary": "MBL Infra reported a consolidated net loss of 125 million rupees in Q1, compared to a profit of 2.2 billion rupees in the same quarter last year. The company's Q1 revenue declined to 277 million rupees from 337 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1755160127907,
            "Source": "earnings"
        },
        {
            "Title": "MBL Infrastructure Receives Court Order for Rs 77.85 Crore Arbitration Award Payment",
            "Summary": "The Commercial Court in Dehradun has directed the Public Works Department of Uttarakhand to deposit the entire arbitration award amount of Rs 77.85 crores to MBL Infrastructure Ltd. The award relates to a road project for improvement and strengthening of 15 roads in Almora District. The original arbitration award was dated January 31, 2022, with corrections made on February 14, 2022. Interest continues to accrue at 8.90% per annum until payment is made. MBL Infrastructure, established in 1995 and listed since 2010, specializes in civil engineering infrastructure projects.",
            "Sentiment": "positive",
            "PublishDate": 1754663885026,
            "Source": "stock"
        },
        {
            "Title": "MBL Infrastructure Approves Equity Share Issuance Worth 169.5 Million Rupees",
            "Summary": "The Board of Directors of MBL Infrastructure has approved the issuance of equity shares valued at 169.5 million rupees. This decision represents a significant corporate action that may impact the company's capital structure and shareholder value.",
            "Sentiment": "neutral",
            "PublishDate": 1734310768000,
            "Source": "corporate_action"
        },
        {
            "Title": "MBL Infrastructure Approves Equity Share Issuance Worth 169.5 Million Rupees",
            "Summary": "The board of MBL Infrastructure has approved the issuance of equity shares valued at 169.5 million rupees. This decision represents a significant corporate action that may impact the company's capital structure and potentially its stock value.",
            "Sentiment": "neutral",
            "PublishDate": 1734095031000,
            "Source": "corporate_action"
        }
    ]
}