{
    "Symbol": "MCLEODRUSS",
    "ISIN": "INE942G01012",
    "News": [
        {
            "Title": "McLeod Russel Gets Relief as Creditor Withdraws Case",
            "Summary": "PDK Impex Pvt Ltd withdraws ₹10.22 crore insolvency application against McLeod Russel India Limited. NCLT Kolkata dismisses the case, providing significant relief to the tea company.",
            "Sentiment": "positive",
            "PublishDate": 1768320363593,
            "Source": "stocks"
        },
        {
            "Title": "Mcleod Russel India Reports Sharp Decline in Q2 Financial Performance",
            "Summary": "Mcleod Russel India's Q2 consolidated net profit dropped significantly to 290.6 million rupees from 845.4 million rupees year-over-year, while revenue fell to 3.63 billion rupees from 4.52 billion rupees. The company's EBITDA declined to 985 million rupees from 1.58 billion rupees, with EBITDA margin contracting to 27.14% from 34.88% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1763337140981,
            "Source": "earnings"
        },
        {
            "Title": "McLeod Russel India Reports Net Loss of Rs 2,908 Lakhs for Q2 FY26 Amid Ongoing Financial Distress",
            "Summary": "McLeod Russel India Limited posted a net loss of Rs 2,908 lakhs for the quarter ended September 30, 2025, with revenue from operations at Rs 35,288 lakhs, while facing severe financial stress and ongoing debt resolution processes. The company's auditors issued an adverse opinion citing material uncertainties about going concern assumptions, unrecoverable inter-corporate deposits of Rs 2,86,050 lakhs, and pending resolution plans with NARCL and other lenders.",
            "Sentiment": "negative",
            "PublishDate": 1763136488868,
            "Source": "earnings"
        },
        {
            "Title": "Carbon Resources Acquires 5.03% Stake in McLeod Russel India",
            "Summary": "Carbon Resources Private Limited acquired 52,50,000 equity shares of McLeod Russel (India) Limited through open market transactions on September 16, 2022. The acquisition represents 5.03% of McLeod Russel's total share capital of 10,44,55,735 equity shares. Carbon Resources is not part of McLeod Russel's promoter group. Prior to this transaction, Carbon Resources held no shares in the tea company. McLeod Russel's shares are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1761796137928,
            "Source": "corporate_action"
        },
        {
            "Title": "McLeod Russel India Limited Announces Leadership Changes at 27th Annual General Meeting",
            "Summary": "McLeod Russel India Limited shareholders approved multiple appointments at their 27th Annual General Meeting held on September 26, 2025. The company re-appointed Mr. Amritanshu Khaitan as Director liable to retire by rotation, who brings experience in management, production, marketing and corporate finance from a family with interests in Tea, Batteries and Engineering. Mr. Khaitan is the nephew of Managing Director Mr. Aditya Khaitan. The meeting also approved the appointment of M/s A.K. Labh & Co as Secretarial Auditors for five consecutive years until the 32nd AGM in 2030. Additionally, Ms. Rupanjana De was re-appointed as Non-Executive Independent Director for a second three-year term from December 30, 2025 to December 29, 2028. Ms. De is a Fellow Member of the Institute of Company Secretaries of India with expertise in Corporate Governance, Legal Compliance and Corporate Social Responsibility.",
            "Sentiment": "neutral",
            "PublishDate": 1758971222857,
            "Source": "corporate_governance"
        },
        {
            "Title": "McLeod Russel India Board Approves Q1 2025 Results, Director Re-appointment, and Calcutta Stock Exchange Delisting",
            "Summary": "McLeod Russel India Limited's Board approved unaudited financial results for Q1 2025 ended June 30, 2025. The company reported standalone revenue of Rs. 16,803 lakhs and a loss of Rs. 4,013 lakhs for the quarter. The Board recommended re-appointment of Ms. Rupanjana De as Independent Director for a second three-year term and appointed M/s A. K. Labh & Co. as Secretarial Auditors for five consecutive years. The company also approved voluntary delisting from Calcutta Stock Exchange while continuing listings on BSE and NSE. The auditors issued an adverse opinion citing concerns over Inter-Corporate Deposits of Rs. 2,86,050 lakhs given to promoter groups that are doubtful of recovery, and ongoing financial distress with current liabilities exceeding current assets.",
            "Sentiment": "negative",
            "PublishDate": 1755180833775,
            "Source": "earnings"
        },
        {
            "Title": "McLeod Russel India Schedules Board Meeting to Approve Q1 Results and Consider Delisting from Calcutta Stock Exchange",
            "Summary": "McLeod Russel India Limited has scheduled a Board of Directors meeting on August 14, 2025, at its registered office in Kolkata. The meeting will consider and approve unaudited financial results for the quarter ended June 30, 2025, covering both standalone and consolidated figures. The board will also consider voluntary delisting of the company's equity shares from the Calcutta Stock Exchange Limited. The trading window for insiders has been closed since July 1, 2025, and will remain closed until 48 hours after the publication of the financial results. The company is listed on BSE, NSE, and Calcutta Stock Exchange.",
            "Sentiment": "neutral",
            "PublishDate": 1754647840471,
            "Source": "corporate_action"
        },
        {
            "Title": "McLeod Russel India Denies Phoenix Acquisition Rumors",
            "Summary": "McLeod Russel India has officially denied rumors regarding a potential acquisition by Phoenix. The company confirmed that there is no truth to the speculation about the acquisition deal.",
            "Sentiment": "neutral",
            "PublishDate": 1753195442263,
            "Source": "stock"
        },
        {
            "Title": "McLeod Russel India Limited: Lenders Transfer ₹1,104 Crore Debt to NARCL at 36% Discount",
            "Summary": "A consortium of lenders has transferred McLeod Russel India Limited's debt of ₹1,104.69 crore to National Asset Reconstruction Company Limited (NARCL) for ₹700 crore, representing a 36% haircut. The deal involves a 15:85 cash-to-security receipts structure with a five-year repayment tenure. This move is expected to help the company negotiate with fewer debtors and potentially turn around its financial situation.",
            "Sentiment": "neutral",
            "PublishDate": 1742134199000,
            "Source": "corporate_action"
        },
        {
            "Title": "McLeod Russel India: Share Price Hits 52-Week High Following Bulk Deal",
            "Summary": "McLeod Russel's share price reached a 52-week high, rising nearly 5% after Altius Finserv Private purchased 12 lakh shares at ₹39.87 each. The stock opened at ₹40.02, touched an intraday high of ₹41.85, but later slipped on profit booking.",
            "Sentiment": "positive",
            "PublishDate": 1733203454000,
            "Source": "block_deals"
        },
        {
            "Title": "McLeod Russel India: Ransomware Attack Reported, Operations Unaffected",
            "Summary": "McLeod Russel India experienced a ransomware attack on its IT infrastructure. The company has taken precautions to minimize impact and is working to restore affected systems. No material impact on operations has been reported.",
            "Sentiment": "neutral",
            "PublishDate": 1733047886000,
            "Source": "corporate_governance"
        }
    ]
}