{
    "Symbol": "MCLOUD",
    "ISIN": "INE613C01026",
    "News": [
        {
            "Title": "Magellanic Cloud Subsidiary Wins ₹4.10 Cr Railway Order",
            "Summary": "Provigil Surveillance Limited, wholly owned subsidiary of Magellanic Cloud Limited, secured a ₹4.10 crore purchase order from South Central Railway for IP-based video surveillance systems for diesel locomotives.",
            "Sentiment": "positive",
            "PublishDate": 1770723957217,
            "Source": "co_actions_results"
        },
        {
            "Title": "Magellanic Cloud Holds EGM for Merger & Leadership",
            "Summary": "Magellanic Cloud Limited conducted an Extra-Ordinary General Meeting on February 03, 2026, addressing five special resolutions including merger with IVIS International and key appointments.",
            "Sentiment": "neutral",
            "PublishDate": 1770108304704,
            "Source": "stocks"
        },
        {
            "Title": "Magellanic Cloud Wins ₹5.36 Crore Railway Contract",
            "Summary": "Magellanic Cloud's subsidiary Provigil Surveillance Limited secures Letter of Acceptance from Central Railway for AI-based CCTV surveillance systems at Level Crossing gates worth ₹5.36 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769686911231,
            "Source": "co_actions_results"
        },
        {
            "Title": "Magellan Cloud Wins ₹3.61 Cr Railway CCTV Contract",
            "Summary": "Magellan Cloud's subsidiary Provigil Surveillance Limited secures Letter of Acceptance from Central Railway for comprehensive CCTV surveillance system deployment at level crossing gates in Nagpur Division.",
            "Sentiment": "positive",
            "PublishDate": 1769063607877,
            "Source": "co_actions_results"
        },
        {
            "Title": "Magellan Cloud appoints Prathik Bhat as Interim CFO",
            "Summary": "Magellan Cloud Limited announces the appointment of Mr. Prathik Harishbhai Bhat as Interim Chief Financial Officer effective February 13, 2026, following board approval on January 13, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768313364056,
            "Source": "stocks"
        },
        {
            "Title": "Magellanic Cloud Subsidiary Wins ₹3.74 Cr Railway Contract",
            "Summary": "Magellanic Cloud's subsidiary Provigil Surveillance Limited secures ₹3.74 crore contract from Western Railway Jaipur Division for advanced CCTV surveillance system with face recognition and video analytics.",
            "Sentiment": "positive",
            "PublishDate": 1767173809643,
            "Source": "co_actions_results"
        },
        {
            "Title": "Magellanic Cloud subsidiary wins ₹2.25 cr IRCTC contract",
            "Summary": "Provigil Surveillance Limited, wholly owned subsidiary of Magellanic Cloud Limited, secures Letter of Acceptance from IRCTC for AI-enabled CCTV surveillance solution at authorized kitchen units.",
            "Sentiment": "positive",
            "PublishDate": 1766763127366,
            "Source": "co_actions_results"
        },
        {
            "Title": "Magellanic Cloud CEO Addresses 64% Stock Decline Despite Strong Fundamentals",
            "Summary": "Magellanic Cloud Limited's Managing Director Joseph Sudheer Reddy Thumma issued a shareholder communication addressing a nearly 64% stock decline over the past fortnight, attributing it to sentiment-driven correction despite strong business performance. The company reported 6.6% revenue growth to ₹597 crores, 4.2% EBITDA growth, secured a ₹140 crore order pipeline from Indian Railways and NHAI, and achieved consistent quarterly orders in its drone division.",
            "Sentiment": "neutral",
            "PublishDate": 1765207290234,
            "Source": "stock"
        },
        {
            "Title": "Magellan Cloud Promoter Joseph Sudheer Reddy Thumma Reduces Stake Through Open Market Sale",
            "Summary": "Joseph Sudheer Reddy Thumma, Managing Director and Promoter of Magellan Cloud Limited, sold 1,19,50,000 equity shares (2.03% stake) through open market transactions on November 26, 2025. His shareholding decreased from 57.84% to 55.81%, reducing his total holding from 34,07,13,600 shares to 32,87,63,600 shares in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1764574190139,
            "Source": "corporate_action"
        },
        {
            "Title": "Magellanic Cloud Subsidiary Secures ₹3 Crore Drone Delivery Contract with Potential ₹9 Crore Phase-II",
            "Summary": "Magellanic Cloud's subsidiary Scandron Private Limited received a ₹3 crore work order from Resonia Limited for drone cargo delivery services. The deal includes a potential Phase-II worth ₹9 crores contingent upon successful completion of the initial phase.",
            "Sentiment": "positive",
            "PublishDate": 1764234600302,
            "Source": "order&deals"
        },
        {
            "Title": "Magellan's Subsidiary Provigil Surveillance Wins Rs 6 Crore Railway Contract",
            "Summary": "Provigil Surveillance Limited, wholly owned subsidiary of Magellan Cloud Limited, received a Letter of Acceptance from East Coast Railway for supply, installation and commissioning of crew voice video recording system for electric locomotives worth Rs 6 crores. The project will be executed within thirty-six months and aims to enhance operational safety, improve investigation efficiency, and boost crew performance accountability across the railway network.",
            "Sentiment": "positive",
            "PublishDate": 1763982410623,
            "Source": "order&deals"
        },
        {
            "Title": "Magellanic Cloud Promoters Pledge Additional Shares to Multiple Financial Institutions",
            "Summary": "Promoters Joseph Sudheer Reddy Thumma and Jagan Mohan Reddy Thumma have pledged portions of their shareholdings in Magellanic Cloud Limited to various financial institutions including Anand Stock Limited, Virtue Financial, and others between October 20-29, 2025. The pledging activities resulted in changes to their encumbered shareholding percentages, with Joseph Sudheer Reddy Thumma's post-event encumbered shares reaching 28.30% and Jagan Mohan Reddy Thumma's reaching 2.66% of total share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1763448728603,
            "Source": "corporate_action"
        },
        {
            "Title": "Magellanic Cloud Limited Board Approves Rs. 500 Crore Capital Raising Plan",
            "Summary": "Magellanic Cloud Limited's Board of Directors approved raising additional capital of Rs. 500 crores through various instruments including equity shares, convertible securities, warrants or debt securities via preferential issue, private placements, rights issue or other permitted methods. The capital raising plan is subject to regulatory approvals and shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1763378201981,
            "Source": "corporate_action"
        },
        {
            "Title": "Magellanic Cloud to Explore Fundraising Options on November 17",
            "Summary": "Magellanic Cloud announced it will explore fundraising options through equity or securities on November 17. The company is considering various funding mechanisms to raise capital.",
            "Sentiment": "neutral",
            "PublishDate": 1762958787025,
            "Source": "stock"
        },
        {
            "Title": "Magellanic Cloud Limited Allots 46.72 Lakh Equity Shares for Acquisition of Finoux Solutions",
            "Summary": "Magellanic Cloud Limited's Board approved the allotment of 46,72,000 equity shares at Rs. 75 per share (face value Rs. 2) through preferential allotment, raising Rs. 35.04 crores. The shares were issued to four promoters of Finoux Solutions Private Limited in exchange for acquiring 100% stake in FSPL through equity swap. The allottees include Sanjay Sarkar (15,88,480 shares), Runa Shah (10,74,560 shares), and two others. Following this allotment, the company's paid-up equity capital increased from Rs. 116.88 crores to Rs. 117.81 crores, with total equity shares rising to 58,90,67,120. The transaction received in-principle approval from both BSE and NSE.",
            "Sentiment": "positive",
            "PublishDate": 1762848225504,
            "Source": "corporate_action"
        },
        {
            "Title": "Magellan Cloud Reports 5.42% Revenue Growth and 13.10% PAT Increase in Q2 FY26",
            "Summary": "Magellan Cloud Limited announced its Q2 FY26 financial results showing revenue from operations of ₹164.44 crore, up 4.54% year-on-year, and total income of ₹165.83 crore, representing a 5.42% increase. Profit After Tax reached ₹27.62 crore, growing 13.10% year-on-year. The company achieved a Total Contract Value exceeding ₹118 crore during the quarter. Key wins included an ₹85 crore railway surveillance project for 484 stations, a ₹32 crore highways project for AI-powered audit camera systems across toll plazas in eight states, and a ₹45 lakh order from Andhra Pradesh for educational institution security systems. The e-surveillance vertical recorded ₹118 crore in new orders during Q2. Both Magellan Cloud and subsidiary Provigil Surveillance Limited received CMMI Maturity Level 3 appraisals. The company expects stronger growth trajectory in Q3 and Q4, supported by existing order book execution and new opportunities in defense, fintech, and smart infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1762437013841,
            "Source": "earnings"
        },
        {
            "Title": "Magellanic Cloud Promoter Joseph Sudheer Reddy Thumma Creates Share Pledges Worth 7.72%",
            "Summary": "Joseph Sudheer Reddy Thumma, a promoter of Magellanic Cloud Limited, has created pledges on company shares as collateral for loans. The pledges were created between October 28-29, 2025, with various entities including Anand Rathi Share and Stock Brokers Limited, Jogani Exports Limited, Aryan Mining and Trading Corporation Pvt Limited, Badjate Stock Broking Pvt Ltd, Virtue Financial Services Pvt Ltd, and Minsol Fund. The total pledged shares amount to 45,133,182 shares representing 7.72% of the company's share capital. Thumma holds 23,15,41,120 shares representing 39.62% of the target company. Other promoters including Sagan Mohan Thumma and Dennis Reddy Thumma also have existing encumbrances on their holdings.",
            "Sentiment": "neutral",
            "PublishDate": 1762408085476,
            "Source": "corporate_action"
        },
        {
            "Title": "Magellanic Cloud Reports Mixed Quarterly Results, Reconstitutes Board Committees",
            "Summary": "Magellanic Cloud Limited approved unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. The company reconstituted four key committees - Audit, Nomination and Remuneration, Stakeholder Relationship, and Risk Management - with Mr. Mayank Mahendra Shukla as chairperson and Mrs. Amita Sachin Karia and Mrs. Priyanka Dharmesh Pandey as members across all committees, effective November 5, 2025. The Chief Financial Officer resigned effective October 15, 2025. Standalone revenue from operations was Rs. 2,597.46 lakhs for the quarter, while consolidated revenue reached Rs. 16,839.90 lakhs. The company operates in IT and IT-related services and got NSE listing approval in February 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762364595180,
            "Source": "earnings"
        },
        {
            "Title": "Magellan Cloud's Subsidiary Secures Rs 2.45 Crore Railway Surveillance Contract",
            "Summary": "Magellan Cloud Limited announced that its wholly owned subsidiary, Provigil Surveillance Limited, received a Letter of Acceptance from Western Railway's Rajkot Division for providing CCTV surveillance systems across various sites. The contract is valued at Rs 2.45 crores and is to be executed within six months. The project aims to enhance security, ensure safety of assets and personnel, and improve operational monitoring as part of Indian Railways' modernization initiatives. The company stated that no promoter or group companies have any interest in the entity that awarded the contract, and it does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1762206687076,
            "Source": "order&deals"
        },
        {
            "Title": "Magellanic Cloud's Subsidiary Secures ₹2.40 Crore Railway Surveillance Contract",
            "Summary": "Provigil Surveillance Limited, a wholly owned subsidiary of Magellanic Cloud Limited, received a Letter of Acceptance from South Central Railway's Guntur Division for a video surveillance project worth ₹2.40 crores. The contract involves replacing video surveillance systems at various railway stations and providing video recording facilities at relay rooms and station master rooms across the division. The project is scheduled for completion within twelve months and aims to enhance passenger safety, station monitoring, and asset protection through AI-driven video analytics and centralized control capabilities. Global CEO Joseph Sudheer Reddy Thumma stated that these consecutive contracts validate the company's capability in deploying advanced AI-integrated monitoring solutions. The contract does not involve any promoter group interest and is not classified as a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1761656042906,
            "Source": "order&deals"
        },
        {
            "Title": "Magellanic Cloud's Subsidiary Wins ₹3.2 Crore Railway Surveillance Contract",
            "Summary": "Provigil Surveillance Limited, a wholly owned subsidiary of Magellanic Cloud Limited, received a Letter of Acceptance from Southern Railway's Madurai Division for installing CCTV cameras at Non-Interlocked Level Crossing Gates. The contract is valued at ₹3.20 crores and must be executed within six months. The project aims to enhance passenger security through AI-enabled surveillance infrastructure. This adds to Provigil's existing contracts worth approximately ₹100 crores from Railways and ₹32 crores from National Highways Authority of India for AI-based video surveillance systems. The combined project wins total around ₹126 crores. Joseph Sudheer Reddy Thumma, Global CEO & Managing Director, stated these consecutive wins reflect the company's growing momentum and execution capabilities in AI-driven surveillance solutions. The contract does not involve any promoter group interest or related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1761561743110,
            "Source": "order&deals"
        },
        {
            "Title": "Magellanic Cloud Promoters Pledge 39.62% Stake as Collateral for Loans",
            "Summary": "Joseph Sudheer Reddy Thumma and Jagan Mohan Reddy Thumma, promoters of Magellanic Cloud Limited, have pledged shares representing 39.62% of the company's equity as collateral for loans. The pledge creation occurred between October 20-24, 2025, involving 23,15,41,120 shares held by Joseph Sudheer Reddy Thumma. Additional smaller pledges were created with various financial institutions and trading companies, including amounts ranging from 2,50,000 to 4,70,00,000 shares. The pledges were made to secure loans from multiple lenders including trading corporations, finance companies, and stock broking firms. Magellanic Cloud Limited is listed on both BSE Limited and National Stock Exchange Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1761540985804,
            "Source": "corporate_action"
        },
        {
            "Title": "Magellanic Cloud CFO Sanjay Mahendra Chauhan Resigns Due to Health Reasons",
            "Summary": "Sanjay Mahendra Chauhan has resigned from his position as Chief Financial Officer and Key Managerial Personnel of Magellanic Cloud Limited effective October 15, 2025. The resignation is attributed to adverse health conditions. Chauhan served the company for nearly 11 years and confirmed there are no other material reasons for his departure beyond health issues. The company has notified stock exchanges BSE and NSE about this key managerial personnel change.",
            "Sentiment": "neutral",
            "PublishDate": 1760523696123,
            "Source": "corporate_governance"
        },
        {
            "Title": "Magellanic Cloud Limited Appoints Three Independent Directors and Reappoints Auditors at 44th AGM",
            "Summary": "Magellanic Cloud Limited announced multiple appointments approved at its 44th Annual General Meeting held on September 23, 2025. The company appointed three new Independent Directors for five-year terms: Ms. Amita Sachin Karia, a Fellow Member of ICSI with over 13 years of experience in Corporate and Securities Laws; Mr. Mayank Mahendra Shukla, an Event Organizer with seven years of experience; and Ms. Priyanka Dharmesh Pandey, an Associate Member of ICSI with over 5 years of corporate compliance experience. Additionally, the company reappointed M/s. S G C O & Co LLP as Statutory Auditors for five consecutive years from the 44th to 49th Annual General Meeting, and appointed M/s. Deep Shukla & Associates as Secretarial Auditor for the same period. Deep Shukla & Associates is a Mumbai-based corporate practice firm providing secretarial consultancy services since 2003.",
            "Sentiment": "positive",
            "PublishDate": 1758704098569,
            "Source": "corporate_governance"
        },
        {
            "Title": "Magellanic Cloud's Subsidiary Secures Railway Surveillance Contracts Worth Rs 119.25 Crores",
            "Summary": "Provigil Surveillance Limited, a wholly owned subsidiary of Magellanic Cloud Limited, has secured multiple railway surveillance contracts totaling approximately Rs 119.25 crores. The company received a Letter of Acceptance from Rail Vikas Nigam Limited for Rs 85 crores to provide Video Surveillance Systems across 441 railway stations and augmentation at 43 major stations of Southern Railway. Additionally, it secured a Rs 2.27 crore contract from South Central Railway for replacing video surveillance systems at Secunderabad Railway stations. The projects involve AI-enabled surveillance infrastructure including IP-based CCTV deployment, networking infrastructure, and advanced AI integration with face recognition software. Joseph Sudheer Reddy Thumma, Global CEO & MD of Magellanic Cloud Limited, stated these wins demonstrate the company's capabilities in delivering large-scale AI-powered surveillance solutions and position them for expansion into airports, metros, and smart city projects.",
            "Sentiment": "positive",
            "PublishDate": 1755596894786,
            "Source": "order&deals"
        },
        {
            "Title": "Magellanic Cloud Limited Announces 43rd AGM with ₹0.15 Dividend and Major Business Developments",
            "Summary": "Magellanic Cloud Limited has announced its 43rd Annual General Meeting scheduled for July 15, 2024, with a proposed dividend of ₹0.15 per share subject to shareholder approval. The record date for dividend eligibility is July 27, 2024. The company reported strong financial performance for FY 2023-24 with consolidated revenue of ₹56,042.86 lakhs (vs ₹42,746.88 lakhs in previous year) and profit after tax of ₹10,295.45 lakhs (vs ₹7,410.30 lakhs). Key business developments include securing a ₹42 crore e-surveillance contract for 2000 ATM sites across India through subsidiary IVIS, a ₹43 crore logistics drone order through subsidiary Scandron, and disposal of subsidiary Serial Enterprise Foods Private Limited for ₹1.21 crores. The company's subsidiary also received type certification from DGCA for cargo and logistics drones. The AGM will address several resolutions including director reappointments, share capital increase, stock split proposals, and a merger scheme with IVIS International Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1755012307331,
            "Source": "corporate_action"
        },
        {
            "Title": "Magellanic Cloud Reports Higher Q1 Profit and Revenue Despite Margin Decline",
            "Summary": "Magellanic Cloud reported Q1 consolidated net profit of 278 million rupees, up from 265 million rupees year-over-year. Revenue increased to 1.64 billion rupees from 1.32 billion rupees in the same period last year. EBITDA rose to 568 million rupees from 529 million rupees year-over-year. However, EBITDA margin declined to 34.65% from 40.05% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753101910739,
            "Source": "earnings"
        },
        {
            "Title": "Magellanic Cloud's Unit Delivers First Drone Consignment",
            "Summary": "Magellanic Cloud has announced that its subsidiary has successfully delivered the first consignment of drones to a customer. The drones have been tested and accepted by the customer.",
            "Sentiment": "positive",
            "PublishDate": 1748875272000,
            "Source": "default"
        },
        {
            "Title": "Magellanic Cloud Ltd: Stock Dips Despite Positive FY24-25 Results",
            "Summary": "Magellanic Cloud Ltd reported a 6.57% YoY revenue increase to ₹597.23 crore for FY24-25. EBITA grew 4.22% to ₹209.67 crore with a 35.11% margin. PAT reached ₹102.73 crore. Subsidiary Motivity Labs secured a $6M contract. The company expanded its Scanalitix platform globally and debuted on NSE. Despite positive results, stock closed down 1.30% at $75.41.",
            "Sentiment": "neutral",
            "PublishDate": 1747394545000,
            "Source": "earnings"
        },
        {
            "Title": "Magellanic Cloud to Acquire Finoux Solutions",
            "Summary": "Magellanic Cloud has approved a share purchase agreement to acquire 100% equity in Finoux Solutions. The acquisition cost is approximately 438 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1747047643000,
            "Source": "default"
        },
        {
            "Title": "Magellanic Cloud Reports Q4 Financial Results",
            "Summary": "Magellanic Cloud announced its Q4 consolidated net profit of 223 million rupees, down from 389 million rupees year-over-year and 293 million rupees quarter-over-quarter. However, Q4 revenue increased to 1.56 billion rupees from 1.37 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1746490155000,
            "Source": "default"
        },
        {
            "Title": "Magellanic Cloud Reports Q4 Financial Results",
            "Summary": "Magellanic Cloud announced its Q4 financial results. The company's EBITDA decreased to 452 million rupees from 539 million rupees year-over-year, with EBITDA margin dropping to 28.90% from 39.26%. Consolidated net profit fell to 223 million rupees from 389 million rupees year-over-year and 293 million rupees quarter-over-quarter. However, revenue increased to 1.56 billion rupees from 1.37 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1746458023000,
            "Source": "result"
        },
        {
            "Title": "Magellanic Cloud Cancels Previous Merger Scheme with Ivis International, Considers Fresh Merger Plan",
            "Summary": "Magellanic Cloud has announced that its previous merger scheme with Ivis International has been cancelled. The company is now considering a fresh merger scheme with Ivis International.",
            "Sentiment": "neutral",
            "PublishDate": 1742775362000,
            "Source": "corporate_action"
        },
        {
            "Title": "Magellanic Cloud Cancels Previous Merger Scheme with IVIS International, Considers Fresh Merger",
            "Summary": "Magellanic Cloud has announced the cancellation of its previous merger scheme with IVIS International. The company states that a fresh merger scheme with IVIS International will be considered.",
            "Sentiment": "neutral",
            "PublishDate": 1742561947000,
            "Source": "corporate_action"
        },
        {
            "Title": "Magellanic Cloud Limited: Q3 Profit Surges 19.6%, Revenue Up 15.3% YoY",
            "Summary": "Magellanic Cloud Limited reported Q3 FY25 profit after tax of ₹29.2 crore, up 19.6% QoQ. Revenue reached ₹151.4 crore, growing 15.3% YoY. EBITDA increased to ₹55.6 crore with a 36.7% margin. The company launched Scanalitix internationally, achieved AWS Select Partner status, and secured a major Generative AI contract.",
            "Sentiment": "positive",
            "PublishDate": 1740021091000,
            "Source": "earnings"
        },
        {
            "Title": "Magellanic Cloud: AI-Driven Strategy Targets Rs 600-Crore Revenue",
            "Summary": "Magellanic Cloud aims to exceed Rs 600 crore in revenue within two years, leveraging AI opportunities. The company plans to increase its workforce to 5,000 and is investing in acquisitions in e-surveillance, IT, and drone technology. A new AI and deep-tech center in Telangana is planned to develop video analytics and security solutions.",
            "Sentiment": "positive",
            "PublishDate": 1739811944000,
            "Source": "normal_news"
        },
        {
            "Title": "Magellanic Cloud Reports Q3 EBITDA Growth with Slight Margin Decline",
            "Summary": "Magellanic Cloud announced its Q3 financial results, reporting an EBITDA of 546 million rupees, up from 508 million rupees in the same quarter last year. However, the company's EBITDA margin decreased to 36.09% from 38.67% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739544558000,
            "Source": "earnings"
        },
        {
            "Title": "Magellanic Cloud Reports Q3 FY24 Financial Results",
            "Summary": "Magellanic Cloud announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 292 million rupees from 226 million rupees in the same quarter last year. Revenue also saw a rise, reaching 1.5 billion rupees compared to 1.31 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739544554000,
            "Source": "earnings"
        },
        {
            "Title": "Motivity Labs: Secures $6 Million IT Services Contract with Tech Giant",
            "Summary": "Motivity Labs, a subsidiary of Magellanic Cloud Ltd, has won a $6 million contract with a major technology and data center conglomerate. The contract focuses on data engineering, advanced analytics, and Generative AI initiatives. Motivity Labs operates across India, the US, and Canada, serving over 100 clients including Fortune 1,000 companies.",
            "Sentiment": "positive",
            "PublishDate": 1739443349000,
            "Source": "order&deals"
        },
        {
            "Title": "Magellanic Cloud to List on NSE",
            "Summary": "Magellanic Cloud, a company, is scheduled to list on the National Stock Exchange (NSE) on February 7. This listing represents a significant corporate action for the company, potentially increasing its visibility and trading accessibility for investors.",
            "Sentiment": "neutral",
            "PublishDate": 1738801130000,
            "Source": "corporate_action"
        },
        {
            "Title": "Magellanic Cloud Reports Q2 FY2024 Financial Results",
            "Summary": "Magellanic Cloud announced its Q2 financial results for the fiscal year 2024. The company reported a consolidated net profit of 244 million rupees, up from 221 million rupees in the same quarter last year. Revenue for the quarter stood at 1.57 billion rupees, slightly higher than the 1.54 billion rupees reported in Q2 of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1731549860000,
            "Source": "result"
        },
        {
            "Title": "Magellanic Cloud Reports Strong Q2 Financial Performance",
            "Summary": "Magellanic Cloud has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased from 405 million rupees to 517 million rupees. Additionally, the EBITDA margin expanded from 26.3% to 32.9%, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1731549832000,
            "Source": "result"
        }
    ]
}