{
    "Symbol": "MEDANTA",
    "ISIN": "INE474Q01031",
    "News": [
        {
            "Title": "Global Health Q3 Net Profit Drops to ₹950M",
            "Summary": "Global Health reports consolidated net profit of ₹950 million for Q3, marking a significant decline from ₹1.43 billion in the same quarter last year, representing a 33.6% year-on-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1770200209855,
            "Source": "co_actions_results"
        },
        {
            "Title": "Global Health Grants 4,000 ESOPs Under LTIP 2024",
            "Summary": "Global Health Limited's Nomination and Remuneration Committee approved grant of 4,000 employee stock options under GHL LTIP 2024 Plan with exercise price of Rs. 2 per option.",
            "Sentiment": "positive",
            "PublishDate": 1770112776205,
            "Source": "stocks"
        },
        {
            "Title": "Global Health Q3FY26 earnings call on Feb 5",
            "Summary": "Global Health Limited schedules earnings conference call for February 5, 2026 at 2:00 PM IST to discuss Q3FY26 results, hosted by JM Financial with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1769768598203,
            "Source": "co_actions_results"
        },
        {
            "Title": "Global Health Gets ESG Rating of 68 for FY25",
            "Summary": "Global Health Limited receives ESG rating of 68 from SES ESG Research Private Limited for Financial Year 2025, demonstrating the company's commitment to environmental, social and governance practices.",
            "Sentiment": "positive",
            "PublishDate": 1767789157896,
            "Source": "stocks"
        },
        {
            "Title": "Global Health Gets Credit Rating Upgrade from CRISIL",
            "Summary": "CRISIL upgrades Global Health's long-term rating to AA/Stable from AA-/Positive for ₹1,500 crore bank facilities. Short-term rating reaffirmed at A1+.",
            "Sentiment": "positive",
            "PublishDate": 1765887237131,
            "Source": "stocks"
        },
        {
            "Title": "Global Health Opens 550-Bed Super Specialty Hospital in Noida",
            "Summary": "Global Health has expanded its operations in the National Capital Region by launching a new 550-bed super specialty hospital in Noida. This expansion strengthens the company's healthcare infrastructure presence in the NCR market.",
            "Sentiment": "positive",
            "PublishDate": 1764244158992,
            "Source": "stock"
        },
        {
            "Title": "Medanta Reports 15% Revenue Growth in Q2FY26, Opens New 550-Bed Noida Hospital",
            "Summary": "Global Health Limited (Medanta) posted consolidated revenue of INR 11,189 million for Q2FY26, up 15% year-on-year, with PAT growing 21% to INR 1,584 million and margins improving to 14.2%. The company commenced operations at its sixth facility, a 550-bed Noida hospital in September 2025, which generated INR 39 million revenue but reported EBITDA loss of INR 197 million in its first month of operations.",
            "Sentiment": "positive",
            "PublishDate": 1763042688899,
            "Source": "earnings"
        },
        {
            "Title": "Medanta Opens 550-Bed Noida Hospital, Reports 14.8% Revenue Growth in Q2",
            "Summary": "Global Health Limited (Medanta) launched a new 550-bed super specialty hospital in Noida in September 2025, strengthening its presence in Delhi/NCR. The company reported consolidated total income of INR 11,189 million in Q2 FY26, up 14.8% year-on-year and 6.4% quarter-on-quarter. EBITDA excluding Noida grew 13.7% year-on-year to INR 2,804 million with margins of 25.2%. Net profit increased 21.1% year-on-year to INR 1,584 million. The Noida facility generated revenue of INR 39 million but recorded an EBITDA loss of INR 197 million during initial operations. The company added 37 new beds at Patna during the quarter and onboarded over 200 doctors across its network. International patient revenue increased 48.5% year-on-year to INR 762 million. The company also announced plans for a 750-bed hospital in Mumbai with an estimated project cost of INR 15,300 million and acquired 3.5 acres in Guwahati for INR 600 million for future expansion.",
            "Sentiment": "positive",
            "PublishDate": 1762539504752,
            "Source": "earnings"
        },
        {
            "Title": "Global Health Targets Double-Digit Revenue Growth with 1,000+ Bed Expansion by FY28",
            "Summary": "Global Health plans to achieve double-digit revenue growth through expansion of high-end specialties and regional hubs. The company will add over 1,000 beds by FY28 across Lucknow, Indore, and Patna. The expansion includes investments in advanced robotics, transplant, and oncology infrastructure. The company aims to strengthen margins through case-mix optimization, operational leverage, and an asset-light expansion model.",
            "Sentiment": "positive",
            "PublishDate": 1762527792885,
            "Source": "stock"
        },
        {
            "Title": "Global Health Reports Strong Q2 Results, Expands Mumbai Hospital Capacity to 750 Beds",
            "Summary": "Global Health Limited announced its quarterly results with revenue from operations reaching ₹9,264.28 million and profit after tax of ₹1,401.99 million. The company's Board approved increasing the bed capacity of its proposed Mumbai hospital from 500 to 750 beds following additional FSI approval from MHADA. The expansion includes acquisition of 30 residential flats for staff accommodation, raising the total Mumbai project cost to ₹1,530 crores from the earlier estimate of ₹1,200 crores. During the period, the company's Noida and Ranchi hospitals commenced operations, and it received in-principle approval for 3.5 acres of land in Assam. The Board also approved granting 605,500 stock options to eligible employees and allotted 183,000 shares under the employee welfare trust.",
            "Sentiment": "positive",
            "PublishDate": 1762521383599,
            "Source": "earnings"
        },
        {
            "Title": "Global Health Reports 20.6% Jump in Q2 Net Profit to 1.58 Billion Rupees",
            "Summary": "Global Health reported quarterly net profit of 1.58 billion rupees compared to 1.31 billion rupees in the same period last year. Revenue increased to 10.99 billion rupees from 9.56 billion rupees year-over-year. EBITDA rose marginally to 2.31 billion rupees from 2.28 billion rupees, while EBITDA margin declined to 21.01% from 23.87% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762519375810,
            "Source": "earnings"
        },
        {
            "Title": "Global Health Limited Schedules Q2 FY2026 Earnings Conference Call for November 10, 2025",
            "Summary": "Global Health Limited (Medanta) has scheduled an earnings conference call for Monday, November 10, 2025 at 2:00 PM IST to discuss its second quarter and half-year results ended September 30, 2025. The call will be hosted by IIFL Capital and will feature key management including Dr. Naresh Trehan (Chairman Managing Director), Mr. Pankaj Sahni (Group CEO & Director), Mr. Yogesh Kumar Gupta (Chief Financial Officer), and Mr. Ravi Gothwal (Head Investor Relations). The company operates as one of the largest private multi-specialty tertiary care providers in North and East India under the Medanta brand, with a network of six hospitals currently operational including facilities in Gurgaon, Indore, Ranchi, Lucknow, Patna, and Noida. The Noida hospital became operational on September 1, 2025. The company has 3,062 installed beds as of June 30, 2025, and provides healthcare services in over 30 medical specialties with over 2,000 doctors.",
            "Sentiment": "neutral",
            "PublishDate": 1761999354024,
            "Source": "earnings"
        },
        {
            "Title": "Medanta Begins Construction of 400-Bed Super-Specialty Hospital in Guwahati",
            "Summary": "Global Health Limited (Medanta) conducted a Bhoomi Poojan ceremony in Guwahati to mark the beginning of construction for its upcoming 400-bed super-specialty hospital facility. The event was attended by Assam Chief Minister Dr. Himanta Biswa Sarma and Dr. Naresh Trehan, Chairman & Managing Director of Medanta. The facility will be built at Industrial Estate, Sarusajai, Guwahati along National Highway 27 at an approximate cost of Rs 500 crores. The hospital will offer comprehensive tertiary and quaternary care services including transplant programs, cardiology, neurology, oncology, and various other specialties. The project is expected to generate 5,000-7,000 direct and indirect jobs across healthcare, administration, and support services. Medanta currently operates six hospitals with 3,362 installed beds and has four additional hospitals in various stages of planning or construction.",
            "Sentiment": "positive",
            "PublishDate": 1761928248798,
            "Source": "stock"
        },
        {
            "Title": "Global Health Limited Secures 3.5 Acres Land in Guwahati for Hospital Development",
            "Summary": "Global Health Limited has received land allotment from Assam Industrial Development Corporation Limited for a proposed hospital project in Guwahati, Assam. The company secured possession of 3.5 acres (14,164.50 Sqm) at Industrial Estate, Sarusajai on a 60-year lease basis with option for 30-year renewal. The land was allotted through a letter dated October 24, 2025, following completion of payment formalities. Global Health plans to begin documentation and construction activities in phases for the hospital project.",
            "Sentiment": "positive",
            "PublishDate": 1761371454413,
            "Source": "stock"
        },
        {
            "Title": "Global Health Limited Receives Land Approval for Proposed Hospital in Guwahati",
            "Summary": "Global Health Limited has received in-principle approval from Assam Industrial Development Corporation Limited for the allotment of 3.5 acres of land in Guwahati, Assam for a proposed hospital. The land is allotted for 60 years, extendable by 30 years, subject to compliance with conditions including remaining payment within 3 months. The company has paid 10% of the total payment as application money and received the approval letter dated September 03, 2025. The land is located at Industrial Estate, Sarusajai, Guwahati, Assam and measures 14,164.50 square meters. Management is working on next steps and will update exchanges and investors on material developments.",
            "Sentiment": "positive",
            "PublishDate": 1756981953614,
            "Source": "stock"
        },
        {
            "Title": "Global Health Limited (Medanta) Reports Strong Q1 FY2026 Results with 19% Revenue Growth and 50% PAT Increase",
            "Summary": "Global Health Limited (Medanta) reported total income of INR 10,513 million for Q1 FY2026, representing 19% year-on-year growth from INR 8,830 million. EBITDA increased 23% to INR 2,553 million with an improved margin of 24.3%. Profit after tax surged 50% to INR 1,590 million, with PAT margin improving to 15.1% from 12%. The company showed strong operational metrics with inpatient volumes up 14%, outpatient volumes up 13%, and average occupied bed days increasing 13%. International patient revenues grew 34% to INR 636 million. The company operationalized a new 110-bed hospital in Ranchi and plans to commence operations at its 550-bed Noida facility. Mature hospitals achieved 62% occupancy with ARPOB growing 9% to INR 73,256, while developing hospitals in Lucknow and Patna maintained 64% occupancy. The company onboarded over 150 doctors including 30 senior clinicians and continues expansion with plans to add 2,000 beds over 3-4 years.",
            "Sentiment": "positive",
            "PublishDate": 1755279189435,
            "Source": "earnings"
        },
        {
            "Title": "Global Health Plans ₹4,000 Crore Investment to Add 3,000 Beds and Double EBITDA by FY30",
            "Summary": "Global Health has announced plans to invest ₹4,000 crore for expansion and growth initiatives. The investment will focus on adding 3,000 hospital beds to increase capacity. The company aims to double its EBITDA by FY30 as part of its growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1754576597846,
            "Source": "stock"
        },
        {
            "Title": "Global Health Reports Strong Q1 Growth with Revenue Up 19.6% and Net Profit Surging 50%",
            "Summary": "Global Health delivered robust quarterly results with revenue rising to 10.3 billion rupees from 8.61 billion rupees year-over-year. The company's consolidated net profit jumped significantly to 1.59 billion rupees compared to 1.06 billion rupees in the same period last year. EBITDA increased to 2.27 billion rupees from 1.86 billion rupees, while EBITDA margin improved to 22.02% from 21.64% year-over-year, indicating enhanced operational efficiency alongside revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1754565831310,
            "Source": "earnings"
        },
        {
            "Title": "Global Health Limited Approves Q1 FY2026 Results, Sets AGM Date and Final Dividend Record Date",
            "Summary": "Global Health Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹8,821.56 million compared to ₹7,578.62 million in the same quarter last year. Profit after tax increased to ₹1,519.64 million from ₹1,085.51 million year-over-year. Consolidated revenue reached ₹10,308.37 million versus ₹8,610.77 million in the previous year, with profit after tax rising to ₹1,589.82 million from ₹1,062.64 million. The Board scheduled the 21st Annual General Meeting for September 19, 2025, and fixed August 22, 2025 as the record date for final dividend payment of ₹0.50 per equity share for FY2025, subject to shareholder approval. The company recommended re-appointment of Dr. Naresh Trehan as Chairman and Managing Director for five years from August 1, 2026, and re-appointment of two independent directors for second terms of five years each. The Board also recommended appointment of MAKS & CO. as Secretarial Auditors for five years starting FY2026.",
            "Sentiment": "positive",
            "PublishDate": 1754564726684,
            "Source": "corporate_action"
        },
        {
            "Title": "Global Health Limited Schedules Board Meeting on August 7 to Approve Quarterly Financial Results",
            "Summary": "Global Health Limited has scheduled a Board of Directors meeting on August 7, 2025, to consider and approve the unaudited financial results for the quarter ended June 30, 2025. The company's trading window is closed from July 1, 2025, and will reopen 48 hours after the results declaration. The company trades on BSE with scrip code 543654 and on NSE with symbol MEDANTA.",
            "Sentiment": "neutral",
            "PublishDate": 1753769209738,
            "Source": "corporate_action"
        },
        {
            "Title": "Medanta Receives Assam Government Approval for 3.5-Acre Hospital Land Lease in Guwahati",
            "Summary": "Global Health Limited (Medanta) has received approval from the Assam Cabinet for allotment of 3.5 acres of land on long-term lease for a hospital project in Guwahati. The lease terms include a 60-year duration with an option for 30-year renewal, requiring an upfront land lease charge of Rs. 56 crore and ongoing estate charges of Rs. 2.42 per square meter per month. This 3.5-acre land allocation replaces an earlier offer of 3 acres from Assam Electricity Grid Corporation Limited, following the company's request for substitution with suitable highway-adjacent land. The Cabinet also approved a common Floor Area Ratio (FAR) for the entire land parcel comprising two hospitals and one hotel. Medanta is awaiting further details from relevant agencies and will proceed with execution of agreements.",
            "Sentiment": "positive",
            "PublishDate": 1753358904220,
            "Source": "stock"
        },
        {
            "Title": "Global Health Ltd: Rs 4,000 Crore Expansion Plan to Reach 6,000 Beds",
            "Summary": "Global Health Ltd, operating Medanta hospitals, plans Rs 4,000 crore capex to expand capacity to 6,000 beds in the next couple of years. New centers in Noida, Guwahati, and Mumbai are part of the expansion. The company's Q4 net profit declined 20% YoY to Rs 101 crore, while revenue increased 15% to Rs 931 crore. FY25 Ebitda margin contracted to 25.4% from 26.1% in FY24.",
            "Sentiment": "positive",
            "PublishDate": 1747540572000,
            "Source": "corporate_action"
        },
        {
            "Title": "Global Health Reports Q4 FY2023 Financial Results",
            "Summary": "Global Health announced its Q4 FY2023 financial results, showing year-over-year improvements in key metrics. EBITDA increased to 2.25 billion rupees from 1.79 billion, with EBITDA margin rising to 24.13% from 22.18%. Revenue grew to 9.31 billion rupees from 8.09 billion. However, consolidated net profit decreased to 1.01 billion rupees from 1.27 billion year-over-year, but improved from 1.43 billion quarter-over-quarter. The company reported an exceptional item of 499 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1747309893000,
            "Source": "result"
        },
        {
            "Title": "Global Health Ltd: Medanta Parent to Invest ₹500 Crore in Assam Hospital",
            "Summary": "Global Health Ltd, parent of Medanta hospitals, has acquired 3 acres of land in Assam for ₹30 crore to build a 400-bed super specialty hospital. The company plans to invest approximately ₹500 crore in the project, which aims to serve over 5 crore people across Assam and neighboring states.",
            "Sentiment": "positive",
            "PublishDate": 1745837076000,
            "Source": "corporate_action"
        },
        {
            "Title": "Global Health Receives Land Offer for Super Speciality Hospital in Guwahati",
            "Summary": "Global Health has received an offer from the Assam Electricity Grid Corporation Ltd (AEGCL), a government entity of Assam, to acquire 3 acres of land in Guwahati. The purpose of this acquisition is to establish a super speciality hospital in the area.",
            "Sentiment": "positive",
            "PublishDate": 1744025536000,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Approves Merger of Medanta Holdings with Global Health",
            "Summary": "The National Company Law Tribunal (NCLT) has approved the scheme of amalgamation between Medanta Holdings and Global Health. This merger represents a significant corporate action in the healthcare sector, potentially consolidating operations and resources of the two entities.",
            "Sentiment": "positive",
            "PublishDate": 1740051205000,
            "Source": "corporate_action"
        },
        {
            "Title": "Global Health Ltd: Medanta Expands with New Hospitals in Noida and Delhi",
            "Summary": "Medanta, operated by Global Health Ltd, is expanding its healthcare network by opening new hospitals in Noida and Delhi.",
            "Sentiment": "positive",
            "PublishDate": 1739349559000,
            "Source": "corporate_action"
        },
        {
            "Title": "Medanta to Expand in Ranchi with New Hospital Lease Agreement",
            "Summary": "Global Health, operating under the Medanta brand, is set to expand its presence in Ranchi by signing a lease agreement to operate a new 110-bed hospital. This move signifies Medanta's strategic growth in the healthcare sector and its commitment to providing medical services in Ranchi.",
            "Sentiment": "positive",
            "PublishDate": 1738675152000,
            "Source": "corporate_action"
        },
        {
            "Title": "Global Health Reports Q3 EBITDA Growth",
            "Summary": "Global Health has announced its Q3 financial results. The company's EBITDA increased to 2.38 billion rupees, up from 2.16 billion rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 25.21% from 25.82% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738666890000,
            "Source": "earnings"
        },
        {
            "Title": "Global Health Reports Q3 Financial Results",
            "Summary": "Global Health announced its financial results for the third quarter. The company's consolidated net profit increased to 1.43 billion rupees from 1.23 billion rupees in the same period last year. Revenue also saw growth, rising to 9.43 billion rupees from 8.36 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738666875000,
            "Source": "earnings"
        },
        {
            "Title": "Global Health Ltd Reports Large Block Trade on NSE",
            "Summary": "A significant block trade of approximately 520,667 shares of Global Health Ltd was executed on the National Stock Exchange (NSE) at a price of Rs. 1103.35 per share. The total value of the transaction amounted to Rs. 57.45 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1734408634000,
            "Source": "block_deals"
        },
        {
            "Title": "Global Health: Q2 Results Highlight Potential in Underserved Markets",
            "Summary": "Axis Securities reviews Global Health's Q2 results, emphasizing opportunities in underserved micro markets. The report suggests potential growth prospects for the company.",
            "Sentiment": "positive",
            "PublishDate": 1731926737000,
            "Source": "result"
        },
        {
            "Title": "Global Health Reports Q2 Revenue Growth",
            "Summary": "Global Health has announced its Q2 revenue of 9.6 billion rupees, compared to 8.4 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731571415000,
            "Source": "result"
        },
        {
            "Title": "Global Health Reports Q2 EBITDA Growth",
            "Summary": "Global Health announced its Q2 financial results, reporting an EBITDA of 2.28 billion rupees, up from 2.1 billion rupees in the same quarter last year. However, the EBITDA margin decreased to 23.87% from 25.22% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731571296000,
            "Source": "result"
        },
        {
            "Title": "Global Health Reports Q2 Net Profit Increase",
            "Summary": "Global Health has announced its Q2 consolidated net profit of 1.31 billion rupees, showing an increase from 1.25 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731571234000,
            "Source": "result"
        },
        {
            "Title": "Global Health to Operate 750-Bed Hospital in New Delhi",
            "Summary": "Global Health has approved an operations and management (O&M) agreement for a 750-bed hospital in New Delhi. The company plans to invest approximately 600 crore rupees over the next 3-4 years for this project.",
            "Sentiment": "positive",
            "PublishDate": 1730880165000,
            "Source": "corporate_action"
        }
    ]
}