{
    "Symbol": "MEDICAMEQ",
    "ISIN": "INE646B01010",
    "News": [
        {
            "Title": "Medicamen Biotech Gets EU Approval for Paracetamol",
            "Summary": "Medicamen Biotech receives European Union approval for registration of paracetamol product from Denmark in partnership with XGX Pharma, marking regulatory milestone for the pharmaceutical company.",
            "Sentiment": "positive",
            "PublishDate": 1767834232177,
            "Source": "stocks"
        },
        {
            "Title": "Medicamen Biotech Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "Medicamen Biotech Limited's Board approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025, showing net profit after tax of Rs. 304.22 lakhs for standalone operations. The biotech company's cash and bank balances increased significantly to Rs. 4,351.23 lakhs from Rs. 358.03 lakhs in the previous year, primarily driven by proceeds from share capital issuance of Rs. 84.82 lakhs and securities premium of Rs. 4,410.72 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1763129959828,
            "Source": "earnings"
        },
        {
            "Title": "Medicameq Ltd Approves Q1 FY26 Results and Appoints Three New Directors",
            "Summary": "Medicameq Ltd approved its unaudited financial results for the quarter ended June 30, 2025. The board appointed Mr. Ashwani Kumar Sharma as Executive Director for five years, changing his role from Non-Executive Director. Two new Non-Executive Independent Directors were also appointed: Mr. Sham Goel, a Chartered Accountant with over 30 years of finance experience, and Mr. Shaival Saurabh, who has over 30 years of branding and advertising experience. The company's 32nd AGM is scheduled for September 26, 2025, and the board proposed a final dividend of 10% or Re. 1 per equity share for FY 2024-25. The auditors provided unmodified opinions on the quarterly results.",
            "Sentiment": "positive",
            "PublishDate": 1754998751904,
            "Source": "corporate_action"
        },
        {
            "Title": "Medicamen Biotech Receives First ANDA Approval from USFDA",
            "Summary": "Medicamen Biotech has received its first Abbreviated New Drug Application (ANDA) approval from the U.S. Food and Drug Administration (USFDA) for Bortezomib for injection. This approval is described as a significant milestone for the company.",
            "Sentiment": "positive",
            "PublishDate": 1748935444000,
            "Source": "default"
        },
        {
            "Title": "Medicamen Biotech Approves Share and Warrant Allotment",
            "Summary": "Medicamen Biotech has approved the allotment of 848,220 shares at 530 rupees each. Additionally, the company has approved the allotment of 650,000 warrants at the same price of 530 rupees each.",
            "Sentiment": "positive",
            "PublishDate": 1745506025000,
            "Source": "default"
        },
        {
            "Title": "Medicamen Biotech Signs Distribution Agreement for Three Products in European Market",
            "Summary": "Medicamen Biotech has announced the signing of a distribution agreement with XGX Pharma, Denmark for three of its products in the European market. The company will retain the marketing authorization for these products.",
            "Sentiment": "positive",
            "PublishDate": 1744098288000,
            "Source": "corporate_action"
        },
        {
            "Title": "Medicamen Biotech Signs CDMO Contract with European Company XGX Pharma",
            "Summary": "Medicamen Biotech has entered into a Contract Development and Manufacturing Organization (CDMO) agreement with XGX Pharma, a European pharmaceutical company. Under this contract, Medicamen will develop six products and manufacture them for XGX. The European company will hold the Marketing Authorization (MA) for these products.",
            "Sentiment": "positive",
            "PublishDate": 1743662301000,
            "Source": "corporate_action"
        },
        {
            "Title": "Medicamen Biotech Expands into Canadian and Australian Markets",
            "Summary": "Medicamen Biotech has announced plans to expand its operations into Canada and Australia. This strategic move indicates the company's efforts to increase its global presence and potentially tap into new pharmaceutical markets.",
            "Sentiment": "positive",
            "PublishDate": 1743146881000,
            "Source": "corporate_action"
        },
        {
            "Title": "Medicamen Biotech Secures EU and USFDA Approvals for Manufacturing Plants",
            "Summary": "Medicamen Biotech has successfully obtained approvals from both the European Union (EU) and the United States Food and Drug Administration (USFDA) for its manufacturing plants. This achievement signifies that the company's production facilities meet the stringent quality and safety standards required by these regulatory bodies, potentially opening up new markets and opportunities for the company's pharmaceutical products.",
            "Sentiment": "positive",
            "PublishDate": 1743146826000,
            "Source": "corporate_action"
        },
        {
            "Title": "Medicamen Biotech Enters Agreement for Product Registration in South Africa",
            "Summary": "Medicamen Biotech has signed an agreement with a South African conglomerate to register and market its products in the region. South Africa's pharmaceutical market is valued at $4 billion and is classified as a regulated market, presenting a significant opportunity for the company's expansion.",
            "Sentiment": "positive",
            "PublishDate": 1741565403000,
            "Source": "corporate_action"
        },
        {
            "Title": "Medicamen Biotech Partners with South African Conglomerate for Market Expansion",
            "Summary": "Medicamen Biotech has formed a partnership with a major South African conglomerate to register and market its products in South Africa's $4 billion pharmaceutical market. This strategic move follows the company's recent EU plant approval and is part of its global expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1741345545000,
            "Source": "corporate_action"
        },
        {
            "Title": "Medicamen Biotech Announces Preferential Share Issue",
            "Summary": "Medicamen Biotech has announced a preferential issue of shares worth up to 689 million rupees. This corporate action indicates the company is raising capital, potentially for expansion, debt reduction, or other strategic purposes.",
            "Sentiment": "positive",
            "PublishDate": 1740574380000,
            "Source": "corporate_action"
        },
        {
            "Title": "Medicamen Biotech Schedules Board Meeting to Discuss Fundraising",
            "Summary": "Medicamen Biotech has announced a board meeting on February 26 to consider fundraising options. This meeting suggests the company may be looking to secure additional capital for its operations or expansion plans.",
            "Sentiment": "neutral",
            "PublishDate": 1740355810000,
            "Source": "corporate_action"
        },
        {
            "Title": "Medicamen Biotech Board Meeting to Consider Fundraising",
            "Summary": "Medicamen Biotech has announced a board meeting scheduled for February 26 to discuss potential fundraising options for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1740136594000,
            "Source": "corporate_action"
        },
        {
            "Title": "Medicamen Biotech Signs 10-Year Manufacturing and Supply Agreement with US and European Pharmaceutical Distributor",
            "Summary": "Medicamen Biotech has entered into a 10-year manufacturing and supply agreement with a pharmaceutical distributor operating in the United States and Europe. As part of the agreement, 25% of the total amount has been paid upon signing. This long-term partnership suggests a significant business opportunity for Medicamen Biotech in expanding its manufacturing and distribution capabilities in key international markets.",
            "Sentiment": "positive",
            "PublishDate": 1740010575000,
            "Source": "corporate_action"
        },
        {
            "Title": "Medicamen Biotech Signs 10-Year Manufacturing Agreement with US, European Distributor",
            "Summary": "Medicamen Biotech has entered into a 10-year manufacturing and supply agreement with a pharmaceutical distributor in the United States and Europe. As part of the agreement, 25% of the total amount has been paid upon signing.",
            "Sentiment": "positive",
            "PublishDate": 1739966039000,
            "Source": "corporate_action"
        },
        {
            "Title": "Medicamen Biotech Reports Q3 Financial Results",
            "Summary": "Medicamen Biotech has announced its financial results for the third quarter. The company reported a net profit of 25 million rupees, down from 28 million rupees in the same quarter last year. Revenue for Q3 stood at 413 million rupees, compared to 442 million rupees in the previous year, indicating a year-over-year decline in both profit and revenue.",
            "Sentiment": "negative",
            "PublishDate": 1739268686000,
            "Source": "earnings"
        },
        {
            "Title": "Medicamen Biotech's Haridwar Facility Receives USFDA Approval",
            "Summary": "Medicamen Biotech has announced that its sterile injectable oncology formulation facility in Haridwar has received approval from the United States Food and Drug Administration (USFDA). This approval is a significant milestone for the company, as it allows them to manufacture and potentially export oncology drugs to the US market.",
            "Sentiment": "positive",
            "PublishDate": 1729840592000,
            "Source": "corporate_action"
        }
    ]
}