{
    "Symbol": "MEDICO",
    "ISIN": "INE630Y01024",
    "News": [
        {
            "Title": "Medico Remedies Q3 FY26 Results: Revenue Up 48.6%",
            "Summary": "Medico Remedies Limited reported strong Q3 FY26 performance with revenue rising 48.6% YoY to ₹5,868.29 lakhs and net profit growing 9.6% to ₹287.23 lakhs for quarter ended December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770901096361,
            "Source": "co_actions_results"
        },
        {
            "Title": "Medico Remedies Secures ₹37.17 Cr UP Govt Order",
            "Summary": "Medico Remedies Limited secured a government supply order worth ₹37.17 crores from Uttar Pradesh Medical Supplies Corporation Limited for multiple drug supplies to be completed by October 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769494928368,
            "Source": "co_actions_results"
        },
        {
            "Title": "Medico Remedies Secures ₹73 Crore Order",
            "Summary": "Medico Remedies has secured a significant order worth ₹73 crore, representing a substantial business development for the pharmaceutical company with a current market capitalisation of ₹390 crore.",
            "Sentiment": "positive",
            "PublishDate": 1768893330548,
            "Source": "co_actions_results"
        },
        {
            "Title": "Medico Remedies Reports Strong Q2 Performance with Revenue Growth and Improved Profitability",
            "Summary": "Medico Remedies Limited reported quarterly revenue of Rs 526.35 lakh and net profit of Rs 356.82 lakh for the quarter ended September 30, 2025, with half-year revenue reaching Rs 932.69 lakh and net profit of Rs 438.63 lakh. The pharmaceutical formulations manufacturer showed significant growth with international sales contributing Rs 467.54 lakh compared to domestic sales of Rs 54.29 lakh in the latest quarter.",
            "Sentiment": "positive",
            "PublishDate": 1763143244743,
            "Source": "earnings"
        },
        {
            "Title": "Medicore Remedies Receives GMP Compliance Certificate from Ukraine's State Service on Medicines and Drugs Control",
            "Summary": "Medicore Remedies' Palghar manufacturing facility received GMP compliance certification from Ukraine's State Service on Medicines and Drugs Control on 10 November, 2025, following a successful inspection. The PIC/S certification will enhance the facility's global credibility and facilitate access to regulated markets including Thailand, Singapore, Malaysia, Jordan, and Iraq.",
            "Sentiment": "positive",
            "PublishDate": 1763114707134,
            "Source": "corporate_action"
        },
        {
            "Title": "",
            "Summary": "",
            "Sentiment": "",
            "PublishDate": 1762519703968,
            "Source": "stock"
        },
        {
            "Title": "Medico Remedies Secures $17.81 Million Government Supply Order",
            "Summary": "Medico Remedies has received a government supply order valued at $17.81 million. The order represents a significant contract win for the pharmaceutical company from government authorities.",
            "Sentiment": "positive",
            "PublishDate": 1759755370430,
            "Source": "stock"
        },
        {
            "Title": "Medico Remedies Receives Bombay High Court Order Quashing GST Demand of Rs 2.94 Crore",
            "Summary": "Medico Remedies Limited received an order from the Bombay High Court quashing show cause notices issued by the GST Authority. The notices had raised a GST demand of Rs 2,94,18,355 for the financial years 2017-18, 2018-19, and 2019-20. The court's decision nullifies the demand, resulting in no financial impact on the company. The company had filed Writ Petition no.10974 of 2025 challenging the show cause notice, and the High Court stayed the operation of the notice. The company acknowledged a delay in disclosure, stating it was inadvertently missed and committed to ensuring timely disclosures in the future.",
            "Sentiment": "positive",
            "PublishDate": 1758713754103,
            "Source": "stock"
        },
        {
            "Title": "Medico Remedies Reports Q1 FY26 Results and Company Secretary Resignation",
            "Summary": "Medico Remedies Limited announced its quarterly results for the quarter ended June 30, 2025, reporting a profit of Rs 181.83 lakh compared to Rs 157.89 lakh in the same quarter last year. Revenue from operations stood at Rs 3,825.15 lakh versus Rs 3,079.81 lakh in the previous year quarter. The company's earnings per share was Rs 0.22 for the quarter. Additionally, Mr. Hasan Bohra resigned from his position as Company Secretary & Compliance Officer effective August 8, 2025, citing other professional commitments. The pharmaceutical formulation manufacturer operates primarily in export markets, with sales outside India accounting for Rs 3,245.01 lakh compared to domestic sales of Rs 539.65 lakh during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754654825855,
            "Source": "earnings"
        },
        {
            "Title": "Medico Remedies Limited Announces Multiple Leadership Changes Including MD Re-appointment and New Secretarial Auditor",
            "Summary": "Medico Remedies Limited's Board of Directors approved several key leadership changes. Harshit Mehta was re-appointed as Managing Director for three years starting September 17, 2025. Haresh Mehta will continue as Chairman & Whole-Time Director despite reaching 70 years of age on August 17, 2025. Maheshkumar Darji, who has 20 years of pharmaceutical industry experience and serves as General Manager at the company's Palghar plant, was appointed as Additional Executive Director. The company also saw changes in its secretarial auditor position, with Haresh Sanghvi resigning due to medical grounds and Shreya Shah being appointed as the new Secretarial Auditor for a five-year term from FY 2025-26 to FY 2029-30. All appointments are subject to shareholder approval at the upcoming Annual General Meeting. The Board also approved the notice for the company's 31st Annual General Meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1753869097935,
            "Source": "corporate_governance"
        },
        {
            "Title": "Medico Remedies Invests in New Factory for B-Lactam Formulations",
            "Summary": "Medico Remedies has begun construction on a new factory worth Rs 30 crore to manufacture B-Lactam formulations. This expansion is expected to increase the company's production capacity and potentially boost revenue by Rs 25 crore after necessary approvals are obtained.",
            "Sentiment": "positive",
            "PublishDate": 1747299270000,
            "Source": "default"
        },
        {
            "Title": "Medico Remedies to Supply Pharmaceutical Products Within 3 Months",
            "Summary": "Medico Remedies has announced that it will supply tablets, capsules, and dry syrups within a three-month timeframe. This commitment suggests the company is prepared to fulfill orders or meet demand for these pharmaceutical products in the near future.",
            "Sentiment": "positive",
            "PublishDate": 1744098413000,
            "Source": "corporate_action"
        },
        {
            "Title": "Medico Remedies Secures $1.9 Million Supply Order from Dominican Republic",
            "Summary": "Medico Remedies has obtained a significant supply order worth $1.9 million from the Dominican Republic. This order represents a substantial business opportunity for the company and potentially indicates expansion into international markets.",
            "Sentiment": "positive",
            "PublishDate": 1744098335000,
            "Source": "order&deals"
        },
        {
            "Title": "Medico Remedies Reports Strong Q3 Financial Performance",
            "Summary": "Medico Remedies has announced its financial results for the third quarter. The company's net profit increased to 26 million rupees, up from 14 million rupees in the same period last year. Revenue also saw significant growth, rising to 395 million rupees from 298 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738751542000,
            "Source": "earnings"
        }
    ]
}