{
    "Symbol": "MEDIASSIST",
    "ISIN": "INE456Z01021",
    "News": [
        {
            "Title": "Medi Assist Seeks Promoter Reclassification",
            "Summary": "Medi Assist Healthcare Services has applied to stock exchanges for reclassification of six entities from promoter category to public category under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770799558581,
            "Source": "stocks"
        },
        {
            "Title": "Medi Assist Subsidiary Gets Credit Rating Reaffirmed",
            "Summary": "Care Ratings reaffirmed CARE AA-; Stable rating for Medi Assist Insurance TPA's ₹246 crore credit facilities, reflecting strong parentage and market leadership in TPA industry.",
            "Sentiment": "positive",
            "PublishDate": 1770741568096,
            "Source": "stocks"
        },
        {
            "Title": "Medi Assist Reports No Deviation in Fund Utilization",
            "Summary": "Medi Assist Healthcare confirms no deviation in INR 198.00 crore preferential issue proceeds utilization for Q3 FY26, with INR 148.40 crore deployed for subsidiary debt repayment.",
            "Sentiment": "neutral",
            "PublishDate": 1770386034588,
            "Source": "co_actions_results"
        },
        {
            "Title": "Medi Assist Approves Merger of Two Subsidiaries",
            "Summary": "Medi Assist Healthcare Services announces board approval for merger between wholly owned subsidiaries IHMS and MCSI under Section 233 of Companies Act 2013, subject to statutory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1770384615039,
            "Source": "co_actions_results"
        },
        {
            "Title": "Medi Assist Reports Q3 FY26 Results with Revenue Growth",
            "Summary": "Medi Assist Healthcare Services reported Q3 FY26 consolidated revenue of ₹2,396.78 million, up from ₹1,859.74 million in Q3 FY25, despite exceptional items impacting profitability during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1770383406486,
            "Source": "co_actions_results"
        },
        {
            "Title": "Medi Assist Board Meet Set for Feb 6 to Review Q3FY26",
            "Summary": "Medi Assist Healthcare Services has scheduled its board meeting for February 6, 2026, to approve Q3FY26 financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769771645538,
            "Source": "co_actions_results"
        },
        {
            "Title": "Medi Assist Auditor Firm Converts to LLP Structure",
            "Summary": "Medi Assist Healthcare Services announces statutory auditor MSKA & Associates has converted to LLP format while continuing audit services without engagement changes.",
            "Sentiment": "neutral",
            "PublishDate": 1769678440531,
            "Source": "stocks"
        },
        {
            "Title": "Medi Assist approves subsidiary merger scheme",
            "Summary": "Medi Assist Healthcare Services announces board approval for merger of Paramount TPA with MAITPA under Section 233 of Companies Act 2013, aimed at operational synergies.",
            "Sentiment": "positive",
            "PublishDate": 1766994067124,
            "Source": "co_actions_results"
        },
        {
            "Title": "MediAssist Healthcare Allots 1.04 Lakh Equity Shares Under Employee Stock Option Scheme",
            "Summary": "MediAssist Healthcare Services Limited allotted 1,04,580 equity shares of face value Rs. 5 each to eligible employees upon exercise of options under Employee Stock Option Scheme 2013. The allotment increased the company's paid-up equity share capital from Rs. 37,17,65,810 to Rs. 37,22,88,710, with total shares rising to 7,44,57,742.",
            "Sentiment": "positive",
            "PublishDate": 1765032747526,
            "Source": "corporate_action"
        },
        {
            "Title": "MediAssist Launches AI-Powered Platforms to Combat Healthcare Fraud and Enhance Cashless Experience",
            "Summary": "MediAssist Healthcare Services unveiled two AI-driven platforms - MaAvenGuard for fraud detection and MAgnum for hospital enablement - alongside releasing a report with Boston Consulting Group revealing Rs 8,000-10,000 crore annual losses due to healthcare fraud, waste, and abuse. The company reported significant operational improvements with 15% of discharges completing before final bill generation, 70% of total claim value processed cashless, and 85% of cashless claims digitally submitted.",
            "Sentiment": "positive",
            "PublishDate": 1763711338525,
            "Source": "stock"
        },
        {
            "Title": "MediAssist Subsidiary Paramount TPA Experiences Cyber-Security Incident",
            "Summary": "Paramount Health Services Insurance TPA Private Limited, a material step-down wholly owned subsidiary of MediAssist Healthcare Services Limited, experienced a cyber-security incident affecting some of its systems and services. All affected infrastructure and systems have been restored and business operations have returned to normal, with MediAssist and its other subsidiaries remaining unaffected by the incident.",
            "Sentiment": "neutral",
            "PublishDate": 1763564368702,
            "Source": "stock"
        },
        {
            "Title": "MediAssist Healthcare Reports Strong Q2 FY26 Performance with Revenue Growth and Market Share Gains",
            "Summary": "MediAssist Healthcare Services Limited reported revenue growth of 11.3% for Q2 FY26 and 11.2% for H1 FY26. The company's market share in health insurance premium administration increased to 20.3% as of September 30, 2025, up from 19.2% in the previous year. Group segment market share reached 30.8% compared to 28.4% in September 2024. The company achieved strong performance across key revenue segments, with Tech Services revenue growing 88.0% in Q2 and 87.5% in H1, International revenue growing 17.9% in Q2 and 25.8% in H1, and Government revenue growing 16.8% in Q2 and 25.2% in H1. Revenue from Private/SAHI insurers grew 16.1% in Q2 and 13.0% in H1. The company reported Q2 FY26 PAT of Rs 8.1 crores, which was impacted by the Paramount acquisition including decreased other income, increased finance costs, and incremental depreciation. The effective tax rate was 40.1% in Q2 and 30.2% in H1. Customer retention stood at 93.4% with focus on quality of revenues following the Paramount acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1762824680305,
            "Source": "earnings"
        },
        {
            "Title": "MediAssist Healthcare Reports 21% Revenue Growth in H1 Results",
            "Summary": "MediAssist Healthcare Services Limited disclosed its key performance indicators for H1 FY2025-26. The company reported revenue from contracts with customers of ₹4,231.03 million, up from ₹3,484.75 million in H1 FY2024-25. Adjusted EBITDA increased to ₹817.30 million from ₹736.78 million, though the margin declined to 19.32% from 21.14%. Profit from continuing operations decreased to ₹306.98 million from ₹400.35 million, with PAT margin falling to 7.26% from 11.12%. Net worth grew to ₹5,911.50 million from ₹4,985.36 million. Return on net worth dropped to 10.39% from 16.06%, while return on capital employed declined to 14.23% from 19.15%. Premium under management increased to ₹1,27,187 million from ₹1,05,824 million. Revenue per average headcount on non-government contracts rose to ₹1.49 million from ₹1.39 million.",
            "Sentiment": "neutral",
            "PublishDate": 1762372085372,
            "Source": "earnings"
        },
        {
            "Title": "MediAssist Healthcare Approves Rs 5 Crore Stand-By Letter of Credit for UK Subsidiary",
            "Summary": "MediAssist Healthcare Services Limited's Board of Directors approved the issuance of a Stand-By Letter of Credit not exceeding Rs 5 crores for its UK subsidiary, Mayfair WeCare Limited. The arrangement is part of a business where the insurer, overseas service provider, and MediAssist will provide services to policyholders of overseas medical claim policies and travel/health insurance policies for Indians going abroad. Mayfair WeCare Limited is required to furnish a Performance Guarantee in the form of a Bank Guarantee to insurers as part of the agreement. This creates a contingent liability for MediAssist, limited to Rs 5 crores, where the company may be required to honor the Bank Guarantee if Mayfair WeCare Limited defaults on its obligations. The promoter/promoter group has no interest in this transaction, which is conducted at arm's length basis.",
            "Sentiment": "neutral",
            "PublishDate": 1762366314488,
            "Source": "corporate_action"
        },
        {
            "Title": "MediAssist Healthcare Reports Mixed Quarterly Results Amid Enforcement Action",
            "Summary": "MediAssist Healthcare Services Limited reported quarterly results for the period ended September 30, 2025. The company's consolidated revenue from operations was Rs. 2,825.85 million for the quarter, with profit after tax of Rs. 206.7 million. For the six-month period, revenue reached Rs. 5,055.51 million with profit of Rs. 439.80 million. The company completed acquisition of 100% equity stake in Paramount Health Services and Insurance TPA Private Limited on July 1, 2025, for Rs. 4,124.40 million after closing adjustments. A search and seizure operation was conducted by the Directorate of Enforcement at offices of wholly-owned subsidiary MediAssist Insurance TPA Private Limited in Ranchi, Jharkhand on April 4, 2025, related to Ayushman Bharat health scheme administration. Management assessed no adverse impact from this operation. Subsequently, the company allotted 37,01,000 equity shares at Rs. 535 per share on October 10, 2025, raising Rs. 1,98,00,35,000 through private placement.",
            "Sentiment": "neutral",
            "PublishDate": 1762349807108,
            "Source": "earnings"
        },
        {
            "Title": "Medi Assist Healthcare Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Medi Assist Healthcare reported quarterly consolidated net profit of 80 million rupees, down from 210 million rupees in the same period last year. Revenue increased to 2.33 billion rupees from 1.81 billion rupees year-over-year. EBITDA rose to 397 million rupees from 385 million rupees, while EBITDA margin compressed to 17.08% from 21.27% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762347600161,
            "Source": "earnings"
        },
        {
            "Title": "MediAssist Healthcare Reports Board Decisions Including Director Resignation and Subsidiary Credit Facility",
            "Summary": "MediAssist Healthcare Services Limited's Board approved unaudited financial results for the quarter and half-year ended September 30, 2025. The Board also approved issuance of a Stand-By Letter of Credit not exceeding Rs. 5 crores for UK subsidiary Mayfair WeCare Limited. Mr. Vishal Vijay Gupta resigned as Nominee Director-Non Executive Director effective November 5, 2025, following divestment of shareholding by Bessemer Health Capital LLC and subsequent sale of shares held by Bessemer India Capital Holdings II Ltd. The company's auditors noted a search and seizure operation conducted by the Directorate of Enforcement at certain offices of wholly-owned subsidiary MediAssist Insurance TPA Private Limited in Ranchi, Jharkhand, related to Ayushman Bharat-linked health scheme administration. Management assessed no adverse impact requiring adjustment in the financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1762346566853,
            "Source": "earnings"
        },
        {
            "Title": "Medi Assist Healthcare Services Raises INR 198 Crores from MIT and Affiliate Through Preferential Issue",
            "Summary": "Medi Assist Healthcare Services Limited completed a preferential allotment of 37,01,000 equity shares at INR 535 per share to Massachusetts Institute of Technology and 238 Plan Associates LLC, raising INR 198 crores. MIT received 28,90,830 shares for INR 154.66 crores, while 238 Plan Associates LLC received 8,10,170 shares for INR 43.34 crores. The company's paid-up equity share capital increased from INR 35.32 crores to INR 37.18 crores, with total shares outstanding rising from 7.06 crore to 7.44 crore shares. The transaction received board approval and 99.15% shareholder approval at an extraordinary general meeting. CEO Satish V N Gidugu stated the investment reaffirms the company's mission to lead India's digital health transformation through AI-led health benefit solutions. The capital raise follows recent acquisitions including Fairfax-owned Paramount Health Services and a strategic collaboration with Star Health Insurance.",
            "Sentiment": "positive",
            "PublishDate": 1760110420121,
            "Source": "corporate_action"
        },
        {
            "Title": "Medi Assist Healthcare Services Appoints CARE Ratings as Monitoring Agency for Preferential Issue",
            "Summary": "Medi Assist Healthcare Services Limited has appointed CARE Ratings Limited as the monitoring agency to oversee the utilization of proceeds from its preferential issue of 37,01,000 equity shares. The appointment follows an Extra-Ordinary General Meeting notice dated August 11, 2025, where the company sought approval for issuing thirty-seven lakhs and one thousand fully paid up equity shares on a preferential basis. CARE Ratings Limited, a SEBI registered Credit Rating Agency with its registered office in Mumbai, will monitor the utilization of proceeds in accordance with the objects disclosed in the EGM notice.",
            "Sentiment": "neutral",
            "PublishDate": 1758694615127,
            "Source": "corporate_action"
        },
        {
            "Title": "MediAssist Clarifies Timeline for INR 198 Crore Preferential Issue Proceeds Utilization",
            "Summary": "MediAssist has provided clarifications regarding the timeline for utilization of proceeds from a preferential issue of 37,01,000 equity shares to Massachusetts Institute of Technology and 238 Plan Associates LLC. The company plans to use INR 150 crore for debt repayment through a subsidiary and INR 48.0035 crore for general corporate purposes, with both to be utilized within 2 years of share allotment. The clarification was made following observations from the National Stock Exchange. Shareholders approved the preferential issue in an extraordinary general meeting held on September 4, 2025. The company also provided an updated shareholding pattern on a fully diluted basis, showing promoter group holding at 19.36% and non-promoter public shareholding at 79.79% post the preferential issue.",
            "Sentiment": "neutral",
            "PublishDate": 1757336959074,
            "Source": "corporate_action"
        },
        {
            "Title": "Wasatch Advisors LP Increases Stake in Medi Assist Healthcare to 5.84%",
            "Summary": "Wasatch Advisors LP acquired 2,572,378 shares of Medi Assist Healthcare Services Ltd through open market purchases on August 12, 2025. The acquisition increased Wasatch's shareholding from 2.19% to 5.84% of the company's total voting capital. Before the transaction, Wasatch held 1,544,039 shares, and after the acquisition, their total holding stands at 4,116,417 shares. Medi Assist Healthcare has a total share capital of 70,538,100 shares with a par value of Rs 5.00 each, and is listed on both BSE and NSE exchanges. Wasatch Advisors LP is not part of the promoter group.",
            "Sentiment": "neutral",
            "PublishDate": 1755151675341,
            "Source": "corporate_action"
        },
        {
            "Title": "Aditya Birla Sun Life Mutual Fund Increases Stake in Medi Assist Healthcare to 7.03%",
            "Summary": "Aditya Birla Sun Life Mutual Fund acquired additional shares in Medi Assist Healthcare Services Limited, increasing its total holding to 7.0332% of the company's paid-up capital. The mutual fund purchased 19,13,739 shares through open market transactions on August 12, 2025, representing 2.7131% of the total share capital. Prior to this acquisition, the fund held 30,47,322 shares (4.3201% stake). Post-acquisition, the total holding stands at 49,61,061 shares. Medi Assist Healthcare has an equity share capital of Rs. 35,26,90,600 comprising 7,05,38,120 shares of Rs. 5 each. The company's shares are listed on both NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1755149923297,
            "Source": "mutualfunds"
        },
        {
            "Title": "Medi Assist Reports 18.5% Premium Growth, Completes Paramount Acquisition for Rs 412.4 Crores",
            "Summary": "Medi Assist Healthcare Services reported total premium under management of Rs 7,076 crores as of June 30, 2025, marking 18.5% year-on-year growth. The company's market share increased to 23.1% from 21.3% in the previous year. Group segment premiums grew 20.4% while retail segment showed minimal growth at 0.2%. Total income reached Rs 198 crores, up 14.5% year-on-year, with operating EBITDA of Rs 42 crores representing 22% margin. The company completed acquisition of Paramount Health Services for Rs 412.4 crores on July 1, 2025. Medi Assist entered a strategic partnership with Star Health to deploy its AI-driven claims platform MAtrix. The company processed over 22 lakh claims in the quarter and achieved fraud prevention savings of Rs 160 crores, up from Rs 50 crores in the same period last year. Technology services now contribute 2.5% of revenue as the company expands beyond traditional TPA services.",
            "Sentiment": "positive",
            "PublishDate": 1754995594476,
            "Source": "earnings"
        },
        {
            "Title": "Medi Assist Promoter Stake Drops to 4.88% After ₹578 Crore Block Deal",
            "Summary": "Medi Assist Healthcare Services saw 1.1 crore shares (15.67% equity) worth ₹578 crore change hands at ₹523 per share through a block deal. Promoter entity Bessemer India Capital Holdings' stake fell from 15.67% to 4.88% after the transaction. The company reported strong quarterly results with net profit rising 19% to ₹22.4 crore and revenue growing 13.6% to ₹190.5 crore. EBITDA increased 18.5% to ₹42.2 crore with margins expanding to 22.1%. The company's board approved raising ₹198 crore through preferential allotment of 37.01 lakh equity shares. Current shareholding includes mutual funds (25.6%), FIIs and foreign companies (17.8%), and insurance companies (9.5%).",
            "Sentiment": "neutral",
            "PublishDate": 1754969561987,
            "Source": "order&deals"
        },
        {
            "Title": "Medi Assist Healthcare Services Announces EGM for ₹198 Crore Preferential Share Issue",
            "Summary": "Medi Assist Healthcare Services Limited has scheduled an Extra-Ordinary General Meeting on September 4, 2025, to approve a preferential issue of 37,01,000 equity shares at ₹535 per share, raising ₹198 crore. The funds will be raised from Massachusetts Institute of Technology and 238 Plan Associates LLC, both qualified institutional buyers. The proceeds will primarily be used for investment in the company's subsidiary to prepay debt and for general corporate purposes. Remote e-voting will be available from September 1-3, 2025, with the cut-off date set as August 28, 2025. The company recently completed the acquisition of Paramount Health Services for ₹412.4 crore and holds a 23.1% market share in India's health insurance industry.",
            "Sentiment": "positive",
            "PublishDate": 1754918622407,
            "Source": "corporate_action"
        },
        {
            "Title": "Medi Assist Promoter Bessemer India Capital To Exit With Rs 560 Crore Stake Sale",
            "Summary": "Bessemer India Capital Holdings II Ltd., a promoter of Medi Assist Healthcare Services Ltd., is planning to exit the company through a bulk deal valued at Rs 560 crore. The promoter entity will sell its entire 15.67% stake in Medi Assist, which operates as a third-party administrator for insurers.",
            "Sentiment": "neutral",
            "PublishDate": 1754917500492,
            "Source": "order&deals"
        },
        {
            "Title": "Medi Assist Targets Nationwide HBA Leadership Through Technology and Global Expansion",
            "Summary": "Medi Assist is pursuing nationwide leadership in the Health Benefits Administration (HBA) sector through technology growth and global expansion initiatives. The company is focusing on building key insurance partnerships while maintaining competitive margins amid rising premiums. The strategy includes implementing fraud reduction innovations as part of their growth plan.",
            "Sentiment": "positive",
            "PublishDate": 1754579167525,
            "Source": "stock"
        },
        {
            "Title": "Medi Assist Healthcare Services Reports Strong Growth in Key Performance Indicators",
            "Summary": "Medi Assist Healthcare Services Limited disclosed its Key Performance Indicators showing significant growth across multiple metrics. Revenue from contracts with customers increased to ₹1,905.58 million from ₹1,677.06 million year-over-year. Adjusted EBITDA rose to ₹420.12 million from ₹352.22 million, with the margin improving to 22.05% from 21.00%. Profit from continuing operations grew to ₹226.31 million from ₹190.70 million, while PAT margin increased to 11.43% from 11.03%. Net worth expanded to ₹5,773.91 million from ₹5,031.63 million. Premium Under Management reached ₹70,756 million compared to ₹59,688 million in the previous period. Return on Capital Employed improved to 21.03% from 18.33%, and annualised revenue per average headcount on non-government contracts increased to ₹1.49 million from ₹1.34 million.",
            "Sentiment": "positive",
            "PublishDate": 1754567658356,
            "Source": "stock"
        },
        {
            "Title": "Medi Assist Healthcare Services Approves Rs 198 Crore Fundraise Through Preferential Allotment",
            "Summary": "Medi Assist Healthcare Services Limited's board approved raising funds of up to Rs 1,980,035,000 through preferential allotment of up to 3,701,000 equity shares at Rs 535 per share. The investors are Massachusetts Institute of Technology and 238 Plan Associates LLC, both qualified institutional buyers. Massachusetts Institute of Technology will receive 2,890,830 shares (3.86% post-allotment stake) while 238 Plan Associates LLC will get 810,170 shares (1.08% post-allotment stake). The equity shares have a face value of Rs 5 each with a premium of Rs 530. The board also approved convening an extraordinary general meeting to seek shareholder approval for this preferential issue. A Fund Raise Committee has been constituted to handle all matters related to the fundraising and share allotment.",
            "Sentiment": "positive",
            "PublishDate": 1754566630147,
            "Source": "corporate_action"
        },
        {
            "Title": "Medi Assist Healthcare Reports Strong Q1 Growth with 19% Revenue Increase",
            "Summary": "Medi Assist Healthcare delivered strong quarterly performance with consolidated net profit rising to 224 million rupees from 188 million rupees year-over-year. Revenue grew to 1.91 billion rupees compared to 1.7 billion rupees in the same period last year. EBITDA increased to 341 million rupees from 292 million rupees year-over-year, while EBITDA margin improved to 17.91% from 17.44%.",
            "Sentiment": "positive",
            "PublishDate": 1754564111017,
            "Source": "earnings"
        },
        {
            "Title": "Medi Assist Healthcare Services: Subsidiary Completes Acquisition of Paramount TPA",
            "Summary": "Medi Assist Insurance TPA, a subsidiary of Medi Assist Healthcare Services, has completed its acquisition of Paramount Health Services & Insurance TPA on July 1, 2025. This adds ₹4,000 crore of health premiums under administration to Medi Assist's portfolio, strengthening its position as India's largest health benefits administrator.",
            "Sentiment": "positive",
            "PublishDate": 1751457538000,
            "Source": "corporate_action"
        },
        {
            "Title": "Star Health & Allied Insurance Partners with Medi Assist for AI-Powered Claims Management",
            "Summary": "Star Health & Allied Insurance has collaborated with Medi Assist Healthcare to launch 'Matrix,' an AI-powered complete claims management system. This partnership aims to enhance the efficiency of claims processing using artificial intelligence technology.",
            "Sentiment": "positive",
            "PublishDate": 1750816946000,
            "Source": "default"
        },
        {
            "Title": "Medi Assist Healthcare Services: Profit Rises 28.5% in FY2025",
            "Summary": "Medi Assist Healthcare Services reported a 28.5% YoY increase in FY2025 profit to ₹91.6 crore, with 14% revenue growth to ₹723.3 crore. Total premium under management rose 14.3% to ₹21,108 crore. The company received IRDAI approval to acquire Paramount Health Services & Insurance TPA Pvt. Ltd.",
            "Sentiment": "positive",
            "PublishDate": 1747373697000,
            "Source": "earnings"
        },
        {
            "Title": "Medi Assist Healthcare Reports Q4 Financial Results",
            "Summary": "Medi Assist Healthcare has released its Q4 financial results. The company reported an EBITDA of 407.4 million rupees, up from 370 million rupees year-over-year. However, the EBITDA margin decreased to 21.57% from 22.19% in the same period last year. Revenue increased to 1.89 billion rupees from 1.67 billion rupees year-over-year. The consolidated net profit for Q4 was 215 million rupees, down from 251 million rupees year-over-year but up from 295.3 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747322671000,
            "Source": "result"
        },
        {
            "Title": "IRDAI Approves Medi Assist's Acquisition of Paramount Health Services",
            "Summary": "Medi Assist Healthcare Services has announced that the Insurance Regulatory and Development Authority of India (IRDAI) has approved its acquisition of Paramount Health Services & Insurance TPA. This approval marks a significant corporate action in the healthcare services sector.",
            "Sentiment": "positive",
            "PublishDate": 1747138466000,
            "Source": "default"
        },
        {
            "Title": "Medi Assist Healthcare Services Announces Dissolution of Mayfair Group Holding Subcontinent Limited",
            "Summary": "Medi Assist Healthcare Services has reported that Mayfair Group Holding Subcontinent Limited, a related entity, has been dissolved. This corporate action may have implications for the company's structure or operations, though specific details are not provided in the brief announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1741739460000,
            "Source": "corporate_action"
        },
        {
            "Title": "Medi Assist Healthcare Services Announces Dissolution of Mayfair Group Holding Subcontinent Limited",
            "Summary": "Medi Assist Healthcare Services has reported that Mayfair Group Holding Subcontinent Limited, likely a subsidiary or affiliated entity, has been dissolved.",
            "Sentiment": "neutral",
            "PublishDate": 1741693045000,
            "Source": "corporate_action"
        },
        {
            "Title": "Medi Assist Healthcare Reports Q3 Financial Results and Approves Fund Raising",
            "Summary": "Medi Assist Healthcare announced its Q3 consolidated net profit of 295 million rupees, up from 205 million rupees year-over-year and 210 million rupees quarter-over-quarter. The company's Q3 revenue reached 1.86 billion rupees, compared to 1.7 billion rupees in the previous year. Additionally, the company has approved a fund raising of up to 3.50 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738801188000,
            "Source": "earnings"
        },
        {
            "Title": "Medi Assist Healthcare Services Approves Fund Raising of Up to 3.50 Billion Rupees",
            "Summary": "Medi Assist Healthcare Services has approved a fund raising initiative of up to 3.50 billion rupees. This decision indicates the company's intent to secure additional capital, potentially for expansion, debt reduction, or other strategic purposes.",
            "Sentiment": "positive",
            "PublishDate": 1738768812000,
            "Source": "corporate_action"
        },
        {
            "Title": "Medi Assist Healthcare Reports Improved Q3 EBITDA and Margin",
            "Summary": "Medi Assist Healthcare has reported a year-over-year increase in its Q3 EBITDA, rising from 339 million rupees to 397 million rupees. The company's EBITDA margin also improved, increasing from 20.42% to 21.34% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738768715000,
            "Source": "earnings"
        },
        {
            "Title": "Medi Assist Healthcare Reports Strong Q3 Financial Performance",
            "Summary": "Medi Assist Healthcare has announced its Q3 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit increased to 295 million rupees, up from 205 million rupees in the same quarter last year and 210 million rupees in the previous quarter. Revenue also saw growth, reaching 1.86 billion rupees compared to 1.7 billion rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1738768625000,
            "Source": "earnings"
        },
        {
            "Title": "Medi Assist Healthcare Services Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade occurred for Medi Assist Healthcare Services Ltd. on the National Stock Exchange (NSE). Approximately 729,038 shares were traded at a price of Rs. 591.95 per share, totaling Rs. 43.16 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1733206124000,
            "Source": "block_deals"
        },
        {
            "Title": "Medi Assist: Hiring Slowdown Impacts Health Insurance Growth",
            "Summary": "Medi Assist CEO reports group premium growth of 11% in H1 FY24, the lowest in years due to slow corporate hiring. Company's premium under management grew 18.1% YoY to ₹10,583 crore. Operating revenue increased 15.4% YoY to ₹348.5 crore, with net profit up 65% to ₹40 crore. Medi Assist is acquiring Paramount TPA for ₹312 crore, awaiting regulatory approval.",
            "Sentiment": "neutral",
            "PublishDate": 1731603801000,
            "Source": "normal_news"
        },
        {
            "Title": "Medi Assist Healthcare Services Reports Q2 EBITDA Decline",
            "Summary": "Medi Assist Healthcare Services has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 384 million rupees from 398 million rupees year-over-year. Additionally, the EBITDA margin dropped to 21.24% from 23.73% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731576821000,
            "Source": "result"
        },
        {
            "Title": "Medi Assist Healthcare Services Reports Q2 Revenue Growth",
            "Summary": "Medi Assist Healthcare Services has reported a revenue of 1.8 billion rupees for the second quarter, compared to 1.6 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731576421000,
            "Source": "result"
        },
        {
            "Title": "Medi Assist Healthcare Services Reports Significant Profit Growth in Q2",
            "Summary": "Medi Assist Healthcare Services has reported a substantial increase in net profit for the second quarter. The company's net profit rose to 210 million rupees, compared to 36 million rupees in the same period last year, representing a nearly six-fold increase year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731576233000,
            "Source": "result"
        }
    ]
}