{
    "Symbol": "MEDPLUS",
    "ISIN": "INE804L01022",
    "News": [
        {
            "Title": "MedPlus subsidiary faces drug license suspension",
            "Summary": "MedPlus Health Services subsidiary Optival Health Solutions receives 15-day drug license suspension for Maharashtra store, potentially impacting revenue by Rs 6.27 lacs.",
            "Sentiment": "negative",
            "PublishDate": 1770209888500,
            "Source": "stocks"
        },
        {
            "Title": "MedPlus Subsidiary Faces Drug License Suspension",
            "Summary": "MedPlus Health Services subsidiary Optival Health Solutions receives 25-day drug license suspension for Maharashtra store, potentially impacting revenue by Rs 7.53 lacs under regulatory violation.",
            "Sentiment": "negative",
            "PublishDate": 1769884229105,
            "Source": "stocks"
        },
        {
            "Title": "MedPlus Allots 2.32 Lakh Shares Under ESOP 2021",
            "Summary": "MedPlus Health Services allotted 2,32,061 equity shares to employees under ESOP 2021 scheme on January 30, 2026, increasing paid-up share capital to ₹24.01 crore with shares exercised at ₹628 and ₹232 per share.",
            "Sentiment": "positive",
            "PublishDate": 1769798814951,
            "Source": "co_actions_results"
        },
        {
            "Title": "MedPlus Health Services Q3FY26 Results",
            "Summary": "MedPlus Health Services reported strong Q3FY26 performance with consolidated revenue of ₹18,061.18 million, up 15.67% YoY, and net profit of ₹577.88 million, marking 26.00% growth compared to Q3FY25.",
            "Sentiment": "positive",
            "PublishDate": 1769778184366,
            "Source": "co_actions_results"
        },
        {
            "Title": "MedPlus Subsidiary Faces Drug License Suspension",
            "Summary": "MedPlus Health Services subsidiary Optival Health Solutions receives one-day drug license suspension for Telangana store, resulting in potential revenue loss of Rs 0.20 lacs.",
            "Sentiment": "negative",
            "PublishDate": 1769774675085,
            "Source": "stocks"
        },
        {
            "Title": "MedPlus Health Services Q3FY26 Earnings Call Feb 2",
            "Summary": "MedPlus Health Services announces earnings call on February 02, 2026 at 4:00 PM IST to discuss Q3FY26 financial results for quarter ended December 31, 2025 under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769083560034,
            "Source": "co_actions_results"
        },
        {
            "Title": "MedPlus subsidiary faces drug license suspensions",
            "Summary": "MedPlus Health Services subsidiary Optival Health Solutions receives six drug license suspension orders across Karnataka and Telangana stores, with potential revenue loss of ₹6.98 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1768318985436,
            "Source": "stocks"
        },
        {
            "Title": "MedPlus subsidiary faces drug license suspension",
            "Summary": "MedPlus Health Services subsidiary Optival Health Solutions receives one-day drug license suspension for Karnataka store, resulting in potential revenue loss of ₹0.23 lacs.",
            "Sentiment": "negative",
            "PublishDate": 1767457771719,
            "Source": "stocks"
        },
        {
            "Title": "MedPlus subsidiary faces 7-day drug license suspension",
            "Summary": "MedPlus Health Services subsidiary Optival Health Solutions receives suspension order for Andhra Pradesh store under Drugs and Cosmetics Act, with potential revenue loss of ₹2.10 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1767258989716,
            "Source": "stocks"
        },
        {
            "Title": "Medplus Health Services Subsidiary Faces License Issue",
            "Summary": "Medplus Health Services subsidiary encounters drug license suspension in Andhra Pradesh, with company projecting minimal revenue impact of ₹2.10 lakhs from the regulatory action.",
            "Sentiment": "negative",
            "PublishDate": 1767258747296,
            "Source": "stocks"
        },
        {
            "Title": "MedPlus Subsidiary Faces Drug License Suspension",
            "Summary": "MedPlus Health Services subsidiary Optival Health Solutions receives one-day drug license suspension for Telangana store, resulting in potential revenue loss of ₹1.19 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1767177422643,
            "Source": "stocks"
        },
        {
            "Title": "Medplus Health Services: Share Pledge Release",
            "Summary": "Catalyst Trusteeship releases 41.72 lakh pledged equity shares of Medplus Health Services, reducing encumbrance from 9.01% to 5.53% of total share capital on December 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767018134383,
            "Source": "co_actions_results"
        },
        {
            "Title": "MedPlus Subsidiary Faces Drug License Suspensions",
            "Summary": "MedPlus Health Services subsidiary Optival Health Solutions receives suspension orders for three stores in Karnataka with potential revenue loss of ₹3.24 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1766585540045,
            "Source": "stocks"
        },
        {
            "Title": "MedPlus Subsidiary Faces Drug License Suspension",
            "Summary": "MedPlus Health Services subsidiary Optival Health Solutions receives 10-day drug license suspension for Maharashtra store, resulting in potential revenue loss of ₹2.00 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1766231938209,
            "Source": "stocks"
        },
        {
            "Title": "MedPlus Releases 41.72 Lakh Pledged Shares Worth ₹334 Cr",
            "Summary": "Agilemed Investments released 41.72 lakh pledged shares of MedPlus following debt repayment, reducing promoter pledge level from 13.06% to 9.58% of total share capital.",
            "Sentiment": "positive",
            "PublishDate": 1766070036855,
            "Source": "co_actions_results"
        },
        {
            "Title": "MedPlus Subsidiary Faces Drug License Suspensions",
            "Summary": "MedPlus Health Services subsidiary Optival Health Solutions receives three drug license suspension orders for Maharashtra stores, with potential revenue loss of ₹10.17 lakhs across affected locations.",
            "Sentiment": "negative",
            "PublishDate": 1765704253242,
            "Source": "stocks"
        },
        {
            "Title": "MedPlus Subsidiary Faces Drug License Suspension",
            "Summary": "MedPlus Health Services subsidiary Optival Health Solutions receives 5-day drug license suspension for Karnataka store, resulting in potential revenue loss of ₹2.40 lacs.",
            "Sentiment": "negative",
            "PublishDate": 1765458280716,
            "Source": "stocks"
        },
        {
            "Title": "MedPlus subsidiary wins High Court case on tax dispute",
            "Summary": "MedPlus Health Services' subsidiary Optival Health Solutions received favorable High Court order on disputed tax amount of ₹43.45 crores for Assessment Year 2020-21, with no financial impact on operations.",
            "Sentiment": "positive",
            "PublishDate": 1765457438272,
            "Source": "stocks"
        },
        {
            "Title": "MedPlus Unit Receives Favorable Court Ruling in Telangana",
            "Summary": "MedPlus Health Services announces that its company unit has received a positive ruling from a court in Telangana, though specific details of the case remain undisclosed.",
            "Sentiment": "positive",
            "PublishDate": 1765457213470,
            "Source": "stocks"
        },
        {
            "Title": "MedPlus Subsidiary Faces Drug License Suspension",
            "Summary": "MedPlus Health Services subsidiary Optival Health Solutions receives one-day drug license suspension for Karnataka store, resulting in potential revenue loss of ₹0.58 lacs.",
            "Sentiment": "negative",
            "PublishDate": 1765379211112,
            "Source": "stocks"
        },
        {
            "Title": "MedPlus Subsidiary Receives Drug License Suspension Order in Telangana",
            "Summary": "Optival Health Solutions Private Limited, a subsidiary of MedPlus Health Services Limited, received a suspension order for a drug license at its store in Telangana for two days under the Drugs and Cosmetics Act. The suspension resulted in a potential revenue loss of Rs 0.87 lacs for the pharmacy chain operator.",
            "Sentiment": "negative",
            "PublishDate": 1765105641131,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Subsidiary Receives Drug License Suspension Order in Maharashtra",
            "Summary": "Optival Health Solutions Private Limited, a subsidiary of MedPlus Health Services Limited, received a suspension order for a drug license at its Charai-Thane store for fifteen days under the Drugs and Cosmetics Act. The suspension is expected to result in a potential revenue loss of Rs 6.00 lacs for the healthcare company.",
            "Sentiment": "negative",
            "PublishDate": 1764849762327,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Subsidiary Faces Drug License Suspension in Telangana",
            "Summary": "Optival Health Solutions Private Limited, a subsidiary of MedPlus Health Services Limited, received a suspension order for its drug license at a store in Medipally Uppal, Telangana for two days under the Drugs and Cosmetics Act. The suspension resulted in a potential revenue loss of Rs 1.43 lacs for the pharmacy chain operator.",
            "Sentiment": "negative",
            "PublishDate": 1764526893427,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Subsidiary Receives Drug License Suspension Order in Telangana",
            "Summary": "Optival Health Solutions Private Limited, a subsidiary of MedPlus Health Services Limited, received a two-day drug license suspension order for its store in Medchal, Telangana under the Drugs and Cosmetics Act. The suspension could result in a potential revenue loss of Rs 1.31 lacs for the pharmaceutical retail chain.",
            "Sentiment": "negative",
            "PublishDate": 1764248395057,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Subsidiary Receives Drug License Suspension Order in Telangana",
            "Summary": "Optival Health Solutions Private Limited, a subsidiary of MedPlus Health Services Limited, received a suspension order for a drug license at its Nizamabad, Telangana store for two days under the Drugs and Cosmetics Act. The suspension could result in a potential revenue loss of Rs 0.72 lacs for the pharmacy chain operator.",
            "Sentiment": "negative",
            "PublishDate": 1764076141667,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Subsidiary Receives Drug License Suspension Order in Karnataka",
            "Summary": "Optival Health Solutions Private Limited, a subsidiary of MedPlus Health Services Limited, received a one-day drug license suspension order for its store in Alnavara, Karnataka under the Drugs and Cosmetics Act. The suspension could result in a potential revenue loss of Rs 0.33 lacs for the pharmacy chain operator.",
            "Sentiment": "negative",
            "PublishDate": 1763816374404,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Subsidiary Faces Drug License Suspension in Karnataka",
            "Summary": "Optival Health Solutions Private Limited, a subsidiary of MedPlus Health Services Limited, received a three-day suspension order for its drug license at a store located on Victoria Road, Hubli, Karnataka. The suspension under the Drugs and Cosmetics Act could result in a potential revenue loss of Rs 1.08 lacs for the pharmacy chain operator.",
            "Sentiment": "negative",
            "PublishDate": 1763467393093,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Health Services Unit Faces Drug License Suspension in Andhra Pradesh",
            "Summary": "MedPlus Health Services has experienced a drug license suspension affecting one of its units in Andhra Pradesh.",
            "Sentiment": "negative",
            "PublishDate": 1762951565135,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Subsidiary Receives Three-Day Drug License Suspension in Telangana",
            "Summary": "MedPlus Health Services Limited disclosed that its subsidiary, Optival Health Solutions Private Limited, received a suspension order for a drug license at a store located at Nagole X Roads, Shameerpet, Telangana. The Assistant Director of Drugs Control Administration, Telangana issued the three-day suspension under Rule 65 of the Drugs and Cosmetics Act, 1940 and Drugs and Cosmetics Rules, 1945. The company estimates a potential revenue loss of Rs 1.73 lacs due to this suspension.",
            "Sentiment": "negative",
            "PublishDate": 1762680704741,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Reports 6.3% Revenue Growth and 5.3% EBITDA Margin in Q2 FY26",
            "Summary": "MedPlus Health Services reported consolidated revenue of INR 16,793 million for Q2 FY26, with consolidated operating EBITDA at INR 887 million representing 5.3% margin. The pharmacy operations grew 6.3% year-on-year on net basis and 8.8% on GMV basis. The company added 145 new stores during the quarter, achieving net addition of 117 stores compared to 101 in the previous quarter, bringing total network to 4,930 stores. Private label sales constituted 21.5% of total revenues, with pharma at 12.1% and non-pharma at 9.6%. Stores older than 12 months generated INR 15,338 million revenue with 11.8% store-level EBITDA margin and 68.6% store-level operating ROCE. The diagnostics segment recorded revenue of INR 332.5 million with 15.3% operating EBITDA margin. The company maintains its outlook for adding 600 new stores in fiscal 2026 and expects same-store sales growth to reach high single digits of 9-10% over the next two years.",
            "Sentiment": "positive",
            "PublishDate": 1762480726838,
            "Source": "earnings"
        },
        {
            "Title": "Medplus Health Services Reports 43% Jump in Quarterly Net Profit to 555 Million Rupees",
            "Summary": "Medplus Health Services reported quarterly net profit of 555 million rupees compared to 387 million rupees in the same period last year. Revenue increased to 16.79 billion rupees from 15.76 billion rupees year-on-year. EBITDA rose to 1.5 billion rupees from 1.24 billion rupees, while EBITDA margin improved to 8.86% from 7.89% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762128843409,
            "Source": "earnings"
        },
        {
            "Title": "MedPlus Subsidiary Receives Drug License Suspension Order in Maharashtra",
            "Summary": "MedPlus Health Services Limited disclosed that its subsidiary, Optival Health Solutions Private Limited, received a suspension order for a drug license of a store located in Shanti Nagar, Nagpur, Maharashtra. The suspension is for twenty-one days and was issued by the Assistant Commissioner Licensing Authority, Food Drug Administration, Maharashtra, Nagpur. The order was received on November 1, 2025, under Rule 65 of Drugs and Cosmetics Act, 1940 and Drugs and Cosmetics Rules, 1945. The company estimates a potential revenue loss of Rs 4.34 lacs due to this suspension.",
            "Sentiment": "negative",
            "PublishDate": 1762071693927,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Health Services Receives Stay Orders Against Suspension in Maharashtra",
            "Summary": "MedPlus Health Services Limited has received two stay orders against a suspension from authorities in Nagpur and Amravati, Maharashtra. The company referenced earlier submissions made on August 6, 2025 and August 14, 2025 regarding the suspension matter. The stay orders will be made available on the company's website and stock exchange websites.",
            "Sentiment": "positive",
            "PublishDate": 1762003171368,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Subsidiary Faces Drug License Suspension in Andhra Pradesh",
            "Summary": "MedPlus Health Services Limited announced that its subsidiary, Optival Health Solutions Private Limited, received a suspension order for a drug license at a store in Rajamahendravaram, E.G District, Andhra Pradesh. The Assistant Director of District sales licensing Authority issued a seven-day suspension under Rule 65 of Drugs and Cosmetics Act, 1940 and Drugs and Cosmetics Rules, 1945. The company estimates a potential revenue loss of Rs 1.75 lacs due to this suspension.",
            "Sentiment": "negative",
            "PublishDate": 1762002815688,
            "Source": "stock"
        },
        {
            "Title": "Medplus Health Services Plans Aggressive Expansion with 120-150 New Stores Quarterly",
            "Summary": "Medplus Health Services announced plans to accelerate cluster-based expansion beyond Tier-1 cities, targeting the addition of approximately 120-150 stores quarterly. The company aims to increase its private-label product mix across both pharmaceutical and FMCG categories. The expansion strategy includes deepening omni-channel capabilities with delivery services in under 2 hours and implementing technology-driven efficiency measures to achieve profitable scale.",
            "Sentiment": "positive",
            "PublishDate": 1761922527808,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Health Services Reports Strong Q2 Growth with 43% Jump in Net Profit",
            "Summary": "MedPlus Health Services delivered robust quarterly performance with consolidated net profit rising to 555 million rupees from 387 million rupees year-over-year. Revenue increased to 16.79 billion rupees compared to 15.76 billion rupees in the same period last year. The company's EBITDA grew to 1.5 billion rupees from 1.24 billion rupees, while EBITDA margin improved to 8.86% from 7.89% year-over-year, indicating enhanced operational efficiency alongside revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1761911960477,
            "Source": "earnings"
        },
        {
            "Title": "MedPlus Subsidiary Faces Drug License Suspensions at Two Store Locations",
            "Summary": "MedPlus Health Services Limited disclosed that its subsidiary Optival Health Solutions Private Limited received two drug license suspension orders. The Assistant Director of Drugs Control Administration in Vijayapura, Karnataka suspended the license for five days at a store on Bus stand Road, while the Khammam, Telangana authority suspended the license for three days at a store on Bus station road Thorrur. Both suspensions were issued under Rule 65 of the Drugs and Cosmetics Act, 1940 and Drugs and Cosmetics Rules, 1945. The company estimates potential revenue losses of Rs 1.12 lacs for the Vijayapura store and Rs 0.39 lacs for the Telangana store.",
            "Sentiment": "negative",
            "PublishDate": 1761402979646,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Subsidiary Faces Drug License Suspensions at Two Karnataka Stores",
            "Summary": "MedPlus Health Services Limited disclosed that its subsidiary, Optival Health Solutions Private Limited, received suspension orders for drug licenses at two store locations in Karnataka. The Assistant Director of Drugs Control Administration suspended the license for five days at the Vijayapura store and one day at the Rajarajeshwari Nagar store. The suspensions were issued under Rule 65 of the Drugs and Cosmetics Act, 1940 and Drugs and Cosmetics Rules, 1945. The company estimates potential revenue losses of approximately Rs. 1.12 lakhs for the Vijayapura store and Rs. 1.71 lakhs for the Rajarajeshwari Nagar store.",
            "Sentiment": "negative",
            "PublishDate": 1761139331726,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Subsidiary Faces Drug License Suspensions at Two Telangana Stores",
            "Summary": "MedPlus Health Services Limited announced that its subsidiary Optival Health Solutions Private Limited received suspension orders for drug licenses at two stores in Telangana. The Assistant Director of Drugs Control Administration, Medchal issued the suspensions for two and five days respectively at stores located in Balanagar Ground Floor and 3rd Phase Kphb. The suspensions were imposed for violations under Rule 65 of the Drugs and Cosmetics Act, 1940 and Drugs and Cosmetics Rules, 1945. The company estimates potential revenue losses of approximately Rs. 0.48 lacs and Rs. 1.28 lacs for the affected stores respectively.",
            "Sentiment": "negative",
            "PublishDate": 1761073726311,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Subsidiary Faces Drug License Suspensions at Two Telangana Stores",
            "Summary": "MedPlus Health Services Limited's subsidiary, Optival Health Solutions Private Limited, received suspension orders for drug licenses at two stores in Telangana. The suspensions, lasting two and five days respectively, were issued by the Assistant Director of Drugs Control Administration for violations under the Drugs and Cosmetics Act. The affected stores are located at Balanagar Ground Floor and 3rd Phase Kphb. The company estimates potential revenue losses of approximately Rs. 0.48 lacs and Rs. 1.28 lacs for the respective stores.",
            "Sentiment": "negative",
            "PublishDate": 1760894223309,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Subsidiary Faces 3-Day Drug License Suspension in Telangana",
            "Summary": "Optival Health Solutions Private Limited, a subsidiary of MedPlus Health Services Limited, received a three-day suspension order for its drug license at a store located in Kapra Saket, Telangana. The suspension was issued by the Assistant Director of Drugs Control Administration, Quthubullapur, Telangana, under Rule 65 of the Drugs and Cosmetics Act, 1940 and Drugs and Cosmetics Rules, 1945. The order was received on October 14, 2025. The company estimates a potential revenue loss of approximately Rs. 0.22 lacs due to this suspension.",
            "Sentiment": "negative",
            "PublishDate": 1760534835332,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Subsidiary Faces 7-Day Drug License Suspension in Andhra Pradesh",
            "Summary": "Optival Health Solutions Private Limited, a subsidiary of MedPlus Health Services Limited, received a seven-day suspension order for its drug license at a store located in Devi Chowk, Andhra Pradesh. The suspension was issued by the Assistant Director, District Sales Licensing Authority, Drugs Control Administration, Rajamahendravaram, E.G District under Rule 65 of Drugs and Cosmetics Act, 1940 and Drugs and Cosmetics Rules, 1945. The order was received on October 13, 2025. The company estimates a potential revenue loss of approximately Rs. 1.75 lakhs due to this suspension.",
            "Sentiment": "negative",
            "PublishDate": 1760445399875,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Subsidiary Faces 15-Day Drug License Suspension in Karnataka",
            "Summary": "MedPlus Health Services Limited's subsidiary, Optival Health Solutions Private Limited, received a suspension order for its drug license at a store located on MG Road, Chikkamagalore, Karnataka. The Assistant Director of Drugs Control Administration suspended the license for 15 days under Rule 65 of the Drugs and Cosmetics Act, 1940 and Drugs and Cosmetics Rules, 1945. The suspension could result in a potential revenue loss of approximately Rs. 10.15 lacs for the company.",
            "Sentiment": "negative",
            "PublishDate": 1760174273544,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Subsidiary Faces Drug License Suspensions at Two Store Locations",
            "Summary": "MedPlus Health Services Limited disclosed that its subsidiary, Optival Health Solutions Private Limited, received suspension orders for drug licenses at two store locations. The Assistant Director of Drugs Control Administration in Karnataka suspended the license for a store in Malavalli for five days, while authorities in Telangana suspended the license for a store in Suryapet for three days. The suspensions were issued under Rule 65 of the Drugs and Cosmetics Act, 1940 and Drugs and Cosmetics Rules, 1945. The company estimates potential revenue losses of approximately Rs. 0.96 lacs for the Karnataka store and Rs. 1.01 lacs for the Telangana store.",
            "Sentiment": "negative",
            "PublishDate": 1759057593969,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Subsidiary Faces 15-Day Drug License Suspension in Maharashtra",
            "Summary": "Optival Health Solutions Private Limited, a subsidiary of MedPlus Health Services Limited, received a suspension order for its drug license at a store in Vishwakarma Nagar, Nagpur, Maharashtra. The Assistant Commissioner & Licensing Authority of Food & Drug Administration, Nagpur issued the 15-day suspension order under Rule 65 of the Drugs and Cosmetics Act, 1940 and Drugs and Cosmetics Rules, 1945. The company estimates a potential revenue loss of approximately Rs. 2.29 lakhs due to this suspension.",
            "Sentiment": "negative",
            "PublishDate": 1758804486277,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Subsidiary Faces 7-Day Drug License Suspension in Andhra Pradesh",
            "Summary": "Optival Health Solutions Private Limited, a subsidiary of MedPlus Health Services Limited, received a seven-day suspension order for its Drug License for a store located on Kalyanadurgham Road in Andhra Pradesh. The suspension was issued by the Assistant Director, District Sales Licensing Authority, Drugs Control Administration, Ananthapuramu Zone-I under Rule 65 of the Drugs and Cosmetics Act, 1940 and Drugs and Cosmetics Rules, 1945. The order was received on September 21, 2025, and is expected to result in a potential revenue loss of approximately Rs. 1.48 lakhs for the company.",
            "Sentiment": "negative",
            "PublishDate": 1758549323398,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Subsidiary Faces Drug License Suspensions at Two Stores, Revenue Impact Rs 5.39 Lakhs",
            "Summary": "Optival Health Solutions Private Limited, a subsidiary of MedPlus Health Services Limited, received suspension orders for drug licenses at two store locations. The Assistant Director of Drugs Control Administration in Karnataka suspended the license for three days at a store in Fort Main Road Old Hubli, resulting in potential revenue loss of Rs 0.79 lakhs. Additionally, the District Sales Licensing Authority in Andhra Pradesh suspended the license for ten days at a store in Venkataramana Colony Main Road, Kurnool District, with potential revenue loss of Rs 4.60 lakhs. Both suspensions were issued under Rule 65 of the Drugs and Cosmetics Act, 1940 and Drugs and Cosmetics Rules, 1945. The orders were received on September 18, 2025, with total potential revenue impact of approximately Rs 5.39 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1758286958507,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Subsidiary Faces Drug License Suspensions at Two Stores, Expects Rs 4.06 Lacs Revenue Loss",
            "Summary": "MedPlus Health Services Limited's subsidiary, Optival Health Solutions Private Limited, received suspension orders for drug licenses at two store locations. The Assistant Drugs Controller Bilaspur District in Chhattisgarh suspended the drug license for five days at a store in Swarnplaza, Bilaspur, with potential revenue loss of Rs 4.00 lacs. The Assistant Director, Drugs Control Administration, Mahabubnagar, Telangana suspended the drug license for four days at a store in Shankarayapally Jadcherla, with potential revenue loss of Rs 0.06 lacs. Both suspensions were issued under Rule 65 of Drugs and Cosmetics Act, 1940 and Drugs and Cosmetics Rules, 1945. The orders were received on September 17, 2025, with total potential revenue impact of approximately Rs 4.06 lacs.",
            "Sentiment": "negative",
            "PublishDate": 1758202022466,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Subsidiary Faces Drug License Suspensions at Two Telangana Stores",
            "Summary": "MedPlus Health Services Limited disclosed that its subsidiary, Optival Health Solutions Private Limited, received suspension orders for drug licenses at two stores in Telangana. The Assistant Director of Drugs Control Administration, Secunderabad issued the orders on September 8, 2025, suspending operations for one day at the West Marredpally Circle store and four days at the Vijayapuri Colony South Lalaguda Road store. The suspensions were imposed under Rule 65 of the Drugs and Cosmetics Act, 1940 and Drugs and Cosmetics Rules, 1945. The company estimates potential revenue losses of approximately Rs. 0.57 lakhs and Rs. 0.93 lakhs respectively from these suspensions.",
            "Sentiment": "negative",
            "PublishDate": 1757423166814,
            "Source": "stock"
        },
        {
            "Title": "MedPlus Subsidiary Faces Two-Day Drug License Suspension in Telangana",
            "Summary": "Optival Health Solutions Private Limited, a subsidiary of MedPlus Health Services Limited, received a two-day suspension order for its drug license at a store located in Boduppal Brundavan Colony, Telangana. The suspension was issued by the Assistant Director of Drugs Control Administration, Shameerpet, Telangana, due to violations under Rule 65 of the Drugs and Cosmetics Act, 1940 and Drugs and Cosmetics Rules, 1945. The company estimates a potential revenue loss of approximately Rs. 0.81 lacs from this suspension.",
            "Sentiment": "negative",
            "PublishDate": 1756992842917,
            "Source": "stock"
        }
    ]
}