{
    "Symbol": "MEGASTAR",
    "ISIN": "INE00EM01016",
    "News": [
        {
            "Title": "Megastar Foods COO Vipin Kumar Resigns",
            "Summary": "Megastar Foods Limited announces resignation of Chief Operating Officer Mr. Vipin Kumar effective February 6, 2026, citing personal commitments as reason for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1770398932006,
            "Source": "stocks"
        },
        {
            "Title": "Megastar Foods Q3FY26 Net Profit Jumps 530% YoY",
            "Summary": "Megastar Foods Limited reported strong Q3FY26 results with net profit rising 530% YoY to ₹306.94 lakhs. Revenue grew 59.4% to ₹14,121.35 lakhs, driven by robust operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1770299321832,
            "Source": "co_actions_results"
        },
        {
            "Title": "Megastar Foods Reports 53% Revenue Growth in Q2 FY26, Targets INR 500 Crores Annual Revenue",
            "Summary": "Megastar Foods Limited delivered strong quarterly results with revenue rising 53% YoY to INR 138 crores and EBITDA jumping 104% to INR 9.4 crores, driven by higher institutional customer demand and improved product mix. The wheat-based products manufacturer, serving clients like Nestle and ITC, projects 15% annual revenue growth with FY26 target of INR 500 crores while operating at 65% of its expanded 710 MT per day capacity.",
            "Sentiment": "positive",
            "PublishDate": 1763367866722,
            "Source": "earnings"
        },
        {
            "Title": "Megastar Foods Reports Strong Q2FY26 Performance with 28% Revenue Growth",
            "Summary": "Megastar Foods Limited released its investor presentation showing consolidated revenue from operations of Rs 13,797 lakhs in Q2FY26, up from Rs 10,734 lakhs in Q2FY25. EBITDA increased to Rs 941 lakhs from Rs 683 lakhs, while PAT grew to Rs 238 lakhs from Rs 162 lakhs in the same period. For the first half of FY26, revenue reached Rs 24,530 lakhs compared to Rs 14,693 lakhs in the previous year. The company operates a state-of-the-art refined flour processing facility in Rupnagar, Punjab, with processing capacity of 710 MT/day and in-house wheat storage capacity of 50,000 MT. Megastar Foods serves leading MNC clients including Nestle, Mrs. Bector, Jubilant, and ITC. The company's product range includes refined wheat flour (70% of revenue), organic wheat flour (14%), and wheat flour products (8%). The presentation highlights the company's certifications including FSSAI, Halal, BRC GS, and SEDEX compliance.",
            "Sentiment": "positive",
            "PublishDate": 1762896435151,
            "Source": "stock"
        },
        {
            "Title": "Megastar Foods Reports Quarterly Financial Results for September 2025",
            "Summary": "Megastar Foods Limited announced its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The Board of Directors approved these results during their meeting on November 10, 2025. The results were reviewed by the Audit Committee and include limited review reports from statutory auditors Nitin Mahajan Associates. The company's standalone revenue from operations was Rs. 5,311.74 lakhs for the quarter, with total income of Rs. 5,314.32 lakhs. The consolidated revenue from operations stood at Rs. 5,373.58 lakhs for the quarter. The financial statements show the company's performance across various operational metrics including expenses, profit margins, and cash flow positions.",
            "Sentiment": "neutral",
            "PublishDate": 1762791359982,
            "Source": "earnings"
        },
        {
            "Title": "Megastar Foods Clarifies Recent Share Price Movement as Market-Driven",
            "Summary": "Megastar Foods Limited responded to BSE's inquiry regarding price movement in its shares. The company stated it has made prompt disclosures of all events and price-sensitive information as required under SEBI regulations and has not withheld any material information. The company confirmed there is no undisclosed price-sensitive information or pending announcements that need to be communicated to exchanges. Megastar Foods attributed the share price movement to market forces and investor sentiment rather than any specific corporate developments.",
            "Sentiment": "neutral",
            "PublishDate": 1761983106764,
            "Source": "stock"
        },
        {
            "Title": "Megastar Foods Submits Investor Presentation Highlighting Growth in Wheat Flour Manufacturing",
            "Summary": "Megastar Foods Limited submitted an investor presentation to stock exchanges for shareholders and potential investors. The wheat flour manufacturer, founded in 1964 and listed on BSE SME platform in 2018 before migrating to the main board in 2022, operates the largest wheat flour processing capacity in North India at 710 MT/day from its Rupnagar, Punjab facility. The company reported Q1 FY2026 revenue of Rs. 107.34 crore with EBITDA of Rs. 6.80 crore and PAT of Rs. 1.62 crore. For FY2025, revenue grew 18.7% to Rs. 361.01 crore with EBITDA increasing 47.8% to Rs. 22.29 crore, though PAT declined 40% to Rs. 3.79 crore. Megastar produces maida (70% of revenue), atta (14%), and sooji/rawa (8%), serving multinational clients including Nestle, ITC, and Mrs. Bector. The company operates with 85% utilization in refined wheat flour capacity and has received certifications including FSSAI, Halal, and BRCGS. The Indian packaged atta market is projected to grow from Rs. 84 billion in 2024 to Rs. 256 billion by 2033 at 13.16% CAGR.",
            "Sentiment": "positive",
            "PublishDate": 1754981776246,
            "Source": "stock"
        },
        {
            "Title": "Megastar Foods Announces Q1 Financial Results and Sets AGM Date for September 2025",
            "Summary": "Megastar Foods Limited's Board of Directors approved the unaudited standalone and consolidated financial results for Q1 ended June 30, 2025, during a meeting held on August 6, 2025. The Audit Committee reviewed the results before board approval. The company scheduled its 14th Annual General Meeting for September 24, 2025, to be conducted via video conferencing. The Register of Members and Share Transfer Books will be closed from September 10-16, 2025, with the cut-off date for e-voting eligibility set as September 17, 2025. The financial results will be available on the company's website. The board meeting lasted from 11:00 AM to 3:00 PM.",
            "Sentiment": "neutral",
            "PublishDate": 1754474199024,
            "Source": "earnings"
        }
    ]
}