{
    "Symbol": "MEIL",
    "ISIN": "INE0PKD01011",
    "News": [
        {
            "Title": "Mangal Electrical COO Resigns Due to Personal Reasons",
            "Summary": "Mangal Electrical Industries announces resignation of Chief Operating Officer Mr. Shekhawat AnilKumar Gopal effective January 31, 2026, citing personal reasons for departure from the company.",
            "Sentiment": "neutral",
            "PublishDate": 1769873545444,
            "Source": "stocks"
        },
        {
            "Title": "Mangal Electrical Q3FY26 Net Profit Rises to ₹1,338.61 Lakhs",
            "Summary": "Mangal Electrical Industries reports Q3FY26 net profit of ₹1,338.61 lakhs with revenue from operations at ₹15,627.39 lakhs. Nine-month profit reaches ₹3,042.04 lakhs on revenue of ₹40,026.22 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1769603271264,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mangal Electrical Appoints Chief Legal Officer",
            "Summary": "Mangal Electrical Industries Limited announces appointment of Mr. Mohit Vyas as Chief Legal Officer effective January 1, 2026, bringing 14 years of corporate law expertise.",
            "Sentiment": "positive",
            "PublishDate": 1766496758635,
            "Source": "stocks"
        },
        {
            "Title": "Mangal Electrical Appoints New Company Secretary & CLO",
            "Summary": "Mangal Electrical Industries Limited announces key appointments of Naresh Kumar Sharma as Company Secretary and Mohit Vyas as Chief Legal Officer, strengthening senior management team.",
            "Sentiment": "positive",
            "PublishDate": 1766494014554,
            "Source": "stocks"
        },
        {
            "Title": "Mangal Electrical Industries Reports No Deviation in IPO Fund Utilization for Quarter Ended September 30, 2025",
            "Summary": "Mangal Electrical Industries Limited's monitoring agency CARE Ratings reported no material deviation from the stated objectives in the utilization of Rs. 400 crore IPO proceeds for the quarter ended September 30, 2025. The company has utilized Rs. 180.61 crore across various objectives including loan repayments (Rs. 75.32 crore), working capital requirements (Rs. 38.15 crore), general corporate purposes (Rs. 44.43 crore), capital expenditure (Rs. 0.27 crore), and issue-related expenses (Rs. 22.44 crore), with Rs. 219.39 crore remaining unutilized.",
            "Sentiment": "neutral",
            "PublishDate": 1763065587845,
            "Source": "stock"
        },
        {
            "Title": "Mangal Electrical Industries Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Mangal Electrical Industries reported quarterly net profit of 133 million rupees compared to 143 million rupees in the same period last year. Revenue increased to 1.54 billion rupees from 1.33 billion rupees year-over-year. EBITDA declined to 218.4 million rupees from 239.5 million rupees, while EBITDA margin compressed to 14.15% from 18.05% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762627954826,
            "Source": "earnings"
        },
        {
            "Title": "Mangal Electrical Industries Reports Q2 FY2026 Results Following Recent IPO Listing",
            "Summary": "Mangal Electrical Industries Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of Rs 15,432.85 lakhs for the quarter, compared to Rs 8,966.00 lakhs in the previous quarter. Profit for the quarter stood at Rs 1,358.06 lakhs versus Rs 1,773.35 lakhs in the prior quarter. The company completed its Initial Public Offering during the quarter, issuing 71,30,124 equity shares at Rs 561 per share (including premium of Rs 551), raising total proceeds of Rs 40,000.00 lakhs. From the IPO proceeds, Rs 18,061.16 lakhs have been utilized and Rs 21,938.84 lakhs remain unutilized. The company's equity shares were listed on NSE and BSE on August 28, 2025. Cash and cash equivalents increased significantly to Rs 10,318.80 lakhs from Rs 43.96 lakhs in the previous year, primarily due to IPO proceeds.",
            "Sentiment": "positive",
            "PublishDate": 1762594413831,
            "Source": "earnings"
        },
        {
            "Title": "Mangal Electrical Projects Strong Growth and Recovery Plans",
            "Summary": "Mangal Electrical has projected strong growth and is targeting recovery in H2FY26. The company's expansion strategy includes introducing new products, enhancing capacity, and making investments funded through its IPO proceeds.",
            "Sentiment": "positive",
            "PublishDate": 1758030140470,
            "Source": "stock"
        },
        {
            "Title": "Mangal Electrical Industries Appoints Ramkishan Bairwa as Chief Operating Officer (EPC)",
            "Summary": "Mangal Electrical Industries Limited appointed Mr. Ramkishan Bairwa as Chief Operating Officer (EPC) effective September 16, 2025. The appointment was approved by the Board of Directors based on the Nomination and Remuneration Committee's recommendation. Bairwa holds a Bachelor's Degree in Electrical Engineering from Delhi College of Engineering and a Graduate Diploma in Materials Management from Indian Institute of Material Management, Bangalore. He brings over 33 years of expertise in managing EPC contracts in Power Transmission & Distribution. Previously, he was associated with Alstom Systems Limited, Teracom Limited, Vindhya Telelinks Limited, and RAMA Prime Engineers & Construction Private Limited. He has not been debarred from holding office by SEBI or any other regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1758028389917,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mangal Electrical Industries Reports Mixed Q1 Results with Revenue Decline and Margin Improvement",
            "Summary": "Mangal Electrical Industries reported quarterly results showing EBITDA of 100 million rupees compared to 112 million rupees in the same period last year. The company's EBITDA margin improved to 11.12% from 9.82% year-over-year. Net profit declined to 37 million rupees from 55 million rupees in the previous year. Revenue decreased to 897 million rupees from 1.14 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1758027136453,
            "Source": "earnings"
        },
        {
            "Title": "Mangal Electrical Industries Reports Q1 Results with Revenue of Rs 8,966 Lakhs",
            "Summary": "Mangal Electrical Industries Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 8,966 lakhs compared to Rs 15,303.23 lakhs in the previous quarter. Net profit for the quarter was Rs 373.27 lakhs, down from Rs 1,393.03 lakhs in the prior quarter. Earnings per share stood at Rs 1.82 for the quarter. The company completed its IPO after the quarter ended, issuing 71,30,124 equity shares at Rs 561 per share (including premium of Rs 551), raising Rs 713.01 lakhs. The shares were listed on NSE and BSE on August 28, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758027040695,
            "Source": "earnings"
        },
        {
            "Title": "Mangal Electrical Industries Appoints Balvinder Singh Guleri as Company Secretary and Compliance Officer",
            "Summary": "Mangal Electrical Industries Limited appointed Mr. Balvinder Singh Guleri as Company Secretary and Compliance Officer effective December 22, 2024. Guleri is an associate member of The Institute of Company Secretaries of India and holds a bachelor's degree in commerce from the University of Rajasthan. He has over 9 years of experience in secretarial roles and was associated with H.G. Infra Engineering Limited, Gurgaon Sohna Highway Private Limited, and Continental Petroleums Limited. He is responsible for ensuring corporate secretarial compliance functions at the company. The company's shares were listed on stock exchanges on August 28, 2025, with BSE scrip code 544492 and NSE symbol MEIL.",
            "Sentiment": "neutral",
            "PublishDate": 1756394090563,
            "Source": "corporate_governance"
        }
    ]
}