{
    "Symbol": "MENONBE",
    "ISIN": "INE071D01033",
    "News": [
        {
            "Title": "Menon Bearings Q3 Net Profit Surges 90% YoY to ₹78m",
            "Summary": "Menon Bearings reports strong Q3 performance with net profit jumping 90% to ₹78 million, revenue growing 46% to ₹572 million, and EBITDA margin expanding to 20.75%.",
            "Sentiment": "positive",
            "PublishDate": 1768522631111,
            "Source": "co_actions_results"
        },
        {
            "Title": "Menon Bearings Q3 EBITDA Surges 78% YoY to ₹119M",
            "Summary": "Menon Bearings reported Q3 EBITDA of ₹119M vs ₹67M YoY, with EBITDA margin improving to 20.75% from 17.15%. Strong operational performance drives profitability growth.",
            "Sentiment": "positive",
            "PublishDate": 1768460941083,
            "Source": "co_actions_results"
        },
        {
            "Title": "Menon Bearings Reports 7% Revenue Growth, Targets INR 280-290 Crores for FY26",
            "Summary": "Menon Bearings Limited reported quarterly revenue of INR 63.85 crores, representing 7% year-on-year growth. EBITDA stood at INR 11.1 crores while PAT reached INR 6.8 crores, reflecting 18% growth for the half-year period. EBITDA margins for the half-year were 18.8% and PAT margins improved to 11.6%. The company expects to achieve consolidated revenue between INR 280-290 crores for the current year with 18-20% growth projected for next year. Raw material costs increased significantly during the quarter, with copper rising from INR 745-775 per kg to INR 875, and tin jumping from INR 2,250 to INR 3,250. The Bi-Metal division remains the major contributor, supported by increasing demand for large diameter bearings. Capacity expansion plans include increasing Bi-Metal capacity from 486 to 530 lakh units, while Alkop can double capacity from 1,440 to 2,880 metric tonnes. The company started new business with Allison USA worth over INR 2.5 crores monthly and expects EV business to contribute 8-10% of Alkop revenue by FY27. Exports currently account for around 30% of total revenue, projected to reach 40% by FY27. The company has a current order book of INR 290 crores for this year and INR 350 crores for next year.",
            "Sentiment": "positive",
            "PublishDate": 1762286557749,
            "Source": "earnings"
        },
        {
            "Title": "Menon Bearings Reports Flat Net Profit with Revenue Growth in Q2",
            "Summary": "Menon Bearings reported net profit of 53 million rupees in Q2, unchanged from the same period last year. The company's revenue increased to 436 million rupees compared to 409 million rupees in the previous year's corresponding quarter, representing growth in the top line.",
            "Sentiment": "neutral",
            "PublishDate": 1761642704739,
            "Source": "earnings"
        },
        {
            "Title": "Menon Bearings Issues Rs. 6 Crore Corporate Guarantee for Subsidiary's Credit Facilities",
            "Summary": "Menon Bearings Limited has issued a corporate guarantee of Rs. 6.00 crore for credit facilities availed by its wholly owned subsidiary, Menon Brakes Limited. Federal Bank granted various credit facilities aggregating to Rs. 6.00 crore to Menon Brakes Limited. Menon Bearings executed the Agreement of Guarantee on July 19, 2025, in favor of Federal Bank to secure repayment of these facilities. The company stated there is no impact of this guarantee unless invoked.",
            "Sentiment": "neutral",
            "PublishDate": 1755164863566,
            "Source": "corporate_action"
        },
        {
            "Title": "Menon Bearings Reports 17% Revenue Growth to ₹67.90 Crores in Q1 FY26",
            "Summary": "Menon Bearings Limited reported quarterly revenues of ₹67.90 crores, marking 17% year-on-year growth. EBITDA increased 22.19% to ₹13.60 crores with a 20% margin. Profit after tax rose 36.91% to ₹8.43 crores compared to ₹6.16 crores in the same quarter last year. The company's capacity utilization averaged 78% for the quarter. Subsidiary Menon Alkop Limited posted revenue of ₹20.26 crores driven by automotive sector demand. Export share increased from 28% to 30% with expectations to reach 35% by year-end. The company secured a ₹30 crores order from a US customer with production starting next month. Management guided for ₹300 crores revenue target for current year and ₹350 crores for next year, expecting 18-20% annual growth. The brakes division awaits a ₹3 crores dynamometer equipment by September to enable railway and OEM approvals, targeting ₹100 crores revenue. Alkop division targets ₹120 crores by 2027 based on 63 new parts developed over two years.",
            "Sentiment": "positive",
            "PublishDate": 1754293124939,
            "Source": "earnings"
        },
        {
            "Title": "Menon Bearings Hosts Earnings Conference Call for Q1 FY26 Results",
            "Summary": "Menon Bearings Limited conducted an earnings conference call on July 30, 2025, at 2:00 p.m. IST to discuss its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The call was held for investors and analysts, with the company making video and audio recordings available on its website. The company informed stock exchanges BSE and NSE about the meeting outcome as part of regulatory disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1753882833105,
            "Source": "stock"
        },
        {
            "Title": "Menon Bearings Reports 16.75% Revenue Growth in Q1FY26, EBITDA Margin Improves to 20.04%",
            "Summary": "Menon Bearings Limited reported consolidated revenue of Rs 67.90 crores in Q1FY26, marking a 16.75% year-over-year increase from Rs 58.16 crores in Q1FY25. EBITDA grew 22.19% to Rs 13.60 crores with margins expanding to 20.04% from 19.14% in the previous year. Profit after tax increased 36.91% to Rs 8.43 crores, with PAT margins improving to 12.42%. The company operates through three divisions: Bimetal products (Rs 47.76 crores revenue), Alkop aluminum die casting (Rs 17.64 crores), and Braking Systems (Rs 1.81 crores). Exports account for approximately 30% of revenue across 24+ countries. The company completed Rs 19.55 crores capex for Bi-Metal Division expansion and ongoing Rs 12.50 crores investment in Alkop Division capacity expansion expected to complete by Q2FY26. Management highlighted strong performance in the tractor segment and progress on railway registration. The company maintains a robust order book of Rs 90+ crores with a pipeline of Rs 100+ crores expected to enter production within two years.",
            "Sentiment": "positive",
            "PublishDate": 1753533272334,
            "Source": "earnings"
        },
        {
            "Title": "Menon Bearings Reports Strong Q1 Growth with 38% Jump in Net Profit",
            "Summary": "Menon Bearings delivered robust quarterly results with consolidated net profit rising to 84 million rupees from 61 million rupees year-over-year. Revenue increased to 672 million rupees compared to 577 million rupees in the same period last year. The company's consolidated EBITDA grew to 129 million rupees from 107 million rupees, while EBITDA margin improved to 19.22% from 18.48% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1753430018759,
            "Source": "earnings"
        },
        {
            "Title": "Menon Bearings Reports Strong Q1 Results, Declares Rs. 2 Interim Dividend and Makes Key Appointments",
            "Summary": "Menon Bearings Limited reported its quarterly results for the period ended June 30, 2025, showing consolidated total income of Rs. 68.80 crores, up 17.84% from Rs. 58.39 crores in the same quarter last year. The company's consolidated profit after tax increased 36.91% to Rs. 8.43 crores compared to Rs. 6.16 crores in the previous year quarter. The board declared an interim dividend of Rs. 2 per equity share (200% of face value) for FY 2025-26, with July 31, 2025 as the record date and payment scheduled between August 6-10, 2025. The company recommended the appointment of Mr. Nandan Borgalkar as Non-Executive Independent Director for a five-year term from October 1, 2025 to September 30, 2030, subject to shareholder approval. Additionally, M/s. M Baldeva Associates was appointed as Secretarial Auditors for five consecutive years from FY 2025-26 to 2029-30. The company operates in the auto components segment and has four entities including three fully owned subsidiaries.",
            "Sentiment": "positive",
            "PublishDate": 1753429951510,
            "Source": "corporate_action"
        },
        {
            "Title": "Menon Bearings Secures ₹30 Crore Annual Export Deal",
            "Summary": "Menon Bearings has secured an export deal valued at ₹30 crore annually. This deal is expected to contribute approximately 12% to the company's yearly revenue.",
            "Sentiment": "positive",
            "PublishDate": 1749548877000,
            "Source": "default"
        },
        {
            "Title": "Menon Bearings Reports Decline in Q4 Financial Performance",
            "Summary": "Menon Bearings has reported a decrease in its Q4 financial results compared to the previous year. The company's EBITDA fell to 85 million rupees from 105 million rupees, with EBITDA margin dropping to 18.69% from 20.16%. Net profit decreased to 59 million rupees from 65 million rupees, while revenue declined to 456 million rupees from 522 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1747294540000,
            "Source": "result"
        },
        {
            "Title": "Menon Bearings: Q3 Revenue Up 13.4%, Profit Stagnant",
            "Summary": "Menon Bearings reported Q3 FY25 results with revenue increasing 13.4% YoY to ₹58.39 crore, while profit remained flat at ₹5.47 crore. Quarter-on-quarter, revenue declined 1.68% and profit fell 18.36%. Operating income decreased 19.13% QoQ but rose 1.37% YoY. EPS remained unchanged at ₹0.98.",
            "Sentiment": "neutral",
            "PublishDate": 1737696041000,
            "Source": "earnings"
        },
        {
            "Title": "Menon Bearings Reports Decline in Q3 Revenue",
            "Summary": "Menon Bearings has reported a decrease in its third-quarter revenue. The company's revenue for Q3 stood at 392 million rupees, compared to 494 million rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1737616586000,
            "Source": "earnings"
        },
        {
            "Title": "Menon Bearings Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Menon Bearings experienced a decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 67 million rupees from 95 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin declined to 17.15% from 19.24% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1737616544000,
            "Source": "earnings"
        },
        {
            "Title": "Menon Bearings Reports Decline in Q3 Net Profit",
            "Summary": "Menon Bearings has reported a net profit of 41 million rupees for the third quarter, compared to 56 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1737616480000,
            "Source": "earnings"
        },
        {
            "Title": "Menon Bearings Reports Q2 FY2024 Financial Results",
            "Summary": "Menon Bearings has released its Q2 financial results. The company's EBITDA for the quarter stood at 84.5 million rupees, down from 103 million rupees in the same quarter last year. However, the EBITDA margin slightly improved to 20.62% from 20.58% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1729752652000,
            "Source": "result"
        },
        {
            "Title": "Menon Bearings Reports Q2 Revenue Decline",
            "Summary": "Menon Bearings Limited has reported a revenue of 409 million rupees for the second quarter, compared to 501.3 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1729752596000,
            "Source": "result"
        },
        {
            "Title": "Menon Bearings Reports Q2 Net Profit Decline",
            "Summary": "Menon Bearings Limited has reported a net profit of 53 million rupees for the second quarter, down from 63 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1729752572000,
            "Source": "result"
        }
    ]
}