{
    "Symbol": "METROPOLIS",
    "ISIN": "INE112L01020",
    "News": [
        {
            "Title": "Metropolis Healthcare Approves 3:1 Bonus Issue",
            "Summary": "Metropolis Healthcare has approved the issuance of bonus equity shares at a ratio of 3:1, providing shareholders with three additional shares for every share held.",
            "Sentiment": "positive",
            "PublishDate": 1770206571359,
            "Source": "co_actions_results"
        },
        {
            "Title": "Metropolis Healthcare Q3FY26 Earnings Call on Feb 5",
            "Summary": "Metropolis Healthcare announces earnings conference call scheduled for February 5, 2026 at 09:00 AM IST to discuss Q3FY26 financial results for quarter ended December 31, 2025, organized by ICICI Securities.",
            "Sentiment": "neutral",
            "PublishDate": 1769790395719,
            "Source": "co_actions_results"
        },
        {
            "Title": "Metropolis Healthcare Allots 9,960 Equity Shares",
            "Summary": "Metropolis Healthcare Limited allotted 9,960 equity shares at ₹2 per share under its RSU Plan 2020, with 50% shares subject to one-year lock-in period starting January 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768309522105,
            "Source": "co_actions_results"
        },
        {
            "Title": "Metropolis to expand genomics tests to 500 in 2 years",
            "Summary": "Metropolis Healthcare launches Centre for Genomics, plans to expand test menu from 220 to 500 tests over next two years. Company targets 13-15% organic growth in FY26-27 with specialty tests contributing 38% of revenue.",
            "Sentiment": "positive",
            "PublishDate": 1768302181995,
            "Source": "stocks"
        },
        {
            "Title": "Metropolis Healthcare launches genomics centre",
            "Summary": "Metropolis Healthcare launches Centre of Genomics with CAP-accredited labs in Mumbai and Delhi NCR, plans to expand genomic portfolio to 500+ tests over 2-3 years from current 220+ validated assays.",
            "Sentiment": "positive",
            "PublishDate": 1768289843268,
            "Source": "stocks"
        },
        {
            "Title": "Metropolis Healthcare Expands Genomics Labs",
            "Summary": "Metropolis Healthcare launches two accredited genomics labs in Delhi NCR and Mumbai, focusing on oncology, reproductive health, neurology, transplant immunology, and rare diseases with plans to expand to over 500 genomic tests.",
            "Sentiment": "positive",
            "PublishDate": 1768275297102,
            "Source": "stocks"
        },
        {
            "Title": "Metropolis Healthcare Launches Advanced Genomics Center",
            "Summary": "Metropolis Healthcare introduces a new genomics center featuring Illumina's NovaSeq™ X Series technology to enhance precision diagnostics and advance genomic research capabilities in India.",
            "Sentiment": "positive",
            "PublishDate": 1768275274377,
            "Source": "stocks"
        },
        {
            "Title": "Metropolis Healthcare Launches Centre of Genomics",
            "Summary": "Metropolis Healthcare launches Centre of Genomics with Illumina's NovaSeq™ X Series technology, backed by two CAP-accredited labs in Delhi NCR and Mumbai, planning to expand genomic portfolio to 500+ tests.",
            "Sentiment": "positive",
            "PublishDate": 1768274919274,
            "Source": "stocks"
        },
        {
            "Title": "Metropolis Healthcare shares surge 4.6% on Q3 update",
            "Summary": "Metropolis Healthcare shares gained 4.6% to ₹2,021.40 following strong Q3 business update showing 26% YoY consolidated revenue growth driven by specialty testing and wellness segments.",
            "Sentiment": "positive",
            "PublishDate": 1767584406340,
            "Source": "co_actions_results"
        },
        {
            "Title": "Metropolis Healthcare Reports 23% Revenue Growth in Q2 FY26 with Margin Expansion",
            "Summary": "Metropolis Healthcare Limited reported strong quarterly results with group revenue growing 23% year-over-year in Q2 FY26. The company's organic business achieved 12% revenue growth with EBITDA margins improving to 26.8% compared to 26.2% in the previous year, representing a 60 basis points expansion. Patient volumes reached 3.6 million with a 6% growth, while test volumes stood at 7.4 million, also growing 6% year-over-year. The B2C segment contributed 59% of total revenue with 11% growth, while B2B segment recorded 14% growth. TruHealth and Specialty segments grew by 21% and 15% respectively. Core Diagnostics, a recent acquisition, showed margin improvement from breakeven in March to high-single-digit margins. The company added approximately 200 collection centres in the first half and plans to add another 300 in the second half. Management maintained their full-year guidance and confirmed no new acquisitions are planned for the next 6-9 months as they focus on organic growth and integration of recent acquisitions.",
            "Sentiment": "positive",
            "PublishDate": 1762918584134,
            "Source": "earnings"
        },
        {
            "Title": "Metropolis Healthcare Targets Double-Digit Margins for Core Diagnostics by FY26-End",
            "Summary": "Metropolis Healthcare is progressing with the integration of Core Diagnostics, which it acquired for Rs 247 crore in late 2024. The company expects Core Diagnostics to achieve double-digit margins by the end of FY26, improving from breakeven in Q4FY25 to low single-digit margins in Q1FY26 and high single-digit margins in Q2FY26. Managing Director Surendran Chemmenkotil stated that Core Diagnostics' margins should align with Metropolis' overall margins within three years of acquisition. The acquisition was aimed at strengthening the company's cancer diagnostics portfolio and expanding presence in Northern and Eastern India. Metropolis reported strong quarterly results with revenue rising 22.7% to Rs 429 crore, EBITDA up 20.4% to Rs 108 crore, and net profit increasing 13.2% to Rs 52.7 crore. The company's TruHealth segment is showing 20% growth.",
            "Sentiment": "positive",
            "PublishDate": 1762422810417,
            "Source": "stock"
        },
        {
            "Title": "Metropolis Healthcare Expects 10-11% Volume Growth for the Year",
            "Summary": "Metropolis Healthcare announced during a conference call that the company expects volume growth of 10-11% for the year.",
            "Sentiment": "positive",
            "PublishDate": 1762408128916,
            "Source": "stock"
        },
        {
            "Title": "Metropolis Confirms Organic Business Growth Target of 70-100 BPS for FY26",
            "Summary": "Metropolis has confirmed its organic business growth target of 70-100 basis points for FY26. This target was communicated during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1762406927219,
            "Source": "stock"
        },
        {
            "Title": "Metropolis Healthcare Reports Strong Q2 Performance with 15% Revenue Growth and Declares Rs 4 Interim Dividend",
            "Summary": "Metropolis Healthcare Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. The company reported consolidated revenue of Rs 42,919.14 lakhs for the quarter, compared to Rs 34,978.88 lakhs in the same period last year, representing significant growth. Consolidated profit for the quarter stood at Rs 5,289.01 lakhs versus Rs 4,669.77 lakhs in the previous year. For the six-month period, consolidated revenue reached Rs 81,525.46 lakhs compared to Rs 66,314.39 lakhs in the prior year, with profit of Rs 9,813.84 lakhs against Rs 8,480.80 lakhs. The Board declared an interim dividend of Rs 4 per equity share of face value Rs 2 each for financial year 2025-26, with November 11, 2025 as the record date. The company completed several business acquisitions during the period, including DAPIC Metropolis Healthcare Private Limited in May 2025 for Rs 3,461 lakhs purchase consideration, Scientific Metropolis Pathology Private Limited in June 2025 for Rs 7,200 lakhs, and Dr. R.S. Patil's Ambika Pathology Laboratory in September 2025 for Rs 1,700 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1762287012400,
            "Source": "earnings"
        },
        {
            "Title": "Metropolis Healthcare Expresses Optimism About Growth and Profit Targets",
            "Summary": "Metropolis Healthcare has stated it remains optimistic about achieving its growth and profit goals for the remainder of the year.",
            "Sentiment": "positive",
            "PublishDate": 1762270493707,
            "Source": "stock"
        },
        {
            "Title": "Metropolis Healthcare Declares Rs 4 Per Share Dividend, Reports Q2 EBITDA Growth",
            "Summary": "Metropolis Healthcare announced a dividend of Rs 4 per share. The company reported Q2 EBITDA of Rs 1.1 billion compared to Rs 899 million in the same period last year. The Q2 EBITDA margin was 25.22% versus 25.7% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762260377364,
            "Source": "corporate_action"
        },
        {
            "Title": "Metropolis Healthcare Reports Strong Q2 Growth with 13% Rise in Net Profit",
            "Summary": "Metropolis Healthcare reported consolidated net profit of 527 million rupees for Q2, representing a year-over-year increase from 465 million rupees. The company's revenue grew to 4.3 billion rupees compared to 3.5 billion rupees in the same quarter last year, marking significant growth across both key financial metrics.",
            "Sentiment": "positive",
            "PublishDate": 1762260004671,
            "Source": "earnings"
        },
        {
            "Title": "Metropolis Healthcare Grants Stock Benefits to Employees Under Multiple Plans",
            "Summary": "Metropolis Healthcare's Nomination and Remuneration Committee approved the grant of stock benefits to eligible employees. The company granted 18,232 units under the Metropolis-Restrictive Stock Unit Plan 2020, 10,107 units under the Metropolis-Restrictive Stock Units Plan 2025, and 228,840 options under the Metropolis-Employees Stock Options Plan 2025. The exercise price for the stock options is INR 1,648.24 per option, while the restricted stock units are priced at face value. All grants have a minimum vesting period of one year, extending up to four years, with a maximum exercise period of five years from the vesting date.",
            "Sentiment": "positive",
            "PublishDate": 1762236891221,
            "Source": "corporate_action"
        },
        {
            "Title": "Metropolis Healthcare Reports 23% Revenue Growth, Maintains Debt-Free Status",
            "Summary": "Metropolis Healthcare reported 23% yearly revenue growth in Q2 FY26. The company's core diagnostics margins improved during the quarter. Metropolis completed an acquisition in Kolhapur to enhance its regional presence. The company maintains a debt-free status with ₹55 crore cash surplus. Management aims for ongoing margin increases and growth in wellness and specialty areas.",
            "Sentiment": "positive",
            "PublishDate": 1759747759044,
            "Source": "earnings"
        },
        {
            "Title": "Metropolis Healthcare Completes Acquisition of Ambika Pathology Laboratory",
            "Summary": "Metropolis Healthcare Limited has completed the acquisition of Dr. RS Patil's Ambika Pathology Laboratory, a sole proprietorship firm owned by Dr. Rajendra Sadashiv Patil. The acquisition became effective September 18, 2025, and was executed as a going concern under the terms of a Business Transfer Agreement. Operations of Ambika Pathology are now being conducted under Metropolis Healthcare Limited. The acquisition includes deferred consideration terms as outlined in the Business Transfer Agreement.",
            "Sentiment": "positive",
            "PublishDate": 1758199539453,
            "Source": "order&deals"
        },
        {
            "Title": "Metropolis Healthcare Incorporates Wholly Owned Healthcare Technology Subsidiary",
            "Summary": "Metropolis Healthcare Limited incorporated a wholly owned subsidiary named Metropolis Quality Solutions Private Limited on September 15, 2025. The new entity operates in the healthcare technology sector and will develop and deal in technology-driven products and services in the healthcare sector. Metropolis Healthcare subscribed to 10,000 equity shares of face value INR 10 each through initial capital subscription in cash, maintaining 100% shareholding. The subsidiary is incorporated under the Indian Companies Act, 2013, with CIN U74909MH2025PTC457187 and registered office in Maharashtra.",
            "Sentiment": "positive",
            "PublishDate": 1758007161835,
            "Source": "corporate_action"
        },
        {
            "Title": "Metropolis Healthcare Reports 23% Revenue Growth in Q1 FY26, Driven by Organic Growth and Acquisitions",
            "Summary": "Metropolis Healthcare Limited reported 23% revenue growth for Q1 FY26, with organic business growing 13.2% driven by volumes and improved realizations. The company achieved 24.7% EBITDA margin on organic basis, up 40 basis points sequentially. Patient volumes grew 7% organically to 3.2 million, while B2C revenue increased 16% year-on-year. The company is integrating three recent acquisitions - Core Diagnostics, DAPIC Dehradun, and Scientific Pathology Agra. Core Diagnostics turned EBITDA positive with low single-digit margins, improving from breakeven levels. Metropolis announced acquisition of Ambika Diagnostics in Kolhapur for Rs.17 crores. The company expanded basic radiology services to 20 locations with full services and 240 locations offering ECG. TruHealth preventive portfolio now contributes 18% of overall revenue, growing 22% year-on-year. North region contribution increased to 17% of total revenue, largely due to Core Diagnostics integration. The company added 80 new collection centers in Q1 and plans to add 400+ centers this year, expanding presence from 750 to 1,000 towns.",
            "Sentiment": "positive",
            "PublishDate": 1755189959364,
            "Source": "earnings"
        },
        {
            "Title": "Metropolis Healthcare Completes 25th AGM with Strong Shareholder Approval Across All Resolutions",
            "Summary": "Metropolis Healthcare Limited held its 25th Annual General Meeting on August 13, 2025, via video conferencing. The company achieved high voter participation with 91.65% of outstanding shares participating in the voting process. All 11 resolutions were approved, including adoption of audited financial statements for the year ended March 31, 2025, re-appointment of directors Hemant Sachdev and Ameera Shah, and ratification of cost auditor remuneration. Key approvals included Ameera Shah's re-appointment as Chairperson & Whole-time Director (99.77% approval), approval of remuneration for Dr. Sushil Shah as Non-Executive Non-Independent Director (86.78% approval), and appointment of secretarial auditors. The company also approved two new employee stock option plans - the Metropolis Employees Stock Options Plan 2025 and Restrictive Stock Units Plan 2025, along with their extension to subsidiary employees. Promoter and promoter group shareholders showed unanimous support across all resolutions with 100% approval rates. The scrutinizer's report was prepared by Vijay Yadav of AVS & Associates Company Secretaries.",
            "Sentiment": "positive",
            "PublishDate": 1755183658569,
            "Source": "corporate_action"
        },
        {
            "Title": "Metropolis Healthcare Acquires Kolhapur Pathology Business",
            "Summary": "Metropolis Healthcare has announced a deal to acquire a pathology business in Kolhapur through a business transfer agreement. The acquisition expands the company's diagnostic services footprint in the region.",
            "Sentiment": "positive",
            "PublishDate": 1754578011741,
            "Source": "order&deals"
        },
        {
            "Title": "Metropolis Healthcare Reports 19% Profit Growth Despite Margin Decline",
            "Summary": "Metropolis Healthcare reported strong financial performance for the April-June period with net profit rising 19% to Rs 45.06 crore compared to Rs 37.95 crore in the same period last year. Revenue increased 23.2% to Rs 386.06 crore from Rs 313.36 crore, while EBITDA grew 14% to Rs 89.76 crore versus Rs 78.81 crore. However, margins contracted to 23.3% from 25.1% in the previous year. The company's stock declined 2.97% to close at Rs 1,994.6 on the NSE, underperforming the benchmark Nifty which rose 0.09%. The stock has fallen 5.21% over the past 12 months and 3.95% year-to-date. Among 24 analysts covering the stock, 17 recommend 'buy', 2 suggest 'hold', and 5 rate it as 'sell', with the average 12-month price target indicating a potential 2.5% downside.",
            "Sentiment": "positive",
            "PublishDate": 1754569700364,
            "Source": "earnings"
        },
        {
            "Title": "Metropolis Healthcare Reports Strong Q1 Results, Announces New Acquisition in Maharashtra",
            "Summary": "Metropolis Healthcare announced its quarterly results for the period ended June 30, 2025, showing revenue from operations of Rs 32,363.24 lakhs on standalone basis and Rs 38,606.32 lakhs on consolidated basis. The company reported standalone profit of Rs 3,558.18 lakhs and consolidated profit of Rs 4,524.53 lakhs. The board approved the acquisition of Dr. RS Patil's Ambika Pathology Laboratory in Kolhapur, Maharashtra, through a Business Transfer Agreement for a total consideration of Rs 17 crores, including deferred consideration of Rs 1.7 crores. The target entity operates NABL-accredited labs with 12 patient touch points and reported turnover of Rs 7.96 crores in FY 2024-25. The acquisition aims to strengthen Metropolis's position in the Kolhapur region and establish a mini reference laboratory to serve 4-5 districts in Western Maharashtra. The transaction is expected to complete within 45 days of signing the agreement.",
            "Sentiment": "positive",
            "PublishDate": 1754567481207,
            "Source": "earnings"
        },
        {
            "Title": "Metropolis Healthcare Gets Approval for Ambika Pathology Lab Acquisition, Reports Strong Q1 Growth",
            "Summary": "Metropolis Healthcare received approval to acquire Ambika Pathology Lab. The company reported strong quarterly financial performance with consolidated net profit rising to 451 million rupees from 379 million rupees year-over-year. Revenue increased to 3.86 billion rupees compared to 3.1 billion rupees in the previous year. EBITDA grew to 898 million rupees from 788 million rupees year-over-year, though EBITDA margin declined to 23.25% from 25.15% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1754566841466,
            "Source": "order&deals"
        },
        {
            "Title": "Metropolis Healthcare Reports Strong Q1 Revenue Growth",
            "Summary": "Metropolis Healthcare has reported significant revenue growth for Q1. The company's overall revenue increased by approximately 23% year-over-year. Notably, the specialty revenues segment showed an even stronger performance, growing by approximately 35%+ compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1751846895000,
            "Source": "default"
        },
        {
            "Title": "Metropolis Healthcare: Q1 Revenue Surges 23% YoY",
            "Summary": "Metropolis Healthcare reported a 23% year-on-year revenue growth for Q1 FY26. Core Diagnostics moved to positive margins. Specialty revenues grew 35% YoY. Excluding acquisitions, revenues increased 13% YoY. B2C revenues up 15%. TruHealth Wellness and Specialty segments grew 20% and 15% respectively. EBITDA improved QoQ. Company remains debt-free.",
            "Sentiment": "positive",
            "PublishDate": 1751644352000,
            "Source": "earnings"
        },
        {
            "Title": "Metropolis Healthcare Reports Q1 Revenue Growth",
            "Summary": "Metropolis Healthcare has reported a significant increase in revenue for the first quarter. The company's revenue grew by approximately 23% compared to the same quarter in the previous year. Notably, specialty revenues showed an even more substantial increase, rising by over 35% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1751634905000,
            "Source": "default"
        },
        {
            "Title": "Metropolis Healthcare Reports Q4 FY23 Financial Results",
            "Summary": "Metropolis Healthcare announced its Q4 FY23 financial results. The company reported a consolidated net profit of 291 million rupees, down from 364 million rupees year-over-year. However, it showed an improvement from 314 million rupees quarter-over-quarter. Revenue for Q4 increased to 3.45 billion rupees from 3.31 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747181861000,
            "Source": "default"
        },
        {
            "Title": "Metropolis Healthcare: Q4 Profit Dips 19%, Revenue Rises 4%",
            "Summary": "Metropolis Healthcare reported a 19.4% YoY decrease in Q4 net profit to ₹29 crore, while revenue increased 4.3% to ₹345.3 crore. EBITDA fell 22% YoY to ₹62.3 crore. FY25 saw 6% growth in patient volume and 7% in test volume. B2C revenue grew 17% for the full year, while B2B revenue increased 12%. TruHealth portfolio showed 24% revenue growth in FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1747149611000,
            "Source": "earnings"
        },
        {
            "Title": "Metropolis Healthcare Reports Q4 Financial Results",
            "Summary": "Metropolis Healthcare announced its Q4 financial results. The company's EBITDA decreased to 623 million rupees from 799.8 million rupees year-over-year, with EBITDA margin falling to 18.04% from 24.16%. Consolidated net profit declined to 291 million rupees from 364 million rupees year-over-year, but increased from 314 million rupees quarter-over-quarter. Revenue grew to 3.45 billion rupees from 3.31 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747144496000,
            "Source": "result"
        },
        {
            "Title": "Metropolis Healthcare to Consider Q4 Results on May 13",
            "Summary": "Metropolis Healthcare has announced that it will consider its fourth quarter (Q4) financial results on May 13. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746448034000,
            "Source": "default"
        },
        {
            "Title": "Metropolis Healthcare: Expands North India Presence with Dehradun Acquisition",
            "Summary": "Metropolis Healthcare Ltd's subsidiary is acquiring Dr. Ahujas' Pathology and Imaging Centre in Dehradun for ₹35 crore. The deal, expected to complete within 45 days, aims to strengthen Metropolis's diagnostic network in North India, particularly in Uttarakhand.",
            "Sentiment": "positive",
            "PublishDate": 1744123182000,
            "Source": "corporate_action"
        },
        {
            "Title": "Metropolis Healthcare: Acquires DAPIC for Rs 35.01 Crore",
            "Summary": "Metropolis Healthcare's subsidiary will acquire 100% ownership of Ahujas' Pathology and Imaging Centre (DAPIC) in Dehradun for Rs 35.01 crore in an all-cash deal. DAPIC operates two NABL and NABH accredited laboratories, 11 patient service centres, and nine hospital-based centres. The acquisition aims to expand Metropolis' presence in Uttar Pradesh and Uttarakhand.",
            "Sentiment": "positive",
            "PublishDate": 1744018951000,
            "Source": "corporate_action"
        },
        {
            "Title": "Metropolis Healthcare: Strategic Acquisition to Boost North India Presence",
            "Summary": "Metropolis Healthcare is acquiring Agra-based Scientific Pathology for Rs 55-83 crore to strengthen its presence in Western UP and North India. The deal is expected to close by March-end, with Scientific Pathology valued at Rs 63 crore initially. This acquisition follows Metropolis' recent purchase of Delhi-based Core Diagnostics, as part of its expansion strategy in North India.",
            "Sentiment": "positive",
            "PublishDate": 1741499803000,
            "Source": "corporate_action"
        },
        {
            "Title": "Metropolis Healthcare: Subsidiary to Acquire Scientific Pathology for Up to Rs 83 Crore",
            "Summary": "Metropolis Clinical Pathology, a subsidiary of Metropolis Healthcare, will acquire Agra-based Scientific Pathology for Rs 55-83 crore. The acquisition strengthens Metropolis' presence in Western Uttar Pradesh and accelerates B2C expansion. The deal involves acquiring laboratories and collection centers through a slump sale transaction.",
            "Sentiment": "positive",
            "PublishDate": 1741002838000,
            "Source": "corporate_action"
        },
        {
            "Title": "Metropolis Healthcare: CEO Confident of 15% Revenue Growth in FY25",
            "Summary": "Metropolis Healthcare CEO Surendram Chemmenkotil expects to meet FY25 revenue targets of 13-15% growth, driven by strong Q4 trends. The company reported 10.9% YoY revenue growth in Q3 FY25. The acquisition of Core Diagnostics is in final stages, with expected margin dilution in the first two years but improvement by the third year.",
            "Sentiment": "positive",
            "PublishDate": 1738825482000,
            "Source": "earnings"
        },
        {
            "Title": "Metropolis Healthcare: Q3 Results Show Volume Impact on Performance",
            "Summary": "Metropolis Healthcare reported lower volumes affecting Q3 performance. Management maintains revenue growth guidance of 13-15% YoY, primarily driven by volume increases. Centrum Broking retains 'Add' rating on the stock.",
            "Sentiment": "neutral",
            "PublishDate": 1738766742000,
            "Source": "earnings"
        },
        {
            "Title": "Metropolis Health Expects Q4 Rebound in Acute Patient Volume and Expansion in Tier 3-4 Cities",
            "Summary": "Metropolis Health has announced in a concall update that they anticipate a rebound in acute patient volume during the fourth quarter. The company also sees significant growth potential in tier 3 and 4 cities, indicating plans for expansion into these markets. This suggests a positive outlook for the company's near-term performance and long-term growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1738730144000,
            "Source": "earnings"
        },
        {
            "Title": "Metropolis Health Maintains Revenue and Margin Guidance for Q4FY25",
            "Summary": "Metropolis Health has reaffirmed its revenue growth guidance of 13% and a margin expectation of over 25% for the fourth quarter of fiscal year 2025. This information was shared during a company conference call, indicating confidence in their financial performance and outlook.",
            "Sentiment": "positive",
            "PublishDate": 1738730014000,
            "Source": "earnings"
        },
        {
            "Title": "Metropolis Healthcare Reports Q3 Financial Results",
            "Summary": "Metropolis Healthcare announced its Q3 financial results. The company's consolidated net profit increased to 314 million rupees from 271.5 million rupees year-over-year. Revenue also saw growth, rising to 3.23 billion rupees from 2.9 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738714874000,
            "Source": "earnings"
        },
        {
            "Title": "Metropolis Healthcare Reports Improved Q3 EBITDA and Margin",
            "Summary": "Metropolis Healthcare, a diagnostic services provider, has reported its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 720 million rupees, up from 648 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin slightly improved to 22.31% from 22.28% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738673607000,
            "Source": "earnings"
        },
        {
            "Title": "Metropolis Healthcare Reports Q3 Financial Results",
            "Summary": "Metropolis Healthcare announced its Q3 financial results. The company's consolidated net profit increased to 314 million rupees from 271.5 million rupees year-over-year. Revenue also saw growth, rising to 3.23 billion rupees from 2.9 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738673602000,
            "Source": "earnings"
        },
        {
            "Title": "Metropolis Healthcare Offers US FDA Approved HMPV Test Kit in India",
            "Summary": "Metropolis Healthcare has announced the availability of US FDA approved test kits for Human Metapneumovirus (HMPV) in India. This development suggests that Metropolis is expanding its diagnostic capabilities by offering advanced testing options for respiratory infections.",
            "Sentiment": "positive",
            "PublishDate": 1736155194000,
            "Source": "corporate_action"
        },
        {
            "Title": "Metropolis Healthcare Reports Revenue Growth Driven by Multiple Factors",
            "Summary": "Metropolis Healthcare has experienced revenue growth attributed to several key factors: an increase in patient volume, growth in test volume, changes in their product mix, and improvements in realization. This combination of factors has contributed to the company's overall financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1736149302000,
            "Source": "earnings"
        },
        {
            "Title": "Metropolis Healthcare Reports 11% Year-on-Year Revenue Growth",
            "Summary": "Metropolis Healthcare, a diagnostics company, has announced that its revenues have increased by approximately 11% compared to the same period last year. This year-on-year growth indicates positive performance for the company in the healthcare sector.",
            "Sentiment": "positive",
            "PublishDate": 1736149277000,
            "Source": "earnings"
        },
        {
            "Title": "Metropolis Healthcare Incorporates New Diagnostic Services Unit",
            "Summary": "Metropolis Healthcare has announced the incorporation of a new unit named Metropolis Clinical Pathology for Diagnostic Services. This move suggests an expansion of the company's diagnostic capabilities and services.",
            "Sentiment": "positive",
            "PublishDate": 1735178453000,
            "Source": "corporate_action"
        },
        {
            "Title": "Metropolis Healthcare: Aims to Align Core Diagnostics' Margins Within Four Years",
            "Summary": "Metropolis Healthcare recently acquired Core Diagnostics for Rs 246.8 crore. The company plans to align Core Diagnostics' margins with its own profile over the next four years. Core Diagnostics, currently not fully profitable, is expected to see significant margin improvements under Metropolis, with yearly leaps in EBITDA margin percentage anticipated.",
            "Sentiment": "positive",
            "PublishDate": 1733890612000,
            "Source": "corporate_action"
        }
    ]
}