{
    "Symbol": "METROBRAND",
    "ISIN": "INE317I01021",
    "News": [
        {
            "Title": "Metro Brands Q3FY26: 15% Revenue Growth to ₹811 Cr",
            "Summary": "Metro Brands reports strong Q3FY26 performance with 15% revenue growth reaching ₹811 crores, EBITDA margins at 33%, and PAT growth of 33% despite early festive season challenges.",
            "Sentiment": "positive",
            "PublishDate": 1770183231826,
            "Source": "co_actions_results"
        },
        {
            "Title": "Metro Brands Announces ₹3 Dividend Per Share",
            "Summary": "Metro Brands has declared a dividend of ₹3 per share for its shareholders, marking a significant return to investors through direct cash distribution.",
            "Sentiment": "positive",
            "PublishDate": 1769522831092,
            "Source": "co_actions_results"
        },
        {
            "Title": "Metro Brands Q3 Net Profit Jumps 32.8% to ₹1.25B",
            "Summary": "Metro Brands reported strong Q3 performance with net profit rising 32.8% YoY to ₹1.25 billion and revenue growing 15.0% to ₹7.9 billion, demonstrating robust business momentum.",
            "Sentiment": "positive",
            "PublishDate": 1769522739982,
            "Source": "co_actions_results"
        },
        {
            "Title": "Metro Brands Re-appoints CEO Nissan Joseph for 5 Years",
            "Summary": "Metro Brands Limited announces the re-appointment of Mr. Nissan Joseph as Chief Executive Officer for a five-year term starting July 1, 2026, following board approval on January 27, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769522506551,
            "Source": "stocks"
        },
        {
            "Title": "Metro Brands Q3FY26 earnings call on Jan 28",
            "Summary": "Metro Brands Limited has scheduled an investor/analyst conference call for January 28, 2026, at 3:30 PM IST to discuss its unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768920642748,
            "Source": "co_actions_results"
        },
        {
            "Title": "Metro Brands allots 25,250 shares under ESOP 2008",
            "Summary": "Metro Brands Limited allotted 25,250 equity shares under its ESOP 2008 scheme on January 12, 2026, increasing paid-up capital to ₹136.23 crores with shares priced between ₹228-₹649.95.",
            "Sentiment": "neutral",
            "PublishDate": 1768223303113,
            "Source": "co_actions_results"
        },
        {
            "Title": "Metro Brands Allots 39,771 Shares Under ESOP 2008",
            "Summary": "Metro Brands Limited allotted 39,771 equity shares under its Employee Stock Option Plan 2008 on December 11, 2025, increasing paid-up share capital to ₹1,36,21,69,955.",
            "Sentiment": "neutral",
            "PublishDate": 1765453935451,
            "Source": "co_actions_results"
        },
        {
            "Title": "Metro Brands Allots 49,061 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Metro Brands Limited allotted 49,061 equity shares of ₹5 each under its Metro Stock Option Plan (ESOP 2008) to eligible grantees on November 13, 2025. The allotment was approved by the company's Share Allotment and Transfer Committee through a circular resolution. Following this allotment, the company's paid-up share capital increased from ₹1,36,17,25,795 (consisting of 27,23,45,159 equity shares) to ₹1,36,19,71,100 (consisting of 27,23,94,220 equity shares). The exercise prices for the shares ranged from ₹228 to ₹649.95 per share across different tranches. The company stated that this share allotment is not material in nature. Metro Brands is listed on BSE and NSE with the symbol METROBRAND.",
            "Sentiment": "neutral",
            "PublishDate": 1763020279627,
            "Source": "corporate_action"
        },
        {
            "Title": "Metro Brands Launches MetroActiv Athletic Shoe Store Chain with Physical and Online Presence",
            "Summary": "Metro Brands has launched MetroActiv, a new multi-brand athletic shoe store concept. The company opened its first three outlets in Indore, Jodhpur, and Dehradun, and simultaneously launched an e-commerce platform at Metroactiv.com. This expansion represents Metro Brands' entry into the athletic footwear retail segment through both physical stores and digital channels.",
            "Sentiment": "positive",
            "PublishDate": 1761799553145,
            "Source": "stock"
        },
        {
            "Title": "Metro Brands Promoter Alisha Rafique Malik Sells 11.9 Lakh Shares Through Block Deal",
            "Summary": "Alisha Rafique Malik, a promoter of Metro Brands Limited, sold 11,90,000 equity shares representing 0.438% voting rights through a block deal on September 6, 2024. The transaction reduced her shareholding from 90,88,000 shares (3.34% voting rights) to 78,98,000 shares (2.90% voting rights). The sale was conducted on the stock exchanges and disclosed under SEBI substantial acquisition regulations. Metro Brands has a total equity share capital of Rs. 135.97 crore comprising 27,19,43,004 equity shares of Rs. 5 each.",
            "Sentiment": "neutral",
            "PublishDate": 1761795448946,
            "Source": "order&deals"
        },
        {
            "Title": "Metro Brands Reports 12% Standalone Growth in Q2FY26, Opens 38 New Stores Including 4 Foot Locker Outlets",
            "Summary": "Metro Brands Limited reported 12% growth in standalone business and 11% in consolidated numbers for the quarter ended September 30, 2025. The company opened 42 new stores with 4 closures, resulting in net addition of 38 stores, including 4 Foot Locker stores and 10 Walkway stores. EBITDA grew 12% for standalone and 10% for consolidated business. The company's e-commerce business achieved 39% growth and now contributes 14% to revenue. Metro Brands launched Clarks footwear in 200 Metro and Mochi stores with plans to expand to 300 stores. GST reductions resulted in 11% price reduction for footwear priced between INR1,000-INR2,500 and 6% reduction for footwear under INR1,000, positively impacting 90% of Walkway and 40% of Metro Mochi footwear business. The company increased marketing spend by 100 basis points and improved gross margins by 40 basis points. Management continues to work on resolving BIS issues affecting FILA and Foot Locker expansion, with FILA repositioning expected to take 12-18 months.",
            "Sentiment": "positive",
            "PublishDate": 1761290772973,
            "Source": "earnings"
        },
        {
            "Title": "Metro Brands Plans Expansion to 1,000+ Stores by FY27 with Focus on Premium and Sports Categories",
            "Summary": "Metro Brands has announced plans to expand to over 1,000 stores by FY27. The company's growth strategy includes accelerated rollout of premium and sports categories, increasing digital sales mix, and margin expansion through growth of in-house brands.",
            "Sentiment": "positive",
            "PublishDate": 1760631970411,
            "Source": "stock"
        },
        {
            "Title": "Metro Brands Reports Q2 FY26 Results with Revenue Growth and Strong Profitability",
            "Summary": "Metro Brands Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 635.97 crores for the quarter, compared to Rs 566.73 crores in the same quarter last year. Profit after tax increased to Rs 64.10 crores from Rs 65.67 crores in the previous year quarter. For the six-month period, revenue reached Rs 1,251.06 crores versus Rs 1,129.94 crores last year, with profit after tax of Rs 160.72 crores compared to Rs 158.02 crores. On a consolidated basis, quarterly revenue was Rs 651.14 crores against Rs 585.45 crores last year, with profit after tax of Rs 68.98 crores versus Rs 71.77 crores. The company granted 1,50,308 employee stock options during the quarter and paid a final dividend of Rs 2.50 per equity share. Basic earnings per share for the quarter stood at Rs 2.35 on standalone basis and Rs 2.49 on consolidated basis.",
            "Sentiment": "positive",
            "PublishDate": 1760619160224,
            "Source": "earnings"
        },
        {
            "Title": "Metro Brands Holds Group Meeting with 20 Institutional Investors at J.P. Morgan India Consumption Forum",
            "Summary": "Metro Brands Limited participated in the J.P. Morgan India Consumption Forum, holding a group meeting with 20 institutional investors and asset management firms on September 24, 2025. The physical meeting lasted from 9:00 a.m. to 9:50 a.m. and included major investors such as Alliance Bernstein, Goldman Sachs Asset Management, Fidelity International, ICICI Prudential AMC, and Citadel Asset Management among others. All discussions were conducted based on generally available information in accordance with Metro Brands' Code of Conduct for Prevention of Insider Trading.",
            "Sentiment": "neutral",
            "PublishDate": 1758706258988,
            "Source": "stock"
        },
        {
            "Title": "Metro Brands Shareholders Approve Re-appointment of Mohammed Iqbal Hasanally Dossani as Whole-Time Director",
            "Summary": "Metro Brands Limited shareholders approved the re-appointment of Mohammed Iqbal Hasanally Dossani as Whole-Time Director for a five-year term beginning June 25, 2026. The decision was made at the company's 48th Annual General Meeting held on September 18, 2025. Dossani, who has been associated with the company as a director since November 26, 2020, holds a bachelor's degree in commerce from the University of Mumbai and has completed a Harvard University course on rhetoric and public speaking. He has been instrumental in launching Biofoot, India's first foot wellness solution, and has led initiatives including CRM implementation and RFID adoption. Dossani also serves as a director on the boards of Metro Shopping Arcade Private Limited, Metro House Private Limited, Metro Athleisure Limited, and Metro Plaza Arcade Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1758201189452,
            "Source": "corporate_governance"
        },
        {
            "Title": "Metro Brands to Pass Full GST Reduction Benefits to Customers, Expects Consumption Boost",
            "Summary": "Metro Brands will completely pass on the 7% GST reduction on footwear priced below Rs 2,500 to customers, according to CEO Nissan Joseph. The GST rate on such footwear will drop from 12% to 5% effective September 22. Joseph stated the company's margins will remain unchanged as they are calculated net of GST, and the company targets 30% EBITDA margins by FY26. The GST cut will make the Rs 2,500-2,700 price point redundant, as retailers will prefer selling at Rs 2,499 to capture GST benefits. Around 44% of Metro Brands' sales come from products under Rs 3,000, with 40% below Rs 2,500. Joseph expects the price reduction to spur demand and support the company's growth trajectory. He remained cautiously optimistic about potentially achieving the long-term guidance of 15% sales CAGR faster due to this development. Metro Brands shares closed 4.38% higher at Rs 1,247.",
            "Sentiment": "positive",
            "PublishDate": 1757500434032,
            "Source": "stock"
        },
        {
            "Title": "Metro Brands Reports 9% Revenue Growth in Q1 FY26 Despite Early Monsoon Impact",
            "Summary": "Metro Brands achieved 9% growth in both standalone and consolidated revenue for the quarter ended June 30, 2025. The company's EBITDA grew 8% to 31%, while PAT increased 7% to maintain 16% margin. Gross margins remained healthy at nearly 60%. The early onset of monsoon in Gujarat and Maharashtra, where the company has significant store presence, dampened shopping activity despite benefiting the Crocs business. E-commerce delivered strong 45% growth during the quarter. The company opened 23 stores and closed 3 stores, with particular focus on expanding the Walkway banner after repositioning efforts. Metro Brands announced a new long-term exclusive partnership with Clarks shoes for India and surrounding countries. The company delayed Foot Locker and Fitflop store openings due to BIS regulations impacting imports, but has since resumed Foot Locker expansion. Management highlighted their ESG initiative of recycling one pair of shoes for every pair sold.",
            "Sentiment": "positive",
            "PublishDate": 1755012340547,
            "Source": "earnings"
        },
        {
            "Title": "Metro Brands Plans Expansion to 2600+ Stores by FY30 with Focus on Omni-Channel and Premium Offerings",
            "Summary": "Metro Brands has announced plans to expand to over 2600 stores by FY30. The company is implementing strategies including omni-channel operations, premiumization, and direct-to-consumer initiatives to maintain double-digit growth momentum.",
            "Sentiment": "positive",
            "PublishDate": 1754573565388,
            "Source": "stock"
        },
        {
            "Title": "Metro Brands Reports Q1 2025 Results, Schedules AGM and Key Board Appointments",
            "Summary": "Metro Brands Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing standalone revenue from operations of ₹615.09 crores and profit after tax of ₹96.62 crores. On a consolidated basis, revenue from operations was ₹618.24 crores with profit after tax of ₹98.80 crores. The company scheduled its 48th Annual General Meeting for September 18, 2025, and set September 5, 2025 as the record date for final dividend eligibility. The Board re-appointed Mohammed Iqbal Hasannally Dossani as Whole-time Director for five years from June 25, 2026, with remuneration not exceeding ₹1.50 crore per annum. Additionally, CS Sekar Ananthanarayan was appointed as Secretarial Auditor for five consecutive years from FY 2024-25 to FY 2029-30. During the quarter, the company granted 60,453 employee stock options and 34,729 options were exercised.",
            "Sentiment": "neutral",
            "PublishDate": 1754569186285,
            "Source": "corporate_action"
        },
        {
            "Title": "Metro Brands Reports Q1 2025 Results, Schedules AGM and Key Board Appointments",
            "Summary": "Metro Brands Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of ₹615.09 crores and profit after tax of ₹96.62 crores, with earnings per share of ₹3.55. On a consolidated basis, revenue from operations was ₹618.24 crores with profit after tax of ₹98.80 crores and earnings per share of ₹3.62. The Board scheduled the 48th Annual General Meeting for September 18, 2025, and set September 5, 2025 as the record date for final dividend eligibility. The company re-appointed Mohammed Iqbal Hasannally Dossani as Whole-time Director for five years effective June 25, 2026, with remuneration not exceeding ₹1.50 crore per annum, subject to shareholder approval. Additionally, CS Sekar Ananthanarayan was appointed as Secretarial Auditor for five consecutive years from FY 2025-26 to FY 2029-30. During the quarter, the company granted 60,453 employee stock options and 34,729 options were exercised.",
            "Sentiment": "neutral",
            "PublishDate": 1754567689839,
            "Source": "earnings"
        },
        {
            "Title": "Metro Brands Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 586,718 shares of Metro Brands Ltd. occurred on the National Stock Exchange (NSE) for Rs. 66.63 crores. The trade was executed at a price of Rs. 1135.60 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1750920350000,
            "Source": "block_details"
        },
        {
            "Title": "Metro Brands Partners with Clarks for Exclusive Distribution in India",
            "Summary": "Metro Brands has announced a strategic partnership with Clarks, securing exclusive distribution rights for Clarks products in India. The company will manage the distribution of Clarks products through various channels, including e-commerce platforms and retail stores. This partnership aims to revolutionize India's comfort footwear market, targeting premium next-generation shoppers.",
            "Sentiment": "positive",
            "PublishDate": 1750679761000,
            "Source": "default"
        },
        {
            "Title": "Metro Brands: Q4 Performance Leads to Rating Upgrade",
            "Summary": "Metro Brands reported sustained performance in Q4, opening 13 new stores for a total of 908 across 205 cities. FY25 saw 70 new stores added, below guidance. Dolat Capital upgraded the rating to 'Add' and increased the target price.",
            "Sentiment": "positive",
            "PublishDate": 1748240747000,
            "Source": "earnings"
        },
        {
            "Title": "Metro Brands: Targeting 12-15% Long-Term Revenue CAGR",
            "Summary": "Metro Brands aims for 12-15% long-term revenue CAGR. E-commerce sales grew 45% in Q4, contributing over 10% to total revenue. The company added 18 new stores and closed 5 in Q4, reaching 908 stores. CEO emphasizes profitability-driven expansion amid rising retail rents.",
            "Sentiment": "positive",
            "PublishDate": 1748061873000,
            "Source": "normal_news"
        },
        {
            "Title": "Metro Brands Increases Revenue Guidance",
            "Summary": "Metro Brands has announced an increase in its revenue guidance. The company states that its revenue will grow in double digits. No specific time frame or fiscal period is mentioned for this growth projection.",
            "Sentiment": "positive",
            "PublishDate": 1747979411000,
            "Source": "default"
        },
        {
            "Title": "Metro Brands Recommends Dividend of 2.5 Rupees Per Share",
            "Summary": "Metro Brands has recommended a dividend of 2.5 rupees per equity share. No additional details about the dividend period or company's financial performance were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747920508000,
            "Source": "result"
        },
        {
            "Title": "Metro Brands Reports Q4 Financial Results",
            "Summary": "Metro Brands has released its Q4 financial results. The company's EBITDA increased to 2.05 billion rupees from 1.66 billion rupees year-over-year. The EBITDA margin improved to 32.44% from 28.75% in the same period last year. Net profit for Q4 was 975 million rupees, down from 1.65 billion rupees year-over-year but up from 941 million rupees quarter-on-quarter. Revenue for Q4 rose to 6.3 billion rupees from 5.78 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747920468000,
            "Source": "result"
        },
        {
            "Title": "Metro Brands Declares Interim and Special Dividends",
            "Summary": "Metro Brands has announced an interim dividend of 3 rupees per equity share and a special dividend of 14.50 rupees per equity share. This decision represents a significant return of value to shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1740961245000,
            "Source": "corporate_action"
        },
        {
            "Title": "Metro Brands: Declares ₹17.50 Dividend, Including Special Payout",
            "Summary": "Metro Brands announced an interim dividend of ₹3 per share and a special dividend of ₹14.50 per share, totaling ₹17.50 per equity share. The record date is set for March 7, 2025. Rekha Jhunjhunwala holds a significant stake in the company.",
            "Sentiment": "positive",
            "PublishDate": 1740914274000,
            "Source": "corporate_action"
        },
        {
            "Title": "Metro Brands Declares Interim and Special Dividends",
            "Summary": "Metro Brands has announced an interim dividend of 3 rupees per equity share and a special dividend of 14.50 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1740743615000,
            "Source": "corporate_action"
        },
        {
            "Title": "Metro Brands to Consider Dividend Declaration for FY 2024-25",
            "Summary": "Metro Brands has announced a board meeting scheduled for February 28 to consider the declaration of a dividend for the financial year 2024-25. The company will evaluate and potentially decide on distributing profits to shareholders for the upcoming fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1740060327000,
            "Source": "corporate_action"
        },
        {
            "Title": "Metro Brands Reports Q3 FY24 Financial Results",
            "Summary": "Metro Brands announced its Q3 financial results with a slight decrease in net profit to 941 million rupees from 957 million rupees year-over-year. However, revenue increased to 6.88 billion rupees from 6.16 billion rupees in the same period. The company stated that new store openings for the current year will be below the previously guided 100 stores, but maintains its overall target of 225 store openings by FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1737073326000,
            "Source": "earnings"
        },
        {
            "Title": "Metro Brands: Q3 Profit Dips 4%, Revenue Up 11%",
            "Summary": "Metro Brands reported a 3.9% YoY decrease in Q3 net profit to ₹95 crore, including a one-time tax charge of ₹25 crore. Revenue increased 10.6% to ₹703 crore. EBITDA rose 13.1% to ₹225 crore with a margin of 32%. The company opened 61 new stores in the first nine months of FY2025, but will miss its 100-store guidance for the year. Metro Brands launched its first Foot Locker store and New Era kiosk during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737047735000,
            "Source": "earnings"
        },
        {
            "Title": "Metro Brands Revises Store Opening Guidance",
            "Summary": "Metro Brands has announced that its net new store openings for the current year will fall short of the previously guided 100 stores. Despite this adjustment, the company maintains its overall target of opening 225 stores by FY26, as stated in their investor presentation.",
            "Sentiment": "neutral",
            "PublishDate": 1737039791000,
            "Source": "corporate_action"
        },
        {
            "Title": "Metro Brands Reports Improved Q3 EBITDA and Margin",
            "Summary": "Metro Brands has announced its Q3 financial results, showing an increase in EBITDA to 2.23 billion rupees from 1.97 billion rupees year-over-year. The company's EBITDA margin also improved to 32.41% from 31.57% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1737037253000,
            "Source": "earnings"
        },
        {
            "Title": "Metro Brands Reports Q3 Financial Results",
            "Summary": "Metro Brands has announced its financial results for the third quarter. The company reported a net profit of 941 million rupees, slightly down from 957 million rupees in the same period last year. However, revenue increased to 6.88 billion rupees from 6.16 billion rupees year-over-year, indicating growth in sales despite the marginal decrease in profit.",
            "Sentiment": "neutral",
            "PublishDate": 1737037237000,
            "Source": "earnings"
        },
        {
            "Title": "Metro Brands Schedules Board Meeting for Q3 Results",
            "Summary": "Metro Brands has announced a board meeting scheduled for January 16 to consider and approve the company's financial results for the third quarter of the current fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1736433240000,
            "Source": "corporate_action"
        },
        {
            "Title": "Metro Brands: Foot Locker Launch Shows Strong Start in India's Sneaker Market",
            "Summary": "Metro Brands reports a strong initial response to Foot Locker's launch in India, targeting the growing sneaker market. The company sees potential in the expanding Indian footwear industry.",
            "Sentiment": "positive",
            "PublishDate": 1730125518000,
            "Source": "normal_news"
        },
        {
            "Title": "Metro Brands: CEO Confident of 15-18% CAGR Target Despite Recent Challenges",
            "Summary": "Metro Brands CEO Nissan Joseph expresses confidence in achieving 15-18% CAGR over five years. Q2 revenue rose 5.4% YoY to Rs 585 crore, with net profit up 6.1% to Rs 72 crore. The company anticipates a Q3 turnaround, boosted by the festive season and increased wedding dates. No external funding required for expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1729825028000,
            "Source": "normal_news"
        },
        {
            "Title": "Metro Brands Expects Demand Recovery in Second Half",
            "Summary": "Metro Brands has announced that they anticipate a recovery in demand during the second half of the year. This expected upturn is primarily attributed to increased consumer spending during the festive and wedding seasons.",
            "Sentiment": "positive",
            "PublishDate": 1729688790000,
            "Source": "normal_news"
        },
        {
            "Title": "Metro Brands: Q2 Profit Misses Estimates Amid High Expenses",
            "Summary": "Metro Brands reported Q2 PAT of Rs 695.5 million, up 4% YoY but below analyst estimates of Rs 767.4 million. Revenue rose 5% to Rs 5.85 billion, while expenses increased 7.9%. The company expects demand recovery in H2 driven by festive and wedding seasons.",
            "Sentiment": "neutral",
            "PublishDate": 1729688103000,
            "Source": "result"
        },
        {
            "Title": "Metro Brands Q2 Financial Results",
            "Summary": "Metro Brands reported Q2 EBITDA of 1.5 billion rupees, unchanged from the same period last year. However, the EBITDA margin decreased slightly to 26.46% from 27.64% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1729686785000,
            "Source": "result"
        },
        {
            "Title": "Metro Brands Reports Q2 FY24 Financial Results",
            "Summary": "Metro Brands has announced its financial results for the second quarter of fiscal year 2024. The company reported a net profit of 657 million rupees, showing a year-over-year increase from 621 million rupees in the same quarter last year. However, this represents a decrease from the previous quarter's net profit of 924 million rupees. Revenue for Q2 stood at 5.7 billion rupees, up from 5.38 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1729686655000,
            "Source": "result"
        }
    ]
}