{
    "Symbol": "MFML",
    "ISIN": "INE0US801024",
    "News": [
        {
            "Title": "Mahalaxmi Fabric Mills Reports Quarterly Results, Receives Fire Insurance Settlement",
            "Summary": "Mahalaxmi Fabric Mills Limited announced its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company received final assessment and settlement of insurance claims for fixed assets including building, plant and machinery, and furniture fixtures equipment during the quarter, related to a fire that occurred at the company's factory premises on November 24, 2024. The settlement has been presented as an exceptional item in the profit and loss statement. The company operates in the traditional textiles segment and has commenced reconstruction and restoration activities, including construction of a new factory building and installation of plant machinery. Final assessment and receipt of claims relating to stocks is still awaited. The company expects to resume production operations in due course.",
            "Sentiment": "neutral",
            "PublishDate": 1763003227688,
            "Source": "earnings"
        },
        {
            "Title": "Mahalaxmi Fabric Mills Reports Strong Turnaround with 78% Revenue Growth in Q1",
            "Summary": "Mahalaxmi Fabric Mills Limited reported significant improvement in its first quarter results ended June 30, 2025. Total income from operations surged 78% to Rs. 3,351.78 lakhs compared to Rs. 1,881.54 lakhs in the same period last year. The company turned profitable with net profit after tax of Rs. 25.86 lakhs versus a loss of Rs. 129.89 lakhs in the previous year. EBITDA margin expanded to 5.8% from 3.8%. Volumes grew approximately 45% year-on-year with capacity utilization improving to 78% from 65%. The company commissioned a new technical textiles product line, expanded its distribution network by adding 50 new dealers, and reduced power costs by 8% through energy efficiency measures. Management expects 20-25% revenue growth for the full year and targets EBITDA margin of 8-9%. The company plans Rs. 50 crores capex over the next two years for modernization and capacity enhancement.",
            "Sentiment": "positive",
            "PublishDate": 1755516966005,
            "Source": "earnings"
        },
        {
            "Title": "Mahalaxmi Fabric Mills Reports Mixed Q1 Results with Consolidated Profit Despite Standalone Loss",
            "Summary": "Mahalaxmi Fabric Mills Limited reported its quarterly results for the period ended June 30, 2025. On a consolidated basis, the company posted a profit of Rs 258.60 lakhs compared to Rs 17.18 lakhs in the same quarter last year, with revenue from operations at Rs 3,351.78 lakhs versus Rs 3,915.68 lakhs previously. However, the standalone business recorded a loss of Rs 112.52 lakhs against a loss of Rs 129.89 lakhs in the prior year quarter, with standalone revenue declining to Rs 1,179.14 lakhs from Rs 1,881.54 lakhs. The consolidated results include contributions from wholly-owned subsidiary Mahalaxmi Exports Private Limited, which contributed Rs 2,202.66 lakhs in revenue and Rs 371.12 lakhs in net profit. The company continues recovery efforts from a factory fire that occurred in November 2024, with partial insurance claims received and production resumption activities underway. Basic earnings per share improved to Rs 2.43 on consolidated basis compared to Rs 0.16 in the previous year quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1755104683168,
            "Source": "earnings"
        }
    ]
}